         TITLE 'IPCS GET DSD RECORD EXPECT RECORD FOUND OR NOREC       *00001000
                        '                                               00002000
*     /* CHANGE ACTIVITY */                                             00003000
*THIS MODULE WRITTEN FOR @G57LPGS                                       00004000
BLSFGD00 CSECT ,                                                   0002 00005000
@MAINENT DS    0H                                                  0002 00006000
         USING *,@15                                               0002 00007000
         B     @PROLOG                                             0002 00008000
         DC    AL1(16)                                             0002 00009000
         DC    C'BLSFGD00  78.065'                                 0002 00010000
         DROP  @15                                                      00011000
@PROLOG  STM   @14,@12,12(@13)                                     0002 00012000
         BALR  @12,0                                               0002 00013000
@PSTART  DS    0H                                                  0002 00014000
         USING @PSTART,@12                                         0002 00015000
         L     @00,@SIZDATD                                        0002 00016000
         BLSUALLS R,LV=(0)                                              00017000
         LR    @11,@01                                             0002 00018000
         USING @DATD,@11                                           0002 00019000
         ST    @13,@SA00001+4                                      0002 00020000
         LM    @00,@01,20(@13)                                     0002 00021000
         ST    @11,8(,@13)                                         0002 00022000
         LR    @13,@11                                             0002 00023000
         MVC   @PC00001(12),0(@01)                                 0002 00024000
*                                                                  0128 00025000
*/********************************************************************/ 00026000
*/*                                                                  */ 00027000
*/*    BEGIN MODULE EXECUATABLE CODE                                 */ 00028000
*/*                                                                  */ 00029000
*/********************************************************************/ 00030000
*                                                                  0128 00031000
*   ZZ2PTR=ADDR(ATV);               /* SET ZZ2 BASING EXPRESSION     */ 00032000
         L     ZZ2PTR,@PC00001                                     0128 00033000
*   AREALEN=LENGTH(DSDREC)+LENGTH(DSDBASRC);                       0129 00034000
         LA    AREALEN,144                                         0129 00035000
*   GDOPENED=OFF;                   /* SET SWITCH TO OFF             */ 00036000
         NI    GDOPENED,B'01111111'                                0130 00037000
*   RETC=ZERO;                      /* ZERO THE RETURN CODE          */ 00038000
         SLR   RETC,RETC                                           0131 00039000
*   IF DMCBSIN=OFF&DMCBSOUT=OFF THEN/* IS DMCB OPEN                  */ 00040000
         L     @10,ZZ2ZZ1P(,ZZ2PTR)                                0132 00041000
         L     @10,ZZ1DSDP(,@10)                                   0132 00042000
         TM    DMCBSIN(@10),B'11000000'                            0132 00043000
         BNZ   @RF00132                                            0132 00044000
*     DO;                           /* NO, OPEN FOR INPUT TO GET   0133 00045000
*                                      REQUESTED REC                 */ 00046000
*       GDOPENED=ON;                /* INDICATE THAT GPOPENED THE PDR*/ 00047000
         OI    GDOPENED,B'10000000'                                0134 00048000
*       DO;                         /* BLSOPEN(ZZ1DSDP)              */ 00049000
*         RFY                                                      0136 00050000
*           GPR01P RSTD;                                           0136 00051000
*         GPR01P=ZZ1DSDP;           /* ADDRESS DMCB                  */ 00052000
         LR    GPR01P,@10                                          0137 00053000
*         RFY                                                      0138 00054000
*           DMCB BASED(GPR01P);                                    0138 00055000
*         IF((GPR01P&'FFFFFFF8'X)=GPR01P)&DMCBID='DMCB'/* VALID DMCB    00056000
*                                      ?                             */ 00057000
*           THEN                                                   0139 00058000
         LR    @10,GPR01P                                          0139 00059000
         N     @10,@CF00971                                        0139 00060000
         CLR   @10,GPR01P                                          0139 00061000
         BNE   @RF00139                                            0139 00062000
         CLC   DMCBID(4,GPR01P),@CC00972                           0139 00063000
         BNE   @RF00139                                            0139 00064000
*           DO;                                                    0140 00065000
*             DMCBRQST=DMCBOPR;     /* INDICATE OPEN REQUEST         */ 00066000
         MVI   DMCBRQST(GPR01P),X'01'                              0141 00067000
*             DMCBOUT='0'B;         /* INDICATE OPEN FOR INPUT       */ 00068000
         NI    DMCBOUT(GPR01P),B'01111111'                         0142 00069000
*             CALL DMCBRI->DMCBDMGR;/* CALL BLSCRQST                 */ 00070000
         L     @15,DMCBRI(,GPR01P)                                 0143 00071000
         BALR  @14,@15                                             0143 00072000
*           END;                                                   0144 00073000
*         ELSE                                                     0145 00074000
*           DO;                                                    0145 00075000
         B     @RC00139                                            0145 00076000
@RF00139 DS    0H                                                  0146 00077000
*             RFY                                                  0146 00078000
*              (GPR00F,                                            0146 00079000
*               GPR15F) RSTD;                                      0146 00080000
*             GPR00F=0;             /* INDICATE NO MESSAGE CHAIN     */ 00081000
         SLR   GPR00F,GPR00F                                       0147 00082000
*             GPR15F=16;            /* INDICATE INVALID DMCB         */ 00083000
         LA    GPR15F,16                                           0148 00084000
*             RFY                                                  0149 00085000
*              (GPR00F,                                            0149 00086000
*               GPR15F);                                           0149 00087000
*           END;                                                   0150 00088000
*         RFY                                                      0151 00089000
*           DMCB;                                                  0151 00090000
@RC00139 DS    0H                                                  0152 00091000
*         RFY                                                      0152 00092000
*           GPR01P;                                                0152 00093000
*       END;                        /* BLSOPEN(ZZ1DSDP) NO, OPEN FOR    00094000
*                                      INPUT TO GET REQUESTED REC    */ 00095000
*       RESPECIFY                                                  0154 00096000
*         RF RESTRICTED;            /* RESTRICT REG 15 TO SAVE RETURN   00097000
*                                      CODE                          */ 00098000
*       RETC=RF;                    /* SAVE THE RETURN CODE          */ 00099000
         LR    RETC,RF                                             0155 00100000
*       RESPECIFY                                                  0156 00101000
*         RF UNRESTRICTED;          /* FREE REG 15 TO COMPILER       */ 00102000
*     END;                          /* END GG00 DID OPEN             */ 00103000
*   IF RETC=ZERO THEN               /* DID OPEN WORK                 */ 00104000
@RF00132 LTR   RETC,RETC                                           0158 00105000
         BNZ   @RF00158                                            0158 00106000
*     DO;                           /* YES, CONTINUE                 */ 00107000
*                                                                  0159 00108000
*       /*************************************************************/ 00109000
*       /*                                                           */ 00110000
*       /* BLSGET (ZZ1DSDP)                                          */ 00111000
*       /* AREA(AREA)AREALEN(AREALEN)ARG(DSNKEY)KEYEQ                */ 00112000
*       /* ARGLEN(LENGTH(DSNKEY))                                    */ 00113000
*       /*                                                           */ 00114000
*       /*************************************************************/ 00115000
*                                                                  0160 00116000
*       DO;                         /* BLSGET (ZZ1DSDP) AREA(AREA)ARE   00117000
*                                      ALEN(AREALEN)ARG(DSNKEY)KEYEQ    00118000
*                                      ARGLEN(LENGTH(DSNKEY))        */ 00119000
*         RFY                                                      0161 00120000
*           GPR01P RSTD;                                           0161 00121000
*         GPR01P=ZZ1DSDP;           /* ADDRESS DMCB                  */ 00122000
         L     @10,ZZ2ZZ1P(,ZZ2PTR)                                0162 00123000
         L     GPR01P,ZZ1DSDP(,@10)                                0162 00124000
*         RFY                                                      0163 00125000
*           DMCB BASED(GPR01P);                                    0163 00126000
*         IF((GPR01P&'FFFFFFF8'X)=GPR01P)&DMCBID='DMCB'/* VALID DMCB    00127000
*                                      ?                             */ 00128000
*           THEN                                                   0164 00129000
         LR    @10,GPR01P                                          0164 00130000
         N     @10,@CF00971                                        0164 00131000
         CLR   @10,GPR01P                                          0164 00132000
         BNE   @RF00164                                            0164 00133000
         CLC   DMCBID(4,GPR01P),@CC00972                           0164 00134000
         BNE   @RF00164                                            0164 00135000
*           DO;                                                    0165 00136000
*             DMCBBUFP=ADDR(AREA);  /* PLACE BUFFER ADDRESS IN DMCB  */ 00137000
         L     @10,@PC00001+8                                      0166 00138000
         ST    @10,DMCBBUFP(,GPR01P)                               0166 00139000
*             DMCBBLEN=AREALEN&'7FFFFFFF'X;/* PLACE BUFFER LENGTH IN    00140000
*                                      DMCB                          */ 00141000
         LR    @10,AREALEN                                         0167 00142000
         N     @10,@CF00976                                        0167 00143000
         ST    @10,DMCBBLEN(,GPR01P)                               0167 00144000
*             DMCBKEYP=ADDR(DSNKEY);/* PLACE KEY ADDRESS IN DMCB     */ 00145000
         L     @10,@PC00001+4                                      0168 00146000
         ST    @10,DMCBKEYP(,GPR01P)                               0168 00147000
*             DMCBKEYL=(LENGTH(DSNKEY))&'7FFFFFFF'X;/* PLACE KEY   0169 00148000
*                                      LENGTH IN DMCB                */ 00149000
         MVC   DMCBKEYL(4,GPR01P),@CF00910                         0169 00150000
*             DMCBKYD='1'B;         /* INDICATE KEYED ACCESS         */ 00151000
*             DMCBAPX='0'B;         /* INDICATE EXACT KEY MATCH      */ 00152000
*             DMCBGKY='0'B;         /* INDICATE FULL KEY SEARCH      */ 00153000
*             DMCBUPD='0'B;         /* DEFAULT FOR GET IS NUP        */ 00154000
         OI    DMCBKYD(GPR01P),B'10000000'                         0173 00155000
         NI    DMCBAPX(GPR01P),B'10001111'                         0173 00156000
*             DMCBRQST=DMCBGER;     /* INDICATE GET REQUEST          */ 00157000
         MVI   DMCBRQST(GPR01P),X'04'                              0174 00158000
*             CALL DMCBRI->DMCBDMGR;/* CALL BLSCRQST                 */ 00159000
         L     @15,DMCBRI(,GPR01P)                                 0175 00160000
         BALR  @14,@15                                             0175 00161000
*           END;                                                   0176 00162000
*         ELSE                                                     0177 00163000
*           DO;                                                    0177 00164000
         B     @RC00164                                            0177 00165000
@RF00164 DS    0H                                                  0178 00166000
*             RFY                                                  0178 00167000
*              (GPR00F,                                            0178 00168000
*               GPR15F) RSTD;                                      0178 00169000
*             GPR00F=0;             /* INDICATE NO MESSAGE CHAIN     */ 00170000
         SLR   GPR00F,GPR00F                                       0179 00171000
*             GPR15F=16;            /* INDICATE INVALID DMCB         */ 00172000
         LA    GPR15F,16                                           0180 00173000
*             RFY                                                  0181 00174000
*              (GPR00F,                                            0181 00175000
*               GPR15F);                                           0181 00176000
*           END;                                                   0182 00177000
*         RFY                                                      0183 00178000
*           DMCB;                                                  0183 00179000
@RC00164 DS    0H                                                  0184 00180000
*         RFY                                                      0184 00181000
*           GPR01P;                                                0184 00182000
*       END;                        /* BLSGET (ZZ1DSDP) AREA(AREA)ARE   00183000
*                                      ALEN(AREALEN)ARG(DSNKEY)KEYEQ    00184000
*                                      ARGLEN(LENGTH(DSNKEY)) GET DSD   00185000
*                                      REC REQUESTED                 */ 00186000
*       RESPECIFY                                                  0186 00187000
*         RF RESTRICTED;            /* RESTRICT REG 15 TO SAVE RETURN   00188000
*                                      CODE                          */ 00189000
*       RETC=RF;                    /* SAVE THE RETURN CODE          */ 00190000
         LR    RETC,RF                                             0187 00191000
*       IF RETC^=ZERO&RETC^=EIGHT THEN/* RETCODE NOT ZERO OR EIGHT   */ 00192000
         LTR   RETC,RETC                                           0188 00193000
         BZ    @RF00188                                            0188 00194000
         C     RETC,@CF00054                                       0188 00195000
         BE    @RF00188                                            0188 00196000
*         DO;                                                      0189 00197000
*           RETC=MAX(RETC,TWELVE);  /* SHOW AT LEAST SEVER ERROR     */ 00198000
         LA    @14,12                                              0190 00199000
         CR    RETC,@14                                            0190 00200000
         BNL   *+6                                                      00201000
         LR    RETC,@14                                            0190 00202000
*           DO;                     /* BLSDMSG                     0191 00203000
*                                      (ZZ2,GETERR,DMCBMSG,BLSDMSGS)    00204000
*                                      ROUTE(TERM)LIFO               */ 00205000
*             CALL BLSDMSG0(ZZ2,GETERR,DMCBMSG,BLSDMSGS,'10010000'B,0); 00206000
         ST    ZZ2PTR,@AL00001                                     0192 00207000
         LA    @14,@CF00958                                        0192 00208000
         ST    @14,@AL00001+4                                      0192 00209000
         L     @14,ZZ2ZZ1P(,ZZ2PTR)                                0192 00210000
         L     @14,ZZ1DSDP(,@14)                                   0192 00211000
         LA    @14,DMCBMSG(,@14)                                   0192 00212000
         ST    @14,@AL00001+8                                      0192 00213000
         L     @14,ZZ2MSGSP(,ZZ2PTR)                               0192 00214000
         ST    @14,@AL00001+12                                     0192 00215000
         LA    @14,@CB00978                                        0192 00216000
         ST    @14,@AL00001+16                                     0192 00217000
         LA    @14,@CF00051                                        0192 00218000
         ST    @14,@AL00001+20                                     0192 00219000
         L     @15,ZZ2MSG0P(,ZZ2PTR)                               0192 00220000
         LA    @01,@AL00001                                        0192 00221000
         BALR  @14,@15                                             0192 00222000
*                                   /* BUILD MESSAGE                 */ 00223000
*           END;                    /* BLSDMSG                     0193 00224000
*                                      (ZZ2,GETERR,DMCBMSG,BLSDMSGS)    00225000
*                                      ROUTE(TERM)LIFO MSG           */ 00226000
*           DO;                     /* ABEND(101) DUMP USER          */ 00227000
*             RESPECIFY                                            0195 00228000
*              (GPR01F) RESTRICTED;                                0195 00229000
*             GPR01F=(101)&'00000FFF'X;/* COMP CODE IN BITS 20-31    */ 00230000
         LA    GPR01F,101                                          0196 00231000
*             GPR01F=GPR01F|'80000000'X;/* DUMP/STEP/DUMPOPTS FLAG   */ 00232000
         O     GPR01F,@CF00066                                     0197 00233000
*             SVC(13);              /* ISSUE ABEND SVC               */ 00234000
         SVC   13                                                  0198 00235000
*             RESPECIFY                                            0199 00236000
*              (GPR01F) UNRESTRICTED;                              0199 00237000
*           END;                    /* ABEND(101) DUMP USER YES,   0200 00238000
*                                      ABEND TO GET INTO TEST        */ 00239000
*         END;                      /* END RETC ^= 0 OR 8            */ 00240000
*       ELSE                        /* ALL OK ON GET, PURGE THE MSG     00241000
*                                      STACK                         */ 00242000
*         DO;                       /* BLSDMSG (ZZ2,MINUSONE,DMCBMSG,   00243000
*                                      BLSDMSGS)                     */ 00244000
         B     @RC00188                                            0202 00245000
@RF00188 DS    0H                                                  0203 00246000
*           CALL BLSDMSG0(ZZ2,MINUSONE,DMCBMSG,BLSDMSGS,'00000000'B,0); 00247000
         ST    ZZ2PTR,@AL00001                                     0203 00248000
         LA    @14,@CF00948                                        0203 00249000
         ST    @14,@AL00001+4                                      0203 00250000
         L     @14,ZZ2ZZ1P(,ZZ2PTR)                                0203 00251000
         L     @14,ZZ1DSDP(,@14)                                   0203 00252000
         LA    @14,DMCBMSG(,@14)                                   0203 00253000
         ST    @14,@AL00001+8                                      0203 00254000
         L     @14,ZZ2MSGSP(,ZZ2PTR)                               0203 00255000
         ST    @14,@AL00001+12                                     0203 00256000
         LA    @14,@CB00983                                        0203 00257000
         ST    @14,@AL00001+16                                     0203 00258000
         LA    @14,@CF00051                                        0203 00259000
         ST    @14,@AL00001+20                                     0203 00260000
         L     @15,ZZ2MSG0P(,ZZ2PTR)                               0203 00261000
         LA    @01,@AL00001                                        0203 00262000
         BALR  @14,@15                                             0203 00263000
*                                   /* BUILD MESSAGE                 */ 00264000
*         END;                      /* BLSDMSG (ZZ2,MINUSONE,DMCBMSG,   00265000
*                                      BLSDMSGS) PURGE DAS MSGS      */ 00266000
*       IF GDOPENED=ON THEN         /* DID BLSDG00 OPEN THE DSD      */ 00267000
@RC00188 TM    GDOPENED,B'10000000'                                0205 00268000
         BNO   @RF00205                                            0205 00269000
*         DO;                       /* YES, CLOSE THE DSD BEFORE   0206 00270000
*                                      EXITING                       */ 00271000
*           DO;                     /* BLSCLOSE(ZZ1DSDP)             */ 00272000
*             RFY                                                  0208 00273000
*               GPR01P RSTD;                                       0208 00274000
*             GPR01P=ZZ1DSDP;       /* ADDRESS THE DMCB              */ 00275000
         L     @14,ZZ2ZZ1P(,ZZ2PTR)                                0209 00276000
         L     GPR01P,ZZ1DSDP(,@14)                                0209 00277000
*             RFY                                                  0210 00278000
*               DMCB BASED(GPR01P);                                0210 00279000
*             IF((GPR01P&'FFFFFFF8'X)=GPR01P)&DMCBID='DMCB'/* VALID     00280000
*                                      DMCB ?                        */ 00281000
*               THEN                                               0211 00282000
         LR    @14,GPR01P                                          0211 00283000
         N     @14,@CF00971                                        0211 00284000
         CLR   @14,GPR01P                                          0211 00285000
         BNE   @RF00211                                            0211 00286000
         CLC   DMCBID(4,GPR01P),@CC00972                           0211 00287000
         BNE   @RF00211                                            0211 00288000
*               DO;                                                0212 00289000
*                 DMCBRQST=DMCBCLR; /* INDICATE CLOSE REQUEST        */ 00290000
         MVI   DMCBRQST(GPR01P),X'02'                              0213 00291000
*                 DMCBTMP='0'B;     /* INDICATE NON TEMP CLOSE       */ 00292000
*                 DMCBRM6='0'B;     /* INDICATE                      */ 00293000
*                 DMCBRM5='0'B;     /* DISP OPTION                   */ 00294000
         NI    DMCBTMP(GPR01P),B'00011111'                         0216 00295000
*                 CALL DMCBRI->DMCBDMGR;/* CALL BLSCRQST             */ 00296000
         L     @15,DMCBRI(,GPR01P)                                 0217 00297000
         BALR  @14,@15                                             0217 00298000
*               END;                                               0218 00299000
*             ELSE                                                 0219 00300000
*               DO;                                                0219 00301000
         B     @RC00211                                            0219 00302000
@RF00211 DS    0H                                                  0220 00303000
*                 RFY                                              0220 00304000
*                  (GPR00F,                                        0220 00305000
*                   GPR15F) RSTD;                                  0220 00306000
*                 GPR00F=0;         /* INDICATE NO MESSAGE CHAIN     */ 00307000
         SLR   GPR00F,GPR00F                                       0221 00308000
*                 GPR15F=16;        /* INDICATE INVALID DMCB         */ 00309000
         LA    GPR15F,16                                           0222 00310000
*                 RFY                                              0223 00311000
*                  (GPR00F,                                        0223 00312000
*                   GPR15F);                                       0223 00313000
*               END;                                               0224 00314000
*             RFY                                                  0225 00315000
*               DMCB;                                              0225 00316000
@RC00211 DS    0H                                                  0226 00317000
*             RFY                                                  0226 00318000
*               GPR01P;                                            0226 00319000
*           END;                    /* BLSCLOSE(ZZ1DSDP) CLOSE THE 0227 00320000
*                                      DSD                           */ 00321000
*           RESPECIFY                                              0228 00322000
*             RF RESTRICTED;        /* REST REGISTER 15 TO SAVE    0228 00323000
*                                      RETURN CD                     */ 00324000
*           IF RF^=ZERO THEN        /* NON ZERO RETURN CODE          */ 00325000
         LTR   RF,RF                                               0229 00326000
         BZ    @RF00229                                            0229 00327000
*             DO;                   /* SET ERROR RETURN CODE AND   0230 00328000
*                                      CHECK TEST                    */ 00329000
*               RETC=MAX(RF,TWELVE);/* SHOW AT LEAST SEVERE ERROR    */ 00330000
         LA    RETC,12                                             0231 00331000
         CR    RETC,RF                                             0231 00332000
         BNL   *+6                                                      00333000
         LR    RETC,RF                                             0231 00334000
*               DO;                 /* BLSDMSG                     0232 00335000
*                                      (ZZ2,CLOSERR,DMCBMSG,BLSDMSGS)   00336000
*                                      LIFO ROUTE(TERM)              */ 00337000
*                 CALL BLSDMSG0(ZZ2,CLOSERR,DMCBMSG,BLSDMSGS,'10010000' 00338000
*                     ,0);          /* BUILD MESSAGE                 */ 00339000
         ST    ZZ2PTR,@AL00001                                     0233 00340000
         LA    @14,@CF00960                                        0233 00341000
         ST    @14,@AL00001+4                                      0233 00342000
         L     @14,ZZ2ZZ1P(,ZZ2PTR)                                0233 00343000
         L     @14,ZZ1DSDP(,@14)                                   0233 00344000
         LA    @14,DMCBMSG(,@14)                                   0233 00345000
         ST    @14,@AL00001+8                                      0233 00346000
         L     @14,ZZ2MSGSP(,ZZ2PTR)                               0233 00347000
         ST    @14,@AL00001+12                                     0233 00348000
         LA    @14,@CB00978                                        0233 00349000
         ST    @14,@AL00001+16                                     0233 00350000
         LA    @14,@CF00051                                        0233 00351000
         ST    @14,@AL00001+20                                     0233 00352000
         L     @15,ZZ2MSG0P(,ZZ2PTR)                               0233 00353000
         LA    @01,@AL00001                                        0233 00354000
         BALR  @14,@15                                             0233 00355000
*               END;                /* BLSDMSG                     0234 00356000
*                                      (ZZ2,CLOSERR,DMCBMSG,BLSDMSGS)   00357000
*                                      LIFO ROUTE(TERM) MSG          */ 00358000
*               DO;                 /* ABEND(102) DUMP USER          */ 00359000
*                 RESPECIFY                                        0236 00360000
*                  (GPR01F) RESTRICTED;                            0236 00361000
*                 GPR01F=(102)&'00000FFF'X;/* COMP CODE IN BITS 20-31*/ 00362000
         LA    GPR01F,102                                          0237 00363000
*                 GPR01F=GPR01F|'80000000'X;/* DUMP/STEP/DUMPOPTS  0238 00364000
*                                      FLAG                          */ 00365000
         O     GPR01F,@CF00066                                     0238 00366000
*                 SVC(13);          /* ISSUE ABEND SVC               */ 00367000
         SVC   13                                                  0239 00368000
*                 RESPECIFY                                        0240 00369000
*                  (GPR01F) UNRESTRICTED;                          0240 00370000
*               END;                /* ABEND(102) DUMP USER YES,   0241 00371000
*                                      ABEND TO GET INTO TEST        */ 00372000
*             END;                  /* END NON ZERO CODE FROM CLOSE  */ 00373000
*           RESPECIFY                                              0243 00374000
*             RF UNRESTRICTED;      /* RETURN REG                    */ 00375000
@RF00229 DS    0H                                                  0244 00376000
*         END;                      /* END BLSFDG00 OPENED THE DSD   */ 00377000
*     END;                          /* END OPEN WORKED               */ 00378000
*   ELSE                            /* OPEN FAILED                   */ 00379000
*     DO;                           /* DO RETURN CODE PROCESSING     */ 00380000
         B     @RC00158                                            0246 00381000
@RF00158 DS    0H                                                  0247 00382000
*       DO;                         /* BLSDMSG                     0247 00383000
*                                      (ZZ2,OPENERR,DMCBMSG,BLSDMSGS)   00384000
*                                      LIFO ROUTE(TERM)              */ 00385000
*         CALL BLSDMSG0(ZZ2,OPENERR,DMCBMSG,BLSDMSGS,'10010000'B,0);    00386000
         ST    ZZ2PTR,@AL00001                                     0248 00387000
         LA    @10,@CF00956                                        0248 00388000
         ST    @10,@AL00001+4                                      0248 00389000
         L     @10,ZZ2ZZ1P(,ZZ2PTR)                                0248 00390000
         L     @10,ZZ1DSDP(,@10)                                   0248 00391000
         LA    @10,DMCBMSG(,@10)                                   0248 00392000
         ST    @10,@AL00001+8                                      0248 00393000
         L     @10,ZZ2MSGSP(,ZZ2PTR)                               0248 00394000
         ST    @10,@AL00001+12                                     0248 00395000
         LA    @10,@CB00978                                        0248 00396000
         ST    @10,@AL00001+16                                     0248 00397000
         LA    @10,@CF00051                                        0248 00398000
         ST    @10,@AL00001+20                                     0248 00399000
         L     @15,ZZ2MSG0P(,ZZ2PTR)                               0248 00400000
         LA    @01,@AL00001                                        0248 00401000
         BALR  @14,@15                                             0248 00402000
*                                   /* BUILD MESSAGE                 */ 00403000
*       END;                        /* BLSDMSG                     0249 00404000
*                                      (ZZ2,OPENERR,DMCBMSG,BLSDMSGS)   00405000
*                                      LIFO ROUTE(TERM) MSG          */ 00406000
*       IF RETC^=FOUR THEN          /* TEST IN EFFECT & NOT ATTEN    */ 00407000
         C     RETC,@CF00043                                       0250 00408000
         BE    @RF00250                                            0250 00409000
*         DO;                       /* ABEND(100) DUMP USER          */ 00410000
*           RESPECIFY                                              0252 00411000
*            (GPR01F) RESTRICTED;                                  0252 00412000
*           GPR01F=(100)&'00000FFF'X;/* COMP CODE IN BITS 20-31      */ 00413000
         LA    GPR01F,100                                          0253 00414000
*           GPR01F=GPR01F|'80000000'X;/* DUMP/STEP/DUMPOPTS FLAG     */ 00415000
         O     GPR01F,@CF00066                                     0254 00416000
*           SVC(13);                /* ISSUE ABEND SVC               */ 00417000
         SVC   13                                                  0255 00418000
*           RESPECIFY                                              0256 00419000
*            (GPR01F) UNRESTRICTED;                                0256 00420000
*         END;                      /* ABEND(100) DUMP USER YES,   0257 00421000
*                                      ABEND TO GET INTO TEST        */ 00422000
*       RETC=MAX(RETC,TWELVE);      /* BUMP RETURN CODE TO ERROR   0258 00423000
*                                      CONDITION                     */ 00424000
@RF00250 LA    @10,12                                              0258 00425000
         CR    RETC,@10                                            0258 00426000
         BNL   *+6                                                      00427000
         LR    RETC,@10                                            0258 00428000
*     END;                          /* END OPEN ERROR PROCESSING     */ 00429000
*   RETURN CODE(RETC);              /* RETURN WITH RETURN CODE       */ 00430000
@RC00158 L     @13,4(,@13)                                         0260 00431000
         L     @00,@SIZDATD                                        0260 00432000
         LR    @01,@11                                             0260 00433000
         BLSUFRES R,LV=(0),A=(1)                                        00434000
         LR    @15,@06                                             0260 00435000
         L     @14,12(,@13)                                        0260 00436000
         LM    @00,@12,20(@13)                                     0260 00437000
         BR    @14                                                 0260 00438000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 00439000
*     GPR00F FIXED(31) REG(0),                                     0261 00440000
*     GPR01F FIXED(31) REG(1),                                     0261 00441000
*     GPR15F FIXED(31) REG(15),                                    0261 00442000
*     GPR01P PTR(31) REG(1);                                       0261 00443000
*   DECLARE                         /* COMMON VARIABLES              */ 00444000
*     I256C CHAR(256) BASED,                                       0262 00445000
*     I031F FIXED(31) BASED,                                       0262 00446000
*     I031P PTR(31) BASED,                                         0262 00447000
*     I015F FIXED(15) BASED,                                       0262 00448000
*     I015P PTR(15) BASED,                                         0262 00449000
*     I008P PTR(8) BASED,                                          0262 00450000
*     I001C CHAR(1) BASED;                                         0262 00451000
*   GENERATE NODEFS NOREFS DATA;                                   0263 00452000
*   END                             /* BLRPEND END BLSFDG00          */ 00453000
*                                                                  0264 00454000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00455000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00456000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00457000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00458000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00459000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00460000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00461000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00462000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00463000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00464000
*/*%INCLUDE SYSLIB  (BLSDSERV)                                       */ 00465000
*/*%INCLUDE SYSLIB  (BLSDSD  )                                       */ 00466000
*                                                                  0264 00467000
*       ;                                                          0264 00468000
@EL00001 L     @13,4(,@13)                                         0264 00469000
@EF00001 L     @00,@SIZDATD                                        0264 00470000
         LR    @01,@11                                             0264 00471000
         BLSUFRES R,LV=(0),A=(1)                                        00472000
@ER00001 LM    @14,@12,12(@13)                                     0264 00473000
         BR    @14                                                 0264 00474000
@DATA    DS    0H                                                       00475000
@DATD    DSECT                                                          00476000
         DS    0F                                                       00477000
@SA00001 DS    18F                                                      00478000
@PC00001 DS    3F                                                       00479000
@AL00001 DS    6A                                                       00480000
BLSFGD00 CSECT                                                          00481000
         DS    0F                                                       00482000
@CF00051 DC    F'0'                                                     00483000
@CF00043 DC    F'4'                                                     00484000
@CF00054 DC    F'8'                                                     00485000
@CF00910 DC    F'61'                                                    00486000
@CF00956 DC    F'4052'                                                  00487000
@CF00958 DC    F'4053'                                                  00488000
@CF00960 DC    F'4055'                                                  00489000
@CF00948 DC    F'-1'                                                    00490000
@CF00066 DC    XL4'80000000'                                            00491000
@CF00971 DC    XL4'FFFFFFF8'                                            00492000
@CF00976 DC    XL4'7FFFFFFF'                                            00493000
@DATD    DSECT                                                          00494000
         DS    0D                                                       00495000
GDOPENED DS    BL1                                                      00496000
BLSFGD00 CSECT                                                          00497000
         DS    0F                                                       00498000
@SIZDATD DC    AL1(0)                                                   00499000
         DC    AL3(@ENDDATD-@DATD)                                      00500000
         DS    0D                                                       00501000
@CC00972 DC    C'DMCB'                                                  00502000
@CB00978 DC    B'10010000'                                              00503000
@CB00983 DC    B'00000000'                                              00504000
@DATD    DSECT                                                          00505000
         SPACE 2                                                        00506000
*********************************************************************** 00507000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00508000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 00509000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 00510000
*********************************************************************** 00511000
         SPACE                                                          00512000
BLSFGD00 CSECT                                                          00513000
         ORG                                                            00514000
         DS    0D                                                       00515000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSFGD00+19)/20+7)/8)CL8'BLSFGD00'     00516000
@DATD    DSECT                                                          00517000
         SPACE 2                                                        00518000
*********************************************************************** 00519000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 00520000
*********************************************************************** 00521000
         SPACE                                                          00522000
         DS    0D                                                       00523000
@DATD    DSECT                                                          00524000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00525000
@ENDDATD EQU   *                                                        00526000
BLSFGD00 CSECT                                                          00527000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00528000
@01      EQU   01                                                       00529000
@02      EQU   02                                                       00530000
@03      EQU   03                                                       00531000
@04      EQU   04                                                       00532000
@05      EQU   05                                                       00533000
@06      EQU   06                                                       00534000
@07      EQU   07                                                       00535000
@08      EQU   08                                                       00536000
@09      EQU   09                                                       00537000
@10      EQU   10                                                       00538000
@11      EQU   11                                                       00539000
@12      EQU   12                                                       00540000
@13      EQU   13                                                       00541000
@14      EQU   14                                                       00542000
@15      EQU   15                                                       00543000
AREALEN  EQU   @07                                                      00544000
RETC     EQU   @06                                                      00545000
ZZ2PTR   EQU   @05                                                      00546000
R0       EQU   @00                                                      00547000
R1       EQU   @01                                                      00548000
R2       EQU   @02                                                      00549000
R3       EQU   @03                                                      00550000
R4       EQU   @04                                                      00551000
R5       EQU   @05                                                      00552000
R9       EQU   @09                                                      00553000
RB       EQU   @11                                                      00554000
RD       EQU   @13                                                      00555000
RE       EQU   @14                                                      00556000
RF       EQU   @15                                                      00557000
GPR01P   EQU   @01                                                      00558000
GPR00F   EQU   @00                                                      00559000
GPR15F   EQU   @15                                                      00560000
GPR01F   EQU   @01                                                      00561000
RA       EQU   @10                                                      00562000
RC       EQU   @12                                                      00563000
R6       EQU   @06                                                      00564000
R7       EQU   @07                                                      00565000
R8       EQU   @08                                                      00566000
ZZ1      EQU   0                                                        00567000
ZZ1DSDP  EQU   ZZ1+44                                                   00568000
ZZ1ATTN  EQU   ZZ1+360                                                  00569000
ZZ1EVE   EQU   ZZ1ATTN+4                                                00570000
ZZ1F     EQU   ZZ1+368                                                  00571000
ZZ1N     EQU   ZZ1+1116                                                 00572000
ZZ2      EQU   0                                                        00573000
ZZ2AMD   EQU   ZZ2                                                      00574000
@NM00013 EQU   ZZ2AMD+7                                                 00575000
ZZ2PRT   EQU   ZZ2+138                                                  00576000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 00577000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                00578000
ZZ2A     EQU   ZZ2+272                                                  00579000
ZZ2AF    EQU   ZZ2A+16                                                  00580000
ZZ2APID  EQU   ZZ2A+64                                                  00581000
ZZ2AD    EQU   ZZ2A+74                                                  00582000
ZZ2ADD   EQU   ZZ2AD                                                    00583000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 00584000
ZZ2ADM   EQU   ZZ2AD+46                                                 00585000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 00586000
ZZ2ADP   EQU   ZZ2AD+56                                                 00587000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 00588000
ZZ2AQAS  EQU   ZZ2A+144                                                 00589000
ZZ2AQD   EQU   ZZ2A+160                                                 00590000
ZZ2AQDT  EQU   ZZ2AQD+10                                                00591000
ZZ2AQDF  EQU   ZZ2AQD+52                                                00592000
ZZ2STG   EQU   ZZ2+960                                                  00593000
ZZ2ALLOP EQU   ZZ2+992                                                  00594000
ZZ2FREEP EQU   ZZ2+996                                                  00595000
ZZ2FF19P EQU   ZZ2+1000                                                 00596000
ZZ2FRE1P EQU   ZZ2+1004                                                 00597000
ZZ2FF18P EQU   ZZ2+1008                                                 00598000
ZZ2DYNAP EQU   ZZ2+1012                                                 00599000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 00600000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 00601000
ZZ2STAIP EQU   ZZ2+1024                                                 00602000
ZZ2FF02P EQU   ZZ2+1028                                                 00603000
ZZ2GETLP EQU   ZZ2+1032                                                 00604000
ZZ2PARSP EQU   ZZ2+1036                                                 00605000
ZZ2PTGTP EQU   ZZ2+1040                                                 00606000
ZZ2PUTLP EQU   ZZ2+1044                                                 00607000
ZZ2SCANP EQU   ZZ2+1048                                                 00608000
ZZ2STCKP EQU   ZZ2+1052                                                 00609000
ZZ2ALOCP EQU   ZZ2+1056                                                 00610000
ZZ2MSGSP EQU   ZZ2+1060                                                 00611000
ZZ2TRMOP EQU   ZZ2+1064                                                 00612000
ZZ2TRMVP EQU   ZZ2+1068                                                 00613000
ZZ2MSG0P EQU   ZZ2+1076                                                 00614000
ZZ2PUTNP EQU   ZZ2+1084                                                 00615000
ZZ2TRMNP EQU   ZZ2+1088                                                 00616000
ZZ2ENQ0P EQU   ZZ2+1092                                                 00617000
ZZ2ADSDP EQU   ZZ2+1096                                                 00618000
ZZ2APDRP EQU   ZZ2+1100                                                 00619000
ZZ2FDSDP EQU   ZZ2+1104                                                 00620000
ZZ2FPDRP EQU   ZZ2+1108                                                 00621000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 00622000
ZZ2DVTP  EQU   ZZ2+1276                                                 00623000
ZZ2BVTP  EQU   ZZ2+1280                                                 00624000
ZZ2CPPL  EQU   ZZ2+1292                                                 00625000
ZZ2CPPLC EQU   ZZ2CPPL                                                  00626000
ZZ2ITR   EQU   ZZ2+2840                                                 00627000
ZZ2ITRE  EQU   ZZ2ITR+16                                                00628000
ZZ2ITSE  EQU   ZZ2+2864                                                 00629000
ZZ2ES    EQU   ZZ2+2872                                                 00630000
ZZ2AMDX  EQU   ZZ2+7160                                                 00631000
ZZ2AXO   EQU   ZZ2+7934                                                 00632000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 00633000
CMD      EQU   0                                                        00634000
CMDT     EQU   CMD+4                                                    00635000
PSCB     EQU   0                                                        00636000
PSCBATR1 EQU   PSCB+16                                                  00637000
ECT      EQU   0                                                        00638000
ECTSWS   EQU   ECT+28                                                   00639000
ECTSWS2  EQU   ECT+40                                                   00640000
ECTSWS21 EQU   ECTSWS2                                                  00641000
UPT      EQU   0                                                        00642000
UPTSWS   EQU   UPT+12                                                   00643000
SA       EQU   0                                                        00644000
SA1      EQU   SA                                                       00645000
SAR      EQU   SA+12                                                    00646000
BVT      EQU   0                                                        00647000
BVTPUTLP EQU   BVT+4                                                    00648000
BVTPUTOP EQU   BVT+12                                                   00649000
BVTPUTTP EQU   BVT+16                                                   00650000
BVTPUTVP EQU   BVT+20                                                   00651000
BVTPUTAP EQU   BVT+24                                                   00652000
BVTPRTTP EQU   BVT+28                                                   00653000
BVTPRTAP EQU   BVT+32                                                   00654000
BVTPUTDP EQU   BVT+36                                                   00655000
BVTMONP  EQU   BVT+40                                                   00656000
BVTMON2P EQU   BVT+44                                                   00657000
BVTVSARP EQU   BVT+48                                                   00658000
BVTVSENP EQU   BVT+64                                                   00659000
BVTVSERP EQU   BVT+68                                                   00660000
BVTVSGEP EQU   BVT+72                                                   00661000
BVTVSGUP EQU   BVT+76                                                   00662000
BVTVSPOP EQU   BVT+80                                                   00663000
BVTVSPUP EQU   BVT+84                                                   00664000
BVTMPKNP EQU   BVT+104                                                  00665000
BVTMONLP EQU   BVT+108                                                  00666000
BVTPUTCP EQU   BVT+132                                                  00667000
BVTMPK1P EQU   BVT+136                                                  00668000
BVTZZ2RP EQU   BVT+140                                                  00669000
BVTPGMRP EQU   BVT+144                                                  00670000
BVTMONAP EQU   BVT+148                                                  00671000
BVTBLDDP EQU   BVT+152                                                  00672000
BVTBLDLP EQU   BVT+156                                                  00673000
BVTPGMCP EQU   BVT+160                                                  00674000
BVTPGMDP EQU   BVT+164                                                  00675000
BVTPGMLP EQU   BVT+168                                                  00676000
BVTMONCP EQU   BVT+180                                                  00677000
BVTMONDP EQU   BVT+184                                                  00678000
BVTMONTP EQU   BVT+188                                                  00679000
BVTPARIP EQU   BVT+192                                                  00680000
BVTPARUP EQU   BVT+196                                                  00681000
BVTPRTNP EQU   BVT+204                                                  00682000
BVTVSCRP EQU   BVT+208                                                  00683000
BVTVSMRP EQU   BVT+212                                                  00684000
BVTMONXP EQU   BVT+216                                                  00685000
BVTTRMAP EQU   BVT+228                                                  00686000
BLSDMSGS EQU   0                                                        00687000
BLSDMSG0 EQU   0                                                        00688000
DVT      EQU   0                                                        00689000
DVTDEQPP EQU   DVT+8                                                    00690000
DVTENQPP EQU   DVT+12                                                   00691000
DVTAUTHP EQU   DVT+20                                                   00692000
DVTLPCLP EQU   DVT+24                                                   00693000
DVTBP00P EQU   DVT+28                                                   00694000
DVTCN00P EQU   DVT+32                                                   00695000
DVTDF00P EQU   DVT+36                                                   00696000
DVTDS00P EQU   DVT+44                                                   00697000
DVTFL00P EQU   DVT+48                                                   00698000
DVTFP00P EQU   DVT+52                                                   00699000
DVTGG00P EQU   DVT+60                                                   00700000
DVTGP00P EQU   DVT+64                                                   00701000
DVTND00P EQU   DVT+68                                                   00702000
DVTND01P EQU   DVT+72                                                   00703000
DVTOD00P EQU   DVT+76                                                   00704000
DVTPS00P EQU   DVT+80                                                   00705000
DVTSD00P EQU   DVT+84                                                   00706000
DVTSL00P EQU   DVT+88                                                   00707000
DVTTL00P EQU   DVT+92                                                   00708000
DVTUD00P EQU   DVT+96                                                   00709000
DVTUP00P EQU   DVT+100                                                  00710000
DVTLP00P EQU   DVT+104                                                  00711000
DVTLALLP EQU   DVT+108                                                  00712000
DVTLPFMP EQU   DVT+112                                                  00713000
DVTCLOSP EQU   DVT+116                                                  00714000
DVTOPENP EQU   DVT+120                                                  00715000
DVTPERAP EQU   DVT+124                                                  00716000
DVTDALLP EQU   DVT+128                                                  00717000
DMCB     EQU   0                                                        00718000
DMCBID   EQU   DMCB                                                     00719000
DMCBFTY  EQU   DMCB+20                                                  00720000
DMCBOPN  EQU   DMCB+21                                                  00721000
DMCBSIN  EQU   DMCBOPN                                                  00722000
DMCBSOUT EQU   DMCBOPN                                                  00723000
DMCBRQST EQU   DMCB+22                                                  00724000
DMCBRMOD EQU   DMCB+23                                                  00725000
DMCBOUT  EQU   DMCBRMOD                                                 00726000
DMCBTMP  EQU   DMCBOUT                                                  00727000
DMCBRM6  EQU   DMCBRMOD                                                 00728000
DMCBRM5  EQU   DMCBRMOD                                                 00729000
DMCBOPTS EQU   DMCB+24                                                  00730000
DMCBKYD  EQU   DMCBOPTS                                                 00731000
DMCBGKY  EQU   DMCBOPTS                                                 00732000
DMCBAPX  EQU   DMCBOPTS                                                 00733000
DMCBUPD  EQU   DMCBOPTS                                                 00734000
DMCBMFLG EQU   DMCB+28                                                  00735000
DMCBBUFP EQU   DMCB+32                                                  00736000
DMCBBLEN EQU   DMCB+36                                                  00737000
DMCBKEYP EQU   DMCB+44                                                  00738000
DMCBKEYL EQU   DMCB+48                                                  00739000
DMCBMSG  EQU   DMCB+52                                                  00740000
DMCBRI   EQU   DMCB+64                                                  00741000
DMCBACBE EQU   DMCB+124                                                 00742000
DMCBSPEC EQU   DMCB+380                                                 00743000
DMCBAMS  EQU   DMCB+416                                                 00744000
DMCBAUDT EQU   DMCB+568                                                 00745000
DMCBLSCP EQU   DMCBAUDT+16                                              00746000
DMCBDMGR EQU   0                                                        00747000
DSDREC   EQU   0                                                        00748000
DSDKEY   EQU   DSDREC                                                   00749000
DSDKGRP  EQU   DSDKEY                                                   00750000
DSDKDSNM EQU   DSDKGRP+1                                                00751000
DSDKBSID EQU   DSDKEY+53                                                00752000
DSDKPID  EQU   DSDKBSID                                                 00753000
DSDINFO  EQU   DSDREC+64                                                00754000
BLSCALOC EQU   0                                                        00755000
BLSDADSD EQU   0                                                        00756000
BLSDAPDR EQU   0                                                        00757000
BLSDDEQP EQU   0                                                        00758000
BLSDENQP EQU   0                                                        00759000
BLSDENQ0 EQU   0                                                        00760000
BLSDFDSD EQU   0                                                        00761000
BLSDFPDR EQU   0                                                        00762000
BLSEAUTH EQU   0                                                        00763000
BLSELPCL EQU   0                                                        00764000
BLSELPFM EQU   0                                                        00765000
BLSFBP00 EQU   0                                                        00766000
BLSFCLOS EQU   0                                                        00767000
BLSFCN00 EQU   0                                                        00768000
BLSFDALL EQU   0                                                        00769000
BLSFDF00 EQU   0                                                        00770000
BLSFDS00 EQU   0                                                        00771000
BLSFFL00 EQU   0                                                        00772000
BLSFFP00 EQU   0                                                        00773000
BLSFGG00 EQU   0                                                        00774000
BLSFGP00 EQU   0                                                        00775000
BLSFLALL EQU   0                                                        00776000
BLSFLP00 EQU   0                                                        00777000
BLSFND00 EQU   0                                                        00778000
BLSFND01 EQU   0                                                        00779000
BLSFOD00 EQU   0                                                        00780000
BLSFOPEN EQU   0                                                        00781000
BLSFPERA EQU   0                                                        00782000
BLSFPS00 EQU   0                                                        00783000
BLSFSD00 EQU   0                                                        00784000
BLSFSL00 EQU   0                                                        00785000
BLSFTL00 EQU   0                                                        00786000
BLSFUD00 EQU   0                                                        00787000
BLSFUP00 EQU   0                                                        00788000
BLSUALLO EQU   0                                                        00789000
BLSUBLDD EQU   0                                                        00790000
BLSUBLDL EQU   0                                                        00791000
BLSUDYNA EQU   0                                                        00792000
BLSUFREE EQU   0                                                        00793000
BLSUFRE1 EQU   0                                                        00794000
BLSUMON  EQU   0                                                        00795000
BLSUMONA EQU   0                                                        00796000
BLSUMONC EQU   0                                                        00797000
BLSUMOND EQU   0                                                        00798000
BLSUMONL EQU   0                                                        00799000
BLSUMONT EQU   0                                                        00800000
BLSUMONX EQU   0                                                        00801000
BLSUMON2 EQU   0                                                        00802000
BLSUMPKN EQU   0                                                        00803000
BLSUMPK1 EQU   0                                                        00804000
BLSUPARI EQU   0                                                        00805000
BLSUPARU EQU   0                                                        00806000
BLSUPGMC EQU   0                                                        00807000
BLSUPGMD EQU   0                                                        00808000
BLSUPGML EQU   0                                                        00809000
BLSUPGMR EQU   0                                                        00810000
BLSUPRTA EQU   0                                                        00811000
BLSUPRTN EQU   0                                                        00812000
BLSUPRTT EQU   0                                                        00813000
BLSUPUTA EQU   0                                                        00814000
BLSUPUTC EQU   0                                                        00815000
BLSUPUTD EQU   0                                                        00816000
BLSUPUTL EQU   0                                                        00817000
BLSUPUTN EQU   0                                                        00818000
BLSUPUTO EQU   0                                                        00819000
BLSUPUTT EQU   0                                                        00820000
BLSUPUTV EQU   0                                                        00821000
BLSUSTAI EQU   0                                                        00822000
BLSUTRMA EQU   0                                                        00823000
BLSUTRMN EQU   0                                                        00824000
BLSUTRMO EQU   0                                                        00825000
BLSUTRMV EQU   0                                                        00826000
BLSUVSAR EQU   0                                                        00827000
BLSUVSCR EQU   0                                                        00828000
BLSUVSEN EQU   0                                                        00829000
BLSUVSER EQU   0                                                        00830000
BLSUVSGE EQU   0                                                        00831000
BLSUVSGU EQU   0                                                        00832000
BLSUVSMR EQU   0                                                        00833000
BLSUVSPO EQU   0                                                        00834000
BLSUVSPU EQU   0                                                        00835000
BLSUZZ2C EQU   0                                                        00836000
BLSUZZ2D EQU   0                                                        00837000
BLSUZZ2R EQU   0                                                        00838000
DMCBRQC  EQU   0                                                        00839000
IKJEFF02 EQU   0                                                        00840000
IKJEFF18 EQU   0                                                        00841000
IKJEFF19 EQU   0                                                        00842000
IKJGETL  EQU   0                                                        00843000
IKJPARS  EQU   0                                                        00844000
IKJPTGT  EQU   0                                                        00845000
IKJPUTL  EQU   0                                                        00846000
IKJSCAN  EQU   0                                                        00847000
IKJSTCK  EQU   0                                                        00848000
I001C    EQU   0                                                        00849000
I008P    EQU   0                                                        00850000
I015F    EQU   0                                                        00851000
I015P    EQU   0                                                        00852000
I031F    EQU   0                                                        00853000
I031P    EQU   0                                                        00854000
I256C    EQU   0                                                        00855000
ATV      EQU   0                                                        00856000
DSNKEY   EQU   0                                                        00857000
AREA     EQU   0                                                        00858000
CPPL     EQU   ZZ2CPPL                                                  00859000
CPPLUPT  EQU   CPPL+4                                                   00860000
CPPLPSCB EQU   CPPL+8                                                   00861000
CPPLECT  EQU   CPPL+12                                                  00862000
DMCBVSM  EQU   DMCBAMS                                                  00863000
DMCBQSM  EQU   DMCBAMS                                                  00864000
DSDBASRC EQU   DSDINFO                                                  00865000
DSDDSATR EQU   DSDBASRC+8                                               00866000
DSDPRASR EQU   DSDINFO                                                  00867000
*                                      START UNREFERENCED COMPONENTS    00868000
DSDPRSQN EQU   DSDPRASR                                                 00869000
DSDBRES1 EQU   DSDBASRC+76                                              00870000
DSDDESC  EQU   DSDBASRC+16                                              00871000
DSDSLOWN EQU   DSDDSATR                                                 00872000
DSDDSNTY EQU   DSDBASRC                                                 00873000
DMCBRES7 EQU   DMCBQSM+96                                               00874000
DMCBDCB  EQU   DMCBQSM                                                  00875000
DMCBACB  EQU   DMCBVSM+76                                               00876000
DMCBRPL  EQU   DMCBVSM                                                  00877000
CPPLCBUF EQU   CPPL                                                     00878000
DSNKEYPN EQU   DSNKEY+53                                                00879000
DSNKEYMN EQU   DSNKEY+45                                                00880000
DSNKEYDS EQU   DSNKEY+1                                                 00881000
DSNKEYTY EQU   DSNKEY                                                   00882000
DSDRES1  EQU   DSDREC+61                                                00883000
DSDKPNUM EQU   DSDKPID+3                                                00884000
DSDKPREF EQU   DSDKPID                                                  00885000
DSDKMEMN EQU   DSDKDSNM+44                                              00886000
DSDKDSN  EQU   DSDKDSNM                                                 00887000
DSDKTYP  EQU   DSDKGRP                                                  00888000
DMCBWRK  EQU   DMCB+648                                                 00889000
DMCBRES8 EQU   DMCB+640                                                 00890000
DMCBMODN EQU   DMCB+632                                                 00891000
DMCBCARY EQU   DMCBAUDT+20                                              00892000
DMCBCLC  EQU   DMCBAUDT+12                                              00893000
DMCBOPC  EQU   DMCBAUDT+8                                               00894000
DMCBFRC  EQU   DMCBAUDT+4                                               00895000
DMCBALC  EQU   DMCBAUDT                                                 00896000
DMCBFR   EQU   DMCB+412                                                 00897000
DMCBRES6 EQU   DMCB+410                                                 00898000
DMCBIRSC EQU   DMCB+408                                                 00899000
DMCBSUBC EQU   DMCB+404                                                 00900000
DMCBDRBP EQU   DMCB+400                                                 00901000
DMCBRSZM EQU   DMCB+398                                                 00902000
DMCBRSZA EQU   DMCB+396                                                 00903000
DMCBCISZ EQU   DMCB+394                                                 00904000
DMCBDCBL EQU   DMCB+392                                                 00905000
DMCBDCLR EQU   DMCB+390                                                 00906000
DMCBDCFM EQU   DMCB+389                                                 00907000
DMCBRES5 EQU   DMCB+388                                                 00908000
DMCBLBRT EQU   DMCB+386                                                 00909000
DMCBLBSQ EQU   DMCB+384                                                 00910000
DMCBLBPS EQU   DMCB+383                                                 00911000
DMCBLBTY EQU   DMCB+382                                                 00912000
DMCBRES4 EQU   DMCB+381                                                 00913000
DMCBSPRS EQU   DMCBSPEC                                                 00914000
DMCBSPRN EQU   DMCBSPEC                                                 00915000
DMCBSPCT EQU   DMCBSPEC                                                 00916000
DMCBSPRL EQU   DMCBSPEC                                                 00917000
DMCBSPSE EQU   DMCB+376                                                 00918000
DMCBSPPR EQU   DMCB+372                                                 00919000
DMCBSPTY EQU   DMCB+369                                                 00920000
DMCBODIS EQU   DMCB+368                                                 00921000
DMCBDISP EQU   DMCB+367                                                 00922000
DMCBSTAT EQU   DMCB+366                                                 00923000
DMCBRES3 EQU   DMCB+364                                                 00924000
DMCBMEMB EQU   DMCB+356                                                 00925000
DMCBMODL EQU   DMCB+348                                                 00926000
DMCBRES9 EQU   DMCB+340                                                 00927000
DMCBPID  EQU   DMCB+332                                                 00928000
DMCBTYPE EQU   DMCB+328                                                 00929000
DMCBDSN  EQU   DMCB+284                                                 00930000
DMCBUNIT EQU   DMCB+276                                                 00931000
DMCBDSOR EQU   DMCB+274                                                 00932000
DMCBVOL  EQU   DMCB+268                                                 00933000
DMCBDDNM EQU   DMCB+260                                                 00934000
DMCBSYNM EQU   DMCB+132                                                 00935000
DMCBRPLF EQU   DMCB+128                                                 00936000
DMCBDCBE EQU   DMCBACBE                                                 00937000
DMCBARC  EQU   DMCB+120                                                 00938000
DMCBCPC  EQU   DMCB+116                                                 00939000
DMCBRET  EQU   DMCB+112                                                 00940000
DMCBSTL  EQU   DMCB+96                                                  00941000
DMCBEOB  EQU   DMCB+92                                                  00942000
DMCBFRE  EQU   DMCB+88                                                  00943000
DMCBRES2 EQU   DMCB+85                                                  00944000
DMCBSPID EQU   DMCB+84                                                  00945000
DMCBRESC EQU   DMCB+80                                                  00946000
DMCBZZ1P EQU   DMCB+76                                                  00947000
DMCBMSGS EQU   DMCB+72                                                  00948000
DMCBMSG0 EQU   DMCB+68                                                  00949000
DMCBRRL  EQU   DMCB+60                                                  00950000
DMCBRBA  EQU   DMCB+56                                                  00951000
DMCBKPC  EQU   DMCBKEYP                                                 00952000
DMCBORL  EQU   DMCB+40                                                  00953000
DMCBBFPC EQU   DMCBBUFP                                                 00954000
DMCBRES1 EQU   DMCB+31                                                  00955000
DMCBACCM EQU   DMCB+30                                                  00956000
DMCBREJ  EQU   DMCB+29                                                  00957000
DMCBRESB EQU   DMCBMFLG                                                 00958000
DMCBFMOD EQU   DMCBMFLG                                                 00959000
DMCBLOPT EQU   DMCB+27                                                  00960000
DMCBLRM  EQU   DMCB+26                                                  00961000
DMCBLRQ  EQU   DMCB+25                                                  00962000
DMCBOPRS EQU   DMCBOPTS                                                 00963000
DMCBLRD  EQU   DMCBOPTS                                                 00964000
DMCBBWD  EQU   DMCBOPTS                                                 00965000
DMCBRNO  EQU   DMCBGKY                                                  00966000
DMCBRMRS EQU   DMCBRMOD                                                 00967000
DMCBRESA EQU   DMCBOPN                                                  00968000
DMCBVSF  EQU   DMCBFTY                                                  00969000
DMCBKSF  EQU   DMCBFTY                                                  00970000
DMCBFTRS EQU   DMCBFTY                                                  00971000
DMCBSHF  EQU   DMCBFTY                                                  00972000
DMCBIRL  EQU   DMCB+16                                                  00973000
DMCBRTC  EQU   DMCB+12                                                  00974000
DMCBTVP  EQU   DMCB+8                                                   00975000
DMCBNEXT EQU   DMCB+4                                                   00976000
DVT99999 EQU   DVT+256                                                  00977000
DVT0064P EQU   DVT+252                                                  00978000
DVT0063P EQU   DVT+248                                                  00979000
DVT0062P EQU   DVT+244                                                  00980000
DVT0061P EQU   DVT+240                                                  00981000
DVT0060P EQU   DVT+236                                                  00982000
DVT0059P EQU   DVT+232                                                  00983000
DVT0058P EQU   DVT+228                                                  00984000
DVT0057P EQU   DVT+224                                                  00985000
DVT0056P EQU   DVT+220                                                  00986000
DVT0055P EQU   DVT+216                                                  00987000
DVT0054P EQU   DVT+212                                                  00988000
DVT0053P EQU   DVT+208                                                  00989000
DVT0052P EQU   DVT+204                                                  00990000
DVT0051P EQU   DVT+200                                                  00991000
DVT0050P EQU   DVT+196                                                  00992000
DVT0049P EQU   DVT+192                                                  00993000
DVT0048P EQU   DVT+188                                                  00994000
DVT0047P EQU   DVT+184                                                  00995000
DVT0046P EQU   DVT+180                                                  00996000
DVT0045P EQU   DVT+176                                                  00997000
DVT0044P EQU   DVT+172                                                  00998000
DVT0043P EQU   DVT+168                                                  00999000
DVT0042P EQU   DVT+164                                                  01000000
DVT0041P EQU   DVT+160                                                  01001000
DVT0040P EQU   DVT+156                                                  01002000
DVT0039P EQU   DVT+152                                                  01003000
DVT0038P EQU   DVT+148                                                  01004000
DVT0037P EQU   DVT+144                                                  01005000
DVT0036P EQU   DVT+140                                                  01006000
DVT0035P EQU   DVT+136                                                  01007000
DVT0034P EQU   DVT+132                                                  01008000
DVTGD00P EQU   DVT+56                                                   01009000
DVT0011P EQU   DVT+40                                                   01010000
DVT0005P EQU   DVT+16                                                   01011000
DVT0002P EQU   DVT+4                                                    01012000
DVT0001P EQU   DVT                                                      01013000
BVT99999 EQU   BVT+256                                                  01014000
BVT0064P EQU   BVT+252                                                  01015000
BVT0063P EQU   BVT+248                                                  01016000
BVT0062P EQU   BVT+244                                                  01017000
BVT0061P EQU   BVT+240                                                  01018000
BVT0060P EQU   BVT+236                                                  01019000
BVT0059P EQU   BVT+232                                                  01020000
BVT0057P EQU   BVT+224                                                  01021000
BVT0056P EQU   BVT+220                                                  01022000
BVTSTBLP EQU   BVT+200                                                  01023000
BVT0045P EQU   BVT+176                                                  01024000
BVT0044P EQU   BVT+172                                                  01025000
BVT0033P EQU   BVT+128                                                  01026000
BVT0032P EQU   BVT+124                                                  01027000
BVT0031P EQU   BVT+120                                                  01028000
BVT0030P EQU   BVT+116                                                  01029000
BVT0029P EQU   BVT+112                                                  01030000
BVT0026P EQU   BVT+100                                                  01031000
BVT0025P EQU   BVT+96                                                   01032000
BVT0024P EQU   BVT+92                                                   01033000
BVT0023P EQU   BVT+88                                                   01034000
BVT0016P EQU   BVT+60                                                   01035000
BVT0015P EQU   BVT+56                                                   01036000
BVT0014P EQU   BVT+52                                                   01037000
BVT0003P EQU   BVT+8                                                    01038000
BVT0001P EQU   BVT                                                      01039000
SA99     EQU   SA+72                                                    01040000
SARC     EQU   SAR+56                                                   01041000
SARB     EQU   SAR+52                                                   01042000
SARA     EQU   SAR+48                                                   01043000
SAR9     EQU   SAR+44                                                   01044000
SAR8     EQU   SAR+40                                                   01045000
SAR7     EQU   SAR+36                                                   01046000
SAR6     EQU   SAR+32                                                   01047000
SAR5     EQU   SAR+28                                                   01048000
SAR4     EQU   SAR+24                                                   01049000
SAR3     EQU   SAR+20                                                   01050000
SAR2     EQU   SAR+16                                                   01051000
SAR1     EQU   SAR+12                                                   01052000
SAR0     EQU   SAR+8                                                    01053000
SARF     EQU   SAR+4                                                    01054000
SARE     EQU   SAR                                                      01055000
SAFWD    EQU   SA+8                                                     01056000
SABAK    EQU   SA+4                                                     01057000
SA1L     EQU   SA1+1                                                    01058000
SA1P     EQU   SA1                                                      01059000
UPTPREFL EQU   UPT+23                                                   01060000
UPTPREFX EQU   UPT+16                                                   01061000
@NM00068 EQU   UPT+15                                                   01062000
UPTLDEL  EQU   UPT+14                                                   01063000
UPTCDEL  EQU   UPT+13                                                   01064000
UPTWTP   EQU   UPTSWS                                                   01065000
UPTMODE  EQU   UPTSWS                                                   01066000
UPTALD   EQU   UPTSWS                                                   01067000
UPTPAUS  EQU   UPTSWS                                                   01068000
UPTNCOM  EQU   UPTSWS                                                   01069000
UPTMID   EQU   UPTSWS                                                   01070000
UPTNPRM  EQU   UPTSWS                                                   01071000
UPTRCVR  EQU   UPTSWS                                                   01072000
UPTUSER  EQU   UPT+2                                                    01073000
@NM00067 EQU   UPT                                                      01074000
@NM00066 EQU   ECT+52                                                   01075000
@NM00065 EQU   ECT+48                                                   01076000
@NM00064 EQU   ECT+44                                                   01077000
@NM00063 EQU   ECTSWS2+1                                                01078000
@NM00062 EQU   ECTSWS21                                                 01079000
ECTTABND EQU   ECTSWS21                                                 01080000
ECTDEFCS EQU   ECTSWS21                                                 01081000
ECTBKPB  EQU   ECT+36                                                   01082000
ECTUSER  EQU   ECT+32                                                   01083000
ECTDDNUM EQU   ECT+29                                                   01084000
ECTATTN  EQU   ECTSWS                                                   01085000
ECTBKGRD EQU   ECTSWS                                                   01086000
ECTNNOT  EQU   ECTSWS                                                   01087000
ECTNMAL  EQU   ECTSWS                                                   01088000
ECTLOGF  EQU   ECTSWS                                                   01089000
ECTATRM  EQU   ECTSWS                                                   01090000
@NM00061 EQU   ECTSWS                                                   01091000
ECTNOPD  EQU   ECTSWS                                                   01092000
ECTSCMD  EQU   ECT+20                                                   01093000
ECTPCMD  EQU   ECT+12                                                   01094000
ECTSMSG  EQU   ECT+9                                                    01095000
ECTMSGF  EQU   ECT+8                                                    01096000
ECTIOWA  EQU   ECT+4                                                    01097000
ECTRTCD  EQU   ECT+1                                                    01098000
ECTRCDF  EQU   ECT                                                      01099000
PSCBU    EQU   PSCB+64                                                  01100000
PSCBRSZ  EQU   PSCB+60                                                  01101000
PSCBLINE EQU   PSCB+59                                                  01102000
PSCBCHAR EQU   PSCB+58                                                  01103000
PSCBUPTL EQU   PSCB+56                                                  01104000
PSCBUPT  EQU   PSCB+52                                                  01105000
PSCBRLGB EQU   PSCB+48                                                  01106000
PSCBDEST EQU   PSCB+40                                                  01107000
@NM00060 EQU   PSCB+36                                                  01108000
@NM00059 EQU   PSCB+32                                                  01109000
@NM00058 EQU   PSCB+28                                                  01110000
PSCBLTI2 EQU   PSCB+24                                                  01111000
PSCBLTIM EQU   PSCB+20                                                  01112000
PSCBATR2 EQU   PSCB+18                                                  01113000
@NM00057 EQU   PSCBATR1                                                 01114000
@NM00056 EQU   PSCBATR1                                                 01115000
@NM00055 EQU   PSCBATR1                                                 01116000
PSCBATTN EQU   PSCBATR1                                                 01117000
PSCBVMNT EQU   PSCBATR1                                                 01118000
PSCBJCL  EQU   PSCBATR1                                                 01119000
PSCBACCT EQU   PSCBATR1                                                 01120000
PSCBCTRL EQU   PSCBATR1                                                 01121000
PSCBGPNM EQU   PSCB+8                                                   01122000
PSCBUSRL EQU   PSCB+7                                                   01123000
PSCBUSER EQU   PSCB                                                     01124000
CMDT1    EQU   CMDT                                                     01125000
CMDO     EQU   CMD+2                                                    01126000
CMDL     EQU   CMD                                                      01127000
ZZ299999 EQU   ZZ2+8192                                                 01128000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  01129000
ZZ2AXOL  EQU   ZZ2AXO                                                   01130000
@NM00054 EQU   ZZ2+7288                                                 01131000
@NM00053 EQU   ZZ2AMDX+4                                                01132000
ZZ2AMDXC EQU   ZZ2AMDX                                                  01133000
ZZ2HSD   EQU   ZZ2+3056                                                 01134000
@NM00052 EQU   ZZ2ES                                                    01135000
@NM00051 EQU   ZZ2+2868                                                 01136000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                01137000
@NM00050 EQU   ZZ2ITSE                                                  01138000
ZZ2ITSEP EQU   ZZ2ITSE                                                  01139000
ZZ2ITSEW EQU   ZZ2ITSE                                                  01140000
@NM00049 EQU   ZZ2ITR+20                                                01141000
ZZ2ITREC EQU   ZZ2ITRE+1                                                01142000
@NM00048 EQU   ZZ2ITRE                                                  01143000
ZZ2ITREP EQU   ZZ2ITRE                                                  01144000
ZZ2ITREW EQU   ZZ2ITRE                                                  01145000
@NM00047 EQU   ZZ2ITR+9                                                 01146000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 01147000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 01148000
ZZ2ITRPP EQU   ZZ2ITR                                                   01149000
@NM00046 EQU   ZZ2+1544                                                 01150000
ZZ2PGM   EQU   ZZ2+1536                                                 01151000
@NM00045 EQU   ZZ2+1526                                                 01152000
ZZ2CW    EQU   ZZ2+1524                                                 01153000
@NM00044 EQU   ZZ2+1504                                                 01154000
@NM00043 EQU   ZZ2+1352                                                 01155000
ZZ2FFSYP EQU   ZZ2+1348                                                 01156000
ZZ2SASYP EQU   ZZ2+1344                                                 01157000
ZZ2RDSYP EQU   ZZ2+1340                                                 01158000
ZZ2RASYP EQU   ZZ2+1336                                                 01159000
ZZ2PHSYP EQU   ZZ2+1332                                                 01160000
ZZ2ESSYP EQU   ZZ2+1328                                                 01161000
ZZ200SYP EQU   ZZ2+1324                                                 01162000
ZZ2SCWP  EQU   ZZ2+1320                                                 01163000
ZZ2TTLP  EQU   ZZ2+1316                                                 01164000
ZZ2LOADP EQU   ZZ2+1312                                                 01165000
ZZ2VRESP EQU   ZZ2+1308                                                 01166000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               01167000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                01168000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                01169000
ZZ2VRSAP EQU   ZZ2+1288                                                 01170000
ZZ2RVTP  EQU   ZZ2+1284                                                 01171000
@NM00042 EQU   ZZ2+1272                                                 01172000
@NM00041 EQU   ZZ2+1268                                                 01173000
ZZ2RPLP  EQU   ZZ2+1260                                                 01174000
ZZ2TCBP  EQU   ZZ2+1256                                                 01175000
@NM00040 EQU   ZZ2+1252                                                 01176000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 01177000
@NM00039 EQU   ZZ2+1112                                                 01178000
@NM00038 EQU   ZZ2+1080                                                 01179000
ZZ2FT25P EQU   ZZ2+1072                                                 01180000
@NM00037 EQU   ZZ2+976                                                  01181000
ZZ2TOD   EQU   ZZ2+968                                                  01182000
ZZ2STGN  EQU   ZZ2STG+4                                                 01183000
ZZ2STGP  EQU   ZZ2STG                                                   01184000
@NM00036 EQU   ZZ2+952                                                  01185000
ZZ2SCMDE EQU   ZZ2+944                                                  01186000
ZZ2SCMDN EQU   ZZ2+936                                                  01187000
ZZ2IDENT EQU   ZZ2+928                                                  01188000
ZZ2A9999 EQU   ZZ2A+656                                                 01189000
@NM00035 EQU   ZZ2A+224                                                 01190000
@NM00034 EQU   ZZ2A+220                                                 01191000
ZZ2AQD99 EQU   ZZ2AQD+60                                                01192000
@NM00033 EQU   ZZ2AQD+56                                                01193000
@NM00032 EQU   ZZ2AQDF                                                  01194000
ZZ2AQDFA EQU   ZZ2AQDF                                                  01195000
ZZ2AQDIL EQU   ZZ2AQD+48                                                01196000
ZZ2AQDIM EQU   ZZ2AQD+44                                                01197000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               01198000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               01199000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                01200000
@NM00031 EQU   ZZ2AQDT+1                                                01201000
ZZ2AQDTY EQU   ZZ2AQDT                                                  01202000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  01203000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 01204000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 01205000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 01206000
ZZ2AQDOF EQU   ZZ2AQD                                                   01207000
ZZ2AQD00 EQU   ZZ2AQD                                                   01208000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               01209000
@NM00030 EQU   ZZ2AQAS+12                                               01210000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                01211000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                01212000
@NM00029 EQU   ZZ2AQAS+2                                                01213000
ZZ2AQAST EQU   ZZ2AQAS                                                  01214000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  01215000
ZZ2AZZ6P EQU   ZZ2A+140                                                 01216000
ZZ2ADPTA EQU   ZZ2ADPT                                                  01217000
ZZ2ADPL  EQU   ZZ2ADP                                                   01218000
ZZ2ADMTA EQU   ZZ2ADMT                                                  01219000
ZZ2ADML  EQU   ZZ2ADM                                                   01220000
ZZ2ADDTA EQU   ZZ2ADDT                                                  01221000
ZZ2ADDL  EQU   ZZ2ADD                                                   01222000
@NM00028 EQU   ZZ2A+72                                                  01223000
ZZ2APIDB EQU   ZZ2APID+3                                                01224000
ZZ2APIDA EQU   ZZ2APID                                                  01225000
@NM00027 EQU   ZZ2A+24                                                  01226000
@NM00026 EQU   ZZ2AF+5                                                  01227000
ZZ2AFX   EQU   ZZ2AF+5                                                  01228000
@NM00025 EQU   ZZ2AF+3                                                  01229000
ZZ2AFS   EQU   ZZ2AF+2                                                  01230000
ZZ2AFD   EQU   ZZ2AF+2                                                  01231000
ZZ2AFQ   EQU   ZZ2AF+2                                                  01232000
ZZ2AF$   EQU   ZZ2AF+2                                                  01233000
@NM00024 EQU   ZZ2AF+2                                                  01234000
ZZ2AFM   EQU   ZZ2AF+2                                                  01235000
@NM00023 EQU   ZZ2AF+2                                                  01236000
@NM00022 EQU   ZZ2AF+1                                                  01237000
ZZ2AFV   EQU   ZZ2AF+1                                                  01238000
@NM00021 EQU   ZZ2AF+1                                                  01239000
ZZ2AFC   EQU   ZZ2AF+1                                                  01240000
@NM00020 EQU   ZZ2AF                                                    01241000
ZZ2AFFS  EQU   ZZ2AF                                                    01242000
ZZ2AFT   EQU   ZZ2AF                                                    01243000
ZZ2AFP   EQU   ZZ2AF                                                    01244000
@NM00019 EQU   ZZ2A+8                                                   01245000
ZZ2ALINE EQU   ZZ2A+4                                                   01246000
@NM00018 EQU   ZZ2A+3                                                   01247000
ZZ2ASE   EQU   ZZ2A+2                                                   01248000
ZZ2ACH   EQU   ZZ2A                                                     01249000
@NM00017 EQU   ZZ2+264                                                  01250000
@NM00016 EQU   ZZ2+263                                                  01251000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  01252000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 01253000
ZZ2PRTL  EQU   ZZ2PRT                                                   01254000
@NM00015 EQU   ZZ2AMD+56                                                01255000
ZZ2AMDXP EQU   ZZ2AMD+52                                                01256000
ZZ2AMDD  EQU   ZZ2AMD+48                                                01257000
ZZ2AMDL  EQU   ZZ2AMD+44                                                01258000
ZZ2AMDU  EQU   ZZ2AMD+28                                                01259000
ZZ2AMDF  EQU   ZZ2AMD+24                                                01260000
ZZ2AMDS  EQU   ZZ2AMD+20                                                01261000
ZZ2AMDC  EQU   ZZ2AMD+16                                                01262000
ZZ2AMDP  EQU   ZZ2AMD+12                                                01263000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 01264000
@NM00014 EQU   @NM00013                                                 01265000
ZZ2AMD2  EQU   @NM00013                                                 01266000
ZZ2AMD1  EQU   @NM00013                                                 01267000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 01268000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 01269000
ZZ2AMDT  EQU   ZZ2AMD                                                   01270000
ZZ199999 EQU   ZZ1+3072                                                 01271000
@NM00012 EQU   ZZ1+2160                                                 01272000
ZZ1TRTAS EQU   ZZ1+1904                                                 01273000
ZZ1TRUPC EQU   ZZ1+1648                                                 01274000
ZZ1TRCTX EQU   ZZ1+1392                                                 01275000
ZZ1NASID EQU   ZZ1N+274                                                 01276000
ZZ1NSTRL EQU   ZZ1N+272                                                 01277000
ZZ1NOFF  EQU   ZZ1N+268                                                 01278000
ZZ1NBDY  EQU   ZZ1N+264                                                 01279000
ZZ1NADE  EQU   ZZ1N+260                                                 01280000
ZZ1NADB  EQU   ZZ1N+256                                                 01281000
ZZ1NSTR  EQU   ZZ1N                                                     01282000
@NM00011 EQU   ZZ1+1080                                                 01283000
ZZ1TREBC EQU   ZZ1+824                                                  01284000
ZZ1TRHEX EQU   ZZ1+568                                                  01285000
@NM00010 EQU   ZZ1+377                                                  01286000
ZZ1USTAE EQU   ZZ1+376                                                  01287000
@NM00009 EQU   ZZ1F+1                                                   01288000
@NM00008 EQU   ZZ1F                                                     01289000
ZZ1FM    EQU   ZZ1F                                                     01290000
ZZ1FX    EQU   ZZ1F                                                     01291000
ZZ1FU    EQU   ZZ1F                                                     01292000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 01293000
@NM00007 EQU   ZZ1EVE                                                   01294000
ZZ1EVEP  EQU   ZZ1EVE                                                   01295000
ZZ1EVEW  EQU   ZZ1EVE                                                   01296000
ZZ1ACMP  EQU   ZZ1ATTN                                                  01297000
@NM00006 EQU   ZZ1+144                                                  01298000
ZZ1FPP   EQU   ZZ1+140                                                  01299000
ZZ1ZZ6P  EQU   ZZ1+136                                                  01300000
@NM00005 EQU   ZZ1+84                                                   01301000
ZZ1PLINE EQU   ZZ1+80                                                   01302000
ZZ1PGSZ  EQU   ZZ1+76                                                   01303000
ZZ1PCNT  EQU   ZZ1+72                                                   01304000
@NM00004 EQU   ZZ1+68                                                   01305000
ZZ1TPAGE EQU   ZZ1+64                                                   01306000
ZZ1TLINE EQU   ZZ1+60                                                   01307000
@NM00003 EQU   ZZ1+52                                                   01308000
ZZ1DMCBP EQU   ZZ1+48                                                   01309000
ZZ1PDRP  EQU   ZZ1+40                                                   01310000
ZZ1ZZ2P  EQU   ZZ1+36                                                   01311000
ZZ1327WP EQU   ZZ1+32                                                   01312000
ZZ1ACBP  EQU   ZZ1+28                                                   01313000
@NM00002 EQU   ZZ1+24                                                   01314000
ZZ1PDCBP EQU   ZZ1+20                                                   01315000
ZZ1BLRBL EQU   ZZ1+16                                                   01316000
@NM00001 EQU   ZZ1+12                                                   01317000
ZZ1PNULL EQU   ZZ1+8                                                    01318000
ZZ1NULL  EQU   ZZ1+4                                                    01319000
ZZ1IDE   EQU   ZZ1                                                      01320000
*                                      END UNREFERENCED COMPONENTS      01321000
@RF00205 EQU   @RC00158                                                 01322000
@ENDDATA EQU   *                                                        01323000
         END   BLSFGD00,(C'PLS1704',0701,78065)                         01324000
