         TITLE 'BLSFCN00-CONFIRMATION MESSAGE AND REPLY PROCESSOR      *00001000
                        '                                               00002000
*          /*        CHANGE ACTIVITY         */                         00003000
*  THIS MODULE IS WRITTEN FOR @G57LPRM                                  00004000
BLSFCN00 CSECT ,                                                01S0002 00005000
@MAINENT DS    0H                                               01S0002 00006000
         USING *,@15                                            01S0002 00007000
         B     @PROLOG                                          01S0002 00008000
         DC    AL1(16)                                          01S0002 00009000
         DC    C'BLSFCN00  78.065'                              01S0002 00010000
         DROP  @15                                                      00011000
@PROLOG  STM   @14,@12,12(@13)                                  01S0002 00012000
         BALR  @12,0                                            01S0002 00013000
@PSTART  DS    0H                                               01S0002 00014000
         USING @PSTART,@12                                      01S0002 00015000
         L     @00,@SIZDATD                                     01S0002 00016000
         BLSUALLS R,LV=(0)                                              00017000
         LR    @11,@01                                          01S0002 00018000
         USING @DATD,@11                                        01S0002 00019000
         ST    @13,@SA00001+4                                   01S0002 00020000
         LM    @00,@01,20(@13)                                  01S0002 00021000
         ST    @11,8(,@13)                                      01S0002 00022000
         LR    @13,@11                                          01S0002 00023000
         MVC   @PC00001(8),0(@01)                               01S0002 00024000
*                                                               01S0143 00025000
*/* ***********************************************************      */ 00026000
*/*                                                                  */ 00027000
*/*               START OF DEFAULT PROCESSING                        */ 00028000
*/*                                                                  */ 00029000
*/* ***********************************************************      */ 00030000
*                                                               01S0143 00031000
*   ZZ2PTR=ADDR(ZZ2CB);             /* GET TASK VARIABLE ADDR        */ 00032000
         L     ZZ2PTR,@PC00001                                  01S0143 00033000
*   RETC=ZERO;                      /* INITIALIZE THE RETC           */ 00034000
         SLR   RETC,RETC                                        01S0144 00035000
*   RETCODE=ZERO;                   /* INITIALIZE THE RETURN CODE    */ 00036000
         SLR   RETCODE,RETCODE                                  01S0145 00037000
*   MSGSEG=ONE;                     /* INIT NUMBER OF SEGMENTS       */ 00038000
         MVC   MSGSEG(4),@CF00044                               01S0146 00039000
*   ANSWER=ZERO;                    /* INIT THE ANSWER LOOP TO ZERO  */ 00040000
         SLR   ANSWER,ANSWER                                    01S0147 00041000
*   MSGPTR=ZERO;                    /* ZERO MESSAGE POINTER BEFORE      00042000
*                                      CALL                          */ 00043000
         SLR   @15,@15                                          01S0148 00044000
         ST    @15,MSGPTR                                       01S0148 00045000
*   PGPBPTR=ADDR(MSGOUT1);          /* POINT TO PUT GET BLOCK        */ 00046000
         LA    PGPBPTR,MSGOUT1                                  01S0149 00047000
*   INOUTPL=INOUTPL&&INOUTPL;       /* CLEAR OUT AREA                */ 00048000
         XC    INOUTPL(16),INOUTPL                              01S0150 00049000
*/* ***********************************************************      */ 00050000
*/*                                                                  */ 00051000
*/*        START OF MODULE PROCESSING                                */ 00052000
*/*                                                                  */ 00053000
*/* ***********************************************************      */ 00054000
*                                                               01S0151 00055000
*   IF ZZ1EVEP='0'B THEN            /* HAS USER REQUESTED END?       */ 00056000
         L     @01,ZZ2ZZ1P(,ZZ2PTR)                             01S0151 00057000
         TM    ZZ1EVEP(@01),B'01000000'                         01S0151 00058000
         BNZ   @RF00151                                         01S0151 00059000
*     DO;                           /* NO, PROCESS MESSAGE           */ 00060000
*                                                               01S0152 00061000
*       /*************************************************************/ 00062000
*       /*                                                           */ 00063000
*       /* GET THE TEXT OF THE MESSAGE REQUESTED                     */ 00064000
*       /*                                                           */ 00065000
*       /*************************************************************/ 00066000
*                                                               01S0153 00067000
*       DO;                         /* BLSDMSG                  01S0153 00068000
*                                      (ZZ2,MSGNR,MSGPTR,BLSDMSGS)      00069000
*                                      LIFO                          */ 00070000
*         CALL BLSDMSG0(ZZ2,MSGNR,MSGPTR,BLSDMSGS,'10000000'B,0);/*     00071000
*                                      BUILD MESSAGE                 */ 00072000
         ST    ZZ2PTR,@AL00001                                  01S0154 00073000
         L     @15,@PC00001+4                                   01S0154 00074000
         ST    @15,@AL00001+4                                   01S0154 00075000
         LA    @15,MSGPTR                                       01S0154 00076000
         ST    @15,@AL00001+8                                   01S0154 00077000
         L     @01,ZZ2MSGSP(,ZZ2PTR)                            01S0154 00078000
         ST    @01,@AL00001+12                                  01S0154 00079000
         LA    @15,@CB00826                                     01S0154 00080000
         ST    @15,@AL00001+16                                  01S0154 00081000
         LA    @15,@CF00049                                     01S0154 00082000
         ST    @15,@AL00001+20                                  01S0154 00083000
         L     @15,ZZ2MSG0P(,ZZ2PTR)                            01S0154 00084000
         LA    @01,@AL00001                                     01S0154 00085000
         BALR  @14,@15                                          01S0154 00086000
*       END;                        /* BLSDMSG                  01S0155 00087000
*                                      (ZZ2,MSGNR,MSGPTR,BLSDMSGS)      00088000
*                                      LIFO                          */ 00089000
*       RESPECIFY                                               01S0156 00090000
*         RF RESTRICTED;            /* RESTRICT USED OF REG 15 TO       00091000
*                                      RETURN CODES                  */ 00092000
*       IF RF=ZERO THEN             /* HAS MESSAGE BEEN FOUND?       */ 00093000
         LTR   RF,RF                                            01S0157 00094000
         BNZ   @RF00157                                         01S0157 00095000
*         DO;                       /* YES, PROCESS MESSAGE          */ 00096000
*                                                               01S0158 00097000
*           /*********************************************************/ 00098000
*           /*                                                       */ 00099000
*           /* BUILD MESSAGE IN BUFFER FOR OUTPUT                    */ 00100000
*           /*                                                       */ 00101000
*           /*********************************************************/ 00102000
*                                                               01S0159 00103000
*           MYMBUF=MYMBUF&&MYMBUF;  /* CLEAN THE AREA                */ 00104000
         XC    MYMBUF(256),MYMBUF                               01S0159 00105000
*           MYMLEN=(MSGWLEN-ONE);   /* MOVE IN LENGTH                */ 00106000
         L     @14,MSGPTR                                       01S0160 00107000
         LH    @05,MSGWLEN(,@14)                                01S0160 00108000
         LR    @04,@05                                          01S0160 00109000
         BCTR  @04,0                                            01S0160 00110000
         STH   @04,MYMLEN                                       01S0160 00111000
*           MYMOFF=MSGWPAD;         /* MOVE IN THE OFFSET            */ 00112000
         LH    @04,MSGWPAD(,@14)                                01S0161 00113000
         STH   @04,MYMOFF                                       01S0161 00114000
*           MYMTXT(ONE:(MSGWLEN-FIVE))=MSGWTXT(TWO:(MSGWLEN-FIVE));     00115000
*                                                               01S0162 00116000
         SL    @05,@CF00181                                     01S0162 00117000
         EX    @05,@SM00847                                     01S0162 00118000
*           /*********************************************************/ 00119000
*           /*                                                       */ 00120000
*           /* PUT OUT THE MESSAGE USING TSO PUTGET                  */ 00121000
*           /*                                                       */ 00122000
*           /*********************************************************/ 00123000
*                                                               01S0163 00124000
*           CALL PRMPTMSG;          /* PUT OUT THE MESSAGE           */ 00125000
         BAL   @14,PRMPTMSG                                     01S0163 00126000
*           IF RETCODE=FOUR THEN    /* IS REPROMPT NEEDED?           */ 00127000
         C     RETCODE,@CF00041                                 01S0164 00128000
         BNE   @RF00164                                         01S0164 00129000
*             DO;                   /* YES, REPROMPT IS REQUIRED     */ 00130000
*               DO;                 /* BLSDMSG                  01S0166 00131000
*                                      (ZZ2,MONE,MSGPTR,BLSDMSGS)    */ 00132000
*                 CALL BLSDMSG0(ZZ2,MONE,MSGPTR,BLSDMSGS,'00000000'B,0) 00133000
*                     ;             /* BUILD MESSAGE                 */ 00134000
         ST    ZZ2PTR,@AL00001                                  01S0167 00135000
         LA    @14,@CF00818                                     01S0167 00136000
         ST    @14,@AL00001+4                                   01S0167 00137000
         LA    @14,MSGPTR                                       01S0167 00138000
         ST    @14,@AL00001+8                                   01S0167 00139000
         L     @14,ZZ2MSGSP(,ZZ2PTR)                            01S0167 00140000
         ST    @14,@AL00001+12                                  01S0167 00141000
         LA    @14,@CB00828                                     01S0167 00142000
         ST    @14,@AL00001+16                                  01S0167 00143000
         LA    @14,@CF00049                                     01S0167 00144000
         ST    @14,@AL00001+20                                  01S0167 00145000
         L     @15,ZZ2MSG0P(,ZZ2PTR)                            01S0167 00146000
         LA    @01,@AL00001                                     01S0167 00147000
         BALR  @14,@15                                          01S0167 00148000
*               END;                /* BLSDMSG                  01S0168 00149000
*                                      (ZZ2,MONE,MSGPTR,BLSDMSGS)       00150000
*                                      PURGE MSG CHAIN               */ 00151000
*               MSGPTR=ZERO;        /* ZERO POINTER FOR NEXT MESSAGE */ 00152000
         SLR   @14,@14                                          01S0169 00153000
         ST    @14,MSGPTR                                       01S0169 00154000
*               DO;                 /* BLSDMSG                  01S0170 00155000
*                                      (ZZ2,04067,MSGPTR,BLSDMSGS)      00156000
*                                      LIFO                          */ 00157000
*                 CALL BLSDMSG0(ZZ2,04067,MSGPTR,BLSDMSGS,'10000000'B,0 00158000
*                     );            /* BUILD MESSAGE                 */ 00159000
         ST    ZZ2PTR,@AL00001                                  01S0171 00160000
         LA    @14,@CF00829                                     01S0171 00161000
         ST    @14,@AL00001+4                                   01S0171 00162000
         LA    @14,MSGPTR                                       01S0171 00163000
         ST    @14,@AL00001+8                                   01S0171 00164000
         L     @14,ZZ2MSGSP(,ZZ2PTR)                            01S0171 00165000
         ST    @14,@AL00001+12                                  01S0171 00166000
         LA    @14,@CB00826                                     01S0171 00167000
         ST    @14,@AL00001+16                                  01S0171 00168000
         LA    @14,@CF00049                                     01S0171 00169000
         ST    @14,@AL00001+20                                  01S0171 00170000
         L     @15,ZZ2MSG0P(,ZZ2PTR)                            01S0171 00171000
         LA    @01,@AL00001                                     01S0171 00172000
         BALR  @14,@15                                          01S0171 00173000
*               END;                /* BLSDMSG                  01S0172 00174000
*                                      (ZZ2,04067,MSGPTR,BLSDMSGS)      00175000
*                                      LIFO REPROMPT MSG             */ 00176000
*               IF RF=ZERO THEN     /* IS MESSAGE TEXT OK?           */ 00177000
         LTR   RF,RF                                            01S0173 00178000
         BNZ   @RF00173                                         01S0173 00179000
*                 DO;               /* BUILD THE MESSAGE             */ 00180000
*                                                               01S0174 00181000
*                   /*************************************************/ 00182000
*                   /*                                               */ 00183000
*                   /* BUILD MESSAGE IN BUFFER FOR OUTPUT            */ 00184000
*                   /*                                               */ 00185000
*                   /*************************************************/ 00186000
*                                                               01S0175 00187000
*                   MYMBUF=MYMBUF&&MYMBUF;/* CLEAN THE AREA          */ 00188000
         XC    MYMBUF(256),MYMBUF                               01S0175 00189000
*                   MYMLEN=(MSGWLEN-ONE);/* MOVE IN LENGTH           */ 00190000
         L     @14,MSGPTR                                       01S0176 00191000
         LH    @09,MSGWLEN(,@14)                                01S0176 00192000
         LR    @05,@09                                          01S0176 00193000
         BCTR  @05,0                                            01S0176 00194000
         STH   @05,MYMLEN                                       01S0176 00195000
*                   MYMOFF=MSGWPAD; /* MOVE IN THE OFFSET            */ 00196000
         LH    @05,MSGWPAD(,@14)                                01S0177 00197000
         STH   @05,MYMOFF                                       01S0177 00198000
*                   MYMTXT(ONE:(MSGWLEN-FIVE))=MSGWTXT(TWO:(MSGWLEN-    00199000
*                       FIVE));                                 01S0178 00200000
*                                                               01S0178 00201000
         SL    @09,@CF00181                                     01S0178 00202000
         EX    @09,@SM00847                                     01S0178 00203000
*                   /*************************************************/ 00204000
*                   /*                                               */ 00205000
*                   /* PUT OUT THE MESSAGE USING TSO PUTGET          */ 00206000
*                   /*                                               */ 00207000
*                   /*************************************************/ 00208000
*                                                               01S0179 00209000
*                   DO ANSWER=1 TO 5 WHILE(RETC^=TWELVE&RETCODE=FOUR);  00210000
         LA    ANSWER,1                                         01S0179 00211000
@DL00179 C     RETC,@CF00034                                    01S0179 00212000
         BE    @DC00179                                         01S0179 00213000
         C     RETCODE,@CF00041                                 01S0179 00214000
         BNE   @DC00179                                         01S0179 00215000
*                                   /* DO LOOP                       */ 00216000
*                     CALL PRMPTMSG;/* PUT OUT MSG                   */ 00217000
         BAL   @14,PRMPTMSG                                     01S0180 00218000
*                     IF ZZ1EVEP='1'B THEN/* HAS USER REQESTED TERM? */ 00219000
         L     @14,ZZ2ZZ1P(,ZZ2PTR)                             01S0181 00220000
         TM    ZZ1EVEP(@14),B'01000000'                         01S0181 00221000
         BNO   @RF00181                                         01S0181 00222000
*                       RETC=TWELVE;/* YES, GET OUT OF LOOP          */ 00223000
         LA    RETC,12                                          01S0182 00224000
*                   END;            /* END OF DO LOOP                */ 00225000
@RF00181 AL    ANSWER,@CF00044                                  01S0183 00226000
         C     ANSWER,@CF00094                                  01S0183 00227000
         BNH   @DL00179                                         01S0183 00228000
@DC00179 DS    0H                                               01S0184 00229000
*                 END;              /* END OF BUILD THE MESSAGE      */ 00230000
*               ELSE                /* NO, REPROMPT MSG LOGIC ERROR  */ 00231000
*                 RETC=TWELVE;      /* REQ TERMINATION               */ 00232000
         B     @RC00173                                         01S0185 00233000
@RF00173 LA    RETC,12                                          01S0185 00234000
*             END;                  /* END OF REPROMPT REQUIRED      */ 00235000
@RC00173 DS    0H                                               01S0187 00236000
*           DO;                     /* BLSDMSG                  01S0187 00237000
*                                      (ZZ2,MONE,MSGPTR,BLSDMSGS)    */ 00238000
@RF00164 DS    0H                                               01S0188 00239000
*             CALL BLSDMSG0(ZZ2,MONE,MSGPTR,BLSDMSGS,'00000000'B,0);    00240000
         ST    ZZ2PTR,@AL00001                                  01S0188 00241000
         LA    @14,@CF00818                                     01S0188 00242000
         ST    @14,@AL00001+4                                   01S0188 00243000
         LA    @14,MSGPTR                                       01S0188 00244000
         ST    @14,@AL00001+8                                   01S0188 00245000
         L     @14,ZZ2MSGSP(,ZZ2PTR)                            01S0188 00246000
         ST    @14,@AL00001+12                                  01S0188 00247000
         LA    @14,@CB00828                                     01S0188 00248000
         ST    @14,@AL00001+16                                  01S0188 00249000
         LA    @14,@CF00049                                     01S0188 00250000
         ST    @14,@AL00001+20                                  01S0188 00251000
         L     @15,ZZ2MSG0P(,ZZ2PTR)                            01S0188 00252000
         LA    @01,@AL00001                                     01S0188 00253000
         BALR  @14,@15                                          01S0188 00254000
*                                   /* BUILD MESSAGE                 */ 00255000
*           END;                    /* BLSDMSG                  01S0189 00256000
*                                      (ZZ2,MONE,MSGPTR,BLSDMSGS)       00257000
*                                      PURGE MSG CHAIN               */ 00258000
*         END;                      /* END OF MSG FOUND              */ 00259000
*       ELSE                        /* NO, END PROCESSING            */ 00260000
*         RETC=TWELVE;                                          01S0191 00261000
         B     @RC00157                                         01S0191 00262000
@RF00157 LA    RETC,12                                          01S0191 00263000
*     END;                          /* END OF PROCESS MESSAGE        */ 00264000
*   ELSE                            /* YES, RETURN TO CALLER         */ 00265000
*     RETC=TWELVE;                  /* TERMINATE COMMAND             */ 00266000
         B     @RC00151                                         01S0193 00267000
@RF00151 LA    RETC,12                                          01S0193 00268000
*   RETURN CODE(RETC);              /* RETURN TO CALLER              */ 00269000
@RC00151 L     @13,4(,@13)                                      01S0194 00270000
         L     @00,@SIZDATD                                     01S0194 00271000
         LR    @01,@11                                          01S0194 00272000
         BLSUFRES R,LV=(0),A=(1)                                        00273000
         LR    @15,@07                                          01S0194 00274000
         L     @14,12(,@13)                                     01S0194 00275000
         LM    @00,@12,20(@13)                                  01S0194 00276000
         BR    @14                                              01S0194 00277000
*PRMPTMSG:                                                      01S0195 00278000
*   PROCEDURE;                      /* ISSUE MESSAGE AND VERIFY REPLY*/ 00279000
*                                                               01S0195 00280000
PRMPTMSG STM   @14,@06,@SA00002                                 01S0195 00281000
         STM   @09,@12,@SA00002+36                              01S0195 00282000
*   /*****************************************************************/ 00283000
*   /*                                                               */ 00284000
*   /* ISSUE MESSAGE VIA PUTGET FOR CONFIRMATION PROMPT              */ 00285000
*   /*                                                               */ 00286000
*   /*****************************************************************/ 00287000
*                                                               01S0196 00288000
*   IF ZZ1EVEP='0'B THEN            /* HAS USER REQUESTED END?       */ 00289000
         L     @14,ZZ2ZZ1P(,ZZ2PTR)                             01S0196 00290000
         TM    ZZ1EVEP(@14),B'01000000'                         01S0196 00291000
         BNZ   @RF00196                                         01S0196 00292000
*     DO;                           /* NO, PROCESS REQUEST           */ 00293000
*       MSGOUT1=MSGOUT;             /* COPY THE LIST FORM OF MACRO   */ 00294000
         MVC   MSGOUT1(16),MSGOUT                               01S0198 00295000
*       MSGTXT=ADDR(MYMBUF);        /* POINT TO MSG TEXT-OLD FORMAT  */ 00296000
         LA    @05,MYMBUF                                       01S0199 00297000
         ST    @05,MSGTXT                                       01S0199 00298000
*       RESPECIFY                                               01S0200 00299000
*        (R2,                                                   01S0200 00300000
*         R3,                                                   01S0200 00301000
*         R4) RESTRICTED;           /* PROTECT REGS FOR CALL TO PUT     00302000
*                                      GET                           */ 00303000
*       R2=ADDR(ZZ1EVE);            /* ADDRESS OF ECB IN REG2        */ 00304000
         LA    R2,ZZ1EVE(,@14)                                  01S0201 00305000
*       R3=CPPLUPT;                 /* PUT ADDR OF UPT IN REG 3      */ 00306000
         L     R3,CPPLUPT(,ZZ2PTR)                              01S0202 00307000
*       R4=CPPLECT;                 /* PUT ECT ADDR IN REG 4         */ 00308000
         L     R4,CPPLECT(,ZZ2PTR)                              01S0203 00309000
*       GEN;                                                    01S0204 00310000
*              /* ISSUE PUT GET MESSAGE */                              00311000
     PUTGET PARM=MSGOUT1,UPT=(3),ECT=(4),ECB=(2),                      C00312000
               OUTPUT=(MSGOLD,SINGLE,TERM),MF=(E,INOUTPL)               00313000
*       RESPECIFY                                               01S0205 00314000
*        (R2,                                                   01S0205 00315000
*         R3,                                                   01S0205 00316000
*         R4) UNRESTRICTED;         /* FREE REGS                     */ 00317000
*       IF RF=ZERO THEN             /* DID THE PROMPT GET ANSWERED?  */ 00318000
         LTR   RF,RF                                            01S0206 00319000
         BNZ   @RF00206                                         01S0206 00320000
*         DO;                       /* YES, ANSWER                   */ 00321000
*                                                               01S0207 00322000
*           /*********************************************************/ 00323000
*           /*                                                       */ 00324000
*           /* PROCESS THE PROMPT REPLY                              */ 00325000
*           /*                                                       */ 00326000
*           /*********************************************************/ 00327000
*                                                               01S0208 00328000
*           IF(ANS|BLANK)=YES THEN  /* WAS THE ANSWER YES            */ 00329000
         L     @14,PGPBIBUF(,PGPBPTR)                           01S0208 00330000
         MVC   @TS00001(1),ANS(@14)                             01S0208 00331000
         OC    @TS00001(1),BLANK                                01S0208 00332000
         CLI   @TS00001,C'Y'                                    01S0208 00333000
         BNE   @RF00208                                         01S0208 00334000
*             DO;                   /* ANSWER YES                    */ 00335000
*               RETC=ZERO;          /* YES, INDICATE YES             */ 00336000
         SLR   RETC,RETC                                        01S0210 00337000
*               RETCODE=ZERO;       /* REPROMPT NOT NEEDED           */ 00338000
         SLR   RETCODE,RETCODE                                  01S0211 00339000
*             END;                  /* END OF ANSWER YES             */ 00340000
*           ELSE                    /* NO                            */ 00341000
*             IF(ANS|BLANK)=NO THEN /* WAS THE ANSWER NO?            */ 00342000
         B     @RC00208                                         01S0213 00343000
@RF00208 L     @14,PGPBIBUF(,PGPBPTR)                           01S0213 00344000
         MVC   @TS00001(1),ANS(@14)                             01S0213 00345000
         OC    @TS00001(1),BLANK                                01S0213 00346000
         CLI   @TS00001,C'N'                                    01S0213 00347000
         BNE   @RF00213                                         01S0213 00348000
*               DO;                 /* ANSWER NO                     */ 00349000
*                 RETC=FOUR;        /* YES, INDICATE NO ANSWER       */ 00350000
         LA    RETC,4                                           01S0215 00351000
*                 RETCODE=ZERO;     /* REPROMPT NOT NEEDED           */ 00352000
         SLR   RETCODE,RETCODE                                  01S0216 00353000
*               END;                /* END OF ANSWER NO              */ 00354000
*             ELSE                  /* NO                            */ 00355000
*               IF ANSWER=FIVE THEN /* HAVE WE TRIED TOO MANY TIMES? */ 00356000
         B     @RC00213                                         01S0218 00357000
@RF00213 C     ANSWER,@CF00094                                  01S0218 00358000
         BNE   @RF00218                                         01S0218 00359000
*                 RETC=TWELVE;      /* TERMINATE THE REQUEST         */ 00360000
         LA    RETC,12                                          01S0219 00361000
*               ELSE                /* NO TRY AGAIN                  */ 00362000
*                 RETCODE=FOUR;     /* REPROMPT IS NEEDED            */ 00363000
         B     @RC00218                                         01S0220 00364000
@RF00218 LA    RETCODE,4                                        01S0220 00365000
*         END;                      /* END OF ANSWER                 */ 00366000
*       ELSE                        /* NO ANSWER TREAT AS ERROR      */ 00367000
*         DO;                       /* PUTGET ERROR MSG              */ 00368000
         B     @RC00206                                         01S0222 00369000
@RF00206 DS    0H                                               01S0223 00370000
*           RCSAVE=RF;              /* SAVE THE RETCODE              */ 00371000
         LR    RCSAVE,RF                                        01S0223 00372000
*           CVD(RCSAVE,TEMPRC);     /* CONVERT TO DEC                */ 00373000
         CVD   RCSAVE,@TS00001                                  01S0224 00374000
         MVC   TEMPRC(4),@TS00001+4                             01S0224 00375000
*           PACKRC=TEMPRC(3:4);     /* REDUCE THE SIZE               */ 00376000
         MVC   PACKRC(2),TEMPRC+2                               01S0225 00377000
*           UNPK(UNPKRC,PACKRC);    /* UNPACK THE NUMBER             */ 00378000
         UNPK  UNPKRC(3),PACKRC(2)                              01S0226 00379000
*           UNPKRC(3:3)=UNPKRC(3:3)|ZEROCHAR;/* FIXED THE SIGN       */ 00380000
         OC    UNPKRC+2(1),ZEROCHAR                             01S0227 00381000
*           DO;                     /* BLSDMSG                  01S0228 00382000
*                                      (ZZ2,04066,MSGPTR,BLSDMSGS)      00383000
*                                      FIFO ROUTE(TERM)INSERT(UNPKRC)*/ 00384000
*             IOPTLIST(1)=0;        /* LAST INSERT                   */ 00385000
         SLR   @14,@14                                          01S0229 00386000
         ST    @14,IOPTLIST                                     01S0229 00387000
*             IOPTLIST(2)=ADDR(UNPKRC);/* INSERT NAME POINTER        */ 00388000
         LA    @05,UNPKRC                                       01S0230 00389000
         ST    @05,IOPTLIST+4                                   01S0230 00390000
*             IOPTLIST(3)=0;        /* ZERO RESERVED FIELD           */ 00391000
         ST    @14,IOPTLIST+8                                   01S0231 00392000
*             RFY                                               01S0232 00393000
*               I015F BASED(ADDR(IOPTLIST(3)));/* ACCESS BYTES 1-2   */ 00394000
*             I015F=LENGTH(UNPKRC); /* INSERT LENGTH                 */ 00395000
         LA    @14,IOPTLIST+8                                   01S0233 00396000
         MVC   I015F(2,@14),@CH00097                            01S0233 00397000
*             CALL BLSDMSG0(ZZ2,04066,MSGPTR,BLSDMSGS,'00010000'B,ADDR( 00398000
*                 IOPTLIST));       /* BUILD MESSAGE                 */ 00399000
         ST    ZZ2PTR,@AL00001                                  01S0234 00400000
         LA    @14,@CF00839                                     01S0234 00401000
         ST    @14,@AL00001+4                                   01S0234 00402000
         LA    @14,MSGPTR                                       01S0234 00403000
         ST    @14,@AL00001+8                                   01S0234 00404000
         L     @14,ZZ2MSGSP(,ZZ2PTR)                            01S0234 00405000
         ST    @14,@AL00001+12                                  01S0234 00406000
         LA    @14,@CB00840                                     01S0234 00407000
         ST    @14,@AL00001+16                                  01S0234 00408000
         LA    @14,IOPTLIST                                     01S0234 00409000
         ST    @14,@AFTEMPS                                     01S0234 00410000
         LA    @14,@AFTEMPS                                     01S0234 00411000
         ST    @14,@AL00001+20                                  01S0234 00412000
         L     @15,ZZ2MSG0P(,ZZ2PTR)                            01S0234 00413000
         LA    @01,@AL00001                                     01S0234 00414000
         BALR  @14,@15                                          01S0234 00415000
*           END;                    /* BLSDMSG                  01S0235 00416000
*                                      (ZZ2,04066,MSGPTR,BLSDMSGS)      00417000
*                                      FIFO ROUTE(TERM)INSERT(UNPKRC)*/ 00418000
*                                                               01S0235 00419000
*           /*********************************************************/ 00420000
*           /*                                                       */ 00421000
*           /* CONFLICTS EXIST, UNABLE TO GET CONFIRMATION, ADD DSN  */ 00422000
*           /* TERM                                                  */ 00423000
*           /*                                                       */ 00424000
*           /*********************************************************/ 00425000
*                                                               01S0236 00426000
*           RETC=TWELVE;            /* INDICATE TERMINATION REQUESTED*/ 00427000
         LA    RETC,12                                          01S0236 00428000
*         END;                      /* END OF PUTGET ERROR MSG       */ 00429000
*     END;                          /* END OF USER DID NOT REQ END   */ 00430000
*   ELSE                            /* YES, TERMINATE                */ 00431000
*     RETC=TWELVE;                  /* TERMINATE THE SUB COMMAND     */ 00432000
         B     @RC00196                                         01S0239 00433000
@RF00196 LA    RETC,12                                          01S0239 00434000
*   END PRMPTMSG;                   /* END OF PRMPTMSG PROC          */ 00435000
@EL00002 DS    0H                                               01S0240 00436000
@EF00002 DS    0H                                               01S0240 00437000
@ER00002 LM    @14,@06,@SA00002                                 01S0240 00438000
         LM    @09,@12,@SA00002+36                              01S0240 00439000
         BR    @14                                              01S0240 00440000
*/*BLSUPEND--MVS IPCS MODULE                                         */ 00441000
*                                                               01S0241 00442000
*   DECLARE                         /* COMMON VARIABLES              */ 00443000
*     I256C CHAR(256) BASED,                                    01S0241 00444000
*     I031F FIXED(31) BASED,                                    01S0241 00445000
*     I031P PTR(31) BASED,                                      01S0241 00446000
*     I015F FIXED(15) BASED,                                    01S0241 00447000
*     I015P PTR(15) BASED,                                      01S0241 00448000
*     I008P PTR(8) BASED,                                       01S0241 00449000
*     I001C CHAR(1) BASED;                                      01S0241 00450000
*   DECLARE                                                     01S0242 00451000
*     IOPTLIST(3) PTR(31) BDY(WORD);/* OPTION LIST ARRAY             */ 00452000
*   GENERATE NODEFS NOREFS DATA;                                01S0243 00453000
*   END                             /* BLRPEND END OF PROCESSING     */ 00454000
*                                                               01S0244 00455000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00456000
*/*%INCLUDE SYSLIB  (IKJPGPB )                                       */ 00457000
*/*%INCLUDE SYSLIB  (BLSDMSGD)                                       */ 00458000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00459000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00460000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00461000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00462000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00463000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00464000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00465000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00466000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00467000
*/*%INCLUDE SYSLIB  (BLSDSERV)                                       */ 00468000
*                                                               01S0244 00469000
*       ;                                                       01S0244 00470000
@EL00001 L     @13,4(,@13)                                      01S0244 00471000
@EF00001 L     @00,@SIZDATD                                     01S0244 00472000
         LR    @01,@11                                          01S0244 00473000
         BLSUFRES R,LV=(0),A=(1)                                        00474000
@ER00001 LM    @14,@12,12(@13)                                  01S0244 00475000
         BR    @14                                              01S0244 00476000
@DATA    DS    0H                                                       00477000
@CH00097 DC    H'3'                                                     00478000
@SM00847 MVC   MYMTXT(0),MSGWTXT+1(@14)                                 00479000
@DATD    DSECT                                                          00480000
         DS    0F                                                       00481000
@SA00001 DS    18F                                                      00482000
@PC00001 DS    2F                                                       00483000
@SA00002 DS    13F                                                      00484000
@AL00001 DS    6A                                                       00485000
@AFTEMPS DS    1F                                                       00486000
BLSFCN00 CSECT                                                          00487000
         DS    0F                                                       00488000
@CF00049 DC    F'0'                                                     00489000
@CF00044 DC    F'1'                                                     00490000
@CF00041 DC    F'4'                                                     00491000
@CF00094 DC    F'5'                                                     00492000
@CF00181 DC    F'6'                                                     00493000
@CF00034 DC    F'12'                                                    00494000
@CF00839 DC    F'4066'                                                  00495000
@CF00829 DC    F'4067'                                                  00496000
@CF00818 DC    F'-1'                                                    00497000
@DATD    DSECT                                                          00498000
         DS    0D                                                       00499000
MSGPTR   DS    A                                                        00500000
         DS    0D                                                       00501000
@TS00001 DS    CL8                                                      00502000
MSGOUT1  DS    CL16                                                     00503000
TEMPRC   DS    CL4                                                      00504000
PACKRC   DS    CL2                                                      00505000
UNPKRC   DS    CL3                                                      00506000
         DS    CL3                                                      00507000
MSGOLD   DS    CL8                                                      00508000
         ORG   MSGOLD                                                   00509000
MSGSEG   DS    AL4                                                      00510000
MSGTXT   DS    AL4                                                      00511000
         ORG   MSGOLD+8                                                 00512000
INOUTPL  DS    CL16                                                     00513000
         ORG   INOUTPL                                                  00514000
A        DS    FL4                                                      00515000
B        DS    FL4                                                      00516000
C        DS    FL4                                                      00517000
D        DS    FL4                                                      00518000
         ORG   INOUTPL+16                                               00519000
MYMBUF   DS    CL256                                                    00520000
         ORG   MYMBUF                                                   00521000
MYMLEN   DS    FL2                                                      00522000
MYMOFF   DS    FL2                                                      00523000
MYMTXT   DS    CL252                                                    00524000
         ORG   MYMBUF+256                                               00525000
IOPTLIST DS    3A                                                       00526000
BLSFCN00 CSECT                                                          00527000
         DS    0F                                                       00528000
@SIZDATD DC    AL1(0)                                                   00529000
         DC    AL3(@ENDDATD-@DATD)                                      00530000
         DS    0D                                                       00531000
@CB00826 DC    B'10000000'                                              00532000
@CB00828 DC    B'00000000'                                              00533000
@CB00840 DC    B'00010000'                                              00534000
BLANK    DC    CL1' '                                                   00535000
ZEROCHAR DC    CL1'0'                                                   00536000
@DATD    DSECT                                                          00537000
         SPACE 2                                                        00538000
*********************************************************************** 00539000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00540000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 00541000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 00542000
*********************************************************************** 00543000
         SPACE                                                          00544000
BLSFCN00 CSECT                                                          00545000
         ORG                                                            00546000
         DS    0D                                                       00547000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSFCN00+19)/20+7)/8)CL8'BLSFCN00'     00548000
BLSFCN00 CSECT                                                          00549000
*                        */ PUTGET MACRO LIST FORM */                   00550000
MSGOUT PUTGET MF=L                                                      00551000
@DATD    DSECT                                                          00552000
         SPACE 2                                                        00553000
*********************************************************************** 00554000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 00555000
*********************************************************************** 00556000
         SPACE                                                          00557000
         DS    0D                                                       00558000
@DATD    DSECT                                                          00559000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00560000
@ENDDATD EQU   *                                                        00561000
BLSFCN00 CSECT                                                          00562000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00563000
@01      EQU   01                                                       00564000
@02      EQU   02                                                       00565000
@03      EQU   03                                                       00566000
@04      EQU   04                                                       00567000
@05      EQU   05                                                       00568000
@06      EQU   06                                                       00569000
@07      EQU   07                                                       00570000
@08      EQU   08                                                       00571000
@09      EQU   09                                                       00572000
@10      EQU   10                                                       00573000
@11      EQU   11                                                       00574000
@12      EQU   12                                                       00575000
@13      EQU   13                                                       00576000
@14      EQU   14                                                       00577000
@15      EQU   15                                                       00578000
ANSWER   EQU   @09                                                      00579000
RETCODE  EQU   @08                                                      00580000
RCSAVE   EQU   @02                                                      00581000
RETC     EQU   @07                                                      00582000
ZZ2PTR   EQU   @06                                                      00583000
PGPBPTR  EQU   @10                                                      00584000
R0       EQU   @00                                                      00585000
R1       EQU   @01                                                      00586000
R2       EQU   @02                                                      00587000
R3       EQU   @03                                                      00588000
R4       EQU   @04                                                      00589000
R5       EQU   @05                                                      00590000
R9       EQU   @09                                                      00591000
RB       EQU   @11                                                      00592000
RD       EQU   @13                                                      00593000
RE       EQU   @14                                                      00594000
RF       EQU   @15                                                      00595000
RA       EQU   @10                                                      00596000
RC       EQU   @12                                                      00597000
R6       EQU   @06                                                      00598000
R7       EQU   @07                                                      00599000
R8       EQU   @08                                                      00600000
PGPB     EQU   0                                                        00601000
PGPBIBUF EQU   PGPB+12                                                  00602000
MSGDENT  EQU   0                                                        00603000
MSGDPRF  EQU   MSGDENT                                                  00604000
MSGDWRT  EQU   MSGDENT+8                                                00605000
MSGDMOV  EQU   MSGDWRT+4                                                00606000
MSGWENT  EQU   0                                                        00607000
MSGWMOV  EQU   MSGWENT+4                                                00608000
MSGWLEN  EQU   MSGWMOV                                                  00609000
MSGWPAD  EQU   MSGWMOV+2                                                00610000
MSGWTXT  EQU   MSGWMOV+4                                                00611000
ZZ1      EQU   0                                                        00612000
ZZ1ATTN  EQU   ZZ1+360                                                  00613000
ZZ1EVE   EQU   ZZ1ATTN+4                                                00614000
ZZ1EVEP  EQU   ZZ1EVE                                                   00615000
ZZ1F     EQU   ZZ1+368                                                  00616000
ZZ1N     EQU   ZZ1+1116                                                 00617000
ZZ2      EQU   0                                                        00618000
ZZ2AMD   EQU   ZZ2                                                      00619000
@NM00014 EQU   ZZ2AMD+7                                                 00620000
ZZ2PRT   EQU   ZZ2+138                                                  00621000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 00622000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                00623000
ZZ2A     EQU   ZZ2+272                                                  00624000
ZZ2AF    EQU   ZZ2A+16                                                  00625000
ZZ2APID  EQU   ZZ2A+64                                                  00626000
ZZ2AD    EQU   ZZ2A+74                                                  00627000
ZZ2ADD   EQU   ZZ2AD                                                    00628000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 00629000
ZZ2ADM   EQU   ZZ2AD+46                                                 00630000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 00631000
ZZ2ADP   EQU   ZZ2AD+56                                                 00632000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 00633000
ZZ2AQAS  EQU   ZZ2A+144                                                 00634000
ZZ2AQD   EQU   ZZ2A+160                                                 00635000
ZZ2AQDT  EQU   ZZ2AQD+10                                                00636000
ZZ2AQDF  EQU   ZZ2AQD+52                                                00637000
ZZ2STG   EQU   ZZ2+960                                                  00638000
ZZ2ALLOP EQU   ZZ2+992                                                  00639000
ZZ2FREEP EQU   ZZ2+996                                                  00640000
ZZ2FF19P EQU   ZZ2+1000                                                 00641000
ZZ2FRE1P EQU   ZZ2+1004                                                 00642000
ZZ2FF18P EQU   ZZ2+1008                                                 00643000
ZZ2DYNAP EQU   ZZ2+1012                                                 00644000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 00645000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 00646000
ZZ2STAIP EQU   ZZ2+1024                                                 00647000
ZZ2FF02P EQU   ZZ2+1028                                                 00648000
ZZ2GETLP EQU   ZZ2+1032                                                 00649000
ZZ2PARSP EQU   ZZ2+1036                                                 00650000
ZZ2PTGTP EQU   ZZ2+1040                                                 00651000
ZZ2PUTLP EQU   ZZ2+1044                                                 00652000
ZZ2SCANP EQU   ZZ2+1048                                                 00653000
ZZ2STCKP EQU   ZZ2+1052                                                 00654000
ZZ2ALOCP EQU   ZZ2+1056                                                 00655000
ZZ2MSGSP EQU   ZZ2+1060                                                 00656000
ZZ2TRMOP EQU   ZZ2+1064                                                 00657000
ZZ2TRMVP EQU   ZZ2+1068                                                 00658000
ZZ2MSG0P EQU   ZZ2+1076                                                 00659000
ZZ2PUTNP EQU   ZZ2+1084                                                 00660000
ZZ2TRMNP EQU   ZZ2+1088                                                 00661000
ZZ2ENQ0P EQU   ZZ2+1092                                                 00662000
ZZ2ADSDP EQU   ZZ2+1096                                                 00663000
ZZ2APDRP EQU   ZZ2+1100                                                 00664000
ZZ2FDSDP EQU   ZZ2+1104                                                 00665000
ZZ2FPDRP EQU   ZZ2+1108                                                 00666000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 00667000
ZZ2DVTP  EQU   ZZ2+1276                                                 00668000
ZZ2BVTP  EQU   ZZ2+1280                                                 00669000
ZZ2CPPL  EQU   ZZ2+1292                                                 00670000
ZZ2CPPLC EQU   ZZ2CPPL                                                  00671000
ZZ2ITR   EQU   ZZ2+2840                                                 00672000
ZZ2ITRE  EQU   ZZ2ITR+16                                                00673000
ZZ2ITSE  EQU   ZZ2+2864                                                 00674000
ZZ2ES    EQU   ZZ2+2872                                                 00675000
ZZ2AMDX  EQU   ZZ2+7160                                                 00676000
ZZ2AXO   EQU   ZZ2+7934                                                 00677000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 00678000
CMD      EQU   0                                                        00679000
CMDT     EQU   CMD+4                                                    00680000
PSCB     EQU   0                                                        00681000
PSCBATR1 EQU   PSCB+16                                                  00682000
ECT      EQU   0                                                        00683000
ECTSWS   EQU   ECT+28                                                   00684000
ECTSWS2  EQU   ECT+40                                                   00685000
ECTSWS21 EQU   ECTSWS2                                                  00686000
UPT      EQU   0                                                        00687000
UPTSWS   EQU   UPT+12                                                   00688000
SA       EQU   0                                                        00689000
SA1      EQU   SA                                                       00690000
SAR      EQU   SA+12                                                    00691000
BVT      EQU   0                                                        00692000
BVTPUTLP EQU   BVT+4                                                    00693000
BVTPUTOP EQU   BVT+12                                                   00694000
BVTPUTTP EQU   BVT+16                                                   00695000
BVTPUTVP EQU   BVT+20                                                   00696000
BVTPUTAP EQU   BVT+24                                                   00697000
BVTPRTTP EQU   BVT+28                                                   00698000
BVTPRTAP EQU   BVT+32                                                   00699000
BVTPUTDP EQU   BVT+36                                                   00700000
BVTMONP  EQU   BVT+40                                                   00701000
BVTMON2P EQU   BVT+44                                                   00702000
BVTVSARP EQU   BVT+48                                                   00703000
BVTVSENP EQU   BVT+64                                                   00704000
BVTVSERP EQU   BVT+68                                                   00705000
BVTVSGEP EQU   BVT+72                                                   00706000
BVTVSGUP EQU   BVT+76                                                   00707000
BVTVSPOP EQU   BVT+80                                                   00708000
BVTVSPUP EQU   BVT+84                                                   00709000
BVTMPKNP EQU   BVT+104                                                  00710000
BVTMONLP EQU   BVT+108                                                  00711000
BVTPUTCP EQU   BVT+132                                                  00712000
BVTMPK1P EQU   BVT+136                                                  00713000
BVTZZ2RP EQU   BVT+140                                                  00714000
BVTPGMRP EQU   BVT+144                                                  00715000
BVTMONAP EQU   BVT+148                                                  00716000
BVTBLDDP EQU   BVT+152                                                  00717000
BVTBLDLP EQU   BVT+156                                                  00718000
BVTPGMCP EQU   BVT+160                                                  00719000
BVTPGMDP EQU   BVT+164                                                  00720000
BVTPGMLP EQU   BVT+168                                                  00721000
BVTMONCP EQU   BVT+180                                                  00722000
BVTMONDP EQU   BVT+184                                                  00723000
BVTMONTP EQU   BVT+188                                                  00724000
BVTPARIP EQU   BVT+192                                                  00725000
BVTPARUP EQU   BVT+196                                                  00726000
BVTPRTNP EQU   BVT+204                                                  00727000
BVTVSCRP EQU   BVT+208                                                  00728000
BVTVSMRP EQU   BVT+212                                                  00729000
BVTMONXP EQU   BVT+216                                                  00730000
BVTTRMAP EQU   BVT+228                                                  00731000
BLSDMSGS EQU   0                                                        00732000
BLSDMSG0 EQU   0                                                        00733000
DVT      EQU   0                                                        00734000
DVTDEQPP EQU   DVT+8                                                    00735000
DVTENQPP EQU   DVT+12                                                   00736000
DVTAUTHP EQU   DVT+20                                                   00737000
DVTLPCLP EQU   DVT+24                                                   00738000
DVTBP00P EQU   DVT+28                                                   00739000
DVTDF00P EQU   DVT+36                                                   00740000
DVTDS00P EQU   DVT+44                                                   00741000
DVTFL00P EQU   DVT+48                                                   00742000
DVTFP00P EQU   DVT+52                                                   00743000
DVTGD00P EQU   DVT+56                                                   00744000
DVTGG00P EQU   DVT+60                                                   00745000
DVTGP00P EQU   DVT+64                                                   00746000
DVTND00P EQU   DVT+68                                                   00747000
DVTND01P EQU   DVT+72                                                   00748000
DVTOD00P EQU   DVT+76                                                   00749000
DVTPS00P EQU   DVT+80                                                   00750000
DVTSD00P EQU   DVT+84                                                   00751000
DVTSL00P EQU   DVT+88                                                   00752000
DVTTL00P EQU   DVT+92                                                   00753000
DVTUD00P EQU   DVT+96                                                   00754000
DVTUP00P EQU   DVT+100                                                  00755000
DVTLP00P EQU   DVT+104                                                  00756000
DVTLALLP EQU   DVT+108                                                  00757000
DVTLPFMP EQU   DVT+112                                                  00758000
DVTCLOSP EQU   DVT+116                                                  00759000
DVTOPENP EQU   DVT+120                                                  00760000
DVTPERAP EQU   DVT+124                                                  00761000
DVTDALLP EQU   DVT+128                                                  00762000
ANSLINE  EQU   0                                                        00763000
ANS      EQU   ANSLINE+4                                                00764000
MSGNR    EQU   0                                                        00765000
I015F    EQU   0                                                        00766000
BLSCALOC EQU   0                                                        00767000
BLSDADSD EQU   0                                                        00768000
BLSDAPDR EQU   0                                                        00769000
BLSDDEQP EQU   0                                                        00770000
BLSDENQP EQU   0                                                        00771000
BLSDENQ0 EQU   0                                                        00772000
BLSDFDSD EQU   0                                                        00773000
BLSDFPDR EQU   0                                                        00774000
BLSEAUTH EQU   0                                                        00775000
BLSELPCL EQU   0                                                        00776000
BLSELPFM EQU   0                                                        00777000
BLSFBP00 EQU   0                                                        00778000
BLSFCLOS EQU   0                                                        00779000
BLSFDALL EQU   0                                                        00780000
BLSFDF00 EQU   0                                                        00781000
BLSFDS00 EQU   0                                                        00782000
BLSFFL00 EQU   0                                                        00783000
BLSFFP00 EQU   0                                                        00784000
BLSFGD00 EQU   0                                                        00785000
BLSFGG00 EQU   0                                                        00786000
BLSFGP00 EQU   0                                                        00787000
BLSFLALL EQU   0                                                        00788000
BLSFLP00 EQU   0                                                        00789000
BLSFND00 EQU   0                                                        00790000
BLSFND01 EQU   0                                                        00791000
BLSFOD00 EQU   0                                                        00792000
BLSFOPEN EQU   0                                                        00793000
BLSFPERA EQU   0                                                        00794000
BLSFPS00 EQU   0                                                        00795000
BLSFSD00 EQU   0                                                        00796000
BLSFSL00 EQU   0                                                        00797000
BLSFTL00 EQU   0                                                        00798000
BLSFUD00 EQU   0                                                        00799000
BLSFUP00 EQU   0                                                        00800000
BLSUALLO EQU   0                                                        00801000
BLSUBLDD EQU   0                                                        00802000
BLSUBLDL EQU   0                                                        00803000
BLSUDYNA EQU   0                                                        00804000
BLSUFREE EQU   0                                                        00805000
BLSUFRE1 EQU   0                                                        00806000
BLSUMON  EQU   0                                                        00807000
BLSUMONA EQU   0                                                        00808000
BLSUMONC EQU   0                                                        00809000
BLSUMOND EQU   0                                                        00810000
BLSUMONL EQU   0                                                        00811000
BLSUMONT EQU   0                                                        00812000
BLSUMONX EQU   0                                                        00813000
BLSUMON2 EQU   0                                                        00814000
BLSUMPKN EQU   0                                                        00815000
BLSUMPK1 EQU   0                                                        00816000
BLSUPARI EQU   0                                                        00817000
BLSUPARU EQU   0                                                        00818000
BLSUPGMC EQU   0                                                        00819000
BLSUPGMD EQU   0                                                        00820000
BLSUPGML EQU   0                                                        00821000
BLSUPGMR EQU   0                                                        00822000
BLSUPRTA EQU   0                                                        00823000
BLSUPRTN EQU   0                                                        00824000
BLSUPRTT EQU   0                                                        00825000
BLSUPUTA EQU   0                                                        00826000
BLSUPUTC EQU   0                                                        00827000
BLSUPUTD EQU   0                                                        00828000
BLSUPUTL EQU   0                                                        00829000
BLSUPUTN EQU   0                                                        00830000
BLSUPUTO EQU   0                                                        00831000
BLSUPUTT EQU   0                                                        00832000
BLSUPUTV EQU   0                                                        00833000
BLSUSTAI EQU   0                                                        00834000
BLSUTRMA EQU   0                                                        00835000
BLSUTRMN EQU   0                                                        00836000
BLSUTRMO EQU   0                                                        00837000
BLSUTRMV EQU   0                                                        00838000
BLSUVSAR EQU   0                                                        00839000
BLSUVSCR EQU   0                                                        00840000
BLSUVSEN EQU   0                                                        00841000
BLSUVSER EQU   0                                                        00842000
BLSUVSGE EQU   0                                                        00843000
BLSUVSGU EQU   0                                                        00844000
BLSUVSMR EQU   0                                                        00845000
BLSUVSPO EQU   0                                                        00846000
BLSUVSPU EQU   0                                                        00847000
BLSUZZ2C EQU   0                                                        00848000
BLSUZZ2D EQU   0                                                        00849000
BLSUZZ2R EQU   0                                                        00850000
IKJEFF02 EQU   0                                                        00851000
IKJEFF18 EQU   0                                                        00852000
IKJEFF19 EQU   0                                                        00853000
IKJGETL  EQU   0                                                        00854000
IKJPARS  EQU   0                                                        00855000
IKJPTGT  EQU   0                                                        00856000
IKJPUTL  EQU   0                                                        00857000
IKJSCAN  EQU   0                                                        00858000
IKJSTCK  EQU   0                                                        00859000
I001C    EQU   0                                                        00860000
I008P    EQU   0                                                        00861000
I015P    EQU   0                                                        00862000
I031F    EQU   0                                                        00863000
I031P    EQU   0                                                        00864000
I256C    EQU   0                                                        00865000
ZZ2CB    EQU   0                                                        00866000
DEFMSGNR EQU   0                                                        00867000
CPPL     EQU   ZZ2CPPL                                                  00868000
CPPLUPT  EQU   CPPL+4                                                   00869000
CPPLPSCB EQU   CPPL+8                                                   00870000
CPPLECT  EQU   CPPL+12                                                  00871000
*                                      START UNREFERENCED COMPONENTS    00872000
CPPLCBUF EQU   CPPL                                                     00873000
@NM00070 EQU   ANSLINE                                                  00874000
DVT99999 EQU   DVT+256                                                  00875000
DVT0064P EQU   DVT+252                                                  00876000
DVT0063P EQU   DVT+248                                                  00877000
DVT0062P EQU   DVT+244                                                  00878000
DVT0061P EQU   DVT+240                                                  00879000
DVT0060P EQU   DVT+236                                                  00880000
DVT0059P EQU   DVT+232                                                  00881000
DVT0058P EQU   DVT+228                                                  00882000
DVT0057P EQU   DVT+224                                                  00883000
DVT0056P EQU   DVT+220                                                  00884000
DVT0055P EQU   DVT+216                                                  00885000
DVT0054P EQU   DVT+212                                                  00886000
DVT0053P EQU   DVT+208                                                  00887000
DVT0052P EQU   DVT+204                                                  00888000
DVT0051P EQU   DVT+200                                                  00889000
DVT0050P EQU   DVT+196                                                  00890000
DVT0049P EQU   DVT+192                                                  00891000
DVT0048P EQU   DVT+188                                                  00892000
DVT0047P EQU   DVT+184                                                  00893000
DVT0046P EQU   DVT+180                                                  00894000
DVT0045P EQU   DVT+176                                                  00895000
DVT0044P EQU   DVT+172                                                  00896000
DVT0043P EQU   DVT+168                                                  00897000
DVT0042P EQU   DVT+164                                                  00898000
DVT0041P EQU   DVT+160                                                  00899000
DVT0040P EQU   DVT+156                                                  00900000
DVT0039P EQU   DVT+152                                                  00901000
DVT0038P EQU   DVT+148                                                  00902000
DVT0037P EQU   DVT+144                                                  00903000
DVT0036P EQU   DVT+140                                                  00904000
DVT0035P EQU   DVT+136                                                  00905000
DVT0034P EQU   DVT+132                                                  00906000
DVT0011P EQU   DVT+40                                                   00907000
DVTCN00P EQU   DVT+32                                                   00908000
DVT0005P EQU   DVT+16                                                   00909000
DVT0002P EQU   DVT+4                                                    00910000
DVT0001P EQU   DVT                                                      00911000
BVT99999 EQU   BVT+256                                                  00912000
BVT0064P EQU   BVT+252                                                  00913000
BVT0063P EQU   BVT+248                                                  00914000
BVT0062P EQU   BVT+244                                                  00915000
BVT0061P EQU   BVT+240                                                  00916000
BVT0060P EQU   BVT+236                                                  00917000
BVT0059P EQU   BVT+232                                                  00918000
BVT0057P EQU   BVT+224                                                  00919000
BVT0056P EQU   BVT+220                                                  00920000
BVTSTBLP EQU   BVT+200                                                  00921000
BVT0045P EQU   BVT+176                                                  00922000
BVT0044P EQU   BVT+172                                                  00923000
BVT0033P EQU   BVT+128                                                  00924000
BVT0032P EQU   BVT+124                                                  00925000
BVT0031P EQU   BVT+120                                                  00926000
BVT0030P EQU   BVT+116                                                  00927000
BVT0029P EQU   BVT+112                                                  00928000
BVT0026P EQU   BVT+100                                                  00929000
BVT0025P EQU   BVT+96                                                   00930000
BVT0024P EQU   BVT+92                                                   00931000
BVT0023P EQU   BVT+88                                                   00932000
BVT0016P EQU   BVT+60                                                   00933000
BVT0015P EQU   BVT+56                                                   00934000
BVT0014P EQU   BVT+52                                                   00935000
BVT0003P EQU   BVT+8                                                    00936000
BVT0001P EQU   BVT                                                      00937000
SA99     EQU   SA+72                                                    00938000
SARC     EQU   SAR+56                                                   00939000
SARB     EQU   SAR+52                                                   00940000
SARA     EQU   SAR+48                                                   00941000
SAR9     EQU   SAR+44                                                   00942000
SAR8     EQU   SAR+40                                                   00943000
SAR7     EQU   SAR+36                                                   00944000
SAR6     EQU   SAR+32                                                   00945000
SAR5     EQU   SAR+28                                                   00946000
SAR4     EQU   SAR+24                                                   00947000
SAR3     EQU   SAR+20                                                   00948000
SAR2     EQU   SAR+16                                                   00949000
SAR1     EQU   SAR+12                                                   00950000
SAR0     EQU   SAR+8                                                    00951000
SARF     EQU   SAR+4                                                    00952000
SARE     EQU   SAR                                                      00953000
SAFWD    EQU   SA+8                                                     00954000
SABAK    EQU   SA+4                                                     00955000
SA1L     EQU   SA1+1                                                    00956000
SA1P     EQU   SA1                                                      00957000
UPTPREFL EQU   UPT+23                                                   00958000
UPTPREFX EQU   UPT+16                                                   00959000
@NM00069 EQU   UPT+15                                                   00960000
UPTLDEL  EQU   UPT+14                                                   00961000
UPTCDEL  EQU   UPT+13                                                   00962000
UPTWTP   EQU   UPTSWS                                                   00963000
UPTMODE  EQU   UPTSWS                                                   00964000
UPTALD   EQU   UPTSWS                                                   00965000
UPTPAUS  EQU   UPTSWS                                                   00966000
UPTNCOM  EQU   UPTSWS                                                   00967000
UPTMID   EQU   UPTSWS                                                   00968000
UPTNPRM  EQU   UPTSWS                                                   00969000
UPTRCVR  EQU   UPTSWS                                                   00970000
UPTUSER  EQU   UPT+2                                                    00971000
@NM00068 EQU   UPT                                                      00972000
@NM00067 EQU   ECT+52                                                   00973000
@NM00066 EQU   ECT+48                                                   00974000
@NM00065 EQU   ECT+44                                                   00975000
@NM00064 EQU   ECTSWS2+1                                                00976000
@NM00063 EQU   ECTSWS21                                                 00977000
ECTTABND EQU   ECTSWS21                                                 00978000
ECTDEFCS EQU   ECTSWS21                                                 00979000
ECTBKPB  EQU   ECT+36                                                   00980000
ECTUSER  EQU   ECT+32                                                   00981000
ECTDDNUM EQU   ECT+29                                                   00982000
ECTATTN  EQU   ECTSWS                                                   00983000
ECTBKGRD EQU   ECTSWS                                                   00984000
ECTNNOT  EQU   ECTSWS                                                   00985000
ECTNMAL  EQU   ECTSWS                                                   00986000
ECTLOGF  EQU   ECTSWS                                                   00987000
ECTATRM  EQU   ECTSWS                                                   00988000
@NM00062 EQU   ECTSWS                                                   00989000
ECTNOPD  EQU   ECTSWS                                                   00990000
ECTSCMD  EQU   ECT+20                                                   00991000
ECTPCMD  EQU   ECT+12                                                   00992000
ECTSMSG  EQU   ECT+9                                                    00993000
ECTMSGF  EQU   ECT+8                                                    00994000
ECTIOWA  EQU   ECT+4                                                    00995000
ECTRTCD  EQU   ECT+1                                                    00996000
ECTRCDF  EQU   ECT                                                      00997000
PSCBU    EQU   PSCB+64                                                  00998000
PSCBRSZ  EQU   PSCB+60                                                  00999000
PSCBLINE EQU   PSCB+59                                                  01000000
PSCBCHAR EQU   PSCB+58                                                  01001000
PSCBUPTL EQU   PSCB+56                                                  01002000
PSCBUPT  EQU   PSCB+52                                                  01003000
PSCBRLGB EQU   PSCB+48                                                  01004000
PSCBDEST EQU   PSCB+40                                                  01005000
@NM00061 EQU   PSCB+36                                                  01006000
@NM00060 EQU   PSCB+32                                                  01007000
@NM00059 EQU   PSCB+28                                                  01008000
PSCBLTI2 EQU   PSCB+24                                                  01009000
PSCBLTIM EQU   PSCB+20                                                  01010000
PSCBATR2 EQU   PSCB+18                                                  01011000
@NM00058 EQU   PSCBATR1                                                 01012000
@NM00057 EQU   PSCBATR1                                                 01013000
@NM00056 EQU   PSCBATR1                                                 01014000
PSCBATTN EQU   PSCBATR1                                                 01015000
PSCBVMNT EQU   PSCBATR1                                                 01016000
PSCBJCL  EQU   PSCBATR1                                                 01017000
PSCBACCT EQU   PSCBATR1                                                 01018000
PSCBCTRL EQU   PSCBATR1                                                 01019000
PSCBGPNM EQU   PSCB+8                                                   01020000
PSCBUSRL EQU   PSCB+7                                                   01021000
PSCBUSER EQU   PSCB                                                     01022000
CMDT1    EQU   CMDT                                                     01023000
CMDO     EQU   CMD+2                                                    01024000
CMDL     EQU   CMD                                                      01025000
ZZ299999 EQU   ZZ2+8192                                                 01026000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  01027000
ZZ2AXOL  EQU   ZZ2AXO                                                   01028000
@NM00055 EQU   ZZ2+7288                                                 01029000
@NM00054 EQU   ZZ2AMDX+4                                                01030000
ZZ2AMDXC EQU   ZZ2AMDX                                                  01031000
ZZ2HSD   EQU   ZZ2+3056                                                 01032000
@NM00053 EQU   ZZ2ES                                                    01033000
@NM00052 EQU   ZZ2+2868                                                 01034000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                01035000
@NM00051 EQU   ZZ2ITSE                                                  01036000
ZZ2ITSEP EQU   ZZ2ITSE                                                  01037000
ZZ2ITSEW EQU   ZZ2ITSE                                                  01038000
@NM00050 EQU   ZZ2ITR+20                                                01039000
ZZ2ITREC EQU   ZZ2ITRE+1                                                01040000
@NM00049 EQU   ZZ2ITRE                                                  01041000
ZZ2ITREP EQU   ZZ2ITRE                                                  01042000
ZZ2ITREW EQU   ZZ2ITRE                                                  01043000
@NM00048 EQU   ZZ2ITR+9                                                 01044000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 01045000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 01046000
ZZ2ITRPP EQU   ZZ2ITR                                                   01047000
@NM00047 EQU   ZZ2+1544                                                 01048000
ZZ2PGM   EQU   ZZ2+1536                                                 01049000
@NM00046 EQU   ZZ2+1526                                                 01050000
ZZ2CW    EQU   ZZ2+1524                                                 01051000
@NM00045 EQU   ZZ2+1504                                                 01052000
@NM00044 EQU   ZZ2+1352                                                 01053000
ZZ2FFSYP EQU   ZZ2+1348                                                 01054000
ZZ2SASYP EQU   ZZ2+1344                                                 01055000
ZZ2RDSYP EQU   ZZ2+1340                                                 01056000
ZZ2RASYP EQU   ZZ2+1336                                                 01057000
ZZ2PHSYP EQU   ZZ2+1332                                                 01058000
ZZ2ESSYP EQU   ZZ2+1328                                                 01059000
ZZ200SYP EQU   ZZ2+1324                                                 01060000
ZZ2SCWP  EQU   ZZ2+1320                                                 01061000
ZZ2TTLP  EQU   ZZ2+1316                                                 01062000
ZZ2LOADP EQU   ZZ2+1312                                                 01063000
ZZ2VRESP EQU   ZZ2+1308                                                 01064000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               01065000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                01066000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                01067000
ZZ2VRSAP EQU   ZZ2+1288                                                 01068000
ZZ2RVTP  EQU   ZZ2+1284                                                 01069000
@NM00043 EQU   ZZ2+1272                                                 01070000
@NM00042 EQU   ZZ2+1268                                                 01071000
ZZ2RPLP  EQU   ZZ2+1260                                                 01072000
ZZ2TCBP  EQU   ZZ2+1256                                                 01073000
@NM00041 EQU   ZZ2+1252                                                 01074000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 01075000
@NM00040 EQU   ZZ2+1112                                                 01076000
@NM00039 EQU   ZZ2+1080                                                 01077000
ZZ2FT25P EQU   ZZ2+1072                                                 01078000
@NM00038 EQU   ZZ2+976                                                  01079000
ZZ2TOD   EQU   ZZ2+968                                                  01080000
ZZ2STGN  EQU   ZZ2STG+4                                                 01081000
ZZ2STGP  EQU   ZZ2STG                                                   01082000
@NM00037 EQU   ZZ2+952                                                  01083000
ZZ2SCMDE EQU   ZZ2+944                                                  01084000
ZZ2SCMDN EQU   ZZ2+936                                                  01085000
ZZ2IDENT EQU   ZZ2+928                                                  01086000
ZZ2A9999 EQU   ZZ2A+656                                                 01087000
@NM00036 EQU   ZZ2A+224                                                 01088000
@NM00035 EQU   ZZ2A+220                                                 01089000
ZZ2AQD99 EQU   ZZ2AQD+60                                                01090000
@NM00034 EQU   ZZ2AQD+56                                                01091000
@NM00033 EQU   ZZ2AQDF                                                  01092000
ZZ2AQDFA EQU   ZZ2AQDF                                                  01093000
ZZ2AQDIL EQU   ZZ2AQD+48                                                01094000
ZZ2AQDIM EQU   ZZ2AQD+44                                                01095000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               01096000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               01097000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                01098000
@NM00032 EQU   ZZ2AQDT+1                                                01099000
ZZ2AQDTY EQU   ZZ2AQDT                                                  01100000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  01101000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 01102000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 01103000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 01104000
ZZ2AQDOF EQU   ZZ2AQD                                                   01105000
ZZ2AQD00 EQU   ZZ2AQD                                                   01106000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               01107000
@NM00031 EQU   ZZ2AQAS+12                                               01108000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                01109000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                01110000
@NM00030 EQU   ZZ2AQAS+2                                                01111000
ZZ2AQAST EQU   ZZ2AQAS                                                  01112000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  01113000
ZZ2AZZ6P EQU   ZZ2A+140                                                 01114000
ZZ2ADPTA EQU   ZZ2ADPT                                                  01115000
ZZ2ADPL  EQU   ZZ2ADP                                                   01116000
ZZ2ADMTA EQU   ZZ2ADMT                                                  01117000
ZZ2ADML  EQU   ZZ2ADM                                                   01118000
ZZ2ADDTA EQU   ZZ2ADDT                                                  01119000
ZZ2ADDL  EQU   ZZ2ADD                                                   01120000
@NM00029 EQU   ZZ2A+72                                                  01121000
ZZ2APIDB EQU   ZZ2APID+3                                                01122000
ZZ2APIDA EQU   ZZ2APID                                                  01123000
@NM00028 EQU   ZZ2A+24                                                  01124000
@NM00027 EQU   ZZ2AF+5                                                  01125000
ZZ2AFX   EQU   ZZ2AF+5                                                  01126000
@NM00026 EQU   ZZ2AF+3                                                  01127000
ZZ2AFS   EQU   ZZ2AF+2                                                  01128000
ZZ2AFD   EQU   ZZ2AF+2                                                  01129000
ZZ2AFQ   EQU   ZZ2AF+2                                                  01130000
ZZ2AF$   EQU   ZZ2AF+2                                                  01131000
@NM00025 EQU   ZZ2AF+2                                                  01132000
ZZ2AFM   EQU   ZZ2AF+2                                                  01133000
@NM00024 EQU   ZZ2AF+2                                                  01134000
@NM00023 EQU   ZZ2AF+1                                                  01135000
ZZ2AFV   EQU   ZZ2AF+1                                                  01136000
@NM00022 EQU   ZZ2AF+1                                                  01137000
ZZ2AFC   EQU   ZZ2AF+1                                                  01138000
@NM00021 EQU   ZZ2AF                                                    01139000
ZZ2AFFS  EQU   ZZ2AF                                                    01140000
ZZ2AFT   EQU   ZZ2AF                                                    01141000
ZZ2AFP   EQU   ZZ2AF                                                    01142000
@NM00020 EQU   ZZ2A+8                                                   01143000
ZZ2ALINE EQU   ZZ2A+4                                                   01144000
@NM00019 EQU   ZZ2A+3                                                   01145000
ZZ2ASE   EQU   ZZ2A+2                                                   01146000
ZZ2ACH   EQU   ZZ2A                                                     01147000
@NM00018 EQU   ZZ2+264                                                  01148000
@NM00017 EQU   ZZ2+263                                                  01149000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  01150000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 01151000
ZZ2PRTL  EQU   ZZ2PRT                                                   01152000
@NM00016 EQU   ZZ2AMD+56                                                01153000
ZZ2AMDXP EQU   ZZ2AMD+52                                                01154000
ZZ2AMDD  EQU   ZZ2AMD+48                                                01155000
ZZ2AMDL  EQU   ZZ2AMD+44                                                01156000
ZZ2AMDU  EQU   ZZ2AMD+28                                                01157000
ZZ2AMDF  EQU   ZZ2AMD+24                                                01158000
ZZ2AMDS  EQU   ZZ2AMD+20                                                01159000
ZZ2AMDC  EQU   ZZ2AMD+16                                                01160000
ZZ2AMDP  EQU   ZZ2AMD+12                                                01161000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 01162000
@NM00015 EQU   @NM00014                                                 01163000
ZZ2AMD2  EQU   @NM00014                                                 01164000
ZZ2AMD1  EQU   @NM00014                                                 01165000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 01166000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 01167000
ZZ2AMDT  EQU   ZZ2AMD                                                   01168000
ZZ199999 EQU   ZZ1+3072                                                 01169000
@NM00013 EQU   ZZ1+2160                                                 01170000
ZZ1TRTAS EQU   ZZ1+1904                                                 01171000
ZZ1TRUPC EQU   ZZ1+1648                                                 01172000
ZZ1TRCTX EQU   ZZ1+1392                                                 01173000
ZZ1NASID EQU   ZZ1N+274                                                 01174000
ZZ1NSTRL EQU   ZZ1N+272                                                 01175000
ZZ1NOFF  EQU   ZZ1N+268                                                 01176000
ZZ1NBDY  EQU   ZZ1N+264                                                 01177000
ZZ1NADE  EQU   ZZ1N+260                                                 01178000
ZZ1NADB  EQU   ZZ1N+256                                                 01179000
ZZ1NSTR  EQU   ZZ1N                                                     01180000
@NM00012 EQU   ZZ1+1080                                                 01181000
ZZ1TREBC EQU   ZZ1+824                                                  01182000
ZZ1TRHEX EQU   ZZ1+568                                                  01183000
@NM00011 EQU   ZZ1+377                                                  01184000
ZZ1USTAE EQU   ZZ1+376                                                  01185000
@NM00010 EQU   ZZ1F+1                                                   01186000
@NM00009 EQU   ZZ1F                                                     01187000
ZZ1FM    EQU   ZZ1F                                                     01188000
ZZ1FX    EQU   ZZ1F                                                     01189000
ZZ1FU    EQU   ZZ1F                                                     01190000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 01191000
@NM00008 EQU   ZZ1EVE                                                   01192000
ZZ1EVEW  EQU   ZZ1EVE                                                   01193000
ZZ1ACMP  EQU   ZZ1ATTN                                                  01194000
@NM00007 EQU   ZZ1+144                                                  01195000
ZZ1FPP   EQU   ZZ1+140                                                  01196000
ZZ1ZZ6P  EQU   ZZ1+136                                                  01197000
@NM00006 EQU   ZZ1+84                                                   01198000
ZZ1PLINE EQU   ZZ1+80                                                   01199000
ZZ1PGSZ  EQU   ZZ1+76                                                   01200000
ZZ1PCNT  EQU   ZZ1+72                                                   01201000
@NM00005 EQU   ZZ1+68                                                   01202000
ZZ1TPAGE EQU   ZZ1+64                                                   01203000
ZZ1TLINE EQU   ZZ1+60                                                   01204000
@NM00004 EQU   ZZ1+52                                                   01205000
ZZ1DMCBP EQU   ZZ1+48                                                   01206000
ZZ1DSDP  EQU   ZZ1+44                                                   01207000
ZZ1PDRP  EQU   ZZ1+40                                                   01208000
ZZ1ZZ2P  EQU   ZZ1+36                                                   01209000
ZZ1327WP EQU   ZZ1+32                                                   01210000
ZZ1ACBP  EQU   ZZ1+28                                                   01211000
@NM00003 EQU   ZZ1+24                                                   01212000
ZZ1PDCBP EQU   ZZ1+20                                                   01213000
ZZ1BLRBL EQU   ZZ1+16                                                   01214000
@NM00002 EQU   ZZ1+12                                                   01215000
ZZ1PNULL EQU   ZZ1+8                                                    01216000
ZZ1NULL  EQU   ZZ1+4                                                    01217000
ZZ1IDE   EQU   ZZ1                                                      01218000
MSGWNXT  EQU   MSGWENT                                                  01219000
MSGDTXT  EQU   MSGDMOV+4                                                01220000
MSGDPAD  EQU   MSGDMOV+2                                                01221000
MSGDLEN  EQU   MSGDMOV                                                  01222000
MSGDNXT  EQU   MSGDWRT                                                  01223000
MSGDBAK  EQU   MSGDPRF+4                                                01224000
MSGDFLEN EQU   MSGDPRF+1                                                01225000
MSGDSPID EQU   MSGDPRF                                                  01226000
@NM00001 EQU   PGPB                                                     01227000
*                                      END UNREFERENCED COMPONENTS      01228000
@RC00157 EQU   @RC00151                                                 01229000
@RC00196 EQU   @EL00002                                                 01230000
@RC00206 EQU   @RC00196                                                 01231000
@RC00218 EQU   @RC00206                                                 01232000
@RC00213 EQU   @RC00206                                                 01233000
@RC00208 EQU   @RC00206                                                 01234000
@ENDDATA EQU   *                                                        01235000
         END   BLSFCN00,(C'PLS1518',0701,78065)                         01236000
