         TITLE 'BLSFBP00-BUILD PDR DS RECORD                           *00001000
                        '                                               00002000
*          /*        CHANGE ACTIVITY         */                         00003000
*  THIS MODULE IS WRITTEN FOR @G57LPRM                                  00004000
BLSFBP00 CSECT ,                                                01S0002 00005000
@MAINENT DS    0H                                               01S0002 00006000
         USING *,@15                                            01S0002 00007000
         B     @PROLOG                                          01S0002 00008000
         DC    AL1(16)                                          01S0002 00009000
         DC    C'BLSFBP00  78.065'                              01S0002 00010000
         DROP  @15                                                      00011000
@PROLOG  STM   @14,@12,12(@13)                                  01S0002 00012000
         BALR  @12,0                                            01S0002 00013000
@PSTART  DS    0H                                               01S0002 00014000
         USING @PSTART,@12                                      01S0002 00015000
         L     @00,@SIZDATD                                     01S0002 00016000
         BLSUALLS R,LV=(0)                                              00017000
         LR    @11,@01                                          01S0002 00018000
         USING @DATD,@11                                        01S0002 00019000
         ST    @13,@SA00001+4                                   01S0002 00020000
         LM    @00,@01,20(@13)                                  01S0002 00021000
         ST    @11,8(,@13)                                      01S0002 00022000
         LR    @13,@11                                          01S0002 00023000
         MVC   @PC00001(24),0(@01)                              01S0002 00024000
*                                                               01S0123 00025000
*/* ***********************************************************      */ 00026000
*/*                                                                  */ 00027000
*/*               START OF DEFAULT PROCESSING                        */ 00028000
*/*                                                                  */ 00029000
*/* ***********************************************************      */ 00030000
*                                                               01S0123 00031000
*   ZZ2PTR=ADDR(ZZ2CB);             /* GET TASK VARIABLE ADDR        */ 00032000
         L     ZZ2PTR,@PC00001                                  01S0123 00033000
*   RETC=ZERO;                      /* INITIALIZE THE RETC           */ 00034000
         SLR   RETC,RETC                                        01S0124 00035000
*/* ***********************************************************      */ 00036000
*/*                                                                  */ 00037000
*/*        START OF MODULE PROCESSING                                */ 00038000
*/*                                                                  */ 00039000
*/* ***********************************************************      */ 00040000
*                                                               01S0125 00041000
*   RESPECIFY                                                   01S0125 00042000
*     PDREC BASED(ADDR(DSRECPDR));  /* ESTABLISH AREA FOR PDR        */ 00043000
*                                                               01S0125 00044000
*   /*****************************************************************/ 00045000
*   /*                                                               */ 00046000
*   /* CHECK IF THE USER HAS ATTEMPTED TO INTERRUPT COMMAND          */ 00047000
*   /*                                                               */ 00048000
*   /*****************************************************************/ 00049000
*                                                               01S0126 00050000
*   IF ZZ1EVEP='0'B THEN            /* HAS THE USER REQUESTED   01S0126 00051000
*                                      TERMINATION?                  */ 00052000
         L     @10,ZZ2ZZ1P(,ZZ2PTR)                             01S0126 00053000
         TM    ZZ1EVEP(@10),B'01000000'                         01S0126 00054000
         BNZ   @RF00126                                         01S0126 00055000
*     DO;                           /* NO, BUILD PDR DS RECORD       */ 00056000
*                                                               01S0127 00057000
*       /*************************************************************/ 00058000
*       /*                                                           */ 00059000
*       /* BUILD PDR DS RECORD KEY                                   */ 00060000
*       /*                                                           */ 00061000
*       /*************************************************************/ 00062000
*                                                               01S0128 00063000
*       PDRKRCTY=PDRDSNC;           /* DATA SET RECORD TYPE          */ 00064000
         L     @10,@PC00001+20                                  01S0128 00065000
         MVC   PDRKRCTY(2,@10),@CC00205                         01S0128 00066000
*       PDRKPID=CURPID;             /* PDR PROBLEM ID                */ 00067000
         L     @03,@PC00001+4                                   01S0129 00068000
         MVC   PDRKPID(8,@10),CURPID(@03)                       01S0129 00069000
*       PDRRECSQ=CURSEQ;            /* SEQ NUMBER FOR THIS RECORD    */ 00070000
         L     @03,@PC00001+8                                   01S0130 00071000
         MVC   PDRRECSQ(4,@10),CURSEQ(@03)                      01S0130 00072000
*       PDRRESV=PDRRESV&&PDRRESV;   /* CLEAR OUT RESERVE AREAS       */ 00073000
         XC    PDRRESV(2,@10),PDRRESV(@10)                      01S0131 00074000
*       PDRDSN=CURDSN;              /* CURRENT DSN                   */ 00075000
         L     @03,@PC00001+12                                  01S0132 00076000
         MVC   PDRDSN(44,@10),CURDSN(@03)                       01S0132 00077000
*       PDRMEMB=CURMEM;             /* CURRENT MEMBER                */ 00078000
         L     @03,@PC00001+16                                  01S0133 00079000
         MVC   PDRMEMB(8,@10),CURMEM(@03)                       01S0133 00080000
*       PDRDSRES=PDRDSRES&&PDRDSRES;/* ZERO RESERVED FIELD           */ 00081000
         XC    PDRDSRES(12,@10),PDRDSRES(@10)                   01S0134 00082000
*     END;                          /* END OF BUILD PDR DS RECORD    */ 00083000
*   ELSE                            /* YES, RETURN WITH TERMINATION     00084000
*                                      REQUEST                       */ 00085000
*     RETC=TWELVE;                  /* TERMINATION REQUESTED         */ 00086000
         B     @RC00126                                         01S0136 00087000
@RF00126 LA    RETC,12                                          01S0136 00088000
*   RETURN CODE(RETC);              /* RETURN TO USER                */ 00089000
@RC00126 L     @13,4(,@13)                                      01S0137 00090000
         L     @00,@SIZDATD                                     01S0137 00091000
         LR    @01,@11                                          01S0137 00092000
         BLSUFRES R,LV=(0),A=(1)                                        00093000
         LR    @15,@02                                          01S0137 00094000
         L     @14,12(,@13)                                     01S0137 00095000
         LM    @00,@12,20(@13)                                  01S0137 00096000
         BR    @14                                              01S0137 00097000
*/*BLSUPEND--MVS IPCS MODULE                                         */ 00098000
*                                                               01S0138 00099000
*   DECLARE                         /* COMMON VARIABLES              */ 00100000
*     I256C CHAR(256) BASED,                                    01S0138 00101000
*     I031F FIXED(31) BASED,                                    01S0138 00102000
*     I031P PTR(31) BASED,                                      01S0138 00103000
*     I015F FIXED(15) BASED,                                    01S0138 00104000
*     I015P PTR(15) BASED,                                      01S0138 00105000
*     I008P PTR(8) BASED,                                       01S0138 00106000
*     I001C CHAR(1) BASED;                                      01S0138 00107000
*   GENERATE NODEFS NOREFS DATA;                                01S0139 00108000
*   END                             /* BLRPEND END OF PROCESSING     */ 00109000
*                                                               01S0140 00110000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00111000
*/*%INCLUDE SYSLIB  (BLSPDR  )                                       */ 00112000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00113000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00114000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00115000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00116000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00117000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00118000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00119000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00120000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00121000
*/*%INCLUDE SYSLIB  (BLSDSERV)                                       */ 00122000
*                                                               01S0140 00123000
*       ;                                                       01S0140 00124000
@EL00001 L     @13,4(,@13)                                      01S0140 00125000
@EF00001 L     @00,@SIZDATD                                     01S0140 00126000
         LR    @01,@11                                          01S0140 00127000
         BLSUFRES R,LV=(0),A=(1)                                        00128000
@ER00001 LM    @14,@12,12(@13)                                  01S0140 00129000
         BR    @14                                              01S0140 00130000
@DATA    DS    0H                                                       00131000
@DATD    DSECT                                                          00132000
         DS    0F                                                       00133000
@SA00001 DS    18F                                                      00134000
@PC00001 DS    6F                                                       00135000
BLSFBP00 CSECT                                                          00136000
         DS    0F                                                       00137000
@DATD    DSECT                                                          00138000
         DS    0D                                                       00139000
BLSFBP00 CSECT                                                          00140000
         DS    0F                                                       00141000
@SIZDATD DC    AL1(0)                                                   00142000
         DC    AL3(@ENDDATD-@DATD)                                      00143000
         DS    0D                                                       00144000
@CC00205 DC    C'DS'                                                    00145000
@DATD    DSECT                                                          00146000
         SPACE 2                                                        00147000
*********************************************************************** 00148000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00149000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 00150000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 00151000
*********************************************************************** 00152000
         SPACE                                                          00153000
BLSFBP00 CSECT                                                          00154000
         ORG                                                            00155000
         DS    0D                                                       00156000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSFBP00+19)/20+7)/8)CL8'BLSFBP00'     00157000
@DATD    DSECT                                                          00158000
         SPACE 2                                                        00159000
*********************************************************************** 00160000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 00161000
*********************************************************************** 00162000
         SPACE                                                          00163000
         DS    0D                                                       00164000
@DATD    DSECT                                                          00165000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00166000
@ENDDATD EQU   *                                                        00167000
BLSFBP00 CSECT                                                          00168000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00169000
@01      EQU   01                                                       00170000
@02      EQU   02                                                       00171000
@03      EQU   03                                                       00172000
@04      EQU   04                                                       00173000
@05      EQU   05                                                       00174000
@06      EQU   06                                                       00175000
@07      EQU   07                                                       00176000
@08      EQU   08                                                       00177000
@09      EQU   09                                                       00178000
@10      EQU   10                                                       00179000
@11      EQU   11                                                       00180000
@12      EQU   12                                                       00181000
@13      EQU   13                                                       00182000
@14      EQU   14                                                       00183000
@15      EQU   15                                                       00184000
RETC     EQU   @02                                                      00185000
ZZ2PTR   EQU   @03                                                      00186000
R0       EQU   @00                                                      00187000
R1       EQU   @01                                                      00188000
R2       EQU   @02                                                      00189000
R3       EQU   @03                                                      00190000
R4       EQU   @04                                                      00191000
R5       EQU   @05                                                      00192000
R9       EQU   @09                                                      00193000
RB       EQU   @11                                                      00194000
RD       EQU   @13                                                      00195000
RE       EQU   @14                                                      00196000
RF       EQU   @15                                                      00197000
RA       EQU   @10                                                      00198000
RC       EQU   @12                                                      00199000
R6       EQU   @06                                                      00200000
R7       EQU   @07                                                      00201000
R8       EQU   @08                                                      00202000
PDREC    EQU   0                                                        00203000
PDRKEY   EQU   PDREC                                                    00204000
PDRGRP   EQU   PDRKEY                                                   00205000
PDRKRCTY EQU   PDRGRP                                                   00206000
PDRKPID  EQU   PDRGRP+2                                                 00207000
PDRRECSQ EQU   PDRKEY+10                                                00208000
PDRRESV  EQU   PDREC+14                                                 00209000
PDRINFO  EQU   PDREC+16                                                 00210000
ZZ1      EQU   0                                                        00211000
ZZ1ATTN  EQU   ZZ1+360                                                  00212000
ZZ1EVE   EQU   ZZ1ATTN+4                                                00213000
ZZ1EVEP  EQU   ZZ1EVE                                                   00214000
ZZ1F     EQU   ZZ1+368                                                  00215000
ZZ1N     EQU   ZZ1+1116                                                 00216000
ZZ2      EQU   0                                                        00217000
ZZ2AMD   EQU   ZZ2                                                      00218000
@NM00013 EQU   ZZ2AMD+7                                                 00219000
ZZ2PRT   EQU   ZZ2+138                                                  00220000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 00221000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                00222000
ZZ2A     EQU   ZZ2+272                                                  00223000
ZZ2AF    EQU   ZZ2A+16                                                  00224000
ZZ2APID  EQU   ZZ2A+64                                                  00225000
ZZ2AD    EQU   ZZ2A+74                                                  00226000
ZZ2ADD   EQU   ZZ2AD                                                    00227000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 00228000
ZZ2ADM   EQU   ZZ2AD+46                                                 00229000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 00230000
ZZ2ADP   EQU   ZZ2AD+56                                                 00231000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 00232000
ZZ2AQAS  EQU   ZZ2A+144                                                 00233000
ZZ2AQD   EQU   ZZ2A+160                                                 00234000
ZZ2AQDT  EQU   ZZ2AQD+10                                                00235000
ZZ2AQDF  EQU   ZZ2AQD+52                                                00236000
ZZ2STG   EQU   ZZ2+960                                                  00237000
ZZ2ALLOP EQU   ZZ2+992                                                  00238000
ZZ2FREEP EQU   ZZ2+996                                                  00239000
ZZ2FF19P EQU   ZZ2+1000                                                 00240000
ZZ2FRE1P EQU   ZZ2+1004                                                 00241000
ZZ2FF18P EQU   ZZ2+1008                                                 00242000
ZZ2DYNAP EQU   ZZ2+1012                                                 00243000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 00244000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 00245000
ZZ2STAIP EQU   ZZ2+1024                                                 00246000
ZZ2FF02P EQU   ZZ2+1028                                                 00247000
ZZ2GETLP EQU   ZZ2+1032                                                 00248000
ZZ2PARSP EQU   ZZ2+1036                                                 00249000
ZZ2PTGTP EQU   ZZ2+1040                                                 00250000
ZZ2PUTLP EQU   ZZ2+1044                                                 00251000
ZZ2SCANP EQU   ZZ2+1048                                                 00252000
ZZ2STCKP EQU   ZZ2+1052                                                 00253000
ZZ2ALOCP EQU   ZZ2+1056                                                 00254000
ZZ2MSGSP EQU   ZZ2+1060                                                 00255000
ZZ2TRMOP EQU   ZZ2+1064                                                 00256000
ZZ2TRMVP EQU   ZZ2+1068                                                 00257000
ZZ2MSG0P EQU   ZZ2+1076                                                 00258000
ZZ2PUTNP EQU   ZZ2+1084                                                 00259000
ZZ2TRMNP EQU   ZZ2+1088                                                 00260000
ZZ2ENQ0P EQU   ZZ2+1092                                                 00261000
ZZ2ADSDP EQU   ZZ2+1096                                                 00262000
ZZ2APDRP EQU   ZZ2+1100                                                 00263000
ZZ2FDSDP EQU   ZZ2+1104                                                 00264000
ZZ2FPDRP EQU   ZZ2+1108                                                 00265000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 00266000
ZZ2DVTP  EQU   ZZ2+1276                                                 00267000
ZZ2BVTP  EQU   ZZ2+1280                                                 00268000
ZZ2CPPL  EQU   ZZ2+1292                                                 00269000
ZZ2CPPLC EQU   ZZ2CPPL                                                  00270000
ZZ2ITR   EQU   ZZ2+2840                                                 00271000
ZZ2ITRE  EQU   ZZ2ITR+16                                                00272000
ZZ2ITSE  EQU   ZZ2+2864                                                 00273000
ZZ2ES    EQU   ZZ2+2872                                                 00274000
ZZ2AMDX  EQU   ZZ2+7160                                                 00275000
ZZ2AXO   EQU   ZZ2+7934                                                 00276000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 00277000
CMD      EQU   0                                                        00278000
CMDT     EQU   CMD+4                                                    00279000
PSCB     EQU   0                                                        00280000
PSCBATR1 EQU   PSCB+16                                                  00281000
ECT      EQU   0                                                        00282000
ECTSWS   EQU   ECT+28                                                   00283000
ECTSWS2  EQU   ECT+40                                                   00284000
ECTSWS21 EQU   ECTSWS2                                                  00285000
UPT      EQU   0                                                        00286000
UPTSWS   EQU   UPT+12                                                   00287000
SA       EQU   0                                                        00288000
SA1      EQU   SA                                                       00289000
SAR      EQU   SA+12                                                    00290000
BVT      EQU   0                                                        00291000
BVTPUTLP EQU   BVT+4                                                    00292000
BVTPUTOP EQU   BVT+12                                                   00293000
BVTPUTTP EQU   BVT+16                                                   00294000
BVTPUTVP EQU   BVT+20                                                   00295000
BVTPUTAP EQU   BVT+24                                                   00296000
BVTPRTTP EQU   BVT+28                                                   00297000
BVTPRTAP EQU   BVT+32                                                   00298000
BVTPUTDP EQU   BVT+36                                                   00299000
BVTMONP  EQU   BVT+40                                                   00300000
BVTMON2P EQU   BVT+44                                                   00301000
BVTVSARP EQU   BVT+48                                                   00302000
BVTVSENP EQU   BVT+64                                                   00303000
BVTVSERP EQU   BVT+68                                                   00304000
BVTVSGEP EQU   BVT+72                                                   00305000
BVTVSGUP EQU   BVT+76                                                   00306000
BVTVSPOP EQU   BVT+80                                                   00307000
BVTVSPUP EQU   BVT+84                                                   00308000
BVTMPKNP EQU   BVT+104                                                  00309000
BVTMONLP EQU   BVT+108                                                  00310000
BVTPUTCP EQU   BVT+132                                                  00311000
BVTMPK1P EQU   BVT+136                                                  00312000
BVTZZ2RP EQU   BVT+140                                                  00313000
BVTPGMRP EQU   BVT+144                                                  00314000
BVTMONAP EQU   BVT+148                                                  00315000
BVTBLDDP EQU   BVT+152                                                  00316000
BVTBLDLP EQU   BVT+156                                                  00317000
BVTPGMCP EQU   BVT+160                                                  00318000
BVTPGMDP EQU   BVT+164                                                  00319000
BVTPGMLP EQU   BVT+168                                                  00320000
BVTMONCP EQU   BVT+180                                                  00321000
BVTMONDP EQU   BVT+184                                                  00322000
BVTMONTP EQU   BVT+188                                                  00323000
BVTPARIP EQU   BVT+192                                                  00324000
BVTPARUP EQU   BVT+196                                                  00325000
BVTPRTNP EQU   BVT+204                                                  00326000
BVTVSCRP EQU   BVT+208                                                  00327000
BVTVSMRP EQU   BVT+212                                                  00328000
BVTMONXP EQU   BVT+216                                                  00329000
BVTTRMAP EQU   BVT+228                                                  00330000
DVT      EQU   0                                                        00331000
DVTDEQPP EQU   DVT+8                                                    00332000
DVTENQPP EQU   DVT+12                                                   00333000
DVTAUTHP EQU   DVT+20                                                   00334000
DVTLPCLP EQU   DVT+24                                                   00335000
DVTCN00P EQU   DVT+32                                                   00336000
DVTDF00P EQU   DVT+36                                                   00337000
DVTDS00P EQU   DVT+44                                                   00338000
DVTFL00P EQU   DVT+48                                                   00339000
DVTFP00P EQU   DVT+52                                                   00340000
DVTGD00P EQU   DVT+56                                                   00341000
DVTGG00P EQU   DVT+60                                                   00342000
DVTGP00P EQU   DVT+64                                                   00343000
DVTND00P EQU   DVT+68                                                   00344000
DVTND01P EQU   DVT+72                                                   00345000
DVTOD00P EQU   DVT+76                                                   00346000
DVTPS00P EQU   DVT+80                                                   00347000
DVTSD00P EQU   DVT+84                                                   00348000
DVTSL00P EQU   DVT+88                                                   00349000
DVTTL00P EQU   DVT+92                                                   00350000
DVTUD00P EQU   DVT+96                                                   00351000
DVTUP00P EQU   DVT+100                                                  00352000
DVTLP00P EQU   DVT+104                                                  00353000
DVTLALLP EQU   DVT+108                                                  00354000
DVTLPFMP EQU   DVT+112                                                  00355000
DVTCLOSP EQU   DVT+116                                                  00356000
DVTOPENP EQU   DVT+120                                                  00357000
DVTPERAP EQU   DVT+124                                                  00358000
DVTDALLP EQU   DVT+128                                                  00359000
CURPID   EQU   0                                                        00360000
CURDSN   EQU   0                                                        00361000
CURMEM   EQU   0                                                        00362000
CURSEQ   EQU   0                                                        00363000
BLSCALOC EQU   0                                                        00364000
BLSDADSD EQU   0                                                        00365000
BLSDAPDR EQU   0                                                        00366000
BLSDDEQP EQU   0                                                        00367000
BLSDENQP EQU   0                                                        00368000
BLSDENQ0 EQU   0                                                        00369000
BLSDFDSD EQU   0                                                        00370000
BLSDFPDR EQU   0                                                        00371000
BLSDMSGS EQU   0                                                        00372000
BLSDMSG0 EQU   0                                                        00373000
BLSEAUTH EQU   0                                                        00374000
BLSELPCL EQU   0                                                        00375000
BLSELPFM EQU   0                                                        00376000
BLSFCLOS EQU   0                                                        00377000
BLSFCN00 EQU   0                                                        00378000
BLSFDALL EQU   0                                                        00379000
BLSFDF00 EQU   0                                                        00380000
BLSFDS00 EQU   0                                                        00381000
BLSFFL00 EQU   0                                                        00382000
BLSFFP00 EQU   0                                                        00383000
BLSFGD00 EQU   0                                                        00384000
BLSFGG00 EQU   0                                                        00385000
BLSFGP00 EQU   0                                                        00386000
BLSFLALL EQU   0                                                        00387000
BLSFLP00 EQU   0                                                        00388000
BLSFND00 EQU   0                                                        00389000
BLSFND01 EQU   0                                                        00390000
BLSFOD00 EQU   0                                                        00391000
BLSFOPEN EQU   0                                                        00392000
BLSFPERA EQU   0                                                        00393000
BLSFPS00 EQU   0                                                        00394000
BLSFSD00 EQU   0                                                        00395000
BLSFSL00 EQU   0                                                        00396000
BLSFTL00 EQU   0                                                        00397000
BLSFUD00 EQU   0                                                        00398000
BLSFUP00 EQU   0                                                        00399000
BLSUALLO EQU   0                                                        00400000
BLSUBLDD EQU   0                                                        00401000
BLSUBLDL EQU   0                                                        00402000
BLSUDYNA EQU   0                                                        00403000
BLSUFREE EQU   0                                                        00404000
BLSUFRE1 EQU   0                                                        00405000
BLSUMON  EQU   0                                                        00406000
BLSUMONA EQU   0                                                        00407000
BLSUMONC EQU   0                                                        00408000
BLSUMOND EQU   0                                                        00409000
BLSUMONL EQU   0                                                        00410000
BLSUMONT EQU   0                                                        00411000
BLSUMONX EQU   0                                                        00412000
BLSUMON2 EQU   0                                                        00413000
BLSUMPKN EQU   0                                                        00414000
BLSUMPK1 EQU   0                                                        00415000
BLSUPARI EQU   0                                                        00416000
BLSUPARU EQU   0                                                        00417000
BLSUPGMC EQU   0                                                        00418000
BLSUPGMD EQU   0                                                        00419000
BLSUPGML EQU   0                                                        00420000
BLSUPGMR EQU   0                                                        00421000
BLSUPRTA EQU   0                                                        00422000
BLSUPRTN EQU   0                                                        00423000
BLSUPRTT EQU   0                                                        00424000
BLSUPUTA EQU   0                                                        00425000
BLSUPUTC EQU   0                                                        00426000
BLSUPUTD EQU   0                                                        00427000
BLSUPUTL EQU   0                                                        00428000
BLSUPUTN EQU   0                                                        00429000
BLSUPUTO EQU   0                                                        00430000
BLSUPUTT EQU   0                                                        00431000
BLSUPUTV EQU   0                                                        00432000
BLSUSTAI EQU   0                                                        00433000
BLSUTRMA EQU   0                                                        00434000
BLSUTRMN EQU   0                                                        00435000
BLSUTRMO EQU   0                                                        00436000
BLSUTRMV EQU   0                                                        00437000
BLSUVSAR EQU   0                                                        00438000
BLSUVSCR EQU   0                                                        00439000
BLSUVSEN EQU   0                                                        00440000
BLSUVSER EQU   0                                                        00441000
BLSUVSGE EQU   0                                                        00442000
BLSUVSGU EQU   0                                                        00443000
BLSUVSMR EQU   0                                                        00444000
BLSUVSPO EQU   0                                                        00445000
BLSUVSPU EQU   0                                                        00446000
BLSUZZ2C EQU   0                                                        00447000
BLSUZZ2D EQU   0                                                        00448000
BLSUZZ2R EQU   0                                                        00449000
IKJEFF02 EQU   0                                                        00450000
IKJEFF18 EQU   0                                                        00451000
IKJEFF19 EQU   0                                                        00452000
IKJGETL  EQU   0                                                        00453000
IKJPARS  EQU   0                                                        00454000
IKJPTGT  EQU   0                                                        00455000
IKJPUTL  EQU   0                                                        00456000
IKJSCAN  EQU   0                                                        00457000
IKJSTCK  EQU   0                                                        00458000
I001C    EQU   0                                                        00459000
I008P    EQU   0                                                        00460000
I015F    EQU   0                                                        00461000
I015P    EQU   0                                                        00462000
I031F    EQU   0                                                        00463000
I031P    EQU   0                                                        00464000
I256C    EQU   0                                                        00465000
ZZ2CB    EQU   0                                                        00466000
DEFPID   EQU   0                                                        00467000
DEFSEQ   EQU   0                                                        00468000
DEFDSN   EQU   0                                                        00469000
DEFMEM   EQU   0                                                        00470000
DSRECPDR EQU   0                                                        00471000
PDRSTREC EQU   PDRINFO                                                  00472000
PDRODATE EQU   PDRSTREC                                                 00473000
PDROWNNM EQU   PDRSTREC+32                                              00474000
PDRDEREC EQU   PDRINFO                                                  00475000
PDRDESCR EQU   PDRDEREC                                                 00476000
PDRTRREC EQU   PDRINFO                                                  00477000
PDRTRARR EQU   PDRTRREC                                                 00478000
PDRHSREC EQU   PDRINFO                                                  00479000
PDRDSREC EQU   PDRINFO                                                  00480000
PDRDSNM  EQU   PDRDSREC                                                 00481000
PDRDSN   EQU   PDRDSNM                                                  00482000
PDRMEMB  EQU   PDRDSNM+44                                               00483000
PDRDSRES EQU   PDRDSREC+52                                              00484000
PDRSVALU EQU   PDRODATE                                                 00485000
CPPL     EQU   ZZ2CPPL                                                  00486000
CPPLUPT  EQU   CPPL+4                                                   00487000
CPPLPSCB EQU   CPPL+8                                                   00488000
CPPLECT  EQU   CPPL+12                                                  00489000
*                                      START UNREFERENCED COMPONENTS    00490000
CPPLCBUF EQU   CPPL                                                     00491000
PDRSVNUM EQU   PDRSVALU+3                                               00492000
PDRSVRES EQU   PDRSVALU                                                 00493000
PDRHYMSD EQU   PDRHSREC+4                                               00494000
PDRHSLEN EQU   PDRHSREC                                                 00495000
PDRTRKD  EQU   PDRTRARR                                                 00496000
PDRDESC  EQU   PDRDESCR                                                 00497000
PDRDSSEQ EQU   PDRSTREC+396                                             00498000
PDRRES6  EQU   PDRSTREC+392                                             00499000
PDRTRKL  EQU   PDRSTREC+388                                             00500000
PDRDESCL EQU   PDRSTREC+384                                             00501000
PDRABS   EQU   PDRSTREC+256                                             00502000
PDRRES5  EQU   PDRSTREC+252                                             00503000
PDRFIXID EQU   PDRSTREC+192                                             00504000
PDRFTIME EQU   PDRSTREC+184                                             00505000
PDRFDATE EQU   PDRSTREC+176                                             00506000
PDRFSTAT EQU   PDRSTREC+172                                             00507000
PDRRES4  EQU   PDRSTREC+167                                             00508000
PDRPTFID EQU   PDRSTREC+160                                             00509000
PDRTTIME EQU   PDRSTREC+152                                             00510000
PDRTDATE EQU   PDRSTREC+144                                             00511000
PDRTSTAT EQU   PDRSTREC+140                                             00512000
PDRRES3  EQU   PDRSTREC+135                                             00513000
PDRAPRID EQU   PDRSTREC+128                                             00514000
PDRITIME EQU   PDRSTREC+120                                             00515000
PDRIDATE EQU   PDRSTREC+112                                             00516000
PDRISTAT EQU   PDRSTREC+104                                             00517000
PDRRTIME EQU   PDRSTREC+96                                              00518000
PDRRDATE EQU   PDRSTREC+88                                              00519000
PDRPTIME EQU   PDRSTREC+80                                              00520000
PDRPDATE EQU   PDRSTREC+72                                              00521000
PDRPSTAT EQU   PDRSTREC+64                                              00522000
PDRUSER  EQU   PDRSTREC+56                                              00523000
PDRSYS   EQU   PDRSTREC+48                                              00524000
PDRGROUP EQU   PDRSTREC+40                                              00525000
PDROWNLN EQU   PDROWNNM+7                                               00526000
PDROWNID EQU   PDROWNNM                                                 00527000
PDRRES1  EQU   PDRSTREC+27                                              00528000
PDRSEV   EQU   PDRSTREC+26                                              00529000
PDRCOMP  EQU   PDRSTREC+16                                              00530000
PDROTIME EQU   PDRSTREC+8                                               00531000
DVT99999 EQU   DVT+256                                                  00532000
DVT0064P EQU   DVT+252                                                  00533000
DVT0063P EQU   DVT+248                                                  00534000
DVT0062P EQU   DVT+244                                                  00535000
DVT0061P EQU   DVT+240                                                  00536000
DVT0060P EQU   DVT+236                                                  00537000
DVT0059P EQU   DVT+232                                                  00538000
DVT0058P EQU   DVT+228                                                  00539000
DVT0057P EQU   DVT+224                                                  00540000
DVT0056P EQU   DVT+220                                                  00541000
DVT0055P EQU   DVT+216                                                  00542000
DVT0054P EQU   DVT+212                                                  00543000
DVT0053P EQU   DVT+208                                                  00544000
DVT0052P EQU   DVT+204                                                  00545000
DVT0051P EQU   DVT+200                                                  00546000
DVT0050P EQU   DVT+196                                                  00547000
DVT0049P EQU   DVT+192                                                  00548000
DVT0048P EQU   DVT+188                                                  00549000
DVT0047P EQU   DVT+184                                                  00550000
DVT0046P EQU   DVT+180                                                  00551000
DVT0045P EQU   DVT+176                                                  00552000
DVT0044P EQU   DVT+172                                                  00553000
DVT0043P EQU   DVT+168                                                  00554000
DVT0042P EQU   DVT+164                                                  00555000
DVT0041P EQU   DVT+160                                                  00556000
DVT0040P EQU   DVT+156                                                  00557000
DVT0039P EQU   DVT+152                                                  00558000
DVT0038P EQU   DVT+148                                                  00559000
DVT0037P EQU   DVT+144                                                  00560000
DVT0036P EQU   DVT+140                                                  00561000
DVT0035P EQU   DVT+136                                                  00562000
DVT0034P EQU   DVT+132                                                  00563000
DVT0011P EQU   DVT+40                                                   00564000
DVTBP00P EQU   DVT+28                                                   00565000
DVT0005P EQU   DVT+16                                                   00566000
DVT0002P EQU   DVT+4                                                    00567000
DVT0001P EQU   DVT                                                      00568000
BVT99999 EQU   BVT+256                                                  00569000
BVT0064P EQU   BVT+252                                                  00570000
BVT0063P EQU   BVT+248                                                  00571000
BVT0062P EQU   BVT+244                                                  00572000
BVT0061P EQU   BVT+240                                                  00573000
BVT0060P EQU   BVT+236                                                  00574000
BVT0059P EQU   BVT+232                                                  00575000
BVT0057P EQU   BVT+224                                                  00576000
BVT0056P EQU   BVT+220                                                  00577000
BVTSTBLP EQU   BVT+200                                                  00578000
BVT0045P EQU   BVT+176                                                  00579000
BVT0044P EQU   BVT+172                                                  00580000
BVT0033P EQU   BVT+128                                                  00581000
BVT0032P EQU   BVT+124                                                  00582000
BVT0031P EQU   BVT+120                                                  00583000
BVT0030P EQU   BVT+116                                                  00584000
BVT0029P EQU   BVT+112                                                  00585000
BVT0026P EQU   BVT+100                                                  00586000
BVT0025P EQU   BVT+96                                                   00587000
BVT0024P EQU   BVT+92                                                   00588000
BVT0023P EQU   BVT+88                                                   00589000
BVT0016P EQU   BVT+60                                                   00590000
BVT0015P EQU   BVT+56                                                   00591000
BVT0014P EQU   BVT+52                                                   00592000
BVT0003P EQU   BVT+8                                                    00593000
BVT0001P EQU   BVT                                                      00594000
SA99     EQU   SA+72                                                    00595000
SARC     EQU   SAR+56                                                   00596000
SARB     EQU   SAR+52                                                   00597000
SARA     EQU   SAR+48                                                   00598000
SAR9     EQU   SAR+44                                                   00599000
SAR8     EQU   SAR+40                                                   00600000
SAR7     EQU   SAR+36                                                   00601000
SAR6     EQU   SAR+32                                                   00602000
SAR5     EQU   SAR+28                                                   00603000
SAR4     EQU   SAR+24                                                   00604000
SAR3     EQU   SAR+20                                                   00605000
SAR2     EQU   SAR+16                                                   00606000
SAR1     EQU   SAR+12                                                   00607000
SAR0     EQU   SAR+8                                                    00608000
SARF     EQU   SAR+4                                                    00609000
SARE     EQU   SAR                                                      00610000
SAFWD    EQU   SA+8                                                     00611000
SABAK    EQU   SA+4                                                     00612000
SA1L     EQU   SA1+1                                                    00613000
SA1P     EQU   SA1                                                      00614000
UPTPREFL EQU   UPT+23                                                   00615000
UPTPREFX EQU   UPT+16                                                   00616000
@NM00068 EQU   UPT+15                                                   00617000
UPTLDEL  EQU   UPT+14                                                   00618000
UPTCDEL  EQU   UPT+13                                                   00619000
UPTWTP   EQU   UPTSWS                                                   00620000
UPTMODE  EQU   UPTSWS                                                   00621000
UPTALD   EQU   UPTSWS                                                   00622000
UPTPAUS  EQU   UPTSWS                                                   00623000
UPTNCOM  EQU   UPTSWS                                                   00624000
UPTMID   EQU   UPTSWS                                                   00625000
UPTNPRM  EQU   UPTSWS                                                   00626000
UPTRCVR  EQU   UPTSWS                                                   00627000
UPTUSER  EQU   UPT+2                                                    00628000
@NM00067 EQU   UPT                                                      00629000
@NM00066 EQU   ECT+52                                                   00630000
@NM00065 EQU   ECT+48                                                   00631000
@NM00064 EQU   ECT+44                                                   00632000
@NM00063 EQU   ECTSWS2+1                                                00633000
@NM00062 EQU   ECTSWS21                                                 00634000
ECTTABND EQU   ECTSWS21                                                 00635000
ECTDEFCS EQU   ECTSWS21                                                 00636000
ECTBKPB  EQU   ECT+36                                                   00637000
ECTUSER  EQU   ECT+32                                                   00638000
ECTDDNUM EQU   ECT+29                                                   00639000
ECTATTN  EQU   ECTSWS                                                   00640000
ECTBKGRD EQU   ECTSWS                                                   00641000
ECTNNOT  EQU   ECTSWS                                                   00642000
ECTNMAL  EQU   ECTSWS                                                   00643000
ECTLOGF  EQU   ECTSWS                                                   00644000
ECTATRM  EQU   ECTSWS                                                   00645000
@NM00061 EQU   ECTSWS                                                   00646000
ECTNOPD  EQU   ECTSWS                                                   00647000
ECTSCMD  EQU   ECT+20                                                   00648000
ECTPCMD  EQU   ECT+12                                                   00649000
ECTSMSG  EQU   ECT+9                                                    00650000
ECTMSGF  EQU   ECT+8                                                    00651000
ECTIOWA  EQU   ECT+4                                                    00652000
ECTRTCD  EQU   ECT+1                                                    00653000
ECTRCDF  EQU   ECT                                                      00654000
PSCBU    EQU   PSCB+64                                                  00655000
PSCBRSZ  EQU   PSCB+60                                                  00656000
PSCBLINE EQU   PSCB+59                                                  00657000
PSCBCHAR EQU   PSCB+58                                                  00658000
PSCBUPTL EQU   PSCB+56                                                  00659000
PSCBUPT  EQU   PSCB+52                                                  00660000
PSCBRLGB EQU   PSCB+48                                                  00661000
PSCBDEST EQU   PSCB+40                                                  00662000
@NM00060 EQU   PSCB+36                                                  00663000
@NM00059 EQU   PSCB+32                                                  00664000
@NM00058 EQU   PSCB+28                                                  00665000
PSCBLTI2 EQU   PSCB+24                                                  00666000
PSCBLTIM EQU   PSCB+20                                                  00667000
PSCBATR2 EQU   PSCB+18                                                  00668000
@NM00057 EQU   PSCBATR1                                                 00669000
@NM00056 EQU   PSCBATR1                                                 00670000
@NM00055 EQU   PSCBATR1                                                 00671000
PSCBATTN EQU   PSCBATR1                                                 00672000
PSCBVMNT EQU   PSCBATR1                                                 00673000
PSCBJCL  EQU   PSCBATR1                                                 00674000
PSCBACCT EQU   PSCBATR1                                                 00675000
PSCBCTRL EQU   PSCBATR1                                                 00676000
PSCBGPNM EQU   PSCB+8                                                   00677000
PSCBUSRL EQU   PSCB+7                                                   00678000
PSCBUSER EQU   PSCB                                                     00679000
CMDT1    EQU   CMDT                                                     00680000
CMDO     EQU   CMD+2                                                    00681000
CMDL     EQU   CMD                                                      00682000
ZZ299999 EQU   ZZ2+8192                                                 00683000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  00684000
ZZ2AXOL  EQU   ZZ2AXO                                                   00685000
@NM00054 EQU   ZZ2+7288                                                 00686000
@NM00053 EQU   ZZ2AMDX+4                                                00687000
ZZ2AMDXC EQU   ZZ2AMDX                                                  00688000
ZZ2HSD   EQU   ZZ2+3056                                                 00689000
@NM00052 EQU   ZZ2ES                                                    00690000
@NM00051 EQU   ZZ2+2868                                                 00691000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                00692000
@NM00050 EQU   ZZ2ITSE                                                  00693000
ZZ2ITSEP EQU   ZZ2ITSE                                                  00694000
ZZ2ITSEW EQU   ZZ2ITSE                                                  00695000
@NM00049 EQU   ZZ2ITR+20                                                00696000
ZZ2ITREC EQU   ZZ2ITRE+1                                                00697000
@NM00048 EQU   ZZ2ITRE                                                  00698000
ZZ2ITREP EQU   ZZ2ITRE                                                  00699000
ZZ2ITREW EQU   ZZ2ITRE                                                  00700000
@NM00047 EQU   ZZ2ITR+9                                                 00701000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 00702000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 00703000
ZZ2ITRPP EQU   ZZ2ITR                                                   00704000
@NM00046 EQU   ZZ2+1544                                                 00705000
ZZ2PGM   EQU   ZZ2+1536                                                 00706000
@NM00045 EQU   ZZ2+1526                                                 00707000
ZZ2CW    EQU   ZZ2+1524                                                 00708000
@NM00044 EQU   ZZ2+1504                                                 00709000
@NM00043 EQU   ZZ2+1352                                                 00710000
ZZ2FFSYP EQU   ZZ2+1348                                                 00711000
ZZ2SASYP EQU   ZZ2+1344                                                 00712000
ZZ2RDSYP EQU   ZZ2+1340                                                 00713000
ZZ2RASYP EQU   ZZ2+1336                                                 00714000
ZZ2PHSYP EQU   ZZ2+1332                                                 00715000
ZZ2ESSYP EQU   ZZ2+1328                                                 00716000
ZZ200SYP EQU   ZZ2+1324                                                 00717000
ZZ2SCWP  EQU   ZZ2+1320                                                 00718000
ZZ2TTLP  EQU   ZZ2+1316                                                 00719000
ZZ2LOADP EQU   ZZ2+1312                                                 00720000
ZZ2VRESP EQU   ZZ2+1308                                                 00721000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               00722000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                00723000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                00724000
ZZ2VRSAP EQU   ZZ2+1288                                                 00725000
ZZ2RVTP  EQU   ZZ2+1284                                                 00726000
@NM00042 EQU   ZZ2+1272                                                 00727000
@NM00041 EQU   ZZ2+1268                                                 00728000
ZZ2RPLP  EQU   ZZ2+1260                                                 00729000
ZZ2TCBP  EQU   ZZ2+1256                                                 00730000
@NM00040 EQU   ZZ2+1252                                                 00731000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 00732000
@NM00039 EQU   ZZ2+1112                                                 00733000
@NM00038 EQU   ZZ2+1080                                                 00734000
ZZ2FT25P EQU   ZZ2+1072                                                 00735000
@NM00037 EQU   ZZ2+976                                                  00736000
ZZ2TOD   EQU   ZZ2+968                                                  00737000
ZZ2STGN  EQU   ZZ2STG+4                                                 00738000
ZZ2STGP  EQU   ZZ2STG                                                   00739000
@NM00036 EQU   ZZ2+952                                                  00740000
ZZ2SCMDE EQU   ZZ2+944                                                  00741000
ZZ2SCMDN EQU   ZZ2+936                                                  00742000
ZZ2IDENT EQU   ZZ2+928                                                  00743000
ZZ2A9999 EQU   ZZ2A+656                                                 00744000
@NM00035 EQU   ZZ2A+224                                                 00745000
@NM00034 EQU   ZZ2A+220                                                 00746000
ZZ2AQD99 EQU   ZZ2AQD+60                                                00747000
@NM00033 EQU   ZZ2AQD+56                                                00748000
@NM00032 EQU   ZZ2AQDF                                                  00749000
ZZ2AQDFA EQU   ZZ2AQDF                                                  00750000
ZZ2AQDIL EQU   ZZ2AQD+48                                                00751000
ZZ2AQDIM EQU   ZZ2AQD+44                                                00752000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               00753000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               00754000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                00755000
@NM00031 EQU   ZZ2AQDT+1                                                00756000
ZZ2AQDTY EQU   ZZ2AQDT                                                  00757000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  00758000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 00759000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 00760000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 00761000
ZZ2AQDOF EQU   ZZ2AQD                                                   00762000
ZZ2AQD00 EQU   ZZ2AQD                                                   00763000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               00764000
@NM00030 EQU   ZZ2AQAS+12                                               00765000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                00766000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                00767000
@NM00029 EQU   ZZ2AQAS+2                                                00768000
ZZ2AQAST EQU   ZZ2AQAS                                                  00769000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  00770000
ZZ2AZZ6P EQU   ZZ2A+140                                                 00771000
ZZ2ADPTA EQU   ZZ2ADPT                                                  00772000
ZZ2ADPL  EQU   ZZ2ADP                                                   00773000
ZZ2ADMTA EQU   ZZ2ADMT                                                  00774000
ZZ2ADML  EQU   ZZ2ADM                                                   00775000
ZZ2ADDTA EQU   ZZ2ADDT                                                  00776000
ZZ2ADDL  EQU   ZZ2ADD                                                   00777000
@NM00028 EQU   ZZ2A+72                                                  00778000
ZZ2APIDB EQU   ZZ2APID+3                                                00779000
ZZ2APIDA EQU   ZZ2APID                                                  00780000
@NM00027 EQU   ZZ2A+24                                                  00781000
@NM00026 EQU   ZZ2AF+5                                                  00782000
ZZ2AFX   EQU   ZZ2AF+5                                                  00783000
@NM00025 EQU   ZZ2AF+3                                                  00784000
ZZ2AFS   EQU   ZZ2AF+2                                                  00785000
ZZ2AFD   EQU   ZZ2AF+2                                                  00786000
ZZ2AFQ   EQU   ZZ2AF+2                                                  00787000
ZZ2AF$   EQU   ZZ2AF+2                                                  00788000
@NM00024 EQU   ZZ2AF+2                                                  00789000
ZZ2AFM   EQU   ZZ2AF+2                                                  00790000
@NM00023 EQU   ZZ2AF+2                                                  00791000
@NM00022 EQU   ZZ2AF+1                                                  00792000
ZZ2AFV   EQU   ZZ2AF+1                                                  00793000
@NM00021 EQU   ZZ2AF+1                                                  00794000
ZZ2AFC   EQU   ZZ2AF+1                                                  00795000
@NM00020 EQU   ZZ2AF                                                    00796000
ZZ2AFFS  EQU   ZZ2AF                                                    00797000
ZZ2AFT   EQU   ZZ2AF                                                    00798000
ZZ2AFP   EQU   ZZ2AF                                                    00799000
@NM00019 EQU   ZZ2A+8                                                   00800000
ZZ2ALINE EQU   ZZ2A+4                                                   00801000
@NM00018 EQU   ZZ2A+3                                                   00802000
ZZ2ASE   EQU   ZZ2A+2                                                   00803000
ZZ2ACH   EQU   ZZ2A                                                     00804000
@NM00017 EQU   ZZ2+264                                                  00805000
@NM00016 EQU   ZZ2+263                                                  00806000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  00807000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 00808000
ZZ2PRTL  EQU   ZZ2PRT                                                   00809000
@NM00015 EQU   ZZ2AMD+56                                                00810000
ZZ2AMDXP EQU   ZZ2AMD+52                                                00811000
ZZ2AMDD  EQU   ZZ2AMD+48                                                00812000
ZZ2AMDL  EQU   ZZ2AMD+44                                                00813000
ZZ2AMDU  EQU   ZZ2AMD+28                                                00814000
ZZ2AMDF  EQU   ZZ2AMD+24                                                00815000
ZZ2AMDS  EQU   ZZ2AMD+20                                                00816000
ZZ2AMDC  EQU   ZZ2AMD+16                                                00817000
ZZ2AMDP  EQU   ZZ2AMD+12                                                00818000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 00819000
@NM00014 EQU   @NM00013                                                 00820000
ZZ2AMD2  EQU   @NM00013                                                 00821000
ZZ2AMD1  EQU   @NM00013                                                 00822000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 00823000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 00824000
ZZ2AMDT  EQU   ZZ2AMD                                                   00825000
ZZ199999 EQU   ZZ1+3072                                                 00826000
@NM00012 EQU   ZZ1+2160                                                 00827000
ZZ1TRTAS EQU   ZZ1+1904                                                 00828000
ZZ1TRUPC EQU   ZZ1+1648                                                 00829000
ZZ1TRCTX EQU   ZZ1+1392                                                 00830000
ZZ1NASID EQU   ZZ1N+274                                                 00831000
ZZ1NSTRL EQU   ZZ1N+272                                                 00832000
ZZ1NOFF  EQU   ZZ1N+268                                                 00833000
ZZ1NBDY  EQU   ZZ1N+264                                                 00834000
ZZ1NADE  EQU   ZZ1N+260                                                 00835000
ZZ1NADB  EQU   ZZ1N+256                                                 00836000
ZZ1NSTR  EQU   ZZ1N                                                     00837000
@NM00011 EQU   ZZ1+1080                                                 00838000
ZZ1TREBC EQU   ZZ1+824                                                  00839000
ZZ1TRHEX EQU   ZZ1+568                                                  00840000
@NM00010 EQU   ZZ1+377                                                  00841000
ZZ1USTAE EQU   ZZ1+376                                                  00842000
@NM00009 EQU   ZZ1F+1                                                   00843000
@NM00008 EQU   ZZ1F                                                     00844000
ZZ1FM    EQU   ZZ1F                                                     00845000
ZZ1FX    EQU   ZZ1F                                                     00846000
ZZ1FU    EQU   ZZ1F                                                     00847000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 00848000
@NM00007 EQU   ZZ1EVE                                                   00849000
ZZ1EVEW  EQU   ZZ1EVE                                                   00850000
ZZ1ACMP  EQU   ZZ1ATTN                                                  00851000
@NM00006 EQU   ZZ1+144                                                  00852000
ZZ1FPP   EQU   ZZ1+140                                                  00853000
ZZ1ZZ6P  EQU   ZZ1+136                                                  00854000
@NM00005 EQU   ZZ1+84                                                   00855000
ZZ1PLINE EQU   ZZ1+80                                                   00856000
ZZ1PGSZ  EQU   ZZ1+76                                                   00857000
ZZ1PCNT  EQU   ZZ1+72                                                   00858000
@NM00004 EQU   ZZ1+68                                                   00859000
ZZ1TPAGE EQU   ZZ1+64                                                   00860000
ZZ1TLINE EQU   ZZ1+60                                                   00861000
@NM00003 EQU   ZZ1+52                                                   00862000
ZZ1DMCBP EQU   ZZ1+48                                                   00863000
ZZ1DSDP  EQU   ZZ1+44                                                   00864000
ZZ1PDRP  EQU   ZZ1+40                                                   00865000
ZZ1ZZ2P  EQU   ZZ1+36                                                   00866000
ZZ1327WP EQU   ZZ1+32                                                   00867000
ZZ1ACBP  EQU   ZZ1+28                                                   00868000
@NM00002 EQU   ZZ1+24                                                   00869000
ZZ1PDCBP EQU   ZZ1+20                                                   00870000
ZZ1BLRBL EQU   ZZ1+16                                                   00871000
@NM00001 EQU   ZZ1+12                                                   00872000
ZZ1PNULL EQU   ZZ1+8                                                    00873000
ZZ1NULL  EQU   ZZ1+4                                                    00874000
ZZ1IDE   EQU   ZZ1                                                      00875000
PDRKPNUM EQU   PDRKPID+3                                                00876000
PDRKPREF EQU   PDRKPID                                                  00877000
*                                      END UNREFERENCED COMPONENTS      00878000
@ENDDATA EQU   *                                                        00879000
         END   BLSFBP00,(C'PLS1447',0701,78065)                         00880000
