ACCQ     TITLE 'BLSRACCQ--DEBUGGING STORAGE ACCESS SERVICE ROUTINE     *00001000
                        '                                               00002000
*/* CHANGE ACTIVITY -------------------------------------------------*/ 00003000
*/*   THIS MODULE WAS WRITTEN FOR @G57LPRW                           */ 00004000
*/*------------------------------------------------------------------*/ 00005000
BLSRACCQ CSECT ,                                                01S0002 00006000
@MAINENT DS    0H                                               01S0002 00007000
         USING *,@15                                            01S0002 00008000
         B     @PROLOG                                          01S0002 00009000
         DC    AL1(16)                                          01S0002 00010000
         DC    C'BLSRACCQ  78.057'                              01S0002 00011000
         DROP  @15                                                      00012000
@PROLOG  STM   @14,@12,12(@13)                                  01S0002 00013000
         BALR  @12,0                                            01S0002 00014000
@PSTART  DS    0H                                               01S0002 00015000
         USING @PSTART,@12                                      01S0002 00016000
         L     @00,@SIZDATD                                     01S0002 00017000
         BLSUALLS R,LV=(0)                                              00018000
         LR    @11,@01                                          01S0002 00019000
         USING @DATD,@11                                        01S0002 00020000
         ST    @13,@SA00001+4                                   01S0002 00021000
         LM    @00,@01,20(@13)                                  01S0002 00022000
         ST    @11,8(,@13)                                      01S0002 00023000
         LR    @13,@11                                          01S0002 00024000
         MVC   @PC00001(12),0(@01)                              01S0002 00025000
*   ESBAPTR=ADDR(ESPA);             /* ->ESBA (ALIAS FOR ESPA)       */ 00026000
         L     ESBAPTR,@PC00001+4                               01S0162 00027000
*   CALL BLSRESCK(ZZ2,ESBA);        /* VALIDATE EQUATE SYMBOL RECORD */ 00028000
         ST    R9,@AL00001                                      01S0163 00029000
         ST    ESBAPTR,@AL00001+4                               01S0163 00030000
         L     @10,ZZ2RVTP(,R9)                                 01S0163 00031000
         L     @15,RVTESCKP(,@10)                               01S0163 00032000
         LA    @01,@AL00001                                     01S0163 00033000
         BALR  @14,@15                                          01S0163 00034000
*   RETC=RF;                        /* RETURN CODE                   */ 00035000
         LR    RETC,RF                                          01S0164 00036000
*   IF RF>ZZZFLAGE THEN             /* INVALID EQUATE SYMBOL RECORD  */ 00037000
*                                                               01S0165 00038000
         CH    RF,@CH00056                                      01S0165 00039000
         BNH   @RF00165                                         01S0165 00040000
*     /***************************************************************/ 00041000
*     /*                                                             */ 00042000
*     /* INVALID EQUATE SYMBOL RECORD                                */ 00043000
*     /*                                                             */ 00044000
*     /***************************************************************/ 00045000
*                                                               01S0166 00046000
*     DO;                           /* INVALID EQUATE SYMBOL RECORD  */ 00047000
*       ESBAFSM='1'B;               /* MISSING STORAGE               */ 00048000
         OI    ESBAFSM(ESBAPTR),B'00100000'                     01S0167 00049000
*       ESBAMAD=ESBALAD;            /* ->MISSING STORAGE             */ 00050000
         MVC   ESBAMAD(4,ESBAPTR),ESBALAD(ESBAPTR)              01S0168 00051000
*       GO TO EXIT;                 /* COMMON EXIT PATH              */ 00052000
         B     EXIT                                             01S0169 00053000
*     END;                          /* INVALID EQUATE SYMBOL RECORD  */ 00054000
*   ESBAFS='00'X;                   /* STORAGE FLAGS                 */ 00055000
@RF00165 MVI   ESBAFS(ESBAPTR),X'00'                            01S0171 00056000
*   CURADDR=ESBALAD+ESBADOF;        /* ->CURRENT STORAGE POSITION    */ 00057000
         L     CURADDR,ESBALAD(,ESBAPTR)                        01S0172 00058000
         AL    CURADDR,ESBADOF(,ESBAPTR)                        01S0172 00059000
*   GENERATE CODE(MVC   ADATA(ADATAEND-ADATA),SDATA);           01S0173 00060000
         MVC   ADATA(ADATAEND-ADATA),SDATA                              00061000
*   AMTLEFT=ESBADLE*MAX(ESBADIM,1); /* REQUESTED STORAGE REMAINING   */ 00062000
         L     @14,ESBADIM(,ESBAPTR)                            01S0174 00063000
         LA    @07,1                                            01S0174 00064000
         CLR   @14,@07                                          01S0174 00065000
         BNL   *+6                                                      00066000
         LR    @14,@07                                          01S0174 00067000
         LR    @01,@14                                          01S0174 00068000
         M     @00,ESBADLE(,ESBAPTR)                            01S0174 00069000
         ST    @01,AMTLEFT                                      01S0174 00070000
*   CURBUFAD=ADDR(BUFFER);          /* ->CURRENT BUFFER POSITION     */ 00071000
         L     @14,@PC00001+8                                   01S0175 00072000
         ST    @14,CURBUFAD                                     01S0175 00073000
*   ASAU=ESBAAS;                    /* ADDRESS SPACE REQUESTED       */ 00074000
*                                                               01S0176 00075000
         MVC   ASAU(16),ESBAAS(ESBAPTR)                         01S0176 00076000
*   /*****************************************************************/ 00077000
*   /*                                                               */ 00078000
*   /* DATA IS MOVED BUFFER (I/O) BY BUFFER TO THE CALLERS BUFFER    */ 00079000
*   /*                                                               */ 00080000
*   /*****************************************************************/ 00081000
*                                                               01S0177 00082000
*   DO WHILE(AMTLEFT>0);            /* ACCESS ALL STORAGE REQUESTED  */ 00083000
         B     @DE00177                                         01S0177 00084000
@DL00177 DS    0H                                               01S0178 00085000
*     IF ZZ1EVEP='1'B THEN          /* EARLY TERMINATION REQUESTED   */ 00086000
*                                                               01S0178 00087000
         L     @14,ZZ2ZZ1P(,R9)                                 01S0178 00088000
         TM    ZZ1EVEP(@14),B'01000000'                         01S0178 00089000
         BNO   @RF00178                                         01S0178 00090000
*       /*************************************************************/ 00091000
*       /*                                                           */ 00092000
*       /* EARLY TERMINATION REQUESTED                               */ 00093000
*       /*                                                           */ 00094000
*       /*************************************************************/ 00095000
*                                                               01S0179 00096000
*       DO;                         /* EARLY TERMINATION REQUESTED   */ 00097000
*         ESBAFSM='1'B;             /* MISSING STORAGE               */ 00098000
         OI    ESBAFSM(ESBAPTR),B'00100000'                     01S0180 00099000
*         ESBAMAD=CURADDR;          /* ->MISSING STORAGE             */ 00100000
         ST    CURADDR,ESBAMAD(,ESBAPTR)                        01S0181 00101000
*         RETC=ZZZFLAGS;            /* RETURN CODE                   */ 00102000
         LA    RETC,12                                          01S0182 00103000
*         GO TO EXIT;               /* COMMON EXIT PATH              */ 00104000
         B     EXIT                                             01S0183 00105000
*       END;                        /* EARLY TERMINATION REQUESTED   */ 00106000
*     RAAUAS=ASAU;                  /* ADDRESS SPACE REQUESTED       */ 00107000
@RF00178 MVC   RAAUAS(16),ASAU                                  01S0185 00108000
*     RAAUFAD=CURADDR;              /* ->STORAGE OF INTEREST         */ 00109000
         ST    CURADDR,RAAUFAD                                  01S0186 00110000
*     CALL BLSRRAGE(ZZ2,RAAU);      /* LOCATE STORAGE RECORD         */ 00111000
         ST    R9,@AL00001                                      01S0187 00112000
         LA    @14,RAAU                                         01S0187 00113000
         ST    @14,@AL00001+4                                   01S0187 00114000
         L     @07,ZZ2RVTP(,R9)                                 01S0187 00115000
         L     @15,RVTRAGEP(,@07)                               01S0187 00116000
         LA    @01,@AL00001                                     01S0187 00117000
         BALR  @14,@15                                          01S0187 00118000
*     RETC=MAX(RETC,RF);            /* RETURN CODE                   */ 00119000
         CR    RETC,RF                                          01S0188 00120000
         BNL   *+6                                                      00121000
         LR    RETC,RF                                          01S0188 00122000
*     IF RF>ZZZFLAGE|RAAURFU(1)='1'B THEN/* STORAGE NOT LOCATED      */ 00123000
*                                                               01S0189 00124000
         CH    RF,@CH00056                                      01S0189 00125000
         BH    @RT00189                                         01S0189 00126000
         TM    RAAURFU,B'10000000'                              01S0189 00127000
         BNO   @RF00189                                         01S0189 00128000
@RT00189 DS    0H                                               01S0190 00129000
*       /*************************************************************/ 00130000
*       /*                                                           */ 00131000
*       /* STORAGE NOT LOCATED                                       */ 00132000
*       /*                                                           */ 00133000
*       /*************************************************************/ 00134000
*                                                               01S0190 00135000
*       DO;                         /* STORAGE NOT LOCATED           */ 00136000
*         ESBAFSM='1'B;             /* MISSING STORAGE               */ 00137000
         OI    ESBAFSM(ESBAPTR),B'00100000'                     01S0191 00138000
*         ESBAMAD=CURADDR;          /* ->MISSING STORAGE             */ 00139000
         ST    CURADDR,ESBAMAD(,ESBAPTR)                        01S0192 00140000
*         RETC=MAX(RETC,ZZZFLAGW);  /* RETURN CODE                   */ 00141000
         LA    @14,4                                            01S0193 00142000
         CR    RETC,@14                                         01S0193 00143000
         BNL   *+6                                                      00144000
         LR    RETC,@14                                         01S0193 00145000
*         GO TO EXIT;               /* COMMON EXIT PATH              */ 00146000
         B     EXIT                                             01S0194 00147000
*       END;                        /* STORAGE NOT LOCATED           */ 00148000
*     IF RAAURDA(1)>=ZZ6DDA1 THEN   /* ABSURD RECORD ADDRESS         */ 00149000
*                                                               01S0196 00150000
@RF00189 L     @14,ZZ2AZZ6P(,R9)                                01S0196 00151000
         CLC   RAAURDA(4),ZZ6DDA1(@14)                          01S0196 00152000
         BL    @RF00196                                         01S0196 00153000
*       /*************************************************************/ 00154000
*       /*                                                           */ 00155000
*       /* ABSURD RECORD ADDRESS                                     */ 00156000
*       /*                                                           */ 00157000
*       /*************************************************************/ 00158000
*                                                               01S0197 00159000
*       DO;                         /* ABSURD RECORD ADDRESS         */ 00160000
*         ESBAFSM='1'B;             /* MISSING STORAGE               */ 00161000
         OI    ESBAFSM(ESBAPTR),B'00100000'                     01S0198 00162000
*         ESBAMAD=CURADDR;          /* ->MISSING STORAGE             */ 00163000
         ST    CURADDR,ESBAMAD(,ESBAPTR)                        01S0199 00164000
*         RETC=MAX(RETC,ZZZFLAGT);  /* RETURN CODE                   */ 00165000
         LA    @14,16                                           01S0200 00166000
         CR    RETC,@14                                         01S0200 00167000
         BNL   *+6                                                      00168000
         LR    RETC,@14                                         01S0200 00169000
*         GO TO EXIT;               /* COMMON EXIT PATH              */ 00170000
         B     EXIT                                             01S0201 00171000
*       END;                        /* ABSURD RECORD ADDRESS         */ 00172000
*     ZZ6BUFB=ZZ6BUFB+1;            /* DATA REQUESTS                 */ 00173000
@RF00196 L     @14,ZZ2AZZ6P(,R9)                                01S0203 00174000
         LA    @07,1                                            01S0203 00175000
         L     @05,ZZ6BUFB(,@14)                                01S0203 00176000
         ALR   @05,@07                                          01S0203 00177000
         ST    @05,ZZ6BUFB(,@14)                                01S0203 00178000
*                                                               02S0204 00179000
*/*------------------------------------------------------------------*/ 00180000
*/* BLSRACCR--READ RECORD INTO BUFFER                                */ 00181000
*/*------------------------------------------------------------------*/ 00182000
*                                                               02S0204 00183000
*     /***************************************************************/ 00184000
*     /*                                                             */ 00185000
*     /* SEARCH BUFFERS FOR REQUESTED RECORD, BEST BUFFER TO STEAL   */ 00186000
*     /*                                                             */ 00187000
*     /***************************************************************/ 00188000
*                                                               02S0204 00189000
*     BUFSTEAL=1;                   /* INDEX OF BUFFER TO STEAL      */ 00190000
         LR    BUFSTEAL,@07                                     02S0204 00191000
*     DO BUFNUM=1 TO ZZ6BUFN WHILE(ZZ6BFL(BUFNUM)=0|ZZ6BDA(BUFNUM)^=    00192000
*           RAAURDA(1));            /* SEARCH BUFFERS                */ 00193000
         LR    BUFNUM,@07                                       02S0205 00194000
         B     @DE00205                                         02S0205 00195000
@DL00205 LR    @14,BUFNUM                                       02S0205 00196000
         SLA   @14,4                                            02S0205 00197000
         L     @07,ZZ2AZZ6P(,R9)                                02S0205 00198000
         LH    @05,ZZ6BFL-16(@14,@07)                           02S0205 00199000
         LTR   @05,@05                                          02S0205 00200000
         BZ    @DB00205                                         02S0205 00201000
         L     @14,ZZ6BDA-16(@14,@07)                           02S0205 00202000
         CL    @14,RAAURDA                                      02S0205 00203000
         BE    @DC00205                                         02S0205 00204000
@DB00205 DS    0H                                               02S0206 00205000
*       IF ZZ6BFL(BUFSTEAL)^=0 THEN /* POSSIBLY A BETTER STEAL       */ 00206000
*                                                               02S0206 00207000
         SLR   @14,@14                                          02S0206 00208000
         LR    @07,BUFSTEAL                                     02S0206 00209000
         SLA   @07,4                                            02S0206 00210000
         L     @05,ZZ2AZZ6P(,R9)                                02S0206 00211000
         CH    @14,ZZ6BFL-16(@07,@05)                           02S0206 00212000
         BE    @RF00206                                         02S0206 00213000
*         /***********************************************************/ 00214000
*         /*                                                         */ 00215000
*         /* POSSIBLY A BETTER STEAL                                 */ 00216000
*         /*                                                         */ 00217000
*         /***********************************************************/ 00218000
*                                                               02S0207 00219000
*         DO;                       /* POSSIBLY A BETTER STEAL       */ 00220000
*           IF                      /* A BETTER BUFFER TO STEAL      */ 00221000
*               ZZ6BFL(BUFNUM)=0|   /* STEAL EMPTY BUFFER            */ 00222000
*               (ZZ6BRC(BUFNUM)*SCALEVAL)/(ZZ6BUFB-ZZ6BRB(BUFNUM))<(    00223000
*               ZZ6BRC(BUFSTEAL)*SCALEVAL)/(ZZ6BUFB-ZZ6BRB(BUFSTEAL))   00224000
*             THEN                  /* STEAL POORLY USED BUFFER      */ 00225000
         LR    @03,BUFNUM                                       02S0208 00226000
         SLA   @03,4                                            02S0208 00227000
         CH    @14,ZZ6BFL-16(@03,@05)                           02S0208 00228000
         BE    @RT00208                                         02S0208 00229000
         L     @14,ZZ6BRC-16(@03,@05)                           02S0208 00230000
         SLA   @14,15                                           02S0208 00231000
         L     @01,ZZ6BUFB(,@05)                                02S0208 00232000
         LR    @00,@01                                          02S0208 00233000
         SL    @00,ZZ6BRB-16(@03,@05)                           02S0208 00234000
         ST    @00,@TF00001                                     02S0208 00235000
         LR    @00,@14                                          02S0208 00236000
         ST    @01,@TF00002                                     02S0208 00237000
         SRDA  @00,32                                           02S0208 00238000
         D     @00,@TF00001                                     02S0208 00239000
         L     @14,ZZ6BRC-16(@07,@05)                           02S0208 00240000
         SLA   @14,15                                           02S0208 00241000
         L     @03,@TF00002                                     02S0208 00242000
         SL    @03,ZZ6BRB-16(@07,@05)                           02S0208 00243000
         LR    @00,@14                                          02S0208 00244000
         ST    @01,@TF00001                                     02S0208 00245000
         SRDA  @00,32                                           02S0208 00246000
         DR    @00,@03                                          02S0208 00247000
         C     @01,@TF00001                                     02S0208 00248000
         BNH   @RF00208                                         02S0208 00249000
@RT00208 DS    0H                                               02S0209 00250000
*             BUFSTEAL=BUFNUM;      /* INDEX OF BUFFER TO STEAL      */ 00251000
         LR    BUFSTEAL,BUFNUM                                  02S0209 00252000
*         END;                      /* POSSIBLY A BETTER STEAL       */ 00253000
@RF00208 DS    0H                                               02S0211 00254000
*     END;                          /* SEARCH BUFFERS                */ 00255000
@RF00206 AH    BUFNUM,@CH00048                                  02S0211 00256000
@DE00205 L     @14,ZZ2AZZ6P(,R9)                                02S0211 00257000
         CH    BUFNUM,ZZ6BUFN(,@14)                             02S0211 00258000
         BNH   @DL00205                                         02S0211 00259000
@DC00205 DS    0H                                               02S0212 00260000
*     IF BUFNUM>ZZ6BUFN THEN        /* REQUESTED DATA NOT IN A BUFFER*/ 00261000
*                                                               02S0212 00262000
         L     @14,ZZ2AZZ6P(,R9)                                02S0212 00263000
         CH    BUFNUM,ZZ6BUFN(,@14)                             02S0212 00264000
         BNH   @RF00212                                         02S0212 00265000
*       /*************************************************************/ 00266000
*       /*                                                           */ 00267000
*       /* REQUESTED DATA NOT IN A BUFFER                            */ 00268000
*       /*                                                           */ 00269000
*       /*************************************************************/ 00270000
*                                                               02S0213 00271000
*       DO;                         /* REQUESTED DATA NOT IN A BUFFER*/ 00272000
*         ZZ6BUFI=ZZ6BUFI+1;        /* BDAM READ REQUESTS            */ 00273000
         LA    @05,1                                            02S0214 00274000
         AL    @05,ZZ6BUFI(,@14)                                02S0214 00275000
         ST    @05,ZZ6BUFI(,@14)                                02S0214 00276000
*         ZZ6BFL(BUFSTEAL)=0;       /* MARK BUFFER EMPTY             */ 00277000
         LR    @05,BUFSTEAL                                     02S0215 00278000
         SLA   @05,4                                            02S0215 00279000
         SLR   @03,@03                                          02S0215 00280000
         STH   @03,ZZ6BFL-16(@05,@14)                           02S0215 00281000
*         RESPECIFY                                             02S0216 00282000
*          (R2,                     /* ->DCB                         */ 00283000
*           R3) RESTRICTED;         /* ->BUFFER                      */ 00284000
*         R2=ADDR(IHADCB);          /* ->DCB                         */ 00285000
         LR    R2,@14                                           02S0217 00286000
*         R3=ZZ6BUFP+ZZ6BUFL*(BUFSTEAL-1);/* ->BUFFER                */ 00287000
         LR    R3,BUFSTEAL                                      02S0218 00288000
         BCTR  R3,0                                             02S0218 00289000
         MH    R3,ZZ6BUFL(,@14)                                 02S0218 00290000
         AL    R3,ZZ6BUFP(,@14)                                 02S0218 00291000
*         GENERATE REFS(ADECB,R2,R3,RAAURDA) SETS(ADECB) CODE;  02S0219 00292000
         READ  ADECB,DI,(R2),(R3),'S',0,RAAURDA+1,MF=E                  00293000
         CHECK ADECB                                                    00294000
*         RESPECIFY                                             02S0220 00295000
*          (R2,                     /* ->DCB                         */ 00296000
*           R3) UNRESTRICTED;       /* ->BUFFER                      */ 00297000
*         DECBPT=ADDR(ADECB);       /* ->DECB                        */ 00298000
         LA    DECBPT,ADECB                                     02S0221 00299000
*         IF DECCC2^='00'X|DECCC3^='00'X THEN/* READ FAILED          */ 00300000
*                                                               02S0222 00301000
         CLI   DECCC2(DECBPT),X'00'                             02S0222 00302000
         BNE   @RT00222                                         02S0222 00303000
         CLI   DECCC3(DECBPT),X'00'                             02S0222 00304000
         BE    @RF00222                                         02S0222 00305000
@RT00222 DS    0H                                               02S0223 00306000
*           /*********************************************************/ 00307000
*           /*                                                       */ 00308000
*           /* READ FAILED                                           */ 00309000
*           /*                                                       */ 00310000
*           /*********************************************************/ 00311000
*                                                               02S0223 00312000
*           DO;                     /* READ FAILED                   */ 00313000
*             ESBAFSM='1'B;         /* MISSING STORAGE               */ 00314000
         OI    ESBAFSM(ESBAPTR),B'00100000'                     02S0224 00315000
*             ESBAMAD=CURADDR;      /* ->MISSING STORAGE             */ 00316000
         ST    CURADDR,ESBAMAD(,ESBAPTR)                        02S0225 00317000
*             RETC=MAX(RETC,ZZZFLAGT);/* RETURN CODE                 */ 00318000
         LA    @14,16                                           02S0226 00319000
         CR    RETC,@14                                         02S0226 00320000
         BNL   *+6                                                      00321000
         LR    RETC,@14                                         02S0226 00322000
*             GO TO EXIT;           /* COMMON EXIT PATH              */ 00323000
         B     EXIT                                             02S0227 00324000
*           END;                    /* READ FAILED                   */ 00325000
*         ZZ6BDA(BUFSTEAL)=RAAURDA(1);/* RECORD                      */ 00326000
@RF00222 LR    @14,BUFSTEAL                                     02S0229 00327000
         SLA   @14,4                                            02S0229 00328000
         L     @07,ZZ2AZZ6P(,R9)                                02S0229 00329000
         L     @05,RAAURDA                                      02S0229 00330000
         ST    @05,ZZ6BDA-16(@14,@07)                           02S0229 00331000
*         ZZ6BFL(BUFSTEAL)=ZZ6BUFL; /* LENGTH OF BUFFER CONTENTS     */ 00332000
         LH    @05,ZZ6BUFL(,@07)                                02S0230 00333000
         STH   @05,ZZ6BFL-16(@14,@07)                           02S0230 00334000
*         ZZ6BRC(BUFSTEAL)=1;       /* BUFFER REFERENCE COUNT        */ 00335000
         LA    @05,1                                            02S0231 00336000
         ST    @05,ZZ6BRC-16(@14,@07)                           02S0231 00337000
*         ZZ6BRB(BUFSTEAL)=ZZ6BUFB; /* REFERENCES TO THE DATA SET    */ 00338000
         L     @05,ZZ6BUFB(,@07)                                02S0232 00339000
         ST    @05,ZZ6BRB-16(@14,@07)                           02S0232 00340000
*       END;                        /* REQUESTED DATA NOT IN A BUFFER*/ 00341000
*     ELSE                          /* REQUESTED DATA IN A BUFFER    */ 00342000
*                                                               02S0234 00343000
*       /*************************************************************/ 00344000
*       /*                                                           */ 00345000
*       /* REQUESTED DATA IN A BUFFER                                */ 00346000
*       /*                                                           */ 00347000
*       /*************************************************************/ 00348000
*                                                               02S0234 00349000
*       DO;                         /* REQUESTED DATA IN A BUFFER    */ 00350000
         B     @RC00212                                         02S0234 00351000
@RF00212 DS    0H                                               02S0235 00352000
*         BUFSTEAL=BUFNUM;          /* CURRENT BUFFER INDEX          */ 00353000
         LR    BUFSTEAL,BUFNUM                                  02S0235 00354000
*         ZZ6BRC(BUFSTEAL)=ZZ6BRC(BUFSTEAL)+1;/* BUFFER REFERENCE       00355000
*                                      COUNT                         */ 00356000
         LR    @14,BUFSTEAL                                     02S0236 00357000
         SLA   @14,4                                            02S0236 00358000
         L     @07,ZZ2AZZ6P(,R9)                                02S0236 00359000
         LA    @05,1                                            02S0236 00360000
         AL    @05,ZZ6BRC-16(@14,@07)                           02S0236 00361000
         ST    @05,ZZ6BRC-16(@14,@07)                           02S0236 00362000
*       END;                        /* REQUESTED DATA IN A BUFFER    */ 00363000
*     HSDPTR=ZZ6BUFP+ZZ6BUFL*(BUFSTEAL-1);/* ->HSD                   */ 00364000
@RC00212 L     @14,ZZ2AZZ6P(,R9)                                02S0238 00365000
         LR    HSDPTR,BUFSTEAL                                  02S0238 00366000
         BCTR  HSDPTR,0                                         02S0238 00367000
         MH    HSDPTR,ZZ6BUFL(,@14)                             02S0238 00368000
         AL    HSDPTR,ZZ6BUFP(,@14)                             02S0238 00369000
*                                                               02S0239 00370000
*/*------------------------------------------------------------------*/ 00371000
*/* BLSRACCS--PROCESS SYSTEM/370 DUMP STORAGE                        */ 00372000
*/*------------------------------------------------------------------*/ 00373000
*                                                               02S0239 00374000
*     IF ZZ6DFDU='1'B&HSDTYPE^=HSDTYPES THEN/* SYSTEM/370 DUMP  02S0239 00375000
*                                      STORAGE                       */ 00376000
*                                                               02S0239 00377000
         TM    ZZ6DFDU(@14),B'01000000'                         02S0239 00378000
         BNO   @RF00239                                         02S0239 00379000
         CLI   HSDTYPE(HSDPTR),X'FF'                            02S0239 00380000
         BE    @RF00239                                         02S0239 00381000
*       /*************************************************************/ 00382000
*       /*                                                           */ 00383000
*       /* SYSTEM/370 DUMP STORAGE RECORD                            */ 00384000
*       /*                                                           */ 00385000
*       /*************************************************************/ 00386000
*                                                               02S0240 00387000
*       DO;                         /* SYSTEM/370 DUMP STORAGE       */ 00388000
*         IF HSDSASI=HSDSASIS THEN  /* SUMDUMP RECORD                */ 00389000
*                                                               02S0241 00390000
         CLC   HSDSASI(2,HSDPTR),@CH00091                       02S0241 00391000
         BNE   @RF00241                                         02S0241 00392000
*           /*********************************************************/ 00393000
*           /*                                                       */ 00394000
*           /* SUMDUMP RECORD                                        */ 00395000
*           /*                                                       */ 00396000
*           /*********************************************************/ 00397000
*                                                               02S0242 00398000
*           DO;                     /* SUMDUMP RECORD                */ 00399000
*             ESBAKEY='FF'X;        /* INDETERMINATE STORAGE KEY     */ 00400000
         MVI   ESBAKEY(ESBAPTR),X'FF'                           02S0243 00401000
*             ESBAFSS='1'B;         /* SUMDUMP DATA                  */ 00402000
         OI    ESBAFSS(ESBAPTR),B'00000001'                     02S0244 00403000
*           END;                    /* SUMDUMP RECORD                */ 00404000
*         IF ESBAFSS='0'B THEN      /* NO SUMDUMP DATA               */ 00405000
*                                                               02S0246 00406000
@RF00241 TM    ESBAFSS(ESBAPTR),B'00000001'                     02S0246 00407000
         BNZ   @RF00246                                         02S0246 00408000
*           /*********************************************************/ 00409000
*           /*                                                       */ 00410000
*           /* NO SUMDUMP DATA                                       */ 00411000
*           /*                                                       */ 00412000
*           /*********************************************************/ 00413000
*                                                               02S0247 00414000
*           DO;                     /* NO SUMDUMP DATA               */ 00415000
*             IF ESBAFSC='0'B THEN  /* FIRST STORAGE RECORD          */ 00416000
*                                                               02S0248 00417000
         TM    ESBAFSC(ESBAPTR),B'10000000'                     02S0248 00418000
         BNZ   @RF00248                                         02S0248 00419000
*               /*****************************************************/ 00420000
*               /*                                                   */ 00421000
*               /* FIRST STORAGE RECORD                              */ 00422000
*               /*                                                   */ 00423000
*               /*****************************************************/ 00424000
*                                                               02S0249 00425000
*               DO;                 /* FIRST STORAGE RECORD          */ 00426000
*                 P1=CURADDR&ZZZP4OFF;/* OFFSET FROM PAGE ORIGIN     */ 00427000
         LR    P1,CURADDR                                       02S0250 00428000
         N     P1,@CF00118                                      02S0250 00429000
*                 IF P1<ZZZLENP2 THEN/* INITIAL 2K OF 4K FRAME       */ 00430000
*                                                               02S0251 00431000
         LA    @14,2048                                         02S0251 00432000
         CR    P1,@14                                           02S0251 00433000
         BNL   @RF00251                                         02S0251 00434000
*                   /*************************************************/ 00435000
*                   /*                                               */ 00436000
*                   /* INITIAL 2K OF 4K FRAME                        */ 00437000
*                   /*                                               */ 00438000
*                   /*************************************************/ 00439000
*                                                               02S0252 00440000
*                   DO;             /* INITIAL 2K OF 4K FRAME        */ 00441000
*                     ESBAKEY=HSDSK1;/* STORAGE KEY                  */ 00442000
         MVC   ESBAKEY(1,ESBAPTR),HSDSK1(HSDPTR)                02S0253 00443000
*                     IF P1+AMTLEFT>ZZZLENP2 THEN/* 2 STORAGE KEYS   */ 00444000
*                                                               02S0254 00445000
         LR    @03,P1                                           02S0254 00446000
         AL    @03,AMTLEFT                                      02S0254 00447000
         CR    @03,@14                                          02S0254 00448000
         BNH   @RF00254                                         02S0254 00449000
*                       /*********************************************/ 00450000
*                       /*                                           */ 00451000
*                       /* BOTH STORAGE KEYS FROM THIS FRAME APPLY   */ 00452000
*                       /*                                           */ 00453000
*                       /*********************************************/ 00454000
*                                                               02S0255 00455000
*                       DO;         /* BOTH STORAGE KEYS APPLY       */ 00456000
*                         ESBAKEY=ESBAKEY|/* STORAGE KEY=REFERENCE      00457000
*                                      VALUE+                        */ 00458000
*                             (HSDSK2&KMU);/* REFERENCE, CHANGE, &      00459000
*                                      FETCH BITS FROM ALL 2K BLOCKS */ 00460000
         MVC   @TS00001(1),HSDSK2(HSDPTR)                       02S0256 00461000
         NI    @TS00001,X'07'                                   02S0256 00462000
         OC    ESBAKEY(1,ESBAPTR),@TS00001                      02S0256 00463000
*                         IF(ESBAKEY&KMK)^=(HSDSK2&KMK) THEN    02S0257 00464000
         MVC   @TS00001(1),ESBAKEY(ESBAPTR)                     02S0257 00465000
         NI    @TS00001,X'F8'                                   02S0257 00466000
         MVC   @TS00001+1(1),HSDSK2(HSDPTR)                     02S0257 00467000
         NI    @TS00001+1,X'F8'                                 02S0257 00468000
         CLC   @TS00001(1),@TS00001+1                           02S0257 00469000
         BE    @RF00257                                         02S0257 00470000
*                           ESBAFS2='1'B;/* MULTIPLE STORAGE KEYS    */ 00471000
         OI    ESBAFS2(ESBAPTR),B'01000000'                     02S0258 00472000
*                       END;        /* BOTH STORAGE KEYS APPLY       */ 00473000
*                   END;            /* INITIAL 2K OF 4K FRAME        */ 00474000
*                 ELSE              /* SECOND 2K OF 4K FRAME         */ 00475000
*                   ESBAKEY=HSDSK2; /* STORAGE KEY                   */ 00476000
         B     @RC00251                                         02S0261 00477000
@RF00251 MVC   ESBAKEY(1,ESBAPTR),HSDSK2(HSDPTR)                02S0261 00478000
*                 IF HSDSASI=HSDSASIR THEN/* ABSOLUTE STORAGE FRAME  */ 00479000
*                                                               02S0262 00480000
@RC00251 ICM   @14,3,HSDSASI(HSDPTR)                            02S0262 00481000
         BNZ   @RF00262                                         02S0262 00482000
*                   /*************************************************/ 00483000
*                   /*                                               */ 00484000
*                   /* ABSOLUTE STORAGE FRAME                        */ 00485000
*                   /*                                               */ 00486000
*                   /*************************************************/ 00487000
*                                                               02S0263 00488000
*                   DO;             /* ABSOLUTE STORAGE FRAME        */ 00489000
*                     ESBAABS=HSDSP+P1;/* ->ABSOLUTE STORAGE         */ 00490000
         LR    @14,P1                                           02S0264 00491000
         AL    @14,HSDSP(,HSDPTR)                               02S0264 00492000
         ST    @14,ESBAABS(,ESBAPTR)                            02S0264 00493000
*                     ESBAFSA='1'B; /* ABSOLUTE ADDRESS VALID        */ 00494000
         OI    ESBAFSA(ESBAPTR),B'00010000'                     02S0265 00495000
*                   END;            /* ABSOLUTE STORAGE FRAME        */ 00496000
*               END;                /* FIRST STORAGE RECORD          */ 00497000
*             ELSE                  /* SECOND, THIRD, ... RECORD     */ 00498000
*                                                               02S0268 00499000
*               /*****************************************************/ 00500000
*               /*                                                   */ 00501000
*               /* SECOND, THIRD, ... STORAGE RECORD                 */ 00502000
*               /*                                                   */ 00503000
*               /*****************************************************/ 00504000
*                                                               02S0268 00505000
*               DO;                 /* SECOND, THIRD, ... RECORD     */ 00506000
         B     @RC00248                                         02S0268 00507000
@RF00248 DS    0H                                               02S0269 00508000
*                 IF(ESBAKEY&KMK)^=(HSDSK1&KMK) THEN/* MULTIPLE KEYS */ 00509000
         MVC   @TS00001(1),ESBAKEY(ESBAPTR)                     02S0269 00510000
         NI    @TS00001,X'F8'                                   02S0269 00511000
         MVC   @TS00001+1(1),HSDSK1(HSDPTR)                     02S0269 00512000
         NI    @TS00001+1,X'F8'                                 02S0269 00513000
         CLC   @TS00001(1),@TS00001+1                           02S0269 00514000
         BE    @RF00269                                         02S0269 00515000
*                   ESBAFS2='1'B;   /* MULTIPLE STORAGE KEYS         */ 00516000
         OI    ESBAFS2(ESBAPTR),B'01000000'                     02S0270 00517000
*                 IF AMTLEFT>ZZZLENP2 THEN/* BOTH STORAGE KEYS APPLY */ 00518000
*                                                               02S0271 00519000
@RF00269 CLC   AMTLEFT(4),@CF00094                              02S0271 00520000
         BNH   @RF00271                                         02S0271 00521000
*                   /*************************************************/ 00522000
*                   /*                                               */ 00523000
*                   /* BOTH STORAGE KEYS FROM THIS FRAME APPLY       */ 00524000
*                   /*                                               */ 00525000
*                   /*************************************************/ 00526000
*                                                               02S0272 00527000
*                   DO;             /* BOTH STORAGE KEYS APPLY       */ 00528000
*                     ESBAKEY=ESBAKEY|(HSDSK2&KMU);/* USAGE BITS     */ 00529000
         MVC   @TS00001(1),HSDSK2(HSDPTR)                       02S0273 00530000
         NI    @TS00001,X'07'                                   02S0273 00531000
         OC    ESBAKEY(1,ESBAPTR),@TS00001                      02S0273 00532000
*                     IF(ESBAKEY&KMK)^=(HSDSK2&KMK) THEN        02S0274 00533000
         MVC   @TS00001(1),ESBAKEY(ESBAPTR)                     02S0274 00534000
         NI    @TS00001,X'F8'                                   02S0274 00535000
         MVC   @TS00001+1(1),HSDSK2(HSDPTR)                     02S0274 00536000
         NI    @TS00001+1,X'F8'                                 02S0274 00537000
         CLC   @TS00001(1),@TS00001+1                           02S0274 00538000
         BE    @RF00274                                         02S0274 00539000
*                       ESBAFS2='1'B;/* MULTIPLE STORAGE KEYS        */ 00540000
         OI    ESBAFS2(ESBAPTR),B'01000000'                     02S0275 00541000
*                   END;            /* BOTH STORAGE KEYS APPLY       */ 00542000
@RF00274 DS    0H                                               02S0277 00543000
*               END;                /* SECOND, THIRD, ... RECORD     */ 00544000
@RF00271 DS    0H                                               02S0278 00545000
*             IF RAAURFP(1)='1'B THEN/* PREFIXED PAGE                */ 00546000
@RC00248 TM    RAAURFP,B'01000000'                              02S0278 00547000
         BNO   @RF00278                                         02S0278 00548000
*               ESBAFSP='1'B;       /* PREFIXED PAGE                 */ 00549000
         OI    ESBAFSP(ESBAPTR),B'00001000'                     02S0279 00550000
*             IF RAAURFR(1)='1'B THEN/* RECLAIMED PAGE               */ 00551000
@RF00278 TM    RAAURFR,B'00100000'                              02S0280 00552000
         BNO   @RF00280                                         02S0280 00553000
*               ESBAFSR='1'B;       /* RECLAIMED PAGE                */ 00554000
         OI    ESBAFSR(ESBAPTR),B'00000100'                     02S0281 00555000
*           END;                    /* NO SUMDUMP DATA               */ 00556000
@RF00280 DS    0H                                               02S0283 00557000
*       END;                        /* SYSTEM/370 DUMP STORAGE       */ 00558000
@RF00246 DS    0H                                               02S0284 00559000
*     IF ESBAFSC='0'B THEN          /* FIRST STORAGE RECORD          */ 00560000
@RF00239 TM    ESBAFSC(ESBAPTR),B'10000000'                     01S0284 00561000
         BNZ   @RF00284                                         01S0284 00562000
*       ESBAFSC='1'B;               /* STORAGE INFORMATION COMPLETED */ 00563000
         OI    ESBAFSC(ESBAPTR),B'10000000'                     01S0285 00564000
*     ELSE                          /* MULTIPLE RECORDS              */ 00565000
*       ESBAFSX='1'B;               /* MULTIPLE RECORDS              */ 00566000
         B     @RC00284                                         01S0286 00567000
@RF00284 OI    ESBAFSX(ESBAPTR),B'00000010'                     01S0286 00568000
*                                                               02S0287 00569000
*/********************************************************************/ 00570000
*/*                                                                  */ 00571000
*/* BLSRACCM--MOVE DATA INTO USER BUFFER                             */ 00572000
*/*                                                                  */ 00573000
*/********************************************************************/ 00574000
*                                                               02S0287 00575000
*     OFFINBLK=CURADDR-RAAURIA(1);  /* UNINTERESTING BYTE COUNT      */ 00576000
@RC00284 LR    @14,CURADDR                                      02S0287 00577000
         SL    @14,RAAURIA                                      02S0287 00578000
         ST    @14,OFFINBLK                                     02S0287 00579000
*     AMTOMOVE=MIN(AMTLEFT,RAAURLE(1)-OFFINBLK);/* STORAGE TO MOVE   */ 00580000
         L     @05,RAAURLE                                      02S0288 00581000
         SLR   @05,@14                                          02S0288 00582000
         L     @04,AMTLEFT                                      02S0288 00583000
         CLR   @04,@05                                          02S0288 00584000
         BNH   *+6                                                      00585000
         LR    @04,@05                                          02S0288 00586000
         ST    @04,AMTOMOVE                                     02S0288 00587000
*     RESPECIFY                     /* BEFORE MVCL                   */ 00588000
*      (R0,                         /* ->USER BUFFER                 */ 00589000
*       R1,                         /* STORAGE TO MOVE               */ 00590000
*       RE) RESTRICTED;             /* ->INPUT BUFFER                */ 00591000
*     R0=CURBUFAD;                  /* ->CURRENT BUFFER POSITION     */ 00592000
         L     R0,CURBUFAD                                      02S0290 00593000
*     R1=AMTOMOVE;                  /* STORAGE TO MOVE               */ 00594000
         LR    R1,@04                                           02S0291 00595000
*     RE=ADDR(HSD)+RAAUROF(1)+OFFINBLK;/* ->INPUT BUFFER             */ 00596000
         L     @05,OFFINBLK                                     02S0292 00597000
         LR    RE,HSDPTR                                        02S0292 00598000
         AL    RE,RAAUROF                                       02S0292 00599000
         ALR   RE,@05                                           02S0292 00600000
*     RF=R1;                        /* STORAGE TO MOVE               */ 00601000
         LR    RF,R1                                            02S0293 00602000
*     MVCL(R0,RE);                  /* FILL USER BUFFER              */ 00603000
         MVCL  R0,RE                                            02S0294 00604000
*     CURBUFAD=R0;                  /* ->CURRENT BUFFER POSITION     */ 00605000
         ST    R0,CURBUFAD                                      02S0295 00606000
*     RESPECIFY                     /* AFTER MVCL                    */ 00607000
*      (R0,                         /* ->USER BUFFER+LENGTH MOVED    */ 00608000
*       R1,                         /* 0                             */ 00609000
*       RE) UNRESTRICTED;           /* ->INPUT BUFFER+LENGTH MOVED   */ 00610000
*     AMTLEFT=AMTLEFT-AMTOMOVE;     /* REQUESTED STORAGE REMAINING   */ 00611000
         L     @14,AMTOMOVE                                     02S0297 00612000
         L     @07,AMTLEFT                                      02S0297 00613000
         SLR   @07,@14                                          02S0297 00614000
         ST    @07,AMTLEFT                                      02S0297 00615000
*     CURADDR=CURADDR+AMTOMOVE;     /* ->CURRENT STORAGE POSITION    */ 00616000
         ALR   CURADDR,@14                                      02S0298 00617000
*   END;                            /* ACCESS ALL STORAGE REQUESTED  */ 00618000
@DE00177 ICM   @14,15,AMTLEFT                                   01S0299 00619000
         BP    @DL00177                                         01S0299 00620000
*EXIT:                              /* COMMON EXIT PATH              */ 00621000
*   RETURN CODE(RETC);                                          01S0300 00622000
*                                                               01S0300 00623000
EXIT     L     @13,4(,@13)                                      01S0300 00624000
         L     @00,@SIZDATD                                     01S0300 00625000
         LR    @01,@11                                          01S0300 00626000
         BLSUFRES R,LV=(0),A=(1)                                        00627000
         LR    @15,@08                                          01S0300 00628000
         L     @14,12(,@13)                                     01S0300 00629000
         LM    @00,@12,20(@13)                                  01S0300 00630000
         BR    @14                                              01S0300 00631000
*/*BLSRPEND--DEBUGGING MODULE                                        */ 00632000
*/*BLSUPEND--MVS IPCS MODULE                                         */ 00633000
*                                                               01S0301 00634000
*   DECLARE                         /* COMMON VARIABLES              */ 00635000
*     I256C CHAR(256) BASED,                                    01S0301 00636000
*     I031F FIXED(31) BASED,                                    01S0301 00637000
*     I031P PTR(31) BASED,                                      01S0301 00638000
*     I015F FIXED(15) BASED,                                    01S0301 00639000
*     I015P PTR(15) BASED,                                      01S0301 00640000
*     I008P PTR(8) BASED,                                       01S0301 00641000
*     I001C CHAR(1) BASED;                                      01S0301 00642000
*   GENERATE NODEFS NOREFS DATA;                                01S0302 00643000
*   END BLSRACCQ                    /* BLRPEND(BLSRACCQ)             */ 00644000
*                                                               01S0303 00645000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00646000
*/*%INCLUDE SYSLIB  (BLSRZZZ )                                       */ 00647000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00648000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00649000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00650000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00651000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00652000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00653000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00654000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00655000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00656000
*/*%INCLUDE SYSLIB  (BLSRSERV)                                       */ 00657000
*/*%INCLUDE SYSLIB  (BLSRHSD )                                       */ 00658000
*/*%INCLUDE SYSLIB  (IHADECB )                                       */ 00659000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 00660000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 00661000
*/*%INCLUDE SYSLIB  (BLSRACCR)                                       */ 00662000
*/*%INCLUDE SYSLIB  (BLSRACCS)                                       */ 00663000
*/*%INCLUDE SYSLIB  (BLSRACCM)                                       */ 00664000
*                                                               01S0303 00665000
*       ;                                                       01S0303 00666000
@EL00001 L     @13,4(,@13)                                      01S0303 00667000
@EF00001 L     @00,@SIZDATD                                     01S0303 00668000
         LR    @01,@11                                          01S0303 00669000
         BLSUFRES R,LV=(0),A=(1)                                        00670000
@ER00001 LM    @14,@12,12(@13)                                  01S0303 00671000
         BR    @14                                              01S0303 00672000
@DATA    DS    0H                                                       00673000
@CH00048 DC    H'1'                                                     00674000
@CH00056 DC    H'8'                                                     00675000
@CH00091 DC    AL2(65530)                                               00676000
@DATD    DSECT                                                          00677000
         DS    0F                                                       00678000
@SA00001 DS    18F                                                      00679000
@PC00001 DS    3F                                                       00680000
@AL00001 DS    2A                                                       00681000
@TF00001 DS    F                                                        00682000
@TF00002 DS    F                                                        00683000
BLSRACCQ CSECT                                                          00684000
         DS    0F                                                       00685000
@CF00094 DC    F'2048'                                                  00686000
@CF00118 DC    XL4'00000FFF'                                            00687000
@DATD    DSECT                                                          00688000
         DS    0D                                                       00689000
CURBUFAD DS    A                                                        00690000
AMTLEFT  DS    F                                                        00691000
AMTOMOVE DS    F                                                        00692000
OFFINBLK DS    F                                                        00693000
@TS00001 DS    CL2                                                      00694000
         DS    CL2                                                      00695000
ASAU     DS    CL16                                                     00696000
         ORG   ASAU                                                     00697000
ASAU0    DS    0C                                                       00698000
ASAUT    DS    CL2                                                      00699000
@NM00146 DS    BL2                                                      00700000
ASAU1    DS    FL4                                                      00701000
ASAU2    DS    FL4                                                      00702000
@NM00147 DS    BL4                                                      00703000
ASAU9    DS    0C                                                       00704000
         ORG   ASAU+16                                                  00705000
         DS    CL4                                                      00706000
RAAU     DS    CL148                                                    00707000
         ORG   RAAU                                                     00708000
RAAURID  DS    CL2                                                      00709000
@NM00160 DS    BL6                                                      00710000
RAAURDX  DS    FL4                                                      00711000
RAAUAS   DS    CL16                                                     00712000
         ORG   RAAUAS                                                   00713000
RAAUAS0  DS    0C                                                       00714000
RAAUAST  DS    CL2                                                      00715000
@NM00161 DS    BL2                                                      00716000
RAAUAS1  DS    FL4                                                      00717000
RAAUAS2  DS    FL4                                                      00718000
@NM00162 DS    BL4                                                      00719000
RAAUAS9  DS    0C                                                       00720000
         ORG   RAAU+28                                                  00721000
RAAUFAD  DS    AL4                                                      00722000
RAAUELK  DS    0C                                                       00723000
@NM00163 DS    BL16                                                     00724000
RAAUDIM  DS    FL2                                                      00725000
RAAUUSE  DS    FL2                                                      00726000
RAAUR    DS    CL32                                                     00727000
         ORG   RAAUR+0                                                  00728000
RAAURIA  DS    AL4                                                      00729000
RAAURLE  DS    FL4                                                      00730000
RAAURNM  DS    FL2                                                      00731000
RAAURF   DS    BL2                                                      00732000
         ORG   RAAURF+0                                                 00733000
RAAURFU  DS    BL1                                                      00734000
RAAURFP  EQU   RAAURF+0                                                 00735000
RAAURFR  EQU   RAAURF+0                                                 00736000
@NM00164 EQU   RAAURF+0                                                 00737000
         ORG   RAAUR+12                                                 00738000
RAAURDA  DS    FL4                                                      00739000
RAAUROF  DS    FL4                                                      00740000
@NM00165 DS    BL12                                                     00741000
         ORG   RAAU+148                                                 00742000
RAAU999  DS    0C                                                       00743000
         ORG   RAAU+148                                                 00744000
BLSRACCQ CSECT                                                          00745000
         DS    0F                                                       00746000
@SIZDATD DC    AL1(0)                                                   00747000
         DC    AL3(@ENDDATD-@DATD)                                      00748000
         DS    0D                                                       00749000
@DATD    DSECT                                                          00750000
         SPACE 2                                                        00751000
*********************************************************************** 00752000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00753000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 00754000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 00755000
*********************************************************************** 00756000
         SPACE                                                          00757000
BLSRACCQ CSECT                                                          00758000
         ORG                                                            00759000
         DS    0D                                                       00760000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSRACCQ+19)/20+7)/8)CL8'BLSRACCQ'     00761000
@DATD    DSECT                                                          00762000
         DS    0H                                                       00763000
@DATD    DSECT                                                          00764000
BLSRACCQ CSECT                                                          00765000
*--------------SDATA AND ADATA MUST HAVE THE SAME FORMAT--------------* 00766000
SDATA    DS    0D                      STATIC STORAGE STRUCTURE         00767000
SREAD    READ  SDECB,DI,,,,,,,MF=L                                      00768000
SDATAEND DS    0D                      END OF SDATA STRUCTURE           00769000
@DATD    DSECT                                                          00770000
ADATA    DS    0D                      AUTOMATIC STORAGE STRUCTURE      00771000
AREAD    READ  ADECB,DI,,,,,,,MF=L                                      00772000
ADATAEND DS    0D                      END OF ADATA STRUCTURE           00773000
@DATD    DSECT                                                          00774000
         SPACE 2                                                        00775000
*********************************************************************** 00776000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 00777000
*********************************************************************** 00778000
         SPACE                                                          00779000
         DS    0D                                                       00780000
@DATD    DSECT                                                          00781000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00782000
@ENDDATD EQU   *                                                        00783000
BLSRACCQ CSECT                                                          00784000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00785000
@01      EQU   01                                                       00786000
@02      EQU   02                                                       00787000
@03      EQU   03                                                       00788000
@04      EQU   04                                                       00789000
@05      EQU   05                                                       00790000
@06      EQU   06                                                       00791000
@07      EQU   07                                                       00792000
@08      EQU   08                                                       00793000
@09      EQU   09                                                       00794000
@10      EQU   10                                                       00795000
@11      EQU   11                                                       00796000
@12      EQU   12                                                       00797000
@13      EQU   13                                                       00798000
@14      EQU   14                                                       00799000
@15      EQU   15                                                       00800000
RETC     EQU   @08                                                      00801000
BUFSTEAL EQU   @04                                                      00802000
BUFNUM   EQU   @02                                                      00803000
P1       EQU   @02                                                      00804000
CURADDR  EQU   @10                                                      00805000
ESBAPTR  EQU   @06                                                      00806000
DECBPT   EQU   @07                                                      00807000
HSDPTR   EQU   @07                                                      00808000
R9       EQU   @09                                                      00809000
R0       EQU   @00                                                      00810000
R1       EQU   @01                                                      00811000
R2       EQU   @02                                                      00812000
R3       EQU   @03                                                      00813000
R4       EQU   @04                                                      00814000
R5       EQU   @05                                                      00815000
RB       EQU   @11                                                      00816000
RD       EQU   @13                                                      00817000
RE       EQU   @14                                                      00818000
RF       EQU   @15                                                      00819000
RA       EQU   @10                                                      00820000
RC       EQU   @12                                                      00821000
R6       EQU   @06                                                      00822000
R7       EQU   @07                                                      00823000
R8       EQU   @08                                                      00824000
ZZ1      EQU   0                                                        00825000
ZZ1ATTN  EQU   ZZ1+360                                                  00826000
ZZ1EVE   EQU   ZZ1ATTN+4                                                00827000
ZZ1EVEP  EQU   ZZ1EVE                                                   00828000
ZZ1F     EQU   ZZ1+368                                                  00829000
ZZ1N     EQU   ZZ1+1116                                                 00830000
ZZ2      EQU   0                                                        00831000
ZZ2AMD   EQU   ZZ2                                                      00832000
@NM00025 EQU   ZZ2AMD+7                                                 00833000
ZZ2PRT   EQU   ZZ2+138                                                  00834000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 00835000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                00836000
ZZ2A     EQU   ZZ2+272                                                  00837000
ZZ2AF    EQU   ZZ2A+16                                                  00838000
ZZ2APID  EQU   ZZ2A+64                                                  00839000
ZZ2AD    EQU   ZZ2A+74                                                  00840000
ZZ2ADD   EQU   ZZ2AD                                                    00841000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 00842000
ZZ2ADM   EQU   ZZ2AD+46                                                 00843000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 00844000
ZZ2ADP   EQU   ZZ2AD+56                                                 00845000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 00846000
ZZ2AZZ6P EQU   ZZ2A+140                                                 00847000
ZZ2AQAS  EQU   ZZ2A+144                                                 00848000
ZZ2AQD   EQU   ZZ2A+160                                                 00849000
ZZ2AQDT  EQU   ZZ2AQD+10                                                00850000
ZZ2AQDF  EQU   ZZ2AQD+52                                                00851000
ZZ2STG   EQU   ZZ2+960                                                  00852000
ZZ2ALLOP EQU   ZZ2+992                                                  00853000
ZZ2FREEP EQU   ZZ2+996                                                  00854000
ZZ2FF19P EQU   ZZ2+1000                                                 00855000
ZZ2FRE1P EQU   ZZ2+1004                                                 00856000
ZZ2FF18P EQU   ZZ2+1008                                                 00857000
ZZ2DYNAP EQU   ZZ2+1012                                                 00858000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 00859000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 00860000
ZZ2STAIP EQU   ZZ2+1024                                                 00861000
ZZ2FF02P EQU   ZZ2+1028                                                 00862000
ZZ2GETLP EQU   ZZ2+1032                                                 00863000
ZZ2PARSP EQU   ZZ2+1036                                                 00864000
ZZ2PTGTP EQU   ZZ2+1040                                                 00865000
ZZ2PUTLP EQU   ZZ2+1044                                                 00866000
ZZ2SCANP EQU   ZZ2+1048                                                 00867000
ZZ2STCKP EQU   ZZ2+1052                                                 00868000
ZZ2TRMOP EQU   ZZ2+1064                                                 00869000
ZZ2TRMVP EQU   ZZ2+1068                                                 00870000
ZZ2PUTNP EQU   ZZ2+1084                                                 00871000
ZZ2TRMNP EQU   ZZ2+1088                                                 00872000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 00873000
ZZ2BVTP  EQU   ZZ2+1280                                                 00874000
ZZ2RVTP  EQU   ZZ2+1284                                                 00875000
ZZ2CPPL  EQU   ZZ2+1292                                                 00876000
ZZ2CPPLC EQU   ZZ2CPPL                                                  00877000
ZZ2ITR   EQU   ZZ2+2840                                                 00878000
ZZ2ITRE  EQU   ZZ2ITR+16                                                00879000
ZZ2ITSE  EQU   ZZ2+2864                                                 00880000
ZZ2ES    EQU   ZZ2+2872                                                 00881000
ZZ2AMDX  EQU   ZZ2+7160                                                 00882000
ZZ2AXO   EQU   ZZ2+7934                                                 00883000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 00884000
CMD      EQU   0                                                        00885000
CMDT     EQU   CMD+4                                                    00886000
PSCB     EQU   0                                                        00887000
PSCBATR1 EQU   PSCB+16                                                  00888000
ECT      EQU   0                                                        00889000
ECTSWS   EQU   ECT+28                                                   00890000
ECTSWS2  EQU   ECT+40                                                   00891000
ECTSWS21 EQU   ECTSWS2                                                  00892000
UPT      EQU   0                                                        00893000
UPTSWS   EQU   UPT+12                                                   00894000
SA       EQU   0                                                        00895000
SA1      EQU   SA                                                       00896000
SAR      EQU   SA+12                                                    00897000
SAR1     EQU   SAR+12                                                   00898000
BVT      EQU   0                                                        00899000
BVTPUTLP EQU   BVT+4                                                    00900000
BVTPUTOP EQU   BVT+12                                                   00901000
BVTPUTTP EQU   BVT+16                                                   00902000
BVTPUTVP EQU   BVT+20                                                   00903000
BVTPUTAP EQU   BVT+24                                                   00904000
BVTPRTTP EQU   BVT+28                                                   00905000
BVTPRTAP EQU   BVT+32                                                   00906000
BVTPUTDP EQU   BVT+36                                                   00907000
BVTMONP  EQU   BVT+40                                                   00908000
BVTMON2P EQU   BVT+44                                                   00909000
BVTVSARP EQU   BVT+48                                                   00910000
BVTVSENP EQU   BVT+64                                                   00911000
BVTVSERP EQU   BVT+68                                                   00912000
BVTVSGEP EQU   BVT+72                                                   00913000
BVTVSGUP EQU   BVT+76                                                   00914000
BVTVSPOP EQU   BVT+80                                                   00915000
BVTVSPUP EQU   BVT+84                                                   00916000
BVTMPKNP EQU   BVT+104                                                  00917000
BVTMONLP EQU   BVT+108                                                  00918000
BVTPUTCP EQU   BVT+132                                                  00919000
BVTMPK1P EQU   BVT+136                                                  00920000
BVTZZ2RP EQU   BVT+140                                                  00921000
BVTPGMRP EQU   BVT+144                                                  00922000
BVTMONAP EQU   BVT+148                                                  00923000
BVTBLDDP EQU   BVT+152                                                  00924000
BVTBLDLP EQU   BVT+156                                                  00925000
BVTPGMCP EQU   BVT+160                                                  00926000
BVTPGMDP EQU   BVT+164                                                  00927000
BVTPGMLP EQU   BVT+168                                                  00928000
BVTMONCP EQU   BVT+180                                                  00929000
BVTMONDP EQU   BVT+184                                                  00930000
BVTMONTP EQU   BVT+188                                                  00931000
BVTPARIP EQU   BVT+192                                                  00932000
BVTPARUP EQU   BVT+196                                                  00933000
BVTPRTNP EQU   BVT+204                                                  00934000
BVTVSCRP EQU   BVT+208                                                  00935000
BVTVSMRP EQU   BVT+212                                                  00936000
BVTMONXP EQU   BVT+216                                                  00937000
BVTTRMAP EQU   BVT+228                                                  00938000
ZZ6      EQU   0                                                        00939000
ZZ6D     EQU   ZZ6+128                                                  00940000
ZZ6DD    EQU   ZZ6D+8                                                   00941000
ZZ6DDT   EQU   ZZ6DD+4                                                  00942000
ZZ6DQA   EQU   ZZ6D+68                                                  00943000
ZZ6DF    EQU   ZZ6D+92                                                  00944000
ZZ6DFDU  EQU   ZZ6DF                                                    00945000
ZZ6DDA1  EQU   ZZ6D+100                                                 00946000
ZZ6BUFN  EQU   ZZ6+516                                                  00947000
ZZ6BUFL  EQU   ZZ6+518                                                  00948000
ZZ6BUFB  EQU   ZZ6+520                                                  00949000
ZZ6BUFP  EQU   ZZ6+532                                                  00950000
ZZ6BUFI  EQU   ZZ6+536                                                  00951000
ZZ6B     EQU   ZZ6+768                                                  00952000
ZZ6BDA   EQU   ZZ6B                                                     00953000
ZZ6BFL   EQU   ZZ6B+4                                                   00954000
ZZ6BRC   EQU   ZZ6B+8                                                   00955000
ZZ6BRB   EQU   ZZ6B+12                                                  00956000
BLSRESCK EQU   0                                                        00957000
BLSRRAGE EQU   0                                                        00958000
RVT      EQU   0                                                        00959000
RVTADDRP EQU   RVT                                                      00960000
RVTT01P  EQU   RVT+4                                                    00961000
RVTTAP   EQU   RVT+8                                                    00962000
RVTTBP   EQU   RVT+12                                                   00963000
RVTTCP   EQU   RVT+16                                                   00964000
RVTTFP   EQU   RVT+24                                                   00965000
RVTTYP   EQU   RVT+40                                                   00966000
RVTT02P  EQU   RVT+48                                                   00967000
RVTT03P  EQU   RVT+52                                                   00968000
RVTT04P  EQU   RVT+56                                                   00969000
RVTACCLP EQU   RVT+60                                                   00970000
RVTRACCP EQU   RVT+64                                                   00971000
RVTTLP   EQU   RVT+68                                                   00972000
RVTTMP   EQU   RVT+72                                                   00973000
RVTTUP   EQU   RVT+80                                                   00974000
RVTESGEP EQU   RVT+84                                                   00975000
RVTESGUP EQU   RVT+88                                                   00976000
RVTESARP EQU   RVT+92                                                   00977000
RVTRAARP EQU   RVT+96                                                   00978000
RVTRAGEP EQU   RVT+100                                                  00979000
RVTADDPP EQU   RVT+104                                                  00980000
RVTSAGUP EQU   RVT+124                                                  00981000
RVTSAGEP EQU   RVT+128                                                  00982000
RVTESCKP EQU   RVT+132                                                  00983000
RVTMSGAP EQU   RVT+136                                                  00984000
RVTMSGDP EQU   RVT+140                                                  00985000
RVTADDTP EQU   RVT+160                                                  00986000
RVTADDUP EQU   RVT+164                                                  00987000
RVTADD1P EQU   RVT+176                                                  00988000
RVTADD2P EQU   RVT+180                                                  00989000
RVTRSAGP EQU   RVT+184                                                  00990000
RVTMSGBP EQU   RVT+188                                                  00991000
RVTADDSP EQU   RVT+192                                                  00992000
RVTADD3P EQU   RVT+196                                                  00993000
RVTT05P  EQU   RVT+200                                                  00994000
RVTPADSP EQU   RVT+204                                                  00995000
RVTTRP   EQU   RVT+228                                                  00996000
RVTADD4P EQU   RVT+232                                                  00997000
RVTSAPCP EQU   RVT+236                                                  00998000
RVTSAARP EQU   RVT+240                                                  00999000
RVTSAGNP EQU   RVT+244                                                  01000000
RVTT06P  EQU   RVT+248                                                  01001000
RVTSAGCP EQU   RVT+252                                                  01002000
RVTSAGQP EQU   RVT+256                                                  01003000
RVTESGCP EQU   RVT+260                                                  01004000
RVTESGQP EQU   RVT+264                                                  01005000
RVTDUCKP EQU   RVT+276                                                  01006000
RVTDUCCP EQU   RVT+280                                                  01007000
HSD      EQU   0                                                        01008000
HSDTYPE  EQU   HSD                                                      01009000
DECB     EQU   0                                                        01010000
DECBPTR  EQU   DECB+4                                                   01011000
DECTYPE  EQU   DECBPTR                                                  01012000
DECTYPE1 EQU   DECTYPE                                                  01013000
DECTYPE2 EQU   DECTYPE+1                                                01014000
DECNEXT  EQU   DECB+20                                                  01015000
DECBS01  EQU   0                                                        01016000
DECBECB  EQU   DECBS01                                                  01017000
DECBRB   EQU   DECBECB                                                  01018000
DECBECBF EQU   DECBRB                                                   01019000
DECBTYP1 EQU   DECBS01+4                                                01020000
DECBTYP2 EQU   DECBS01+5                                                01021000
DECBEXC1 EQU   DECBS01+24                                               01022000
DECBEXC2 EQU   DECBS01+25                                               01023000
DECBS02  EQU   0                                                        01024000
@NM00110 EQU   DECBS02                                                  01025000
DECCC2   EQU   @NM00110+1                                               01026000
DECCC3   EQU   @NM00110+2                                               01027000
@NM00112 EQU   DECBS02+4                                                01028000
@NM00113 EQU   @NM00112                                                 01029000
@NM00114 EQU   @NM00112+1                                               01030000
DECTYPRU EQU   @NM00114                                                 01031000
DECNA    EQU   DECBS02+28                                               01032000
DECBS03  EQU   0                                                        01033000
DECCPOL  EQU   DECBS03+20                                               01034000
@NM00122 EQU   DECBS03+36                                               01035000
DECBS04  EQU   0                                                        01036000
@NM00125 EQU   DECBS04+4                                                01037000
@NM00126 EQU   @NM00125                                                 01038000
@NM00129 EQU   DECBS04+8                                                01039000
DECBUFCT EQU   @NM00129                                                 01040000
DECONLTT EQU   DECBUFCT                                                 01041000
DECENTRY EQU   DECBS04+20                                               01042000
DECFLAGS EQU   DECBS04+24                                               01043000
DECWACK  EQU   DECFLAGS                                                 01044000
DECREVRS EQU   DECFLAGS                                                 01045000
DECERRST EQU   DECBS04+29                                               01046000
DECPOLPT EQU   DECBS04+36                                               01047000
IHADCB   EQU   0                                                        01048000
IHADCS00 EQU   0                                                        01049000
DCBFDAD  EQU   IHADCS00+5                                               01050000
IHADCS01 EQU   0                                                        01051000
DCBDVTBL EQU   IHADCS01                                                 01052000
IHADCS11 EQU   0                                                        01053000
DCBRELB  EQU   IHADCS11                                                 01054000
DCBREL   EQU   DCBRELB+1                                                01055000
DCBBUFCB EQU   IHADCS11+4                                               01056000
DCBDSORG EQU   IHADCS11+10                                              01057000
DCBDSRG1 EQU   DCBDSORG                                                 01058000
DCBDSRG2 EQU   DCBDSORG+1                                               01059000
DCBIOBAD EQU   IHADCS11+12                                              01060000
DCBODEB  EQU   DCBIOBAD                                                 01061000
DCBLNP   EQU   DCBODEB                                                  01062000
DCBQSLM  EQU   DCBLNP                                                   01063000
DCBIOBAA EQU   DCBODEB+1                                                01064000
IHADCS50 EQU   0                                                        01065000
DCBSVCXL EQU   IHADCS50                                                 01066000
DCBEODAD EQU   IHADCS50+4                                               01067000
DCBBFALN EQU   DCBEODAD                                                 01068000
DCBHIARC EQU   DCBBFALN                                                 01069000
DCBBFTEK EQU   DCBHIARC                                                 01070000
DCBBFT   EQU   DCBBFTEK                                                 01071000
DCBEXLST EQU   IHADCS50+8                                               01072000
DCBRECFM EQU   DCBEXLST                                                 01073000
DCBRECLA EQU   DCBRECFM                                                 01074000
IHADCS24 EQU   0                                                        01075000
DCBOFLGS EQU   IHADCS24+8                                               01076000
DCBOFLWR EQU   DCBOFLGS                                                 01077000
DCBIFLG  EQU   IHADCS24+9                                               01078000
DCBIBPCT EQU   DCBIFLG                                                  01079000
DCBMACR  EQU   IHADCS24+10                                              01080000
DCBMACR1 EQU   DCBMACR                                                  01081000
DCBMRFE  EQU   DCBMACR1                                                 01082000
DCBMRGET EQU   DCBMRFE                                                  01083000
DCBMRAPG EQU   DCBMACR1                                                 01084000
DCBMRRD  EQU   DCBMRAPG                                                 01085000
DCBMRCI  EQU   DCBMACR1                                                 01086000
DCBMRMVG EQU   DCBMRCI                                                  01087000
DCBMRLCG EQU   DCBMACR1                                                 01088000
DCBMRABC EQU   DCBMACR1                                                 01089000
DCBMRPT1 EQU   DCBMRABC                                                 01090000
DCBMRSBG EQU   DCBMRPT1                                                 01091000
DCBMRCRL EQU   DCBMACR1                                                 01092000
DCBMRCHK EQU   DCBMRCRL                                                 01093000
DCBMRRDX EQU   DCBMRCHK                                                 01094000
DCBMRDMG EQU   DCBMACR1                                                 01095000
DCBMACR2 EQU   DCBMACR+1                                                01096000
DCBMRPUT EQU   DCBMACR2                                                 01097000
DCBMRWRT EQU   DCBMACR2                                                 01098000
DCBMRMVP EQU   DCBMACR2                                                 01099000
DCBMR5WD EQU   DCBMACR2                                                 01100000
DCBMRLDM EQU   DCBMR5WD                                                 01101000
DCBMRLCP EQU   DCBMRLDM                                                 01102000
DCBMR4WD EQU   DCBMACR2                                                 01103000
DCBMRPT2 EQU   DCBMR4WD                                                 01104000
DCBMRTMD EQU   DCBMRPT2                                                 01105000
DCBMR3WD EQU   DCBMACR2                                                 01106000
DCBMRCTL EQU   DCBMR3WD                                                 01107000
DCBMRSTK EQU   DCBMRCTL                                                 01108000
DCBMR1WD EQU   DCBMACR2                                                 01109000
DCBMRSWA EQU   DCBMR1WD                                                 01110000
DCBMRDMD EQU   DCBMRSWA                                                 01111000
IHADCS25 EQU   0                                                        01112000
DCBMACRF EQU   IHADCS25+2                                               01113000
DCBMACF1 EQU   DCBMACRF                                                 01114000
DCBMFFE  EQU   DCBMACF1                                                 01115000
DCBMFGET EQU   DCBMFFE                                                  01116000
DCBMFAPG EQU   DCBMACF1                                                 01117000
DCBMFRD  EQU   DCBMFAPG                                                 01118000
DCBMFCI  EQU   DCBMACF1                                                 01119000
DCBMFMVG EQU   DCBMFCI                                                  01120000
DCBMFLCG EQU   DCBMACF1                                                 01121000
DCBMFABC EQU   DCBMACF1                                                 01122000
DCBMFPT1 EQU   DCBMFABC                                                 01123000
DCBMFSBG EQU   DCBMFPT1                                                 01124000
DCBMFCRL EQU   DCBMACF1                                                 01125000
DCBMFCHK EQU   DCBMFCRL                                                 01126000
DCBMFDMG EQU   DCBMACF1                                                 01127000
DCBMACF2 EQU   DCBMACRF+1                                               01128000
DCBMFPUT EQU   DCBMACF2                                                 01129000
DCBMFWRT EQU   DCBMACF2                                                 01130000
DCBMFMVP EQU   DCBMACF2                                                 01131000
DCBMF5WD EQU   DCBMACF2                                                 01132000
DCBMFLDM EQU   DCBMF5WD                                                 01133000
DCBMFLCP EQU   DCBMFLDM                                                 01134000
DCBMF4WD EQU   DCBMACF2                                                 01135000
DCBMFPT2 EQU   DCBMF4WD                                                 01136000
DCBMFTMD EQU   DCBMFPT2                                                 01137000
DCBMF3WD EQU   DCBMACF2                                                 01138000
DCBMFCTL EQU   DCBMF3WD                                                 01139000
DCBMFSTK EQU   DCBMFCTL                                                 01140000
DCBMF1WD EQU   DCBMACF2                                                 01141000
DCBMFSWA EQU   DCBMF1WD                                                 01142000
DCBMFDMD EQU   DCBMFSWA                                                 01143000
DCBDEBAD EQU   IHADCS25+4                                               01144000
DCBIFLGS EQU   DCBDEBAD                                                 01145000
DCBIFPCT EQU   DCBIFLGS                                                 01146000
IHADCS26 EQU   0                                                        01147000
DCBWRITE EQU   IHADCS26                                                 01148000
DCBREAD  EQU   DCBWRITE                                                 01149000
DCBWRITA EQU   DCBREAD+1                                                01150000
IHADCS30 EQU   0                                                        01151000
DCBCHECK EQU   IHADCS30                                                 01152000
DCBOPTCD EQU   DCBCHECK                                                 01153000
DCBXARG  EQU   IHADCS30+32                                              01154000
DCBDRDX  EQU   IHADCS30+36                                              01155000
ESBA     EQU   0                                                        01156000
ESBAAS   EQU   ESBA+60                                                  01157000
ESBALAD  EQU   ESBA+76                                                  01158000
ESBAD    EQU   ESBA+80                                                  01159000
ESBADOF  EQU   ESBAD                                                    01160000
ESBADLE  EQU   ESBAD+4                                                  01161000
ESBADT   EQU   ESBAD+10                                                 01162000
ESBADIM  EQU   ESBAD+44                                                 01163000
ESBADF   EQU   ESBAD+52                                                 01164000
ESBAMAD  EQU   ESBA+140                                                 01165000
ESBAKEY  EQU   ESBA+160                                                 01166000
ESBAF    EQU   ESBA+161                                                 01167000
ESBAFS   EQU   ESBAF                                                    01168000
ESBAFSC  EQU   ESBAFS                                                   01169000
ESBAFS2  EQU   ESBAFS                                                   01170000
ESBAFSM  EQU   ESBAFS                                                   01171000
ESBAFSA  EQU   ESBAFS                                                   01172000
ESBAFSP  EQU   ESBAFS                                                   01173000
ESBAFSR  EQU   ESBAFS                                                   01174000
ESBAFSX  EQU   ESBAFS                                                   01175000
ESBAFSS  EQU   ESBAFS                                                   01176000
ESBAFC   EQU   ESBAF+1                                                  01177000
ESBAABS  EQU   ESBA+164                                                 01178000
ESBAR    EQU   ESBA+180                                                 01179000
ESBART   EQU   ESBAR+2                                                  01180000
BLSRACC  EQU   0                                                        01181000
BLSRACCL EQU   0                                                        01182000
BLSRADDP EQU   0                                                        01183000
BLSRADDR EQU   0                                                        01184000
BLSRADDS EQU   0                                                        01185000
BLSRADDT EQU   0                                                        01186000
BLSRADDU EQU   0                                                        01187000
BLSRADD1 EQU   0                                                        01188000
BLSRADD2 EQU   0                                                        01189000
BLSRADD3 EQU   0                                                        01190000
BLSRADD4 EQU   0                                                        01191000
BLSRDUCC EQU   0                                                        01192000
BLSRDUCK EQU   0                                                        01193000
BLSRESAR EQU   0                                                        01194000
BLSRESGC EQU   0                                                        01195000
BLSRESGE EQU   0                                                        01196000
BLSRESGQ EQU   0                                                        01197000
BLSRESGU EQU   0                                                        01198000
BLSRMSGA EQU   0                                                        01199000
BLSRMSGB EQU   0                                                        01200000
BLSRMSGD EQU   0                                                        01201000
BLSRPADS EQU   0                                                        01202000
BLSRRAAR EQU   0                                                        01203000
BLSRSAAR EQU   0                                                        01204000
BLSRSAG  EQU   0                                                        01205000
BLSRSAGC EQU   0                                                        01206000
BLSRSAGE EQU   0                                                        01207000
BLSRSAGN EQU   0                                                        01208000
BLSRSAGQ EQU   0                                                        01209000
BLSRSAGU EQU   0                                                        01210000
BLSRSAPC EQU   0                                                        01211000
BLSTA    EQU   0                                                        01212000
BLSTB    EQU   0                                                        01213000
BLSTC    EQU   0                                                        01214000
BLSTF    EQU   0                                                        01215000
BLSTL    EQU   0                                                        01216000
BLSTM    EQU   0                                                        01217000
BLSTR    EQU   0                                                        01218000
BLSTU    EQU   0                                                        01219000
BLSTY    EQU   0                                                        01220000
BLST01   EQU   0                                                        01221000
BLST02   EQU   0                                                        01222000
BLST03   EQU   0                                                        01223000
BLST04   EQU   0                                                        01224000
BLST05   EQU   0                                                        01225000
BLST06   EQU   0                                                        01226000
BLSUALLO EQU   0                                                        01227000
BLSUBLDD EQU   0                                                        01228000
BLSUBLDL EQU   0                                                        01229000
BLSUDYNA EQU   0                                                        01230000
BLSUFREE EQU   0                                                        01231000
BLSUFRE1 EQU   0                                                        01232000
BLSUMON  EQU   0                                                        01233000
BLSUMONA EQU   0                                                        01234000
BLSUMONC EQU   0                                                        01235000
BLSUMOND EQU   0                                                        01236000
BLSUMONL EQU   0                                                        01237000
BLSUMONT EQU   0                                                        01238000
BLSUMONX EQU   0                                                        01239000
BLSUMON2 EQU   0                                                        01240000
BLSUMPKN EQU   0                                                        01241000
BLSUMPK1 EQU   0                                                        01242000
BLSUPARI EQU   0                                                        01243000
BLSUPARU EQU   0                                                        01244000
BLSUPGMC EQU   0                                                        01245000
BLSUPGMD EQU   0                                                        01246000
BLSUPGML EQU   0                                                        01247000
BLSUPGMR EQU   0                                                        01248000
BLSUPRTA EQU   0                                                        01249000
BLSUPRTN EQU   0                                                        01250000
BLSUPRTT EQU   0                                                        01251000
BLSUPUTA EQU   0                                                        01252000
BLSUPUTC EQU   0                                                        01253000
BLSUPUTD EQU   0                                                        01254000
BLSUPUTL EQU   0                                                        01255000
BLSUPUTN EQU   0                                                        01256000
BLSUPUTO EQU   0                                                        01257000
BLSUPUTT EQU   0                                                        01258000
BLSUPUTV EQU   0                                                        01259000
BLSUSTAI EQU   0                                                        01260000
BLSUTRMA EQU   0                                                        01261000
BLSUTRMN EQU   0                                                        01262000
BLSUTRMO EQU   0                                                        01263000
BLSUTRMV EQU   0                                                        01264000
BLSUVSAR EQU   0                                                        01265000
BLSUVSCR EQU   0                                                        01266000
BLSUVSEN EQU   0                                                        01267000
BLSUVSER EQU   0                                                        01268000
BLSUVSGE EQU   0                                                        01269000
BLSUVSGU EQU   0                                                        01270000
BLSUVSMR EQU   0                                                        01271000
BLSUVSPO EQU   0                                                        01272000
BLSUVSPU EQU   0                                                        01273000
BLSUZZ2C EQU   0                                                        01274000
BLSUZZ2D EQU   0                                                        01275000
BLSUZZ2R EQU   0                                                        01276000
IKJEFF02 EQU   0                                                        01277000
IKJEFF18 EQU   0                                                        01278000
IKJEFF19 EQU   0                                                        01279000
IKJGETL  EQU   0                                                        01280000
IKJPARS  EQU   0                                                        01281000
IKJPTGT  EQU   0                                                        01282000
IKJPUTL  EQU   0                                                        01283000
IKJSCAN  EQU   0                                                        01284000
IKJSTCK  EQU   0                                                        01285000
I001C    EQU   0                                                        01286000
I008P    EQU   0                                                        01287000
I015F    EQU   0                                                        01288000
I015P    EQU   0                                                        01289000
I031F    EQU   0                                                        01290000
I031P    EQU   0                                                        01291000
I256C    EQU   0                                                        01292000
PZ2      EQU   0                                                        01293000
ESPA     EQU   0                                                        01294000
ESPAAS   EQU   ESPA+60                                                  01295000
ESPAD    EQU   ESPA+80                                                  01296000
ESPADT   EQU   ESPAD+10                                                 01297000
ESPADF   EQU   ESPAD+52                                                 01298000
ESPAF    EQU   ESPA+161                                                 01299000
ESPAFS   EQU   ESPAF                                                    01300000
ESPAFC   EQU   ESPAF+1                                                  01301000
ESPAR    EQU   ESPA+180                                                 01302000
ESPART   EQU   ESPAR+2                                                  01303000
BUFFER   EQU   0                                                        01304000
CPPL     EQU   ZZ2CPPL                                                  01305000
CPPLUPT  EQU   CPPL+4                                                   01306000
CPPLPSCB EQU   CPPL+8                                                   01307000
CPPLECT  EQU   CPPL+12                                                  01308000
HSDH     EQU   HSD                                                      01309000
HSDHV    EQU   HSD                                                      01310000
HSDHA    EQU   HSD                                                      01311000
HSDC     EQU   HSD                                                      01312000
HSDCSF   EQU   HSDC+2                                                   01313000
HSDCPSA  EQU   HSDC+8                                                   01314000
HSDS     EQU   HSD                                                      01315000
HSDSK1   EQU   HSDS                                                     01316000
HSDSK2   EQU   HSDS+1                                                   01317000
HSDSASI  EQU   HSDS+2                                                   01318000
HSDSP    EQU   HSDS+4                                                   01319000
DECBS05  EQU   DECNEXT                                                  01320000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01321000
DECBLFMT EQU   DECBS05+8                                                01322000
DECBLNNM EQU   DECBS05+4                                                01323000
DECBHDRA EQU   DECBS05                                                  01324000
HSDSC    EQU   HSDS+8                                                   01325000
@NM00109 EQU   HSDCPSA+552                                              01326000
HSDCASCO EQU   HSDCPSA+548                                              01327000
HSDCASCN EQU   HSDCPSA+544                                              01328000
HSDCTCBO EQU   HSDCPSA+540                                              01329000
HSDCTCBN EQU   HSDCPSA+536                                              01330000
HSDCLCCR EQU   HSDCPSA+532                                              01331000
HSDCLCCV EQU   HSDCPSA+528                                              01332000
HSDCPCCR EQU   HSDCPSA+524                                              01333000
HSDCPCCV EQU   HSDCPSA+520                                              01334000
HSDCLADD EQU   HSDCPSA+518                                              01335000
HSDCPADD EQU   HSDCPSA+516                                              01336000
HSDCPSID EQU   HSDCPSA+512                                              01337000
HSDCTLR  EQU   HSDCPSA+448                                              01338000
HSDCGPR  EQU   HSDCPSA+384                                              01339000
HSDCFPR  EQU   HSDCPSA+352                                              01340000
HSDCADDR EQU   HSDCPSA+350                                              01341000
@NM00108 EQU   HSDCPSA+268                                              01342000
HSDCPREF EQU   HSDCPSA+264                                              01343000
HSDCLPSW EQU   HSDCPSA+256                                              01344000
@NM00107 EQU   HSDCPSA                                                  01345000
HSDCSCPU EQU   HSDC+6                                                   01346000
@NM00106 EQU   HSDC+4                                                   01347000
@NM00105 EQU   HSDCSF                                                   01348000
HSDCSFR  EQU   HSDCSF                                                   01349000
HSDCSFI  EQU   HSDCSF                                                   01350000
HSDCSFU  EQU   HSDCSF                                                   01351000
HSDCCLA  EQU   HSDC+1                                                   01352000
HSDCTYPE EQU   HSDC                                                     01353000
@NM00104 EQU   HSDHA+132                                                01354000
HSDHACAW EQU   HSDHA+128                                                01355000
HSDHACSW EQU   HSDHA+120                                                01356000
@NM00103 EQU   HSDHA+20                                                 01357000
@NM00102 EQU   HSDHA+12                                                 01358000
@NM00101 EQU   HSDHA+4                                                  01359000
@NM00100 EQU   HSDHA+2                                                  01360000
@NM00099 EQU   HSDHA+1                                                  01361000
@NM00098 EQU   HSDHA                                                    01362000
@NM00097 EQU   HSDHV+292                                                01363000
HSDHVCVT EQU   HSDHV+288                                                01364000
HSDHVPSW EQU   HSDHV+280                                                01365000
HSDHVCR  EQU   HSDHV+216                                                01366000
HSDHVGPR EQU   HSDHV+152                                                01367000
HSDHVFPR EQU   HSDHV+120                                                01368000
@NM00096 EQU   HSDHV+20                                                 01369000
@NM00095 EQU   HSDHV+12                                                 01370000
@NM00094 EQU   HSDHV+4                                                  01371000
@NM00093 EQU   HSDHV+2                                                  01372000
@NM00092 EQU   HSDHV+1                                                  01373000
@NM00091 EQU   HSDHV                                                    01374000
@NM00090 EQU   HSDH+120                                                 01375000
HSDHTITL EQU   HSDH+20                                                  01376000
HSDHTOD  EQU   HSDH+12                                                  01377000
HSDHPROG EQU   HSDH+4                                                   01378000
HSDHASI  EQU   HSDH+2                                                   01379000
HSDHCLA  EQU   HSDH+1                                                   01380000
HSDHTYPE EQU   HSDH                                                     01381000
CPPLCBUF EQU   CPPL                                                     01382000
ESPA999  EQU   ESPA+694                                                 01383000
ESPART1  EQU   ESPART                                                   01384000
ESPARL   EQU   ESPAR                                                    01385000
@NM00012 EQU   ESPA+168                                                 01386000
ESPAABS  EQU   ESPA+164                                                 01387000
@NM00011 EQU   ESPAF+2                                                  01388000
@NM00010 EQU   ESPAFC                                                   01389000
ESPAFCD  EQU   ESPAFC                                                   01390000
ESPAFSS  EQU   ESPAFS                                                   01391000
ESPAFSX  EQU   ESPAFS                                                   01392000
ESPAFSR  EQU   ESPAFS                                                   01393000
ESPAFSP  EQU   ESPAFS                                                   01394000
ESPAFSA  EQU   ESPAFS                                                   01395000
ESPAFSM  EQU   ESPAFS                                                   01396000
ESPAFS2  EQU   ESPAFS                                                   01397000
ESPAFSC  EQU   ESPAFS                                                   01398000
ESPAKEY  EQU   ESPA+160                                                 01399000
@NM00009 EQU   ESPA+144                                                 01400000
ESPAMAD  EQU   ESPA+140                                                 01401000
ESPAD99  EQU   ESPAD+60                                                 01402000
@NM00008 EQU   ESPAD+56                                                 01403000
@NM00007 EQU   ESPADF                                                   01404000
ESPADFA  EQU   ESPADF                                                   01405000
ESPADIL  EQU   ESPAD+48                                                 01406000
ESPADIM  EQU   ESPAD+44                                                 01407000
ESPADT9  EQU   ESPADT+34                                                01408000
ESPADTE  EQU   ESPADT+33                                                01409000
ESPADTD  EQU   ESPADT+2                                                 01410000
@NM00006 EQU   ESPADT+1                                                 01411000
ESPADTY  EQU   ESPADT                                                   01412000
ESPADT0  EQU   ESPADT                                                   01413000
ESPADLB  EQU   ESPAD+9                                                  01414000
ESPADOB  EQU   ESPAD+8                                                  01415000
ESPADLE  EQU   ESPAD+4                                                  01416000
ESPADOF  EQU   ESPAD                                                    01417000
ESPAD00  EQU   ESPAD                                                    01418000
ESPALAD  EQU   ESPA+76                                                  01419000
ESPAAS9  EQU   ESPAAS+16                                                01420000
@NM00005 EQU   ESPAAS+12                                                01421000
ESPAAS2  EQU   ESPAAS+8                                                 01422000
ESPAAS1  EQU   ESPAAS+4                                                 01423000
@NM00004 EQU   ESPAAS+2                                                 01424000
ESPAAST  EQU   ESPAAS                                                   01425000
ESPAAS0  EQU   ESPAAS                                                   01426000
ESPARV1  EQU   ESPA+59                                                  01427000
ESPAELK  EQU   ESPA+59                                                  01428000
ESPASYM  EQU   ESPA+28                                                  01429000
ESPARDX  EQU   ESPA+24                                                  01430000
@NM00003 EQU   ESPA+16                                                  01431000
@NM00002 EQU   ESPA+8                                                   01432000
@NM00001 EQU   ESPA+2                                                   01433000
ESPARID  EQU   ESPA                                                     01434000
ESBA999  EQU   ESBA+694                                                 01435000
ESBART1  EQU   ESBART                                                   01436000
ESBARL   EQU   ESBAR                                                    01437000
@NM00159 EQU   ESBA+168                                                 01438000
@NM00158 EQU   ESBAF+2                                                  01439000
@NM00157 EQU   ESBAFC                                                   01440000
ESBAFCD  EQU   ESBAFC                                                   01441000
@NM00156 EQU   ESBA+144                                                 01442000
ESBAD99  EQU   ESBAD+60                                                 01443000
@NM00155 EQU   ESBAD+56                                                 01444000
@NM00154 EQU   ESBADF                                                   01445000
ESBADFA  EQU   ESBADF                                                   01446000
ESBADIL  EQU   ESBAD+48                                                 01447000
ESBADT9  EQU   ESBADT+34                                                01448000
ESBADTE  EQU   ESBADT+33                                                01449000
ESBADTD  EQU   ESBADT+2                                                 01450000
@NM00153 EQU   ESBADT+1                                                 01451000
ESBADTY  EQU   ESBADT                                                   01452000
ESBADT0  EQU   ESBADT                                                   01453000
ESBADLB  EQU   ESBAD+9                                                  01454000
ESBADOB  EQU   ESBAD+8                                                  01455000
ESBAD00  EQU   ESBAD                                                    01456000
ESBAAS9  EQU   ESBAAS+16                                                01457000
@NM00152 EQU   ESBAAS+12                                                01458000
ESBAAS2  EQU   ESBAAS+8                                                 01459000
ESBAAS1  EQU   ESBAAS+4                                                 01460000
@NM00151 EQU   ESBAAS+2                                                 01461000
ESBAAST  EQU   ESBAAS                                                   01462000
ESBAAS0  EQU   ESBAAS                                                   01463000
ESBARV1  EQU   ESBA+59                                                  01464000
ESBAELK  EQU   ESBA+59                                                  01465000
ESBASYM  EQU   ESBA+28                                                  01466000
ESBARDX  EQU   ESBA+24                                                  01467000
@NM00150 EQU   ESBA+16                                                  01468000
@NM00149 EQU   ESBA+8                                                   01469000
@NM00148 EQU   ESBA+2                                                   01470000
ESBARID  EQU   ESBA                                                     01471000
DCBDYNB  EQU   IHADCS30+48                                              01472000
DCBDFBK  EQU   IHADCS30+44                                              01473000
DCBDFOR  EQU   IHADCS30+40                                              01474000
DCBDRDXA EQU   DCBDRDX+1                                                01475000
DCBMVXNO EQU   DCBDRDX                                                  01476000
DCBXARGA EQU   DCBXARG+1                                                01477000
DCBXCNT  EQU   DCBXARG                                                  01478000
DCBLIMCT EQU   IHADCS30+29                                              01479000
@NM00145 EQU   IHADCS30+28                                              01480000
DCBUQND  EQU   IHADCS30+24                                              01481000
DCBIOBUQ EQU   IHADCS30+20                                              01482000
DCBSQND  EQU   IHADCS30+16                                              01483000
DCBIOBSQ EQU   IHADCS30+12                                              01484000
DCBBLKSI EQU   IHADCS30+10                                              01485000
@NM00144 EQU   IHADCS30+8                                               01486000
DCBSYNAD EQU   IHADCS30+4                                               01487000
DCBCHCKA EQU   DCBCHECK+1                                               01488000
DCBOPTRB EQU   DCBOPTCD                                                 01489000
DCBOPTRE EQU   DCBOPTCD                                                 01490000
DCBOPTDB EQU   DCBOPTCD                                                 01491000
DCBOPTA  EQU   DCBOPTCD                                                 01492000
DCBOPTF  EQU   DCBOPTCD                                                 01493000
DCBOPTE  EQU   DCBOPTCD                                                 01494000
DCBOPTTO EQU   DCBOPTCD                                                 01495000
DCBOPTW  EQU   DCBOPTCD                                                 01496000
DCBREADA EQU   DCBWRITA                                                 01497000
@NM00143 EQU   DCBREAD                                                  01498000
DCBDEBA  EQU   DCBDEBAD+1                                               01499000
@NM00142 EQU   DCBIFLGS                                                 01500000
DCBIFIOE EQU   DCBIFLGS                                                 01501000
DCBCH12  EQU   DCBIFPCT                                                 01502000
DCBCH9   EQU   DCBIFPCT                                                 01503000
DCBIFEC  EQU   DCBIFLGS                                                 01504000
DCBMFSTI EQU   DCBMFDMD                                                 01505000
DCBMFAWR EQU   DCBMFSTK                                                 01506000
DCBMFUIP EQU   DCBMFTMD                                                 01507000
DCBMFIDW EQU   DCBMFLCP                                                 01508000
DCBMFWRK EQU   DCBMFMVP                                                 01509000
DCBMFRDQ EQU   DCBMFWRT                                                 01510000
DCBMFGTQ EQU   DCBMFPUT                                                 01511000
DCBMFSTL EQU   DCBMACF2                                                 01512000
DCBMFCK  EQU   DCBMFDMG                                                 01513000
DCBMFRDX EQU   DCBMFCHK                                                 01514000
DCBMFDBF EQU   DCBMFSBG                                                 01515000
DCBMFRDI EQU   DCBMFLCG                                                 01516000
DCBMFRDK EQU   DCBMFMVG                                                 01517000
DCBMFWRQ EQU   DCBMFRD                                                  01518000
DCBMFPTQ EQU   DCBMFGET                                                 01519000
DCBMFECP EQU   DCBMACF1                                                 01520000
DCBTIOT  EQU   IHADCS25                                                 01521000
DCBMRSTI EQU   DCBMRDMD                                                 01522000
DCBMRAWR EQU   DCBMRSTK                                                 01523000
DCBMRUIP EQU   DCBMRTMD                                                 01524000
DCBMRIDW EQU   DCBMRLCP                                                 01525000
DCBMRWRK EQU   DCBMRMVP                                                 01526000
DCBMRRDQ EQU   DCBMRWRT                                                 01527000
DCBMRGTQ EQU   DCBMRPUT                                                 01528000
DCBMRSTL EQU   DCBMACR2                                                 01529000
DCBMRCK  EQU   DCBMRDMG                                                 01530000
DCBPGFXA EQU   DCBMRRDX                                                 01531000
DCBMRDBF EQU   DCBMRSBG                                                 01532000
DCBMRRDI EQU   DCBMRLCG                                                 01533000
DCBMRRDK EQU   DCBMRMVG                                                 01534000
DCBMRWRQ EQU   DCBMRRD                                                  01535000
DCBMRPTQ EQU   DCBMRGET                                                 01536000
DCBMRECP EQU   DCBMACR1                                                 01537000
@NM00141 EQU   DCBIFLG                                                  01538000
DCBIBIOE EQU   DCBIFLG                                                  01539000
DCBICH12 EQU   DCBIBPCT                                                 01540000
DCBICH9  EQU   DCBIBPCT                                                 01541000
DCBIBEC  EQU   DCBIFLG                                                  01542000
DCBOFIOF EQU   DCBOFLGS                                                 01543000
DCBOFUEX EQU   DCBOFLGS                                                 01544000
DCBOFTM  EQU   DCBOFLGS                                                 01545000
DCBOFPPC EQU   DCBOFLGS                                                 01546000
DCBOFOPN EQU   DCBOFLGS                                                 01547000
DCBOFEOV EQU   DCBOFLGS                                                 01548000
DCBOFLRB EQU   DCBOFLGS                                                 01549000
DCBOFIOD EQU   DCBOFLWR                                                 01550000
DCBDDNAM EQU   IHADCS24                                                 01551000
DCBEXLSA EQU   DCBEXLST+1                                               01552000
DCBRECKL EQU   DCBRECFM                                                 01553000
DCBRECCC EQU   DCBRECFM                                                 01554000
DCBRECSB EQU   DCBRECFM                                                 01555000
DCBRECBR EQU   DCBRECFM                                                 01556000
DCBRECTO EQU   DCBRECLA                                                 01557000
DCBRECL  EQU   DCBRECLA                                                 01558000
DCBEODA  EQU   DCBEODAD+1                                               01559000
DCBBFA   EQU   DCBBFTEK                                                 01560000
DCBH0    EQU   DCBBFTEK                                                 01561000
DCBBFTKD EQU   DCBBFTEK                                                 01562000
DCBBFTE  EQU   DCBBFT                                                   01563000
DCBBFTKR EQU   DCBBFT                                                   01564000
DCBBFTS  EQU   DCBBFT                                                   01565000
DCBH1    EQU   DCBBFTEK                                                 01566000
DCBSVCXA EQU   DCBSVCXL+1                                               01567000
@NM00140 EQU   DCBSVCXL                                                 01568000
DCBODEBA EQU   DCBIOBAA                                                 01569000
@NM00139 EQU   DCBQSLM                                                  01570000
DCBUPDBT EQU   DCBQSLM                                                  01571000
DCBUPDCM EQU   DCBQSLM                                                  01572000
DCB1DVDS EQU   DCBQSLM                                                  01573000
@NM00138 EQU   DCBDSRG2                                                 01574000
DCBDSGTR EQU   DCBDSRG2                                                 01575000
DCBACBM  EQU   DCBDSRG2                                                 01576000
@NM00137 EQU   DCBDSRG2                                                 01577000
DCBDSGTQ EQU   DCBDSRG2                                                 01578000
DCBDSGTX EQU   DCBDSRG2                                                 01579000
DCBDSGGS EQU   DCBDSRG2                                                 01580000
DCBDSGU  EQU   DCBDSRG1                                                 01581000
DCBDSGPO EQU   DCBDSRG1                                                 01582000
@NM00136 EQU   DCBDSRG1                                                 01583000
@NM00135 EQU   DCBDSRG1                                                 01584000
DCBDSGCX EQU   DCBDSRG1                                                 01585000
DCBDSGDA EQU   DCBDSRG1                                                 01586000
DCBDSGPS EQU   DCBDSRG1                                                 01587000
DCBDSGIS EQU   DCBDSRG1                                                 01588000
DCBBUFL  EQU   IHADCS11+8                                               01589000
DCBBUFCA EQU   DCBBUFCB+1                                               01590000
DCBBUFNO EQU   DCBBUFCB                                                 01591000
DCBDEVT  EQU   DCBREL                                                   01592000
DCBKEYLE EQU   DCBRELB                                                  01593000
DCBTRBAL EQU   IHADCS01+6                                               01594000
@NM00134 EQU   IHADCS01+5                                               01595000
@NM00133 EQU   IHADCS01+4                                               01596000
DCBDVTBA EQU   DCBDVTBL+1                                               01597000
@NM00132 EQU   DCBDVTBL                                                 01598000
DCBKEYCN EQU   IHADCS00+4                                               01599000
DCBRELAD EQU   IHADCS00                                                 01600000
@NM00131 EQU   IHADCB                                                   01601000
DECWAREA EQU   DECBS04+44                                               01602000
DECWLNG  EQU   DECBS04+42                                               01603000
DECRSV56 EQU   DECBS04+40                                               01604000
DECPOLPA EQU   DECPOLPT+1                                               01605000
DECNDXPL EQU   DECPOLPT                                                 01606000
DECADRPT EQU   DECBS04+32                                               01607000
DECCSWST EQU   DECBS04+30                                               01608000
DECRSV55 EQU   DECERRST                                                 01609000
DECRSV54 EQU   DECERRST                                                 01610000
DECRSV53 EQU   DECERRST                                                 01611000
DECDSABL EQU   DECERRST                                                 01612000
DECDIAGN EQU   DECERRST                                                 01613000
DECERPER EQU   DECERRST                                                 01614000
DECUNDEF EQU   DECERRST                                                 01615000
DECSIO3  EQU   DECERRST                                                 01616000
DECTPCOD EQU   DECBS04+28                                               01617000
DECRESPN EQU   DECBS04+26                                               01618000
DECRLN   EQU   DECBS04+25                                               01619000
DECSTXNQ EQU   DECFLAGS                                                 01620000
DECSSMSG EQU   DECREVRS                                                 01621000
DECNEGRP EQU   DECFLAGS                                                 01622000
DECNOBUF EQU   DECFLAGS                                                 01623000
DECBADID EQU   DECFLAGS                                                 01624000
DECALTAC EQU   DECFLAGS                                                 01625000
DECDIFAC EQU   DECWACK                                                  01626000
DECERRMS EQU   DECWACK                                                  01627000
DECENTRA EQU   DECENTRY+1                                               01628000
DECCMCOD EQU   DECENTRY                                                 01629000
DECCOUNT EQU   DECBS04+18                                               01630000
DECSENS1 EQU   DECBS04+17                                               01631000
DECSENS0 EQU   DECBS04+16                                               01632000
@NM00130 EQU   DECBS04+12                                               01633000
DECDCBAA EQU   @NM00129+1                                               01634000
DECRSV52 EQU   DECONLTT                                                 01635000
DECRSV51 EQU   DECONLTT                                                 01636000
DECRSV50 EQU   DECONLTT                                                 01637000
DECRSV49 EQU   DECONLTT                                                 01638000
DECRSV48 EQU   DECONLTT                                                 01639000
DECRSV47 EQU   DECONLTT                                                 01640000
DECRCVMS EQU   DECONLTT                                                 01641000
DECONLTS EQU   DECONLTT                                                 01642000
@NM00128 EQU   DECBS04+6                                                01643000
@NM00127 EQU   @NM00125+1                                               01644000
DECSLNTH EQU   @NM00126                                                 01645000
DECSAREA EQU   @NM00126                                                 01646000
DECSTRME EQU   @NM00126                                                 01647000
DECRSV46 EQU   @NM00126                                                 01648000
DECRSV45 EQU   @NM00126                                                 01649000
DECRSV44 EQU   @NM00126                                                 01650000
DECRSV43 EQU   @NM00126                                                 01651000
DECRDAPL EQU   @NM00126                                                 01652000
@NM00124 EQU   DECBS04                                                  01653000
@NM00123 EQU   @NM00122+1                                               01654000
DECRSV42 EQU   @NM00122                                                 01655000
DECADRCH EQU   DECBS03+32                                               01656000
DECRSV41 EQU   DECBS03+28                                               01657000
DECRSV40 EQU   DECBS03+26                                               01658000
DECUCBDX EQU   DECBS03+25                                               01659000
DECRSV39 EQU   DECBS03+24                                               01660000
DECCPOLA EQU   DECCPOL+1                                                01661000
DECNMMSG EQU   DECCPOL                                                  01662000
DECRSV38 EQU   DECBS03+16                                               01663000
@NM00121 EQU   DECBS03+12                                               01664000
@NM00120 EQU   DECBS03+8                                                01665000
@NM00119 EQU   DECBS03+6                                                01666000
DECOPCOD EQU   DECBS03+5                                                01667000
DECRSV37 EQU   DECBS03+4                                                01668000
LINEDECB EQU   DECBS03                                                  01669000
DECNAA   EQU   DECNA+1                                                  01670000
DECRSV36 EQU   DECNA                                                    01671000
DECRECPT EQU   DECBS02+24                                               01672000
DECKYADR EQU   DECBS02+20                                               01673000
@NM00118 EQU   DECBS02+16                                               01674000
@NM00117 EQU   DECBS02+12                                               01675000
@NM00116 EQU   DECBS02+8                                                01676000
@NM00115 EQU   DECBS02+6                                                01677000
DECRSV35 EQU   @NM00114                                                 01678000
DECWRADD EQU   @NM00114                                                 01679000
DECSRKEY EQU   @NM00114                                                 01680000
DECOPRD  EQU   @NM00114                                                 01681000
DECTYPR  EQU   DECTYPRU                                                 01682000
DECTYPU  EQU   DECTYPRU                                                 01683000
DECBKLNS EQU   @NM00114                                                 01684000
DECKEYS  EQU   @NM00114                                                 01685000
DECRELBA EQU   @NM00113                                                 01686000
DECRDEX  EQU   @NM00113                                                 01687000
DECDYNBF EQU   @NM00113                                                 01688000
DECACTAD EQU   @NM00113                                                 01689000
DECFDBCK EQU   @NM00113                                                 01690000
DECEXSRC EQU   @NM00113                                                 01691000
DECOFLOW EQU   @NM00113                                                 01692000
DECVERFY EQU   @NM00113                                                 01693000
DECRSV34 EQU   @NM00110+3                                               01694000
DECCCKFF EQU   DECCC3                                                   01695000
DECCCOPT EQU   DECCC3                                                   01696000
DECCCSDK EQU   DECCC3                                                   01697000
DECCCWDI EQU   DECCC3                                                   01698000
DECCCNBK EQU   DECCC3                                                   01699000
DECCCEXS EQU   DECCC3                                                   01700000
DECCCWRI EQU   DECCC3                                                   01701000
DECRSV33 EQU   DECCC3                                                   01702000
DECCCREX EQU   DECCC2                                                   01703000
DECCCUER EQU   DECCC2                                                   01704000
DECCCEOD EQU   DECCC2                                                   01705000
DECCCERR EQU   DECCC2                                                   01706000
DECCCINV EQU   DECCC2                                                   01707000
DECCCNSP EQU   DECCC2                                                   01708000
DECCCRLC EQU   DECCC2                                                   01709000
DECCCRNF EQU   DECCC2                                                   01710000
@NM00111 EQU   @NM00110                                                 01711000
DECEXRKU EQU   DECBEXC2                                                 01712000
DECEXASR EQU   DECBEXC2                                                 01713000
DECRSV32 EQU   DECBEXC2                                                 01714000
DECRSV31 EQU   DECBEXC2                                                 01715000
DECRSV30 EQU   DECBEXC2                                                 01716000
DECRSV29 EQU   DECBEXC2                                                 01717000
DECRSV28 EQU   DECBEXC2                                                 01718000
DECRSV27 EQU   DECBEXC2                                                 01719000
DECEXDUP EQU   DECBEXC1                                                 01720000
DECEXOFL EQU   DECBEXC1                                                 01721000
DECEXUBK EQU   DECBEXC1                                                 01722000
DECEXERR EQU   DECBEXC1                                                 01723000
DECEXINV EQU   DECBEXC1                                                 01724000
DECEXNSP EQU   DECBEXC1                                                 01725000
DECEXRLC EQU   DECBEXC1                                                 01726000
DECEXRNF EQU   DECBEXC1                                                 01727000
DECBKEY  EQU   DECBS01+20                                               01728000
DECBLOGR EQU   DECBS01+16                                               01729000
DECBAREA EQU   DECBS01+12                                               01730000
DECBDCBA EQU   DECBS01+8                                                01731000
DECBLGTH EQU   DECBS01+6                                                01732000
DECRSV26 EQU   DECBTYP2                                                 01733000
DECRSV25 EQU   DECBTYP2                                                 01734000
DECBWRKN EQU   DECBTYP2                                                 01735000
DECBWRK  EQU   DECBTYP2                                                 01736000
DECRSV24 EQU   DECBTYP2                                                 01737000
DECBRDKU EQU   DECBTYP2                                                 01738000
DECRSV23 EQU   DECBTYP2                                                 01739000
DECBRDK  EQU   DECBTYP2                                                 01740000
DECBARS  EQU   DECBTYP1                                                 01741000
DECBLNS  EQU   DECBTYP1                                                 01742000
DECRSV22 EQU   DECBTYP1                                                 01743000
DECRSV21 EQU   DECBTYP1                                                 01744000
DECRSV20 EQU   DECBTYP1                                                 01745000
DECRSV19 EQU   DECBTYP1                                                 01746000
DECRSV18 EQU   DECBTYP1                                                 01747000
DECRSV17 EQU   DECBTYP1                                                 01748000
DECBRBA  EQU   DECBRB+1                                                 01749000
DECRSV16 EQU   DECBECBF                                                 01750000
DECRSV15 EQU   DECBECBF                                                 01751000
DECRSV14 EQU   DECBECBF                                                 01752000
DECRSV13 EQU   DECBECBF                                                 01753000
DECRSV12 EQU   DECBECBF                                                 01754000
DECRSV11 EQU   DECBECBF                                                 01755000
DECBPOST EQU   DECBECBF                                                 01756000
DECBWAIT EQU   DECBECBF                                                 01757000
DECNEXTA EQU   DECNEXT+1                                                01758000
DECRSV10 EQU   DECNEXT                                                  01759000
DECIOBPT EQU   DECB+16                                                  01760000
DECAREA  EQU   DECB+12                                                  01761000
DECDCBAD EQU   DECB+8                                                   01762000
DECLNGTH EQU   DECBPTR+2                                                01763000
DECWRSFR EQU   DECTYPE2                                                 01764000
DECRSV09 EQU   DECTYPE2                                                 01765000
DECWRSZ  EQU   DECTYPE2                                                 01766000
DECRSV08 EQU   DECTYPE2                                                 01767000
DECWRSD  EQU   DECTYPE2                                                 01768000
DECWRSF  EQU   DECTYPE2                                                 01769000
DECRDSB  EQU   DECTYPE2                                                 01770000
DECRDSF  EQU   DECTYPE2                                                 01771000
DECRSV07 EQU   DECTYPE1                                                 01772000
DECRSV06 EQU   DECTYPE1                                                 01773000
DECRSV05 EQU   DECTYPE1                                                 01774000
DECRSV04 EQU   DECTYPE1                                                 01775000
DECRSV03 EQU   DECTYPE1                                                 01776000
DECRSV02 EQU   DECTYPE1                                                 01777000
DECRSV01 EQU   DECTYPE1                                                 01778000
DECLNS   EQU   DECTYPE1                                                 01779000
DECSDECB EQU   DECB                                                     01780000
@NM00089 EQU   HSD+2                                                    01781000
HSDCLA   EQU   HSD+1                                                    01782000
RVT99999 EQU   RVT+384                                                  01783000
RVT0096P EQU   RVT+380                                                  01784000
RVT0095P EQU   RVT+376                                                  01785000
RVT0094P EQU   RVT+372                                                  01786000
RVT0093P EQU   RVT+368                                                  01787000
RVT0092P EQU   RVT+364                                                  01788000
RVT0091P EQU   RVT+360                                                  01789000
RVT0090P EQU   RVT+356                                                  01790000
RVT0089P EQU   RVT+352                                                  01791000
RVT0088P EQU   RVT+348                                                  01792000
RVT0087P EQU   RVT+344                                                  01793000
RVT0086P EQU   RVT+340                                                  01794000
RVT0085P EQU   RVT+336                                                  01795000
RVT0084P EQU   RVT+332                                                  01796000
RVT0083P EQU   RVT+328                                                  01797000
RVT0082P EQU   RVT+324                                                  01798000
RVT0081P EQU   RVT+320                                                  01799000
RVT0080P EQU   RVT+316                                                  01800000
RVT0079P EQU   RVT+312                                                  01801000
RVT0078P EQU   RVT+308                                                  01802000
RVT0077P EQU   RVT+304                                                  01803000
RVT0076P EQU   RVT+300                                                  01804000
RVT0075P EQU   RVT+296                                                  01805000
RVT0074P EQU   RVT+292                                                  01806000
RVT0073P EQU   RVT+288                                                  01807000
RVT0072P EQU   RVT+284                                                  01808000
RVTDTUTP EQU   RVT+272                                                  01809000
RVTDTMTP EQU   RVT+268                                                  01810000
RVT0057P EQU   RVT+224                                                  01811000
RVT0056P EQU   RVT+220                                                  01812000
RVT0055P EQU   RVT+216                                                  01813000
RVT0054P EQU   RVT+212                                                  01814000
RVT0053P EQU   RVT+208                                                  01815000
RVT0044P EQU   RVT+172                                                  01816000
RVT0043P EQU   RVT+168                                                  01817000
RVT0040P EQU   RVT+156                                                  01818000
RVT0039P EQU   RVT+152                                                  01819000
RVT0038P EQU   RVT+148                                                  01820000
RVT0037P EQU   RVT+144                                                  01821000
RVT0031P EQU   RVT+120                                                  01822000
RVT0030P EQU   RVT+116                                                  01823000
RVT0029P EQU   RVT+112                                                  01824000
RVTACCQP EQU   RVT+108                                                  01825000
RVT0020P EQU   RVT+76                                                   01826000
RVT0012P EQU   RVT+44                                                   01827000
RVT0010P EQU   RVT+36                                                   01828000
RVT0009P EQU   RVT+32                                                   01829000
RVT0008P EQU   RVT+28                                                   01830000
RVT0006P EQU   RVT+20                                                   01831000
ZZ69999  EQU   ZZ6+1792                                                 01832000
@NM00088 EQU   ZZ6B+6                                                   01833000
@NM00087 EQU   ZZ6+540                                                  01834000
ZZ6FILE  EQU   ZZ6+524                                                  01835000
ZZ6ZZ6P  EQU   ZZ6+512                                                  01836000
@NM00086 EQU   ZZ6+256                                                  01837000
ZZ6D999  EQU   ZZ6D+128                                                 01838000
@NM00085 EQU   ZZ6D+116                                                 01839000
ZZ6DCAP  EQU   ZZ6D+112                                                 01840000
ZZ6DPRP  EQU   ZZ6D+108                                                 01841000
ZZ6DDA2  EQU   ZZ6D+104                                                 01842000
@NM00084 EQU   ZZ6DF                                                    01843000
ZZ6DFSU  EQU   ZZ6DF                                                    01844000
ZZ6DFST  EQU   ZZ6DF                                                    01845000
ZZ6DFAB  EQU   ZZ6DF                                                    01846000
ZZ6DFMP  EQU   ZZ6DF                                                    01847000
ZZ6DFBS  EQU   ZZ6DF                                                    01848000
ZZ6DQ2   EQU   ZZ6D+88                                                  01849000
ZZ6DQ1   EQU   ZZ6D+84                                                  01850000
ZZ6DQA9  EQU   ZZ6DQA+16                                                01851000
@NM00083 EQU   ZZ6DQA+12                                                01852000
ZZ6DQA2  EQU   ZZ6DQA+8                                                 01853000
ZZ6DQA1  EQU   ZZ6DQA+4                                                 01854000
@NM00082 EQU   ZZ6DQA+2                                                 01855000
ZZ6DQAT  EQU   ZZ6DQA                                                   01856000
ZZ6DQA0  EQU   ZZ6DQA                                                   01857000
ZZ6DRDX  EQU   ZZ6D+64                                                  01858000
ZZ6DELK  EQU   ZZ6D+64                                                  01859000
ZZ6DMEM  EQU   ZZ6D+56                                                  01860000
ZZ6DDT1  EQU   ZZ6DDT                                                   01861000
ZZ6DDO   EQU   ZZ6DD+2                                                  01862000
ZZ6DDL   EQU   ZZ6DD                                                    01863000
@NM00081 EQU   ZZ6D+2                                                   01864000
ZZ6DRID  EQU   ZZ6D                                                     01865000
ZZ6RDCB  EQU   ZZ6                                                      01866000
ZZ60000  EQU   ZZ6                                                      01867000
BVT99999 EQU   BVT+256                                                  01868000
BVT0064P EQU   BVT+252                                                  01869000
BVT0063P EQU   BVT+248                                                  01870000
BVT0062P EQU   BVT+244                                                  01871000
BVT0061P EQU   BVT+240                                                  01872000
BVT0060P EQU   BVT+236                                                  01873000
BVT0059P EQU   BVT+232                                                  01874000
BVT0057P EQU   BVT+224                                                  01875000
BVT0056P EQU   BVT+220                                                  01876000
BVTSTBLP EQU   BVT+200                                                  01877000
BVT0045P EQU   BVT+176                                                  01878000
BVT0044P EQU   BVT+172                                                  01879000
BVT0033P EQU   BVT+128                                                  01880000
BVT0032P EQU   BVT+124                                                  01881000
BVT0031P EQU   BVT+120                                                  01882000
BVT0030P EQU   BVT+116                                                  01883000
BVT0029P EQU   BVT+112                                                  01884000
BVT0026P EQU   BVT+100                                                  01885000
BVT0025P EQU   BVT+96                                                   01886000
BVT0024P EQU   BVT+92                                                   01887000
BVT0023P EQU   BVT+88                                                   01888000
BVT0016P EQU   BVT+60                                                   01889000
BVT0015P EQU   BVT+56                                                   01890000
BVT0014P EQU   BVT+52                                                   01891000
BVT0003P EQU   BVT+8                                                    01892000
BVT0001P EQU   BVT                                                      01893000
SA99     EQU   SA+72                                                    01894000
SARC     EQU   SAR+56                                                   01895000
SARB     EQU   SAR+52                                                   01896000
SARA     EQU   SAR+48                                                   01897000
SAR9     EQU   SAR+44                                                   01898000
SAR8     EQU   SAR+40                                                   01899000
SAR7     EQU   SAR+36                                                   01900000
SAR6     EQU   SAR+32                                                   01901000
SAR5     EQU   SAR+28                                                   01902000
SAR4     EQU   SAR+24                                                   01903000
SAR3     EQU   SAR+20                                                   01904000
SAR2     EQU   SAR+16                                                   01905000
SAR0     EQU   SAR+8                                                    01906000
SARF     EQU   SAR+4                                                    01907000
SARE     EQU   SAR                                                      01908000
SAFWD    EQU   SA+8                                                     01909000
SABAK    EQU   SA+4                                                     01910000
SA1L     EQU   SA1+1                                                    01911000
SA1P     EQU   SA1                                                      01912000
UPTPREFL EQU   UPT+23                                                   01913000
UPTPREFX EQU   UPT+16                                                   01914000
@NM00080 EQU   UPT+15                                                   01915000
UPTLDEL  EQU   UPT+14                                                   01916000
UPTCDEL  EQU   UPT+13                                                   01917000
UPTWTP   EQU   UPTSWS                                                   01918000
UPTMODE  EQU   UPTSWS                                                   01919000
UPTALD   EQU   UPTSWS                                                   01920000
UPTPAUS  EQU   UPTSWS                                                   01921000
UPTNCOM  EQU   UPTSWS                                                   01922000
UPTMID   EQU   UPTSWS                                                   01923000
UPTNPRM  EQU   UPTSWS                                                   01924000
UPTRCVR  EQU   UPTSWS                                                   01925000
UPTUSER  EQU   UPT+2                                                    01926000
@NM00079 EQU   UPT                                                      01927000
@NM00078 EQU   ECT+52                                                   01928000
@NM00077 EQU   ECT+48                                                   01929000
@NM00076 EQU   ECT+44                                                   01930000
@NM00075 EQU   ECTSWS2+1                                                01931000
@NM00074 EQU   ECTSWS21                                                 01932000
ECTTABND EQU   ECTSWS21                                                 01933000
ECTDEFCS EQU   ECTSWS21                                                 01934000
ECTBKPB  EQU   ECT+36                                                   01935000
ECTUSER  EQU   ECT+32                                                   01936000
ECTDDNUM EQU   ECT+29                                                   01937000
ECTATTN  EQU   ECTSWS                                                   01938000
ECTBKGRD EQU   ECTSWS                                                   01939000
ECTNNOT  EQU   ECTSWS                                                   01940000
ECTNMAL  EQU   ECTSWS                                                   01941000
ECTLOGF  EQU   ECTSWS                                                   01942000
ECTATRM  EQU   ECTSWS                                                   01943000
@NM00073 EQU   ECTSWS                                                   01944000
ECTNOPD  EQU   ECTSWS                                                   01945000
ECTSCMD  EQU   ECT+20                                                   01946000
ECTPCMD  EQU   ECT+12                                                   01947000
ECTSMSG  EQU   ECT+9                                                    01948000
ECTMSGF  EQU   ECT+8                                                    01949000
ECTIOWA  EQU   ECT+4                                                    01950000
ECTRTCD  EQU   ECT+1                                                    01951000
ECTRCDF  EQU   ECT                                                      01952000
PSCBU    EQU   PSCB+64                                                  01953000
PSCBRSZ  EQU   PSCB+60                                                  01954000
PSCBLINE EQU   PSCB+59                                                  01955000
PSCBCHAR EQU   PSCB+58                                                  01956000
PSCBUPTL EQU   PSCB+56                                                  01957000
PSCBUPT  EQU   PSCB+52                                                  01958000
PSCBRLGB EQU   PSCB+48                                                  01959000
PSCBDEST EQU   PSCB+40                                                  01960000
@NM00072 EQU   PSCB+36                                                  01961000
@NM00071 EQU   PSCB+32                                                  01962000
@NM00070 EQU   PSCB+28                                                  01963000
PSCBLTI2 EQU   PSCB+24                                                  01964000
PSCBLTIM EQU   PSCB+20                                                  01965000
PSCBATR2 EQU   PSCB+18                                                  01966000
@NM00069 EQU   PSCBATR1                                                 01967000
@NM00068 EQU   PSCBATR1                                                 01968000
@NM00067 EQU   PSCBATR1                                                 01969000
PSCBATTN EQU   PSCBATR1                                                 01970000
PSCBVMNT EQU   PSCBATR1                                                 01971000
PSCBJCL  EQU   PSCBATR1                                                 01972000
PSCBACCT EQU   PSCBATR1                                                 01973000
PSCBCTRL EQU   PSCBATR1                                                 01974000
PSCBGPNM EQU   PSCB+8                                                   01975000
PSCBUSRL EQU   PSCB+7                                                   01976000
PSCBUSER EQU   PSCB                                                     01977000
CMDT1    EQU   CMDT                                                     01978000
CMDO     EQU   CMD+2                                                    01979000
CMDL     EQU   CMD                                                      01980000
ZZ299999 EQU   ZZ2+8192                                                 01981000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  01982000
ZZ2AXOL  EQU   ZZ2AXO                                                   01983000
@NM00066 EQU   ZZ2+7288                                                 01984000
@NM00065 EQU   ZZ2AMDX+4                                                01985000
ZZ2AMDXC EQU   ZZ2AMDX                                                  01986000
ZZ2HSD   EQU   ZZ2+3056                                                 01987000
@NM00064 EQU   ZZ2ES                                                    01988000
@NM00063 EQU   ZZ2+2868                                                 01989000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                01990000
@NM00062 EQU   ZZ2ITSE                                                  01991000
ZZ2ITSEP EQU   ZZ2ITSE                                                  01992000
ZZ2ITSEW EQU   ZZ2ITSE                                                  01993000
@NM00061 EQU   ZZ2ITR+20                                                01994000
ZZ2ITREC EQU   ZZ2ITRE+1                                                01995000
@NM00060 EQU   ZZ2ITRE                                                  01996000
ZZ2ITREP EQU   ZZ2ITRE                                                  01997000
ZZ2ITREW EQU   ZZ2ITRE                                                  01998000
@NM00059 EQU   ZZ2ITR+9                                                 01999000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 02000000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 02001000
ZZ2ITRPP EQU   ZZ2ITR                                                   02002000
@NM00058 EQU   ZZ2+1544                                                 02003000
ZZ2PGM   EQU   ZZ2+1536                                                 02004000
@NM00057 EQU   ZZ2+1526                                                 02005000
ZZ2CW    EQU   ZZ2+1524                                                 02006000
@NM00056 EQU   ZZ2+1504                                                 02007000
@NM00055 EQU   ZZ2+1352                                                 02008000
ZZ2FFSYP EQU   ZZ2+1348                                                 02009000
ZZ2SASYP EQU   ZZ2+1344                                                 02010000
ZZ2RDSYP EQU   ZZ2+1340                                                 02011000
ZZ2RASYP EQU   ZZ2+1336                                                 02012000
ZZ2PHSYP EQU   ZZ2+1332                                                 02013000
ZZ2ESSYP EQU   ZZ2+1328                                                 02014000
ZZ200SYP EQU   ZZ2+1324                                                 02015000
ZZ2SCWP  EQU   ZZ2+1320                                                 02016000
ZZ2TTLP  EQU   ZZ2+1316                                                 02017000
ZZ2LOADP EQU   ZZ2+1312                                                 02018000
ZZ2VRESP EQU   ZZ2+1308                                                 02019000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               02020000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                02021000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                02022000
ZZ2VRSAP EQU   ZZ2+1288                                                 02023000
ZZ2DVTP  EQU   ZZ2+1276                                                 02024000
@NM00054 EQU   ZZ2+1272                                                 02025000
@NM00053 EQU   ZZ2+1268                                                 02026000
ZZ2RPLP  EQU   ZZ2+1260                                                 02027000
ZZ2TCBP  EQU   ZZ2+1256                                                 02028000
@NM00052 EQU   ZZ2+1252                                                 02029000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 02030000
@NM00051 EQU   ZZ2+1112                                                 02031000
ZZ2FPDRP EQU   ZZ2+1108                                                 02032000
ZZ2FDSDP EQU   ZZ2+1104                                                 02033000
ZZ2APDRP EQU   ZZ2+1100                                                 02034000
ZZ2ADSDP EQU   ZZ2+1096                                                 02035000
ZZ2ENQ0P EQU   ZZ2+1092                                                 02036000
@NM00050 EQU   ZZ2+1080                                                 02037000
ZZ2MSG0P EQU   ZZ2+1076                                                 02038000
ZZ2FT25P EQU   ZZ2+1072                                                 02039000
ZZ2MSGSP EQU   ZZ2+1060                                                 02040000
ZZ2ALOCP EQU   ZZ2+1056                                                 02041000
@NM00049 EQU   ZZ2+976                                                  02042000
ZZ2TOD   EQU   ZZ2+968                                                  02043000
ZZ2STGN  EQU   ZZ2STG+4                                                 02044000
ZZ2STGP  EQU   ZZ2STG                                                   02045000
@NM00048 EQU   ZZ2+952                                                  02046000
ZZ2SCMDE EQU   ZZ2+944                                                  02047000
ZZ2SCMDN EQU   ZZ2+936                                                  02048000
ZZ2IDENT EQU   ZZ2+928                                                  02049000
ZZ2A9999 EQU   ZZ2A+656                                                 02050000
@NM00047 EQU   ZZ2A+224                                                 02051000
@NM00046 EQU   ZZ2A+220                                                 02052000
ZZ2AQD99 EQU   ZZ2AQD+60                                                02053000
@NM00045 EQU   ZZ2AQD+56                                                02054000
@NM00044 EQU   ZZ2AQDF                                                  02055000
ZZ2AQDFA EQU   ZZ2AQDF                                                  02056000
ZZ2AQDIL EQU   ZZ2AQD+48                                                02057000
ZZ2AQDIM EQU   ZZ2AQD+44                                                02058000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               02059000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               02060000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                02061000
@NM00043 EQU   ZZ2AQDT+1                                                02062000
ZZ2AQDTY EQU   ZZ2AQDT                                                  02063000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  02064000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 02065000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 02066000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 02067000
ZZ2AQDOF EQU   ZZ2AQD                                                   02068000
ZZ2AQD00 EQU   ZZ2AQD                                                   02069000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               02070000
@NM00042 EQU   ZZ2AQAS+12                                               02071000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                02072000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                02073000
@NM00041 EQU   ZZ2AQAS+2                                                02074000
ZZ2AQAST EQU   ZZ2AQAS                                                  02075000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  02076000
ZZ2ADPTA EQU   ZZ2ADPT                                                  02077000
ZZ2ADPL  EQU   ZZ2ADP                                                   02078000
ZZ2ADMTA EQU   ZZ2ADMT                                                  02079000
ZZ2ADML  EQU   ZZ2ADM                                                   02080000
ZZ2ADDTA EQU   ZZ2ADDT                                                  02081000
ZZ2ADDL  EQU   ZZ2ADD                                                   02082000
@NM00040 EQU   ZZ2A+72                                                  02083000
ZZ2APIDB EQU   ZZ2APID+3                                                02084000
ZZ2APIDA EQU   ZZ2APID                                                  02085000
@NM00039 EQU   ZZ2A+24                                                  02086000
@NM00038 EQU   ZZ2AF+5                                                  02087000
ZZ2AFX   EQU   ZZ2AF+5                                                  02088000
@NM00037 EQU   ZZ2AF+3                                                  02089000
ZZ2AFS   EQU   ZZ2AF+2                                                  02090000
ZZ2AFD   EQU   ZZ2AF+2                                                  02091000
ZZ2AFQ   EQU   ZZ2AF+2                                                  02092000
ZZ2AF$   EQU   ZZ2AF+2                                                  02093000
@NM00036 EQU   ZZ2AF+2                                                  02094000
ZZ2AFM   EQU   ZZ2AF+2                                                  02095000
@NM00035 EQU   ZZ2AF+2                                                  02096000
@NM00034 EQU   ZZ2AF+1                                                  02097000
ZZ2AFV   EQU   ZZ2AF+1                                                  02098000
@NM00033 EQU   ZZ2AF+1                                                  02099000
ZZ2AFC   EQU   ZZ2AF+1                                                  02100000
@NM00032 EQU   ZZ2AF                                                    02101000
ZZ2AFFS  EQU   ZZ2AF                                                    02102000
ZZ2AFT   EQU   ZZ2AF                                                    02103000
ZZ2AFP   EQU   ZZ2AF                                                    02104000
@NM00031 EQU   ZZ2A+8                                                   02105000
ZZ2ALINE EQU   ZZ2A+4                                                   02106000
@NM00030 EQU   ZZ2A+3                                                   02107000
ZZ2ASE   EQU   ZZ2A+2                                                   02108000
ZZ2ACH   EQU   ZZ2A                                                     02109000
@NM00029 EQU   ZZ2+264                                                  02110000
@NM00028 EQU   ZZ2+263                                                  02111000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  02112000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 02113000
ZZ2PRTL  EQU   ZZ2PRT                                                   02114000
@NM00027 EQU   ZZ2AMD+56                                                02115000
ZZ2AMDXP EQU   ZZ2AMD+52                                                02116000
ZZ2AMDD  EQU   ZZ2AMD+48                                                02117000
ZZ2AMDL  EQU   ZZ2AMD+44                                                02118000
ZZ2AMDU  EQU   ZZ2AMD+28                                                02119000
ZZ2AMDF  EQU   ZZ2AMD+24                                                02120000
ZZ2AMDS  EQU   ZZ2AMD+20                                                02121000
ZZ2AMDC  EQU   ZZ2AMD+16                                                02122000
ZZ2AMDP  EQU   ZZ2AMD+12                                                02123000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 02124000
@NM00026 EQU   @NM00025                                                 02125000
ZZ2AMD2  EQU   @NM00025                                                 02126000
ZZ2AMD1  EQU   @NM00025                                                 02127000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 02128000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 02129000
ZZ2AMDT  EQU   ZZ2AMD                                                   02130000
ZZ199999 EQU   ZZ1+3072                                                 02131000
@NM00024 EQU   ZZ1+2160                                                 02132000
ZZ1TRTAS EQU   ZZ1+1904                                                 02133000
ZZ1TRUPC EQU   ZZ1+1648                                                 02134000
ZZ1TRCTX EQU   ZZ1+1392                                                 02135000
ZZ1NASID EQU   ZZ1N+274                                                 02136000
ZZ1NSTRL EQU   ZZ1N+272                                                 02137000
ZZ1NOFF  EQU   ZZ1N+268                                                 02138000
ZZ1NBDY  EQU   ZZ1N+264                                                 02139000
ZZ1NADE  EQU   ZZ1N+260                                                 02140000
ZZ1NADB  EQU   ZZ1N+256                                                 02141000
ZZ1NSTR  EQU   ZZ1N                                                     02142000
@NM00023 EQU   ZZ1+1080                                                 02143000
ZZ1TREBC EQU   ZZ1+824                                                  02144000
ZZ1TRHEX EQU   ZZ1+568                                                  02145000
@NM00022 EQU   ZZ1+377                                                  02146000
ZZ1USTAE EQU   ZZ1+376                                                  02147000
@NM00021 EQU   ZZ1F+1                                                   02148000
@NM00020 EQU   ZZ1F                                                     02149000
ZZ1FM    EQU   ZZ1F                                                     02150000
ZZ1FX    EQU   ZZ1F                                                     02151000
ZZ1FU    EQU   ZZ1F                                                     02152000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 02153000
@NM00019 EQU   ZZ1EVE                                                   02154000
ZZ1EVEW  EQU   ZZ1EVE                                                   02155000
ZZ1ACMP  EQU   ZZ1ATTN                                                  02156000
@NM00018 EQU   ZZ1+144                                                  02157000
ZZ1FPP   EQU   ZZ1+140                                                  02158000
ZZ1ZZ6P  EQU   ZZ1+136                                                  02159000
@NM00017 EQU   ZZ1+84                                                   02160000
ZZ1PLINE EQU   ZZ1+80                                                   02161000
ZZ1PGSZ  EQU   ZZ1+76                                                   02162000
ZZ1PCNT  EQU   ZZ1+72                                                   02163000
@NM00016 EQU   ZZ1+68                                                   02164000
ZZ1TPAGE EQU   ZZ1+64                                                   02165000
ZZ1TLINE EQU   ZZ1+60                                                   02166000
@NM00015 EQU   ZZ1+48                                                   02167000
ZZ1DSDP  EQU   ZZ1+44                                                   02168000
ZZ1PDRP  EQU   ZZ1+40                                                   02169000
ZZ1ZZ2P  EQU   ZZ1+36                                                   02170000
ZZ1327WP EQU   ZZ1+32                                                   02171000
ZZ1ACBP  EQU   ZZ1+28                                                   02172000
@NM00014 EQU   ZZ1+24                                                   02173000
ZZ1PDCBP EQU   ZZ1+20                                                   02174000
ZZ1BLRBL EQU   ZZ1+16                                                   02175000
@NM00013 EQU   ZZ1+12                                                   02176000
ZZ1PNULL EQU   ZZ1+8                                                    02177000
ZZ1NULL  EQU   ZZ1+4                                                    02178000
ZZ1IDE   EQU   ZZ1                                                      02179000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02180000
@RF00254 EQU   @RC00251                                                 02181000
@RF00257 EQU   @RC00251                                                 02182000
@RF00262 EQU   @RC00248                                                 02183000
@ENDDATA EQU   *                                                        02184000
         END   BLSRACCQ,(C'PLS1358',0701,78057)                         02185000
