SYRB     TITLE 'BLSRSYRB--GENERATE SYMBOL RANGE BOUNDS                 *00001000
                        '                                               00002000
*/* CHANGE ACTIVITY -------------------------------------------------*/ 00003000
*/*   THIS MODULE WAS WRITTEN FOR @G57LPSR                           */ 00004000
*/*------------------------------------------------------------------*/ 00005000
BLSRSYRB CSECT ,                                                   0002 00006000
@MAINENT DS    0H                                                  0002 00007000
         USING *,@15                                               0002 00008000
         B     @PROLOG                                             0002 00009000
         DC    AL1(16)                                             0002 00010000
         DC    C'BLSRSYRB  78.058'                                 0002 00011000
         DROP  @15                                                      00012000
@PROLOG  STM   @14,@12,12(@13)                                     0002 00013000
         BALR  @12,0                                               0002 00014000
@PSTART  DS    0H                                                  0002 00015000
         USING @PSTART,@12                                         0002 00016000
         L     @00,@SIZDATD                                        0002 00017000
         BLSUALLS R,LV=(0)                                              00018000
         LR    @11,@01                                             0002 00019000
         USING @DATD,@11                                           0002 00020000
         ST    @13,@SA00001+4                                      0002 00021000
         LM    @00,@01,20(@13)                                     0002 00022000
         ST    @11,8(,@13)                                         0002 00023000
         LR    @13,@11                                             0002 00024000
         MVC   @PC00001(16),0(@01)                                 0002 00025000
*   RETC=ZZZFLAGI;                  /* ANTICIPATE NORMAL RETURN      */ 00026000
         SLR   RETC,RETC                                           0131 00027000
*   PDSYMP=ADDR(PDSYM);             /* ->PDSYM (FIRST SYMBOL PDE)    */ 00028000
         L     PDSYMP,@PC00001+12                                  0132 00029000
*   RESPECIFY                                                      0133 00030000
*     PDSYMX BASED(PDSYMP);         /* A SYMBOL PDE                  */ 00031000
*   RANGEMIN=ZZZSYMAX;              /* LARGEST POSSIBLE MINIMUM      */ 00032000
         L     @14,@PC00001+4                                      0134 00033000
         MVC   RANGEMIN(31,@14),@CC00176                           0134 00034000
*   RANGEMAX=ZZZSYMIN;              /* SMALLEST POSSIBLE MAXIMUM     */ 00035000
         L     @14,@PC00001+8                                      0135 00036000
         MVC   RANGEMAX(31,@14),@CC00180                           0135 00037000
*   IF PDSYMIL(1)=0 THEN            /* NO RANGES SPECIFIED           */ 00038000
         LH    @14,PDSYMIL(,PDSYMP)                                0136 00039000
         LTR   @14,@14                                             0136 00040000
         BNZ   @RF00136                                            0136 00041000
*     CALL DORANGE;                 /* PROCESS DEFAULT RANGE         */ 00042000
         BAL   @14,DORANGE                                         0137 00043000
*   ELSE                            /* RANGES SPECIFIED              */ 00044000
*     DO WHILE(PDSYMP^=ZZ1PNULL);   /* PROCESS REMAINING RANGES      */ 00045000
         B     @RC00136                                            0138 00046000
@RF00136 B     @DE00138                                            0138 00047000
@DL00138 DS    0H                                                  0139 00048000
*       CALL DORANGE;               /* PROCESS A RANGE               */ 00049000
         BAL   @14,DORANGE                                         0139 00050000
*       PDSYMP=PDSYMXP;             /* ADVANCE TO NEXT RANGE         */ 00051000
         L     PDSYMP,PDSYMXP(,PDSYMP)                             0140 00052000
*     END;                          /* PROCESS REMAINING RANGES      */ 00053000
@DE00138 L     @14,ZZ2ZZ1P(,R9)                                    0141 00054000
         CL    PDSYMP,ZZ1PNULL(,@14)                               0141 00055000
         BNE   @DL00138                                            0141 00056000
*   RETURN CODE(RETC);              /* END OF DIAGNOSTICS            */ 00057000
@RC00136 L     @13,4(,@13)                                         0142 00058000
         L     @00,@SIZDATD                                        0142 00059000
         LR    @01,@11                                             0142 00060000
         BLSUFRES R,LV=(0),A=(1)                                        00061000
         LR    @15,@04                                             0142 00062000
         L     @14,12(,@13)                                        0142 00063000
         LM    @00,@12,20(@13)                                     0142 00064000
         BR    @14                                                 0142 00065000
*DORANGE:                           /* PROCESS A RANGE               */ 00066000
*   PROCEDURE;                                                     0143 00067000
DORANGE  STM   @14,@12,@SA00002                                    0143 00068000
*   PDSYMIF2(1)='0'B;               /* INITIALIZE RANGE NOT FOUND    */ 00069000
*   PDSYMIF3(1)='0'B;               /* INITIALIZE RANGE NOT USED     */ 00070000
         NI    PDSYMIF2(PDSYMP),B'10011111'                        0145 00071000
*   CALL BLSRSYRG;                  /* GET THE RANGE                 */ 00072000
         BAL   @14,BLSRSYRG                                        0146 00073000
*   IF RANGEMIN>RANGEORG THEN       /* NEW RANGE MINIMUM             */ 00074000
         L     @14,@PC00001+4                                      0147 00075000
         CLC   RANGEMIN(31,@14),RANGEORG                           0147 00076000
         BNH   @RF00147                                            0147 00077000
*     RANGEMIN=RANGEORG;                                           0148 00078000
         MVC   RANGEMIN(31,@14),RANGEORG                           0148 00079000
*   IF RANGEMAX<RANGEEND THEN       /* NEW RANGE MAXIMUM             */ 00080000
@RF00147 L     @14,@PC00001+8                                      0149 00081000
         CLC   RANGEMAX(31,@14),RANGEEND                           0149 00082000
         BNL   @RF00149                                            0149 00083000
*     RANGEMAX=RANGEEND;                                           0150 00084000
         MVC   RANGEMAX(31,@14),RANGEEND                           0150 00085000
*   END DORANGE;                    /* PROCESS ONE RANGE             */ 00086000
@EL00002 DS    0H                                                  0151 00087000
@EF00002 DS    0H                                                  0151 00088000
@ER00002 LM    @14,@12,@SA00002                                    0151 00089000
         BR    @14                                                 0151 00090000
*                                                                  0152 00091000
*/********************************************************************/ 00092000
*/*                                                                  */ 00093000
*/* BLSRSYRG--GET THE SYMBOL RANGE (INTERNAL PROCEDURE ONLY)         */ 00094000
*/*                                                                  */ 00095000
*/********************************************************************/ 00096000
*                                                                  0152 00097000
*BLSRSYRG:                                                         0152 00098000
*   PROCEDURE;                                                     0152 00099000
BLSRSYRG STM   @14,@12,12(@13)                                     0152 00100000
*   RANGEORG=ZZZSYMIN;              /* DEFAULT LOWER BOUND           */ 00101000
         MVC   RANGEORG(31),@CC00180                               0153 00102000
*   RANGEEND=ZZZSYMAX;              /* DEFAULT UPPER BOUND           */ 00103000
         MVC   RANGEEND(31),@CC00176                               0154 00104000
*   IF PDSYMIL(1)=0|                /* NO SYMBOL SPECIFIED           */ 00105000
*       (PDSYMIL(1)=1&PDSYMI1(1:1)='*')/* ASTERISK SPECIFIED         */ 00106000
*     THEN                                                         0155 00107000
         LH    @14,PDSYMIL(,PDSYMP)                                0155 00108000
         LTR   @14,@14                                             0155 00109000
         BZ    @RT00155                                            0155 00110000
         C     @14,@CF00052                                        0155 00111000
         BNE   @RF00155                                            0155 00112000
         L     @14,PDSYMIP(,PDSYMP)                                0155 00113000
         CLI   PDSYMI1(@14),C'*'                                   0155 00114000
         BE    @RT00155                                            0155 00115000
*     ;                             /* DEFAULT RANGE                 */ 00116000
*   ELSE                                                           0157 00117000
*     DO;                           /* EXPLICIT RANGE                */ 00118000
@RF00155 DS    0H                                                  0158 00119000
*       RANGEORG(1:PDSYMIL(1))=PDSYMI1(1:PDSYMIL(1));/* ORIGIN       */ 00120000
         LH    @14,PDSYMIL(,PDSYMP)                                0158 00121000
         BCTR  @14,0                                               0158 00122000
         L     @10,PDSYMIP(,PDSYMP)                                0158 00123000
         EX    @14,@SM00964                                        0158 00124000
*       IF PDSYMIFP(2)='1'B THEN    /* EXPLICIT RANGE END            */ 00125000
         TM    PDSYMIFP+8(PDSYMP),B'10000000'                      0159 00126000
         BNO   @RF00159                                            0159 00127000
*         RANGEEND(1:PDSYMIL(2))=PDSYMI2(1:PDSYMIL(2));            0160 00128000
         LH    @14,PDSYMIL+8(,PDSYMP)                              0160 00129000
         BCTR  @14,0                                               0160 00130000
         L     @10,PDSYMIP+8(,PDSYMP)                              0160 00131000
         EX    @14,@SM00966                                        0160 00132000
*       ELSE                        /* IMPLICIT RANGE END            */ 00133000
*         RANGEEND=RANGEORG;        /* RANGE END                     */ 00134000
         B     @RC00159                                            0161 00135000
@RF00159 MVC   RANGEEND(31),RANGEORG                               0161 00136000
*     END;                                                         0162 00137000
*   END BLSRSYRG;                   /* GET THE RANGE                 */ 00138000
@EL00003 DS    0H                                                  0163 00139000
@EF00003 DS    0H                                                  0163 00140000
@ER00003 LM    @14,@12,12(@13)                                     0163 00141000
         BR    @14                                                 0163 00142000
*                                                                  0164 00143000
*/*BLSRPEND--DEBUGGING MODULE                                        */ 00144000
*/*BLSUPEND--MVS IPCS MODULE                                         */ 00145000
*                                                                  0164 00146000
*   DECLARE                         /* COMMON VARIABLES              */ 00147000
*     I256C CHAR(256) BASED,                                       0164 00148000
*     I031F FIXED(31) BASED,                                       0164 00149000
*     I031P PTR(31) BASED,                                         0164 00150000
*     I015F FIXED(15) BASED,                                       0164 00151000
*     I015P PTR(15) BASED,                                         0164 00152000
*     I008P PTR(8) BASED,                                          0164 00153000
*     I001C CHAR(1) BASED;                                         0164 00154000
*   GENERATE NODEFS NOREFS DATA;                                   0165 00155000
*   END BLSRSYRB                    /* BLRPEND(BLSRSYRB)             */ 00156000
*                                                                  0166 00157000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00158000
*/*%INCLUDE SYSLIB  (BLSRZZZ )                                       */ 00159000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00160000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00161000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00162000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00163000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00164000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00165000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00166000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00167000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00168000
*/*%INCLUDE SYSLIB  (BLSRSERV)                                       */ 00169000
*/*%INCLUDE SYSLIB  (BLSRSYPL)                                       */ 00170000
*/*%INCLUDE SYSLIB  (BLSRSYRG)                                       */ 00171000
*                                                                  0166 00172000
*       ;                                                          0166 00173000
@EL00001 L     @13,4(,@13)                                         0166 00174000
@EF00001 L     @00,@SIZDATD                                        0166 00175000
         LR    @01,@11                                             0166 00176000
         BLSUFRES R,LV=(0),A=(1)                                        00177000
@ER00001 LM    @14,@12,12(@13)                                     0166 00178000
         BR    @14                                                 0166 00179000
@DATA    DS    0H                                                       00180000
@SM00964 MVC   RANGEORG(0),PDSYMI1(@10)                                 00181000
@SM00966 MVC   RANGEEND(0),PDSYMI2(@10)                                 00182000
@DATD    DSECT                                                          00183000
         DS    0F                                                       00184000
@SA00001 DS    18F                                                      00185000
@PC00001 DS    4F                                                       00186000
@SA00002 DS    15F                                                      00187000
BLSRSYRB CSECT                                                          00188000
         DS    0F                                                       00189000
@CF00052 DC    F'1'                                                     00190000
@DATD    DSECT                                                          00191000
         DS    0D                                                       00192000
RANGEORG DS    CL31                                                     00193000
RANGEEND DS    CL31                                                     00194000
BLSRSYRB CSECT                                                          00195000
         DS    0F                                                       00196000
@SIZDATD DC    AL1(0)                                                   00197000
         DC    AL3(@ENDDATD-@DATD)                                      00198000
         DS    0D                                                       00199000
@CC00176 DC    C'Z999999999999999999999999999999'                       00200000
@CC00180 DC    C'$                              '                       00201000
@DATD    DSECT                                                          00202000
         SPACE 2                                                        00203000
*********************************************************************** 00204000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00205000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 00206000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 00207000
*********************************************************************** 00208000
         SPACE                                                          00209000
BLSRSYRB CSECT                                                          00210000
         ORG                                                            00211000
         DS    0D                                                       00212000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSRSYRB+19)/20+7)/8)CL8'BLSRSYRB'     00213000
@DATD    DSECT                                                          00214000
         DS    0H                                                       00215000
@DATD    DSECT                                                          00216000
         SPACE 2                                                        00217000
*********************************************************************** 00218000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 00219000
*********************************************************************** 00220000
         SPACE                                                          00221000
         DS    0D                                                       00222000
@DATD    DSECT                                                          00223000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00224000
@ENDDATD EQU   *                                                        00225000
BLSRSYRB CSECT                                                          00226000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00227000
@01      EQU   01                                                       00228000
@02      EQU   02                                                       00229000
@03      EQU   03                                                       00230000
@04      EQU   04                                                       00231000
@05      EQU   05                                                       00232000
@06      EQU   06                                                       00233000
@07      EQU   07                                                       00234000
@08      EQU   08                                                       00235000
@09      EQU   09                                                       00236000
@10      EQU   10                                                       00237000
@11      EQU   11                                                       00238000
@12      EQU   12                                                       00239000
@13      EQU   13                                                       00240000
@14      EQU   14                                                       00241000
@15      EQU   15                                                       00242000
PDSYMP   EQU   @03                                                      00243000
RETC     EQU   @04                                                      00244000
R9       EQU   @09                                                      00245000
R0       EQU   @00                                                      00246000
R1       EQU   @01                                                      00247000
R2       EQU   @02                                                      00248000
R3       EQU   @03                                                      00249000
R4       EQU   @04                                                      00250000
R5       EQU   @05                                                      00251000
RB       EQU   @11                                                      00252000
RD       EQU   @13                                                      00253000
RE       EQU   @14                                                      00254000
RF       EQU   @15                                                      00255000
RA       EQU   @10                                                      00256000
RC       EQU   @12                                                      00257000
R6       EQU   @06                                                      00258000
R7       EQU   @07                                                      00259000
R8       EQU   @08                                                      00260000
ZZ1      EQU   0                                                        00261000
ZZ1PNULL EQU   ZZ1+8                                                    00262000
ZZ1ATTN  EQU   ZZ1+360                                                  00263000
ZZ1EVE   EQU   ZZ1ATTN+4                                                00264000
ZZ1F     EQU   ZZ1+368                                                  00265000
ZZ1N     EQU   ZZ1+1116                                                 00266000
ZZ2      EQU   0                                                        00267000
ZZ2AMD   EQU   ZZ2                                                      00268000
@NM00013 EQU   ZZ2AMD+7                                                 00269000
ZZ2PRT   EQU   ZZ2+138                                                  00270000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 00271000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                00272000
ZZ2A     EQU   ZZ2+272                                                  00273000
ZZ2AF    EQU   ZZ2A+16                                                  00274000
ZZ2APID  EQU   ZZ2A+64                                                  00275000
ZZ2AD    EQU   ZZ2A+74                                                  00276000
ZZ2ADD   EQU   ZZ2AD                                                    00277000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 00278000
ZZ2ADM   EQU   ZZ2AD+46                                                 00279000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 00280000
ZZ2ADP   EQU   ZZ2AD+56                                                 00281000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 00282000
ZZ2AZZ6P EQU   ZZ2A+140                                                 00283000
ZZ2AQAS  EQU   ZZ2A+144                                                 00284000
ZZ2AQD   EQU   ZZ2A+160                                                 00285000
ZZ2AQDT  EQU   ZZ2AQD+10                                                00286000
ZZ2AQDF  EQU   ZZ2AQD+52                                                00287000
ZZ2STG   EQU   ZZ2+960                                                  00288000
ZZ2ALLOP EQU   ZZ2+992                                                  00289000
ZZ2FREEP EQU   ZZ2+996                                                  00290000
ZZ2FF19P EQU   ZZ2+1000                                                 00291000
ZZ2FRE1P EQU   ZZ2+1004                                                 00292000
ZZ2FF18P EQU   ZZ2+1008                                                 00293000
ZZ2DYNAP EQU   ZZ2+1012                                                 00294000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 00295000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 00296000
ZZ2STAIP EQU   ZZ2+1024                                                 00297000
ZZ2FF02P EQU   ZZ2+1028                                                 00298000
ZZ2GETLP EQU   ZZ2+1032                                                 00299000
ZZ2PARSP EQU   ZZ2+1036                                                 00300000
ZZ2PTGTP EQU   ZZ2+1040                                                 00301000
ZZ2PUTLP EQU   ZZ2+1044                                                 00302000
ZZ2SCANP EQU   ZZ2+1048                                                 00303000
ZZ2STCKP EQU   ZZ2+1052                                                 00304000
ZZ2TRMOP EQU   ZZ2+1064                                                 00305000
ZZ2TRMVP EQU   ZZ2+1068                                                 00306000
ZZ2PUTNP EQU   ZZ2+1084                                                 00307000
ZZ2TRMNP EQU   ZZ2+1088                                                 00308000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 00309000
ZZ2BVTP  EQU   ZZ2+1280                                                 00310000
ZZ2RVTP  EQU   ZZ2+1284                                                 00311000
ZZ2CPPL  EQU   ZZ2+1292                                                 00312000
ZZ2CPPLC EQU   ZZ2CPPL                                                  00313000
ZZ2ITR   EQU   ZZ2+2840                                                 00314000
ZZ2ITRE  EQU   ZZ2ITR+16                                                00315000
ZZ2ITSE  EQU   ZZ2+2864                                                 00316000
ZZ2ES    EQU   ZZ2+2872                                                 00317000
ZZ2AMDX  EQU   ZZ2+7160                                                 00318000
ZZ2AXO   EQU   ZZ2+7934                                                 00319000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 00320000
CMD      EQU   0                                                        00321000
CMDT     EQU   CMD+4                                                    00322000
PSCB     EQU   0                                                        00323000
PSCBATR1 EQU   PSCB+16                                                  00324000
ECT      EQU   0                                                        00325000
ECTSWS   EQU   ECT+28                                                   00326000
ECTSWS2  EQU   ECT+40                                                   00327000
ECTSWS21 EQU   ECTSWS2                                                  00328000
UPT      EQU   0                                                        00329000
UPTSWS   EQU   UPT+12                                                   00330000
SA       EQU   0                                                        00331000
SA1      EQU   SA                                                       00332000
SAR      EQU   SA+12                                                    00333000
SAR1     EQU   SAR+12                                                   00334000
BVT      EQU   0                                                        00335000
BVTPUTLP EQU   BVT+4                                                    00336000
BVTPUTOP EQU   BVT+12                                                   00337000
BVTPUTTP EQU   BVT+16                                                   00338000
BVTPUTVP EQU   BVT+20                                                   00339000
BVTPUTAP EQU   BVT+24                                                   00340000
BVTPRTTP EQU   BVT+28                                                   00341000
BVTPRTAP EQU   BVT+32                                                   00342000
BVTPUTDP EQU   BVT+36                                                   00343000
BVTMONP  EQU   BVT+40                                                   00344000
BVTMON2P EQU   BVT+44                                                   00345000
BVTVSARP EQU   BVT+48                                                   00346000
BVTVSENP EQU   BVT+64                                                   00347000
BVTVSERP EQU   BVT+68                                                   00348000
BVTVSGEP EQU   BVT+72                                                   00349000
BVTVSGUP EQU   BVT+76                                                   00350000
BVTVSPOP EQU   BVT+80                                                   00351000
BVTVSPUP EQU   BVT+84                                                   00352000
BVTMPKNP EQU   BVT+104                                                  00353000
BVTMONLP EQU   BVT+108                                                  00354000
BVTPUTCP EQU   BVT+132                                                  00355000
BVTMPK1P EQU   BVT+136                                                  00356000
BVTZZ2RP EQU   BVT+140                                                  00357000
BVTPGMRP EQU   BVT+144                                                  00358000
BVTMONAP EQU   BVT+148                                                  00359000
BVTBLDDP EQU   BVT+152                                                  00360000
BVTBLDLP EQU   BVT+156                                                  00361000
BVTPGMCP EQU   BVT+160                                                  00362000
BVTPGMDP EQU   BVT+164                                                  00363000
BVTPGMLP EQU   BVT+168                                                  00364000
BVTMONCP EQU   BVT+180                                                  00365000
BVTMONDP EQU   BVT+184                                                  00366000
BVTMONTP EQU   BVT+188                                                  00367000
BVTPARIP EQU   BVT+192                                                  00368000
BVTPARUP EQU   BVT+196                                                  00369000
BVTPRTNP EQU   BVT+204                                                  00370000
BVTVSCRP EQU   BVT+208                                                  00371000
BVTVSMRP EQU   BVT+212                                                  00372000
BVTMONXP EQU   BVT+216                                                  00373000
BVTTRMAP EQU   BVT+228                                                  00374000
ZZ6      EQU   0                                                        00375000
ZZ6D     EQU   ZZ6+128                                                  00376000
ZZ6DD    EQU   ZZ6D+8                                                   00377000
ZZ6DDT   EQU   ZZ6DD+4                                                  00378000
ZZ6DQA   EQU   ZZ6D+68                                                  00379000
ZZ6DF    EQU   ZZ6D+92                                                  00380000
ZZ6B     EQU   ZZ6+768                                                  00381000
RVT      EQU   0                                                        00382000
RVTADDRP EQU   RVT                                                      00383000
RVTT01P  EQU   RVT+4                                                    00384000
RVTTAP   EQU   RVT+8                                                    00385000
RVTTBP   EQU   RVT+12                                                   00386000
RVTTCP   EQU   RVT+16                                                   00387000
RVTTFP   EQU   RVT+24                                                   00388000
RVTTYP   EQU   RVT+40                                                   00389000
RVTT02P  EQU   RVT+48                                                   00390000
RVTT03P  EQU   RVT+52                                                   00391000
RVTT04P  EQU   RVT+56                                                   00392000
RVTACCLP EQU   RVT+60                                                   00393000
RVTRACCP EQU   RVT+64                                                   00394000
RVTTLP   EQU   RVT+68                                                   00395000
RVTTMP   EQU   RVT+72                                                   00396000
RVTTUP   EQU   RVT+80                                                   00397000
RVTESGEP EQU   RVT+84                                                   00398000
RVTESGUP EQU   RVT+88                                                   00399000
RVTESARP EQU   RVT+92                                                   00400000
RVTRAARP EQU   RVT+96                                                   00401000
RVTRAGEP EQU   RVT+100                                                  00402000
RVTADDPP EQU   RVT+104                                                  00403000
RVTACCQP EQU   RVT+108                                                  00404000
RVTSAGUP EQU   RVT+124                                                  00405000
RVTSAGEP EQU   RVT+128                                                  00406000
RVTESCKP EQU   RVT+132                                                  00407000
RVTMSGAP EQU   RVT+136                                                  00408000
RVTMSGDP EQU   RVT+140                                                  00409000
RVTADDTP EQU   RVT+160                                                  00410000
RVTADDUP EQU   RVT+164                                                  00411000
RVTADD1P EQU   RVT+176                                                  00412000
RVTADD2P EQU   RVT+180                                                  00413000
RVTRSAGP EQU   RVT+184                                                  00414000
RVTMSGBP EQU   RVT+188                                                  00415000
RVTADDSP EQU   RVT+192                                                  00416000
RVTADD3P EQU   RVT+196                                                  00417000
RVTT05P  EQU   RVT+200                                                  00418000
RVTPADSP EQU   RVT+204                                                  00419000
RVTTRP   EQU   RVT+228                                                  00420000
RVTADD4P EQU   RVT+232                                                  00421000
RVTSAPCP EQU   RVT+236                                                  00422000
RVTSAARP EQU   RVT+240                                                  00423000
RVTSAGNP EQU   RVT+244                                                  00424000
RVTT06P  EQU   RVT+248                                                  00425000
RVTSAGCP EQU   RVT+252                                                  00426000
RVTSAGQP EQU   RVT+256                                                  00427000
RVTESGCP EQU   RVT+260                                                  00428000
RVTESGQP EQU   RVT+264                                                  00429000
RVTDUCKP EQU   RVT+276                                                  00430000
RVTDUCCP EQU   RVT+280                                                  00431000
PDSYMX   EQU   0                                                        00432000
@NM00077 EQU   PDSYMX                                                   00433000
PDSYMIP  EQU   @NM00077                                                 00434000
PDSYMIL  EQU   @NM00077+4                                               00435000
PDSYMIF  EQU   @NM00077+6                                               00436000
PDSYMIFP EQU   PDSYMIF                                                  00437000
PDSYMIF2 EQU   PDSYMIF                                                  00438000
PDSYMIF3 EQU   PDSYMIF                                                  00439000
PDSYMXP  EQU   PDSYMX+16                                                00440000
PDSYMI1  EQU   0                                                        00441000
PDSYMI2  EQU   0                                                        00442000
BLSRACC  EQU   0                                                        00443000
BLSRACCL EQU   0                                                        00444000
BLSRACCQ EQU   0                                                        00445000
BLSRADDP EQU   0                                                        00446000
BLSRADDR EQU   0                                                        00447000
BLSRADDS EQU   0                                                        00448000
BLSRADDT EQU   0                                                        00449000
BLSRADDU EQU   0                                                        00450000
BLSRADD1 EQU   0                                                        00451000
BLSRADD2 EQU   0                                                        00452000
BLSRADD3 EQU   0                                                        00453000
BLSRADD4 EQU   0                                                        00454000
BLSRDUCC EQU   0                                                        00455000
BLSRDUCK EQU   0                                                        00456000
BLSRESAR EQU   0                                                        00457000
BLSRESCK EQU   0                                                        00458000
BLSRESGC EQU   0                                                        00459000
BLSRESGE EQU   0                                                        00460000
BLSRESGQ EQU   0                                                        00461000
BLSRESGU EQU   0                                                        00462000
BLSRMSGA EQU   0                                                        00463000
BLSRMSGB EQU   0                                                        00464000
BLSRMSGD EQU   0                                                        00465000
BLSRPADS EQU   0                                                        00466000
BLSRRAAR EQU   0                                                        00467000
BLSRRAGE EQU   0                                                        00468000
BLSRSAAR EQU   0                                                        00469000
BLSRSAG  EQU   0                                                        00470000
BLSRSAGC EQU   0                                                        00471000
BLSRSAGE EQU   0                                                        00472000
BLSRSAGN EQU   0                                                        00473000
BLSRSAGQ EQU   0                                                        00474000
BLSRSAGU EQU   0                                                        00475000
BLSRSAPC EQU   0                                                        00476000
BLSTA    EQU   0                                                        00477000
BLSTB    EQU   0                                                        00478000
BLSTC    EQU   0                                                        00479000
BLSTF    EQU   0                                                        00480000
BLSTL    EQU   0                                                        00481000
BLSTM    EQU   0                                                        00482000
BLSTR    EQU   0                                                        00483000
BLSTU    EQU   0                                                        00484000
BLSTY    EQU   0                                                        00485000
BLST01   EQU   0                                                        00486000
BLST02   EQU   0                                                        00487000
BLST03   EQU   0                                                        00488000
BLST04   EQU   0                                                        00489000
BLST05   EQU   0                                                        00490000
BLST06   EQU   0                                                        00491000
BLSUALLO EQU   0                                                        00492000
BLSUBLDD EQU   0                                                        00493000
BLSUBLDL EQU   0                                                        00494000
BLSUDYNA EQU   0                                                        00495000
BLSUFREE EQU   0                                                        00496000
BLSUFRE1 EQU   0                                                        00497000
BLSUMON  EQU   0                                                        00498000
BLSUMONA EQU   0                                                        00499000
BLSUMONC EQU   0                                                        00500000
BLSUMOND EQU   0                                                        00501000
BLSUMONL EQU   0                                                        00502000
BLSUMONT EQU   0                                                        00503000
BLSUMONX EQU   0                                                        00504000
BLSUMON2 EQU   0                                                        00505000
BLSUMPKN EQU   0                                                        00506000
BLSUMPK1 EQU   0                                                        00507000
BLSUPARI EQU   0                                                        00508000
BLSUPARU EQU   0                                                        00509000
BLSUPGMC EQU   0                                                        00510000
BLSUPGMD EQU   0                                                        00511000
BLSUPGML EQU   0                                                        00512000
BLSUPGMR EQU   0                                                        00513000
BLSUPRTA EQU   0                                                        00514000
BLSUPRTN EQU   0                                                        00515000
BLSUPRTT EQU   0                                                        00516000
BLSUPUTA EQU   0                                                        00517000
BLSUPUTC EQU   0                                                        00518000
BLSUPUTD EQU   0                                                        00519000
BLSUPUTL EQU   0                                                        00520000
BLSUPUTN EQU   0                                                        00521000
BLSUPUTO EQU   0                                                        00522000
BLSUPUTT EQU   0                                                        00523000
BLSUPUTV EQU   0                                                        00524000
BLSUSTAI EQU   0                                                        00525000
BLSUTRMA EQU   0                                                        00526000
BLSUTRMN EQU   0                                                        00527000
BLSUTRMO EQU   0                                                        00528000
BLSUTRMV EQU   0                                                        00529000
BLSUVSAR EQU   0                                                        00530000
BLSUVSCR EQU   0                                                        00531000
BLSUVSEN EQU   0                                                        00532000
BLSUVSER EQU   0                                                        00533000
BLSUVSGE EQU   0                                                        00534000
BLSUVSGU EQU   0                                                        00535000
BLSUVSMR EQU   0                                                        00536000
BLSUVSPO EQU   0                                                        00537000
BLSUVSPU EQU   0                                                        00538000
BLSUZZ2C EQU   0                                                        00539000
BLSUZZ2D EQU   0                                                        00540000
BLSUZZ2R EQU   0                                                        00541000
IKJEFF02 EQU   0                                                        00542000
IKJEFF18 EQU   0                                                        00543000
IKJEFF19 EQU   0                                                        00544000
IKJGETL  EQU   0                                                        00545000
IKJPARS  EQU   0                                                        00546000
IKJPTGT  EQU   0                                                        00547000
IKJPUTL  EQU   0                                                        00548000
IKJSCAN  EQU   0                                                        00549000
IKJSTCK  EQU   0                                                        00550000
I001C    EQU   0                                                        00551000
I008P    EQU   0                                                        00552000
I015F    EQU   0                                                        00553000
I015P    EQU   0                                                        00554000
I031F    EQU   0                                                        00555000
I031P    EQU   0                                                        00556000
I256C    EQU   0                                                        00557000
PZ2      EQU   0                                                        00558000
RANGEMIN EQU   0                                                        00559000
RANGEMAX EQU   0                                                        00560000
PDSYM    EQU   0                                                        00561000
CPPL     EQU   ZZ2CPPL                                                  00562000
CPPLUPT  EQU   CPPL+4                                                   00563000
CPPLPSCB EQU   CPPL+8                                                   00564000
CPPLECT  EQU   CPPL+12                                                  00565000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00566000
CPPLCBUF EQU   CPPL                                                     00567000
@NM00078 EQU   @NM00077+7                                               00568000
PDSYMIF8 EQU   PDSYMIF                                                  00569000
PDSYMIF7 EQU   PDSYMIF                                                  00570000
PDSYMIF6 EQU   PDSYMIF                                                  00571000
PDSYMIF5 EQU   PDSYMIF                                                  00572000
PDSYMIF4 EQU   PDSYMIF                                                  00573000
RVT99999 EQU   RVT+384                                                  00574000
RVT0096P EQU   RVT+380                                                  00575000
RVT0095P EQU   RVT+376                                                  00576000
RVT0094P EQU   RVT+372                                                  00577000
RVT0093P EQU   RVT+368                                                  00578000
RVT0092P EQU   RVT+364                                                  00579000
RVT0091P EQU   RVT+360                                                  00580000
RVT0090P EQU   RVT+356                                                  00581000
RVT0089P EQU   RVT+352                                                  00582000
RVT0088P EQU   RVT+348                                                  00583000
RVT0087P EQU   RVT+344                                                  00584000
RVT0086P EQU   RVT+340                                                  00585000
RVT0085P EQU   RVT+336                                                  00586000
RVT0084P EQU   RVT+332                                                  00587000
RVT0083P EQU   RVT+328                                                  00588000
RVT0082P EQU   RVT+324                                                  00589000
RVT0081P EQU   RVT+320                                                  00590000
RVT0080P EQU   RVT+316                                                  00591000
RVT0079P EQU   RVT+312                                                  00592000
RVT0078P EQU   RVT+308                                                  00593000
RVT0077P EQU   RVT+304                                                  00594000
RVT0076P EQU   RVT+300                                                  00595000
RVT0075P EQU   RVT+296                                                  00596000
RVT0074P EQU   RVT+292                                                  00597000
RVT0073P EQU   RVT+288                                                  00598000
RVT0072P EQU   RVT+284                                                  00599000
RVTDTUTP EQU   RVT+272                                                  00600000
RVTDTMTP EQU   RVT+268                                                  00601000
RVT0057P EQU   RVT+224                                                  00602000
RVT0056P EQU   RVT+220                                                  00603000
RVT0055P EQU   RVT+216                                                  00604000
RVT0054P EQU   RVT+212                                                  00605000
RVT0053P EQU   RVT+208                                                  00606000
RVT0044P EQU   RVT+172                                                  00607000
RVT0043P EQU   RVT+168                                                  00608000
RVT0040P EQU   RVT+156                                                  00609000
RVT0039P EQU   RVT+152                                                  00610000
RVT0038P EQU   RVT+148                                                  00611000
RVT0037P EQU   RVT+144                                                  00612000
RVT0031P EQU   RVT+120                                                  00613000
RVT0030P EQU   RVT+116                                                  00614000
RVT0029P EQU   RVT+112                                                  00615000
RVT0020P EQU   RVT+76                                                   00616000
RVT0012P EQU   RVT+44                                                   00617000
RVT0010P EQU   RVT+36                                                   00618000
RVT0009P EQU   RVT+32                                                   00619000
RVT0008P EQU   RVT+28                                                   00620000
RVT0006P EQU   RVT+20                                                   00621000
ZZ69999  EQU   ZZ6+1792                                                 00622000
ZZ6BRB   EQU   ZZ6B+12                                                  00623000
ZZ6BRC   EQU   ZZ6B+8                                                   00624000
@NM00076 EQU   ZZ6B+6                                                   00625000
ZZ6BFL   EQU   ZZ6B+4                                                   00626000
ZZ6BDA   EQU   ZZ6B                                                     00627000
@NM00075 EQU   ZZ6+540                                                  00628000
ZZ6BUFI  EQU   ZZ6+536                                                  00629000
ZZ6BUFP  EQU   ZZ6+532                                                  00630000
ZZ6FILE  EQU   ZZ6+524                                                  00631000
ZZ6BUFB  EQU   ZZ6+520                                                  00632000
ZZ6BUFL  EQU   ZZ6+518                                                  00633000
ZZ6BUFN  EQU   ZZ6+516                                                  00634000
ZZ6ZZ6P  EQU   ZZ6+512                                                  00635000
@NM00074 EQU   ZZ6+256                                                  00636000
ZZ6D999  EQU   ZZ6D+128                                                 00637000
@NM00073 EQU   ZZ6D+116                                                 00638000
ZZ6DCAP  EQU   ZZ6D+112                                                 00639000
ZZ6DPRP  EQU   ZZ6D+108                                                 00640000
ZZ6DDA2  EQU   ZZ6D+104                                                 00641000
ZZ6DDA1  EQU   ZZ6D+100                                                 00642000
@NM00072 EQU   ZZ6DF                                                    00643000
ZZ6DFSU  EQU   ZZ6DF                                                    00644000
ZZ6DFST  EQU   ZZ6DF                                                    00645000
ZZ6DFAB  EQU   ZZ6DF                                                    00646000
ZZ6DFMP  EQU   ZZ6DF                                                    00647000
ZZ6DFDU  EQU   ZZ6DF                                                    00648000
ZZ6DFBS  EQU   ZZ6DF                                                    00649000
ZZ6DQ2   EQU   ZZ6D+88                                                  00650000
ZZ6DQ1   EQU   ZZ6D+84                                                  00651000
ZZ6DQA9  EQU   ZZ6DQA+16                                                00652000
@NM00071 EQU   ZZ6DQA+12                                                00653000
ZZ6DQA2  EQU   ZZ6DQA+8                                                 00654000
ZZ6DQA1  EQU   ZZ6DQA+4                                                 00655000
@NM00070 EQU   ZZ6DQA+2                                                 00656000
ZZ6DQAT  EQU   ZZ6DQA                                                   00657000
ZZ6DQA0  EQU   ZZ6DQA                                                   00658000
ZZ6DRDX  EQU   ZZ6D+64                                                  00659000
ZZ6DELK  EQU   ZZ6D+64                                                  00660000
ZZ6DMEM  EQU   ZZ6D+56                                                  00661000
ZZ6DDT1  EQU   ZZ6DDT                                                   00662000
ZZ6DDO   EQU   ZZ6DD+2                                                  00663000
ZZ6DDL   EQU   ZZ6DD                                                    00664000
@NM00069 EQU   ZZ6D+2                                                   00665000
ZZ6DRID  EQU   ZZ6D                                                     00666000
ZZ6RDCB  EQU   ZZ6                                                      00667000
ZZ60000  EQU   ZZ6                                                      00668000
BVT99999 EQU   BVT+256                                                  00669000
BVT0064P EQU   BVT+252                                                  00670000
BVT0063P EQU   BVT+248                                                  00671000
BVT0062P EQU   BVT+244                                                  00672000
BVT0061P EQU   BVT+240                                                  00673000
BVT0060P EQU   BVT+236                                                  00674000
BVT0059P EQU   BVT+232                                                  00675000
BVT0057P EQU   BVT+224                                                  00676000
BVT0056P EQU   BVT+220                                                  00677000
BVTSTBLP EQU   BVT+200                                                  00678000
BVT0045P EQU   BVT+176                                                  00679000
BVT0044P EQU   BVT+172                                                  00680000
BVT0033P EQU   BVT+128                                                  00681000
BVT0032P EQU   BVT+124                                                  00682000
BVT0031P EQU   BVT+120                                                  00683000
BVT0030P EQU   BVT+116                                                  00684000
BVT0029P EQU   BVT+112                                                  00685000
BVT0026P EQU   BVT+100                                                  00686000
BVT0025P EQU   BVT+96                                                   00687000
BVT0024P EQU   BVT+92                                                   00688000
BVT0023P EQU   BVT+88                                                   00689000
BVT0016P EQU   BVT+60                                                   00690000
BVT0015P EQU   BVT+56                                                   00691000
BVT0014P EQU   BVT+52                                                   00692000
BVT0003P EQU   BVT+8                                                    00693000
BVT0001P EQU   BVT                                                      00694000
SA99     EQU   SA+72                                                    00695000
SARC     EQU   SAR+56                                                   00696000
SARB     EQU   SAR+52                                                   00697000
SARA     EQU   SAR+48                                                   00698000
SAR9     EQU   SAR+44                                                   00699000
SAR8     EQU   SAR+40                                                   00700000
SAR7     EQU   SAR+36                                                   00701000
SAR6     EQU   SAR+32                                                   00702000
SAR5     EQU   SAR+28                                                   00703000
SAR4     EQU   SAR+24                                                   00704000
SAR3     EQU   SAR+20                                                   00705000
SAR2     EQU   SAR+16                                                   00706000
SAR0     EQU   SAR+8                                                    00707000
SARF     EQU   SAR+4                                                    00708000
SARE     EQU   SAR                                                      00709000
SAFWD    EQU   SA+8                                                     00710000
SABAK    EQU   SA+4                                                     00711000
SA1L     EQU   SA1+1                                                    00712000
SA1P     EQU   SA1                                                      00713000
UPTPREFL EQU   UPT+23                                                   00714000
UPTPREFX EQU   UPT+16                                                   00715000
@NM00068 EQU   UPT+15                                                   00716000
UPTLDEL  EQU   UPT+14                                                   00717000
UPTCDEL  EQU   UPT+13                                                   00718000
UPTWTP   EQU   UPTSWS                                                   00719000
UPTMODE  EQU   UPTSWS                                                   00720000
UPTALD   EQU   UPTSWS                                                   00721000
UPTPAUS  EQU   UPTSWS                                                   00722000
UPTNCOM  EQU   UPTSWS                                                   00723000
UPTMID   EQU   UPTSWS                                                   00724000
UPTNPRM  EQU   UPTSWS                                                   00725000
UPTRCVR  EQU   UPTSWS                                                   00726000
UPTUSER  EQU   UPT+2                                                    00727000
@NM00067 EQU   UPT                                                      00728000
@NM00066 EQU   ECT+52                                                   00729000
@NM00065 EQU   ECT+48                                                   00730000
@NM00064 EQU   ECT+44                                                   00731000
@NM00063 EQU   ECTSWS2+1                                                00732000
@NM00062 EQU   ECTSWS21                                                 00733000
ECTTABND EQU   ECTSWS21                                                 00734000
ECTDEFCS EQU   ECTSWS21                                                 00735000
ECTBKPB  EQU   ECT+36                                                   00736000
ECTUSER  EQU   ECT+32                                                   00737000
ECTDDNUM EQU   ECT+29                                                   00738000
ECTATTN  EQU   ECTSWS                                                   00739000
ECTBKGRD EQU   ECTSWS                                                   00740000
ECTNNOT  EQU   ECTSWS                                                   00741000
ECTNMAL  EQU   ECTSWS                                                   00742000
ECTLOGF  EQU   ECTSWS                                                   00743000
ECTATRM  EQU   ECTSWS                                                   00744000
@NM00061 EQU   ECTSWS                                                   00745000
ECTNOPD  EQU   ECTSWS                                                   00746000
ECTSCMD  EQU   ECT+20                                                   00747000
ECTPCMD  EQU   ECT+12                                                   00748000
ECTSMSG  EQU   ECT+9                                                    00749000
ECTMSGF  EQU   ECT+8                                                    00750000
ECTIOWA  EQU   ECT+4                                                    00751000
ECTRTCD  EQU   ECT+1                                                    00752000
ECTRCDF  EQU   ECT                                                      00753000
PSCBU    EQU   PSCB+64                                                  00754000
PSCBRSZ  EQU   PSCB+60                                                  00755000
PSCBLINE EQU   PSCB+59                                                  00756000
PSCBCHAR EQU   PSCB+58                                                  00757000
PSCBUPTL EQU   PSCB+56                                                  00758000
PSCBUPT  EQU   PSCB+52                                                  00759000
PSCBRLGB EQU   PSCB+48                                                  00760000
PSCBDEST EQU   PSCB+40                                                  00761000
@NM00060 EQU   PSCB+36                                                  00762000
@NM00059 EQU   PSCB+32                                                  00763000
@NM00058 EQU   PSCB+28                                                  00764000
PSCBLTI2 EQU   PSCB+24                                                  00765000
PSCBLTIM EQU   PSCB+20                                                  00766000
PSCBATR2 EQU   PSCB+18                                                  00767000
@NM00057 EQU   PSCBATR1                                                 00768000
@NM00056 EQU   PSCBATR1                                                 00769000
@NM00055 EQU   PSCBATR1                                                 00770000
PSCBATTN EQU   PSCBATR1                                                 00771000
PSCBVMNT EQU   PSCBATR1                                                 00772000
PSCBJCL  EQU   PSCBATR1                                                 00773000
PSCBACCT EQU   PSCBATR1                                                 00774000
PSCBCTRL EQU   PSCBATR1                                                 00775000
PSCBGPNM EQU   PSCB+8                                                   00776000
PSCBUSRL EQU   PSCB+7                                                   00777000
PSCBUSER EQU   PSCB                                                     00778000
CMDT1    EQU   CMDT                                                     00779000
CMDO     EQU   CMD+2                                                    00780000
CMDL     EQU   CMD                                                      00781000
ZZ299999 EQU   ZZ2+8192                                                 00782000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  00783000
ZZ2AXOL  EQU   ZZ2AXO                                                   00784000
@NM00054 EQU   ZZ2+7288                                                 00785000
@NM00053 EQU   ZZ2AMDX+4                                                00786000
ZZ2AMDXC EQU   ZZ2AMDX                                                  00787000
ZZ2HSD   EQU   ZZ2+3056                                                 00788000
@NM00052 EQU   ZZ2ES                                                    00789000
@NM00051 EQU   ZZ2+2868                                                 00790000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                00791000
@NM00050 EQU   ZZ2ITSE                                                  00792000
ZZ2ITSEP EQU   ZZ2ITSE                                                  00793000
ZZ2ITSEW EQU   ZZ2ITSE                                                  00794000
@NM00049 EQU   ZZ2ITR+20                                                00795000
ZZ2ITREC EQU   ZZ2ITRE+1                                                00796000
@NM00048 EQU   ZZ2ITRE                                                  00797000
ZZ2ITREP EQU   ZZ2ITRE                                                  00798000
ZZ2ITREW EQU   ZZ2ITRE                                                  00799000
@NM00047 EQU   ZZ2ITR+9                                                 00800000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 00801000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 00802000
ZZ2ITRPP EQU   ZZ2ITR                                                   00803000
@NM00046 EQU   ZZ2+1544                                                 00804000
ZZ2PGM   EQU   ZZ2+1536                                                 00805000
@NM00045 EQU   ZZ2+1526                                                 00806000
ZZ2CW    EQU   ZZ2+1524                                                 00807000
@NM00044 EQU   ZZ2+1504                                                 00808000
@NM00043 EQU   ZZ2+1352                                                 00809000
ZZ2FFSYP EQU   ZZ2+1348                                                 00810000
ZZ2SASYP EQU   ZZ2+1344                                                 00811000
ZZ2RDSYP EQU   ZZ2+1340                                                 00812000
ZZ2RASYP EQU   ZZ2+1336                                                 00813000
ZZ2PHSYP EQU   ZZ2+1332                                                 00814000
ZZ2ESSYP EQU   ZZ2+1328                                                 00815000
ZZ200SYP EQU   ZZ2+1324                                                 00816000
ZZ2SCWP  EQU   ZZ2+1320                                                 00817000
ZZ2TTLP  EQU   ZZ2+1316                                                 00818000
ZZ2LOADP EQU   ZZ2+1312                                                 00819000
ZZ2VRESP EQU   ZZ2+1308                                                 00820000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               00821000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                00822000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                00823000
ZZ2VRSAP EQU   ZZ2+1288                                                 00824000
ZZ2DVTP  EQU   ZZ2+1276                                                 00825000
@NM00042 EQU   ZZ2+1272                                                 00826000
@NM00041 EQU   ZZ2+1268                                                 00827000
ZZ2RPLP  EQU   ZZ2+1260                                                 00828000
ZZ2TCBP  EQU   ZZ2+1256                                                 00829000
@NM00040 EQU   ZZ2+1252                                                 00830000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 00831000
@NM00039 EQU   ZZ2+1112                                                 00832000
ZZ2FPDRP EQU   ZZ2+1108                                                 00833000
ZZ2FDSDP EQU   ZZ2+1104                                                 00834000
ZZ2APDRP EQU   ZZ2+1100                                                 00835000
ZZ2ADSDP EQU   ZZ2+1096                                                 00836000
ZZ2ENQ0P EQU   ZZ2+1092                                                 00837000
@NM00038 EQU   ZZ2+1080                                                 00838000
ZZ2MSG0P EQU   ZZ2+1076                                                 00839000
ZZ2FT25P EQU   ZZ2+1072                                                 00840000
ZZ2MSGSP EQU   ZZ2+1060                                                 00841000
ZZ2ALOCP EQU   ZZ2+1056                                                 00842000
@NM00037 EQU   ZZ2+976                                                  00843000
ZZ2TOD   EQU   ZZ2+968                                                  00844000
ZZ2STGN  EQU   ZZ2STG+4                                                 00845000
ZZ2STGP  EQU   ZZ2STG                                                   00846000
@NM00036 EQU   ZZ2+952                                                  00847000
ZZ2SCMDE EQU   ZZ2+944                                                  00848000
ZZ2SCMDN EQU   ZZ2+936                                                  00849000
ZZ2IDENT EQU   ZZ2+928                                                  00850000
ZZ2A9999 EQU   ZZ2A+656                                                 00851000
@NM00035 EQU   ZZ2A+224                                                 00852000
@NM00034 EQU   ZZ2A+220                                                 00853000
ZZ2AQD99 EQU   ZZ2AQD+60                                                00854000
@NM00033 EQU   ZZ2AQD+56                                                00855000
@NM00032 EQU   ZZ2AQDF                                                  00856000
ZZ2AQDFA EQU   ZZ2AQDF                                                  00857000
ZZ2AQDIL EQU   ZZ2AQD+48                                                00858000
ZZ2AQDIM EQU   ZZ2AQD+44                                                00859000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               00860000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               00861000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                00862000
@NM00031 EQU   ZZ2AQDT+1                                                00863000
ZZ2AQDTY EQU   ZZ2AQDT                                                  00864000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  00865000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 00866000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 00867000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 00868000
ZZ2AQDOF EQU   ZZ2AQD                                                   00869000
ZZ2AQD00 EQU   ZZ2AQD                                                   00870000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               00871000
@NM00030 EQU   ZZ2AQAS+12                                               00872000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                00873000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                00874000
@NM00029 EQU   ZZ2AQAS+2                                                00875000
ZZ2AQAST EQU   ZZ2AQAS                                                  00876000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  00877000
ZZ2ADPTA EQU   ZZ2ADPT                                                  00878000
ZZ2ADPL  EQU   ZZ2ADP                                                   00879000
ZZ2ADMTA EQU   ZZ2ADMT                                                  00880000
ZZ2ADML  EQU   ZZ2ADM                                                   00881000
ZZ2ADDTA EQU   ZZ2ADDT                                                  00882000
ZZ2ADDL  EQU   ZZ2ADD                                                   00883000
@NM00028 EQU   ZZ2A+72                                                  00884000
ZZ2APIDB EQU   ZZ2APID+3                                                00885000
ZZ2APIDA EQU   ZZ2APID                                                  00886000
@NM00027 EQU   ZZ2A+24                                                  00887000
@NM00026 EQU   ZZ2AF+5                                                  00888000
ZZ2AFX   EQU   ZZ2AF+5                                                  00889000
@NM00025 EQU   ZZ2AF+3                                                  00890000
ZZ2AFS   EQU   ZZ2AF+2                                                  00891000
ZZ2AFD   EQU   ZZ2AF+2                                                  00892000
ZZ2AFQ   EQU   ZZ2AF+2                                                  00893000
ZZ2AF$   EQU   ZZ2AF+2                                                  00894000
@NM00024 EQU   ZZ2AF+2                                                  00895000
ZZ2AFM   EQU   ZZ2AF+2                                                  00896000
@NM00023 EQU   ZZ2AF+2                                                  00897000
@NM00022 EQU   ZZ2AF+1                                                  00898000
ZZ2AFV   EQU   ZZ2AF+1                                                  00899000
@NM00021 EQU   ZZ2AF+1                                                  00900000
ZZ2AFC   EQU   ZZ2AF+1                                                  00901000
@NM00020 EQU   ZZ2AF                                                    00902000
ZZ2AFFS  EQU   ZZ2AF                                                    00903000
ZZ2AFT   EQU   ZZ2AF                                                    00904000
ZZ2AFP   EQU   ZZ2AF                                                    00905000
@NM00019 EQU   ZZ2A+8                                                   00906000
ZZ2ALINE EQU   ZZ2A+4                                                   00907000
@NM00018 EQU   ZZ2A+3                                                   00908000
ZZ2ASE   EQU   ZZ2A+2                                                   00909000
ZZ2ACH   EQU   ZZ2A                                                     00910000
@NM00017 EQU   ZZ2+264                                                  00911000
@NM00016 EQU   ZZ2+263                                                  00912000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  00913000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 00914000
ZZ2PRTL  EQU   ZZ2PRT                                                   00915000
@NM00015 EQU   ZZ2AMD+56                                                00916000
ZZ2AMDXP EQU   ZZ2AMD+52                                                00917000
ZZ2AMDD  EQU   ZZ2AMD+48                                                00918000
ZZ2AMDL  EQU   ZZ2AMD+44                                                00919000
ZZ2AMDU  EQU   ZZ2AMD+28                                                00920000
ZZ2AMDF  EQU   ZZ2AMD+24                                                00921000
ZZ2AMDS  EQU   ZZ2AMD+20                                                00922000
ZZ2AMDC  EQU   ZZ2AMD+16                                                00923000
ZZ2AMDP  EQU   ZZ2AMD+12                                                00924000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 00925000
@NM00014 EQU   @NM00013                                                 00926000
ZZ2AMD2  EQU   @NM00013                                                 00927000
ZZ2AMD1  EQU   @NM00013                                                 00928000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 00929000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 00930000
ZZ2AMDT  EQU   ZZ2AMD                                                   00931000
ZZ199999 EQU   ZZ1+3072                                                 00932000
@NM00012 EQU   ZZ1+2160                                                 00933000
ZZ1TRTAS EQU   ZZ1+1904                                                 00934000
ZZ1TRUPC EQU   ZZ1+1648                                                 00935000
ZZ1TRCTX EQU   ZZ1+1392                                                 00936000
ZZ1NASID EQU   ZZ1N+274                                                 00937000
ZZ1NSTRL EQU   ZZ1N+272                                                 00938000
ZZ1NOFF  EQU   ZZ1N+268                                                 00939000
ZZ1NBDY  EQU   ZZ1N+264                                                 00940000
ZZ1NADE  EQU   ZZ1N+260                                                 00941000
ZZ1NADB  EQU   ZZ1N+256                                                 00942000
ZZ1NSTR  EQU   ZZ1N                                                     00943000
@NM00011 EQU   ZZ1+1080                                                 00944000
ZZ1TREBC EQU   ZZ1+824                                                  00945000
ZZ1TRHEX EQU   ZZ1+568                                                  00946000
@NM00010 EQU   ZZ1+377                                                  00947000
ZZ1USTAE EQU   ZZ1+376                                                  00948000
@NM00009 EQU   ZZ1F+1                                                   00949000
@NM00008 EQU   ZZ1F                                                     00950000
ZZ1FM    EQU   ZZ1F                                                     00951000
ZZ1FX    EQU   ZZ1F                                                     00952000
ZZ1FU    EQU   ZZ1F                                                     00953000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 00954000
@NM00007 EQU   ZZ1EVE                                                   00955000
ZZ1EVEP  EQU   ZZ1EVE                                                   00956000
ZZ1EVEW  EQU   ZZ1EVE                                                   00957000
ZZ1ACMP  EQU   ZZ1ATTN                                                  00958000
@NM00006 EQU   ZZ1+144                                                  00959000
ZZ1FPP   EQU   ZZ1+140                                                  00960000
ZZ1ZZ6P  EQU   ZZ1+136                                                  00961000
@NM00005 EQU   ZZ1+84                                                   00962000
ZZ1PLINE EQU   ZZ1+80                                                   00963000
ZZ1PGSZ  EQU   ZZ1+76                                                   00964000
ZZ1PCNT  EQU   ZZ1+72                                                   00965000
@NM00004 EQU   ZZ1+68                                                   00966000
ZZ1TPAGE EQU   ZZ1+64                                                   00967000
ZZ1TLINE EQU   ZZ1+60                                                   00968000
@NM00003 EQU   ZZ1+48                                                   00969000
ZZ1DSDP  EQU   ZZ1+44                                                   00970000
ZZ1PDRP  EQU   ZZ1+40                                                   00971000
ZZ1ZZ2P  EQU   ZZ1+36                                                   00972000
ZZ1327WP EQU   ZZ1+32                                                   00973000
ZZ1ACBP  EQU   ZZ1+28                                                   00974000
@NM00002 EQU   ZZ1+24                                                   00975000
ZZ1PDCBP EQU   ZZ1+20                                                   00976000
ZZ1BLRBL EQU   ZZ1+16                                                   00977000
@NM00001 EQU   ZZ1+12                                                   00978000
ZZ1NULL  EQU   ZZ1+4                                                    00979000
ZZ1IDE   EQU   ZZ1                                                      00980000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00981000
@RF00149 EQU   @EL00002                                                 00982000
@RT00155 EQU   @EL00003                                                 00983000
@RC00159 EQU   @EL00003                                                 00984000
@ENDDATA EQU   *                                                        00985000
         END   BLSRSYRB,(C'PLS2324',0701,78058)                         00986000
