MSGB     TITLE 'BLSRMSGB--IPCS STORAGE DESCRIPTION FORMATTER           *00001000
                        '                                               00002000
*/* CHANGE ACTIVITY -------------------------------------------------*/ 00003000
*/*   THIS MODULE WAS WRITTEN FOR @G57LPLK                           */ 00004000
*/*------------------------------------------------------------------*/ 00005000
BLSRMSGB CSECT ,                                                   0002 00006000
@MAINENT DS    0H                                                  0002 00007000
         USING *,@15                                               0002 00008000
         B     @PROLOG                                             0002 00009000
         DC    AL1(16)                                             0002 00010000
         DC    C'BLSRMSGB  78.058'                                 0002 00011000
         DROP  @15                                                      00012000
@PROLOG  STM   @14,@12,12(@13)                                     0002 00013000
         BALR  @12,0                                               0002 00014000
@PSTART  DS    0H                                                  0002 00015000
         USING @PSTART,@12                                         0002 00016000
         L     @00,@SIZDATD                                        0002 00017000
         BLSUALLS R,LV=(0)                                              00018000
         LR    @11,@01                                             0002 00019000
         USING @DATD,@11                                           0002 00020000
         ST    @13,@SA00001+4                                      0002 00021000
         LM    @00,@01,20(@13)                                     0002 00022000
         ST    @11,8(,@13)                                         0002 00023000
         LR    @13,@11                                             0002 00024000
         MVC   @PC00001(12),0(@01)                                 0002 00025000
*/********************************************************************/ 00026000
*/*                                                                  */ 00027000
*/* BLSRMSGB--IPCS STORAGE DESCRIPTION FORMATTER                     */ 00028000
*/*                                                                  */ 00029000
*/********************************************************************/ 00030000
*                                                                  0135 00031000
*   RETC=ZZZFLAGI;                  /* ANTICIPATE NORMAL COMPLETION  */ 00032000
         SLR   RETC,RETC                                           0135 00033000
*   MSB=MSS;                        /* MESSAGE LITERAL TEXT          */ 00034000
         MVC   MSB(23),MSS                                         0136 00035000
*   DO;                             /* BLRCNVUC(DPALE) FROM(UNSIGNED    00036000
*                                      BINARY)TO(CHARACTER)SET(MSBT2)   00037000
*                                      PATTERN('40202020202020202120'   00038000
*                                      X)OPTIONS(PATTERN IN        0137 00039000
*                                      PLACE)REMARK(STORAGE LENGTH)  */ 00040000
*                                                                  0137 00041000
*     /***************************************************************/ 00042000
*     /*                                                             */ 00043000
*     /* STORAGE LENGTH                                              */ 00044000
*     /*                                                             */ 00045000
*     /***************************************************************/ 00046000
*                                                                  0138 00047000
*     CVD(DPALE,PACKED);            /* UNSIGNED BINARY=>PACKED     0138 00048000
*                                      DECIMAL                       */ 00049000
         L     @10,@PC00001+8                                      0138 00050000
         L     @08,DPALE(,@10)                                     0138 00051000
         CVD   @08,PACKED                                          0138 00052000
*     ED(MSBT2,PACKED(25:64));      /* PACKED DECIMAL=>EBCDIC        */ 00053000
         ED    MSBT2(10),PACKED+3                                  0139 00054000
*   END;                            /* BLRCNVUC(DPALE) FROM(UNSIGNED    00055000
*                                      BINARY)TO(CHARACTER)SET(MSBT2)   00056000
*                                      PATTERN('40202020202020202120'   00057000
*                                      X)OPTIONS(PATTERN IN        0140 00058000
*                                      PLACE)REMARK(STORAGE LENGTH)  */ 00059000
*   IF DPAFA='1'B THEN                                             0141 00060000
*                                                                  0141 00061000
         TM    DPAFA(@10),B'10000000'                              0141 00062000
         BNO   @RF00141                                            0141 00063000
*     /***************************************************************/ 00064000
*     /*                                                             */ 00065000
*     /* ARRAY                                                       */ 00066000
*     /*                                                             */ 00067000
*     /***************************************************************/ 00068000
*                                                                  0142 00069000
*     DO;                           /* ARRAY                         */ 00070000
*       IF DPAIM=0 THEN                                            0143 00071000
*                                                                  0143 00072000
         L     @08,DPAIM(,@10)                                     0143 00073000
         LTR   @08,@08                                             0143 00074000
         BNZ   @RF00143                                            0143 00075000
*         /***********************************************************/ 00076000
*         /*                                                         */ 00077000
*         /* ZERO REPLICATION FACTOR                                 */ 00078000
*         /*                                                         */ 00079000
*         /***********************************************************/ 00080000
*                                                                  0144 00081000
*         DO;                       /* ZERO REPLICATION FACTOR       */ 00082000
*           MBL=LENGTH(MSB)+LENGTH(TZB);/* MESSAGE LENGTH            */ 00083000
         MVC   MBL(2),@CH01030                                     0145 00084000
*           TZB=TZS;                /* SUPPLEMENTARY LITERAL TEXT    */ 00085000
         MVC   TZB(32),TZS                                         0146 00086000
*           DO;                     /* BLRCNVUC(DPAIL) FROM(UNSIGNED    00087000
*                                      BINARY)TO(CHARACTER)SET(TZB2)P   00088000
*                                      ATTERN('4020202020202020202021   00089000
*                                      20'X)OPTIONS(PATTERN IN     0147 00090000
*                                      PLACE)REMARK(ENTRY NUMBER)    */ 00091000
*                                                                  0147 00092000
*             /*******************************************************/ 00093000
*             /*                                                     */ 00094000
*             /* ENTRY NUMBER                                        */ 00095000
*             /*                                                     */ 00096000
*             /*******************************************************/ 00097000
*                                                                  0148 00098000
*             CVD(DPAIL,PACKED);    /* UNSIGNED BINARY=>PACKED     0148 00099000
*                                      DECIMAL                       */ 00100000
         L     @10,DPAIL(,@10)                                     0148 00101000
         CVD   @10,PACKED                                          0148 00102000
*             ED(TZB2,PACKED(17:64));/* PACKED DECIMAL=>EBCDIC       */ 00103000
         ED    TZB2(12),PACKED+2                                   0149 00104000
*           END;                    /* BLRCNVUC(DPAIL) FROM(UNSIGNED    00105000
*                                      BINARY)TO(CHARACTER)SET(TZB2)P   00106000
*                                      ATTERN('4020202020202020202021   00107000
*                                      20'X)OPTIONS(PATTERN IN     0150 00108000
*                                      PLACE)REMARK(ENTRY NUMBER)    */ 00109000
*         END;                                                     0151 00110000
*       ELSE                                                       0152 00111000
*         IF DPAIM=1 THEN                                          0152 00112000
*                                                                  0152 00113000
         B     @RC00143                                            0152 00114000
@RF00143 L     @10,@PC00001+8                                      0152 00115000
         CLC   DPAIM(4,@10),@CF00050                               0152 00116000
         BNE   @RF00152                                            0152 00117000
*           /*********************************************************/ 00118000
*           /*                                                       */ 00119000
*           /* SINGLE ARRAY ENTRY                                    */ 00120000
*           /*                                                       */ 00121000
*           /*********************************************************/ 00122000
*                                                                  0153 00123000
*           DO;                     /* SINGLE ARRAY ENTRY            */ 00124000
*             MBL=LENGTH(MSB)+LENGTH(TSB);/* MESSAGE LENGTH          */ 00125000
         MVC   MBL(2),@CH01032                                     0154 00126000
*             TSB=TSS;              /* SUPPLEMENTARY LITERAL TEXT    */ 00127000
         MVC   TSB(20),TSS                                         0155 00128000
*             DO;                   /* BLRCNVUC(DPAIL) FROM(UNSIGNED    00129000
*                                      BINARY)TO(CHARACTER)SET(TSB2)P   00130000
*                                      ATTERN('4020202020202020202021   00131000
*                                      20'X)OPTIONS(PATTERN IN     0156 00132000
*                                      PLACE)REMARK(ENTRY NUMBER)    */ 00133000
*                                                                  0156 00134000
*               /*****************************************************/ 00135000
*               /*                                                   */ 00136000
*               /* ENTRY NUMBER                                      */ 00137000
*               /*                                                   */ 00138000
*               /*****************************************************/ 00139000
*                                                                  0157 00140000
*               CVD(DPAIL,PACKED);  /* UNSIGNED BINARY=>PACKED     0157 00141000
*                                      DECIMAL                       */ 00142000
         L     @10,DPAIL(,@10)                                     0157 00143000
         CVD   @10,PACKED                                          0157 00144000
*               ED(TSB2,PACKED(17:64));/* PACKED DECIMAL=>EBCDIC     */ 00145000
         ED    TSB2(12),PACKED+2                                   0158 00146000
*             END;                  /* BLRCNVUC(DPAIL) FROM(UNSIGNED    00147000
*                                      BINARY)TO(CHARACTER)SET(TSB2)P   00148000
*                                      ATTERN('4020202020202020202021   00149000
*                                      20'X)OPTIONS(PATTERN IN     0159 00150000
*                                      PLACE)REMARK(ENTRY NUMBER)    */ 00151000
*           END;                                                   0160 00152000
*         ELSE                                                     0161 00153000
*                                                                  0161 00154000
*           /*********************************************************/ 00155000
*           /*                                                       */ 00156000
*           /* MULTIPLE ARRAY ENTRIES                                */ 00157000
*           /*                                                       */ 00158000
*           /*********************************************************/ 00159000
*                                                                  0161 00160000
*           DO;                     /* MULTIPLE ARRAY ENTRIES        */ 00161000
         B     @RC00152                                            0161 00162000
@RF00152 DS    0H                                                  0162 00163000
*             MBL=LENGTH(MSB)+LENGTH(TMB);/* MESSAGE LENGTH          */ 00164000
         MVC   MBL(2),@CH01034                                     0162 00165000
*             TMB=TMS;              /* SUPPLEMENTARY LITERAL TEXT    */ 00166000
         MVC   TMB(35),TMS                                         0163 00167000
*             DO;                   /* BLRCNVSC(DPAIL) FROM(SIGNED BI   00168000
*                                      NARY)TO(CHARACTER)SET(TMB2)PAT   00169000
*                                      TERN('402020202020202020202120   00170000
*                                      'X)OPTIONS(PATTERN IN       0164 00171000
*                                      PLACE)REMARK(ENTRY NUMBER)    */ 00172000
*                                                                  0164 00173000
*               /*****************************************************/ 00174000
*               /*                                                   */ 00175000
*               /* ENTRY NUMBER                                      */ 00176000
*               /*                                                   */ 00177000
*               /*****************************************************/ 00178000
*                                                                  0165 00179000
*               CVD(DPAIL,PACKED);  /* SIGNED BINARY=>PACKED DECIMAL */ 00180000
         L     @10,@PC00001+8                                      0165 00181000
         L     @10,DPAIL(,@10)                                     0165 00182000
         CVD   @10,PACKED                                          0165 00183000
*               RESPECIFY                                          0166 00184000
*                (GPR01P) RESTRICTED;                              0166 00185000
*               GPR01P=ADDR(TMB2(12:12));/* ->DIGIT(S) FORCED      0167 00186000
*                                      SIGNIFICANT                   */ 00187000
         LA    GPR01P,TMB2+11                                      0167 00188000
*               GENERATE REFS(PACKED,TMB2) SETS(TMB2,GPR01P)/* PACKED   00189000
*                                      DECIMAL=>EBCDIC               */ 00190000
*                   CODE(EDMK  TMB2(12),PACKED+2);                 0168 00191000
         EDMK  TMB2(12),PACKED+2                                        00192000
*               BC(11,L0000001);    /* IF DPAIL<0 THEN DO            */ 00193000
         BC    11,L0000001                                         0169 00194000
*               GPR01P=GPR01P-1;    /* ->MINUS SIGN DIGIT            */ 00195000
         BCTR  GPR01P,0                                            0170 00196000
*               GPR01P->I001C='-';  /* INSERT MINUS SIGN             */ 00197000
         MVI   I001C(GPR01P),C'-'                                  0171 00198000
*               ;                   /* END                           */ 00199000
*L0000001:                          /* ELSE PLUS SIGN IS IMPLICIT    */ 00200000
*               ;                   /* SIGN INDICATED                */ 00201000
L0000001 DS    0H                                                  0174 00202000
*               RESPECIFY                                          0174 00203000
*                (GPR01P) UNRESTRICTED;                            0174 00204000
*             END;                  /* BLRCNVSC(DPAIL) FROM(SIGNED BI   00205000
*                                      NARY)TO(CHARACTER)SET(TMB2)PAT   00206000
*                                      TERN('402020202020202020202120   00207000
*                                      'X)OPTIONS(PATTERN IN       0175 00208000
*                                      PLACE)REMARK(ENTRY NUMBER)    */ 00209000
*             DO;                   /* BLRCNVSC(DPAIL+DPAIM-1)     0176 00210000
*                                      FROM(SIGNED BINARY)TO(CHARACTE   00211000
*                                      R)SET(TMB4)PATTERN('4020202020   00212000
*                                      20202020202120'X)OPTIONS(PATTE   00213000
*                                      RN IN PLACE)REMARK(FINAL ENTRY   00214000
*                                      NUMBER)                       */ 00215000
*                                                                  0176 00216000
*               /*****************************************************/ 00217000
*               /*                                                   */ 00218000
*               /* FINAL ENTRY NUMBER                                */ 00219000
*               /*                                                   */ 00220000
*               /*****************************************************/ 00221000
*                                                                  0177 00222000
*               S0000001=DPAIL+DPAIM-1;/* SOURCE EXPRESSION          */ 00223000
         L     @10,@PC00001+8                                      0177 00224000
         L     S0000001,DPAIL(,@10)                                0177 00225000
         AL    S0000001,DPAIM(,@10)                                0177 00226000
         BCTR  S0000001,0                                          0177 00227000
*               CVD(S0000001,PACKED);/* SIGNED BINARY=>PACKED DECIMAL*/ 00228000
         CVD   S0000001,PACKED                                     0178 00229000
*               RESPECIFY                                          0179 00230000
*                (GPR01P) RESTRICTED;                              0179 00231000
*               GPR01P=ADDR(TMB4(12:12));/* ->DIGIT(S) FORCED      0180 00232000
*                                      SIGNIFICANT                   */ 00233000
         LA    GPR01P,TMB4+11                                      0180 00234000
*               GENERATE REFS(PACKED,TMB4) SETS(TMB4,GPR01P)/* PACKED   00235000
*                                      DECIMAL=>EBCDIC               */ 00236000
*                   CODE(EDMK  TMB4(12),PACKED+2);                 0181 00237000
         EDMK  TMB4(12),PACKED+2                                        00238000
*               BC(11,L0000002);    /* IF S0000001<0 THEN DO         */ 00239000
         BC    11,L0000002                                         0182 00240000
*               GPR01P=GPR01P-1;    /* ->MINUS SIGN DIGIT            */ 00241000
         BCTR  GPR01P,0                                            0183 00242000
*               GPR01P->I001C='-';  /* INSERT MINUS SIGN             */ 00243000
         MVI   I001C(GPR01P),C'-'                                  0184 00244000
*               ;                   /* END                           */ 00245000
*L0000002:                          /* ELSE PLUS SIGN IS IMPLICIT    */ 00246000
*               ;                   /* SIGN INDICATED                */ 00247000
L0000002 DS    0H                                                  0187 00248000
*               RESPECIFY                                          0187 00249000
*                (GPR01P) UNRESTRICTED;                            0187 00250000
*             END;                  /* BLRCNVSC(DPAIL+DPAIM-1)     0188 00251000
*                                      FROM(SIGNED BINARY)TO(CHARACTE   00252000
*                                      R)SET(TMB4)PATTERN('4020202020   00253000
*                                      20202020202120'X)OPTIONS(PATTE   00254000
*                                      RN IN PLACE)REMARK(FINAL ENTRY   00255000
*                                      NUMBER)                       */ 00256000
*           END;                                                   0189 00257000
*     END;                                                         0190 00258000
@RC00152 DS    0H                                                  0190 00259000
@RC00143 DS    0H                                                  0191 00260000
*   CALL BLSUMPK1(ZZ2,MB);          /* REMOVE EXTRANEOUS BLANKS      */ 00261000
@RF00141 ST    R9,@AL00001                                         0191 00262000
         LA    @10,MB                                              0191 00263000
         ST    @10,@AL00001+4                                      0191 00264000
         L     @10,ZZ2BVTP(,R9)                                    0191 00265000
         L     @15,BVTMPK1P(,@10)                                  0191 00266000
         LA    @01,@AL00001                                        0191 00267000
         BALR  @14,@15                                             0191 00268000
*   MSG(1:MBL)=MB(1:MBL);           /* RETURN TEXT INSERTION BUFFER  */ 00269000
         L     @10,@PC00001+4                                      0192 00270000
         LH    @08,MBL                                             0192 00271000
         N     @08,@CF01035                                        0192 00272000
         BCTR  @08,0                                               0192 00273000
         EX    @08,@SM01036                                        0192 00274000
*   RETURN CODE(RETC);                                             0193 00275000
*                                                                  0193 00276000
         L     @13,4(,@13)                                         0193 00277000
         L     @00,@SIZDATD                                        0193 00278000
         LR    @01,@11                                             0193 00279000
         BLSUFRES R,LV=(0),A=(1)                                        00280000
         LR    @15,@03                                             0193 00281000
         L     @14,12(,@13)                                        0193 00282000
         LM    @00,@12,20(@13)                                     0193 00283000
         BR    @14                                                 0193 00284000
*/*BLSRPEND--DEBUGGING MODULE                                        */ 00285000
*/*BLSUPEND--MVS IPCS MODULE                                         */ 00286000
*                                                                  0194 00287000
*   DECLARE                         /* DATA FOR AHB MACROS           */ 00288000
*     PACKED BIT(64) BOUNDARY(DWORD),/* DATA CONVERSION WORK AREA    */ 00289000
*     S0000001 SIGNED BINARY(31);   /* DATA CONVERSION EXPRESSION  0194 00290000
*                                      HOLDER                        */ 00291000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 00292000
*     GPR01P PTR(31) REG(1);                                       0195 00293000
*   DECLARE                         /* COMMON VARIABLES              */ 00294000
*     I256C CHAR(256) BASED,                                       0196 00295000
*     I031F FIXED(31) BASED,                                       0196 00296000
*     I031P PTR(31) BASED,                                         0196 00297000
*     I015F FIXED(15) BASED,                                       0196 00298000
*     I015P PTR(15) BASED,                                         0196 00299000
*     I008P PTR(8) BASED,                                          0196 00300000
*     I001C CHAR(1) BASED;                                         0196 00301000
*   GENERATE NODEFS NOREFS DATA;                                   0197 00302000
*   END BLSRMSGB                    /* BLRPEND(BLSRMSGB)             */ 00303000
*                                                                  0198 00304000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00305000
*/*%INCLUDE SYSLIB  (BLSRZZZ )                                       */ 00306000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00307000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00308000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00309000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00310000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00311000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00312000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00313000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00314000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00315000
*/*%INCLUDE SYSLIB  (BLSRSERV)                                       */ 00316000
*                                                                  0198 00317000
*       ;                                                          0198 00318000
@EL00001 L     @13,4(,@13)                                         0198 00319000
@EF00001 L     @00,@SIZDATD                                        0198 00320000
         LR    @01,@11                                             0198 00321000
         BLSUFRES R,LV=(0),A=(1)                                        00322000
@ER00001 LM    @14,@12,12(@13)                                     0198 00323000
         BR    @14                                                 0198 00324000
@DATA    DS    0H                                                       00325000
@CH01032 DC    H'43'                                                    00326000
@CH01030 DC    H'55'                                                    00327000
@CH01034 DC    H'58'                                                    00328000
@SM01036 MVC   MSG(0,@10),MB                                            00329000
@DATD    DSECT                                                          00330000
         DS    0F                                                       00331000
@SA00001 DS    18F                                                      00332000
@PC00001 DS    3F                                                       00333000
@AL00001 DS    2A                                                       00334000
BLSRMSGB CSECT                                                          00335000
         DS    0F                                                       00336000
@CF00050 DC    F'1'                                                     00337000
@CF01035 DC    XL4'0000FFFF'                                            00338000
@DATD    DSECT                                                          00339000
         DS    0D                                                       00340000
MB       DS    CL125                                                    00341000
         ORG   MB                                                       00342000
MBL      DS    FL2                                                      00343000
@NM00081 DS    BL2                                                      00344000
MBT      DS    CL121                                                    00345000
         ORG   MBT                                                      00346000
MBT1     DS    CL1                                                      00347000
MBT2     DS    CL120                                                    00348000
         ORG   MB+125                                                   00349000
         DS    CL3                                                      00350000
PACKED   DS    BL8                                                      00351000
BLSRMSGB CSECT                                                          00352000
         DS    0F                                                       00353000
@SIZDATD DC    AL1(0)                                                   00354000
         DC    AL3(@ENDDATD-@DATD)                                      00355000
         DS    0D                                                       00356000
MSS      DS    CL23                                                     00357000
         ORG   MSS                                                      00358000
MSSL     DC    AL2(23)                                                  00359000
@NM00082 DC    X'0000'                                                  00360000
MSST     DS    CL19                                                     00361000
         ORG   MSST                                                     00362000
MSST1    DC    CL8' LENGTH('                                            00363000
MSST2    DC    X'40202020202020202120'                                  00364000
MSST3    DC    CL1')'                                                   00365000
MSST4    DS    0C                                                       00366000
         ORG   MSS+23                                                   00367000
TMS      DS    CL35                                                     00368000
         ORG   TMS                                                      00369000
TMS1     DC    CL9' ENTRIES('                                           00370000
TMS2     DC    X'402020202020202020202120'                              00371000
TMS3     DC    CL1':'                                                   00372000
TMS4     DC    X'402020202020202020202120'                              00373000
TMS5     DC    CL1')'                                                   00374000
         ORG   TMS+35                                                   00375000
TSS      DS    CL20                                                     00376000
         ORG   TSS                                                      00377000
TSS1     DC    CL7' ENTRY('                                             00378000
TSS2     DC    X'402020202020202020202120'                              00379000
TSS3     DC    CL1')'                                                   00380000
         ORG   TSS+20                                                   00381000
TZS      DS    CL32                                                     00382000
         ORG   TZS                                                      00383000
TZS1     DC    CL7' ENTRY('                                             00384000
TZS2     DC    X'402020202020202020202120'                              00385000
TZS3     DC    CL13') MULTIPLE(0)'                                      00386000
         ORG   TZS+32                                                   00387000
@DATD    DSECT                                                          00388000
         SPACE 2                                                        00389000
*********************************************************************** 00390000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00391000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 00392000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 00393000
*********************************************************************** 00394000
         SPACE                                                          00395000
BLSRMSGB CSECT                                                          00396000
         ORG                                                            00397000
         DS    0D                                                       00398000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSRMSGB+19)/20+7)/8)CL8'BLSRMSGB'     00399000
@DATD    DSECT                                                          00400000
         DS    0H                                                       00401000
@DATD    DSECT                                                          00402000
         SPACE 2                                                        00403000
*********************************************************************** 00404000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 00405000
*********************************************************************** 00406000
         SPACE                                                          00407000
         DS    0D                                                       00408000
@DATD    DSECT                                                          00409000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00410000
@ENDDATD EQU   *                                                        00411000
BLSRMSGB CSECT                                                          00412000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00413000
@01      EQU   01                                                       00414000
@02      EQU   02                                                       00415000
@03      EQU   03                                                       00416000
@04      EQU   04                                                       00417000
@05      EQU   05                                                       00418000
@06      EQU   06                                                       00419000
@07      EQU   07                                                       00420000
@08      EQU   08                                                       00421000
@09      EQU   09                                                       00422000
@10      EQU   10                                                       00423000
@11      EQU   11                                                       00424000
@12      EQU   12                                                       00425000
@13      EQU   13                                                       00426000
@14      EQU   14                                                       00427000
@15      EQU   15                                                       00428000
S0000001 EQU   @02                                                      00429000
RETC     EQU   @03                                                      00430000
R9       EQU   @09                                                      00431000
R0       EQU   @00                                                      00432000
R1       EQU   @01                                                      00433000
R2       EQU   @02                                                      00434000
R3       EQU   @03                                                      00435000
R4       EQU   @04                                                      00436000
R5       EQU   @05                                                      00437000
RB       EQU   @11                                                      00438000
RD       EQU   @13                                                      00439000
RE       EQU   @14                                                      00440000
RF       EQU   @15                                                      00441000
GPR01P   EQU   @01                                                      00442000
RA       EQU   @10                                                      00443000
RC       EQU   @12                                                      00444000
R6       EQU   @06                                                      00445000
R7       EQU   @07                                                      00446000
R8       EQU   @08                                                      00447000
ZZ1      EQU   0                                                        00448000
ZZ1ATTN  EQU   ZZ1+360                                                  00449000
ZZ1EVE   EQU   ZZ1ATTN+4                                                00450000
ZZ1F     EQU   ZZ1+368                                                  00451000
ZZ1N     EQU   ZZ1+1116                                                 00452000
ZZ2      EQU   0                                                        00453000
ZZ2AMD   EQU   ZZ2                                                      00454000
@NM00013 EQU   ZZ2AMD+7                                                 00455000
ZZ2PRT   EQU   ZZ2+138                                                  00456000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 00457000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                00458000
ZZ2A     EQU   ZZ2+272                                                  00459000
ZZ2AF    EQU   ZZ2A+16                                                  00460000
ZZ2APID  EQU   ZZ2A+64                                                  00461000
ZZ2AD    EQU   ZZ2A+74                                                  00462000
ZZ2ADD   EQU   ZZ2AD                                                    00463000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 00464000
ZZ2ADM   EQU   ZZ2AD+46                                                 00465000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 00466000
ZZ2ADP   EQU   ZZ2AD+56                                                 00467000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 00468000
ZZ2AZZ6P EQU   ZZ2A+140                                                 00469000
ZZ2AQAS  EQU   ZZ2A+144                                                 00470000
ZZ2AQD   EQU   ZZ2A+160                                                 00471000
ZZ2AQDT  EQU   ZZ2AQD+10                                                00472000
ZZ2AQDF  EQU   ZZ2AQD+52                                                00473000
ZZ2STG   EQU   ZZ2+960                                                  00474000
ZZ2ALLOP EQU   ZZ2+992                                                  00475000
ZZ2FREEP EQU   ZZ2+996                                                  00476000
ZZ2FF19P EQU   ZZ2+1000                                                 00477000
ZZ2FRE1P EQU   ZZ2+1004                                                 00478000
ZZ2FF18P EQU   ZZ2+1008                                                 00479000
ZZ2DYNAP EQU   ZZ2+1012                                                 00480000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 00481000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 00482000
ZZ2STAIP EQU   ZZ2+1024                                                 00483000
ZZ2FF02P EQU   ZZ2+1028                                                 00484000
ZZ2GETLP EQU   ZZ2+1032                                                 00485000
ZZ2PARSP EQU   ZZ2+1036                                                 00486000
ZZ2PTGTP EQU   ZZ2+1040                                                 00487000
ZZ2PUTLP EQU   ZZ2+1044                                                 00488000
ZZ2SCANP EQU   ZZ2+1048                                                 00489000
ZZ2STCKP EQU   ZZ2+1052                                                 00490000
ZZ2TRMOP EQU   ZZ2+1064                                                 00491000
ZZ2TRMVP EQU   ZZ2+1068                                                 00492000
ZZ2PUTNP EQU   ZZ2+1084                                                 00493000
ZZ2TRMNP EQU   ZZ2+1088                                                 00494000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 00495000
ZZ2BVTP  EQU   ZZ2+1280                                                 00496000
ZZ2RVTP  EQU   ZZ2+1284                                                 00497000
ZZ2CPPL  EQU   ZZ2+1292                                                 00498000
ZZ2CPPLC EQU   ZZ2CPPL                                                  00499000
ZZ2ITR   EQU   ZZ2+2840                                                 00500000
ZZ2ITRE  EQU   ZZ2ITR+16                                                00501000
ZZ2ITSE  EQU   ZZ2+2864                                                 00502000
ZZ2ES    EQU   ZZ2+2872                                                 00503000
ZZ2AMDX  EQU   ZZ2+7160                                                 00504000
ZZ2AXO   EQU   ZZ2+7934                                                 00505000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 00506000
CMD      EQU   0                                                        00507000
CMDT     EQU   CMD+4                                                    00508000
PSCB     EQU   0                                                        00509000
PSCBATR1 EQU   PSCB+16                                                  00510000
ECT      EQU   0                                                        00511000
ECTSWS   EQU   ECT+28                                                   00512000
ECTSWS2  EQU   ECT+40                                                   00513000
ECTSWS21 EQU   ECTSWS2                                                  00514000
UPT      EQU   0                                                        00515000
UPTSWS   EQU   UPT+12                                                   00516000
SA       EQU   0                                                        00517000
SA1      EQU   SA                                                       00518000
SAR      EQU   SA+12                                                    00519000
SAR1     EQU   SAR+12                                                   00520000
BLSUMPK1 EQU   0                                                        00521000
BVT      EQU   0                                                        00522000
BVTPUTLP EQU   BVT+4                                                    00523000
BVTPUTOP EQU   BVT+12                                                   00524000
BVTPUTTP EQU   BVT+16                                                   00525000
BVTPUTVP EQU   BVT+20                                                   00526000
BVTPUTAP EQU   BVT+24                                                   00527000
BVTPRTTP EQU   BVT+28                                                   00528000
BVTPRTAP EQU   BVT+32                                                   00529000
BVTPUTDP EQU   BVT+36                                                   00530000
BVTMONP  EQU   BVT+40                                                   00531000
BVTMON2P EQU   BVT+44                                                   00532000
BVTVSARP EQU   BVT+48                                                   00533000
BVTVSENP EQU   BVT+64                                                   00534000
BVTVSERP EQU   BVT+68                                                   00535000
BVTVSGEP EQU   BVT+72                                                   00536000
BVTVSGUP EQU   BVT+76                                                   00537000
BVTVSPOP EQU   BVT+80                                                   00538000
BVTVSPUP EQU   BVT+84                                                   00539000
BVTMPKNP EQU   BVT+104                                                  00540000
BVTMONLP EQU   BVT+108                                                  00541000
BVTPUTCP EQU   BVT+132                                                  00542000
BVTMPK1P EQU   BVT+136                                                  00543000
BVTZZ2RP EQU   BVT+140                                                  00544000
BVTPGMRP EQU   BVT+144                                                  00545000
BVTMONAP EQU   BVT+148                                                  00546000
BVTBLDDP EQU   BVT+152                                                  00547000
BVTBLDLP EQU   BVT+156                                                  00548000
BVTPGMCP EQU   BVT+160                                                  00549000
BVTPGMDP EQU   BVT+164                                                  00550000
BVTPGMLP EQU   BVT+168                                                  00551000
BVTMONCP EQU   BVT+180                                                  00552000
BVTMONDP EQU   BVT+184                                                  00553000
BVTMONTP EQU   BVT+188                                                  00554000
BVTPARIP EQU   BVT+192                                                  00555000
BVTPARUP EQU   BVT+196                                                  00556000
BVTPRTNP EQU   BVT+204                                                  00557000
BVTVSCRP EQU   BVT+208                                                  00558000
BVTVSMRP EQU   BVT+212                                                  00559000
BVTMONXP EQU   BVT+216                                                  00560000
BVTTRMAP EQU   BVT+228                                                  00561000
ZZ6      EQU   0                                                        00562000
ZZ6D     EQU   ZZ6+128                                                  00563000
ZZ6DD    EQU   ZZ6D+8                                                   00564000
ZZ6DDT   EQU   ZZ6DD+4                                                  00565000
ZZ6DQA   EQU   ZZ6D+68                                                  00566000
ZZ6DF    EQU   ZZ6D+92                                                  00567000
ZZ6B     EQU   ZZ6+768                                                  00568000
RVT      EQU   0                                                        00569000
RVTADDRP EQU   RVT                                                      00570000
RVTT01P  EQU   RVT+4                                                    00571000
RVTTAP   EQU   RVT+8                                                    00572000
RVTTBP   EQU   RVT+12                                                   00573000
RVTTCP   EQU   RVT+16                                                   00574000
RVTTFP   EQU   RVT+24                                                   00575000
RVTTYP   EQU   RVT+40                                                   00576000
RVTT02P  EQU   RVT+48                                                   00577000
RVTT03P  EQU   RVT+52                                                   00578000
RVTT04P  EQU   RVT+56                                                   00579000
RVTACCLP EQU   RVT+60                                                   00580000
RVTRACCP EQU   RVT+64                                                   00581000
RVTTLP   EQU   RVT+68                                                   00582000
RVTTMP   EQU   RVT+72                                                   00583000
RVTTUP   EQU   RVT+80                                                   00584000
RVTESGEP EQU   RVT+84                                                   00585000
RVTESGUP EQU   RVT+88                                                   00586000
RVTESARP EQU   RVT+92                                                   00587000
RVTRAARP EQU   RVT+96                                                   00588000
RVTRAGEP EQU   RVT+100                                                  00589000
RVTADDPP EQU   RVT+104                                                  00590000
RVTACCQP EQU   RVT+108                                                  00591000
RVTSAGUP EQU   RVT+124                                                  00592000
RVTSAGEP EQU   RVT+128                                                  00593000
RVTESCKP EQU   RVT+132                                                  00594000
RVTMSGAP EQU   RVT+136                                                  00595000
RVTMSGDP EQU   RVT+140                                                  00596000
RVTADDTP EQU   RVT+160                                                  00597000
RVTADDUP EQU   RVT+164                                                  00598000
RVTADD1P EQU   RVT+176                                                  00599000
RVTADD2P EQU   RVT+180                                                  00600000
RVTRSAGP EQU   RVT+184                                                  00601000
RVTADDSP EQU   RVT+192                                                  00602000
RVTADD3P EQU   RVT+196                                                  00603000
RVTT05P  EQU   RVT+200                                                  00604000
RVTPADSP EQU   RVT+204                                                  00605000
RVTTRP   EQU   RVT+228                                                  00606000
RVTADD4P EQU   RVT+232                                                  00607000
RVTSAPCP EQU   RVT+236                                                  00608000
RVTSAARP EQU   RVT+240                                                  00609000
RVTSAGNP EQU   RVT+244                                                  00610000
RVTT06P  EQU   RVT+248                                                  00611000
RVTSAGCP EQU   RVT+252                                                  00612000
RVTSAGQP EQU   RVT+256                                                  00613000
RVTESGCP EQU   RVT+260                                                  00614000
RVTESGQP EQU   RVT+264                                                  00615000
RVTDUCKP EQU   RVT+276                                                  00616000
RVTDUCCP EQU   RVT+280                                                  00617000
I001C    EQU   0                                                        00618000
BLSRACC  EQU   0                                                        00619000
BLSRACCL EQU   0                                                        00620000
BLSRACCQ EQU   0                                                        00621000
BLSRADDP EQU   0                                                        00622000
BLSRADDR EQU   0                                                        00623000
BLSRADDS EQU   0                                                        00624000
BLSRADDT EQU   0                                                        00625000
BLSRADDU EQU   0                                                        00626000
BLSRADD1 EQU   0                                                        00627000
BLSRADD2 EQU   0                                                        00628000
BLSRADD3 EQU   0                                                        00629000
BLSRADD4 EQU   0                                                        00630000
BLSRDUCC EQU   0                                                        00631000
BLSRDUCK EQU   0                                                        00632000
BLSRESAR EQU   0                                                        00633000
BLSRESCK EQU   0                                                        00634000
BLSRESGC EQU   0                                                        00635000
BLSRESGE EQU   0                                                        00636000
BLSRESGQ EQU   0                                                        00637000
BLSRESGU EQU   0                                                        00638000
BLSRMSGA EQU   0                                                        00639000
BLSRMSGD EQU   0                                                        00640000
BLSRPADS EQU   0                                                        00641000
BLSRRAAR EQU   0                                                        00642000
BLSRRAGE EQU   0                                                        00643000
BLSRSAAR EQU   0                                                        00644000
BLSRSAG  EQU   0                                                        00645000
BLSRSAGC EQU   0                                                        00646000
BLSRSAGE EQU   0                                                        00647000
BLSRSAGN EQU   0                                                        00648000
BLSRSAGQ EQU   0                                                        00649000
BLSRSAGU EQU   0                                                        00650000
BLSRSAPC EQU   0                                                        00651000
BLSTA    EQU   0                                                        00652000
BLSTB    EQU   0                                                        00653000
BLSTC    EQU   0                                                        00654000
BLSTF    EQU   0                                                        00655000
BLSTL    EQU   0                                                        00656000
BLSTM    EQU   0                                                        00657000
BLSTR    EQU   0                                                        00658000
BLSTU    EQU   0                                                        00659000
BLSTY    EQU   0                                                        00660000
BLST01   EQU   0                                                        00661000
BLST02   EQU   0                                                        00662000
BLST03   EQU   0                                                        00663000
BLST04   EQU   0                                                        00664000
BLST05   EQU   0                                                        00665000
BLST06   EQU   0                                                        00666000
BLSUALLO EQU   0                                                        00667000
BLSUBLDD EQU   0                                                        00668000
BLSUBLDL EQU   0                                                        00669000
BLSUDYNA EQU   0                                                        00670000
BLSUFREE EQU   0                                                        00671000
BLSUFRE1 EQU   0                                                        00672000
BLSUMON  EQU   0                                                        00673000
BLSUMONA EQU   0                                                        00674000
BLSUMONC EQU   0                                                        00675000
BLSUMOND EQU   0                                                        00676000
BLSUMONL EQU   0                                                        00677000
BLSUMONT EQU   0                                                        00678000
BLSUMONX EQU   0                                                        00679000
BLSUMON2 EQU   0                                                        00680000
BLSUMPKN EQU   0                                                        00681000
BLSUPARI EQU   0                                                        00682000
BLSUPARU EQU   0                                                        00683000
BLSUPGMC EQU   0                                                        00684000
BLSUPGMD EQU   0                                                        00685000
BLSUPGML EQU   0                                                        00686000
BLSUPGMR EQU   0                                                        00687000
BLSUPRTA EQU   0                                                        00688000
BLSUPRTN EQU   0                                                        00689000
BLSUPRTT EQU   0                                                        00690000
BLSUPUTA EQU   0                                                        00691000
BLSUPUTC EQU   0                                                        00692000
BLSUPUTD EQU   0                                                        00693000
BLSUPUTL EQU   0                                                        00694000
BLSUPUTN EQU   0                                                        00695000
BLSUPUTO EQU   0                                                        00696000
BLSUPUTT EQU   0                                                        00697000
BLSUPUTV EQU   0                                                        00698000
BLSUSTAI EQU   0                                                        00699000
BLSUTRMA EQU   0                                                        00700000
BLSUTRMN EQU   0                                                        00701000
BLSUTRMO EQU   0                                                        00702000
BLSUTRMV EQU   0                                                        00703000
BLSUVSAR EQU   0                                                        00704000
BLSUVSCR EQU   0                                                        00705000
BLSUVSEN EQU   0                                                        00706000
BLSUVSER EQU   0                                                        00707000
BLSUVSGE EQU   0                                                        00708000
BLSUVSGU EQU   0                                                        00709000
BLSUVSMR EQU   0                                                        00710000
BLSUVSPO EQU   0                                                        00711000
BLSUVSPU EQU   0                                                        00712000
BLSUZZ2C EQU   0                                                        00713000
BLSUZZ2D EQU   0                                                        00714000
BLSUZZ2R EQU   0                                                        00715000
IKJEFF02 EQU   0                                                        00716000
IKJEFF18 EQU   0                                                        00717000
IKJEFF19 EQU   0                                                        00718000
IKJGETL  EQU   0                                                        00719000
IKJPARS  EQU   0                                                        00720000
IKJPTGT  EQU   0                                                        00721000
IKJPUTL  EQU   0                                                        00722000
IKJSCAN  EQU   0                                                        00723000
IKJSTCK  EQU   0                                                        00724000
I008P    EQU   0                                                        00725000
I015F    EQU   0                                                        00726000
I015P    EQU   0                                                        00727000
I031F    EQU   0                                                        00728000
I031P    EQU   0                                                        00729000
I256C    EQU   0                                                        00730000
PZ2      EQU   0                                                        00731000
MSG      EQU   0                                                        00732000
MSGT     EQU   MSG+4                                                    00733000
DPA      EQU   0                                                        00734000
DPALE    EQU   DPA+4                                                    00735000
DPAT     EQU   DPA+10                                                   00736000
DPAIM    EQU   DPA+44                                                   00737000
DPAIL    EQU   DPA+48                                                   00738000
DPAF     EQU   DPA+52                                                   00739000
DPAFA    EQU   DPAF                                                     00740000
CPPL     EQU   ZZ2CPPL                                                  00741000
CPPLUPT  EQU   CPPL+4                                                   00742000
CPPLPSCB EQU   CPPL+8                                                   00743000
CPPLECT  EQU   CPPL+12                                                  00744000
MSB      EQU   MB                                                       00745000
MSBT     EQU   MSB+4                                                    00746000
MSBT2    EQU   MSBT+8                                                   00747000
MSBT4    EQU   MSBT+19                                                  00748000
TMB      EQU   MSBT4                                                    00749000
TMB2     EQU   TMB+9                                                    00750000
TMB4     EQU   TMB+22                                                   00751000
TSB      EQU   MSBT4                                                    00752000
TSB2     EQU   TSB+7                                                    00753000
TZB      EQU   MSBT4                                                    00754000
TZB2     EQU   TZB+7                                                    00755000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00756000
TZB3     EQU   TZB+19                                                   00757000
TZB1     EQU   TZB                                                      00758000
TSB3     EQU   TSB+19                                                   00759000
TSB1     EQU   TSB                                                      00760000
TMB5     EQU   TMB+34                                                   00761000
TMB3     EQU   TMB+21                                                   00762000
TMB1     EQU   TMB                                                      00763000
MSBT3    EQU   MSBT+18                                                  00764000
MSBT1    EQU   MSBT                                                     00765000
@NM00083 EQU   MSB+2                                                    00766000
MSBL     EQU   MSB                                                      00767000
CPPLCBUF EQU   CPPL                                                     00768000
DPA99    EQU   DPA+60                                                   00769000
@NM00079 EQU   DPA+56                                                   00770000
@NM00078 EQU   DPAF                                                     00771000
DPAT9    EQU   DPAT+34                                                  00772000
DPATE    EQU   DPAT+33                                                  00773000
DPATD    EQU   DPAT+2                                                   00774000
@NM00077 EQU   DPAT+1                                                   00775000
DPATY    EQU   DPAT                                                     00776000
DPAT0    EQU   DPAT                                                     00777000
DPALB    EQU   DPA+9                                                    00778000
DPAOB    EQU   DPA+8                                                    00779000
DPAOF    EQU   DPA                                                      00780000
DPA00    EQU   DPA                                                      00781000
MSGT2    EQU   MSGT+1                                                   00782000
MSGT1    EQU   MSGT                                                     00783000
@NM00080 EQU   MSG+2                                                    00784000
MSGL     EQU   MSG                                                      00785000
RVT99999 EQU   RVT+384                                                  00786000
RVT0096P EQU   RVT+380                                                  00787000
RVT0095P EQU   RVT+376                                                  00788000
RVT0094P EQU   RVT+372                                                  00789000
RVT0093P EQU   RVT+368                                                  00790000
RVT0092P EQU   RVT+364                                                  00791000
RVT0091P EQU   RVT+360                                                  00792000
RVT0090P EQU   RVT+356                                                  00793000
RVT0089P EQU   RVT+352                                                  00794000
RVT0088P EQU   RVT+348                                                  00795000
RVT0087P EQU   RVT+344                                                  00796000
RVT0086P EQU   RVT+340                                                  00797000
RVT0085P EQU   RVT+336                                                  00798000
RVT0084P EQU   RVT+332                                                  00799000
RVT0083P EQU   RVT+328                                                  00800000
RVT0082P EQU   RVT+324                                                  00801000
RVT0081P EQU   RVT+320                                                  00802000
RVT0080P EQU   RVT+316                                                  00803000
RVT0079P EQU   RVT+312                                                  00804000
RVT0078P EQU   RVT+308                                                  00805000
RVT0077P EQU   RVT+304                                                  00806000
RVT0076P EQU   RVT+300                                                  00807000
RVT0075P EQU   RVT+296                                                  00808000
RVT0074P EQU   RVT+292                                                  00809000
RVT0073P EQU   RVT+288                                                  00810000
RVT0072P EQU   RVT+284                                                  00811000
RVTDTUTP EQU   RVT+272                                                  00812000
RVTDTMTP EQU   RVT+268                                                  00813000
RVT0057P EQU   RVT+224                                                  00814000
RVT0056P EQU   RVT+220                                                  00815000
RVT0055P EQU   RVT+216                                                  00816000
RVT0054P EQU   RVT+212                                                  00817000
RVT0053P EQU   RVT+208                                                  00818000
RVTMSGBP EQU   RVT+188                                                  00819000
RVT0044P EQU   RVT+172                                                  00820000
RVT0043P EQU   RVT+168                                                  00821000
RVT0040P EQU   RVT+156                                                  00822000
RVT0039P EQU   RVT+152                                                  00823000
RVT0038P EQU   RVT+148                                                  00824000
RVT0037P EQU   RVT+144                                                  00825000
RVT0031P EQU   RVT+120                                                  00826000
RVT0030P EQU   RVT+116                                                  00827000
RVT0029P EQU   RVT+112                                                  00828000
RVT0020P EQU   RVT+76                                                   00829000
RVT0012P EQU   RVT+44                                                   00830000
RVT0010P EQU   RVT+36                                                   00831000
RVT0009P EQU   RVT+32                                                   00832000
RVT0008P EQU   RVT+28                                                   00833000
RVT0006P EQU   RVT+20                                                   00834000
ZZ69999  EQU   ZZ6+1792                                                 00835000
ZZ6BRB   EQU   ZZ6B+12                                                  00836000
ZZ6BRC   EQU   ZZ6B+8                                                   00837000
@NM00076 EQU   ZZ6B+6                                                   00838000
ZZ6BFL   EQU   ZZ6B+4                                                   00839000
ZZ6BDA   EQU   ZZ6B                                                     00840000
@NM00075 EQU   ZZ6+540                                                  00841000
ZZ6BUFI  EQU   ZZ6+536                                                  00842000
ZZ6BUFP  EQU   ZZ6+532                                                  00843000
ZZ6FILE  EQU   ZZ6+524                                                  00844000
ZZ6BUFB  EQU   ZZ6+520                                                  00845000
ZZ6BUFL  EQU   ZZ6+518                                                  00846000
ZZ6BUFN  EQU   ZZ6+516                                                  00847000
ZZ6ZZ6P  EQU   ZZ6+512                                                  00848000
@NM00074 EQU   ZZ6+256                                                  00849000
ZZ6D999  EQU   ZZ6D+128                                                 00850000
@NM00073 EQU   ZZ6D+116                                                 00851000
ZZ6DCAP  EQU   ZZ6D+112                                                 00852000
ZZ6DPRP  EQU   ZZ6D+108                                                 00853000
ZZ6DDA2  EQU   ZZ6D+104                                                 00854000
ZZ6DDA1  EQU   ZZ6D+100                                                 00855000
@NM00072 EQU   ZZ6DF                                                    00856000
ZZ6DFSU  EQU   ZZ6DF                                                    00857000
ZZ6DFST  EQU   ZZ6DF                                                    00858000
ZZ6DFAB  EQU   ZZ6DF                                                    00859000
ZZ6DFMP  EQU   ZZ6DF                                                    00860000
ZZ6DFDU  EQU   ZZ6DF                                                    00861000
ZZ6DFBS  EQU   ZZ6DF                                                    00862000
ZZ6DQ2   EQU   ZZ6D+88                                                  00863000
ZZ6DQ1   EQU   ZZ6D+84                                                  00864000
ZZ6DQA9  EQU   ZZ6DQA+16                                                00865000
@NM00071 EQU   ZZ6DQA+12                                                00866000
ZZ6DQA2  EQU   ZZ6DQA+8                                                 00867000
ZZ6DQA1  EQU   ZZ6DQA+4                                                 00868000
@NM00070 EQU   ZZ6DQA+2                                                 00869000
ZZ6DQAT  EQU   ZZ6DQA                                                   00870000
ZZ6DQA0  EQU   ZZ6DQA                                                   00871000
ZZ6DRDX  EQU   ZZ6D+64                                                  00872000
ZZ6DELK  EQU   ZZ6D+64                                                  00873000
ZZ6DMEM  EQU   ZZ6D+56                                                  00874000
ZZ6DDT1  EQU   ZZ6DDT                                                   00875000
ZZ6DDO   EQU   ZZ6DD+2                                                  00876000
ZZ6DDL   EQU   ZZ6DD                                                    00877000
@NM00069 EQU   ZZ6D+2                                                   00878000
ZZ6DRID  EQU   ZZ6D                                                     00879000
ZZ6RDCB  EQU   ZZ6                                                      00880000
ZZ60000  EQU   ZZ6                                                      00881000
BVT99999 EQU   BVT+256                                                  00882000
BVT0064P EQU   BVT+252                                                  00883000
BVT0063P EQU   BVT+248                                                  00884000
BVT0062P EQU   BVT+244                                                  00885000
BVT0061P EQU   BVT+240                                                  00886000
BVT0060P EQU   BVT+236                                                  00887000
BVT0059P EQU   BVT+232                                                  00888000
BVT0057P EQU   BVT+224                                                  00889000
BVT0056P EQU   BVT+220                                                  00890000
BVTSTBLP EQU   BVT+200                                                  00891000
BVT0045P EQU   BVT+176                                                  00892000
BVT0044P EQU   BVT+172                                                  00893000
BVT0033P EQU   BVT+128                                                  00894000
BVT0032P EQU   BVT+124                                                  00895000
BVT0031P EQU   BVT+120                                                  00896000
BVT0030P EQU   BVT+116                                                  00897000
BVT0029P EQU   BVT+112                                                  00898000
BVT0026P EQU   BVT+100                                                  00899000
BVT0025P EQU   BVT+96                                                   00900000
BVT0024P EQU   BVT+92                                                   00901000
BVT0023P EQU   BVT+88                                                   00902000
BVT0016P EQU   BVT+60                                                   00903000
BVT0015P EQU   BVT+56                                                   00904000
BVT0014P EQU   BVT+52                                                   00905000
BVT0003P EQU   BVT+8                                                    00906000
BVT0001P EQU   BVT                                                      00907000
SA99     EQU   SA+72                                                    00908000
SARC     EQU   SAR+56                                                   00909000
SARB     EQU   SAR+52                                                   00910000
SARA     EQU   SAR+48                                                   00911000
SAR9     EQU   SAR+44                                                   00912000
SAR8     EQU   SAR+40                                                   00913000
SAR7     EQU   SAR+36                                                   00914000
SAR6     EQU   SAR+32                                                   00915000
SAR5     EQU   SAR+28                                                   00916000
SAR4     EQU   SAR+24                                                   00917000
SAR3     EQU   SAR+20                                                   00918000
SAR2     EQU   SAR+16                                                   00919000
SAR0     EQU   SAR+8                                                    00920000
SARF     EQU   SAR+4                                                    00921000
SARE     EQU   SAR                                                      00922000
SAFWD    EQU   SA+8                                                     00923000
SABAK    EQU   SA+4                                                     00924000
SA1L     EQU   SA1+1                                                    00925000
SA1P     EQU   SA1                                                      00926000
UPTPREFL EQU   UPT+23                                                   00927000
UPTPREFX EQU   UPT+16                                                   00928000
@NM00068 EQU   UPT+15                                                   00929000
UPTLDEL  EQU   UPT+14                                                   00930000
UPTCDEL  EQU   UPT+13                                                   00931000
UPTWTP   EQU   UPTSWS                                                   00932000
UPTMODE  EQU   UPTSWS                                                   00933000
UPTALD   EQU   UPTSWS                                                   00934000
UPTPAUS  EQU   UPTSWS                                                   00935000
UPTNCOM  EQU   UPTSWS                                                   00936000
UPTMID   EQU   UPTSWS                                                   00937000
UPTNPRM  EQU   UPTSWS                                                   00938000
UPTRCVR  EQU   UPTSWS                                                   00939000
UPTUSER  EQU   UPT+2                                                    00940000
@NM00067 EQU   UPT                                                      00941000
@NM00066 EQU   ECT+52                                                   00942000
@NM00065 EQU   ECT+48                                                   00943000
@NM00064 EQU   ECT+44                                                   00944000
@NM00063 EQU   ECTSWS2+1                                                00945000
@NM00062 EQU   ECTSWS21                                                 00946000
ECTTABND EQU   ECTSWS21                                                 00947000
ECTDEFCS EQU   ECTSWS21                                                 00948000
ECTBKPB  EQU   ECT+36                                                   00949000
ECTUSER  EQU   ECT+32                                                   00950000
ECTDDNUM EQU   ECT+29                                                   00951000
ECTATTN  EQU   ECTSWS                                                   00952000
ECTBKGRD EQU   ECTSWS                                                   00953000
ECTNNOT  EQU   ECTSWS                                                   00954000
ECTNMAL  EQU   ECTSWS                                                   00955000
ECTLOGF  EQU   ECTSWS                                                   00956000
ECTATRM  EQU   ECTSWS                                                   00957000
@NM00061 EQU   ECTSWS                                                   00958000
ECTNOPD  EQU   ECTSWS                                                   00959000
ECTSCMD  EQU   ECT+20                                                   00960000
ECTPCMD  EQU   ECT+12                                                   00961000
ECTSMSG  EQU   ECT+9                                                    00962000
ECTMSGF  EQU   ECT+8                                                    00963000
ECTIOWA  EQU   ECT+4                                                    00964000
ECTRTCD  EQU   ECT+1                                                    00965000
ECTRCDF  EQU   ECT                                                      00966000
PSCBU    EQU   PSCB+64                                                  00967000
PSCBRSZ  EQU   PSCB+60                                                  00968000
PSCBLINE EQU   PSCB+59                                                  00969000
PSCBCHAR EQU   PSCB+58                                                  00970000
PSCBUPTL EQU   PSCB+56                                                  00971000
PSCBUPT  EQU   PSCB+52                                                  00972000
PSCBRLGB EQU   PSCB+48                                                  00973000
PSCBDEST EQU   PSCB+40                                                  00974000
@NM00060 EQU   PSCB+36                                                  00975000
@NM00059 EQU   PSCB+32                                                  00976000
@NM00058 EQU   PSCB+28                                                  00977000
PSCBLTI2 EQU   PSCB+24                                                  00978000
PSCBLTIM EQU   PSCB+20                                                  00979000
PSCBATR2 EQU   PSCB+18                                                  00980000
@NM00057 EQU   PSCBATR1                                                 00981000
@NM00056 EQU   PSCBATR1                                                 00982000
@NM00055 EQU   PSCBATR1                                                 00983000
PSCBATTN EQU   PSCBATR1                                                 00984000
PSCBVMNT EQU   PSCBATR1                                                 00985000
PSCBJCL  EQU   PSCBATR1                                                 00986000
PSCBACCT EQU   PSCBATR1                                                 00987000
PSCBCTRL EQU   PSCBATR1                                                 00988000
PSCBGPNM EQU   PSCB+8                                                   00989000
PSCBUSRL EQU   PSCB+7                                                   00990000
PSCBUSER EQU   PSCB                                                     00991000
CMDT1    EQU   CMDT                                                     00992000
CMDO     EQU   CMD+2                                                    00993000
CMDL     EQU   CMD                                                      00994000
ZZ299999 EQU   ZZ2+8192                                                 00995000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  00996000
ZZ2AXOL  EQU   ZZ2AXO                                                   00997000
@NM00054 EQU   ZZ2+7288                                                 00998000
@NM00053 EQU   ZZ2AMDX+4                                                00999000
ZZ2AMDXC EQU   ZZ2AMDX                                                  01000000
ZZ2HSD   EQU   ZZ2+3056                                                 01001000
@NM00052 EQU   ZZ2ES                                                    01002000
@NM00051 EQU   ZZ2+2868                                                 01003000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                01004000
@NM00050 EQU   ZZ2ITSE                                                  01005000
ZZ2ITSEP EQU   ZZ2ITSE                                                  01006000
ZZ2ITSEW EQU   ZZ2ITSE                                                  01007000
@NM00049 EQU   ZZ2ITR+20                                                01008000
ZZ2ITREC EQU   ZZ2ITRE+1                                                01009000
@NM00048 EQU   ZZ2ITRE                                                  01010000
ZZ2ITREP EQU   ZZ2ITRE                                                  01011000
ZZ2ITREW EQU   ZZ2ITRE                                                  01012000
@NM00047 EQU   ZZ2ITR+9                                                 01013000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 01014000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 01015000
ZZ2ITRPP EQU   ZZ2ITR                                                   01016000
@NM00046 EQU   ZZ2+1544                                                 01017000
ZZ2PGM   EQU   ZZ2+1536                                                 01018000
@NM00045 EQU   ZZ2+1526                                                 01019000
ZZ2CW    EQU   ZZ2+1524                                                 01020000
@NM00044 EQU   ZZ2+1504                                                 01021000
@NM00043 EQU   ZZ2+1352                                                 01022000
ZZ2FFSYP EQU   ZZ2+1348                                                 01023000
ZZ2SASYP EQU   ZZ2+1344                                                 01024000
ZZ2RDSYP EQU   ZZ2+1340                                                 01025000
ZZ2RASYP EQU   ZZ2+1336                                                 01026000
ZZ2PHSYP EQU   ZZ2+1332                                                 01027000
ZZ2ESSYP EQU   ZZ2+1328                                                 01028000
ZZ200SYP EQU   ZZ2+1324                                                 01029000
ZZ2SCWP  EQU   ZZ2+1320                                                 01030000
ZZ2TTLP  EQU   ZZ2+1316                                                 01031000
ZZ2LOADP EQU   ZZ2+1312                                                 01032000
ZZ2VRESP EQU   ZZ2+1308                                                 01033000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               01034000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                01035000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                01036000
ZZ2VRSAP EQU   ZZ2+1288                                                 01037000
ZZ2DVTP  EQU   ZZ2+1276                                                 01038000
@NM00042 EQU   ZZ2+1272                                                 01039000
@NM00041 EQU   ZZ2+1268                                                 01040000
ZZ2RPLP  EQU   ZZ2+1260                                                 01041000
ZZ2TCBP  EQU   ZZ2+1256                                                 01042000
@NM00040 EQU   ZZ2+1252                                                 01043000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 01044000
@NM00039 EQU   ZZ2+1112                                                 01045000
ZZ2FPDRP EQU   ZZ2+1108                                                 01046000
ZZ2FDSDP EQU   ZZ2+1104                                                 01047000
ZZ2APDRP EQU   ZZ2+1100                                                 01048000
ZZ2ADSDP EQU   ZZ2+1096                                                 01049000
ZZ2ENQ0P EQU   ZZ2+1092                                                 01050000
@NM00038 EQU   ZZ2+1080                                                 01051000
ZZ2MSG0P EQU   ZZ2+1076                                                 01052000
ZZ2FT25P EQU   ZZ2+1072                                                 01053000
ZZ2MSGSP EQU   ZZ2+1060                                                 01054000
ZZ2ALOCP EQU   ZZ2+1056                                                 01055000
@NM00037 EQU   ZZ2+976                                                  01056000
ZZ2TOD   EQU   ZZ2+968                                                  01057000
ZZ2STGN  EQU   ZZ2STG+4                                                 01058000
ZZ2STGP  EQU   ZZ2STG                                                   01059000
@NM00036 EQU   ZZ2+952                                                  01060000
ZZ2SCMDE EQU   ZZ2+944                                                  01061000
ZZ2SCMDN EQU   ZZ2+936                                                  01062000
ZZ2IDENT EQU   ZZ2+928                                                  01063000
ZZ2A9999 EQU   ZZ2A+656                                                 01064000
@NM00035 EQU   ZZ2A+224                                                 01065000
@NM00034 EQU   ZZ2A+220                                                 01066000
ZZ2AQD99 EQU   ZZ2AQD+60                                                01067000
@NM00033 EQU   ZZ2AQD+56                                                01068000
@NM00032 EQU   ZZ2AQDF                                                  01069000
ZZ2AQDFA EQU   ZZ2AQDF                                                  01070000
ZZ2AQDIL EQU   ZZ2AQD+48                                                01071000
ZZ2AQDIM EQU   ZZ2AQD+44                                                01072000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               01073000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               01074000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                01075000
@NM00031 EQU   ZZ2AQDT+1                                                01076000
ZZ2AQDTY EQU   ZZ2AQDT                                                  01077000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  01078000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 01079000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 01080000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 01081000
ZZ2AQDOF EQU   ZZ2AQD                                                   01082000
ZZ2AQD00 EQU   ZZ2AQD                                                   01083000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               01084000
@NM00030 EQU   ZZ2AQAS+12                                               01085000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                01086000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                01087000
@NM00029 EQU   ZZ2AQAS+2                                                01088000
ZZ2AQAST EQU   ZZ2AQAS                                                  01089000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  01090000
ZZ2ADPTA EQU   ZZ2ADPT                                                  01091000
ZZ2ADPL  EQU   ZZ2ADP                                                   01092000
ZZ2ADMTA EQU   ZZ2ADMT                                                  01093000
ZZ2ADML  EQU   ZZ2ADM                                                   01094000
ZZ2ADDTA EQU   ZZ2ADDT                                                  01095000
ZZ2ADDL  EQU   ZZ2ADD                                                   01096000
@NM00028 EQU   ZZ2A+72                                                  01097000
ZZ2APIDB EQU   ZZ2APID+3                                                01098000
ZZ2APIDA EQU   ZZ2APID                                                  01099000
@NM00027 EQU   ZZ2A+24                                                  01100000
@NM00026 EQU   ZZ2AF+5                                                  01101000
ZZ2AFX   EQU   ZZ2AF+5                                                  01102000
@NM00025 EQU   ZZ2AF+3                                                  01103000
ZZ2AFS   EQU   ZZ2AF+2                                                  01104000
ZZ2AFD   EQU   ZZ2AF+2                                                  01105000
ZZ2AFQ   EQU   ZZ2AF+2                                                  01106000
ZZ2AF$   EQU   ZZ2AF+2                                                  01107000
@NM00024 EQU   ZZ2AF+2                                                  01108000
ZZ2AFM   EQU   ZZ2AF+2                                                  01109000
@NM00023 EQU   ZZ2AF+2                                                  01110000
@NM00022 EQU   ZZ2AF+1                                                  01111000
ZZ2AFV   EQU   ZZ2AF+1                                                  01112000
@NM00021 EQU   ZZ2AF+1                                                  01113000
ZZ2AFC   EQU   ZZ2AF+1                                                  01114000
@NM00020 EQU   ZZ2AF                                                    01115000
ZZ2AFFS  EQU   ZZ2AF                                                    01116000
ZZ2AFT   EQU   ZZ2AF                                                    01117000
ZZ2AFP   EQU   ZZ2AF                                                    01118000
@NM00019 EQU   ZZ2A+8                                                   01119000
ZZ2ALINE EQU   ZZ2A+4                                                   01120000
@NM00018 EQU   ZZ2A+3                                                   01121000
ZZ2ASE   EQU   ZZ2A+2                                                   01122000
ZZ2ACH   EQU   ZZ2A                                                     01123000
@NM00017 EQU   ZZ2+264                                                  01124000
@NM00016 EQU   ZZ2+263                                                  01125000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  01126000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 01127000
ZZ2PRTL  EQU   ZZ2PRT                                                   01128000
@NM00015 EQU   ZZ2AMD+56                                                01129000
ZZ2AMDXP EQU   ZZ2AMD+52                                                01130000
ZZ2AMDD  EQU   ZZ2AMD+48                                                01131000
ZZ2AMDL  EQU   ZZ2AMD+44                                                01132000
ZZ2AMDU  EQU   ZZ2AMD+28                                                01133000
ZZ2AMDF  EQU   ZZ2AMD+24                                                01134000
ZZ2AMDS  EQU   ZZ2AMD+20                                                01135000
ZZ2AMDC  EQU   ZZ2AMD+16                                                01136000
ZZ2AMDP  EQU   ZZ2AMD+12                                                01137000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 01138000
@NM00014 EQU   @NM00013                                                 01139000
ZZ2AMD2  EQU   @NM00013                                                 01140000
ZZ2AMD1  EQU   @NM00013                                                 01141000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 01142000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 01143000
ZZ2AMDT  EQU   ZZ2AMD                                                   01144000
ZZ199999 EQU   ZZ1+3072                                                 01145000
@NM00012 EQU   ZZ1+2160                                                 01146000
ZZ1TRTAS EQU   ZZ1+1904                                                 01147000
ZZ1TRUPC EQU   ZZ1+1648                                                 01148000
ZZ1TRCTX EQU   ZZ1+1392                                                 01149000
ZZ1NASID EQU   ZZ1N+274                                                 01150000
ZZ1NSTRL EQU   ZZ1N+272                                                 01151000
ZZ1NOFF  EQU   ZZ1N+268                                                 01152000
ZZ1NBDY  EQU   ZZ1N+264                                                 01153000
ZZ1NADE  EQU   ZZ1N+260                                                 01154000
ZZ1NADB  EQU   ZZ1N+256                                                 01155000
ZZ1NSTR  EQU   ZZ1N                                                     01156000
@NM00011 EQU   ZZ1+1080                                                 01157000
ZZ1TREBC EQU   ZZ1+824                                                  01158000
ZZ1TRHEX EQU   ZZ1+568                                                  01159000
@NM00010 EQU   ZZ1+377                                                  01160000
ZZ1USTAE EQU   ZZ1+376                                                  01161000
@NM00009 EQU   ZZ1F+1                                                   01162000
@NM00008 EQU   ZZ1F                                                     01163000
ZZ1FM    EQU   ZZ1F                                                     01164000
ZZ1FX    EQU   ZZ1F                                                     01165000
ZZ1FU    EQU   ZZ1F                                                     01166000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 01167000
@NM00007 EQU   ZZ1EVE                                                   01168000
ZZ1EVEP  EQU   ZZ1EVE                                                   01169000
ZZ1EVEW  EQU   ZZ1EVE                                                   01170000
ZZ1ACMP  EQU   ZZ1ATTN                                                  01171000
@NM00006 EQU   ZZ1+144                                                  01172000
ZZ1FPP   EQU   ZZ1+140                                                  01173000
ZZ1ZZ6P  EQU   ZZ1+136                                                  01174000
@NM00005 EQU   ZZ1+84                                                   01175000
ZZ1PLINE EQU   ZZ1+80                                                   01176000
ZZ1PGSZ  EQU   ZZ1+76                                                   01177000
ZZ1PCNT  EQU   ZZ1+72                                                   01178000
@NM00004 EQU   ZZ1+68                                                   01179000
ZZ1TPAGE EQU   ZZ1+64                                                   01180000
ZZ1TLINE EQU   ZZ1+60                                                   01181000
@NM00003 EQU   ZZ1+48                                                   01182000
ZZ1DSDP  EQU   ZZ1+44                                                   01183000
ZZ1PDRP  EQU   ZZ1+40                                                   01184000
ZZ1ZZ2P  EQU   ZZ1+36                                                   01185000
ZZ1327WP EQU   ZZ1+32                                                   01186000
ZZ1ACBP  EQU   ZZ1+28                                                   01187000
@NM00002 EQU   ZZ1+24                                                   01188000
ZZ1PDCBP EQU   ZZ1+20                                                   01189000
ZZ1BLRBL EQU   ZZ1+16                                                   01190000
@NM00001 EQU   ZZ1+12                                                   01191000
ZZ1PNULL EQU   ZZ1+8                                                    01192000
ZZ1NULL  EQU   ZZ1+4                                                    01193000
ZZ1IDE   EQU   ZZ1                                                      01194000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01195000
@ENDDATA EQU   *                                                        01196000
         END   BLSRMSGB,(C'PLS1738',0701,78058)                         01197000
