RACV     TITLE 'BLSRRACV--BUILD MVS VIRTUAL ADDRESS SPACE DESCRIPTION  *00001000
                        '                                               00002000
*/* CHANGE ACTIVITY -------------------------------------------------*/ 00003000
*/*   THIS MODULE WAS WRITTEN FOR @G57LPRW                           */ 00004000
*/*------------------------------------------------------------------*/ 00005000
BLSRRACV CSECT ,                                                01S0002 00006000
@MAINENT DS    0H                                               01S0002 00007000
         USING *,@15                                            01S0002 00008000
         B     @PROLOG                                          01S0002 00009000
         DC    AL1(16)                                          01S0002 00010000
         DC    C'BLSRRACV  78.058'                              01S0002 00011000
         DROP  @15                                                      00012000
@PROLOG  STM   @14,@12,12(@13)                                  01S0002 00013000
         BALR  @12,0                                            01S0002 00014000
@PSTART  DS    0H                                               01S0002 00015000
         USING @PSTART,@12                                      01S0002 00016000
         L     @00,@SIZDATD                                     01S0002 00017000
         BLSUALLS R,LV=(0)                                              00018000
         LR    @11,@01                                          01S0002 00019000
         USING @DATD,@11                                        01S0002 00020000
         ST    @13,@SA00001+4                                   01S0002 00021000
         LM    @00,@01,20(@13)                                  01S0002 00022000
         ST    @11,8(,@13)                                      01S0002 00023000
         LR    @13,@11                                          01S0002 00024000
         MVC   @PC00001(8),0(@01)                               01S0002 00025000
*   FLAG='00'X;                     /* PROCESSING CONTROL FLAGS      */ 00026000
         MVI   FLAG,X'00'                                       01S0147 00027000
*   RETC=ZZZFLAGI;                  /* RETURN CODE                   */ 00028000
         SLR   RETC,RETC                                        01S0148 00029000
*   RABAPTR=ADDR(RAPA);             /* ->RABA (ALIAS FOR RAPA)       */ 00030000
         L     RABAPTR,@PC00001+4                               01S0149 00031000
*   DATS=RABAAS;                    /* REQUESTED ADDRESS SPACE       */ 00032000
         MVC   DATS(16),RABAAS(RABAPTR)                         01S0150 00033000
*   REQPAGEP=RABAFAD&ZZZP4M24;      /* ->INTERESTING PAGE            */ 00034000
         L     REQPAGEP,RABAFAD(,RABAPTR)                       01S0151 00035000
         N     REQPAGEP,@CF00118                                01S0151 00036000
*   IF DATS2^=ZZ6DQA2 THEN          /* SECONDARY ADDRESS SPACE       */ 00037000
*                                                               01S0152 00038000
         L     @14,ZZ2AZZ6P(,R9)                                01S0152 00039000
         CLC   DATS2(4),ZZ6DQA2(@14)                            01S0152 00040000
         BE    @RF00152                                         01S0152 00041000
*     /***************************************************************/ 00042000
*     /*                                                             */ 00043000
*     /* SECONDARY ADDRESS SPACE FOR THIS DUMP                       */ 00044000
*     /*                                                             */ 00045000
*     /***************************************************************/ 00046000
*                                                               01S0153 00047000
*     DO;                           /* SECONDARY ADDRESS SPACE       */ 00048000
*       IF                          /* COMMON STORAGE                */ 00049000
*           REQPAGEP<ZZ6DPRP|       /* BELOW THE PRIVATE AREA        */ 00050000
*           REQPAGEP>=ZZ6DCAP THEN  /* IN THE COMMON AREA            */ 00051000
*                                                               01S0154 00052000
         CL    REQPAGEP,ZZ6DPRP(,@14)                           01S0154 00053000
         BL    @RT00154                                         01S0154 00054000
         CL    REQPAGEP,ZZ6DCAP(,@14)                           01S0154 00055000
         BL    @RF00154                                         01S0154 00056000
@RT00154 DS    0H                                               01S0155 00057000
*         /***********************************************************/ 00058000
*         /*                                                         */ 00059000
*         /* COMMON STORAGE                                          */ 00060000
*         /*                                                         */ 00061000
*         /***********************************************************/ 00062000
*                                                               01S0155 00063000
*         DO;                       /* COMMON STORAGE                */ 00064000
*           RABAAS2=ZZ6DQA2;        /* PRIMARY MVS ASID              */ 00065000
         L     @14,ZZ2AZZ6P(,R9)                                01S0156 00066000
         MVC   RABAAS2(4,RABAPTR),ZZ6DQA2(@14)                  01S0156 00067000
*           CALL BLSRRAGE(ZZ2,RABA);/* LOCATE COMMON STORAGE         */ 00068000
         ST    R9,@AL00001                                      01S0157 00069000
         ST    RABAPTR,@AL00001+4                               01S0157 00070000
         L     @10,ZZ2RVTP(,R9)                                 01S0157 00071000
         L     @15,RVTRAGEP(,@10)                               01S0157 00072000
         LA    @01,@AL00001                                     01S0157 00073000
         BALR  @14,@15                                          01S0157 00074000
*           RETC=RF;                /* RETURN CODE                   */ 00075000
         LR    RETC,RF                                          01S0158 00076000
*           IF RETC>ZZZFLAGE THEN   /* LOCATION NOT RECORDED         */ 00077000
*                                                               01S0159 00078000
         CH    RETC,@CH00054                                    01S0159 00079000
         BNH   @RF00159                                         01S0159 00080000
*             /*******************************************************/ 00081000
*             /*                                                     */ 00082000
*             /* LOCATION NOT RECORDED                               */ 00083000
*             /*                                                     */ 00084000
*             /*******************************************************/ 00085000
*                                                               01S0160 00086000
*             DO;                   /* LOCATION NOT RECORDED         */ 00087000
*               RABAAS2=DATS2;      /* RESTORE REQUESTED ASID        */ 00088000
         MVC   RABAAS2(4,RABAPTR),DATS2                         01S0161 00089000
*               GO TO EXIT;         /* ERROR EXIT                    */ 00090000
         B     EXIT                                             01S0162 00091000
*             END;                  /* LOCATION NOT RECORDED         */ 00092000
*           IF REQPAGEP<ZZ6DPRP THEN/* NUCLEUS/SYSTEM AREA           */ 00093000
*                                                               01S0164 00094000
@RF00159 L     @14,ZZ2AZZ6P(,R9)                                01S0164 00095000
         L     @14,ZZ6DPRP(,@14)                                01S0164 00096000
         CLR   REQPAGEP,@14                                     01S0164 00097000
         BNL   @RF00164                                         01S0164 00098000
*             /*******************************************************/ 00099000
*             /*                                                     */ 00100000
*             /* NUCLEUS/SYSTEM AREA                                 */ 00101000
*             /*                                                     */ 00102000
*             /*******************************************************/ 00103000
*                                                               01S0165 00104000
*             DO;                   /* NUCLEUS/SYSTEM AREA           */ 00105000
*               RABAUSE=1;          /* ENTRIES IN USE                */ 00106000
         LA    @10,1                                            01S0166 00107000
         STH   @10,RABAUSE(,RABAPTR)                            01S0166 00108000
*               RABAFAD=            /* ->FINAL BYTE DESCRIBED        */ 00109000
*                   RABARIA(1)+RABARNM(1)*RABARLE(1)-1;         01S0167 00110000
         L     @08,RABARIA(,RABAPTR)                            01S0167 00111000
         LH    @06,RABARNM(,RABAPTR)                            01S0167 00112000
         L     @02,RABARLE(,RABAPTR)                            01S0167 00113000
         LR    @01,@06                                          01S0167 00114000
         MR    @00,@02                                          01S0167 00115000
         ALR   @01,@08                                          01S0167 00116000
         BCTR  @01,0                                            01S0167 00117000
         ST    @01,RABAFAD(,RABAPTR)                            01S0167 00118000
*               IF                  /* MAKE FINAL GROUP 1 RECORD     */ 00119000
*                   RABAFAD>=ZZ6DPRP&/* PENETRATES PRIVATE AREA      */ 00120000
*                   RABARNM(1)^=1 THEN/* MULTIPLE RECORD GROUP       */ 00121000
*                                                               01S0168 00122000
         CLR   @01,@14                                          01S0168 00123000
         BL    @RF00168                                         01S0168 00124000
         CR    @06,@10                                          01S0168 00125000
         BE    @RF00168                                         01S0168 00126000
*                 /***************************************************/ 00127000
*                 /*                                                 */ 00128000
*                 /* MAKE FINAL GROUP CONSIST OF 1 RECORD            */ 00129000
*                 /*                                                 */ 00130000
*                 /***************************************************/ 00131000
*                                                               01S0169 00132000
*                 DO;               /* MAKE FINAL GROUP 1 RECORD     */ 00133000
*                   RABAFAD=RABARIA(1)+RABARLE(1)-1;/* ->FINAL BYTE  */ 00134000
         ALR   @08,@02                                          01S0170 00135000
         BCTR  @08,0                                            01S0170 00136000
         ST    @08,RABAFAD(,RABAPTR)                            01S0170 00137000
*                   RABARNM(1)=1;   /* NUMBER OF RECORDS             */ 00138000
         STH   @10,RABARNM(,RABAPTR)                            01S0171 00139000
*                 END;              /* MAKE FINAL GROUP 1 RECORD     */ 00140000
*               IF RABAFAD>=ZZ6DPRP THEN/* TRUNCATE FINAL GROUP      */ 00141000
*                                                               01S0173 00142000
@RF00168 L     @14,ZZ2AZZ6P(,R9)                                01S0173 00143000
         L     @14,ZZ6DPRP(,@14)                                01S0173 00144000
         CL    @14,RABAFAD(,RABAPTR)                            01S0173 00145000
         BH    @RF00173                                         01S0173 00146000
*                 /***************************************************/ 00147000
*                 /*                                                 */ 00148000
*                 /* TRUNCATE FINAL GROUP AT THE PRIVATE AREA        */ 00149000
*                 /*                                                 */ 00150000
*                 /***************************************************/ 00151000
*                                                               01S0174 00152000
*                 DO;               /* TRUNCATE FINAL GROUP          */ 00153000
*                   RABAFAD=ZZ6DPRP-1;/* ->FINAL BYTE DESCRIBED      */ 00154000
         LR    @10,@14                                          01S0175 00155000
         BCTR  @10,0                                            01S0175 00156000
         ST    @10,RABAFAD(,RABAPTR)                            01S0175 00157000
*                   RABARLE(1)=ZZ6DPRP-RABARIA(1);/* LENGTH          */ 00158000
         SL    @14,RABARIA(,RABAPTR)                            01S0176 00159000
         ST    @14,RABARLE(,RABAPTR)                            01S0176 00160000
*                 END;              /* TRUNCATE FINAL GROUP          */ 00161000
*             END;                  /* NUCLEUS/SYSTEM AREA           */ 00162000
@RF00173 DS    0H                                               01S0179 00163000
*           RABAAS2=DATS2;          /* RESTORE REQUESTED ASID        */ 00164000
@RF00164 MVC   RABAAS2(4,RABAPTR),DATS2                         01S0179 00165000
*           GO TO EXIT;             /* COMMON EXIT PATH              */ 00166000
         B     EXIT                                             01S0180 00167000
*         END;                      /* COMMON STORAGE                */ 00168000
*     END;                          /* SECONDARY ADDRESS SPACE       */ 00169000
@RF00154 DS    0H                                               01S0183 00170000
*   RABA=RACO;                      /* INITIALIZE RABA               */ 00171000
@RF00152 L     @14,ZZ2RASYP(,R9)                                01S0183 00172000
         MVC   RABA(148,RABAPTR),RACO(@14)                      01S0183 00173000
*   RABAAS=DATS;                    /* ADDRESS SPACE REQUESTED       */ 00174000
         MVC   RABAAS(16,RABAPTR),DATS                          01S0184 00175000
*   RABAFAD=REQPAGEP|'00000FFF'X;   /* ->FINAL BYTE DESCRIBED        */ 00176000
         LR    @14,REQPAGEP                                     01S0185 00177000
         O     @14,@CF00116                                     01S0185 00178000
         ST    @14,RABAFAD(,RABAPTR)                            01S0185 00179000
*   RABAUSE=1;                      /* ONE ENTRY IN USE              */ 00180000
         LA    @14,1                                            01S0186 00181000
         STH   @14,RABAUSE(,RABAPTR)                            01S0186 00182000
*   RABARLE(1)=ZZZLENP4;            /* LENGTH OF DATA                */ 00183000
         MVC   RABARLE(4,RABAPTR),@CF00094                      01S0187 00184000
*   RABARNM(1)=1;                   /* ONE STORAGE RECORD            */ 00185000
         STH   @14,RABARNM(,RABAPTR)                            01S0188 00186000
*   RABAROF(1)=0;                   /* NO DATA OFFSET                */ 00187000
         SLR   @14,@14                                          01S0189 00188000
         ST    @14,RABAROF(,RABAPTR)                            01S0189 00189000
*   RABARDA(1)=0;                   /* NO DISK RECORD                */ 00190000
         ST    @14,RABARDA(,RABAPTR)                            01S0190 00191000
*   RABARFU(1)=ZZZ1;                /* STORAGE NOT AVAILABLE         */ 00192000
         OI    RABARFU(RABAPTR),B'10000000'                     01S0191 00193000
*   RABARIA(1)=REQPAGEP;            /* ->FIRST BYTE DESCRIBED        */ 00194000
         ST    REQPAGEP,RABARIA(,RABAPTR)                       01S0192 00195000
*   IF ZZ6DFAB=ZZZ0 THEN            /* VIRTUAL DUMP                  */ 00196000
         L     @14,ZZ2AZZ6P(,R9)                                01S0193 00197000
         TM    ZZ6DFAB(@14),B'00010000'                         01S0193 00198000
         BZ    @RT00193                                         01S0193 00199000
*     GO TO EXIT;                   /* COMMON EXIT PATH              */ 00200000
*   ESAUSYM='SGT';                  /* RETRIEVE SGT DEFINITION       */ 00201000
         MVI   ESAUSYM+3,C' '                                   01S0195 00202000
         MVC   ESAUSYM+4(27),ESAUSYM+3                          01S0195 00203000
         MVC   ESAUSYM(3),@CC01290                              01S0195 00204000
*   DO;                             /* BLRCNVUC(DATS2) FROM(UNSIGNED    00205000
*                                      BINARY)TO(CHARACTER)SET(ESAUSY   00206000
*                                      M(4:6))REMARK(ASID)           */ 00207000
*                                                               01S0196 00208000
*     /***************************************************************/ 00209000
*     /*                                                             */ 00210000
*     /* ASID                                                        */ 00211000
*     /*                                                             */ 00212000
*     /***************************************************************/ 00213000
*                                                               01S0197 00214000
*     CVD(DATS2,PACKED);            /* BINARY=>PACKED DECIMAL        */ 00215000
         L     @14,DATS2                                        01S0197 00216000
         CVD   @14,PACKED                                       01S0197 00217000
*     UNPK(ESAUSYM(4:6),PACKED);    /* PACKED DECIMAL=>ZONED DECIMAL */ 00218000
         UNPK  ESAUSYM+3(3),PACKED(8)                           01S0198 00219000
*     ESAUSYM(6:6)=ESAUSYM(6:6)|'0';/* ZONED DECIMAL=>EBCDIC         */ 00220000
         OI    ESAUSYM+5,C'0'                                   01S0199 00221000
*   END;                            /* BLRCNVUC(DATS2) FROM(UNSIGNED    00222000
*                                      BINARY)TO(CHARACTER)SET(ESAUSY   00223000
*                                      M(4:6))REMARK(ASID)           */ 00224000
*   ESAUDT=DTSGT;                   /* DATA TYPE                     */ 00225000
         MVC   ESAUDT(34),DTSGT                                 01S0201 00226000
*   CALL BLSRESGU(ZZ2,ESAU);        /* RETRIEVE SGT DEFINITION       */ 00227000
         ST    R9,@AL00001                                      01S0202 00228000
         LA    @14,ESAU                                         01S0202 00229000
         ST    @14,@AL00001+4                                   01S0202 00230000
         L     @10,ZZ2RVTP(,R9)                                 01S0202 00231000
         L     @15,RVTESGUP(,@10)                               01S0202 00232000
         LA    @01,@AL00001                                     01S0202 00233000
         BALR  @14,@15                                          01S0202 00234000
*   IF RF>ZZZFLAGE THEN             /* ERROR LOCATING SEGMENT TABLE  */ 00235000
*                                                               01S0203 00236000
         CH    RF,@CH00054                                      01S0203 00237000
         BNH   @RF00203                                         01S0203 00238000
*     /***************************************************************/ 00239000
*     /*                                                             */ 00240000
*     /* ERROR LOCATING SEGMENT TABLE                                */ 00241000
*     /*                                                             */ 00242000
*     /***************************************************************/ 00243000
*                                                               01S0204 00244000
*     DO;                           /* ERROR LOCATING SEGMENT TABLE  */ 00245000
*       IF DATS2=ZZZAS2M THEN       /* MASTER SEGMENT TABLE          */ 00246000
*                                                               01S0205 00247000
         CLC   DATS2(4),@CF00046                                01S0205 00248000
         BNE   @RF00205                                         01S0205 00249000
*         /***********************************************************/ 00250000
*         /*                                                         */ 00251000
*         /* MASTER SEGMENT TABLE                                    */ 00252000
*         /*                                                         */ 00253000
*         /***********************************************************/ 00254000
*                                                               01S0206 00255000
*         DO;                       /* MASTER SEGMENT TABLE          */ 00256000
*           P1=ZZZP24P1;            /* ->BYTE FOLLOWING DESCRIPTION  */ 00257000
         L     P1,@CF00124                                      01S0207 00258000
*           P2=ZZZZNULL;            /* ->FIRST BYTE DESCRIBED        */ 00259000
         SLR   P2,P2                                            01S0208 00260000
*         END;                      /* MASTER SEGMENT TABLE          */ 00261000
*       ELSE                        /* SGT002, SGT003, ....          */ 00262000
*                                                               01S0210 00263000
*         /***********************************************************/ 00264000
*         /*                                                         */ 00265000
*         /* SEGMENT TABLE FOR SECONDARY ADDRESS SPACE               */ 00266000
*         /*                                                         */ 00267000
*         /***********************************************************/ 00268000
*                                                               01S0210 00269000
*         DO;                       /* SGT002, SGT003, ....          */ 00270000
         B     @RC00205                                         01S0210 00271000
@RF00205 DS    0H                                               01S0211 00272000
*           P1=ZZ6DCAP;             /* ->BYTE FOLLOWING DESCRIPTION  */ 00273000
         L     @14,ZZ2AZZ6P(,R9)                                01S0211 00274000
         L     P1,ZZ6DCAP(,@14)                                 01S0211 00275000
*           P2=ZZ6DPRP;             /* ->FIRST BYTE DESCRIBED        */ 00276000
         L     P2,ZZ6DPRP(,@14)                                 01S0212 00277000
*         END;                      /* SGT002, SGT003, ....          */ 00278000
*       RABAFAD=P1-1;               /* ->FINAL BYTE DESCRIBED        */ 00279000
@RC00205 LR    @14,P1                                           01S0214 00280000
         BCTR  @14,0                                            01S0214 00281000
         ST    @14,RABAFAD(,RABAPTR)                            01S0214 00282000
*       RABARIA(1)=P2;              /* ->FIRST BYTE DESCRIBED        */ 00283000
         ST    P2,RABARIA(,RABAPTR)                             01S0215 00284000
*       RABARLE(1)=P1-P2;           /* LENGTH OF DATA                */ 00285000
         LR    @14,P1                                           01S0216 00286000
         SLR   @14,P2                                           01S0216 00287000
         ST    @14,RABARLE(,RABAPTR)                            01S0216 00288000
*       GO TO EXIT;                 /* COMMON EXIT PATH              */ 00289000
         B     EXIT                                             01S0217 00290000
*     END;                          /* ERROR LOCATING SEGMENT TABLE  */ 00291000
*   ESAUSYM(1:1)='P';               /* CHANGE SGT=>PGT               */ 00292000
@RF00203 MVI   ESAUSYM,C'P'                                     01S0219 00293000
*   SEGNUM=REQPAGEP/ZZZLENS6;       /* SEGMENT NUMBER                */ 00294000
         LR    SEGNUM,REQPAGEP                                  01S0220 00295000
         SRL   SEGNUM,16                                        01S0220 00296000
*   ESAUSYM(7:7)=ALPHASEQ(SEGNUM/ZZZALPSM+1);/* FIRST SEGMENT DIGIT  */ 00297000
         LA    @14,26                                           01S0221 00298000
         LR    @01,SEGNUM                                       01S0221 00299000
         SLR   @00,@00                                          01S0221 00300000
         DR    @00,@14                                          01S0221 00301000
         LA    @10,ALPHASEQ(@01)                                01S0221 00302000
         MVC   ESAUSYM+6(1),0(@10)                              01S0221 00303000
*   ESAUSYM(8:8)=ALPHASEQ(SEGNUM//ZZZALPSM+1);/* 2ND SEGMENT DIGIT   */ 00304000
         LR    @00,SEGNUM                                       01S0222 00305000
         SRDA  @00,32                                           01S0222 00306000
         DR    @00,@14                                          01S0222 00307000
         LR    @14,@00                                          01S0222 00308000
         LA    @10,ALPHASEQ(@14)                                01S0222 00309000
         MVC   ESAUSYM+7(1),0(@10)                              01S0222 00310000
*   ESAUDT=DATCPGT;                 /* DATA TYPE STRUCTURE(PGTE)     */ 00311000
         MVC   ESAUDT(34),DATCPGT                               01S0223 00312000
*   CALL BLSRESGU(ZZ2,ESAU);        /* LOCATE PAGE TABLE             */ 00313000
         ST    R9,@AL00001                                      01S0224 00314000
         LA    @14,ESAU                                         01S0224 00315000
         ST    @14,@AL00001+4                                   01S0224 00316000
         L     @10,ZZ2RVTP(,R9)                                 01S0224 00317000
         L     @15,RVTESGUP(,@10)                               01S0224 00318000
         LA    @01,@AL00001                                     01S0224 00319000
         BALR  @14,@15                                          01S0224 00320000
*   IF RF>ZZZFLAGE THEN             /* REQUESTED SEGMENT IS INVALID  */ 00321000
*                                                               01S0225 00322000
         CH    RF,@CH00054                                      01S0225 00323000
         BNH   @RF00225                                         01S0225 00324000
*     /***************************************************************/ 00325000
*     /*                                                             */ 00326000
*     /* REQUESTED SEGMENT IS INVALID                                */ 00327000
*     /*                                                             */ 00328000
*     /***************************************************************/ 00329000
*                                                               01S0226 00330000
*     DO;                           /* REQUESTED SEGMENT IS INVALID  */ 00331000
*       RABAFAD=REQPAGEP|'0000FFFF'X;/* ->FINAL BYTE DESCRIBED       */ 00332000
         LR    @14,REQPAGEP                                     01S0227 00333000
         O     @14,@CF01295                                     01S0227 00334000
         ST    @14,RABAFAD(,RABAPTR)                            01S0227 00335000
*       RABARIA(1)=REQPAGEP&'FFFF0000'X;/* ->FIRST BYTE DESCRIBED    */ 00336000
         LR    @14,REQPAGEP                                     01S0228 00337000
         N     @14,@CF01296                                     01S0228 00338000
         ST    @14,RABARIA(,RABAPTR)                            01S0228 00339000
*       RABARLE(1)=ZZZLENS6;        /* LENGTH OF DATA                */ 00340000
         MVC   RABARLE(4,RABAPTR),@CF00096                      01S0229 00341000
*       CALL E100;                  /* WRITE RA RECORD               */ 00342000
         BAL   @14,E100                                         01S0230 00343000
*       GO TO EXIT;                 /* COMMON EXIT PATH              */ 00344000
         B     EXIT                                             01S0231 00345000
*     END;                          /* REQUESTED SEGMENT IS INVALID  */ 00346000
*   ESAUD=DATCPG;                   /* DATA CHARACTERISTICS OF PGTE  */ 00347000
@RF00225 MVC   ESAUD(60),DATCPG                                 01S0233 00348000
*   ESAUDIL=(REQPAGEP&'0000F000'X)/ZZZLENP4;/* ENTRY NUMBER          */ 00349000
         LR    @00,REQPAGEP                                     01S0234 00350000
         N     @00,@CF01298                                     01S0234 00351000
         SRL   @00,12                                           01S0234 00352000
         ST    @00,ESAUDIL                                      01S0234 00353000
*   ESAUDOF=ESAUDIL*LENGTH(PGTPTE); /* OFFSET                        */ 00354000
         ALR   @00,@00                                          01S0235 00355000
         ST    @00,ESAUDOF                                      01S0235 00356000
*   CALL BLSRACCQ(ZZ2,ESAU,HOLDWORD);/* RETRIEVE PGTPTE IMAGE        */ 00357000
         ST    R9,@AL00001                                      01S0236 00358000
         LA    @14,ESAU                                         01S0236 00359000
         ST    @14,@AL00001+4                                   01S0236 00360000
         LA    @14,HOLDWORD                                     01S0236 00361000
         ST    @14,@AL00001+8                                   01S0236 00362000
         L     @10,ZZ2RVTP(,R9)                                 01S0236 00363000
         L     @15,RVTACCQP(,@10)                               01S0236 00364000
         LA    @01,@AL00001                                     01S0236 00365000
         BALR  @14,@15                                          01S0236 00366000
*   PTEPTR=ADDR(HOLDWORD);          /* ->PGTPTE IMAGE                */ 00367000
         LA    PTEPTR,HOLDWORD                                  01S0237 00368000
*   IF RF^=ZZZFLAGI|                /* PGTPTE STORAGE NOT AVAILABLE  */ 00369000
*       (PGTPVM=ZZZ1&               /* INVALID PAGE                  */ 00370000
*       PGTPAM=ZZZ0) THEN           /* PAGE NOT GETMAINED            */ 00371000
*                                                               01S0238 00372000
         LTR   RF,RF                                            01S0238 00373000
         BNZ   @RT00238                                         01S0238 00374000
         TM    PGTPVM(PTEPTR),B'00001000'                       01S0238 00375000
         BNO   @RF00238                                         01S0238 00376000
         TM    PGTPAM(PTEPTR),B'00000001'                       01S0238 00377000
         BNZ   @RF00238                                         01S0238 00378000
@RT00238 DS    0H                                               01S0239 00379000
*     /***************************************************************/ 00380000
*     /*                                                             */ 00381000
*     /* REQUESTED PAGE IS INVALID                                   */ 00382000
*     /*                                                             */ 00383000
*     /***************************************************************/ 00384000
*                                                               01S0239 00385000
*     DO;                           /* REQUESTED PAGE IS INVALID     */ 00386000
*       CALL E100;                  /* WRITE MISSING STORAGE RECORD  */ 00387000
         BAL   @14,E100                                         01S0240 00388000
*       GO TO EXIT;                 /* COMMON EXIT PATH              */ 00389000
         B     EXIT                                             01S0241 00390000
*     END;                          /* REQUESTED PAGE IS INVALID     */ 00391000
*   IF PGTPVM=ZZZ1 THEN             /* GETMAINED BUT INVALID         */ 00392000
*                                                               01S0243 00393000
@RF00238 TM    PGTPVM(PTEPTR),B'00001000'                       01S0243 00394000
         BNO   @RF00243                                         01S0243 00395000
*     /***************************************************************/ 00396000
*     /*                                                             */ 00397000
*     /* ATTEMPT RECLAIM FOR AN INVALID PAGE                         */ 00398000
*     /*                                                             */ 00399000
*     /***************************************************************/ 00400000
*                                                               01S0244 00401000
*     DO;                           /* ATTEMPT RECLAIM FOR ONE PAGE  */ 00402000
*       RBNTIM16=PGTRSA&'FFF0'X;    /* 16*REAL BLOCK NUMBER          */ 00403000
         L     RBNTIM16,@CF01299                                01S0245 00404000
         SLR   @14,@14                                          01S0245 00405000
         ICM   @14,3,PGTRSA(PTEPTR)                             01S0245 00406000
         NR    RBNTIM16,@14                                     01S0245 00407000
*       ESAUSYM='PFT';              /* RETREIVE PFT DEFINITION       */ 00408000
         MVI   ESAUSYM+3,C' '                                   01S0246 00409000
         MVC   ESAUSYM+4(27),ESAUSYM+3                          01S0246 00410000
         MVC   ESAUSYM(3),@CC01300                              01S0246 00411000
*       ESAUDT=DATCPFT;             /* DATA TYPE STRUCTURE(PFTE)     */ 00412000
         MVC   ESAUDT(34),DATCPFT                               01S0247 00413000
*       CALL BLSRESGU(ZZ2,ESAU);    /* RETRIEVE PFT DEFINITION       */ 00414000
         ST    R9,@AL00001                                      01S0248 00415000
         LA    @14,ESAU                                         01S0248 00416000
         ST    @14,@AL00001+4                                   01S0248 00417000
         L     @10,ZZ2RVTP(,R9)                                 01S0248 00418000
         L     @15,RVTESGUP(,@10)                               01S0248 00419000
         LA    @01,@AL00001                                     01S0248 00420000
         BALR  @14,@15                                          01S0248 00421000
*       IF RF>ZZZFLAGE|             /* PFT NOT FOUND                 */ 00422000
*           RBNTIM16<ESAUDOF|       /* NUCLEUS PAGE                  */ 00423000
*           RBNTIM16>=ESAUDOF+ESAUDIM*ESAUDLE THEN/* NO SUCH REAL       00424000
*                                      STORAGE PAGE                  */ 00425000
*                                                               01S0249 00426000
         CH    RF,@CH00054                                      01S0249 00427000
         BH    @RT00249                                         01S0249 00428000
         L     @14,ESAUDOF                                      01S0249 00429000
         CR    RBNTIM16,@14                                     01S0249 00430000
         BL    @RT00249                                         01S0249 00431000
         L     @01,ESAUDIM                                      01S0249 00432000
         M     @00,ESAUDLE                                      01S0249 00433000
         ALR   @14,@01                                          01S0249 00434000
         CLR   RBNTIM16,@14                                     01S0249 00435000
         BL    @RF00249                                         01S0249 00436000
@RT00249 DS    0H                                               01S0250 00437000
*         /***********************************************************/ 00438000
*         /*                                                         */ 00439000
*         /* PAGE FRAME TABLE NOT USEFUL                             */ 00440000
*         /*                                                         */ 00441000
*         /***********************************************************/ 00442000
*                                                               01S0250 00443000
*         DO;                       /* PFT NOT USEFUL                */ 00444000
*           CALL E100;              /* WRITE MISSING STORAGE RECORD  */ 00445000
         BAL   @14,E100                                         01S0251 00446000
*           GO TO EXIT;             /* COMMON EXIT PATH              */ 00447000
         B     EXIT                                             01S0252 00448000
*         END;                      /* PFT NOT USEFUL                */ 00449000
*       ESAUD=DATCPF;               /* DATA CHARACTERISTICS OF PFTE  */ 00450000
@RF00249 MVC   ESAUD(60),DATCPF                                 01S0254 00451000
*       ESAUDOF=RBNTIM16;           /* OFFSET OF INTERESTING PFTE    */ 00452000
         ST    RBNTIM16,ESAUDOF                                 01S0255 00453000
*       ESAUDIL=RBNTIM16/(ZZZLENS6/ZZZLENP4);/* REAL BLOCK NUMBER    */ 00454000
         LR    @14,RBNTIM16                                     01S0256 00455000
         SRL   @14,4                                            01S0256 00456000
         ST    @14,ESAUDIL                                      01S0256 00457000
*       VBNTIM16=(REQPAGEP&ZZZP4M24)/(ZZZP24P1/ZZZLENS6);       01S0257 00458000
         LR    @00,REQPAGEP                                     01S0257 00459000
         N     @00,@CF00118                                     01S0257 00460000
         SRL   @00,8                                            01S0257 00461000
         LR    VBNTIM16,@00                                     01S0257 00462000
*       CALL BLSRACCQ(ZZ2,ESAU,HOLD20);/* RETRIEVE PFTE              */ 00463000
         ST    R9,@AL00001                                      01S0258 00464000
         LA    @14,ESAU                                         01S0258 00465000
         ST    @14,@AL00001+4                                   01S0258 00466000
         LA    @14,HOLD20                                       01S0258 00467000
         ST    @14,@AL00001+8                                   01S0258 00468000
         L     @10,ZZ2RVTP(,R9)                                 01S0258 00469000
         L     @15,RVTACCQP(,@10)                               01S0258 00470000
         LA    @01,@AL00001                                     01S0258 00471000
         BALR  @14,@15                                          01S0258 00472000
*       PFTEPTR=ADDR(HOLD20);       /* ->PFTE IMAGE                  */ 00473000
         LA    PFTEPTR,HOLD20                                   01S0259 00474000
*       IF RF^=ZZZFLAGI|            /* PFTE STORAGE NOT AVAILABLE    */ 00475000
*           PFTIRRG=ZZZ1|           /* VIO PAGE                      */ 00476000
*           (PFTASID^='FFFF'X&PFTASID^=DATS2)|/* BACKING FOR ANOTHER    00477000
*                                      ADDRESS SPACE                 */ 00478000
*           VBNTIM16^=PFTVBN THEN   /* BACKING FOR ANOTHER BLOCK     */ 00479000
*                                                               01S0260 00480000
         LTR   RF,RF                                            01S0260 00481000
         BNZ   @RT00260                                         01S0260 00482000
         TM    PFTIRRG(PFTEPTR),B'00010000'                     01S0260 00483000
         BO    @RT00260                                         01S0260 00484000
         SLR   @14,@14                                          01S0260 00485000
         ICM   @14,3,PFTASID(PFTEPTR)                           01S0260 00486000
         C     @14,@CF00141                                     01S0260 00487000
         BE    @GL00006                                         01S0260 00488000
         CL    @14,DATS2                                        01S0260 00489000
         BNE   @RT00260                                         01S0260 00490000
@GL00006 SLR   @14,@14                                          01S0260 00491000
         ICM   @14,3,PFTVBN(PFTEPTR)                            01S0260 00492000
         CR    VBNTIM16,@14                                     01S0260 00493000
         BE    @RF00260                                         01S0260 00494000
@RT00260 DS    0H                                               01S0261 00495000
*         /***********************************************************/ 00496000
*         /*                                                         */ 00497000
*         /* LAST BACKING FRAME NOT USEFUL                           */ 00498000
*         /*                                                         */ 00499000
*         /***********************************************************/ 00500000
*                                                               01S0261 00501000
*         DO;                       /* LAST BACKING FRAME NOT USEFUL */ 00502000
*           CALL E100;              /* WRITE MISSING STORAGE RECORD  */ 00503000
         BAL   @14,E100                                         01S0262 00504000
*           GO TO EXIT;             /* COMMON EXIT PATH              */ 00505000
         B     EXIT                                             01S0263 00506000
*         END;                      /* LAST BACKING FRAME NOT USEFUL */ 00507000
*       FLAGR=ZZZ1;                 /* RECLAIMED STORAGE PENDING     */ 00508000
@RF00260 OI    FLAGR,B'10000000'                                01S0265 00509000
*     END;                          /* ATTEMPT RECLAIM FOR ONE PAGE  */ 00510000
*   RABAAST=ZZZASTCR;               /* REAL STORAGE                  */ 00511000
@RF00243 MVC   RABAAST(2,RABAPTR),@CC00076                      01S0267 00512000
*   RABAAS2=ZZZAS2NU;               /* NO ASID                       */ 00513000
         SLR   @14,@14                                          01S0268 00514000
         ST    @14,RABAAS2(,RABAPTR)                            01S0268 00515000
*   RABAFAD=(HOLDWORD&'FFF00000'X)/(ZZZP24P1/ZZZLENS6);/* ->REAL PAGE*/ 00516000
         L     @00,HOLDWORD                                     01S0269 00517000
         N     @00,@CF01301                                     01S0269 00518000
         SRL   @00,8                                            01S0269 00519000
         ST    @00,RABAFAD(,RABAPTR)                            01S0269 00520000
*   CALL BLSRRAGE(ZZ2,RABA);        /* RETRIEVE PREVIOUS RESULTS     */ 00521000
         ST    R9,@AL00001                                      01S0270 00522000
         ST    RABAPTR,@AL00001+4                               01S0270 00523000
         L     @10,ZZ2RVTP(,R9)                                 01S0270 00524000
         L     @15,RVTRAGEP(,@10)                               01S0270 00525000
         LA    @01,@AL00001                                     01S0270 00526000
         BALR  @14,@15                                          01S0270 00527000
*   RETC=RF;                        /* RETURN CODE                   */ 00528000
         LR    RETC,RF                                          01S0271 00529000
*   RABAAS=DATS;                    /* REQUESTED ADDRESS SPACE       */ 00530000
         MVC   RABAAS(16,RABAPTR),DATS                          01S0272 00531000
*   IF RETC=ZZZFLAGI THEN           /* INFORMATION OBTAINED          */ 00532000
*                                                               01S0273 00533000
         LTR   RETC,RETC                                        01S0273 00534000
         BNZ   @RF00273                                         01S0273 00535000
*     /***************************************************************/ 00536000
*     /*                                                             */ 00537000
*     /* INFORMATION OBTAINED                                        */ 00538000
*     /*                                                             */ 00539000
*     /***************************************************************/ 00540000
*                                                               01S0274 00541000
*     DO;                           /* INFORMATION OBTAINED          */ 00542000
*       RABAFAD=REQPAGEP|'00000FFF'X;/* ->FINAL BYTE DESCRIBED       */ 00543000
         LR    @14,REQPAGEP                                     01S0275 00544000
         O     @14,@CF00116                                     01S0275 00545000
         ST    @14,RABAFAD(,RABAPTR)                            01S0275 00546000
*       RABAUSE=1;                  /* ONE ENTRY IN USE              */ 00547000
         LA    @14,1                                            01S0276 00548000
         STH   @14,RABAUSE(,RABAPTR)                            01S0276 00549000
*       RABARIA(1)=REQPAGEP;        /* ->FIRST BYTE DESCRIBED        */ 00550000
         ST    REQPAGEP,RABARIA(,RABAPTR)                       01S0277 00551000
*       RABARNM(1)=1;               /* ONE RECORD DESCRIBED          */ 00552000
         STH   @14,RABARNM(,RABAPTR)                            01S0278 00553000
*       IF                          /* RECLAIMED STORAGE             */ 00554000
*           RABARFU(1)=ZZZ0&        /* REAL FRAME AVAILABLE          */ 00555000
*           FLAGR(1)=ZZZ1 THEN      /* RECLAIMED STORAGE PENDING     */ 00556000
         TM    RABARFU(RABAPTR),B'10000000'                     01S0279 00557000
         BNZ   @RF00279                                         01S0279 00558000
         TM    FLAGR,B'10000000'                                01S0279 00559000
         BNO   @RF00279                                         01S0279 00560000
*         RABARFR(1)=ZZZ1;          /* RECLAIMED STORAGE             */ 00561000
         OI    RABARFR(RABAPTR),B'00100000'                     01S0280 00562000
*       CALL E100;                  /* WRITE RA RECORD               */ 00563000
@RF00279 BAL   @14,E100                                         01S0281 00564000
*     END;                          /* INFORMATION OBTAINED          */ 00565000
*EXIT:                              /* COMMON EXIT PATH              */ 00566000
*   RETURN CODE(RETC);                                          01S0283 00567000
@RF00273 DS    0H                                               01S0283 00568000
EXIT     L     @13,4(,@13)                                      01S0283 00569000
         L     @00,@SIZDATD                                     01S0283 00570000
         LR    @01,@11                                          01S0283 00571000
         BLSUFRES R,LV=(0),A=(1)                                        00572000
         LR    @15,@07                                          01S0283 00573000
         L     @14,12(,@13)                                     01S0283 00574000
         LM    @00,@12,20(@13)                                  01S0283 00575000
         BR    @14                                              01S0283 00576000
         SPACE 1                                                        00577000
*                                                               01S0284 00578000
*/*------------------------------------------------------------------*/ 00579000
*/* E100--WRITE AN ADDRESS SPACE RECORD                              */ 00580000
*/*------------------------------------------------------------------*/ 00581000
*                                                               01S0284 00582000
*E100:                              /* WRITE RA RECORD               */ 00583000
*   PROCEDURE;                                                  01S0284 00584000
E100     STM   @14,@12,@SA00002                                 01S0284 00585000
*   CALL BLSRRAAR(ZZ2,RABA);        /* WRITE RA RECORD               */ 00586000
         ST    R9,@AL00001                                      01S0285 00587000
         ST    RABAPTR,@AL00001+4                               01S0285 00588000
         L     @10,ZZ2RVTP(,R9)                                 01S0285 00589000
         L     @15,RVTRAARP(,@10)                               01S0285 00590000
         LA    @01,@AL00001                                     01S0285 00591000
         BALR  @14,@15                                          01S0285 00592000
*   RETURN;                                                     01S0286 00593000
@EL00002 DS    0H                                               01S0286 00594000
@EF00002 DS    0H                                               01S0286 00595000
@ER00002 LM    @14,@12,@SA00002                                 01S0286 00596000
         BR    @14                                              01S0286 00597000
*   END E100;                                                   01S0287 00598000
*                                                               01S0287 00599000
*/*BLSRPEND--DEBUGGING MODULE                                        */ 00600000
*/*BLSUPEND--MVS IPCS MODULE                                         */ 00601000
*                                                               01S0288 00602000
*   DECLARE                         /* DATA FOR AHB MACROS           */ 00603000
*     PACKED BIT(64) BOUNDARY(DWORD);/* DATA CONVERSION WORK AREA    */ 00604000
*   DECLARE                         /* COMMON VARIABLES              */ 00605000
*     I256C CHAR(256) BASED,                                    01S0289 00606000
*     I031F FIXED(31) BASED,                                    01S0289 00607000
*     I031P PTR(31) BASED,                                      01S0289 00608000
*     I015F FIXED(15) BASED,                                    01S0289 00609000
*     I015P PTR(15) BASED,                                      01S0289 00610000
*     I008P PTR(8) BASED,                                       01S0289 00611000
*     I001C CHAR(1) BASED;                                      01S0289 00612000
*   GENERATE NODEFS NOREFS DATA;                                01S0290 00613000
*   END BLSRRACV                    /* BLRPEND(BLSRRACV)             */ 00614000
*                                                               01S0291 00615000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00616000
*/*%INCLUDE SYSLIB  (BLSRZZZ )                                       */ 00617000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00618000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00619000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00620000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00621000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00622000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00623000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00624000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00625000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00626000
*/*%INCLUDE SYSLIB  (BLSRSERV)                                       */ 00627000
*/*%INCLUDE SYSLIB  (IHAPFTE )                                       */ 00628000
*/*%INCLUDE SYSLIB  (IHAPGTE )                                       */ 00629000
*                                                               01S0291 00630000
*       ;                                                       01S0291 00631000
@EL00001 L     @13,4(,@13)                                      01S0291 00632000
@EF00001 L     @00,@SIZDATD                                     01S0291 00633000
         LR    @01,@11                                          01S0291 00634000
         BLSUFRES R,LV=(0),A=(1)                                        00635000
@ER00001 LM    @14,@12,12(@13)                                  01S0291 00636000
         BR    @14                                              01S0291 00637000
@DATA    DS    0H                                                       00638000
@CH00054 DC    H'8'                                                     00639000
@DATD    DSECT                                                          00640000
         DS    0F                                                       00641000
@SA00001 DS    18F                                                      00642000
@PC00001 DS    2F                                                       00643000
@SA00002 DS    15F                                                      00644000
@AL00001 DS    3A                                                       00645000
BLSRRACV CSECT                                                          00646000
         DS    0F                                                       00647000
@CF00046 DC    F'1'                                                     00648000
@CF00094 DC    F'4096'                                                  00649000
@CF00096 DC    F'65536'                                                 00650000
@CF00124 DC    F'16777216'                                              00651000
@CF00116 DC    XL4'00000FFF'                                            00652000
@CF00118 DC    XL4'00FFF000'                                            00653000
@CF01295 DC    XL4'0000FFFF'                                            00654000
@CF01296 DC    XL4'FFFF0000'                                            00655000
@CF01298 DC    XL4'0000F000'                                            00656000
@CF01301 DC    XL4'FFF00000'                                            00657000
@CF00141 DC    XL4'FFFF'                                                00658000
@CF01299 DC    XL4'FFF0'                                                00659000
@DATD    DSECT                                                          00660000
         DS    0D                                                       00661000
HOLDWORD DS    F                                                        00662000
DATS     DS    CL16                                                     00663000
         ORG   DATS                                                     00664000
DATS0    DS    0C                                                       00665000
DATST    DS    CL2                                                      00666000
@NM00097 DS    BL2                                                      00667000
DATS1    DS    FL4                                                      00668000
DATS2    DS    FL4                                                      00669000
@NM00098 DS    BL4                                                      00670000
DATS9    DS    0C                                                       00671000
         ORG   DATS+16                                                  00672000
         DS    CL4                                                      00673000
ESAU     DS    CL694                                                    00674000
         ORG   ESAU                                                     00675000
ESAURID  DS    CL2                                                      00676000
@NM00100 DS    BL6                                                      00677000
@NM00101 DS    CL8                                                      00678000
@NM00102 DS    BL8                                                      00679000
ESAURDX  DS    FL4                                                      00680000
ESAUSYM  DS    CL31                                                     00681000
ESAUELK  DS    0C                                                       00682000
ESAURV1  DS    CL1                                                      00683000
ESAUAS   DS    CL16                                                     00684000
         ORG   ESAUAS                                                   00685000
ESAUAS0  DS    0C                                                       00686000
ESAUAST  DS    CL2                                                      00687000
@NM00103 DS    BL2                                                      00688000
ESAUAS1  DS    FL4                                                      00689000
ESAUAS2  DS    FL4                                                      00690000
@NM00104 DS    BL4                                                      00691000
ESAUAS9  DS    0C                                                       00692000
         ORG   ESAU+76                                                  00693000
ESAULAD  DS    AL4                                                      00694000
ESAUD    DS    CL60                                                     00695000
         ORG   ESAUD                                                    00696000
ESAUD00  DS    0C                                                       00697000
ESAUDOF  DS    FL4                                                      00698000
ESAUDLE  DS    FL4                                                      00699000
ESAUDOB  DS    FL1                                                      00700000
ESAUDLB  DS    FL1                                                      00701000
ESAUDT   DS    CL34                                                     00702000
         ORG   ESAUDT                                                   00703000
ESAUDT0  DS    0C                                                       00704000
ESAUDTY  DS    CL1                                                      00705000
@NM00105 DS    BL1                                                      00706000
ESAUDTD  DS    CL31                                                     00707000
ESAUDTE  DS    CL1                                                      00708000
ESAUDT9  DS    0C                                                       00709000
         ORG   ESAUD+44                                                 00710000
ESAUDIM  DS    FL4                                                      00711000
ESAUDIL  DS    FL4                                                      00712000
ESAUDF   DS    BL4                                                      00713000
         ORG   ESAUDF                                                   00714000
ESAUDFA  DS    BL1                                                      00715000
@NM00106 EQU   ESAUDF+0                                                 00716000
         ORG   ESAUD+56                                                 00717000
@NM00107 DS    BL4                                                      00718000
ESAUD99  DS    0C                                                       00719000
         ORG   ESAU+140                                                 00720000
ESAUMAD  DS    AL4                                                      00721000
@NM00108 DS    BL16                                                     00722000
ESAUKEY  DS    BL1                                                      00723000
ESAUF    DS    BL3                                                      00724000
         ORG   ESAUF                                                    00725000
ESAUFS   DS    BL1                                                      00726000
         ORG   ESAUFS                                                   00727000
ESAUFSC  DS    BL1                                                      00728000
ESAUFS2  EQU   ESAUFS+0                                                 00729000
ESAUFSM  EQU   ESAUFS+0                                                 00730000
ESAUFSA  EQU   ESAUFS+0                                                 00731000
ESAUFSP  EQU   ESAUFS+0                                                 00732000
ESAUFSR  EQU   ESAUFS+0                                                 00733000
ESAUFSX  EQU   ESAUFS+0                                                 00734000
ESAUFSS  EQU   ESAUFS+0                                                 00735000
         ORG   ESAUF+1                                                  00736000
ESAUFC   DS    BL1                                                      00737000
         ORG   ESAUFC                                                   00738000
ESAUFCD  DS    BL1                                                      00739000
@NM00109 EQU   ESAUFC+0                                                 00740000
         ORG   ESAUF+2                                                  00741000
@NM00110 DS    BL1                                                      00742000
         ORG   ESAU+164                                                 00743000
ESAUABS  DS    FL4                                                      00744000
@NM00111 DS    BL12                                                     00745000
ESAUR    DS    CL514                                                    00746000
         ORG   ESAUR                                                    00747000
ESAURL   DS    FL2                                                      00748000
ESAURT   DS    CL512                                                    00749000
         ORG   ESAURT                                                   00750000
ESAURT1  DS    CL512                                                    00751000
         ORG   ESAU+694                                                 00752000
ESAU999  DS    0C                                                       00753000
         ORG   ESAU+694                                                 00754000
FLAG     DS    BL1                                                      00755000
         ORG   FLAG                                                     00756000
FLAGR    DS    BL1                                                      00757000
@NM00124 EQU   FLAG+0                                                   00758000
         ORG   FLAG+1                                                   00759000
         DS    CL1                                                      00760000
HOLD20   DS    CL20                                                     00761000
         DS    CL4                                                      00762000
PACKED   DS    BL8                                                      00763000
BLSRRACV CSECT                                                          00764000
         DS    0F                                                       00765000
@SIZDATD DC    AL1(0)                                                   00766000
         DC    AL3(@ENDDATD-@DATD)                                      00767000
         DS    0D                                                       00768000
@CC01290 DC    C'SGT'                                                   00769000
@CC01300 DC    C'PFT'                                                   00770000
@CC00076 DC    C'CR'                                                    00771000
DATCPF   DS    CL60                                                     00772000
         ORG   DATCPF                                                   00773000
DATCPF00 DS    0C                                                       00774000
DATCPFOF DC    F'0'                                                     00775000
DATCPFLE DC    AL4(16)                                                  00776000
DATCPFOB DC    AL1(0)                                                   00777000
DATCPFLB DC    AL1(0)                                                   00778000
DATCPFT  DS    CL34                                                     00779000
         ORG   DATCPFT                                                  00780000
DATCPFT0 DS    0C                                                       00781000
DATCPFTY DC    CL1'M'                                                   00782000
@NM00091 DC    X'00'                                                    00783000
DATCPFTD DC    CL31'PFTE'                                               00784000
DATCPFTE DC    CL1' '                                                   00785000
DATCPFT9 DS    0C                                                       00786000
         ORG   DATCPF+44                                                00787000
DATCPFIM DC    AL4(1+1-1)                                               00788000
DATCPFIL DC    F'1'                                                     00789000
DATCPFF  DC    X'80000000'                                              00790000
         ORG   DATCPFF                                                  00791000
DATCPFFA DS    BL1                                                      00792000
@NM00092 EQU   DATCPFF+0                                                00793000
         ORG   DATCPF+56                                                00794000
@NM00093 DC    X'00'                                                    00795000
         DC    XL3'0'                                                   00796000
DATCPF99 DS    0C                                                       00797000
         ORG   DATCPF+60                                                00798000
DATCPG   DS    CL60                                                     00799000
         ORG   DATCPG                                                   00800000
DATCPG00 DS    0C                                                       00801000
DATCPGOF DC    F'0'                                                     00802000
DATCPGLE DC    AL4(2)                                                   00803000
DATCPGOB DC    AL1(0)                                                   00804000
DATCPGLB DC    AL1(0)                                                   00805000
DATCPGT  DS    CL34                                                     00806000
         ORG   DATCPGT                                                  00807000
DATCPGT0 DS    0C                                                       00808000
DATCPGTY DC    CL1'M'                                                   00809000
@NM00094 DC    X'00'                                                    00810000
DATCPGTD DC    CL31'PGTE'                                               00811000
DATCPGTE DC    CL1' '                                                   00812000
DATCPGT9 DS    0C                                                       00813000
         ORG   DATCPG+44                                                00814000
DATCPGIM DC    AL4(1+1-1)                                               00815000
DATCPGIL DC    F'1'                                                     00816000
DATCPGF  DC    X'80000000'                                              00817000
         ORG   DATCPGF                                                  00818000
DATCPGFA DS    BL1                                                      00819000
@NM00095 EQU   DATCPGF+0                                                00820000
         ORG   DATCPG+56                                                00821000
@NM00096 DC    X'00'                                                    00822000
         DC    XL3'0'                                                   00823000
DATCPG99 DS    0C                                                       00824000
         ORG   DATCPG+60                                                00825000
DTSGT    DS    CL34                                                     00826000
         ORG   DTSGT                                                    00827000
DTSGT0   DS    0C                                                       00828000
DTSGTY   DC    CL1'M'                                                   00829000
@NM00099 DC    X'00'                                                    00830000
DTSGTD   DC    CL31'SGTE'                                               00831000
DTSGTE   DC    CL1' '                                                   00832000
DTSGT9   DS    0C                                                       00833000
         ORG   DTSGT+34                                                 00834000
ALPHASEQ DC    CL26'ABCDEFGHIJKLMNOPQRSTUVWXYZ'                         00835000
@DATD    DSECT                                                          00836000
         SPACE 2                                                        00837000
*********************************************************************** 00838000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00839000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 00840000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 00841000
*********************************************************************** 00842000
         SPACE                                                          00843000
BLSRRACV CSECT                                                          00844000
         ORG                                                            00845000
         DS    0D                                                       00846000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSRRACV+19)/20+7)/8)CL8'BLSRRACV'     00847000
@DATD    DSECT                                                          00848000
         DS    0H                                                       00849000
@DATD    DSECT                                                          00850000
         SPACE 2                                                        00851000
*********************************************************************** 00852000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 00853000
*********************************************************************** 00854000
         SPACE                                                          00855000
         DS    0D                                                       00856000
@DATD    DSECT                                                          00857000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00858000
@ENDDATD EQU   *                                                        00859000
BLSRRACV CSECT                                                          00860000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00861000
@01      EQU   01                                                       00862000
@02      EQU   02                                                       00863000
@03      EQU   03                                                       00864000
@04      EQU   04                                                       00865000
@05      EQU   05                                                       00866000
@06      EQU   06                                                       00867000
@07      EQU   07                                                       00868000
@08      EQU   08                                                       00869000
@09      EQU   09                                                       00870000
@10      EQU   10                                                       00871000
@11      EQU   11                                                       00872000
@12      EQU   12                                                       00873000
@13      EQU   13                                                       00874000
@14      EQU   14                                                       00875000
@15      EQU   15                                                       00876000
VBNTIM16 EQU   @06                                                      00877000
SEGNUM   EQU   @04                                                      00878000
RETC     EQU   @07                                                      00879000
RBNTIM16 EQU   @04                                                      00880000
REQPAGEP EQU   @05                                                      00881000
P2       EQU   @04                                                      00882000
P1       EQU   @05                                                      00883000
RABAPTR  EQU   @03                                                      00884000
PTEPTR   EQU   @06                                                      00885000
PFTEPTR  EQU   @04                                                      00886000
R9       EQU   @09                                                      00887000
R0       EQU   @00                                                      00888000
R1       EQU   @01                                                      00889000
R2       EQU   @02                                                      00890000
R3       EQU   @03                                                      00891000
R4       EQU   @04                                                      00892000
R5       EQU   @05                                                      00893000
RB       EQU   @11                                                      00894000
RD       EQU   @13                                                      00895000
RE       EQU   @14                                                      00896000
RF       EQU   @15                                                      00897000
RA       EQU   @10                                                      00898000
RC       EQU   @12                                                      00899000
R6       EQU   @06                                                      00900000
R7       EQU   @07                                                      00901000
R8       EQU   @08                                                      00902000
ZZ1      EQU   0                                                        00903000
ZZ1ATTN  EQU   ZZ1+360                                                  00904000
ZZ1EVE   EQU   ZZ1ATTN+4                                                00905000
ZZ1F     EQU   ZZ1+368                                                  00906000
ZZ1N     EQU   ZZ1+1116                                                 00907000
ZZ2      EQU   0                                                        00908000
ZZ2AMD   EQU   ZZ2                                                      00909000
@NM00019 EQU   ZZ2AMD+7                                                 00910000
ZZ2PRT   EQU   ZZ2+138                                                  00911000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 00912000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                00913000
ZZ2A     EQU   ZZ2+272                                                  00914000
ZZ2AF    EQU   ZZ2A+16                                                  00915000
ZZ2APID  EQU   ZZ2A+64                                                  00916000
ZZ2AD    EQU   ZZ2A+74                                                  00917000
ZZ2ADD   EQU   ZZ2AD                                                    00918000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 00919000
ZZ2ADM   EQU   ZZ2AD+46                                                 00920000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 00921000
ZZ2ADP   EQU   ZZ2AD+56                                                 00922000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 00923000
ZZ2AZZ6P EQU   ZZ2A+140                                                 00924000
ZZ2AQAS  EQU   ZZ2A+144                                                 00925000
ZZ2AQD   EQU   ZZ2A+160                                                 00926000
ZZ2AQDT  EQU   ZZ2AQD+10                                                00927000
ZZ2AQDF  EQU   ZZ2AQD+52                                                00928000
ZZ2STG   EQU   ZZ2+960                                                  00929000
ZZ2ALLOP EQU   ZZ2+992                                                  00930000
ZZ2FREEP EQU   ZZ2+996                                                  00931000
ZZ2FF19P EQU   ZZ2+1000                                                 00932000
ZZ2FRE1P EQU   ZZ2+1004                                                 00933000
ZZ2FF18P EQU   ZZ2+1008                                                 00934000
ZZ2DYNAP EQU   ZZ2+1012                                                 00935000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 00936000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 00937000
ZZ2STAIP EQU   ZZ2+1024                                                 00938000
ZZ2FF02P EQU   ZZ2+1028                                                 00939000
ZZ2GETLP EQU   ZZ2+1032                                                 00940000
ZZ2PARSP EQU   ZZ2+1036                                                 00941000
ZZ2PTGTP EQU   ZZ2+1040                                                 00942000
ZZ2PUTLP EQU   ZZ2+1044                                                 00943000
ZZ2SCANP EQU   ZZ2+1048                                                 00944000
ZZ2STCKP EQU   ZZ2+1052                                                 00945000
ZZ2TRMOP EQU   ZZ2+1064                                                 00946000
ZZ2TRMVP EQU   ZZ2+1068                                                 00947000
ZZ2PUTNP EQU   ZZ2+1084                                                 00948000
ZZ2TRMNP EQU   ZZ2+1088                                                 00949000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 00950000
ZZ2BVTP  EQU   ZZ2+1280                                                 00951000
ZZ2RVTP  EQU   ZZ2+1284                                                 00952000
ZZ2CPPL  EQU   ZZ2+1292                                                 00953000
ZZ2CPPLC EQU   ZZ2CPPL                                                  00954000
ZZ2RASYP EQU   ZZ2+1336                                                 00955000
ZZ2ITR   EQU   ZZ2+2840                                                 00956000
ZZ2ITRE  EQU   ZZ2ITR+16                                                00957000
ZZ2ITSE  EQU   ZZ2+2864                                                 00958000
ZZ2ES    EQU   ZZ2+2872                                                 00959000
ZZ2AMDX  EQU   ZZ2+7160                                                 00960000
ZZ2AXO   EQU   ZZ2+7934                                                 00961000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 00962000
CMD      EQU   0                                                        00963000
CMDT     EQU   CMD+4                                                    00964000
PSCB     EQU   0                                                        00965000
PSCBATR1 EQU   PSCB+16                                                  00966000
ECT      EQU   0                                                        00967000
ECTSWS   EQU   ECT+28                                                   00968000
ECTSWS2  EQU   ECT+40                                                   00969000
ECTSWS21 EQU   ECTSWS2                                                  00970000
UPT      EQU   0                                                        00971000
UPTSWS   EQU   UPT+12                                                   00972000
SA       EQU   0                                                        00973000
SA1      EQU   SA                                                       00974000
SAR      EQU   SA+12                                                    00975000
SAR1     EQU   SAR+12                                                   00976000
BVT      EQU   0                                                        00977000
BVTPUTLP EQU   BVT+4                                                    00978000
BVTPUTOP EQU   BVT+12                                                   00979000
BVTPUTTP EQU   BVT+16                                                   00980000
BVTPUTVP EQU   BVT+20                                                   00981000
BVTPUTAP EQU   BVT+24                                                   00982000
BVTPRTTP EQU   BVT+28                                                   00983000
BVTPRTAP EQU   BVT+32                                                   00984000
BVTPUTDP EQU   BVT+36                                                   00985000
BVTMONP  EQU   BVT+40                                                   00986000
BVTMON2P EQU   BVT+44                                                   00987000
BVTVSARP EQU   BVT+48                                                   00988000
BVTVSENP EQU   BVT+64                                                   00989000
BVTVSERP EQU   BVT+68                                                   00990000
BVTVSGEP EQU   BVT+72                                                   00991000
BVTVSGUP EQU   BVT+76                                                   00992000
BVTVSPOP EQU   BVT+80                                                   00993000
BVTVSPUP EQU   BVT+84                                                   00994000
BVTMPKNP EQU   BVT+104                                                  00995000
BVTMONLP EQU   BVT+108                                                  00996000
BVTPUTCP EQU   BVT+132                                                  00997000
BVTMPK1P EQU   BVT+136                                                  00998000
BVTZZ2RP EQU   BVT+140                                                  00999000
BVTPGMRP EQU   BVT+144                                                  01000000
BVTMONAP EQU   BVT+148                                                  01001000
BVTBLDDP EQU   BVT+152                                                  01002000
BVTBLDLP EQU   BVT+156                                                  01003000
BVTPGMCP EQU   BVT+160                                                  01004000
BVTPGMDP EQU   BVT+164                                                  01005000
BVTPGMLP EQU   BVT+168                                                  01006000
BVTMONCP EQU   BVT+180                                                  01007000
BVTMONDP EQU   BVT+184                                                  01008000
BVTMONTP EQU   BVT+188                                                  01009000
BVTPARIP EQU   BVT+192                                                  01010000
BVTPARUP EQU   BVT+196                                                  01011000
BVTPRTNP EQU   BVT+204                                                  01012000
BVTVSCRP EQU   BVT+208                                                  01013000
BVTVSMRP EQU   BVT+212                                                  01014000
BVTMONXP EQU   BVT+216                                                  01015000
BVTTRMAP EQU   BVT+228                                                  01016000
ZZ6      EQU   0                                                        01017000
ZZ6D     EQU   ZZ6+128                                                  01018000
ZZ6DD    EQU   ZZ6D+8                                                   01019000
ZZ6DDT   EQU   ZZ6DD+4                                                  01020000
ZZ6DQA   EQU   ZZ6D+68                                                  01021000
ZZ6DQA2  EQU   ZZ6DQA+8                                                 01022000
ZZ6DF    EQU   ZZ6D+92                                                  01023000
ZZ6DFAB  EQU   ZZ6DF                                                    01024000
ZZ6DPRP  EQU   ZZ6D+108                                                 01025000
ZZ6DCAP  EQU   ZZ6D+112                                                 01026000
ZZ6B     EQU   ZZ6+768                                                  01027000
BLSRACCQ EQU   0                                                        01028000
BLSRESGU EQU   0                                                        01029000
BLSRRAAR EQU   0                                                        01030000
BLSRRAGE EQU   0                                                        01031000
RVT      EQU   0                                                        01032000
RVTADDRP EQU   RVT                                                      01033000
RVTT01P  EQU   RVT+4                                                    01034000
RVTTAP   EQU   RVT+8                                                    01035000
RVTTBP   EQU   RVT+12                                                   01036000
RVTTCP   EQU   RVT+16                                                   01037000
RVTTFP   EQU   RVT+24                                                   01038000
RVTTYP   EQU   RVT+40                                                   01039000
RVTT02P  EQU   RVT+48                                                   01040000
RVTT03P  EQU   RVT+52                                                   01041000
RVTT04P  EQU   RVT+56                                                   01042000
RVTACCLP EQU   RVT+60                                                   01043000
RVTRACCP EQU   RVT+64                                                   01044000
RVTTLP   EQU   RVT+68                                                   01045000
RVTTMP   EQU   RVT+72                                                   01046000
RVTTUP   EQU   RVT+80                                                   01047000
RVTESGEP EQU   RVT+84                                                   01048000
RVTESGUP EQU   RVT+88                                                   01049000
RVTESARP EQU   RVT+92                                                   01050000
RVTRAARP EQU   RVT+96                                                   01051000
RVTRAGEP EQU   RVT+100                                                  01052000
RVTADDPP EQU   RVT+104                                                  01053000
RVTACCQP EQU   RVT+108                                                  01054000
RVTSAGUP EQU   RVT+124                                                  01055000
RVTSAGEP EQU   RVT+128                                                  01056000
RVTESCKP EQU   RVT+132                                                  01057000
RVTMSGAP EQU   RVT+136                                                  01058000
RVTMSGDP EQU   RVT+140                                                  01059000
RVTADDTP EQU   RVT+160                                                  01060000
RVTADDUP EQU   RVT+164                                                  01061000
RVTADD1P EQU   RVT+176                                                  01062000
RVTADD2P EQU   RVT+180                                                  01063000
RVTRSAGP EQU   RVT+184                                                  01064000
RVTMSGBP EQU   RVT+188                                                  01065000
RVTADDSP EQU   RVT+192                                                  01066000
RVTADD3P EQU   RVT+196                                                  01067000
RVTT05P  EQU   RVT+200                                                  01068000
RVTPADSP EQU   RVT+204                                                  01069000
RVTTRP   EQU   RVT+228                                                  01070000
RVTADD4P EQU   RVT+232                                                  01071000
RVTSAPCP EQU   RVT+236                                                  01072000
RVTSAARP EQU   RVT+240                                                  01073000
RVTSAGNP EQU   RVT+244                                                  01074000
RVTT06P  EQU   RVT+248                                                  01075000
RVTSAGCP EQU   RVT+252                                                  01076000
RVTSAGQP EQU   RVT+256                                                  01077000
RVTESGCP EQU   RVT+260                                                  01078000
RVTESGQP EQU   RVT+264                                                  01079000
RVTDUCKP EQU   RVT+276                                                  01080000
RVTDUCCP EQU   RVT+280                                                  01081000
PFTE     EQU   0                                                        01082000
PFTPGID  EQU   PFTE                                                     01083000
PFTASID  EQU   PFTPGID                                                  01084000
PFTVBN   EQU   PFTPGID+2                                                01085000
PFTQPTRS EQU   PFTE+4                                                   01086000
PFTFLAGS EQU   PFTE+12                                                  01087000
PFTFLAG1 EQU   PFTFLAGS                                                 01088000
PFTFLAG2 EQU   PFTFLAGS+1                                               01089000
PFTIRRG  EQU   PFTFLAG2                                                 01090000
PGTPTE   EQU   0                                                        01091000
PGTRSA   EQU   PGTPTE                                                   01092000
PGTBITS  EQU   PGTRSA+1                                                 01093000
PGTPVM   EQU   PGTBITS                                                  01094000
PGTPAM   EQU   PGTBITS                                                  01095000
RABA     EQU   0                                                        01096000
RABAAS   EQU   RABA+12                                                  01097000
RABAAST  EQU   RABAAS                                                   01098000
RABAAS2  EQU   RABAAS+8                                                 01099000
RABAFAD  EQU   RABA+28                                                  01100000
RABAUSE  EQU   RABA+50                                                  01101000
RABAR    EQU   RABA+52                                                  01102000
RABARIA  EQU   RABAR                                                    01103000
RABARLE  EQU   RABAR+4                                                  01104000
RABARNM  EQU   RABAR+8                                                  01105000
RABARF   EQU   RABAR+10                                                 01106000
RABARFU  EQU   RABARF                                                   01107000
RABARFR  EQU   RABARF                                                   01108000
RABARDA  EQU   RABAR+12                                                 01109000
RABAROF  EQU   RABAR+16                                                 01110000
RACO     EQU   0                                                        01111000
RACOAS   EQU   RACO+12                                                  01112000
RACOR    EQU   RACO+52                                                  01113000
RACORF   EQU   RACOR+10                                                 01114000
BLSRACC  EQU   0                                                        01115000
BLSRACCL EQU   0                                                        01116000
BLSRADDP EQU   0                                                        01117000
BLSRADDR EQU   0                                                        01118000
BLSRADDS EQU   0                                                        01119000
BLSRADDT EQU   0                                                        01120000
BLSRADDU EQU   0                                                        01121000
BLSRADD1 EQU   0                                                        01122000
BLSRADD2 EQU   0                                                        01123000
BLSRADD3 EQU   0                                                        01124000
BLSRADD4 EQU   0                                                        01125000
BLSRDUCC EQU   0                                                        01126000
BLSRDUCK EQU   0                                                        01127000
BLSRESAR EQU   0                                                        01128000
BLSRESCK EQU   0                                                        01129000
BLSRESGC EQU   0                                                        01130000
BLSRESGE EQU   0                                                        01131000
BLSRESGQ EQU   0                                                        01132000
BLSRMSGA EQU   0                                                        01133000
BLSRMSGB EQU   0                                                        01134000
BLSRMSGD EQU   0                                                        01135000
BLSRPADS EQU   0                                                        01136000
BLSRSAAR EQU   0                                                        01137000
BLSRSAG  EQU   0                                                        01138000
BLSRSAGC EQU   0                                                        01139000
BLSRSAGE EQU   0                                                        01140000
BLSRSAGN EQU   0                                                        01141000
BLSRSAGQ EQU   0                                                        01142000
BLSRSAGU EQU   0                                                        01143000
BLSRSAPC EQU   0                                                        01144000
BLSTA    EQU   0                                                        01145000
BLSTB    EQU   0                                                        01146000
BLSTC    EQU   0                                                        01147000
BLSTF    EQU   0                                                        01148000
BLSTL    EQU   0                                                        01149000
BLSTM    EQU   0                                                        01150000
BLSTR    EQU   0                                                        01151000
BLSTU    EQU   0                                                        01152000
BLSTY    EQU   0                                                        01153000
BLST01   EQU   0                                                        01154000
BLST02   EQU   0                                                        01155000
BLST03   EQU   0                                                        01156000
BLST04   EQU   0                                                        01157000
BLST05   EQU   0                                                        01158000
BLST06   EQU   0                                                        01159000
BLSUALLO EQU   0                                                        01160000
BLSUBLDD EQU   0                                                        01161000
BLSUBLDL EQU   0                                                        01162000
BLSUDYNA EQU   0                                                        01163000
BLSUFREE EQU   0                                                        01164000
BLSUFRE1 EQU   0                                                        01165000
BLSUMON  EQU   0                                                        01166000
BLSUMONA EQU   0                                                        01167000
BLSUMONC EQU   0                                                        01168000
BLSUMOND EQU   0                                                        01169000
BLSUMONL EQU   0                                                        01170000
BLSUMONT EQU   0                                                        01171000
BLSUMONX EQU   0                                                        01172000
BLSUMON2 EQU   0                                                        01173000
BLSUMPKN EQU   0                                                        01174000
BLSUMPK1 EQU   0                                                        01175000
BLSUPARI EQU   0                                                        01176000
BLSUPARU EQU   0                                                        01177000
BLSUPGMC EQU   0                                                        01178000
BLSUPGMD EQU   0                                                        01179000
BLSUPGML EQU   0                                                        01180000
BLSUPGMR EQU   0                                                        01181000
BLSUPRTA EQU   0                                                        01182000
BLSUPRTN EQU   0                                                        01183000
BLSUPRTT EQU   0                                                        01184000
BLSUPUTA EQU   0                                                        01185000
BLSUPUTC EQU   0                                                        01186000
BLSUPUTD EQU   0                                                        01187000
BLSUPUTL EQU   0                                                        01188000
BLSUPUTN EQU   0                                                        01189000
BLSUPUTO EQU   0                                                        01190000
BLSUPUTT EQU   0                                                        01191000
BLSUPUTV EQU   0                                                        01192000
BLSUSTAI EQU   0                                                        01193000
BLSUTRMA EQU   0                                                        01194000
BLSUTRMN EQU   0                                                        01195000
BLSUTRMO EQU   0                                                        01196000
BLSUTRMV EQU   0                                                        01197000
BLSUVSAR EQU   0                                                        01198000
BLSUVSCR EQU   0                                                        01199000
BLSUVSEN EQU   0                                                        01200000
BLSUVSER EQU   0                                                        01201000
BLSUVSGE EQU   0                                                        01202000
BLSUVSGU EQU   0                                                        01203000
BLSUVSMR EQU   0                                                        01204000
BLSUVSPO EQU   0                                                        01205000
BLSUVSPU EQU   0                                                        01206000
BLSUZZ2C EQU   0                                                        01207000
BLSUZZ2D EQU   0                                                        01208000
BLSUZZ2R EQU   0                                                        01209000
IKJEFF02 EQU   0                                                        01210000
IKJEFF18 EQU   0                                                        01211000
IKJEFF19 EQU   0                                                        01212000
IKJGETL  EQU   0                                                        01213000
IKJPARS  EQU   0                                                        01214000
IKJPTGT  EQU   0                                                        01215000
IKJPUTL  EQU   0                                                        01216000
IKJSCAN  EQU   0                                                        01217000
IKJSTCK  EQU   0                                                        01218000
I001C    EQU   0                                                        01219000
I008P    EQU   0                                                        01220000
I015F    EQU   0                                                        01221000
I015P    EQU   0                                                        01222000
I031F    EQU   0                                                        01223000
I031P    EQU   0                                                        01224000
I256C    EQU   0                                                        01225000
PGTEND   EQU   0                                                        01226000
PZ2      EQU   0                                                        01227000
RAPA     EQU   0                                                        01228000
RAPAAS   EQU   RAPA+12                                                  01229000
RAPAR    EQU   RAPA+52                                                  01230000
RAPARF   EQU   RAPAR+10                                                 01231000
CPPL     EQU   ZZ2CPPL                                                  01232000
CPPLUPT  EQU   CPPL+4                                                   01233000
CPPLPSCB EQU   CPPL+8                                                   01234000
CPPLECT  EQU   CPPL+12                                                  01235000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01236000
CPPLCBUF EQU   CPPL                                                     01237000
RAPA999  EQU   RAPA+3060                                                01238000
@NM00006 EQU   RAPAR+20                                                 01239000
RAPAROF  EQU   RAPAR+16                                                 01240000
RAPARDA  EQU   RAPAR+12                                                 01241000
@NM00005 EQU   RAPARF                                                   01242000
RAPARFR  EQU   RAPARF                                                   01243000
RAPARFP  EQU   RAPARF                                                   01244000
RAPARFU  EQU   RAPARF                                                   01245000
RAPARNM  EQU   RAPAR+8                                                  01246000
RAPARLE  EQU   RAPAR+4                                                  01247000
RAPARIA  EQU   RAPAR                                                    01248000
RAPAUSE  EQU   RAPA+50                                                  01249000
RAPADIM  EQU   RAPA+48                                                  01250000
@NM00004 EQU   RAPA+32                                                  01251000
RAPAELK  EQU   RAPA+32                                                  01252000
RAPAFAD  EQU   RAPA+28                                                  01253000
RAPAAS9  EQU   RAPAAS+16                                                01254000
@NM00003 EQU   RAPAAS+12                                                01255000
RAPAAS2  EQU   RAPAAS+8                                                 01256000
RAPAAS1  EQU   RAPAAS+4                                                 01257000
@NM00002 EQU   RAPAAS+2                                                 01258000
RAPAAST  EQU   RAPAAS                                                   01259000
RAPAAS0  EQU   RAPAAS                                                   01260000
RAPARDX  EQU   RAPA+8                                                   01261000
@NM00001 EQU   RAPA+2                                                   01262000
RAPARID  EQU   RAPA                                                     01263000
RACO999  EQU   RACO+148                                                 01264000
@NM00123 EQU   RACOR+20                                                 01265000
RACOROF  EQU   RACOR+16                                                 01266000
RACORDA  EQU   RACOR+12                                                 01267000
@NM00122 EQU   RACORF                                                   01268000
RACORFR  EQU   RACORF                                                   01269000
RACORFP  EQU   RACORF                                                   01270000
RACORFU  EQU   RACORF                                                   01271000
RACORNM  EQU   RACOR+8                                                  01272000
RACORLE  EQU   RACOR+4                                                  01273000
RACORIA  EQU   RACOR                                                    01274000
RACOUSE  EQU   RACO+50                                                  01275000
RACODIM  EQU   RACO+48                                                  01276000
@NM00121 EQU   RACO+32                                                  01277000
RACOELK  EQU   RACO+32                                                  01278000
RACOFAD  EQU   RACO+28                                                  01279000
RACOAS9  EQU   RACOAS+16                                                01280000
@NM00120 EQU   RACOAS+12                                                01281000
RACOAS2  EQU   RACOAS+8                                                 01282000
RACOAS1  EQU   RACOAS+4                                                 01283000
@NM00119 EQU   RACOAS+2                                                 01284000
RACOAST  EQU   RACOAS                                                   01285000
RACOAS0  EQU   RACOAS                                                   01286000
RACORDX  EQU   RACO+8                                                   01287000
@NM00118 EQU   RACO+2                                                   01288000
RACORID  EQU   RACO                                                     01289000
RABA999  EQU   RABA+148                                                 01290000
@NM00117 EQU   RABAR+20                                                 01291000
@NM00116 EQU   RABARF                                                   01292000
RABARFP  EQU   RABARF                                                   01293000
RABADIM  EQU   RABA+48                                                  01294000
@NM00115 EQU   RABA+32                                                  01295000
RABAELK  EQU   RABA+32                                                  01296000
RABAAS9  EQU   RABAAS+16                                                01297000
@NM00114 EQU   RABAAS+12                                                01298000
RABAAS1  EQU   RABAAS+4                                                 01299000
@NM00113 EQU   RABAAS+2                                                 01300000
RABAAS0  EQU   RABAAS                                                   01301000
RABARDX  EQU   RABA+8                                                   01302000
@NM00112 EQU   RABA+2                                                   01303000
RABARID  EQU   RABA                                                     01304000
@NM00090 EQU   PGTBITS                                                  01305000
@NM00089 EQU   PGTBITS                                                  01306000
@NM00088 EQU   PGTBITS                                                  01307000
@NM00087 EQU   PGTBITS                                                  01308000
@NM00086 EQU   PGTBITS                                                  01309000
@NM00085 EQU   PGTBITS                                                  01310000
PGTREAL  EQU   PGTRSA                                                   01311000
PFTUIC   EQU   PFTE+15                                                  01312000
PFTQNDX  EQU   PFTE+14                                                  01313000
@NM00084 EQU   PFTFLAG2                                                 01314000
@NM00083 EQU   PFTFLAG2                                                 01315000
PFTPREF  EQU   PFTFLAG2                                                 01316000
PFTSTEAL EQU   PFTFLAG2                                                 01317000
PFTVR    EQU   PFTFLAG2                                                 01318000
PFTOFFLN EQU   PFTFLAG2                                                 01319000
PFTDFRLS EQU   PFTFLAG2                                                 01320000
PFTOFINT EQU   PFTFLAG1                                                 01321000
PFTVRALC EQU   PFTFLAG1                                                 01322000
PFTBADPG EQU   PFTFLAG1                                                 01323000
PFTPCBSI EQU   PFTFLAG1                                                 01324000
PFTLNGFX EQU   PFTFLAG1                                                 01325000
PFTLSQA  EQU   PFTFLAG1                                                 01326000
PFTVRINT EQU   PFTFLAG1                                                 01327000
PFTONAVQ EQU   PFTFLAG1                                                 01328000
PFTRSV1  EQU   PFTE+10                                                  01329000
PFTFXCT  EQU   PFTE+8                                                   01330000
PFTBQPTR EQU   PFTQPTRS+2                                               01331000
PFTFQPTR EQU   PFTQPTRS                                                 01332000
RVT99999 EQU   RVT+384                                                  01333000
RVT0096P EQU   RVT+380                                                  01334000
RVT0095P EQU   RVT+376                                                  01335000
RVT0094P EQU   RVT+372                                                  01336000
RVT0093P EQU   RVT+368                                                  01337000
RVT0092P EQU   RVT+364                                                  01338000
RVT0091P EQU   RVT+360                                                  01339000
RVT0090P EQU   RVT+356                                                  01340000
RVT0089P EQU   RVT+352                                                  01341000
RVT0088P EQU   RVT+348                                                  01342000
RVT0087P EQU   RVT+344                                                  01343000
RVT0086P EQU   RVT+340                                                  01344000
RVT0085P EQU   RVT+336                                                  01345000
RVT0084P EQU   RVT+332                                                  01346000
RVT0083P EQU   RVT+328                                                  01347000
RVT0082P EQU   RVT+324                                                  01348000
RVT0081P EQU   RVT+320                                                  01349000
RVT0080P EQU   RVT+316                                                  01350000
RVT0079P EQU   RVT+312                                                  01351000
RVT0078P EQU   RVT+308                                                  01352000
RVT0077P EQU   RVT+304                                                  01353000
RVT0076P EQU   RVT+300                                                  01354000
RVT0075P EQU   RVT+296                                                  01355000
RVT0074P EQU   RVT+292                                                  01356000
RVT0073P EQU   RVT+288                                                  01357000
RVT0072P EQU   RVT+284                                                  01358000
RVTDTUTP EQU   RVT+272                                                  01359000
RVTDTMTP EQU   RVT+268                                                  01360000
RVT0057P EQU   RVT+224                                                  01361000
RVT0056P EQU   RVT+220                                                  01362000
RVT0055P EQU   RVT+216                                                  01363000
RVT0054P EQU   RVT+212                                                  01364000
RVT0053P EQU   RVT+208                                                  01365000
RVT0044P EQU   RVT+172                                                  01366000
RVT0043P EQU   RVT+168                                                  01367000
RVT0040P EQU   RVT+156                                                  01368000
RVT0039P EQU   RVT+152                                                  01369000
RVT0038P EQU   RVT+148                                                  01370000
RVT0037P EQU   RVT+144                                                  01371000
RVT0031P EQU   RVT+120                                                  01372000
RVT0030P EQU   RVT+116                                                  01373000
RVT0029P EQU   RVT+112                                                  01374000
RVT0020P EQU   RVT+76                                                   01375000
RVT0012P EQU   RVT+44                                                   01376000
RVT0010P EQU   RVT+36                                                   01377000
RVT0009P EQU   RVT+32                                                   01378000
RVT0008P EQU   RVT+28                                                   01379000
RVT0006P EQU   RVT+20                                                   01380000
ZZ69999  EQU   ZZ6+1792                                                 01381000
ZZ6BRB   EQU   ZZ6B+12                                                  01382000
ZZ6BRC   EQU   ZZ6B+8                                                   01383000
@NM00082 EQU   ZZ6B+6                                                   01384000
ZZ6BFL   EQU   ZZ6B+4                                                   01385000
ZZ6BDA   EQU   ZZ6B                                                     01386000
@NM00081 EQU   ZZ6+540                                                  01387000
ZZ6BUFI  EQU   ZZ6+536                                                  01388000
ZZ6BUFP  EQU   ZZ6+532                                                  01389000
ZZ6FILE  EQU   ZZ6+524                                                  01390000
ZZ6BUFB  EQU   ZZ6+520                                                  01391000
ZZ6BUFL  EQU   ZZ6+518                                                  01392000
ZZ6BUFN  EQU   ZZ6+516                                                  01393000
ZZ6ZZ6P  EQU   ZZ6+512                                                  01394000
@NM00080 EQU   ZZ6+256                                                  01395000
ZZ6D999  EQU   ZZ6D+128                                                 01396000
@NM00079 EQU   ZZ6D+116                                                 01397000
ZZ6DDA2  EQU   ZZ6D+104                                                 01398000
ZZ6DDA1  EQU   ZZ6D+100                                                 01399000
@NM00078 EQU   ZZ6DF                                                    01400000
ZZ6DFSU  EQU   ZZ6DF                                                    01401000
ZZ6DFST  EQU   ZZ6DF                                                    01402000
ZZ6DFMP  EQU   ZZ6DF                                                    01403000
ZZ6DFDU  EQU   ZZ6DF                                                    01404000
ZZ6DFBS  EQU   ZZ6DF                                                    01405000
ZZ6DQ2   EQU   ZZ6D+88                                                  01406000
ZZ6DQ1   EQU   ZZ6D+84                                                  01407000
ZZ6DQA9  EQU   ZZ6DQA+16                                                01408000
@NM00077 EQU   ZZ6DQA+12                                                01409000
ZZ6DQA1  EQU   ZZ6DQA+4                                                 01410000
@NM00076 EQU   ZZ6DQA+2                                                 01411000
ZZ6DQAT  EQU   ZZ6DQA                                                   01412000
ZZ6DQA0  EQU   ZZ6DQA                                                   01413000
ZZ6DRDX  EQU   ZZ6D+64                                                  01414000
ZZ6DELK  EQU   ZZ6D+64                                                  01415000
ZZ6DMEM  EQU   ZZ6D+56                                                  01416000
ZZ6DDT1  EQU   ZZ6DDT                                                   01417000
ZZ6DDO   EQU   ZZ6DD+2                                                  01418000
ZZ6DDL   EQU   ZZ6DD                                                    01419000
@NM00075 EQU   ZZ6D+2                                                   01420000
ZZ6DRID  EQU   ZZ6D                                                     01421000
ZZ6RDCB  EQU   ZZ6                                                      01422000
ZZ60000  EQU   ZZ6                                                      01423000
BVT99999 EQU   BVT+256                                                  01424000
BVT0064P EQU   BVT+252                                                  01425000
BVT0063P EQU   BVT+248                                                  01426000
BVT0062P EQU   BVT+244                                                  01427000
BVT0061P EQU   BVT+240                                                  01428000
BVT0060P EQU   BVT+236                                                  01429000
BVT0059P EQU   BVT+232                                                  01430000
BVT0057P EQU   BVT+224                                                  01431000
BVT0056P EQU   BVT+220                                                  01432000
BVTSTBLP EQU   BVT+200                                                  01433000
BVT0045P EQU   BVT+176                                                  01434000
BVT0044P EQU   BVT+172                                                  01435000
BVT0033P EQU   BVT+128                                                  01436000
BVT0032P EQU   BVT+124                                                  01437000
BVT0031P EQU   BVT+120                                                  01438000
BVT0030P EQU   BVT+116                                                  01439000
BVT0029P EQU   BVT+112                                                  01440000
BVT0026P EQU   BVT+100                                                  01441000
BVT0025P EQU   BVT+96                                                   01442000
BVT0024P EQU   BVT+92                                                   01443000
BVT0023P EQU   BVT+88                                                   01444000
BVT0016P EQU   BVT+60                                                   01445000
BVT0015P EQU   BVT+56                                                   01446000
BVT0014P EQU   BVT+52                                                   01447000
BVT0003P EQU   BVT+8                                                    01448000
BVT0001P EQU   BVT                                                      01449000
SA99     EQU   SA+72                                                    01450000
SARC     EQU   SAR+56                                                   01451000
SARB     EQU   SAR+52                                                   01452000
SARA     EQU   SAR+48                                                   01453000
SAR9     EQU   SAR+44                                                   01454000
SAR8     EQU   SAR+40                                                   01455000
SAR7     EQU   SAR+36                                                   01456000
SAR6     EQU   SAR+32                                                   01457000
SAR5     EQU   SAR+28                                                   01458000
SAR4     EQU   SAR+24                                                   01459000
SAR3     EQU   SAR+20                                                   01460000
SAR2     EQU   SAR+16                                                   01461000
SAR0     EQU   SAR+8                                                    01462000
SARF     EQU   SAR+4                                                    01463000
SARE     EQU   SAR                                                      01464000
SAFWD    EQU   SA+8                                                     01465000
SABAK    EQU   SA+4                                                     01466000
SA1L     EQU   SA1+1                                                    01467000
SA1P     EQU   SA1                                                      01468000
UPTPREFL EQU   UPT+23                                                   01469000
UPTPREFX EQU   UPT+16                                                   01470000
@NM00074 EQU   UPT+15                                                   01471000
UPTLDEL  EQU   UPT+14                                                   01472000
UPTCDEL  EQU   UPT+13                                                   01473000
UPTWTP   EQU   UPTSWS                                                   01474000
UPTMODE  EQU   UPTSWS                                                   01475000
UPTALD   EQU   UPTSWS                                                   01476000
UPTPAUS  EQU   UPTSWS                                                   01477000
UPTNCOM  EQU   UPTSWS                                                   01478000
UPTMID   EQU   UPTSWS                                                   01479000
UPTNPRM  EQU   UPTSWS                                                   01480000
UPTRCVR  EQU   UPTSWS                                                   01481000
UPTUSER  EQU   UPT+2                                                    01482000
@NM00073 EQU   UPT                                                      01483000
@NM00072 EQU   ECT+52                                                   01484000
@NM00071 EQU   ECT+48                                                   01485000
@NM00070 EQU   ECT+44                                                   01486000
@NM00069 EQU   ECTSWS2+1                                                01487000
@NM00068 EQU   ECTSWS21                                                 01488000
ECTTABND EQU   ECTSWS21                                                 01489000
ECTDEFCS EQU   ECTSWS21                                                 01490000
ECTBKPB  EQU   ECT+36                                                   01491000
ECTUSER  EQU   ECT+32                                                   01492000
ECTDDNUM EQU   ECT+29                                                   01493000
ECTATTN  EQU   ECTSWS                                                   01494000
ECTBKGRD EQU   ECTSWS                                                   01495000
ECTNNOT  EQU   ECTSWS                                                   01496000
ECTNMAL  EQU   ECTSWS                                                   01497000
ECTLOGF  EQU   ECTSWS                                                   01498000
ECTATRM  EQU   ECTSWS                                                   01499000
@NM00067 EQU   ECTSWS                                                   01500000
ECTNOPD  EQU   ECTSWS                                                   01501000
ECTSCMD  EQU   ECT+20                                                   01502000
ECTPCMD  EQU   ECT+12                                                   01503000
ECTSMSG  EQU   ECT+9                                                    01504000
ECTMSGF  EQU   ECT+8                                                    01505000
ECTIOWA  EQU   ECT+4                                                    01506000
ECTRTCD  EQU   ECT+1                                                    01507000
ECTRCDF  EQU   ECT                                                      01508000
PSCBU    EQU   PSCB+64                                                  01509000
PSCBRSZ  EQU   PSCB+60                                                  01510000
PSCBLINE EQU   PSCB+59                                                  01511000
PSCBCHAR EQU   PSCB+58                                                  01512000
PSCBUPTL EQU   PSCB+56                                                  01513000
PSCBUPT  EQU   PSCB+52                                                  01514000
PSCBRLGB EQU   PSCB+48                                                  01515000
PSCBDEST EQU   PSCB+40                                                  01516000
@NM00066 EQU   PSCB+36                                                  01517000
@NM00065 EQU   PSCB+32                                                  01518000
@NM00064 EQU   PSCB+28                                                  01519000
PSCBLTI2 EQU   PSCB+24                                                  01520000
PSCBLTIM EQU   PSCB+20                                                  01521000
PSCBATR2 EQU   PSCB+18                                                  01522000
@NM00063 EQU   PSCBATR1                                                 01523000
@NM00062 EQU   PSCBATR1                                                 01524000
@NM00061 EQU   PSCBATR1                                                 01525000
PSCBATTN EQU   PSCBATR1                                                 01526000
PSCBVMNT EQU   PSCBATR1                                                 01527000
PSCBJCL  EQU   PSCBATR1                                                 01528000
PSCBACCT EQU   PSCBATR1                                                 01529000
PSCBCTRL EQU   PSCBATR1                                                 01530000
PSCBGPNM EQU   PSCB+8                                                   01531000
PSCBUSRL EQU   PSCB+7                                                   01532000
PSCBUSER EQU   PSCB                                                     01533000
CMDT1    EQU   CMDT                                                     01534000
CMDO     EQU   CMD+2                                                    01535000
CMDL     EQU   CMD                                                      01536000
ZZ299999 EQU   ZZ2+8192                                                 01537000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  01538000
ZZ2AXOL  EQU   ZZ2AXO                                                   01539000
@NM00060 EQU   ZZ2+7288                                                 01540000
@NM00059 EQU   ZZ2AMDX+4                                                01541000
ZZ2AMDXC EQU   ZZ2AMDX                                                  01542000
ZZ2HSD   EQU   ZZ2+3056                                                 01543000
@NM00058 EQU   ZZ2ES                                                    01544000
@NM00057 EQU   ZZ2+2868                                                 01545000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                01546000
@NM00056 EQU   ZZ2ITSE                                                  01547000
ZZ2ITSEP EQU   ZZ2ITSE                                                  01548000
ZZ2ITSEW EQU   ZZ2ITSE                                                  01549000
@NM00055 EQU   ZZ2ITR+20                                                01550000
ZZ2ITREC EQU   ZZ2ITRE+1                                                01551000
@NM00054 EQU   ZZ2ITRE                                                  01552000
ZZ2ITREP EQU   ZZ2ITRE                                                  01553000
ZZ2ITREW EQU   ZZ2ITRE                                                  01554000
@NM00053 EQU   ZZ2ITR+9                                                 01555000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 01556000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 01557000
ZZ2ITRPP EQU   ZZ2ITR                                                   01558000
@NM00052 EQU   ZZ2+1544                                                 01559000
ZZ2PGM   EQU   ZZ2+1536                                                 01560000
@NM00051 EQU   ZZ2+1526                                                 01561000
ZZ2CW    EQU   ZZ2+1524                                                 01562000
@NM00050 EQU   ZZ2+1504                                                 01563000
@NM00049 EQU   ZZ2+1352                                                 01564000
ZZ2FFSYP EQU   ZZ2+1348                                                 01565000
ZZ2SASYP EQU   ZZ2+1344                                                 01566000
ZZ2RDSYP EQU   ZZ2+1340                                                 01567000
ZZ2PHSYP EQU   ZZ2+1332                                                 01568000
ZZ2ESSYP EQU   ZZ2+1328                                                 01569000
ZZ200SYP EQU   ZZ2+1324                                                 01570000
ZZ2SCWP  EQU   ZZ2+1320                                                 01571000
ZZ2TTLP  EQU   ZZ2+1316                                                 01572000
ZZ2LOADP EQU   ZZ2+1312                                                 01573000
ZZ2VRESP EQU   ZZ2+1308                                                 01574000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               01575000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                01576000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                01577000
ZZ2VRSAP EQU   ZZ2+1288                                                 01578000
ZZ2DVTP  EQU   ZZ2+1276                                                 01579000
@NM00048 EQU   ZZ2+1272                                                 01580000
@NM00047 EQU   ZZ2+1268                                                 01581000
ZZ2RPLP  EQU   ZZ2+1260                                                 01582000
ZZ2TCBP  EQU   ZZ2+1256                                                 01583000
@NM00046 EQU   ZZ2+1252                                                 01584000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 01585000
@NM00045 EQU   ZZ2+1112                                                 01586000
ZZ2FPDRP EQU   ZZ2+1108                                                 01587000
ZZ2FDSDP EQU   ZZ2+1104                                                 01588000
ZZ2APDRP EQU   ZZ2+1100                                                 01589000
ZZ2ADSDP EQU   ZZ2+1096                                                 01590000
ZZ2ENQ0P EQU   ZZ2+1092                                                 01591000
@NM00044 EQU   ZZ2+1080                                                 01592000
ZZ2MSG0P EQU   ZZ2+1076                                                 01593000
ZZ2FT25P EQU   ZZ2+1072                                                 01594000
ZZ2MSGSP EQU   ZZ2+1060                                                 01595000
ZZ2ALOCP EQU   ZZ2+1056                                                 01596000
@NM00043 EQU   ZZ2+976                                                  01597000
ZZ2TOD   EQU   ZZ2+968                                                  01598000
ZZ2STGN  EQU   ZZ2STG+4                                                 01599000
ZZ2STGP  EQU   ZZ2STG                                                   01600000
@NM00042 EQU   ZZ2+952                                                  01601000
ZZ2SCMDE EQU   ZZ2+944                                                  01602000
ZZ2SCMDN EQU   ZZ2+936                                                  01603000
ZZ2IDENT EQU   ZZ2+928                                                  01604000
ZZ2A9999 EQU   ZZ2A+656                                                 01605000
@NM00041 EQU   ZZ2A+224                                                 01606000
@NM00040 EQU   ZZ2A+220                                                 01607000
ZZ2AQD99 EQU   ZZ2AQD+60                                                01608000
@NM00039 EQU   ZZ2AQD+56                                                01609000
@NM00038 EQU   ZZ2AQDF                                                  01610000
ZZ2AQDFA EQU   ZZ2AQDF                                                  01611000
ZZ2AQDIL EQU   ZZ2AQD+48                                                01612000
ZZ2AQDIM EQU   ZZ2AQD+44                                                01613000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               01614000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               01615000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                01616000
@NM00037 EQU   ZZ2AQDT+1                                                01617000
ZZ2AQDTY EQU   ZZ2AQDT                                                  01618000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  01619000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 01620000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 01621000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 01622000
ZZ2AQDOF EQU   ZZ2AQD                                                   01623000
ZZ2AQD00 EQU   ZZ2AQD                                                   01624000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               01625000
@NM00036 EQU   ZZ2AQAS+12                                               01626000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                01627000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                01628000
@NM00035 EQU   ZZ2AQAS+2                                                01629000
ZZ2AQAST EQU   ZZ2AQAS                                                  01630000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  01631000
ZZ2ADPTA EQU   ZZ2ADPT                                                  01632000
ZZ2ADPL  EQU   ZZ2ADP                                                   01633000
ZZ2ADMTA EQU   ZZ2ADMT                                                  01634000
ZZ2ADML  EQU   ZZ2ADM                                                   01635000
ZZ2ADDTA EQU   ZZ2ADDT                                                  01636000
ZZ2ADDL  EQU   ZZ2ADD                                                   01637000
@NM00034 EQU   ZZ2A+72                                                  01638000
ZZ2APIDB EQU   ZZ2APID+3                                                01639000
ZZ2APIDA EQU   ZZ2APID                                                  01640000
@NM00033 EQU   ZZ2A+24                                                  01641000
@NM00032 EQU   ZZ2AF+5                                                  01642000
ZZ2AFX   EQU   ZZ2AF+5                                                  01643000
@NM00031 EQU   ZZ2AF+3                                                  01644000
ZZ2AFS   EQU   ZZ2AF+2                                                  01645000
ZZ2AFD   EQU   ZZ2AF+2                                                  01646000
ZZ2AFQ   EQU   ZZ2AF+2                                                  01647000
ZZ2AF$   EQU   ZZ2AF+2                                                  01648000
@NM00030 EQU   ZZ2AF+2                                                  01649000
ZZ2AFM   EQU   ZZ2AF+2                                                  01650000
@NM00029 EQU   ZZ2AF+2                                                  01651000
@NM00028 EQU   ZZ2AF+1                                                  01652000
ZZ2AFV   EQU   ZZ2AF+1                                                  01653000
@NM00027 EQU   ZZ2AF+1                                                  01654000
ZZ2AFC   EQU   ZZ2AF+1                                                  01655000
@NM00026 EQU   ZZ2AF                                                    01656000
ZZ2AFFS  EQU   ZZ2AF                                                    01657000
ZZ2AFT   EQU   ZZ2AF                                                    01658000
ZZ2AFP   EQU   ZZ2AF                                                    01659000
@NM00025 EQU   ZZ2A+8                                                   01660000
ZZ2ALINE EQU   ZZ2A+4                                                   01661000
@NM00024 EQU   ZZ2A+3                                                   01662000
ZZ2ASE   EQU   ZZ2A+2                                                   01663000
ZZ2ACH   EQU   ZZ2A                                                     01664000
@NM00023 EQU   ZZ2+264                                                  01665000
@NM00022 EQU   ZZ2+263                                                  01666000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  01667000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 01668000
ZZ2PRTL  EQU   ZZ2PRT                                                   01669000
@NM00021 EQU   ZZ2AMD+56                                                01670000
ZZ2AMDXP EQU   ZZ2AMD+52                                                01671000
ZZ2AMDD  EQU   ZZ2AMD+48                                                01672000
ZZ2AMDL  EQU   ZZ2AMD+44                                                01673000
ZZ2AMDU  EQU   ZZ2AMD+28                                                01674000
ZZ2AMDF  EQU   ZZ2AMD+24                                                01675000
ZZ2AMDS  EQU   ZZ2AMD+20                                                01676000
ZZ2AMDC  EQU   ZZ2AMD+16                                                01677000
ZZ2AMDP  EQU   ZZ2AMD+12                                                01678000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 01679000
@NM00020 EQU   @NM00019                                                 01680000
ZZ2AMD2  EQU   @NM00019                                                 01681000
ZZ2AMD1  EQU   @NM00019                                                 01682000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 01683000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 01684000
ZZ2AMDT  EQU   ZZ2AMD                                                   01685000
ZZ199999 EQU   ZZ1+3072                                                 01686000
@NM00018 EQU   ZZ1+2160                                                 01687000
ZZ1TRTAS EQU   ZZ1+1904                                                 01688000
ZZ1TRUPC EQU   ZZ1+1648                                                 01689000
ZZ1TRCTX EQU   ZZ1+1392                                                 01690000
ZZ1NASID EQU   ZZ1N+274                                                 01691000
ZZ1NSTRL EQU   ZZ1N+272                                                 01692000
ZZ1NOFF  EQU   ZZ1N+268                                                 01693000
ZZ1NBDY  EQU   ZZ1N+264                                                 01694000
ZZ1NADE  EQU   ZZ1N+260                                                 01695000
ZZ1NADB  EQU   ZZ1N+256                                                 01696000
ZZ1NSTR  EQU   ZZ1N                                                     01697000
@NM00017 EQU   ZZ1+1080                                                 01698000
ZZ1TREBC EQU   ZZ1+824                                                  01699000
ZZ1TRHEX EQU   ZZ1+568                                                  01700000
@NM00016 EQU   ZZ1+377                                                  01701000
ZZ1USTAE EQU   ZZ1+376                                                  01702000
@NM00015 EQU   ZZ1F+1                                                   01703000
@NM00014 EQU   ZZ1F                                                     01704000
ZZ1FM    EQU   ZZ1F                                                     01705000
ZZ1FX    EQU   ZZ1F                                                     01706000
ZZ1FU    EQU   ZZ1F                                                     01707000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 01708000
@NM00013 EQU   ZZ1EVE                                                   01709000
ZZ1EVEP  EQU   ZZ1EVE                                                   01710000
ZZ1EVEW  EQU   ZZ1EVE                                                   01711000
ZZ1ACMP  EQU   ZZ1ATTN                                                  01712000
@NM00012 EQU   ZZ1+144                                                  01713000
ZZ1FPP   EQU   ZZ1+140                                                  01714000
ZZ1ZZ6P  EQU   ZZ1+136                                                  01715000
@NM00011 EQU   ZZ1+84                                                   01716000
ZZ1PLINE EQU   ZZ1+80                                                   01717000
ZZ1PGSZ  EQU   ZZ1+76                                                   01718000
ZZ1PCNT  EQU   ZZ1+72                                                   01719000
@NM00010 EQU   ZZ1+68                                                   01720000
ZZ1TPAGE EQU   ZZ1+64                                                   01721000
ZZ1TLINE EQU   ZZ1+60                                                   01722000
@NM00009 EQU   ZZ1+48                                                   01723000
ZZ1DSDP  EQU   ZZ1+44                                                   01724000
ZZ1PDRP  EQU   ZZ1+40                                                   01725000
ZZ1ZZ2P  EQU   ZZ1+36                                                   01726000
ZZ1327WP EQU   ZZ1+32                                                   01727000
ZZ1ACBP  EQU   ZZ1+28                                                   01728000
@NM00008 EQU   ZZ1+24                                                   01729000
ZZ1PDCBP EQU   ZZ1+20                                                   01730000
ZZ1BLRBL EQU   ZZ1+16                                                   01731000
@NM00007 EQU   ZZ1+12                                                   01732000
ZZ1PNULL EQU   ZZ1+8                                                    01733000
ZZ1NULL  EQU   ZZ1+4                                                    01734000
ZZ1IDE   EQU   ZZ1                                                      01735000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01736000
@RT00193 EQU   EXIT                                                     01737000
@ENDDATA EQU   *                                                        01738000
         END   BLSRRACV,(C'PLS1830',0701,78058)                         01739000
