DUSC     TITLE 'BLSRDUSC--SCAN SYS1.DUMP DATA SETS                     *00001000
                        '                                               00002000
*/* CHANGE ACTIVITY -------------------------------------------------*/ 00003000
*/*   THIS MODULE WAS WRITTEN FOR @G57LPGW                           */ 00004000
*/*   THIS MODULE WAS CHANGED FOR @ZA32005                   @ZA32005*/ 00005000
*/*   THIS MODULE WAS CHANGED FOR @ZA32007                   @ZA32007*/ 00006000
*/*------------------------------------------------------------------*/ 00007000
BLSRDUSC CSECT ,                                                01S0002 00008000
@MAINENT DS    0H                                               01S0002 00009000
         USING *,@15                                            01S0002 00010000
         B     @PROLOG                                          01S0002 00011000
         DC    AL1(16)                                          01S0002 00012000
         DC    C'BLSRDUSC  78.117'                              01S0002 00013000
         DROP  @15                                                      00014000
@PROLOG  STM   @14,@12,12(@13)                                  01S0002 00015000
         BALR  @12,0                                            01S0002 00016000
@PSTART  DS    0H                                               01S0002 00017000
         USING @PSTART,@12                                      01S0002 00018000
         L     @00,@SIZDATD                                     01S0002 00019000
         GETMAIN  R,LV=(0)                                              00020000
         LR    @11,@01                                          01S0002 00021000
         USING @DATD,@11                                        01S0002 00022000
         ST    @13,@SA00001+4                                   01S0002 00023000
         LM    @00,@01,20(@13)                                  01S0002 00024000
         ST    @11,8(,@13)                                      01S0002 00025000
         LR    @13,@11                                          01S0002 00026000
         MVC   @PC00001(16),0(@01)                              01S0002 00027000
*BLREXTRN - IDENTIFY EXTERNAL REFERENCES                                00028000
         EXTRN BLSUVP99                                                 00029000
*                                                               01S0087 00030000
*/********************************************************************/ 00031000
*/*                                                                  */ 00032000
*/* PERFORM INITIALIZATION                                           */ 00033000
*/*                                                                  */ 00034000
*/********************************************************************/ 00035000
*                                                               01S0087 00036000
*   CPPLPTR=R1;                     /* ->CPPL                        */ 00037000
         LR    CPPLPTR,R1                                       01S0087 00038000
*   FLAG='00'X;                     /* PROCESSING CONTROL FLAGS      */ 00039000
         MVI   FLAG,X'00'                                       01S0088 00040000
*   GENERATE CODE(MVC   ADATA(SDATAEND-SDATA),SDATA);           01S0089 00041000
         MVC   ADATA(SDATAEND-SDATA),SDATA                              00042000
*   IOPLUPT=ADDR(UPT);              /* UPT ADDR TO IOPL              */ 00043000
         L     @14,@PC00001+4                                   01S0090 00044000
         ST    @14,IOPLUPT                                      01S0090 00045000
*   IOPLECT=ADDR(ECT);              /* ECT ADDR TO IOPL              */ 00046000
         L     @10,@PC00001+12                                  01S0091 00047000
         ST    @10,IOPLECT                                      01S0091 00048000
*   IOPLECB=ADDR(0);                /* NO IOPL UCB                   */ 00049000
         LA    @07,@CF00051                                     01S0092 00050000
         ST    @07,IOPLECB                                      01S0092 00051000
*   IOPLIOPB=ADDR(PTPB);            /* PTPB ADDR TO IOPL             */ 00052000
         LA    @07,PTPB                                         01S0093 00053000
         ST    @07,IOPLIOPB                                     01S0093 00054000
*   PTPBOPUT=ADDR(OLD);             /* PUTLINE PARAMETER BLOCK       */ 00055000
         LA    @07,OLD                                          01S0094 00056000
         ST    @07,PTPBOPUT                                     01S0094 00057000
*   OLDN=DIM(OLDP);                 /* OUTPUT LINE DESCRIPTOR        */ 00058000
         MVC   OLDN(4),@CF00038                                 01S0095 00059000
*   DCBPTR=ADDR(ADCB);              /* POINT TO ADCB                 */ 00060000
         LA    DCBPTR,ADCB                                      01S0096 00061000
*   S99RBPTR=ADDR(S99RB)|'80000000'X;/* ->SVC 99 REQUEST BLOCK       */ 00062000
         L     @07,@CF00066                                     01S0097 00063000
         LA    @03,S99RB                                        01S0097 00064000
         OR    @03,@07                                          01S0097 00065000
         ST    @03,S99RBPTR                                     01S0097 00066000
*   S99RB=S99RB&&S99RB;             /* SVC 99 REQUEST BLOCK          */ 00067000
         XC    S99RB(20),S99RB                                  01S0098 00068000
*   S99RBLN=LENGTH(S99RB);          /* SET LENGTH                    */ 00069000
         MVI   S99RBLN,X'14'                                    01S0099 00070000
*   PUAB1=ADDR(TSHB);               /* ->DISP=SHR TEXT UNIT  @ZA32007*/ 00071000
         LA    @03,TSHB                                         01S0100 00072000
         ST    @03,PUAB1                                        01S0100 00073000
*   PUAB2=ADDR(TKEB);               /* ->DISP=(,KEEP) TEXT   @ZA32007*/ 00074000
         LA    @03,TKEB                                         01S0101 00075000
         ST    @03,PUAB2                                        01S0101 00076000
*   PUAB3=ADDR(TDSB);               /* ->DSNAME TEXT UNIT            */ 00077000
         LA    @03,TDSB                                         01S0102 00078000
         ST    @03,PUAB3                                        01S0102 00079000
*   PUAB4=ADDR(TDOB);               /* ->DSORG RESULT TEXT UNIT      */ 00080000
         LA    @03,TDOB                                         01S0103 00081000
         ST    @03,PUAB4                                        01S0103 00082000
*   PUAB5=ADDR(TDDB)|'80000000'X;   /* TURN ON HIGH ORDER BIT        */ 00083000
         LA    @03,TDDB                                         01S0104 00084000
         OR    @03,@07                                          01S0104 00085000
         ST    @03,PUAB5                                        01S0104 00086000
*   TSHB=TSHS;                      /* DISP=SHR TEXT UNIT    @ZA32007*/ 00087000
         MVC   TSHB(7),TSHS                                     01S0105 00088000
*   TKEB=TKES;                      /* DISP=(,KEEP) TEXT     @ZA32007*/ 00089000
         MVC   TKEB(7),TKES                                     01S0106 00090000
*   TDSB=TDSS;                      /* INPUT DATA SET NAME           */ 00091000
         MVC   TDSB(17),TDSS                                    01S0107 00092000
*   TDOB=TDOS;                      /* DATA SET ORGANIZATION         */ 00093000
         MVC   TDOB(8),TDOS                                     01S0108 00094000
*   RETC=ZZZFLAGI;                  /* RETURN CODE                   */ 00095000
         SLR   @07,@07                                          01S0109 00096000
         ST    @07,RETC                                         01S0109 00097000
*   RESPECIFY                                                   01S0110 00098000
*    (R1) UNRESTRICTED;             /* ->PARAMETER LIST              */ 00099000
*                                                               01S0111 00100000
*   /*****************************************************************/ 00101000
*   /*                                                               */ 00102000
*   /* CALL IKJPARS AND EXAMINE OPERANDS                             */ 00103000
*   /*                                                               */ 00104000
*   /*****************************************************************/ 00105000
*                                                               01S0111 00106000
*   CALL IKJPARS(UPT,ECT,0,PCCSECT,PDAPTR,CMD,0);               01S0111 00107000
         ST    @14,@AL00001                                     01S0111 00108000
         ST    @10,@AL00001+4                                   01S0111 00109000
         LA    @14,@CF00051                                     01S0111 00110000
         ST    @14,@AL00001+8                                   01S0111 00111000
         L     @14,PCPTR                                        01S0111 00112000
         ST    @14,@AL00001+12                                  01S0111 00113000
         LA    @14,PDAPTR                                       01S0111 00114000
         ST    @14,@AL00001+16                                  01S0111 00115000
         L     @14,@PC00001                                     01S0111 00116000
         ST    @14,@AL00001+20                                  01S0111 00117000
         LA    @14,@CF00051                                     01S0111 00118000
         ST    @14,@AL00001+24                                  01S0111 00119000
         L     @10,FLCCVT                                       01S0111 00120000
         L     @15,CVTPARS(,@10)                                01S0111 00121000
         LA    @01,@AL00001                                     01S0111 00122000
         BALR  @14,@15                                          01S0111 00123000
*   RETC=RF;                        /* RETURN CODE                   */ 00124000
         ST    RF,RETC                                          01S0112 00125000
*   IF RF>ZZZFLAGI THEN                                         01S0113 00126000
         LTR   RF,RF                                            01S0113 00127000
         BP    @RT00113                                         01S0113 00128000
*     GO TO EXITNORL;               /* EXIT WITH NO PDL              */ 00129000
*   RESPECIFY                                                   01S0115 00130000
*    (R1) RESTRICTED;               /* ->PARAMETER LIST              */ 00131000
*   RESPECIFY                                                   01S0116 00132000
*    (PDRPTR) RESTRICTED;           /* ->PD                          */ 00133000
*   PDRPTR=PDAPTR;                  /* ->PD                          */ 00134000
         L     PDRPTR,PDAPTR                                    01S0117 00135000
*   GENERATE CODE(USING PD,PDRPTR);                             01S0118 00136000
         USING PD,PDRPTR                                                00137000
*   RANGEBEG=PNDXI1;                /* DUMP INDEX (FIRST)            */ 00138000
         L     @14,PNDXIP                                       01S0119 00139000
         L     RANGEBEG,PNDXI1(,@14)                            01S0119 00140000
*   IF PNDXIFP(2)=ZZZ1 THEN                                     01S0120 00141000
         TM    PNDXIFP+8,B'10000000'                            01S0120 00142000
         BNO   @RF00120                                         01S0120 00143000
*     RANGEEND=PNDXI2;              /* DUMP INDEX (LAST)             */ 00144000
         L     @14,PNDXIP+8                                     01S0121 00145000
         L     RANGEEND,PNDXI2(,@14)                            01S0121 00146000
*   ELSE                                                        01S0122 00147000
*     RANGEEND=RANGEBEG;            /* DUMP INDEX (LAST)             */ 00148000
         B     @RC00120                                         01S0122 00149000
@RF00120 LR    RANGEEND,RANGEBEG                                01S0122 00150000
*                                                               01S0123 00151000
*   /*****************************************************************/ 00152000
*   /*                                                               */ 00153000
*   /* SCAN SYS1.DUMP DATA SETS                                      */ 00154000
*   /*                                                               */ 00155000
*   /*****************************************************************/ 00156000
*                                                               01S0123 00157000
*   DO J=RANGEBEG TO RANGEEND;      /* SCAN SYS1.DUMP DATA SETS      */ 00158000
@RC00120 LR    J,RANGEBEG                                       01S0123 00159000
         B     @DE00123                                         01S0123 00160000
@DL00123 DS    0H                                               01S0124 00161000
*     S99VERB=S99VRBAL;             /* ALLOCATE                      */ 00162000
         MVI   S99VERB,X'01'                                    01S0124 00163000
*     S99TXTPP=ADDR(PUAB);          /* ->LIST OF TEXT UNITS          */ 00164000
*                                                               01S0125 00165000
         LA    @14,PUAB                                         01S0125 00166000
         ST    @14,S99TXTPP                                     01S0125 00167000
*      DO;/*BLRCNVUC(J) FROM(UNSIGNED BINARY)TO(CHARACTER)SET(TDSBATB)R 00168000
*MARK(DUMP NUMBER)*/                                            01S0126 00169000
*        /*DUMP NUMBER*/                                        01S0127 00170000
*        CVD(J,PACKED);/*BINARY=>PACKED DECIMAL*/               01S0127 00171000
         CVD   J,PACKED                                         01S0127 00172000
*        UNPK(TDSBATB,PACKED);/*PACKED DECIMAL=>ZONED DECIMAL*/ 01S0128 00173000
         UNPK  TDSBATB(2),PACKED(8)                             01S0128 00174000
*        TDSBATB(LENGTH(TDSBATB):LENGTH(TDSBATB))=TDSBATB(LENGTH(TDSBAT 00175000
*):LENGTH(TDSBATB))|'0';/*ZONED DECIMAL=>EBCDIC*/               01S0129 00176000
         OI    TDSBATB+1,C'0'                                   01S0129 00177000
*      END;/*BLRCNVUC(J) FROM(UNSIGNED BINARY)TO(CHARACTER)SET(TDSBATB) 00178000
*EMARK(DUMP NUMBER)*/                                           01S0130 00179000
*     TDDB=TDDS;                    /* OUTPUT DDNAME                 */ 00180000
         MVC   TDDB(14),TDDS                                    01S0131 00181000
*     R1=ADDR(S99RBPTR);            /* ->SVC 99 PARAMETER LIST       */ 00182000
*                                                               01S0132 00183000
         LA    R1,S99RBPTR                                      01S0132 00184000
*      /*MACDATE Y-2 73082*/                                    01S0133 00185000
*      SVC (99);                                                01S0133 00186000
         SVC   99                                               01S0133 00187000
*     RETC=RF;                      /* RETURN CODE                   */ 00188000
         ST    RF,RETC                                          01S0134 00189000
*     IF RF^=0 THEN                                             01S0135 00190000
*                                                               01S0135 00191000
         LTR   RF,RF                                            01S0135 00192000
         BZ    @RF00135                                         01S0135 00193000
*       /*************************************************************/ 00194000
*       /*                                                           */ 00195000
*       /* UNABLE TO ALLOCATE A SYS1.DUMP DATA SET                   */ 00196000
*       /*                                                           */ 00197000
*       /*************************************************************/ 00198000
*                                                               01S0136 00199000
*        DO; /* LINK MF(E,LINK) PARAM(S99RB,RETC,0,HF,CPPL) */  01S0136 00200000
*        IOPTLIST(1)=ADDR(S99RB);/*ADDR OF PROB PROG PARM*/     01S0137 00201000
         LA    @14,S99RB                                        01S0137 00202000
         ST    @14,IOPTLIST                                     01S0137 00203000
*        IOPTLIST(2)=ADDR(RETC);/*ADDR OF PROB PROG PARM*/      01S0138 00204000
         LA    @14,RETC                                         01S0138 00205000
         ST    @14,IOPTLIST+4                                   01S0138 00206000
*        IOPTLIST(3)=ADDR(0);/*ADDR OF PROB PROG PARM*/         01S0139 00207000
         LA    @14,@CF00051                                     01S0139 00208000
         ST    @14,IOPTLIST+8                                   01S0139 00209000
*        IOPTLIST(4)=ADDR(HF);/*ADDR OF PROB PROG PARM*/        01S0140 00210000
         LA    @14,HF                                           01S0140 00211000
         ST    @14,IOPTLIST+12                                  01S0140 00212000
*        IOPTLIST(5)=ADDR(CPPL);/*ADDR OF PROB PROG PARM*/      01S0141 00213000
         ST    CPPLPTR,IOPTLIST+16                              01S0141 00214000
*        IOPTLIST(5)=IOPTLIST(5)|'80000000'X;/*SET VL BIT*/     01S0142 00215000
         L     @14,IOPTLIST+16                                  01S0142 00216000
         O     @14,@CF00066                                     01S0142 00217000
         ST    @14,IOPTLIST+16                                  01S0142 00218000
*        RESPECIFY(GPR01P) RESTRICTED;                          01S0143 00219000
*        GPR01P=ADDR(IOPTLIST);/*ADDR OF OPTLIST*/              01S0144 00220000
         LA    GPR01P,IOPTLIST                                  01S0144 00221000
*        RESPECIFY(GPR15P) RESTRICTED;                          01S0145 00222000
*        GPR15P=ADDR(LINK);/*ADDR OF LINK LIST*/                01S0146 00223000
         LA    GPR15P,LINK                                      01S0146 00224000
*        SVC (6);/*ISSUE LINK SVC*/                             01S0147 00225000
         SVC   6                                                01S0147 00226000
*        RESPECIFY(GPR01P) UNRESTRICTED;                        01S0148 00227000
*        RESPECIFY(GPR15P) UNRESTRICTED;                        01S0149 00228000
*        END; /* LINK MF(E,LINK) PARAM(S99RB,RETC,0,HF,CPPL) */ 01S0150 00229000
*     ELSE                                                      01S0151 00230000
*                                                               01S0151 00231000
*       /*************************************************************/ 00232000
*       /*                                                           */ 00233000
*       /* SYS1.DUMP DATA SET ALLOCATED                              */ 00234000
*       /*                                                           */ 00235000
*       /*************************************************************/ 00236000
*                                                               01S0151 00237000
*       DO;                         /* SYS1.DUMP DATA SET ALLOCATED  */ 00238000
         B     @RC00135                                         01S0151 00239000
@RF00135 DS    0H                                               01S0152 00240000
*         IF                        /* DSORG SUPPORTED               */ 00241000
*             TDOBAT='0000'X|       /* UNDEFINED DSORG       @ZA32005*/ 00242000
*             TDOBAT='4000'X|       /* DSORG=PS                      */ 00243000
*             TDOBAT='2000'X|       /* DSORG=DA                      */ 00244000
*             TDOBAT='4100'X|       /* DSORG=PSU                     */ 00245000
*             TDOBAT='2100'X THEN   /* DSORG=DAU                     */ 00246000
*                                                               01S0152 00247000
         CLC   TDOBAT(2),@CB00129                               01S0152 00248000
         BE    @RT00152                                         01S0152 00249000
         CLC   TDOBAT(2),@CB02179                               01S0152 00250000
         BE    @RT00152                                         01S0152 00251000
         CLC   TDOBAT(2),@CB02180                               01S0152 00252000
         BE    @RT00152                                         01S0152 00253000
         CLC   TDOBAT(2),@CB02181                               01S0152 00254000
         BE    @RT00152                                         01S0152 00255000
         CLC   TDOBAT(2),@CB02182                               01S0152 00256000
         BNE   @RF00152                                         01S0152 00257000
@RT00152 DS    0H                                               01S0153 00258000
*           /*********************************************************/ 00259000
*           /*                                                       */ 00260000
*           /* DSORG SUPPORTED                                       */ 00261000
*           /*                                                       */ 00262000
*           /*********************************************************/ 00263000
*                                                               01S0153 00264000
*           DO;                                                 01S0153 00265000
*             DCBDDNAM=ZZZPGM40;    /* DDNAME                        */ 00266000
         LA    @14,40                                           01S0154 00267000
         ALR   @14,DCBPTR                                       01S0154 00268000
         MVC   DCBDDNAM(8,@14),@CC00164                         01S0154 00269000
*             DCBDDNAM(1:TDDBAL)=TDDBAT(1:TDDBAL);              01S0155 00270000
         SLR   @09,@09                                          01S0155 00271000
         ICM   @09,3,TDDBAL                                     01S0155 00272000
         BCTR  @09,0                                            01S0155 00273000
         EX    @09,@SM02202                                     01S0155 00274000
*             GENERATE REFS(DCBPTR) CODE                        01S0156 00275000
*                 (OPEN  ((DCBPTR),(INPUT)),MF=(E,AOPEN));      01S0156 00276000
         OPEN  ((DCBPTR),(INPUT)),MF=(E,AOPEN)                          00277000
*             IF DCBOFOPN=ZZZ0 THEN                             01S0157 00278000
*                                                               01S0157 00279000
         TM    DCBOFOPN+40(DCBPTR),B'00010000'                  01S0157 00280000
         BNZ   @RF00157                                         01S0157 00281000
*               /*****************************************************/ 00282000
*               /*                                                   */ 00283000
*               /* UNABLE TO OPEN SYS1.DUMP DATA SET                 */ 00284000
*               /*                                                   */ 00285000
*               /*****************************************************/ 00286000
*                                                               01S0158 00287000
*               DO;                 /* UNABLE TO OPEN                */ 00288000
*                 OLDP(1)=ADDR(M012B);/* ->MESSAGE BUFFER            */ 00289000
         LA    @14,M012B                                        01S0159 00290000
         ST    @14,OLDP                                         01S0159 00291000
*                 M012B=M012S;      /* M012 LITERAL TEXT             */ 00292000
         MVC   M012B(40),M012S                                  01S0160 00293000
*                 M012BTB=TDSBATB;  /* DUMP NUMBER                   */ 00294000
         MVC   M012BTB(2),TDSBATB                               01S0161 00295000
*                 R1=ADDR(IOPL);    /* ->I/O PARAMETER LIST          */ 00296000
         LA    R1,IOPL                                          01S0162 00297000
*                 CALL IKJPUTL;     /* TRANSMIT M012                 */ 00298000
         L     @09,FLCCVT                                       01S0163 00299000
         L     @15,CVTPUTL(,@09)                                01S0163 00300000
         BALR  @14,@15                                          01S0163 00301000
*                 GO TO SCANNEXT;   /* CONTINUE SCAN PROCESSING      */ 00302000
         B     SCANNEXT                                         01S0164 00303000
*               END;                                            01S0165 00304000
*             FLAGPOOL=ZZZ1;        /* BUFFER POOL CONTRUCTED        */ 00305000
*                                                               01S0166 00306000
@RF00157 OI    FLAGPOOL,B'10000000'                             01S0166 00307000
*             /*******************************************************/ 00308000
*             /*                                                     */ 00309000
*             /* SCAN FOR TITLE RECORD                               */ 00310000
*             /*                                                     */ 00311000
*             /*******************************************************/ 00312000
*                                                               01S0167 00313000
*             DO K=1 TO 10;         /* SCAN FOR TITLE RECORD         */ 00314000
         LA    K,1                                              01S0167 00315000
@DL00167 DS    0H                                               01S0168 00316000
*               GENERATE REFS(DCBPTR) FLOWS(SCANEOD) SEQFLOW CODE       00317000
*                   (GET   (DCBPTR));                           01S0168 00318000
         GET   (DCBPTR)                                                 00319000
*               HSDPTR=R1;                                      01S0169 00320000
         LR    HSDPTR,R1                                        01S0169 00321000
*               IF HSDTYPE=HSDTYPES&HSDCLA=HSDCLAH THEN         01S0170 00322000
*                                                               01S0170 00323000
         CLI   HSDTYPE(HSDPTR),X'FF'                            01S0170 00324000
         BNE   @RF00170                                         01S0170 00325000
         CLI   HSDCLA(HSDPTR),X'FF'                             01S0170 00326000
         BNE   @RF00170                                         01S0170 00327000
*                 /***************************************************/ 00328000
*                 /*                                                 */ 00329000
*                 /* PROCESS TITLE RECORD                            */ 00330000
*                 /*                                                 */ 00331000
*                 /***************************************************/ 00332000
*                                                               01S0171 00333000
*                 DO;               /* PROCESS TITLE RECORD          */ 00334000
*                   OLDP(1)=ADDR(M011B);/* ->MESSAGE BUFFER          */ 00335000
         LA    @14,M011B                                        01S0172 00336000
         ST    @14,OLDP                                         01S0172 00337000
*                   M011B=M011S;    /* M011 LITERAL TEXT             */ 00338000
         MVC   M011B(127),M011S                                 01S0173 00339000
*                   M011BTB=TDSBATB;/* DUMP NUMBER                   */ 00340000
         MVC   M011BTB(2),TDSBATB                               01S0174 00341000
*                   M011BTD=HSDHTITL;/* DUMP TITLE                   */ 00342000
         MVC   M011BTD(100),HSDHTITL(HSDPTR)                    01S0175 00343000
*                   DO M011BL=LENGTH(M011B) TO 7 BY-1 WHILE(M011B(      00344000
*                         M011BL:M011BL)=' ');/* REMOVE TRAILING        00345000
*                                      BLANKS                        */ 00346000
         LA    @14,127                                          01S0176 00347000
         STH   @14,M011BL                                       01S0176 00348000
@DL00176 LA    @09,M011B-1(@14)                                 01S0176 00349000
         CLI   0(@09),C' '                                      01S0176 00350000
         BNE   @DC00176                                         01S0176 00351000
*                   END;                                        01S0177 00352000
         BCTR  @14,0                                            01S0177 00353000
         STH   @14,M011BL                                       01S0177 00354000
         CH    @14,@CH00248                                     01S0177 00355000
         BNL   @DL00176                                         01S0177 00356000
@DC00176 DS    0H                                               01S0178 00357000
*                   R1=ADDR(IOPL);  /* ->I/O PARAMETER LIST          */ 00358000
         LA    R1,IOPL                                          01S0178 00359000
*                   CALL IKJPUTL;   /* TRANSMIT M011                 */ 00360000
         L     @09,FLCCVT                                       01S0179 00361000
         L     @15,CVTPUTL(,@09)                                01S0179 00362000
         BALR  @14,@15                                          01S0179 00363000
*                   GO TO SCANNEXT; /* CONTINUE SCAN PROCESSING      */ 00364000
         B     SCANNEXT                                         01S0180 00365000
*                 END;                                          01S0181 00366000
*             END;                                              01S0182 00367000
@RF00170 AL    K,@CF00038                                       01S0182 00368000
         CH    K,@CH00234                                       01S0182 00369000
         BNH   @DL00167                                         01S0182 00370000
*SCANEOD:                           /* EODAD EXIT                    */ 00371000
*             IF K>1 THEN                                       01S0183 00372000
*                                                               01S0183 00373000
SCANEOD  CH    K,@CH00038                                       01S0183 00374000
         BNH   @RF00183                                         01S0183 00375000
*               /*****************************************************/ 00376000
*               /*                                                   */ 00377000
*               /* UNABLE TO FIND A TITLE RECORD                     */ 00378000
*               /*                                                   */ 00379000
*               /*****************************************************/ 00380000
*                                                               01S0184 00381000
*               DO;                 /* UNABLE TO FIND A TITLE RECORD */ 00382000
*                 OLDP(1)=ADDR(M013B);/* ->MESSAGE BUFFER            */ 00383000
         LA    @14,M013B                                        01S0185 00384000
         ST    @14,OLDP                                         01S0185 00385000
*                 M013B=M013S;      /* M013 LITERAL TEXT             */ 00386000
         MVC   M013B(51),M013S                                  01S0186 00387000
*                 M013BTB=TDSBATB;  /* DUMP NUMBER                   */ 00388000
         MVC   M013BTB(2),TDSBATB                               01S0187 00389000
*                 R1=ADDR(IOPL);    /* ->I/O PARAMETER LIST          */ 00390000
         LA    R1,IOPL                                          01S0188 00391000
*                 CALL IKJPUTL;     /* TRANSMIT M013                 */ 00392000
         L     @09,FLCCVT                                       01S0189 00393000
         L     @15,CVTPUTL(,@09)                                01S0189 00394000
         BALR  @14,@15                                          01S0189 00395000
*               END;                                            01S0190 00396000
*             ELSE                                              01S0191 00397000
*                                                               01S0191 00398000
*               /*****************************************************/ 00399000
*               /*                                                   */ 00400000
*               /* SYS1.DUMP DATA SET IS EMPTY                       */ 00401000
*               /*                                                   */ 00402000
*               /*****************************************************/ 00403000
*                                                               01S0191 00404000
*               DO;                 /* SYS1.DUMP DATA SET IS EMPTY   */ 00405000
         B     @RC00183                                         01S0191 00406000
@RF00183 DS    0H                                               01S0192 00407000
*                 OLDP(1)=ADDR(M014B);/* ->MESSAGE BUFFER            */ 00408000
         LA    @14,M014B                                        01S0192 00409000
         ST    @14,OLDP                                         01S0192 00410000
*                 M014B=M014S;      /* M014 LITERAL TEXT             */ 00411000
         MVC   M014B(34),M014S                                  01S0193 00412000
*                 M014BTB=TDSBATB;  /* DUMP NUMBER                   */ 00413000
         MVC   M014BTB(2),TDSBATB                               01S0194 00414000
*                 R1=ADDR(IOPL);    /* ->I/O PARAMETER LIST          */ 00415000
         LA    R1,IOPL                                          01S0195 00416000
*                 CALL IKJPUTL;     /* TRANSMIT M012                 */ 00417000
         L     @09,FLCCVT                                       01S0196 00418000
         L     @15,CVTPUTL(,@09)                                01S0196 00419000
         BALR  @14,@15                                          01S0196 00420000
*               END;                                            01S0197 00421000
*                                                               01S0197 00422000
*             /*******************************************************/ 00423000
*             /*                                                     */ 00424000
*             /* FREE RESOURCES USED TO PROCESS THE SYS1.DUMP DATA   */ 00425000
*             /* SET                                                 */ 00426000
*             /*                                                     */ 00427000
*             /*******************************************************/ 00428000
*                                                               01S0198 00429000
*SCANNEXT:                          /* CONTINUE SCAN PROCESSING      */ 00430000
*             GENERATE CODE(CLOSE MF=(E,AOPEN));                01S0198 00431000
@RC00183 DS    0H                                               01S0198 00432000
SCANNEXT CLOSE MF=(E,AOPEN)                                             00433000
*           END;                    /* CLOSE VALID DSORG             */ 00434000
*         ELSE                      /* UNSUPPORTED DSORG             */ 00435000
*           DO;                                                 01S0200 00436000
         B     @RC00152                                         01S0200 00437000
@RF00152 DS    0H                                               01S0201 00438000
*             OLDP(1)=ADDR(M134);   /* ->MESSAGE BUFFER              */ 00439000
         LA    @14,M134                                         01S0201 00440000
         ST    @14,OLDP                                         01S0201 00441000
*             R1=ADDR(IOPL);        /* ->I/O PARAMETER LIST          */ 00442000
         LA    R1,IOPL                                          01S0202 00443000
*             CALL IKJPUTL;         /* TRANSMIT M134                 */ 00444000
         L     @09,FLCCVT                                       01S0203 00445000
         L     @15,CVTPUTL(,@09)                                01S0203 00446000
         BALR  @14,@15                                          01S0203 00447000
*           END;                                                01S0204 00448000
*         S99VERB=S99VRBUN;         /* UNALLOCATE                    */ 00449000
@RC00152 MVI   S99VERB,X'02'                                    01S0205 00450000
*         S99TXTPP=ADDR(PUAB5);     /* ->LIST OF TEXT UNITS          */ 00451000
         LA    @14,PUAB5                                        01S0206 00452000
         ST    @14,S99TXTPP                                     01S0206 00453000
*         TDDB$$=DUNDDNAM;          /* CONVERT TEXT UNIT             */ 00454000
         MVC   TDDB$$(2),@CB01630                               01S0207 00455000
*         R1=ADDR(S99RBPTR);        /* ->SVC 99 PARAMETER LIST       */ 00456000
*                                                               01S0208 00457000
         LA    R1,S99RBPTR                                      01S0208 00458000
*          /*MACDATE Y-2 73082*/                                01S0209 00459000
*          SVC (99);                                            01S0209 00460000
         SVC   99                                               01S0209 00461000
*         RETC=RF;                  /* RETURN CODE                   */ 00462000
         ST    RF,RETC                                          01S0210 00463000
*         IF RF^=0 THEN                                         01S0211 00464000
*                                                               01S0211 00465000
         LTR   RF,RF                                            01S0211 00466000
         BZ    @RF00211                                         01S0211 00467000
*           /*********************************************************/ 00468000
*           /*                                                       */ 00469000
*           /* UNABLE TO FREE A SYS1.DUMP DATA SET                   */ 00470000
*           /*                                                       */ 00471000
*           /*********************************************************/ 00472000
*                                                               01S0212 00473000
*           DO;                     /* UNABLE TO FREE DATA SET       */ 00474000
*              DO; /* LINK MF(E,LINK) PARAM(S99RB,RETC,0,HF,CPPL) */    00475000
*              IOPTLIST(1)=ADDR(S99RB);/*ADDR OF PROB PROG PARM*/       00476000
         LA    @14,S99RB                                        01S0214 00477000
         ST    @14,IOPTLIST                                     01S0214 00478000
*              IOPTLIST(2)=ADDR(RETC);/*ADDR OF PROB PROG PARM*/        00479000
         LA    @14,RETC                                         01S0215 00480000
         ST    @14,IOPTLIST+4                                   01S0215 00481000
*              IOPTLIST(3)=ADDR(0);/*ADDR OF PROB PROG PARM*/   01S0216 00482000
         LA    @14,@CF00051                                     01S0216 00483000
         ST    @14,IOPTLIST+8                                   01S0216 00484000
*              IOPTLIST(4)=ADDR(HF);/*ADDR OF PROB PROG PARM*/  01S0217 00485000
         LA    @14,HF                                           01S0217 00486000
         ST    @14,IOPTLIST+12                                  01S0217 00487000
*              IOPTLIST(5)=ADDR(CPPL);/*ADDR OF PROB PROG PARM*/        00488000
         ST    CPPLPTR,IOPTLIST+16                              01S0218 00489000
*              IOPTLIST(5)=IOPTLIST(5)|'80000000'X;/*SET VL BIT*/       00490000
         L     @14,IOPTLIST+16                                  01S0219 00491000
         O     @14,@CF00066                                     01S0219 00492000
         ST    @14,IOPTLIST+16                                  01S0219 00493000
*              RESPECIFY(GPR01P) RESTRICTED;                    01S0220 00494000
*              GPR01P=ADDR(IOPTLIST);/*ADDR OF OPTLIST*/        01S0221 00495000
         LA    GPR01P,IOPTLIST                                  01S0221 00496000
*              RESPECIFY(GPR15P) RESTRICTED;                    01S0222 00497000
*              GPR15P=ADDR(LINK);/*ADDR OF LINK LIST*/          01S0223 00498000
         LA    GPR15P,LINK                                      01S0223 00499000
*              SVC (6);/*ISSUE LINK SVC*/                       01S0224 00500000
         SVC   6                                                01S0224 00501000
*              RESPECIFY(GPR01P) UNRESTRICTED;                  01S0225 00502000
*              RESPECIFY(GPR15P) UNRESTRICTED;                  01S0226 00503000
*              END; /* LINK MF(E,LINK) PARAM(S99RB,RETC,0,HF,CPPL) */   00504000
*             GO TO EXITRLSA;       /* EXIT WITH PDL                 */ 00505000
         B     EXITRLSA                                         01S0228 00506000
*           END;                                                01S0229 00507000
*       END;                                                    01S0230 00508000
@RF00211 DS    0H                                               01S0231 00509000
*   END;                            /* END OF PROCESSING LOOP        */ 00510000
@RC00135 AL    J,@CF00038                                       01S0231 00511000
@DE00123 CR    J,RANGEEND                                       01S0231 00512000
         BNH   @DL00123                                         01S0231 00513000
*                                                               01S0232 00514000
*   /*****************************************************************/ 00515000
*   /*                                                               */ 00516000
*   /* PROGRAM EXIT                                                  */ 00517000
*   /*                                                               */ 00518000
*   /*****************************************************************/ 00519000
*                                                               01S0232 00520000
*                                                               01S0232 00521000
*EXITRLSA:                                                      01S0232 00522000
*   DO WHILE(PDAPTR^=0);/*BLRRLSA MF(EXECUTE,PD)*/              01S0232 00523000
EXITRLSA B     @DE00232                                         01S0232 00524000
@DL00232 DS    0H                                               01S0233 00525000
*     PDRPTR=PDAPTR;                                            01S0233 00526000
         L     PDRPTR,PDAPTR                                    01S0233 00527000
*     PDAPTR=PDXP;                                              01S0234 00528000
*                                                               01S0234 00529000
         SLR   @14,@14                                          01S0234 00530000
         ICM   @14,7,PDXP(PDRPTR)                               01S0234 00531000
         ST    @14,PDAPTR                                       01S0234 00532000
*   DO; /*FREEMAIN(R) LV(PDL)SP(1)A(PDDSECT)*/                  01S0235 00533000
*   RESPECIFY (GPR01F,GPR00F) RESTRICTED;                       01S0236 00534000
*   GPR00F = PDL; /* LENGTH REQUESTED*/                         01S0237 00535000
         SLR   GPR00F,GPR00F                                    01S0237 00536000
         ICM   GPR00F,7,PDL(PDRPTR)                             01S0237 00537000
*   GPR01F = 1; /* SP IN REG 1 */                               01S0238 00538000
         LA    GPR01F,1                                         01S0238 00539000
*   GEN   (SLL   GPR01F,24)                                     01S0239 00540000
*   NODEFS NOREFS NOSETS NOEXIT NOFLOWS SEQFLOW;                01S0239 00541000
         SLL   GPR01F,24                                                00542000
*   GPR00F = GPR00F | GPR01F; /* SP IN HI BYTE */               01S0240 00543000
         OR    GPR00F,GPR01F                                    01S0240 00544000
*   GPR01F=ADDR(PDDSECT); /*SET REGISTER ONE*/                  01S0241 00545000
         LR    GPR01F,PDRPTR                                    01S0241 00546000
*   SVC(10); /* R-FORM OF GETMAIN*/                             01S0242 00547000
         SVC   10                                               01S0242 00548000
*   RESPECIFY (GPR01F,GPR00F) UNRESTRICTED;                     01S0243 00549000
*   END; /*FREEMAIN(R) LV(PDL)SP(1)A(PDDSECT)*/                 01S0244 00550000
*   END;/*BLRRLSA MF(EXECUTE,PD)*/                              01S0245 00551000
@DE00232 ICM   @14,15,PDAPTR                                    01S0245 00552000
         BNZ   @DL00232                                         01S0245 00553000
*   IF FLAGPOOL=ZZZ1 THEN           /* BUFFER POOL CONTRUCTED        */ 00554000
         TM    FLAGPOOL,B'10000000'                             01S0246 00555000
         BNO   @RF00246                                         01S0246 00556000
*     GENERATE REFS(DCBPTR) CODE(FREEPOOL (DCBPTR));            01S0247 00557000
         FREEPOOL (DCBPTR)                                              00558000
*EXITNORL:                          /* EXIT WITH NO PDL              */ 00559000
*   RETURN CODE(RETC);                                          01S0248 00560000
*                                                               01S0248 00561000
@RF00246 DS    0H                                               01S0248 00562000
EXITNORL L     @03,RETC                                         01S0248 00563000
         L     @13,4(,@13)                                      01S0248 00564000
         L     @00,@SIZDATD                                     01S0248 00565000
         LR    @01,@11                                          01S0248 00566000
         FREEMAIN R,LV=(0),A=(1)                                        00567000
         LR    @15,@03                                          01S0248 00568000
         L     @14,12(,@13)                                     01S0248 00569000
         LM    @00,@12,20(@13)                                  01S0248 00570000
         BR    @14                                              01S0248 00571000
*/*BLSRPEND--DEBUGGING MODULE*/                                 01S0249 00572000
*                                                               01S0249 00573000
*/*BLSUPEND--MVS IPCS MODULE*/                                  01S0249 00574000
*                                                               01S0249 00575000
*   DECLARE/*DATA FOR AHB MACROS*/                              01S0249 00576000
*     PACKED BIT(64) BOUNDARY(DWORD);/*DATA CONVERSION WORK AREA*/      00577000
*                                                               01S0249 00578000
*                                                               01S0249 00579000
*    DECLARE /*GENERAL PURPOSE REGISTERS */                     01S0250 00580000
*      GPR00F FIXED(31) REG(0),                                 01S0250 00581000
*      GPR01F FIXED(31) REG(1),                                 01S0250 00582000
*      GPR01P PTR(31) REG(1),                                   01S0250 00583000
*      GPR15P PTR(31) REG(15);                                  01S0250 00584000
*                                                               01S0250 00585000
*    DECLARE /* COMMON VARIABLES */                             01S0251 00586000
*      I256C CHAR(256) BASED,                                   01S0251 00587000
*      I031F FIXED(31) BASED,                                   01S0251 00588000
*      I031P PTR(31)   BASED,                                   01S0251 00589000
*      I015F FIXED(15) BASED,                                   01S0251 00590000
*      I015P PTR(15)   BASED,                                   01S0251 00591000
*      I008P PTR(8)    BASED,                                   01S0251 00592000
*      I001C CHAR(1)   BASED;                                   01S0251 00593000
*                                                               01S0251 00594000
*    DECLARE IOPTLIST (5) PTR(31) BDY(WORD); /* OPTION LIST ARRAY */    00595000
*    GENERATE NODEFS NOREFS DATA;                               01S0253 00596000
*   END BLSRDUSC /*BLRPEND(BLSRDUSC) */                         01S0254 00597000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00598000
*/*%INCLUDE SYSLIB  (BLRCMDPL)                                        * 00599000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                        * 00600000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                        * 00601000
*/*%INCLUDE SYSLIB  (IKJECT  )                                        * 00602000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        * 00603000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 00604000
*/*%INCLUDE SYSLIB  (BLRSERV )                                        * 00605000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                        * 00606000
*/*%INCLUDE SYSLIB  (IHADCB  )                                        * 00607000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                        * 00608000
*/*%INCLUDE SYSLIB  (IKJIOPL )                                        * 00609000
*/*%INCLUDE SYSLIB  (IKJPTPB )                                        * 00610000
*/*%INCLUDE SYSLIB  (IEFZB4D0)                                        * 00611000
*/*%INCLUDE SYSLIB  (IEFZB4D2)                                        * 00612000
*/*%INCLUDE SYSLIB  (BLSRHSD )                                        * 00613000
*;                                                              01S0254 00614000
@EL00001 L     @13,4(,@13)                                      01S0254 00615000
@EF00001 L     @00,@SIZDATD                                     01S0254 00616000
         LR    @01,@11                                          01S0254 00617000
         FREEMAIN R,LV=(0),A=(1)                                        00618000
@ER00001 LM    @14,@12,12(@13)                                  01S0254 00619000
         BR    @14                                              01S0254 00620000
@DATA    DS    0H                                                       00621000
@CH00248 DC    H'7'                                                     00622000
@CH00234 DC    H'10'                                                    00623000
@SM02202 MVC   DCBDDNAM(0,@14),TDDBAT                                   00624000
@DATD    DSECT                                                          00625000
         DS    0F                                                       00626000
@SA00001 DS    18F                                                      00627000
@PC00001 DS    4F                                                       00628000
@AL00001 DS    7A                                                       00629000
BLSRDUSC CSECT                                                          00630000
         DS    0F                                                       00631000
@CF00051 DC    F'0'                                                     00632000
@CF00038 DC    F'1'                                                     00633000
@CH00038 EQU   @CF00038+2                                               00634000
@CF00066 DC    XL4'80000000'                                            00635000
@DATD    DSECT                                                          00636000
         DS    0D                                                       00637000
S99RBPTR DS    AL4                                                      00638000
         ORG   S99RBPTR                                                 00639000
S99RBPND DS    BL1                                                      00640000
         ORG   S99RBPTR+4                                               00641000
PDAPTR   DS    A                                                        00642000
RETC     DS    F                                                        00643000
IOPL     DS    CL16                                                     00644000
         ORG   IOPL                                                     00645000
IOPLUPT  DS    AL4                                                      00646000
IOPLECT  DS    AL4                                                      00647000
IOPLECB  DS    AL4                                                      00648000
IOPLIOPB DS    AL4                                                      00649000
         ORG   IOPL+16                                                  00650000
S99RB    DS    CL20                                                     00651000
         ORG   S99RB                                                    00652000
S99RBLN  DS    CL1                                                      00653000
S99VERB  DS    CL1                                                      00654000
S99FLAG1 DS    CL2                                                      00655000
         ORG   S99FLAG1                                                 00656000
S99FLG11 DS    CL1                                                      00657000
         ORG   S99FLG11                                                 00658000
S99ONCNV DS    BL1                                                      00659000
S99NOCNV EQU   S99FLG11+0                                               00660000
S99NOMNT EQU   S99FLG11+0                                               00661000
S99JBSYS EQU   S99FLG11+0                                               00662000
         ORG   S99FLAG1+1                                               00663000
S99FLG12 DS    CL1                                                      00664000
         ORG   S99RB+4                                                  00665000
S99RSC   DS    CL4                                                      00666000
         ORG   S99RSC                                                   00667000
S99ERROR DS    CL2                                                      00668000
S99INFO  DS    CL2                                                      00669000
         ORG   S99RB+8                                                  00670000
S99TXTPP DS    AL4                                                      00671000
S99RSV01 DS    FL4                                                      00672000
S99FLAG2 DS    CL4                                                      00673000
         ORG   S99FLAG2                                                 00674000
S99FLG21 DS    CL1                                                      00675000
         ORG   S99FLG21                                                 00676000
S99WTVOL DS    BL1                                                      00677000
S99WTDSN EQU   S99FLG21+0                                               00678000
S99NORES EQU   S99FLG21+0                                               00679000
S99WTUNT EQU   S99FLG21+0                                               00680000
S99OFFLN EQU   S99FLG21+0                                               00681000
S99TIONQ EQU   S99FLG21+0                                               00682000
S99CATLG EQU   S99FLG21+0                                               00683000
S99MOUNT EQU   S99FLG21+0                                               00684000
         ORG   S99FLAG2+1                                               00685000
S99FLG22 DS    CL1                                                      00686000
         ORG   S99FLG22                                                 00687000
S99UDEVT DS    BL1                                                      00688000
S99PCINT EQU   S99FLG22+0                                               00689000
         ORG   S99FLAG2+2                                               00690000
S99FLG23 DS    CL1                                                      00691000
S99FLG24 DS    CL1                                                      00692000
         ORG   S99RB+20                                                 00693000
M011B    DS    CL127                                                    00694000
         ORG   M011B                                                    00695000
M011BL   DS    FL2                                                      00696000
@NM00092 DS    BL2                                                      00697000
M011BT   DS    CL123                                                    00698000
         ORG   M011BT                                                   00699000
M011BTA  DS    CL19                                                     00700000
M011BTB  DS    CL2                                                      00701000
M011BTC  DS    CL2                                                      00702000
M011BTD  DS    CL100                                                    00703000
         ORG   M011B+127                                                00704000
         DS    CL1                                                      00705000
OLD      DS    CL8                                                      00706000
         ORG   OLD                                                      00707000
OLDN     DS    FL4                                                      00708000
OLDP     DS    1A                                                       00709000
         ORG   OLD+8                                                    00710000
TSHB     DS    CL7                                                      00711000
         ORG   TSHB                                                     00712000
TSHB$$   DS    CL2                                                      00713000
TSHB$#   DS    FL2                                                      00714000
TSHBA    DS    CL3                                                      00715000
         ORG   TSHBA                                                    00716000
TSHBAL   DS    FL2                                                      00717000
TSHBAT   DS    CL1                                                      00718000
         ORG   TSHBAT                                                   00719000
TSHBATA  DS    CL1                                                      00720000
         ORG   TSHB+7                                                   00721000
TSHB$9   DS    0C                                                       00722000
         ORG   TSHB+7                                                   00723000
         DS    CL1                                                      00724000
TKEB     DS    CL7                                                      00725000
         ORG   TKEB                                                     00726000
TKEB$$   DS    CL2                                                      00727000
TKEB$#   DS    FL2                                                      00728000
TKEBA    DS    CL3                                                      00729000
         ORG   TKEBA                                                    00730000
TKEBAL   DS    FL2                                                      00731000
TKEBAT   DS    CL1                                                      00732000
         ORG   TKEBAT                                                   00733000
TKEBATA  DS    CL1                                                      00734000
         ORG   TKEB+7                                                   00735000
TKEB$9   DS    0C                                                       00736000
         ORG   TKEB+7                                                   00737000
         DS    CL1                                                      00738000
TDSB     DS    CL17                                                     00739000
         ORG   TDSB                                                     00740000
TDSB$$   DS    CL2                                                      00741000
TDSB$#   DS    FL2                                                      00742000
TDSBA    DS    CL13                                                     00743000
         ORG   TDSBA                                                    00744000
TDSBAL   DS    FL2                                                      00745000
TDSBAT   DS    CL11                                                     00746000
         ORG   TDSBAT                                                   00747000
TDSBATA  DS    CL9                                                      00748000
TDSBATB  DS    CL2                                                      00749000
         ORG   TDSB+17                                                  00750000
TDSB$9   DS    0C                                                       00751000
         ORG   TDSB+17                                                  00752000
         DS    CL1                                                      00753000
TDDB     DS    CL14                                                     00754000
         ORG   TDDB                                                     00755000
TDDB$$   DS    CL2                                                      00756000
TDDB$#   DS    FL2                                                      00757000
TDDBA    DS    CL10                                                     00758000
         ORG   TDDBA                                                    00759000
TDDBAL   DS    FL2                                                      00760000
TDDBAT   DS    CL8                                                      00761000
         ORG   TDDBAT                                                   00762000
TDDBATA  DS    CL8                                                      00763000
         ORG   TDDB+14                                                  00764000
TDDB$9   DS    0C                                                       00765000
         ORG   TDDB+14                                                  00766000
TDOB     DS    CL8                                                      00767000
         ORG   TDOB                                                     00768000
TDOB$$   DS    CL2                                                      00769000
TDOB$#   DS    FL2                                                      00770000
TDOBA    DS    CL4                                                      00771000
         ORG   TDOBA                                                    00772000
TDOBAL   DS    FL2                                                      00773000
TDOBAT   DS    CL2                                                      00774000
         ORG   TDOBAT                                                   00775000
TDOBATA  DS    CL2                                                      00776000
         ORG   TDOB+8                                                   00777000
TDOB$9   DS    0C                                                       00778000
         ORG   TDOB+8                                                   00779000
FLAG     DS    BL1                                                      00780000
         ORG   FLAG                                                     00781000
FLAGPOOL DS    BL1                                                      00782000
@NM00100 EQU   FLAG+0                                                   00783000
         ORG   FLAG+1                                                   00784000
         DS    CL3                                                      00785000
PUAB     DS    CL20                                                     00786000
         ORG   PUAB                                                     00787000
PUAB1    DS    AL4                                                      00788000
PUAB2    DS    AL4                                                      00789000
PUAB3    DS    AL4                                                      00790000
PUAB4    DS    AL4                                                      00791000
PUAB5    DS    AL4                                                      00792000
         ORG   PUAB+20                                                  00793000
PACKED   DS    BL8                                                      00794000
IOPTLIST DS    5A                                                       00795000
BLSRDUSC CSECT                                                          00796000
         DS    0F                                                       00797000
@SIZDATD DC    AL1(1)                                                   00798000
         DC    AL3(@ENDDATD-@DATD)                                      00799000
         DS    0D                                                       00800000
PCPTR    DC    AL4(PC)                                                  00801000
@CC00164 DC    C'        '                                              00802000
@CC02150 DC    C'IKJEFF18'                                              00803000
@CB00129 DC    X'0000'                                                  00804000
@CB01630 DC    X'0001'                                                  00805000
@CB02179 DC    X'4000'                                                  00806000
@CB02180 DC    X'2000'                                                  00807000
@CB02181 DC    X'4100'                                                  00808000
@CB02182 DC    X'2100'                                                  00809000
M011S    DS    CL127                                                    00810000
         ORG   M011S                                                    00811000
M011SL   DC    AL2(127)                                                 00812000
@NM00091 DC    X'0000'                                                  00813000
M011ST   DS    CL123                                                    00814000
         ORG   M011ST                                                   00815000
M011STA  DC    CL19'BLS18011I SYS1.DUMP'                                00816000
M011STB  DC    CL2' '                                                   00817000
M011STC  DC    CL2'--'                                                  00818000
M011STD  DC    CL100' '                                                 00819000
         ORG   M011S+127                                                00820000
         DS    CL1                                                      00821000
M012S    DS    CL40                                                     00822000
         ORG   M012S                                                    00823000
M012SL   DC    AL2(40)                                                  00824000
@NM00093 DC    X'0000'                                                  00825000
M012ST   DS    CL36                                                     00826000
         ORG   M012ST                                                   00827000
M012STA  DC    CL34'BLS18012I UNABLE TO OPEN SYS1.DUMP'                 00828000
M012STB  DC    CL2' '                                                   00829000
         ORG   M012S+40                                                 00830000
M013S    DS    CL51                                                     00831000
         ORG   M013S                                                    00832000
M013SL   DC    AL2(51)                                                  00833000
@NM00095 DC    X'0000'                                                  00834000
M013ST   DS    CL47                                                     00835000
         ORG   M013ST                                                   00836000
M013STA  DC    CL45'BLS18013I NO TITLE RECORD FOUND FOR SYS1.DUMP'      00837000
M013STB  DC    CL2' '                                                   00838000
         ORG   M013S+51                                                 00839000
         DS    CL1                                                      00840000
M014S    DS    CL34                                                     00841000
         ORG   M014S                                                    00842000
M014SL   DC    AL2(34)                                                  00843000
@NM00097 DC    X'0000'                                                  00844000
M014ST   DS    CL30                                                     00845000
         ORG   M014ST                                                   00846000
M014STA  DC    CL19'BLS18014I SYS1.DUMP'                                00847000
M014STB  DC    CL2' '                                                   00848000
M014STC  DC    CL9' IS EMPTY'                                           00849000
         ORG   M014S+34                                                 00850000
M134     DS    CL27                                                     00851000
         ORG   M134                                                     00852000
M134L    DC    AL2(27)                                                  00853000
@NM00099 DC    X'0000'                                                  00854000
M134T    DS    CL23                                                     00855000
         ORG   M134T                                                    00856000
M134TA   DC    CL23'BLS18134I INVALID DSORG'                            00857000
         ORG   M134+27                                                  00858000
         DS    CL1                                                      00859000
TSHS     DS    CL7                                                      00860000
         ORG   TSHS                                                     00861000
TSHS$$   DC    X'0004'                                                  00862000
TSHS$#   DC    AL2(1)                                                   00863000
TSHSA    DS    CL3                                                      00864000
         ORG   TSHSA                                                    00865000
TSHSAL   DC    AL2(1)                                                   00866000
TSHSAT   DS    CL1                                                      00867000
         ORG   TSHSAT                                                   00868000
TSHSATA  DC    X'08'                                                    00869000
         ORG   TSHS+7                                                   00870000
TSHS$9   DS    0C                                                       00871000
         ORG   TSHS+7                                                   00872000
         DS    CL1                                                      00873000
TKES     DS    CL7                                                      00874000
         ORG   TKES                                                     00875000
TKES$$   DC    X'0005'                                                  00876000
TKES$#   DC    AL2(1)                                                   00877000
TKESA    DS    CL3                                                      00878000
         ORG   TKESA                                                    00879000
TKESAL   DC    AL2(1)                                                   00880000
TKESAT   DS    CL1                                                      00881000
         ORG   TKESAT                                                   00882000
TKESATA  DC    X'08'                                                    00883000
         ORG   TKES+7                                                   00884000
TKES$9   DS    0C                                                       00885000
         ORG   TKES+7                                                   00886000
         DS    CL1                                                      00887000
TDSS     DS    CL17                                                     00888000
         ORG   TDSS                                                     00889000
TDSS$$   DC    X'0002'                                                  00890000
TDSS$#   DC    AL2(1)                                                   00891000
TDSSA    DS    CL13                                                     00892000
         ORG   TDSSA                                                    00893000
TDSSAL   DC    AL2(11)                                                  00894000
TDSSAT   DS    CL11                                                     00895000
         ORG   TDSSAT                                                   00896000
TDSSATA  DC    CL9'SYS1.DUMP'                                           00897000
TDSSATB  DC    CL2' '                                                   00898000
         ORG   TDSS+17                                                  00899000
TDSS$9   DS    0C                                                       00900000
         ORG   TDSS+17                                                  00901000
         DS    CL1                                                      00902000
TDDS     DS    CL14                                                     00903000
         ORG   TDDS                                                     00904000
TDDS$$   DC    X'0055'                                                  00905000
TDDS$#   DC    AL2(1)                                                   00906000
TDDSA    DS    CL10                                                     00907000
         ORG   TDDSA                                                    00908000
TDDSAL   DC    AL2(8)                                                   00909000
TDDSAT   DS    CL8                                                      00910000
         ORG   TDDSAT                                                   00911000
TDDSATA  DC    CL8' '                                                   00912000
         ORG   TDDS+14                                                  00913000
TDDS$9   DS    0C                                                       00914000
         ORG   TDDS+14                                                  00915000
TDOS     DS    CL8                                                      00916000
         ORG   TDOS                                                     00917000
TDOS$$   DC    X'0057'                                                  00918000
TDOS$#   DC    AL2(1)                                                   00919000
TDOSA    DS    CL4                                                      00920000
         ORG   TDOSA                                                    00921000
TDOSAL   DC    AL2(2)                                                   00922000
TDOSAT   DS    CL2                                                      00923000
         ORG   TDOSAT                                                   00924000
TDOSATA  DC    CL2' '                                                   00925000
         ORG   TDOS+8                                                   00926000
TDOS$9   DS    0C                                                       00927000
         ORG   TDOS+8                                                   00928000
         DS    CL2                                                      00929000
LINK     DS    CL8                                                      00930000
         ORG   LINK                                                     00931000
LINK01   DC    X'00'                                                    00932000
LINK02   DC    AL3(@CC02150)                                            00933000
LINK03   DC    X'00'                                                    00934000
LINK04   DC    AL3(0)                                                   00935000
         ORG   LINK+8                                                   00936000
HF       DC    X'0032'                                                  00937000
@DATD    DSECT                                                          00938000
         SPACE 2                                                        00939000
*********************************************************************** 00940000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00941000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 00942000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 00943000
*********************************************************************** 00944000
         SPACE                                                          00945000
BLSRDUSC CSECT                                                          00946000
         ORG                                                            00947000
         DS    0D                                                       00948000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSRDUSC+19)/20+7)/8)CL8'BLSRDUSC'     00949000
@DATD    DSECT                                                          00950000
BLSRDUSC CSECT                                                          00951000
         SPACE 2                                                        00952000
*---------------------------------------------------------------------* 00953000
* SDATA AND ADATA ARE STRUCTURES WHOSE SIZE AND FORMAT ARE IDENTICAL. * 00954000
* AT EXECUTION TIME ADATA IS INITIALIZED BY COPYING AN IMAGE OF SDATA * 00955000
* TO IT                                                               * 00956000
*---------------------------------------------------------------------* 00957000
         SPACE                                                          00958000
SDATA    DS    0F                   BEGINNING OF SDATA STRUCTURE        00959000
SOPEN    OPEN (,),MF=L              OPEN PARAMETER LIST IMAGE           00960000
         DS    0F                                                       00961000
SDCB     DCB   DDNAME=0,DSORG=PS,MACRF=(GL),EODAD=SCANEOD,             *00962000
               RECFM=F,LRECL=4104,BLKSIZE=4104                          00963000
         DS    0F                                                       00964000
SPTPB    PUTLINE OUTPUT=(0,TERM,SINGLE,INFOR),                         *00965000
               TERMPUT=(EDIT,WAIT,NOHOLD,NOBREAK),MF=L                  00966000
SDATAEND DS    0F                   END OF SDATA STRUCTURE              00967000
@DATD    DSECT                                                          00968000
ADATA    DS    0F                   BEGINNING OF ADATA STRUCTURE        00969000
AOPEN    OPEN  (,),MF=L                                                 00970000
         DS    0F                                                       00971000
ADCB     DCB   DDNAME=0,DSORG=PS,MACRF=(GL),EODAD=SCANEOD,             *00972000
               RECFM=F,LRECL=4104,BLKSIZE=4104                          00973000
         DS    0F                                                       00974000
PTPB     PUTLINE OUTPUT=(0,TERM,SINGLE,INFOR),                         *00975000
               TERMPUT=(EDIT,WAIT,NOHOLD,NOBREAK),MF=L                  00976000
ADATAEND DS    0F                   END OF ADATA STRUCTURE              00977000
@DATD    DSECT                                                          00978000
         SPACE 2                                                        00979000
*********************************************************************** 00980000
* IKJPARM--BEGIN MACROS SPECIFYING COMMAND SYNTAX                     * 00981000
*********************************************************************** 00982000
         SPACE                                                          00983000
BLSRDUSC CSECT                                                          00984000
PC       IKJPARM DSECT=PD                                               00985000
@DATD    DSECT                                                          00986000
BLSRDUSC CSECT                                                          00987000
PNDX     IKJIDENT 'DUMP INDEX',INTEG,RANGE,DEFAULT='0:9',VALIDCK=BLSUVP*00988000
               99                                                       00989000
@DATD    DSECT                                                          00990000
PD       DSECT                                                          00991000
PD99     DS    0C                                                       00992000
BLSRDUSC CSECT                                                          00993000
         IKJENDP                                                        00994000
         SPACE 2                                                        00995000
*********************************************************************** 00996000
* IKJENDP--END SYNTAX DESCRIPTION                                     * 00997000
*********************************************************************** 00998000
         SPACE                                                          00999000
@DATD    DSECT                                                          01000000
         SPACE 2                                                        01001000
*********************************************************************** 01002000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 01003000
*********************************************************************** 01004000
         SPACE                                                          01005000
         DS    0D                                                       01006000
@DATD    DSECT                                                          01007000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01008000
@ENDDATD EQU   *                                                        01009000
BLSRDUSC CSECT                                                          01010000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01011000
@01      EQU   01                                                       01012000
@02      EQU   02                                                       01013000
@03      EQU   03                                                       01014000
@04      EQU   04                                                       01015000
@05      EQU   05                                                       01016000
@06      EQU   06                                                       01017000
@07      EQU   07                                                       01018000
@08      EQU   08                                                       01019000
@09      EQU   09                                                       01020000
@10      EQU   10                                                       01021000
@11      EQU   11                                                       01022000
@12      EQU   12                                                       01023000
@13      EQU   13                                                       01024000
@14      EQU   14                                                       01025000
@15      EQU   15                                                       01026000
K        EQU   @09                                                      01027000
RANGEEND EQU   @04                                                      01028000
RANGEBEG EQU   @08                                                      01029000
J        EQU   @07                                                      01030000
HSDPTR   EQU   @05                                                      01031000
CPPLPTR  EQU   @06                                                      01032000
R1       EQU   @01                                                      01033000
RB       EQU   @11                                                      01034000
RC       EQU   @12                                                      01035000
RD       EQU   @13                                                      01036000
RE       EQU   @14                                                      01037000
RF       EQU   @15                                                      01038000
DCBPTR   EQU   @02                                                      01039000
PDRPTR   EQU   @10                                                      01040000
GPR01P   EQU   @01                                                      01041000
GPR15P   EQU   @15                                                      01042000
GPR01F   EQU   @01                                                      01043000
GPR00F   EQU   @00                                                      01044000
RA       EQU   @10                                                      01045000
R0       EQU   @00                                                      01046000
R2       EQU   @02                                                      01047000
R3       EQU   @03                                                      01048000
R4       EQU   @04                                                      01049000
R5       EQU   @05                                                      01050000
R6       EQU   @06                                                      01051000
R7       EQU   @07                                                      01052000
R8       EQU   @08                                                      01053000
R9       EQU   @09                                                      01054000
PSA      EQU   0                                                        01055000
FLCRNPSW EQU   PSA                                                      01056000
FLCROPSW EQU   PSA+8                                                    01057000
FLCICCW2 EQU   PSA+16                                                   01058000
FLCCVT   EQU   FLCICCW2                                                 01059000
PSAEEPSW EQU   PSA+132                                                  01060000
PSAESPSW EQU   PSA+136                                                  01061000
FLCSVILC EQU   PSAESPSW+1                                               01062000
PSAEPPSW EQU   PSA+140                                                  01063000
FLCPIILC EQU   PSAEPPSW+1                                               01064000
FLCPICOD EQU   PSAEPPSW+2                                               01065000
PSAPICOD EQU   FLCPICOD+1                                               01066000
FLCTEA   EQU   PSAEPPSW+4                                               01067000
FLCPER   EQU   PSA+152                                                  01068000
FLCMCLA  EQU   PSA+168                                                  01069000
FLCIOEL  EQU   FLCMCLA+4                                                01070000
FLCIOA   EQU   FLCMCLA+16                                               01071000
FLCFSA   EQU   FLCMCLA+80                                               01072000
PSASUPER EQU   PSA+552                                                  01073000
PSASUP1  EQU   PSASUPER                                                 01074000
PSASUP2  EQU   PSASUPER+1                                               01075000
PSASUP3  EQU   PSASUPER+2                                               01076000
PSASUP4  EQU   PSASUPER+3                                               01077000
PSACLHT  EQU   PSA+640                                                  01078000
PSALKSA  EQU   PSA+696                                                  01079000
PSAHLHI  EQU   PSA+760                                                  01080000
PSADSSFL EQU   PSA+836                                                  01081000
PSADSSF1 EQU   PSADSSFL                                                 01082000
PSADSSF3 EQU   PSADSSFL+2                                               01083000
PSADSSF4 EQU   PSADSSFL+3                                               01084000
PSARSVT  EQU   PSA+896                                                  01085000
SA       EQU   0                                                        01086000
SA1      EQU   SA                                                       01087000
SAR      EQU   SA+12                                                    01088000
CVTMAP   EQU   0                                                        01089000
CVTDAR   EQU   CVTMAP+72                                                01090000
CVTFLGS1 EQU   CVTDAR                                                   01091000
CVTDCB   EQU   CVTMAP+116                                               01092000
CVTIOQET EQU   CVTMAP+120                                               01093000
CVTIERLC EQU   CVTMAP+144                                               01094000
CVTHEAD  EQU   CVTMAP+160                                               01095000
CVTSV76C EQU   CVTHEAD                                                  01096000
CVTOPTA  EQU   CVTMAP+182                                               01097000
CVTOPTB  EQU   CVTMAP+183                                               01098000
CVTGTF   EQU   CVTMAP+236                                               01099000
CVTGTFST EQU   CVTGTF                                                   01100000
CVTGTFS  EQU   CVTGTFST                                                 01101000
CVTSTATE EQU   CVTGTFST                                                 01102000
CVTTMODE EQU   CVTGTFST                                                 01103000
CVTFORM  EQU   CVTGTFST                                                 01104000
CVTAQAVT EQU   CVTMAP+240                                               01105000
CVTTCMFG EQU   CVTAQAVT                                                 01106000
CVTVOLM2 EQU   CVTMAP+244                                               01107000
CVTTATA  EQU   CVTVOLM2                                                 01108000
CVTTSKS  EQU   CVTTATA                                                  01109000
CVTVOLF2 EQU   CVTTSKS                                                  01110000
CVTTAT   EQU   CVTTATA+1                                                01111000
CVTATER  EQU   CVTMAP+248                                               01112000
CVTEXT1  EQU   CVTMAP+252                                               01113000
CVTPURG  EQU   CVTMAP+260                                               01114000
CVTQMSG  EQU   CVTMAP+268                                               01115000
CVTDMSR  EQU   CVTMAP+272                                               01116000
CVTRSV37 EQU   CVTDMSR                                                  01117000
CVTDMSRF EQU   CVTRSV37                                                 01118000
CVTERPV  EQU   CVTMAP+316                                               01119000
CVTINTLA EQU   CVTMAP+320                                               01120000
CVTAPF   EQU   CVTMAP+324                                               01121000
CVTEXT2  EQU   CVTMAP+328                                               01122000
CVTHJES  EQU   CVTMAP+332                                               01123000
CVTPGSIA EQU   CVTMAP+348                                               01124000
CVTA1F1  EQU   CVTMAP+356                                               01125000
CVTSYSK  EQU   CVTMAP+357                                               01126000
CVTVOLM1 EQU   CVTMAP+380                                               01127000
CVTVOLF1 EQU   CVTVOLM1                                                 01128000
CVTATMCT EQU   CVTMAP+388                                               01129000
CVTXTNT1 EQU   0                                                        01130000
CVTXTNT2 EQU   0                                                        01131000
CVTDSSV  EQU   CVTXTNT2                                                 01132000
CVTFLGBT EQU   CVTXTNT2+5                                               01133000
CVTQID   EQU   CVTXTNT2+24                                              01134000
CVTRV400 EQU   CVTXTNT2+52                                              01135000
CVTRV409 EQU   CVTXTNT2+53                                              01136000
CVTATCVT EQU   CVTXTNT2+64                                              01137000
CVTRV429 EQU   CVTXTNT2+84                                              01138000
CVTRV438 EQU   CVTXTNT2+85                                              01139000
CVTRV457 EQU   CVTXTNT2+112                                             01140000
CVTRV466 EQU   CVTXTNT2+113                                             01141000
CVTFIX   EQU   0                                                        01142000
CVTRELNO EQU   CVTFIX+252                                               01143000
IKJPARS  EQU   0                                                        01144000
IKJPUTL  EQU   0                                                        01145000
IHADCB   EQU   0                                                        01146000
IHADCS00 EQU   0                                                        01147000
DCBFDAD  EQU   IHADCS00+5                                               01148000
IHADCS01 EQU   0                                                        01149000
DCBDVTBL EQU   IHADCS01                                                 01150000
IHADCS11 EQU   0                                                        01151000
DCBRELB  EQU   IHADCS11                                                 01152000
DCBREL   EQU   DCBRELB+1                                                01153000
DCBBUFCB EQU   IHADCS11+4                                               01154000
DCBDSORG EQU   IHADCS11+10                                              01155000
DCBDSRG1 EQU   DCBDSORG                                                 01156000
DCBDSRG2 EQU   DCBDSORG+1                                               01157000
DCBIOBAD EQU   IHADCS11+12                                              01158000
DCBODEB  EQU   DCBIOBAD                                                 01159000
DCBLNP   EQU   DCBODEB                                                  01160000
DCBQSLM  EQU   DCBLNP                                                   01161000
DCBIOBAA EQU   DCBODEB+1                                                01162000
IHADCS50 EQU   0                                                        01163000
DCBSVCXL EQU   IHADCS50                                                 01164000
DCBEODAD EQU   IHADCS50+4                                               01165000
DCBBFALN EQU   DCBEODAD                                                 01166000
DCBHIARC EQU   DCBBFALN                                                 01167000
DCBBFTEK EQU   DCBHIARC                                                 01168000
DCBBFT   EQU   DCBBFTEK                                                 01169000
DCBEXLST EQU   IHADCS50+8                                               01170000
DCBRECFM EQU   DCBEXLST                                                 01171000
DCBRECLA EQU   DCBRECFM                                                 01172000
IHADCS24 EQU   0                                                        01173000
DCBDDNAM EQU   IHADCS24                                                 01174000
DCBOFLGS EQU   IHADCS24+8                                               01175000
DCBOFLWR EQU   DCBOFLGS                                                 01176000
DCBOFOPN EQU   DCBOFLGS                                                 01177000
DCBIFLG  EQU   IHADCS24+9                                               01178000
DCBIBPCT EQU   DCBIFLG                                                  01179000
DCBMACR  EQU   IHADCS24+10                                              01180000
DCBMACR1 EQU   DCBMACR                                                  01181000
DCBMRFE  EQU   DCBMACR1                                                 01182000
DCBMRGET EQU   DCBMRFE                                                  01183000
DCBMRAPG EQU   DCBMACR1                                                 01184000
DCBMRRD  EQU   DCBMRAPG                                                 01185000
DCBMRCI  EQU   DCBMACR1                                                 01186000
DCBMRMVG EQU   DCBMRCI                                                  01187000
DCBMRLCG EQU   DCBMACR1                                                 01188000
DCBMRABC EQU   DCBMACR1                                                 01189000
DCBMRPT1 EQU   DCBMRABC                                                 01190000
DCBMRSBG EQU   DCBMRPT1                                                 01191000
DCBMRCRL EQU   DCBMACR1                                                 01192000
DCBMRCHK EQU   DCBMRCRL                                                 01193000
DCBMRRDX EQU   DCBMRCHK                                                 01194000
DCBMRDMG EQU   DCBMACR1                                                 01195000
DCBMACR2 EQU   DCBMACR+1                                                01196000
DCBMRPUT EQU   DCBMACR2                                                 01197000
DCBMRWRT EQU   DCBMACR2                                                 01198000
DCBMRMVP EQU   DCBMACR2                                                 01199000
DCBMR5WD EQU   DCBMACR2                                                 01200000
DCBMRLDM EQU   DCBMR5WD                                                 01201000
DCBMRLCP EQU   DCBMRLDM                                                 01202000
DCBMR4WD EQU   DCBMACR2                                                 01203000
DCBMRPT2 EQU   DCBMR4WD                                                 01204000
DCBMRTMD EQU   DCBMRPT2                                                 01205000
DCBMR3WD EQU   DCBMACR2                                                 01206000
DCBMRCTL EQU   DCBMR3WD                                                 01207000
DCBMRSTK EQU   DCBMRCTL                                                 01208000
DCBMR1WD EQU   DCBMACR2                                                 01209000
DCBMRSWA EQU   DCBMR1WD                                                 01210000
DCBMRDMD EQU   DCBMRSWA                                                 01211000
IHADCS25 EQU   0                                                        01212000
DCBMACRF EQU   IHADCS25+2                                               01213000
DCBMACF1 EQU   DCBMACRF                                                 01214000
DCBMFFE  EQU   DCBMACF1                                                 01215000
DCBMFGET EQU   DCBMFFE                                                  01216000
DCBMFAPG EQU   DCBMACF1                                                 01217000
DCBMFRD  EQU   DCBMFAPG                                                 01218000
DCBMFCI  EQU   DCBMACF1                                                 01219000
DCBMFMVG EQU   DCBMFCI                                                  01220000
DCBMFLCG EQU   DCBMACF1                                                 01221000
DCBMFABC EQU   DCBMACF1                                                 01222000
DCBMFPT1 EQU   DCBMFABC                                                 01223000
DCBMFSBG EQU   DCBMFPT1                                                 01224000
DCBMFCRL EQU   DCBMACF1                                                 01225000
DCBMFCHK EQU   DCBMFCRL                                                 01226000
DCBMFDMG EQU   DCBMACF1                                                 01227000
DCBMACF2 EQU   DCBMACRF+1                                               01228000
DCBMFPUT EQU   DCBMACF2                                                 01229000
DCBMFWRT EQU   DCBMACF2                                                 01230000
DCBMFMVP EQU   DCBMACF2                                                 01231000
DCBMF5WD EQU   DCBMACF2                                                 01232000
DCBMFLDM EQU   DCBMF5WD                                                 01233000
DCBMFLCP EQU   DCBMFLDM                                                 01234000
DCBMF4WD EQU   DCBMACF2                                                 01235000
DCBMFPT2 EQU   DCBMF4WD                                                 01236000
DCBMFTMD EQU   DCBMFPT2                                                 01237000
DCBMF3WD EQU   DCBMACF2                                                 01238000
DCBMFCTL EQU   DCBMF3WD                                                 01239000
DCBMFSTK EQU   DCBMFCTL                                                 01240000
DCBMF1WD EQU   DCBMACF2                                                 01241000
DCBMFSWA EQU   DCBMF1WD                                                 01242000
DCBMFDMD EQU   DCBMFSWA                                                 01243000
DCBDEBAD EQU   IHADCS25+4                                               01244000
DCBIFLGS EQU   DCBDEBAD                                                 01245000
DCBIFPCT EQU   DCBIFLGS                                                 01246000
IHADCS27 EQU   0                                                        01247000
DCBGET   EQU   IHADCS27                                                 01248000
DCBPUT   EQU   DCBGET                                                   01249000
DCBGETA  EQU   DCBPUT+1                                                 01250000
IHADCS36 EQU   0                                                        01251000
DCBGERR  EQU   IHADCS36                                                 01252000
DCBPERR  EQU   DCBGERR                                                  01253000
DCBCHECK EQU   DCBPERR                                                  01254000
DCBOPTCD EQU   DCBCHECK                                                 01255000
DCBOPTH  EQU   DCBOPTCD                                                 01256000
DCBOPTO  EQU   DCBOPTH                                                  01257000
DCBOPTZ  EQU   DCBOPTCD                                                 01258000
DCBGERRA EQU   DCBCHECK+1                                               01259000
DCBPERRA EQU   DCBGERRA                                                 01260000
DCBSYNAD EQU   IHADCS36+4                                               01261000
DCBCIND1 EQU   IHADCS36+8                                               01262000
DCBCIND2 EQU   IHADCS36+9                                               01263000
DCBIOBA  EQU   IHADCS36+16                                              01264000
DCBCICB  EQU   DCBIOBA                                                  01265000
IHADCS52 EQU   0                                                        01266000
DCBDIRCT EQU   IHADCS52                                                 01267000
DCBQSWS  EQU   DCBDIRCT                                                 01268000
DCBUSASI EQU   DCBQSWS                                                  01269000
DCBQADFS EQU   DCBUSASI                                                 01270000
DCBBUFOF EQU   DCBDIRCT+1                                               01271000
IHADCS37 EQU   0                                                        01272000
DCBFLAG1 EQU   IHADCS37                                                 01273000
IHADCS40 EQU   0                                                        01274000
DCBEOBAD EQU   IHADCS40                                                 01275000
DCBCCCW  EQU   IHADCS40+4                                               01276000
DCBRECAD EQU   DCBCCCW                                                  01277000
DCBRECBT EQU   DCBRECAD                                                 01278000
DCBRCREL EQU   DCBRECBT                                                 01279000
DCBCNTRL EQU   IHADCS40+12                                              01280000
DCBEROPT EQU   DCBCNTRL                                                 01281000
CPPL     EQU   0                                                        01282000
S99TUPL  EQU   0                                                        01283000
S99TUPTR EQU   S99TUPL                                                  01284000
S99TUP   EQU   0                                                        01285000
S99TUNIT EQU   0                                                        01286000
S99TUENT EQU   S99TUNIT+4                                               01287000
S99TUFLD EQU   0                                                        01288000
HSD      EQU   0                                                        01289000
HSDTYPE  EQU   HSD                                                      01290000
HSDCLA   EQU   HSD+1                                                    01291000
PCCSECT  EQU   0                                                        01292000
PDDSECT  EQU   0                                                        01293000
PDXP     EQU   PDDSECT+1                                                01294000
PDL      EQU   PDDSECT+5                                                01295000
PNDXI1   EQU   0                                                        01296000
PNDXI2   EQU   0                                                        01297000
IKJEFF02 EQU   0                                                        01298000
IKJGETL  EQU   0                                                        01299000
IKJPTGT  EQU   0                                                        01300000
IKJSCAN  EQU   0                                                        01301000
IKJSTCK  EQU   0                                                        01302000
I001C    EQU   0                                                        01303000
I008P    EQU   0                                                        01304000
I015F    EQU   0                                                        01305000
I015P    EQU   0                                                        01306000
I031F    EQU   0                                                        01307000
I031P    EQU   0                                                        01308000
I256C    EQU   0                                                        01309000
PTPBOPUT EQU   PTPB+4                                                   01310000
@NM00088 EQU   PNDX                                                     01311000
PNDXIP   EQU   @NM00088                                                 01312000
PNDXIF   EQU   @NM00088+6                                               01313000
PNDXIFP  EQU   PNDXIF                                                   01314000
CMD      EQU   0                                                        01315000
CMDT     EQU   CMD+4                                                    01316000
UPT      EQU   0                                                        01317000
UPTSWS   EQU   UPT+12                                                   01318000
PSCB     EQU   0                                                        01319000
PSCBATR1 EQU   PSCB+16                                                  01320000
ECT      EQU   0                                                        01321000
ECTSWS   EQU   ECT+28                                                   01322000
ECTSWS2  EQU   ECT+40                                                   01323000
ECTSWS21 EQU   ECTSWS2                                                  01324000
PSARSVTE EQU   PSARSVT                                                  01325000
CVTS01   EQU   CVTPGSIA                                                 01326000
CVTGETL  EQU   CVTS01                                                   01327000
CVTLPDIA EQU   CVTS01+12                                                01328000
CVTDIRST EQU   CVTLPDIA                                                 01329000
CVTSLIDA EQU   CVTS01+24                                                01330000
CVTCTLFG EQU   CVTS01+50                                                01331000
CVTPUTL  EQU   CVTS01+96                                                01332000
CVTPTGT  EQU   CVTS01+116                                               01333000
CVTSTCK  EQU   CVTS01+124                                               01334000
CVTSCAN  EQU   CVTS01+132                                               01335000
CVTPARS  EQU   CVTS01+176                                               01336000
CVTRV210 EQU   CVTS01+424                                               01337000
CVTRV219 EQU   CVTS01+425                                               01338000
CVTRV228 EQU   CVTS01+426                                               01339000
CVTRV237 EQU   CVTS01+427                                               01340000
CVTMFRTR EQU   CVTS01+452                                               01341000
CVTRV262 EQU   CVTS01+468                                               01342000
CVTRV271 EQU   CVTS01+469                                               01343000
CVTRV280 EQU   CVTS01+470                                               01344000
CVTRV289 EQU   CVTS01+471                                               01345000
CVTGSDA  EQU   CVTS01+600                                               01346000
CVTEFF02 EQU   CVTS01+628                                               01347000
HSDH     EQU   HSD                                                      01348000
HSDHTITL EQU   HSDH+20                                                  01349000
HSDHV    EQU   HSD                                                      01350000
HSDHA    EQU   HSD                                                      01351000
HSDC     EQU   HSD                                                      01352000
HSDCSF   EQU   HSDC+2                                                   01353000
HSDCPSA  EQU   HSDC+8                                                   01354000
HSDS     EQU   HSD                                                      01355000
M012B    EQU   M011B                                                    01356000
M012BT   EQU   M012B+4                                                  01357000
M012BTB  EQU   M012BT+34                                                01358000
M013B    EQU   M011B                                                    01359000
M013BT   EQU   M013B+4                                                  01360000
M013BTB  EQU   M013BT+45                                                01361000
M014B    EQU   M011B                                                    01362000
M014BT   EQU   M014B+4                                                  01363000
M014BTB  EQU   M014BT+19                                                01364000
FLC      EQU   PSA                                                      01365000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01366000
M014BTC  EQU   M014BT+21                                                01367000
M014BTA  EQU   M014BT                                                   01368000
@NM00098 EQU   M014B+2                                                  01369000
M014BL   EQU   M014B                                                    01370000
M013BTA  EQU   M013BT                                                   01371000
@NM00096 EQU   M013B+2                                                  01372000
M013BL   EQU   M013B                                                    01373000
M012BTA  EQU   M012BT                                                   01374000
@NM00094 EQU   M012B+2                                                  01375000
M012BL   EQU   M012B                                                    01376000
HSDSC    EQU   HSDS+8                                                   01377000
HSDSP    EQU   HSDS+4                                                   01378000
HSDSASI  EQU   HSDS+2                                                   01379000
HSDSK2   EQU   HSDS+1                                                   01380000
HSDSK1   EQU   HSDS                                                     01381000
@NM00086 EQU   HSDCPSA+552                                              01382000
HSDCASCO EQU   HSDCPSA+548                                              01383000
HSDCASCN EQU   HSDCPSA+544                                              01384000
HSDCTCBO EQU   HSDCPSA+540                                              01385000
HSDCTCBN EQU   HSDCPSA+536                                              01386000
HSDCLCCR EQU   HSDCPSA+532                                              01387000
HSDCLCCV EQU   HSDCPSA+528                                              01388000
HSDCPCCR EQU   HSDCPSA+524                                              01389000
HSDCPCCV EQU   HSDCPSA+520                                              01390000
HSDCLADD EQU   HSDCPSA+518                                              01391000
HSDCPADD EQU   HSDCPSA+516                                              01392000
HSDCPSID EQU   HSDCPSA+512                                              01393000
HSDCTLR  EQU   HSDCPSA+448                                              01394000
HSDCGPR  EQU   HSDCPSA+384                                              01395000
HSDCFPR  EQU   HSDCPSA+352                                              01396000
HSDCADDR EQU   HSDCPSA+350                                              01397000
@NM00085 EQU   HSDCPSA+268                                              01398000
HSDCPREF EQU   HSDCPSA+264                                              01399000
HSDCLPSW EQU   HSDCPSA+256                                              01400000
@NM00084 EQU   HSDCPSA                                                  01401000
HSDCSCPU EQU   HSDC+6                                                   01402000
@NM00083 EQU   HSDC+4                                                   01403000
@NM00082 EQU   HSDCSF                                                   01404000
HSDCSFR  EQU   HSDCSF                                                   01405000
HSDCSFI  EQU   HSDCSF                                                   01406000
HSDCSFU  EQU   HSDCSF                                                   01407000
HSDCCLA  EQU   HSDC+1                                                   01408000
HSDCTYPE EQU   HSDC                                                     01409000
@NM00081 EQU   HSDHA+132                                                01410000
HSDHACAW EQU   HSDHA+128                                                01411000
HSDHACSW EQU   HSDHA+120                                                01412000
@NM00080 EQU   HSDHA+20                                                 01413000
@NM00079 EQU   HSDHA+12                                                 01414000
@NM00078 EQU   HSDHA+4                                                  01415000
@NM00077 EQU   HSDHA+2                                                  01416000
@NM00076 EQU   HSDHA+1                                                  01417000
@NM00075 EQU   HSDHA                                                    01418000
@NM00074 EQU   HSDHV+292                                                01419000
HSDHVCVT EQU   HSDHV+288                                                01420000
HSDHVPSW EQU   HSDHV+280                                                01421000
HSDHVCR  EQU   HSDHV+216                                                01422000
HSDHVGPR EQU   HSDHV+152                                                01423000
HSDHVFPR EQU   HSDHV+120                                                01424000
@NM00073 EQU   HSDHV+20                                                 01425000
@NM00072 EQU   HSDHV+12                                                 01426000
@NM00071 EQU   HSDHV+4                                                  01427000
@NM00070 EQU   HSDHV+2                                                  01428000
@NM00069 EQU   HSDHV+1                                                  01429000
@NM00068 EQU   HSDHV                                                    01430000
@NM00067 EQU   HSDH+120                                                 01431000
HSDHTOD  EQU   HSDH+12                                                  01432000
HSDHPROG EQU   HSDH+4                                                   01433000
HSDHASI  EQU   HSDH+2                                                   01434000
HSDHCLA  EQU   HSDH+1                                                   01435000
HSDHTYPE EQU   HSDH                                                     01436000
CVTRV628 EQU   CVTS01+728                                               01437000
CVTRV627 EQU   CVTS01+724                                               01438000
CVTRV626 EQU   CVTS01+720                                               01439000
CVTRV625 EQU   CVTS01+716                                               01440000
CVTRV624 EQU   CVTS01+712                                               01441000
CVTRV623 EQU   CVTS01+708                                               01442000
CVTRV622 EQU   CVTS01+704                                               01443000
CVTRV621 EQU   CVTS01+700                                               01444000
CVTIHASU EQU   CVTS01+696                                               01445000
CVTSUSP  EQU   CVTS01+692                                               01446000
CVTT6SVC EQU   CVTS01+688                                               01447000
CVTCDAL  EQU   CVTS01+684                                               01448000
CVTTCTL  EQU   CVTS01+680                                               01449000
CVTRSUME EQU   CVTS01+676                                               01450000
CVTJTERM EQU   CVTS01+672                                               01451000
CVTASMRM EQU   CVTS01+668                                               01452000
CVTTCASP EQU   CVTS01+664                                               01453000
CVT0PT03 EQU   CVTS01+660                                               01454000
CVT0PT0E EQU   CVTS01+656                                               01455000
CVTRV609 EQU   CVTS01+652                                               01456000
CVTCGK   EQU   CVTS01+648                                               01457000
CVTRAC   EQU   CVTS01+644                                               01458000
CVTHSM   EQU   CVTS01+640                                               01459000
CVTRV605 EQU   CVTS01+636                                               01460000
CVTRV604 EQU   CVTS01+632                                               01461000
CVTCBBR  EQU   CVTS01+624                                               01462000
CVTSSCR  EQU   CVTS01+620                                               01463000
CVTEVENT EQU   CVTS01+616                                               01464000
CVTCRCA  EQU   CVTS01+612                                               01465000
CVTTPIO  EQU   CVTS01+608                                               01466000
CVTADV   EQU   CVTS01+604                                               01467000
CVTGSDAB EQU   CVTGSDA                                                  01468000
CVTQV3   EQU   CVTS01+596                                               01469000
CVTQV2   EQU   CVTS01+592                                               01470000
CVTQV1   EQU   CVTS01+588                                               01471000
CVTRPT   EQU   CVTS01+584                                               01472000
CVTSSRB  EQU   CVTS01+580                                               01473000
CVTCSDRL EQU   CVTS01+576                                               01474000
CVTEXP1  EQU   CVTS01+572                                               01475000
CVTRMPMT EQU   CVTS01+568                                               01476000
CVTRMPTT EQU   CVTS01+564                                               01477000
CVTVPSA  EQU   CVTS01+560                                               01478000
CVTVSTOP EQU   CVTS01+556                                               01479000
CVTGTFR8 EQU   CVTS01+552                                               01480000
CVTQUIT  EQU   CVTS01+548                                               01481000
CVTVACR  EQU   CVTS01+544                                               01482000
CVTWTCB  EQU   CVTS01+540                                               01483000
CVTSTPRS EQU   CVTS01+536                                               01484000
CVT0PT02 EQU   CVTS01+532                                               01485000
CVTDARCM EQU   CVTS01+528                                               01486000
CVTIRECM EQU   CVTS01+524                                               01487000
CVTJRECM EQU   CVTS01+520                                               01488000
CVTVEMS0 EQU   CVTS01+516                                               01489000
CVTSPFRR EQU   CVTS01+512                                               01490000
CVTRLSTG EQU   CVTS01+508                                               01491000
CVT0TC0A EQU   CVTS01+504                                               01492000
CVTGMBR  EQU   CVTS01+500                                               01493000
CVTLFRM  EQU   CVTS01+496                                               01494000
CVTRMBR  EQU   CVTS01+492                                               01495000
CVTVIOP  EQU   CVTS01+488                                               01496000
CVTRV307 EQU   CVTS01+486                                               01497000
CVTRV306 EQU   CVTS01+484                                               01498000
CVTRV305 EQU   CVTS01+482                                               01499000
CVTRV304 EQU   CVTS01+480                                               01500000
CVTRV303 EQU   CVTS01+478                                               01501000
CVTRV302 EQU   CVTS01+476                                               01502000
CVTTRCA  EQU   CVTS01+472                                               01503000
CVTRV297 EQU   CVTRV289                                                 01504000
CVTRV296 EQU   CVTRV289                                                 01505000
CVTRV295 EQU   CVTRV289                                                 01506000
CVTRV294 EQU   CVTRV289                                                 01507000
CVTRV293 EQU   CVTRV289                                                 01508000
CVTRV292 EQU   CVTRV289                                                 01509000
CVTRV291 EQU   CVTRV289                                                 01510000
CVTRV290 EQU   CVTRV289                                                 01511000
CVTRV288 EQU   CVTRV280                                                 01512000
CVTRV287 EQU   CVTRV280                                                 01513000
CVTRV286 EQU   CVTRV280                                                 01514000
CVTRV285 EQU   CVTRV280                                                 01515000
CVTRV284 EQU   CVTRV280                                                 01516000
CVTRV283 EQU   CVTRV280                                                 01517000
CVTRV282 EQU   CVTRV280                                                 01518000
CVTRV281 EQU   CVTRV280                                                 01519000
CVTRV279 EQU   CVTRV271                                                 01520000
CVTRV278 EQU   CVTRV271                                                 01521000
CVTRV277 EQU   CVTRV271                                                 01522000
CVTRV276 EQU   CVTRV271                                                 01523000
CVTRV275 EQU   CVTRV271                                                 01524000
CVTRV274 EQU   CVTRV271                                                 01525000
CVTRV273 EQU   CVTRV271                                                 01526000
CVTRV272 EQU   CVTRV271                                                 01527000
CVTRV270 EQU   CVTRV262                                                 01528000
CVTRV269 EQU   CVTRV262                                                 01529000
CVTRV268 EQU   CVTRV262                                                 01530000
CVTRV267 EQU   CVTRV262                                                 01531000
CVTRV266 EQU   CVTRV262                                                 01532000
CVTRV265 EQU   CVTRV262                                                 01533000
CVTRV264 EQU   CVTRV262                                                 01534000
CVTRV263 EQU   CVTRV262                                                 01535000
CVTVFP   EQU   CVTS01+464                                               01536000
CVTVSI   EQU   CVTS01+460                                               01537000
CVTVPSIB EQU   CVTS01+456                                               01538000
CVTMFACT EQU   CVTMFRTR                                                 01539000
CVTMFCTL EQU   CVTS01+448                                               01540000
CVTPVBP  EQU   CVTS01+444                                               01541000
CVTPWI   EQU   CVTS01+440                                               01542000
CVTRV254 EQU   CVTS01+438                                               01543000
CVTRV253 EQU   CVTS01+436                                               01544000
CVTRV252 EQU   CVTS01+434                                               01545000
CVTRV251 EQU   CVTS01+433                                               01546000
CVTRV250 EQU   CVTS01+432                                               01547000
CVTRV249 EQU   CVTS01+431                                               01548000
CVTRV248 EQU   CVTS01+430                                               01549000
CVTRV247 EQU   CVTS01+429                                               01550000
CVTRV246 EQU   CVTS01+428                                               01551000
CVTRV245 EQU   CVTRV237                                                 01552000
CVTRV244 EQU   CVTRV237                                                 01553000
CVTRV243 EQU   CVTRV237                                                 01554000
CVTRV242 EQU   CVTRV237                                                 01555000
CVTRV241 EQU   CVTRV237                                                 01556000
CVTRV240 EQU   CVTRV237                                                 01557000
CVTRV239 EQU   CVTRV237                                                 01558000
CVTRV238 EQU   CVTRV237                                                 01559000
CVTRV236 EQU   CVTRV228                                                 01560000
CVTRV235 EQU   CVTRV228                                                 01561000
CVTRV234 EQU   CVTRV228                                                 01562000
CVTRV233 EQU   CVTRV228                                                 01563000
CVTRV232 EQU   CVTRV228                                                 01564000
CVTRV231 EQU   CVTRV228                                                 01565000
CVTRV230 EQU   CVTRV228                                                 01566000
CVTRV229 EQU   CVTRV228                                                 01567000
CVTRV227 EQU   CVTRV219                                                 01568000
CVTRV226 EQU   CVTRV219                                                 01569000
CVTRV225 EQU   CVTRV219                                                 01570000
CVTRV224 EQU   CVTRV219                                                 01571000
CVTRV223 EQU   CVTRV219                                                 01572000
CVTRV222 EQU   CVTRV219                                                 01573000
CVTRV221 EQU   CVTRV219                                                 01574000
CVTRV220 EQU   CVTRV219                                                 01575000
CVTRV218 EQU   CVTRV210                                                 01576000
CVTRV217 EQU   CVTRV210                                                 01577000
CVTRV216 EQU   CVTRV210                                                 01578000
CVTRV215 EQU   CVTRV210                                                 01579000
CVTRV214 EQU   CVTRV210                                                 01580000
CVTRV213 EQU   CVTRV210                                                 01581000
CVTRV212 EQU   CVTRV210                                                 01582000
CVTRV211 EQU   CVTRV210                                                 01583000
CVTLCCAT EQU   CVTS01+420                                               01584000
CVTPCCAT EQU   CVTS01+416                                               01585000
CVTIPCRP EQU   CVTS01+412                                               01586000
CVTIPCRI EQU   CVTS01+408                                               01587000
CVTIPCDS EQU   CVTS01+404                                               01588000
CVTAIDVT EQU   CVTS01+400                                               01589000
CVTSSAP  EQU   CVTS01+396                                               01590000
CVTEHCIR EQU   CVTS01+392                                               01591000
CVTEHDEF EQU   CVTS01+388                                               01592000
CVTDAIR  EQU   CVTS01+384                                               01593000
CVTPERFM EQU   CVTS01+380                                               01594000
CVT044R2 EQU   CVTS01+376                                               01595000
CVTFETCH EQU   CVTS01+372                                               01596000
CVTRSTWD EQU   CVTS01+368                                               01597000
CVTSPOST EQU   CVTS01+364                                               01598000
CVTIOBP  EQU   CVTS01+360                                               01599000
CVTASMVT EQU   CVTS01+356                                               01600000
CVTRECRQ EQU   CVTS01+352                                               01601000
CVTWSAC  EQU   CVTS01+348                                               01602000
CVTRV149 EQU   CVTS01+344                                               01603000
CVTWSAL  EQU   CVTS01+340                                               01604000
CVTSPSA  EQU   CVTS01+336                                               01605000
CVTGLMN  EQU   CVTS01+332                                               01606000
CVTVEAC0 EQU   CVTS01+328                                               01607000
CVT062R1 EQU   CVTS01+324                                               01608000
CVTRPOST EQU   CVTS01+320                                               01609000
CVTDQIQE EQU   CVTS01+316                                               01610000
CVTCSD   EQU   CVTS01+312                                               01611000
CVTLKRMA EQU   CVTS01+308                                               01612000
CVTRSPIE EQU   CVTS01+304                                               01613000
CVTRENQ  EQU   CVTS01+300                                               01614000
CVTLQCB  EQU   CVTS01+296                                               01615000
CVTFQCB  EQU   CVTS01+292                                               01616000
CVTQCS01 EQU   CVTS01+288                                               01617000
CVTAPFT  EQU   CVTS01+284                                               01618000
CVTPARRL EQU   CVTS01+280                                               01619000
CVTVWAIT EQU   CVTS01+276                                               01620000
CVTGSPL  EQU   CVTS01+272                                               01621000
CVTLSMQ  EQU   CVTS01+268                                               01622000
CVTGSMQ  EQU   CVTS01+264                                               01623000
CVTEXPRO EQU   CVTS01+260                                               01624000
CVTOPCTP EQU   CVTS01+256                                               01625000
CVTSIC   EQU   CVTS01+252                                               01626000
CVTTPIOS EQU   CVTS01+248                                               01627000
CVTRTMS  EQU   CVTS01+244                                               01628000
CVTSDBF  EQU   CVTS01+240                                               01629000
CVTSCBP  EQU   CVTS01+236                                               01630000
CVTSDMP  EQU   CVTS01+232                                               01631000
CVTSV60  EQU   CVTS01+228                                               01632000
CVTRTMCT EQU   CVTS01+224                                               01633000
CVTASCBL EQU   CVTS01+220                                               01634000
CVTASCBH EQU   CVTS01+216                                               01635000
CVTGDA   EQU   CVTS01+212                                               01636000
CVTASVT  EQU   CVTS01+208                                               01637000
CVTVVMDI EQU   CVTS01+204                                               01638000
CVTAQTOP EQU   CVTS01+200                                               01639000
CVTIOSCS EQU   CVTS01+196                                               01640000
CVTSDRM  EQU   CVTS01+192                                               01641000
CVTOPTE  EQU   CVTS01+188                                               01642000
CVTSTXU  EQU   CVTS01+184                                               01643000
CVTQUIS  EQU   CVTS01+180                                               01644000
CVTS1EE  EQU   CVTS01+172                                               01645000
CVTFRAS  EQU   CVTS01+168                                               01646000
CVTQSAS  EQU   CVTS01+164                                               01647000
CVTCRAS  EQU   CVTS01+160                                               01648000
CVTCRMN  EQU   CVTS01+156                                               01649000
CVTDELCP EQU   CVTS01+152                                               01650000
CVTFRECL EQU   CVTS01+148                                               01651000
CVTGETCL EQU   CVTS01+144                                               01652000
CVTBLDCP EQU   CVTS01+140                                               01653000
CVTAUTHL EQU   CVTS01+136                                               01654000
CVTRV144 EQU   CVTS01+130                                               01655000
CVTMAXMP EQU   CVTS01+128                                               01656000
CVTRV139 EQU   CVTS01+123                                               01657000
CVTDSSAC EQU   CVTS01+122                                               01658000
CVTRV513 EQU   CVTS01+121                                               01659000
CVTIOSPL EQU   CVTS01+120                                               01660000
CVTCSPIE EQU   CVTS01+112                                               01661000
CVTSMFEX EQU   CVTS01+108                                               01662000
CVTOLT0A EQU   CVTS01+104                                               01663000
CVTSRBRT EQU   CVTS01+100                                               01664000
CVTASCRL EQU   CVTS01+92                                                01665000
CVTASCRF EQU   CVTS01+88                                                01666000
CVTRV326 EQU   CVTS01+84                                                01667000
CVTRV325 EQU   CVTS01+80                                                01668000
CVTRV324 EQU   CVTS01+76                                                01669000
CVT0VL01 EQU   CVTS01+72                                                01670000
CVTSHRVM EQU   CVTS01+68                                                01671000
CVTRV332 EQU   CVTS01+64                                                01672000
CVTTAS   EQU   CVTS01+60                                                01673000
CVTRSCN  EQU   CVTS01+56                                                01674000
CVTTRAC2 EQU   CVTS01+54                                                01675000
CVTTRACE EQU   CVTS01+52                                                01676000
CVTAPG   EQU   CVTS01+51                                                01677000
CVTSDTRC EQU   CVTCTLFG                                                 01678000
CVTGTRCE EQU   CVTCTLFG                                                 01679000
CVTNOMP  EQU   CVTCTLFG                                                 01680000
CVTRSV79 EQU   CVTCTLFG                                                 01681000
CVTDSTAT EQU   CVTCTLFG                                                 01682000
CVTRSV78 EQU   CVTCTLFG                                                 01683000
CVTRV333 EQU   CVTCTLFG                                                 01684000
CVTRV323 EQU   CVTCTLFG                                                 01685000
CVTSPVLK EQU   CVTS01+49                                                01686000
CVTRSV77 EQU   CVTS01+48                                                01687000
CVTRV331 EQU   CVTS01+44                                                01688000
CVTRV330 EQU   CVTS01+40                                                01689000
CVTRV329 EQU   CVTS01+36                                                01690000
CVTRV328 EQU   CVTS01+32                                                01691000
CVTRV322 EQU   CVTS01+28                                                01692000
CVTSLID  EQU   CVTSLIDA+1                                               01693000
CVTSYLK  EQU   CVTSLIDA                                                 01694000
CVTRV321 EQU   CVTS01+20                                                01695000
CVTRV320 EQU   CVTS01+16                                                01696000
CVTLPDIR EQU   CVTLPDIA+1                                               01697000
CVTRSV69 EQU   CVTDIRST                                                 01698000
CVTRSV68 EQU   CVTDIRST                                                 01699000
CVTRSV67 EQU   CVTDIRST                                                 01700000
CVTRSV66 EQU   CVTDIRST                                                 01701000
CVTRSV65 EQU   CVTDIRST                                                 01702000
CVTRSV64 EQU   CVTDIRST                                                 01703000
CVTRSV63 EQU   CVTDIRST                                                 01704000
CVTDICOM EQU   CVTDIRST                                                 01705000
CVTPVTP  EQU   CVTS01+8                                                 01706000
CVTLPDSR EQU   CVTS01+4                                                 01707000
PSARSAV  EQU   PSARSVTE+60                                              01708000
PSARSTK  EQU   PSARSVTE+56                                              01709000
PSAESAV3 EQU   PSARSVTE+52                                              01710000
PSAESTK3 EQU   PSARSVTE+48                                              01711000
PSAESAV2 EQU   PSARSVTE+44                                              01712000
PSAESTK2 EQU   PSARSVTE+40                                              01713000
PSAESAV1 EQU   PSARSVTE+36                                              01714000
PSAESTK1 EQU   PSARSVTE+32                                              01715000
PSAPSAV  EQU   PSARSVTE+28                                              01716000
PSAPSTK  EQU   PSARSVTE+24                                              01717000
PSAMSAV  EQU   PSARSVTE+20                                              01718000
PSAMSTK  EQU   PSARSVTE+16                                              01719000
PSASSAV  EQU   PSARSVTE+12                                              01720000
PSASSTK  EQU   PSARSVTE+8                                               01721000
PSANSTK  EQU   PSARSVTE+4                                               01722000
PSACSTK  EQU   PSARSVTE                                                 01723000
@NM00014 EQU   ECT+52                                                   01724000
@NM00013 EQU   ECT+48                                                   01725000
@NM00012 EQU   ECT+44                                                   01726000
@NM00011 EQU   ECTSWS2+1                                                01727000
@NM00010 EQU   ECTSWS21                                                 01728000
ECTTABND EQU   ECTSWS21                                                 01729000
ECTDEFCS EQU   ECTSWS21                                                 01730000
ECTBKPB  EQU   ECT+36                                                   01731000
ECTUSER  EQU   ECT+32                                                   01732000
ECTDDNUM EQU   ECT+29                                                   01733000
ECTATTN  EQU   ECTSWS                                                   01734000
ECTBKGRD EQU   ECTSWS                                                   01735000
ECTNNOT  EQU   ECTSWS                                                   01736000
ECTNMAL  EQU   ECTSWS                                                   01737000
ECTLOGF  EQU   ECTSWS                                                   01738000
ECTATRM  EQU   ECTSWS                                                   01739000
@NM00009 EQU   ECTSWS                                                   01740000
ECTNOPD  EQU   ECTSWS                                                   01741000
ECTSCMD  EQU   ECT+20                                                   01742000
ECTPCMD  EQU   ECT+12                                                   01743000
ECTSMSG  EQU   ECT+9                                                    01744000
ECTMSGF  EQU   ECT+8                                                    01745000
ECTIOWA  EQU   ECT+4                                                    01746000
ECTRTCD  EQU   ECT+1                                                    01747000
ECTRCDF  EQU   ECT                                                      01748000
PSCBU    EQU   PSCB+64                                                  01749000
PSCBRSZ  EQU   PSCB+60                                                  01750000
PSCBLINE EQU   PSCB+59                                                  01751000
PSCBCHAR EQU   PSCB+58                                                  01752000
PSCBUPTL EQU   PSCB+56                                                  01753000
PSCBUPT  EQU   PSCB+52                                                  01754000
PSCBRLGB EQU   PSCB+48                                                  01755000
PSCBDEST EQU   PSCB+40                                                  01756000
@NM00008 EQU   PSCB+36                                                  01757000
@NM00007 EQU   PSCB+32                                                  01758000
@NM00006 EQU   PSCB+28                                                  01759000
PSCBLTI2 EQU   PSCB+24                                                  01760000
PSCBLTIM EQU   PSCB+20                                                  01761000
PSCBATR2 EQU   PSCB+18                                                  01762000
@NM00005 EQU   PSCBATR1                                                 01763000
@NM00004 EQU   PSCBATR1                                                 01764000
@NM00003 EQU   PSCBATR1                                                 01765000
PSCBATTN EQU   PSCBATR1                                                 01766000
PSCBVMNT EQU   PSCBATR1                                                 01767000
PSCBJCL  EQU   PSCBATR1                                                 01768000
PSCBACCT EQU   PSCBATR1                                                 01769000
PSCBCTRL EQU   PSCBATR1                                                 01770000
PSCBGPNM EQU   PSCB+8                                                   01771000
PSCBUSRL EQU   PSCB+7                                                   01772000
PSCBUSER EQU   PSCB                                                     01773000
UPTPREFL EQU   UPT+23                                                   01774000
UPTPREFX EQU   UPT+16                                                   01775000
@NM00002 EQU   UPT+15                                                   01776000
UPTLDEL  EQU   UPT+14                                                   01777000
UPTCDEL  EQU   UPT+13                                                   01778000
UPTWTP   EQU   UPTSWS                                                   01779000
UPTMODE  EQU   UPTSWS                                                   01780000
UPTALD   EQU   UPTSWS                                                   01781000
UPTPAUS  EQU   UPTSWS                                                   01782000
UPTNCOM  EQU   UPTSWS                                                   01783000
UPTMID   EQU   UPTSWS                                                   01784000
UPTNPRM  EQU   UPTSWS                                                   01785000
UPTRCVR  EQU   UPTSWS                                                   01786000
UPTUSER  EQU   UPT+2                                                    01787000
@NM00001 EQU   UPT                                                      01788000
CMDT1    EQU   CMDT                                                     01789000
CMDO     EQU   CMD+2                                                    01790000
CMDL     EQU   CMD                                                      01791000
@NM00090 EQU   PNDX+16                                                  01792000
@NM00089 EQU   @NM00088+7                                               01793000
PNDXIF8  EQU   PNDXIF                                                   01794000
PNDXIF7  EQU   PNDXIF                                                   01795000
PNDXIF6  EQU   PNDXIF                                                   01796000
PNDXIF5  EQU   PNDXIF                                                   01797000
PNDXIF4  EQU   PNDXIF                                                   01798000
PNDXIF3  EQU   PNDXIF                                                   01799000
PNDXIF2  EQU   PNDXIF                                                   01800000
PNDXIL   EQU   @NM00088+4                                               01801000
PTPBFLN  EQU   PTPB+8                                                   01802000
@NM00065 EQU   PTPB                                                     01803000
PDSP     EQU   PDDSECT+4                                                01804000
@NM00087 EQU   PDDSECT                                                  01805000
@NM00066 EQU   HSD+2                                                    01806000
S99TUPRM EQU   S99TUFLD+2                                               01807000
S99TULEN EQU   S99TUFLD                                                 01808000
S99TUPAR EQU   S99TUENT+2                                               01809000
S99TULNG EQU   S99TUENT                                                 01810000
S99TUNUM EQU   S99TUNIT+2                                               01811000
S99TUKEY EQU   S99TUNIT                                                 01812000
S99TUPND EQU   S99TUP                                                   01813000
S99TUPLN EQU   S99TUPTR                                                 01814000
CPPLECT  EQU   CPPL+12                                                  01815000
CPPLPSCB EQU   CPPL+8                                                   01816000
CPPLUPT  EQU   CPPL+4                                                   01817000
CPPLCBUF EQU   CPPL                                                     01818000
DCBEOB   EQU   IHADCS40+20                                              01819000
DCBPRECL EQU   IHADCS40+18                                              01820000
@NM00064 EQU   IHADCS40+16                                              01821000
DCBCNTRA EQU   DCBCNTRL+1                                               01822000
@NM00063 EQU   DCBEROPT                                                 01823000
DCBERABE EQU   DCBEROPT                                                 01824000
DCBERSKP EQU   DCBEROPT                                                 01825000
DCBERACC EQU   DCBEROPT                                                 01826000
DCBLRECL EQU   IHADCS40+10                                              01827000
@NM00062 EQU   IHADCS40+9                                               01828000
@NM00061 EQU   IHADCS40+8                                               01829000
DCBRECA  EQU   DCBRECAD+1                                               01830000
@NM00060 EQU   DCBRECBT                                                 01831000
DCBRCFGT EQU   DCBRCREL                                                 01832000
DCBRCTRU EQU   DCBRCREL                                                 01833000
DCBLCCW  EQU   DCBEOBAD                                                 01834000
@NM00059 EQU   DCBFLAG1                                                 01835000
DCBSTFLS EQU   DCBFLAG1                                                 01836000
DCBSTQCK EQU   DCBFLAG1                                                 01837000
DCBDIRCQ EQU   DCBBUFOF                                                 01838000
DCBQSTRU EQU   DCBUSASI                                                 01839000
@NM00058 EQU   DCBUSASI                                                 01840000
DCBQADF3 EQU   DCBQADFS                                                 01841000
DCBQADF2 EQU   DCBQADFS                                                 01842000
DCBQADF1 EQU   DCBQADFS                                                 01843000
DCBBLBP  EQU   DCBUSASI                                                 01844000
@NM00057 EQU   DCBUSASI                                                 01845000
DCBCICBA EQU   DCBCICB+1                                                01846000
@NM00056 EQU   DCBCICB                                                  01847000
DCBOFFSW EQU   IHADCS36+15                                              01848000
DCBOFFSR EQU   IHADCS36+14                                              01849000
DCBWCPL  EQU   IHADCS36+13                                              01850000
DCBWCPO  EQU   IHADCS36+12                                              01851000
DCBBLKSI EQU   IHADCS36+10                                              01852000
DCBCNQSM EQU   DCBCIND2                                                 01853000
DCBCNFEO EQU   DCBCIND2                                                 01854000
DCBCNCHS EQU   DCBCIND2                                                 01855000
DCBCNBFP EQU   DCBCIND2                                                 01856000
DCBCNIOE EQU   DCBCIND2                                                 01857000
DCBCNCLO EQU   DCBCIND2                                                 01858000
DCBCNWRO EQU   DCBCIND2                                                 01859000
DCBCNSTO EQU   DCBCIND2                                                 01860000
DCBCNEXB EQU   DCBCIND1                                                 01861000
@NM00055 EQU   DCBCIND1                                                 01862000
DCBCNBRM EQU   DCBCIND1                                                 01863000
@NM00054 EQU   DCBCIND1                                                 01864000
DCBCNEVA EQU   DCBCIND1                                                 01865000
DCBCNEVB EQU   DCBCIND1                                                 01866000
DCBCNSRD EQU   DCBCIND1                                                 01867000
DCBCNTOV EQU   DCBCIND1                                                 01868000
DCBSYNA  EQU   DCBSYNAD+1                                               01869000
DCBIOBL  EQU   DCBSYNAD                                                 01870000
DCBCHCKA EQU   DCBPERRA                                                 01871000
DCBOPTJ  EQU   DCBOPTCD                                                 01872000
DCBOPTT  EQU   DCBOPTCD                                                 01873000
DCBSRCHD EQU   DCBOPTZ                                                  01874000
DCBOPTQ  EQU   DCBOPTCD                                                 01875000
DCBBCKPT EQU   DCBOPTO                                                  01876000
DCBOPTC  EQU   DCBOPTCD                                                 01877000
DCBOPTU  EQU   DCBOPTCD                                                 01878000
DCBOPTW  EQU   DCBOPTCD                                                 01879000
DCBPUTA  EQU   DCBGETA                                                  01880000
@NM00053 EQU   DCBPUT                                                   01881000
DCBDEBA  EQU   DCBDEBAD+1                                               01882000
@NM00052 EQU   DCBIFLGS                                                 01883000
DCBIFIOE EQU   DCBIFLGS                                                 01884000
DCBCH12  EQU   DCBIFPCT                                                 01885000
DCBCH9   EQU   DCBIFPCT                                                 01886000
DCBIFEC  EQU   DCBIFLGS                                                 01887000
DCBMFSTI EQU   DCBMFDMD                                                 01888000
DCBMFAWR EQU   DCBMFSTK                                                 01889000
DCBMFUIP EQU   DCBMFTMD                                                 01890000
DCBMFIDW EQU   DCBMFLCP                                                 01891000
DCBMFWRK EQU   DCBMFMVP                                                 01892000
DCBMFRDQ EQU   DCBMFWRT                                                 01893000
DCBMFGTQ EQU   DCBMFPUT                                                 01894000
DCBMFSTL EQU   DCBMACF2                                                 01895000
DCBMFCK  EQU   DCBMFDMG                                                 01896000
DCBMFRDX EQU   DCBMFCHK                                                 01897000
DCBMFDBF EQU   DCBMFSBG                                                 01898000
DCBMFRDI EQU   DCBMFLCG                                                 01899000
DCBMFRDK EQU   DCBMFMVG                                                 01900000
DCBMFWRQ EQU   DCBMFRD                                                  01901000
DCBMFPTQ EQU   DCBMFGET                                                 01902000
DCBMFECP EQU   DCBMACF1                                                 01903000
DCBTIOT  EQU   IHADCS25                                                 01904000
DCBMRSTI EQU   DCBMRDMD                                                 01905000
DCBMRAWR EQU   DCBMRSTK                                                 01906000
DCBMRUIP EQU   DCBMRTMD                                                 01907000
DCBMRIDW EQU   DCBMRLCP                                                 01908000
DCBMRWRK EQU   DCBMRMVP                                                 01909000
DCBMRRDQ EQU   DCBMRWRT                                                 01910000
DCBMRGTQ EQU   DCBMRPUT                                                 01911000
DCBMRSTL EQU   DCBMACR2                                                 01912000
DCBMRCK  EQU   DCBMRDMG                                                 01913000
DCBPGFXA EQU   DCBMRRDX                                                 01914000
DCBMRDBF EQU   DCBMRSBG                                                 01915000
DCBMRRDI EQU   DCBMRLCG                                                 01916000
DCBMRRDK EQU   DCBMRMVG                                                 01917000
DCBMRWRQ EQU   DCBMRRD                                                  01918000
DCBMRPTQ EQU   DCBMRGET                                                 01919000
DCBMRECP EQU   DCBMACR1                                                 01920000
@NM00051 EQU   DCBIFLG                                                  01921000
DCBIBIOE EQU   DCBIFLG                                                  01922000
DCBICH12 EQU   DCBIBPCT                                                 01923000
DCBICH9  EQU   DCBIBPCT                                                 01924000
DCBIBEC  EQU   DCBIFLG                                                  01925000
DCBOFIOF EQU   DCBOFLGS                                                 01926000
DCBOFUEX EQU   DCBOFLGS                                                 01927000
DCBOFTM  EQU   DCBOFLGS                                                 01928000
DCBOFPPC EQU   DCBOFLGS                                                 01929000
DCBOFEOV EQU   DCBOFLGS                                                 01930000
DCBOFLRB EQU   DCBOFLGS                                                 01931000
DCBOFIOD EQU   DCBOFLWR                                                 01932000
DCBEXLSA EQU   DCBEXLST+1                                               01933000
DCBRECKL EQU   DCBRECFM                                                 01934000
DCBRECCC EQU   DCBRECFM                                                 01935000
DCBRECSB EQU   DCBRECFM                                                 01936000
DCBRECBR EQU   DCBRECFM                                                 01937000
DCBRECTO EQU   DCBRECLA                                                 01938000
DCBRECL  EQU   DCBRECLA                                                 01939000
DCBEODA  EQU   DCBEODAD+1                                               01940000
DCBBFA   EQU   DCBBFTEK                                                 01941000
DCBH0    EQU   DCBBFTEK                                                 01942000
DCBBFTKD EQU   DCBBFTEK                                                 01943000
DCBBFTE  EQU   DCBBFT                                                   01944000
DCBBFTKR EQU   DCBBFT                                                   01945000
DCBBFTS  EQU   DCBBFT                                                   01946000
DCBH1    EQU   DCBBFTEK                                                 01947000
DCBSVCXA EQU   DCBSVCXL+1                                               01948000
@NM00050 EQU   DCBSVCXL                                                 01949000
DCBODEBA EQU   DCBIOBAA                                                 01950000
@NM00049 EQU   DCBQSLM                                                  01951000
DCBUPDBT EQU   DCBQSLM                                                  01952000
DCBUPDCM EQU   DCBQSLM                                                  01953000
DCB1DVDS EQU   DCBQSLM                                                  01954000
@NM00048 EQU   DCBDSRG2                                                 01955000
DCBDSGTR EQU   DCBDSRG2                                                 01956000
DCBACBM  EQU   DCBDSRG2                                                 01957000
@NM00047 EQU   DCBDSRG2                                                 01958000
DCBDSGTQ EQU   DCBDSRG2                                                 01959000
DCBDSGTX EQU   DCBDSRG2                                                 01960000
DCBDSGGS EQU   DCBDSRG2                                                 01961000
DCBDSGU  EQU   DCBDSRG1                                                 01962000
DCBDSGPO EQU   DCBDSRG1                                                 01963000
@NM00046 EQU   DCBDSRG1                                                 01964000
@NM00045 EQU   DCBDSRG1                                                 01965000
DCBDSGCX EQU   DCBDSRG1                                                 01966000
DCBDSGDA EQU   DCBDSRG1                                                 01967000
DCBDSGPS EQU   DCBDSRG1                                                 01968000
DCBDSGIS EQU   DCBDSRG1                                                 01969000
DCBBUFL  EQU   IHADCS11+8                                               01970000
DCBBUFCA EQU   DCBBUFCB+1                                               01971000
DCBBUFNO EQU   DCBBUFCB                                                 01972000
DCBDEVT  EQU   DCBREL                                                   01973000
DCBKEYLE EQU   DCBRELB                                                  01974000
DCBTRBAL EQU   IHADCS01+6                                               01975000
@NM00044 EQU   IHADCS01+5                                               01976000
@NM00043 EQU   IHADCS01+4                                               01977000
DCBDVTBA EQU   DCBDVTBL+1                                               01978000
@NM00042 EQU   DCBDVTBL                                                 01979000
DCBKEYCN EQU   IHADCS00+4                                               01980000
DCBRELAD EQU   IHADCS00                                                 01981000
@NM00041 EQU   IHADCB                                                   01982000
CVTLEVL  EQU   CVTRELNO+2                                               01983000
CVTNUMB  EQU   CVTRELNO                                                 01984000
CVTMDL   EQU   CVTFIX+250                                               01985000
@NM00040 EQU   CVTFIX+248                                               01986000
@NM00039 EQU   CVTFIX                                                   01987000
CVTRV482 EQU   CVTXTNT2+128                                             01988000
CVTRV481 EQU   CVTXTNT2+124                                             01989000
CVTRV480 EQU   CVTXTNT2+120                                             01990000
CVTRV479 EQU   CVTXTNT2+118                                             01991000
CVTRV478 EQU   CVTXTNT2+117                                             01992000
CVTRV477 EQU   CVTXTNT2+116                                             01993000
CVTRV476 EQU   CVTXTNT2+115                                             01994000
CVTRV475 EQU   CVTXTNT2+114                                             01995000
CVTRV474 EQU   CVTRV466                                                 01996000
CVTRV473 EQU   CVTRV466                                                 01997000
CVTRV472 EQU   CVTRV466                                                 01998000
CVTRV471 EQU   CVTRV466                                                 01999000
CVTRV470 EQU   CVTRV466                                                 02000000
CVTRV469 EQU   CVTRV466                                                 02001000
CVTRV468 EQU   CVTRV466                                                 02002000
CVTRV467 EQU   CVTRV466                                                 02003000
CVTRV465 EQU   CVTRV457                                                 02004000
CVTRV464 EQU   CVTRV457                                                 02005000
CVTRV463 EQU   CVTRV457                                                 02006000
CVTRV462 EQU   CVTRV457                                                 02007000
CVTRV461 EQU   CVTRV457                                                 02008000
CVTRV460 EQU   CVTRV457                                                 02009000
CVTRV459 EQU   CVTRV457                                                 02010000
CVTRV458 EQU   CVTRV457                                                 02011000
CVTRV456 EQU   CVTXTNT2+108                                             02012000
CVTRV455 EQU   CVTXTNT2+104                                             02013000
CVTRV454 EQU   CVTXTNT2+100                                             02014000
CVTRV453 EQU   CVTXTNT2+96                                              02015000
CVTRV452 EQU   CVTXTNT2+94                                              02016000
CVTRV451 EQU   CVTXTNT2+92                                              02017000
CVTRV450 EQU   CVTXTNT2+90                                              02018000
CVTRV449 EQU   CVTXTNT2+88                                              02019000
CVTRV448 EQU   CVTXTNT2+87                                              02020000
CVTRV447 EQU   CVTXTNT2+86                                              02021000
CVTRV446 EQU   CVTRV438                                                 02022000
CVTRV445 EQU   CVTRV438                                                 02023000
CVTRV444 EQU   CVTRV438                                                 02024000
CVTRV443 EQU   CVTRV438                                                 02025000
CVTRV442 EQU   CVTRV438                                                 02026000
CVTRV441 EQU   CVTRV438                                                 02027000
CVTRV440 EQU   CVTRV438                                                 02028000
CVTRV439 EQU   CVTRV438                                                 02029000
CVTRV437 EQU   CVTRV429                                                 02030000
CVTRV436 EQU   CVTRV429                                                 02031000
CVTRV435 EQU   CVTRV429                                                 02032000
CVTRV434 EQU   CVTRV429                                                 02033000
CVTRV433 EQU   CVTRV429                                                 02034000
CVTRV432 EQU   CVTRV429                                                 02035000
CVTRV431 EQU   CVTRV429                                                 02036000
CVTRV430 EQU   CVTRV429                                                 02037000
CVTRV428 EQU   CVTXTNT2+80                                              02038000
CVTRV427 EQU   CVTXTNT2+76                                              02039000
CVTRV426 EQU   CVTXTNT2+72                                              02040000
CVTRV425 EQU   CVTXTNT2+68                                              02041000
CVTATACT EQU   CVTATCVT                                                 02042000
CVTRV423 EQU   CVTXTNT2+62                                              02043000
CVTRV422 EQU   CVTXTNT2+60                                              02044000
CVTRV421 EQU   CVTXTNT2+58                                              02045000
CVTRV420 EQU   CVTXTNT2+56                                              02046000
CVTRV419 EQU   CVTXTNT2+55                                              02047000
CVTRV418 EQU   CVTXTNT2+54                                              02048000
CVTRV417 EQU   CVTRV409                                                 02049000
CVTRV416 EQU   CVTRV409                                                 02050000
CVTRV415 EQU   CVTRV409                                                 02051000
CVTRV414 EQU   CVTRV409                                                 02052000
CVTRV413 EQU   CVTRV409                                                 02053000
CVTRV412 EQU   CVTRV409                                                 02054000
CVTRV411 EQU   CVTRV409                                                 02055000
CVTRV410 EQU   CVTRV409                                                 02056000
CVTRV408 EQU   CVTRV400                                                 02057000
CVTRV407 EQU   CVTRV400                                                 02058000
CVTRV406 EQU   CVTRV400                                                 02059000
CVTRV405 EQU   CVTRV400                                                 02060000
CVTRV404 EQU   CVTRV400                                                 02061000
CVTRV403 EQU   CVTRV400                                                 02062000
CVTRV402 EQU   CVTRV400                                                 02063000
CVTRV401 EQU   CVTRV400                                                 02064000
CVTICB   EQU   CVTXTNT2+48                                              02065000
CVTSKTA  EQU   CVTXTNT2+44                                              02066000
CVTCCVT  EQU   CVTXTNT2+40                                              02067000
CVTRSV98 EQU   CVTXTNT2+36                                              02068000
CVTRSV97 EQU   CVTXTNT2+34                                              02069000
CVTRSV96 EQU   CVTXTNT2+32                                              02070000
CVTOLTEP EQU   CVTXTNT2+28                                              02071000
CVTQIDA  EQU   CVTQID+1                                                 02072000
CVTRSV95 EQU   CVTQID                                                   02073000
CVTRSV94 EQU   CVTXTNT2+20                                              02074000
CVTRSV93 EQU   CVTXTNT2+16                                              02075000
CVTRSV92 EQU   CVTXTNT2+12                                              02076000
CVTDEBVR EQU   CVTXTNT2+8                                               02077000
CVTRSV91 EQU   CVTXTNT2+6                                               02078000
CVTRSV9H EQU   CVTFLGBT                                                 02079000
CVTRSV9G EQU   CVTFLGBT                                                 02080000
CVTRSV9F EQU   CVTFLGBT                                                 02081000
CVTRSV9E EQU   CVTFLGBT                                                 02082000
CVTRSV9D EQU   CVTFLGBT                                                 02083000
CVTRSV9C EQU   CVTFLGBT                                                 02084000
CVTVME   EQU   CVTFLGBT                                                 02085000
CVTNPE   EQU   CVTFLGBT                                                 02086000
CVTNUCLS EQU   CVTXTNT2+4                                               02087000
CVTDSSVA EQU   CVTDSSV+1                                                02088000
CVTRSV89 EQU   CVTDSSV                                                  02089000
CVTRSV88 EQU   CVTXTNT1+8                                               02090000
CVTRSV87 EQU   CVTXTNT1+4                                               02091000
CVTFACHN EQU   CVTXTNT1                                                 02092000
CVTRV488 EQU   CVTMAP+412                                               02093000
CVTRV487 EQU   CVTMAP+408                                               02094000
CVTRV486 EQU   CVTMAP+404                                               02095000
CVTRV485 EQU   CVTMAP+400                                               02096000
CVTACTAP EQU   CVTMAP+396                                               02097000
CVTAUTH  EQU   CVTMAP+392                                               02098000
CVTATMCA EQU   CVTATMCT+1                                               02099000
CVTATMST EQU   CVTATMCT                                                 02100000
CVTRSV61 EQU   CVTMAP+384                                               02101000
CVTVOLT1 EQU   CVTVOLM1+1                                               02102000
CVTVOLI1 EQU   CVTVOLF1                                                 02103000
CVTSTOA  EQU   CVTMAP+376                                               02104000
CVTRSV58 EQU   CVTMAP+374                                               02105000
CVTRSV57 EQU   CVTMAP+372                                               02106000
CVTDDCE  EQU   CVTMAP+368                                               02107000
CVTPNWFR EQU   CVTMAP+364                                               02108000
CVTSMF   EQU   CVTMAP+360                                               02109000
CVTSULK  EQU   CVTMAP+358                                               02110000
CVTSLKO  EQU   CVTSYSK                                                  02111000
CVTSLKP  EQU   CVTSYSK                                                  02112000
CVTSLKQ  EQU   CVTSYSK                                                  02113000
CVTSLKR  EQU   CVTSYSK                                                  02114000
CVTRSV56 EQU   CVTSYSK                                                  02115000
CVTRSV55 EQU   CVTSYSK                                                  02116000
CVTRSV54 EQU   CVTSYSK                                                  02117000
CVTRSV53 EQU   CVTSYSK                                                  02118000
CVTRSV52 EQU   CVTA1F1                                                  02119000
CVTRSV51 EQU   CVTA1F1                                                  02120000
CVTRSV50 EQU   CVTA1F1                                                  02121000
CVTRSV49 EQU   CVTA1F1                                                  02122000
CVTRSV48 EQU   CVTA1F1                                                  02123000
CVTRSV47 EQU   CVTA1F1                                                  02124000
CVTSRSW  EQU   CVTA1F1                                                  02125000
CVTPFSW  EQU   CVTA1F1                                                  02126000
CVTPCVT  EQU   CVTMAP+352                                               02127000
CVTRSV46 EQU   CVTMAP+344                                               02128000
CVTRSV45 EQU   CVTMAP+340                                               02129000
CVTRSV44 EQU   CVTMAP+338                                               02130000
CVTRSV43 EQU   CVTMAP+336                                               02131000
CVTHJESA EQU   CVTHJES+1                                                02132000
CVTRSV42 EQU   CVTHJES                                                  02133000
CVTEXT2A EQU   CVTEXT2+1                                                02134000
CVTRSV41 EQU   CVTEXT2                                                  02135000
CVTAPFA  EQU   CVTAPF+1                                                 02136000
CVTRSV40 EQU   CVTAPF                                                   02137000
CVTRV518 EQU   CVTINTLA                                                 02138000
CVTRV517 EQU   CVTERPV                                                  02139000
CVTEORM  EQU   CVTMAP+312                                               02140000
CVTMCHPR EQU   CVTMAP+308                                               02141000
CVTTZ    EQU   CVTMAP+304                                               02142000
CVTJEPS  EQU   CVTMAP+300                                               02143000
CVTJESCT EQU   CVTMAP+296                                               02144000
CVTMODE  EQU   CVTMAP+292                                               02145000
CVTPTRV  EQU   CVTMAP+288                                               02146000
CVTREAL  EQU   CVTMAP+284                                               02147000
CVTRSV39 EQU   CVTMAP+280                                               02148000
CVTRSV38 EQU   CVTMAP+276                                               02149000
CVTDMSRA EQU   CVTDMSR+1                                                02150000
CVTRV634 EQU   CVTDMSRF                                                 02151000
CVTRV633 EQU   CVTDMSRF                                                 02152000
CVTRV632 EQU   CVTDMSRF                                                 02153000
CVTRV631 EQU   CVTDMSRF                                                 02154000
CVTRV630 EQU   CVTDMSRF                                                 02155000
CVTRV629 EQU   CVTDMSRF                                                 02156000
CVTUDUMP EQU   CVTDMSRF                                                 02157000
CVTSDUMP EQU   CVTDMSRF                                                 02158000
CVTQMSGA EQU   CVTQMSG+1                                                02159000
CVTRSV36 EQU   CVTQMSG                                                  02160000
CVTAMFF  EQU   CVTMAP+264                                               02161000
CVTPURGA EQU   CVTPURG+1                                                02162000
CVTRSV35 EQU   CVTPURG                                                  02163000
CVTCBSP  EQU   CVTMAP+256                                               02164000
CVTATERA EQU   CVTATER+1                                                02165000
CVTSYST  EQU   CVTATER                                                  02166000
CVTVOLT2 EQU   CVTTAT                                                   02167000
CVTVOLI2 EQU   CVTVOLF2                                                 02168000
CVTAQAVB EQU   CVTAQAVT+1                                               02169000
CVTRSV34 EQU   CVTTCMFG                                                 02170000
CVTRSV33 EQU   CVTTCMFG                                                 02171000
CVTRSV32 EQU   CVTTCMFG                                                 02172000
CVTRSV31 EQU   CVTTCMFG                                                 02173000
CVTRSV30 EQU   CVTTCMFG                                                 02174000
CVTRSV29 EQU   CVTTCMFG                                                 02175000
CVTLDEV  EQU   CVTTCMFG                                                 02176000
CVTTCRDY EQU   CVTTCMFG                                                 02177000
CVTGTFA  EQU   CVTGTF+1                                                 02178000
CVTRSV27 EQU   CVTGTFST                                                 02179000
CVTRNIO  EQU   CVTGTFST                                                 02180000
CVTUSR   EQU   CVTGTFST                                                 02181000
CVTRV318 EQU   CVTFORM                                                  02182000
CVTRV317 EQU   CVTTMODE                                                 02183000
CVTRV316 EQU   CVTSTATE                                                 02184000
CVTRV315 EQU   CVTGTFS                                                  02185000
CVTGTFAV EQU   CVTGTFS                                                  02186000
CVT0SCR1 EQU   CVTMAP+232                                               02187000
CVTRV515 EQU   CVTMAP+228                                               02188000
CVTRMS   EQU   CVTMAP+224                                               02189000
CVTPATCH EQU   CVTMAP+220                                               02190000
CVTTSCE  EQU   CVTMAP+216                                               02191000
CVTLNKSC EQU   CVTMAP+214                                               02192000
CVTQABST EQU   CVTMAP+212                                               02193000
CVTMDLDS EQU   CVTMAP+208                                               02194000
CVTUSER  EQU   CVTMAP+204                                               02195000
CVTABEND EQU   CVTMAP+200                                               02196000
CVTSMCA  EQU   CVTMAP+196                                               02197000
CVTRSV18 EQU   CVTMAP+192                                               02198000
CVTQLPAQ EQU   CVTMAP+188                                               02199000
CVTQCDSR EQU   CVTMAP+184                                               02200000
CVTRSV17 EQU   CVTOPTB                                                  02201000
CVTRSV16 EQU   CVTOPTB                                                  02202000
CVTFP    EQU   CVTOPTB                                                  02203000
CVTAPTHR EQU   CVTOPTB                                                  02204000
CVTNLOG  EQU   CVTOPTB                                                  02205000
CVTTOD   EQU   CVTOPTB                                                  02206000
CVTCTIMS EQU   CVTOPTB                                                  02207000
CVTPROT  EQU   CVTOPTB                                                  02208000
CVTXPFP  EQU   CVTOPTA                                                  02209000
CVTASCII EQU   CVTOPTA                                                  02210000
CVTRSV13 EQU   CVTOPTA                                                  02211000
CVTRSV12 EQU   CVTOPTA                                                  02212000
CVTNIP   EQU   CVTOPTA                                                  02213000
CVTDDR   EQU   CVTOPTA                                                  02214000
CVTAPR   EQU   CVTOPTA                                                  02215000
CVTCCH   EQU   CVTOPTA                                                  02216000
CVTSNCTR EQU   CVTMAP+180                                               02217000
CVTQMWR  EQU   CVTMAP+176                                               02218000
CVTQOCR  EQU   CVTMAP+172                                               02219000
CVT1EF00 EQU   CVTMAP+168                                               02220000
CVTMZ00  EQU   CVTMAP+164                                               02221000
CVTSV76Q EQU   CVTSV76C                                                 02222000
CVTRSV11 EQU   CVTMAP+156                                               02223000
CVT0PT01 EQU   CVTMAP+152                                               02224000
CVTMSER  EQU   CVTMAP+148                                               02225000
CVTRV516 EQU   CVTIERLC                                                 02226000
CVTILCH  EQU   CVTMAP+140                                               02227000
CVT0DS   EQU   CVTMAP+136                                               02228000
CVTFBOSV EQU   CVTMAP+132                                               02229000
CVTNUCB  EQU   CVTMAP+128                                               02230000
CVTIXAVL EQU   CVTMAP+124                                               02231000
CVTSV76M EQU   CVTIOQET                                                 02232000
CVTDCBA  EQU   CVTMAP+117                                               02233000
CVTMVS2  EQU   CVTDCB                                                   02234000
CVT6DAT  EQU   CVTDCB                                                   02235000
CVT4MPS  EQU   CVTDCB                                                   02236000
CVTRSV09 EQU   CVTDCB                                                   02237000
CVT4MS1  EQU   CVTDCB                                                   02238000
CVT2SPS  EQU   CVTDCB                                                   02239000
CVT1SSS  EQU   CVTDCB                                                   02240000
CVTRSV08 EQU   CVTDCB                                                   02241000
CVTSTB   EQU   CVTMAP+112                                               02242000
CVTQTD00 EQU   CVTMAP+108                                               02243000
CVTQTE00 EQU   CVTMAP+104                                               02244000
CVTCUCB  EQU   CVTMAP+100                                               02245000
CVTSJQ   EQU   CVTMAP+96                                                02246000
CVTPBLDL EQU   CVTMAP+92                                                02247000
CVTTPC   EQU   CVTMAP+88                                                02248000
CVTSVDCB EQU   CVTMAP+84                                                02249000
CVTBRET  EQU   CVTMAP+82                                                02250000
CVTEXIT  EQU   CVTMAP+80                                                02251000
CVT0FN00 EQU   CVTMAP+76                                                02252000
CVTDARA  EQU   CVTDAR+1                                                 02253000
CVTRSV07 EQU   CVTFLGS1                                                 02254000
CVTRSV06 EQU   CVTFLGS1                                                 02255000
CVTRSV05 EQU   CVTFLGS1                                                 02256000
CVTRSV04 EQU   CVTFLGS1                                                 02257000
CVTRSV03 EQU   CVTFLGS1                                                 02258000
CVTRSV02 EQU   CVTFLGS1                                                 02259000
CVTRSV01 EQU   CVTFLGS1                                                 02260000
CVTDMPLK EQU   CVTFLGS1                                                 02261000
CVTXITP  EQU   CVTMAP+68                                                02262000
CVTZDTAB EQU   CVTMAP+64                                                02263000
CVTMSLT  EQU   CVTMAP+60                                                02264000
CVTDATE  EQU   CVTMAP+56                                                02265000
CVTBTERM EQU   CVTMAP+52                                                02266000
CVTSYSAD EQU   CVTMAP+48                                                02267000
CVTXTLER EQU   CVTMAP+44                                                02268000
CVTILK2  EQU   CVTMAP+40                                                02269000
CVTILK1  EQU   CVTMAP+36                                                02270000
CVTPRLTV EQU   CVTMAP+32                                                02271000
CVTPCNVT EQU   CVTMAP+28                                                02272000
CVT0VL00 EQU   CVTMAP+24                                                02273000
CVTXAPG  EQU   CVTMAP+20                                                02274000
CVTBUF   EQU   CVTMAP+16                                                02275000
CVTJOB   EQU   CVTMAP+12                                                02276000
CVTLINK  EQU   CVTMAP+8                                                 02277000
CVT0EF00 EQU   CVTMAP+4                                                 02278000
CVTTCBP  EQU   CVTMAP                                                   02279000
CVT      EQU   CVTMAP                                                   02280000
SA99     EQU   SA+72                                                    02281000
SARC     EQU   SAR+56                                                   02282000
SARB     EQU   SAR+52                                                   02283000
SARA     EQU   SAR+48                                                   02284000
SAR9     EQU   SAR+44                                                   02285000
SAR8     EQU   SAR+40                                                   02286000
SAR7     EQU   SAR+36                                                   02287000
SAR6     EQU   SAR+32                                                   02288000
SAR5     EQU   SAR+28                                                   02289000
SAR4     EQU   SAR+24                                                   02290000
SAR3     EQU   SAR+20                                                   02291000
SAR2     EQU   SAR+16                                                   02292000
SAR1     EQU   SAR+12                                                   02293000
SAR0     EQU   SAR+8                                                    02294000
SARF     EQU   SAR+4                                                    02295000
SARE     EQU   SAR                                                      02296000
SAFWD    EQU   SA+8                                                     02297000
SABAK    EQU   SA+4                                                     02298000
SA1L     EQU   SA1+1                                                    02299000
SA1P     EQU   SA1                                                      02300000
@NM00038 EQU   PSA+3668                                                 02301000
PSASTAK  EQU   PSA+3072                                                 02302000
@NM00037 EQU   PSA+1048                                                 02303000
PSAUSEND EQU   PSA+1048                                                 02304000
PSARV062 EQU   PSA+1044                                                 02305000
PSACDAL  EQU   PSA+1040                                                 02306000
PSAWTCOD EQU   PSA+1036                                                 02307000
PSAATCVT EQU   PSA+1032                                                 02308000
PSAPCPSW EQU   PSA+1024                                                 02309000
PSAPIR2  EQU   PSA+1020                                                 02310000
PSARV059 EQU   PSA+1018                                                 02311000
PSASVC13 EQU   PSA+1016                                                 02312000
PSALSFCC EQU   PSA+1012                                                 02313000
PSASFACC EQU   PSA+1008                                                 02314000
PSASTOP  EQU   PSA+992                                                  02315000
PSASTART EQU   PSA+976                                                  02316000
PSARSPSW EQU   PSA+968                                                  02317000
PSASRPSW EQU   PSA+960                                                  02318000
PSARV045 EQU   PSA+892                                                  02319000
PSARV044 EQU   PSA+888                                                  02320000
PSARV043 EQU   PSA+884                                                  02321000
PSARV042 EQU   PSA+880                                                  02322000
PSARV041 EQU   PSA+876                                                  02323000
PSARV040 EQU   PSA+872                                                  02324000
PSARV025 EQU   PSA+868                                                  02325000
PSADSSED EQU   PSA+868                                                  02326000
PSADSSPR EQU   PSA+864                                                  02327000
PSADSSFW EQU   PSA+860                                                  02328000
PSADSS14 EQU   PSA+856                                                  02329000
PSADSSPP EQU   PSA+848                                                  02330000
PSADSSRP EQU   PSA+840                                                  02331000
PSADSS05 EQU   PSADSSF4                                                 02332000
PSADSS10 EQU   PSADSSF4                                                 02333000
PSADSSVE EQU   PSADSSF4                                                 02334000
PSADSSDE EQU   PSADSSF4                                                 02335000
PSADSSC0 EQU   PSADSSF4                                                 02336000
PSADSSIE EQU   PSADSSF4                                                 02337000
PSADSS12 EQU   PSADSSF4                                                 02338000
PSADSSRC EQU   PSADSSF4                                                 02339000
PSARV057 EQU   PSADSSF3                                                 02340000
PSARV056 EQU   PSADSSF3                                                 02341000
PSARV055 EQU   PSADSSF3                                                 02342000
PSADSSMC EQU   PSADSSF3                                                 02343000
PSADSSRW EQU   PSADSSF3                                                 02344000
PSADSSNM EQU   PSADSSF3                                                 02345000
PSADSSES EQU   PSADSSF3                                                 02346000
PSADSSGP EQU   PSADSSF3                                                 02347000
PSADSSF2 EQU   PSADSSFL+1                                               02348000
PSADSSPI EQU   PSADSSF1                                                 02349000
PSADSSOI EQU   PSADSSF1                                                 02350000
PSADSSSP EQU   PSADSSF1                                                 02351000
PSADSSTP EQU   PSADSSF1                                                 02352000
PSADSSDW EQU   PSADSSF1                                                 02353000
PSADSSDD EQU   PSADSSF1                                                 02354000
PSADSSDM EQU   PSADSSF1                                                 02355000
PSADSSMV EQU   PSADSSF1                                                 02356000
PSADSSTS EQU   PSA+816                                                  02357000
PSADSSWK EQU   PSA+812                                                  02358000
PSADSSR3 EQU   PSA+808                                                  02359000
PSADSSR2 EQU   PSA+804                                                  02360000
PSADSSRS EQU   PSA+800                                                  02361000
PSASTOR  EQU   PSA+796                                                  02362000
PSACPUSA EQU   PSA+794                                                  02363000
PSAVSTAP EQU   PSA+792                                                  02364000
PSAWKVAP EQU   PSA+788                                                  02365000
PSAWKRAP EQU   PSA+784                                                  02366000
PSAMCHIC EQU   PSA+783                                                  02367000
PSARV061 EQU   PSA+782                                                  02368000
PSASYMSK EQU   PSA+781                                                  02369000
PSAMCHFL EQU   PSA+780                                                  02370000
PSACR0   EQU   PSA+776                                                  02371000
PSAPSWSV EQU   PSA+768                                                  02372000
PSALITA  EQU   PSA+764                                                  02373000
PSACLHS  EQU   PSAHLHI                                                  02374000
PSALKR15 EQU   PSALKSA+60                                               02375000
PSALKR14 EQU   PSALKSA+56                                               02376000
PSALKR13 EQU   PSALKSA+52                                               02377000
PSALKR12 EQU   PSALKSA+48                                               02378000
PSALKR11 EQU   PSALKSA+44                                               02379000
PSALKR10 EQU   PSALKSA+40                                               02380000
PSALKR9  EQU   PSALKSA+36                                               02381000
PSALKR8  EQU   PSALKSA+32                                               02382000
PSALKR7  EQU   PSALKSA+28                                               02383000
PSALKR6  EQU   PSALKSA+24                                               02384000
PSALKR5  EQU   PSALKSA+20                                               02385000
PSALKR4  EQU   PSALKSA+16                                               02386000
PSALKR3  EQU   PSALKSA+12                                               02387000
PSALKR2  EQU   PSALKSA+8                                                02388000
PSALKR1  EQU   PSALKSA+4                                                02389000
PSALKR0  EQU   PSALKSA                                                  02390000
PSARV023 EQU   PSACLHT+52                                               02391000
PSALOCAL EQU   PSACLHT+48                                               02392000
PSACMSL  EQU   PSACLHT+44                                               02393000
PSAOPTL  EQU   PSACLHT+40                                               02394000
PSATPACL EQU   PSACLHT+36                                               02395000
PSATPDNL EQU   PSACLHT+32                                               02396000
PSATPNCL EQU   PSACLHT+28                                               02397000
PSAIOSLL EQU   PSACLHT+24                                               02398000
PSAIOSUL EQU   PSACLHT+20                                               02399000
PSAIOSCL EQU   PSACLHT+16                                               02400000
PSAIOSSL EQU   PSACLHT+12                                               02401000
PSASALCL EQU   PSACLHT+8                                                02402000
PSAASML  EQU   PSACLHT+4                                                02403000
PSADISPL EQU   PSACLHT                                                  02404000
PSASRSA  EQU   PSA+636                                                  02405000
PSARV050 EQU   PSA+634                                                  02406000
PSADSSGO EQU   PSA+633                                                  02407000
PSARECUR EQU   PSA+632                                                  02408000
PSAHLHIS EQU   PSA+628                                                  02409000
PSAIPCSA EQU   PSA+624                                                  02410000
@NM00036 EQU   PSA+621                                                  02411000
PSAIPCDM EQU   PSA+620                                                  02412000
PSAIPCD  EQU   PSA+616                                                  02413000
@NM00035 EQU   PSA+613                                                  02414000
PSAIPCRM EQU   PSA+612                                                  02415000
PSAIPCR  EQU   PSA+608                                                  02416000
PSAMCHEX EQU   PSA+600                                                  02417000
PSAMPSW  EQU   PSA+592                                                  02418000
PSAEXPS2 EQU   PSA+584                                                  02419000
PSAEXPS1 EQU   PSA+576                                                  02420000
PSAPIREG EQU   PSA+572                                                  02421000
PSARSREG EQU   PSA+568                                                  02422000
PSAGPREG EQU   PSA+556                                                  02423000
PSARV022 EQU   PSASUP4                                                  02424000
PSARV021 EQU   PSASUP4                                                  02425000
PSARV020 EQU   PSASUP4                                                  02426000
PSARV019 EQU   PSASUP4                                                  02427000
PSARV018 EQU   PSASUP4                                                  02428000
PSARV017 EQU   PSASUP4                                                  02429000
PSARV016 EQU   PSASUP4                                                  02430000
PSARV015 EQU   PSASUP4                                                  02431000
PSARV014 EQU   PSASUP3                                                  02432000
PSAULCMS EQU   PSASUP3                                                  02433000
PSARV012 EQU   PSASUP3                                                  02434000
PSAESTA  EQU   PSASUP3                                                  02435000
PSASPR   EQU   PSASUP3                                                  02436000
PSAPSREG EQU   PSASUP3                                                  02437000
PSAPI2   EQU   PSASUP3                                                  02438000
PSAIOSUP EQU   PSASUP3                                                  02439000
PSALCR   EQU   PSASUP2                                                  02440000
PSARTM   EQU   PSASUP2                                                  02441000
PSAACR   EQU   PSASUP2                                                  02442000
PSAIPCE2 EQU   PSASUP2                                                  02443000
PSAIPCES EQU   PSASUP2                                                  02444000
PSAIPCEC EQU   PSASUP2                                                  02445000
PSAGTF   EQU   PSASUP2                                                  02446000
PSAIPCRI EQU   PSASUP2                                                  02447000
PSATYPE6 EQU   PSASUP1                                                  02448000
PSATCTL  EQU   PSASUP1                                                  02449000
PSADISP  EQU   PSASUP1                                                  02450000
PSALOCK  EQU   PSASUP1                                                  02451000
PSAPI    EQU   PSASUP1                                                  02452000
PSAEXT   EQU   PSASUP1                                                  02453000
PSASVC   EQU   PSASUP1                                                  02454000
PSAIO    EQU   PSASUP1                                                  02455000
PSAAOLD  EQU   PSA+548                                                  02456000
PSAANEW  EQU   PSA+544                                                  02457000
PSATOLD  EQU   PSA+540                                                  02458000
PSATNEW  EQU   PSA+536                                                  02459000
PSALCCAR EQU   PSA+532                                                  02460000
PSALCCAV EQU   PSA+528                                                  02461000
PSAPCCAR EQU   PSA+524                                                  02462000
PSAPCCAV EQU   PSA+520                                                  02463000
PSACPULA EQU   PSA+518                                                  02464000
PSACPUPA EQU   PSA+516                                                  02465000
PSAPSA   EQU   PSA+512                                                  02466000
FLCHDEND EQU   PSA+512                                                  02467000
FLCCRSAV EQU   FLCMCLA+280                                              02468000
FLCGRSAV EQU   FLCMCLA+216                                              02469000
FLCFPSAV EQU   FLCMCLA+184                                              02470000
FLCFLA   EQU   FLCMCLA+88                                               02471000
FLCRGNCD EQU   FLCMCLA+84                                               02472000
FLCFSAA  EQU   FLCFSA+1                                                 02473000
@NM00034 EQU   FLCFSA                                                   02474000
@NM00033 EQU   FLCMCLA+72                                               02475000
FLCMCIC  EQU   FLCMCLA+64                                               02476000
@NM00032 EQU   FLCMCLA+20                                               02477000
FLCIOAA  EQU   FLCIOA+1                                                 02478000
@NM00031 EQU   FLCIOA                                                   02479000
@NM00030 EQU   FLCMCLA+15                                               02480000
@NM00029 EQU   FLCMCLA+14                                               02481000
@NM00028 EQU   FLCMCLA+12                                               02482000
FLCLCL   EQU   FLCMCLA+8                                                02483000
FLCIOELA EQU   FLCIOEL+1                                                02484000
@NM00027 EQU   FLCIOEL                                                  02485000
FLCCHNID EQU   FLCMCLA                                                  02486000
@NM00026 EQU   PSA+160                                                  02487000
FLCMTRCD EQU   PSA+157                                                  02488000
@NM00025 EQU   PSA+156                                                  02489000
FLCPERA  EQU   FLCPER+1                                                 02490000
@NM00024 EQU   FLCPER                                                   02491000
@NM00023 EQU   PSA+151                                                  02492000
FLCPERCD EQU   PSA+150                                                  02493000
FLCMCNUM EQU   PSA+149                                                  02494000
@NM00022 EQU   PSA+148                                                  02495000
FLCTEAA  EQU   FLCTEA+1                                                 02496000
@NM00021 EQU   FLCTEA                                                   02497000
PSAPIPC  EQU   PSAPICOD                                                 02498000
PSAPIMC  EQU   PSAPICOD                                                 02499000
PSAPIPER EQU   PSAPICOD                                                 02500000
PSARV049 EQU   FLCPICOD                                                 02501000
FLCPILCB EQU   FLCPIILC                                                 02502000
@NM00020 EQU   FLCPIILC                                                 02503000
@NM00019 EQU   PSAEPPSW                                                 02504000
FLCSVCN  EQU   PSAESPSW+2                                               02505000
FLCSILCB EQU   FLCSVILC                                                 02506000
@NM00018 EQU   FLCSVILC                                                 02507000
@NM00017 EQU   PSAESPSW                                                 02508000
FLCEICOD EQU   PSAEEPSW+2                                               02509000
PSASPAD  EQU   PSAEEPSW                                                 02510000
@NM00016 EQU   PSA+128                                                  02511000
FLCINPSW EQU   PSA+120                                                  02512000
FLCMNPSW EQU   PSA+112                                                  02513000
FLCPNPSW EQU   PSA+104                                                  02514000
FLCSNPSW EQU   PSA+96                                                   02515000
FLCENPSW EQU   PSA+88                                                   02516000
FLCTRACE EQU   PSA+84                                                   02517000
FLCTIMER EQU   PSA+80                                                   02518000
FLCCVT2  EQU   PSA+76                                                   02519000
FLCCAW   EQU   PSA+72                                                   02520000
FLCCSW   EQU   PSA+64                                                   02521000
FLCIOPSW EQU   PSA+56                                                   02522000
FLCMOPSW EQU   PSA+48                                                   02523000
FLCPOPSW EQU   PSA+40                                                   02524000
FLCSOPSW EQU   PSA+32                                                   02525000
FLCEOPSW EQU   PSA+24                                                   02526000
@NM00015 EQU   FLCICCW2+4                                               02527000
FLCICCW1 EQU   FLCROPSW                                                 02528000
FLCIPPSW EQU   FLCRNPSW                                                 02529000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02530000
@RT00113 EQU   EXITNORL                                                 02531000
@ENDDATA EQU   *                                                        02532000
         END   BLSRDUSC,(C'PLS1922',0701,78117)                         02533000
