DUIC     TITLE 'BLSRDUIC--DUMP INITIALIZATION--CPU STATUS RECORD       *00001000
                        '                                               00002000
*/* CHANGE ACTIVITY -------------------------------------------------*/ 00003000
*/*   THIS MODULE WAS WRITTEN FOR @G57LPRW                           */ 00004000
*/*------------------------------------------------------------------*/ 00005000
BLSRDUIC CSECT ,                                                01S0002 00006000
@MAINENT DS    0H                                               01S0002 00007000
         USING *,@15                                            01S0002 00008000
         B     @PROLOG                                          01S0002 00009000
         DC    AL1(16)                                          01S0002 00010000
         DC    C'BLSRDUIC  78.057'                              01S0002 00011000
         DROP  @15                                                      00012000
@PROLOG  STM   @14,@12,12(@13)                                  01S0002 00013000
         BALR  @12,0                                            01S0002 00014000
@PSTART  DS    0H                                               01S0002 00015000
         USING @PSTART,@12                                      01S0002 00016000
         L     @00,@SIZDATD                                     01S0002 00017000
         BLSUALLS R,LV=(0)                                              00018000
         LR    @11,@01                                          01S0002 00019000
         USING @DATD,@11                                        01S0002 00020000
         ST    @13,@SA00001+4                                   01S0002 00021000
         LM    @00,@01,20(@13)                                  01S0002 00022000
         ST    @11,8(,@13)                                      01S0002 00023000
         LR    @13,@11                                          01S0002 00024000
         MVC   @PC00001(8),0(@01)                               01S0002 00025000
*   IF ZZ6DFST='0'B THEN            /* FIRST CPU STATUS RECORD       */ 00026000
*                                                               01S0144 00027000
         L     @14,ZZ2AZZ6P(,R9)                                01S0144 00028000
         TM    ZZ6DFST(@14),B'00001000'                         01S0144 00029000
         BNZ   @RF00144                                         01S0144 00030000
*     /***************************************************************/ 00031000
*     /*                                                             */ 00032000
*     /* FIRST CPU STATUS RECORD                                     */ 00033000
*     /*                                                             */ 00034000
*     /***************************************************************/ 00035000
*                                                               01S0145 00036000
*     DO;                           /* FIRST CPU STATUS RECORD       */ 00037000
*       ZZ6DFST='1'B;               /* CPU STATUS DATA AVAILABLE     */ 00038000
         OI    ZZ6DFST(@14),B'00001000'                         01S0146 00039000
*       ZZ6DQA1=HSDCPADD;           /* PREFERRED ADDRESS SPACE CPU   */ 00040000
         L     @10,@PC00001+4                                   01S0147 00041000
         SLR   @08,@08                                          01S0147 00042000
         ICM   @08,3,HSDCPADD(@10)                              01S0147 00043000
         ST    @08,ZZ6DQA1(,@14)                                01S0147 00044000
*       ZZ6DQ1=HSDCPADD;            /* ACTIVE CPU ADDRESS            */ 00045000
         ST    @08,ZZ6DQ1(,@14)                                 01S0148 00046000
*     END;                          /* FIRST CPU STATUS RECORD       */ 00047000
*   ELSE                            /* 2ND, ... CPU STATUS RECORD    */ 00048000
*     ZZ6DFMP='1'B;                 /* MULTI-PROCESSOR DUMP          */ 00049000
         B     @RC00144                                         01S0150 00050000
@RF00144 L     @14,ZZ2AZZ6P(,R9)                                01S0150 00051000
         OI    ZZ6DFMP(@14),B'00100000'                         01S0150 00052000
*   CPU=HSDCSCPU;                   /* CPU ADDRESS                   */ 00053000
@RC00144 L     @14,@PC00001+4                                   01S0151 00054000
         SLR   CPU,CPU                                          01S0151 00055000
         ICM   CPU,3,HSDCSCPU(@14)                              01S0151 00056000
*   IF HSDCSFI='0'B THEN            /* CPU STATUS IS VALID           */ 00057000
*                                                               01S0152 00058000
         TM    HSDCSFI(@14),B'01000000'                         01S0152 00059000
         BNZ   @RF00152                                         01S0152 00060000
*     /***************************************************************/ 00061000
*     /*                                                             */ 00062000
*     /* CPU STATUS IS VALID                                         */ 00063000
*     /*                                                             */ 00064000
*     /***************************************************************/ 00065000
*                                                               01S0153 00066000
*     DO;                           /* CPU STATUS IS VALID           */ 00067000
*       M125B=M125S;                /* INITIALIZE MESSAGE M125       */ 00068000
         MVC   M125B(40),M125S                                  01S0154 00069000
*       DO;                         /* BLRCNVUC(CPU) FROM(UNSIGNED BI   00070000
*                                      NARY)TO(CHARACTER)PATTERN('402   00071000
*                                      02120'X)OPTIONS(PATTERN IN       00072000
*                                      PLACE)SET(M125BTB)REMARK(CPU     00073000
*                                      ADDRESS)                      */ 00074000
*                                                               01S0155 00075000
*         /***********************************************************/ 00076000
*         /*                                                         */ 00077000
*         /* CPU ADDRESS                                             */ 00078000
*         /*                                                         */ 00079000
*         /***********************************************************/ 00080000
*                                                               01S0156 00081000
*         CVD(CPU,PACKED);          /* UNSIGNED BINARY=>PACKED  01S0156 00082000
*                                      DECIMAL                       */ 00083000
         CVD   CPU,PACKED                                       01S0156 00084000
*         ED(M125BTB,PACKED(49:64));/* PACKED DECIMAL=>EBCDIC        */ 00085000
         ED    M125BTB(4),PACKED+6                              01S0157 00086000
*       END;                        /* BLRCNVUC(CPU) FROM(UNSIGNED BI   00087000
*                                      NARY)TO(CHARACTER)PATTERN('402   00088000
*                                      02120'X)OPTIONS(PATTERN IN       00089000
*                                      PLACE)SET(M125BTB)REMARK(CPU     00090000
*                                      ADDRESS)                      */ 00091000
*     END;                          /* CPU STATUS IS VALID           */ 00092000
*   ELSE                            /* CPU STATUS MAY BE INVALID     */ 00093000
*     IF HSDCSFR='0'B THEN          /* CPU STATUS MAY BE INVALID     */ 00094000
*                                                               01S0160 00095000
         B     @RC00152                                         01S0160 00096000
@RF00152 L     @14,@PC00001+4                                   01S0160 00097000
         TM    HSDCSFR(@14),B'00100000'                         01S0160 00098000
         BNZ   @RF00160                                         01S0160 00099000
*       /*************************************************************/ 00100000
*       /*                                                           */ 00101000
*       /* CPU STATUS MAY BE INVALID                                 */ 00102000
*       /*                                                           */ 00103000
*       /*************************************************************/ 00104000
*                                                               01S0161 00105000
*       DO;                         /* CPU STATUS MAY BE INVALID     */ 00106000
*         M126B=M126S;              /* INITIALIZE MESSAGE M126       */ 00107000
         MVC   M126B(45),M126S                                  01S0162 00108000
*         DO;                       /* BLRCNVUC(CPU) FROM(UNSIGNED BI   00109000
*                                      NARY)TO(CHARACTER)PATTERN('402   00110000
*                                      02120'X)OPTIONS(PATTERN IN       00111000
*                                      PLACE)SET(M126BTB)REMARK(CPU     00112000
*                                      ADDRESS)                      */ 00113000
*                                                               01S0163 00114000
*           /*********************************************************/ 00115000
*           /*                                                       */ 00116000
*           /* CPU ADDRESS                                           */ 00117000
*           /*                                                       */ 00118000
*           /*********************************************************/ 00119000
*                                                               01S0164 00120000
*           CVD(CPU,PACKED);        /* UNSIGNED BINARY=>PACKED  01S0164 00121000
*                                      DECIMAL                       */ 00122000
         CVD   CPU,PACKED                                       01S0164 00123000
*           ED(M126BTB,PACKED(49:64));/* PACKED DECIMAL=>EBCDIC      */ 00124000
         ED    M126BTB(4),PACKED+6                              01S0165 00125000
*         END;                      /* BLRCNVUC(CPU) FROM(UNSIGNED BI   00126000
*                                      NARY)TO(CHARACTER)PATTERN('402   00127000
*                                      02120'X)OPTIONS(PATTERN IN       00128000
*                                      PLACE)SET(M126BTB)REMARK(CPU     00129000
*                                      ADDRESS)                      */ 00130000
*       END;                        /* CPU STATUS MAY BE INVALID     */ 00131000
*     ELSE                          /* ONLY GPR STATUS IS VALID      */ 00132000
*                                                               01S0168 00133000
*       /*************************************************************/ 00134000
*       /*                                                           */ 00135000
*       /* ONLY GPR STATUS IS VALID                                  */ 00136000
*       /*                                                           */ 00137000
*       /*************************************************************/ 00138000
*                                                               01S0168 00139000
*       DO;                         /* ONLY GPR STATUS IS VALID      */ 00140000
         B     @RC00160                                         01S0168 00141000
@RF00160 DS    0H                                               01S0169 00142000
*         M128B=M128S;              /* INITIALIZE MESSAGE M128       */ 00143000
         MVC   M128B(49),M128S                                  01S0169 00144000
*         DO;                       /* BLRCNVUC(CPU) FROM(UNSIGNED BI   00145000
*                                      NARY)TO(CHARACTER)PATTERN('402   00146000
*                                      02120'X)OPTIONS(PATTERN IN       00147000
*                                      PLACE)SET(M128BTB)REMARK(CPU     00148000
*                                      ADDRESS)                      */ 00149000
*                                                               01S0170 00150000
*           /*********************************************************/ 00151000
*           /*                                                       */ 00152000
*           /* CPU ADDRESS                                           */ 00153000
*           /*                                                       */ 00154000
*           /*********************************************************/ 00155000
*                                                               01S0171 00156000
*           CVD(CPU,PACKED);        /* UNSIGNED BINARY=>PACKED  01S0171 00157000
*                                      DECIMAL                       */ 00158000
         CVD   CPU,PACKED                                       01S0171 00159000
*           ED(M128BTB,PACKED(49:64));/* PACKED DECIMAL=>EBCDIC      */ 00160000
         ED    M128BTB(4),PACKED+6                              01S0172 00161000
*         END;                      /* BLRCNVUC(CPU) FROM(UNSIGNED BI   00162000
*                                      NARY)TO(CHARACTER)PATTERN('402   00163000
*                                      02120'X)OPTIONS(PATTERN IN       00164000
*                                      PLACE)SET(M128BTB)REMARK(CPU     00165000
*                                      ADDRESS)                      */ 00166000
*       END;                        /* ONLY GPR STATUS IS VALID      */ 00167000
*   CALL BLSUMPK1(ZZ2,MA);          /* COMPRESS CPU STATUS MESSAGE   */ 00168000
@RC00160 DS    0H                                               01S0175 00169000
@RC00152 ST    R9,@AL00001                                      01S0175 00170000
         LA    @14,MA                                           01S0175 00171000
         ST    @14,@AL00001+4                                   01S0175 00172000
         L     @10,ZZ2BVTP(,R9)                                 01S0175 00173000
         L     @15,BVTMPK1P(,@10)                               01S0175 00174000
         LA    @01,@AL00001                                     01S0175 00175000
         BALR  @14,@15                                          01S0175 00176000
*   RETC=RF;                        /* RETURN CODE                   */ 00177000
         LR    RETC,RF                                          01S0176 00178000
*   CALL BLSUTRMV(ZZ2,MA);          /* TRANSMIT CPU STATUS MESSAGE   */ 00179000
         ST    R9,@AL00001                                      01S0177 00180000
         LA    @14,MA                                           01S0177 00181000
         ST    @14,@AL00001+4                                   01S0177 00182000
         L     @15,ZZ2TRMVP(,R9)                                01S0177 00183000
         LA    @01,@AL00001                                     01S0177 00184000
         BALR  @14,@15                                          01S0177 00185000
*   RETC=MAX(RETC,RF);              /* RETURN CODE                   */ 00186000
         CR    RETC,RF                                          01S0178 00187000
         BNL   *+6                                                      00188000
         LR    RETC,RF                                          01S0178 00189000
*   RETURN CODE(RETC);                                          01S0179 00190000
*                                                               01S0179 00191000
         L     @13,4(,@13)                                      01S0179 00192000
         L     @00,@SIZDATD                                     01S0179 00193000
         LR    @01,@11                                          01S0179 00194000
         BLSUFRES R,LV=(0),A=(1)                                        00195000
         LR    @15,@03                                          01S0179 00196000
         L     @14,12(,@13)                                     01S0179 00197000
         LM    @00,@12,20(@13)                                  01S0179 00198000
         BR    @14                                              01S0179 00199000
*/*BLSRPEND--DEBUGGING MODULE                                        */ 00200000
*/*BLSUPEND--MVS IPCS MODULE                                         */ 00201000
*                                                               01S0180 00202000
*   DECLARE                         /* DATA FOR AHB MACROS           */ 00203000
*     PACKED BIT(64) BOUNDARY(DWORD);/* DATA CONVERSION WORK AREA    */ 00204000
*   DECLARE                         /* COMMON VARIABLES              */ 00205000
*     I256C CHAR(256) BASED,                                    01S0181 00206000
*     I031F FIXED(31) BASED,                                    01S0181 00207000
*     I031P PTR(31) BASED,                                      01S0181 00208000
*     I015F FIXED(15) BASED,                                    01S0181 00209000
*     I015P PTR(15) BASED,                                      01S0181 00210000
*     I008P PTR(8) BASED,                                       01S0181 00211000
*     I001C CHAR(1) BASED;                                      01S0181 00212000
*   GENERATE NODEFS NOREFS DATA;                                01S0182 00213000
*   END BLSRDUIC                    /* BLRPEND(BLSRDUIC)             */ 00214000
*                                                               01S0183 00215000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00216000
*/*%INCLUDE SYSLIB  (BLSRZZZ )                                       */ 00217000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00218000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00219000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00220000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00221000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00222000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00223000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00224000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00225000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00226000
*/*%INCLUDE SYSLIB  (BLSRSERV)                                       */ 00227000
*/*%INCLUDE SYSLIB  (BLSRHSD )                                       */ 00228000
*                                                               01S0183 00229000
*       ;                                                       01S0183 00230000
@EL00001 L     @13,4(,@13)                                      01S0183 00231000
@EF00001 L     @00,@SIZDATD                                     01S0183 00232000
         LR    @01,@11                                          01S0183 00233000
         BLSUFRES R,LV=(0),A=(1)                                        00234000
@ER00001 LM    @14,@12,12(@13)                                  01S0183 00235000
         BR    @14                                              01S0183 00236000
@DATA    DS    0H                                                       00237000
@DATD    DSECT                                                          00238000
         DS    0F                                                       00239000
@SA00001 DS    18F                                                      00240000
@PC00001 DS    2F                                                       00241000
@AL00001 DS    2A                                                       00242000
BLSRDUIC CSECT                                                          00243000
         DS    0F                                                       00244000
@DATD    DSECT                                                          00245000
         DS    0D                                                       00246000
MA       DS    CL254                                                    00247000
         ORG   MA                                                       00248000
MAL      DS    FL2                                                      00249000
@NM00098 DS    BL2                                                      00250000
MAT      DS    CL250                                                    00251000
         ORG   MAT                                                      00252000
MATA     DS    CL250                                                    00253000
         ORG   MA+254                                                   00254000
         DS    CL2                                                      00255000
PACKED   DS    BL8                                                      00256000
BLSRDUIC CSECT                                                          00257000
         DS    0F                                                       00258000
@SIZDATD DC    AL1(0)                                                   00259000
         DC    AL3(@ENDDATD-@DATD)                                      00260000
         DS    0D                                                       00261000
M125S    DS    CL40                                                     00262000
         ORG   M125S                                                    00263000
M125SL   DC    AL2(40)                                                  00264000
@NM00099 DC    X'0000'                                                  00265000
M125ST   DS    CL36                                                     00266000
         ORG   M125ST                                                   00267000
M125STA  DC    CL14'BLS18125I CPU('                                     00268000
M125STB  DC    X'40202120'                                              00269000
M125STC  DC    CL18') STATUS AVAILABLE'                                 00270000
         ORG   M125S+40                                                 00271000
M126S    DS    CL45                                                     00272000
         ORG   M126S                                                    00273000
M126SL   DC    AL2(45)                                                  00274000
@NM00101 DC    X'0000'                                                  00275000
M126ST   DS    CL41                                                     00276000
         ORG   M126ST                                                   00277000
M126STA  DC    CL14'BLS18126I CPU('                                     00278000
M126STB  DC    X'40202120'                                              00279000
M126STC  DC    CL23') STATUS MAY BE INVALID'                            00280000
         ORG   M126S+45                                                 00281000
         DS    CL1                                                      00282000
M128S    DS    CL49                                                     00283000
         ORG   M128S                                                    00284000
M128SL   DC    AL2(49)                                                  00285000
@NM00103 DC    X'0000'                                                  00286000
M128ST   DS    CL45                                                     00287000
         ORG   M128ST                                                   00288000
M128STA  DC    CL14'BLS18128I CPU('                                     00289000
M128STB  DC    X'40202120'                                              00290000
M128STC  DC    CL27')--ONLY GPR STATUS IS VALID'                        00291000
         ORG   M128S+49                                                 00292000
@DATD    DSECT                                                          00293000
         SPACE 2                                                        00294000
*********************************************************************** 00295000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00296000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 00297000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 00298000
*********************************************************************** 00299000
         SPACE                                                          00300000
BLSRDUIC CSECT                                                          00301000
         ORG                                                            00302000
         DS    0D                                                       00303000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSRDUIC+19)/20+7)/8)CL8'BLSRDUIC'     00304000
@DATD    DSECT                                                          00305000
         DS    0H                                                       00306000
@DATD    DSECT                                                          00307000
         SPACE 2                                                        00308000
*********************************************************************** 00309000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 00310000
*********************************************************************** 00311000
         SPACE                                                          00312000
         DS    0D                                                       00313000
@DATD    DSECT                                                          00314000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00315000
@ENDDATD EQU   *                                                        00316000
BLSRDUIC CSECT                                                          00317000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00318000
@01      EQU   01                                                       00319000
@02      EQU   02                                                       00320000
@03      EQU   03                                                       00321000
@04      EQU   04                                                       00322000
@05      EQU   05                                                       00323000
@06      EQU   06                                                       00324000
@07      EQU   07                                                       00325000
@08      EQU   08                                                       00326000
@09      EQU   09                                                       00327000
@10      EQU   10                                                       00328000
@11      EQU   11                                                       00329000
@12      EQU   12                                                       00330000
@13      EQU   13                                                       00331000
@14      EQU   14                                                       00332000
@15      EQU   15                                                       00333000
RETC     EQU   @03                                                      00334000
CPU      EQU   @03                                                      00335000
R9       EQU   @09                                                      00336000
R0       EQU   @00                                                      00337000
R1       EQU   @01                                                      00338000
R2       EQU   @02                                                      00339000
R3       EQU   @03                                                      00340000
R4       EQU   @04                                                      00341000
R5       EQU   @05                                                      00342000
RB       EQU   @11                                                      00343000
RD       EQU   @13                                                      00344000
RE       EQU   @14                                                      00345000
RF       EQU   @15                                                      00346000
RA       EQU   @10                                                      00347000
RC       EQU   @12                                                      00348000
R6       EQU   @06                                                      00349000
R7       EQU   @07                                                      00350000
R8       EQU   @08                                                      00351000
ZZ1      EQU   0                                                        00352000
ZZ1ATTN  EQU   ZZ1+360                                                  00353000
ZZ1EVE   EQU   ZZ1ATTN+4                                                00354000
ZZ1F     EQU   ZZ1+368                                                  00355000
ZZ1N     EQU   ZZ1+1116                                                 00356000
ZZ2      EQU   0                                                        00357000
ZZ2AMD   EQU   ZZ2                                                      00358000
@NM00013 EQU   ZZ2AMD+7                                                 00359000
ZZ2PRT   EQU   ZZ2+138                                                  00360000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 00361000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                00362000
ZZ2A     EQU   ZZ2+272                                                  00363000
ZZ2AF    EQU   ZZ2A+16                                                  00364000
ZZ2APID  EQU   ZZ2A+64                                                  00365000
ZZ2AD    EQU   ZZ2A+74                                                  00366000
ZZ2ADD   EQU   ZZ2AD                                                    00367000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 00368000
ZZ2ADM   EQU   ZZ2AD+46                                                 00369000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 00370000
ZZ2ADP   EQU   ZZ2AD+56                                                 00371000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 00372000
ZZ2AZZ6P EQU   ZZ2A+140                                                 00373000
ZZ2AQAS  EQU   ZZ2A+144                                                 00374000
ZZ2AQD   EQU   ZZ2A+160                                                 00375000
ZZ2AQDT  EQU   ZZ2AQD+10                                                00376000
ZZ2AQDF  EQU   ZZ2AQD+52                                                00377000
ZZ2STG   EQU   ZZ2+960                                                  00378000
ZZ2ALLOP EQU   ZZ2+992                                                  00379000
ZZ2FREEP EQU   ZZ2+996                                                  00380000
ZZ2FF19P EQU   ZZ2+1000                                                 00381000
ZZ2FRE1P EQU   ZZ2+1004                                                 00382000
ZZ2FF18P EQU   ZZ2+1008                                                 00383000
ZZ2DYNAP EQU   ZZ2+1012                                                 00384000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 00385000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 00386000
ZZ2STAIP EQU   ZZ2+1024                                                 00387000
ZZ2FF02P EQU   ZZ2+1028                                                 00388000
ZZ2GETLP EQU   ZZ2+1032                                                 00389000
ZZ2PARSP EQU   ZZ2+1036                                                 00390000
ZZ2PTGTP EQU   ZZ2+1040                                                 00391000
ZZ2PUTLP EQU   ZZ2+1044                                                 00392000
ZZ2SCANP EQU   ZZ2+1048                                                 00393000
ZZ2STCKP EQU   ZZ2+1052                                                 00394000
ZZ2TRMOP EQU   ZZ2+1064                                                 00395000
ZZ2TRMVP EQU   ZZ2+1068                                                 00396000
ZZ2PUTNP EQU   ZZ2+1084                                                 00397000
ZZ2TRMNP EQU   ZZ2+1088                                                 00398000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 00399000
ZZ2BVTP  EQU   ZZ2+1280                                                 00400000
ZZ2RVTP  EQU   ZZ2+1284                                                 00401000
ZZ2CPPL  EQU   ZZ2+1292                                                 00402000
ZZ2CPPLC EQU   ZZ2CPPL                                                  00403000
ZZ2ITR   EQU   ZZ2+2840                                                 00404000
ZZ2ITRE  EQU   ZZ2ITR+16                                                00405000
ZZ2ITSE  EQU   ZZ2+2864                                                 00406000
ZZ2ES    EQU   ZZ2+2872                                                 00407000
ZZ2AMDX  EQU   ZZ2+7160                                                 00408000
ZZ2AXO   EQU   ZZ2+7934                                                 00409000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 00410000
CMD      EQU   0                                                        00411000
CMDT     EQU   CMD+4                                                    00412000
PSCB     EQU   0                                                        00413000
PSCBATR1 EQU   PSCB+16                                                  00414000
ECT      EQU   0                                                        00415000
ECTSWS   EQU   ECT+28                                                   00416000
ECTSWS2  EQU   ECT+40                                                   00417000
ECTSWS21 EQU   ECTSWS2                                                  00418000
UPT      EQU   0                                                        00419000
UPTSWS   EQU   UPT+12                                                   00420000
SA       EQU   0                                                        00421000
SA1      EQU   SA                                                       00422000
SAR      EQU   SA+12                                                    00423000
SAR1     EQU   SAR+12                                                   00424000
BLSUMPK1 EQU   0                                                        00425000
BLSUTRMV EQU   0                                                        00426000
BVT      EQU   0                                                        00427000
BVTPUTLP EQU   BVT+4                                                    00428000
BVTPUTOP EQU   BVT+12                                                   00429000
BVTPUTTP EQU   BVT+16                                                   00430000
BVTPUTVP EQU   BVT+20                                                   00431000
BVTPUTAP EQU   BVT+24                                                   00432000
BVTPRTTP EQU   BVT+28                                                   00433000
BVTPRTAP EQU   BVT+32                                                   00434000
BVTPUTDP EQU   BVT+36                                                   00435000
BVTMONP  EQU   BVT+40                                                   00436000
BVTMON2P EQU   BVT+44                                                   00437000
BVTVSARP EQU   BVT+48                                                   00438000
BVTVSENP EQU   BVT+64                                                   00439000
BVTVSERP EQU   BVT+68                                                   00440000
BVTVSGEP EQU   BVT+72                                                   00441000
BVTVSGUP EQU   BVT+76                                                   00442000
BVTVSPOP EQU   BVT+80                                                   00443000
BVTVSPUP EQU   BVT+84                                                   00444000
BVTMPKNP EQU   BVT+104                                                  00445000
BVTMONLP EQU   BVT+108                                                  00446000
BVTPUTCP EQU   BVT+132                                                  00447000
BVTMPK1P EQU   BVT+136                                                  00448000
BVTZZ2RP EQU   BVT+140                                                  00449000
BVTPGMRP EQU   BVT+144                                                  00450000
BVTMONAP EQU   BVT+148                                                  00451000
BVTBLDDP EQU   BVT+152                                                  00452000
BVTBLDLP EQU   BVT+156                                                  00453000
BVTPGMCP EQU   BVT+160                                                  00454000
BVTPGMDP EQU   BVT+164                                                  00455000
BVTPGMLP EQU   BVT+168                                                  00456000
BVTMONCP EQU   BVT+180                                                  00457000
BVTMONDP EQU   BVT+184                                                  00458000
BVTMONTP EQU   BVT+188                                                  00459000
BVTPARIP EQU   BVT+192                                                  00460000
BVTPARUP EQU   BVT+196                                                  00461000
BVTPRTNP EQU   BVT+204                                                  00462000
BVTVSCRP EQU   BVT+208                                                  00463000
BVTVSMRP EQU   BVT+212                                                  00464000
BVTMONXP EQU   BVT+216                                                  00465000
BVTTRMAP EQU   BVT+228                                                  00466000
ZZ6      EQU   0                                                        00467000
ZZ6D     EQU   ZZ6+128                                                  00468000
ZZ6DD    EQU   ZZ6D+8                                                   00469000
ZZ6DDT   EQU   ZZ6DD+4                                                  00470000
ZZ6DQA   EQU   ZZ6D+68                                                  00471000
ZZ6DQA1  EQU   ZZ6DQA+4                                                 00472000
ZZ6DQ1   EQU   ZZ6D+84                                                  00473000
ZZ6DF    EQU   ZZ6D+92                                                  00474000
ZZ6DFMP  EQU   ZZ6DF                                                    00475000
ZZ6DFST  EQU   ZZ6DF                                                    00476000
ZZ6B     EQU   ZZ6+768                                                  00477000
RVT      EQU   0                                                        00478000
RVTADDRP EQU   RVT                                                      00479000
RVTT01P  EQU   RVT+4                                                    00480000
RVTTAP   EQU   RVT+8                                                    00481000
RVTTBP   EQU   RVT+12                                                   00482000
RVTTCP   EQU   RVT+16                                                   00483000
RVTTFP   EQU   RVT+24                                                   00484000
RVTTYP   EQU   RVT+40                                                   00485000
RVTT02P  EQU   RVT+48                                                   00486000
RVTT03P  EQU   RVT+52                                                   00487000
RVTT04P  EQU   RVT+56                                                   00488000
RVTACCLP EQU   RVT+60                                                   00489000
RVTRACCP EQU   RVT+64                                                   00490000
RVTTLP   EQU   RVT+68                                                   00491000
RVTTMP   EQU   RVT+72                                                   00492000
RVTTUP   EQU   RVT+80                                                   00493000
RVTESGEP EQU   RVT+84                                                   00494000
RVTESGUP EQU   RVT+88                                                   00495000
RVTESARP EQU   RVT+92                                                   00496000
RVTRAARP EQU   RVT+96                                                   00497000
RVTRAGEP EQU   RVT+100                                                  00498000
RVTADDPP EQU   RVT+104                                                  00499000
RVTACCQP EQU   RVT+108                                                  00500000
RVTSAGUP EQU   RVT+124                                                  00501000
RVTSAGEP EQU   RVT+128                                                  00502000
RVTESCKP EQU   RVT+132                                                  00503000
RVTMSGAP EQU   RVT+136                                                  00504000
RVTMSGDP EQU   RVT+140                                                  00505000
RVTADDTP EQU   RVT+160                                                  00506000
RVTADDUP EQU   RVT+164                                                  00507000
RVTADD1P EQU   RVT+176                                                  00508000
RVTADD2P EQU   RVT+180                                                  00509000
RVTRSAGP EQU   RVT+184                                                  00510000
RVTMSGBP EQU   RVT+188                                                  00511000
RVTADDSP EQU   RVT+192                                                  00512000
RVTADD3P EQU   RVT+196                                                  00513000
RVTT05P  EQU   RVT+200                                                  00514000
RVTPADSP EQU   RVT+204                                                  00515000
RVTTRP   EQU   RVT+228                                                  00516000
RVTADD4P EQU   RVT+232                                                  00517000
RVTSAPCP EQU   RVT+236                                                  00518000
RVTSAARP EQU   RVT+240                                                  00519000
RVTSAGNP EQU   RVT+244                                                  00520000
RVTT06P  EQU   RVT+248                                                  00521000
RVTSAGCP EQU   RVT+252                                                  00522000
RVTSAGQP EQU   RVT+256                                                  00523000
RVTESGCP EQU   RVT+260                                                  00524000
RVTESGQP EQU   RVT+264                                                  00525000
RVTDUCKP EQU   RVT+276                                                  00526000
RVTDUCCP EQU   RVT+280                                                  00527000
BLSRACC  EQU   0                                                        00528000
BLSRACCL EQU   0                                                        00529000
BLSRACCQ EQU   0                                                        00530000
BLSRADDP EQU   0                                                        00531000
BLSRADDR EQU   0                                                        00532000
BLSRADDS EQU   0                                                        00533000
BLSRADDT EQU   0                                                        00534000
BLSRADDU EQU   0                                                        00535000
BLSRADD1 EQU   0                                                        00536000
BLSRADD2 EQU   0                                                        00537000
BLSRADD3 EQU   0                                                        00538000
BLSRADD4 EQU   0                                                        00539000
BLSRDUCC EQU   0                                                        00540000
BLSRDUCK EQU   0                                                        00541000
BLSRESAR EQU   0                                                        00542000
BLSRESCK EQU   0                                                        00543000
BLSRESGC EQU   0                                                        00544000
BLSRESGE EQU   0                                                        00545000
BLSRESGQ EQU   0                                                        00546000
BLSRESGU EQU   0                                                        00547000
BLSRMSGA EQU   0                                                        00548000
BLSRMSGB EQU   0                                                        00549000
BLSRMSGD EQU   0                                                        00550000
BLSRPADS EQU   0                                                        00551000
BLSRRAAR EQU   0                                                        00552000
BLSRRAGE EQU   0                                                        00553000
BLSRSAAR EQU   0                                                        00554000
BLSRSAG  EQU   0                                                        00555000
BLSRSAGC EQU   0                                                        00556000
BLSRSAGE EQU   0                                                        00557000
BLSRSAGN EQU   0                                                        00558000
BLSRSAGQ EQU   0                                                        00559000
BLSRSAGU EQU   0                                                        00560000
BLSRSAPC EQU   0                                                        00561000
BLSTA    EQU   0                                                        00562000
BLSTB    EQU   0                                                        00563000
BLSTC    EQU   0                                                        00564000
BLSTF    EQU   0                                                        00565000
BLSTL    EQU   0                                                        00566000
BLSTM    EQU   0                                                        00567000
BLSTR    EQU   0                                                        00568000
BLSTU    EQU   0                                                        00569000
BLSTY    EQU   0                                                        00570000
BLST01   EQU   0                                                        00571000
BLST02   EQU   0                                                        00572000
BLST03   EQU   0                                                        00573000
BLST04   EQU   0                                                        00574000
BLST05   EQU   0                                                        00575000
BLST06   EQU   0                                                        00576000
BLSUALLO EQU   0                                                        00577000
BLSUBLDD EQU   0                                                        00578000
BLSUBLDL EQU   0                                                        00579000
BLSUDYNA EQU   0                                                        00580000
BLSUFREE EQU   0                                                        00581000
BLSUFRE1 EQU   0                                                        00582000
BLSUMON  EQU   0                                                        00583000
BLSUMONA EQU   0                                                        00584000
BLSUMONC EQU   0                                                        00585000
BLSUMOND EQU   0                                                        00586000
BLSUMONL EQU   0                                                        00587000
BLSUMONT EQU   0                                                        00588000
BLSUMONX EQU   0                                                        00589000
BLSUMON2 EQU   0                                                        00590000
BLSUMPKN EQU   0                                                        00591000
BLSUPARI EQU   0                                                        00592000
BLSUPARU EQU   0                                                        00593000
BLSUPGMC EQU   0                                                        00594000
BLSUPGMD EQU   0                                                        00595000
BLSUPGML EQU   0                                                        00596000
BLSUPGMR EQU   0                                                        00597000
BLSUPRTA EQU   0                                                        00598000
BLSUPRTN EQU   0                                                        00599000
BLSUPRTT EQU   0                                                        00600000
BLSUPUTA EQU   0                                                        00601000
BLSUPUTC EQU   0                                                        00602000
BLSUPUTD EQU   0                                                        00603000
BLSUPUTL EQU   0                                                        00604000
BLSUPUTN EQU   0                                                        00605000
BLSUPUTO EQU   0                                                        00606000
BLSUPUTT EQU   0                                                        00607000
BLSUPUTV EQU   0                                                        00608000
BLSUSTAI EQU   0                                                        00609000
BLSUTRMA EQU   0                                                        00610000
BLSUTRMN EQU   0                                                        00611000
BLSUTRMO EQU   0                                                        00612000
BLSUVSAR EQU   0                                                        00613000
BLSUVSCR EQU   0                                                        00614000
BLSUVSEN EQU   0                                                        00615000
BLSUVSER EQU   0                                                        00616000
BLSUVSGE EQU   0                                                        00617000
BLSUVSGU EQU   0                                                        00618000
BLSUVSMR EQU   0                                                        00619000
BLSUVSPO EQU   0                                                        00620000
BLSUVSPU EQU   0                                                        00621000
BLSUZZ2C EQU   0                                                        00622000
BLSUZZ2D EQU   0                                                        00623000
BLSUZZ2R EQU   0                                                        00624000
IKJEFF02 EQU   0                                                        00625000
IKJEFF18 EQU   0                                                        00626000
IKJEFF19 EQU   0                                                        00627000
IKJGETL  EQU   0                                                        00628000
IKJPARS  EQU   0                                                        00629000
IKJPTGT  EQU   0                                                        00630000
IKJPUTL  EQU   0                                                        00631000
IKJSCAN  EQU   0                                                        00632000
IKJSTCK  EQU   0                                                        00633000
I001C    EQU   0                                                        00634000
I008P    EQU   0                                                        00635000
I015F    EQU   0                                                        00636000
I015P    EQU   0                                                        00637000
I031F    EQU   0                                                        00638000
I031P    EQU   0                                                        00639000
I256C    EQU   0                                                        00640000
PZ2      EQU   0                                                        00641000
HSD      EQU   0                                                        00642000
CPPL     EQU   ZZ2CPPL                                                  00643000
CPPLUPT  EQU   CPPL+4                                                   00644000
CPPLPSCB EQU   CPPL+8                                                   00645000
CPPLECT  EQU   CPPL+12                                                  00646000
HSDH     EQU   HSD                                                      00647000
HSDHV    EQU   HSD                                                      00648000
HSDHA    EQU   HSD                                                      00649000
HSDC     EQU   HSD                                                      00650000
HSDCSF   EQU   HSDC+2                                                   00651000
HSDCSFI  EQU   HSDCSF                                                   00652000
HSDCSFR  EQU   HSDCSF                                                   00653000
HSDCSCPU EQU   HSDC+6                                                   00654000
HSDCPSA  EQU   HSDC+8                                                   00655000
HSDCPADD EQU   HSDCPSA+516                                              00656000
HSDS     EQU   HSD                                                      00657000
M125B    EQU   MA                                                       00658000
M125BT   EQU   M125B+4                                                  00659000
M125BTB  EQU   M125BT+14                                                00660000
M126B    EQU   MA                                                       00661000
M126BT   EQU   M126B+4                                                  00662000
M126BTB  EQU   M126BT+14                                                00663000
M128B    EQU   MA                                                       00664000
M128BT   EQU   M128B+4                                                  00665000
M128BTB  EQU   M128BT+14                                                00666000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00667000
M128BTC  EQU   M128BT+18                                                00668000
M128BTA  EQU   M128BT                                                   00669000
@NM00104 EQU   M128B+2                                                  00670000
M128BL   EQU   M128B                                                    00671000
M126BTC  EQU   M126BT+18                                                00672000
M126BTA  EQU   M126BT                                                   00673000
@NM00102 EQU   M126B+2                                                  00674000
M126BL   EQU   M126B                                                    00675000
M125BTC  EQU   M125BT+18                                                00676000
M125BTA  EQU   M125BT                                                   00677000
@NM00100 EQU   M125B+2                                                  00678000
M125BL   EQU   M125B                                                    00679000
HSDSC    EQU   HSDS+8                                                   00680000
HSDSP    EQU   HSDS+4                                                   00681000
HSDSASI  EQU   HSDS+2                                                   00682000
HSDSK2   EQU   HSDS+1                                                   00683000
HSDSK1   EQU   HSDS                                                     00684000
@NM00097 EQU   HSDCPSA+552                                              00685000
HSDCASCO EQU   HSDCPSA+548                                              00686000
HSDCASCN EQU   HSDCPSA+544                                              00687000
HSDCTCBO EQU   HSDCPSA+540                                              00688000
HSDCTCBN EQU   HSDCPSA+536                                              00689000
HSDCLCCR EQU   HSDCPSA+532                                              00690000
HSDCLCCV EQU   HSDCPSA+528                                              00691000
HSDCPCCR EQU   HSDCPSA+524                                              00692000
HSDCPCCV EQU   HSDCPSA+520                                              00693000
HSDCLADD EQU   HSDCPSA+518                                              00694000
HSDCPSID EQU   HSDCPSA+512                                              00695000
HSDCTLR  EQU   HSDCPSA+448                                              00696000
HSDCGPR  EQU   HSDCPSA+384                                              00697000
HSDCFPR  EQU   HSDCPSA+352                                              00698000
HSDCADDR EQU   HSDCPSA+350                                              00699000
@NM00096 EQU   HSDCPSA+268                                              00700000
HSDCPREF EQU   HSDCPSA+264                                              00701000
HSDCLPSW EQU   HSDCPSA+256                                              00702000
@NM00095 EQU   HSDCPSA                                                  00703000
@NM00094 EQU   HSDC+4                                                   00704000
@NM00093 EQU   HSDCSF                                                   00705000
HSDCSFU  EQU   HSDCSF                                                   00706000
HSDCCLA  EQU   HSDC+1                                                   00707000
HSDCTYPE EQU   HSDC                                                     00708000
@NM00092 EQU   HSDHA+132                                                00709000
HSDHACAW EQU   HSDHA+128                                                00710000
HSDHACSW EQU   HSDHA+120                                                00711000
@NM00091 EQU   HSDHA+20                                                 00712000
@NM00090 EQU   HSDHA+12                                                 00713000
@NM00089 EQU   HSDHA+4                                                  00714000
@NM00088 EQU   HSDHA+2                                                  00715000
@NM00087 EQU   HSDHA+1                                                  00716000
@NM00086 EQU   HSDHA                                                    00717000
@NM00085 EQU   HSDHV+292                                                00718000
HSDHVCVT EQU   HSDHV+288                                                00719000
HSDHVPSW EQU   HSDHV+280                                                00720000
HSDHVCR  EQU   HSDHV+216                                                00721000
HSDHVGPR EQU   HSDHV+152                                                00722000
HSDHVFPR EQU   HSDHV+120                                                00723000
@NM00084 EQU   HSDHV+20                                                 00724000
@NM00083 EQU   HSDHV+12                                                 00725000
@NM00082 EQU   HSDHV+4                                                  00726000
@NM00081 EQU   HSDHV+2                                                  00727000
@NM00080 EQU   HSDHV+1                                                  00728000
@NM00079 EQU   HSDHV                                                    00729000
@NM00078 EQU   HSDH+120                                                 00730000
HSDHTITL EQU   HSDH+20                                                  00731000
HSDHTOD  EQU   HSDH+12                                                  00732000
HSDHPROG EQU   HSDH+4                                                   00733000
HSDHASI  EQU   HSDH+2                                                   00734000
HSDHCLA  EQU   HSDH+1                                                   00735000
HSDHTYPE EQU   HSDH                                                     00736000
CPPLCBUF EQU   CPPL                                                     00737000
@NM00077 EQU   HSD+2                                                    00738000
HSDCLA   EQU   HSD+1                                                    00739000
HSDTYPE  EQU   HSD                                                      00740000
RVT99999 EQU   RVT+384                                                  00741000
RVT0096P EQU   RVT+380                                                  00742000
RVT0095P EQU   RVT+376                                                  00743000
RVT0094P EQU   RVT+372                                                  00744000
RVT0093P EQU   RVT+368                                                  00745000
RVT0092P EQU   RVT+364                                                  00746000
RVT0091P EQU   RVT+360                                                  00747000
RVT0090P EQU   RVT+356                                                  00748000
RVT0089P EQU   RVT+352                                                  00749000
RVT0088P EQU   RVT+348                                                  00750000
RVT0087P EQU   RVT+344                                                  00751000
RVT0086P EQU   RVT+340                                                  00752000
RVT0085P EQU   RVT+336                                                  00753000
RVT0084P EQU   RVT+332                                                  00754000
RVT0083P EQU   RVT+328                                                  00755000
RVT0082P EQU   RVT+324                                                  00756000
RVT0081P EQU   RVT+320                                                  00757000
RVT0080P EQU   RVT+316                                                  00758000
RVT0079P EQU   RVT+312                                                  00759000
RVT0078P EQU   RVT+308                                                  00760000
RVT0077P EQU   RVT+304                                                  00761000
RVT0076P EQU   RVT+300                                                  00762000
RVT0075P EQU   RVT+296                                                  00763000
RVT0074P EQU   RVT+292                                                  00764000
RVT0073P EQU   RVT+288                                                  00765000
RVT0072P EQU   RVT+284                                                  00766000
RVTDTUTP EQU   RVT+272                                                  00767000
RVTDTMTP EQU   RVT+268                                                  00768000
RVT0057P EQU   RVT+224                                                  00769000
RVT0056P EQU   RVT+220                                                  00770000
RVT0055P EQU   RVT+216                                                  00771000
RVT0054P EQU   RVT+212                                                  00772000
RVT0053P EQU   RVT+208                                                  00773000
RVT0044P EQU   RVT+172                                                  00774000
RVT0043P EQU   RVT+168                                                  00775000
RVT0040P EQU   RVT+156                                                  00776000
RVT0039P EQU   RVT+152                                                  00777000
RVT0038P EQU   RVT+148                                                  00778000
RVT0037P EQU   RVT+144                                                  00779000
RVT0031P EQU   RVT+120                                                  00780000
RVT0030P EQU   RVT+116                                                  00781000
RVT0029P EQU   RVT+112                                                  00782000
RVT0020P EQU   RVT+76                                                   00783000
RVT0012P EQU   RVT+44                                                   00784000
RVT0010P EQU   RVT+36                                                   00785000
RVT0009P EQU   RVT+32                                                   00786000
RVT0008P EQU   RVT+28                                                   00787000
RVT0006P EQU   RVT+20                                                   00788000
ZZ69999  EQU   ZZ6+1792                                                 00789000
ZZ6BRB   EQU   ZZ6B+12                                                  00790000
ZZ6BRC   EQU   ZZ6B+8                                                   00791000
@NM00076 EQU   ZZ6B+6                                                   00792000
ZZ6BFL   EQU   ZZ6B+4                                                   00793000
ZZ6BDA   EQU   ZZ6B                                                     00794000
@NM00075 EQU   ZZ6+540                                                  00795000
ZZ6BUFI  EQU   ZZ6+536                                                  00796000
ZZ6BUFP  EQU   ZZ6+532                                                  00797000
ZZ6FILE  EQU   ZZ6+524                                                  00798000
ZZ6BUFB  EQU   ZZ6+520                                                  00799000
ZZ6BUFL  EQU   ZZ6+518                                                  00800000
ZZ6BUFN  EQU   ZZ6+516                                                  00801000
ZZ6ZZ6P  EQU   ZZ6+512                                                  00802000
@NM00074 EQU   ZZ6+256                                                  00803000
ZZ6D999  EQU   ZZ6D+128                                                 00804000
@NM00073 EQU   ZZ6D+116                                                 00805000
ZZ6DCAP  EQU   ZZ6D+112                                                 00806000
ZZ6DPRP  EQU   ZZ6D+108                                                 00807000
ZZ6DDA2  EQU   ZZ6D+104                                                 00808000
ZZ6DDA1  EQU   ZZ6D+100                                                 00809000
@NM00072 EQU   ZZ6DF                                                    00810000
ZZ6DFSU  EQU   ZZ6DF                                                    00811000
ZZ6DFAB  EQU   ZZ6DF                                                    00812000
ZZ6DFDU  EQU   ZZ6DF                                                    00813000
ZZ6DFBS  EQU   ZZ6DF                                                    00814000
ZZ6DQ2   EQU   ZZ6D+88                                                  00815000
ZZ6DQA9  EQU   ZZ6DQA+16                                                00816000
@NM00071 EQU   ZZ6DQA+12                                                00817000
ZZ6DQA2  EQU   ZZ6DQA+8                                                 00818000
@NM00070 EQU   ZZ6DQA+2                                                 00819000
ZZ6DQAT  EQU   ZZ6DQA                                                   00820000
ZZ6DQA0  EQU   ZZ6DQA                                                   00821000
ZZ6DRDX  EQU   ZZ6D+64                                                  00822000
ZZ6DELK  EQU   ZZ6D+64                                                  00823000
ZZ6DMEM  EQU   ZZ6D+56                                                  00824000
ZZ6DDT1  EQU   ZZ6DDT                                                   00825000
ZZ6DDO   EQU   ZZ6DD+2                                                  00826000
ZZ6DDL   EQU   ZZ6DD                                                    00827000
@NM00069 EQU   ZZ6D+2                                                   00828000
ZZ6DRID  EQU   ZZ6D                                                     00829000
ZZ6RDCB  EQU   ZZ6                                                      00830000
ZZ60000  EQU   ZZ6                                                      00831000
BVT99999 EQU   BVT+256                                                  00832000
BVT0064P EQU   BVT+252                                                  00833000
BVT0063P EQU   BVT+248                                                  00834000
BVT0062P EQU   BVT+244                                                  00835000
BVT0061P EQU   BVT+240                                                  00836000
BVT0060P EQU   BVT+236                                                  00837000
BVT0059P EQU   BVT+232                                                  00838000
BVT0057P EQU   BVT+224                                                  00839000
BVT0056P EQU   BVT+220                                                  00840000
BVTSTBLP EQU   BVT+200                                                  00841000
BVT0045P EQU   BVT+176                                                  00842000
BVT0044P EQU   BVT+172                                                  00843000
BVT0033P EQU   BVT+128                                                  00844000
BVT0032P EQU   BVT+124                                                  00845000
BVT0031P EQU   BVT+120                                                  00846000
BVT0030P EQU   BVT+116                                                  00847000
BVT0029P EQU   BVT+112                                                  00848000
BVT0026P EQU   BVT+100                                                  00849000
BVT0025P EQU   BVT+96                                                   00850000
BVT0024P EQU   BVT+92                                                   00851000
BVT0023P EQU   BVT+88                                                   00852000
BVT0016P EQU   BVT+60                                                   00853000
BVT0015P EQU   BVT+56                                                   00854000
BVT0014P EQU   BVT+52                                                   00855000
BVT0003P EQU   BVT+8                                                    00856000
BVT0001P EQU   BVT                                                      00857000
SA99     EQU   SA+72                                                    00858000
SARC     EQU   SAR+56                                                   00859000
SARB     EQU   SAR+52                                                   00860000
SARA     EQU   SAR+48                                                   00861000
SAR9     EQU   SAR+44                                                   00862000
SAR8     EQU   SAR+40                                                   00863000
SAR7     EQU   SAR+36                                                   00864000
SAR6     EQU   SAR+32                                                   00865000
SAR5     EQU   SAR+28                                                   00866000
SAR4     EQU   SAR+24                                                   00867000
SAR3     EQU   SAR+20                                                   00868000
SAR2     EQU   SAR+16                                                   00869000
SAR0     EQU   SAR+8                                                    00870000
SARF     EQU   SAR+4                                                    00871000
SARE     EQU   SAR                                                      00872000
SAFWD    EQU   SA+8                                                     00873000
SABAK    EQU   SA+4                                                     00874000
SA1L     EQU   SA1+1                                                    00875000
SA1P     EQU   SA1                                                      00876000
UPTPREFL EQU   UPT+23                                                   00877000
UPTPREFX EQU   UPT+16                                                   00878000
@NM00068 EQU   UPT+15                                                   00879000
UPTLDEL  EQU   UPT+14                                                   00880000
UPTCDEL  EQU   UPT+13                                                   00881000
UPTWTP   EQU   UPTSWS                                                   00882000
UPTMODE  EQU   UPTSWS                                                   00883000
UPTALD   EQU   UPTSWS                                                   00884000
UPTPAUS  EQU   UPTSWS                                                   00885000
UPTNCOM  EQU   UPTSWS                                                   00886000
UPTMID   EQU   UPTSWS                                                   00887000
UPTNPRM  EQU   UPTSWS                                                   00888000
UPTRCVR  EQU   UPTSWS                                                   00889000
UPTUSER  EQU   UPT+2                                                    00890000
@NM00067 EQU   UPT                                                      00891000
@NM00066 EQU   ECT+52                                                   00892000
@NM00065 EQU   ECT+48                                                   00893000
@NM00064 EQU   ECT+44                                                   00894000
@NM00063 EQU   ECTSWS2+1                                                00895000
@NM00062 EQU   ECTSWS21                                                 00896000
ECTTABND EQU   ECTSWS21                                                 00897000
ECTDEFCS EQU   ECTSWS21                                                 00898000
ECTBKPB  EQU   ECT+36                                                   00899000
ECTUSER  EQU   ECT+32                                                   00900000
ECTDDNUM EQU   ECT+29                                                   00901000
ECTATTN  EQU   ECTSWS                                                   00902000
ECTBKGRD EQU   ECTSWS                                                   00903000
ECTNNOT  EQU   ECTSWS                                                   00904000
ECTNMAL  EQU   ECTSWS                                                   00905000
ECTLOGF  EQU   ECTSWS                                                   00906000
ECTATRM  EQU   ECTSWS                                                   00907000
@NM00061 EQU   ECTSWS                                                   00908000
ECTNOPD  EQU   ECTSWS                                                   00909000
ECTSCMD  EQU   ECT+20                                                   00910000
ECTPCMD  EQU   ECT+12                                                   00911000
ECTSMSG  EQU   ECT+9                                                    00912000
ECTMSGF  EQU   ECT+8                                                    00913000
ECTIOWA  EQU   ECT+4                                                    00914000
ECTRTCD  EQU   ECT+1                                                    00915000
ECTRCDF  EQU   ECT                                                      00916000
PSCBU    EQU   PSCB+64                                                  00917000
PSCBRSZ  EQU   PSCB+60                                                  00918000
PSCBLINE EQU   PSCB+59                                                  00919000
PSCBCHAR EQU   PSCB+58                                                  00920000
PSCBUPTL EQU   PSCB+56                                                  00921000
PSCBUPT  EQU   PSCB+52                                                  00922000
PSCBRLGB EQU   PSCB+48                                                  00923000
PSCBDEST EQU   PSCB+40                                                  00924000
@NM00060 EQU   PSCB+36                                                  00925000
@NM00059 EQU   PSCB+32                                                  00926000
@NM00058 EQU   PSCB+28                                                  00927000
PSCBLTI2 EQU   PSCB+24                                                  00928000
PSCBLTIM EQU   PSCB+20                                                  00929000
PSCBATR2 EQU   PSCB+18                                                  00930000
@NM00057 EQU   PSCBATR1                                                 00931000
@NM00056 EQU   PSCBATR1                                                 00932000
@NM00055 EQU   PSCBATR1                                                 00933000
PSCBATTN EQU   PSCBATR1                                                 00934000
PSCBVMNT EQU   PSCBATR1                                                 00935000
PSCBJCL  EQU   PSCBATR1                                                 00936000
PSCBACCT EQU   PSCBATR1                                                 00937000
PSCBCTRL EQU   PSCBATR1                                                 00938000
PSCBGPNM EQU   PSCB+8                                                   00939000
PSCBUSRL EQU   PSCB+7                                                   00940000
PSCBUSER EQU   PSCB                                                     00941000
CMDT1    EQU   CMDT                                                     00942000
CMDO     EQU   CMD+2                                                    00943000
CMDL     EQU   CMD                                                      00944000
ZZ299999 EQU   ZZ2+8192                                                 00945000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  00946000
ZZ2AXOL  EQU   ZZ2AXO                                                   00947000
@NM00054 EQU   ZZ2+7288                                                 00948000
@NM00053 EQU   ZZ2AMDX+4                                                00949000
ZZ2AMDXC EQU   ZZ2AMDX                                                  00950000
ZZ2HSD   EQU   ZZ2+3056                                                 00951000
@NM00052 EQU   ZZ2ES                                                    00952000
@NM00051 EQU   ZZ2+2868                                                 00953000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                00954000
@NM00050 EQU   ZZ2ITSE                                                  00955000
ZZ2ITSEP EQU   ZZ2ITSE                                                  00956000
ZZ2ITSEW EQU   ZZ2ITSE                                                  00957000
@NM00049 EQU   ZZ2ITR+20                                                00958000
ZZ2ITREC EQU   ZZ2ITRE+1                                                00959000
@NM00048 EQU   ZZ2ITRE                                                  00960000
ZZ2ITREP EQU   ZZ2ITRE                                                  00961000
ZZ2ITREW EQU   ZZ2ITRE                                                  00962000
@NM00047 EQU   ZZ2ITR+9                                                 00963000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 00964000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 00965000
ZZ2ITRPP EQU   ZZ2ITR                                                   00966000
@NM00046 EQU   ZZ2+1544                                                 00967000
ZZ2PGM   EQU   ZZ2+1536                                                 00968000
@NM00045 EQU   ZZ2+1526                                                 00969000
ZZ2CW    EQU   ZZ2+1524                                                 00970000
@NM00044 EQU   ZZ2+1504                                                 00971000
@NM00043 EQU   ZZ2+1352                                                 00972000
ZZ2FFSYP EQU   ZZ2+1348                                                 00973000
ZZ2SASYP EQU   ZZ2+1344                                                 00974000
ZZ2RDSYP EQU   ZZ2+1340                                                 00975000
ZZ2RASYP EQU   ZZ2+1336                                                 00976000
ZZ2PHSYP EQU   ZZ2+1332                                                 00977000
ZZ2ESSYP EQU   ZZ2+1328                                                 00978000
ZZ200SYP EQU   ZZ2+1324                                                 00979000
ZZ2SCWP  EQU   ZZ2+1320                                                 00980000
ZZ2TTLP  EQU   ZZ2+1316                                                 00981000
ZZ2LOADP EQU   ZZ2+1312                                                 00982000
ZZ2VRESP EQU   ZZ2+1308                                                 00983000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               00984000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                00985000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                00986000
ZZ2VRSAP EQU   ZZ2+1288                                                 00987000
ZZ2DVTP  EQU   ZZ2+1276                                                 00988000
@NM00042 EQU   ZZ2+1272                                                 00989000
@NM00041 EQU   ZZ2+1268                                                 00990000
ZZ2RPLP  EQU   ZZ2+1260                                                 00991000
ZZ2TCBP  EQU   ZZ2+1256                                                 00992000
@NM00040 EQU   ZZ2+1252                                                 00993000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 00994000
@NM00039 EQU   ZZ2+1112                                                 00995000
ZZ2FPDRP EQU   ZZ2+1108                                                 00996000
ZZ2FDSDP EQU   ZZ2+1104                                                 00997000
ZZ2APDRP EQU   ZZ2+1100                                                 00998000
ZZ2ADSDP EQU   ZZ2+1096                                                 00999000
ZZ2ENQ0P EQU   ZZ2+1092                                                 01000000
@NM00038 EQU   ZZ2+1080                                                 01001000
ZZ2MSG0P EQU   ZZ2+1076                                                 01002000
ZZ2FT25P EQU   ZZ2+1072                                                 01003000
ZZ2MSGSP EQU   ZZ2+1060                                                 01004000
ZZ2ALOCP EQU   ZZ2+1056                                                 01005000
@NM00037 EQU   ZZ2+976                                                  01006000
ZZ2TOD   EQU   ZZ2+968                                                  01007000
ZZ2STGN  EQU   ZZ2STG+4                                                 01008000
ZZ2STGP  EQU   ZZ2STG                                                   01009000
@NM00036 EQU   ZZ2+952                                                  01010000
ZZ2SCMDE EQU   ZZ2+944                                                  01011000
ZZ2SCMDN EQU   ZZ2+936                                                  01012000
ZZ2IDENT EQU   ZZ2+928                                                  01013000
ZZ2A9999 EQU   ZZ2A+656                                                 01014000
@NM00035 EQU   ZZ2A+224                                                 01015000
@NM00034 EQU   ZZ2A+220                                                 01016000
ZZ2AQD99 EQU   ZZ2AQD+60                                                01017000
@NM00033 EQU   ZZ2AQD+56                                                01018000
@NM00032 EQU   ZZ2AQDF                                                  01019000
ZZ2AQDFA EQU   ZZ2AQDF                                                  01020000
ZZ2AQDIL EQU   ZZ2AQD+48                                                01021000
ZZ2AQDIM EQU   ZZ2AQD+44                                                01022000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               01023000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               01024000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                01025000
@NM00031 EQU   ZZ2AQDT+1                                                01026000
ZZ2AQDTY EQU   ZZ2AQDT                                                  01027000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  01028000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 01029000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 01030000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 01031000
ZZ2AQDOF EQU   ZZ2AQD                                                   01032000
ZZ2AQD00 EQU   ZZ2AQD                                                   01033000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               01034000
@NM00030 EQU   ZZ2AQAS+12                                               01035000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                01036000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                01037000
@NM00029 EQU   ZZ2AQAS+2                                                01038000
ZZ2AQAST EQU   ZZ2AQAS                                                  01039000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  01040000
ZZ2ADPTA EQU   ZZ2ADPT                                                  01041000
ZZ2ADPL  EQU   ZZ2ADP                                                   01042000
ZZ2ADMTA EQU   ZZ2ADMT                                                  01043000
ZZ2ADML  EQU   ZZ2ADM                                                   01044000
ZZ2ADDTA EQU   ZZ2ADDT                                                  01045000
ZZ2ADDL  EQU   ZZ2ADD                                                   01046000
@NM00028 EQU   ZZ2A+72                                                  01047000
ZZ2APIDB EQU   ZZ2APID+3                                                01048000
ZZ2APIDA EQU   ZZ2APID                                                  01049000
@NM00027 EQU   ZZ2A+24                                                  01050000
@NM00026 EQU   ZZ2AF+5                                                  01051000
ZZ2AFX   EQU   ZZ2AF+5                                                  01052000
@NM00025 EQU   ZZ2AF+3                                                  01053000
ZZ2AFS   EQU   ZZ2AF+2                                                  01054000
ZZ2AFD   EQU   ZZ2AF+2                                                  01055000
ZZ2AFQ   EQU   ZZ2AF+2                                                  01056000
ZZ2AF$   EQU   ZZ2AF+2                                                  01057000
@NM00024 EQU   ZZ2AF+2                                                  01058000
ZZ2AFM   EQU   ZZ2AF+2                                                  01059000
@NM00023 EQU   ZZ2AF+2                                                  01060000
@NM00022 EQU   ZZ2AF+1                                                  01061000
ZZ2AFV   EQU   ZZ2AF+1                                                  01062000
@NM00021 EQU   ZZ2AF+1                                                  01063000
ZZ2AFC   EQU   ZZ2AF+1                                                  01064000
@NM00020 EQU   ZZ2AF                                                    01065000
ZZ2AFFS  EQU   ZZ2AF                                                    01066000
ZZ2AFT   EQU   ZZ2AF                                                    01067000
ZZ2AFP   EQU   ZZ2AF                                                    01068000
@NM00019 EQU   ZZ2A+8                                                   01069000
ZZ2ALINE EQU   ZZ2A+4                                                   01070000
@NM00018 EQU   ZZ2A+3                                                   01071000
ZZ2ASE   EQU   ZZ2A+2                                                   01072000
ZZ2ACH   EQU   ZZ2A                                                     01073000
@NM00017 EQU   ZZ2+264                                                  01074000
@NM00016 EQU   ZZ2+263                                                  01075000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  01076000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 01077000
ZZ2PRTL  EQU   ZZ2PRT                                                   01078000
@NM00015 EQU   ZZ2AMD+56                                                01079000
ZZ2AMDXP EQU   ZZ2AMD+52                                                01080000
ZZ2AMDD  EQU   ZZ2AMD+48                                                01081000
ZZ2AMDL  EQU   ZZ2AMD+44                                                01082000
ZZ2AMDU  EQU   ZZ2AMD+28                                                01083000
ZZ2AMDF  EQU   ZZ2AMD+24                                                01084000
ZZ2AMDS  EQU   ZZ2AMD+20                                                01085000
ZZ2AMDC  EQU   ZZ2AMD+16                                                01086000
ZZ2AMDP  EQU   ZZ2AMD+12                                                01087000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 01088000
@NM00014 EQU   @NM00013                                                 01089000
ZZ2AMD2  EQU   @NM00013                                                 01090000
ZZ2AMD1  EQU   @NM00013                                                 01091000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 01092000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 01093000
ZZ2AMDT  EQU   ZZ2AMD                                                   01094000
ZZ199999 EQU   ZZ1+3072                                                 01095000
@NM00012 EQU   ZZ1+2160                                                 01096000
ZZ1TRTAS EQU   ZZ1+1904                                                 01097000
ZZ1TRUPC EQU   ZZ1+1648                                                 01098000
ZZ1TRCTX EQU   ZZ1+1392                                                 01099000
ZZ1NASID EQU   ZZ1N+274                                                 01100000
ZZ1NSTRL EQU   ZZ1N+272                                                 01101000
ZZ1NOFF  EQU   ZZ1N+268                                                 01102000
ZZ1NBDY  EQU   ZZ1N+264                                                 01103000
ZZ1NADE  EQU   ZZ1N+260                                                 01104000
ZZ1NADB  EQU   ZZ1N+256                                                 01105000
ZZ1NSTR  EQU   ZZ1N                                                     01106000
@NM00011 EQU   ZZ1+1080                                                 01107000
ZZ1TREBC EQU   ZZ1+824                                                  01108000
ZZ1TRHEX EQU   ZZ1+568                                                  01109000
@NM00010 EQU   ZZ1+377                                                  01110000
ZZ1USTAE EQU   ZZ1+376                                                  01111000
@NM00009 EQU   ZZ1F+1                                                   01112000
@NM00008 EQU   ZZ1F                                                     01113000
ZZ1FM    EQU   ZZ1F                                                     01114000
ZZ1FX    EQU   ZZ1F                                                     01115000
ZZ1FU    EQU   ZZ1F                                                     01116000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 01117000
@NM00007 EQU   ZZ1EVE                                                   01118000
ZZ1EVEP  EQU   ZZ1EVE                                                   01119000
ZZ1EVEW  EQU   ZZ1EVE                                                   01120000
ZZ1ACMP  EQU   ZZ1ATTN                                                  01121000
@NM00006 EQU   ZZ1+144                                                  01122000
ZZ1FPP   EQU   ZZ1+140                                                  01123000
ZZ1ZZ6P  EQU   ZZ1+136                                                  01124000
@NM00005 EQU   ZZ1+84                                                   01125000
ZZ1PLINE EQU   ZZ1+80                                                   01126000
ZZ1PGSZ  EQU   ZZ1+76                                                   01127000
ZZ1PCNT  EQU   ZZ1+72                                                   01128000
@NM00004 EQU   ZZ1+68                                                   01129000
ZZ1TPAGE EQU   ZZ1+64                                                   01130000
ZZ1TLINE EQU   ZZ1+60                                                   01131000
@NM00003 EQU   ZZ1+48                                                   01132000
ZZ1DSDP  EQU   ZZ1+44                                                   01133000
ZZ1PDRP  EQU   ZZ1+40                                                   01134000
ZZ1ZZ2P  EQU   ZZ1+36                                                   01135000
ZZ1327WP EQU   ZZ1+32                                                   01136000
ZZ1ACBP  EQU   ZZ1+28                                                   01137000
@NM00002 EQU   ZZ1+24                                                   01138000
ZZ1PDCBP EQU   ZZ1+20                                                   01139000
ZZ1BLRBL EQU   ZZ1+16                                                   01140000
@NM00001 EQU   ZZ1+12                                                   01141000
ZZ1PNULL EQU   ZZ1+8                                                    01142000
ZZ1NULL  EQU   ZZ1+4                                                    01143000
ZZ1IDE   EQU   ZZ1                                                      01144000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01145000
@ENDDATA EQU   *                                                        01146000
         END   BLSRDUIC,(C'PLS1620',0701,78057)                         01147000
