ASCB     TITLE 'BLSSASCB--FIND ADDRESS SPACE CONTROL BLOCK (ASCB)      *00001000
                        '                                               00002000
*/* CHANGE ACTIVITY -------------------------------------------------*/ 00003000
*/*   THIS MODULE WAS WRITTEN FOR @G57LPRW                           */ 00004000
*/*------------------------------------------------------------------*/ 00005000
BLSSASCB CSECT ,                                                01S0002 00006000
@MAINENT DS    0H                                               01S0002 00007000
         USING *,@15                                            01S0002 00008000
         B     @PROLOG                                          01S0002 00009000
         DC    AL1(16)                                          01S0002 00010000
         DC    C'BLSSASCB  78.059'                              01S0002 00011000
         DROP  @15                                                      00012000
@PROLOG  STM   @14,@12,12(@13)                                  01S0002 00013000
         BALR  @12,0                                            01S0002 00014000
@PSTART  DS    0H                                               01S0002 00015000
         USING @PSTART,@12                                      01S0002 00016000
         L     @00,@SIZDATD                                     01S0002 00017000
         BLSUALLS R,LV=(0)                                              00018000
         LR    @11,@01                                          01S0002 00019000
         USING @DATD,@11                                        01S0002 00020000
         ST    @13,@SA00001+4                                   01S0002 00021000
         LM    @00,@01,20(@13)                                  01S0002 00022000
         ST    @11,8(,@13)                                      01S0002 00023000
         LR    @13,@11                                          01S0002 00024000
         MVC   @PC00001(8),0(@01)                               01S0002 00025000
*   RETC=ZZZFLAGS;                  /* RETURN CODE                   */ 00026000
         LA    RETC,12                                          01S0148 00027000
*   ESBAPTR=ADDR(ESPA);             /* ->ESBA (ALIAS FOR ESPA)       */ 00028000
         L     ESBAPTR,@PC00001+4                               01S0149 00029000
*   IF SYMA^='ASCB'|ESBASYM(LENGTH(SYM)+1:LENGTH(ESBASYM))^=BLANKSUF    00030000
*     THEN                          /* INVALID SYMBOL                */ 00031000
         CLC   SYMA(4,ESBAPTR),@CC01219                         01S0150 00032000
         BNE   @RT00150                                         01S0150 00033000
         CLC   ESBASYM+7(24,ESBAPTR),BLANKSUF                   01S0150 00034000
         BNE   @RT00150                                         01S0150 00035000
*     GO TO EXIT;                   /* COMMON EXIT PATH              */ 00036000
*   DO J1=1 TO LENGTH(SYMB) WHILE(SYMB(J1:J1)>='0'&SYMB(J1:J1)<='9');   00037000
         LA    J1,1                                             01S0152 00038000
@DL00152 LR    @14,ESBAPTR                                      01S0152 00039000
         ALR   @14,J1                                           01S0152 00040000
         CLI   SYMB-1(@14),C'0'                                 01S0152 00041000
         BL    @DC00152                                         01S0152 00042000
         LR    @14,ESBAPTR                                      01S0152 00043000
         ALR   @14,J1                                           01S0152 00044000
         CLI   SYMB-1(@14),C'9'                                 01S0152 00045000
         BH    @DC00152                                         01S0152 00046000
*   END;                                                        01S0153 00047000
         AH    J1,@CH00046                                      01S0153 00048000
         CH    J1,@CH00156                                      01S0153 00049000
         BNH   @DL00152                                         01S0153 00050000
@DC00152 DS    0H                                               01S0154 00051000
*   IF J1<=LENGTH(SYMB) THEN        /* NON-NUMERIC DIGIT             */ 00052000
         CH    J1,@CH00156                                      01S0154 00053000
         BNH   @RT00154                                         01S0154 00054000
*     GO TO EXIT;                   /* COMMON EXIT PATH              */ 00055000
*   ESAUSYM='ASVT';                 /* SYMBOL                        */ 00056000
         MVI   ESAUSYM+4,C' '                                   01S0156 00057000
         MVC   ESAUSYM+5(26),ESAUSYM+4                          01S0156 00058000
         MVC   ESAUSYM(4),@CC01301                              01S0156 00059000
*   ESAUDT=DTASV;                   /* DATA TYPE                     */ 00060000
         MVC   ESAUDT(34),DTASV                                 01S0157 00061000
*   CALL BLSRESGU(ZZ2,ESAU);        /* FIND THE ASVT                 */ 00062000
         ST    R9,@AL00001                                      01S0158 00063000
         LA    @14,ESAU                                         01S0158 00064000
         ST    @14,@AL00001+4                                   01S0158 00065000
         L     @10,ZZ2RVTP(,R9)                                 01S0158 00066000
         L     @15,RVTESGUP(,@10)                               01S0158 00067000
         LA    @01,@AL00001                                     01S0158 00068000
         BALR  @14,@15                                          01S0158 00069000
*   RETC=RF;                        /* RETURN CODE                   */ 00070000
         LR    RETC,RF                                          01S0159 00071000
*   IF RF>ZZZFLAGE THEN             /* ASVT NOT FOUND                */ 00072000
         CH    RF,@CH00054                                      01S0160 00073000
         BH    @RT00160                                         01S0160 00074000
*     GO TO EXIT;                   /* COMMON EXIT PATH              */ 00075000
*   DO;                             /* BLRCNVCU(SYMB)           01S0162 00076000
*                                      FROM(CHARACTER)TO(UNSIGNED       00077000
*                                      BINARY)SET(ASID)REMARK(ADDRESS   00078000
*                                      SPACE IDENTIFIER)             */ 00079000
*                                                               01S0162 00080000
*     /***************************************************************/ 00081000
*     /*                                                             */ 00082000
*     /* ADDRESS SPACE IDENTIFIER                                    */ 00083000
*     /*                                                             */ 00084000
*     /***************************************************************/ 00085000
*                                                               01S0163 00086000
*     PACK(PACKED,SYMB);            /* EBCDIC=>PACKED DECIMAL        */ 00087000
         PACK  PACKED(8),SYMB(3,ESBAPTR)                        01S0163 00088000
*     CVB(ASID,PACKED);             /* PACKED DECIMAL=>UNSIGNED 01S0164 00089000
*                                      BINARY                        */ 00090000
         CVB   ASID,PACKED                                      01S0164 00091000
*   END;                            /* BLRCNVCU(SYMB)           01S0165 00092000
*                                      FROM(CHARACTER)TO(UNSIGNED       00093000
*                                      BINARY)SET(ASID)REMARK(ADDRESS   00094000
*                                      SPACE IDENTIFIER)             */ 00095000
*   J2=ADDR(ASVTFRST)-ADDR(ASVT)+ASID*LENGTH(ASVTENTY);/* OFFSET     */ 00096000
         LR    J2,ASID                                          01S0166 00097000
         SLA   J2,2                                             01S0166 00098000
         AH    J2,@CH01328                                      01S0166 00099000
*   IF J2>=ESAUDOF+ESAUDLE THEN     /* ASID LARGER THAN MAXUSER      */ 00100000
*                                                               01S0167 00101000
         L     @14,ESAUDOF                                      01S0167 00102000
         AL    @14,ESAUDLE                                      01S0167 00103000
         CLR   J2,@14                                           01S0167 00104000
         BL    @RF00167                                         01S0167 00105000
*     /***************************************************************/ 00106000
*     /*                                                             */ 00107000
*     /* ASID LARGER THAN MAXUSER                                    */ 00108000
*     /*                                                             */ 00109000
*     /***************************************************************/ 00110000
*                                                               01S0168 00111000
*     DO;                           /* ASID LARGER THAN MAXUSER      */ 00112000
*       M000B=M000S;                /* MESSAGE M000 LITERAL TEXT     */ 00113000
         MVC   M000B(47),M000S                                  01S0169 00114000
*       DO;                         /* BLRCNVUC(ASID) FROM(UNSIGNED B   00115000
*                                      INARY)TO(CHARACTER)SET(M000BTB   00116000
*                                      )PATTERN('402020202120'X)OPTIO   00117000
*                                      NS(PATTERN IN            01S0170 00118000
*                                      PLACE)REMARK(ADDRESS SPACE       00119000
*                                      IDENTIFIER)                   */ 00120000
*                                                               01S0170 00121000
*         /***********************************************************/ 00122000
*         /*                                                         */ 00123000
*         /* ADDRESS SPACE IDENTIFIER                                */ 00124000
*         /*                                                         */ 00125000
*         /***********************************************************/ 00126000
*                                                               01S0171 00127000
*         CVD(ASID,PACKED);         /* UNSIGNED BINARY=>PACKED  01S0171 00128000
*                                      DECIMAL                       */ 00129000
         CVD   ASID,PACKED                                      01S0171 00130000
*         ED(M000BTB,PACKED(41:64));/* PACKED DECIMAL=>EBCDIC        */ 00131000
         ED    M000BTB(6),PACKED+5                              01S0172 00132000
*       END;                        /* BLRCNVUC(ASID) FROM(UNSIGNED B   00133000
*                                      INARY)TO(CHARACTER)SET(M000BTB   00134000
*                                      )PATTERN('402020202120'X)OPTIO   00135000
*                                      NS(PATTERN IN            01S0173 00136000
*                                      PLACE)REMARK(ADDRESS SPACE       00137000
*                                      IDENTIFIER)                   */ 00138000
*       CALL BLSUMPK1(ZZ2,M000B);   /* COMPRESS MESSAGE M000         */ 00139000
         ST    R9,@AL00001                                      01S0174 00140000
         LA    @14,M000B                                        01S0174 00141000
         ST    @14,@AL00001+4                                   01S0174 00142000
         L     @10,ZZ2BVTP(,R9)                                 01S0174 00143000
         L     @15,BVTMPK1P(,@10)                               01S0174 00144000
         LA    @01,@AL00001                                     01S0174 00145000
         BALR  @14,@15                                          01S0174 00146000
*       CALL BLSUPUTV(ZZ2,M000B);   /* TRANSMIT MESSAGE M000         */ 00147000
         ST    R9,@AL00001                                      01S0175 00148000
         LA    @14,M000B                                        01S0175 00149000
         ST    @14,@AL00001+4                                   01S0175 00150000
         L     @10,ZZ2BVTP(,R9)                                 01S0175 00151000
         L     @15,BVTPUTVP(,@10)                               01S0175 00152000
         LA    @01,@AL00001                                     01S0175 00153000
         BALR  @14,@15                                          01S0175 00154000
*       RETC=MAX(RF,ZZZFLAGS);      /* RETURN CODE                   */ 00155000
         LA    RETC,12                                          01S0176 00156000
         CR    RETC,RF                                          01S0176 00157000
         BNL   *+6                                                      00158000
         LR    RETC,RF                                          01S0176 00159000
*       GO TO EXIT;                 /* COMMON EXIT PATH              */ 00160000
         B     EXIT                                             01S0177 00161000
*     END;                          /* ASID LARGER THAN MAXUSER      */ 00162000
*   ESAUD=DATC;                     /* DESCRIPTION OF ASVT ENTRY     */ 00163000
@RF00167 MVC   ESAUD(60),DATC                                   01S0179 00164000
*   ESAUDOF=J2;                     /* GET ASVT ENTRY FOR THE ASID   */ 00165000
         ST    J2,ESAUDOF                                       01S0180 00166000
*   CALL BLSRACC(ZZ2,ESAU,ESBALAD); /* RETRIEVE ->ASCB               */ 00167000
         ST    R9,@AL00001                                      01S0181 00168000
         LA    @14,ESAU                                         01S0181 00169000
         ST    @14,@AL00001+4                                   01S0181 00170000
         LA    @14,ESBALAD(,ESBAPTR)                            01S0181 00171000
         ST    @14,@AL00001+8                                   01S0181 00172000
         L     @10,ZZ2RVTP(,R9)                                 01S0181 00173000
         L     @15,RVTRACCP(,@10)                               01S0181 00174000
         LA    @01,@AL00001                                     01S0181 00175000
         BALR  @14,@15                                          01S0181 00176000
*   IF RF^=ZZZFLAGI THEN            /* ->ASCB NOT AVAILABLE          */ 00177000
*                                                               01S0182 00178000
         LTR   RF,RF                                            01S0182 00179000
         BZ    @RF00182                                         01S0182 00180000
*     /***************************************************************/ 00181000
*     /*                                                             */ 00182000
*     /* ->ASCB NOT AVAILABLE                                        */ 00183000
*     /*                                                             */ 00184000
*     /***************************************************************/ 00185000
*                                                               01S0183 00186000
*     DO;                           /* ->ASCB NOT AVAILABLE          */ 00187000
*       RETC=MAX(RF,ZZZFLAGS);      /* RETURN CODE                   */ 00188000
         LA    RETC,12                                          01S0184 00189000
         CR    RETC,RF                                          01S0184 00190000
         BNL   *+6                                                      00191000
         LR    RETC,RF                                          01S0184 00192000
*       GO TO EXIT;                 /* COMMON EXIT PATH              */ 00193000
         B     EXIT                                             01S0185 00194000
*     END;                          /* ->ASCB NOT AVAILABLE          */ 00195000
*   IF ASIDFLAG='1'B THEN           /* ASID NOT ACTIVE               */ 00196000
*                                                               01S0187 00197000
@RF00182 L     @14,@PC00001+4                                   01S0187 00198000
         TM    ASIDFLAG(@14),B'10000000'                        01S0187 00199000
         BNO   @RF00187                                         01S0187 00200000
*     /***************************************************************/ 00201000
*     /*                                                             */ 00202000
*     /* ASID NOT ACTIVE                                             */ 00203000
*     /*                                                             */ 00204000
*     /***************************************************************/ 00205000
*                                                               01S0188 00206000
*     DO;                           /* ASID NOT ACTIVE               */ 00207000
*       M001B=M001S;                /* MESSAGE M001 LITERAL TEXT     */ 00208000
         MVC   M001B(37),M001S                                  01S0189 00209000
*       DO;                         /* BLRCNVUC(ASID) FROM(UNSIGNED B   00210000
*                                      INARY)TO(CHARACTER)SET(M001BTB   00211000
*                                      )PATTERN('402020202120'X)OPTIO   00212000
*                                      NS(PATTERN IN            01S0190 00213000
*                                      PLACE)REMARK(ADDRESS SPACE       00214000
*                                      IDENTIFIER)                   */ 00215000
*                                                               01S0190 00216000
*         /***********************************************************/ 00217000
*         /*                                                         */ 00218000
*         /* ADDRESS SPACE IDENTIFIER                                */ 00219000
*         /*                                                         */ 00220000
*         /***********************************************************/ 00221000
*                                                               01S0191 00222000
*         CVD(ASID,PACKED);         /* UNSIGNED BINARY=>PACKED  01S0191 00223000
*                                      DECIMAL                       */ 00224000
         CVD   ASID,PACKED                                      01S0191 00225000
*         ED(M001BTB,PACKED(41:64));/* PACKED DECIMAL=>EBCDIC        */ 00226000
         ED    M001BTB(6),PACKED+5                              01S0192 00227000
*       END;                        /* BLRCNVUC(ASID) FROM(UNSIGNED B   00228000
*                                      INARY)TO(CHARACTER)SET(M001BTB   00229000
*                                      )PATTERN('402020202120'X)OPTIO   00230000
*                                      NS(PATTERN IN            01S0193 00231000
*                                      PLACE)REMARK(ADDRESS SPACE       00232000
*                                      IDENTIFIER)                   */ 00233000
*       CALL BLSUMPK1(ZZ2,M001B);   /* COMPRESS MESSAGE M001         */ 00234000
         ST    R9,@AL00001                                      01S0194 00235000
         LA    @14,M001B                                        01S0194 00236000
         ST    @14,@AL00001+4                                   01S0194 00237000
         L     @10,ZZ2BVTP(,R9)                                 01S0194 00238000
         L     @15,BVTMPK1P(,@10)                               01S0194 00239000
         LA    @01,@AL00001                                     01S0194 00240000
         BALR  @14,@15                                          01S0194 00241000
*       CALL BLSUPUTV(ZZ2,M001B);   /* TRANSMIT MESSAGE M001         */ 00242000
         ST    R9,@AL00001                                      01S0195 00243000
         LA    @14,M001B                                        01S0195 00244000
         ST    @14,@AL00001+4                                   01S0195 00245000
         L     @10,ZZ2BVTP(,R9)                                 01S0195 00246000
         L     @15,BVTPUTVP(,@10)                               01S0195 00247000
         LA    @01,@AL00001                                     01S0195 00248000
         BALR  @14,@15                                          01S0195 00249000
*       RETC=MAX(RF,ZZZFLAGS);      /* RETURN CODE                   */ 00250000
         LA    RETC,12                                          01S0196 00251000
         CR    RETC,RF                                          01S0196 00252000
         BNL   *+6                                                      00253000
         LR    RETC,RF                                          01S0196 00254000
*       GO TO EXIT;                 /* COMMON EXIT PATH              */ 00255000
         B     EXIT                                             01S0197 00256000
*     END;                          /* ASID NOT ACTIVE               */ 00257000
*   ESBAAS=DATS;                    /* MASTER ADDRESS SPACE          */ 00258000
@RF00187 MVC   ESBAAS(16,ESBAPTR),DATS                          01S0199 00259000
*   ESBAAS1=ZZ6DQA1;                /* PREFERRED CPU ADDRESS         */ 00260000
         L     @14,ZZ2AZZ6P(,R9)                                01S0200 00261000
         MVC   ESBAAS1(4,ESBAPTR),ZZ6DQA1(@14)                  01S0200 00262000
*   CALL BLSRSAGU(ZZ2,SAAU,ESBA);   /* PROCESS SA RECORD             */ 00263000
         ST    R9,@AL00001                                      01S0201 00264000
         LA    @14,SAAU                                         01S0201 00265000
         ST    @14,@AL00001+4                                   01S0201 00266000
         ST    ESBAPTR,@AL00001+8                               01S0201 00267000
         L     @10,ZZ2RVTP(,R9)                                 01S0201 00268000
         L     @15,RVTSAGUP(,@10)                               01S0201 00269000
         LA    @01,@AL00001                                     01S0201 00270000
         BALR  @14,@15                                          01S0201 00271000
*   RETC=MAX(RETC,RF,SAAUSRC);      /* RETURN CODE                   */ 00272000
         LR    @14,RF                                           01S0202 00273000
         CR    @14,RETC                                         01S0202 00274000
         BNL   *+6                                                      00275000
         LR    @14,RETC                                         01S0202 00276000
         SLR   @10,@10                                          01S0202 00277000
         IC    @10,SAAUSRC                                      01S0202 00278000
         CR    @14,@10                                          01S0202 00279000
         BNL   *+6                                                      00280000
         LR    @14,@10                                          01S0202 00281000
         LR    RETC,@14                                         01S0202 00282000
*   IF RETC<ZZZFLAGS THEN           /* NO SERIOUS ERROR(S) DETECTED  */ 00283000
         CH    RETC,@CH00036                                    01S0203 00284000
         BNL   @RF00203                                         01S0203 00285000
*     RMKB=RMKS;                    /* REMARK                        */ 00286000
         MVC   RMKB(29,ESBAPTR),RMKS                            01S0204 00287000
*EXIT:                              /* COMMON EXIT PATH              */ 00288000
*   RETURN CODE(RETC);                                          01S0205 00289000
*                                                               01S0205 00290000
@RF00203 DS    0H                                               01S0205 00291000
EXIT     L     @13,4(,@13)                                      01S0205 00292000
         L     @00,@SIZDATD                                     01S0205 00293000
         LR    @01,@11                                          01S0205 00294000
         BLSUFRES R,LV=(0),A=(1)                                        00295000
         LR    @15,@05                                          01S0205 00296000
         L     @14,12(,@13)                                     01S0205 00297000
         LM    @00,@12,20(@13)                                  01S0205 00298000
         BR    @14                                              01S0205 00299000
*/*BLSSPEND--FIND EXIT                                               */ 00300000
*/*BLSRPEND--DEBUGGING MODULE                                        */ 00301000
*/*BLSUPEND--MVS IPCS MODULE                                         */ 00302000
*                                                               01S0206 00303000
*   DECLARE                         /* DATA FOR AHB MACROS           */ 00304000
*     PACKED BIT(64) BOUNDARY(DWORD);/* DATA CONVERSION WORK AREA    */ 00305000
*   DECLARE                         /* COMMON VARIABLES              */ 00306000
*     I256C CHAR(256) BASED,                                    01S0207 00307000
*     I031F FIXED(31) BASED,                                    01S0207 00308000
*     I031P PTR(31) BASED,                                      01S0207 00309000
*     I015F FIXED(15) BASED,                                    01S0207 00310000
*     I015P PTR(15) BASED,                                      01S0207 00311000
*     I008P PTR(8) BASED,                                       01S0207 00312000
*     I001C CHAR(1) BASED;                                      01S0207 00313000
*   GENERATE NODEFS NOREFS DATA;                                01S0208 00314000
*   END BLSSASCB                    /* BLRPEND(BLSSASCB)             */ 00315000
*                                                               01S0209 00316000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00317000
*/*%INCLUDE SYSLIB  (BLSRZZZ )                                       */ 00318000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00319000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00320000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00321000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00322000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00323000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00324000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00325000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00326000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00327000
*/*%INCLUDE SYSLIB  (BLSRSERV)                                       */ 00328000
*/*%INCLUDE SYSLIB  (IHAASVT )                                       */ 00329000
*                                                               01S0209 00330000
*       ;                                                       01S0209 00331000
@EL00001 L     @13,4(,@13)                                      01S0209 00332000
@EF00001 L     @00,@SIZDATD                                     01S0209 00333000
         LR    @01,@11                                          01S0209 00334000
         BLSUFRES R,LV=(0),A=(1)                                        00335000
@ER00001 LM    @14,@12,12(@13)                                  01S0209 00336000
         BR    @14                                              01S0209 00337000
@DATA    DS    0H                                                       00338000
@CH00046 DC    H'1'                                                     00339000
@CH00156 DC    H'3'                                                     00340000
@CH00054 DC    H'8'                                                     00341000
@CH00036 DC    H'12'                                                    00342000
@CH01328 DC    H'524'                                                   00343000
@DATD    DSECT                                                          00344000
         DS    0F                                                       00345000
@SA00001 DS    18F                                                      00346000
@PC00001 DS    2F                                                       00347000
@AL00001 DS    3A                                                       00348000
BLSSASCB CSECT                                                          00349000
         DS    0F                                                       00350000
@DATD    DSECT                                                          00351000
         DS    0D                                                       00352000
VSAMBUFR DS    CL3072                                                   00353000
MA       DS    CL254                                                    00354000
         ORG   MA                                                       00355000
MAL      DS    FL2                                                      00356000
@NM00124 DS    BL2                                                      00357000
MAT      DS    CL250                                                    00358000
         ORG   MAT                                                      00359000
MATA     DS    CL250                                                    00360000
         ORG   MA+254                                                   00361000
         DS    CL2                                                      00362000
PACKED   DS    BL8                                                      00363000
BLSSASCB CSECT                                                          00364000
         DS    0F                                                       00365000
@SIZDATD DC    AL1(0)                                                   00366000
         DC    AL3(@ENDDATD-@DATD)                                      00367000
         DS    0D                                                       00368000
@CC01219 DC    C'ASCB'                                                  00369000
@CC01301 DC    C'ASVT'                                                  00370000
RMKS     DS    CL29                                                     00371000
         ORG   RMKS                                                     00372000
RMKSL    DC    AL2(27)                                                  00373000
RMKST    DS    CL27                                                     00374000
         ORG   RMKST                                                    00375000
RMKSTA   DC    CL27'ADDRESS SPACE CONTROL BLOCK'                        00376000
         ORG   RMKS+29                                                  00377000
         DS    CL1                                                      00378000
M000S    DS    CL47                                                     00379000
         ORG   M000S                                                    00380000
M000SL   DC    AL2(47)                                                  00381000
@NM00125 DC    X'0000'                                                  00382000
M000ST   DS    CL43                                                     00383000
         ORG   M000ST                                                   00384000
M000STA  DC    CL15'BLS19000I ASID('                                    00385000
M000STB  DC    X'402020202120'                                          00386000
M000STC  DC    CL22') GREATER THAN MAXUSER'                             00387000
         ORG   M000S+47                                                 00388000
         DS    CL1                                                      00389000
M001S    DS    CL37                                                     00390000
         ORG   M001S                                                    00391000
M001SL   DC    AL2(37)                                                  00392000
@NM00127 DC    X'0000'                                                  00393000
M001ST   DS    CL33                                                     00394000
         ORG   M001ST                                                   00395000
M001STA  DC    CL15'BLS19001I ASID('                                    00396000
M001STB  DC    X'402020202120'                                          00397000
M001STC  DC    CL12') NOT ACTIVE'                                       00398000
         ORG   M001S+37                                                 00399000
         DS    CL1                                                      00400000
DATC     DS    CL60                                                     00401000
         ORG   DATC                                                     00402000
DATC00   DS    0C                                                       00403000
DATCOF   DC    F'0'                                                     00404000
DATCLE   DC    AL4(4)                                                   00405000
DATCOB   DC    AL1(0)                                                   00406000
DATCLB   DC    AL1(0)                                                   00407000
DATCT    DS    CL34                                                     00408000
         ORG   DATCT                                                    00409000
DATCT0   DS    0C                                                       00410000
DATCTY   DC    CL1'U'                                                   00411000
@NM00129 DC    X'00'                                                    00412000
DATCTD   DC    CL31'                               '                    00413000
DATCTE   DC    CL1' '                                                   00414000
DATCT9   DS    0C                                                       00415000
         ORG   DATC+44                                                  00416000
DATCIM   DC    A(0)                                                     00417000
DATCIL   DC    F'0'                                                     00418000
DATCF    DC    X'00000000'                                              00419000
         ORG   DATCF                                                    00420000
DATCFA   DS    BL1                                                      00421000
@NM00130 EQU   DATCF+0                                                  00422000
         ORG   DATC+56                                                  00423000
@NM00131 DC    X'00'                                                    00424000
         DC    XL3'0'                                                   00425000
DATC99   DS    0C                                                       00426000
         ORG   DATC+60                                                  00427000
DATS     DS    CL16                                                     00428000
         ORG   DATS                                                     00429000
DATS0    DS    0C                                                       00430000
DATST    DC    CL2'CV'                                                  00431000
@NM00132 DC    X'0000'                                                  00432000
DATS1    DC    A(0)                                                     00433000
DATS2    DC    A(1)                                                     00434000
@NM00133 DC    X'00'                                                    00435000
         DC    XL3'0'                                                   00436000
DATS9    DS    0C                                                       00437000
         ORG   DATS+16                                                  00438000
DTASV    DS    CL34                                                     00439000
         ORG   DTASV                                                    00440000
DTASV0   DS    0C                                                       00441000
DTASVY   DC    CL1'M'                                                   00442000
@NM00134 DC    X'00'                                                    00443000
DTASVD   DC    CL31'ASVT'                                               00444000
DTASVE   DC    CL1' '                                                   00445000
DTASV9   DS    0C                                                       00446000
         ORG   DTASV+34                                                 00447000
BLANKSUF DC    CL24' '                                                  00448000
@DATD    DSECT                                                          00449000
         SPACE 2                                                        00450000
*********************************************************************** 00451000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00452000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 00453000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 00454000
*********************************************************************** 00455000
         SPACE                                                          00456000
BLSSASCB CSECT                                                          00457000
         ORG                                                            00458000
         DS    0D                                                       00459000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSSASCB+19)/20+7)/8)CL8'BLSSASCB'     00460000
@DATD    DSECT                                                          00461000
         DS    0H                                                       00462000
@DATD    DSECT                                                          00463000
         SPACE 2                                                        00464000
*********************************************************************** 00465000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 00466000
*********************************************************************** 00467000
         SPACE                                                          00468000
         DS    0D                                                       00469000
@DATD    DSECT                                                          00470000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00471000
@ENDDATD EQU   *                                                        00472000
BLSSASCB CSECT                                                          00473000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00474000
@01      EQU   01                                                       00475000
@02      EQU   02                                                       00476000
@03      EQU   03                                                       00477000
@04      EQU   04                                                       00478000
@05      EQU   05                                                       00479000
@06      EQU   06                                                       00480000
@07      EQU   07                                                       00481000
@08      EQU   08                                                       00482000
@09      EQU   09                                                       00483000
@10      EQU   10                                                       00484000
@11      EQU   11                                                       00485000
@12      EQU   12                                                       00486000
@13      EQU   13                                                       00487000
@14      EQU   14                                                       00488000
@15      EQU   15                                                       00489000
J2       EQU   @06                                                      00490000
J1       EQU   @04                                                      00491000
ASID     EQU   @04                                                      00492000
RETC     EQU   @05                                                      00493000
ESBAPTR  EQU   @03                                                      00494000
R9       EQU   @09                                                      00495000
R0       EQU   @00                                                      00496000
R1       EQU   @01                                                      00497000
R2       EQU   @02                                                      00498000
R3       EQU   @03                                                      00499000
R4       EQU   @04                                                      00500000
R5       EQU   @05                                                      00501000
RB       EQU   @11                                                      00502000
RD       EQU   @13                                                      00503000
RE       EQU   @14                                                      00504000
RF       EQU   @15                                                      00505000
RA       EQU   @10                                                      00506000
RC       EQU   @12                                                      00507000
R6       EQU   @06                                                      00508000
R7       EQU   @07                                                      00509000
R8       EQU   @08                                                      00510000
ESBA     EQU   0                                                        00511000
ESBASYM  EQU   ESBA+28                                                  00512000
ESBAAS   EQU   ESBA+60                                                  00513000
ESBAAS1  EQU   ESBAAS+4                                                 00514000
ESBALAD  EQU   ESBA+76                                                  00515000
ESBAD    EQU   ESBA+80                                                  00516000
ESBADT   EQU   ESBAD+10                                                 00517000
ESBADF   EQU   ESBAD+52                                                 00518000
ESBAF    EQU   ESBA+161                                                 00519000
ESBAFS   EQU   ESBAF                                                    00520000
ESBAFC   EQU   ESBAF+1                                                  00521000
ESBAR    EQU   ESBA+180                                                 00522000
ESBART   EQU   ESBAR+2                                                  00523000
ZZ1      EQU   0                                                        00524000
ZZ1ATTN  EQU   ZZ1+360                                                  00525000
ZZ1EVE   EQU   ZZ1ATTN+4                                                00526000
ZZ1F     EQU   ZZ1+368                                                  00527000
ZZ1N     EQU   ZZ1+1116                                                 00528000
ZZ2      EQU   0                                                        00529000
ZZ2AMD   EQU   ZZ2                                                      00530000
@NM00059 EQU   ZZ2AMD+7                                                 00531000
ZZ2PRT   EQU   ZZ2+138                                                  00532000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 00533000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                00534000
ZZ2A     EQU   ZZ2+272                                                  00535000
ZZ2AF    EQU   ZZ2A+16                                                  00536000
ZZ2APID  EQU   ZZ2A+64                                                  00537000
ZZ2AD    EQU   ZZ2A+74                                                  00538000
ZZ2ADD   EQU   ZZ2AD                                                    00539000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 00540000
ZZ2ADM   EQU   ZZ2AD+46                                                 00541000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 00542000
ZZ2ADP   EQU   ZZ2AD+56                                                 00543000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 00544000
ZZ2AZZ6P EQU   ZZ2A+140                                                 00545000
ZZ2AQAS  EQU   ZZ2A+144                                                 00546000
ZZ2AQD   EQU   ZZ2A+160                                                 00547000
ZZ2AQDT  EQU   ZZ2AQD+10                                                00548000
ZZ2AQDF  EQU   ZZ2AQD+52                                                00549000
ZZ2STG   EQU   ZZ2+960                                                  00550000
ZZ2ALLOP EQU   ZZ2+992                                                  00551000
ZZ2FREEP EQU   ZZ2+996                                                  00552000
ZZ2FF19P EQU   ZZ2+1000                                                 00553000
ZZ2FRE1P EQU   ZZ2+1004                                                 00554000
ZZ2FF18P EQU   ZZ2+1008                                                 00555000
ZZ2DYNAP EQU   ZZ2+1012                                                 00556000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 00557000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 00558000
ZZ2STAIP EQU   ZZ2+1024                                                 00559000
ZZ2FF02P EQU   ZZ2+1028                                                 00560000
ZZ2GETLP EQU   ZZ2+1032                                                 00561000
ZZ2PARSP EQU   ZZ2+1036                                                 00562000
ZZ2PTGTP EQU   ZZ2+1040                                                 00563000
ZZ2PUTLP EQU   ZZ2+1044                                                 00564000
ZZ2SCANP EQU   ZZ2+1048                                                 00565000
ZZ2STCKP EQU   ZZ2+1052                                                 00566000
ZZ2TRMOP EQU   ZZ2+1064                                                 00567000
ZZ2TRMVP EQU   ZZ2+1068                                                 00568000
ZZ2PUTNP EQU   ZZ2+1084                                                 00569000
ZZ2TRMNP EQU   ZZ2+1088                                                 00570000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 00571000
ZZ2BVTP  EQU   ZZ2+1280                                                 00572000
ZZ2RVTP  EQU   ZZ2+1284                                                 00573000
ZZ2CPPL  EQU   ZZ2+1292                                                 00574000
ZZ2CPPLC EQU   ZZ2CPPL                                                  00575000
ZZ2ITR   EQU   ZZ2+2840                                                 00576000
ZZ2ITRE  EQU   ZZ2ITR+16                                                00577000
ZZ2ITSE  EQU   ZZ2+2864                                                 00578000
ZZ2ES    EQU   ZZ2+2872                                                 00579000
ZZ2AMDX  EQU   ZZ2+7160                                                 00580000
ZZ2AXO   EQU   ZZ2+7934                                                 00581000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 00582000
CMD      EQU   0                                                        00583000
CMDT     EQU   CMD+4                                                    00584000
PSCB     EQU   0                                                        00585000
PSCBATR1 EQU   PSCB+16                                                  00586000
ECT      EQU   0                                                        00587000
ECTSWS   EQU   ECT+28                                                   00588000
ECTSWS2  EQU   ECT+40                                                   00589000
ECTSWS21 EQU   ECTSWS2                                                  00590000
UPT      EQU   0                                                        00591000
UPTSWS   EQU   UPT+12                                                   00592000
SA       EQU   0                                                        00593000
SA1      EQU   SA                                                       00594000
SAR      EQU   SA+12                                                    00595000
SAR1     EQU   SAR+12                                                   00596000
BLSUMPK1 EQU   0                                                        00597000
BLSUPUTV EQU   0                                                        00598000
BVT      EQU   0                                                        00599000
BVTPUTLP EQU   BVT+4                                                    00600000
BVTPUTOP EQU   BVT+12                                                   00601000
BVTPUTTP EQU   BVT+16                                                   00602000
BVTPUTVP EQU   BVT+20                                                   00603000
BVTPUTAP EQU   BVT+24                                                   00604000
BVTPRTTP EQU   BVT+28                                                   00605000
BVTPRTAP EQU   BVT+32                                                   00606000
BVTPUTDP EQU   BVT+36                                                   00607000
BVTMONP  EQU   BVT+40                                                   00608000
BVTMON2P EQU   BVT+44                                                   00609000
BVTVSARP EQU   BVT+48                                                   00610000
BVTVSENP EQU   BVT+64                                                   00611000
BVTVSERP EQU   BVT+68                                                   00612000
BVTVSGEP EQU   BVT+72                                                   00613000
BVTVSGUP EQU   BVT+76                                                   00614000
BVTVSPOP EQU   BVT+80                                                   00615000
BVTVSPUP EQU   BVT+84                                                   00616000
BVTMPKNP EQU   BVT+104                                                  00617000
BVTMONLP EQU   BVT+108                                                  00618000
BVTPUTCP EQU   BVT+132                                                  00619000
BVTMPK1P EQU   BVT+136                                                  00620000
BVTZZ2RP EQU   BVT+140                                                  00621000
BVTPGMRP EQU   BVT+144                                                  00622000
BVTMONAP EQU   BVT+148                                                  00623000
BVTBLDDP EQU   BVT+152                                                  00624000
BVTBLDLP EQU   BVT+156                                                  00625000
BVTPGMCP EQU   BVT+160                                                  00626000
BVTPGMDP EQU   BVT+164                                                  00627000
BVTPGMLP EQU   BVT+168                                                  00628000
BVTMONCP EQU   BVT+180                                                  00629000
BVTMONDP EQU   BVT+184                                                  00630000
BVTMONTP EQU   BVT+188                                                  00631000
BVTPARIP EQU   BVT+192                                                  00632000
BVTPARUP EQU   BVT+196                                                  00633000
BVTPRTNP EQU   BVT+204                                                  00634000
BVTVSCRP EQU   BVT+208                                                  00635000
BVTVSMRP EQU   BVT+212                                                  00636000
BVTMONXP EQU   BVT+216                                                  00637000
BVTTRMAP EQU   BVT+228                                                  00638000
ZZ6      EQU   0                                                        00639000
ZZ6D     EQU   ZZ6+128                                                  00640000
ZZ6DD    EQU   ZZ6D+8                                                   00641000
ZZ6DDT   EQU   ZZ6DD+4                                                  00642000
ZZ6DQA   EQU   ZZ6D+68                                                  00643000
ZZ6DQA1  EQU   ZZ6DQA+4                                                 00644000
ZZ6DF    EQU   ZZ6D+92                                                  00645000
ZZ6B     EQU   ZZ6+768                                                  00646000
BLSRACC  EQU   0                                                        00647000
BLSRESGU EQU   0                                                        00648000
BLSRSAGU EQU   0                                                        00649000
RVT      EQU   0                                                        00650000
RVTADDRP EQU   RVT                                                      00651000
RVTT01P  EQU   RVT+4                                                    00652000
RVTTAP   EQU   RVT+8                                                    00653000
RVTTBP   EQU   RVT+12                                                   00654000
RVTTCP   EQU   RVT+16                                                   00655000
RVTTFP   EQU   RVT+24                                                   00656000
RVTTYP   EQU   RVT+40                                                   00657000
RVTT02P  EQU   RVT+48                                                   00658000
RVTT03P  EQU   RVT+52                                                   00659000
RVTT04P  EQU   RVT+56                                                   00660000
RVTACCLP EQU   RVT+60                                                   00661000
RVTRACCP EQU   RVT+64                                                   00662000
RVTTLP   EQU   RVT+68                                                   00663000
RVTTMP   EQU   RVT+72                                                   00664000
RVTTUP   EQU   RVT+80                                                   00665000
RVTESGEP EQU   RVT+84                                                   00666000
RVTESGUP EQU   RVT+88                                                   00667000
RVTESARP EQU   RVT+92                                                   00668000
RVTRAARP EQU   RVT+96                                                   00669000
RVTRAGEP EQU   RVT+100                                                  00670000
RVTADDPP EQU   RVT+104                                                  00671000
RVTACCQP EQU   RVT+108                                                  00672000
RVTSAGUP EQU   RVT+124                                                  00673000
RVTSAGEP EQU   RVT+128                                                  00674000
RVTESCKP EQU   RVT+132                                                  00675000
RVTMSGAP EQU   RVT+136                                                  00676000
RVTMSGDP EQU   RVT+140                                                  00677000
RVTADDTP EQU   RVT+160                                                  00678000
RVTADDUP EQU   RVT+164                                                  00679000
RVTADD1P EQU   RVT+176                                                  00680000
RVTADD2P EQU   RVT+180                                                  00681000
RVTRSAGP EQU   RVT+184                                                  00682000
RVTMSGBP EQU   RVT+188                                                  00683000
RVTADDSP EQU   RVT+192                                                  00684000
RVTADD3P EQU   RVT+196                                                  00685000
RVTT05P  EQU   RVT+200                                                  00686000
RVTPADSP EQU   RVT+204                                                  00687000
RVTTRP   EQU   RVT+228                                                  00688000
RVTADD4P EQU   RVT+232                                                  00689000
RVTSAPCP EQU   RVT+236                                                  00690000
RVTSAARP EQU   RVT+240                                                  00691000
RVTSAGNP EQU   RVT+244                                                  00692000
RVTT06P  EQU   RVT+248                                                  00693000
RVTSAGCP EQU   RVT+252                                                  00694000
RVTSAGQP EQU   RVT+256                                                  00695000
RVTESGCP EQU   RVT+260                                                  00696000
RVTESGQP EQU   RVT+264                                                  00697000
RVTDUCKP EQU   RVT+276                                                  00698000
RVTDUCCP EQU   RVT+280                                                  00699000
ASVT     EQU   0                                                        00700000
ASVTFRST EQU   ASVT+524                                                 00701000
ASVTENTY EQU   ASVT+528                                                 00702000
BLSRACCL EQU   0                                                        00703000
BLSRACCQ EQU   0                                                        00704000
BLSRADDP EQU   0                                                        00705000
BLSRADDR EQU   0                                                        00706000
BLSRADDS EQU   0                                                        00707000
BLSRADDT EQU   0                                                        00708000
BLSRADDU EQU   0                                                        00709000
BLSRADD1 EQU   0                                                        00710000
BLSRADD2 EQU   0                                                        00711000
BLSRADD3 EQU   0                                                        00712000
BLSRADD4 EQU   0                                                        00713000
BLSRDUCC EQU   0                                                        00714000
BLSRDUCK EQU   0                                                        00715000
BLSRESAR EQU   0                                                        00716000
BLSRESCK EQU   0                                                        00717000
BLSRESGC EQU   0                                                        00718000
BLSRESGE EQU   0                                                        00719000
BLSRESGQ EQU   0                                                        00720000
BLSRMSGA EQU   0                                                        00721000
BLSRMSGB EQU   0                                                        00722000
BLSRMSGD EQU   0                                                        00723000
BLSRPADS EQU   0                                                        00724000
BLSRRAAR EQU   0                                                        00725000
BLSRRAGE EQU   0                                                        00726000
BLSRSAAR EQU   0                                                        00727000
BLSRSAG  EQU   0                                                        00728000
BLSRSAGC EQU   0                                                        00729000
BLSRSAGE EQU   0                                                        00730000
BLSRSAGN EQU   0                                                        00731000
BLSRSAGQ EQU   0                                                        00732000
BLSRSAPC EQU   0                                                        00733000
BLSTA    EQU   0                                                        00734000
BLSTB    EQU   0                                                        00735000
BLSTC    EQU   0                                                        00736000
BLSTF    EQU   0                                                        00737000
BLSTL    EQU   0                                                        00738000
BLSTM    EQU   0                                                        00739000
BLSTR    EQU   0                                                        00740000
BLSTU    EQU   0                                                        00741000
BLSTY    EQU   0                                                        00742000
BLST01   EQU   0                                                        00743000
BLST02   EQU   0                                                        00744000
BLST03   EQU   0                                                        00745000
BLST04   EQU   0                                                        00746000
BLST05   EQU   0                                                        00747000
BLST06   EQU   0                                                        00748000
BLSUALLO EQU   0                                                        00749000
BLSUBLDD EQU   0                                                        00750000
BLSUBLDL EQU   0                                                        00751000
BLSUDYNA EQU   0                                                        00752000
BLSUFREE EQU   0                                                        00753000
BLSUFRE1 EQU   0                                                        00754000
BLSUMON  EQU   0                                                        00755000
BLSUMONA EQU   0                                                        00756000
BLSUMONC EQU   0                                                        00757000
BLSUMOND EQU   0                                                        00758000
BLSUMONL EQU   0                                                        00759000
BLSUMONT EQU   0                                                        00760000
BLSUMONX EQU   0                                                        00761000
BLSUMON2 EQU   0                                                        00762000
BLSUMPKN EQU   0                                                        00763000
BLSUPARI EQU   0                                                        00764000
BLSUPARU EQU   0                                                        00765000
BLSUPGMC EQU   0                                                        00766000
BLSUPGMD EQU   0                                                        00767000
BLSUPGML EQU   0                                                        00768000
BLSUPGMR EQU   0                                                        00769000
BLSUPRTA EQU   0                                                        00770000
BLSUPRTN EQU   0                                                        00771000
BLSUPRTT EQU   0                                                        00772000
BLSUPUTA EQU   0                                                        00773000
BLSUPUTC EQU   0                                                        00774000
BLSUPUTD EQU   0                                                        00775000
BLSUPUTL EQU   0                                                        00776000
BLSUPUTN EQU   0                                                        00777000
BLSUPUTO EQU   0                                                        00778000
BLSUPUTT EQU   0                                                        00779000
BLSUSTAI EQU   0                                                        00780000
BLSUTRMA EQU   0                                                        00781000
BLSUTRMN EQU   0                                                        00782000
BLSUTRMO EQU   0                                                        00783000
BLSUTRMV EQU   0                                                        00784000
BLSUVSAR EQU   0                                                        00785000
BLSUVSCR EQU   0                                                        00786000
BLSUVSEN EQU   0                                                        00787000
BLSUVSER EQU   0                                                        00788000
BLSUVSGE EQU   0                                                        00789000
BLSUVSGU EQU   0                                                        00790000
BLSUVSMR EQU   0                                                        00791000
BLSUVSPO EQU   0                                                        00792000
BLSUVSPU EQU   0                                                        00793000
BLSUZZ2C EQU   0                                                        00794000
BLSUZZ2D EQU   0                                                        00795000
BLSUZZ2R EQU   0                                                        00796000
IKJEFF02 EQU   0                                                        00797000
IKJEFF18 EQU   0                                                        00798000
IKJEFF19 EQU   0                                                        00799000
IKJGETL  EQU   0                                                        00800000
IKJPARS  EQU   0                                                        00801000
IKJPTGT  EQU   0                                                        00802000
IKJPUTL  EQU   0                                                        00803000
IKJSCAN  EQU   0                                                        00804000
IKJSTCK  EQU   0                                                        00805000
I001C    EQU   0                                                        00806000
I008P    EQU   0                                                        00807000
I015F    EQU   0                                                        00808000
I015P    EQU   0                                                        00809000
I031F    EQU   0                                                        00810000
I031P    EQU   0                                                        00811000
I256C    EQU   0                                                        00812000
PZ2      EQU   0                                                        00813000
ESPA     EQU   0                                                        00814000
ESPAAS   EQU   ESPA+60                                                  00815000
ESPALAD  EQU   ESPA+76                                                  00816000
ESPAD    EQU   ESPA+80                                                  00817000
ESPADT   EQU   ESPAD+10                                                 00818000
ESPADF   EQU   ESPAD+52                                                 00819000
ESPAF    EQU   ESPA+161                                                 00820000
ESPAFS   EQU   ESPAF                                                    00821000
ESPAFC   EQU   ESPAF+1                                                  00822000
ESPAR    EQU   ESPA+180                                                 00823000
ESPART   EQU   ESPAR+2                                                  00824000
ESAU     EQU   VSAMBUFR                                                 00825000
ESAUSYM  EQU   ESAU+28                                                  00826000
ESAUAS   EQU   ESAU+60                                                  00827000
ESAUD    EQU   ESAU+80                                                  00828000
ESAUDOF  EQU   ESAUD                                                    00829000
ESAUDLE  EQU   ESAUD+4                                                  00830000
ESAUDT   EQU   ESAUD+10                                                 00831000
ESAUDF   EQU   ESAUD+52                                                 00832000
ESAUF    EQU   ESAU+161                                                 00833000
ESAUFS   EQU   ESAUF                                                    00834000
ESAUFC   EQU   ESAUF+1                                                  00835000
ESAUR    EQU   ESAU+180                                                 00836000
ESAURT   EQU   ESAUR+2                                                  00837000
SAAU     EQU   VSAMBUFR                                                 00838000
SAAUAS   EQU   SAAU+12                                                  00839000
SAAUDT   EQU   SAAU+32                                                  00840000
SAAUF    EQU   SAAU+68                                                  00841000
SAAUFT   EQU   SAAUF+10                                                 00842000
SAAUFF   EQU   SAAUF+52                                                 00843000
SAAUSF   EQU   SAAU+128                                                 00844000
SAAUSRC  EQU   SAAU+152                                                 00845000
SAAUC    EQU   SAAU+254                                                 00846000
SAAUCT   EQU   SAAUC+2                                                  00847000
CPPL     EQU   ZZ2CPPL                                                  00848000
CPPLUPT  EQU   CPPL+4                                                   00849000
CPPLPSCB EQU   CPPL+8                                                   00850000
CPPLECT  EQU   CPPL+12                                                  00851000
RMKB     EQU   ESBAR                                                    00852000
RMKBT    EQU   RMKB+2                                                   00853000
SYM      EQU   ESBASYM                                                  00854000
SYMA     EQU   SYM                                                      00855000
SYMB     EQU   SYM+4                                                    00856000
M000B    EQU   MA                                                       00857000
M000BT   EQU   M000B+4                                                  00858000
M000BTB  EQU   M000BT+15                                                00859000
M001B    EQU   MA                                                       00860000
M001BT   EQU   M001B+4                                                  00861000
M001BTB  EQU   M001BT+15                                                00862000
ASIDFLAG EQU   ESPALAD                                                  00863000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00864000
M001BTC  EQU   M001BT+21                                                00865000
M001BTA  EQU   M001BT                                                   00866000
@NM00128 EQU   M001B+2                                                  00867000
M001BL   EQU   M001B                                                    00868000
M000BTC  EQU   M000BT+21                                                00869000
M000BTA  EQU   M000BT                                                   00870000
@NM00126 EQU   M000B+2                                                  00871000
M000BL   EQU   M000B                                                    00872000
RMKBTA   EQU   RMKBT                                                    00873000
RMKBL    EQU   RMKB                                                     00874000
CPPLCBUF EQU   CPPL                                                     00875000
SAAU999  EQU   SAAU+3072                                                00876000
SAAUCT1  EQU   SAAUCT                                                   00877000
SAAUCL   EQU   SAAUC                                                    00878000
@NM00046 EQU   SAAU+153                                                 00879000
SAAUPGV  EQU   SAAU+144                                                 00880000
SAAUGMT  EQU   SAAU+136                                                 00881000
@NM00045 EQU   SAAUSF                                                   00882000
SAAUSFS  EQU   SAAUSF                                                   00883000
SAAUSFI  EQU   SAAUSF                                                   00884000
SAAUSF9  EQU   SAAUSF                                                   00885000
SAAUSF1  EQU   SAAUSF                                                   00886000
SAAUF99  EQU   SAAUF+60                                                 00887000
@NM00044 EQU   SAAUF+56                                                 00888000
@NM00043 EQU   SAAUFF                                                   00889000
SAAUFFA  EQU   SAAUFF                                                   00890000
SAAUFIL  EQU   SAAUF+48                                                 00891000
SAAUFIM  EQU   SAAUF+44                                                 00892000
SAAUFT9  EQU   SAAUFT+34                                                00893000
SAAUFTE  EQU   SAAUFT+33                                                00894000
SAAUFTD  EQU   SAAUFT+2                                                 00895000
@NM00042 EQU   SAAUFT+1                                                 00896000
SAAUFTY  EQU   SAAUFT                                                   00897000
SAAUFT0  EQU   SAAUFT                                                   00898000
SAAUFLB  EQU   SAAUF+9                                                  00899000
SAAUFOB  EQU   SAAUF+8                                                  00900000
SAAUFLE  EQU   SAAUF+4                                                  00901000
SAAUFOF  EQU   SAAUF                                                    00902000
SAAUF00  EQU   SAAUF                                                    00903000
@NM00041 EQU   SAAU+66                                                  00904000
SAAUELK  EQU   SAAU+66                                                  00905000
SAAUDT9  EQU   SAAUDT+34                                                00906000
SAAUDTE  EQU   SAAUDT+33                                                00907000
SAAUDTD  EQU   SAAUDT+2                                                 00908000
@NM00040 EQU   SAAUDT+1                                                 00909000
SAAUDTY  EQU   SAAUDT                                                   00910000
SAAUDT0  EQU   SAAUDT                                                   00911000
SAAULAD  EQU   SAAU+28                                                  00912000
SAAUAS9  EQU   SAAUAS+16                                                00913000
@NM00039 EQU   SAAUAS+12                                                00914000
SAAUAS2  EQU   SAAUAS+8                                                 00915000
SAAUAS1  EQU   SAAUAS+4                                                 00916000
@NM00038 EQU   SAAUAS+2                                                 00917000
SAAUAST  EQU   SAAUAS                                                   00918000
SAAUAS0  EQU   SAAUAS                                                   00919000
SAAURDX  EQU   SAAU+8                                                   00920000
@NM00037 EQU   SAAU+2                                                   00921000
SAAURID  EQU   SAAU                                                     00922000
ESAU999  EQU   ESAU+694                                                 00923000
ESAURT1  EQU   ESAURT                                                   00924000
ESAURL   EQU   ESAUR                                                    00925000
@NM00036 EQU   ESAU+168                                                 00926000
ESAUABS  EQU   ESAU+164                                                 00927000
@NM00035 EQU   ESAUF+2                                                  00928000
@NM00034 EQU   ESAUFC                                                   00929000
ESAUFCD  EQU   ESAUFC                                                   00930000
ESAUFSS  EQU   ESAUFS                                                   00931000
ESAUFSX  EQU   ESAUFS                                                   00932000
ESAUFSR  EQU   ESAUFS                                                   00933000
ESAUFSP  EQU   ESAUFS                                                   00934000
ESAUFSA  EQU   ESAUFS                                                   00935000
ESAUFSM  EQU   ESAUFS                                                   00936000
ESAUFS2  EQU   ESAUFS                                                   00937000
ESAUFSC  EQU   ESAUFS                                                   00938000
ESAUKEY  EQU   ESAU+160                                                 00939000
@NM00033 EQU   ESAU+144                                                 00940000
ESAUMAD  EQU   ESAU+140                                                 00941000
ESAUD99  EQU   ESAUD+60                                                 00942000
@NM00032 EQU   ESAUD+56                                                 00943000
@NM00031 EQU   ESAUDF                                                   00944000
ESAUDFA  EQU   ESAUDF                                                   00945000
ESAUDIL  EQU   ESAUD+48                                                 00946000
ESAUDIM  EQU   ESAUD+44                                                 00947000
ESAUDT9  EQU   ESAUDT+34                                                00948000
ESAUDTE  EQU   ESAUDT+33                                                00949000
ESAUDTD  EQU   ESAUDT+2                                                 00950000
@NM00030 EQU   ESAUDT+1                                                 00951000
ESAUDTY  EQU   ESAUDT                                                   00952000
ESAUDT0  EQU   ESAUDT                                                   00953000
ESAUDLB  EQU   ESAUD+9                                                  00954000
ESAUDOB  EQU   ESAUD+8                                                  00955000
ESAUD00  EQU   ESAUD                                                    00956000
ESAULAD  EQU   ESAU+76                                                  00957000
ESAUAS9  EQU   ESAUAS+16                                                00958000
@NM00029 EQU   ESAUAS+12                                                00959000
ESAUAS2  EQU   ESAUAS+8                                                 00960000
ESAUAS1  EQU   ESAUAS+4                                                 00961000
@NM00028 EQU   ESAUAS+2                                                 00962000
ESAUAST  EQU   ESAUAS                                                   00963000
ESAUAS0  EQU   ESAUAS                                                   00964000
ESAURV1  EQU   ESAU+59                                                  00965000
ESAUELK  EQU   ESAU+59                                                  00966000
ESAURDX  EQU   ESAU+24                                                  00967000
@NM00027 EQU   ESAU+16                                                  00968000
@NM00026 EQU   ESAU+8                                                   00969000
@NM00025 EQU   ESAU+2                                                   00970000
ESAURID  EQU   ESAU                                                     00971000
ESPA999  EQU   ESPA+694                                                 00972000
ESPART1  EQU   ESPART                                                   00973000
ESPARL   EQU   ESPAR                                                    00974000
@NM00012 EQU   ESPA+168                                                 00975000
ESPAABS  EQU   ESPA+164                                                 00976000
@NM00011 EQU   ESPAF+2                                                  00977000
@NM00010 EQU   ESPAFC                                                   00978000
ESPAFCD  EQU   ESPAFC                                                   00979000
ESPAFSS  EQU   ESPAFS                                                   00980000
ESPAFSX  EQU   ESPAFS                                                   00981000
ESPAFSR  EQU   ESPAFS                                                   00982000
ESPAFSP  EQU   ESPAFS                                                   00983000
ESPAFSA  EQU   ESPAFS                                                   00984000
ESPAFSM  EQU   ESPAFS                                                   00985000
ESPAFS2  EQU   ESPAFS                                                   00986000
ESPAFSC  EQU   ESPAFS                                                   00987000
ESPAKEY  EQU   ESPA+160                                                 00988000
@NM00009 EQU   ESPA+144                                                 00989000
ESPAMAD  EQU   ESPA+140                                                 00990000
ESPAD99  EQU   ESPAD+60                                                 00991000
@NM00008 EQU   ESPAD+56                                                 00992000
@NM00007 EQU   ESPADF                                                   00993000
ESPADFA  EQU   ESPADF                                                   00994000
ESPADIL  EQU   ESPAD+48                                                 00995000
ESPADIM  EQU   ESPAD+44                                                 00996000
ESPADT9  EQU   ESPADT+34                                                00997000
ESPADTE  EQU   ESPADT+33                                                00998000
ESPADTD  EQU   ESPADT+2                                                 00999000
@NM00006 EQU   ESPADT+1                                                 01000000
ESPADTY  EQU   ESPADT                                                   01001000
ESPADT0  EQU   ESPADT                                                   01002000
ESPADLB  EQU   ESPAD+9                                                  01003000
ESPADOB  EQU   ESPAD+8                                                  01004000
ESPADLE  EQU   ESPAD+4                                                  01005000
ESPADOF  EQU   ESPAD                                                    01006000
ESPAD00  EQU   ESPAD                                                    01007000
ESPAAS9  EQU   ESPAAS+16                                                01008000
@NM00005 EQU   ESPAAS+12                                                01009000
ESPAAS2  EQU   ESPAAS+8                                                 01010000
ESPAAS1  EQU   ESPAAS+4                                                 01011000
@NM00004 EQU   ESPAAS+2                                                 01012000
ESPAAST  EQU   ESPAAS                                                   01013000
ESPAAS0  EQU   ESPAAS                                                   01014000
ESPARV1  EQU   ESPA+59                                                  01015000
ESPAELK  EQU   ESPA+59                                                  01016000
ESPASYM  EQU   ESPA+28                                                  01017000
ESPARDX  EQU   ESPA+24                                                  01018000
@NM00003 EQU   ESPA+16                                                  01019000
@NM00002 EQU   ESPA+8                                                   01020000
@NM00001 EQU   ESPA+2                                                   01021000
ESPARID  EQU   ESPA                                                     01022000
ASVTEND  EQU   ASVT+528                                                 01023000
ASVTAVAL EQU   ASVTENTY                                                 01024000
ASVTAVAI EQU   ASVTFRST                                                 01025000
ASVTRS00 EQU   ASVT+520                                                 01026000
ASVTMAXU EQU   ASVT+516                                                 01027000
ASVTASVT EQU   ASVT+512                                                 01028000
ASVTBEGN EQU   ASVT+512                                                 01029000
@NM00123 EQU   ASVT                                                     01030000
RVT99999 EQU   RVT+384                                                  01031000
RVT0096P EQU   RVT+380                                                  01032000
RVT0095P EQU   RVT+376                                                  01033000
RVT0094P EQU   RVT+372                                                  01034000
RVT0093P EQU   RVT+368                                                  01035000
RVT0092P EQU   RVT+364                                                  01036000
RVT0091P EQU   RVT+360                                                  01037000
RVT0090P EQU   RVT+356                                                  01038000
RVT0089P EQU   RVT+352                                                  01039000
RVT0088P EQU   RVT+348                                                  01040000
RVT0087P EQU   RVT+344                                                  01041000
RVT0086P EQU   RVT+340                                                  01042000
RVT0085P EQU   RVT+336                                                  01043000
RVT0084P EQU   RVT+332                                                  01044000
RVT0083P EQU   RVT+328                                                  01045000
RVT0082P EQU   RVT+324                                                  01046000
RVT0081P EQU   RVT+320                                                  01047000
RVT0080P EQU   RVT+316                                                  01048000
RVT0079P EQU   RVT+312                                                  01049000
RVT0078P EQU   RVT+308                                                  01050000
RVT0077P EQU   RVT+304                                                  01051000
RVT0076P EQU   RVT+300                                                  01052000
RVT0075P EQU   RVT+296                                                  01053000
RVT0074P EQU   RVT+292                                                  01054000
RVT0073P EQU   RVT+288                                                  01055000
RVT0072P EQU   RVT+284                                                  01056000
RVTDTUTP EQU   RVT+272                                                  01057000
RVTDTMTP EQU   RVT+268                                                  01058000
RVT0057P EQU   RVT+224                                                  01059000
RVT0056P EQU   RVT+220                                                  01060000
RVT0055P EQU   RVT+216                                                  01061000
RVT0054P EQU   RVT+212                                                  01062000
RVT0053P EQU   RVT+208                                                  01063000
RVT0044P EQU   RVT+172                                                  01064000
RVT0043P EQU   RVT+168                                                  01065000
RVT0040P EQU   RVT+156                                                  01066000
RVT0039P EQU   RVT+152                                                  01067000
RVT0038P EQU   RVT+148                                                  01068000
RVT0037P EQU   RVT+144                                                  01069000
RVT0031P EQU   RVT+120                                                  01070000
RVT0030P EQU   RVT+116                                                  01071000
RVT0029P EQU   RVT+112                                                  01072000
RVT0020P EQU   RVT+76                                                   01073000
RVT0012P EQU   RVT+44                                                   01074000
RVT0010P EQU   RVT+36                                                   01075000
RVT0009P EQU   RVT+32                                                   01076000
RVT0008P EQU   RVT+28                                                   01077000
RVT0006P EQU   RVT+20                                                   01078000
ZZ69999  EQU   ZZ6+1792                                                 01079000
ZZ6BRB   EQU   ZZ6B+12                                                  01080000
ZZ6BRC   EQU   ZZ6B+8                                                   01081000
@NM00122 EQU   ZZ6B+6                                                   01082000
ZZ6BFL   EQU   ZZ6B+4                                                   01083000
ZZ6BDA   EQU   ZZ6B                                                     01084000
@NM00121 EQU   ZZ6+540                                                  01085000
ZZ6BUFI  EQU   ZZ6+536                                                  01086000
ZZ6BUFP  EQU   ZZ6+532                                                  01087000
ZZ6FILE  EQU   ZZ6+524                                                  01088000
ZZ6BUFB  EQU   ZZ6+520                                                  01089000
ZZ6BUFL  EQU   ZZ6+518                                                  01090000
ZZ6BUFN  EQU   ZZ6+516                                                  01091000
ZZ6ZZ6P  EQU   ZZ6+512                                                  01092000
@NM00120 EQU   ZZ6+256                                                  01093000
ZZ6D999  EQU   ZZ6D+128                                                 01094000
@NM00119 EQU   ZZ6D+116                                                 01095000
ZZ6DCAP  EQU   ZZ6D+112                                                 01096000
ZZ6DPRP  EQU   ZZ6D+108                                                 01097000
ZZ6DDA2  EQU   ZZ6D+104                                                 01098000
ZZ6DDA1  EQU   ZZ6D+100                                                 01099000
@NM00118 EQU   ZZ6DF                                                    01100000
ZZ6DFSU  EQU   ZZ6DF                                                    01101000
ZZ6DFST  EQU   ZZ6DF                                                    01102000
ZZ6DFAB  EQU   ZZ6DF                                                    01103000
ZZ6DFMP  EQU   ZZ6DF                                                    01104000
ZZ6DFDU  EQU   ZZ6DF                                                    01105000
ZZ6DFBS  EQU   ZZ6DF                                                    01106000
ZZ6DQ2   EQU   ZZ6D+88                                                  01107000
ZZ6DQ1   EQU   ZZ6D+84                                                  01108000
ZZ6DQA9  EQU   ZZ6DQA+16                                                01109000
@NM00117 EQU   ZZ6DQA+12                                                01110000
ZZ6DQA2  EQU   ZZ6DQA+8                                                 01111000
@NM00116 EQU   ZZ6DQA+2                                                 01112000
ZZ6DQAT  EQU   ZZ6DQA                                                   01113000
ZZ6DQA0  EQU   ZZ6DQA                                                   01114000
ZZ6DRDX  EQU   ZZ6D+64                                                  01115000
ZZ6DELK  EQU   ZZ6D+64                                                  01116000
ZZ6DMEM  EQU   ZZ6D+56                                                  01117000
ZZ6DDT1  EQU   ZZ6DDT                                                   01118000
ZZ6DDO   EQU   ZZ6DD+2                                                  01119000
ZZ6DDL   EQU   ZZ6DD                                                    01120000
@NM00115 EQU   ZZ6D+2                                                   01121000
ZZ6DRID  EQU   ZZ6D                                                     01122000
ZZ6RDCB  EQU   ZZ6                                                      01123000
ZZ60000  EQU   ZZ6                                                      01124000
BVT99999 EQU   BVT+256                                                  01125000
BVT0064P EQU   BVT+252                                                  01126000
BVT0063P EQU   BVT+248                                                  01127000
BVT0062P EQU   BVT+244                                                  01128000
BVT0061P EQU   BVT+240                                                  01129000
BVT0060P EQU   BVT+236                                                  01130000
BVT0059P EQU   BVT+232                                                  01131000
BVT0057P EQU   BVT+224                                                  01132000
BVT0056P EQU   BVT+220                                                  01133000
BVTSTBLP EQU   BVT+200                                                  01134000
BVT0045P EQU   BVT+176                                                  01135000
BVT0044P EQU   BVT+172                                                  01136000
BVT0033P EQU   BVT+128                                                  01137000
BVT0032P EQU   BVT+124                                                  01138000
BVT0031P EQU   BVT+120                                                  01139000
BVT0030P EQU   BVT+116                                                  01140000
BVT0029P EQU   BVT+112                                                  01141000
BVT0026P EQU   BVT+100                                                  01142000
BVT0025P EQU   BVT+96                                                   01143000
BVT0024P EQU   BVT+92                                                   01144000
BVT0023P EQU   BVT+88                                                   01145000
BVT0016P EQU   BVT+60                                                   01146000
BVT0015P EQU   BVT+56                                                   01147000
BVT0014P EQU   BVT+52                                                   01148000
BVT0003P EQU   BVT+8                                                    01149000
BVT0001P EQU   BVT                                                      01150000
SA99     EQU   SA+72                                                    01151000
SARC     EQU   SAR+56                                                   01152000
SARB     EQU   SAR+52                                                   01153000
SARA     EQU   SAR+48                                                   01154000
SAR9     EQU   SAR+44                                                   01155000
SAR8     EQU   SAR+40                                                   01156000
SAR7     EQU   SAR+36                                                   01157000
SAR6     EQU   SAR+32                                                   01158000
SAR5     EQU   SAR+28                                                   01159000
SAR4     EQU   SAR+24                                                   01160000
SAR3     EQU   SAR+20                                                   01161000
SAR2     EQU   SAR+16                                                   01162000
SAR0     EQU   SAR+8                                                    01163000
SARF     EQU   SAR+4                                                    01164000
SARE     EQU   SAR                                                      01165000
SAFWD    EQU   SA+8                                                     01166000
SABAK    EQU   SA+4                                                     01167000
SA1L     EQU   SA1+1                                                    01168000
SA1P     EQU   SA1                                                      01169000
UPTPREFL EQU   UPT+23                                                   01170000
UPTPREFX EQU   UPT+16                                                   01171000
@NM00114 EQU   UPT+15                                                   01172000
UPTLDEL  EQU   UPT+14                                                   01173000
UPTCDEL  EQU   UPT+13                                                   01174000
UPTWTP   EQU   UPTSWS                                                   01175000
UPTMODE  EQU   UPTSWS                                                   01176000
UPTALD   EQU   UPTSWS                                                   01177000
UPTPAUS  EQU   UPTSWS                                                   01178000
UPTNCOM  EQU   UPTSWS                                                   01179000
UPTMID   EQU   UPTSWS                                                   01180000
UPTNPRM  EQU   UPTSWS                                                   01181000
UPTRCVR  EQU   UPTSWS                                                   01182000
UPTUSER  EQU   UPT+2                                                    01183000
@NM00113 EQU   UPT                                                      01184000
@NM00112 EQU   ECT+52                                                   01185000
@NM00111 EQU   ECT+48                                                   01186000
@NM00110 EQU   ECT+44                                                   01187000
@NM00109 EQU   ECTSWS2+1                                                01188000
@NM00108 EQU   ECTSWS21                                                 01189000
ECTTABND EQU   ECTSWS21                                                 01190000
ECTDEFCS EQU   ECTSWS21                                                 01191000
ECTBKPB  EQU   ECT+36                                                   01192000
ECTUSER  EQU   ECT+32                                                   01193000
ECTDDNUM EQU   ECT+29                                                   01194000
ECTATTN  EQU   ECTSWS                                                   01195000
ECTBKGRD EQU   ECTSWS                                                   01196000
ECTNNOT  EQU   ECTSWS                                                   01197000
ECTNMAL  EQU   ECTSWS                                                   01198000
ECTLOGF  EQU   ECTSWS                                                   01199000
ECTATRM  EQU   ECTSWS                                                   01200000
@NM00107 EQU   ECTSWS                                                   01201000
ECTNOPD  EQU   ECTSWS                                                   01202000
ECTSCMD  EQU   ECT+20                                                   01203000
ECTPCMD  EQU   ECT+12                                                   01204000
ECTSMSG  EQU   ECT+9                                                    01205000
ECTMSGF  EQU   ECT+8                                                    01206000
ECTIOWA  EQU   ECT+4                                                    01207000
ECTRTCD  EQU   ECT+1                                                    01208000
ECTRCDF  EQU   ECT                                                      01209000
PSCBU    EQU   PSCB+64                                                  01210000
PSCBRSZ  EQU   PSCB+60                                                  01211000
PSCBLINE EQU   PSCB+59                                                  01212000
PSCBCHAR EQU   PSCB+58                                                  01213000
PSCBUPTL EQU   PSCB+56                                                  01214000
PSCBUPT  EQU   PSCB+52                                                  01215000
PSCBRLGB EQU   PSCB+48                                                  01216000
PSCBDEST EQU   PSCB+40                                                  01217000
@NM00106 EQU   PSCB+36                                                  01218000
@NM00105 EQU   PSCB+32                                                  01219000
@NM00104 EQU   PSCB+28                                                  01220000
PSCBLTI2 EQU   PSCB+24                                                  01221000
PSCBLTIM EQU   PSCB+20                                                  01222000
PSCBATR2 EQU   PSCB+18                                                  01223000
@NM00103 EQU   PSCBATR1                                                 01224000
@NM00102 EQU   PSCBATR1                                                 01225000
@NM00101 EQU   PSCBATR1                                                 01226000
PSCBATTN EQU   PSCBATR1                                                 01227000
PSCBVMNT EQU   PSCBATR1                                                 01228000
PSCBJCL  EQU   PSCBATR1                                                 01229000
PSCBACCT EQU   PSCBATR1                                                 01230000
PSCBCTRL EQU   PSCBATR1                                                 01231000
PSCBGPNM EQU   PSCB+8                                                   01232000
PSCBUSRL EQU   PSCB+7                                                   01233000
PSCBUSER EQU   PSCB                                                     01234000
CMDT1    EQU   CMDT                                                     01235000
CMDO     EQU   CMD+2                                                    01236000
CMDL     EQU   CMD                                                      01237000
ZZ299999 EQU   ZZ2+8192                                                 01238000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  01239000
ZZ2AXOL  EQU   ZZ2AXO                                                   01240000
@NM00100 EQU   ZZ2+7288                                                 01241000
@NM00099 EQU   ZZ2AMDX+4                                                01242000
ZZ2AMDXC EQU   ZZ2AMDX                                                  01243000
ZZ2HSD   EQU   ZZ2+3056                                                 01244000
@NM00098 EQU   ZZ2ES                                                    01245000
@NM00097 EQU   ZZ2+2868                                                 01246000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                01247000
@NM00096 EQU   ZZ2ITSE                                                  01248000
ZZ2ITSEP EQU   ZZ2ITSE                                                  01249000
ZZ2ITSEW EQU   ZZ2ITSE                                                  01250000
@NM00095 EQU   ZZ2ITR+20                                                01251000
ZZ2ITREC EQU   ZZ2ITRE+1                                                01252000
@NM00094 EQU   ZZ2ITRE                                                  01253000
ZZ2ITREP EQU   ZZ2ITRE                                                  01254000
ZZ2ITREW EQU   ZZ2ITRE                                                  01255000
@NM00093 EQU   ZZ2ITR+9                                                 01256000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 01257000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 01258000
ZZ2ITRPP EQU   ZZ2ITR                                                   01259000
@NM00092 EQU   ZZ2+1544                                                 01260000
ZZ2PGM   EQU   ZZ2+1536                                                 01261000
@NM00091 EQU   ZZ2+1526                                                 01262000
ZZ2CW    EQU   ZZ2+1524                                                 01263000
@NM00090 EQU   ZZ2+1504                                                 01264000
@NM00089 EQU   ZZ2+1352                                                 01265000
ZZ2FFSYP EQU   ZZ2+1348                                                 01266000
ZZ2SASYP EQU   ZZ2+1344                                                 01267000
ZZ2RDSYP EQU   ZZ2+1340                                                 01268000
ZZ2RASYP EQU   ZZ2+1336                                                 01269000
ZZ2PHSYP EQU   ZZ2+1332                                                 01270000
ZZ2ESSYP EQU   ZZ2+1328                                                 01271000
ZZ200SYP EQU   ZZ2+1324                                                 01272000
ZZ2SCWP  EQU   ZZ2+1320                                                 01273000
ZZ2TTLP  EQU   ZZ2+1316                                                 01274000
ZZ2LOADP EQU   ZZ2+1312                                                 01275000
ZZ2VRESP EQU   ZZ2+1308                                                 01276000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               01277000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                01278000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                01279000
ZZ2VRSAP EQU   ZZ2+1288                                                 01280000
ZZ2DVTP  EQU   ZZ2+1276                                                 01281000
@NM00088 EQU   ZZ2+1272                                                 01282000
@NM00087 EQU   ZZ2+1268                                                 01283000
ZZ2RPLP  EQU   ZZ2+1260                                                 01284000
ZZ2TCBP  EQU   ZZ2+1256                                                 01285000
@NM00086 EQU   ZZ2+1252                                                 01286000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 01287000
@NM00085 EQU   ZZ2+1112                                                 01288000
ZZ2FPDRP EQU   ZZ2+1108                                                 01289000
ZZ2FDSDP EQU   ZZ2+1104                                                 01290000
ZZ2APDRP EQU   ZZ2+1100                                                 01291000
ZZ2ADSDP EQU   ZZ2+1096                                                 01292000
ZZ2ENQ0P EQU   ZZ2+1092                                                 01293000
@NM00084 EQU   ZZ2+1080                                                 01294000
ZZ2MSG0P EQU   ZZ2+1076                                                 01295000
ZZ2FT25P EQU   ZZ2+1072                                                 01296000
ZZ2MSGSP EQU   ZZ2+1060                                                 01297000
ZZ2ALOCP EQU   ZZ2+1056                                                 01298000
@NM00083 EQU   ZZ2+976                                                  01299000
ZZ2TOD   EQU   ZZ2+968                                                  01300000
ZZ2STGN  EQU   ZZ2STG+4                                                 01301000
ZZ2STGP  EQU   ZZ2STG                                                   01302000
@NM00082 EQU   ZZ2+952                                                  01303000
ZZ2SCMDE EQU   ZZ2+944                                                  01304000
ZZ2SCMDN EQU   ZZ2+936                                                  01305000
ZZ2IDENT EQU   ZZ2+928                                                  01306000
ZZ2A9999 EQU   ZZ2A+656                                                 01307000
@NM00081 EQU   ZZ2A+224                                                 01308000
@NM00080 EQU   ZZ2A+220                                                 01309000
ZZ2AQD99 EQU   ZZ2AQD+60                                                01310000
@NM00079 EQU   ZZ2AQD+56                                                01311000
@NM00078 EQU   ZZ2AQDF                                                  01312000
ZZ2AQDFA EQU   ZZ2AQDF                                                  01313000
ZZ2AQDIL EQU   ZZ2AQD+48                                                01314000
ZZ2AQDIM EQU   ZZ2AQD+44                                                01315000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               01316000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               01317000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                01318000
@NM00077 EQU   ZZ2AQDT+1                                                01319000
ZZ2AQDTY EQU   ZZ2AQDT                                                  01320000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  01321000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 01322000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 01323000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 01324000
ZZ2AQDOF EQU   ZZ2AQD                                                   01325000
ZZ2AQD00 EQU   ZZ2AQD                                                   01326000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               01327000
@NM00076 EQU   ZZ2AQAS+12                                               01328000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                01329000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                01330000
@NM00075 EQU   ZZ2AQAS+2                                                01331000
ZZ2AQAST EQU   ZZ2AQAS                                                  01332000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  01333000
ZZ2ADPTA EQU   ZZ2ADPT                                                  01334000
ZZ2ADPL  EQU   ZZ2ADP                                                   01335000
ZZ2ADMTA EQU   ZZ2ADMT                                                  01336000
ZZ2ADML  EQU   ZZ2ADM                                                   01337000
ZZ2ADDTA EQU   ZZ2ADDT                                                  01338000
ZZ2ADDL  EQU   ZZ2ADD                                                   01339000
@NM00074 EQU   ZZ2A+72                                                  01340000
ZZ2APIDB EQU   ZZ2APID+3                                                01341000
ZZ2APIDA EQU   ZZ2APID                                                  01342000
@NM00073 EQU   ZZ2A+24                                                  01343000
@NM00072 EQU   ZZ2AF+5                                                  01344000
ZZ2AFX   EQU   ZZ2AF+5                                                  01345000
@NM00071 EQU   ZZ2AF+3                                                  01346000
ZZ2AFS   EQU   ZZ2AF+2                                                  01347000
ZZ2AFD   EQU   ZZ2AF+2                                                  01348000
ZZ2AFQ   EQU   ZZ2AF+2                                                  01349000
ZZ2AF$   EQU   ZZ2AF+2                                                  01350000
@NM00070 EQU   ZZ2AF+2                                                  01351000
ZZ2AFM   EQU   ZZ2AF+2                                                  01352000
@NM00069 EQU   ZZ2AF+2                                                  01353000
@NM00068 EQU   ZZ2AF+1                                                  01354000
ZZ2AFV   EQU   ZZ2AF+1                                                  01355000
@NM00067 EQU   ZZ2AF+1                                                  01356000
ZZ2AFC   EQU   ZZ2AF+1                                                  01357000
@NM00066 EQU   ZZ2AF                                                    01358000
ZZ2AFFS  EQU   ZZ2AF                                                    01359000
ZZ2AFT   EQU   ZZ2AF                                                    01360000
ZZ2AFP   EQU   ZZ2AF                                                    01361000
@NM00065 EQU   ZZ2A+8                                                   01362000
ZZ2ALINE EQU   ZZ2A+4                                                   01363000
@NM00064 EQU   ZZ2A+3                                                   01364000
ZZ2ASE   EQU   ZZ2A+2                                                   01365000
ZZ2ACH   EQU   ZZ2A                                                     01366000
@NM00063 EQU   ZZ2+264                                                  01367000
@NM00062 EQU   ZZ2+263                                                  01368000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  01369000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 01370000
ZZ2PRTL  EQU   ZZ2PRT                                                   01371000
@NM00061 EQU   ZZ2AMD+56                                                01372000
ZZ2AMDXP EQU   ZZ2AMD+52                                                01373000
ZZ2AMDD  EQU   ZZ2AMD+48                                                01374000
ZZ2AMDL  EQU   ZZ2AMD+44                                                01375000
ZZ2AMDU  EQU   ZZ2AMD+28                                                01376000
ZZ2AMDF  EQU   ZZ2AMD+24                                                01377000
ZZ2AMDS  EQU   ZZ2AMD+20                                                01378000
ZZ2AMDC  EQU   ZZ2AMD+16                                                01379000
ZZ2AMDP  EQU   ZZ2AMD+12                                                01380000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 01381000
@NM00060 EQU   @NM00059                                                 01382000
ZZ2AMD2  EQU   @NM00059                                                 01383000
ZZ2AMD1  EQU   @NM00059                                                 01384000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 01385000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 01386000
ZZ2AMDT  EQU   ZZ2AMD                                                   01387000
ZZ199999 EQU   ZZ1+3072                                                 01388000
@NM00058 EQU   ZZ1+2160                                                 01389000
ZZ1TRTAS EQU   ZZ1+1904                                                 01390000
ZZ1TRUPC EQU   ZZ1+1648                                                 01391000
ZZ1TRCTX EQU   ZZ1+1392                                                 01392000
ZZ1NASID EQU   ZZ1N+274                                                 01393000
ZZ1NSTRL EQU   ZZ1N+272                                                 01394000
ZZ1NOFF  EQU   ZZ1N+268                                                 01395000
ZZ1NBDY  EQU   ZZ1N+264                                                 01396000
ZZ1NADE  EQU   ZZ1N+260                                                 01397000
ZZ1NADB  EQU   ZZ1N+256                                                 01398000
ZZ1NSTR  EQU   ZZ1N                                                     01399000
@NM00057 EQU   ZZ1+1080                                                 01400000
ZZ1TREBC EQU   ZZ1+824                                                  01401000
ZZ1TRHEX EQU   ZZ1+568                                                  01402000
@NM00056 EQU   ZZ1+377                                                  01403000
ZZ1USTAE EQU   ZZ1+376                                                  01404000
@NM00055 EQU   ZZ1F+1                                                   01405000
@NM00054 EQU   ZZ1F                                                     01406000
ZZ1FM    EQU   ZZ1F                                                     01407000
ZZ1FX    EQU   ZZ1F                                                     01408000
ZZ1FU    EQU   ZZ1F                                                     01409000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 01410000
@NM00053 EQU   ZZ1EVE                                                   01411000
ZZ1EVEP  EQU   ZZ1EVE                                                   01412000
ZZ1EVEW  EQU   ZZ1EVE                                                   01413000
ZZ1ACMP  EQU   ZZ1ATTN                                                  01414000
@NM00052 EQU   ZZ1+144                                                  01415000
ZZ1FPP   EQU   ZZ1+140                                                  01416000
ZZ1ZZ6P  EQU   ZZ1+136                                                  01417000
@NM00051 EQU   ZZ1+84                                                   01418000
ZZ1PLINE EQU   ZZ1+80                                                   01419000
ZZ1PGSZ  EQU   ZZ1+76                                                   01420000
ZZ1PCNT  EQU   ZZ1+72                                                   01421000
@NM00050 EQU   ZZ1+68                                                   01422000
ZZ1TPAGE EQU   ZZ1+64                                                   01423000
ZZ1TLINE EQU   ZZ1+60                                                   01424000
@NM00049 EQU   ZZ1+48                                                   01425000
ZZ1DSDP  EQU   ZZ1+44                                                   01426000
ZZ1PDRP  EQU   ZZ1+40                                                   01427000
ZZ1ZZ2P  EQU   ZZ1+36                                                   01428000
ZZ1327WP EQU   ZZ1+32                                                   01429000
ZZ1ACBP  EQU   ZZ1+28                                                   01430000
@NM00048 EQU   ZZ1+24                                                   01431000
ZZ1PDCBP EQU   ZZ1+20                                                   01432000
ZZ1BLRBL EQU   ZZ1+16                                                   01433000
@NM00047 EQU   ZZ1+12                                                   01434000
ZZ1PNULL EQU   ZZ1+8                                                    01435000
ZZ1NULL  EQU   ZZ1+4                                                    01436000
ZZ1IDE   EQU   ZZ1                                                      01437000
ESBA999  EQU   ESBA+694                                                 01438000
ESBART1  EQU   ESBART                                                   01439000
ESBARL   EQU   ESBAR                                                    01440000
@NM00024 EQU   ESBA+168                                                 01441000
ESBAABS  EQU   ESBA+164                                                 01442000
@NM00023 EQU   ESBAF+2                                                  01443000
@NM00022 EQU   ESBAFC                                                   01444000
ESBAFCD  EQU   ESBAFC                                                   01445000
ESBAFSS  EQU   ESBAFS                                                   01446000
ESBAFSX  EQU   ESBAFS                                                   01447000
ESBAFSR  EQU   ESBAFS                                                   01448000
ESBAFSP  EQU   ESBAFS                                                   01449000
ESBAFSA  EQU   ESBAFS                                                   01450000
ESBAFSM  EQU   ESBAFS                                                   01451000
ESBAFS2  EQU   ESBAFS                                                   01452000
ESBAFSC  EQU   ESBAFS                                                   01453000
ESBAKEY  EQU   ESBA+160                                                 01454000
@NM00021 EQU   ESBA+144                                                 01455000
ESBAMAD  EQU   ESBA+140                                                 01456000
ESBAD99  EQU   ESBAD+60                                                 01457000
@NM00020 EQU   ESBAD+56                                                 01458000
@NM00019 EQU   ESBADF                                                   01459000
ESBADFA  EQU   ESBADF                                                   01460000
ESBADIL  EQU   ESBAD+48                                                 01461000
ESBADIM  EQU   ESBAD+44                                                 01462000
ESBADT9  EQU   ESBADT+34                                                01463000
ESBADTE  EQU   ESBADT+33                                                01464000
ESBADTD  EQU   ESBADT+2                                                 01465000
@NM00018 EQU   ESBADT+1                                                 01466000
ESBADTY  EQU   ESBADT                                                   01467000
ESBADT0  EQU   ESBADT                                                   01468000
ESBADLB  EQU   ESBAD+9                                                  01469000
ESBADOB  EQU   ESBAD+8                                                  01470000
ESBADLE  EQU   ESBAD+4                                                  01471000
ESBADOF  EQU   ESBAD                                                    01472000
ESBAD00  EQU   ESBAD                                                    01473000
ESBAAS9  EQU   ESBAAS+16                                                01474000
@NM00017 EQU   ESBAAS+12                                                01475000
ESBAAS2  EQU   ESBAAS+8                                                 01476000
@NM00016 EQU   ESBAAS+2                                                 01477000
ESBAAST  EQU   ESBAAS                                                   01478000
ESBAAS0  EQU   ESBAAS                                                   01479000
ESBARV1  EQU   ESBA+59                                                  01480000
ESBAELK  EQU   ESBA+59                                                  01481000
ESBARDX  EQU   ESBA+24                                                  01482000
@NM00015 EQU   ESBA+16                                                  01483000
@NM00014 EQU   ESBA+8                                                   01484000
@NM00013 EQU   ESBA+2                                                   01485000
ESBARID  EQU   ESBA                                                     01486000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01487000
@RT00150 EQU   EXIT                                                     01488000
@RT00154 EQU   EXIT                                                     01489000
@RT00160 EQU   EXIT                                                     01490000
@ENDDATA EQU   *                                                        01491000
         END   BLSSASCB,(C'PLS0327',0701,78059)                         01492000
