MONL     TITLE 'BLSUMONL--SUBCOMMAND LINKAGE SUBROUTINE                *00001000
                        '                                               00002000
*/* CHANGE ACTIVITY -------------------------------------------------*/ 00003000
*/*   THIS MODULE WAS WRITTEN FOR @G57LPRW                           */ 00004000
*/*------------------------------------------------------------------*/ 00005000
BLSUMONL CSECT ,                                                01S0002 00006000
@MAINENT DS    0H                                               01S0002 00007000
         USING *,@15                                            01S0002 00008000
         B     @PROLOG                                          01S0002 00009000
         DC    AL1(16)                                          01S0002 00010000
         DC    C'BLSUMONL  78.060'                              01S0002 00011000
         DROP  @15                                                      00012000
@PROLOG  STM   @14,@12,12(@13)                                  01S0002 00013000
         BALR  @12,0                                            01S0002 00014000
@PSTART  DS    0H                                               01S0002 00015000
         USING @PSTART,@12                                      01S0002 00016000
         L     @00,@SIZDATD                                     01S0002 00017000
         BLSUALLS R,LV=(0)                                              00018000
         LR    @11,@01                                          01S0002 00019000
         USING @DATD,@11                                        01S0002 00020000
         ST    @13,@SA00001+4                                   01S0002 00021000
         LM    @00,@01,20(@13)                                  01S0002 00022000
         ST    @11,8(,@13)                                      01S0002 00023000
         LR    @13,@11                                          01S0002 00024000
         MVC   @PC00001(8),0(@01)                               01S0002 00025000
*   ECTRCDF='00'X;                  /* NORMAL PROCESSING SO FAR      */ 00026000
         L     @14,CPPLECT(,R9)                                 01S0170 00027000
         MVI   ECTRCDF(@14),X'00'                               01S0170 00028000
*   IF CSOAVWP='1'B THEN            /* OPERANDS PRESENT ON COMMAND   */ 00029000
         L     @10,@PC00001+4                                   01S0171 00030000
         TM    CSOAVWP(@10),B'10000000'                         01S0171 00031000
         BNO   @RF00171                                         01S0171 00032000
*     ECTNOPD='0'B;                 /* OPERANDS PRESENT ON COMMAND   */ 00033000
         NI    ECTNOPD(@14),B'01111111'                         01S0172 00034000
*   ELSE                            /* NO OPERANDS ON COMMAND        */ 00035000
*     ECTNOPD='1'B;                 /* NO OPERANDS ON COMMAND        */ 00036000
         B     @RC00171                                         01S0173 00037000
@RF00171 L     @14,CPPLECT(,R9)                                 01S0173 00038000
         OI    ECTNOPD(@14),B'10000000'                         01S0173 00039000
*   ZZ2SCMDN=ZZZPGM40;              /* PAD COMMAND NAME FIELD        */ 00040000
@RC00171 MVC   ZZ2SCMDN(8,R9),@CC00105                          01S0174 00041000
*   ZZ2SCMDN(1:CSOALNM)=CSOACN(1:CSOALNM);/* COMMAND NAME            */ 00042000
         L     @14,@PC00001+4                                   01S0175 00043000
         LH    @10,CSOALNM(,@14)                                01S0175 00044000
         LR    @08,@10                                          01S0175 00045000
         BCTR  @08,0                                            01S0175 00046000
         L     @07,CSOACNM(,@14)                                01S0175 00047000
         EX    @08,@SM00988                                     01S0175 00048000
*   CMDNAMTA=ZZ2SCMDN;              /* COMMAND NAME                  */ 00049000
         MVC   CMDNAMTA(8),ZZ2SCMDN(R9)                         01S0176 00050000
*   CMDNAML=CSOALNM;                /* LENGTH OF COMMAND NAME        */ 00051000
         STC   @10,CMDNAML                                      01S0177 00052000
*   BVTPTR=ADDR(BVT);               /* ->BVT                         */ 00053000
         L     BVTPTR,ZZ2BVTP(,R9)                              01S0178 00054000
*   RESPECIFY                                                   01S0179 00055000
*     BVT BASED(BVTPTR);            /* CENTRAL SERVICES VECTOR TABLE */ 00056000
*   IF CSOAEXEC='1'B THEN           /* PERCENT SIGN COMMAND PREFIX   */ 00057000
         TM    CSOAEXEC(@14),B'00000100'                        01S0180 00058000
         BNO   @RF00180                                         01S0180 00059000
*     DO;                           /* BLSUCALL EP(BLSUMONC)         */ 00060000
*       RESPECIFY                                               01S0182 00061000
*        (GPR01P) RESTRICTED;       /* ->TASK VARIABLE               */ 00062000
*       GPR01P=ADDR(ZZ2);           /* ->TASK VARIABLE               */ 00063000
         LR    GPR01P,R9                                        01S0183 00064000
*       CALL BLSUMONC;              /* CALL RESIDENT IPCS PROGRAM    */ 00065000
         L     @15,BVTMONCP(,BVTPTR)                            01S0184 00066000
         BALR  @14,@15                                          01S0184 00067000
*       RESPECIFY                                               01S0185 00068000
*        (GPR01P) UNRESTRICTED;     /* ->TASK VARIABLE               */ 00069000
*     END;                          /* BLSUCALL EP(BLSUMONC)         */ 00070000
*   ELSE                            /* NO PERCENT SIGN PREFIX        */ 00071000
*                                                               01S0187 00072000
*     /***************************************************************/ 00073000
*     /*                                                             */ 00074000
*     /* NO PERCENT SIGN PREFIX                                      */ 00075000
*     /*                                                             */ 00076000
*     /***************************************************************/ 00077000
*                                                               01S0187 00078000
*     DO;                           /* NO PERCENT SIGN PREFIX        */ 00079000
         B     @RC00180                                         01S0187 00080000
@RF00180 DS    0H                                               01S0188 00081000
*       GSTBP=ADDR(STB);            /* ->STB (GLOBAL)                */ 00082000
         L     GSTBP,BVTSTBLP(,BVTPTR)                          01S0188 00083000
*       RESPECIFY                                               01S0189 00084000
*         STB BASED(GSTBP);         /* IPCS SUBCOMMAND TABLE         */ 00085000
*                                                               01S0189 00086000
*       /*************************************************************/ 00087000
*       /*                                                           */ 00088000
*       /* SEARCH SUBCOMMAND TABLE FOR THE COMMAND ENTERED           */ 00089000
*       /*                                                           */ 00090000
*       /*************************************************************/ 00091000
*                                                               01S0190 00092000
*       DO;                         /* BLRSRCH(CMDNAM) ARRAY(STBSN)DI   00093000
*                                      MENSION(STBDIM)SET(CMDINDEX)  */ 00094000
*         CMDINDEX=0;               /* CURRENT POSITION              */ 00095000
         SLR   CMDINDEX,CMDINDEX                                01S0191 00096000
*         SCH0001G=STBDIM;          /* PROBE DISTANCE                */ 00097000
*                                                               01S0192 00098000
         L     SCH0001G,STBDIM(,GSTBP)                          01S0192 00099000
*         /***********************************************************/ 00100000
*         /*                                                         */ 00101000
*         /* SEARCH SORTED ARRAY STBSN FOR CMDNAM                    */ 00102000
*         /*                                                         */ 00103000
*         /***********************************************************/ 00104000
*                                                               01S0193 00105000
*         DO WHILE(SCH0001G>0);     /* SEARCH SORTED ARRAY           */ 00106000
         B     @DE00193                                         01S0193 00107000
@DL00193 DS    0H                                               01S0194 00108000
*           SCH0001A=CMDINDEX+SCH0001G;/* PROBE POSITION             */ 00109000
         LR    SCH0001A,CMDINDEX                                01S0194 00110000
         ALR   SCH0001A,SCH0001G                                01S0194 00111000
*           IF SCH0001A>STBDIM THEN /* PROBE BEYOND ARRAY            */ 00112000
         CL    SCH0001A,STBDIM(,GSTBP)                          01S0195 00113000
         BNH   @RF00195                                         01S0195 00114000
*             IF SCH0001G=1 THEN    /* ADJACENT ARRAY ENTRIES        */ 00115000
*                                                               01S0196 00116000
         CL    SCH0001G,@CF00046                                01S0196 00117000
         BNE   @RF00196                                         01S0196 00118000
*               /*****************************************************/ 00119000
*               /*                                                   */ 00120000
*               /* CMDNAM COLLATES HIGHER THAN STBSN(STBDIM)         */ 00121000
*               /*                                                   */ 00122000
*               /*****************************************************/ 00123000
*                                                               01S0197 00124000
*               DO;                 /* ADJACENT ARRAY ENTRIES        */ 00125000
*                 CMDINDEX=0;       /* SEARCH IS UNSUCCESSFUL        */ 00126000
         SLR   CMDINDEX,CMDINDEX                                01S0198 00127000
*                 SCH0001G=0;       /* SEARCH IS COMPLETE            */ 00128000
         SLR   SCH0001G,SCH0001G                                01S0199 00129000
*               END;                /* ADJACENT ARRAY ENTRIES        */ 00130000
*             ELSE                  /* INTERVENING ENTRY(IES)        */ 00131000
*               ;                   /* NEW PROBE POSITION            */ 00132000
@RF00196 DS    0H                                               01S0202 00133000
*           ELSE                    /* PROBE POSITION IN ARRAY       */ 00134000
*             IF STBSN(SCH0001A)<=CMDNAM THEN                   01S0202 00135000
*                                                               01S0202 00136000
         B     @RC00195                                         01S0202 00137000
@RF00195 LR    @14,SCH0001A                                     01S0202 00138000
         MH    @14,@CH00985                                     01S0202 00139000
         ALR   @14,GSTBP                                        01S0202 00140000
         AL    @14,@CF00990                                     01S0202 00141000
         CLC   STBSN-15(9,@14),CMDNAM                           01S0202 00142000
         BH    @RF00202                                         01S0202 00143000
*               /*****************************************************/ 00144000
*               /*                                                   */ 00145000
*               /* SEARCH HIGHER IN ARRAY                            */ 00146000
*               /*                                                   */ 00147000
*               /*****************************************************/ 00148000
*                                                               01S0203 00149000
*               DO;                 /* CURRENT POSITION TOO LOW      */ 00150000
*                 BC(7,SCH0001L);   /* IF STBSN(SCH0001A)=CMDNAM THEN   00151000
*                                      SEARCH IS SUCCESSFUL          */ 00152000
         BC    7,SCH0001L                                       01S0204 00153000
*                 SCH0001G=0;       /* SEARCH IS COMPLETE            */ 00154000
         SLR   SCH0001G,SCH0001G                                01S0205 00155000
*SCH0001L:                          /* ELSE CONTINUE THE SEARCH      */ 00156000
*                 CMDINDEX=SCH0001A;/* CURRENT POSITION              */ 00157000
SCH0001L LR    CMDINDEX,SCH0001A                                01S0206 00158000
*               END;                /* CURRENT POSITION TOO LOW      */ 00159000
*             ELSE                  /* CURRENT POSITION HIGH ENOUGH  */ 00160000
*               IF SCH0001G=1 THEN  /* ADJACENT ARRAY ENTRIES        */ 00161000
*                                                               01S0208 00162000
         B     @RC00202                                         01S0208 00163000
@RF00202 CL    SCH0001G,@CF00046                                01S0208 00164000
         BNE   @RF00208                                         01S0208 00165000
*                 /***************************************************/ 00166000
*                 /*                                                 */ 00167000
*                 /* CMDNAM COLLATES BETWEEN ENTRIES OR LOW          */ 00168000
*                 /*                                                 */ 00169000
*                 /***************************************************/ 00170000
*                                                               01S0209 00171000
*                 DO;               /* ADJACENT ARRAY ENTRIES        */ 00172000
*                   CMDINDEX=0;     /* SEARCH IS UNSUCCESSFUL        */ 00173000
         SLR   CMDINDEX,CMDINDEX                                01S0210 00174000
*                   SCH0001G=0;     /* SEARCH IS COMPLETE            */ 00175000
         SLR   SCH0001G,SCH0001G                                01S0211 00176000
*                 END;              /* ADJACENT ARRAY ENTRIES        */ 00177000
*           SCH0001G=SCH0001G+1;    /* PROBE DISTANCE                */ 00178000
@RF00208 DS    0H                                               01S0213 00179000
@RC00202 DS    0H                                               01S0213 00180000
@RC00195 AL    SCH0001G,@CF00046                                01S0213 00181000
*           SRL(SCH0001G,1);        /* PROBE DISTANCE                */ 00182000
         SRL   SCH0001G,1                                       01S0214 00183000
*         END;                      /* SEARCH SORTED ARRAY           */ 00184000
@DE00193 SLR   @14,@14                                          01S0215 00185000
         CLR   SCH0001G,@14                                     01S0215 00186000
         BH    @DL00193                                         01S0215 00187000
*       END;                        /* BLRSRCH(CMDNAM) ARRAY(STBSN)DI   00188000
*                                      MENSION(STBDIM)SET(CMDINDEX)  */ 00189000
*       IF CMDINDEX=0 THEN          /* SUBCOMMAND NOT LISTED         */ 00190000
         CR    CMDINDEX,@14                                     01S0217 00191000
         BNE   @RF00217                                         01S0217 00192000
*         DO;                       /* BLSUCALL EP(BLSUMONX)         */ 00193000
*           RESPECIFY                                           01S0219 00194000
*            (GPR01P) RESTRICTED;   /* ->TASK VARIABLE               */ 00195000
*           GPR01P=ADDR(ZZ2);       /* ->TASK VARIABLE               */ 00196000
         LR    GPR01P,R9                                        01S0220 00197000
*           CALL BLSUMONX;          /* CALL RESIDENT IPCS PROGRAM    */ 00198000
         L     @15,BVTMONXP(,BVTPTR)                            01S0221 00199000
         BALR  @14,@15                                          01S0221 00200000
*           RESPECIFY                                           01S0222 00201000
*            (GPR01P) UNRESTRICTED; /* ->TASK VARIABLE               */ 00202000
*         END;                      /* BLSUCALL EP(BLSUMONX)         */ 00203000
*       ELSE                        /* SUBCOMMAND LISTED             */ 00204000
*                                                               01S0224 00205000
*         /***********************************************************/ 00206000
*         /*                                                         */ 00207000
*         /* SUBCOMMAND LISTED                                       */ 00208000
*         /*                                                         */ 00209000
*         /***********************************************************/ 00210000
*                                                               01S0224 00211000
*         DO;                       /* SUBCOMMAND LISTED             */ 00212000
         B     @RC00217                                         01S0224 00213000
@RF00217 DS    0H                                               01S0225 00214000
*           LSTBP=ADDR(LSTB);       /* ->STB (LOCAL COPY)            */ 00215000
         LA    LSTBP,LSTB                                       01S0225 00216000
*           LSTBP->STBS(1)=STBS(CMDINDEX);/* SUBCOMMAND DEFINITION   */ 00217000
         LR    @14,CMDINDEX                                     01S0226 00218000
         MH    @14,@CH00985                                     01S0226 00219000
         ALR   @14,GSTBP                                        01S0226 00220000
         AL    @14,@CF00991                                     01S0226 00221000
         MVC   STBS(20,LSTBP),STBS-12(@14)                      01S0226 00222000
*           RESPECIFY                                           01S0227 00223000
*             STB BASED(LSTBP);     /* SUBCOMMAND TABLE (LOCAL)      */ 00224000
*           IF STBSFINV(1)='1'B THEN/* SUBCOMMAND NOT SUPPORTED      */ 00225000
*                                                               01S0228 00226000
         TM    STBSFINV(LSTBP),B'10000000'                      01S0228 00227000
         BNO   @RF00228                                         01S0228 00228000
*             /*******************************************************/ 00229000
*             /*                                                     */ 00230000
*             /* SUBCOMMAND NOT SUPPORTED                            */ 00231000
*             /*                                                     */ 00232000
*             /*******************************************************/ 00233000
*                                                               01S0229 00234000
*             DO;                   /* SUBCOMMAND NOT SUPPORTED      */ 00235000
*               CALL BLSUTRMV(ZZ2,M006);/* TRANSMIT MESSAGE M006     */ 00236000
         ST    R9,@AL00001                                      01S0230 00237000
         LA    @14,M006                                         01S0230 00238000
         ST    @14,@AL00001+4                                   01S0230 00239000
         L     @15,ZZ2TRMVP(,R9)                                01S0230 00240000
         LA    @01,@AL00001                                     01S0230 00241000
         BALR  @14,@15                                          01S0230 00242000
*               RF=ZZZFLAGT;        /* SET RETURN CODE               */ 00243000
         LA    RF,16                                            01S0231 00244000
*             END;                  /* SUBCOMMAND NOT SUPPORTED      */ 00245000
*           ELSE                    /* SUBCOMMAND SUPPORTED          */ 00246000
*                                                               01S0233 00247000
*             /*******************************************************/ 00248000
*             /*                                                     */ 00249000
*             /* SUBCOMMAND SUPPORTED                                */ 00250000
*             /*                                                     */ 00251000
*             /*******************************************************/ 00252000
*                                                               01S0233 00253000
*             DO;                   /* SUBCOMMAND SUPPORTED          */ 00254000
         B     @RC00228                                         01S0233 00255000
@RF00228 DS    0H                                               01S0234 00256000
*               ZZ2SCMDE=STBSEP(1); /* ENTRY POINT NAME              */ 00257000
         MVC   ZZ2SCMDE(8,R9),STBSEP(LSTBP)                     01S0234 00258000
*               IF STBST(1)=STBSTL THEN/* IPCS SUBCOMMAND            */ 00259000
*                                                               01S0235 00260000
         CLI   STBST(LSTBP),C'L'                                01S0235 00261000
         BNE   @RF00235                                         01S0235 00262000
*                 /***************************************************/ 00263000
*                 /*                                                 */ 00264000
*                 /* IPCS SUBCOMMAND                                 */ 00265000
*                 /*                                                 */ 00266000
*                 /***************************************************/ 00267000
*                                                               01S0236 00268000
*                 DO;               /* IPCS SUBCOMMAND               */ 00269000
*                   RESPECIFY                                   01S0237 00270000
*                    (R1) RESTRICTED;/* ->CURRENT TASK VARIABLE      */ 00271000
*                   R1=ADDR(ZZ2);   /* ->CURRENT TASK VARIABLE       */ 00272000
         LR    R1,R9                                            01S0238 00273000
*                   CALL BLSUZZ2R;  /* REFRESH TASK VARIABLE         */ 00274000
         L     @15,BVTZZ2RP(,BVTPTR)                            01S0239 00275000
         BALR  @14,@15                                          01S0239 00276000
*                   IF STBSFPDR(1)='1'B THEN/* PDR REQUIRED          */ 00277000
         TM    STBSFPDR(LSTBP),B'01000000'                      01S0240 00278000
         BNO   @RF00240                                         01S0240 00279000
*                     CALL BLSDAPDR;/* ALLOCATE PROBLEM DIRECTORY    */ 00280000
         L     @15,ZZ2APDRP(,R9)                                01S0241 00281000
         BALR  @14,@15                                          01S0241 00282000
*                   IF              /* BLSDADSD SHOULD BE CALLED     */ 00283000
*                       RF<ZZZFLAGS&/* PREPARATION SATISFACTORY      */ 00284000
*                       STBSFDSD(1)='1'B THEN/* DSD REQUIRED         */ 00285000
@RF00240 CH    RF,@CH00036                                      01S0242 00286000
         BNL   @RF00242                                         01S0242 00287000
         TM    STBSFDSD(LSTBP),B'00100000'                      01S0242 00288000
         BNO   @RF00242                                         01S0242 00289000
*                     CALL BLSDADSD;/* ALLOCATE DATA SET DIRECTORY   */ 00290000
         L     @15,ZZ2ADSDP(,R9)                                01S0243 00291000
         BALR  @14,@15                                          01S0243 00292000
*                   IF              /* BLSRDUCK SHOULD BE CALLED     */ 00293000
*                       RF<ZZZFLAGS&/* PREPARATION SATISFACTORY      */ 00294000
*                       STBSFDU(1)='1'B THEN/* DUMP REQUIRED         */ 00295000
@RF00242 CH    RF,@CH00036                                      01S0244 00296000
         BNL   @RF00244                                         01S0244 00297000
         TM    STBSFDU(LSTBP),B'00010000'                       01S0244 00298000
         BNO   @RF00244                                         01S0244 00299000
*                     CALL BLSRDUCK;/* ALLOCATE, OPEN, INIT. DUMP    */ 00300000
         L     @10,ZZ2RVTP(,R9)                                 01S0245 00301000
         L     @15,RVTDUCKP(,@10)                               01S0245 00302000
         BALR  @14,@15                                          01S0245 00303000
*                   IF RF<ZZZFLAGS THEN/* PREPARATION SATISFACTORY   */ 00304000
@RF00244 CH    RF,@CH00036                                      01S0246 00305000
         BNL   @RF00246                                         01S0246 00306000
*                     CALL BLSUMOND;/* IPCS SUBCOMMAND INTERFACE     */ 00307000
         L     @15,BVTMONDP(,BVTPTR)                            01S0247 00308000
         BALR  @14,@15                                          01S0247 00309000
*                   RESPECIFY                                   01S0248 00310000
*                    (R1) UNRESTRICTED;/* ->CURRENT TASK VARIABLE    */ 00311000
@RF00246 DS    0H                                               01S0249 00312000
*                 END;              /* IPCS SUBCOMMAND               */ 00313000
*               ELSE                /* NOT AN IPCS SUBCOMMAND        */ 00314000
*                 IF STBST(1)=STBSTT THEN/* TSO COMMAND              */ 00315000
*                                                               01S0250 00316000
         B     @RC00235                                         01S0250 00317000
@RF00235 CLI   STBST(LSTBP),C'T'                                01S0250 00318000
         BNE   @RF00250                                         01S0250 00319000
*                   /*************************************************/ 00320000
*                   /*                                               */ 00321000
*                   /* TSO COMMAND                                   */ 00322000
*                   /*                                               */ 00323000
*                   /*************************************************/ 00324000
*                                                               01S0251 00325000
*                   DO;             /* BLSUCALL EP(BLSUMONT)         */ 00326000
*                     RESPECIFY                                 01S0252 00327000
*                      (GPR01P) RESTRICTED;/* ->TASK VARIABLE        */ 00328000
*                     GPR01P=ADDR(ZZ2);/* ->TASK VARIABLE            */ 00329000
         LR    GPR01P,R9                                        01S0253 00330000
*                     CALL BLSUMONT;/* CALL RESIDENT IPCS PROGRAM    */ 00331000
         L     @15,BVTMONTP(,BVTPTR)                            01S0254 00332000
         BALR  @14,@15                                          01S0254 00333000
*                     RESPECIFY                                 01S0255 00334000
*                      (GPR01P) UNRESTRICTED;/* ->TASK VARIABLE      */ 00335000
*                   END;            /* BLSUCALL EP(BLSUMONT)         */ 00336000
*                 ELSE              /* UNSUPPORTED COMMAND TYPE      */ 00337000
*                                                               01S0257 00338000
*                   /*************************************************/ 00339000
*                   /*                                               */ 00340000
*                   /* COMMAND TYPE NOT SUPPORTED                    */ 00341000
*                   /*                                               */ 00342000
*                   /*************************************************/ 00343000
*                                                               01S0257 00344000
*                   DO;             /* UNSUPPORTED COMMAND TYPE      */ 00345000
         B     @RC00250                                         01S0257 00346000
@RF00250 DS    0H                                               01S0258 00347000
*                     CALL BLSUTRMV(ZZ2,M007);/* TRANSMIT MSG M007   */ 00348000
         ST    R9,@AL00001                                      01S0258 00349000
         LA    @14,M007                                         01S0258 00350000
         ST    @14,@AL00001+4                                   01S0258 00351000
         L     @15,ZZ2TRMVP(,R9)                                01S0258 00352000
         LA    @01,@AL00001                                     01S0258 00353000
         BALR  @14,@15                                          01S0258 00354000
*                     RF=ZZZFLAGT;  /* RETURN CODE                   */ 00355000
         LA    RF,16                                            01S0259 00356000
*                   END;            /* UNSUPPORTED COMMAND TYPE      */ 00357000
*             END;                  /* SUBCOMMAND SUPPORTED          */ 00358000
@RC00250 DS    0H                                               01S0261 00359000
@RC00235 DS    0H                                               01S0262 00360000
*         END;                      /* SUBCOMMAND LISTED             */ 00361000
@RC00228 DS    0H                                               01S0263 00362000
*     END;                          /* NO PERCENT SIGN PREFIX        */ 00363000
@RC00217 DS    0H                                               01S0264 00364000
*EXIT:                              /* COMMON EXIT PATH              */ 00365000
*   ECTPCMD=ZZ1ZZ2P->ZZ2SCMDN;      /* COMMAND NAME                  */ 00366000
@RC00180 DS    0H                                               01S0264 00367000
EXIT     L     @14,CPPLECT(,R9)                                 01S0264 00368000
         L     @10,ZZ2ZZ1P(,R9)                                 01S0264 00369000
         L     @10,ZZ1ZZ2P(,@10)                                01S0264 00370000
         MVC   ECTPCMD(8,@14),ZZ2SCMDN(@10)                     01S0264 00371000
*   ECTSCMD=ZZZPGM40;               /* NO SUBCOMMAND ACTIVE          */ 00372000
         MVC   ECTSCMD(8,@14),@CC00105                          01S0265 00373000
*   ECTRTCD=RF;                     /* RETURN CODE                   */ 00374000
         STCM  RF,7,ECTRTCD(@14)                                01S0266 00375000
*   RETURN CODE(RF);                                            01S0267 00376000
*                                                               01S0267 00377000
         LR    @10,@15                                          01S0267 00378000
         L     @13,4(,@13)                                      01S0267 00379000
         L     @00,@SIZDATD                                     01S0267 00380000
         LR    @01,@11                                          01S0267 00381000
         BLSUFRES R,LV=(0),A=(1)                                        00382000
         LR    @15,@10                                          01S0267 00383000
         L     @14,12(,@13)                                     01S0267 00384000
         LM    @00,@12,20(@13)                                  01S0267 00385000
         BR    @14                                              01S0267 00386000
*/*BLSUPEND--MVS IPCS MODULE                                         */ 00387000
*                                                               01S0268 00388000
*   DECLARE                         /* DATA FOR AHB MACROS           */ 00389000
*    (SCH0001A,                     /* PROBE INDEX FOR SEARCH        */ 00390000
*     SCH0001G) UNSIGNED BINARY(32);/* PROBE DISTANCE FOR SEARCH     */ 00391000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 00392000
*     GPR01P PTR(31) REG(1);                                    01S0269 00393000
*   DECLARE                         /* COMMON VARIABLES              */ 00394000
*     I256C CHAR(256) BASED,                                    01S0270 00395000
*     I031F FIXED(31) BASED,                                    01S0270 00396000
*     I031P PTR(31) BASED,                                      01S0270 00397000
*     I015F FIXED(15) BASED,                                    01S0270 00398000
*     I015P PTR(15) BASED,                                      01S0270 00399000
*     I008P PTR(8) BASED,                                       01S0270 00400000
*     I001C CHAR(1) BASED;                                      01S0270 00401000
*   GENERATE NODEFS NOREFS DATA;                                01S0271 00402000
*   END BLSUMONL                    /* BLRPEND(BLSUMONL)             */ 00403000
*                                                               01S0272 00404000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00405000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00406000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00407000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00408000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00409000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00410000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00411000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00412000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00413000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00414000
*/*%INCLUDE SYSLIB  (BLSDSERV)                                       */ 00415000
*/*%INCLUDE SYSLIB  (BLSRSERV)                                       */ 00416000
*/*%INCLUDE SYSLIB  (IKJCSOA )                                       */ 00417000
*/*%INCLUDE SYSLIB  (BLSUSTB )                                       */ 00418000
*                                                               01S0272 00419000
*       ;                                                       01S0272 00420000
@EL00001 L     @13,4(,@13)                                      01S0272 00421000
@EF00001 L     @00,@SIZDATD                                     01S0272 00422000
         LR    @01,@11                                          01S0272 00423000
         BLSUFRES R,LV=(0),A=(1)                                        00424000
@ER00001 LM    @14,@12,12(@13)                                  01S0272 00425000
         BR    @14                                              01S0272 00426000
@DATA    DS    0H                                                       00427000
@CH00036 DC    H'12'                                                    00428000
@CH00985 DC    H'20'                                                    00429000
@SM00988 MVC   ZZ2SCMDN(0,R9),CSOACN(@07)                               00430000
@DATD    DSECT                                                          00431000
         DS    0F                                                       00432000
@SA00001 DS    18F                                                      00433000
@PC00001 DS    2F                                                       00434000
@AL00001 DS    2A                                                       00435000
BLSUMONL CSECT                                                          00436000
         DS    0F                                                       00437000
@CF00046 DC    F'1'                                                     00438000
@CF00991 DC    F'-8'                                                    00439000
@CF00990 DC    F'-5'                                                    00440000
@DATD    DSECT                                                          00441000
         DS    0D                                                       00442000
CMDNAM   DS    CL9                                                      00443000
         ORG   CMDNAM                                                   00444000
CMDNAML  DS    FL1                                                      00445000
CMDNAMT  DS    CL8                                                      00446000
         ORG   CMDNAMT                                                  00447000
CMDNAMTA DS    CL8                                                      00448000
         ORG   CMDNAM+9                                                 00449000
LSTB     DS    CL32                                                     00450000
BLSUMONL CSECT                                                          00451000
         DS    0F                                                       00452000
@SIZDATD DC    AL1(0)                                                   00453000
         DC    AL3(@ENDDATD-@DATD)                                      00454000
         DS    0D                                                       00455000
@CC00105 DC    C'        '                                              00456000
M006     DS    CL35                                                     00457000
         ORG   M006                                                     00458000
M006L    DC    AL2(35)                                                  00459000
@NM00073 DC    X'0000'                                                  00460000
M006T    DS    CL31                                                     00461000
         ORG   M006T                                                    00462000
M006TA   DC    CL31'BLS21006I COMMAND NOT SUPPORTED'                    00463000
         ORG   M006+35                                                  00464000
         DS    CL1                                                      00465000
M007     DS    CL38                                                     00466000
         ORG   M007                                                     00467000
M007L    DC    AL2(38)                                                  00468000
@NM00074 DC    X'0000'                                                  00469000
M007T    DS    CL34                                                     00470000
         ORG   M007T                                                    00471000
M007TA   DC    CL34'BLS21007I UNSUPPORTED COMMAND TYPE'                 00472000
         ORG   M007+38                                                  00473000
@DATD    DSECT                                                          00474000
         SPACE 2                                                        00475000
*********************************************************************** 00476000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00477000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 00478000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 00479000
*********************************************************************** 00480000
         SPACE                                                          00481000
BLSUMONL CSECT                                                          00482000
         ORG                                                            00483000
         DS    0D                                                       00484000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSUMONL+19)/20+7)/8)CL8'BLSUMONL'     00485000
@DATD    DSECT                                                          00486000
         DS    0H                                                       00487000
@DATD    DSECT                                                          00488000
         SPACE 2                                                        00489000
*********************************************************************** 00490000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 00491000
*********************************************************************** 00492000
         SPACE                                                          00493000
         DS    0D                                                       00494000
@DATD    DSECT                                                          00495000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00496000
@ENDDATD EQU   *                                                        00497000
BLSUMONL CSECT                                                          00498000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00499000
@01      EQU   01                                                       00500000
@02      EQU   02                                                       00501000
@03      EQU   03                                                       00502000
@04      EQU   04                                                       00503000
@05      EQU   05                                                       00504000
@06      EQU   06                                                       00505000
@07      EQU   07                                                       00506000
@08      EQU   08                                                       00507000
@09      EQU   09                                                       00508000
@10      EQU   10                                                       00509000
@11      EQU   11                                                       00510000
@12      EQU   12                                                       00511000
@13      EQU   13                                                       00512000
@14      EQU   14                                                       00513000
@15      EQU   15                                                       00514000
SCH0001A EQU   @05                                                      00515000
SCH0001G EQU   @02                                                      00516000
CMDINDEX EQU   @03                                                      00517000
LSTBP    EQU   @05                                                      00518000
GSTBP    EQU   @07                                                      00519000
BVTPTR   EQU   @06                                                      00520000
R9       EQU   @09                                                      00521000
R0       EQU   @00                                                      00522000
R1       EQU   @01                                                      00523000
R2       EQU   @02                                                      00524000
R3       EQU   @03                                                      00525000
R4       EQU   @04                                                      00526000
R5       EQU   @05                                                      00527000
RB       EQU   @11                                                      00528000
RD       EQU   @13                                                      00529000
RE       EQU   @14                                                      00530000
RF       EQU   @15                                                      00531000
GPR01P   EQU   @01                                                      00532000
RA       EQU   @10                                                      00533000
RC       EQU   @12                                                      00534000
R6       EQU   @06                                                      00535000
R7       EQU   @07                                                      00536000
R8       EQU   @08                                                      00537000
ZZ1      EQU   0                                                        00538000
ZZ1ZZ2P  EQU   ZZ1+36                                                   00539000
ZZ1ATTN  EQU   ZZ1+360                                                  00540000
ZZ1EVE   EQU   ZZ1ATTN+4                                                00541000
ZZ1F     EQU   ZZ1+368                                                  00542000
ZZ1N     EQU   ZZ1+1116                                                 00543000
ZZ2      EQU   0                                                        00544000
ZZ2AMD   EQU   ZZ2                                                      00545000
@NM00013 EQU   ZZ2AMD+7                                                 00546000
ZZ2PRT   EQU   ZZ2+138                                                  00547000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 00548000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                00549000
ZZ2A     EQU   ZZ2+272                                                  00550000
ZZ2AF    EQU   ZZ2A+16                                                  00551000
ZZ2APID  EQU   ZZ2A+64                                                  00552000
ZZ2AD    EQU   ZZ2A+74                                                  00553000
ZZ2ADD   EQU   ZZ2AD                                                    00554000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 00555000
ZZ2ADM   EQU   ZZ2AD+46                                                 00556000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 00557000
ZZ2ADP   EQU   ZZ2AD+56                                                 00558000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 00559000
ZZ2AQAS  EQU   ZZ2A+144                                                 00560000
ZZ2AQD   EQU   ZZ2A+160                                                 00561000
ZZ2AQDT  EQU   ZZ2AQD+10                                                00562000
ZZ2AQDF  EQU   ZZ2AQD+52                                                00563000
ZZ2SCMDN EQU   ZZ2+936                                                  00564000
ZZ2SCMDE EQU   ZZ2+944                                                  00565000
ZZ2STG   EQU   ZZ2+960                                                  00566000
ZZ2ALLOP EQU   ZZ2+992                                                  00567000
ZZ2FREEP EQU   ZZ2+996                                                  00568000
ZZ2FF19P EQU   ZZ2+1000                                                 00569000
ZZ2FRE1P EQU   ZZ2+1004                                                 00570000
ZZ2FF18P EQU   ZZ2+1008                                                 00571000
ZZ2DYNAP EQU   ZZ2+1012                                                 00572000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 00573000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 00574000
ZZ2STAIP EQU   ZZ2+1024                                                 00575000
ZZ2FF02P EQU   ZZ2+1028                                                 00576000
ZZ2GETLP EQU   ZZ2+1032                                                 00577000
ZZ2PARSP EQU   ZZ2+1036                                                 00578000
ZZ2PTGTP EQU   ZZ2+1040                                                 00579000
ZZ2PUTLP EQU   ZZ2+1044                                                 00580000
ZZ2SCANP EQU   ZZ2+1048                                                 00581000
ZZ2STCKP EQU   ZZ2+1052                                                 00582000
ZZ2ALOCP EQU   ZZ2+1056                                                 00583000
ZZ2MSGSP EQU   ZZ2+1060                                                 00584000
ZZ2TRMOP EQU   ZZ2+1064                                                 00585000
ZZ2TRMVP EQU   ZZ2+1068                                                 00586000
ZZ2MSG0P EQU   ZZ2+1076                                                 00587000
ZZ2PUTNP EQU   ZZ2+1084                                                 00588000
ZZ2TRMNP EQU   ZZ2+1088                                                 00589000
ZZ2ENQ0P EQU   ZZ2+1092                                                 00590000
ZZ2ADSDP EQU   ZZ2+1096                                                 00591000
ZZ2APDRP EQU   ZZ2+1100                                                 00592000
ZZ2FDSDP EQU   ZZ2+1104                                                 00593000
ZZ2FPDRP EQU   ZZ2+1108                                                 00594000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 00595000
ZZ2DVTP  EQU   ZZ2+1276                                                 00596000
ZZ2BVTP  EQU   ZZ2+1280                                                 00597000
ZZ2RVTP  EQU   ZZ2+1284                                                 00598000
ZZ2CPPL  EQU   ZZ2+1292                                                 00599000
ZZ2CPPLC EQU   ZZ2CPPL                                                  00600000
ZZ2ITR   EQU   ZZ2+2840                                                 00601000
ZZ2ITRE  EQU   ZZ2ITR+16                                                00602000
ZZ2ITSE  EQU   ZZ2+2864                                                 00603000
ZZ2ES    EQU   ZZ2+2872                                                 00604000
ZZ2AMDX  EQU   ZZ2+7160                                                 00605000
ZZ2AXO   EQU   ZZ2+7934                                                 00606000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 00607000
CMD      EQU   0                                                        00608000
CMDT     EQU   CMD+4                                                    00609000
PSCB     EQU   0                                                        00610000
PSCBATR1 EQU   PSCB+16                                                  00611000
ECT      EQU   0                                                        00612000
ECTRCDF  EQU   ECT                                                      00613000
ECTRTCD  EQU   ECT+1                                                    00614000
ECTPCMD  EQU   ECT+12                                                   00615000
ECTSCMD  EQU   ECT+20                                                   00616000
ECTSWS   EQU   ECT+28                                                   00617000
ECTNOPD  EQU   ECTSWS                                                   00618000
ECTSWS2  EQU   ECT+40                                                   00619000
ECTSWS21 EQU   ECTSWS2                                                  00620000
UPT      EQU   0                                                        00621000
UPTSWS   EQU   UPT+12                                                   00622000
SA       EQU   0                                                        00623000
SA1      EQU   SA                                                       00624000
SAR      EQU   SA+12                                                    00625000
SAR1     EQU   SAR+12                                                   00626000
BLSUMONC EQU   0                                                        00627000
BLSUMOND EQU   0                                                        00628000
BLSUMONT EQU   0                                                        00629000
BLSUMONX EQU   0                                                        00630000
BLSUTRMV EQU   0                                                        00631000
BLSUZZ2R EQU   0                                                        00632000
BVT      EQU   0                                                        00633000
BVTPUTLP EQU   BVT+4                                                    00634000
BVTPUTOP EQU   BVT+12                                                   00635000
BVTPUTTP EQU   BVT+16                                                   00636000
BVTPUTVP EQU   BVT+20                                                   00637000
BVTPUTAP EQU   BVT+24                                                   00638000
BVTPRTTP EQU   BVT+28                                                   00639000
BVTPRTAP EQU   BVT+32                                                   00640000
BVTPUTDP EQU   BVT+36                                                   00641000
BVTMONP  EQU   BVT+40                                                   00642000
BVTMON2P EQU   BVT+44                                                   00643000
BVTVSARP EQU   BVT+48                                                   00644000
BVTVSENP EQU   BVT+64                                                   00645000
BVTVSERP EQU   BVT+68                                                   00646000
BVTVSGEP EQU   BVT+72                                                   00647000
BVTVSGUP EQU   BVT+76                                                   00648000
BVTVSPOP EQU   BVT+80                                                   00649000
BVTVSPUP EQU   BVT+84                                                   00650000
BVTMPKNP EQU   BVT+104                                                  00651000
BVTPUTCP EQU   BVT+132                                                  00652000
BVTMPK1P EQU   BVT+136                                                  00653000
BVTZZ2RP EQU   BVT+140                                                  00654000
BVTPGMRP EQU   BVT+144                                                  00655000
BVTMONAP EQU   BVT+148                                                  00656000
BVTBLDDP EQU   BVT+152                                                  00657000
BVTBLDLP EQU   BVT+156                                                  00658000
BVTPGMCP EQU   BVT+160                                                  00659000
BVTPGMDP EQU   BVT+164                                                  00660000
BVTPGMLP EQU   BVT+168                                                  00661000
BVTMONCP EQU   BVT+180                                                  00662000
BVTMONDP EQU   BVT+184                                                  00663000
BVTMONTP EQU   BVT+188                                                  00664000
BVTPARIP EQU   BVT+192                                                  00665000
BVTPARUP EQU   BVT+196                                                  00666000
BVTSTBLP EQU   BVT+200                                                  00667000
BVTPRTNP EQU   BVT+204                                                  00668000
BVTVSCRP EQU   BVT+208                                                  00669000
BVTVSMRP EQU   BVT+212                                                  00670000
BVTMONXP EQU   BVT+216                                                  00671000
BVTTRMAP EQU   BVT+228                                                  00672000
BLSDADSD EQU   0                                                        00673000
BLSDAPDR EQU   0                                                        00674000
DVT      EQU   0                                                        00675000
DVTDEQPP EQU   DVT+8                                                    00676000
DVTENQPP EQU   DVT+12                                                   00677000
DVTAUTHP EQU   DVT+20                                                   00678000
DVTLPCLP EQU   DVT+24                                                   00679000
DVTBP00P EQU   DVT+28                                                   00680000
DVTCN00P EQU   DVT+32                                                   00681000
DVTDF00P EQU   DVT+36                                                   00682000
DVTDS00P EQU   DVT+44                                                   00683000
DVTFL00P EQU   DVT+48                                                   00684000
DVTFP00P EQU   DVT+52                                                   00685000
DVTGD00P EQU   DVT+56                                                   00686000
DVTGG00P EQU   DVT+60                                                   00687000
DVTGP00P EQU   DVT+64                                                   00688000
DVTND00P EQU   DVT+68                                                   00689000
DVTND01P EQU   DVT+72                                                   00690000
DVTOD00P EQU   DVT+76                                                   00691000
DVTPS00P EQU   DVT+80                                                   00692000
DVTSD00P EQU   DVT+84                                                   00693000
DVTSL00P EQU   DVT+88                                                   00694000
DVTTL00P EQU   DVT+92                                                   00695000
DVTUD00P EQU   DVT+96                                                   00696000
DVTUP00P EQU   DVT+100                                                  00697000
DVTLP00P EQU   DVT+104                                                  00698000
DVTLALLP EQU   DVT+108                                                  00699000
DVTLPFMP EQU   DVT+112                                                  00700000
DVTCLOSP EQU   DVT+116                                                  00701000
DVTOPENP EQU   DVT+120                                                  00702000
DVTPERAP EQU   DVT+124                                                  00703000
DVTDALLP EQU   DVT+128                                                  00704000
BLSRDUCK EQU   0                                                        00705000
RVT      EQU   0                                                        00706000
RVTADDRP EQU   RVT                                                      00707000
RVTT01P  EQU   RVT+4                                                    00708000
RVTTAP   EQU   RVT+8                                                    00709000
RVTTBP   EQU   RVT+12                                                   00710000
RVTTCP   EQU   RVT+16                                                   00711000
RVTTFP   EQU   RVT+24                                                   00712000
RVTTYP   EQU   RVT+40                                                   00713000
RVTT02P  EQU   RVT+48                                                   00714000
RVTT03P  EQU   RVT+52                                                   00715000
RVTT04P  EQU   RVT+56                                                   00716000
RVTACCLP EQU   RVT+60                                                   00717000
RVTRACCP EQU   RVT+64                                                   00718000
RVTTLP   EQU   RVT+68                                                   00719000
RVTTMP   EQU   RVT+72                                                   00720000
RVTTUP   EQU   RVT+80                                                   00721000
RVTESGEP EQU   RVT+84                                                   00722000
RVTESGUP EQU   RVT+88                                                   00723000
RVTESARP EQU   RVT+92                                                   00724000
RVTRAARP EQU   RVT+96                                                   00725000
RVTRAGEP EQU   RVT+100                                                  00726000
RVTADDPP EQU   RVT+104                                                  00727000
RVTACCQP EQU   RVT+108                                                  00728000
RVTSAGUP EQU   RVT+124                                                  00729000
RVTSAGEP EQU   RVT+128                                                  00730000
RVTESCKP EQU   RVT+132                                                  00731000
RVTMSGAP EQU   RVT+136                                                  00732000
RVTMSGDP EQU   RVT+140                                                  00733000
RVTADDTP EQU   RVT+160                                                  00734000
RVTADDUP EQU   RVT+164                                                  00735000
RVTADD1P EQU   RVT+176                                                  00736000
RVTADD2P EQU   RVT+180                                                  00737000
RVTRSAGP EQU   RVT+184                                                  00738000
RVTMSGBP EQU   RVT+188                                                  00739000
RVTADDSP EQU   RVT+192                                                  00740000
RVTADD3P EQU   RVT+196                                                  00741000
RVTT05P  EQU   RVT+200                                                  00742000
RVTPADSP EQU   RVT+204                                                  00743000
RVTTRP   EQU   RVT+228                                                  00744000
RVTADD4P EQU   RVT+232                                                  00745000
RVTSAPCP EQU   RVT+236                                                  00746000
RVTSAARP EQU   RVT+240                                                  00747000
RVTSAGNP EQU   RVT+244                                                  00748000
RVTT06P  EQU   RVT+248                                                  00749000
RVTSAGCP EQU   RVT+252                                                  00750000
RVTSAGQP EQU   RVT+256                                                  00751000
RVTESGCP EQU   RVT+260                                                  00752000
RVTESGQP EQU   RVT+264                                                  00753000
RVTDUCKP EQU   RVT+276                                                  00754000
RVTDUCCP EQU   RVT+280                                                  00755000
STB      EQU   0                                                        00756000
STBDIM   EQU   STB+8                                                    00757000
STBS     EQU   STB+12                                                   00758000
STBST    EQU   STBS                                                     00759000
STBSF    EQU   STBS+1                                                   00760000
STBSFINV EQU   STBSF                                                    00761000
STBSFPDR EQU   STBSF                                                    00762000
STBSFDSD EQU   STBSF                                                    00763000
STBSFDU  EQU   STBSF                                                    00764000
STBSN    EQU   STBS+3                                                   00765000
STBSEP   EQU   STBS+12                                                  00766000
CSOACN   EQU   0                                                        00767000
BLSCALOC EQU   0                                                        00768000
BLSDDEQP EQU   0                                                        00769000
BLSDENQP EQU   0                                                        00770000
BLSDENQ0 EQU   0                                                        00771000
BLSDFDSD EQU   0                                                        00772000
BLSDFPDR EQU   0                                                        00773000
BLSDMSGS EQU   0                                                        00774000
BLSDMSG0 EQU   0                                                        00775000
BLSEAUTH EQU   0                                                        00776000
BLSELPCL EQU   0                                                        00777000
BLSELPFM EQU   0                                                        00778000
BLSFBP00 EQU   0                                                        00779000
BLSFCLOS EQU   0                                                        00780000
BLSFCN00 EQU   0                                                        00781000
BLSFDALL EQU   0                                                        00782000
BLSFDF00 EQU   0                                                        00783000
BLSFDS00 EQU   0                                                        00784000
BLSFFL00 EQU   0                                                        00785000
BLSFFP00 EQU   0                                                        00786000
BLSFGD00 EQU   0                                                        00787000
BLSFGG00 EQU   0                                                        00788000
BLSFGP00 EQU   0                                                        00789000
BLSFLALL EQU   0                                                        00790000
BLSFLP00 EQU   0                                                        00791000
BLSFND00 EQU   0                                                        00792000
BLSFND01 EQU   0                                                        00793000
BLSFOD00 EQU   0                                                        00794000
BLSFOPEN EQU   0                                                        00795000
BLSFPERA EQU   0                                                        00796000
BLSFPS00 EQU   0                                                        00797000
BLSFSD00 EQU   0                                                        00798000
BLSFSL00 EQU   0                                                        00799000
BLSFTL00 EQU   0                                                        00800000
BLSFUD00 EQU   0                                                        00801000
BLSFUP00 EQU   0                                                        00802000
BLSRACC  EQU   0                                                        00803000
BLSRACCL EQU   0                                                        00804000
BLSRACCQ EQU   0                                                        00805000
BLSRADDP EQU   0                                                        00806000
BLSRADDR EQU   0                                                        00807000
BLSRADDS EQU   0                                                        00808000
BLSRADDT EQU   0                                                        00809000
BLSRADDU EQU   0                                                        00810000
BLSRADD1 EQU   0                                                        00811000
BLSRADD2 EQU   0                                                        00812000
BLSRADD3 EQU   0                                                        00813000
BLSRADD4 EQU   0                                                        00814000
BLSRDUCC EQU   0                                                        00815000
BLSRESAR EQU   0                                                        00816000
BLSRESCK EQU   0                                                        00817000
BLSRESGC EQU   0                                                        00818000
BLSRESGE EQU   0                                                        00819000
BLSRESGQ EQU   0                                                        00820000
BLSRESGU EQU   0                                                        00821000
BLSRMSGA EQU   0                                                        00822000
BLSRMSGB EQU   0                                                        00823000
BLSRMSGD EQU   0                                                        00824000
BLSRPADS EQU   0                                                        00825000
BLSRRAAR EQU   0                                                        00826000
BLSRRAGE EQU   0                                                        00827000
BLSRSAAR EQU   0                                                        00828000
BLSRSAG  EQU   0                                                        00829000
BLSRSAGC EQU   0                                                        00830000
BLSRSAGE EQU   0                                                        00831000
BLSRSAGN EQU   0                                                        00832000
BLSRSAGQ EQU   0                                                        00833000
BLSRSAGU EQU   0                                                        00834000
BLSRSAPC EQU   0                                                        00835000
BLSTA    EQU   0                                                        00836000
BLSTB    EQU   0                                                        00837000
BLSTC    EQU   0                                                        00838000
BLSTF    EQU   0                                                        00839000
BLSTL    EQU   0                                                        00840000
BLSTM    EQU   0                                                        00841000
BLSTR    EQU   0                                                        00842000
BLSTU    EQU   0                                                        00843000
BLSTY    EQU   0                                                        00844000
BLST01   EQU   0                                                        00845000
BLST02   EQU   0                                                        00846000
BLST03   EQU   0                                                        00847000
BLST04   EQU   0                                                        00848000
BLST05   EQU   0                                                        00849000
BLST06   EQU   0                                                        00850000
BLSUALLO EQU   0                                                        00851000
BLSUBLDD EQU   0                                                        00852000
BLSUBLDL EQU   0                                                        00853000
BLSUDYNA EQU   0                                                        00854000
BLSUFREE EQU   0                                                        00855000
BLSUFRE1 EQU   0                                                        00856000
BLSUMON  EQU   0                                                        00857000
BLSUMONA EQU   0                                                        00858000
BLSUMON2 EQU   0                                                        00859000
BLSUMPKN EQU   0                                                        00860000
BLSUMPK1 EQU   0                                                        00861000
BLSUPARI EQU   0                                                        00862000
BLSUPARU EQU   0                                                        00863000
BLSUPGMC EQU   0                                                        00864000
BLSUPGMD EQU   0                                                        00865000
BLSUPGML EQU   0                                                        00866000
BLSUPGMR EQU   0                                                        00867000
BLSUPRTA EQU   0                                                        00868000
BLSUPRTN EQU   0                                                        00869000
BLSUPRTT EQU   0                                                        00870000
BLSUPUTA EQU   0                                                        00871000
BLSUPUTC EQU   0                                                        00872000
BLSUPUTD EQU   0                                                        00873000
BLSUPUTL EQU   0                                                        00874000
BLSUPUTN EQU   0                                                        00875000
BLSUPUTO EQU   0                                                        00876000
BLSUPUTT EQU   0                                                        00877000
BLSUPUTV EQU   0                                                        00878000
BLSUSTAI EQU   0                                                        00879000
BLSUTRMA EQU   0                                                        00880000
BLSUTRMN EQU   0                                                        00881000
BLSUTRMO EQU   0                                                        00882000
BLSUVSAR EQU   0                                                        00883000
BLSUVSCR EQU   0                                                        00884000
BLSUVSEN EQU   0                                                        00885000
BLSUVSER EQU   0                                                        00886000
BLSUVSGE EQU   0                                                        00887000
BLSUVSGU EQU   0                                                        00888000
BLSUVSMR EQU   0                                                        00889000
BLSUVSPO EQU   0                                                        00890000
BLSUVSPU EQU   0                                                        00891000
BLSUZZ2C EQU   0                                                        00892000
BLSUZZ2D EQU   0                                                        00893000
IKJEFF02 EQU   0                                                        00894000
IKJEFF18 EQU   0                                                        00895000
IKJEFF19 EQU   0                                                        00896000
IKJGETL  EQU   0                                                        00897000
IKJPARS  EQU   0                                                        00898000
IKJPTGT  EQU   0                                                        00899000
IKJPUTL  EQU   0                                                        00900000
IKJSCAN  EQU   0                                                        00901000
IKJSTCK  EQU   0                                                        00902000
I001C    EQU   0                                                        00903000
I008P    EQU   0                                                        00904000
I015F    EQU   0                                                        00905000
I015P    EQU   0                                                        00906000
I031F    EQU   0                                                        00907000
I031P    EQU   0                                                        00908000
I256C    EQU   0                                                        00909000
PZ2      EQU   0                                                        00910000
CSOA     EQU   0                                                        00911000
CSOACNM  EQU   CSOA                                                     00912000
CSOALNM  EQU   CSOA+4                                                   00913000
CSOAFLG  EQU   CSOA+6                                                   00914000
CSOAVWP  EQU   CSOAFLG                                                  00915000
CSOAEXEC EQU   CSOAFLG                                                  00916000
CPPL     EQU   ZZ2CPPL                                                  00917000
CPPLUPT  EQU   CPPL+4                                                   00918000
CPPLPSCB EQU   CPPL+8                                                   00919000
CPPLECT  EQU   CPPL+12                                                  00920000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00921000
CPPLCBUF EQU   CPPL                                                     00922000
@NM00071 EQU   CSOA+7                                                   00923000
@NM00070 EQU   CSOAFLG                                                  00924000
@NM00069 EQU   CSOAFLG                                                  00925000
CSOABAD  EQU   CSOAFLG                                                  00926000
CSOANOC  EQU   CSOAFLG                                                  00927000
CSOAQM   EQU   CSOAFLG                                                  00928000
CSOAVNP  EQU   CSOAFLG                                                  00929000
STBSNT   EQU   STBSN+1                                                  00930000
STBSNL   EQU   STBSN                                                    00931000
@NM00072 EQU   STBSF                                                    00932000
STBID    EQU   STB                                                      00933000
RVT99999 EQU   RVT+384                                                  00934000
RVT0096P EQU   RVT+380                                                  00935000
RVT0095P EQU   RVT+376                                                  00936000
RVT0094P EQU   RVT+372                                                  00937000
RVT0093P EQU   RVT+368                                                  00938000
RVT0092P EQU   RVT+364                                                  00939000
RVT0091P EQU   RVT+360                                                  00940000
RVT0090P EQU   RVT+356                                                  00941000
RVT0089P EQU   RVT+352                                                  00942000
RVT0088P EQU   RVT+348                                                  00943000
RVT0087P EQU   RVT+344                                                  00944000
RVT0086P EQU   RVT+340                                                  00945000
RVT0085P EQU   RVT+336                                                  00946000
RVT0084P EQU   RVT+332                                                  00947000
RVT0083P EQU   RVT+328                                                  00948000
RVT0082P EQU   RVT+324                                                  00949000
RVT0081P EQU   RVT+320                                                  00950000
RVT0080P EQU   RVT+316                                                  00951000
RVT0079P EQU   RVT+312                                                  00952000
RVT0078P EQU   RVT+308                                                  00953000
RVT0077P EQU   RVT+304                                                  00954000
RVT0076P EQU   RVT+300                                                  00955000
RVT0075P EQU   RVT+296                                                  00956000
RVT0074P EQU   RVT+292                                                  00957000
RVT0073P EQU   RVT+288                                                  00958000
RVT0072P EQU   RVT+284                                                  00959000
RVTDTUTP EQU   RVT+272                                                  00960000
RVTDTMTP EQU   RVT+268                                                  00961000
RVT0057P EQU   RVT+224                                                  00962000
RVT0056P EQU   RVT+220                                                  00963000
RVT0055P EQU   RVT+216                                                  00964000
RVT0054P EQU   RVT+212                                                  00965000
RVT0053P EQU   RVT+208                                                  00966000
RVT0044P EQU   RVT+172                                                  00967000
RVT0043P EQU   RVT+168                                                  00968000
RVT0040P EQU   RVT+156                                                  00969000
RVT0039P EQU   RVT+152                                                  00970000
RVT0038P EQU   RVT+148                                                  00971000
RVT0037P EQU   RVT+144                                                  00972000
RVT0031P EQU   RVT+120                                                  00973000
RVT0030P EQU   RVT+116                                                  00974000
RVT0029P EQU   RVT+112                                                  00975000
RVT0020P EQU   RVT+76                                                   00976000
RVT0012P EQU   RVT+44                                                   00977000
RVT0010P EQU   RVT+36                                                   00978000
RVT0009P EQU   RVT+32                                                   00979000
RVT0008P EQU   RVT+28                                                   00980000
RVT0006P EQU   RVT+20                                                   00981000
DVT99999 EQU   DVT+256                                                  00982000
DVT0064P EQU   DVT+252                                                  00983000
DVT0063P EQU   DVT+248                                                  00984000
DVT0062P EQU   DVT+244                                                  00985000
DVT0061P EQU   DVT+240                                                  00986000
DVT0060P EQU   DVT+236                                                  00987000
DVT0059P EQU   DVT+232                                                  00988000
DVT0058P EQU   DVT+228                                                  00989000
DVT0057P EQU   DVT+224                                                  00990000
DVT0056P EQU   DVT+220                                                  00991000
DVT0055P EQU   DVT+216                                                  00992000
DVT0054P EQU   DVT+212                                                  00993000
DVT0053P EQU   DVT+208                                                  00994000
DVT0052P EQU   DVT+204                                                  00995000
DVT0051P EQU   DVT+200                                                  00996000
DVT0050P EQU   DVT+196                                                  00997000
DVT0049P EQU   DVT+192                                                  00998000
DVT0048P EQU   DVT+188                                                  00999000
DVT0047P EQU   DVT+184                                                  01000000
DVT0046P EQU   DVT+180                                                  01001000
DVT0045P EQU   DVT+176                                                  01002000
DVT0044P EQU   DVT+172                                                  01003000
DVT0043P EQU   DVT+168                                                  01004000
DVT0042P EQU   DVT+164                                                  01005000
DVT0041P EQU   DVT+160                                                  01006000
DVT0040P EQU   DVT+156                                                  01007000
DVT0039P EQU   DVT+152                                                  01008000
DVT0038P EQU   DVT+148                                                  01009000
DVT0037P EQU   DVT+144                                                  01010000
DVT0036P EQU   DVT+140                                                  01011000
DVT0035P EQU   DVT+136                                                  01012000
DVT0034P EQU   DVT+132                                                  01013000
DVT0011P EQU   DVT+40                                                   01014000
DVT0005P EQU   DVT+16                                                   01015000
DVT0002P EQU   DVT+4                                                    01016000
DVT0001P EQU   DVT                                                      01017000
BVT99999 EQU   BVT+256                                                  01018000
BVT0064P EQU   BVT+252                                                  01019000
BVT0063P EQU   BVT+248                                                  01020000
BVT0062P EQU   BVT+244                                                  01021000
BVT0061P EQU   BVT+240                                                  01022000
BVT0060P EQU   BVT+236                                                  01023000
BVT0059P EQU   BVT+232                                                  01024000
BVT0057P EQU   BVT+224                                                  01025000
BVT0056P EQU   BVT+220                                                  01026000
BVT0045P EQU   BVT+176                                                  01027000
BVT0044P EQU   BVT+172                                                  01028000
BVT0033P EQU   BVT+128                                                  01029000
BVT0032P EQU   BVT+124                                                  01030000
BVT0031P EQU   BVT+120                                                  01031000
BVT0030P EQU   BVT+116                                                  01032000
BVT0029P EQU   BVT+112                                                  01033000
BVTMONLP EQU   BVT+108                                                  01034000
BVT0026P EQU   BVT+100                                                  01035000
BVT0025P EQU   BVT+96                                                   01036000
BVT0024P EQU   BVT+92                                                   01037000
BVT0023P EQU   BVT+88                                                   01038000
BVT0016P EQU   BVT+60                                                   01039000
BVT0015P EQU   BVT+56                                                   01040000
BVT0014P EQU   BVT+52                                                   01041000
BVT0003P EQU   BVT+8                                                    01042000
BVT0001P EQU   BVT                                                      01043000
SA99     EQU   SA+72                                                    01044000
SARC     EQU   SAR+56                                                   01045000
SARB     EQU   SAR+52                                                   01046000
SARA     EQU   SAR+48                                                   01047000
SAR9     EQU   SAR+44                                                   01048000
SAR8     EQU   SAR+40                                                   01049000
SAR7     EQU   SAR+36                                                   01050000
SAR6     EQU   SAR+32                                                   01051000
SAR5     EQU   SAR+28                                                   01052000
SAR4     EQU   SAR+24                                                   01053000
SAR3     EQU   SAR+20                                                   01054000
SAR2     EQU   SAR+16                                                   01055000
SAR0     EQU   SAR+8                                                    01056000
SARF     EQU   SAR+4                                                    01057000
SARE     EQU   SAR                                                      01058000
SAFWD    EQU   SA+8                                                     01059000
SABAK    EQU   SA+4                                                     01060000
SA1L     EQU   SA1+1                                                    01061000
SA1P     EQU   SA1                                                      01062000
UPTPREFL EQU   UPT+23                                                   01063000
UPTPREFX EQU   UPT+16                                                   01064000
@NM00068 EQU   UPT+15                                                   01065000
UPTLDEL  EQU   UPT+14                                                   01066000
UPTCDEL  EQU   UPT+13                                                   01067000
UPTWTP   EQU   UPTSWS                                                   01068000
UPTMODE  EQU   UPTSWS                                                   01069000
UPTALD   EQU   UPTSWS                                                   01070000
UPTPAUS  EQU   UPTSWS                                                   01071000
UPTNCOM  EQU   UPTSWS                                                   01072000
UPTMID   EQU   UPTSWS                                                   01073000
UPTNPRM  EQU   UPTSWS                                                   01074000
UPTRCVR  EQU   UPTSWS                                                   01075000
UPTUSER  EQU   UPT+2                                                    01076000
@NM00067 EQU   UPT                                                      01077000
@NM00066 EQU   ECT+52                                                   01078000
@NM00065 EQU   ECT+48                                                   01079000
@NM00064 EQU   ECT+44                                                   01080000
@NM00063 EQU   ECTSWS2+1                                                01081000
@NM00062 EQU   ECTSWS21                                                 01082000
ECTTABND EQU   ECTSWS21                                                 01083000
ECTDEFCS EQU   ECTSWS21                                                 01084000
ECTBKPB  EQU   ECT+36                                                   01085000
ECTUSER  EQU   ECT+32                                                   01086000
ECTDDNUM EQU   ECT+29                                                   01087000
ECTATTN  EQU   ECTSWS                                                   01088000
ECTBKGRD EQU   ECTSWS                                                   01089000
ECTNNOT  EQU   ECTSWS                                                   01090000
ECTNMAL  EQU   ECTSWS                                                   01091000
ECTLOGF  EQU   ECTSWS                                                   01092000
ECTATRM  EQU   ECTSWS                                                   01093000
@NM00061 EQU   ECTSWS                                                   01094000
ECTSMSG  EQU   ECT+9                                                    01095000
ECTMSGF  EQU   ECT+8                                                    01096000
ECTIOWA  EQU   ECT+4                                                    01097000
PSCBU    EQU   PSCB+64                                                  01098000
PSCBRSZ  EQU   PSCB+60                                                  01099000
PSCBLINE EQU   PSCB+59                                                  01100000
PSCBCHAR EQU   PSCB+58                                                  01101000
PSCBUPTL EQU   PSCB+56                                                  01102000
PSCBUPT  EQU   PSCB+52                                                  01103000
PSCBRLGB EQU   PSCB+48                                                  01104000
PSCBDEST EQU   PSCB+40                                                  01105000
@NM00060 EQU   PSCB+36                                                  01106000
@NM00059 EQU   PSCB+32                                                  01107000
@NM00058 EQU   PSCB+28                                                  01108000
PSCBLTI2 EQU   PSCB+24                                                  01109000
PSCBLTIM EQU   PSCB+20                                                  01110000
PSCBATR2 EQU   PSCB+18                                                  01111000
@NM00057 EQU   PSCBATR1                                                 01112000
@NM00056 EQU   PSCBATR1                                                 01113000
@NM00055 EQU   PSCBATR1                                                 01114000
PSCBATTN EQU   PSCBATR1                                                 01115000
PSCBVMNT EQU   PSCBATR1                                                 01116000
PSCBJCL  EQU   PSCBATR1                                                 01117000
PSCBACCT EQU   PSCBATR1                                                 01118000
PSCBCTRL EQU   PSCBATR1                                                 01119000
PSCBGPNM EQU   PSCB+8                                                   01120000
PSCBUSRL EQU   PSCB+7                                                   01121000
PSCBUSER EQU   PSCB                                                     01122000
CMDT1    EQU   CMDT                                                     01123000
CMDO     EQU   CMD+2                                                    01124000
CMDL     EQU   CMD                                                      01125000
ZZ299999 EQU   ZZ2+8192                                                 01126000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  01127000
ZZ2AXOL  EQU   ZZ2AXO                                                   01128000
@NM00054 EQU   ZZ2+7288                                                 01129000
@NM00053 EQU   ZZ2AMDX+4                                                01130000
ZZ2AMDXC EQU   ZZ2AMDX                                                  01131000
ZZ2HSD   EQU   ZZ2+3056                                                 01132000
@NM00052 EQU   ZZ2ES                                                    01133000
@NM00051 EQU   ZZ2+2868                                                 01134000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                01135000
@NM00050 EQU   ZZ2ITSE                                                  01136000
ZZ2ITSEP EQU   ZZ2ITSE                                                  01137000
ZZ2ITSEW EQU   ZZ2ITSE                                                  01138000
@NM00049 EQU   ZZ2ITR+20                                                01139000
ZZ2ITREC EQU   ZZ2ITRE+1                                                01140000
@NM00048 EQU   ZZ2ITRE                                                  01141000
ZZ2ITREP EQU   ZZ2ITRE                                                  01142000
ZZ2ITREW EQU   ZZ2ITRE                                                  01143000
@NM00047 EQU   ZZ2ITR+9                                                 01144000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 01145000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 01146000
ZZ2ITRPP EQU   ZZ2ITR                                                   01147000
@NM00046 EQU   ZZ2+1544                                                 01148000
ZZ2PGM   EQU   ZZ2+1536                                                 01149000
@NM00045 EQU   ZZ2+1526                                                 01150000
ZZ2CW    EQU   ZZ2+1524                                                 01151000
@NM00044 EQU   ZZ2+1504                                                 01152000
@NM00043 EQU   ZZ2+1352                                                 01153000
ZZ2FFSYP EQU   ZZ2+1348                                                 01154000
ZZ2SASYP EQU   ZZ2+1344                                                 01155000
ZZ2RDSYP EQU   ZZ2+1340                                                 01156000
ZZ2RASYP EQU   ZZ2+1336                                                 01157000
ZZ2PHSYP EQU   ZZ2+1332                                                 01158000
ZZ2ESSYP EQU   ZZ2+1328                                                 01159000
ZZ200SYP EQU   ZZ2+1324                                                 01160000
ZZ2SCWP  EQU   ZZ2+1320                                                 01161000
ZZ2TTLP  EQU   ZZ2+1316                                                 01162000
ZZ2LOADP EQU   ZZ2+1312                                                 01163000
ZZ2VRESP EQU   ZZ2+1308                                                 01164000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               01165000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                01166000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                01167000
ZZ2VRSAP EQU   ZZ2+1288                                                 01168000
@NM00042 EQU   ZZ2+1272                                                 01169000
@NM00041 EQU   ZZ2+1268                                                 01170000
ZZ2RPLP  EQU   ZZ2+1260                                                 01171000
ZZ2TCBP  EQU   ZZ2+1256                                                 01172000
@NM00040 EQU   ZZ2+1252                                                 01173000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 01174000
@NM00039 EQU   ZZ2+1112                                                 01175000
@NM00038 EQU   ZZ2+1080                                                 01176000
ZZ2FT25P EQU   ZZ2+1072                                                 01177000
@NM00037 EQU   ZZ2+976                                                  01178000
ZZ2TOD   EQU   ZZ2+968                                                  01179000
ZZ2STGN  EQU   ZZ2STG+4                                                 01180000
ZZ2STGP  EQU   ZZ2STG                                                   01181000
@NM00036 EQU   ZZ2+952                                                  01182000
ZZ2IDENT EQU   ZZ2+928                                                  01183000
ZZ2A9999 EQU   ZZ2A+656                                                 01184000
@NM00035 EQU   ZZ2A+224                                                 01185000
@NM00034 EQU   ZZ2A+220                                                 01186000
ZZ2AQD99 EQU   ZZ2AQD+60                                                01187000
@NM00033 EQU   ZZ2AQD+56                                                01188000
@NM00032 EQU   ZZ2AQDF                                                  01189000
ZZ2AQDFA EQU   ZZ2AQDF                                                  01190000
ZZ2AQDIL EQU   ZZ2AQD+48                                                01191000
ZZ2AQDIM EQU   ZZ2AQD+44                                                01192000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               01193000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               01194000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                01195000
@NM00031 EQU   ZZ2AQDT+1                                                01196000
ZZ2AQDTY EQU   ZZ2AQDT                                                  01197000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  01198000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 01199000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 01200000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 01201000
ZZ2AQDOF EQU   ZZ2AQD                                                   01202000
ZZ2AQD00 EQU   ZZ2AQD                                                   01203000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               01204000
@NM00030 EQU   ZZ2AQAS+12                                               01205000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                01206000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                01207000
@NM00029 EQU   ZZ2AQAS+2                                                01208000
ZZ2AQAST EQU   ZZ2AQAS                                                  01209000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  01210000
ZZ2AZZ6P EQU   ZZ2A+140                                                 01211000
ZZ2ADPTA EQU   ZZ2ADPT                                                  01212000
ZZ2ADPL  EQU   ZZ2ADP                                                   01213000
ZZ2ADMTA EQU   ZZ2ADMT                                                  01214000
ZZ2ADML  EQU   ZZ2ADM                                                   01215000
ZZ2ADDTA EQU   ZZ2ADDT                                                  01216000
ZZ2ADDL  EQU   ZZ2ADD                                                   01217000
@NM00028 EQU   ZZ2A+72                                                  01218000
ZZ2APIDB EQU   ZZ2APID+3                                                01219000
ZZ2APIDA EQU   ZZ2APID                                                  01220000
@NM00027 EQU   ZZ2A+24                                                  01221000
@NM00026 EQU   ZZ2AF+5                                                  01222000
ZZ2AFX   EQU   ZZ2AF+5                                                  01223000
@NM00025 EQU   ZZ2AF+3                                                  01224000
ZZ2AFS   EQU   ZZ2AF+2                                                  01225000
ZZ2AFD   EQU   ZZ2AF+2                                                  01226000
ZZ2AFQ   EQU   ZZ2AF+2                                                  01227000
ZZ2AF$   EQU   ZZ2AF+2                                                  01228000
@NM00024 EQU   ZZ2AF+2                                                  01229000
ZZ2AFM   EQU   ZZ2AF+2                                                  01230000
@NM00023 EQU   ZZ2AF+2                                                  01231000
@NM00022 EQU   ZZ2AF+1                                                  01232000
ZZ2AFV   EQU   ZZ2AF+1                                                  01233000
@NM00021 EQU   ZZ2AF+1                                                  01234000
ZZ2AFC   EQU   ZZ2AF+1                                                  01235000
@NM00020 EQU   ZZ2AF                                                    01236000
ZZ2AFFS  EQU   ZZ2AF                                                    01237000
ZZ2AFT   EQU   ZZ2AF                                                    01238000
ZZ2AFP   EQU   ZZ2AF                                                    01239000
@NM00019 EQU   ZZ2A+8                                                   01240000
ZZ2ALINE EQU   ZZ2A+4                                                   01241000
@NM00018 EQU   ZZ2A+3                                                   01242000
ZZ2ASE   EQU   ZZ2A+2                                                   01243000
ZZ2ACH   EQU   ZZ2A                                                     01244000
@NM00017 EQU   ZZ2+264                                                  01245000
@NM00016 EQU   ZZ2+263                                                  01246000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  01247000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 01248000
ZZ2PRTL  EQU   ZZ2PRT                                                   01249000
@NM00015 EQU   ZZ2AMD+56                                                01250000
ZZ2AMDXP EQU   ZZ2AMD+52                                                01251000
ZZ2AMDD  EQU   ZZ2AMD+48                                                01252000
ZZ2AMDL  EQU   ZZ2AMD+44                                                01253000
ZZ2AMDU  EQU   ZZ2AMD+28                                                01254000
ZZ2AMDF  EQU   ZZ2AMD+24                                                01255000
ZZ2AMDS  EQU   ZZ2AMD+20                                                01256000
ZZ2AMDC  EQU   ZZ2AMD+16                                                01257000
ZZ2AMDP  EQU   ZZ2AMD+12                                                01258000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 01259000
@NM00014 EQU   @NM00013                                                 01260000
ZZ2AMD2  EQU   @NM00013                                                 01261000
ZZ2AMD1  EQU   @NM00013                                                 01262000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 01263000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 01264000
ZZ2AMDT  EQU   ZZ2AMD                                                   01265000
ZZ199999 EQU   ZZ1+3072                                                 01266000
@NM00012 EQU   ZZ1+2160                                                 01267000
ZZ1TRTAS EQU   ZZ1+1904                                                 01268000
ZZ1TRUPC EQU   ZZ1+1648                                                 01269000
ZZ1TRCTX EQU   ZZ1+1392                                                 01270000
ZZ1NASID EQU   ZZ1N+274                                                 01271000
ZZ1NSTRL EQU   ZZ1N+272                                                 01272000
ZZ1NOFF  EQU   ZZ1N+268                                                 01273000
ZZ1NBDY  EQU   ZZ1N+264                                                 01274000
ZZ1NADE  EQU   ZZ1N+260                                                 01275000
ZZ1NADB  EQU   ZZ1N+256                                                 01276000
ZZ1NSTR  EQU   ZZ1N                                                     01277000
@NM00011 EQU   ZZ1+1080                                                 01278000
ZZ1TREBC EQU   ZZ1+824                                                  01279000
ZZ1TRHEX EQU   ZZ1+568                                                  01280000
@NM00010 EQU   ZZ1+377                                                  01281000
ZZ1USTAE EQU   ZZ1+376                                                  01282000
@NM00009 EQU   ZZ1F+1                                                   01283000
@NM00008 EQU   ZZ1F                                                     01284000
ZZ1FM    EQU   ZZ1F                                                     01285000
ZZ1FX    EQU   ZZ1F                                                     01286000
ZZ1FU    EQU   ZZ1F                                                     01287000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 01288000
@NM00007 EQU   ZZ1EVE                                                   01289000
ZZ1EVEP  EQU   ZZ1EVE                                                   01290000
ZZ1EVEW  EQU   ZZ1EVE                                                   01291000
ZZ1ACMP  EQU   ZZ1ATTN                                                  01292000
@NM00006 EQU   ZZ1+144                                                  01293000
ZZ1FPP   EQU   ZZ1+140                                                  01294000
ZZ1ZZ6P  EQU   ZZ1+136                                                  01295000
@NM00005 EQU   ZZ1+84                                                   01296000
ZZ1PLINE EQU   ZZ1+80                                                   01297000
ZZ1PGSZ  EQU   ZZ1+76                                                   01298000
ZZ1PCNT  EQU   ZZ1+72                                                   01299000
@NM00004 EQU   ZZ1+68                                                   01300000
ZZ1TPAGE EQU   ZZ1+64                                                   01301000
ZZ1TLINE EQU   ZZ1+60                                                   01302000
@NM00003 EQU   ZZ1+48                                                   01303000
ZZ1DSDP  EQU   ZZ1+44                                                   01304000
ZZ1PDRP  EQU   ZZ1+40                                                   01305000
ZZ1327WP EQU   ZZ1+32                                                   01306000
ZZ1ACBP  EQU   ZZ1+28                                                   01307000
@NM00002 EQU   ZZ1+24                                                   01308000
ZZ1PDCBP EQU   ZZ1+20                                                   01309000
ZZ1BLRBL EQU   ZZ1+16                                                   01310000
@NM00001 EQU   ZZ1+12                                                   01311000
ZZ1PNULL EQU   ZZ1+8                                                    01312000
ZZ1NULL  EQU   ZZ1+4                                                    01313000
ZZ1IDE   EQU   ZZ1                                                      01314000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01315000
@ENDDATA EQU   *                                                        01316000
         END   BLSUMONL,(C'PLS2143',0701,78060)                         01317000
