TRMV     TITLE 'BLSUTRMV--TRANSMIT VAR LEN (MSGID) MESSAGE TO TERMINAL *00001000
                        '                                               00002000
*/* CHANGE ACTIVITY -------------------------------------------------*/ 00003000
*/*   THIS MODULE WAS WRITTEN FOR @G57LPKB                           */ 00004000
*/*------------------------------------------------------------------*/ 00005000
BLSUTRMV CSECT ,                                                01S0002 00006000
@MAINENT DS    0H                                               01S0002 00007000
         USING *,@15                                            01S0002 00008000
         B     @PROLOG                                          01S0002 00009000
         DC    AL1(16)                                          01S0002 00010000
         DC    C'BLSUTRMV  78.060'                              01S0002 00011000
         DROP  @15                                                      00012000
@PROLOG  STM   @14,@12,12(@13)                                  01S0002 00013000
         BALR  @12,0                                            01S0002 00014000
@PSTART  DS    0H                                               01S0002 00015000
         USING @PSTART,@12                                      01S0002 00016000
         L     @00,@SIZDATD                                     01S0002 00017000
         BLSUALLS R,LV=(0)                                              00018000
         LR    @11,@01                                          01S0002 00019000
         USING @DATD,@11                                        01S0002 00020000
         ST    @13,@SA00001+4                                   01S0002 00021000
         LM    @00,@01,20(@13)                                  01S0002 00022000
         ST    @11,8(,@13)                                      01S0002 00023000
         LR    @13,@11                                          01S0002 00024000
         MVC   @PC00001(8),0(@01)                               01S0002 00025000
*   RETC=ZZZFLAGI;                  /* ANTICIPATE NORMAL COMPLETION  */ 00026000
         SLR   RETC,RETC                                        01S0119 00027000
*   IF                              /* PROCESSING SHOULD CONTINUE    */ 00028000
*       ZZ2AFFS='0'B&               /* NOT IN FULL SCREEN MODE       */ 00029000
*       ZZ1EVEP='0'B                /* NO TERMINATION PENDING        */ 00030000
*     THEN                                                      01S0120 00031000
*                                                               01S0120 00032000
         TM    ZZ2AFFS(R9),B'00100000'                          01S0120 00033000
         BNZ   @RF00120                                         01S0120 00034000
         L     @14,ZZ2ZZ1P(,R9)                                 01S0120 00035000
         TM    ZZ1EVEP(@14),B'01000000'                         01S0120 00036000
         BNZ   @RF00120                                         01S0120 00037000
*     /***************************************************************/ 00038000
*     /*                                                             */ 00039000
*     /* NO TERMINATION REQUEST PENDING, NOT IN FULL SCREEN MODE     */ 00040000
*     /*                                                             */ 00041000
*     /***************************************************************/ 00042000
*                                                               01S0121 00043000
*     DO;                           /* TRANSMIT MESSAGE              */ 00044000
*       GENERATE SETS(PTPB) CODE(MVC   ADATA(SDATAEND-SDATA),SDATA);    00045000
         MVC   ADATA(SDATAEND-SDATA),SDATA                              00046000
*       PTPBOPUT=ADDR(OLD);         /* ->OUTPUT LINE DESCRIPTOR      */ 00047000
         LA    @14,OLD                                          01S0123 00048000
         ST    @14,PTPBOPUT                                     01S0123 00049000
*       OLDN=1;                     /* INITIALIZE OLD                */ 00050000
         MVC   OLDN(4),@CF00048                                 01S0124 00051000
*       OLDP(1)=ADDR(MSGP);         /* ->MSGP                        */ 00052000
         L     @14,@PC00001+4                                   01S0125 00053000
         ST    @14,OLDP                                         01S0125 00054000
*       CALL IKJPUTL(UPT,ECT,ZZ1EVE,PTPB);/* TRANSMIT MSGP           */ 00055000
         L     @14,CPPLUPT(,R9)                                 01S0126 00056000
         ST    @14,@AL00001                                     01S0126 00057000
         L     @14,CPPLECT(,R9)                                 01S0126 00058000
         ST    @14,@AL00001+4                                   01S0126 00059000
         L     @14,ZZ2ZZ1P(,R9)                                 01S0126 00060000
         LA    @14,ZZ1EVE(,@14)                                 01S0126 00061000
         ST    @14,@AL00001+8                                   01S0126 00062000
         LA    @14,PTPB                                         01S0126 00063000
         ST    @14,@AL00001+12                                  01S0126 00064000
         L     @15,ZZ2PUTLP(,R9)                                01S0126 00065000
         LA    @01,@AL00001                                     01S0126 00066000
         BALR  @14,@15                                          01S0126 00067000
*       IF RF>4 THEN                /* TRANSMIT FAILED               */ 00068000
         C     RF,@CF00045                                      01S0127 00069000
         BNH   @RF00127                                         01S0127 00070000
*         RETC=MAX(RETC,ZZZFLAGT);  /* TERMINATING CONDITION         */ 00071000
         LA    @14,16                                           01S0128 00072000
         CR    RETC,@14                                         01S0128 00073000
         BNL   *+6                                                      00074000
         LR    RETC,@14                                         01S0128 00075000
*     END;                          /* TRANSMIT FAILED               */ 00076000
*   ELSE                            /* PROCESSING DISCONTINUED       */ 00077000
*     RETC=ZZZFLAGS;                /* SERIOUS CONDITION             */ 00078000
         B     @RC00120                                         01S0130 00079000
@RF00120 LA    RETC,12                                          01S0130 00080000
*   RETURN CODE(RETC);              /* RETURN CODE                   */ 00081000
@RC00120 L     @13,4(,@13)                                      01S0131 00082000
         L     @00,@SIZDATD                                     01S0131 00083000
         LR    @01,@11                                          01S0131 00084000
         BLSUFRES R,LV=(0),A=(1)                                        00085000
         LR    @15,@03                                          01S0131 00086000
         L     @14,12(,@13)                                     01S0131 00087000
         LM    @00,@12,20(@13)                                  01S0131 00088000
         BR    @14                                              01S0131 00089000
*/*BLSUPEND--MVS IPCS MODULE                                         */ 00090000
*                                                               01S0132 00091000
*   DECLARE                         /* COMMON VARIABLES              */ 00092000
*     I256C CHAR(256) BASED,                                    01S0132 00093000
*     I031F FIXED(31) BASED,                                    01S0132 00094000
*     I031P PTR(31) BASED,                                      01S0132 00095000
*     I015F FIXED(15) BASED,                                    01S0132 00096000
*     I015P PTR(15) BASED,                                      01S0132 00097000
*     I008P PTR(8) BASED,                                       01S0132 00098000
*     I001C CHAR(1) BASED;                                      01S0132 00099000
*   GENERATE NODEFS NOREFS DATA;                                01S0133 00100000
*   END BLSUTRMV                    /* BLRPEND(BLSUTRMV)             */ 00101000
*                                                               01S0134 00102000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00103000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00104000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00105000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00106000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00107000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00108000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00109000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00110000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00111000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00112000
*/*%INCLUDE SYSLIB  (BLSDSERV)                                       */ 00113000
*/*%INCLUDE SYSLIB  (IKJPTPB )                                       */ 00114000
*                                                               01S0134 00115000
*       ;                                                       01S0134 00116000
@EL00001 L     @13,4(,@13)                                      01S0134 00117000
@EF00001 L     @00,@SIZDATD                                     01S0134 00118000
         LR    @01,@11                                          01S0134 00119000
         BLSUFRES R,LV=(0),A=(1)                                        00120000
@ER00001 LM    @14,@12,12(@13)                                  01S0134 00121000
         BR    @14                                              01S0134 00122000
@DATA    DS    0H                                                       00123000
@DATD    DSECT                                                          00124000
         DS    0F                                                       00125000
@SA00001 DS    18F                                                      00126000
@PC00001 DS    2F                                                       00127000
@AL00001 DS    4A                                                       00128000
BLSUTRMV CSECT                                                          00129000
         DS    0F                                                       00130000
@CF00048 DC    F'1'                                                     00131000
@CF00045 DC    F'4'                                                     00132000
@DATD    DSECT                                                          00133000
         DS    0D                                                       00134000
OLD      DS    CL8                                                      00135000
         ORG   OLD                                                      00136000
OLDN     DS    FL4                                                      00137000
OLDP     DS    1A                                                       00138000
         ORG   OLD+8                                                    00139000
BLSUTRMV CSECT                                                          00140000
         DS    0F                                                       00141000
@SIZDATD DC    AL1(0)                                                   00142000
         DC    AL3(@ENDDATD-@DATD)                                      00143000
         DS    0D                                                       00144000
@DATD    DSECT                                                          00145000
         SPACE 2                                                        00146000
*********************************************************************** 00147000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00148000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 00149000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 00150000
*********************************************************************** 00151000
         SPACE                                                          00152000
BLSUTRMV CSECT                                                          00153000
         ORG                                                            00154000
         DS    0D                                                       00155000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSUTRMV+19)/20+7)/8)CL8'BLSUTRMV'     00156000
@DATD    DSECT                                                          00157000
         DS    0H                                                       00158000
@DATD    DSECT                                                          00159000
BLSUTRMV CSECT                                                          00160000
***SDATA AND ADATA MUST HAVE THE SAME FORMAT                            00161000
SDATA    DS    0D                                                       00162000
SPTPB    PUTLINE OUTPUT=(0,TERM,SINGLE,INFOR),                         *00163000
               TERMPUT=(EDIT,WAIT,NOHOLD,NOBREAK),MF=L                  00164000
SDATAEND DS    0D                                                       00165000
@DATD    DSECT                                                          00166000
ADATA    DS    0D                                                       00167000
PTPB     PUTLINE OUTPUT=(0,TERM,SINGLE,INFOR),                         *00168000
               TERMPUT=(EDIT,WAIT,NOHOLD,NOBREAK),MF=L                  00169000
ADATAEND DS    0D                                                       00170000
@DATD    DSECT                                                          00171000
         SPACE 2                                                        00172000
*********************************************************************** 00173000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 00174000
*********************************************************************** 00175000
         SPACE                                                          00176000
         DS    0D                                                       00177000
@DATD    DSECT                                                          00178000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00179000
@ENDDATD EQU   *                                                        00180000
BLSUTRMV CSECT                                                          00181000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00182000
@01      EQU   01                                                       00183000
@02      EQU   02                                                       00184000
@03      EQU   03                                                       00185000
@04      EQU   04                                                       00186000
@05      EQU   05                                                       00187000
@06      EQU   06                                                       00188000
@07      EQU   07                                                       00189000
@08      EQU   08                                                       00190000
@09      EQU   09                                                       00191000
@10      EQU   10                                                       00192000
@11      EQU   11                                                       00193000
@12      EQU   12                                                       00194000
@13      EQU   13                                                       00195000
@14      EQU   14                                                       00196000
@15      EQU   15                                                       00197000
RETC     EQU   @03                                                      00198000
R9       EQU   @09                                                      00199000
R0       EQU   @00                                                      00200000
R1       EQU   @01                                                      00201000
R2       EQU   @02                                                      00202000
R3       EQU   @03                                                      00203000
R4       EQU   @04                                                      00204000
R5       EQU   @05                                                      00205000
RB       EQU   @11                                                      00206000
RD       EQU   @13                                                      00207000
RE       EQU   @14                                                      00208000
RF       EQU   @15                                                      00209000
RA       EQU   @10                                                      00210000
RC       EQU   @12                                                      00211000
R6       EQU   @06                                                      00212000
R7       EQU   @07                                                      00213000
R8       EQU   @08                                                      00214000
ZZ1      EQU   0                                                        00215000
ZZ1ATTN  EQU   ZZ1+360                                                  00216000
ZZ1EVE   EQU   ZZ1ATTN+4                                                00217000
ZZ1EVEP  EQU   ZZ1EVE                                                   00218000
ZZ1F     EQU   ZZ1+368                                                  00219000
ZZ1N     EQU   ZZ1+1116                                                 00220000
ZZ2      EQU   0                                                        00221000
ZZ2AMD   EQU   ZZ2                                                      00222000
@NM00013 EQU   ZZ2AMD+7                                                 00223000
ZZ2PRT   EQU   ZZ2+138                                                  00224000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 00225000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                00226000
ZZ2A     EQU   ZZ2+272                                                  00227000
ZZ2AF    EQU   ZZ2A+16                                                  00228000
ZZ2AFFS  EQU   ZZ2AF                                                    00229000
ZZ2APID  EQU   ZZ2A+64                                                  00230000
ZZ2AD    EQU   ZZ2A+74                                                  00231000
ZZ2ADD   EQU   ZZ2AD                                                    00232000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 00233000
ZZ2ADM   EQU   ZZ2AD+46                                                 00234000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 00235000
ZZ2ADP   EQU   ZZ2AD+56                                                 00236000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 00237000
ZZ2AQAS  EQU   ZZ2A+144                                                 00238000
ZZ2AQD   EQU   ZZ2A+160                                                 00239000
ZZ2AQDT  EQU   ZZ2AQD+10                                                00240000
ZZ2AQDF  EQU   ZZ2AQD+52                                                00241000
ZZ2STG   EQU   ZZ2+960                                                  00242000
ZZ2ALLOP EQU   ZZ2+992                                                  00243000
ZZ2FREEP EQU   ZZ2+996                                                  00244000
ZZ2FF19P EQU   ZZ2+1000                                                 00245000
ZZ2FRE1P EQU   ZZ2+1004                                                 00246000
ZZ2FF18P EQU   ZZ2+1008                                                 00247000
ZZ2DYNAP EQU   ZZ2+1012                                                 00248000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 00249000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 00250000
ZZ2STAIP EQU   ZZ2+1024                                                 00251000
ZZ2FF02P EQU   ZZ2+1028                                                 00252000
ZZ2GETLP EQU   ZZ2+1032                                                 00253000
ZZ2PARSP EQU   ZZ2+1036                                                 00254000
ZZ2PTGTP EQU   ZZ2+1040                                                 00255000
ZZ2PUTLP EQU   ZZ2+1044                                                 00256000
ZZ2SCANP EQU   ZZ2+1048                                                 00257000
ZZ2STCKP EQU   ZZ2+1052                                                 00258000
ZZ2ALOCP EQU   ZZ2+1056                                                 00259000
ZZ2MSGSP EQU   ZZ2+1060                                                 00260000
ZZ2TRMOP EQU   ZZ2+1064                                                 00261000
ZZ2MSG0P EQU   ZZ2+1076                                                 00262000
ZZ2PUTNP EQU   ZZ2+1084                                                 00263000
ZZ2TRMNP EQU   ZZ2+1088                                                 00264000
ZZ2ENQ0P EQU   ZZ2+1092                                                 00265000
ZZ2ADSDP EQU   ZZ2+1096                                                 00266000
ZZ2APDRP EQU   ZZ2+1100                                                 00267000
ZZ2FDSDP EQU   ZZ2+1104                                                 00268000
ZZ2FPDRP EQU   ZZ2+1108                                                 00269000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 00270000
ZZ2DVTP  EQU   ZZ2+1276                                                 00271000
ZZ2BVTP  EQU   ZZ2+1280                                                 00272000
ZZ2CPPL  EQU   ZZ2+1292                                                 00273000
ZZ2CPPLC EQU   ZZ2CPPL                                                  00274000
ZZ2ITR   EQU   ZZ2+2840                                                 00275000
ZZ2ITRE  EQU   ZZ2ITR+16                                                00276000
ZZ2ITSE  EQU   ZZ2+2864                                                 00277000
ZZ2ES    EQU   ZZ2+2872                                                 00278000
ZZ2AMDX  EQU   ZZ2+7160                                                 00279000
ZZ2AXO   EQU   ZZ2+7934                                                 00280000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 00281000
CMD      EQU   0                                                        00282000
CMDT     EQU   CMD+4                                                    00283000
PSCB     EQU   0                                                        00284000
PSCBATR1 EQU   PSCB+16                                                  00285000
ECT      EQU   0                                                        00286000
ECTSWS   EQU   ECT+28                                                   00287000
ECTSWS2  EQU   ECT+40                                                   00288000
ECTSWS21 EQU   ECTSWS2                                                  00289000
UPT      EQU   0                                                        00290000
UPTSWS   EQU   UPT+12                                                   00291000
SA       EQU   0                                                        00292000
SA1      EQU   SA                                                       00293000
SAR      EQU   SA+12                                                    00294000
SAR1     EQU   SAR+12                                                   00295000
IKJPUTL  EQU   0                                                        00296000
BVT      EQU   0                                                        00297000
BVTPUTLP EQU   BVT+4                                                    00298000
BVTPUTOP EQU   BVT+12                                                   00299000
BVTPUTTP EQU   BVT+16                                                   00300000
BVTPUTVP EQU   BVT+20                                                   00301000
BVTPUTAP EQU   BVT+24                                                   00302000
BVTPRTTP EQU   BVT+28                                                   00303000
BVTPRTAP EQU   BVT+32                                                   00304000
BVTPUTDP EQU   BVT+36                                                   00305000
BVTMONP  EQU   BVT+40                                                   00306000
BVTMON2P EQU   BVT+44                                                   00307000
BVTVSARP EQU   BVT+48                                                   00308000
BVTVSENP EQU   BVT+64                                                   00309000
BVTVSERP EQU   BVT+68                                                   00310000
BVTVSGEP EQU   BVT+72                                                   00311000
BVTVSGUP EQU   BVT+76                                                   00312000
BVTVSPOP EQU   BVT+80                                                   00313000
BVTVSPUP EQU   BVT+84                                                   00314000
BVTMPKNP EQU   BVT+104                                                  00315000
BVTMONLP EQU   BVT+108                                                  00316000
BVTPUTCP EQU   BVT+132                                                  00317000
BVTMPK1P EQU   BVT+136                                                  00318000
BVTZZ2RP EQU   BVT+140                                                  00319000
BVTPGMRP EQU   BVT+144                                                  00320000
BVTMONAP EQU   BVT+148                                                  00321000
BVTBLDDP EQU   BVT+152                                                  00322000
BVTBLDLP EQU   BVT+156                                                  00323000
BVTPGMCP EQU   BVT+160                                                  00324000
BVTPGMDP EQU   BVT+164                                                  00325000
BVTPGMLP EQU   BVT+168                                                  00326000
BVTMONCP EQU   BVT+180                                                  00327000
BVTMONDP EQU   BVT+184                                                  00328000
BVTMONTP EQU   BVT+188                                                  00329000
BVTPARIP EQU   BVT+192                                                  00330000
BVTPARUP EQU   BVT+196                                                  00331000
BVTPRTNP EQU   BVT+204                                                  00332000
BVTVSCRP EQU   BVT+208                                                  00333000
BVTVSMRP EQU   BVT+212                                                  00334000
BVTMONXP EQU   BVT+216                                                  00335000
BVTTRMAP EQU   BVT+228                                                  00336000
DVT      EQU   0                                                        00337000
DVTDEQPP EQU   DVT+8                                                    00338000
DVTENQPP EQU   DVT+12                                                   00339000
DVTAUTHP EQU   DVT+20                                                   00340000
DVTLPCLP EQU   DVT+24                                                   00341000
DVTBP00P EQU   DVT+28                                                   00342000
DVTCN00P EQU   DVT+32                                                   00343000
DVTDF00P EQU   DVT+36                                                   00344000
DVTDS00P EQU   DVT+44                                                   00345000
DVTFL00P EQU   DVT+48                                                   00346000
DVTFP00P EQU   DVT+52                                                   00347000
DVTGD00P EQU   DVT+56                                                   00348000
DVTGG00P EQU   DVT+60                                                   00349000
DVTGP00P EQU   DVT+64                                                   00350000
DVTND00P EQU   DVT+68                                                   00351000
DVTND01P EQU   DVT+72                                                   00352000
DVTOD00P EQU   DVT+76                                                   00353000
DVTPS00P EQU   DVT+80                                                   00354000
DVTSD00P EQU   DVT+84                                                   00355000
DVTSL00P EQU   DVT+88                                                   00356000
DVTTL00P EQU   DVT+92                                                   00357000
DVTUD00P EQU   DVT+96                                                   00358000
DVTUP00P EQU   DVT+100                                                  00359000
DVTLP00P EQU   DVT+104                                                  00360000
DVTLALLP EQU   DVT+108                                                  00361000
DVTLPFMP EQU   DVT+112                                                  00362000
DVTCLOSP EQU   DVT+116                                                  00363000
DVTOPENP EQU   DVT+120                                                  00364000
DVTPERAP EQU   DVT+124                                                  00365000
DVTDALLP EQU   DVT+128                                                  00366000
BLSCALOC EQU   0                                                        00367000
BLSDADSD EQU   0                                                        00368000
BLSDAPDR EQU   0                                                        00369000
BLSDDEQP EQU   0                                                        00370000
BLSDENQP EQU   0                                                        00371000
BLSDENQ0 EQU   0                                                        00372000
BLSDFDSD EQU   0                                                        00373000
BLSDFPDR EQU   0                                                        00374000
BLSDMSGS EQU   0                                                        00375000
BLSDMSG0 EQU   0                                                        00376000
BLSEAUTH EQU   0                                                        00377000
BLSELPCL EQU   0                                                        00378000
BLSELPFM EQU   0                                                        00379000
BLSFBP00 EQU   0                                                        00380000
BLSFCLOS EQU   0                                                        00381000
BLSFCN00 EQU   0                                                        00382000
BLSFDALL EQU   0                                                        00383000
BLSFDF00 EQU   0                                                        00384000
BLSFDS00 EQU   0                                                        00385000
BLSFFL00 EQU   0                                                        00386000
BLSFFP00 EQU   0                                                        00387000
BLSFGD00 EQU   0                                                        00388000
BLSFGG00 EQU   0                                                        00389000
BLSFGP00 EQU   0                                                        00390000
BLSFLALL EQU   0                                                        00391000
BLSFLP00 EQU   0                                                        00392000
BLSFND00 EQU   0                                                        00393000
BLSFND01 EQU   0                                                        00394000
BLSFOD00 EQU   0                                                        00395000
BLSFOPEN EQU   0                                                        00396000
BLSFPERA EQU   0                                                        00397000
BLSFPS00 EQU   0                                                        00398000
BLSFSD00 EQU   0                                                        00399000
BLSFSL00 EQU   0                                                        00400000
BLSFTL00 EQU   0                                                        00401000
BLSFUD00 EQU   0                                                        00402000
BLSFUP00 EQU   0                                                        00403000
BLSUALLO EQU   0                                                        00404000
BLSUBLDD EQU   0                                                        00405000
BLSUBLDL EQU   0                                                        00406000
BLSUDYNA EQU   0                                                        00407000
BLSUFREE EQU   0                                                        00408000
BLSUFRE1 EQU   0                                                        00409000
BLSUMON  EQU   0                                                        00410000
BLSUMONA EQU   0                                                        00411000
BLSUMONC EQU   0                                                        00412000
BLSUMOND EQU   0                                                        00413000
BLSUMONL EQU   0                                                        00414000
BLSUMONT EQU   0                                                        00415000
BLSUMONX EQU   0                                                        00416000
BLSUMON2 EQU   0                                                        00417000
BLSUMPKN EQU   0                                                        00418000
BLSUMPK1 EQU   0                                                        00419000
BLSUPARI EQU   0                                                        00420000
BLSUPARU EQU   0                                                        00421000
BLSUPGMC EQU   0                                                        00422000
BLSUPGMD EQU   0                                                        00423000
BLSUPGML EQU   0                                                        00424000
BLSUPGMR EQU   0                                                        00425000
BLSUPRTA EQU   0                                                        00426000
BLSUPRTN EQU   0                                                        00427000
BLSUPRTT EQU   0                                                        00428000
BLSUPUTA EQU   0                                                        00429000
BLSUPUTC EQU   0                                                        00430000
BLSUPUTD EQU   0                                                        00431000
BLSUPUTL EQU   0                                                        00432000
BLSUPUTN EQU   0                                                        00433000
BLSUPUTO EQU   0                                                        00434000
BLSUPUTT EQU   0                                                        00435000
BLSUPUTV EQU   0                                                        00436000
BLSUSTAI EQU   0                                                        00437000
BLSUTRMA EQU   0                                                        00438000
BLSUTRMN EQU   0                                                        00439000
BLSUTRMO EQU   0                                                        00440000
BLSUVSAR EQU   0                                                        00441000
BLSUVSCR EQU   0                                                        00442000
BLSUVSEN EQU   0                                                        00443000
BLSUVSER EQU   0                                                        00444000
BLSUVSGE EQU   0                                                        00445000
BLSUVSGU EQU   0                                                        00446000
BLSUVSMR EQU   0                                                        00447000
BLSUVSPO EQU   0                                                        00448000
BLSUVSPU EQU   0                                                        00449000
BLSUZZ2C EQU   0                                                        00450000
BLSUZZ2D EQU   0                                                        00451000
BLSUZZ2R EQU   0                                                        00452000
IKJEFF02 EQU   0                                                        00453000
IKJEFF18 EQU   0                                                        00454000
IKJEFF19 EQU   0                                                        00455000
IKJGETL  EQU   0                                                        00456000
IKJPARS  EQU   0                                                        00457000
IKJPTGT  EQU   0                                                        00458000
IKJSCAN  EQU   0                                                        00459000
IKJSTCK  EQU   0                                                        00460000
I001C    EQU   0                                                        00461000
I008P    EQU   0                                                        00462000
I015F    EQU   0                                                        00463000
I015P    EQU   0                                                        00464000
I031F    EQU   0                                                        00465000
I031P    EQU   0                                                        00466000
I256C    EQU   0                                                        00467000
PTPBOPUT EQU   PTPB+4                                                   00468000
PZ2      EQU   0                                                        00469000
MSGP     EQU   0                                                        00470000
MSGPT    EQU   MSGP+4                                                   00471000
CPPL     EQU   ZZ2CPPL                                                  00472000
CPPLUPT  EQU   CPPL+4                                                   00473000
CPPLPSCB EQU   CPPL+8                                                   00474000
CPPLECT  EQU   CPPL+12                                                  00475000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00476000
CPPLCBUF EQU   CPPL                                                     00477000
MSGPT1   EQU   MSGPT                                                    00478000
MSGPO    EQU   MSGP+2                                                   00479000
MSGPL    EQU   MSGP                                                     00480000
PTPBFLN  EQU   PTPB+8                                                   00481000
@NM00069 EQU   PTPB                                                     00482000
DVT99999 EQU   DVT+256                                                  00483000
DVT0064P EQU   DVT+252                                                  00484000
DVT0063P EQU   DVT+248                                                  00485000
DVT0062P EQU   DVT+244                                                  00486000
DVT0061P EQU   DVT+240                                                  00487000
DVT0060P EQU   DVT+236                                                  00488000
DVT0059P EQU   DVT+232                                                  00489000
DVT0058P EQU   DVT+228                                                  00490000
DVT0057P EQU   DVT+224                                                  00491000
DVT0056P EQU   DVT+220                                                  00492000
DVT0055P EQU   DVT+216                                                  00493000
DVT0054P EQU   DVT+212                                                  00494000
DVT0053P EQU   DVT+208                                                  00495000
DVT0052P EQU   DVT+204                                                  00496000
DVT0051P EQU   DVT+200                                                  00497000
DVT0050P EQU   DVT+196                                                  00498000
DVT0049P EQU   DVT+192                                                  00499000
DVT0048P EQU   DVT+188                                                  00500000
DVT0047P EQU   DVT+184                                                  00501000
DVT0046P EQU   DVT+180                                                  00502000
DVT0045P EQU   DVT+176                                                  00503000
DVT0044P EQU   DVT+172                                                  00504000
DVT0043P EQU   DVT+168                                                  00505000
DVT0042P EQU   DVT+164                                                  00506000
DVT0041P EQU   DVT+160                                                  00507000
DVT0040P EQU   DVT+156                                                  00508000
DVT0039P EQU   DVT+152                                                  00509000
DVT0038P EQU   DVT+148                                                  00510000
DVT0037P EQU   DVT+144                                                  00511000
DVT0036P EQU   DVT+140                                                  00512000
DVT0035P EQU   DVT+136                                                  00513000
DVT0034P EQU   DVT+132                                                  00514000
DVT0011P EQU   DVT+40                                                   00515000
DVT0005P EQU   DVT+16                                                   00516000
DVT0002P EQU   DVT+4                                                    00517000
DVT0001P EQU   DVT                                                      00518000
BVT99999 EQU   BVT+256                                                  00519000
BVT0064P EQU   BVT+252                                                  00520000
BVT0063P EQU   BVT+248                                                  00521000
BVT0062P EQU   BVT+244                                                  00522000
BVT0061P EQU   BVT+240                                                  00523000
BVT0060P EQU   BVT+236                                                  00524000
BVT0059P EQU   BVT+232                                                  00525000
BVT0057P EQU   BVT+224                                                  00526000
BVT0056P EQU   BVT+220                                                  00527000
BVTSTBLP EQU   BVT+200                                                  00528000
BVT0045P EQU   BVT+176                                                  00529000
BVT0044P EQU   BVT+172                                                  00530000
BVT0033P EQU   BVT+128                                                  00531000
BVT0032P EQU   BVT+124                                                  00532000
BVT0031P EQU   BVT+120                                                  00533000
BVT0030P EQU   BVT+116                                                  00534000
BVT0029P EQU   BVT+112                                                  00535000
BVT0026P EQU   BVT+100                                                  00536000
BVT0025P EQU   BVT+96                                                   00537000
BVT0024P EQU   BVT+92                                                   00538000
BVT0023P EQU   BVT+88                                                   00539000
BVT0016P EQU   BVT+60                                                   00540000
BVT0015P EQU   BVT+56                                                   00541000
BVT0014P EQU   BVT+52                                                   00542000
BVT0003P EQU   BVT+8                                                    00543000
BVT0001P EQU   BVT                                                      00544000
SA99     EQU   SA+72                                                    00545000
SARC     EQU   SAR+56                                                   00546000
SARB     EQU   SAR+52                                                   00547000
SARA     EQU   SAR+48                                                   00548000
SAR9     EQU   SAR+44                                                   00549000
SAR8     EQU   SAR+40                                                   00550000
SAR7     EQU   SAR+36                                                   00551000
SAR6     EQU   SAR+32                                                   00552000
SAR5     EQU   SAR+28                                                   00553000
SAR4     EQU   SAR+24                                                   00554000
SAR3     EQU   SAR+20                                                   00555000
SAR2     EQU   SAR+16                                                   00556000
SAR0     EQU   SAR+8                                                    00557000
SARF     EQU   SAR+4                                                    00558000
SARE     EQU   SAR                                                      00559000
SAFWD    EQU   SA+8                                                     00560000
SABAK    EQU   SA+4                                                     00561000
SA1L     EQU   SA1+1                                                    00562000
SA1P     EQU   SA1                                                      00563000
UPTPREFL EQU   UPT+23                                                   00564000
UPTPREFX EQU   UPT+16                                                   00565000
@NM00068 EQU   UPT+15                                                   00566000
UPTLDEL  EQU   UPT+14                                                   00567000
UPTCDEL  EQU   UPT+13                                                   00568000
UPTWTP   EQU   UPTSWS                                                   00569000
UPTMODE  EQU   UPTSWS                                                   00570000
UPTALD   EQU   UPTSWS                                                   00571000
UPTPAUS  EQU   UPTSWS                                                   00572000
UPTNCOM  EQU   UPTSWS                                                   00573000
UPTMID   EQU   UPTSWS                                                   00574000
UPTNPRM  EQU   UPTSWS                                                   00575000
UPTRCVR  EQU   UPTSWS                                                   00576000
UPTUSER  EQU   UPT+2                                                    00577000
@NM00067 EQU   UPT                                                      00578000
@NM00066 EQU   ECT+52                                                   00579000
@NM00065 EQU   ECT+48                                                   00580000
@NM00064 EQU   ECT+44                                                   00581000
@NM00063 EQU   ECTSWS2+1                                                00582000
@NM00062 EQU   ECTSWS21                                                 00583000
ECTTABND EQU   ECTSWS21                                                 00584000
ECTDEFCS EQU   ECTSWS21                                                 00585000
ECTBKPB  EQU   ECT+36                                                   00586000
ECTUSER  EQU   ECT+32                                                   00587000
ECTDDNUM EQU   ECT+29                                                   00588000
ECTATTN  EQU   ECTSWS                                                   00589000
ECTBKGRD EQU   ECTSWS                                                   00590000
ECTNNOT  EQU   ECTSWS                                                   00591000
ECTNMAL  EQU   ECTSWS                                                   00592000
ECTLOGF  EQU   ECTSWS                                                   00593000
ECTATRM  EQU   ECTSWS                                                   00594000
@NM00061 EQU   ECTSWS                                                   00595000
ECTNOPD  EQU   ECTSWS                                                   00596000
ECTSCMD  EQU   ECT+20                                                   00597000
ECTPCMD  EQU   ECT+12                                                   00598000
ECTSMSG  EQU   ECT+9                                                    00599000
ECTMSGF  EQU   ECT+8                                                    00600000
ECTIOWA  EQU   ECT+4                                                    00601000
ECTRTCD  EQU   ECT+1                                                    00602000
ECTRCDF  EQU   ECT                                                      00603000
PSCBU    EQU   PSCB+64                                                  00604000
PSCBRSZ  EQU   PSCB+60                                                  00605000
PSCBLINE EQU   PSCB+59                                                  00606000
PSCBCHAR EQU   PSCB+58                                                  00607000
PSCBUPTL EQU   PSCB+56                                                  00608000
PSCBUPT  EQU   PSCB+52                                                  00609000
PSCBRLGB EQU   PSCB+48                                                  00610000
PSCBDEST EQU   PSCB+40                                                  00611000
@NM00060 EQU   PSCB+36                                                  00612000
@NM00059 EQU   PSCB+32                                                  00613000
@NM00058 EQU   PSCB+28                                                  00614000
PSCBLTI2 EQU   PSCB+24                                                  00615000
PSCBLTIM EQU   PSCB+20                                                  00616000
PSCBATR2 EQU   PSCB+18                                                  00617000
@NM00057 EQU   PSCBATR1                                                 00618000
@NM00056 EQU   PSCBATR1                                                 00619000
@NM00055 EQU   PSCBATR1                                                 00620000
PSCBATTN EQU   PSCBATR1                                                 00621000
PSCBVMNT EQU   PSCBATR1                                                 00622000
PSCBJCL  EQU   PSCBATR1                                                 00623000
PSCBACCT EQU   PSCBATR1                                                 00624000
PSCBCTRL EQU   PSCBATR1                                                 00625000
PSCBGPNM EQU   PSCB+8                                                   00626000
PSCBUSRL EQU   PSCB+7                                                   00627000
PSCBUSER EQU   PSCB                                                     00628000
CMDT1    EQU   CMDT                                                     00629000
CMDO     EQU   CMD+2                                                    00630000
CMDL     EQU   CMD                                                      00631000
ZZ299999 EQU   ZZ2+8192                                                 00632000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  00633000
ZZ2AXOL  EQU   ZZ2AXO                                                   00634000
@NM00054 EQU   ZZ2+7288                                                 00635000
@NM00053 EQU   ZZ2AMDX+4                                                00636000
ZZ2AMDXC EQU   ZZ2AMDX                                                  00637000
ZZ2HSD   EQU   ZZ2+3056                                                 00638000
@NM00052 EQU   ZZ2ES                                                    00639000
@NM00051 EQU   ZZ2+2868                                                 00640000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                00641000
@NM00050 EQU   ZZ2ITSE                                                  00642000
ZZ2ITSEP EQU   ZZ2ITSE                                                  00643000
ZZ2ITSEW EQU   ZZ2ITSE                                                  00644000
@NM00049 EQU   ZZ2ITR+20                                                00645000
ZZ2ITREC EQU   ZZ2ITRE+1                                                00646000
@NM00048 EQU   ZZ2ITRE                                                  00647000
ZZ2ITREP EQU   ZZ2ITRE                                                  00648000
ZZ2ITREW EQU   ZZ2ITRE                                                  00649000
@NM00047 EQU   ZZ2ITR+9                                                 00650000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 00651000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 00652000
ZZ2ITRPP EQU   ZZ2ITR                                                   00653000
@NM00046 EQU   ZZ2+1544                                                 00654000
ZZ2PGM   EQU   ZZ2+1536                                                 00655000
@NM00045 EQU   ZZ2+1526                                                 00656000
ZZ2CW    EQU   ZZ2+1524                                                 00657000
@NM00044 EQU   ZZ2+1504                                                 00658000
@NM00043 EQU   ZZ2+1352                                                 00659000
ZZ2FFSYP EQU   ZZ2+1348                                                 00660000
ZZ2SASYP EQU   ZZ2+1344                                                 00661000
ZZ2RDSYP EQU   ZZ2+1340                                                 00662000
ZZ2RASYP EQU   ZZ2+1336                                                 00663000
ZZ2PHSYP EQU   ZZ2+1332                                                 00664000
ZZ2ESSYP EQU   ZZ2+1328                                                 00665000
ZZ200SYP EQU   ZZ2+1324                                                 00666000
ZZ2SCWP  EQU   ZZ2+1320                                                 00667000
ZZ2TTLP  EQU   ZZ2+1316                                                 00668000
ZZ2LOADP EQU   ZZ2+1312                                                 00669000
ZZ2VRESP EQU   ZZ2+1308                                                 00670000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               00671000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                00672000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                00673000
ZZ2VRSAP EQU   ZZ2+1288                                                 00674000
ZZ2RVTP  EQU   ZZ2+1284                                                 00675000
@NM00042 EQU   ZZ2+1272                                                 00676000
@NM00041 EQU   ZZ2+1268                                                 00677000
ZZ2RPLP  EQU   ZZ2+1260                                                 00678000
ZZ2TCBP  EQU   ZZ2+1256                                                 00679000
@NM00040 EQU   ZZ2+1252                                                 00680000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 00681000
@NM00039 EQU   ZZ2+1112                                                 00682000
@NM00038 EQU   ZZ2+1080                                                 00683000
ZZ2FT25P EQU   ZZ2+1072                                                 00684000
ZZ2TRMVP EQU   ZZ2+1068                                                 00685000
@NM00037 EQU   ZZ2+976                                                  00686000
ZZ2TOD   EQU   ZZ2+968                                                  00687000
ZZ2STGN  EQU   ZZ2STG+4                                                 00688000
ZZ2STGP  EQU   ZZ2STG                                                   00689000
@NM00036 EQU   ZZ2+952                                                  00690000
ZZ2SCMDE EQU   ZZ2+944                                                  00691000
ZZ2SCMDN EQU   ZZ2+936                                                  00692000
ZZ2IDENT EQU   ZZ2+928                                                  00693000
ZZ2A9999 EQU   ZZ2A+656                                                 00694000
@NM00035 EQU   ZZ2A+224                                                 00695000
@NM00034 EQU   ZZ2A+220                                                 00696000
ZZ2AQD99 EQU   ZZ2AQD+60                                                00697000
@NM00033 EQU   ZZ2AQD+56                                                00698000
@NM00032 EQU   ZZ2AQDF                                                  00699000
ZZ2AQDFA EQU   ZZ2AQDF                                                  00700000
ZZ2AQDIL EQU   ZZ2AQD+48                                                00701000
ZZ2AQDIM EQU   ZZ2AQD+44                                                00702000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               00703000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               00704000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                00705000
@NM00031 EQU   ZZ2AQDT+1                                                00706000
ZZ2AQDTY EQU   ZZ2AQDT                                                  00707000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  00708000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 00709000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 00710000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 00711000
ZZ2AQDOF EQU   ZZ2AQD                                                   00712000
ZZ2AQD00 EQU   ZZ2AQD                                                   00713000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               00714000
@NM00030 EQU   ZZ2AQAS+12                                               00715000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                00716000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                00717000
@NM00029 EQU   ZZ2AQAS+2                                                00718000
ZZ2AQAST EQU   ZZ2AQAS                                                  00719000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  00720000
ZZ2AZZ6P EQU   ZZ2A+140                                                 00721000
ZZ2ADPTA EQU   ZZ2ADPT                                                  00722000
ZZ2ADPL  EQU   ZZ2ADP                                                   00723000
ZZ2ADMTA EQU   ZZ2ADMT                                                  00724000
ZZ2ADML  EQU   ZZ2ADM                                                   00725000
ZZ2ADDTA EQU   ZZ2ADDT                                                  00726000
ZZ2ADDL  EQU   ZZ2ADD                                                   00727000
@NM00028 EQU   ZZ2A+72                                                  00728000
ZZ2APIDB EQU   ZZ2APID+3                                                00729000
ZZ2APIDA EQU   ZZ2APID                                                  00730000
@NM00027 EQU   ZZ2A+24                                                  00731000
@NM00026 EQU   ZZ2AF+5                                                  00732000
ZZ2AFX   EQU   ZZ2AF+5                                                  00733000
@NM00025 EQU   ZZ2AF+3                                                  00734000
ZZ2AFS   EQU   ZZ2AF+2                                                  00735000
ZZ2AFD   EQU   ZZ2AF+2                                                  00736000
ZZ2AFQ   EQU   ZZ2AF+2                                                  00737000
ZZ2AF$   EQU   ZZ2AF+2                                                  00738000
@NM00024 EQU   ZZ2AF+2                                                  00739000
ZZ2AFM   EQU   ZZ2AF+2                                                  00740000
@NM00023 EQU   ZZ2AF+2                                                  00741000
@NM00022 EQU   ZZ2AF+1                                                  00742000
ZZ2AFV   EQU   ZZ2AF+1                                                  00743000
@NM00021 EQU   ZZ2AF+1                                                  00744000
ZZ2AFC   EQU   ZZ2AF+1                                                  00745000
@NM00020 EQU   ZZ2AF                                                    00746000
ZZ2AFT   EQU   ZZ2AF                                                    00747000
ZZ2AFP   EQU   ZZ2AF                                                    00748000
@NM00019 EQU   ZZ2A+8                                                   00749000
ZZ2ALINE EQU   ZZ2A+4                                                   00750000
@NM00018 EQU   ZZ2A+3                                                   00751000
ZZ2ASE   EQU   ZZ2A+2                                                   00752000
ZZ2ACH   EQU   ZZ2A                                                     00753000
@NM00017 EQU   ZZ2+264                                                  00754000
@NM00016 EQU   ZZ2+263                                                  00755000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  00756000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 00757000
ZZ2PRTL  EQU   ZZ2PRT                                                   00758000
@NM00015 EQU   ZZ2AMD+56                                                00759000
ZZ2AMDXP EQU   ZZ2AMD+52                                                00760000
ZZ2AMDD  EQU   ZZ2AMD+48                                                00761000
ZZ2AMDL  EQU   ZZ2AMD+44                                                00762000
ZZ2AMDU  EQU   ZZ2AMD+28                                                00763000
ZZ2AMDF  EQU   ZZ2AMD+24                                                00764000
ZZ2AMDS  EQU   ZZ2AMD+20                                                00765000
ZZ2AMDC  EQU   ZZ2AMD+16                                                00766000
ZZ2AMDP  EQU   ZZ2AMD+12                                                00767000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 00768000
@NM00014 EQU   @NM00013                                                 00769000
ZZ2AMD2  EQU   @NM00013                                                 00770000
ZZ2AMD1  EQU   @NM00013                                                 00771000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 00772000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 00773000
ZZ2AMDT  EQU   ZZ2AMD                                                   00774000
ZZ199999 EQU   ZZ1+3072                                                 00775000
@NM00012 EQU   ZZ1+2160                                                 00776000
ZZ1TRTAS EQU   ZZ1+1904                                                 00777000
ZZ1TRUPC EQU   ZZ1+1648                                                 00778000
ZZ1TRCTX EQU   ZZ1+1392                                                 00779000
ZZ1NASID EQU   ZZ1N+274                                                 00780000
ZZ1NSTRL EQU   ZZ1N+272                                                 00781000
ZZ1NOFF  EQU   ZZ1N+268                                                 00782000
ZZ1NBDY  EQU   ZZ1N+264                                                 00783000
ZZ1NADE  EQU   ZZ1N+260                                                 00784000
ZZ1NADB  EQU   ZZ1N+256                                                 00785000
ZZ1NSTR  EQU   ZZ1N                                                     00786000
@NM00011 EQU   ZZ1+1080                                                 00787000
ZZ1TREBC EQU   ZZ1+824                                                  00788000
ZZ1TRHEX EQU   ZZ1+568                                                  00789000
@NM00010 EQU   ZZ1+377                                                  00790000
ZZ1USTAE EQU   ZZ1+376                                                  00791000
@NM00009 EQU   ZZ1F+1                                                   00792000
@NM00008 EQU   ZZ1F                                                     00793000
ZZ1FM    EQU   ZZ1F                                                     00794000
ZZ1FX    EQU   ZZ1F                                                     00795000
ZZ1FU    EQU   ZZ1F                                                     00796000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 00797000
@NM00007 EQU   ZZ1EVE                                                   00798000
ZZ1EVEW  EQU   ZZ1EVE                                                   00799000
ZZ1ACMP  EQU   ZZ1ATTN                                                  00800000
@NM00006 EQU   ZZ1+144                                                  00801000
ZZ1FPP   EQU   ZZ1+140                                                  00802000
ZZ1ZZ6P  EQU   ZZ1+136                                                  00803000
@NM00005 EQU   ZZ1+84                                                   00804000
ZZ1PLINE EQU   ZZ1+80                                                   00805000
ZZ1PGSZ  EQU   ZZ1+76                                                   00806000
ZZ1PCNT  EQU   ZZ1+72                                                   00807000
@NM00004 EQU   ZZ1+68                                                   00808000
ZZ1TPAGE EQU   ZZ1+64                                                   00809000
ZZ1TLINE EQU   ZZ1+60                                                   00810000
@NM00003 EQU   ZZ1+48                                                   00811000
ZZ1DSDP  EQU   ZZ1+44                                                   00812000
ZZ1PDRP  EQU   ZZ1+40                                                   00813000
ZZ1ZZ2P  EQU   ZZ1+36                                                   00814000
ZZ1327WP EQU   ZZ1+32                                                   00815000
ZZ1ACBP  EQU   ZZ1+28                                                   00816000
@NM00002 EQU   ZZ1+24                                                   00817000
ZZ1PDCBP EQU   ZZ1+20                                                   00818000
ZZ1BLRBL EQU   ZZ1+16                                                   00819000
@NM00001 EQU   ZZ1+12                                                   00820000
ZZ1PNULL EQU   ZZ1+8                                                    00821000
ZZ1NULL  EQU   ZZ1+4                                                    00822000
ZZ1IDE   EQU   ZZ1                                                      00823000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00824000
@RF00127 EQU   @RC00120                                                 00825000
@ENDDATA EQU   *                                                        00826000
         END   BLSUTRMV,(C'PLS2125',0701,78060)                         00827000
