MON2     TITLE 'BLSUMON2--COMMAND SCAN INTERFACE SUBROUTINE            *00001000
                        '                                               00002000
*/* CHANGE ACTIVITY -------------------------------------------------*/ 00003000
*/*   THIS MODULE WAS WRITTEN FOR @G57LPRW                           */ 00004000
*/*------------------------------------------------------------------*/ 00005000
BLSUMON2 CSECT ,                                                01S0002 00006000
@MAINENT DS    0H                                               01S0002 00007000
         USING *,@15                                            01S0002 00008000
         B     @PROLOG                                          01S0002 00009000
         DC    AL1(16)                                          01S0002 00010000
         DC    C'BLSUMON2  78.059'                              01S0002 00011000
         DROP  @15                                                      00012000
@PROLOG  STM   @14,@12,12(@13)                                  01S0002 00013000
         BALR  @12,0                                            01S0002 00014000
@PSTART  DS    0H                                               01S0002 00015000
         USING @PSTART,@12                                      01S0002 00016000
         L     @00,@SIZDATD                                     01S0002 00017000
         BLSUALLS R,LV=(0)                                              00018000
         LR    @11,@01                                          01S0002 00019000
         USING @DATD,@11                                        01S0002 00020000
         ST    @13,@SA00001+4                                   01S0002 00021000
         LM    @00,@01,20(@13)                                  01S0002 00022000
         ST    @11,8(,@13)                                      01S0002 00023000
         LR    @13,@11                                          01S0002 00024000
         MVC   @PC00001(8),0(@01)                               01S0002 00025000
*/*------------------------------------------------------------------*/ 00026000
*/* BLSUMON2--COMMAND SCAN INTERFACE SUBROUTINE                      */ 00027000
*/*------------------------------------------------------------------*/ 00028000
*                                                               01S0080 00029000
*   CSPLUPT=ADDR(UPT);              /* ->USER PROFILE TABLE          */ 00030000
         L     @10,@PC00001+4                                   01S0080 00031000
         MVC   CSPLUPT(4,@10),CPPLUPT(R9)                       01S0080 00032000
*   CSPLECT=ADDR(ECT);              /* ->ENVIRONMENT CONTROL TABLE   */ 00033000
         MVC   CSPLECT(4,@10),CPPLECT(R9)                       01S0081 00034000
*   CSPLECB=ADDR(ZZZZNULL);         /* NO ECB                        */ 00035000
         LA    @08,@CF00051                                     01S0082 00036000
         ST    @08,CSPLECB(,@10)                                01S0082 00037000
*   CSPLFLG=ADDR(ZZZZNULL);         /* ->COMMAND SCAN OPTIONS FLAGS  */ 00038000
         ST    @08,CSPLFLG(,@10)                                01S0083 00039000
*   RESPECIFY                                                   01S0084 00040000
*    (R1) RESTRICTED;               /* ->CSPL                        */ 00041000
*   R1=ADDR(CSPL);                  /* ->CSPL                        */ 00042000
         LR    R1,@10                                           01S0085 00043000
*   RESPECIFY                                                   01S0086 00044000
*    (RF) RESTRICTED;               /* RETURN CODE                   */ 00045000
*   CALL IKJSCAN;                   /* COMMAND SCAN TSO SERVICE RTN. */ 00046000
         L     @15,ZZ2SCANP(,R9)                                01S0087 00047000
         BALR  @14,@15                                          01S0087 00048000
*   RESPECIFY                                                   01S0088 00049000
*    (R1) UNRESTRICTED;             /* ->CSPL                        */ 00050000
*   CSOAPTR=CSPLOA;                 /* ->COMMAND SCAN OUTPUT AREA    */ 00051000
         L     @14,@PC00001+4                                   01S0089 00052000
         L     CSOAPTR,CSPLOA(,@14)                             01S0089 00053000
*   IF                              /* COMMAND SCAN ERROR            */ 00054000
*/*     ONLY REASONABLE RETURN CODE IS ZERO                          */ 00055000
*                                                               01S0090 00056000
*       RF^=ZZZFLAGI|               /* UNEXPECTED RETURN CODE        */ 00057000
*/*     QUESTION MARKS ARE NORMALLY INTERCEPTED BY PUTGET            */ 00058000
*                                                               01S0090 00059000
*       CSOAQM='1'B THEN            /* QUESTION MARK NOT INTERCEPTED */ 00060000
*                                                               01S0090 00061000
         LTR   RF,RF                                            01S0090 00062000
         BNZ   @RT00090                                         01S0090 00063000
         TM    CSOAQM(CSOAPTR),B'00100000'                      01S0090 00064000
         BNO   @RF00090                                         01S0090 00065000
@RT00090 DS    0H                                               01S0091 00066000
*     /***************************************************************/ 00067000
*     /*                                                             */ 00068000
*     /* COMMAND SCAN ERROR                                          */ 00069000
*     /*                                                             */ 00070000
*     /***************************************************************/ 00071000
*                                                               01S0091 00072000
*     DO;                           /* COMMAND SCAN ERROR            */ 00073000
*       CALL BLSUTRMV(ZZ2,M055);    /* TRANSMIT MESSAGE M055         */ 00074000
         ST    R9,@AL00001                                      01S0092 00075000
         LA    @14,M055                                         01S0092 00076000
         ST    @14,@AL00001+4                                   01S0092 00077000
         L     @15,ZZ2TRMVP(,R9)                                01S0092 00078000
         LA    @01,@AL00001                                     01S0092 00079000
         BALR  @14,@15                                          01S0092 00080000
*       RETC=ZZZFLAGT;              /* RETURN CODE                   */ 00081000
         LA    RETC,16                                          01S0093 00082000
*     END;                          /* COMMAND SCAN ERROR            */ 00083000
*   ELSE                            /* VALID COMMAND SCAN RESULTS    */ 00084000
*     IF CSOABAD='1'B THEN          /* INVALID COMMAND SYNTAX        */ 00085000
*                                                               01S0095 00086000
         B     @RC00090                                         01S0095 00087000
@RF00090 TM    CSOABAD(CSOAPTR),B'00001000'                     01S0095 00088000
         BNO   @RF00095                                         01S0095 00089000
*       /*************************************************************/ 00090000
*       /*                                                           */ 00091000
*       /* INVALID COMMAND SYNTAX                                    */ 00092000
*       /*                                                           */ 00093000
*       /*************************************************************/ 00094000
*                                                               01S0096 00095000
*       DO;                         /* INVALID COMMAND SYNTAX        */ 00096000
*         CALL BLSUTRMV(ZZ2,M056);  /* TRAMSMIT MESSAGE M056         */ 00097000
         ST    R9,@AL00001                                      01S0097 00098000
         LA    @14,M056                                         01S0097 00099000
         ST    @14,@AL00001+4                                   01S0097 00100000
         L     @15,ZZ2TRMVP(,R9)                                01S0097 00101000
         LA    @01,@AL00001                                     01S0097 00102000
         BALR  @14,@15                                          01S0097 00103000
*         RETC=ZZZFLAGS;            /* RETURN CODE                   */ 00104000
         LA    RETC,12                                          01S0098 00105000
*       END;                        /* INVALID COMMAND SYNTAX        */ 00106000
*     ELSE                          /* WELL-FORMED COMMAND           */ 00107000
*       RETC=ZZZFLAGI;              /* RETURN CODE                   */ 00108000
         B     @RC00095                                         01S0100 00109000
@RF00095 SLR   RETC,RETC                                        01S0100 00110000
*   RETURN CODE(RETC);                                          01S0101 00111000
*                                                               01S0101 00112000
@RC00095 DS    0H                                               01S0101 00113000
@RC00090 L     @13,4(,@13)                                      01S0101 00114000
         L     @00,@SIZDATD                                     01S0101 00115000
         LR    @01,@11                                          01S0101 00116000
         BLSUFRES R,LV=(0),A=(1)                                        00117000
         LR    @15,@02                                          01S0101 00118000
         L     @14,12(,@13)                                     01S0101 00119000
         LM    @00,@12,20(@13)                                  01S0101 00120000
         BR    @14                                              01S0101 00121000
*/*BLSUPEND--MVS IPCS MODULE                                         */ 00122000
*                                                               01S0102 00123000
*   DECLARE                         /* COMMON VARIABLES              */ 00124000
*     I256C CHAR(256) BASED,                                    01S0102 00125000
*     I031F FIXED(31) BASED,                                    01S0102 00126000
*     I031P PTR(31) BASED,                                      01S0102 00127000
*     I015F FIXED(15) BASED,                                    01S0102 00128000
*     I015P PTR(15) BASED,                                      01S0102 00129000
*     I008P PTR(8) BASED,                                       01S0102 00130000
*     I001C CHAR(1) BASED;                                      01S0102 00131000
*   GENERATE NODEFS NOREFS DATA;                                01S0103 00132000
*   END BLSUMON2                    /* BLRPEND(BLSUMON2)             */ 00133000
*                                                               01S0104 00134000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00135000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00136000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00137000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00138000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00139000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00140000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00141000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00142000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00143000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00144000
*/*%INCLUDE SYSLIB  (IKJCSPL )                                       */ 00145000
*/*%INCLUDE SYSLIB  (IKJCSOA )                                       */ 00146000
*                                                               01S0104 00147000
*       ;                                                       01S0104 00148000
@EL00001 L     @13,4(,@13)                                      01S0104 00149000
@EF00001 L     @00,@SIZDATD                                     01S0104 00150000
         LR    @01,@11                                          01S0104 00151000
         BLSUFRES R,LV=(0),A=(1)                                        00152000
@ER00001 LM    @14,@12,12(@13)                                  01S0104 00153000
         BR    @14                                              01S0104 00154000
@DATA    DS    0H                                                       00155000
@DATD    DSECT                                                          00156000
         DS    0F                                                       00157000
@SA00001 DS    18F                                                      00158000
@PC00001 DS    2F                                                       00159000
@AL00001 DS    2A                                                       00160000
BLSUMON2 CSECT                                                          00161000
         DS    0F                                                       00162000
@CF00051 DC    F'0'                                                     00163000
@DATD    DSECT                                                          00164000
         DS    0D                                                       00165000
BLSUMON2 CSECT                                                          00166000
         DS    0F                                                       00167000
@SIZDATD DC    AL1(0)                                                   00168000
         DC    AL3(@ENDDATD-@DATD)                                      00169000
         DS    0D                                                       00170000
M055     DS    CL32                                                     00171000
         ORG   M055                                                     00172000
M055L    DC    AL2(32)                                                  00173000
@NM00072 DC    X'0000'                                                  00174000
M055T    DS    CL28                                                     00175000
         ORG   M055T                                                    00176000
M055TA   DC    CL28'BLS21055I COMMAND SCAN ERROR'                       00177000
         ORG   M055+32                                                  00178000
M056     DS    CL36                                                     00179000
         ORG   M056                                                     00180000
M056L    DC    AL2(36)                                                  00181000
@NM00073 DC    X'0000'                                                  00182000
M056T    DS    CL32                                                     00183000
         ORG   M056T                                                    00184000
M056TA   DC    CL32'BLS21056I INVALID COMMAND SYNTAX'                   00185000
         ORG   M056+36                                                  00186000
@DATD    DSECT                                                          00187000
         SPACE 2                                                        00188000
*********************************************************************** 00189000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00190000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 00191000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 00192000
*********************************************************************** 00193000
         SPACE                                                          00194000
BLSUMON2 CSECT                                                          00195000
         ORG                                                            00196000
         DS    0D                                                       00197000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSUMON2+19)/20+7)/8)CL8'BLSUMON2'     00198000
@DATD    DSECT                                                          00199000
         DS    0H                                                       00200000
@DATD    DSECT                                                          00201000
         SPACE 2                                                        00202000
*********************************************************************** 00203000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 00204000
*********************************************************************** 00205000
         SPACE                                                          00206000
         DS    0D                                                       00207000
@DATD    DSECT                                                          00208000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00209000
@ENDDATD EQU   *                                                        00210000
BLSUMON2 CSECT                                                          00211000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00212000
@01      EQU   01                                                       00213000
@02      EQU   02                                                       00214000
@03      EQU   03                                                       00215000
@04      EQU   04                                                       00216000
@05      EQU   05                                                       00217000
@06      EQU   06                                                       00218000
@07      EQU   07                                                       00219000
@08      EQU   08                                                       00220000
@09      EQU   09                                                       00221000
@10      EQU   10                                                       00222000
@11      EQU   11                                                       00223000
@12      EQU   12                                                       00224000
@13      EQU   13                                                       00225000
@14      EQU   14                                                       00226000
@15      EQU   15                                                       00227000
RETC     EQU   @02                                                      00228000
CSOAPTR  EQU   @05                                                      00229000
R9       EQU   @09                                                      00230000
R0       EQU   @00                                                      00231000
R1       EQU   @01                                                      00232000
R2       EQU   @02                                                      00233000
R3       EQU   @03                                                      00234000
R4       EQU   @04                                                      00235000
R5       EQU   @05                                                      00236000
RB       EQU   @11                                                      00237000
RD       EQU   @13                                                      00238000
RE       EQU   @14                                                      00239000
RF       EQU   @15                                                      00240000
RA       EQU   @10                                                      00241000
RC       EQU   @12                                                      00242000
R6       EQU   @06                                                      00243000
R7       EQU   @07                                                      00244000
R8       EQU   @08                                                      00245000
ZZ1      EQU   0                                                        00246000
ZZ1ATTN  EQU   ZZ1+360                                                  00247000
ZZ1EVE   EQU   ZZ1ATTN+4                                                00248000
ZZ1F     EQU   ZZ1+368                                                  00249000
ZZ1N     EQU   ZZ1+1116                                                 00250000
ZZ2      EQU   0                                                        00251000
ZZ2AMD   EQU   ZZ2                                                      00252000
@NM00013 EQU   ZZ2AMD+7                                                 00253000
ZZ2PRT   EQU   ZZ2+138                                                  00254000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 00255000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                00256000
ZZ2A     EQU   ZZ2+272                                                  00257000
ZZ2AF    EQU   ZZ2A+16                                                  00258000
ZZ2APID  EQU   ZZ2A+64                                                  00259000
ZZ2AD    EQU   ZZ2A+74                                                  00260000
ZZ2ADD   EQU   ZZ2AD                                                    00261000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 00262000
ZZ2ADM   EQU   ZZ2AD+46                                                 00263000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 00264000
ZZ2ADP   EQU   ZZ2AD+56                                                 00265000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 00266000
ZZ2AQAS  EQU   ZZ2A+144                                                 00267000
ZZ2AQD   EQU   ZZ2A+160                                                 00268000
ZZ2AQDT  EQU   ZZ2AQD+10                                                00269000
ZZ2AQDF  EQU   ZZ2AQD+52                                                00270000
ZZ2STG   EQU   ZZ2+960                                                  00271000
ZZ2ALLOP EQU   ZZ2+992                                                  00272000
ZZ2FREEP EQU   ZZ2+996                                                  00273000
ZZ2FF19P EQU   ZZ2+1000                                                 00274000
ZZ2FRE1P EQU   ZZ2+1004                                                 00275000
ZZ2FF18P EQU   ZZ2+1008                                                 00276000
ZZ2DYNAP EQU   ZZ2+1012                                                 00277000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 00278000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 00279000
ZZ2STAIP EQU   ZZ2+1024                                                 00280000
ZZ2FF02P EQU   ZZ2+1028                                                 00281000
ZZ2GETLP EQU   ZZ2+1032                                                 00282000
ZZ2PARSP EQU   ZZ2+1036                                                 00283000
ZZ2PTGTP EQU   ZZ2+1040                                                 00284000
ZZ2PUTLP EQU   ZZ2+1044                                                 00285000
ZZ2SCANP EQU   ZZ2+1048                                                 00286000
ZZ2STCKP EQU   ZZ2+1052                                                 00287000
ZZ2TRMOP EQU   ZZ2+1064                                                 00288000
ZZ2TRMVP EQU   ZZ2+1068                                                 00289000
ZZ2PUTNP EQU   ZZ2+1084                                                 00290000
ZZ2TRMNP EQU   ZZ2+1088                                                 00291000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 00292000
ZZ2BVTP  EQU   ZZ2+1280                                                 00293000
ZZ2CPPL  EQU   ZZ2+1292                                                 00294000
ZZ2CPPLC EQU   ZZ2CPPL                                                  00295000
ZZ2ITR   EQU   ZZ2+2840                                                 00296000
ZZ2ITRE  EQU   ZZ2ITR+16                                                00297000
ZZ2ITSE  EQU   ZZ2+2864                                                 00298000
ZZ2ES    EQU   ZZ2+2872                                                 00299000
ZZ2AMDX  EQU   ZZ2+7160                                                 00300000
ZZ2AXO   EQU   ZZ2+7934                                                 00301000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 00302000
CMD      EQU   0                                                        00303000
CMDT     EQU   CMD+4                                                    00304000
PSCB     EQU   0                                                        00305000
PSCBATR1 EQU   PSCB+16                                                  00306000
ECT      EQU   0                                                        00307000
ECTSWS   EQU   ECT+28                                                   00308000
ECTSWS2  EQU   ECT+40                                                   00309000
ECTSWS21 EQU   ECTSWS2                                                  00310000
UPT      EQU   0                                                        00311000
UPTSWS   EQU   UPT+12                                                   00312000
SA       EQU   0                                                        00313000
SA1      EQU   SA                                                       00314000
SAR      EQU   SA+12                                                    00315000
SAR1     EQU   SAR+12                                                   00316000
IKJSCAN  EQU   0                                                        00317000
BLSUTRMV EQU   0                                                        00318000
BVT      EQU   0                                                        00319000
BVTPUTLP EQU   BVT+4                                                    00320000
BVTPUTOP EQU   BVT+12                                                   00321000
BVTPUTTP EQU   BVT+16                                                   00322000
BVTPUTVP EQU   BVT+20                                                   00323000
BVTPUTAP EQU   BVT+24                                                   00324000
BVTPRTTP EQU   BVT+28                                                   00325000
BVTPRTAP EQU   BVT+32                                                   00326000
BVTPUTDP EQU   BVT+36                                                   00327000
BVTMONP  EQU   BVT+40                                                   00328000
BVTVSARP EQU   BVT+48                                                   00329000
BVTVSENP EQU   BVT+64                                                   00330000
BVTVSERP EQU   BVT+68                                                   00331000
BVTVSGEP EQU   BVT+72                                                   00332000
BVTVSGUP EQU   BVT+76                                                   00333000
BVTVSPOP EQU   BVT+80                                                   00334000
BVTVSPUP EQU   BVT+84                                                   00335000
BVTMPKNP EQU   BVT+104                                                  00336000
BVTMONLP EQU   BVT+108                                                  00337000
BVTPUTCP EQU   BVT+132                                                  00338000
BVTMPK1P EQU   BVT+136                                                  00339000
BVTZZ2RP EQU   BVT+140                                                  00340000
BVTPGMRP EQU   BVT+144                                                  00341000
BVTMONAP EQU   BVT+148                                                  00342000
BVTBLDDP EQU   BVT+152                                                  00343000
BVTBLDLP EQU   BVT+156                                                  00344000
BVTPGMCP EQU   BVT+160                                                  00345000
BVTPGMDP EQU   BVT+164                                                  00346000
BVTPGMLP EQU   BVT+168                                                  00347000
BVTMONCP EQU   BVT+180                                                  00348000
BVTMONDP EQU   BVT+184                                                  00349000
BVTMONTP EQU   BVT+188                                                  00350000
BVTPARIP EQU   BVT+192                                                  00351000
BVTPARUP EQU   BVT+196                                                  00352000
BVTPRTNP EQU   BVT+204                                                  00353000
BVTVSCRP EQU   BVT+208                                                  00354000
BVTVSMRP EQU   BVT+212                                                  00355000
BVTMONXP EQU   BVT+216                                                  00356000
BVTTRMAP EQU   BVT+228                                                  00357000
CSOA     EQU   0                                                        00358000
CSOAFLG  EQU   CSOA+6                                                   00359000
CSOAQM   EQU   CSOAFLG                                                  00360000
CSOABAD  EQU   CSOAFLG                                                  00361000
BLSUALLO EQU   0                                                        00362000
BLSUBLDD EQU   0                                                        00363000
BLSUBLDL EQU   0                                                        00364000
BLSUDYNA EQU   0                                                        00365000
BLSUFREE EQU   0                                                        00366000
BLSUFRE1 EQU   0                                                        00367000
BLSUMON  EQU   0                                                        00368000
BLSUMONA EQU   0                                                        00369000
BLSUMONC EQU   0                                                        00370000
BLSUMOND EQU   0                                                        00371000
BLSUMONL EQU   0                                                        00372000
BLSUMONT EQU   0                                                        00373000
BLSUMONX EQU   0                                                        00374000
BLSUMPKN EQU   0                                                        00375000
BLSUMPK1 EQU   0                                                        00376000
BLSUPARI EQU   0                                                        00377000
BLSUPARU EQU   0                                                        00378000
BLSUPGMC EQU   0                                                        00379000
BLSUPGMD EQU   0                                                        00380000
BLSUPGML EQU   0                                                        00381000
BLSUPGMR EQU   0                                                        00382000
BLSUPRTA EQU   0                                                        00383000
BLSUPRTN EQU   0                                                        00384000
BLSUPRTT EQU   0                                                        00385000
BLSUPUTA EQU   0                                                        00386000
BLSUPUTC EQU   0                                                        00387000
BLSUPUTD EQU   0                                                        00388000
BLSUPUTL EQU   0                                                        00389000
BLSUPUTN EQU   0                                                        00390000
BLSUPUTO EQU   0                                                        00391000
BLSUPUTT EQU   0                                                        00392000
BLSUPUTV EQU   0                                                        00393000
BLSUSTAI EQU   0                                                        00394000
BLSUTRMA EQU   0                                                        00395000
BLSUTRMN EQU   0                                                        00396000
BLSUTRMO EQU   0                                                        00397000
BLSUVSAR EQU   0                                                        00398000
BLSUVSCR EQU   0                                                        00399000
BLSUVSEN EQU   0                                                        00400000
BLSUVSER EQU   0                                                        00401000
BLSUVSGE EQU   0                                                        00402000
BLSUVSGU EQU   0                                                        00403000
BLSUVSMR EQU   0                                                        00404000
BLSUVSPO EQU   0                                                        00405000
BLSUVSPU EQU   0                                                        00406000
BLSUZZ2C EQU   0                                                        00407000
BLSUZZ2D EQU   0                                                        00408000
BLSUZZ2R EQU   0                                                        00409000
IKJEFF02 EQU   0                                                        00410000
IKJEFF18 EQU   0                                                        00411000
IKJEFF19 EQU   0                                                        00412000
IKJGETL  EQU   0                                                        00413000
IKJPARS  EQU   0                                                        00414000
IKJPTGT  EQU   0                                                        00415000
IKJPUTL  EQU   0                                                        00416000
IKJSTCK  EQU   0                                                        00417000
I001C    EQU   0                                                        00418000
I008P    EQU   0                                                        00419000
I015F    EQU   0                                                        00420000
I015P    EQU   0                                                        00421000
I031F    EQU   0                                                        00422000
I031P    EQU   0                                                        00423000
I256C    EQU   0                                                        00424000
PZ2      EQU   0                                                        00425000
CSPL     EQU   0                                                        00426000
CSPLUPT  EQU   CSPL                                                     00427000
CSPLECT  EQU   CSPL+4                                                   00428000
CSPLECB  EQU   CSPL+8                                                   00429000
CSPLFLG  EQU   CSPL+12                                                  00430000
CSPLOA   EQU   CSPL+16                                                  00431000
CPPL     EQU   ZZ2CPPL                                                  00432000
CPPLUPT  EQU   CPPL+4                                                   00433000
CPPLPSCB EQU   CPPL+8                                                   00434000
CPPLECT  EQU   CPPL+12                                                  00435000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00436000
CPPLCBUF EQU   CPPL                                                     00437000
CSPLCBUF EQU   CSPL+20                                                  00438000
@NM00071 EQU   CSOA+7                                                   00439000
@NM00070 EQU   CSOAFLG                                                  00440000
@NM00069 EQU   CSOAFLG                                                  00441000
CSOAEXEC EQU   CSOAFLG                                                  00442000
CSOANOC  EQU   CSOAFLG                                                  00443000
CSOAVNP  EQU   CSOAFLG                                                  00444000
CSOAVWP  EQU   CSOAFLG                                                  00445000
CSOALNM  EQU   CSOA+4                                                   00446000
CSOACNM  EQU   CSOA                                                     00447000
BVT99999 EQU   BVT+256                                                  00448000
BVT0064P EQU   BVT+252                                                  00449000
BVT0063P EQU   BVT+248                                                  00450000
BVT0062P EQU   BVT+244                                                  00451000
BVT0061P EQU   BVT+240                                                  00452000
BVT0060P EQU   BVT+236                                                  00453000
BVT0059P EQU   BVT+232                                                  00454000
BVT0057P EQU   BVT+224                                                  00455000
BVT0056P EQU   BVT+220                                                  00456000
BVTSTBLP EQU   BVT+200                                                  00457000
BVT0045P EQU   BVT+176                                                  00458000
BVT0044P EQU   BVT+172                                                  00459000
BVT0033P EQU   BVT+128                                                  00460000
BVT0032P EQU   BVT+124                                                  00461000
BVT0031P EQU   BVT+120                                                  00462000
BVT0030P EQU   BVT+116                                                  00463000
BVT0029P EQU   BVT+112                                                  00464000
BVT0026P EQU   BVT+100                                                  00465000
BVT0025P EQU   BVT+96                                                   00466000
BVT0024P EQU   BVT+92                                                   00467000
BVT0023P EQU   BVT+88                                                   00468000
BVT0016P EQU   BVT+60                                                   00469000
BVT0015P EQU   BVT+56                                                   00470000
BVT0014P EQU   BVT+52                                                   00471000
BVTMON2P EQU   BVT+44                                                   00472000
BVT0003P EQU   BVT+8                                                    00473000
BVT0001P EQU   BVT                                                      00474000
SA99     EQU   SA+72                                                    00475000
SARC     EQU   SAR+56                                                   00476000
SARB     EQU   SAR+52                                                   00477000
SARA     EQU   SAR+48                                                   00478000
SAR9     EQU   SAR+44                                                   00479000
SAR8     EQU   SAR+40                                                   00480000
SAR7     EQU   SAR+36                                                   00481000
SAR6     EQU   SAR+32                                                   00482000
SAR5     EQU   SAR+28                                                   00483000
SAR4     EQU   SAR+24                                                   00484000
SAR3     EQU   SAR+20                                                   00485000
SAR2     EQU   SAR+16                                                   00486000
SAR0     EQU   SAR+8                                                    00487000
SARF     EQU   SAR+4                                                    00488000
SARE     EQU   SAR                                                      00489000
SAFWD    EQU   SA+8                                                     00490000
SABAK    EQU   SA+4                                                     00491000
SA1L     EQU   SA1+1                                                    00492000
SA1P     EQU   SA1                                                      00493000
UPTPREFL EQU   UPT+23                                                   00494000
UPTPREFX EQU   UPT+16                                                   00495000
@NM00068 EQU   UPT+15                                                   00496000
UPTLDEL  EQU   UPT+14                                                   00497000
UPTCDEL  EQU   UPT+13                                                   00498000
UPTWTP   EQU   UPTSWS                                                   00499000
UPTMODE  EQU   UPTSWS                                                   00500000
UPTALD   EQU   UPTSWS                                                   00501000
UPTPAUS  EQU   UPTSWS                                                   00502000
UPTNCOM  EQU   UPTSWS                                                   00503000
UPTMID   EQU   UPTSWS                                                   00504000
UPTNPRM  EQU   UPTSWS                                                   00505000
UPTRCVR  EQU   UPTSWS                                                   00506000
UPTUSER  EQU   UPT+2                                                    00507000
@NM00067 EQU   UPT                                                      00508000
@NM00066 EQU   ECT+52                                                   00509000
@NM00065 EQU   ECT+48                                                   00510000
@NM00064 EQU   ECT+44                                                   00511000
@NM00063 EQU   ECTSWS2+1                                                00512000
@NM00062 EQU   ECTSWS21                                                 00513000
ECTTABND EQU   ECTSWS21                                                 00514000
ECTDEFCS EQU   ECTSWS21                                                 00515000
ECTBKPB  EQU   ECT+36                                                   00516000
ECTUSER  EQU   ECT+32                                                   00517000
ECTDDNUM EQU   ECT+29                                                   00518000
ECTATTN  EQU   ECTSWS                                                   00519000
ECTBKGRD EQU   ECTSWS                                                   00520000
ECTNNOT  EQU   ECTSWS                                                   00521000
ECTNMAL  EQU   ECTSWS                                                   00522000
ECTLOGF  EQU   ECTSWS                                                   00523000
ECTATRM  EQU   ECTSWS                                                   00524000
@NM00061 EQU   ECTSWS                                                   00525000
ECTNOPD  EQU   ECTSWS                                                   00526000
ECTSCMD  EQU   ECT+20                                                   00527000
ECTPCMD  EQU   ECT+12                                                   00528000
ECTSMSG  EQU   ECT+9                                                    00529000
ECTMSGF  EQU   ECT+8                                                    00530000
ECTIOWA  EQU   ECT+4                                                    00531000
ECTRTCD  EQU   ECT+1                                                    00532000
ECTRCDF  EQU   ECT                                                      00533000
PSCBU    EQU   PSCB+64                                                  00534000
PSCBRSZ  EQU   PSCB+60                                                  00535000
PSCBLINE EQU   PSCB+59                                                  00536000
PSCBCHAR EQU   PSCB+58                                                  00537000
PSCBUPTL EQU   PSCB+56                                                  00538000
PSCBUPT  EQU   PSCB+52                                                  00539000
PSCBRLGB EQU   PSCB+48                                                  00540000
PSCBDEST EQU   PSCB+40                                                  00541000
@NM00060 EQU   PSCB+36                                                  00542000
@NM00059 EQU   PSCB+32                                                  00543000
@NM00058 EQU   PSCB+28                                                  00544000
PSCBLTI2 EQU   PSCB+24                                                  00545000
PSCBLTIM EQU   PSCB+20                                                  00546000
PSCBATR2 EQU   PSCB+18                                                  00547000
@NM00057 EQU   PSCBATR1                                                 00548000
@NM00056 EQU   PSCBATR1                                                 00549000
@NM00055 EQU   PSCBATR1                                                 00550000
PSCBATTN EQU   PSCBATR1                                                 00551000
PSCBVMNT EQU   PSCBATR1                                                 00552000
PSCBJCL  EQU   PSCBATR1                                                 00553000
PSCBACCT EQU   PSCBATR1                                                 00554000
PSCBCTRL EQU   PSCBATR1                                                 00555000
PSCBGPNM EQU   PSCB+8                                                   00556000
PSCBUSRL EQU   PSCB+7                                                   00557000
PSCBUSER EQU   PSCB                                                     00558000
CMDT1    EQU   CMDT                                                     00559000
CMDO     EQU   CMD+2                                                    00560000
CMDL     EQU   CMD                                                      00561000
ZZ299999 EQU   ZZ2+8192                                                 00562000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  00563000
ZZ2AXOL  EQU   ZZ2AXO                                                   00564000
@NM00054 EQU   ZZ2+7288                                                 00565000
@NM00053 EQU   ZZ2AMDX+4                                                00566000
ZZ2AMDXC EQU   ZZ2AMDX                                                  00567000
ZZ2HSD   EQU   ZZ2+3056                                                 00568000
@NM00052 EQU   ZZ2ES                                                    00569000
@NM00051 EQU   ZZ2+2868                                                 00570000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                00571000
@NM00050 EQU   ZZ2ITSE                                                  00572000
ZZ2ITSEP EQU   ZZ2ITSE                                                  00573000
ZZ2ITSEW EQU   ZZ2ITSE                                                  00574000
@NM00049 EQU   ZZ2ITR+20                                                00575000
ZZ2ITREC EQU   ZZ2ITRE+1                                                00576000
@NM00048 EQU   ZZ2ITRE                                                  00577000
ZZ2ITREP EQU   ZZ2ITRE                                                  00578000
ZZ2ITREW EQU   ZZ2ITRE                                                  00579000
@NM00047 EQU   ZZ2ITR+9                                                 00580000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 00581000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 00582000
ZZ2ITRPP EQU   ZZ2ITR                                                   00583000
@NM00046 EQU   ZZ2+1544                                                 00584000
ZZ2PGM   EQU   ZZ2+1536                                                 00585000
@NM00045 EQU   ZZ2+1526                                                 00586000
ZZ2CW    EQU   ZZ2+1524                                                 00587000
@NM00044 EQU   ZZ2+1504                                                 00588000
@NM00043 EQU   ZZ2+1352                                                 00589000
ZZ2FFSYP EQU   ZZ2+1348                                                 00590000
ZZ2SASYP EQU   ZZ2+1344                                                 00591000
ZZ2RDSYP EQU   ZZ2+1340                                                 00592000
ZZ2RASYP EQU   ZZ2+1336                                                 00593000
ZZ2PHSYP EQU   ZZ2+1332                                                 00594000
ZZ2ESSYP EQU   ZZ2+1328                                                 00595000
ZZ200SYP EQU   ZZ2+1324                                                 00596000
ZZ2SCWP  EQU   ZZ2+1320                                                 00597000
ZZ2TTLP  EQU   ZZ2+1316                                                 00598000
ZZ2LOADP EQU   ZZ2+1312                                                 00599000
ZZ2VRESP EQU   ZZ2+1308                                                 00600000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               00601000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                00602000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                00603000
ZZ2VRSAP EQU   ZZ2+1288                                                 00604000
ZZ2RVTP  EQU   ZZ2+1284                                                 00605000
ZZ2DVTP  EQU   ZZ2+1276                                                 00606000
@NM00042 EQU   ZZ2+1272                                                 00607000
@NM00041 EQU   ZZ2+1268                                                 00608000
ZZ2RPLP  EQU   ZZ2+1260                                                 00609000
ZZ2TCBP  EQU   ZZ2+1256                                                 00610000
@NM00040 EQU   ZZ2+1252                                                 00611000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 00612000
@NM00039 EQU   ZZ2+1112                                                 00613000
ZZ2FPDRP EQU   ZZ2+1108                                                 00614000
ZZ2FDSDP EQU   ZZ2+1104                                                 00615000
ZZ2APDRP EQU   ZZ2+1100                                                 00616000
ZZ2ADSDP EQU   ZZ2+1096                                                 00617000
ZZ2ENQ0P EQU   ZZ2+1092                                                 00618000
@NM00038 EQU   ZZ2+1080                                                 00619000
ZZ2MSG0P EQU   ZZ2+1076                                                 00620000
ZZ2FT25P EQU   ZZ2+1072                                                 00621000
ZZ2MSGSP EQU   ZZ2+1060                                                 00622000
ZZ2ALOCP EQU   ZZ2+1056                                                 00623000
@NM00037 EQU   ZZ2+976                                                  00624000
ZZ2TOD   EQU   ZZ2+968                                                  00625000
ZZ2STGN  EQU   ZZ2STG+4                                                 00626000
ZZ2STGP  EQU   ZZ2STG                                                   00627000
@NM00036 EQU   ZZ2+952                                                  00628000
ZZ2SCMDE EQU   ZZ2+944                                                  00629000
ZZ2SCMDN EQU   ZZ2+936                                                  00630000
ZZ2IDENT EQU   ZZ2+928                                                  00631000
ZZ2A9999 EQU   ZZ2A+656                                                 00632000
@NM00035 EQU   ZZ2A+224                                                 00633000
@NM00034 EQU   ZZ2A+220                                                 00634000
ZZ2AQD99 EQU   ZZ2AQD+60                                                00635000
@NM00033 EQU   ZZ2AQD+56                                                00636000
@NM00032 EQU   ZZ2AQDF                                                  00637000
ZZ2AQDFA EQU   ZZ2AQDF                                                  00638000
ZZ2AQDIL EQU   ZZ2AQD+48                                                00639000
ZZ2AQDIM EQU   ZZ2AQD+44                                                00640000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               00641000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               00642000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                00643000
@NM00031 EQU   ZZ2AQDT+1                                                00644000
ZZ2AQDTY EQU   ZZ2AQDT                                                  00645000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  00646000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 00647000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 00648000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 00649000
ZZ2AQDOF EQU   ZZ2AQD                                                   00650000
ZZ2AQD00 EQU   ZZ2AQD                                                   00651000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               00652000
@NM00030 EQU   ZZ2AQAS+12                                               00653000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                00654000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                00655000
@NM00029 EQU   ZZ2AQAS+2                                                00656000
ZZ2AQAST EQU   ZZ2AQAS                                                  00657000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  00658000
ZZ2AZZ6P EQU   ZZ2A+140                                                 00659000
ZZ2ADPTA EQU   ZZ2ADPT                                                  00660000
ZZ2ADPL  EQU   ZZ2ADP                                                   00661000
ZZ2ADMTA EQU   ZZ2ADMT                                                  00662000
ZZ2ADML  EQU   ZZ2ADM                                                   00663000
ZZ2ADDTA EQU   ZZ2ADDT                                                  00664000
ZZ2ADDL  EQU   ZZ2ADD                                                   00665000
@NM00028 EQU   ZZ2A+72                                                  00666000
ZZ2APIDB EQU   ZZ2APID+3                                                00667000
ZZ2APIDA EQU   ZZ2APID                                                  00668000
@NM00027 EQU   ZZ2A+24                                                  00669000
@NM00026 EQU   ZZ2AF+5                                                  00670000
ZZ2AFX   EQU   ZZ2AF+5                                                  00671000
@NM00025 EQU   ZZ2AF+3                                                  00672000
ZZ2AFS   EQU   ZZ2AF+2                                                  00673000
ZZ2AFD   EQU   ZZ2AF+2                                                  00674000
ZZ2AFQ   EQU   ZZ2AF+2                                                  00675000
ZZ2AF$   EQU   ZZ2AF+2                                                  00676000
@NM00024 EQU   ZZ2AF+2                                                  00677000
ZZ2AFM   EQU   ZZ2AF+2                                                  00678000
@NM00023 EQU   ZZ2AF+2                                                  00679000
@NM00022 EQU   ZZ2AF+1                                                  00680000
ZZ2AFV   EQU   ZZ2AF+1                                                  00681000
@NM00021 EQU   ZZ2AF+1                                                  00682000
ZZ2AFC   EQU   ZZ2AF+1                                                  00683000
@NM00020 EQU   ZZ2AF                                                    00684000
ZZ2AFFS  EQU   ZZ2AF                                                    00685000
ZZ2AFT   EQU   ZZ2AF                                                    00686000
ZZ2AFP   EQU   ZZ2AF                                                    00687000
@NM00019 EQU   ZZ2A+8                                                   00688000
ZZ2ALINE EQU   ZZ2A+4                                                   00689000
@NM00018 EQU   ZZ2A+3                                                   00690000
ZZ2ASE   EQU   ZZ2A+2                                                   00691000
ZZ2ACH   EQU   ZZ2A                                                     00692000
@NM00017 EQU   ZZ2+264                                                  00693000
@NM00016 EQU   ZZ2+263                                                  00694000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  00695000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 00696000
ZZ2PRTL  EQU   ZZ2PRT                                                   00697000
@NM00015 EQU   ZZ2AMD+56                                                00698000
ZZ2AMDXP EQU   ZZ2AMD+52                                                00699000
ZZ2AMDD  EQU   ZZ2AMD+48                                                00700000
ZZ2AMDL  EQU   ZZ2AMD+44                                                00701000
ZZ2AMDU  EQU   ZZ2AMD+28                                                00702000
ZZ2AMDF  EQU   ZZ2AMD+24                                                00703000
ZZ2AMDS  EQU   ZZ2AMD+20                                                00704000
ZZ2AMDC  EQU   ZZ2AMD+16                                                00705000
ZZ2AMDP  EQU   ZZ2AMD+12                                                00706000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 00707000
@NM00014 EQU   @NM00013                                                 00708000
ZZ2AMD2  EQU   @NM00013                                                 00709000
ZZ2AMD1  EQU   @NM00013                                                 00710000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 00711000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 00712000
ZZ2AMDT  EQU   ZZ2AMD                                                   00713000
ZZ199999 EQU   ZZ1+3072                                                 00714000
@NM00012 EQU   ZZ1+2160                                                 00715000
ZZ1TRTAS EQU   ZZ1+1904                                                 00716000
ZZ1TRUPC EQU   ZZ1+1648                                                 00717000
ZZ1TRCTX EQU   ZZ1+1392                                                 00718000
ZZ1NASID EQU   ZZ1N+274                                                 00719000
ZZ1NSTRL EQU   ZZ1N+272                                                 00720000
ZZ1NOFF  EQU   ZZ1N+268                                                 00721000
ZZ1NBDY  EQU   ZZ1N+264                                                 00722000
ZZ1NADE  EQU   ZZ1N+260                                                 00723000
ZZ1NADB  EQU   ZZ1N+256                                                 00724000
ZZ1NSTR  EQU   ZZ1N                                                     00725000
@NM00011 EQU   ZZ1+1080                                                 00726000
ZZ1TREBC EQU   ZZ1+824                                                  00727000
ZZ1TRHEX EQU   ZZ1+568                                                  00728000
@NM00010 EQU   ZZ1+377                                                  00729000
ZZ1USTAE EQU   ZZ1+376                                                  00730000
@NM00009 EQU   ZZ1F+1                                                   00731000
@NM00008 EQU   ZZ1F                                                     00732000
ZZ1FM    EQU   ZZ1F                                                     00733000
ZZ1FX    EQU   ZZ1F                                                     00734000
ZZ1FU    EQU   ZZ1F                                                     00735000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 00736000
@NM00007 EQU   ZZ1EVE                                                   00737000
ZZ1EVEP  EQU   ZZ1EVE                                                   00738000
ZZ1EVEW  EQU   ZZ1EVE                                                   00739000
ZZ1ACMP  EQU   ZZ1ATTN                                                  00740000
@NM00006 EQU   ZZ1+144                                                  00741000
ZZ1FPP   EQU   ZZ1+140                                                  00742000
ZZ1ZZ6P  EQU   ZZ1+136                                                  00743000
@NM00005 EQU   ZZ1+84                                                   00744000
ZZ1PLINE EQU   ZZ1+80                                                   00745000
ZZ1PGSZ  EQU   ZZ1+76                                                   00746000
ZZ1PCNT  EQU   ZZ1+72                                                   00747000
@NM00004 EQU   ZZ1+68                                                   00748000
ZZ1TPAGE EQU   ZZ1+64                                                   00749000
ZZ1TLINE EQU   ZZ1+60                                                   00750000
@NM00003 EQU   ZZ1+48                                                   00751000
ZZ1DSDP  EQU   ZZ1+44                                                   00752000
ZZ1PDRP  EQU   ZZ1+40                                                   00753000
ZZ1ZZ2P  EQU   ZZ1+36                                                   00754000
ZZ1327WP EQU   ZZ1+32                                                   00755000
ZZ1ACBP  EQU   ZZ1+28                                                   00756000
@NM00002 EQU   ZZ1+24                                                   00757000
ZZ1PDCBP EQU   ZZ1+20                                                   00758000
ZZ1BLRBL EQU   ZZ1+16                                                   00759000
@NM00001 EQU   ZZ1+12                                                   00760000
ZZ1PNULL EQU   ZZ1+8                                                    00761000
ZZ1NULL  EQU   ZZ1+4                                                    00762000
ZZ1IDE   EQU   ZZ1                                                      00763000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00764000
@ENDDATA EQU   *                                                        00765000
         END   BLSUMON2,(C'PLS2311',0701,78059)                         00766000
