MPKN     TITLE 'BLSUMPKN--COMPRESS A MESSAGE                           *00001000
                        '                                               00002000
*/* CHANGE ACTIVITY -------------------------------------------------*/ 00003000
*/*   THIS MODULE WAS WRITTEN FOR @G57LPRW                           */ 00004000
*/*------------------------------------------------------------------*/ 00005000
BLSUMPKN CSECT ,                                                01S0002 00006000
@MAINENT DS    0H                                               01S0002 00007000
         USING *,@15                                            01S0002 00008000
         B     @PROLOG                                          01S0002 00009000
         DC    AL1(16)                                          01S0002 00010000
         DC    C'BLSUMPKN  78.059'                              01S0002 00011000
         DROP  @15                                                      00012000
@PROLOG  STM   @14,@12,12(@13)                                  01S0002 00013000
         BALR  @12,0                                            01S0002 00014000
@PSTART  DS    0H                                               01S0002 00015000
         USING @PSTART,@12                                      01S0002 00016000
*   LM(R9,RB,PARM);                 /* ->ZZ2, ->MSG, ->COLP          */ 00017000
         LM    R9,RB,PARM(R1)                                   01S0079 00018000
*   COLX=COLP;                      /* LAST COLUMN TO RETAIN         */ 00019000
         L     COLX,COLP(,RB)                                   01S0080 00020000
*   PI=ADDR(MSGT(COLX+1));          /* ->FIRST COLUMN TO SCAN        */ 00021000
         LA    PI,MSGT(COLX,RA)                                 01S0081 00022000
*   PL=ADDR(MSGT(COLX+2));          /* ->LAST COLUMN TO SCAN         */ 00023000
         LA    PL,MSGT+1(COLX,RA)                               01S0082 00024000
*/*------------------------------------------------------------------*/ 00025000
*/* SCAN FINAL COLUMN(S)                                             */ 00026000
*/*------------------------------------------------------------------*/ 00027000
*                                                               01S0083 00028000
*   DO PS=ADDR(MSG(MIN(MSGL,LENGTH(MSGT)))) TO PL BY-1;         01S0083 00029000
         SLR   @08,@08                                          01S0083 00030000
         ICM   @08,3,MSGL(RA)                                   01S0083 00031000
         LA    @07,257                                          01S0083 00032000
         CR    @08,@07                                          01S0083 00033000
         BNH   *+6                                                      00034000
         LR    @08,@07                                          01S0083 00035000
         BCTR  @08,0                                            01S0083 00036000
         LA    PS,MSG(@08,RA)                                   01S0083 00037000
         B     @DE00083                                         01S0083 00038000
@DL00083 DS    0H                                               01S0084 00039000
*     TRT(CS,BLSUMPKS);             /* SCAN FINAL COLUMN(S)          */ 00040000
         TRT   CS(1,PS),BLSUMPKS                                01S0084 00041000
*     BC(8,L010);                   /* SCAN INITIAL COLUMN(S)        */ 00042000
         BC    8,L010                                           01S0085 00043000
*   END;                            /* SCAN FINAL COLUMN(S)          */ 00044000
         BCTR  PS,0                                             01S0086 00045000
@DE00083 CR    PS,PL                                            01S0086 00046000
         BNL   @DL00083                                         01S0086 00047000
*L010:                              /* SCAN INITIAL COLUMN(S)        */ 00048000
*   PL=PS;                          /* ->LIMIT COLUMN FOR SCAN       */ 00049000
L010     LR    PL,PS                                            01S0087 00050000
*   PS=PI;                          /* ->SCAN COLUMN                 */ 00051000
         LR    PS,PI                                            01S0088 00052000
*/*------------------------------------------------------------------*/ 00053000
*/* SCAN NON-TRAILING COLUMN(S)                                      */ 00054000
*/*------------------------------------------------------------------*/ 00055000
*                                                               01S0089 00056000
*   DO WHILE(PS<PL);                /* SCAN NON-TRAILING COLUMN(S)   */ 00057000
         B     @DE00089                                         01S0089 00058000
@DL00089 DS    0H                                               01S0090 00059000
*     IF PS=PI THEN                 /* SCAN INITIAL COLUMN           */ 00060000
*                                                               01S0090 00061000
         CR    PS,PI                                            01S0090 00062000
         BNE   @RF00090                                         01S0090 00063000
*       /*************************************************************/ 00064000
*       /*                                                           */ 00065000
*       /* SCAN INITIAL COLUMN                                       */ 00066000
*       /*                                                           */ 00067000
*       /*************************************************************/ 00068000
*                                                               01S0091 00069000
*       DO;                         /* SCAN INITIAL COLUMN           */ 00070000
*         TRT(CS,BLSUMPKS);         /* SCAN INITIAL COLUMN           */ 00071000
         TRT   CS(1,PS),BLSUMPKS                                01S0092 00072000
*         BC(7,L020);               /* EXTRANEOUS BLANK              */ 00073000
         BC    7,L020                                           01S0093 00074000
*       END;                        /* SCAN INITIAL COLUMN           */ 00075000
*     ELSE                          /* SCAN NON-TERMINAL COLUMN(S)   */ 00076000
*                                                               01S0095 00077000
*       /*************************************************************/ 00078000
*       /*                                                           */ 00079000
*       /* SCAN NON-TERMINAL COLUMN(S)                               */ 00080000
*       /*                                                           */ 00081000
*       /*************************************************************/ 00082000
*                                                               01S0095 00083000
*       DO;                         /* SCAN NON-TERMINAL COLUMN(S)   */ 00084000
         B     @RC00090                                         01S0095 00085000
@RF00090 DS    0H                                               01S0096 00086000
*         TRT(CR(1:PL-PS),BLSUMPKS);/* SCAN NON-TERMINAL COLUMN(S)   */ 00087000
         LR    @03,PL                                           01S0096 00088000
         SLR   @03,PS                                           01S0096 00089000
         BCTR  @03,0                                            01S0096 00090000
         EX    @03,@SB00727                                     01S0096 00091000
*         BC(8,EXIT);               /* MESSAGE COMPRESSED            */ 00092000
         BC    8,EXIT                                           01S0097 00093000
*         PS=R1;                    /* ->SCAN COLUMN                 */ 00094000
         LR    PS,R1                                            01S0098 00095000
*         TRT(CP,BLSUMPKB);         /* PRECEDING COLUMN              */ 00096000
         LR    @03,PS                                           01S0099 00097000
         BCTR  @03,0                                            01S0099 00098000
         TRT   CP(1,@03),BLSUMPKB                               01S0099 00099000
*         BC(7,L020);               /* EXTRANEOUS BLANK              */ 00100000
         BC    7,L020                                           01S0100 00101000
*         TRT(CF,BLSUMPKF);         /* FOLLOWING COLUMN              */ 00102000
         TRT   CF(1,PS),BLSUMPKF                                01S0101 00103000
*         BC(7,L020);               /* EXTRANEOUS BLANK              */ 00104000
         BC    7,L020                                           01S0102 00105000
*         TR(CS,BLSUMPKS);          /* NON-GRAPHIC=>BLANK            */ 00106000
         TR    CS(1,PS),BLSUMPKS                                01S0103 00107000
*       END;                        /* SCAN NON-TERMINAL COLUMN(S)   */ 00108000
*     PS=PS+1;                      /* ->SCAN COLUMN                 */ 00109000
@RC00090 AH    PS,@CH00037                                      01S0105 00110000
*     GO TO L030;                   /* CONTINUE SCAN LOOP            */ 00111000
         B     L030                                             01S0106 00112000
*L020:                              /* EXTRANEOUS BLANK              */ 00113000
*     IF PS<PL THEN                 /* STRIP EXTRANEOUS BLANK        */ 00114000
*                                                               01S0107 00115000
L020     CR    PS,PL                                            01S0107 00116000
         BNL   @RF00107                                         01S0107 00117000
*       /*************************************************************/ 00118000
*       /*                                                           */ 00119000
*       /* STRIP EXTRANEOUS BLANK                                    */ 00120000
*       /*                                                           */ 00121000
*       /*************************************************************/ 00122000
*                                                               01S0108 00123000
*       DO;                         /* STRIP EXTRANEOUS BLANK        */ 00124000
*         MVC(CR(1:PL-PS),CR(2:PL-PS+1));/* STRIP EXTRANEOUS BLANK   */ 00125000
         LR    @08,PL                                           01S0109 00126000
         SLR   @08,PS                                           01S0109 00127000
         BCTR  @08,0                                            01S0109 00128000
         EX    @08,@SM00729                                     01S0109 00129000
*         PL=PL-1;                  /* ->LIMIT COLUMN FOR SCAN       */ 00130000
         BCTR  PL,0                                             01S0110 00131000
*       END;                        /* STRIP EXTRANEOUS BLANK        */ 00132000
*L030:                              /* CONTINUE SCAN LOOP            */ 00133000
*   END;                            /* SCAN NON-TRAILING COLUMN(S)   */ 00134000
@RF00107 DS    0H                                               01S0112 00135000
L030     DS    0H                                               01S0112 00136000
@DE00089 CR    PS,PL                                            01S0112 00137000
         BL    @DL00089                                         01S0112 00138000
*EXIT:                              /* MESSAGE TEXT COMPRESSED       */ 00139000
*   MSGL=PL-ADDR(MSG)+1;            /* MESSAGE LENGTH                */ 00140000
EXIT     LR    @08,PL                                           01S0113 00141000
         SLR   @08,RA                                           01S0113 00142000
         AH    @08,@CH00037                                     01S0113 00143000
         STH   @08,MSGL(,RA)                                    01S0113 00144000
*   RETURN CODE(0);                                             01S0114 00145000
*                                                               01S0114 00146000
         SLR   @15,@15                                          01S0114 00147000
         L     @14,12(,@13)                                     01S0114 00148000
         LM    @00,@12,20(@13)                                  01S0114 00149000
         BR    @14                                              01S0114 00150000
*/*BLSUPEND--MVS IPCS MODULE                                         */ 00151000
*                                                               01S0115 00152000
*   DECLARE                         /* COMMON VARIABLES              */ 00153000
*     I256C CHAR(256) BASED,                                    01S0115 00154000
*     I031F FIXED(31) BASED,                                    01S0115 00155000
*     I031P PTR(31) BASED,                                      01S0115 00156000
*     I015F FIXED(15) BASED,                                    01S0115 00157000
*     I015P PTR(15) BASED,                                      01S0115 00158000
*     I008P PTR(8) BASED,                                       01S0115 00159000
*     I001C CHAR(1) BASED;                                      01S0115 00160000
*   GENERATE NODEFS NOREFS DATA;                                01S0116 00161000
*   END BLSUMPKN                    /* BLRPEND(BLSUMPKN)             */ 00162000
*                                                               01S0117 00163000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00164000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00165000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00166000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00167000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00168000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00169000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00170000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00171000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00172000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00173000
*/*%INCLUDE SYSLIB  (BLSUMPKB)                                       */ 00174000
*/*%INCLUDE SYSLIB  (BLSUMPKF)                                       */ 00175000
*/*%INCLUDE SYSLIB  (BLSUMPKS)                                       */ 00176000
*                                                               01S0117 00177000
*       ;                                                       01S0117 00178000
@EL00001 DS    0H                                               01S0117 00179000
@EF00001 DS    0H                                               01S0117 00180000
@ER00001 LM    @14,@12,12(@13)                                  01S0117 00181000
         BR    @14                                              01S0117 00182000
@DATA    DS    0H                                                       00183000
@CH00037 DC    H'1'                                                     00184000
@SB00727 TRT   CR(0,PS),BLSUMPKS                                        00185000
@SM00729 MVC   CR(0,PS),CR+1(PS)                                        00186000
@DATD    DSECT                                                          00187000
         DS    0F                                                       00188000
BLSUMPKN CSECT                                                          00189000
         DS    0F                                                       00190000
@DATD    DSECT                                                          00191000
         DS    0D                                                       00192000
BLSUMPKN CSECT                                                          00193000
         NOPR  ((@ENDDATD-@DATD)*16)                                    00194000
         DS    0F                                                       00195000
@SIZDATD DC    AL1(0)                                                   00196000
         DC    AL3(@ENDDATD-@DATD)                                      00197000
         DS    0D                                                       00198000
BLSUMPKB DS    CL256                                                    00199000
         ORG   BLSUMPKB                                                 00200000
@NM00069 DC    64CL1' '                                                 00201000
         DC    CL1' '                                                   00202000
         DC    9CL1' '                                                  00203000
         DC    X'00'                                                    00204000
         DC    X'00'                                                    00205000
         DC    X'4C'                                                    00206000
         DC    X'4D'                                                    00207000
         DC    X'4E'                                                    00208000
         DC    X'4F'                                                    00209000
         DC    X'50'                                                    00210000
         DC    9CL1' '                                                  00211000
         DC    X'00'                                                    00212000
         DC    X'00'                                                    00213000
         DC    X'5C'                                                    00214000
         DC    X'00'                                                    00215000
         DC    X'00'                                                    00216000
         DC    X'5F'                                                    00217000
         DC    X'00'                                                    00218000
         DC    X'61'                                                    00219000
         DC    8CL1' '                                                  00220000
         DC    X'00'                                                    00221000
         DC    X'00'                                                    00222000
         DC    X'00'                                                    00223000
         DC    X'00'                                                    00224000
         DC    X'6E'                                                    00225000
         DC    X'00'                                                    00226000
         DC    9CL1' '                                                  00227000
         DC    X'00'                                                    00228000
         DC    X'7A'                                                    00229000
         DC    X'00'                                                    00230000
         DC    X'00'                                                    00231000
         DC    X'00'                                                    00232000
         DC    X'7E'                                                    00233000
         DC    X'00'                                                    00234000
         DC    CL1' '                                                   00235000
         DC    9X'00'                                                   00236000
         DC    CL1' '                                                   00237000
         DC    X'8B'                                                    00238000
         DC    X'8C'                                                    00239000
         DC    X'8D'                                                    00240000
         DC    X'8E'                                                    00241000
         DC    X'00'                                                    00242000
         DC    CL1' '                                                   00243000
         DC    9X'00'                                                   00244000
         DC    CL1' '                                                   00245000
         DC    X'00'                                                    00246000
         DC    X'00'                                                    00247000
         DC    X'00'                                                    00248000
         DC    X'9E'                                                    00249000
         DC    X'00'                                                    00250000
         DC    X'A0'                                                    00251000
         DC    X'00'                                                    00252000
         DC    8X'00'                                                   00253000
         DC    CL1' '                                                   00254000
         DC    X'00'                                                    00255000
         DC    X'00'                                                    00256000
         DC    X'AD'                                                    00257000
         DC    X'AE'                                                    00258000
         DC    X'00'                                                    00259000
         DC    10X'00'                                                  00260000
         DC    CL1' '                                                   00261000
         DC    X'00'                                                    00262000
         DC    X'00'                                                    00263000
         DC    X'00'                                                    00264000
         DC    X'BE'                                                    00265000
         DC    X'BF'                                                    00266000
         DC    X'C0'                                                    00267000
         DC    9X'00'                                                   00268000
         DC    2CL1' '                                                  00269000
         DC    X'00'                                                    00270000
         DC    CL1' '                                                   00271000
         DC    X'00'                                                    00272000
         DC    CL1' '                                                   00273000
         DC    X'00'                                                    00274000
         DC    9X'00'                                                   00275000
         DC    6CL1' '                                                  00276000
         DC    X'00'                                                    00277000
         DC    CL1' '                                                   00278000
         DC    8X'00'                                                   00279000
         DC    2CL1' '                                                  00280000
         DC    X'00'                                                    00281000
         DC    3CL1' '                                                  00282000
         DC    10X'00'                                                  00283000
         DC    X'00'                                                    00284000
         DC    5CL1' '                                                  00285000
         ORG   BLSUMPKB+256                                             00286000
BLSUMPKF DS    CL256                                                    00287000
         ORG   BLSUMPKF                                                 00288000
@NM00070 DC    64CL1' '                                                 00289000
         DC    CL1' '                                                   00290000
         DC    9CL1' '                                                  00291000
         DC    X'00'                                                    00292000
         DC    X'00'                                                    00293000
         DC    X'4C'                                                    00294000
         DC    X'00'                                                    00295000
         DC    X'4E'                                                    00296000
         DC    X'4F'                                                    00297000
         DC    X'50'                                                    00298000
         DC    9CL1' '                                                  00299000
         DC    X'00'                                                    00300000
         DC    X'00'                                                    00301000
         DC    X'5C'                                                    00302000
         DC    X'5D'                                                    00303000
         DC    X'00'                                                    00304000
         DC    X'5F'                                                    00305000
         DC    X'00'                                                    00306000
         DC    X'61'                                                    00307000
         DC    8CL1' '                                                  00308000
         DC    X'00'                                                    00309000
         DC    X'6B'                                                    00310000
         DC    X'00'                                                    00311000
         DC    X'00'                                                    00312000
         DC    X'6E'                                                    00313000
         DC    X'00'                                                    00314000
         DC    9CL1' '                                                  00315000
         DC    X'00'                                                    00316000
         DC    X'7A'                                                    00317000
         DC    X'00'                                                    00318000
         DC    X'00'                                                    00319000
         DC    X'00'                                                    00320000
         DC    X'7E'                                                    00321000
         DC    X'00'                                                    00322000
         DC    CL1' '                                                   00323000
         DC    9X'00'                                                   00324000
         DC    CL1' '                                                   00325000
         DC    X'00'                                                    00326000
         DC    X'8C'                                                    00327000
         DC    X'00'                                                    00328000
         DC    X'8E'                                                    00329000
         DC    X'00'                                                    00330000
         DC    CL1' '                                                   00331000
         DC    9X'00'                                                   00332000
         DC    CL1' '                                                   00333000
         DC    X'9B'                                                    00334000
         DC    X'00'                                                    00335000
         DC    X'9D'                                                    00336000
         DC    X'9E'                                                    00337000
         DC    X'00'                                                    00338000
         DC    X'A0'                                                    00339000
         DC    X'00'                                                    00340000
         DC    8X'00'                                                   00341000
         DC    CL1' '                                                   00342000
         DC    X'00'                                                    00343000
         DC    X'00'                                                    00344000
         DC    X'00'                                                    00345000
         DC    X'AE'                                                    00346000
         DC    X'00'                                                    00347000
         DC    10X'00'                                                  00348000
         DC    CL1' '                                                   00349000
         DC    X'00'                                                    00350000
         DC    X'00'                                                    00351000
         DC    X'BD'                                                    00352000
         DC    X'BE'                                                    00353000
         DC    X'BF'                                                    00354000
         DC    X'00'                                                    00355000
         DC    9X'00'                                                   00356000
         DC    2CL1' '                                                  00357000
         DC    X'00'                                                    00358000
         DC    CL1' '                                                   00359000
         DC    X'00'                                                    00360000
         DC    CL1' '                                                   00361000
         DC    X'D0'                                                    00362000
         DC    9X'00'                                                   00363000
         DC    6CL1' '                                                  00364000
         DC    X'00'                                                    00365000
         DC    CL1' '                                                   00366000
         DC    8X'00'                                                   00367000
         DC    2CL1' '                                                  00368000
         DC    X'00'                                                    00369000
         DC    3CL1' '                                                  00370000
         DC    10X'00'                                                  00371000
         DC    X'00'                                                    00372000
         DC    5CL1' '                                                  00373000
         ORG   BLSUMPKF+256                                             00374000
BLSUMPKS DS    CL256                                                    00375000
         ORG   BLSUMPKS                                                 00376000
@NM00071 DC    64CL1' '                                                 00377000
         DC    CL1' '                                                   00378000
         DC    9CL1' '                                                  00379000
         DC    X'00'                                                    00380000
         DC    X'00'                                                    00381000
         DC    X'00'                                                    00382000
         DC    X'00'                                                    00383000
         DC    X'00'                                                    00384000
         DC    X'00'                                                    00385000
         DC    X'00'                                                    00386000
         DC    9CL1' '                                                  00387000
         DC    X'00'                                                    00388000
         DC    X'00'                                                    00389000
         DC    X'00'                                                    00390000
         DC    X'00'                                                    00391000
         DC    X'00'                                                    00392000
         DC    X'00'                                                    00393000
         DC    X'00'                                                    00394000
         DC    X'00'                                                    00395000
         DC    8CL1' '                                                  00396000
         DC    X'00'                                                    00397000
         DC    X'00'                                                    00398000
         DC    X'00'                                                    00399000
         DC    X'00'                                                    00400000
         DC    X'00'                                                    00401000
         DC    X'00'                                                    00402000
         DC    9CL1' '                                                  00403000
         DC    X'00'                                                    00404000
         DC    X'00'                                                    00405000
         DC    X'00'                                                    00406000
         DC    X'00'                                                    00407000
         DC    X'00'                                                    00408000
         DC    X'00'                                                    00409000
         DC    X'00'                                                    00410000
         DC    CL1' '                                                   00411000
         DC    9X'00'                                                   00412000
         DC    CL1' '                                                   00413000
         DC    X'00'                                                    00414000
         DC    X'00'                                                    00415000
         DC    X'00'                                                    00416000
         DC    X'00'                                                    00417000
         DC    X'00'                                                    00418000
         DC    CL1' '                                                   00419000
         DC    9X'00'                                                   00420000
         DC    CL1' '                                                   00421000
         DC    X'00'                                                    00422000
         DC    X'00'                                                    00423000
         DC    X'00'                                                    00424000
         DC    X'00'                                                    00425000
         DC    X'00'                                                    00426000
         DC    X'00'                                                    00427000
         DC    X'00'                                                    00428000
         DC    8X'00'                                                   00429000
         DC    CL1' '                                                   00430000
         DC    X'00'                                                    00431000
         DC    X'00'                                                    00432000
         DC    X'00'                                                    00433000
         DC    X'00'                                                    00434000
         DC    X'00'                                                    00435000
         DC    10X'00'                                                  00436000
         DC    CL1' '                                                   00437000
         DC    X'00'                                                    00438000
         DC    X'00'                                                    00439000
         DC    X'00'                                                    00440000
         DC    X'00'                                                    00441000
         DC    X'00'                                                    00442000
         DC    X'00'                                                    00443000
         DC    9X'00'                                                   00444000
         DC    2CL1' '                                                  00445000
         DC    X'00'                                                    00446000
         DC    CL1' '                                                   00447000
         DC    X'00'                                                    00448000
         DC    CL1' '                                                   00449000
         DC    X'00'                                                    00450000
         DC    9X'00'                                                   00451000
         DC    6CL1' '                                                  00452000
         DC    X'00'                                                    00453000
         DC    CL1' '                                                   00454000
         DC    8X'00'                                                   00455000
         DC    2CL1' '                                                  00456000
         DC    X'00'                                                    00457000
         DC    3CL1' '                                                  00458000
         DC    10X'00'                                                  00459000
         DC    X'00'                                                    00460000
         DC    5CL1' '                                                  00461000
         ORG   BLSUMPKS+256                                             00462000
@DATD    DSECT                                                          00463000
         SPACE 2                                                        00464000
*********************************************************************** 00465000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00466000
*********************************************************************** 00467000
         SPACE                                                          00468000
BLSUMPKN CSECT                                                          00469000
         ORG                                                            00470000
         DS    0D                                                       00471000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSUMPKN+19)/20+7)/8)CL8'BLSUMPKN'     00472000
@DATD    DSECT                                                          00473000
         SPACE 2                                                        00474000
*********************************************************************** 00475000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 00476000
*********************************************************************** 00477000
         SPACE                                                          00478000
         DS    0D                                                       00479000
@DATD    DSECT                                                          00480000
@ENDDATD EQU   *                                                        00481000
BLSUMPKN CSECT                                                          00482000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00483000
@01      EQU   01                                                       00484000
@02      EQU   02                                                       00485000
@03      EQU   03                                                       00486000
@04      EQU   04                                                       00487000
@05      EQU   05                                                       00488000
@06      EQU   06                                                       00489000
@07      EQU   07                                                       00490000
@08      EQU   08                                                       00491000
@09      EQU   09                                                       00492000
@10      EQU   10                                                       00493000
@11      EQU   11                                                       00494000
@12      EQU   12                                                       00495000
@13      EQU   13                                                       00496000
@14      EQU   14                                                       00497000
@15      EQU   15                                                       00498000
COLX     EQU   @04                                                      00499000
PS       EQU   @04                                                      00500000
PL       EQU   @05                                                      00501000
PI       EQU   @06                                                      00502000
R9       EQU   @09                                                      00503000
R0       EQU   @00                                                      00504000
R1       EQU   @01                                                      00505000
R2       EQU   @02                                                      00506000
R3       EQU   @03                                                      00507000
R4       EQU   @04                                                      00508000
R5       EQU   @05                                                      00509000
RA       EQU   @10                                                      00510000
RB       EQU   @11                                                      00511000
RD       EQU   @13                                                      00512000
RE       EQU   @14                                                      00513000
RF       EQU   @15                                                      00514000
RC       EQU   @12                                                      00515000
R6       EQU   @06                                                      00516000
R7       EQU   @07                                                      00517000
R8       EQU   @08                                                      00518000
ZZ1      EQU   0                                                        00519000
ZZ1ATTN  EQU   ZZ1+360                                                  00520000
ZZ1EVE   EQU   ZZ1ATTN+4                                                00521000
ZZ1F     EQU   ZZ1+368                                                  00522000
ZZ1N     EQU   ZZ1+1116                                                 00523000
ZZ2      EQU   0                                                        00524000
ZZ2AMD   EQU   ZZ2                                                      00525000
@NM00013 EQU   ZZ2AMD+7                                                 00526000
ZZ2PRT   EQU   ZZ2+138                                                  00527000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 00528000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                00529000
ZZ2A     EQU   ZZ2+272                                                  00530000
ZZ2AF    EQU   ZZ2A+16                                                  00531000
ZZ2APID  EQU   ZZ2A+64                                                  00532000
ZZ2AD    EQU   ZZ2A+74                                                  00533000
ZZ2ADD   EQU   ZZ2AD                                                    00534000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 00535000
ZZ2ADM   EQU   ZZ2AD+46                                                 00536000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 00537000
ZZ2ADP   EQU   ZZ2AD+56                                                 00538000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 00539000
ZZ2AQAS  EQU   ZZ2A+144                                                 00540000
ZZ2AQD   EQU   ZZ2A+160                                                 00541000
ZZ2AQDT  EQU   ZZ2AQD+10                                                00542000
ZZ2AQDF  EQU   ZZ2AQD+52                                                00543000
ZZ2STG   EQU   ZZ2+960                                                  00544000
ZZ2ALLOP EQU   ZZ2+992                                                  00545000
ZZ2FREEP EQU   ZZ2+996                                                  00546000
ZZ2FF19P EQU   ZZ2+1000                                                 00547000
ZZ2FRE1P EQU   ZZ2+1004                                                 00548000
ZZ2FF18P EQU   ZZ2+1008                                                 00549000
ZZ2DYNAP EQU   ZZ2+1012                                                 00550000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 00551000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 00552000
ZZ2STAIP EQU   ZZ2+1024                                                 00553000
ZZ2FF02P EQU   ZZ2+1028                                                 00554000
ZZ2GETLP EQU   ZZ2+1032                                                 00555000
ZZ2PARSP EQU   ZZ2+1036                                                 00556000
ZZ2PTGTP EQU   ZZ2+1040                                                 00557000
ZZ2PUTLP EQU   ZZ2+1044                                                 00558000
ZZ2SCANP EQU   ZZ2+1048                                                 00559000
ZZ2STCKP EQU   ZZ2+1052                                                 00560000
ZZ2TRMOP EQU   ZZ2+1064                                                 00561000
ZZ2TRMVP EQU   ZZ2+1068                                                 00562000
ZZ2PUTNP EQU   ZZ2+1084                                                 00563000
ZZ2TRMNP EQU   ZZ2+1088                                                 00564000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 00565000
ZZ2BVTP  EQU   ZZ2+1280                                                 00566000
ZZ2CPPL  EQU   ZZ2+1292                                                 00567000
ZZ2CPPLC EQU   ZZ2CPPL                                                  00568000
ZZ2ITR   EQU   ZZ2+2840                                                 00569000
ZZ2ITRE  EQU   ZZ2ITR+16                                                00570000
ZZ2ITSE  EQU   ZZ2+2864                                                 00571000
ZZ2ES    EQU   ZZ2+2872                                                 00572000
ZZ2AMDX  EQU   ZZ2+7160                                                 00573000
ZZ2AXO   EQU   ZZ2+7934                                                 00574000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 00575000
CMD      EQU   0                                                        00576000
CMDT     EQU   CMD+4                                                    00577000
PSCB     EQU   0                                                        00578000
PSCBATR1 EQU   PSCB+16                                                  00579000
ECT      EQU   0                                                        00580000
ECTSWS   EQU   ECT+28                                                   00581000
ECTSWS2  EQU   ECT+40                                                   00582000
ECTSWS21 EQU   ECTSWS2                                                  00583000
UPT      EQU   0                                                        00584000
UPTSWS   EQU   UPT+12                                                   00585000
SA       EQU   0                                                        00586000
SA1      EQU   SA                                                       00587000
SAR      EQU   SA+12                                                    00588000
BVT      EQU   0                                                        00589000
BVTPUTLP EQU   BVT+4                                                    00590000
BVTPUTOP EQU   BVT+12                                                   00591000
BVTPUTTP EQU   BVT+16                                                   00592000
BVTPUTVP EQU   BVT+20                                                   00593000
BVTPUTAP EQU   BVT+24                                                   00594000
BVTPRTTP EQU   BVT+28                                                   00595000
BVTPRTAP EQU   BVT+32                                                   00596000
BVTPUTDP EQU   BVT+36                                                   00597000
BVTMONP  EQU   BVT+40                                                   00598000
BVTMON2P EQU   BVT+44                                                   00599000
BVTVSARP EQU   BVT+48                                                   00600000
BVTVSENP EQU   BVT+64                                                   00601000
BVTVSERP EQU   BVT+68                                                   00602000
BVTVSGEP EQU   BVT+72                                                   00603000
BVTVSGUP EQU   BVT+76                                                   00604000
BVTVSPOP EQU   BVT+80                                                   00605000
BVTVSPUP EQU   BVT+84                                                   00606000
BVTMONLP EQU   BVT+108                                                  00607000
BVTPUTCP EQU   BVT+132                                                  00608000
BVTMPK1P EQU   BVT+136                                                  00609000
BVTZZ2RP EQU   BVT+140                                                  00610000
BVTPGMRP EQU   BVT+144                                                  00611000
BVTMONAP EQU   BVT+148                                                  00612000
BVTBLDDP EQU   BVT+152                                                  00613000
BVTBLDLP EQU   BVT+156                                                  00614000
BVTPGMCP EQU   BVT+160                                                  00615000
BVTPGMDP EQU   BVT+164                                                  00616000
BVTPGMLP EQU   BVT+168                                                  00617000
BVTMONCP EQU   BVT+180                                                  00618000
BVTMONDP EQU   BVT+184                                                  00619000
BVTMONTP EQU   BVT+188                                                  00620000
BVTPARIP EQU   BVT+192                                                  00621000
BVTPARUP EQU   BVT+196                                                  00622000
BVTPRTNP EQU   BVT+204                                                  00623000
BVTVSCRP EQU   BVT+208                                                  00624000
BVTVSMRP EQU   BVT+212                                                  00625000
BVTMONXP EQU   BVT+216                                                  00626000
BVTTRMAP EQU   BVT+228                                                  00627000
MSG      EQU   0                                                        00628000
MSGL     EQU   MSG                                                      00629000
MSGT     EQU   MSG+4                                                    00630000
PARM     EQU   0                                                        00631000
COLP     EQU   0                                                        00632000
CF       EQU   1                                                        00633000
CP       EQU   0                                                        00634000
CR       EQU   0                                                        00635000
CS       EQU   0                                                        00636000
BLSUALLO EQU   0                                                        00637000
BLSUBLDD EQU   0                                                        00638000
BLSUBLDL EQU   0                                                        00639000
BLSUDYNA EQU   0                                                        00640000
BLSUFREE EQU   0                                                        00641000
BLSUFRE1 EQU   0                                                        00642000
BLSUMON  EQU   0                                                        00643000
BLSUMONA EQU   0                                                        00644000
BLSUMONC EQU   0                                                        00645000
BLSUMOND EQU   0                                                        00646000
BLSUMONL EQU   0                                                        00647000
BLSUMONT EQU   0                                                        00648000
BLSUMONX EQU   0                                                        00649000
BLSUMON2 EQU   0                                                        00650000
BLSUMPK1 EQU   0                                                        00651000
BLSUPARI EQU   0                                                        00652000
BLSUPARU EQU   0                                                        00653000
BLSUPGMC EQU   0                                                        00654000
BLSUPGMD EQU   0                                                        00655000
BLSUPGML EQU   0                                                        00656000
BLSUPGMR EQU   0                                                        00657000
BLSUPRTA EQU   0                                                        00658000
BLSUPRTN EQU   0                                                        00659000
BLSUPRTT EQU   0                                                        00660000
BLSUPUTA EQU   0                                                        00661000
BLSUPUTC EQU   0                                                        00662000
BLSUPUTD EQU   0                                                        00663000
BLSUPUTL EQU   0                                                        00664000
BLSUPUTN EQU   0                                                        00665000
BLSUPUTO EQU   0                                                        00666000
BLSUPUTT EQU   0                                                        00667000
BLSUPUTV EQU   0                                                        00668000
BLSUSTAI EQU   0                                                        00669000
BLSUTRMA EQU   0                                                        00670000
BLSUTRMN EQU   0                                                        00671000
BLSUTRMO EQU   0                                                        00672000
BLSUTRMV EQU   0                                                        00673000
BLSUVSAR EQU   0                                                        00674000
BLSUVSCR EQU   0                                                        00675000
BLSUVSEN EQU   0                                                        00676000
BLSUVSER EQU   0                                                        00677000
BLSUVSGE EQU   0                                                        00678000
BLSUVSGU EQU   0                                                        00679000
BLSUVSMR EQU   0                                                        00680000
BLSUVSPO EQU   0                                                        00681000
BLSUVSPU EQU   0                                                        00682000
BLSUZZ2C EQU   0                                                        00683000
BLSUZZ2D EQU   0                                                        00684000
BLSUZZ2R EQU   0                                                        00685000
IKJEFF02 EQU   0                                                        00686000
IKJEFF18 EQU   0                                                        00687000
IKJEFF19 EQU   0                                                        00688000
IKJGETL  EQU   0                                                        00689000
IKJPARS  EQU   0                                                        00690000
IKJPTGT  EQU   0                                                        00691000
IKJPUTL  EQU   0                                                        00692000
IKJSCAN  EQU   0                                                        00693000
IKJSTCK  EQU   0                                                        00694000
I001C    EQU   0                                                        00695000
I008P    EQU   0                                                        00696000
I015F    EQU   0                                                        00697000
I015P    EQU   0                                                        00698000
I031F    EQU   0                                                        00699000
I031P    EQU   0                                                        00700000
I256C    EQU   0                                                        00701000
CPPL     EQU   ZZ2CPPL                                                  00702000
CPPLUPT  EQU   CPPL+4                                                   00703000
CPPLPSCB EQU   CPPL+8                                                   00704000
CPPLECT  EQU   CPPL+12                                                  00705000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00706000
CPPLCBUF EQU   CPPL                                                     00707000
PARMCOLP EQU   PARM+8                                                   00708000
PARMMSG  EQU   PARM+4                                                   00709000
PARMZZ2  EQU   PARM                                                     00710000
MSGTA    EQU   MSGT+1                                                   00711000
MSGT$    EQU   MSGT                                                     00712000
MSGO     EQU   MSG+2                                                    00713000
BVT99999 EQU   BVT+256                                                  00714000
BVT0064P EQU   BVT+252                                                  00715000
BVT0063P EQU   BVT+248                                                  00716000
BVT0062P EQU   BVT+244                                                  00717000
BVT0061P EQU   BVT+240                                                  00718000
BVT0060P EQU   BVT+236                                                  00719000
BVT0059P EQU   BVT+232                                                  00720000
BVT0057P EQU   BVT+224                                                  00721000
BVT0056P EQU   BVT+220                                                  00722000
BVTSTBLP EQU   BVT+200                                                  00723000
BVT0045P EQU   BVT+176                                                  00724000
BVT0044P EQU   BVT+172                                                  00725000
BVT0033P EQU   BVT+128                                                  00726000
BVT0032P EQU   BVT+124                                                  00727000
BVT0031P EQU   BVT+120                                                  00728000
BVT0030P EQU   BVT+116                                                  00729000
BVT0029P EQU   BVT+112                                                  00730000
BVTMPKNP EQU   BVT+104                                                  00731000
BVT0026P EQU   BVT+100                                                  00732000
BVT0025P EQU   BVT+96                                                   00733000
BVT0024P EQU   BVT+92                                                   00734000
BVT0023P EQU   BVT+88                                                   00735000
BVT0016P EQU   BVT+60                                                   00736000
BVT0015P EQU   BVT+56                                                   00737000
BVT0014P EQU   BVT+52                                                   00738000
BVT0003P EQU   BVT+8                                                    00739000
BVT0001P EQU   BVT                                                      00740000
SA99     EQU   SA+72                                                    00741000
SARC     EQU   SAR+56                                                   00742000
SARB     EQU   SAR+52                                                   00743000
SARA     EQU   SAR+48                                                   00744000
SAR9     EQU   SAR+44                                                   00745000
SAR8     EQU   SAR+40                                                   00746000
SAR7     EQU   SAR+36                                                   00747000
SAR6     EQU   SAR+32                                                   00748000
SAR5     EQU   SAR+28                                                   00749000
SAR4     EQU   SAR+24                                                   00750000
SAR3     EQU   SAR+20                                                   00751000
SAR2     EQU   SAR+16                                                   00752000
SAR1     EQU   SAR+12                                                   00753000
SAR0     EQU   SAR+8                                                    00754000
SARF     EQU   SAR+4                                                    00755000
SARE     EQU   SAR                                                      00756000
SAFWD    EQU   SA+8                                                     00757000
SABAK    EQU   SA+4                                                     00758000
SA1L     EQU   SA1+1                                                    00759000
SA1P     EQU   SA1                                                      00760000
UPTPREFL EQU   UPT+23                                                   00761000
UPTPREFX EQU   UPT+16                                                   00762000
@NM00068 EQU   UPT+15                                                   00763000
UPTLDEL  EQU   UPT+14                                                   00764000
UPTCDEL  EQU   UPT+13                                                   00765000
UPTWTP   EQU   UPTSWS                                                   00766000
UPTMODE  EQU   UPTSWS                                                   00767000
UPTALD   EQU   UPTSWS                                                   00768000
UPTPAUS  EQU   UPTSWS                                                   00769000
UPTNCOM  EQU   UPTSWS                                                   00770000
UPTMID   EQU   UPTSWS                                                   00771000
UPTNPRM  EQU   UPTSWS                                                   00772000
UPTRCVR  EQU   UPTSWS                                                   00773000
UPTUSER  EQU   UPT+2                                                    00774000
@NM00067 EQU   UPT                                                      00775000
@NM00066 EQU   ECT+52                                                   00776000
@NM00065 EQU   ECT+48                                                   00777000
@NM00064 EQU   ECT+44                                                   00778000
@NM00063 EQU   ECTSWS2+1                                                00779000
@NM00062 EQU   ECTSWS21                                                 00780000
ECTTABND EQU   ECTSWS21                                                 00781000
ECTDEFCS EQU   ECTSWS21                                                 00782000
ECTBKPB  EQU   ECT+36                                                   00783000
ECTUSER  EQU   ECT+32                                                   00784000
ECTDDNUM EQU   ECT+29                                                   00785000
ECTATTN  EQU   ECTSWS                                                   00786000
ECTBKGRD EQU   ECTSWS                                                   00787000
ECTNNOT  EQU   ECTSWS                                                   00788000
ECTNMAL  EQU   ECTSWS                                                   00789000
ECTLOGF  EQU   ECTSWS                                                   00790000
ECTATRM  EQU   ECTSWS                                                   00791000
@NM00061 EQU   ECTSWS                                                   00792000
ECTNOPD  EQU   ECTSWS                                                   00793000
ECTSCMD  EQU   ECT+20                                                   00794000
ECTPCMD  EQU   ECT+12                                                   00795000
ECTSMSG  EQU   ECT+9                                                    00796000
ECTMSGF  EQU   ECT+8                                                    00797000
ECTIOWA  EQU   ECT+4                                                    00798000
ECTRTCD  EQU   ECT+1                                                    00799000
ECTRCDF  EQU   ECT                                                      00800000
PSCBU    EQU   PSCB+64                                                  00801000
PSCBRSZ  EQU   PSCB+60                                                  00802000
PSCBLINE EQU   PSCB+59                                                  00803000
PSCBCHAR EQU   PSCB+58                                                  00804000
PSCBUPTL EQU   PSCB+56                                                  00805000
PSCBUPT  EQU   PSCB+52                                                  00806000
PSCBRLGB EQU   PSCB+48                                                  00807000
PSCBDEST EQU   PSCB+40                                                  00808000
@NM00060 EQU   PSCB+36                                                  00809000
@NM00059 EQU   PSCB+32                                                  00810000
@NM00058 EQU   PSCB+28                                                  00811000
PSCBLTI2 EQU   PSCB+24                                                  00812000
PSCBLTIM EQU   PSCB+20                                                  00813000
PSCBATR2 EQU   PSCB+18                                                  00814000
@NM00057 EQU   PSCBATR1                                                 00815000
@NM00056 EQU   PSCBATR1                                                 00816000
@NM00055 EQU   PSCBATR1                                                 00817000
PSCBATTN EQU   PSCBATR1                                                 00818000
PSCBVMNT EQU   PSCBATR1                                                 00819000
PSCBJCL  EQU   PSCBATR1                                                 00820000
PSCBACCT EQU   PSCBATR1                                                 00821000
PSCBCTRL EQU   PSCBATR1                                                 00822000
PSCBGPNM EQU   PSCB+8                                                   00823000
PSCBUSRL EQU   PSCB+7                                                   00824000
PSCBUSER EQU   PSCB                                                     00825000
CMDT1    EQU   CMDT                                                     00826000
CMDO     EQU   CMD+2                                                    00827000
CMDL     EQU   CMD                                                      00828000
ZZ299999 EQU   ZZ2+8192                                                 00829000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  00830000
ZZ2AXOL  EQU   ZZ2AXO                                                   00831000
@NM00054 EQU   ZZ2+7288                                                 00832000
@NM00053 EQU   ZZ2AMDX+4                                                00833000
ZZ2AMDXC EQU   ZZ2AMDX                                                  00834000
ZZ2HSD   EQU   ZZ2+3056                                                 00835000
@NM00052 EQU   ZZ2ES                                                    00836000
@NM00051 EQU   ZZ2+2868                                                 00837000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                00838000
@NM00050 EQU   ZZ2ITSE                                                  00839000
ZZ2ITSEP EQU   ZZ2ITSE                                                  00840000
ZZ2ITSEW EQU   ZZ2ITSE                                                  00841000
@NM00049 EQU   ZZ2ITR+20                                                00842000
ZZ2ITREC EQU   ZZ2ITRE+1                                                00843000
@NM00048 EQU   ZZ2ITRE                                                  00844000
ZZ2ITREP EQU   ZZ2ITRE                                                  00845000
ZZ2ITREW EQU   ZZ2ITRE                                                  00846000
@NM00047 EQU   ZZ2ITR+9                                                 00847000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 00848000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 00849000
ZZ2ITRPP EQU   ZZ2ITR                                                   00850000
@NM00046 EQU   ZZ2+1544                                                 00851000
ZZ2PGM   EQU   ZZ2+1536                                                 00852000
@NM00045 EQU   ZZ2+1526                                                 00853000
ZZ2CW    EQU   ZZ2+1524                                                 00854000
@NM00044 EQU   ZZ2+1504                                                 00855000
@NM00043 EQU   ZZ2+1352                                                 00856000
ZZ2FFSYP EQU   ZZ2+1348                                                 00857000
ZZ2SASYP EQU   ZZ2+1344                                                 00858000
ZZ2RDSYP EQU   ZZ2+1340                                                 00859000
ZZ2RASYP EQU   ZZ2+1336                                                 00860000
ZZ2PHSYP EQU   ZZ2+1332                                                 00861000
ZZ2ESSYP EQU   ZZ2+1328                                                 00862000
ZZ200SYP EQU   ZZ2+1324                                                 00863000
ZZ2SCWP  EQU   ZZ2+1320                                                 00864000
ZZ2TTLP  EQU   ZZ2+1316                                                 00865000
ZZ2LOADP EQU   ZZ2+1312                                                 00866000
ZZ2VRESP EQU   ZZ2+1308                                                 00867000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               00868000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                00869000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                00870000
ZZ2VRSAP EQU   ZZ2+1288                                                 00871000
ZZ2RVTP  EQU   ZZ2+1284                                                 00872000
ZZ2DVTP  EQU   ZZ2+1276                                                 00873000
@NM00042 EQU   ZZ2+1272                                                 00874000
@NM00041 EQU   ZZ2+1268                                                 00875000
ZZ2RPLP  EQU   ZZ2+1260                                                 00876000
ZZ2TCBP  EQU   ZZ2+1256                                                 00877000
@NM00040 EQU   ZZ2+1252                                                 00878000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 00879000
@NM00039 EQU   ZZ2+1112                                                 00880000
ZZ2FPDRP EQU   ZZ2+1108                                                 00881000
ZZ2FDSDP EQU   ZZ2+1104                                                 00882000
ZZ2APDRP EQU   ZZ2+1100                                                 00883000
ZZ2ADSDP EQU   ZZ2+1096                                                 00884000
ZZ2ENQ0P EQU   ZZ2+1092                                                 00885000
@NM00038 EQU   ZZ2+1080                                                 00886000
ZZ2MSG0P EQU   ZZ2+1076                                                 00887000
ZZ2FT25P EQU   ZZ2+1072                                                 00888000
ZZ2MSGSP EQU   ZZ2+1060                                                 00889000
ZZ2ALOCP EQU   ZZ2+1056                                                 00890000
@NM00037 EQU   ZZ2+976                                                  00891000
ZZ2TOD   EQU   ZZ2+968                                                  00892000
ZZ2STGN  EQU   ZZ2STG+4                                                 00893000
ZZ2STGP  EQU   ZZ2STG                                                   00894000
@NM00036 EQU   ZZ2+952                                                  00895000
ZZ2SCMDE EQU   ZZ2+944                                                  00896000
ZZ2SCMDN EQU   ZZ2+936                                                  00897000
ZZ2IDENT EQU   ZZ2+928                                                  00898000
ZZ2A9999 EQU   ZZ2A+656                                                 00899000
@NM00035 EQU   ZZ2A+224                                                 00900000
@NM00034 EQU   ZZ2A+220                                                 00901000
ZZ2AQD99 EQU   ZZ2AQD+60                                                00902000
@NM00033 EQU   ZZ2AQD+56                                                00903000
@NM00032 EQU   ZZ2AQDF                                                  00904000
ZZ2AQDFA EQU   ZZ2AQDF                                                  00905000
ZZ2AQDIL EQU   ZZ2AQD+48                                                00906000
ZZ2AQDIM EQU   ZZ2AQD+44                                                00907000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               00908000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               00909000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                00910000
@NM00031 EQU   ZZ2AQDT+1                                                00911000
ZZ2AQDTY EQU   ZZ2AQDT                                                  00912000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  00913000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 00914000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 00915000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 00916000
ZZ2AQDOF EQU   ZZ2AQD                                                   00917000
ZZ2AQD00 EQU   ZZ2AQD                                                   00918000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               00919000
@NM00030 EQU   ZZ2AQAS+12                                               00920000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                00921000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                00922000
@NM00029 EQU   ZZ2AQAS+2                                                00923000
ZZ2AQAST EQU   ZZ2AQAS                                                  00924000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  00925000
ZZ2AZZ6P EQU   ZZ2A+140                                                 00926000
ZZ2ADPTA EQU   ZZ2ADPT                                                  00927000
ZZ2ADPL  EQU   ZZ2ADP                                                   00928000
ZZ2ADMTA EQU   ZZ2ADMT                                                  00929000
ZZ2ADML  EQU   ZZ2ADM                                                   00930000
ZZ2ADDTA EQU   ZZ2ADDT                                                  00931000
ZZ2ADDL  EQU   ZZ2ADD                                                   00932000
@NM00028 EQU   ZZ2A+72                                                  00933000
ZZ2APIDB EQU   ZZ2APID+3                                                00934000
ZZ2APIDA EQU   ZZ2APID                                                  00935000
@NM00027 EQU   ZZ2A+24                                                  00936000
@NM00026 EQU   ZZ2AF+5                                                  00937000
ZZ2AFX   EQU   ZZ2AF+5                                                  00938000
@NM00025 EQU   ZZ2AF+3                                                  00939000
ZZ2AFS   EQU   ZZ2AF+2                                                  00940000
ZZ2AFD   EQU   ZZ2AF+2                                                  00941000
ZZ2AFQ   EQU   ZZ2AF+2                                                  00942000
ZZ2AF$   EQU   ZZ2AF+2                                                  00943000
@NM00024 EQU   ZZ2AF+2                                                  00944000
ZZ2AFM   EQU   ZZ2AF+2                                                  00945000
@NM00023 EQU   ZZ2AF+2                                                  00946000
@NM00022 EQU   ZZ2AF+1                                                  00947000
ZZ2AFV   EQU   ZZ2AF+1                                                  00948000
@NM00021 EQU   ZZ2AF+1                                                  00949000
ZZ2AFC   EQU   ZZ2AF+1                                                  00950000
@NM00020 EQU   ZZ2AF                                                    00951000
ZZ2AFFS  EQU   ZZ2AF                                                    00952000
ZZ2AFT   EQU   ZZ2AF                                                    00953000
ZZ2AFP   EQU   ZZ2AF                                                    00954000
@NM00019 EQU   ZZ2A+8                                                   00955000
ZZ2ALINE EQU   ZZ2A+4                                                   00956000
@NM00018 EQU   ZZ2A+3                                                   00957000
ZZ2ASE   EQU   ZZ2A+2                                                   00958000
ZZ2ACH   EQU   ZZ2A                                                     00959000
@NM00017 EQU   ZZ2+264                                                  00960000
@NM00016 EQU   ZZ2+263                                                  00961000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  00962000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 00963000
ZZ2PRTL  EQU   ZZ2PRT                                                   00964000
@NM00015 EQU   ZZ2AMD+56                                                00965000
ZZ2AMDXP EQU   ZZ2AMD+52                                                00966000
ZZ2AMDD  EQU   ZZ2AMD+48                                                00967000
ZZ2AMDL  EQU   ZZ2AMD+44                                                00968000
ZZ2AMDU  EQU   ZZ2AMD+28                                                00969000
ZZ2AMDF  EQU   ZZ2AMD+24                                                00970000
ZZ2AMDS  EQU   ZZ2AMD+20                                                00971000
ZZ2AMDC  EQU   ZZ2AMD+16                                                00972000
ZZ2AMDP  EQU   ZZ2AMD+12                                                00973000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 00974000
@NM00014 EQU   @NM00013                                                 00975000
ZZ2AMD2  EQU   @NM00013                                                 00976000
ZZ2AMD1  EQU   @NM00013                                                 00977000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 00978000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 00979000
ZZ2AMDT  EQU   ZZ2AMD                                                   00980000
ZZ199999 EQU   ZZ1+3072                                                 00981000
@NM00012 EQU   ZZ1+2160                                                 00982000
ZZ1TRTAS EQU   ZZ1+1904                                                 00983000
ZZ1TRUPC EQU   ZZ1+1648                                                 00984000
ZZ1TRCTX EQU   ZZ1+1392                                                 00985000
ZZ1NASID EQU   ZZ1N+274                                                 00986000
ZZ1NSTRL EQU   ZZ1N+272                                                 00987000
ZZ1NOFF  EQU   ZZ1N+268                                                 00988000
ZZ1NBDY  EQU   ZZ1N+264                                                 00989000
ZZ1NADE  EQU   ZZ1N+260                                                 00990000
ZZ1NADB  EQU   ZZ1N+256                                                 00991000
ZZ1NSTR  EQU   ZZ1N                                                     00992000
@NM00011 EQU   ZZ1+1080                                                 00993000
ZZ1TREBC EQU   ZZ1+824                                                  00994000
ZZ1TRHEX EQU   ZZ1+568                                                  00995000
@NM00010 EQU   ZZ1+377                                                  00996000
ZZ1USTAE EQU   ZZ1+376                                                  00997000
@NM00009 EQU   ZZ1F+1                                                   00998000
@NM00008 EQU   ZZ1F                                                     00999000
ZZ1FM    EQU   ZZ1F                                                     01000000
ZZ1FX    EQU   ZZ1F                                                     01001000
ZZ1FU    EQU   ZZ1F                                                     01002000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 01003000
@NM00007 EQU   ZZ1EVE                                                   01004000
ZZ1EVEP  EQU   ZZ1EVE                                                   01005000
ZZ1EVEW  EQU   ZZ1EVE                                                   01006000
ZZ1ACMP  EQU   ZZ1ATTN                                                  01007000
@NM00006 EQU   ZZ1+144                                                  01008000
ZZ1FPP   EQU   ZZ1+140                                                  01009000
ZZ1ZZ6P  EQU   ZZ1+136                                                  01010000
@NM00005 EQU   ZZ1+84                                                   01011000
ZZ1PLINE EQU   ZZ1+80                                                   01012000
ZZ1PGSZ  EQU   ZZ1+76                                                   01013000
ZZ1PCNT  EQU   ZZ1+72                                                   01014000
@NM00004 EQU   ZZ1+68                                                   01015000
ZZ1TPAGE EQU   ZZ1+64                                                   01016000
ZZ1TLINE EQU   ZZ1+60                                                   01017000
@NM00003 EQU   ZZ1+48                                                   01018000
ZZ1DSDP  EQU   ZZ1+44                                                   01019000
ZZ1PDRP  EQU   ZZ1+40                                                   01020000
ZZ1ZZ2P  EQU   ZZ1+36                                                   01021000
ZZ1327WP EQU   ZZ1+32                                                   01022000
ZZ1ACBP  EQU   ZZ1+28                                                   01023000
@NM00002 EQU   ZZ1+24                                                   01024000
ZZ1PDCBP EQU   ZZ1+20                                                   01025000
ZZ1BLRBL EQU   ZZ1+16                                                   01026000
@NM00001 EQU   ZZ1+12                                                   01027000
ZZ1PNULL EQU   ZZ1+8                                                    01028000
ZZ1NULL  EQU   ZZ1+4                                                    01029000
ZZ1IDE   EQU   ZZ1                                                      01030000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01031000
@ENDDATA EQU   *                                                        01032000
         END   BLSUMPKN,(C'PLS2312',0701,78059)                         01033000
