TSO      TITLE 'BLSUTSO--IPCS TSO SUBCOMMAND                           *00001000
                        '                                               00002000
*/* CHANGE ACTIVITY -------------------------------------------------*/ 00003000
*/*   THIS MODULE WAS WRITTEN FOR @G57LPRW                           */ 00004000
*/*   THIS MODULE WAS CHANGED FOR @ZA32007                   @ZA32007*/ 00005000
*/*------------------------------------------------------------------*/ 00006000
BLSUTSO  CSECT ,                                                01S0002 00007000
@MAINENT DS    0H                                               01S0002 00008000
         USING *,@15                                            01S0002 00009000
         B     @PROLOG                                          01S0002 00010000
         DC    AL1(16)                                          01S0002 00011000
         DC    C'BLSUTSO   78.117'                              01S0002 00012000
         DROP  @15                                                      00013000
@PROLOG  STM   @14,@12,12(@13)                                  01S0002 00014000
         BALR  @12,0                                            01S0002 00015000
@PSTART  DS    0H                                               01S0002 00016000
         USING @PSTART,@12                                      01S0002 00017000
         L     @00,@SIZDATD                                     01S0002 00018000
         BLSUALLR R,LV=(0)                                              00019000
         LR    @11,@01                                          01S0002 00020000
         USING @DATD,@11                                        01S0002 00021000
         ST    @13,@SA00001+4                                   01S0002 00022000
         LM    @00,@01,20(@13)                                  01S0002 00023000
         ST    @11,8(,@13)                                      01S0002 00024000
         LR    @13,@11                                          01S0002 00025000
*   IF ECTNOPD='1'B THEN            /* NO TSO COMMAND SPECIFIED      */ 00026000
*                                                               01S0122 00027000
         L     @14,CPPLECT(,R9)                                 01S0122 00028000
         TM    ECTNOPD(@14),B'10000000'                         01S0122 00029000
         BNO   @RF00122                                         01S0122 00030000
*     /***************************************************************/ 00031000
*     /*                                                             */ 00032000
*     /* NO TSO COMMAND SPECIFIED                                    */ 00033000
*     /*                                                             */ 00034000
*     /***************************************************************/ 00035000
*                                                               01S0123 00036000
*     DO;                           /* NO TSO COMMAND SPECIFIED      */ 00037000
*       CALL BLSUTRMV(ZZ2,M057);    /* TRANSMIT MESSAGE M057         */ 00038000
         ST    R9,@AL00001                                      01S0124 00039000
         LA    @14,M057                                         01S0124 00040000
         ST    @14,@AL00001+4                                   01S0124 00041000
         L     @15,ZZ2TRMVP(,R9)                                01S0124 00042000
         LA    @01,@AL00001                                     01S0124 00043000
         BALR  @14,@15                                          01S0124 00044000
*       RETC=ZZZFLAGS;              /* RETURN CODE                   */ 00045000
         LA    RETC,12                                          01S0125 00046000
*       GO TO EXIT;                 /* COMMON EXIT PATH              */ 00047000
         B     EXIT                                             01S0126 00048000
*     END;                          /* NO TSO COMMAND SPECIFIED      */ 00049000
*   RESPECIFY                       /* BEFORE MVCL                   */ 00050000
*    (R0,                           /* ->COMMAND BUFFER TEXT         */ 00051000
*     R1,                           /* LENGTH OF TEXT TO BE BLANKED  */ 00052000
*     RE) RESTRICTED;               /* IRRELEVANT TO THIS MVCL       */ 00053000
@RF00122 DS    0H                                               01S0129 00054000
*   R0=ADDR(CMDT);                  /* ->COMMAND BUFFER TEXT         */ 00055000
         L     @10,ZZ2CPPLC(,R9)                                01S0129 00056000
         LA    R0,CMDT(,@10)                                    01S0129 00057000
*   R1=CMDO-1;                      /* LENGTH OF TEXT TO BE BLANKED  */ 00058000
         SLR   R1,R1                                            01S0130 00059000
         ICM   R1,3,CMDO(@10)                                   01S0130 00060000
         BCTR  R1,0                                             01S0130 00061000
*   RF='40000000'X;                 /* SOURCE OF PADDING BLANKS      */ 00062000
         L     RF,@CF00846                                      01S0131 00063000
*   MVCL(R0,RE);                    /* BLANK VERB IN COMMAND BUFFER  */ 00064000
         MVCL  R0,RE                                            01S0132 00065000
*   RESPECIFY                       /* AFTER MVCL                    */ 00066000
*    (R0,                           /* DESTROYED                     */ 00067000
*     R1,                           /* 0                             */ 00068000
*     RE) UNRESTRICTED;             /* IRRELEVANT                    */ 00069000
*   CSPLOA=ADDR(CSOA);              /* ->COMMAND SCAN OUTPUT AREA    */ 00070000
         LA    @14,CSOA                                         01S0134 00071000
         ST    @14,CSPLOA                                       01S0134 00072000
*   CSPLCBUF=ADDR(CMD);             /* ->COMMAND BUFFER              */ 00073000
         MVC   CSPLCBUF(4),ZZ2CPPLC(R9)                         01S0135 00074000
*   CALL BLSUMON2(ZZ2,CSPL);        /* SCAN COMMAND BUFFER           */ 00075000
         ST    R9,@AL00001                                      01S0136 00076000
         LA    @14,CSPL                                         01S0136 00077000
         ST    @14,@AL00001+4                                   01S0136 00078000
         L     @10,ZZ2BVTP(,R9)                                 01S0136 00079000
         L     @15,BVTMON2P(,@10)                               01S0136 00080000
         LA    @01,@AL00001                                     01S0136 00081000
         BALR  @14,@15                                          01S0136 00082000
*   IF RF=ZZZFLAGI THEN             /* VALID COMMAND SCAN RESULTS    */ 00083000
*                                                               01S0137 00084000
         LTR   RF,RF                                            01S0137 00085000
         BNZ   @RF00137                                         01S0137 00086000
*     /***************************************************************/ 00087000
*     /*                                                             */ 00088000
*     /* VALID COMMAND SCAN RESULTS                                  */ 00089000
*     /*                                                             */ 00090000
*     /***************************************************************/ 00091000
*                                                               01S0138 00092000
*     DO;                           /* VALID COMMAND SCAN RESULTS    */ 00093000
*       IF CSOANOC='1'B THEN        /* NO TSO COMMAND SPECIFIED      */ 00094000
*                                                               01S0139 00095000
         TM    CSOANOC,B'00010000'                              01S0139 00096000
         BNO   @RF00139                                         01S0139 00097000
*         /***********************************************************/ 00098000
*         /*                                                         */ 00099000
*         /* NO TSO COMMAND SPECIFIED                                */ 00100000
*         /*                                                         */ 00101000
*         /***********************************************************/ 00102000
*                                                               01S0140 00103000
*         DO;                       /* NO TSO COMMAND SPECIFIED      */ 00104000
*           CALL BLSUTRMV(ZZ2,M057);/* TRANSMIT MESSAGE M057         */ 00105000
         ST    R9,@AL00001                                      01S0141 00106000
         LA    @14,M057                                         01S0141 00107000
         ST    @14,@AL00001+4                                   01S0141 00108000
         L     @15,ZZ2TRMVP(,R9)                                01S0141 00109000
         LA    @01,@AL00001                                     01S0141 00110000
         BALR  @14,@15                                          01S0141 00111000
*           RETC=ZZZFLAGS;          /* RETURN CODE                   */ 00112000
         LA    RETC,12                                          01S0142 00113000
*           GO TO EXIT;             /* COMMON EXIT PATH              */ 00114000
         B     EXIT                                             01S0143 00115000
*         END;                      /* NO TSO COMMAND SPECIFIED      */ 00116000
*       IF CSOAEXEC='1'B THEN       /* PERCENT SIGN COMMAND PREFIX   */ 00117000
*                                                               01S0145 00118000
@RF00139 TM    CSOAEXEC,B'00000100'                             01S0145 00119000
         BNO   @RF00145                                         01S0145 00120000
*         /***********************************************************/ 00121000
*         /*                                                         */ 00122000
*         /* PERCENT SIGN COMMAND PREFIX                             */ 00123000
*         /*                                                         */ 00124000
*         /***********************************************************/ 00125000
*                                                               01S0146 00126000
*         DO;                       /* PERCENT SIGN COMMAND PREFIX   */ 00127000
*           CALL BLSUTRMV(ZZ2,M058);/* TRANSMIT MESSAGE M058         */ 00128000
         ST    R9,@AL00001                                      01S0147 00129000
         LA    @14,M058                                         01S0147 00130000
         ST    @14,@AL00001+4                                   01S0147 00131000
         L     @15,ZZ2TRMVP(,R9)                                01S0147 00132000
         LA    @01,@AL00001                                     01S0147 00133000
         BALR  @14,@15                                          01S0147 00134000
*           RETC=ZZZFLAGS;          /* RETURN CODE                   */ 00135000
         LA    RETC,12                                          01S0148 00136000
*           GO TO EXIT;             /* COMMON EXIT PATH              */ 00137000
         B     EXIT                                             01S0149 00138000
*         END;                      /* PERCENT SIGN COMMAND PREFIX   */ 00139000
*       ELSE                                                    01S0151 00140000
*         DO;                                                   01S0151 00141000
*                                                               01S0151 00142000
@RF00145 DS    0H                                               01S0152 00143000
*           /*********************************************************/ 00144000
*           /*                                                       */ 00145000
*           /* IS IT A TIME COMMAND?                                 */ 00146000
*           /*                                                       */ 00147000
*           /*********************************************************/ 00148000
*                                                               01S0152 00149000
*           IF CSOALNM=LENGTH(TIMECMD)&/* IS THE LENGTH OF THE  01S0152 00150000
*                                      COMMAND = TO LENGTH OF 'TIME'?*/ 00151000
*               CSOACN(1:LENGTH(TIMECMD))=TIMECMD/* IS IT 'TIME'?    */ 00152000
*             THEN                                              01S0152 00153000
         LH    @14,CSOALNM                                      01S0152 00154000
         CH    @14,@CH00040                                     01S0152 00155000
         BNE   @RF00152                                         01S0152 00156000
         L     @10,CSOACNM                                      01S0152 00157000
         CLC   CSOACN(4,@10),@CC00842                           01S0152 00158000
         BNE   @RF00152                                         01S0152 00159000
*             DO;                                               01S0153 00160000
*               CMDNAMTA=CSOACN(1:CSOALNM);/* PICK UP COMMAND        */ 00161000
         MVI   CMDNAMTA+1,C' '                                  01S0154 00162000
         MVC   CMDNAMTA+2(6),CMDNAMTA+1                         01S0154 00163000
         LR    @08,@14                                          01S0154 00164000
         BCTR  @08,0                                            01S0154 00165000
         EX    @08,@SM00864                                     01S0154 00166000
*               CMDNAML=CSOALNM;    /* GET LENGTH OF COMMAND         */ 00167000
         STC   @14,CMDNAML                                      01S0155 00168000
*               CALL IKJEFT25(CMD,UPT,PSCB,ECT);/* DISPLAY THE TIME  */ 00169000
         L     @14,ZZ2CPPLC(,R9)                                01S0156 00170000
         ST    @14,@AL00001                                     01S0156 00171000
         L     @14,CPPLUPT(,R9)                                 01S0156 00172000
         ST    @14,@AL00001+4                                   01S0156 00173000
         L     @14,CPPLPSCB(,R9)                                01S0156 00174000
         ST    @14,@AL00001+8                                   01S0156 00175000
         L     @14,CPPLECT(,R9)                                 01S0156 00176000
         ST    @14,@AL00001+12                                  01S0156 00177000
         L     @15,ZZ2FT25P(,R9)                                01S0156 00178000
         LA    @01,@AL00001                                     01S0156 00179000
         BALR  @14,@15                                          01S0156 00180000
*               RETC=ZZZFLAGI;      /* SET RETURN CODE               */ 00181000
         SLR   RETC,RETC                                        01S0157 00182000
*               GO TO EXIT;         /* COMMON EXIT PATH              */ 00183000
         B     EXIT                                             01S0158 00184000
*             END;                                              01S0159 00185000
*           ELSE                                                01S0160 00186000
*             ;                     /* NOT A TIME COMMAND            */ 00187000
@RF00152 DS    0H                                               01S0161 00188000
*         END;                                                  01S0161 00189000
*       CMDNAMTA=CSOACN(1:CSOALNM); /* PICK UP COMMAND               */ 00190000
         MVI   CMDNAMTA+1,C' '                                  01S0162 00191000
         MVC   CMDNAMTA+2(6),CMDNAMTA+1                         01S0162 00192000
         LH    @14,CSOALNM                                      01S0162 00193000
         LR    @10,@14                                          01S0162 00194000
         BCTR  @10,0                                            01S0162 00195000
         L     @08,CSOACNM                                      01S0162 00196000
         EX    @10,@SM00866                                     01S0162 00197000
*       CMDNAML=CSOALNM;            /* PICK UP LENGTH OF COMMAND     */ 00198000
*                                                               01S0163 00199000
         STC   @14,CMDNAML                                      01S0163 00200000
*       /*************************************************************/ 00201000
*       /*                                                           */ 00202000
*       /* SEARCH SUBCOMMAND TABLE FOR THE COMMAND ENTERED           */ 00203000
*       /*                                                           */ 00204000
*       /*************************************************************/ 00205000
*                                                               01S0164 00206000
*                                                               01S0164 00207000
*        DO;/*BLRSRCH(CMDNAM) ARRAY(STBSN)DIMENSION(STBDIM)SET(CMDINDEX 00208000
**/        CMDINDEX=0;/*CURRENT POSITION*/                      01S0164 00209000
         SLR   CMDINDEX,CMDINDEX                                01S0165 00210000
*          SCH0001G=STBDIM;/*PROBE DISTANCE*/                   01S0166 00211000
         L     @14,ZZ2BVTP(,R9)                                 01S0166 00212000
         L     @14,BVTSTBLP(,@14)                               01S0166 00213000
         L     SCH0001G,STBDIM(,@14)                            01S0166 00214000
*          /*SEARCH SORTED ARRAY STBSN FOR CMDNAM*/             01S0167 00215000
*          DO WHILE(SCH0001G>0);/*SEARCH SORTED ARRAY*/         01S0167 00216000
         B     @DE00167                                         01S0167 00217000
@DL00167 DS    0H                                               01S0168 00218000
*            SCH0001A=CMDINDEX+SCH0001G;/*PROBE POSITION*/      01S0168 00219000
         LR    SCH0001A,CMDINDEX                                01S0168 00220000
         ALR   SCH0001A,SCH0001G                                01S0168 00221000
*            IF SCH0001A>STBDIM THEN/*PROBE BEYOND ARRAY*/      01S0169 00222000
         L     @14,ZZ2BVTP(,R9)                                 01S0169 00223000
         L     @14,BVTSTBLP(,@14)                               01S0169 00224000
         CL    SCH0001A,STBDIM(,@14)                            01S0169 00225000
         BNH   @RF00169                                         01S0169 00226000
*              IF SCH0001G=1 THEN/*ADJACENT ARRAY ENTRIES*/     01S0170 00227000
         CL    SCH0001G,@CF00043                                01S0170 00228000
         BNE   @RF00170                                         01S0170 00229000
*                /*CMDNAM COLLATES HIGHER THAN STBSN(STBDIM)*/  01S0171 00230000
*                DO;/*ADJACENT ARRAY ENTRIES*/                  01S0171 00231000
*                  CMDINDEX=0;/*SEARCH IS UNSUCCESSFUL*/        01S0172 00232000
         SLR   CMDINDEX,CMDINDEX                                01S0172 00233000
*                  SCH0001G=0;/*SEARCH IS COMPLETE*/            01S0173 00234000
         SLR   SCH0001G,SCH0001G                                01S0173 00235000
*                END;/*ADJACENT ARRAY ENTRIES*/                 01S0174 00236000
*              ELSE/*INTERVENING ENTRY(IES)*/                   01S0175 00237000
*                ;/*NEW PROBE POSITION*/                        01S0175 00238000
@RF00170 DS    0H                                               01S0176 00239000
*            ELSE/*PROBE POSITION IN ARRAY*/                    01S0176 00240000
*              IF STBSN(SCH0001A)<=CMDNAM THEN                  01S0176 00241000
         B     @RC00169                                         01S0176 00242000
@RF00169 LR    @14,SCH0001A                                     01S0176 00243000
         MH    @14,@CH00863                                     01S0176 00244000
         L     @10,ZZ2BVTP(,R9)                                 01S0176 00245000
         L     @10,BVTSTBLP(,@10)                               01S0176 00246000
         ALR   @10,@14                                          01S0176 00247000
         AL    @10,@CF00868                                     01S0176 00248000
         CLC   STBSN-15(9,@10),CMDNAM                           01S0176 00249000
         BH    @RF00176                                         01S0176 00250000
*          /*SEARCH HIGHER IN ARRAY*/                           01S0177 00251000
*                DO;/*CURRENT POSITION TOO LOW*/                01S0177 00252000
*                  BC(7,SCH0001L);/*IF STBSN(SCH0001A)=CMDNAM THEN SEAR 00253000
*H IS SUCCESSFUL*/   SCH0001G=0;/*SEARCH IS COMPLETE*/          01S0178 00254000
         BC    7,SCH0001L                                       01S0178 00255000
         SLR   SCH0001G,SCH0001G                                01S0179 00256000
*SCH0001L:/*ELSE CONTINUE THE SEARCH*/                          01S0180 00257000
*                  CMDINDEX=SCH0001A;/*CURRENT POSITION*/       01S0180 00258000
SCH0001L LR    CMDINDEX,SCH0001A                                01S0180 00259000
*                END;/*CURRENT POSITION TOO LOW*/               01S0181 00260000
*              ELSE/*CURRENT POSITION HIGH ENOUGH*/             01S0182 00261000
*                IF SCH0001G=1 THEN/*ADJACENT ARRAY ENTRIES*/   01S0182 00262000
         B     @RC00176                                         01S0182 00263000
@RF00176 CL    SCH0001G,@CF00043                                01S0182 00264000
         BNE   @RF00182                                         01S0182 00265000
*                /*CMDNAM COLLATES BETWEEN ENTRIES OR LOW*/     01S0183 00266000
*                  DO;/*ADJACENT ARRAY ENTRIES*/                01S0183 00267000
*                    CMDINDEX=0;/*SEARCH IS UNSUCCESSFUL*/      01S0184 00268000
         SLR   CMDINDEX,CMDINDEX                                01S0184 00269000
*                    SCH0001G=0;/*SEARCH IS COMPLETE*/          01S0185 00270000
         SLR   SCH0001G,SCH0001G                                01S0185 00271000
*                  END;/*ADJACENT ARRAY ENTRIES*/               01S0186 00272000
*            SCH0001G=SCH0001G+1;/*PROBE DISTANCE*/             01S0187 00273000
@RF00182 DS    0H                                               01S0187 00274000
@RC00176 DS    0H                                               01S0187 00275000
@RC00169 AL    SCH0001G,@CF00043                                01S0187 00276000
*            SRL(SCH0001G,1);/*PROBE DISTANCE*/                 01S0188 00277000
         SRL   SCH0001G,1                                       01S0188 00278000
*          END;/*SEARCH SORTED ARRAY*/                          01S0189 00279000
@DE00167 SLR   @14,@14                                          01S0189 00280000
         CLR   SCH0001G,@14                                     01S0189 00281000
         BH    @DL00167                                         01S0189 00282000
*        END;/*BLRSRCH(CMDNAM) ARRAY(STBSN)DIMENSION(STBDIM)SET(CMDINDE 00283000
*)*/                                                            01S0190 00284000
*       IF CMDINDEX^=0              /* SUBCOMMAND FOUND IN TABLE     */ 00285000
*         THEN                                                  01S0191 00286000
         CR    CMDINDEX,@14                                     01S0191 00287000
         BE    @RF00191                                         01S0191 00288000
*         DO;                                                   01S0192 00289000
*           IF STBSFINV(CMDINDEX)='1'B THEN/* SUBCOMMAND NOT    01S0193 00290000
*                                      SUPPORTED             @ZA32007*/ 00291000
*                                                               01S0193 00292000
         LR    @14,CMDINDEX                                     01S0193 00293000
         MH    @14,@CH00863                                     01S0193 00294000
         L     @10,ZZ2BVTP(,R9)                                 01S0193 00295000
         L     @10,BVTSTBLP(,@10)                               01S0193 00296000
         ALR   @10,@14                                          01S0193 00297000
         AL    @10,@CF00869                                     01S0193 00298000
         TM    STBSFINV-13(@10),B'10000000'                     01S0193 00299000
         BNO   @RF00193                                         01S0193 00300000
*             /*******************************************************/ 00301000
*             /*                                                     */ 00302000
*             /* SUBCOMMAND NOT SUPPORTED                            */ 00303000
*             /*                                                     */ 00304000
*             /*******************************************************/ 00305000
*                                                               01S0194 00306000
*             DO;                                               01S0194 00307000
*               CALL BLSUTRMV(ZZ2,M059);/* TRANSMIT MESSAGE M059     */ 00308000
         ST    R9,@AL00001                                      01S0195 00309000
         LA    @14,M059                                         01S0195 00310000
         ST    @14,@AL00001+4                                   01S0195 00311000
         L     @15,ZZ2TRMVP(,R9)                                01S0195 00312000
         LA    @01,@AL00001                                     01S0195 00313000
         BALR  @14,@15                                          01S0195 00314000
*               RETC=ZZZFLAGS;      /* SET RETURN CODE               */ 00315000
         LA    RETC,12                                          01S0196 00316000
*               GO TO EXIT;         /* COMMON EXIT PATH              */ 00317000
         B     EXIT                                             01S0197 00318000
*             END;                                              01S0198 00319000
*         END;                                                  01S0199 00320000
*       ELSE                                                    01S0200 00321000
*         ;                                                     01S0200 00322000
@RF00191 DS    0H                                               01S0201 00323000
*       IF CSOAVWP='1'B THEN        /* OPERANDS PRESENT ON COMMAND   */ 00324000
@RC00191 TM    CSOAVWP,B'10000000'                              01S0201 00325000
         BNO   @RF00201                                         01S0201 00326000
*         ECTNOPD='0'B;             /* OPERANDS PRESENT ON COMMAND   */ 00327000
         L     @14,CPPLECT(,R9)                                 01S0202 00328000
         NI    ECTNOPD(@14),B'01111111'                         01S0202 00329000
*       ELSE                        /* NO OPERANDS ON COMMAND        */ 00330000
*         ECTNOPD='1'B;             /* NO OPERANDS ON COMMAND        */ 00331000
         B     @RC00201                                         01S0203 00332000
@RF00201 L     @14,CPPLECT(,R9)                                 01S0203 00333000
         OI    ECTNOPD(@14),B'10000000'                         01S0203 00334000
*       ZZ2SCMDN=ZZZPGM40;          /* PAD COMMAND NAME FIELD        */ 00335000
@RC00201 MVC   ZZ2SCMDN(8,R9),@CC00104                          01S0204 00336000
*       ZZ2SCMDN(1:CSOALNM)=CSOACN(1:CSOALNM);/* COMMAND NAME        */ 00337000
         LH    @14,CSOALNM                                      01S0205 00338000
         BCTR  @14,0                                            01S0205 00339000
         L     @10,CSOACNM                                      01S0205 00340000
         EX    @14,@SM00872                                     01S0205 00341000
*       ZZ2SCMDE=ZZ2SCMDN;          /* ENTRY POINT NAME              */ 00342000
         MVC   ZZ2SCMDE(8,R9),ZZ2SCMDN(R9)                      01S0206 00343000
*       ECTPCMD=ZZ2SCMDN;           /* COMMAND NAME ENTERED          */ 00344000
*                                                               01S0207 00345000
         L     @14,CPPLECT(,R9)                                 01S0207 00346000
         MVC   ECTPCMD(8,@14),ZZ2SCMDN(R9)                      01S0207 00347000
*        DO;/*BLSUCALL EP(BLSUMONA)*/                           01S0208 00348000
*          RESPECIFY                                            01S0209 00349000
*           (GPR01P) RESTRICTED;/*->TASK VARIABLE*/             01S0209 00350000
*          GPR01P=ADDR(ZZ2);/*->TASK VARIABLE*/                 01S0210 00351000
         LR    GPR01P,R9                                        01S0210 00352000
*          CALL BLSUMONA;/*CALL RESIDENT IPCS PROGRAM*/         01S0211 00353000
         L     @10,ZZ2BVTP(,R9)                                 01S0211 00354000
         L     @15,BVTMONAP(,@10)                               01S0211 00355000
         BALR  @14,@15                                          01S0211 00356000
*          RESPECIFY                                            01S0212 00357000
*           (GPR01P) UNRESTRICTED;/*->TASK VARIABLE*/           01S0212 00358000
*        END;/*BLSUCALL EP(BLSUMONA)*/                          01S0213 00359000
*     END;                          /* VALID COMMAND SCAN RESULTS    */ 00360000
*   RETC=RF;                        /* RETURN CODE                   */ 00361000
@RF00137 LR    RETC,RF                                          01S0215 00362000
*EXIT:                              /* COMMON EXIT PATH              */ 00363000
*   RETURN CODE(RETC);                                          01S0216 00364000
*                                                               01S0216 00365000
EXIT     L     @13,4(,@13)                                      01S0216 00366000
         L     @00,@SIZDATD                                     01S0216 00367000
         LR    @01,@11                                          01S0216 00368000
         BLSUFRER R,LV=(0),A=(1)                                        00369000
         LR    @15,@02                                          01S0216 00370000
         L     @14,12(,@13)                                     01S0216 00371000
         LM    @00,@12,20(@13)                                  01S0216 00372000
         BR    @14                                              01S0216 00373000
*/*BLSUPEND--MVS IPCS MODULE*/                                  01S0217 00374000
*                                                               01S0217 00375000
*   DECLARE/*DATA FOR AHB MACROS*/                              01S0217 00376000
*     (SCH0001A,/*PROBE INDEX FOR SEARCH*/                      01S0217 00377000
*     SCH0001G) UNSIGNED BINARY(32);/*PROBE DISTANCE FOR SEARCH*/       00378000
*                                                               01S0217 00379000
*                                                               01S0217 00380000
*    DECLARE /*GENERAL PURPOSE REGISTERS */                     01S0218 00381000
*      GPR01P PTR(31) REG(1);                                   01S0218 00382000
*                                                               01S0218 00383000
*    DECLARE /* COMMON VARIABLES */                             01S0219 00384000
*      I256C CHAR(256) BASED,                                   01S0219 00385000
*      I031F FIXED(31) BASED,                                   01S0219 00386000
*      I031P PTR(31)   BASED,                                   01S0219 00387000
*      I015F FIXED(15) BASED,                                   01S0219 00388000
*      I015P PTR(15)   BASED,                                   01S0219 00389000
*      I008P PTR(8)    BASED,                                   01S0219 00390000
*      I001C CHAR(1)   BASED;                                   01S0219 00391000
*    GENERATE NODEFS NOREFS DATA;                               01S0220 00392000
*   END BLSUTSO /*BLRPEND(BLSUTSO) */                           01S0221 00393000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00394000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                        * 00395000
*/*%INCLUDE SYSLIB  (BLRFULL )                                        * 00396000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                        * 00397000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                        * 00398000
*/*%INCLUDE SYSLIB  (IKJECT  )                                        * 00399000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                        * 00400000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                        * 00401000
*/*%INCLUDE SYSLIB  (BLRSERV )                                        * 00402000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                        * 00403000
*/*%INCLUDE SYSLIB  (BLSDSERV)                                        * 00404000
*/*%INCLUDE SYSLIB  (IKJCSPL )                                        * 00405000
*/*%INCLUDE SYSLIB  (IKJCSOA )                                        * 00406000
*/*%INCLUDE SYSLIB  (BLSUSTB )                                        * 00407000
*;                                                              01S0221 00408000
@EL00001 L     @13,4(,@13)                                      01S0221 00409000
@EF00001 L     @00,@SIZDATD                                     01S0221 00410000
         LR    @01,@11                                          01S0221 00411000
         BLSUFRER R,LV=(0),A=(1)                                        00412000
@ER00001 LM    @14,@12,12(@13)                                  01S0221 00413000
         BR    @14                                              01S0221 00414000
@DATA    DS    0H                                                       00415000
@CH00040 DC    H'4'                                                     00416000
@CH00863 DC    H'20'                                                    00417000
@SM00864 MVC   CMDNAMTA(0),CSOACN(@10)                                  00418000
@SM00866 MVC   CMDNAMTA(0),CSOACN(@08)                                  00419000
@SM00872 MVC   ZZ2SCMDN(0,R9),CSOACN(@10)                               00420000
@DATD    DSECT                                                          00421000
         DS    0F                                                       00422000
@SA00001 DS    18F                                                      00423000
@AL00001 DS    4A                                                       00424000
BLSUTSO  CSECT                                                          00425000
         DS    0F                                                       00426000
@CF00043 DC    F'1'                                                     00427000
@CF00869 DC    F'-7'                                                    00428000
@CF00868 DC    F'-5'                                                    00429000
@CF00846 DC    XL4'40000000'                                            00430000
@DATD    DSECT                                                          00431000
         DS    0D                                                       00432000
CSPL     DS    CL24                                                     00433000
         ORG   CSPL                                                     00434000
CSPLUPT  DS    AL4                                                      00435000
CSPLECT  DS    AL4                                                      00436000
CSPLECB  DS    AL4                                                      00437000
CSPLFLG  DS    AL4                                                      00438000
CSPLOA   DS    AL4                                                      00439000
CSPLCBUF DS    AL4                                                      00440000
         ORG   CSPL+24                                                  00441000
CSOA     DS    CL8                                                      00442000
         ORG   CSOA                                                     00443000
CSOACNM  DS    AL4                                                      00444000
CSOALNM  DS    FL2                                                      00445000
CSOAFLG  DS    CL1                                                      00446000
         ORG   CSOAFLG                                                  00447000
CSOAVWP  DS    BL1                                                      00448000
CSOAVNP  EQU   CSOAFLG+0                                                00449000
CSOAQM   EQU   CSOAFLG+0                                                00450000
CSOANOC  EQU   CSOAFLG+0                                                00451000
CSOABAD  EQU   CSOAFLG+0                                                00452000
CSOAEXEC EQU   CSOAFLG+0                                                00453000
@NM00072 EQU   CSOAFLG+0                                                00454000
@NM00073 EQU   CSOAFLG+0                                                00455000
         ORG   CSOA+7                                                   00456000
@NM00074 DS    CL1                                                      00457000
         ORG   CSOA+8                                                   00458000
CMDNAM   DS    CL9                                                      00459000
         ORG   CMDNAM                                                   00460000
CMDNAML  DS    FL1                                                      00461000
CMDNAMT  DS    CL8                                                      00462000
         ORG   CMDNAMT                                                  00463000
CMDNAMTA DS    CL8                                                      00464000
         ORG   CMDNAM+9                                                 00465000
BLSUTSO  CSECT                                                          00466000
         DS    0F                                                       00467000
@SIZDATD DC    AL1(0)                                                   00468000
         DC    AL3(@ENDDATD-@DATD)                                      00469000
         DS    0D                                                       00470000
@CC00104 DC    C'        '                                              00471000
@CC00842 DC    C'TIME'                                                  00472000
M057     DS    CL34                                                     00473000
         ORG   M057                                                     00474000
M057L    DC    AL2(34)                                                  00475000
@NM00075 DC    X'0000'                                                  00476000
M057T    DS    CL30                                                     00477000
         ORG   M057T                                                    00478000
M057TA   DC    CL30'BLS21057I NO TSO COMMAND NAMED'                     00479000
         ORG   M057+34                                                  00480000
M058     DS    CL52                                                     00481000
         ORG   M058                                                     00482000
M058L    DC    AL2(52)                                                  00483000
@NM00076 DC    X'0000'                                                  00484000
M058T    DS    CL48                                                     00485000
         ORG   M058T                                                    00486000
M058TA   DC    CL48'BLS21058I TSO SUBCOMMAND DOES NOT SUPPORT CLISTS'   00487000
         ORG   M058+52                                                  00488000
M059     DS    CL46                                                     00489000
         ORG   M059                                                     00490000
M059L    DC    AL2(46)                                                  00491000
@NM00077 DC    X'0000'                                                  00492000
M059T    DS    CL42                                                     00493000
         ORG   M059T                                                    00494000
M059TA   DC    CL42'BLS21059I COMMAND NOT SUPPORTED UNDER IPCS'         00495000
         ORG   M059+46                                                  00496000
@DATD    DSECT                                                          00497000
         SPACE 2                                                        00498000
*********************************************************************** 00499000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00500000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 00501000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 00502000
*********************************************************************** 00503000
         SPACE                                                          00504000
BLSUTSO  CSECT                                                          00505000
         ORG                                                            00506000
         DS    0D                                                       00507000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSUTSO+19)/20+7)/8)CL8'BLSUTSO'       00508000
@DATD    DSECT                                                          00509000
         DS    0H                                                       00510000
@DATD    DSECT                                                          00511000
         SPACE 2                                                        00512000
*********************************************************************** 00513000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 00514000
*********************************************************************** 00515000
         SPACE                                                          00516000
         DS    0D                                                       00517000
@DATD    DSECT                                                          00518000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00519000
@ENDDATD EQU   *                                                        00520000
BLSUTSO  CSECT                                                          00521000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00522000
@01      EQU   01                                                       00523000
@02      EQU   02                                                       00524000
@03      EQU   03                                                       00525000
@04      EQU   04                                                       00526000
@05      EQU   05                                                       00527000
@06      EQU   06                                                       00528000
@07      EQU   07                                                       00529000
@08      EQU   08                                                       00530000
@09      EQU   09                                                       00531000
@10      EQU   10                                                       00532000
@11      EQU   11                                                       00533000
@12      EQU   12                                                       00534000
@13      EQU   13                                                       00535000
@14      EQU   14                                                       00536000
@15      EQU   15                                                       00537000
SCH0001A EQU   @04                                                      00538000
SCH0001G EQU   @02                                                      00539000
RETC     EQU   @02                                                      00540000
CMDINDEX EQU   @03                                                      00541000
R9       EQU   @09                                                      00542000
R0       EQU   @00                                                      00543000
R1       EQU   @01                                                      00544000
R2       EQU   @02                                                      00545000
R3       EQU   @03                                                      00546000
R4       EQU   @04                                                      00547000
R5       EQU   @05                                                      00548000
RB       EQU   @11                                                      00549000
RD       EQU   @13                                                      00550000
RE       EQU   @14                                                      00551000
RF       EQU   @15                                                      00552000
GPR01P   EQU   @01                                                      00553000
RA       EQU   @10                                                      00554000
RC       EQU   @12                                                      00555000
R6       EQU   @06                                                      00556000
R7       EQU   @07                                                      00557000
R8       EQU   @08                                                      00558000
ZZ1      EQU   0                                                        00559000
ZZ1ATTN  EQU   ZZ1+360                                                  00560000
ZZ1EVE   EQU   ZZ1ATTN+4                                                00561000
ZZ1F     EQU   ZZ1+368                                                  00562000
ZZ1N     EQU   ZZ1+1116                                                 00563000
ZZ2      EQU   0                                                        00564000
ZZ2AMD   EQU   ZZ2                                                      00565000
@NM00015 EQU   ZZ2AMD+7                                                 00566000
ZZ2PRT   EQU   ZZ2+138                                                  00567000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 00568000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                00569000
ZZ2A     EQU   ZZ2+272                                                  00570000
ZZ2AF    EQU   ZZ2A+16                                                  00571000
ZZ2APID  EQU   ZZ2A+64                                                  00572000
ZZ2AD    EQU   ZZ2A+74                                                  00573000
ZZ2ADD   EQU   ZZ2AD                                                    00574000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 00575000
ZZ2ADM   EQU   ZZ2AD+46                                                 00576000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 00577000
ZZ2ADP   EQU   ZZ2AD+56                                                 00578000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 00579000
ZZ2AQAS  EQU   ZZ2A+144                                                 00580000
ZZ2AQD   EQU   ZZ2A+160                                                 00581000
ZZ2AQDT  EQU   ZZ2AQD+10                                                00582000
ZZ2AQDF  EQU   ZZ2AQD+52                                                00583000
ZZ2SCMDN EQU   ZZ2+936                                                  00584000
ZZ2SCMDE EQU   ZZ2+944                                                  00585000
ZZ2STG   EQU   ZZ2+960                                                  00586000
ZZ2ALLOP EQU   ZZ2+992                                                  00587000
ZZ2FREEP EQU   ZZ2+996                                                  00588000
ZZ2FF19P EQU   ZZ2+1000                                                 00589000
ZZ2FRE1P EQU   ZZ2+1004                                                 00590000
ZZ2FF18P EQU   ZZ2+1008                                                 00591000
ZZ2DYNAP EQU   ZZ2+1012                                                 00592000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 00593000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 00594000
ZZ2STAIP EQU   ZZ2+1024                                                 00595000
ZZ2FF02P EQU   ZZ2+1028                                                 00596000
ZZ2GETLP EQU   ZZ2+1032                                                 00597000
ZZ2PARSP EQU   ZZ2+1036                                                 00598000
ZZ2PTGTP EQU   ZZ2+1040                                                 00599000
ZZ2PUTLP EQU   ZZ2+1044                                                 00600000
ZZ2SCANP EQU   ZZ2+1048                                                 00601000
ZZ2STCKP EQU   ZZ2+1052                                                 00602000
ZZ2ALOCP EQU   ZZ2+1056                                                 00603000
ZZ2MSGSP EQU   ZZ2+1060                                                 00604000
ZZ2TRMOP EQU   ZZ2+1064                                                 00605000
ZZ2TRMVP EQU   ZZ2+1068                                                 00606000
ZZ2FT25P EQU   ZZ2+1072                                                 00607000
ZZ2MSG0P EQU   ZZ2+1076                                                 00608000
ZZ2PUTNP EQU   ZZ2+1084                                                 00609000
ZZ2TRMNP EQU   ZZ2+1088                                                 00610000
ZZ2ENQ0P EQU   ZZ2+1092                                                 00611000
ZZ2ADSDP EQU   ZZ2+1096                                                 00612000
ZZ2APDRP EQU   ZZ2+1100                                                 00613000
ZZ2FDSDP EQU   ZZ2+1104                                                 00614000
ZZ2FPDRP EQU   ZZ2+1108                                                 00615000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 00616000
ZZ2DVTP  EQU   ZZ2+1276                                                 00617000
ZZ2BVTP  EQU   ZZ2+1280                                                 00618000
ZZ2CPPL  EQU   ZZ2+1292                                                 00619000
ZZ2CPPLC EQU   ZZ2CPPL                                                  00620000
ZZ2F     EQU   ZZ2+2824                                                 00621000
ZZ2ITR   EQU   ZZ2+2840                                                 00622000
ZZ2ITRE  EQU   ZZ2ITR+16                                                00623000
ZZ2ITSE  EQU   ZZ2+2864                                                 00624000
ZZ2ES    EQU   ZZ2+2872                                                 00625000
ZZ2AMDX  EQU   ZZ2+7160                                                 00626000
ZZ2AXO   EQU   ZZ2+7934                                                 00627000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 00628000
CMD      EQU   0                                                        00629000
CMDO     EQU   CMD+2                                                    00630000
CMDT     EQU   CMD+4                                                    00631000
PSCB     EQU   0                                                        00632000
PSCBATR1 EQU   PSCB+16                                                  00633000
ECT      EQU   0                                                        00634000
ECTPCMD  EQU   ECT+12                                                   00635000
ECTSWS   EQU   ECT+28                                                   00636000
ECTNOPD  EQU   ECTSWS                                                   00637000
ECTSWS2  EQU   ECT+40                                                   00638000
ECTSWS21 EQU   ECTSWS2                                                  00639000
UPT      EQU   0                                                        00640000
UPTSWS   EQU   UPT+12                                                   00641000
SA       EQU   0                                                        00642000
SA1      EQU   SA                                                       00643000
SAR      EQU   SA+12                                                    00644000
SAR1     EQU   SAR+12                                                   00645000
BLSUMONA EQU   0                                                        00646000
BLSUMON2 EQU   0                                                        00647000
BLSUTRMV EQU   0                                                        00648000
BVT      EQU   0                                                        00649000
BVTPUTLP EQU   BVT+4                                                    00650000
BVTPUTOP EQU   BVT+12                                                   00651000
BVTPUTTP EQU   BVT+16                                                   00652000
BVTPUTVP EQU   BVT+20                                                   00653000
BVTPUTAP EQU   BVT+24                                                   00654000
BVTPRTTP EQU   BVT+28                                                   00655000
BVTPRTAP EQU   BVT+32                                                   00656000
BVTPUTDP EQU   BVT+36                                                   00657000
BVTMONP  EQU   BVT+40                                                   00658000
BVTMON2P EQU   BVT+44                                                   00659000
BVTVSARP EQU   BVT+48                                                   00660000
BVTVSENP EQU   BVT+64                                                   00661000
BVTVSERP EQU   BVT+68                                                   00662000
BVTVSGEP EQU   BVT+72                                                   00663000
BVTVSGUP EQU   BVT+76                                                   00664000
BVTVSPOP EQU   BVT+80                                                   00665000
BVTVSPUP EQU   BVT+84                                                   00666000
BVTMPKNP EQU   BVT+104                                                  00667000
BVTMONLP EQU   BVT+108                                                  00668000
BVTPUTCP EQU   BVT+132                                                  00669000
BVTMPK1P EQU   BVT+136                                                  00670000
BVTZZ2RP EQU   BVT+140                                                  00671000
BVTPGMRP EQU   BVT+144                                                  00672000
BVTMONAP EQU   BVT+148                                                  00673000
BVTBLDDP EQU   BVT+152                                                  00674000
BVTBLDLP EQU   BVT+156                                                  00675000
BVTPGMCP EQU   BVT+160                                                  00676000
BVTPGMDP EQU   BVT+164                                                  00677000
BVTPGMLP EQU   BVT+168                                                  00678000
BVTMONCP EQU   BVT+180                                                  00679000
BVTMONDP EQU   BVT+184                                                  00680000
BVTMONTP EQU   BVT+188                                                  00681000
BVTPARIP EQU   BVT+192                                                  00682000
BVTPARUP EQU   BVT+196                                                  00683000
BVTSTBLP EQU   BVT+200                                                  00684000
BVTPRTNP EQU   BVT+204                                                  00685000
BVTVSCRP EQU   BVT+208                                                  00686000
BVTVSMRP EQU   BVT+212                                                  00687000
BVTMONXP EQU   BVT+216                                                  00688000
BVTTRMAP EQU   BVT+228                                                  00689000
DVT      EQU   0                                                        00690000
DVTDEQPP EQU   DVT+8                                                    00691000
DVTENQPP EQU   DVT+12                                                   00692000
DVTAUTHP EQU   DVT+20                                                   00693000
DVTLPCLP EQU   DVT+24                                                   00694000
DVTBP00P EQU   DVT+28                                                   00695000
DVTCN00P EQU   DVT+32                                                   00696000
DVTDF00P EQU   DVT+36                                                   00697000
DVTDS00P EQU   DVT+44                                                   00698000
DVTFL00P EQU   DVT+48                                                   00699000
DVTFP00P EQU   DVT+52                                                   00700000
DVTGD00P EQU   DVT+56                                                   00701000
DVTGG00P EQU   DVT+60                                                   00702000
DVTGP00P EQU   DVT+64                                                   00703000
DVTND00P EQU   DVT+68                                                   00704000
DVTND01P EQU   DVT+72                                                   00705000
DVTOD00P EQU   DVT+76                                                   00706000
DVTPS00P EQU   DVT+80                                                   00707000
DVTSD00P EQU   DVT+84                                                   00708000
DVTSL00P EQU   DVT+88                                                   00709000
DVTTL00P EQU   DVT+92                                                   00710000
DVTUD00P EQU   DVT+96                                                   00711000
DVTUP00P EQU   DVT+100                                                  00712000
DVTLP00P EQU   DVT+104                                                  00713000
DVTLALLP EQU   DVT+108                                                  00714000
DVTLPFMP EQU   DVT+112                                                  00715000
DVTCLOSP EQU   DVT+116                                                  00716000
DVTOPENP EQU   DVT+120                                                  00717000
DVTPERAP EQU   DVT+124                                                  00718000
DVTDALLP EQU   DVT+128                                                  00719000
STB      EQU   0                                                        00720000
STBDIM   EQU   STB+8                                                    00721000
STBS     EQU   STB+12                                                   00722000
STBSF    EQU   STBS+1                                                   00723000
STBSFINV EQU   STBSF                                                    00724000
STBSN    EQU   STBS+3                                                   00725000
IKJEFT25 EQU   0                                                        00726000
CSOACN   EQU   0                                                        00727000
BLSCALOC EQU   0                                                        00728000
BLSDADSD EQU   0                                                        00729000
BLSDAPDR EQU   0                                                        00730000
BLSDDEQP EQU   0                                                        00731000
BLSDENQP EQU   0                                                        00732000
BLSDENQ0 EQU   0                                                        00733000
BLSDFDSD EQU   0                                                        00734000
BLSDFPDR EQU   0                                                        00735000
BLSDMSGS EQU   0                                                        00736000
BLSDMSG0 EQU   0                                                        00737000
BLSEAUTH EQU   0                                                        00738000
BLSELPCL EQU   0                                                        00739000
BLSELPFM EQU   0                                                        00740000
BLSFBP00 EQU   0                                                        00741000
BLSFCLOS EQU   0                                                        00742000
BLSFCN00 EQU   0                                                        00743000
BLSFDALL EQU   0                                                        00744000
BLSFDF00 EQU   0                                                        00745000
BLSFDS00 EQU   0                                                        00746000
BLSFFL00 EQU   0                                                        00747000
BLSFFP00 EQU   0                                                        00748000
BLSFGD00 EQU   0                                                        00749000
BLSFGG00 EQU   0                                                        00750000
BLSFGP00 EQU   0                                                        00751000
BLSFLALL EQU   0                                                        00752000
BLSFLP00 EQU   0                                                        00753000
BLSFND00 EQU   0                                                        00754000
BLSFND01 EQU   0                                                        00755000
BLSFOD00 EQU   0                                                        00756000
BLSFOPEN EQU   0                                                        00757000
BLSFPERA EQU   0                                                        00758000
BLSFPS00 EQU   0                                                        00759000
BLSFSD00 EQU   0                                                        00760000
BLSFSL00 EQU   0                                                        00761000
BLSFTL00 EQU   0                                                        00762000
BLSFUD00 EQU   0                                                        00763000
BLSFUP00 EQU   0                                                        00764000
BLSUALLO EQU   0                                                        00765000
BLSUBLDD EQU   0                                                        00766000
BLSUBLDL EQU   0                                                        00767000
BLSUDYNA EQU   0                                                        00768000
BLSUFREE EQU   0                                                        00769000
BLSUFRE1 EQU   0                                                        00770000
BLSUMON  EQU   0                                                        00771000
BLSUMONC EQU   0                                                        00772000
BLSUMOND EQU   0                                                        00773000
BLSUMONL EQU   0                                                        00774000
BLSUMONT EQU   0                                                        00775000
BLSUMONX EQU   0                                                        00776000
BLSUMPKN EQU   0                                                        00777000
BLSUMPK1 EQU   0                                                        00778000
BLSUPARI EQU   0                                                        00779000
BLSUPARU EQU   0                                                        00780000
BLSUPGMC EQU   0                                                        00781000
BLSUPGMD EQU   0                                                        00782000
BLSUPGML EQU   0                                                        00783000
BLSUPGMR EQU   0                                                        00784000
BLSUPRTA EQU   0                                                        00785000
BLSUPRTN EQU   0                                                        00786000
BLSUPRTT EQU   0                                                        00787000
BLSUPUTA EQU   0                                                        00788000
BLSUPUTC EQU   0                                                        00789000
BLSUPUTD EQU   0                                                        00790000
BLSUPUTL EQU   0                                                        00791000
BLSUPUTN EQU   0                                                        00792000
BLSUPUTO EQU   0                                                        00793000
BLSUPUTT EQU   0                                                        00794000
BLSUPUTV EQU   0                                                        00795000
BLSUSTAI EQU   0                                                        00796000
BLSUTRMA EQU   0                                                        00797000
BLSUTRMN EQU   0                                                        00798000
BLSUTRMO EQU   0                                                        00799000
BLSUVSAR EQU   0                                                        00800000
BLSUVSCR EQU   0                                                        00801000
BLSUVSEN EQU   0                                                        00802000
BLSUVSER EQU   0                                                        00803000
BLSUVSGE EQU   0                                                        00804000
BLSUVSGU EQU   0                                                        00805000
BLSUVSMR EQU   0                                                        00806000
BLSUVSPO EQU   0                                                        00807000
BLSUVSPU EQU   0                                                        00808000
BLSUZZ2C EQU   0                                                        00809000
BLSUZZ2D EQU   0                                                        00810000
BLSUZZ2R EQU   0                                                        00811000
IKJEFF02 EQU   0                                                        00812000
IKJEFF18 EQU   0                                                        00813000
IKJEFF19 EQU   0                                                        00814000
IKJGETL  EQU   0                                                        00815000
IKJPARS  EQU   0                                                        00816000
IKJPTGT  EQU   0                                                        00817000
IKJPUTL  EQU   0                                                        00818000
IKJSCAN  EQU   0                                                        00819000
IKJSTCK  EQU   0                                                        00820000
I001C    EQU   0                                                        00821000
I008P    EQU   0                                                        00822000
I015F    EQU   0                                                        00823000
I015P    EQU   0                                                        00824000
I031F    EQU   0                                                        00825000
I031P    EQU   0                                                        00826000
I256C    EQU   0                                                        00827000
CPPL     EQU   ZZ2CPPL                                                  00828000
CPPLUPT  EQU   CPPL+4                                                   00829000
CPPLPSCB EQU   CPPL+8                                                   00830000
CPPLECT  EQU   CPPL+12                                                  00831000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00832000
CPPLCBUF EQU   CPPL                                                     00833000
STBSEP   EQU   STBS+12                                                  00834000
STBSNT   EQU   STBSN+1                                                  00835000
STBSNL   EQU   STBSN                                                    00836000
@NM00078 EQU   STBSF                                                    00837000
STBSFDU  EQU   STBSF                                                    00838000
STBSFDSD EQU   STBSF                                                    00839000
STBSFPDR EQU   STBSF                                                    00840000
STBST    EQU   STBS                                                     00841000
STBID    EQU   STB                                                      00842000
DVT99999 EQU   DVT+256                                                  00843000
DVT0064P EQU   DVT+252                                                  00844000
DVT0063P EQU   DVT+248                                                  00845000
DVT0062P EQU   DVT+244                                                  00846000
DVT0061P EQU   DVT+240                                                  00847000
DVT0060P EQU   DVT+236                                                  00848000
DVT0059P EQU   DVT+232                                                  00849000
DVT0058P EQU   DVT+228                                                  00850000
DVT0057P EQU   DVT+224                                                  00851000
DVT0056P EQU   DVT+220                                                  00852000
DVT0055P EQU   DVT+216                                                  00853000
DVT0054P EQU   DVT+212                                                  00854000
DVT0053P EQU   DVT+208                                                  00855000
DVT0052P EQU   DVT+204                                                  00856000
DVT0051P EQU   DVT+200                                                  00857000
DVT0050P EQU   DVT+196                                                  00858000
DVT0049P EQU   DVT+192                                                  00859000
DVT0048P EQU   DVT+188                                                  00860000
DVT0047P EQU   DVT+184                                                  00861000
DVT0046P EQU   DVT+180                                                  00862000
DVT0045P EQU   DVT+176                                                  00863000
DVT0044P EQU   DVT+172                                                  00864000
DVT0043P EQU   DVT+168                                                  00865000
DVT0042P EQU   DVT+164                                                  00866000
DVT0041P EQU   DVT+160                                                  00867000
DVT0040P EQU   DVT+156                                                  00868000
DVT0039P EQU   DVT+152                                                  00869000
DVT0038P EQU   DVT+148                                                  00870000
DVT0037P EQU   DVT+144                                                  00871000
DVT0036P EQU   DVT+140                                                  00872000
DVT0035P EQU   DVT+136                                                  00873000
DVT0034P EQU   DVT+132                                                  00874000
DVT0011P EQU   DVT+40                                                   00875000
DVT0005P EQU   DVT+16                                                   00876000
DVT0002P EQU   DVT+4                                                    00877000
DVT0001P EQU   DVT                                                      00878000
BVT99999 EQU   BVT+256                                                  00879000
BVT0064P EQU   BVT+252                                                  00880000
BVT0063P EQU   BVT+248                                                  00881000
BVT0062P EQU   BVT+244                                                  00882000
BVT0061P EQU   BVT+240                                                  00883000
BVT0060P EQU   BVT+236                                                  00884000
BVT0059P EQU   BVT+232                                                  00885000
BVT0057P EQU   BVT+224                                                  00886000
BVT0056P EQU   BVT+220                                                  00887000
BVT0045P EQU   BVT+176                                                  00888000
BVT0044P EQU   BVT+172                                                  00889000
BVT0033P EQU   BVT+128                                                  00890000
BVT0032P EQU   BVT+124                                                  00891000
BVT0031P EQU   BVT+120                                                  00892000
BVT0030P EQU   BVT+116                                                  00893000
BVT0029P EQU   BVT+112                                                  00894000
BVT0026P EQU   BVT+100                                                  00895000
BVT0025P EQU   BVT+96                                                   00896000
BVT0024P EQU   BVT+92                                                   00897000
BVT0023P EQU   BVT+88                                                   00898000
BVT0016P EQU   BVT+60                                                   00899000
BVT0015P EQU   BVT+56                                                   00900000
BVT0014P EQU   BVT+52                                                   00901000
BVT0003P EQU   BVT+8                                                    00902000
BVT0001P EQU   BVT                                                      00903000
SA99     EQU   SA+72                                                    00904000
SARC     EQU   SAR+56                                                   00905000
SARB     EQU   SAR+52                                                   00906000
SARA     EQU   SAR+48                                                   00907000
SAR9     EQU   SAR+44                                                   00908000
SAR8     EQU   SAR+40                                                   00909000
SAR7     EQU   SAR+36                                                   00910000
SAR6     EQU   SAR+32                                                   00911000
SAR5     EQU   SAR+28                                                   00912000
SAR4     EQU   SAR+24                                                   00913000
SAR3     EQU   SAR+20                                                   00914000
SAR2     EQU   SAR+16                                                   00915000
SAR0     EQU   SAR+8                                                    00916000
SARF     EQU   SAR+4                                                    00917000
SARE     EQU   SAR                                                      00918000
SAFWD    EQU   SA+8                                                     00919000
SABAK    EQU   SA+4                                                     00920000
SA1L     EQU   SA1+1                                                    00921000
SA1P     EQU   SA1                                                      00922000
UPTPREFL EQU   UPT+23                                                   00923000
UPTPREFX EQU   UPT+16                                                   00924000
@NM00071 EQU   UPT+15                                                   00925000
UPTLDEL  EQU   UPT+14                                                   00926000
UPTCDEL  EQU   UPT+13                                                   00927000
UPTWTP   EQU   UPTSWS                                                   00928000
UPTMODE  EQU   UPTSWS                                                   00929000
UPTALD   EQU   UPTSWS                                                   00930000
UPTPAUS  EQU   UPTSWS                                                   00931000
UPTNCOM  EQU   UPTSWS                                                   00932000
UPTMID   EQU   UPTSWS                                                   00933000
UPTNPRM  EQU   UPTSWS                                                   00934000
UPTRCVR  EQU   UPTSWS                                                   00935000
UPTUSER  EQU   UPT+2                                                    00936000
@NM00070 EQU   UPT                                                      00937000
@NM00069 EQU   ECT+52                                                   00938000
@NM00068 EQU   ECT+48                                                   00939000
@NM00067 EQU   ECT+44                                                   00940000
@NM00066 EQU   ECTSWS2+1                                                00941000
@NM00065 EQU   ECTSWS21                                                 00942000
ECTTABND EQU   ECTSWS21                                                 00943000
ECTDEFCS EQU   ECTSWS21                                                 00944000
ECTBKPB  EQU   ECT+36                                                   00945000
ECTUSER  EQU   ECT+32                                                   00946000
ECTDDNUM EQU   ECT+29                                                   00947000
ECTATTN  EQU   ECTSWS                                                   00948000
ECTBKGRD EQU   ECTSWS                                                   00949000
ECTNNOT  EQU   ECTSWS                                                   00950000
ECTNMAL  EQU   ECTSWS                                                   00951000
ECTLOGF  EQU   ECTSWS                                                   00952000
ECTATRM  EQU   ECTSWS                                                   00953000
@NM00064 EQU   ECTSWS                                                   00954000
ECTSCMD  EQU   ECT+20                                                   00955000
ECTSMSG  EQU   ECT+9                                                    00956000
ECTMSGF  EQU   ECT+8                                                    00957000
ECTIOWA  EQU   ECT+4                                                    00958000
ECTRTCD  EQU   ECT+1                                                    00959000
ECTRCDF  EQU   ECT                                                      00960000
PSCBU    EQU   PSCB+64                                                  00961000
PSCBRSZ  EQU   PSCB+60                                                  00962000
PSCBLINE EQU   PSCB+59                                                  00963000
PSCBCHAR EQU   PSCB+58                                                  00964000
PSCBUPTL EQU   PSCB+56                                                  00965000
PSCBUPT  EQU   PSCB+52                                                  00966000
PSCBRLGB EQU   PSCB+48                                                  00967000
PSCBDEST EQU   PSCB+40                                                  00968000
@NM00063 EQU   PSCB+36                                                  00969000
@NM00062 EQU   PSCB+32                                                  00970000
@NM00061 EQU   PSCB+28                                                  00971000
PSCBLTI2 EQU   PSCB+24                                                  00972000
PSCBLTIM EQU   PSCB+20                                                  00973000
PSCBATR2 EQU   PSCB+18                                                  00974000
@NM00060 EQU   PSCBATR1                                                 00975000
@NM00059 EQU   PSCBATR1                                                 00976000
@NM00058 EQU   PSCBATR1                                                 00977000
PSCBATTN EQU   PSCBATR1                                                 00978000
PSCBVMNT EQU   PSCBATR1                                                 00979000
PSCBJCL  EQU   PSCBATR1                                                 00980000
PSCBACCT EQU   PSCBATR1                                                 00981000
PSCBCTRL EQU   PSCBATR1                                                 00982000
PSCBGPNM EQU   PSCB+8                                                   00983000
PSCBUSRL EQU   PSCB+7                                                   00984000
PSCBUSER EQU   PSCB                                                     00985000
CMDT1    EQU   CMDT                                                     00986000
CMDL     EQU   CMD                                                      00987000
ZZ299999 EQU   ZZ2+8192                                                 00988000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  00989000
ZZ2AXOL  EQU   ZZ2AXO                                                   00990000
@NM00057 EQU   ZZ2+7288                                                 00991000
@NM00056 EQU   ZZ2AMDX+4                                                00992000
ZZ2AMDXC EQU   ZZ2AMDX                                                  00993000
ZZ2HSD   EQU   ZZ2+3056                                                 00994000
@NM00055 EQU   ZZ2ES                                                    00995000
@NM00054 EQU   ZZ2+2868                                                 00996000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                00997000
@NM00053 EQU   ZZ2ITSE                                                  00998000
ZZ2ITSEP EQU   ZZ2ITSE                                                  00999000
ZZ2ITSEW EQU   ZZ2ITSE                                                  01000000
@NM00052 EQU   ZZ2ITR+20                                                01001000
ZZ2ITREC EQU   ZZ2ITRE+1                                                01002000
@NM00051 EQU   ZZ2ITRE                                                  01003000
ZZ2ITREP EQU   ZZ2ITRE                                                  01004000
ZZ2ITREW EQU   ZZ2ITRE                                                  01005000
@NM00050 EQU   ZZ2ITR+9                                                 01006000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 01007000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 01008000
ZZ2ITRPP EQU   ZZ2ITR                                                   01009000
@NM00049 EQU   ZZ2F                                                     01010000
ZZ2F3270 EQU   ZZ2F                                                     01011000
@NM00048 EQU   ZZ2+1544                                                 01012000
ZZ2PGM   EQU   ZZ2+1536                                                 01013000
@NM00047 EQU   ZZ2+1526                                                 01014000
ZZ2CW    EQU   ZZ2+1524                                                 01015000
@NM00046 EQU   ZZ2+1504                                                 01016000
@NM00045 EQU   ZZ2+1352                                                 01017000
ZZ2FFSYP EQU   ZZ2+1348                                                 01018000
ZZ2SASYP EQU   ZZ2+1344                                                 01019000
ZZ2RDSYP EQU   ZZ2+1340                                                 01020000
ZZ2RASYP EQU   ZZ2+1336                                                 01021000
ZZ2PHSYP EQU   ZZ2+1332                                                 01022000
ZZ2ESSYP EQU   ZZ2+1328                                                 01023000
ZZ200SYP EQU   ZZ2+1324                                                 01024000
ZZ2SCWP  EQU   ZZ2+1320                                                 01025000
ZZ2TTLP  EQU   ZZ2+1316                                                 01026000
ZZ2LOADP EQU   ZZ2+1312                                                 01027000
ZZ2VRESP EQU   ZZ2+1308                                                 01028000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               01029000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                01030000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                01031000
ZZ2VRSAP EQU   ZZ2+1288                                                 01032000
ZZ2RVTP  EQU   ZZ2+1284                                                 01033000
@NM00044 EQU   ZZ2+1272                                                 01034000
@NM00043 EQU   ZZ2+1268                                                 01035000
ZZ2RPLP  EQU   ZZ2+1260                                                 01036000
ZZ2TCBP  EQU   ZZ2+1256                                                 01037000
@NM00042 EQU   ZZ2+1252                                                 01038000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 01039000
@NM00041 EQU   ZZ2+1112                                                 01040000
@NM00040 EQU   ZZ2+1080                                                 01041000
@NM00039 EQU   ZZ2+976                                                  01042000
ZZ2TOD   EQU   ZZ2+968                                                  01043000
ZZ2STGN  EQU   ZZ2STG+4                                                 01044000
ZZ2STGP  EQU   ZZ2STG                                                   01045000
@NM00038 EQU   ZZ2+952                                                  01046000
ZZ2IDENT EQU   ZZ2+928                                                  01047000
ZZ2A9999 EQU   ZZ2A+656                                                 01048000
@NM00037 EQU   ZZ2A+224                                                 01049000
@NM00036 EQU   ZZ2A+220                                                 01050000
ZZ2AQD99 EQU   ZZ2AQD+60                                                01051000
@NM00035 EQU   ZZ2AQD+56                                                01052000
@NM00034 EQU   ZZ2AQDF                                                  01053000
ZZ2AQDFA EQU   ZZ2AQDF                                                  01054000
ZZ2AQDIL EQU   ZZ2AQD+48                                                01055000
ZZ2AQDIM EQU   ZZ2AQD+44                                                01056000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               01057000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               01058000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                01059000
@NM00033 EQU   ZZ2AQDT+1                                                01060000
ZZ2AQDTY EQU   ZZ2AQDT                                                  01061000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  01062000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 01063000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 01064000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 01065000
ZZ2AQDOF EQU   ZZ2AQD                                                   01066000
ZZ2AQD00 EQU   ZZ2AQD                                                   01067000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               01068000
@NM00032 EQU   ZZ2AQAS+12                                               01069000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                01070000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                01071000
@NM00031 EQU   ZZ2AQAS+2                                                01072000
ZZ2AQAST EQU   ZZ2AQAS                                                  01073000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  01074000
ZZ2AZZ6P EQU   ZZ2A+140                                                 01075000
ZZ2ADPTA EQU   ZZ2ADPT                                                  01076000
ZZ2ADPL  EQU   ZZ2ADP                                                   01077000
ZZ2ADMTA EQU   ZZ2ADMT                                                  01078000
ZZ2ADML  EQU   ZZ2ADM                                                   01079000
ZZ2ADDTA EQU   ZZ2ADDT                                                  01080000
ZZ2ADDL  EQU   ZZ2ADD                                                   01081000
@NM00030 EQU   ZZ2A+72                                                  01082000
ZZ2APIDB EQU   ZZ2APID+3                                                01083000
ZZ2APIDA EQU   ZZ2APID                                                  01084000
@NM00029 EQU   ZZ2A+24                                                  01085000
@NM00028 EQU   ZZ2AF+5                                                  01086000
ZZ2AFX   EQU   ZZ2AF+5                                                  01087000
@NM00027 EQU   ZZ2AF+3                                                  01088000
ZZ2AFS   EQU   ZZ2AF+2                                                  01089000
ZZ2AFD   EQU   ZZ2AF+2                                                  01090000
ZZ2AFQ   EQU   ZZ2AF+2                                                  01091000
ZZ2AF$   EQU   ZZ2AF+2                                                  01092000
@NM00026 EQU   ZZ2AF+2                                                  01093000
ZZ2AFM   EQU   ZZ2AF+2                                                  01094000
@NM00025 EQU   ZZ2AF+2                                                  01095000
@NM00024 EQU   ZZ2AF+1                                                  01096000
ZZ2AFV   EQU   ZZ2AF+1                                                  01097000
@NM00023 EQU   ZZ2AF+1                                                  01098000
ZZ2AFC   EQU   ZZ2AF+1                                                  01099000
@NM00022 EQU   ZZ2AF                                                    01100000
ZZ2AFFS  EQU   ZZ2AF                                                    01101000
ZZ2AFT   EQU   ZZ2AF                                                    01102000
ZZ2AFP   EQU   ZZ2AF                                                    01103000
@NM00021 EQU   ZZ2A+8                                                   01104000
ZZ2ALINE EQU   ZZ2A+4                                                   01105000
@NM00020 EQU   ZZ2A+3                                                   01106000
ZZ2ASE   EQU   ZZ2A+2                                                   01107000
ZZ2ACH   EQU   ZZ2A                                                     01108000
@NM00019 EQU   ZZ2+264                                                  01109000
@NM00018 EQU   ZZ2+263                                                  01110000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  01111000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 01112000
ZZ2PRTL  EQU   ZZ2PRT                                                   01113000
@NM00017 EQU   ZZ2AMD+56                                                01114000
ZZ2AMDXP EQU   ZZ2AMD+52                                                01115000
ZZ2AMDD  EQU   ZZ2AMD+48                                                01116000
ZZ2AMDL  EQU   ZZ2AMD+44                                                01117000
ZZ2AMDU  EQU   ZZ2AMD+28                                                01118000
ZZ2AMDF  EQU   ZZ2AMD+24                                                01119000
ZZ2AMDS  EQU   ZZ2AMD+20                                                01120000
ZZ2AMDC  EQU   ZZ2AMD+16                                                01121000
ZZ2AMDP  EQU   ZZ2AMD+12                                                01122000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 01123000
@NM00016 EQU   @NM00015                                                 01124000
ZZ2AMD2  EQU   @NM00015                                                 01125000
ZZ2AMD1  EQU   @NM00015                                                 01126000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 01127000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 01128000
ZZ2AMDT  EQU   ZZ2AMD                                                   01129000
ZZ199999 EQU   ZZ1+3072                                                 01130000
@NM00014 EQU   ZZ1+2160                                                 01131000
ZZ1TRTAS EQU   ZZ1+1904                                                 01132000
ZZ1TRUPC EQU   ZZ1+1648                                                 01133000
ZZ1TRCTX EQU   ZZ1+1392                                                 01134000
ZZ1NASID EQU   ZZ1N+274                                                 01135000
ZZ1NSTRL EQU   ZZ1N+272                                                 01136000
ZZ1NOFF  EQU   ZZ1N+268                                                 01137000
ZZ1NBDY  EQU   ZZ1N+264                                                 01138000
ZZ1NADE  EQU   ZZ1N+260                                                 01139000
ZZ1NADB  EQU   ZZ1N+256                                                 01140000
ZZ1NSTR  EQU   ZZ1N                                                     01141000
@NM00013 EQU   ZZ1+1080                                                 01142000
ZZ1TREBC EQU   ZZ1+824                                                  01143000
ZZ1TRHEX EQU   ZZ1+568                                                  01144000
@NM00012 EQU   ZZ1+377                                                  01145000
ZZ1USTAE EQU   ZZ1+376                                                  01146000
@NM00011 EQU   ZZ1F+3                                                   01147000
@NM00010 EQU   ZZ1F+2                                                   01148000
ZZ1FPRNT EQU   ZZ1F+2                                                   01149000
@NM00009 EQU   ZZ1F+1                                                   01150000
ZZ1FTCAM EQU   ZZ1F+1                                                   01151000
ZZ1FACCM EQU   ZZ1F+1                                                   01152000
@NM00008 EQU   ZZ1F                                                     01153000
ZZ1FM    EQU   ZZ1F                                                     01154000
ZZ1FX    EQU   ZZ1F                                                     01155000
ZZ1FU    EQU   ZZ1F                                                     01156000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 01157000
@NM00007 EQU   ZZ1EVE                                                   01158000
ZZ1EVEP  EQU   ZZ1EVE                                                   01159000
ZZ1EVEW  EQU   ZZ1EVE                                                   01160000
ZZ1ACMP  EQU   ZZ1ATTN                                                  01161000
@NM00006 EQU   ZZ1+144                                                  01162000
ZZ1FPP   EQU   ZZ1+140                                                  01163000
ZZ1ZZ6P  EQU   ZZ1+136                                                  01164000
@NM00005 EQU   ZZ1+84                                                   01165000
ZZ1PLINE EQU   ZZ1+80                                                   01166000
ZZ1PGSZ  EQU   ZZ1+76                                                   01167000
ZZ1PCNT  EQU   ZZ1+72                                                   01168000
@NM00004 EQU   ZZ1+68                                                   01169000
ZZ1TPAGE EQU   ZZ1+64                                                   01170000
ZZ1TLINE EQU   ZZ1+60                                                   01171000
@NM00003 EQU   ZZ1+52                                                   01172000
ZZ1DMCBP EQU   ZZ1+48                                                   01173000
ZZ1DSDP  EQU   ZZ1+44                                                   01174000
ZZ1PDRP  EQU   ZZ1+40                                                   01175000
ZZ1ZZ2P  EQU   ZZ1+36                                                   01176000
ZZ1327WP EQU   ZZ1+32                                                   01177000
ZZ1ACBP  EQU   ZZ1+28                                                   01178000
@NM00002 EQU   ZZ1+24                                                   01179000
ZZ1PDCBP EQU   ZZ1+20                                                   01180000
ZZ1BLRBL EQU   ZZ1+16                                                   01181000
@NM00001 EQU   ZZ1+12                                                   01182000
ZZ1PNULL EQU   ZZ1+8                                                    01183000
ZZ1NULL  EQU   ZZ1+4                                                    01184000
ZZ1IDE   EQU   ZZ1                                                      01185000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01186000
@RF00193 EQU   @RC00191                                                 01187000
@ENDDATA EQU   *                                                        01188000
         END   BLSUTSO,(C'PLS2107',0701,78117)                          01189000
