         TITLE 'IEFAB451 - HSKP CONTROL ROUTINE                        *00001000
                        '                                               00002000
IEFAB451 CSECT ,                                                01S0001 00003000
@MAINENT DS    0H                                               01S0001 00004000
         USING *,@15                                            01S0001 00005000
         B     @PROLOG                                          01S0001 00006000
         DC    AL1(16)                                          01S0001 00007000
         DC    C'IEFAB451  76.334'                              01S0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00010000
         BALR  @12,0                                            01S0001 00011000
@PSTART  DS    0H                                               01S0001 00012000
         USING @PSTART,@12                                      01S0001 00013000
         L     @00,@SIZDATD                                     01S0001 00014000
         GSPACE   R,LV=(0)                                              00015000
         LR    @11,@01                                          01S0001 00016000
         USING @DATD,@11                                        01S0001 00017000
         ST    @13,@SA00001+4                                   01S0001 00018000
         LM    @00,@01,20(@13)                                  01S0001 00019000
         ST    @11,8(,@13)                                      01S0001 00020000
         LR    @13,@11                                          01S0001 00021000
         MVC   @PC00001(44),0(@01)                              01S0001 00022000
JSCBDISP EQU 188                                                        00023000
JSCBAOS1 EQU  72                                                        00024000
JSCBAOS2 EQU 192                                                        00025000
*   RTNCODE=SUCCESS;                /* SET NORMAL RETURN CODE        */ 00026000
         SLR   @10,@10                                          01S0061 00027000
         ST    @10,RTNCODE                                      01S0061 00028000
*   IF FSIOTPTR^=0 THEN             /* CHECK FOR ANY REQUESTS TO     */ 00029000
         L     @15,@PC00001+4                                   01S0062 00030000
         C     @10,FSIOTPTR(,@15)                               01S0062 00031000
         BE    @RF00062                                         01S0062 00032000
*     DO;                           /* PROCESS                       */ 00033000
*                                                               02S0064 00034000
*/********************************************************************/ 00035000
*/*                                                                  */ 00036000
*/* SEGMENT NAME - HSKESTAE                                          */ 00037000
*/*                                                                  */ 00038000
*/* DESCRIPTIVE NAME - HSKP ESTAE SETUP                              */ 00039000
*/*                                                                  */ 00040000
*/* FUNCTION - OBTAIN AND INITIALIZE THE ESTAE EXIT PARMLIST.        */ 00041000
*/*            CREATE AN ESTAE ENVIRONMENT.                  @Z40FPPG*/ 00042000
*/*                                                                  */ 00043000
*/*    OPERATION - 1. ISSUE GETMAIN FOR PARMLIST                     */ 00044000
*/*                2. INITIALIZE FIELDS WITHIN PARMLIST              */ 00045000
*/*                3. CREATE ESTAE ENVIRONMENT               @Z40FPPG*/ 00046000
*/*                4. CHECK SUCCESS OF ESTAE SET UP.         @Z40FPPG*/ 00047000
*/*                5. FAIL IF ESTAE UNSUCCESSFUL AND FREE PARMLIST   */ 00048000
*/*                                                                  */ 00049000
*/* ENTRY - INLINE SEGMENT                                           */ 00050000
*/*                                                                  */ 00051000
*/*    INPUT - SEGMENT USES INPUT TO HSKP TO INITIALIZE PARMLIST     */ 00052000
*/*                                                                  */ 00053000
*/* EXIT - N/A                                                       */ 00054000
*/*                                                                  */ 00055000
*/*    CONDITION - IF SUCCESSFUL ESTAE ENVIRONMENT, RTNCODE = 0      */ 00056000
*/*                                                          @Z40FPPG*/ 00057000
*/*                IF UNSUCCESSFUL, RTNCODE=8, REASONCD=16           */ 00058000
*/*                                                                  */ 00059000
*/*    OUTPUT DATA - INITIALIZED ESTAE PARMLIST AND ESTAE            */ 00060000
*/*                  ENVIRONMENT SET UP.                     @Z40FPPG*/ 00061000
*/*                                                                  */ 00062000
*/********************************************************************/ 00063000
*                                                               02S0064 00064000
*                                                               02S0064 00065000
*/********************************************************************/ 00066000
*                                                               02S0064 00067000
*       RFY                                                     02S0064 00068000
*        (REG0,                                                 02S0064 00069000
*         REG1,                                                 02S0064 00070000
*         REG15) RSTD;                                          02S0064 00071000
*       SBPOOL=SUBPOOOL;            /* SET SUBPOOL NUMBER            */ 00072000
         MVI   SBPOOL,X'E6'                                     02S0065 00073000
*       LENTH=LENGTH(EPARMLST);     /* LENGTH OF ESTAE PARMLIST      */ 00074000
         MVC   LENTH(3),@CF01849+1                              02S0066 00075000
*       REG0=SPLEN;                 /* SET SUBPOOL+LENGTH IN REG 0   */ 00076000
         L     REG0,SPLEN                                       02S0067 00077000
*       GEN(GETMAIN R,LV=(0));      /* ESTAE PARMLIST GETMAIN        */ 00078000
         GETMAIN R,LV=(0)                                               00079000
*       EPRMLSTP=REG1;              /* PARMLIST POINTER              */ 00080000
         LR    EPRMLSTP,REG1                                    02S0069 00081000
*       RFY                                                     02S0070 00082000
*        (REG0,                                                 02S0070 00083000
*         REG1) UNRSTD;                                         02S0070 00084000
*       EECNTRLS=0;                 /* CLEAR CONTROLS                */ 00085000
         SLR   @14,@14                                          02S0071 00086000
         ST    @14,EECNTRLS(,EPRMLSTP)                          02S0071 00087000
*       IF IDENQTIO=ON THEN         /* ENQ ON TIOT ONLY IF           */ 00088000
         L     @14,@PC00001                                     02S0072 00089000
         TM    IDENQTIO(@14),B'01000000'                        02S0072 00090000
         BNO   @RF00072                                         02S0072 00091000
*         EEDNENQT=ON;              /* CALLER DIDN'T                 */ 00092000
         OI    EEDNENQT(EPRMLSTP),B'00000001'                   02S0073 00093000
*       IF ICAJSCB=ON THEN          /* REINSTATE JSCB PTR(S) IF      */ 00094000
@RF00072 L     @14,@PC00001                                     02S0074 00095000
         TM    ICAJSCB(@14),B'00100000'                         02S0074 00096000
         BNO   @RF00074                                         02S0074 00097000
*         EERAJSCP=ON;              /* SWITCHING WAS ALLOWED         */ 00098000
         OI    EERAJSCP(EPRMLSTP),B'00000100'                   02S0075 00099000
*       IF IUNCATSW=ON THEN         /* CATALOG UNALLOCATION          */ 00100000
@RF00074 L     @14,@PC00001                                     02S0076 00101000
         TM    IUNCATSW(@14),B'00001000'                        02S0076 00102000
         BNO   @RF00076                                         02S0076 00103000
*         DO;                       /* ALLOWED                       */ 00104000
*           EEUALCAT=ON;            /* UNALLOCATE ALL PVT.CATALOGS   */ 00105000
*           EECLACAT=ON;            /* CLOSE ALL PVT.CATALOGS        */ 00106000
*           EEFAPCCB=ON;            /* FREE ALL PVT.CATALOG PCCBS    */ 00107000
         OI    EEUALCAT(EPRMLSTP),B'11100000'                   02S0080 00108000
*         END;                                                  02S0081 00109000
*       ELSE                        /* DO NOT ALLOW CATALOG          */ 00110000
*         EEDYNAM=ON;               /* UNALLOCATION - DYN.ALLOC.     */ 00111000
         B     @RC00076                                         02S0082 00112000
@RF00076 OI    EEDYNAM(EPRMLSTP),B'00000010'                    02S0082 00113000
*       ECJSCBP=JSCBPTR;            /* CURRENT JSCB PTR              */ 00114000
@RC00076 L     @14,@PC00001+28                                  02S0083 00115000
         L     @14,JSCBPTR(,@14)                                02S0083 00116000
         ST    @14,ECJSCBP(,EPRMLSTP)                           02S0083 00117000
*       EAJSCBP=JSCBPTR->JSCBACT;   /* ACTIVE JSCB PTR               */ 00118000
         L     @14,JSCBACT(,@14)                                02S0084 00119000
         ST    @14,EAJSCBP(,EPRMLSTP)                           02S0084 00120000
*                                                               03S0085 00121000
*/********************************************************************/ 00122000
*/*                                                          @Z40FPPG*/ 00123000
*/* SEGMENT NAME - ESTAECOD                                  @Z40FPPG*/ 00124000
*/*                                                          @Z40FPPG*/ 00125000
*/* DESCRIPTIVE NAME - ESTAE CODE                            @Z40FPPG*/ 00126000
*/*                                                          @Z40FPPG*/ 00127000
*/* FUNCTION - SET UP THE APPROPRIATE ESTAE ENVIRONMENT      @Z40FPPG*/ 00128000
*/*                                                          @Z40FPPG*/ 00129000
*/* OPERATION -                                              @Z40FPPG*/ 00130000
*/*          . AN ALLOCATION STAE WORK AREA (ASWA) IS FILLED @Z40FPPG*/ 00131000
*/*            IN. THIS ALLOWS THE ALLOCATION COMMON ESTAE   @Z40FPPG*/ 00132000
*/*            EXIT (IEFAB4ED) TO ROUTE CONTROL TO THE OTHER @Z40FPPG*/ 00133000
*/*            APPROPRIATE EXIT ROUTINES FOR SPECIFIC        @Z40FPPG*/ 00134000
*/*            RECOVERY PROCESSING.                          @Z40FPPG*/ 00135000
*/*          . IF NO ALLOCATION ESTAE IS IN EFFECT, OR IF ONE@Z40FPPG*/ 00136000
*/*            IS BUT IT IS NOT THE CURRENT ESTAE A NEW ESTAE@Z40FPPG*/ 00137000
*/*            MUST BE ISSUED, THE ASWA BUILT BECOMES THE    @Z40FPPG*/ 00138000
*/*            FIRST ONE IN A NEW CHAIN, IS THE EXIT PARM    @Z40FPPG*/ 00139000
*/*            RECEIVED BY THE COMMON ESTAE EXIT, AND MUST   @Z40FPPG*/ 00140000
*/*            PROVIDE THE AUTOMATIC CORE FOR THE DATA THAT  @Z40FPPG*/ 00141000
*/*            ROUTINE USES. THE PTR TO THE LAST ASWA OF AN  @Z40FPPG*/ 00142000
*/*            EARLIER ALLOCATION ESTAE, IF ANY, IS SAVED IN @Z40FPPG*/ 00143000
*/*            THIS ASWA. NOTE THAT THE STAE CONTROL BLOCK   @Z40FPPG*/ 00144000
*/*            ADDRESS IN THE ASWA IS NOT UPDATED UNTIL AFTER@Z40FPPG*/ 00145000
*/*            THE ESTAE IS ISSUED SO THAT IT REFLECTS THE   @Z40FPPG*/ 00146000
*/*            CURRENT ONE.                                  @Z40FPPG*/ 00147000
*/*          . IF THE CURRENT ESTAE IN EFFECT IS ALLOCATION'S@Z40FPPG*/ 00148000
*/*            IT CAN BE USED TO PROVIDE THIS ROUTINES NECES-@Z40FPPG*/ 00149000
*/*            SARY RECOVERY ENVIRONMENT. THE SCB ADDRESS    @Z40FPPG*/ 00150000
*/*            BE COPIED FROM THE MOST RECENT ASWA, TO WHICH @Z40FPPG*/ 00151000
*/*            THE CHAIN PTR OF THIS NEW ASWA WILL POINT BACK@Z40FPPG*/ 00152000
*/*          . THE ADDRESS OF THE NEW ASWA IS PLACED IN      @Z40FPPG*/ 00153000
*/*            THE JSCB AS THE LAST ONE IN THE CHAIN FOR THE @Z40FPPG*/ 00154000
*/*            CURRENT ALLOCATION ESTAE                      @Z40FPPG*/ 00155000
*/*          . (NOTE THAT AS OF REL4, THERE SHOULD ALWAYS    @Z40FPPG*/ 00156000
*/*             BE A USEABLE EXISTING ALLOCATION ESTAE IN    @Z40FPPG*/ 00157000
*/*             EFFECT WHEN THIS MODULE GETS CONTROL.)       @Z40FPPG*/ 00158000
*/*                                                          @Z40FPPG*/ 00159000
*/* ENTRY - INLINE SUBROUTINE ENTERED AT THE TOP             @Z40FPPG*/ 00160000
*/*                                                          @Z40FPPG*/ 00161000
*/*   PURPOSE - SEE FUNCTION                                 @Z40FPPG*/ 00162000
*/*                                                          @Z40FPPG*/ 00163000
*/*   INPUT -                                                @Z40FPPG*/ 00164000
*/*        .JSCBASWA - PTR LAST LAST ASWA ON CHAIN, IF ANY   @Z40FPPG*/ 00165000
*/*        .TCBSTABB - PTR TO CURRENT STAE CONTROL BLOCK     @Z40FPPG*/ 00166000
*/*                                                          @Z40FPPG*/ 00167000
*/* EXIT - INLINE SUBROUTINE THAT EXISTS AT THE BOTTOM       @Z40FPPG*/ 00168000
*/*                                                          @Z40FPPG*/ 00169000
*/*   CONDITION - ESTAE SETUP COMPLETED                      @Z40FPPG*/ 00170000
*/*                                                          @Z40FPPG*/ 00171000
*/*   OUTPUT -                                               @Z40FPPG*/ 00172000
*/*           .ASWA - FILLED IN AND PLACED ON THE CHAIN      @Z40FPPG*/ 00173000
*/*           .JSCBASWA - POINTS TO ASWA AS LAST ON CHAIN    @Z40FPPG*/ 00174000
*/*           .EPRMLSTP - PTR TO HSKPING ESTAE PARMS         @Z40FPPG*/ 00175000
*/*           .ISSUESTA - ON IF ESTAE ISSUED                 @Z40FPPG*/ 00176000
*/*                                                          @Z40FPPG*/ 00177000
*/*   RETURN CODES - REG15 HAS ESTAE RETURN CODE             @Z40FPPG*/ 00178000
*/*                  IF ONE WAS ISSUED. (ZERO OTHERWISE)     @Z40FPPG*/ 00179000
*/*                                                          @Z40FPPG*/ 00180000
*/********************************************************************/ 00181000
*                                                               03S0085 00182000
*       REG15=ZERO;                 /* INIT RETURN CODE      @Z40FPPG*/ 00183000
         SLR   REG15,REG15                                      03S0085 00184000
*       ASWAPTR=ADDR(ASWACORE);     /* ADDRESS ASWA CORE     @Z40FPPG*/ 00185000
         LA    ASWAPTR,ASWACORE                                 03S0086 00186000
*       ASWA=ASWA&&ASWA;            /* ZERO OUT ASWA         @Z40FPPG*/ 00187000
         XC    ASWA(40,ASWAPTR),ASWA(ASWAPTR)                   03S0087 00188000
*       ASWAID=CHARASWA;            /* FILL IN BLOCK ID      @Z40FPPG*/ 00189000
         MVC   ASWAID(4,ASWAPTR),@CC00114                       03S0088 00190000
*       ASWACSCT=EXITCSCT;          /* CSECT NAME OF EXIT    @Z40FPPG*/ 00191000
         MVC   ASWACSCT(8,ASWAPTR),@CC00116                     03S0089 00192000
*       ASWARTNP=ADDR(IEFAB4EA);    /* ADDRESS OF EXIT RTN   @Z40FPPG*/ 00193000
         L     @08,@CV00138                                     03S0090 00194000
         STCM  @08,15,ASWARTNP(ASWAPTR)                         03S0090 00195000
*       ASWAPRMS=EPRMLSTP;          /* PARMS FOR THIS EXIT   @Z40FPPG*/ 00196000
         STCM  EPRMLSTP,15,ASWAPRMS(ASWAPTR)                    03S0091 00197000
*       JSCBWRKP=JSCBACT;           /* GET ACTIVE JSCB       @Z40FPPG*/ 00198000
         ST    @14,JSCBWRKP                                     03S0092 00199000
*       RFY                                                     03S0093 00200000
*         IEZJSCB BASED(JSCBWRKP);  /*                       @Z40FPPG*/ 00201000
*       ISSUESTA=OFF;               /* INIT. ESTAE SW        @Z40FPPG*/ 00202000
         NI    ISSUESTA,B'01111111'                             03S0094 00203000
*       IF JSCBASWA=ZERO|           /* NO ALLOC ESTAE IN EFFECT OR      00204000
*                                                            @Z40FPPG*/ 00205000
*           JSCBASWA->ASWASCBP^=TCBSTABB THEN/* ITS NOT THE CURRENT     00206000
*                                      ONE                   @Z40FPPG*/ 00207000
         L     @14,JSCBASWA(,@14)                               03S0095 00208000
         LTR   @14,@14                                          03S0095 00209000
         BZ    @RT00095                                         03S0095 00210000
         L     @08,LOC16PTR                                     03S0095 00211000
         L     @08,TCBLISTP(,@08)                               03S0095 00212000
         L     @08,TCBPTR(,@08)                                 03S0095 00213000
         ICM   @07,15,ASWASCBP(@14)                             03S0095 00214000
         L     @14,TCBSTABB-1(,@08)                             03S0095 00215000
         LA    @14,0(,@14)                                      03S0095 00216000
         CR    @07,@14                                          03S0095 00217000
         BE    @RF00095                                         03S0095 00218000
@RT00095 DS    0H                                               03S0096 00219000
*         DO;                       /* PROCESS NEW ESTAE     @Z40FPPG*/ 00220000
*           ISSUESTA=ON;            /* SAY ESTAE ISSUED      @Z40FPPG*/ 00221000
         OI    ISSUESTA,B'10000000'                             03S0097 00222000
*           ASWAAUTO=ADDR(AB4EDCOR);/* 1ST ASWA GIVES W/A    @Z40FPPG*/ 00223000
         LA    @14,AB4EDCOR                                     03S0098 00224000
         STCM  @14,15,ASWAAUTO(ASWAPTR)                         03S0098 00225000
*           ASWAOLDP=JSCBASWA;      /* OLD LAST IF ANY       @Z40FPPG*/ 00226000
         L     @14,JSCBWRKP                                     03S0099 00227000
         MVC   ASWAOLDP(4,ASWAPTR),JSCBASWA(@14)                03S0099 00228000
*           RFY                                                 03S0100 00229000
*            (REG2,                                             03S0100 00230000
*             REG3) RSTD;           /* RESTRICT WORK REGS    @Z40FPPG*/ 00231000
*           REG2=ADDR(IEFAB4ED);    /* COMMON ESTAE EXIT     @Z40FPPG*/ 00232000
         L     REG2,@CV00139                                    03S0101 00233000
*           REG3=ASWAPTR;           /* ASWA IS EXIT PARMS    @Z40FPPG*/ 00234000
         LR    REG3,ASWAPTR                                     03S0102 00235000
*           ESTAECOR(1:ESTAELEN)=ESTAELST(1:ESTAELEN);/* MOVE TO AUTO   00236000
*                                      CORE                  @Z40FPPG*/ 00237000
         L     @14,ESTAELEN                                     03S0103 00238000
         BCTR  @14,0                                            03S0103 00239000
         EX    @14,@SM01862                                     03S0103 00240000
*           GEN REFS(ESTAECOR) SETS(REG15,TCBSTABB);            03S0104 00241000
      ESTAE (2),PARAM=(3),RECORD=YES,TERM=YES,MF=(E,ESTAECOR)           00242000
*           RFY                                                 03S0105 00243000
*            (REG2,                                             03S0105 00244000
*             REG3) UNRSTD;                                     03S0105 00245000
*           IF REG15=ZERO THEN      /* IF ESTAE SUCCESSFUL   @Z40FPPG*/ 00246000
         LTR   REG15,REG15                                      03S0106 00247000
         BNZ   @RF00106                                         03S0106 00248000
*             ASWASCBP=TCBSTABB;    /* CURRENT SCB @         @Z40FPPG*/ 00249000
         L     @14,LOC16PTR                                     03S0107 00250000
         L     @14,TCBLISTP(,@14)                               03S0107 00251000
         L     @14,TCBPTR(,@14)                                 03S0107 00252000
         L     @14,TCBSTABB-1(,@14)                             03S0107 00253000
         LA    @14,0(,@14)                                      03S0107 00254000
         STCM  @14,15,ASWASCBP(ASWAPTR)                         03S0107 00255000
*         END;                      /* END IF ESTAE ISSUED   @Z40FPPG*/ 00256000
*       ELSE                        /* CURRENT IS ALLOC'S    @Z40FPPG*/ 00257000
*         DO;                       /* USE EXISTING ESTAE    @Z40FPPG*/ 00258000
         B     @RC00095                                         03S0109 00259000
@RF00095 DS    0H                                               03S0110 00260000
*           ASWASCBP=JSCBASWA->ASWASCBP;/* SCB @ FROM LAST      03S0110 00261000
*                                      ASWA@Z40FPPG                  */ 00262000
         L     @14,JSCBWRKP                                     03S0110 00263000
         L     @14,JSCBASWA(,@14)                               03S0110 00264000
         MVC   ASWASCBP(4,ASWAPTR),ASWASCBP(@14)                03S0110 00265000
*           ASWACHNP=JSCBASWA;      /* POINT BACK TO LAST    @Z40FPPG*/ 00266000
         STCM  @14,15,ASWACHNP(ASWAPTR)                         03S0111 00267000
*         END;                      /* CURRENT ESTAE USED    @Z40FPPG*/ 00268000
*       IF REG15=ZERO THEN          /* IF NO ERROR           @Z40FPPG*/ 00269000
@RC00095 SLR   @14,@14                                          03S0113 00270000
         CR    REG15,@14                                        03S0113 00271000
         BNE   @RF00113                                         03S0113 00272000
*         DO;                       /* PUT ASWA ONTO CHAIN   @Z40FPPG*/ 00273000
*           DO;                     /* MODESET KEYADDR(ZERO)         */ 00274000
*             SPKA(ZERO);           /* SET PSW KEY                   */ 00275000
         SPKA  0(@14)                                           03S0116 00276000
*           END;                    /* MODESET KEYADDR(ZERO) KEY TO     00277000
*                                      UPDATE JSCB           @Z40FPPG*/ 00278000
*           JSCBASWA=ASWAPTR;       /* NEW LAST ASWA PTR     @Z40FPPG*/ 00279000
         L     @14,JSCBWRKP                                     03S0118 00280000
         ST    ASWAPTR,JSCBASWA(,@14)                           03S0118 00281000
*           DO;                     /* MODESET EXTKEY(SCHED)         */ 00282000
*             SPKA(16);             /* SET PSW KEY                   */ 00283000
         LA    @14,16                                           03S0120 00284000
         SPKA  0(@14)                                           03S0120 00285000
*           END;                    /* MODESET EXTKEY(SCHED) BACK TO    00286000
*                                      SCHED KEY             @Z40FPPG*/ 00287000
*         END;                      /* END IF NO ERROR       @Z40FPPG*/ 00288000
*       RFY                                                     03S0123 00289000
*         IEZJSCB BASED(JSCBPTR);   /*                       @Z40FPPG*/ 00290000
@RF00113 DS    0H                                               03S0124 00291000
*       IF REG15^=0 THEN            /* ESTAE ENVIRONMENT NOT SET     */ 00292000
         LTR   REG15,REG15                                      02S0124 00293000
         BZ    @RF00124                                         02S0124 00294000
*         DO;                       /* - FAILING SITUATION           */ 00295000
*           RFY                                                 02S0126 00296000
*            (REG0,                                             02S0126 00297000
*             REG1) RSTD;                                       02S0126 00298000
*           SBPOOL=SUBPOOOL;        /* SET SUBPOOL NUMBER            */ 00299000
         MVI   SBPOOL,X'E6'                                     02S0127 00300000
*           LENTH=LENGTH(EPARMLST); /* LENGTH OF ESTAE PARMLIST      */ 00301000
         MVC   LENTH(3),@CF01849+1                              02S0128 00302000
*           REG0=SPLEN;             /* SUBPOOL+LENGTH TO REG 0       */ 00303000
         L     REG0,SPLEN                                       02S0129 00304000
*           REG1=EPRMLSTP;          /* PTR TO PARMLIST               */ 00305000
         LR    REG1,EPRMLSTP                                    02S0130 00306000
*           GEN(FREEMAIN R,LV=(0),A=(1));                       02S0131 00307000
         FREEMAIN R,LV=(0),A=(1)                                        00308000
*           RFY                                                 02S0132 00309000
*            (REG0,                                             02S0132 00310000
*             REG1) UNRSTD;                                     02S0132 00311000
*           RTNCODE=STEPERR;        /* 8 - ESTABLISH ESTAE           */ 00312000
         MVC   RTNCODE(4),@CF00074                              02S0133 00313000
*           REASONCD=ESTAEERR;      /* 16 - ENVIRONMENT FAILED       */ 00314000
         L     @14,@PC00001+36                                  02S0134 00315000
         MVC   REASONCD(2,@14),@CH00055                         02S0134 00316000
*         END;                                                  02S0135 00317000
*       RFY                                                     02S0136 00318000
*        (REG15) UNRSTD;            /*                       @Z40FPPG*/ 00319000
@RF00124 DS    0H                                               02S0137 00320000
*       IF RTNCODE=SUCCESS THEN     /* SUCCESSFUL ESTAE              */ 00321000
         L     @08,RTNCODE                                      01S0137 00322000
         LTR   @08,@08                                          01S0137 00323000
         BNZ   @RF00137                                         01S0137 00324000
*         DO;                                                   01S0138 00325000
*                                                               02S0139 00326000
*/********************************************************************/ 00327000
*/*                                                                  */ 00328000
*/* SEGMENT NAME - HSKPINIT                                          */ 00329000
*/*                                                                  */ 00330000
*/* DESCRIPTIVE NAME - HSKP INITIALIZATION ROUTINE                   */ 00331000
*/*                                                                  */ 00332000
*/* FUNCTION - OBTAIN AND INITIALIZE THE HOUSEKEEPING WORKAREA       */ 00333000
*/*                                                                  */ 00334000
*/*     OPERATION - INITIALLY A GETMAIN IS ISSUED TO OBTAIN SPACE TO */ 00335000
*/*            CONSTRUCT THE HOUSEKEEPING WORKAREA(HSKPWA). THE      */ 00336000
*/*            WORKAREA IS THEN INITALIZED WITH INFORMATION PASSED   */ 00337000
*/*            TO JFCB HOUSEKEEPING. FIELDS ARE INITIALIZED EITHER   */ 00338000
*/*            TO ZERO OR WITH THE INFORMATION LISTED AS INPUT DATA  */ 00339000
*/*            BELOW. THE INPUT FUNCTION MAP BECOMES GLOBAL CONTROLS */ 00340000
*/*            WITHIN THE CONTROL AREA OF HSKPWA. A PARAMETER LIST   */ 00341000
*/*            FOR SUBSEQUENT HOUSEKEEPING PROCESSING IS CONSTRUCTED */ 00342000
*/*            AS FOLLOWS:                                           */ 00343000
*/*                      WORD1 - PTR TO CONTROL INFO.                */ 00344000
*/*                      WORD2 - PTR TO DATA AREA.                   */ 00345000
*/*                      WORD3 - PTR TO INTERNAL RETURN INFO AREA.   */ 00346000
*/*                      WORD4 - PTR TO ADDRESS OF FIRST SIOT TO BE  */ 00347000
*/*                                PROCESSED.                        */ 00348000
*/*            ERROR SITUATIONS(E.G. GETMAIN) ARE REPRESENTED BY A   */ 00349000
*/*            STEP RELATED REASON CODE PLACED IN A HALF-WORD RETURN */ 00350000
*/*            AREA PASSED BY THE CALLER OF HOUSEKEEPING.            */ 00351000
*/*                                                                  */ 00352000
*/*                                                                  */ 00353000
*/*                                                                  */ 00354000
*/* ENTRY - N/A (INLINE SEGMENT)                                     */ 00355000
*/*   PURPOSE - INCLUDED ONCE PER JOB STEP/SESSION WITHIN HSKP       */ 00356000
*/*             CONTROL                                              */ 00357000
*/*                                                                  */ 00358000
*/*   INPUT DATA - A PARAMETER LIST CONTAINING THE FOLLOWING:        */ 00359000
*/*                                                                  */ 00360000
*/*                 WORD1 -  CALLER'S FUNCTION MAP                   */ 00361000
*/*                 WORD2 -  PTR OF FIRST SIOT TO BE PROCESSED       */ 00362000
*/*                 WORD3 -  THE JOB STEP NUMBER OR ZERO             */ 00363000
*/*                 WORD4 -  PTR OF JCT                              */ 00364000
*/*                 WORD5 -  PTR OF SCT                              */ 00365000
*/*                 WORD6 -  PTR TO LAST EPA IN CHAIN                */ 00366000
*/*                 WORD7 -  PTR TO SPECIAL EPA CHAIN                */ 00367000
*/*                 WORD8 -  PTR OF JSCB                             */ 00368000
*/*                 WORD9 -  PTR OF IOS LOOKUP TABLE                 */ 00369000
*/*                 WORD10- 2 BYTE FIELD FOR RETURNING STEP RELATED  */ 00370000
*/*                            REASON CODE TO CALLER                 */ 00371000
*/*                                                                  */ 00372000
*/* EXITS - N/A                                                      */ 00373000
*/*   CONDITION -IF GETMAIN FAILURE, APPROPRIATE REASON CODE PLACED  */ 00374000
*/*             IN CALLER'S RETURN INFORMATION AREA.                 */ 00375000
*/*   OUTPUT DATA - INITIALIZED WORK AREA (HSKPWA)                   */ 00376000
*/*                                                                  */ 00377000
*/*   RETURN CODE - R15 - 0 SUCCESSFUL                               */ 00378000
*/*                       8 STEP RELATED ERROR                       */ 00379000
*/********************************************************************/ 00380000
*                                                               02S0139 00381000
*           GETLNTH=LENGTH(HWCNTRL)+/* CALCULATE WORKAREA LENGTH     */ 00382000
*               LENGTH(HWDATA)+LENGTH(HWRETURN)+LENGTH(HWUCLST);        00383000
*                                                               02S0139 00384000
         LA    @08,1085                                         02S0139 00385000
         ST    @08,GETLNTH                                      02S0139 00386000
*           /*********************************************************/ 00387000
*           /*                                                       */ 00388000
*           /* ?GETSTORG (SUBPOOOL,GETLNTH,ADDRESS);                 */ 00389000
*           /*                                                       */ 00390000
*           /*********************************************************/ 00391000
*                                                               02S0140 00392000
*                                                               02S0140 00393000
*           /*********************************************************/ 00394000
*           /*                                                       */ 00395000
*           /* DEFINITIONS OF GETMAIN PARMS                          */ 00396000
*           /*                                                       */ 00397000
*           /*********************************************************/ 00398000
*                                                               02S0140 00399000
*           DCL                                                 02S0140 00400000
*             GTSTR0 FIXED(31) REG(0),/* GTMN PARM REG               */ 00401000
*             GTSTR1 FIXED(31) REG(1),/* GTMN PARM REG               */ 00402000
*             GTSTR2 PTR(31) REG(2),/* GTMN PARM REG                 */ 00403000
*             GTSTR15 FIXED(31) REG(15),/* GTMN RET COD              */ 00404000
*             GTSTRTCD FIXED(31);   /* GETMAIN RTN CODE              */ 00405000
*           DCL                                                 02S0141 00406000
*             GTSTR3 FIXED(31) REG(3),/* CLEARING REG                */ 00407000
*             GTSTR4 FIXED(31) REG(4),/* CLEARING REG                */ 00408000
*             GTSTR5 FIXED(31) REG(5),/* CLEARING REG                */ 00409000
*             GTSTR6 FIXED(31) REG(6),/* CLEARING REG                */ 00410000
*             GTSTR7 FIXED(31) REG(7),/* CLEARING REG                */ 00411000
*             GTSTR8 FIXED(31) REG(8),/* CLEARING REG                */ 00412000
*             GTSTZERO FIXED(31) INIT(0),                       02S0141 00413000
*             GTST253 FIXED(31) CONSTANT(253);                  02S0141 00414000
*           RFY                                                 02S0142 00415000
*            (GTSTR0,                                           02S0142 00416000
*             GTSTR1,                                           02S0142 00417000
*             GTSTR2) RSTD;         /* SAVE RGS                      */ 00418000
*           GTSTR0=GETLNTH;         /* SET AMOUNT                    */ 00419000
         LR    GTSTR0,@08                                       02S0143 00420000
*           GTSTR2=SUBPOOOL;        /* SET SUBPOOL                   */ 00421000
         LA    GTSTR2,230                                       02S0144 00422000
*           GENERATE CODE;                                      02S0145 00423000
       GETMAIN RC,LV=(0),SP=(2)  DO GETMAIN                             00424000
*           GTSTRTCD=GTSTR15;       /* SAVE GETMAIN RET COD          */ 00425000
         ST    GTSTR15,GTSTRTCD                                 02S0146 00426000
*           ADDRESS=GTSTR1;         /* ADDR OF GOTN STORG            */ 00427000
         ST    GTSTR1,ADDRESS                                   02S0147 00428000
*           RFY                                                 02S0148 00429000
*            (GTSTR0,                                           02S0148 00430000
*             GTSTR1,                                           02S0148 00431000
*             GTSTR2) UNRSTD;       /* RLSE                          */ 00432000
*           IF GTSTRTCD=0 THEN      /* GETMAIN SUCCESSFUL?           */ 00433000
         L     @08,GTSTRTCD                                     02S0149 00434000
         LTR   @08,@08                                          02S0149 00435000
         BNZ   @RF00149                                         02S0149 00436000
*             DO;                   /* YES, CLEAR STORAGE.           */ 00437000
*               RFY                                             02S0151 00438000
*                (GTSTR2,                                       02S0151 00439000
*                 GTSTR4,                                       02S0151 00440000
*                 GTSTR5,                                       02S0151 00441000
*                 GTSTR6,                                       02S0151 00442000
*                 GTSTR7,                                       02S0151 00443000
*                 GTSTR8) RSTD;                                 02S0151 00444000
*               GTSTR4=ADDRESS;     /* STORG PTR                     */ 00445000
         L     @03,ADDRESS                                      02S0152 00446000
         LR    GTSTR4,@03                                       02S0152 00447000
*               GTSTR5=GETLNTH;     /* STORG AMNT                    */ 00448000
         L     GTSTR5,GETLNTH                                   02S0153 00449000
*               GTSTR7='00000000'X; /* PAD CHAR & LNTH               */ 00450000
         SLR   GTSTR7,GTSTR7                                    02S0154 00451000
*               IF SUBPOOOL=GTST253 THEN                        02S0155 00452000
         B     @RF00155                                         02S0155 00453000
*                 GEN(MODESET KEYADDR=GTSTZERO,SAVEKEY=(2),WORKREG=8);  00454000
         MODESET KEYADDR=GTSTZERO,SAVEKEY=(2),WORKREG=8                 00455000
*               GEN REFS(GTSTR4,GTSTR6);                        02S0157 00456000
@RF00155 DS    0H                                               02S0157 00457000
            MVCL  GTSTR4,GTSTR6 CLEAR GOTTEN STORG                      00458000
*               IF SUBPOOOL=GTST253 THEN                        02S0158 00459000
         B     @RF00158                                         02S0158 00460000
*                 GEN(MODESET KEYADDR=(2));                     02S0159 00461000
         MODESET KEYADDR=(2)                                            00462000
*               RFY                                             02S0160 00463000
*                (GTSTR2,                                       02S0160 00464000
*                 GTSTR4,                                       02S0160 00465000
*                 GTSTR5,                                       02S0160 00466000
*                 GTSTR6,                                       02S0160 00467000
*                 GTSTR7,                                       02S0160 00468000
*                 GTSTR8) UNRSTD;                               02S0160 00469000
@RF00158 DS    0H                                               02S0161 00470000
*             END;                  /* STORAGE CLEARING COMPLETED    */ 00471000
*           ELSE                                                02S0162 00472000
*             ADDRESS=0;            /* CLEAR RETURN ADDR.            */ 00473000
         B     @RC00149                                         02S0162 00474000
@RF00149 SLR   @08,@08                                          02S0162 00475000
         ST    @08,ADDRESS                                      02S0162 00476000
*           GTSTR15=GTSTRTCD;       /* GTMN RETURN CODE              */ 00477000
@RC00149 L     GTSTR15,GTSTRTCD                                 02S0163 00478000
*                                   /* RESTORE LIST PRINT STATUS     */ 00479000
*                                                               02S0164 00480000
*           /*********************************************************/ 00481000
*           /*                                                       */ 00482000
*           /* HAVE GETMAIN ISSUED                                   */ 00483000
*           /*                                                       */ 00484000
*           /*********************************************************/ 00485000
*                                                               02S0164 00486000
*           IF REG15=SUCCESS THEN   /* GETMAIN FOR WORKAREA GOOD     */ 00487000
         LTR   REG15,REG15                                      02S0164 00488000
         BNZ   @RF00164                                         02S0164 00489000
*             DO;                                               02S0165 00490000
*                                                               02S0165 00491000
*               /*****************************************************/ 00492000
*               /*                                                   */ 00493000
*               /* FOLLOWING CODE INITIALIZES CONTROL, DATA, AND     */ 00494000
*               /* RETURN INFO AREA POINTERS. THESE AREAS MAKE UP    */ 00495000
*               /* HSKP WORKAREA.                                    */ 00496000
*               /*                                                   */ 00497000
*               /*****************************************************/ 00498000
*                                                               02S0166 00499000
*               HWCNTRLP=ADDRESS;   /* POINTER TO CONTROL AREA       */ 00500000
         L     @08,ADDRESS                                      02S0166 00501000
         ST    @08,HWCNTRLP                                     02S0166 00502000
*               HWDATAP=HWCNTRLP+LENGTH(HWCNTRL);/* PTR TO DATA AREA */ 00503000
         LA    @15,16                                           02S0167 00504000
         ALR   @15,@08                                          02S0167 00505000
         ST    @15,HWDATAP                                      02S0167 00506000
*               HWUCLPTR=HWDATAP+LENGTH(HWDATA);/* PTR TO UNIT NAME     00507000
*                                      CONVERSION LIST               */ 00508000
         LA    @14,1054                                         02S0168 00509000
         ALR   @14,@15                                          02S0168 00510000
         ST    @14,HWUCLPTR(,@15)                               02S0168 00511000
*               HWRTNP=HWUCLPTR+LENGTH(HWUCLST);/* PTR TO RETURN AREA*/ 00512000
*                                                               02S0169 00513000
         AL    @14,@CF00492                                     02S0169 00514000
         ST    @14,HWRTNP                                       02S0169 00515000
*               /*****************************************************/ 00516000
*               /*                                                   */ 00517000
*               /* FOLLOWING CODE INITIALIZE FIELDS WITHIN THE       */ 00518000
*               /* CONTROL AND DATA AREA OF THE HSKP WORKAREA WITH   */ 00519000
*               /* DATA PASSED AS INPUT TO THE HSKP PROCESS OR       */ 00520000
*               /* OBTAINED AS RESULT OF ABOVE GETMAIN.              */ 00521000
*               /*                                                   */ 00522000
*               /*****************************************************/ 00523000
*                                                               02S0170 00524000
*               HWGETADD=ADDRESS;   /* SAVE ADDRESS OF GETMAIN       */ 00525000
         ST    @08,HWGETADD(,@15)                               02S0170 00526000
*               HWGETSPN=SUBPOOOL;  /* SUBPOOL FOR HSKPWA GETMAIN    */ 00527000
         MVC   HWGETSPN(4,@15),@CF00043                         02S0171 00528000
*               HWGETLN=GETLNTH;    /* LENGTH OF HSKPWA GETMAIN      */ 00529000
         L     @14,GETLNTH                                      02S0172 00530000
         ST    @14,HWGETLN(,@15)                                02S0172 00531000
*               HWCNTRL=IFUNCTN;    /* MOVE INPUT FUNCTION MAP TO       00532000
*                                      HSKPWA GLOBAL CONTROL AREA    */ 00533000
         XC    HWCNTRL+2(14,@08),HWCNTRL+2(@08)                 02S0173 00534000
         L     @14,@PC00001                                     02S0173 00535000
         MVC   HWCNTRL(2,@08),IFUNCTN(@14)                      02S0173 00536000
*               HWFSIOTP=FSIOTPTR;  /* POINTER TO FIRST SIOT         */ 00537000
         L     @08,@PC00001+4                                   02S0174 00538000
         L     @08,FSIOTPTR(,@08)                               02S0174 00539000
         ST    @08,HWFSIOTP(,@15)                               02S0174 00540000
*               HWSTEPNO=STEPNUMB;  /* NUMBER OF STEP BEING PROCESSED*/ 00541000
         L     @08,@PC00001+8                                   02S0175 00542000
         IC    @14,STEPNUMB(,@08)                               02S0175 00543000
         STC   @14,HWSTEPNO(,@15)                               02S0175 00544000
*               HWJCTP=JCTPTR;      /* CORE POINTER TO THE JCT       */ 00545000
         L     @08,@PC00001+12                                  02S0176 00546000
         L     @08,JCTPTR(,@08)                                 02S0176 00547000
         ST    @08,HWJCTP(,@15)                                 02S0176 00548000
*               HWSCTP=SCTPTR;      /* CORE POINTER TO THE SCT       */ 00549000
         L     @08,@PC00001+16                                  02S0177 00550000
         L     @08,SCTPTR(,@08)                                 02S0177 00551000
         ST    @08,HWSCTP(,@15)                                 02S0177 00552000
*               HWLEPAP=LEPAPTR;    /* PTR TO LAST EPA ON EPA CHAIN  */ 00553000
         L     @08,@PC00001+20                                  02S0178 00554000
         L     @08,LEPAPTR(,@08)                                02S0178 00555000
         ST    @08,HWLEPAP(,@15)                                02S0178 00556000
*               HWGEPACP=GEPACPTR;  /* PTR TO SPECIAL EPA CHAIN FOR     00557000
*                                      GENERATED TABLES              */ 00558000
         L     @08,@PC00001+24                                  02S0179 00559000
         L     @08,GEPACPTR(,@08)                               02S0179 00560000
         ST    @08,HWGEPACP(,@15)                               02S0179 00561000
*               HWJSCBP=JSCBPTR;    /* JSCB POINTER                  */ 00562000
         L     @08,@PC00001+28                                  02S0180 00563000
         L     @08,JSCBPTR(,@08)                                02S0180 00564000
         ST    @08,HWJSCBP(,@15)                                02S0180 00565000
*               HWIOSLTP=IOSLUTP;   /* IOS (UCB) LOOK-UP-TABLE PTR   */ 00566000
         L     @08,@PC00001+32                                  02S0181 00567000
         L     @08,IOSLUTP(,@08)                                02S0181 00568000
         ST    @08,HWIOSLTP(,@15)                               02S0181 00569000
*               HWCRIP=ADDR(HWCRI); /* CATALOG RETURN INFO PTR       */ 00570000
         LA    @08,HWCRI(,@15)                                  02S0182 00571000
         ST    @08,HWCRIP(,@15)                                 02S0182 00572000
*             END;                                              02S0183 00573000
*           ELSE                    /* GETMAIN FAILURE               */ 00574000
*             DO;                                               02S0184 00575000
         B     @RC00164                                         02S0184 00576000
@RF00164 DS    0H                                               02S0185 00577000
*               RTNCODE=FAILURE;    /* CALLER'S RETURN CODE INFO     */ 00578000
         MVC   RTNCODE(4),@CF00113                              02S0185 00579000
*               REASONCD=GETERROR;  /* 2 - CALLER'S REASON CODE      */ 00580000
         L     @08,@PC00001+36                                  02S0186 00581000
         MVC   REASONCD(2,@08),@CH00125                         02S0186 00582000
*             END;                                              02S0187 00583000
*           IF RTNCODE=SUCCESS THEN /* SUCCESSFUL HSKP INITIALIZATION*/ 00584000
@RC00164 L     @08,RTNCODE                                      01S0188 00585000
         LTR   @08,@08                                          01S0188 00586000
         BNZ   @RF00188                                         01S0188 00587000
*             DO;                                               01S0189 00588000
*               CALL IEFAB452(HWCNTRLP,/* DD PROCESSING CONTROL -    */ 00589000
*                   HWDATAP,HWRTNP,HWFSIOTP);/* PROCESS ALL REQUESTS    00590000
*                                      OF THIS STEP                  */ 00591000
         LA    @08,HWCNTRLP                                     01S0190 00592000
         ST    @08,@AL00001                                     01S0190 00593000
         LA    @08,HWDATAP                                      01S0190 00594000
         ST    @08,@AL00001+4                                   01S0190 00595000
         LA    @08,HWRTNP                                       01S0190 00596000
         ST    @08,@AL00001+8                                   01S0190 00597000
         L     @08,HWDATAP                                      01S0190 00598000
         LA    @08,HWFSIOTP(,@08)                               01S0190 00599000
         ST    @08,@AL00001+12                                  01S0190 00600000
         L     @15,@CV00137                                     01S0190 00601000
         LA    @01,@AL00001                                     01S0190 00602000
         BALR  @14,@15                                          01S0190 00603000
*               IF HWRTCD=DDERR THEN/* DD RELATED ERROR - 4          */ 00604000
         LA    @08,4                                            01S0191 00605000
         L     @15,HWRTNP                                       01S0191 00606000
         CH    @08,HWRTCD(,@15)                                 01S0191 00607000
         BNE   @RF00191                                         01S0191 00608000
*                 DO;               /* PUT REASON CODE IN SIOT OF    */ 00609000
*                   HWCSIOTP->SIOTRSNC=HWRSNCD;/* FAILING REQUEST    */ 00610000
         L     @01,HWDATAP                                      01S0193 00611000
         L     @01,HWCSIOTP(,@01)                               01S0193 00612000
         LH    @00,HWRSNCD(,@15)                                01S0193 00613000
         STH   @00,SIOTRSNC(,@01)                               01S0193 00614000
*                   RTNCODE=FAILURE;/* FAILING RETURN CODE - 4       */ 00615000
         ST    @08,RTNCODE                                      01S0194 00616000
*                 END;                                          01S0195 00617000
*               ELSE                /* NOT DD RELATED ERROR -4       */ 00618000
*                 IF HWRTCD=STEPERR THEN/* STEP RELATED ERROR - 8    */ 00619000
         B     @RC00191                                         01S0196 00620000
@RF00191 L     @08,HWRTNP                                       01S0196 00621000
         CLC   HWRTCD(2,@08),@CH00074                           01S0196 00622000
         BNE   @RF00196                                         01S0196 00623000
*                   DO;             /* PUT REASON CODE IN AREA       */ 00624000
*                     REASONCD=HWRSNCD;/* PROVIDED BY CALLER OF HSKP */ 00625000
         L     @15,@PC00001+36                                  01S0198 00626000
         LH    @08,HWRSNCD(,@08)                                01S0198 00627000
         STH   @08,REASONCD(,@15)                               01S0198 00628000
*                     RTNCODE=FAILURE;/* FAILING RETURN CODE - 4     */ 00629000
         MVC   RTNCODE(4),@CF00113                              01S0199 00630000
*                   END;                                        01S0200 00631000
*               IF HWLEPAP^=LEPAPTR THEN/* IF EPA(S) WERE CREATED    */ 00632000
@RF00196 DS    0H                                               01S0201 00633000
@RC00191 L     @08,HWDATAP                                      01S0201 00634000
         L     @08,HWLEPAP(,@08)                                01S0201 00635000
         L     @15,@PC00001+20                                  01S0201 00636000
         C     @08,LEPAPTR(,@15)                                01S0201 00637000
         BE    @RF00201                                         01S0201 00638000
*                 LEPAPTR=HWLEPAP;  /* UPDATE CALLER'S LAST EPA PTR  */ 00639000
         ST    @08,LEPAPTR(,@15)                                01S0202 00640000
*               IF HWGEPACP^=GEPACPTR THEN/* IF EPA(S) WERE CREATED  */ 00641000
@RF00201 L     @08,HWDATAP                                      01S0203 00642000
         L     @08,HWGEPACP(,@08)                               01S0203 00643000
         L     @15,@PC00001+24                                  01S0203 00644000
         C     @08,GEPACPTR(,@15)                               01S0203 00645000
         BE    @RF00203                                         01S0203 00646000
*                 GEPACPTR=HWGEPACP;/* UPDATE DYNALLOCS EPA PTR      */ 00647000
         ST    @08,GEPACPTR(,@15)                               01S0204 00648000
*                                                               02S0205 00649000
*/********************************************************************/ 00650000
*/*                                                                  */ 00651000
*/* SEGMENT NAME - HSKPCLUP                                          */ 00652000
*/*                                                                  */ 00653000
*/* DESCRIPTIVE NAME - HSKP CLEANUP ROUTINE                          */ 00654000
*/*                                                                  */ 00655000
*/* FUNCTION - HOUSEKEEPING CLEANUP IS PERFORMED ONCE PER JOB STEP/  */ 00656000
*/*            SESSION AT THE END OF THE HOUSEKEEPING PROCESS. IT    */ 00657000
*/*            INVOLVES UNALLOCATION OF USER CATALOGS AND ISSUANCE   */ 00658000
*/*            OF A FREEMAIN FOR THE HOUSEKEEPING WORKAREA(HSKPWA).  */ 00659000
*/*                                                                  */ 00660000
*/*     OPERATION -  INITIALLY, IT IS DETERMINED IF ANY  PRIVATE     */ 00661000
*/*            CATALOGS HAVE BEEN ALLOCATED TO THE STEP/SESSION. IF  */ 00662000
*/*            HOUSEKEEPING WAS USED AS A SUBROUTINE OF DYNAMIC      */ 00663000
*/*            ALLOCATION AND IF PRIVATE CATALOGS WERE ALLOCATED BY  */ 00664000
*/*            HOUSEKEEPING DURING THAT SESSION, THOSE CATALOGS WILL */ 00665000
*/*            NOT BE UNALLOCATED DURING THE HSKP CLEANUP PROCESS.   */ 00666000
*/*            IF HOUSEKEEPING WAS CALLED FROM STEP ALLOCATION AND   */ 00667000
*/*            IF CATALOGS ARE ALLOCATED DURING HOUSEKEEPING PROCESS */ 00668000
*/*            THEN THE  CATALOG UNALLOCATION  ROUTINE(IEFAB4F4) IS  */ 00669000
*/*            CALLED BY HSKP CLEANUP TO PERFORM THE UNALLOCATION    */ 00670000
*/*            AND TEMPORARY CLOSE OF ALL PRIVATE VSAM       @YM04224*/ 00671000
*/*            (USER) CATALOGS ALLOCATED TO THAT STEP. THIS  @YM04224*/ 00672000
*/*            'TEMPORARY' CLOSE ALLOWS 'OPEN'S' CONTROL     @YM04224*/ 00673000
*/*            BLOCKS TO REMAIN INTACT, THUS SPEEDING UP     @YM04224*/ 00674000
*/*            THE SUBSEQUENT OPEN DONE FOR THE PRIVATE      @YM04224*/ 00675000
*/*            CATALOGS ON BEHALF OF THE PROBLEM PROGRAM.    @YM04224*/ 00676000
*/*                                                                  */ 00677000
*/*            THEN AN FSPACE IS ISSUED TO FREE UP THE CORE  @Z40FPPD*/ 00678000
*/*            PREVIOUSLY OBTAINED FOR AN EPA (USED FOR READ         */ 00679000
*/*            OPERATIONS DURING HSKP) IF ONE EXISTS, AND A          */ 00680000
*/*            FREEMAIN IS ISSUED FOR THE HOUSEKEEPING WORKAREA.     */ 00681000
*/*            ERROR SITUATIONS ARE REPRESENTED BY RELATED           */ 00682000
*/*            REASON CODES PLACED IN A HALF-WORD RETURN AREA        */ 00683000
*/*            PASSED BY THE CALLER OF HOUSEKEEPING.                 */ 00684000
*/*                                                                  */ 00685000
*/*                                                                  */ 00686000
*/* ENTRY - N/A (INLINE SEGMENT)                                     */ 00687000
*/*   PURPOSE - INCLUDED ONCE PER JOB STEP/SESSION WITHIN HSKP       */ 00688000
*/*             CONTROL                                              */ 00689000
*/*                                                                  */ 00690000
*/*   INPUT DATA - IN ADDITION TO THE HSKPWA BEING AVAILABLE TO      */ 00691000
*/*            THIS SEGMENT, THE JSCB IS SPECIFICALLY USED TO        */ 00692000
*/*            DETERMINE IF ANY PRIVATE CATALOGS HAVE BEEN ALLOCATED */ 00693000
*/*            DURING THE HOUSEKEEPING PROCESS AND TO OBTAIN THE     */ 00694000
*/*            PTR TO THE PCCB CHAIN(IF PRESENT)FROM THE ACTIVE JSCB */ 00695000
*/*                                                                  */ 00696000
*/* EXITS -N/A                                                       */ 00697000
*/*   CONDITION - NO ERROR CONDITIONS ENCOUNTERED IN THIS SEGMENT    */ 00698000
*/*                                                                  */ 00699000
*/*   OUTPUT DATA - NONE                                             */ 00700000
*/*                                                                  */ 00701000
*/********************************************************************/ 00702000
*                                                               02S0205 00703000
*               IF JSCBACT->JSCBPCC^=0&HWUNLCCT=ON THEN/* IF COND MET   00704000
*                                      PROCESS                       */ 00705000
@RF00203 SLR   @08,@08                                          02S0205 00706000
         L     @15,@PC00001+28                                  02S0205 00707000
         L     @01,JSCBPTR(,@15)                                02S0205 00708000
         L     @01,JSCBACT(,@01)                                02S0205 00709000
         C     @08,JSCBPCC(,@01)                                02S0205 00710000
         BE    @RF00205                                         02S0205 00711000
         L     @15,HWCNTRLP                                     02S0205 00712000
         TM    HWUNLCCT(@15),B'00001000'                        02S0205 00713000
         BNO   @RF00205                                         02S0205 00714000
*                 DO;               /* INITIALIZE UNALLOCATE CTLG    */ 00715000
*                   UCCNTRLS=0;     /* CLEAR CONTROLS        @YM05752*/ 00716000
         STH   @08,UCCNTRLS                                     02S0207 00717000
*                   IF HWDENQT=ON THEN/* DO NOT ENQ ON TIOT IF       */ 00718000
         TM    HWDENQT(@15),B'01000000'                         02S0208 00719000
         BNO   @RF00208                                         02S0208 00720000
*                     UCNTIONQ=ON;  /* CALLER REQUESTS SAME.         */ 00721000
         OI    UCNTIONQ,B'01000000'                             02S0209 00722000
*                   UCALLCAT=ON;    /* CONTROLS TO UNALLOCATE AND    */ 00723000
@RF00208 DS    0H                                               02S0211 00724000
*                   UCALLACB=ON;    /* CLOSE ALL PRIVATE CATALOGS    */ 00725000
         OI    UCALLCAT,B'00010100'                             02S0211 00726000
*                   IF HWRTCD=0 THEN/* TEMPORARILY CLOSE     @YM04224*/ 00727000
         L     @08,HWRTNP                                       02S0212 00728000
         LH    @08,HWRTCD(,@08)                                 02S0212 00729000
         LTR   @08,@08                                          02S0212 00730000
         BNZ   @RF00212                                         02S0212 00731000
*                     UCTEMP=ON;    /* IF NO ERRORS          @YM04224*/ 00732000
         OI    UCTEMP,B'10000000'                               02S0213 00733000
*                   IF HWCAJSCB=ON THEN/* CHANGE ACTIVE JSCB IF      */ 00734000
@RF00212 L     @08,HWCNTRLP                                     02S0214 00735000
         TM    HWCAJSCB(@08),B'00100000'                        02S0214 00736000
         BNO   @RF00214                                         02S0214 00737000
*                     UCCAJSCB=ON;  /* ALLOWED BY CALLER             */ 00738000
         OI    UCCAJSCB,B'10000000'                             02S0215 00739000
*                   CALL IEFAB4F4   /* CALL IEFAB4F4                 */ 00740000
*                       (UCCNTRLS,ADDR(RETINFO),0,0,0,JSCBPTR); 02S0216 00741000
@RF00214 LA    @08,UCCNTRLS                                     02S0216 00742000
         ST    @08,@AL00001                                     02S0216 00743000
         LA    @08,RETINFO                                      02S0216 00744000
         ST    @08,@TF00001                                     02S0216 00745000
         LA    @08,@TF00001                                     02S0216 00746000
         ST    @08,@AL00001+4                                   02S0216 00747000
         LA    @08,@CF00122                                     02S0216 00748000
         ST    @08,@AL00001+8                                   02S0216 00749000
         LA    @08,@CF00122                                     02S0216 00750000
         ST    @08,@AL00001+12                                  02S0216 00751000
         LA    @08,@CF00122                                     02S0216 00752000
         ST    @08,@AL00001+16                                  02S0216 00753000
         L     @08,@PC00001+28                                  02S0216 00754000
         ST    @08,@AL00001+20                                  02S0216 00755000
         L     @15,@CV00140                                     02S0216 00756000
         LA    @01,@AL00001                                     02S0216 00757000
         BALR  @14,@15                                          02S0216 00758000
*                   IF RETCODE^=0&  /* RETURN CODE NOT = O           */ 00759000
*                       REASONCD=0 THEN/* REASON CODE = 0            */ 00760000
         SLR   @08,@08                                          02S0217 00761000
         CH    @08,RETCODE                                      02S0217 00762000
         BE    @RF00217                                         02S0217 00763000
         L     @15,@PC00001+36                                  02S0217 00764000
         CH    @08,REASONCD(,@15)                               02S0217 00765000
         BNE   @RF00217                                         02S0217 00766000
*                     DO;                                       02S0218 00767000
*                       REASONCD=REASCODE;/* SAVE FAILING REASON CODE*/ 00768000
         LH    @08,REASCODE                                     02S0219 00769000
         STH   @08,REASONCD(,@15)                               02S0219 00770000
*                       RTNCODE=FAILURE;/* SET FAILING RETURN CODE   */ 00771000
         MVC   RTNCODE(4),@CF00113                              02S0220 00772000
*                     END;                                      02S0221 00773000
*                 END;                                          02S0222 00774000
@RF00217 DS    0H                                               02S0223 00775000
*               IF HWSELDON=ON THEN /* IF MSS SELECTS DONE THEN 02S0223 00776000
*                                                            @G24LPSJ*/ 00777000
@RF00205 L     @08,HWCNTRLP                                     02S0223 00778000
         TM    HWSELDON(@08),B'00000010'                        02S0223 00779000
         BNO   @RF00223                                         02S0223 00780000
*                 IF RTNCODE=SUCCESS THEN/* IF HSKP SUCCESSFUL, THEN    00781000
*                                                            @G24LPSJ*/ 00782000
         L     @08,RTNCODE                                      02S0224 00783000
         LTR   @08,@08                                          02S0224 00784000
         BNZ   @RF00224                                         02S0224 00785000
*                   JHMSSTRM=ON;    /* INDICATE MSS TERMINATION 02S0225 00786000
*                                      REQUIRED              @G24LPSJ*/ 00787000
         L     @08,@PC00001+40                                  02S0225 00788000
         OI    JHMSSTRM(@08),B'10000000'                        02S0225 00789000
*                 ELSE                                          02S0226 00790000
*                   DO;             /*                       @G24LPSJ*/ 00791000
         B     @RC00224                                         02S0226 00792000
@RF00224 DS    0H                                               02S0227 00793000
*                                                               03S0227 00794000
*/***********************************************************@G24LPSJ*/ 00795000
*/*                                                          @G24LPSJ*/ 00796000
*/* SEGMENT NAME - TERMCALL                                  @G24LPSJ*/ 00797000
*/*                                                          @G24LPSJ*/ 00798000
*/* DESCRIPTIVE NAME - MSSC TERMINATE PROCESSING             @G24LPSJ*/ 00799000
*/*                                                          @G24LPSJ*/ 00800000
*/* FUNCTION -                                               @G24LPSJ*/ 00801000
*/*                                                          @G24LPSJ*/ 00802000
*/*   THIS SEGMENT WILL ISSUE THE MSS TERMINATE REQUEST IF   @G24LPSJ*/ 00803000
*/*   THERE HAS BEEN A HOUSEKEEPING FAILURE.                 @G24LPSJ*/ 00804000
*/*                                                          @G24LPSJ*/ 00805000
*/* OPERATION -                                              @G24LPSJ*/ 00806000
*/*                                                          @G24LPSJ*/ 00807000
*/*   THE MSS TERMINATE PROCESSING IS DONE. THE TERMINATE    @G24LPSJ*/ 00808000
*/*   REQUEST BLOCK IS CLEARED AND INITIALIZED. REG 1 IS     @G24LPSJ*/ 00809000
*/*   POINTED TO THE REQUEST BLOCK AND SVC 126 ISSUED.       @G24LPSJ*/ 00810000
*/*                                                          @G24LPSJ*/ 00811000
*/* ENTRY - IN-LINE SEGMENT                                  @G24LPSJ*/ 00812000
*/*                                                          @G24LPSJ*/ 00813000
*/*   PURPOSE - SEE FUNCTION                                 @G24LPSJ*/ 00814000
*/*   INPUT - ASCB                                           @G24LPSJ*/ 00815000
*/*                                                          @G24LPSJ*/ 00816000
*/*                                                          @G24LPSJ*/ 00817000
*/* EXIT -                                                   @G24LPSJ*/ 00818000
*/*                                                          @G24LPSJ*/ 00819000
*/*   CONDITION - MSSC TERMINATE ISSUED                      @G24LPSJ*/ 00820000
*/*     OUTPUT -                                             @G24LPSJ*/ 00821000
*/*       NONE                                               @G24LPSJ*/ 00822000
*/*     RETURN CODES -                                       @G24LPSJ*/ 00823000
*/*       NONE                                               @G24LPSJ*/ 00824000
*/*                                                          @G24LPSJ*/ 00825000
*/***********************************************************@G24LPSJ*/ 00826000
*                                                               03S0227 00827000
*                     RFY                                       03S0227 00828000
*                       TRMRB BASED(ADDR(TERMAREA));/* SET ADDR FOR     00829000
*                                      TERMINATE REQUEST BLOCK  03S0227 00830000
*                                                            @G24LPSJ*/ 00831000
*                     TRMRB=TRMRB&&TRMRB;/* CLEAR BLOCK      @G24LPSJ*/ 00832000
         LA    @08,TERMAREA                                     03S0228 00833000
         XC    TRMRB(16,@08),TRMRB(@08)                         03S0228 00834000
*                     TRMRBLEN=LENGTH(TRMRB);/* SET TERM LENGTH 03S0229 00835000
*                                                            @G24LPSJ*/ 00836000
         MVC   TRMRBLEN(4,@08),@CF00055                         03S0229 00837000
*                     TRMRBOPC=TRMOPCD;/* SET TERM OP CODE   @G24LPSJ*/ 00838000
         MVI   TRMRBOPC(@08),X'8A'                              03S0230 00839000
*                     ASCBPTR=PSAAOLD;/* SET ASCB ADDRESS    @G24LPSJ*/ 00840000
         L     ASCBPTR,PSAAOLD                                  03S0231 00841000
*                     TRMJOBID=ASCBASID;/* SET ASID OF STEP  @G24LPSJ*/ 00842000
         LH    @03,ASCBASID(,ASCBPTR)                           03S0232 00843000
         N     @03,@CF01865                                     03S0232 00844000
         ST    @03,TRMJOBID(,@08)                               03S0232 00845000
*                     REG1=ADDR(TRMRB);/* LOAD ADDR TRMTRB   @G24LPSJ*/ 00846000
         LR    REG1,@08                                         03S0233 00847000
*                     RFY                                       03S0234 00848000
*                       REG1 RSTD;  /* RESTRICT REG 1        @G24LPSJ*/ 00849000
*                     SVC(126);     /* CALL MSSC             @G24LPSJ*/ 00850000
         SVC   126                                              03S0235 00851000
*                     RFY                                       03S0236 00852000
*                       REG1 UNRSTD;/* RELEASE REG 1         @G24LPSJ*/ 00853000
*                   END;            /*                       @G24LPSJ*/ 00854000
*/*** COMMUNICATE TO DYN.ALLOCATION THAT JCT WAS/WAS NOT ADDED TO  ***/ 00855000
*/*** EPA CHAIN DURING GDG PROCESSING                              ***/ 00856000
*                                                               02S0238 00857000
*               IF HWEPAJCT=OFF&    /* JCT ADDED TO EPA CHAIN        */ 00858000
*                   IAEPAJCT=ON THEN/* AND DYN.ALLOCATION CALLING    */ 00859000
@RC00224 DS    0H                                               02S0238 00860000
@RF00223 L     @08,HWCNTRLP                                     02S0238 00861000
         TM    HWEPAJCT(@08),B'00010000'                        02S0238 00862000
         BNZ   @RF00238                                         02S0238 00863000
         L     @08,@PC00001                                     02S0238 00864000
         TM    IAEPAJCT(@08),B'00010000'                        02S0238 00865000
         BNO   @RF00238                                         02S0238 00866000
*                 IAEPAJCT=OFF;                                 02S0239 00867000
*                                                               02S0239 00868000
         NI    IAEPAJCT(@08),B'11101111'                        02S0239 00869000
*/*** THE FOLLOWING SETS UP AND FREES AN EPA, IF ONE EXISTS @Z40FPPD**/ 00870000
*/*** (HWLEPARP NOT 0), THAT WAS USED FOR READING SWA.  THE @Z40FPPD**/ 00871000
*/*** EPA WAS GOTTEN VIA GSPACE IN IEFAB4F7. A CATALOG      @Z40FPPD**/ 00872000
*/*** VOLUME LIST IS FREED IF ONE EXISTS OUTSIDE HSKPWA AND THEN    **/ 00873000
*/*** THE HOUSEKEEPING WORKAREA IS FREED.                           **/ 00874000
*                                                               02S0240 00875000
*               RFY                                             02S0240 00876000
*                (REG0,                                         02S0240 00877000
*                 REG1) RSTD;                                   02S0240 00878000
@RF00238 DS    0H                                               02S0241 00879000
*               IF HWLEPARP^=0 THEN /* AN EPA EXISTS                 */ 00880000
         L     @08,HWDATAP                                      02S0241 00881000
         L     @08,HWLEPARP(,@08)                               02S0241 00882000
         LTR   @08,@08                                          02S0241 00883000
         BZ    @RF00241                                         02S0241 00884000
*                 DO;                                           02S0242 00885000
*                   SBPOOL=SUBPOOOL;/* SET SUBPOOL NUMBER            */ 00886000
         MVI   SBPOOL,X'E6'                                     02S0243 00887000
*                   LENTH=LENGTH(SWAEPA);/* LENGTH OF AN EPA         */ 00888000
         MVC   LENTH(3),@CF00055+1                              02S0244 00889000
*                   REG0=SPLEN;     /* SUBPOOL+LENGTH TO REG 0       */ 00890000
         L     REG0,SPLEN                                       02S0245 00891000
*                   REG1=HWLEPARP;  /* POINTER TO EPA                */ 00892000
         LR    REG1,@08                                         02S0246 00893000
*                   GEN(FREEMAIN R,LV=(0),A=(1));/* FREE EPA @Z40FPPD*/ 00894000
         FREEMAIN R,LV=(0),A=(1)                                        00895000
*                 END;                                          02S0248 00896000
*               IF HWNEWVL=ON THEN  /* AN ADDITIONAL VOL LIST        */ 00897000
@RF00241 L     @08,HWCNTRLP                                     02S0249 00898000
         TM    HWNEWVL(@08),B'00001000'                         02S0249 00899000
         BNO   @RF00249                                         02S0249 00900000
*                 DO;                                           02S0250 00901000
*                   SBPOOL=SUBPOOOL;/* SET SUBPOOL NUMBER            */ 00902000
         MVI   SBPOOL,X'E6'                                     02S0251 00903000
*                   LENTH=CTGWALV;  /* LENGTH OF VOL LIST            */ 00904000
         L     @08,HWDATAP                                      02S0252 00905000
         L     @08,HWCRIP(,@08)                                 02S0252 00906000
         L     @08,CTGWKA(,@08)                                 02S0252 00907000
         LH    @15,CTGWALV(,@08)                                02S0252 00908000
         STCM  @15,7,LENTH                                      02S0252 00909000
*                   REG0=SPLEN;     /* SUBPOOL+LENGTH TO REG 0       */ 00910000
         L     REG0,SPLEN                                       02S0253 00911000
*                   REG1=CTGWAVL;   /* POINTER TO VOL LIST           */ 00912000
         L     REG1,CTGWAVL(,@08)                               02S0254 00913000
*                   GEN(FREEMAIN R,LV=(0),A=(1));               02S0255 00914000
         FREEMAIN R,LV=(0),A=(1)                                        00915000
*                 END;                                          02S0256 00916000
*               SBPOOL=SUBPOOOL;    /* SET SUBPOOL NUMBER            */ 00917000
@RF00249 MVI   SBPOOL,X'E6'                                     02S0257 00918000
*               LENTH=HWGETLN;      /* LENGTH OF HSKP WORKAREA       */ 00919000
         L     @08,HWDATAP                                      02S0258 00920000
         MVC   LENTH(3),HWGETLN+1(@08)                          02S0258 00921000
*               REG0=SPLEN;         /* SUBPOOL+LENGTH TO REG 0       */ 00922000
         L     REG0,SPLEN                                       02S0259 00923000
*               REG1=HWGETADD;      /* ADDRESS OF WORKAREA           */ 00924000
         L     REG1,HWGETADD(,@08)                              02S0260 00925000
*               GEN(FREEMAIN R,LV=(0),A=(1));                   02S0261 00926000
         FREEMAIN R,LV=(0),A=(1)                                        00927000
*               RFY                                             01S0262 00928000
*                 IEZJSCB BASED(JSCBWRKP);/* REFER TO ACTIVE @Z40FPPG*/ 00929000
*               DO;                 /* MODESET KEYADDR(ZERO)         */ 00930000
*                 SPKA(ZERO);       /* SET PSW KEY                   */ 00931000
         SLR   @08,@08                                          01S0264 00932000
         SPKA  0(@08)                                           01S0264 00933000
*               END;                /* MODESET KEYADDR(ZERO) KEY TO     00934000
*                                      UPDATE JSCB           @Z40FPPG*/ 00935000
*               IF ISSUESTA=ON THEN /* WAS ESTAE ISSUED      @Z40FPPG*/ 00936000
         TM    ISSUESTA,B'10000000'                             01S0266 00937000
         BNO   @RF00266                                         01S0266 00938000
*                 JSCBASWA=ASWAOLDP;/* ZERO OR OLD LAST      @Z40FPPG*/ 00939000
         L     @08,JSCBWRKP                                     01S0267 00940000
         MVC   JSCBASWA(4,@08),ASWAOLDP(ASWAPTR)                01S0267 00941000
*               ELSE                /* NO ESTAE ISSUED       @Z40FPPG*/ 00942000
*                 JSCBASWA=ASWACHNP;/* PRECEEDING IS LAST    @Z40FPPG*/ 00943000
         B     @RC00266                                         01S0268 00944000
@RF00266 L     @08,JSCBWRKP                                     01S0268 00945000
         MVC   JSCBASWA(4,@08),ASWACHNP(ASWAPTR)                01S0268 00946000
*               DO;                 /* MODESET EXTKEY(SCHED)         */ 00947000
@RC00266 DS    0H                                               01S0270 00948000
*                 SPKA(16);         /* SET PSW KEY                   */ 00949000
         LA    @15,16                                           01S0270 00950000
         SPKA  0(@15)                                           01S0270 00951000
*               END;                /* MODESET EXTKEY(SCHED) BACK TO    00952000
*                                      SCHED KEY             @Z40FPPG*/ 00953000
*               RFY                                             01S0272 00954000
*                 IEZJSCB BASED(JSCBPTR);/* RESET BASE       @Z40FPPG*/ 00955000
*               IF ISSUESTA=ON THEN /* WAS ESTAE ISSUED      @Z40FPPG*/ 00956000
         TM    ISSUESTA,B'10000000'                             01S0273 00957000
         BNO   @RF00273                                         01S0273 00958000
*                 DO;               /* YES, CANCEL IT        @Z40FPPG*/ 00959000
*                   GEN REFS(ESTAECOR);                         01S0275 00960000
                  ESTAE 0,MF=(E,ESTAECOR)                               00961000
*                 END;              /*                       @Z40FPPG*/ 00962000
*               RFY                                             01S0277 00963000
*                (REG0,                                         01S0277 00964000
*                 REG1) RSTD;       /* ESTAE PARMLIST IS TO BE FREED */ 00965000
@RF00273 DS    0H                                               01S0278 00966000
*               SBPOOL=SUBPOOOL;    /* SET SUBPOOL NUMBER            */ 00967000
         MVI   SBPOOL,X'E6'                                     01S0278 00968000
*               LENTH=LENGTH(EPARMLST);/* LENGTH OF ESTAE PARMLIST   */ 00969000
         MVC   LENTH(3),@CF01849+1                              01S0279 00970000
*               REG0=SPLEN;         /* SET SUBPOOL+LENGTH IN REG 0   */ 00971000
         L     REG0,SPLEN                                       01S0280 00972000
*               REG1=EPRMLSTP;      /* PTR TO PARMLIST TO FREE       */ 00973000
         LR    REG1,EPRMLSTP                                    01S0281 00974000
*               GEN(FREEMAIN R,LV=(0),A=(1));                   01S0282 00975000
         FREEMAIN R,LV=(0),A=(1)                                        00976000
*               RFY                                             01S0283 00977000
*                (REG0,                                         01S0283 00978000
*                 REG1) UNRSTD;                                 01S0283 00979000
*             END;                                              01S0284 00980000
*         END;                                                  01S0285 00981000
@RF00188 DS    0H                                               01S0286 00982000
*     END;                                                      01S0286 00983000
@RF00137 DS    0H                                               01S0287 00984000
*   RETURN CODE(RTNCODE);           /* RETURN TO CALLER PASSING 01S0287 00985000
*                                      APPROPRIATE RETURN CODE       */ 00986000
@RF00062 L     @10,RTNCODE                                      01S0287 00987000
         L     @13,4(,@13)                                      01S0287 00988000
         L     @00,@SIZDATD                                     01S0287 00989000
         LR    @01,@11                                          01S0287 00990000
         FSPACE   R,LV=(0),A=(1)                                        00991000
         LR    @15,@10                                          01S0287 00992000
         L     @14,12(,@13)                                     01S0287 00993000
         LM    @00,@12,20(@13)                                  01S0287 00994000
         BR    @14                                              01S0287 00995000
*   END IEFAB451                    /* END HSKP CONTROL ROUTINE      */ 00996000
*                                                               01S0288 00997000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00998000
*/*%INCLUDE SYSUT5  (HCNTLSPC)                                       */ 00999000
*/*%INCLUDE SYSUT5  (B451DATA)                                       */ 01000000
*/*%INCLUDE SYSLIB  (IEFZB437)                                       */ 01001000
*/*%INCLUDE SYSLIB  (IEFZB444)                                       */ 01002000
*/*%INCLUDE SYSLIB  (IEFZB443)                                       */ 01003000
*/*%INCLUDE SYSLIB  (IEZJSCB )                                       */ 01004000
*/*%INCLUDE SYSLIB  (IEZCTGPL)                                       */ 01005000
*/*%INCLUDE SYSLIB  (IEZCTGWA)                                       */ 01006000
*/*%INCLUDE SYSLIB  (IEFZB505)                                       */ 01007000
*/*%INCLUDE SYSLIB  (IEFASCTB)                                       */ 01008000
*/*%INCLUDE SYSLIB  (IEFASIOT)                                       */ 01009000
*/*%INCLUDE SYSLIB  (IEFAJCTB)                                       */ 01010000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 01011000
*/*%INCLUDE SYSLIB  (IEFZB453)                                       */ 01012000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 01013000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 01014000
*/*%INCLUDE SYSUT5  (HESTAESP)                                       */ 01015000
*/*%INCLUDE SYSUT5  (HSKESTAE)                                       */ 01016000
*/*%INCLUDE SYSUT5  (ESTAECOD)                                       */ 01017000
*/*%INCLUDE SYSLIB  (ESTAESPC)                                       */ 01018000
*/*%INCLUDE SYSUT5  (HINITSPC)                                       */ 01019000
*/*%INCLUDE SYSUT5  (HSKPINIT)                                       */ 01020000
*/*%INCLUDE SYSUT5  (HCLUPSPC)                                       */ 01021000
*/*%INCLUDE SYSUT5  (HSKPCLUP)                                       */ 01022000
*/*%INCLUDE SYSUT5  (TERMCALL)                                       */ 01023000
*/*%INCLUDE SYSLIB  (TERMSPEC)                                       */ 01024000
*                                                               01S0288 01025000
*       ;                                                       01S0288 01026000
@DATA    DS    0H                                                       01027000
@CH00125 DC    H'2'                                                     01028000
@SM01862 MVC   ESTAECOR(0),ESTAELST                                     01029000
@DATD    DSECT                                                          01030000
         DS    0F                                                       01031000
@SA00001 DS    18F                                                      01032000
@PC00001 DS    11F                                                      01033000
@AL00001 DS    6A                                                       01034000
@TF00001 DS    F                                                        01035000
IEFAB451 CSECT                                                          01036000
         DS    0F                                                       01037000
@CF00122 DC    F'0'                                                     01038000
@CF00113 DC    F'4'                                                     01039000
@CF00074 DC    F'8'                                                     01040000
@CH00074 EQU   @CF00074+2                                               01041000
@CF00492 DC    F'11'                                                    01042000
@CF00055 DC    F'16'                                                    01043000
@CH00055 EQU   @CF00055+2                                               01044000
@CF00043 DC    F'230'                                                   01045000
@CF01849 DC    F'436'                                                   01046000
@CF01865 DC    XL4'0000FFFF'                                            01047000
@DATD    DSECT                                                          01048000
         DS    0D                                                       01049000
JSCBWRKP DS    A                                                        01050000
SIOTPTR  DS    A                                                        01051000
RTNCODE  DS    F                                                        01052000
ADDRESS  DS    F                                                        01053000
GETLNTH  DS    F                                                        01054000
HWCNTRLP DS    A                                                        01055000
HWDATAP  DS    A                                                        01056000
HWRTNP   DS    A                                                        01057000
GTSTRTCD DS    F                                                        01058000
UCCNTRLS DS    FL2                                                      01059000
         ORG   UCCNTRLS                                                 01060000
UCCAJSCB DS    BL1                                                      01061000
UCNTIONQ EQU   UCCNTRLS+0                                               01062000
UCONECAT EQU   UCCNTRLS+0                                               01063000
UCALLCAT EQU   UCCNTRLS+0                                               01064000
UCONEACB EQU   UCCNTRLS+0                                               01065000
UCALLACB EQU   UCCNTRLS+0                                               01066000
UCONPCCB EQU   UCCNTRLS+0                                               01067000
UCALPCCB EQU   UCCNTRLS+0                                               01068000
UCTEMP   DS    BL1                                                      01069000
UCSWTIOT EQU   UCCNTRLS+1                                               01070000
@NM00021 EQU   UCCNTRLS+1                                               01071000
         ORG   UCCNTRLS+2                                               01072000
AB4EDCOR DS    CL500                                                    01073000
ASWACORE DS    CL40                                                     01074000
SWITCHES DS    BL1                                                      01075000
         ORG   SWITCHES                                                 01076000
ISSUESTA DS    BL1                                                      01077000
@NM00003 EQU   SWITCHES+0                                               01078000
         ORG   SWITCHES+1                                               01079000
         DS    CL1                                                      01080000
RETINFO  DS    CL4                                                      01081000
         ORG   RETINFO                                                  01082000
RETCODE  DS    FL2                                                      01083000
REASCODE DS    FL2                                                      01084000
         ORG   RETINFO+4                                                01085000
SPLEN    DS    CL4                                                      01086000
         ORG   SPLEN                                                    01087000
SBPOOL   DS    FL1                                                      01088000
LENTH    DS    FL3                                                      01089000
         ORG   SPLEN+4                                                  01090000
TERMAREA DS    CL16                                                     01091000
IEFAB451 CSECT                                                          01092000
         DS    0F                                                       01093000
@SIZDATD DC    AL1(230)                                                 01094000
         DC    AL3(@ENDDATD-@DATD)                                      01095000
@CV00137 DC    V(IEFAB452)                                              01096000
@CV00138 DC    V(IEFAB4EA)                                              01097000
@CV00139 DC    V(IEFAB4ED)                                              01098000
@CV00140 DC    V(IEFAB4F4)                                              01099000
         DS    0D                                                       01100000
GTSTZERO DC    F'0'                                                     01101000
@CC00116 DC    C'IEFAB4EA'                                              01102000
@CC00114 DC    C'ASWA'                                                  01103000
IEFAB451 CSECT                                                          01104000
ESTAELST ESTAE RECORD=YES,TERM=YES,MF=L                                 01105000
ESTAELEN DC A(*-ESTAELST)                                               01106000
@DATD    DSECT                                                          01107000
ESTAECOR ESTAE RECORD=YES,TERM=YES,MF=L                                 01108000
IEFAB451 CSECT                                                          01109000
         DS   0H                                                        01110000
PATCHLOC DC ((@DATA-@PSTART)/20)X'00'                                   01111000
@DATD    DSECT                                                          01112000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01113000
@ENDDATD EQU   *                                                        01114000
IEFAB451 CSECT                                                          01115000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01116000
@01      EQU   01                                                       01117000
@02      EQU   02                                                       01118000
@03      EQU   03                                                       01119000
@04      EQU   04                                                       01120000
@05      EQU   05                                                       01121000
@06      EQU   06                                                       01122000
@07      EQU   07                                                       01123000
@08      EQU   08                                                       01124000
@09      EQU   09                                                       01125000
@10      EQU   10                                                       01126000
@11      EQU   11                                                       01127000
@12      EQU   12                                                       01128000
@13      EQU   13                                                       01129000
@14      EQU   14                                                       01130000
@15      EQU   15                                                       01131000
ASWAPTR  EQU   @09                                                      01132000
ASCBPTR  EQU   @02                                                      01133000
EPRMLSTP EQU   @10                                                      01134000
REG0     EQU   @00                                                      01135000
REG1     EQU   @01                                                      01136000
REG2     EQU   @02                                                      01137000
REG3     EQU   @03                                                      01138000
REG15    EQU   @15                                                      01139000
GTSTR0   EQU   @00                                                      01140000
GTSTR1   EQU   @01                                                      01141000
GTSTR2   EQU   @02                                                      01142000
GTSTR15  EQU   @15                                                      01143000
GTSTR4   EQU   @04                                                      01144000
GTSTR5   EQU   @05                                                      01145000
GTSTR6   EQU   @06                                                      01146000
GTSTR7   EQU   @07                                                      01147000
GTSTR8   EQU   @08                                                      01148000
GTSTR3   EQU   @03                                                      01149000
LOC16PTR EQU   16                                                       01150000
PSA      EQU   0                                                        01151000
FLCRNPSW EQU   PSA                                                      01152000
FLCROPSW EQU   PSA+8                                                    01153000
FLCICCW2 EQU   PSA+16                                                   01154000
PSAEEPSW EQU   PSA+132                                                  01155000
PSAESPSW EQU   PSA+136                                                  01156000
FLCSVILC EQU   PSAESPSW+1                                               01157000
PSAEPPSW EQU   PSA+140                                                  01158000
FLCPIILC EQU   PSAEPPSW+1                                               01159000
FLCPICOD EQU   PSAEPPSW+2                                               01160000
PSAPICOD EQU   FLCPICOD+1                                               01161000
FLCTEA   EQU   PSAEPPSW+4                                               01162000
FLCPER   EQU   PSA+152                                                  01163000
FLCMCLA  EQU   PSA+168                                                  01164000
FLCIOEL  EQU   FLCMCLA+4                                                01165000
FLCIOA   EQU   FLCMCLA+16                                               01166000
FLCFSA   EQU   FLCMCLA+80                                               01167000
PSAAOLD  EQU   PSA+548                                                  01168000
PSASUPER EQU   PSA+552                                                  01169000
PSASUP1  EQU   PSASUPER                                                 01170000
PSASUP2  EQU   PSASUPER+1                                               01171000
PSASUP3  EQU   PSASUPER+2                                               01172000
PSASUP4  EQU   PSASUPER+3                                               01173000
PSACLHT  EQU   PSA+640                                                  01174000
PSALKSA  EQU   PSA+696                                                  01175000
PSAHLHI  EQU   PSA+760                                                  01176000
PSADSSFL EQU   PSA+836                                                  01177000
PSADSSF1 EQU   PSADSSFL                                                 01178000
PSADSSF3 EQU   PSADSSFL+2                                               01179000
PSADSSF4 EQU   PSADSSFL+3                                               01180000
PSARSVT  EQU   PSA+896                                                  01181000
TCBLISTP EQU   0                                                        01182000
TWOTCBPS EQU   0                                                        01183000
TCBPTR   EQU   TWOTCBPS+4                                               01184000
AB4EDPMS EQU   0                                                        01185000
ASWA     EQU   0                                                        01186000
ASWAID   EQU   ASWA                                                     01187000
ASWACSCT EQU   ASWA+4                                                   01188000
ASWARTNP EQU   ASWA+12                                                  01189000
ASWAPRMS EQU   ASWA+16                                                  01190000
ASWASCBP EQU   ASWA+20                                                  01191000
ASWAOLDP EQU   ASWA+24                                                  01192000
ASWAFLGS EQU   ASWA+28                                                  01193000
ASWADSWS EQU   ASWAFLGS                                                 01194000
ASWAAUTO EQU   ASWA+32                                                  01195000
ASWACHNP EQU   ASWA+36                                                  01196000
HWCNTRL  EQU   0                                                        01197000
HWUNLCCT EQU   HWCNTRL                                                  01198000
HWDENQT  EQU   HWCNTRL+1                                                01199000
HWCAJSCB EQU   HWCNTRL+1                                                01200000
HWEPAJCT EQU   HWCNTRL+1                                                01201000
HWNEWVL  EQU   HWCNTRL+3                                                01202000
HWMSSCTL EQU   HWCNTRL+3                                                01203000
HWSELDON EQU   HWMSSCTL                                                 01204000
HWTBLCTL EQU   HWCNTRL+6                                                01205000
HWJLCTLS EQU   HWCNTRL+7                                                01206000
HWDATA   EQU   0                                                        01207000
HWJCTP   EQU   HWDATA                                                   01208000
HWSCTP   EQU   HWDATA+4                                                 01209000
HWFSIOTP EQU   HWDATA+8                                                 01210000
HWLEPAP  EQU   HWDATA+12                                                01211000
HWGEPACP EQU   HWDATA+16                                                01212000
HWJSCBP  EQU   HWDATA+20                                                01213000
HWIOSLTP EQU   HWDATA+32                                                01214000
HWCRIP   EQU   HWDATA+36                                                01215000
HWCSIOTP EQU   HWDATA+44                                                01216000
HWGETADD EQU   HWDATA+52                                                01217000
HWUCLPTR EQU   HWDATA+56                                                01218000
HWLEPARP EQU   HWDATA+60                                                01219000
HWVLSELP EQU   HWDATA+80                                                01220000
HWGETSPN EQU   HWDATA+164                                               01221000
HWGETLN  EQU   HWDATA+168                                               01222000
HWSTPNBR EQU   HWDATA+172                                               01223000
HWSTEPNO EQU   HWSTPNBR+1                                               01224000
HWCRI    EQU   HWDATA+220                                               01225000
HWUCLST  EQU   0                                                        01226000
HWDEV    EQU   0                                                        01227000
HWOBYTE  EQU   HWDEV+1                                                  01228000
HWCTBYT  EQU   HWDEV+2                                                  01229000
HWRETURN EQU   0                                                        01230000
HWRTCD   EQU   HWRETURN                                                 01231000
HWRSNCD  EQU   HWRETURN+2                                               01232000
HWVLSELB EQU   0                                                        01233000
HWSELHDR EQU   HWVLSELB                                                 01234000
EPARMLST EQU   0                                                        01235000
EECNTRLS EQU   EPARMLST+400                                             01236000
EEUALCAT EQU   EECNTRLS                                                 01237000
EECLACAT EQU   EECNTRLS                                                 01238000
EEFAPCCB EQU   EECNTRLS                                                 01239000
EERAJSCP EQU   EECNTRLS                                                 01240000
EEDYNAM  EQU   EECNTRLS                                                 01241000
EEDNENQT EQU   EECNTRLS                                                 01242000
ECJSCBP  EQU   EPARMLST+404                                             01243000
EAJSCBP  EQU   EPARMLST+408                                             01244000
ERETURNS EQU   EPARMLST+424                                             01245000
IEZJSCB  EQU   0                                                        01246000
JSCBSEC1 EQU   IEZJSCB+188                                              01247000
JSCHPCE  EQU   JSCBSEC1+4                                               01248000
JSCBPCC  EQU   JSCBSEC1+16                                              01249000
JSCBDCB  EQU   JSCBSEC1+36                                              01250000
JSCBOPTS EQU   JSCBSEC1+48                                              01251000
JSCBSWT1 EQU   JSCBSEC1+55                                              01252000
JSCBWTP  EQU   JSCBSEC1+64                                              01253000
JSCBWTFG EQU   JSCBWTP                                                  01254000
JSCBEND1 EQU   IEZJSCB+260                                              01255000
CTGPL    EQU   0                                                        01256000
CTGOPTN1 EQU   CTGPL                                                    01257000
CTGOPTN2 EQU   CTGPL+1                                                  01258000
CTGEXT   EQU   CTGOPTN2                                                 01259000
CTGERASE EQU   CTGOPTN2                                                 01260000
CTGSMF   EQU   CTGERASE                                                 01261000
CTGREL   EQU   CTGSMF                                                   01262000
CTGPURG  EQU   CTGOPTN2                                                 01263000
CTGVMNT  EQU   CTGPURG                                                  01264000
CTGRCATN EQU   CTGVMNT                                                  01265000
CTGOPTN3 EQU   CTGPL+2                                                  01266000
CTGOPTN4 EQU   CTGPL+3                                                  01267000
CTGENT   EQU   CTGPL+4                                                  01268000
CTGCAT   EQU   CTGPL+8                                                  01269000
CTGWKA   EQU   CTGPL+12                                                 01270000
CTGDSORG EQU   CTGPL+16                                                 01271000
CTGDDNM  EQU   CTGPL+20                                                 01272000
CTGNEWNM EQU   CTGDDNM                                                  01273000
CTGFBFLG EQU   CTGNEWNM+2                                               01274000
CTGJSCB  EQU   CTGPL+24                                                 01275000
CTGWA    EQU   0                                                        01276000
CTGWAVL  EQU   CTGWA                                                    01277000
CTGWALV  EQU   CTGWA+4                                                  01278000
SWAEPA   EQU   0                                                        01279000
SWVAFW   EQU   SWAEPA+4                                                 01280000
INSMSCT  EQU   0                                                        01281000
SCTSSTAT EQU   INSMSCT+4                                                01282000
SCTSTYPE EQU   INSMSCT+67                                               01283000
SCTSDPTY EQU   INSMSCT+94                                               01284000
SCTSTAT2 EQU   INSMSCT+104                                              01285000
SCTBCT   EQU   SCTSTAT2                                                 01286000
SCTCDENT EQU   INSMSCT+118                                              01287000
SCTSTEND EQU   INSMSCT+172                                              01288000
@NM00053 EQU   0                                                        01289000
SCTABCND EQU   @NM00053                                                 01290000
INDMSIOT EQU   0                                                        01291000
SCTUSADD EQU   INDMSIOT+20                                              01292000
SIOTBYT1 EQU   INDMSIOT+43                                              01293000
SIOTBYT3 EQU   INDMSIOT+46                                              01294000
SIOTTSTC EQU   INDMSIOT+47                                              01295000
SIOTBYT0 EQU   INDMSIOT+52                                              01296000
SCTSDISP EQU   INDMSIOT+55                                              01297000
SCTSBYT1 EQU   INDMSIOT+56                                              01298000
SCTSBYT2 EQU   INDMSIOT+57                                              01299000
SCTSBYT3 EQU   INDMSIOT+58                                              01300000
SCTSBYT4 EQU   INDMSIOT+59                                              01301000
SCTUTYPE EQU   INDMSIOT+60                                              01302000
SIOTDEVT EQU   SCTUTYPE                                                 01303000
SIOUBYT3 EQU   SIOTDEVT+2                                               01304000
SIOTBYT4 EQU   INDMSIOT+81                                              01305000
SIOTALTD EQU   INDMSIOT+92                                              01306000
SIOTBYT2 EQU   INDMSIOT+103                                             01307000
SIOTRSNC EQU   INDMSIOT+130                                             01308000
INJMJCT  EQU   0                                                        01309000
JCTJSTAT EQU   INJMJCT+5                                                01310000
INDMCTLG EQU   JCTJSTAT                                                 01311000
JCTJBYTE EQU   INJMJCT+7                                                01312000
JCTJMGLV EQU   JCTJBYTE                                                 01313000
JCTCCODE EQU   INJMJCT+54                                               01314000
JCTRSW1  EQU   INJMJCT+86                                               01315000
JCTRSW2  EQU   INJMJCT+87                                               01316000
JCTJSB   EQU   INJMJCT+111                                              01317000
JCTSTAT2 EQU   INJMJCT+116                                              01318000
IEFAACTB EQU   0                                                        01319000
TCBFIX   EQU   0                                                        01320000
TCBFRS   EQU   TCBFIX                                                   01321000
TCB      EQU   0                                                        01322000
TCBPIE   EQU   TCB+4                                                    01323000
TCBPMASK EQU   TCBPIE                                                   01324000
TCBCMP   EQU   TCB+16                                                   01325000
TCBCMPF  EQU   TCBCMP                                                   01326000
TCBCPP   EQU   TCBCMPF                                                  01327000
TCBSTCC  EQU   TCBCMPF                                                  01328000
TCBCDBL  EQU   TCBCMPF                                                  01329000
TCBCWTO  EQU   TCBCMPF                                                  01330000
TCBCIND  EQU   TCBCMPF                                                  01331000
TCBCMSG  EQU   TCBCMPF                                                  01332000
TCBTRN   EQU   TCB+20                                                   01333000
TCBABF   EQU   TCBTRN                                                   01334000
TCBMSS   EQU   TCB+24                                                   01335000
TCBPKF   EQU   TCB+28                                                   01336000
TCBFLGS  EQU   TCB+29                                                   01337000
TCBFLGS1 EQU   TCBFLGS                                                  01338000
TCBFLGS2 EQU   TCBFLGS+1                                                01339000
TCBFLGS3 EQU   TCBFLGS+2                                                01340000
TCBFLGS4 EQU   TCBFLGS+3                                                01341000
TCBFLGS5 EQU   TCBFLGS+4                                                01342000
TCBABWF  EQU   TCBFLGS5                                                 01343000
TCBJPQ   EQU   TCB+44                                                   01344000
TCBPURGE EQU   TCBJPQ                                                   01345000
TCBGRS   EQU   TCB+48                                                   01346000
TCBFSA   EQU   TCB+112                                                  01347000
TCBTME   EQU   TCB+120                                                  01348000
TCBJSTCB EQU   TCB+124                                                  01349000
TCBTSFLG EQU   TCB+148                                                  01350000
TCBTSTSK EQU   TCBTSFLG                                                 01351000
TCBSTAB  EQU   TCB+160                                                  01352000
TCBNSTAE EQU   TCBSTAB                                                  01353000
TCBSTABB EQU   TCBSTAB+1                                                01354000
TCBTCT   EQU   TCB+164                                                  01355000
TCBTCTGF EQU   TCBTCT                                                   01356000
TCBSCNDY EQU   TCB+172                                                  01357000
TCBNDSP  EQU   TCBSCNDY                                                 01358000
TCBNDSP1 EQU   TCBNDSP+1                                                01359000
TCBNDSP2 EQU   TCBNDSP+2                                                01360000
TCBNDSP3 EQU   TCBNDSP+3                                                01361000
TCBJSCB  EQU   TCB+180                                                  01362000
TCBRECDE EQU   TCBJSCB                                                  01363000
TCBEXT1  EQU   TCB+196                                                  01364000
TCBBITS  EQU   TCB+200                                                  01365000
TCBNDSP4 EQU   TCBBITS                                                  01366000
TCBNDSP5 EQU   TCBBITS+1                                                01367000
TCBFLGS6 EQU   TCBBITS+2                                                01368000
TCBFLGS7 EQU   TCBBITS+3                                                01369000
TCBDAR   EQU   TCB+204                                                  01370000
TCBDARC  EQU   TCBDAR                                                   01371000
TCBEXT2  EQU   TCB+208                                                  01372000
TCBXSCT  EQU   TCB+240                                                  01373000
TCBXSCT1 EQU   TCBXSCT                                                  01374000
TCBFOE   EQU   TCB+244                                                  01375000
TCBESTAE EQU   TCB+264                                                  01376000
TCBESTRM EQU   TCBESTAE+1                                               01377000
TCBFBYT1 EQU   TCB+276                                                  01378000
TCBFBYT2 EQU   TCB+277                                                  01379000
TCBRV124 EQU   TCB+278                                                  01380000
TCBRV133 EQU   TCB+279                                                  01381000
TCBXTNT2 EQU   0                                                        01382000
TCBGTF   EQU   TCBXTNT2                                                 01383000
TCBTFLG  EQU   TCBGTF                                                   01384000
TCBRV146 EQU   TCBXTNT2+28                                              01385000
TCBRV155 EQU   TCBXTNT2+29                                              01386000
TCBRV164 EQU   TCBXTNT2+30                                              01387000
TCBRV173 EQU   TCBXTNT2+31                                              01388000
ASCB     EQU   0                                                        01389000
ASCBSUPC EQU   ASCB+16                                                  01390000
ASCBASID EQU   ASCB+36                                                  01391000
ASCBFW1  EQU   ASCB+100                                                 01392000
ASCBRCTF EQU   ASCBFW1+2                                                01393000
ASCBFLG1 EQU   ASCBFW1+3                                                01394000
ASCBDSP1 EQU   ASCB+114                                                 01395000
ASCBFLG2 EQU   ASCB+115                                                 01396000
ASCBLKGP EQU   ASCB+128                                                 01397000
ASCBSRQ  EQU   ASCB+180                                                 01398000
ASCBSRQ1 EQU   ASCBSRQ                                                  01399000
ASCBSRQ2 EQU   ASCBSRQ+1                                                01400000
ASCBSRQ3 EQU   ASCBSRQ+2                                                01401000
ASCBSRQ4 EQU   ASCBSRQ+3                                                01402000
TRMRB    EQU   0                                                        01403000
TRMRBLEN EQU   TRMRB                                                    01404000
TRMRBOPC EQU   TRMRB+4                                                  01405000
TRMFLAGS EQU   TRMRB+5                                                  01406000
TRMJOBID EQU   TRMRB+8                                                  01407000
INDMDSNT EQU   0                                                        01408000
IFUNCTN  EQU   0                                                        01409000
IUNCATSW EQU   IFUNCTN                                                  01410000
IDENQTIO EQU   IFUNCTN+1                                                01411000
ICAJSCB  EQU   IFUNCTN+1                                                01412000
IAEPAJCT EQU   IFUNCTN+1                                                01413000
FSIOTPTR EQU   0                                                        01414000
STEPNUMB EQU   0                                                        01415000
JCTPTR   EQU   0                                                        01416000
SCTPTR   EQU   0                                                        01417000
LEPAPTR  EQU   0                                                        01418000
GEPACPTR EQU   0                                                        01419000
JSCBPTR  EQU   0                                                        01420000
IOSLUTP  EQU   0                                                        01421000
REASONCD EQU   0                                                        01422000
JHRETMAP EQU   0                                                        01423000
JHMSSTRM EQU   JHRETMAP                                                 01424000
JSCBSEC2 EQU   JSCBEND1                                                 01425000
JSCBSEC3 EQU   JSCBEND1                                                 01426000
JSCBJCT  EQU   JSCBSEC3                                                 01427000
JSCBJCTA EQU   JSCBJCT+1                                                01428000
JSCBASID EQU   JSCBSEC3+8                                               01429000
JSCBFBYT EQU   JSCBSEC3+10                                              01430000
JSCBJNL  EQU   JSCBSEC3+28                                              01431000
JSCBJJSB EQU   JSCBJNL                                                  01432000
JSCBSUB  EQU   JSCBSEC3+40                                              01433000
JSCSCT   EQU   JSCBSEC3+68                                              01434000
JSCBACT  EQU   JSCBSEC3+88                                              01435000
JSCBASWA EQU   JSCBSEC3+96                                              01436000
JSCRSV45 EQU   JSCBSEC3+112                                             01437000
JSCRSV46 EQU   JSCRSV45                                                 01438000
JSCRSV47 EQU   JSCRSV45+2                                               01439000
@NM00031 EQU   CTGDDNM                                                  01440000
CTGPROB  EQU   @NM00031                                                 01441000
CTGREASN EQU   CTGPROB+2                                                01442000
PSARSVTE EQU   PSARSVT                                                  01443000
FLC      EQU   PSA                                                      01444000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01445000
PSARSAV  EQU   PSARSVTE+60                                              01446000
PSARSTK  EQU   PSARSVTE+56                                              01447000
PSAESAV3 EQU   PSARSVTE+52                                              01448000
PSAESTK3 EQU   PSARSVTE+48                                              01449000
PSAESAV2 EQU   PSARSVTE+44                                              01450000
PSAESTK2 EQU   PSARSVTE+40                                              01451000
PSAESAV1 EQU   PSARSVTE+36                                              01452000
PSAESTK1 EQU   PSARSVTE+32                                              01453000
PSAPSAV  EQU   PSARSVTE+28                                              01454000
PSAPSTK  EQU   PSARSVTE+24                                              01455000
PSAMSAV  EQU   PSARSVTE+20                                              01456000
PSAMSTK  EQU   PSARSVTE+16                                              01457000
PSASSAV  EQU   PSARSVTE+12                                              01458000
PSASSTK  EQU   PSARSVTE+8                                               01459000
PSANSTK  EQU   PSARSVTE+4                                               01460000
PSACSTK  EQU   PSARSVTE                                                 01461000
CTGREAS2 EQU   CTGREASN+1                                               01462000
CTGREAS1 EQU   CTGREASN                                                 01463000
CTGMODID EQU   CTGPROB                                                  01464000
JSCBEND3 EQU   JSCBSEC3+120                                             01465000
JSCRSV52 EQU   JSCBSEC3+116                                             01466000
JSCRSV51 EQU   JSCRSV47+1                                               01467000
JSCRSV50 EQU   JSCRSV47                                                 01468000
JSCRSV49 EQU   JSCRSV46+1                                               01469000
JSCRSV48 EQU   JSCRSV46                                                 01470000
JSCRSV44 EQU   JSCBSEC3+108                                             01471000
JSCRSV43 EQU   JSCBSEC3+104                                             01472000
JSCRSV42 EQU   JSCBSEC3+100                                             01473000
JSCBUFPT EQU   JSCBSEC3+92                                              01474000
JSCBSWSP EQU   JSCBSEC3+87                                              01475000
JSCRSV33 EQU   JSCBSEC3+86                                              01476000
JSCDDNUM EQU   JSCBSEC3+84                                              01477000
JSCRSV53 EQU   JSCBSEC3+82                                              01478000
JSCDDNNO EQU   JSCBSEC3+80                                              01479000
JSCBVATA EQU   JSCBSEC3+76                                              01480000
JSCTMCOR EQU   JSCBSEC3+72                                              01481000
JSCSCTP  EQU   JSCSCT+1                                                 01482000
JSCRSV55 EQU   JSCSCT                                                   01483000
JSCRSV54 EQU   JSCBSEC3+64                                              01484000
JSCDSABQ EQU   JSCBSEC3+60                                              01485000
JSCBSSIB EQU   JSCBSEC3+56                                              01486000
JSCBFRBA EQU   JSCBSEC3+48                                              01487000
JSCRSV28 EQU   JSCBSEC3+46                                              01488000
JSCBSONO EQU   JSCBSEC3+44                                              01489000
JSCBSUBA EQU   JSCBSUB+1                                                01490000
JSCRSV31 EQU   JSCBSUB                                                  01491000
JSCBSMLR EQU   JSCBSEC3+36                                              01492000
JSCBJNLR EQU   JSCBSEC3+32                                              01493000
JSCBJNLA EQU   JSCBJNL+1                                                01494000
JSCBJSBT EQU   JSCBJJSB                                                 01495000
JSCBJSBX EQU   JSCBJJSB                                                 01496000
JSCBJSBA EQU   JSCBJJSB                                                 01497000
JSCBJSBI EQU   JSCBJJSB                                                 01498000
@NM00025 EQU   JSCBJJSB                                                 01499000
JSCBJNLE EQU   JSCBJJSB                                                 01500000
JSCBJNLF EQU   JSCBJJSB                                                 01501000
JSCBJNLN EQU   JSCBJJSB                                                 01502000
@NM00024 EQU   JSCBSEC3+24                                              01503000
JSCBJRBA EQU   JSCBSEC3+16                                              01504000
JSCBIECB EQU   JSCBSEC3+12                                              01505000
JSCBRV08 EQU   JSCBSEC3+11                                              01506000
JSCBRV07 EQU   JSCBFBYT                                                 01507000
JSCBRV06 EQU   JSCBFBYT                                                 01508000
JSCBRV05 EQU   JSCBFBYT                                                 01509000
JSCBRV04 EQU   JSCBFBYT                                                 01510000
JSCBRV03 EQU   JSCBFBYT                                                 01511000
JSCBRV02 EQU   JSCBFBYT                                                 01512000
JSCBADSP EQU   JSCBFBYT                                                 01513000
JSCBRV01 EQU   JSCBFBYT                                                 01514000
JSCBTJID EQU   JSCBASID                                                 01515000
JSCBPSCB EQU   JSCBSEC3+4                                               01516000
JSCJCTP  EQU   JSCBJCTA                                                 01517000
JSCRSV24 EQU   JSCBJCT                                                  01518000
JSCBEND2 EQU   JSCBSEC2                                                 01519000
@NM00002 EQU   JHRETMAP                                                 01520000
@NM00001 EQU   IFUNCTN+1                                                01521000
IDNOVRID EQU   IFUNCTN+1                                                01522000
IDSAUTH  EQU   IFUNCTN+1                                                01523000
INODSI   EQU   IFUNCTN+1                                                01524000
ICOFFDEV EQU   IFUNCTN+1                                                01525000
INOSCAT  EQU   IFUNCTN                                                  01526000
IWAITVSW EQU   IFUNCTN                                                  01527000
IDCCDDSW EQU   IFUNCTN                                                  01528000
IWAITUSW EQU   IFUNCTN                                                  01529000
ICATMTSW EQU   IFUNCTN                                                  01530000
INOSCTUP EQU   IFUNCTN                                                  01531000
IPRPDISW EQU   IFUNCTN                                                  01532000
TRMSTHDR EQU   TRMRB+12                                                 01533000
@NM00115 EQU   TRMRB+6                                                  01534000
@NM00114 EQU   TRMFLAGS                                                 01535000
TRMSCHAB EQU   TRMFLAGS                                                 01536000
TRMALLOK EQU   TRMFLAGS                                                 01537000
ASCBEND  EQU   ASCB+208                                                 01538000
ASCBSRBT EQU   ASCB+200                                                 01539000
ASCBSWTL EQU   ASCB+196                                                 01540000
ASCBRS14 EQU   ASCB+195                                                 01541000
ASCBSMCT EQU   ASCB+194                                                 01542000
ASCBRS12 EQU   ASCB+192                                                 01543000
ASCBPCTT EQU   ASCB+188                                                 01544000
ASCBVGTT EQU   ASCB+184                                                 01545000
ASCBRV43 EQU   ASCBSRQ4                                                 01546000
ASCBRV42 EQU   ASCBSRQ4                                                 01547000
ASCBRV41 EQU   ASCBSRQ4                                                 01548000
ASCBRV40 EQU   ASCBSRQ4                                                 01549000
ASCBRV39 EQU   ASCBSRQ4                                                 01550000
ASCBRV38 EQU   ASCBSRQ4                                                 01551000
ASCBRV37 EQU   ASCBSRQ4                                                 01552000
ASCBRV36 EQU   ASCBSRQ4                                                 01553000
ASCBRV35 EQU   ASCBSRQ3                                                 01554000
ASCBRV34 EQU   ASCBSRQ3                                                 01555000
ASCBRV33 EQU   ASCBSRQ3                                                 01556000
ASCBRV32 EQU   ASCBSRQ3                                                 01557000
ASCBRV31 EQU   ASCBSRQ3                                                 01558000
ASCBRV30 EQU   ASCBSRQ3                                                 01559000
ASCBRV29 EQU   ASCBSRQ3                                                 01560000
ASCBRV28 EQU   ASCBSRQ3                                                 01561000
ASCBRV27 EQU   ASCBSRQ2                                                 01562000
ASCBRV26 EQU   ASCBSRQ2                                                 01563000
ASCBRV25 EQU   ASCBSRQ2                                                 01564000
ASCBRV24 EQU   ASCBSRQ2                                                 01565000
ASCBRV23 EQU   ASCBSRQ2                                                 01566000
ASCBRV22 EQU   ASCBSRQ2                                                 01567000
ASCBRV21 EQU   ASCBSRQ2                                                 01568000
ASCBRV20 EQU   ASCBSRQ2                                                 01569000
ASCBRV19 EQU   ASCBSRQ1                                                 01570000
ASCBRV18 EQU   ASCBSRQ1                                                 01571000
ASCBRV17 EQU   ASCBSRQ1                                                 01572000
ASCBRV16 EQU   ASCBSRQ1                                                 01573000
ASCBRV15 EQU   ASCBSRQ1                                                 01574000
ASCBRV14 EQU   ASCBSRQ1                                                 01575000
ASCBRV13 EQU   ASCBSRQ1                                                 01576000
ASCBSTA  EQU   ASCBSRQ1                                                 01577000
ASCBJBNS EQU   ASCB+176                                                 01578000
ASCBJBNI EQU   ASCB+172                                                 01579000
ASCBMCC  EQU   ASCB+168                                                 01580000
ASCBRTWA EQU   ASCB+164                                                 01581000
ASCBIQEA EQU   ASCB+160                                                 01582000
ASCBXMPQ EQU   ASCB+156                                                 01583000
ASCBRS01 EQU   ASCB+154                                                 01584000
ASCBFMCT EQU   ASCB+152                                                 01585000
ASCBOUXB EQU   ASCB+148                                                 01586000
ASCBOUCB EQU   ASCB+144                                                 01587000
ASCBMECB EQU   ASCB+140                                                 01588000
ASCBQECB EQU   ASCB+136                                                 01589000
ASCBLSQH EQU   ASCBLKGP+4                                               01590000
ASCBLOCK EQU   ASCBLKGP                                                 01591000
ASCBTCBS EQU   ASCB+124                                                 01592000
ASCBNVSC EQU   ASCB+122                                                 01593000
ASCBVSC  EQU   ASCB+120                                                 01594000
ASCBSRBS EQU   ASCB+118                                                 01595000
ASCBSSRB EQU   ASCB+116                                                 01596000
ASCBRV06 EQU   ASCBFLG2                                                 01597000
ASCBRV05 EQU   ASCBFLG2                                                 01598000
ASCBRV04 EQU   ASCBFLG2                                                 01599000
ASCBSNQS EQU   ASCBFLG2                                                 01600000
ASCBS2S  EQU   ASCBFLG2                                                 01601000
ASCBCEXT EQU   ASCBFLG2                                                 01602000
ASCBPXMT EQU   ASCBFLG2                                                 01603000
ASCBXMPT EQU   ASCBFLG2                                                 01604000
ASCBRF07 EQU   ASCBDSP1                                                 01605000
ASCBRF06 EQU   ASCBDSP1                                                 01606000
ASCBRF05 EQU   ASCBDSP1                                                 01607000
ASCBRF04 EQU   ASCBDSP1                                                 01608000
ASCBRF03 EQU   ASCBDSP1                                                 01609000
ASCBRF02 EQU   ASCBDSP1                                                 01610000
ASCBFAIL EQU   ASCBDSP1                                                 01611000
ASCBNOQ  EQU   ASCBDSP1                                                 01612000
ASCBSWCT EQU   ASCB+112                                                 01613000
ASCBASXB EQU   ASCB+108                                                 01614000
ASCBTMCH EQU   ASCB+104                                                 01615000
ASCBNSWP EQU   ASCBFLG1                                                 01616000
ASCBTYP1 EQU   ASCBFLG1                                                 01617000
ASCBSTND EQU   ASCBFLG1                                                 01618000
ASCBABNT EQU   ASCBFLG1                                                 01619000
ASCBTERM EQU   ASCBFLG1                                                 01620000
ASCBS3S  EQU   ASCBFLG1                                                 01621000
ASCBCMSH EQU   ASCBFLG1                                                 01622000
ASCBTOFF EQU   ASCBFLG1                                                 01623000
ASCBRF01 EQU   ASCBRCTF                                                 01624000
ASCBTMLW EQU   ASCBRCTF                                                 01625000
ASCBOUT  EQU   ASCBRCTF                                                 01626000
ASCBWAIT EQU   ASCBRCTF                                                 01627000
ASCBRV08 EQU   ASCBRCTF                                                 01628000
ASCBFQU  EQU   ASCBRCTF                                                 01629000
ASCBFRS  EQU   ASCBRCTF                                                 01630000
ASCBTMNO EQU   ASCBRCTF                                                 01631000
ASCBAFFN EQU   ASCBFW1                                                  01632000
ASCBDUMP EQU   ASCB+96                                                  01633000
ASCBRV44 EQU   ASCB+92                                                  01634000
ASCBUBET EQU   ASCB+88                                                  01635000
ASCBECB  EQU   ASCB+84                                                  01636000
ASCBJSTL EQU   ASCB+80                                                  01637000
ASCBEWST EQU   ASCB+72                                                  01638000
ASCBEJST EQU   ASCB+64                                                  01639000
ASCBTSB  EQU   ASCB+60                                                  01640000
ASCBCSCB EQU   ASCB+56                                                  01641000
ASCBRSM  EQU   ASCB+52                                                  01642000
ASCBLDA  EQU   ASCB+48                                                  01643000
ASCBSTOR EQU   ASCB+44                                                  01644000
ASCBDP   EQU   ASCB+43                                                  01645000
ASCBRV07 EQU   ASCB+42                                                  01646000
ASCBIOSM EQU   ASCB+40                                                  01647000
ASCBSEQN EQU   ASCB+38                                                  01648000
ASCBCPUS EQU   ASCB+32                                                  01649000
ASCBSPL  EQU   ASCB+28                                                  01650000
ASCBIOSP EQU   ASCB+24                                                  01651000
ASCBSYNC EQU   ASCBSUPC+4                                               01652000
ASCBSVRB EQU   ASCBSUPC                                                 01653000
ASCBCMSF EQU   ASCB+12                                                  01654000
ASCBBWDP EQU   ASCB+8                                                   01655000
ASCBFWDP EQU   ASCB+4                                                   01656000
ASCBASCB EQU   ASCB                                                     01657000
ASCBEGIN EQU   ASCB                                                     01658000
@NM00089 EQU   TCBXTNT2+32                                              01659000
TCBRV181 EQU   TCBRV173                                                 01660000
TCBRV180 EQU   TCBRV173                                                 01661000
TCBRV179 EQU   TCBRV173                                                 01662000
TCBRV178 EQU   TCBRV173                                                 01663000
TCBRV177 EQU   TCBRV173                                                 01664000
TCBRV176 EQU   TCBRV173                                                 01665000
TCBRV175 EQU   TCBRV173                                                 01666000
TCBRV174 EQU   TCBRV173                                                 01667000
TCBRV172 EQU   TCBRV164                                                 01668000
TCBRV171 EQU   TCBRV164                                                 01669000
TCBRV170 EQU   TCBRV164                                                 01670000
TCBRV169 EQU   TCBRV164                                                 01671000
TCBRV168 EQU   TCBRV164                                                 01672000
TCBRV167 EQU   TCBRV164                                                 01673000
TCBRV166 EQU   TCBRV164                                                 01674000
TCBRV165 EQU   TCBRV164                                                 01675000
TCBRV163 EQU   TCBRV155                                                 01676000
TCBRV162 EQU   TCBRV155                                                 01677000
TCBRV161 EQU   TCBRV155                                                 01678000
TCBRV160 EQU   TCBRV155                                                 01679000
TCBRV159 EQU   TCBRV155                                                 01680000
TCBRV158 EQU   TCBRV155                                                 01681000
TCBRV157 EQU   TCBRV155                                                 01682000
TCBRV156 EQU   TCBRV155                                                 01683000
TCBRV154 EQU   TCBRV146                                                 01684000
TCBRV153 EQU   TCBRV146                                                 01685000
TCBRV152 EQU   TCBRV146                                                 01686000
TCBRV151 EQU   TCBRV146                                                 01687000
TCBRV150 EQU   TCBRV146                                                 01688000
TCBRV149 EQU   TCBRV146                                                 01689000
TCBRV148 EQU   TCBRV146                                                 01690000
TCBRV147 EQU   TCBRV146                                                 01691000
TCBRV145 EQU   TCBXTNT2+26                                              01692000
TCBRV144 EQU   TCBXTNT2+24                                              01693000
TCBRV143 EQU   TCBXTNT2+20                                              01694000
TCBRV142 EQU   TCBXTNT2+16                                              01695000
TCBRSV49 EQU   TCBXTNT2+12                                              01696000
TCBEVENT EQU   TCBXTNT2+8                                               01697000
TCBRCMP  EQU   TCBXTNT2+5                                               01698000
TCBRSVAB EQU   TCBXTNT2+4                                               01699000
TCBGTFA  EQU   TCBGTF+1                                                 01700000
TCBRSV47 EQU   TCBTFLG                                                  01701000
TCBRSV46 EQU   TCBTFLG                                                  01702000
TCBRSV45 EQU   TCBTFLG                                                  01703000
TCBRSV44 EQU   TCBTFLG                                                  01704000
TCBRSV43 EQU   TCBTFLG                                                  01705000
TCBDSPIT EQU   TCBTFLG                                                  01706000
TCBERRTN EQU   TCBTFLG                                                  01707000
TCBASYNC EQU   TCBTFLG                                                  01708000
@NM00088 EQU   TCB+296                                                  01709000
TCBSVCA2 EQU   TCB+292                                                  01710000
TCBSWASA EQU   TCB+288                                                  01711000
TCBDBTB  EQU   TCB+284                                                  01712000
TCBRPT   EQU   TCB+280                                                  01713000
TCBRV141 EQU   TCBRV133                                                 01714000
TCBRV140 EQU   TCBRV133                                                 01715000
TCBRV139 EQU   TCBRV133                                                 01716000
TCBRV138 EQU   TCBRV133                                                 01717000
TCBRV137 EQU   TCBRV133                                                 01718000
TCBRV136 EQU   TCBRV133                                                 01719000
TCBRV135 EQU   TCBRV133                                                 01720000
TCBRV134 EQU   TCBRV133                                                 01721000
TCBRV132 EQU   TCBRV124                                                 01722000
TCBRV131 EQU   TCBRV124                                                 01723000
TCBRV130 EQU   TCBRV124                                                 01724000
TCBRV129 EQU   TCBRV124                                                 01725000
TCBRV128 EQU   TCBRV124                                                 01726000
TCBRV127 EQU   TCBRV124                                                 01727000
TCBRV126 EQU   TCBRV124                                                 01728000
TCBRV125 EQU   TCBRV124                                                 01729000
TCBRV123 EQU   TCBFBYT2                                                 01730000
TCBRV122 EQU   TCBFBYT2                                                 01731000
TCBECBNV EQU   TCBFBYT2                                                 01732000
TCBSSSYN EQU   TCBFBYT2                                                 01733000
TCBFPRAP EQU   TCBFBYT2                                                 01734000
TCBFDW   EQU   TCBFBYT2                                                 01735000
TCBFMW   EQU   TCBFBYT2                                                 01736000
TCBCNCB  EQU   TCBFBYT2                                                 01737000
TCBLLH   EQU   TCBFBYT1                                                 01738000
TCBRV113 EQU   TCBFBYT1                                                 01739000
TCBEOT   EQU   TCBFBYT1                                                 01740000
TCBRTM2  EQU   TCBFBYT1                                                 01741000
TCBPGNLY EQU   TCBFBYT1                                                 01742000
TCBNDIOS EQU   TCBFBYT1                                                 01743000
TCBRV327 EQU   TCBFBYT1                                                 01744000
TCBEOTFM EQU   TCBFBYT1                                                 01745000
TCBAFFN  EQU   TCB+274                                                  01746000
TCBRV326 EQU   TCB+272                                                  01747000
TCBUKYSP EQU   TCB+268                                                  01748000
TCBMODE  EQU   TCBESTAE+3                                               01749000
TCBERTYP EQU   TCBESTAE+2                                               01750000
TCBRV314 EQU   TCBESTRM                                                 01751000
TCBRV313 EQU   TCBESTRM                                                 01752000
TCBRV312 EQU   TCBESTRM                                                 01753000
TCBRV311 EQU   TCBESTRM                                                 01754000
TCBRV310 EQU   TCBESTRM                                                 01755000
TCBRV309 EQU   TCBESTRM                                                 01756000
TCBRV308 EQU   TCBESTRM                                                 01757000
TCBETERM EQU   TCBESTRM                                                 01758000
TCBSCBKY EQU   TCBESTAE                                                 01759000
TCBRTM12 EQU   TCB+260                                                  01760000
TCBTCBID EQU   TCB+256                                                  01761000
TCBSTAWA EQU   TCB+252                                                  01762000
TCBSWA   EQU   TCB+248                                                  01763000
TCBFOEA  EQU   TCBFOE+1                                                 01764000
TCBRSV42 EQU   TCBFOE                                                   01765000
TCBCCPVI EQU   TCBXSCT+2                                                01766000
TCBRV325 EQU   TCBXSCT+1                                                01767000
TCBRV324 EQU   TCBXSCT1                                                 01768000
TCBRV323 EQU   TCBXSCT1                                                 01769000
TCBRV322 EQU   TCBXSCT1                                                 01770000
TCBRV321 EQU   TCBXSCT1                                                 01771000
TCBRV320 EQU   TCBXSCT1                                                 01772000
TCBRV319 EQU   TCBXSCT1                                                 01773000
TCBS3A   EQU   TCBXSCT1                                                 01774000
TCBACTIV EQU   TCBXSCT1                                                 01775000
TCBRSV41 EQU   TCB+239                                                  01776000
TCBTID   EQU   TCB+238                                                  01777000
TCBRSVAA EQU   TCB+237                                                  01778000
TCBABCUR EQU   TCB+236                                                  01779000
TCBTMSAV EQU   TCB+232                                                  01780000
TCBIOTIM EQU   TCB+228                                                  01781000
TCBRTWA  EQU   TCB+224                                                  01782000
TCBBACK  EQU   TCB+220                                                  01783000
TCBTIRB  EQU   TCB+216                                                  01784000
TCBAECB  EQU   TCB+212                                                  01785000
TCBEXT2A EQU   TCBEXT2+1                                                01786000
TCBRSV39 EQU   TCBEXT2                                                  01787000
TCBSTMCT EQU   TCB+207                                                  01788000
TCBSYSCT EQU   TCB+206                                                  01789000
TCBRSV37 EQU   TCB+205                                                  01790000
TCBEXSVC EQU   TCBDAR                                                   01791000
TCBDARMS EQU   TCBDAR                                                   01792000
TCBDARWT EQU   TCBDAR                                                   01793000
TCBDARO  EQU   TCBDAR                                                   01794000
TCBDARMC EQU   TCBDARC                                                  01795000
TCBDARD  EQU   TCBDAR                                                   01796000
TCBDARS  EQU   TCBDAR                                                   01797000
TCBDARP  EQU   TCBDAR                                                   01798000
TCBGTOFM EQU   TCBFLGS7                                                 01799000
TCBADMP  EQU   TCBFLGS7                                                 01800000
TCBRSTSK EQU   TCBFLGS7                                                 01801000
TCBSVCS  EQU   TCBFLGS7                                                 01802000
TCBSTACK EQU   TCBFLGS7                                                 01803000
TCBRSV34 EQU   TCBFLGS7                                                 01804000
TCBRSV33 EQU   TCBFLGS7                                                 01805000
TCBGPECB EQU   TCBFLGS7                                                 01806000
TCBNTJS  EQU   TCBFLGS6                                                 01807000
TCBAPG   EQU   TCBFLGS6                                                 01808000
TCBMIGR  EQU   TCBFLGS6                                                 01809000
TCBRV303 EQU   TCBFLGS6                                                 01810000
TCBSPVLK EQU   TCBFLGS6                                                 01811000
TCBCPU   EQU   TCBFLGS6                                                 01812000
TCBPIE17 EQU   TCBFLGS6                                                 01813000
TCBRV    EQU   TCBFLGS6                                                 01814000
TCBRSV79 EQU   TCBNDSP5                                                 01815000
TCBRSV78 EQU   TCBNDSP5                                                 01816000
TCBRSV77 EQU   TCBNDSP5                                                 01817000
TCBRSV76 EQU   TCBNDSP5                                                 01818000
TCBRSV75 EQU   TCBNDSP5                                                 01819000
TCBRSV74 EQU   TCBNDSP5                                                 01820000
TCBRSV95 EQU   TCBNDSP5                                                 01821000
TCBRSV94 EQU   TCBNDSP5                                                 01822000
TCBRSV93 EQU   TCBNDSP4                                                 01823000
TCBRSV92 EQU   TCBNDSP4                                                 01824000
TCBRSV91 EQU   TCBNDSP4                                                 01825000
TCBRSV90 EQU   TCBNDSP4                                                 01826000
TCBRSV89 EQU   TCBNDSP4                                                 01827000
TCBRSV88 EQU   TCBNDSP4                                                 01828000
TCBRSV87 EQU   TCBNDSP4                                                 01829000
TCBRSV86 EQU   TCBNDSP4                                                 01830000
TCBEXT1A EQU   TCBEXT1+1                                                01831000
TCBRSV32 EQU   TCBEXT1                                                  01832000
TCBEXCPD EQU   TCB+192                                                  01833000
TCBIOBRC EQU   TCB+188                                                  01834000
TCBDDWTC EQU   TCB+186                                                  01835000
TCBDDEXC EQU   TCB+184                                                  01836000
TCBJSCBB EQU   TCBJSCB+1                                                01837000
@NM00087 EQU   TCBRECDE                                                 01838000
TCBREC   EQU   TCBRECDE                                                 01839000
TCBMDIDS EQU   TCB+176                                                  01840000
TCBNDINT EQU   TCBNDSP3                                                 01841000
TCBRSV27 EQU   TCBNDSP3                                                 01842000
TCBRSV26 EQU   TCBNDSP3                                                 01843000
TCBRSV25 EQU   TCBNDSP3                                                 01844000
TCBRSV24 EQU   TCBNDSP3                                                 01845000
TCBSRBND EQU   TCBNDSP3                                                 01846000
TCBRV302 EQU   TCBNDSP3                                                 01847000
TCBLJSND EQU   TCBNDSP3                                                 01848000
TCBABE   EQU   TCBNDSP2                                                 01849000
TCBDSS   EQU   TCBNDSP2                                                 01850000
TCBOWAIT EQU   TCBNDSP2                                                 01851000
TCBIWAIT EQU   TCBNDSP2                                                 01852000
TCBNDTS  EQU   TCBNDSP2                                                 01853000
TCBNDSVC EQU   TCBNDSP2                                                 01854000
TCBSTPP  EQU   TCBNDSP2                                                 01855000
TCBABD   EQU   TCBNDSP2                                                 01856000
TCBRSV22 EQU   TCBNDSP1                                                 01857000
TCBPIEND EQU   TCBNDSP1                                                 01858000
TCBTPSP  EQU   TCBNDSP1                                                 01859000
TCBDDRND EQU   TCBNDSP1                                                 01860000
TCBRSPND EQU   TCBNDSP1                                                 01861000
TCBRSTND EQU   TCBNDSP1                                                 01862000
TCBDARPN EQU   TCBNDSP1                                                 01863000
TCBDARTN EQU   TCBNDSP1                                                 01864000
TCBNDSP0 EQU   TCBNDSP                                                  01865000
TCBUSER  EQU   TCB+168                                                  01866000
TCBTCTB  EQU   TCBTCT+1                                                 01867000
TCBRSV9C EQU   TCBTCTGF                                                 01868000
TCBRSV9B EQU   TCBTCTGF                                                 01869000
TCBRSV9A EQU   TCBTCTGF                                                 01870000
TCBRSV99 EQU   TCBTCTGF                                                 01871000
TCBRSV98 EQU   TCBTCTGF                                                 01872000
TCBRSV97 EQU   TCBTCTGF                                                 01873000
TCBRSV20 EQU   TCBTCTGF                                                 01874000
TCBSMFGF EQU   TCBTCTGF                                                 01875000
TCBSTCUR EQU   TCBNSTAE                                                 01876000
TCBRV301 EQU   TCBNSTAE                                                 01877000
TCBSYNCH EQU   TCBNSTAE                                                 01878000
TCBHALT  EQU   TCBNSTAE                                                 01879000
TCBPPSUP EQU   TCBNSTAE                                                 01880000
TCB33E   EQU   TCBNSTAE                                                 01881000
TCBQUIES EQU   TCBNSTAE                                                 01882000
TCBSTABE EQU   TCBNSTAE                                                 01883000
TCBAQE   EQU   TCB+156                                                  01884000
TCBPQE   EQU   TCB+152                                                  01885000
TCBTSDP  EQU   TCB+151                                                  01886000
TCBTSLP  EQU   TCB+150                                                  01887000
TCBSTPCT EQU   TCB+149                                                  01888000
TCBCPUBN EQU   TCBTSFLG                                                 01889000
TCBDYDSP EQU   TCBTSFLG                                                 01890000
TCBRSV18 EQU   TCBTSFLG                                                 01891000
TCBRSV17 EQU   TCBTSFLG                                                 01892000
TCBTIOTG EQU   TCBTSFLG                                                 01893000
TCBATT   EQU   TCBTSFLG                                                 01894000
TCBSTPPR EQU   TCBTSFLG                                                 01895000
TCBRV300 EQU   TCBTSTSK                                                 01896000
TCBECB   EQU   TCB+144                                                  01897000
TCBIQE   EQU   TCB+140                                                  01898000
TCBLTC   EQU   TCB+136                                                  01899000
TCBOTC   EQU   TCB+132                                                  01900000
TCBNTC   EQU   TCB+128                                                  01901000
TCBJSTCA EQU   TCBJSTCB+1                                               01902000
TCBRSV16 EQU   TCBJSTCB                                                 01903000
TCBTQET  EQU   TCBTME                                                   01904000
TCBTCB   EQU   TCB+116                                                  01905000
TCBFSAB  EQU   TCBFSA+1                                                 01906000
TCBQEL   EQU   TCBFSA                                                   01907000
TCBGRS15 EQU   TCBGRS+60                                                01908000
TCBGRS14 EQU   TCBGRS+56                                                01909000
TCBGRS13 EQU   TCBGRS+52                                                01910000
TCBGRS12 EQU   TCBGRS+48                                                01911000
TCBGRS11 EQU   TCBGRS+44                                                01912000
TCBGRS10 EQU   TCBGRS+40                                                01913000
TCBGRS9  EQU   TCBGRS+36                                                01914000
TCBGRS8  EQU   TCBGRS+32                                                01915000
TCBGRS7  EQU   TCBGRS+28                                                01916000
TCBGRS6  EQU   TCBGRS+24                                                01917000
TCBGRS5  EQU   TCBGRS+20                                                01918000
TCBGRS4  EQU   TCBGRS+16                                                01919000
TCBGRS3  EQU   TCBGRS+12                                                01920000
TCBGRS2  EQU   TCBGRS+8                                                 01921000
TCBGRS1  EQU   TCBGRS+4                                                 01922000
TCBGRS0  EQU   TCBGRS                                                   01923000
TCBJPQB  EQU   TCBJPQ+1                                                 01924000
TCBRSV15 EQU   TCBPURGE                                                 01925000
TCBRSV14 EQU   TCBPURGE                                                 01926000
TCBRSV13 EQU   TCBPURGE                                                 01927000
TCBRSV12 EQU   TCBPURGE                                                 01928000
TCBRSV11 EQU   TCBPURGE                                                 01929000
TCBRSV10 EQU   TCBPURGE                                                 01930000
TCBRSV09 EQU   TCBPURGE                                                 01931000
TCBJPQF  EQU   TCBPURGE                                                 01932000
TCBJLB   EQU   TCB+40                                                   01933000
TCBLLS   EQU   TCB+36                                                   01934000
TCBDSP   EQU   TCB+35                                                   01935000
TCBLMP   EQU   TCB+34                                                   01936000
TCBPNDSP EQU   TCBFLGS5                                                 01937000
TCBFCD1  EQU   TCBFLGS5                                                 01938000
TCBSTP   EQU   TCBFLGS5                                                 01939000
TCBSYS   EQU   TCBFLGS5                                                 01940000
TCBANDSP EQU   TCBFLGS5                                                 01941000
TCBPAGE  EQU   TCBFLGS5                                                 01942000
TCBUXNDF EQU   TCBABWF                                                  01943000
TCBFC    EQU   TCBFLGS5                                                 01944000
TCBONDSP EQU   TCBFLGS4                                                 01945000
TCBMPCND EQU   TCBFLGS4                                                 01946000
TCBMPCVQ EQU   TCBFLGS4                                                 01947000
TCBUXNDV EQU   TCBFLGS4                                                 01948000
TCBHNDSP EQU   TCBFLGS4                                                 01949000
TCBRQENA EQU   TCBFLGS4                                                 01950000
TCBSER   EQU   TCBFLGS4                                                 01951000
TCBNDUMP EQU   TCBFLGS4                                                 01952000
TCBDWSTA EQU   TCBFLGS3                                                 01953000
TCBRSV08 EQU   TCBFLGS3                                                 01954000
TCBRSV07 EQU   TCBFLGS3                                                 01955000
TCBRSV06 EQU   TCBFLGS3                                                 01956000
TCBABGM  EQU   TCBFLGS3                                                 01957000
TCBABTRM EQU   TCBFLGS3                                                 01958000
TCBADINP EQU   TCBFLGS3                                                 01959000
TCBFSM   EQU   TCBFLGS3                                                 01960000
TCBFTS   EQU   TCBFLGS2                                                 01961000
TCBFETXR EQU   TCBFLGS2                                                 01962000
TCBFDSOP EQU   TCBFLGS2                                                 01963000
TCBFJMC  EQU   TCBFLGS2                                                 01964000
TCBFSMC  EQU   TCBFLGS2                                                 01965000
TCBFABOP EQU   TCBFLGS2                                                 01966000
TCBFSTI  EQU   TCBFLGS2                                                 01967000
TCBFOINP EQU   TCBFLGS2                                                 01968000
TCBFX    EQU   TCBFLGS1                                                 01969000
TCBFS    EQU   TCBFLGS1                                                 01970000
TCBFT    EQU   TCBFLGS1                                                 01971000
TCBPDUMP EQU   TCBFLGS1                                                 01972000
TCBNONPR EQU   TCBFLGS1                                                 01973000
TCBFERA  EQU   TCBFLGS1                                                 01974000
TCBFE    EQU   TCBFLGS1                                                 01975000
TCBFA    EQU   TCBFLGS1                                                 01976000
TCBZERO  EQU   TCBPKF                                                   01977000
TCBFLAG  EQU   TCBPKF                                                   01978000
TCBMSSB  EQU   TCBMSS+1                                                 01979000
TCBRSV03 EQU   TCBMSS                                                   01980000
TCBTRNB  EQU   TCBTRN+1                                                 01981000
TCBRSV02 EQU   TCBABF                                                   01982000
TCBOLTEP EQU   TCBABF                                                   01983000
TCBTCP   EQU   TCBABF                                                   01984000
TCBTCPP  EQU   TCBABF                                                   01985000
TCBRSV01 EQU   TCBABF                                                   01986000
TCBGRPH  EQU   TCBABF                                                   01987000
TCBNOCHK EQU   TCBABF                                                   01988000
TCBMOD91 EQU   TCBABF                                                   01989000
TCBCMPC  EQU   TCBCMP+1                                                 01990000
TCBRV318 EQU   TCBCMSG                                                  01991000
TCBRV317 EQU   TCBCIND                                                  01992000
TCBRV316 EQU   TCBCWTO                                                  01993000
TCBCASID EQU   TCBCDBL                                                  01994000
TCBNOCC  EQU   TCBSTCC                                                  01995000
TCBDMPO  EQU   TCBCPP                                                   01996000
TCBCSTEP EQU   TCBCMPF                                                  01997000
TCBCREQ  EQU   TCBCMPF                                                  01998000
TCBTIO   EQU   TCB+12                                                   01999000
TCBDEB   EQU   TCB+8                                                    02000000
TCBPIEA  EQU   TCBPIE+1                                                 02001000
TCBPM    EQU   TCBPMASK                                                 02002000
@NM00086 EQU   TCBPMASK                                                 02003000
TCBRBP   EQU   TCB                                                      02004000
TCBFRS6  EQU   TCBFRS+24                                                02005000
TCBFRS4  EQU   TCBFRS+16                                                02006000
TCBFRS2  EQU   TCBFRS+8                                                 02007000
TCBFRS0  EQU   TCBFRS                                                   02008000
ACTACCNT EQU   IEFAACTB+32                                              02009000
ACTJNFLD EQU   IEFAACTB+31                                              02010000
ACTJTIME EQU   IEFAACTB+28                                              02011000
ACTPRGNM EQU   IEFAACTB+8                                               02012000
@NM00085 EQU   IEFAACTB+7                                               02013000
ACTNEXT  EQU   IEFAACTB+4                                               02014000
ACTIDENT EQU   IEFAACTB+3                                               02015000
ACTDSKAD EQU   IEFAACTB                                                 02016000
@NM00084 EQU   INJMJCT+175                                              02017000
JCTVULDP EQU   INJMJCT+172                                              02018000
JCTACODE EQU   INJMJCT+168                                              02019000
JCTPRFMF EQU   INJMJCT+167                                              02020000
JCTUSER  EQU   INJMJCT+160                                              02021000
JCTSSD   EQU   INJMJCT+157                                              02022000
@NM00083 EQU   INJMJCT+156                                              02023000
JCTSRBT  EQU   INJMJCT+152                                              02024000
JCTJMRJD EQU   INJMJCT+149                                              02025000
JCTJMRJT EQU   INJMJCT+146                                              02026000
JCTJMRSS EQU   INJMJCT+143                                              02027000
JCTJMRTL EQU   INJMJCT+140                                              02028000
JCTJMRCL EQU   INJMJCT+139                                              02029000
JCTJMROP EQU   INJMJCT+138                                              02030000
JCTJMRD  EQU   INJMJCT+137                                              02031000
JCTJMR   EQU   INJMJCT+134                                              02032000
JCTCKIDT EQU   INJMJCT+118                                              02033000
JCTCKIDL EQU   INJMJCT+117                                              02034000
@NM00082 EQU   JCTSTAT2                                                 02035000
JCTBLP   EQU   JCTSTAT2                                                 02036000
JCTPERFM EQU   JCTSTAT2                                                 02037000
JCTSWSM  EQU   JCTSTAT2                                                 02038000
JCTENDIT EQU   JCTSTAT2                                                 02039000
JCTADSPC EQU   JCTSTAT2                                                 02040000
JCTSPSYS EQU   JCTSTAT2                                                 02041000
@NM00081 EQU   INJMJCT+115                                              02042000
JCTSSTR  EQU   INJMJCT+112                                              02043000
JCTJSBTM EQU   JCTJSB                                                   02044000
JCTJSBEX EQU   JCTJSB                                                   02045000
JCTJSBAL EQU   JCTJSB                                                   02046000
JCTJSBIN EQU   JCTJSB                                                   02047000
@NM00080 EQU   JCTJSB                                                   02048000
JCTVOLSQ EQU   INJMJCT+110                                              02049000
JCTNRCKP EQU   INJMJCT+108                                              02050000
JCTNTRK  EQU   INJMJCT+107                                              02051000
JCTCKTTR EQU   INJMJCT+104                                              02052000
JCTDEVT  EQU   INJMJCT+100                                              02053000
@NM00079 EQU   INJMJCT+99                                               02054000
JCTSTIOT EQU   INJMJCT+96                                               02055000
JCTSNUMB EQU   INJMJCT+95                                               02056000
JCTQIDNT EQU   INJMJCT+94                                               02057000
JCTEQREG EQU   INJMJCT+92                                               02058000
@NM00078 EQU   INJMJCT+91                                               02059000
JCTDETDA EQU   INJMJCT+88                                               02060000
JCTDSDRA EQU   JCTRSW2                                                  02061000
JCTDSOJB EQU   JCTRSW2                                                  02062000
JCTDSOCR EQU   JCTRSW2                                                  02063000
JCTRESTT EQU   JCTRSW2                                                  02064000
JCTNOCKP EQU   JCTRSW2                                                  02065000
JCTNORST EQU   JCTRSW2                                                  02066000
JCTNARST EQU   JCTRSW2                                                  02067000
JCTSYSCK EQU   JCTRSW2                                                  02068000
@NM00077 EQU   JCTRSW1                                                  02069000
JCTSTEPR EQU   JCTRSW1                                                  02070000
JCTCKPTR EQU   JCTRSW1                                                  02071000
JCTCKFT  EQU   JCTRSW1                                                  02072000
JCTCONTR EQU   JCTRSW1                                                  02073000
JCTSTERM EQU   JCTRSW1                                                  02074000
JCTWARMS EQU   JCTRSW1                                                  02075000
@NM00076 EQU   JCTCCODE+3                                               02076000
JCTJDPOP EQU   JCTCCODE+2                                               02077000
JCTJDPCD EQU   JCTCCODE                                                 02078000
@NM00075 EQU   INJMJCT+53                                               02079000
JCTSCT   EQU   INJMJCT+52                                               02080000
JCTSMRBA EQU   INJMJCT+44                                               02081000
@NM00074 EQU   INJMJCT+43                                               02082000
JCTACTAD EQU   INJMJCT+40                                               02083000
@NM00073 EQU   INJMJCT+39                                               02084000
JCTJCTX  EQU   INJMJCT+36                                               02085000
@NM00072 EQU   INJMJCT+35                                               02086000
JCTSDKAD EQU   INJMJCT+32                                               02087000
JCTJCSMF EQU   INJMJCT+31                                               02088000
JCTGDGNT EQU   INJMJCT+28                                               02089000
@NM00071 EQU   INJMJCT+27                                               02090000
JCTPDIP  EQU   INJMJCT+24                                               02091000
JCTJTPTN EQU   INJMJCT+16                                               02092000
JCTJNAME EQU   INJMJCT+8                                                02093000
JCTJPRTY EQU   JCTJBYTE                                                 02094000
INCMMGL1 EQU   JCTJMGLV                                                 02095000
INCMMGL2 EQU   JCTJMGLV                                                 02096000
@NM00070 EQU   JCTJMGLV                                                 02097000
INCMALL  EQU   JCTJMGLV                                                 02098000
JCTJMGPO EQU   INJMJCT+6                                                02099000
INCMNSET EQU   JCTJSTAT                                                 02100000
INCMCAT  EQU   INDMCTLG                                                 02101000
INCMSTS  EQU   JCTJSTAT                                                 02102000
JCTABEND EQU   JCTJSTAT                                                 02103000
@NM00069 EQU   JCTJSTAT                                                 02104000
JCTJSTPC EQU   JCTJSTAT                                                 02105000
@NM00068 EQU   JCTJSTAT                                                 02106000
JCTJBLBS EQU   JCTJSTAT                                                 02107000
JCTJSRNO EQU   INJMJCT+4                                                02108000
JCTIDENT EQU   INJMJCT+3                                                02109000
JCTDSKAD EQU   INJMJCT                                                  02110000
SIODDSNL EQU   INDMSIOT+173                                             02111000
SIOVDSNL EQU   INDMSIOT+172                                             02112000
SIOVDSNT EQU   INDMSIOT+170                                             02113000
SVOLUNNO EQU   INDMSIOT+168                                             02114000
SIOTVMVP EQU   INDMSIOT+164                                             02115000
SIOTJFX  EQU   INDMSIOT+160                                             02116000
SJFCBPTR EQU   INDMSIOT+156                                             02117000
SIOTNPTR EQU   INDMSIOT+152                                             02118000
SIOTETIO EQU   INDMSIOT+148                                             02119000
SIOTATE  EQU   INDMSIOT+144                                             02120000
SVOLUNAD EQU   INDMSIOT+140                                             02121000
SIOTEDLP EQU   INDMSIOT+136                                             02122000
SIOTEDLS EQU   INDMSIOT+132                                             02123000
SCTANAME EQU   INDMSIOT+122                                             02124000
SIOTSSIC EQU   INDMSIOT+120                                             02125000
@NM00067 EQU   INDMSIOT+108                                             02126000
SIOTSSNM EQU   INDMSIOT+104                                             02127000
SIODDQCR EQU   SIOTBYT2                                                 02128000
SIOVDQCR EQU   SIOTBYT2                                                 02129000
SIOTCVOL EQU   SIOTBYT2                                                 02130000
SIOTCNEW EQU   SIOTBYT2                                                 02131000
SIOTCALC EQU   SIOTBYT2                                                 02132000
SIOTGALL EQU   SIOTBYT2                                                 02133000
SIOTDSPD EQU   SIOTBYT2                                                 02134000
SIOTDMND EQU   SIOTBYT2                                                 02135000
SIOTOPUC EQU   INDMSIOT+99                                              02136000
SIOTOUTR EQU   INDMSIOT+97                                              02137000
SIOTOUTC EQU   INDMSIOT+96                                              02138000
SIOTSSWA EQU   INDMSIOT+93                                              02139000
SIOTAUNC EQU   SIOTALTD                                                 02140000
SIOTACAT EQU   SIOTALTD                                                 02141000
SIOTADEL EQU   SIOTALTD                                                 02142000
SIOTAKEP EQU   SIOTALTD                                                 02143000
SIOTNPRV EQU   SIOTALTD                                                 02144000
SIOJCATS EQU   SIOTALTD                                                 02145000
@NM00066 EQU   SIOTALTD                                                 02146000
@NM00065 EQU   SIOTALTD                                                 02147000
@NM00064 EQU   INDMSIOT+91                                              02148000
SIOTNDSB EQU   INDMSIOT+88                                              02149000
@NM00063 EQU   INDMSIOT+84                                              02150000
SIOTDPCD EQU   INDMSIOT+82                                              02151000
@NM00062 EQU   SIOTBYT4                                                 02152000
SIOTRACT EQU   SIOTBYT4                                                 02153000
SIOTRACD EQU   SIOTBYT4                                                 02154000
SIOTPROT EQU   SIOTBYT4                                                 02155000
SCTOUTPN EQU   INDMSIOT+80                                              02156000
SCTOUTNO EQU   INDMSIOT+76                                              02157000
SCTOUTNM EQU   INDMSIOT+68                                              02158000
SIOUCBAD EQU   SCTUTYPE+5                                               02159000
SIOUCNVT EQU   SCTUTYPE+4                                               02160000
SIOUBYT4 EQU   SIOTDEVT+3                                               02161000
@NM00061 EQU   SIOUBYT3                                                 02162000
SIO3UREC EQU   SIOUBYT3                                                 02163000
SIO3DISP EQU   SIOUBYT3                                                 02164000
SIO3DACC EQU   SIOUBYT3                                                 02165000
SIO3COMM EQU   SIOUBYT3                                                 02166000
SIO3TAPE EQU   SIOUBYT3                                                 02167000
SIOUBYT2 EQU   SIOTDEVT+1                                               02168000
SIOUBYT1 EQU   SIOTDEVT                                                 02169000
SIOTOMN  EQU   SCTSBYT4                                                 02170000
SIOTIPDI EQU   SCTSBYT4                                                 02171000
SIOTVAFF EQU   SCTSBYT4                                                 02172000
SIOTSTEP EQU   SCTSBYT4                                                 02173000
SIOTASCI EQU   SCTSBYT4                                                 02174000
@NM00060 EQU   SCTSBYT4                                                 02175000
SIOTGDGA EQU   SCTSBYT4                                                 02176000
SCTSGDGS EQU   SCTSBYT4                                                 02177000
SCTSOLD  EQU   SCTSBYT3                                                 02178000
SCTSMOD  EQU   SCTSBYT3                                                 02179000
SCTSNEW  EQU   SCTSBYT3                                                 02180000
SCTSYSOU EQU   SCTSBYT3                                                 02181000
SCTVREF  EQU   SCTSBYT3                                                 02182000
SCTALCHK EQU   SCTSBYT3                                                 02183000
SCTSYSNE EQU   SCTSBYT3                                                 02184000
SCTDSNRF EQU   SCTSBYT3                                                 02185000
SCTRECVD EQU   SCTSBYT2                                                 02186000
SCTDEFER EQU   SCTSBYT2                                                 02187000
SCTLABEL EQU   SCTSBYT2                                                 02188000
SCTUNLBD EQU   SCTSBYT2                                                 02189000
SCTJOBLB EQU   SCTSBYT2                                                 02190000
SCTVOLAF EQU   SCTSBYT2                                                 02191000
SIOTCATL EQU   SCTSBYT2                                                 02192000
SIOCLUNL EQU   SCTSBYT2                                                 02193000
SIOTJSCT EQU   SCTSBYT1                                                 02194000
SCTUNAFF EQU   SCTSBYT1                                                 02195000
SCTPARLM EQU   SCTSBYT1                                                 02196000
SIOTQDSN EQU   SCTSBYT1                                                 02197000
SIOTGDSN EQU   SCTSBYT1                                                 02198000
SIOTCCAT EQU   SCTSBYT1                                                 02199000
SCTSYSIN EQU   SCTSBYT1                                                 02200000
SCTDUMMY EQU   SCTSBYT1                                                 02201000
SIOTUNCT EQU   SCTSDISP                                                 02202000
SIOTCTLG EQU   SCTSDISP                                                 02203000
SIOTDLET EQU   SCTSDISP                                                 02204000
SIOTKEEP EQU   SCTSDISP                                                 02205000
SIOTPASS EQU   SCTSDISP                                                 02206000
SIOTPRIV EQU   SCTSDISP                                                 02207000
S3400DSP EQU   SCTSDISP                                                 02208000
SIOTRETN EQU   SCTSDISP                                                 02209000
SIOTVLCT EQU   INDMSIOT+54                                              02210000
SCTNMBUT EQU   INDMSIOT+53                                              02211000
SIOTRTRY EQU   SIOTBYT0                                                 02212000
SIOTPUPV EQU   SIOTBYT0                                                 02213000
SIOTNOPV EQU   SIOTBYT0                                                 02214000
SIOTGIGN EQU   SIOTBYT0                                                 02215000
SPVTAMSG EQU   SIOTBYT0                                                 02216000
SIOTFUDA EQU   SIOTBYT0                                                 02217000
SIOTDYAL EQU   SIOTBYT0                                                 02218000
SIOTSSDS EQU   SIOTBYT0                                                 02219000
SIOTGIID EQU   INDMSIOT+50                                              02220000
SCTVOLCT EQU   INDMSIOT+49                                              02221000
SCTSPOOL EQU   INDMSIOT+48                                              02222000
SIOTQNAM EQU   SIOTTSTC                                                 02223000
SIOTDSNM EQU   SIOTTSTC                                                 02224000
SIOTTRKM EQU   SIOTTSTC                                                 02225000
SIOTSSMG EQU   SIOTTSTC                                                 02226000
SIOTSSGP EQU   SIOTTSTC                                                 02227000
@NM00059 EQU   SIOTTSTC                                                 02228000
SIOTTERM EQU   SIOTTSTC                                                 02229000
SIOTINFC EQU   SIOTTSTC                                                 02230000
@NM00058 EQU   SIOTBYT3                                                 02231000
SIOTJES3 EQU   SIOTBYT3                                                 02232000
SIOCDEVT EQU   SIOTBYT3                                                 02233000
SIOALIAS EQU   SIOTBYT3                                                 02234000
SCTDDINO EQU   INDMSIOT+44                                              02235000
SIOTDDNT EQU   SIOTBYT1                                                 02236000
SIOTALCD EQU   SIOTBYT1                                                 02237000
SIODADSM EQU   SIOTBYT1                                                 02238000
SIOTDADR EQU   SIOTBYT1                                                 02239000
SIODUNAL EQU   SIOTBYT1                                                 02240000
SIOVAMDS EQU   SIOTBYT1                                                 02241000
SIOTHOLD EQU   SIOTBYT1                                                 02242000
SIOTOCKP EQU   SIOTBYT1                                                 02243000
SIOPSCNT EQU   INDMSIOT+42                                              02244000
SIOTREFN EQU   INDMSIOT+40                                              02245000
SIOTOTUN EQU   INDMSIOT+39                                              02246000
SIOTVRSB EQU   INDMSIOT+36                                              02247000
@NM00057 EQU   INDMSIOT+35                                              02248000
SCTPJFCB EQU   INDMSIOT+32                                              02249000
@NM00056 EQU   INDMSIOT+31                                              02250000
SCTPSIOT EQU   INDMSIOT+28                                              02251000
SIOTAFID EQU   INDMSIOT+26                                              02252000
SIOTVLSP EQU   INDMSIOT+24                                              02253000
SIODSNTE EQU   INDMSIOT+22                                              02254000
SIOTUNAF EQU   SCTUSADD                                                 02255000
SIOTDEST EQU   INDMSIOT+12                                              02256000
SCTDDNAM EQU   INDMSIOT+4                                               02257000
SIOTTYPE EQU   INDMSIOT+3                                               02258000
SIOTDSKA EQU   INDMSIOT                                                 02259000
@NM00055 EQU   @NM00053+1                                               02260000
SCTONLY  EQU   SCTABCND                                                 02261000
SCTEVEN  EQU   SCTABCND                                                 02262000
SCTABEND EQU   SCTABCND                                                 02263000
SCTONLYC EQU   SCTABCND                                                 02264000
SCTABCAN EQU   SCTABCND                                                 02265000
@NM00054 EQU   SCTABCND                                                 02266000
@NM00052 EQU   INSMSCT+173                                              02267000
@NM00051 EQU   SCTSTEND                                                 02268000
SCTSYSCK EQU   SCTSTEND                                                 02269000
SCTSTPND EQU   SCTSTEND                                                 02270000
SCTSTSRT EQU   SCTSTEND                                                 02271000
@NM00050 EQU   INSMSCT+168                                              02272000
SCTCATCT EQU   INSMSCT+166                                              02273000
SCTSDPSA EQU   SCTCDENT+3                                               02274000
SCTSDPOP EQU   SCTCDENT+2                                               02275000
SCTSDPCD EQU   SCTCDENT                                                 02276000
@NM00049 EQU   INSMSCT+117                                              02277000
SCTPRFMF EQU   INSMSCT+116                                              02278000
SCTPGMNM EQU   INSMSCT+108                                              02279000
SCTTIOT  EQU   INSMSCT+105                                              02280000
@NM00048 EQU   SCTBCT                                                   02281000
SCTJBEND EQU   SCTBCT                                                   02282000
SCTSPSYS EQU   SCTBCT                                                   02283000
SCTSTPLB EQU   SCTBCT                                                   02284000
@NM00047 EQU   SCTBCT                                                   02285000
SCTMCVOL EQU   SCTBCT                                                   02286000
@NM00046 EQU   SCTBCT                                                   02287000
SCTGOTTR EQU   INSMSCT+100                                              02288000
SCTSMF   EQU   INSMSCT+96                                               02289000
@NM00045 EQU   SCTSDPTY+1                                               02290000
SCTSDP   EQU   SCTSDPTY                                                 02291000
SCTFSTEP EQU   SCTSDPTY                                                 02292000
@NM00044 EQU   SCTSDPTY                                                 02293000
@NM00043 EQU   SCTSDPTY                                                 02294000
SCTNIUSL EQU   INSMSCT+92                                               02295000
@NM00042 EQU   INSMSCT+90                                               02296000
SCTMSSZE EQU   INSMSCT+88                                               02297000
SCTPCAT  EQU   INSMSCT+84                                               02298000
SCTLDSTB EQU   INSMSCT+80                                               02299000
SCTSRBT  EQU   INSMSCT+76                                               02300000
SCTMSADR EQU   INSMSCT+72                                               02301000
@NM00041 EQU   INSMSCT+71                                               02302000
SCTXBTTR EQU   INSMSCT+68                                               02303000
SCTJSCAT EQU   SCTSTYPE                                                 02304000
SCTINITB EQU   SCTSTYPE                                                 02305000
SCTSJFHK EQU   SCTSTYPE                                                 02306000
SCTOUTMC EQU   SCTSTYPE                                                 02307000
SCTINPUT EQU   SCTSTYPE                                                 02308000
SCTGOSTP EQU   SCTSTYPE                                                 02309000
@NM00040 EQU   INSMSCT+66                                               02310000
SCTNSMSG EQU   INSMSCT+65                                               02311000
SCTSNUMB EQU   INSMSCT+64                                               02312000
@NM00039 EQU   INSMSCT+62                                               02313000
SCTRPACT EQU   INSMSCT+60                                               02314000
SCTSNAME EQU   INSMSCT+52                                               02315000
SCTSCLPC EQU   INSMSCT+44                                               02316000
@NM00038 EQU   INSMSCT+43                                               02317000
SCTADSTB EQU   INSMSCT+40                                               02318000
@NM00037 EQU   INSMSCT+36                                               02319000
@NM00036 EQU   INSMSCT+35                                               02320000
SCTAFACT EQU   INSMSCT+32                                               02321000
SCTDDNT  EQU   INSMSCT+28                                               02322000
@NM00035 EQU   INSMSCT+27                                               02323000
SCTLSIOT EQU   INSMSCT+24                                               02324000
@NM00034 EQU   INSMSCT+23                                               02325000
SCTANSCT EQU   INSMSCT+20                                               02326000
@NM00033 EQU   INSMSCT+19                                               02327000
SCTAALOC EQU   INSMSCT+16                                               02328000
@NM00032 EQU   INSMSCT+15                                               02329000
SCTFSIOT EQU   INSMSCT+12                                               02330000
SCTLALOC EQU   INSMSCT+10                                               02331000
SCTSEXEC EQU   INSMSCT+8                                                02332000
SCTSTIME EQU   INSMSCT+5                                                02333000
INCMSSTS EQU   SCTSSTAT                                                 02334000
SCTGRPH  EQU   SCTSSTAT                                                 02335000
SCTKEY0  EQU   SCTSSTAT                                                 02336000
SCTDORST EQU   SCTSSTAT                                                 02337000
SCTNOCKP EQU   SCTSSTAT                                                 02338000
SCTNORST EQU   SCTSSTAT                                                 02339000
EACAUSER EQU   SCTSSTAT                                                 02340000
EAADDRBT EQU   SCTSSTAT                                                 02341000
SCTTBLID EQU   INSMSCT+3                                                02342000
SCTDISKA EQU   INSMSCT                                                  02343000
SWCHNPTR EQU   SWAEPA+12                                                02344000
SWLNGTH  EQU   SWAEPA+8                                                 02345000
SWBLKID  EQU   SWVAFW+3                                                 02346000
SWVA     EQU   SWVAFW                                                   02347000
SWBLKPTR EQU   SWAEPA                                                   02348000
CTGWAGB  EQU   CTGWA+12                                                 02349000
CTGWAGCT EQU   CTGWA+10                                                 02350000
CTGWAUCT EQU   CTGWA+8                                                  02351000
CTGWAVCT EQU   CTGWA+6                                                  02352000
CTGFIELD EQU   CTGPL+28                                                 02353000
CTGPSWD  EQU   CTGJSCB                                                  02354000
@NM00030 EQU   CTGFBFLG                                                 02355000
CTGNGDSN EQU   CTGFBFLG                                                 02356000
CTGGDGB  EQU   CTGFBFLG                                                 02357000
CTGKEEP  EQU   CTGFBFLG                                                 02358000
CTGPAR   EQU   CTGFBFLG                                                 02359000
CTGFDBK  EQU   CTGNEWNM                                                 02360000
CTGNOFLD EQU   CTGPL+19                                                 02361000
CTGTYPE  EQU   CTGPL+18                                                 02362000
@NM00029 EQU   CTGDSORG                                                 02363000
CTGOPTNS EQU   CTGDSORG                                                 02364000
CTGCVOL  EQU   CTGCAT                                                   02365000
CTGFVT   EQU   CTGENT                                                   02366000
@NM00028 EQU   CTGOPTN4                                                 02367000
CTGBYPMT EQU   CTGOPTN4                                                 02368000
@NM00027 EQU   CTGOPTN4                                                 02369000
CTGNPROF EQU   CTGOPTN4                                                 02370000
CTGDOCAT EQU   CTGOPTN4                                                 02371000
CTGLBASE EQU   CTGOPTN4                                                 02372000
CTGAM0   EQU   CTGOPTN3                                                 02373000
CTGNUM   EQU   CTGOPTN3                                                 02374000
CTGSRH   EQU   CTGOPTN3                                                 02375000
CTGGDGL  EQU   CTGOPTN3                                                 02376000
CTGSUPLT EQU   CTGOPTN3                                                 02377000
CTGFUNC  EQU   CTGOPTN3                                                 02378000
@NM00026 EQU   CTGOPTN2                                                 02379000
CTGSCR   EQU   CTGOPTN2                                                 02380000
CTGOVRID EQU   CTGOPTN2                                                 02381000
CTGDISC  EQU   CTGOPTN2                                                 02382000
CTGGTNXT EQU   CTGOPTN2                                                 02383000
CTGSWAP  EQU   CTGRCATN                                                 02384000
CTGGTALL EQU   CTGREL                                                   02385000
CTGNSVS  EQU   CTGEXT                                                   02386000
CTGGENLD EQU   CTGOPTN1                                                 02387000
CTGCNAME EQU   CTGOPTN1                                                 02388000
CTGNAME  EQU   CTGOPTN1                                                 02389000
CTGREAD  EQU   CTGOPTN1                                                 02390000
CTGUPD   EQU   CTGOPTN1                                                 02391000
CTGCI    EQU   CTGOPTN1                                                 02392000
CTGMAST  EQU   CTGOPTN1                                                 02393000
CTGBYPSS EQU   CTGOPTN1                                                 02394000
JSCBCSCB EQU   JSCBSEC1+68                                              02395000
JSCBPMG  EQU   JSCBWTP+2                                                02396000
JSCBWTSP EQU   JSCBWTP+1                                                02397000
JSCRSV23 EQU   JSCBWTFG                                                 02398000
JSCRSV22 EQU   JSCBWTFG                                                 02399000
JSCRSV21 EQU   JSCBWTFG                                                 02400000
JSCRSV20 EQU   JSCBWTFG                                                 02401000
JSCRSV19 EQU   JSCBWTFG                                                 02402000
JSCRSV18 EQU   JSCBWTFG                                                 02403000
JSCBRET  EQU   JSCBWTFG                                                 02404000
JSCBIOFG EQU   JSCBWTFG                                                 02405000
@NM00023 EQU   JSCBSEC1+60                                              02406000
JSCBQMPI EQU   JSCBSEC1+56                                              02407000
JSCBPMSG EQU   JSCBSWT1                                                 02408000
JSCRSV16 EQU   JSCBSWT1                                                 02409000
JSCRSV15 EQU   JSCBSWT1                                                 02410000
JSCRSV14 EQU   JSCBSWT1                                                 02411000
JSCRSV13 EQU   JSCBSWT1                                                 02412000
JSCRSV12 EQU   JSCBSWT1                                                 02413000
JSCRSV11 EQU   JSCBSWT1                                                 02414000
JSCBPASS EQU   JSCBSWT1                                                 02415000
JSCBTTTR EQU   JSCBSEC1+52                                              02416000
JSCRSV10 EQU   JSCBSEC1+49                                              02417000
JSCBAUTH EQU   JSCBOPTS                                                 02418000
JSCSIOTS EQU   JSCBOPTS                                                 02419000
JSCRSV08 EQU   JSCBOPTS                                                 02420000
JSCRSV07 EQU   JSCBOPTS                                                 02421000
JSCRSV06 EQU   JSCBOPTS                                                 02422000
JSCBLONG EQU   JSCBOPTS                                                 02423000
JSCRSV05 EQU   JSCBOPTS                                                 02424000
JSCRSV04 EQU   JSCBOPTS                                                 02425000
JSCBSECB EQU   JSCBSEC1+44                                              02426000
JSCRSV03 EQU   JSCBSEC1+41                                              02427000
JSCBSTEP EQU   JSCBSEC1+40                                              02428000
JSCBDCBA EQU   JSCBDCB+1                                                02429000
JSCRSV02 EQU   JSCBDCB                                                  02430000
JSCBID   EQU   JSCBSEC1+32                                              02431000
JSCBDBTB EQU   JSCBSEC1+28                                              02432000
JSCBIJSC EQU   JSCBSEC1+24                                              02433000
JSCBTCBP EQU   JSCBSEC1+20                                              02434000
JSCBTCP  EQU   JSCBSEC1+12                                              02435000
JSCBSHR  EQU   JSCBSEC1+8                                               02436000
JSCHPCEA EQU   JSCHPCE+1                                                02437000
JSCRSV32 EQU   JSCHPCE                                                  02438000
JSCRSV01 EQU   JSCBSEC1                                                 02439000
@NM00022 EQU   IEZJSCB                                                  02440000
ETCBP    EQU   EPARMLST+432                                             02441000
EEINTIOT EQU   EPARMLST+428                                             02442000
ERESCD   EQU   ERETURNS+2                                               02443000
ERETCD   EQU   ERETURNS                                                 02444000
EDDNAME  EQU   EPARMLST+416                                             02445000
EACBPTR  EQU   EPARMLST+412                                             02446000
@NM00020 EQU   EECNTRLS+1                                               02447000
@NM00019 EQU   EECNTRLS+1                                               02448000
EENOUNCT EQU   EECNTRLS+1                                               02449000
EESWTIOT EQU   EECNTRLS+1                                               02450000
EECCUCAT EQU   EECNTRLS                                                 02451000
EEUCUCAT EQU   EECNTRLS                                                 02452000
@NM00018 EQU   EPARMLST                                                 02453000
HWVLSERS EQU   HWVLSELB+4                                               02454000
HWVLSLCT EQU   HWSELHDR+2                                               02455000
HWVLSBLN EQU   HWSELHDR                                                 02456000
HWTYPE   EQU   HWCTBYT+1                                                02457000
@NM00017 EQU   HWCTBYT                                                  02458000
HWDA     EQU   HWCTBYT                                                  02459000
@NM00016 EQU   HWCTBYT                                                  02460000
HWTAPE   EQU   HWCTBYT                                                  02461000
@NM00015 EQU   HWOBYTE                                                  02462000
HWRVDEV  EQU   HWOBYTE                                                  02463000
@NM00014 EQU   HWOBYTE                                                  02464000
HW7TRK   EQU   HWOBYTE                                                  02465000
HWMBYTE  EQU   HWDEV                                                    02466000
HWUCBP   EQU   HWUCLST+8                                                02467000
HWDEVTYP EQU   HWUCLST+4                                                02468000
HWEDTLUV EQU   HWUCLST                                                  02469000
HWRSVCHR EQU   HWDATA+986                                               02470000
HWCONCAT EQU   HWDATA+984                                               02471000
HWCATSER EQU   HWDATA+978                                               02472000
@NM00013 EQU   HWDATA+958                                               02473000
HWDSNAME EQU   HWDATA+176                                               02474000
HWDSNLN  EQU   HWDATA+174                                               02475000
@NM00012 EQU   HWSTPNBR                                                 02476000
HWRSVPTR EQU   HWDATA+84                                                02477000
HWDSENQP EQU   HWDATA+76                                                02478000
HWRPDIEP EQU   HWDATA+72                                                02479000
HWLPDIBP EQU   HWDATA+68                                                02480000
HWGDGBSP EQU   HWDATA+64                                                02481000
HWCJFCBP EQU   HWDATA+48                                                02482000
HWRSIOTP EQU   HWDATA+40                                                02483000
HWGDGNTP EQU   HWDATA+28                                                02484000
HWPDIP   EQU   HWDATA+24                                                02485000
@NM00011 EQU   HWCNTRL+14                                               02486000
HWDDCTR  EQU   HWCNTRL+12                                               02487000
HWDDSTEP EQU   HWCNTRL+10                                               02488000
@NM00010 EQU   HWCNTRL+9                                                02489000
@NM00009 EQU   HWJLCTLS+1                                               02490000
HWNOVOLU EQU   HWJLCTLS+1                                               02491000
HWDOMOD  EQU   HWJLCTLS+1                                               02492000
HWVSAME  EQU   HWJLCTLS                                                 02493000
HWLOCCAT EQU   HWJLCTLS                                                 02494000
HWGDGSLC EQU   HWJLCTLS                                                 02495000
HWLBASEL EQU   HWJLCTLS                                                 02496000
@NM00008 EQU   HWJLCTLS                                                 02497000
HWSYSLOC EQU   HWJLCTLS                                                 02498000
HWPDIEDL EQU   HWJLCTLS                                                 02499000
HWPDISCN EQU   HWJLCTLS                                                 02500000
@NM00007 EQU   HWTBLCTL                                                 02501000
HWCOPYAF EQU   HWTBLCTL                                                 02502000
HWTBCOPY EQU   HWTBLCTL                                                 02503000
@NM00006 EQU   HWCNTRL+4                                                02504000
@NM00005 EQU   HWMSSCTL+1                                               02505000
HWAVSRCH EQU   HWMSSCTL+1                                               02506000
HWVLSELF EQU   HWMSSCTL+1                                               02507000
HWAVUNIT EQU   HWMSSCTL                                                 02508000
HWCATINT EQU   HWCNTRL+3                                                02509000
HWDDDONE EQU   HWCNTRL+3                                                02510000
HWOVRDN  EQU   HWCNTRL+3                                                02511000
HWVAME   EQU   HWCNTRL+3                                                02512000
HWEDT    EQU   HWCNTRL+3                                                02513000
HWUCB    EQU   HWCNTRL+2                                                02514000
HWOVCAND EQU   HWCNTRL+2                                                02515000
HWDSNCAT EQU   HWCNTRL+2                                                02516000
HWRESIOT EQU   HWCNTRL+2                                                02517000
HWGDGALL EQU   HWCNTRL+2                                                02518000
HWDSNRQD EQU   HWCNTRL+2                                                02519000
HWVUREC  EQU   HWCNTRL+2                                                02520000
HWDSNREC EQU   HWCNTRL+2                                                02521000
@NM00004 EQU   HWCNTRL+1                                                02522000
HWNOVRID EQU   HWCNTRL+1                                                02523000
HWDSAUTH EQU   HWCNTRL+1                                                02524000
HWNODSI  EQU   HWCNTRL+1                                                02525000
HWOFFDEV EQU   HWCNTRL+1                                                02526000
HWNOSCAT EQU   HWCNTRL                                                  02527000
HWWVOLS  EQU   HWCNTRL                                                  02528000
HWDNCCDD EQU   HWCNTRL                                                  02529000
HWWAITOK EQU   HWCNTRL                                                  02530000
HWMNTCAT EQU   HWCNTRL                                                  02531000
HWNOULSP EQU   HWCNTRL                                                  02532000
HWDOPDI  EQU   HWCNTRL                                                  02533000
ASWRSV02 EQU   ASWAFLGS+1                                               02534000
ASWRSV01 EQU   ASWADSWS                                                 02535000
ASWADYUE EQU   ASWADSWS                                                 02536000
ASWAVMVF EQU   ASWADSWS                                                 02537000
ASWACOMF EQU   ASWADSWS                                                 02538000
ASWADYNF EQU   ASWADSWS                                                 02539000
NEXTTCBP EQU   TWOTCBPS                                                 02540000
@NM00113 EQU   PSA+3668                                                 02541000
PSASTAK  EQU   PSA+3072                                                 02542000
@NM00112 EQU   PSA+1048                                                 02543000
PSAUSEND EQU   PSA+1048                                                 02544000
PSARV062 EQU   PSA+1044                                                 02545000
PSACDAL  EQU   PSA+1040                                                 02546000
PSAWTCOD EQU   PSA+1036                                                 02547000
PSAATCVT EQU   PSA+1032                                                 02548000
PSAPCPSW EQU   PSA+1024                                                 02549000
PSAPIR2  EQU   PSA+1020                                                 02550000
PSARV059 EQU   PSA+1018                                                 02551000
PSASVC13 EQU   PSA+1016                                                 02552000
PSALSFCC EQU   PSA+1012                                                 02553000
PSASFACC EQU   PSA+1008                                                 02554000
PSASTOP  EQU   PSA+992                                                  02555000
PSASTART EQU   PSA+976                                                  02556000
PSARSPSW EQU   PSA+968                                                  02557000
PSASRPSW EQU   PSA+960                                                  02558000
PSARV045 EQU   PSA+892                                                  02559000
PSARV044 EQU   PSA+888                                                  02560000
PSARV043 EQU   PSA+884                                                  02561000
PSARV042 EQU   PSA+880                                                  02562000
PSARV041 EQU   PSA+876                                                  02563000
PSARV040 EQU   PSA+872                                                  02564000
PSARV025 EQU   PSA+868                                                  02565000
PSADSSED EQU   PSA+868                                                  02566000
PSADSSPR EQU   PSA+864                                                  02567000
PSADSSFW EQU   PSA+860                                                  02568000
PSADSS14 EQU   PSA+856                                                  02569000
PSADSSPP EQU   PSA+848                                                  02570000
PSADSSRP EQU   PSA+840                                                  02571000
PSADSS05 EQU   PSADSSF4                                                 02572000
PSADSS10 EQU   PSADSSF4                                                 02573000
PSADSSVE EQU   PSADSSF4                                                 02574000
PSADSSDE EQU   PSADSSF4                                                 02575000
PSADSSC0 EQU   PSADSSF4                                                 02576000
PSADSSIE EQU   PSADSSF4                                                 02577000
PSADSS12 EQU   PSADSSF4                                                 02578000
PSADSSRC EQU   PSADSSF4                                                 02579000
PSARV057 EQU   PSADSSF3                                                 02580000
PSARV056 EQU   PSADSSF3                                                 02581000
PSARV055 EQU   PSADSSF3                                                 02582000
PSADSSMC EQU   PSADSSF3                                                 02583000
PSADSSRW EQU   PSADSSF3                                                 02584000
PSADSSNM EQU   PSADSSF3                                                 02585000
PSADSSES EQU   PSADSSF3                                                 02586000
PSADSSGP EQU   PSADSSF3                                                 02587000
PSADSSF2 EQU   PSADSSFL+1                                               02588000
PSADSSPI EQU   PSADSSF1                                                 02589000
PSADSSOI EQU   PSADSSF1                                                 02590000
PSADSSSP EQU   PSADSSF1                                                 02591000
PSADSSTP EQU   PSADSSF1                                                 02592000
PSADSSDW EQU   PSADSSF1                                                 02593000
PSADSSDD EQU   PSADSSF1                                                 02594000
PSADSSDM EQU   PSADSSF1                                                 02595000
PSADSSMV EQU   PSADSSF1                                                 02596000
PSADSSTS EQU   PSA+816                                                  02597000
PSADSSWK EQU   PSA+812                                                  02598000
PSADSSR3 EQU   PSA+808                                                  02599000
PSADSSR2 EQU   PSA+804                                                  02600000
PSADSSRS EQU   PSA+800                                                  02601000
PSASTOR  EQU   PSA+796                                                  02602000
PSACPUSA EQU   PSA+794                                                  02603000
PSAVSTAP EQU   PSA+792                                                  02604000
PSAWKVAP EQU   PSA+788                                                  02605000
PSAWKRAP EQU   PSA+784                                                  02606000
PSAMCHIC EQU   PSA+783                                                  02607000
PSARV061 EQU   PSA+782                                                  02608000
PSASYMSK EQU   PSA+781                                                  02609000
PSAMCHFL EQU   PSA+780                                                  02610000
PSACR0   EQU   PSA+776                                                  02611000
PSAPSWSV EQU   PSA+768                                                  02612000
PSALITA  EQU   PSA+764                                                  02613000
PSACLHS  EQU   PSAHLHI                                                  02614000
PSALKR15 EQU   PSALKSA+60                                               02615000
PSALKR14 EQU   PSALKSA+56                                               02616000
PSALKR13 EQU   PSALKSA+52                                               02617000
PSALKR12 EQU   PSALKSA+48                                               02618000
PSALKR11 EQU   PSALKSA+44                                               02619000
PSALKR10 EQU   PSALKSA+40                                               02620000
PSALKR9  EQU   PSALKSA+36                                               02621000
PSALKR8  EQU   PSALKSA+32                                               02622000
PSALKR7  EQU   PSALKSA+28                                               02623000
PSALKR6  EQU   PSALKSA+24                                               02624000
PSALKR5  EQU   PSALKSA+20                                               02625000
PSALKR4  EQU   PSALKSA+16                                               02626000
PSALKR3  EQU   PSALKSA+12                                               02627000
PSALKR2  EQU   PSALKSA+8                                                02628000
PSALKR1  EQU   PSALKSA+4                                                02629000
PSALKR0  EQU   PSALKSA                                                  02630000
PSARV023 EQU   PSACLHT+52                                               02631000
PSALOCAL EQU   PSACLHT+48                                               02632000
PSACMSL  EQU   PSACLHT+44                                               02633000
PSAOPTL  EQU   PSACLHT+40                                               02634000
PSATPACL EQU   PSACLHT+36                                               02635000
PSATPDNL EQU   PSACLHT+32                                               02636000
PSATPNCL EQU   PSACLHT+28                                               02637000
PSAIOSLL EQU   PSACLHT+24                                               02638000
PSAIOSUL EQU   PSACLHT+20                                               02639000
PSAIOSCL EQU   PSACLHT+16                                               02640000
PSAIOSSL EQU   PSACLHT+12                                               02641000
PSASALCL EQU   PSACLHT+8                                                02642000
PSAASML  EQU   PSACLHT+4                                                02643000
PSADISPL EQU   PSACLHT                                                  02644000
PSASRSA  EQU   PSA+636                                                  02645000
PSARV050 EQU   PSA+634                                                  02646000
PSADSSGO EQU   PSA+633                                                  02647000
PSARECUR EQU   PSA+632                                                  02648000
PSAHLHIS EQU   PSA+628                                                  02649000
PSAIPCSA EQU   PSA+624                                                  02650000
@NM00111 EQU   PSA+621                                                  02651000
PSAIPCDM EQU   PSA+620                                                  02652000
PSAIPCD  EQU   PSA+616                                                  02653000
@NM00110 EQU   PSA+613                                                  02654000
PSAIPCRM EQU   PSA+612                                                  02655000
PSAIPCR  EQU   PSA+608                                                  02656000
PSAMCHEX EQU   PSA+600                                                  02657000
PSAMPSW  EQU   PSA+592                                                  02658000
PSAEXPS2 EQU   PSA+584                                                  02659000
PSAEXPS1 EQU   PSA+576                                                  02660000
PSAPIREG EQU   PSA+572                                                  02661000
PSARSREG EQU   PSA+568                                                  02662000
PSAGPREG EQU   PSA+556                                                  02663000
PSARV022 EQU   PSASUP4                                                  02664000
PSARV021 EQU   PSASUP4                                                  02665000
PSARV020 EQU   PSASUP4                                                  02666000
PSARV019 EQU   PSASUP4                                                  02667000
PSARV018 EQU   PSASUP4                                                  02668000
PSARV017 EQU   PSASUP4                                                  02669000
PSARV016 EQU   PSASUP4                                                  02670000
PSARV015 EQU   PSASUP4                                                  02671000
PSARV014 EQU   PSASUP3                                                  02672000
PSARV013 EQU   PSASUP3                                                  02673000
PSARV012 EQU   PSASUP3                                                  02674000
PSAESTA  EQU   PSASUP3                                                  02675000
PSASPR   EQU   PSASUP3                                                  02676000
PSAPSREG EQU   PSASUP3                                                  02677000
PSAPI2   EQU   PSASUP3                                                  02678000
PSAIOSUP EQU   PSASUP3                                                  02679000
PSALCR   EQU   PSASUP2                                                  02680000
PSARTM   EQU   PSASUP2                                                  02681000
PSAACR   EQU   PSASUP2                                                  02682000
PSAIPCE2 EQU   PSASUP2                                                  02683000
PSAIPCES EQU   PSASUP2                                                  02684000
PSAIPCEC EQU   PSASUP2                                                  02685000
PSAGTF   EQU   PSASUP2                                                  02686000
PSAIPCRI EQU   PSASUP2                                                  02687000
PSATYPE6 EQU   PSASUP1                                                  02688000
PSATCTL  EQU   PSASUP1                                                  02689000
PSADISP  EQU   PSASUP1                                                  02690000
PSALOCK  EQU   PSASUP1                                                  02691000
PSAPI    EQU   PSASUP1                                                  02692000
PSAEXT   EQU   PSASUP1                                                  02693000
PSASVC   EQU   PSASUP1                                                  02694000
PSAIO    EQU   PSASUP1                                                  02695000
PSAANEW  EQU   PSA+544                                                  02696000
PSATOLD  EQU   PSA+540                                                  02697000
PSATNEW  EQU   PSA+536                                                  02698000
PSALCCAR EQU   PSA+532                                                  02699000
PSALCCAV EQU   PSA+528                                                  02700000
PSAPCCAR EQU   PSA+524                                                  02701000
PSAPCCAV EQU   PSA+520                                                  02702000
PSACPULA EQU   PSA+518                                                  02703000
PSACPUPA EQU   PSA+516                                                  02704000
PSAPSA   EQU   PSA+512                                                  02705000
FLCHDEND EQU   PSA+512                                                  02706000
FLCCRSAV EQU   FLCMCLA+280                                              02707000
FLCGRSAV EQU   FLCMCLA+216                                              02708000
FLCFPSAV EQU   FLCMCLA+184                                              02709000
FLCFLA   EQU   FLCMCLA+88                                               02710000
FLCRGNCD EQU   FLCMCLA+84                                               02711000
FLCFSAA  EQU   FLCFSA+1                                                 02712000
@NM00109 EQU   FLCFSA                                                   02713000
@NM00108 EQU   FLCMCLA+72                                               02714000
FLCMCIC  EQU   FLCMCLA+64                                               02715000
@NM00107 EQU   FLCMCLA+20                                               02716000
FLCIOAA  EQU   FLCIOA+1                                                 02717000
@NM00106 EQU   FLCIOA                                                   02718000
@NM00105 EQU   FLCMCLA+15                                               02719000
@NM00104 EQU   FLCMCLA+14                                               02720000
@NM00103 EQU   FLCMCLA+12                                               02721000
FLCLCL   EQU   FLCMCLA+8                                                02722000
FLCIOELA EQU   FLCIOEL+1                                                02723000
@NM00102 EQU   FLCIOEL                                                  02724000
FLCCHNID EQU   FLCMCLA                                                  02725000
@NM00101 EQU   PSA+160                                                  02726000
FLCMTRCD EQU   PSA+157                                                  02727000
@NM00100 EQU   PSA+156                                                  02728000
FLCPERA  EQU   FLCPER+1                                                 02729000
@NM00099 EQU   FLCPER                                                   02730000
@NM00098 EQU   PSA+151                                                  02731000
FLCPERCD EQU   PSA+150                                                  02732000
FLCMCNUM EQU   PSA+149                                                  02733000
@NM00097 EQU   PSA+148                                                  02734000
FLCTEAA  EQU   FLCTEA+1                                                 02735000
@NM00096 EQU   FLCTEA                                                   02736000
PSAPIPC  EQU   PSAPICOD                                                 02737000
PSAPIMC  EQU   PSAPICOD                                                 02738000
PSAPIPER EQU   PSAPICOD                                                 02739000
PSARV049 EQU   FLCPICOD                                                 02740000
FLCPILCB EQU   FLCPIILC                                                 02741000
@NM00095 EQU   FLCPIILC                                                 02742000
@NM00094 EQU   PSAEPPSW                                                 02743000
FLCSVCN  EQU   PSAESPSW+2                                               02744000
FLCSILCB EQU   FLCSVILC                                                 02745000
@NM00093 EQU   FLCSVILC                                                 02746000
@NM00092 EQU   PSAESPSW                                                 02747000
FLCEICOD EQU   PSAEEPSW+2                                               02748000
PSASPAD  EQU   PSAEEPSW                                                 02749000
@NM00091 EQU   PSA+128                                                  02750000
FLCINPSW EQU   PSA+120                                                  02751000
FLCMNPSW EQU   PSA+112                                                  02752000
FLCPNPSW EQU   PSA+104                                                  02753000
FLCSNPSW EQU   PSA+96                                                   02754000
FLCENPSW EQU   PSA+88                                                   02755000
FLCTRACE EQU   PSA+84                                                   02756000
FLCTIMER EQU   PSA+80                                                   02757000
FLCCVT2  EQU   PSA+76                                                   02758000
FLCCAW   EQU   PSA+72                                                   02759000
FLCCSW   EQU   PSA+64                                                   02760000
FLCIOPSW EQU   PSA+56                                                   02761000
FLCMOPSW EQU   PSA+48                                                   02762000
FLCPOPSW EQU   PSA+40                                                   02763000
FLCSOPSW EQU   PSA+32                                                   02764000
FLCEOPSW EQU   PSA+24                                                   02765000
@NM00090 EQU   FLCICCW2+4                                               02766000
FLCCVT   EQU   FLCICCW2                                                 02767000
FLCICCW1 EQU   FLCROPSW                                                 02768000
FLCIPPSW EQU   FLCRNPSW                                                 02769000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02770000
@RF00106 EQU   @RC00095                                                 02771000
@ENDDATA EQU   *                                                        02772000
         END   IEFAB451,(C'PLS2207',0701,76334)                         02773000
