         TITLE 'IEFAB498 - MVCA CHAIN PROCESSOR                        *00001000
                        '                                               00002000
IEFAB498 CSECT ,                                                01S0001 00003000
@MAINENT DS    0H                                               01S0001 00004000
         USING *,@15                                            01S0001 00005000
         B     @PROLOG                                          01S0001 00006000
         DC    AL1(16)                                          01S0001 00007000
         DC    C'IEFAB498  73.325'                              01S0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00010000
         BALR  @10,0                                            01S0001 00011000
@PSTART  DS    0H                                               01S0001 00012000
         USING @PSTART,@10                                      01S0001 00013000
         L     @00,@SIZDATD                                     01S0001 00014000
         MODESET EXTKEY=SCHED,SAVEKEY=(2)                               00015000
         GSPACE  R,LV=(0)                                               00016000
         LR    @09,@01                                          01S0001 00017000
         USING @DATD,@09                                        01S0001 00018000
         ST    @13,@SA00001+4                                   01S0001 00019000
         STC   @02,@OLDKEY                                      01S0001 00020000
         MODESET KEYADDR=(2)                                            00021000
         LM    @00,@02,20(@13)                                  01S0001 00022000
         ST    @09,8(,@13)                                      01S0001 00023000
         LR    @13,@09                                          01S0001 00024000
         MODESET EXTKEY=ZERO                                            00025000
         MVC   @PC00001(8),0(@01)                               01S0001 00026000
         MODESET EXTKEY=SCHED                                           00027000
*                                         STACK                      */ 00028000
*ATCAPTR = CVTQMWR;                    /*ADDRESS ATCA                */ 00029000
         L     @12,CVTPTR                                       01S0041 00030000
         L     ATCAPTR,CVTQMWR(,@12)                            01S0041 00031000
*RETCODE = SUCCESS;                    /*INITIALIZE RETURN CODE      */ 00032000
         SLR   @12,@12                                          01S0042 00033000
         LR    RETCODE,@12                                      01S0042 00034000
*/*OBTAIN LOCAL AND CMS LOCKS                                        */ 00035000
* DO; /*MODESET  KEYADDR(ZERO)*/                                01S0043 00036000
*   SPKA (ZERO); /*SET PSW KEY*/                                01S0044 00037000
         SPKA  0(@12)                                           01S0044 00038000
* END; /*MODESET  KEYADDR(ZERO)*/               /*GET KEY ZERO  01S0045 00039000
*      */                                                       01S0045 00040000
* DO; /* SETLOCK (OBTAIN) MODE(UNCOND) TYPE(LOCAL) REGS(USE) RELATED(MV 00041000
*A,IEFAB498(IEFAB498)) */                                       01S0046 00042000
*   RFY (GPR11P,GPR12P,GPR13P,GPR14P) RSTD;                     01S0047 00043000
*   RFY (GPR15P,GPR00P,GPR01P) RSTD;                            01S0048 00044000
*   GPR15P = GPR11P; /* SAVE REG. 11 IN REG. 15. */             01S0049 00045000
         LR    GPR15P,GPR11P                                    01S0049 00046000
*   GPR00P = GPR12P; /* SAVE REG. 12 IN REG. 0. */              01S0050 00047000
         LR    GPR00P,GPR12P                                    01S0050 00048000
*   GPR01P = GPR13P; /* SAVE REG. 13 IN REG. 1. */              01S0051 00049000
         LR    GPR01P,GPR13P                                    01S0051 00050000
*   GPR13P = PSALITA; /* ADDRESS OF LOCK INTERFACE TABLE. */    01S0052 00051000
         L     GPR13P,PSALITA                                   01S0052 00052000
*   GEN(LM GPR11P,GPR13P,576(GPR13P)); /* LOAD LOCKWORD, CLHT AND ENTRY 00053000
*ADRS. */                                                       01S0053 00054000
         LM GPR11P,GPR13P,576(GPR13P)                                   00055000
*   GEN(BALR GPR14P,GPR13P); /* BALR TO SETLOCK RTN. */         01S0054 00056000
         BALR GPR14P,GPR13P                                             00057000
*   GPR11P = GPR15P; /* RESTORE REG. 11. */                     01S0055 00058000
         LR    GPR11P,GPR15P                                    01S0055 00059000
*   GPR15P = GPR13P; /* SAVE RETURN CODE. */                    01S0056 00060000
         LR    GPR15P,GPR13P                                    01S0056 00061000
*   GPR12P = GPR00P; /* RESTORE REG. 12 */                      01S0057 00062000
         LR    GPR12P,GPR00P                                    01S0057 00063000
*   GPR13P = GPR01P; /* RESTORE REG. 13. */                     01S0058 00064000
         LR    GPR13P,GPR01P                                    01S0058 00065000
*   RFY(GPR15P,GPR00P,GPR01P) UNRSTD;                           01S0059 00066000
*   RFY (GPR11P,GPR12P,GPR13P,GPR14P) UNRSTD;                   01S0060 00067000
* END; /* SETLOCK (OBTAIN) MODE(UNCOND) TYPE(LOCAL) REGS(USE) RELATED(M 00068000
*CA,IEFAB498(IEFAB498)) */                                      01S0061 00069000
* DO; /* SETLOCK (OBTAIN) MODE(UNCOND) TYPE(CMS) REGS(USE) RELATED(MVCA 00070000
*IEFAB498(IEFAB498)) */                                         01S0062 00071000
*   RFY (GPR11P,GPR12P,GPR13P,GPR14P) RSTD;                     01S0063 00072000
*   RFY (GPR15P,GPR00P,GPR01P) RSTD;                            01S0064 00073000
*   GPR15P = GPR11P; /* SAVE REG. 11 IN REG. 15. */             01S0065 00074000
         LR    GPR15P,GPR11P                                    01S0065 00075000
*   GPR00P = GPR12P; /* SAVE REG. 12 IN REG. 0. */              01S0066 00076000
         LR    GPR00P,GPR12P                                    01S0066 00077000
*   GPR01P = GPR13P; /* SAVE REG. 13 IN REG. 1. */              01S0067 00078000
         LR    GPR01P,GPR13P                                    01S0067 00079000
*   GPR13P = PSALITA; /* ADDRESS OF LOCK INTERFACE TABLE. */    01S0068 00080000
         L     GPR13P,PSALITA                                   01S0068 00081000
*   GEN(LM GPR11P,GPR13P,540(GPR13P)); /* LOAD LOCKWORD, CLHT AND ENTRY 00082000
*ADRS. */                                                       01S0069 00083000
         LM GPR11P,GPR13P,540(GPR13P)                                   00084000
*   GEN(BALR GPR14P,GPR13P); /* BALR TO SETLOCK RTN. */         01S0070 00085000
         BALR GPR14P,GPR13P                                             00086000
*   GPR11P = GPR15P; /* RESTORE REG. 11. */                     01S0071 00087000
         LR    GPR11P,GPR15P                                    01S0071 00088000
*   GPR15P = GPR13P; /* SAVE RETURN CODE. */                    01S0072 00089000
         LR    GPR15P,GPR13P                                    01S0072 00090000
*   GPR12P = GPR00P; /* RESTORE REG. 12 */                      01S0073 00091000
         LR    GPR12P,GPR00P                                    01S0073 00092000
*   GPR13P = GPR01P; /* RESTORE REG. 13. */                     01S0074 00093000
         LR    GPR13P,GPR01P                                    01S0074 00094000
*   RFY(GPR15P,GPR00P,GPR01P) UNRSTD;                           01S0075 00095000
*   RFY (GPR11P,GPR12P,GPR13P,GPR14P) UNRSTD;                   01S0076 00096000
* END; /* SETLOCK (OBTAIN) MODE(UNCOND) TYPE(CMS) REGS(USE) RELATED(MVC 00097000
*,IEFAB498(IEFAB498)) */    /*GET CMS LOCK                */    01S0077 00098000
*IF DELTINDC = ON                      /*DELETE MVCA REQUEST ?       */ 00099000
*   | SRCHINDC = ON THEN               /*OR SEARCH MVCA CHAIN REQUEST*/ 00100000
         L     @12,@PC00001                                     01S0078 00101000
         L     @12,PARMPTR(,@12)                                01S0078 00102000
         TM    DELTINDC(@12),B'01100000'                        01S0078 00103000
         BZ    @RF00078                                         01S0078 00104000
*  DO;                                                          01S0079 00105000
*        RETCODE = NOMATCH;            /*INITIALIZE RETURN           */ 00106000
         LA    RETCODE,12                                       01S0080 00107000
*        MVCAPTR = ATCAMVCP;           /*PTR TO FIRST MVCA ON CHAIN  */ 00108000
         L     MVCAPTR,ATCAMVCP(,ATCAPTR)                       01S0081 00109000
*        DO WHILE(MVCAPTR ^= ZERO      /*SEARCH MVCA CHAIN UNTIL END */ 00110000
*                & RETCODE ^= MATCH);  /*OR UNTIL MATCHING ASID      */ 00111000
         B     @DE00082                                         01S0082 00112000
@DL00082 DS    0H                                               01S0083 00113000
*          IF MVCAASID = ASID THEN     /*IF ASID MATCHES             */ 00114000
         L     @12,@PC00001                                     01S0083 00115000
         L     @12,PARMPTR(,@12)                                01S0083 00116000
         SLR   @11,@11                                          01S0083 00117000
         ICM   @11,3,ASID(@12)                                  01S0083 00118000
         CH    @11,MVCAASID(,MVCAPTR)                           01S0083 00119000
         BNE   @RF00083                                         01S0083 00120000
*            DO;                                                01S0084 00121000
*              RETCODE = MATCH;        /*INDICATE ASID FOUND         */ 00122000
         LA    RETCODE,8                                        01S0085 00123000
*              IF DELTINDC = ON THEN   /*DELETE MVCA REQUEST         */ 00124000
         TM    DELTINDC(@12),B'01000000'                        01S0086 00125000
         BNO   @RF00086                                         01S0086 00126000
*                DO;                                            01S0087 00127000
*                  IF VMVEXITP ^= ZERO THEN /*FRR PARMS SUPPLIED     */ 00128000
         L     @12,@PC00001+4                                   01S0088 00129000
         ICM   @11,15,VMVEXITP(@12)                             01S0088 00130000
         BZ    @RF00088                                         01S0088 00131000
*                    DO;                    /*ISSUE FRR MACRO        */ 00132000
*                      RFY(REG2,REG3,REG4) RSTD;                01S0090 00133000
*                      REG2 = ADDR(IEFAB4E1); /*ADDR OF FRR EXIT RTN */ 00134000
         L     REG2,@CV00058                                    01S0091 00135000
*                      GEN;                                     01S0092 00136000
                      SETFRR A,FRRAD=(2),PARMAD=(3),WRKREGS=(3,4)       00137000
*                      FRRUSERP = REG3; /*PTR TO FRR SUPPLIED PARMS  */ 00138000
         LR    FRRUSERP,REG3                                    01S0093 00139000
*                      RFY (REG2,REG3,REG4) UNRSTD;             01S0094 00140000
*                      FRRP = VMVEXITP; /*PTR TO USER PARMS          */ 00141000
         L     @11,@PC00001+4                                   01S0095 00142000
         MVC   FRRP(4,FRRUSERP),VMVEXITP(@11)                   01S0095 00143000
*                    END;                                       01S0096 00144000
*                  IF MVCAPRVP = ZERO THEN /*FIRST MVCA ON CHAIN     */ 00145000
@RF00088 SLR   @12,@12                                          01S0097 00146000
         C     @12,MVCAPRVP(,MVCAPTR)                           01S0097 00147000
         BNE   @RF00097                                         01S0097 00148000
*                    DO;                                        01S0098 00149000
*                      ATCAMVCP = MVCANXTP; /*REMOVE BACK CHAIN      */ 00150000
         L     @11,MVCANXTP(,MVCAPTR)                           01S0099 00151000
         ST    @11,ATCAMVCP(,ATCAPTR)                           01S0099 00152000
*                      IF MVCANXTP ^= ZERO THEN /*IF NOT ONLY MVCA   */ 00153000
         CR    @11,@12                                          01S0100 00154000
         BE    @RF00100                                         01S0100 00155000
*                        DO;                    /*ON CHAIN           */ 00156000
*                          RFY MVCA BASED(ATCAMVCP); /*CHANGE MVCA      00157000
*                                                      BASE          */ 00158000
*                          MVCAPRVP = ZERO; /*REMOVE FOWARD CHAIN    */ 00159000
         ST    @12,MVCAPRVP(,@11)                               01S0103 00160000
*                          RFY MVCA BASED(MVCAPTR);             01S0104 00161000
*                        END;                                   01S0105 00162000
*                      ELSE;           /*ONLY MVCA ON CHAIN          */ 00163000
@RF00100 DS    0H                                               01S0107 00164000
*                    END;                                       01S0107 00165000
*                  ELSE                /*NOT FIRST MVCA ON CHAIN     */ 00166000
*                    IF MVCANXTP = ZERO THEN /*IF LAST MVCA ON CHAIN */ 00167000
         B     @RC00097                                         01S0108 00168000
@RF00097 SLR   @12,@12                                          01S0108 00169000
         C     @12,MVCANXTP(,MVCAPTR)                           01S0108 00170000
         BNE   @RF00108                                         01S0108 00171000
*                      DO;                                      01S0109 00172000
*                         LSTMVCAP = MVCAPRVP; /*PTR TO PREVIOUS MVCA*/ 00173000
         L     LSTMVCAP,MVCAPRVP(,MVCAPTR)                      01S0110 00174000
*                         RFY MVCA BASED(LSTMVCAP);             01S0111 00175000
*                         MVCANXTP = ZERO; /*DELETE MVCA FROM CHAIN  */ 00176000
         ST    @12,MVCANXTP(,LSTMVCAP)                          01S0112 00177000
*                         RFY MVCA BASED(MVCAPTR);              01S0113 00178000
*                      END;                                     01S0114 00179000
*                    ELSE              /*NOT FIRST OR LAST ON CHAIN  */ 00180000
*                      DO;                                      01S0115 00181000
         B     @RC00108                                         01S0115 00182000
@RF00108 DS    0H                                               01S0116 00183000
*                        LSTMVCAP = MVCAPRVP;/*PTR TO PREV ON CHAIN  */ 00184000
         L     LSTMVCAP,MVCAPRVP(,MVCAPTR)                      01S0116 00185000
*                        NXTMVCAP = MVCANXTP;/*PTR TO NEXT ON CHAIN  */ 00186000
         L     NXTMVCAP,MVCANXTP(,MVCAPTR)                      01S0117 00187000
*                        RFY MVCA BASED(LSTMVCAP);/*PREVIOUS MVCA    */ 00188000
*                        MVCANXTP = NXTMVCAP;/*RESET PREVIOUS MVCA   */ 00189000
         ST    NXTMVCAP,MVCANXTP(,LSTMVCAP)                     01S0119 00190000
*                        RFY MVCA BASED(NXTMVCAP);/*NEXT MVCA        */ 00191000
*                        MVCAPRVP = LSTMVCAP; /*RESET NEXT MVCA      */ 00192000
         ST    LSTMVCAP,MVCAPRVP(,NXTMVCAP)                     01S0121 00193000
*                        RFY MVCA BASED(MVCAPTR);/*RESTORE PTR       */ 00194000
*                      END;                                     01S0123 00195000
*                  IF VMVEXITP ^= ZERO THEN  /*FRR PARM LIST SUPPLIED*/ 00196000
@RC00108 DS    0H                                               01S0124 00197000
@RC00097 L     @12,@PC00001+4                                   01S0124 00198000
         ICM   @11,15,VMVEXITP(@12)                             01S0124 00199000
         BZ    @RF00124                                         01S0124 00200000
*                    DO;                     /*CANCEL FRR            */ 00201000
*                      RFY (REG2,REG3) RSTD;                    01S0126 00202000
*                      GEN;                                     01S0127 00203000
                      SETFRR D,WRKREGS=(2,3)                            00204000
*                      RFY (REG2,REG3) UNRSTD;                  01S0128 00205000
*                    END;                                       01S0129 00206000
*                END;                                           01S0130 00207000
*              ELSE                    /*NOT DELETE REQUEST -MUST BE    00208000
*                                        SEARCH REQUEST              */ 00209000
*                DO;                                            01S0131 00210000
         B     @RC00086                                         01S0131 00211000
@RF00086 DS    0H                                               01S0132 00212000
*                  MVCAMPTR = MVCAPTR; /*PUT PTR TO MVCA IN RETURN      00213000
*                                        AREA                        */ 00214000
         L     @12,@PC00001                                     01S0132 00215000
         L     @12,PARMPTR(,@12)                                01S0132 00216000
         ST    MVCAPTR,MVCAMPTR(,@12)                           01S0132 00217000
*                END;                                           01S0133 00218000
*            END;                                               01S0134 00219000
*          ELSE                        /*ASID NOT FOUND              */ 00220000
*            DO;                                                01S0135 00221000
         B     @RC00083                                         01S0135 00222000
@RF00083 DS    0H                                               01S0136 00223000
*              MVCAPTR = MVCANXTP;     /*PTR TO NEXT MVCA            */ 00224000
         L     MVCAPTR,MVCANXTP(,MVCAPTR)                       01S0136 00225000
*            END;                                               01S0137 00226000
*        END;                                                   01S0138 00227000
@RC00083 DS    0H                                               01S0138 00228000
@DE00082 LTR   MVCAPTR,MVCAPTR                                  01S0138 00229000
         BZ    @DC00082                                         01S0138 00230000
         CH    RETCODE,@CH00081                                 01S0138 00231000
         BNE   @DL00082                                         01S0138 00232000
@DC00082 DS    0H                                               01S0139 00233000
*  END;                                                         01S0139 00234000
*ELSE                                  /*NOT DELETE OR SEARCH REQUEST*/ 00235000
*  DO;                                                          01S0140 00236000
         B     @RC00078                                         01S0140 00237000
@RF00078 DS    0H                                               01S0141 00238000
*/********************************************************************/ 00239000
*/*                                                                  */ 00240000
*/* SEGMENT NAME - B498ADDR                                          */ 00241000
*/*                                                                  */ 00242000
*/* DESCRIPTIVE NAME - ADD MVCA ROUTINE                              */ 00243000
*/*                                                                  */ 00244000
*/* FUNCTION -                                                       */ 00245000
*/*   THIS SEGMENT IS INVOKED TO ADD AN MVCA CONTROL BLOCK           */ 00246000
*/*   TO THE MVCA CHAIN                                              */ 00247000
*/*                                                                  */ 00248000
*/*   OPERATION -                                                    */ 00249000
*/*     THIS SEGMENT WILL LOCATE THE END OF THE MVCA CHAIN           */ 00250000
*/*     AND ADD ON THE NEW MVCA                                      */ 00251000
*/*                                                                  */ 00252000
*/* ENTRY POINT -(INLINE SUBROUTINE - ENTERED AT THE TOP)            */ 00253000
*/*                                                                  */ 00254000
*/*   PURPOSE - TO ADD A NEW MVCA TO THE MVCA CHAIN                  */ 00255000
*/*                                                                  */ 00256000
*/* INPUT -                                                          */ 00257000
*/*   MVCAMPTR - PTR TO NEW MVCA                                     */ 00258000
*/*                                                                  */ 00259000
*/* EXIT - NORMAL - (INLINE SUBROUTINE - EXITS AT BOTTOM)            */ 00260000
*/*                                                                  */ 00261000
*/*   CONDITION - MVCA CHAINED                                       */ 00262000
*/*                                                                  */ 00263000
*/*   OUTPUT - MVCA ON CHAIN                                         */ 00264000
*/*                                                                  */ 00265000
*/*   RETURN CODE - N/A                                              */ 00266000
*/*                                                                  */ 00267000
*/********************************************************************/ 00268000
*RETCODE = SUCCESS;                    /*INITIALIZE RETURN CODE      */ 00269000
         SLR   @12,@12                                          02S0141 00270000
         LR    RETCODE,@12                                      02S0141 00271000
*IF ATCAMVCP ^= ZERO THEN              /*ANY MVCA'S ON CHAIN         */ 00272000
         L     @11,ATCAMVCP(,ATCAPTR)                           02S0142 00273000
         CR    @11,@12                                          02S0142 00274000
         BE    @RF00142                                         02S0142 00275000
*  DO;                                                          02S0143 00276000
*    MVCAPTR = ATCAMVCP;               /*PTR TO FIRST MVCA ON CHAIN  */ 00277000
         LR    MVCAPTR,@11                                      02S0144 00278000
*    LASTINDC = OFF;                   /*INITIALIZE SWITCH           */ 00279000
         NI    LASTINDC,B'01111111'                             02S0145 00280000
*    DO WHILE(LASTINDC = OFF);         /*SEARCH MVCA CHAIN           */ 00281000
         B     @DE00146                                         02S0146 00282000
@DL00146 DS    0H                                               02S0147 00283000
*      IF MVCANXTP = ZERO THEN         /*IF LAST MVCA ON CHAIN       */ 00284000
         ICM   @12,15,MVCANXTP(MVCAPTR)                         02S0147 00285000
         BNZ   @RF00147                                         02S0147 00286000
*        DO;                                                    02S0148 00287000
*          LASTINDC = ON;              /*INDICATE LAST               */ 00288000
         OI    LASTINDC,B'10000000'                             02S0149 00289000
*          MVCAMPTR -> MVCAPRVP = MVCAPTR; /*BACK CHAIN NEW MVCA     */ 00290000
         L     @12,@PC00001                                     02S0150 00291000
         L     @12,PARMPTR(,@12)                                02S0150 00292000
         L     @12,MVCAMPTR(,@12)                               02S0150 00293000
         ST    MVCAPTR,MVCAPRVP(,@12)                           02S0150 00294000
*          MVCANXTP = MVCAMPTR;        /*PTR TO NEW MVCA             */ 00295000
         ST    @12,MVCANXTP(,MVCAPTR)                           02S0151 00296000
*        END;                                                   02S0152 00297000
*      ELSE                            /*NOT LAST MVCA ON CHAIN      */ 00298000
*      MVCAPTR =MVCANXTP;              /*PTR TO NEXT MVCA OR ZERO IF    00299000
*                                        LAST                        */ 00300000
         B     @RC00147                                         02S0153 00301000
@RF00147 L     MVCAPTR,MVCANXTP(,MVCAPTR)                       02S0153 00302000
*    END;                                                       02S0154 00303000
@RC00147 DS    0H                                               02S0154 00304000
@DE00146 TM    LASTINDC,B'10000000'                             02S0154 00305000
         BZ    @DL00146                                         02S0154 00306000
*  END;                                                         02S0155 00307000
*ELSE                                  /*NO MVCA'S ON CHAIN          */ 00308000
*  DO;                                                          02S0156 00309000
         B     @RC00142                                         02S0156 00310000
@RF00142 DS    0H                                               02S0157 00311000
*    ATCAMVCP = MVCAMPTR;              /*CHAIN IN THIS MVCA          */ 00312000
         L     @12,@PC00001                                     02S0157 00313000
         L     @12,PARMPTR(,@12)                                02S0157 00314000
         MVC   ATCAMVCP(4,ATCAPTR),MVCAMPTR(@12)                02S0157 00315000
*  END;                                                         02S0158 00316000
*  END;                                                         01S0159 00317000
@RC00142 DS    0H                                               01S0160 00318000
*/* FREE LOCAL AND CMS LOCK                                          */ 00319000
* DO; /* SETLOCK (RELEASE) TYPE(CMS) REGS(USE) RELATED(MVCA,IEFAB498(IE 00320000
*AB498)) */                                                     01S0160 00321000
@RC00078 DS    0H                                               01S0161 00322000
*   RFY (GPR11P,GPR12P,GPR13P,GPR14P) RSTD;                     01S0161 00323000
*   RFY (GPR15P,GPR00P,GPR01P) RSTD;                            01S0162 00324000
*   GPR15P = GPR11P; /* SAVE REG. 11 IN REG. 15. */             01S0163 00325000
         LR    GPR15P,GPR11P                                    01S0163 00326000
*   GPR00P = GPR12P; /* SAVE REG. 12 IN REG. 0. */              01S0164 00327000
         LR    GPR00P,GPR12P                                    01S0164 00328000
*   GPR01P = GPR13P; /* SAVE REG. 13 IN REG. 1. */              01S0165 00329000
         LR    GPR01P,GPR13P                                    01S0165 00330000
*   GPR13P = PSALITA; /* ADDRESS OF LOCK INTERFACE TABLE. */    01S0166 00331000
         L     GPR13P,PSALITA                                   01S0166 00332000
*   GEN(LM GPR11P,GPR13P,552(GPR13P)); /* LOAD LOCKWORD, CLHT AND ENTRY 00333000
*ADRS. */                                                       01S0167 00334000
         LM GPR11P,GPR13P,552(GPR13P)                                   00335000
*   GEN(BALR GPR14P,GPR13P); /* BALR TO SETLOCK RTN. */         01S0168 00336000
         BALR GPR14P,GPR13P                                             00337000
*   GPR11P = GPR15P; /* RESTORE REG. 11. */                     01S0169 00338000
         LR    GPR11P,GPR15P                                    01S0169 00339000
*   GPR15P = GPR13P; /* SAVE RETURN CODE. */                    01S0170 00340000
         LR    GPR15P,GPR13P                                    01S0170 00341000
*   GPR12P = GPR00P; /* RESTORE REG. 12 */                      01S0171 00342000
         LR    GPR12P,GPR00P                                    01S0171 00343000
*   GPR13P = GPR01P; /* RESTORE REG. 13. */                     01S0172 00344000
         LR    GPR13P,GPR01P                                    01S0172 00345000
*   RFY(GPR15P,GPR00P,GPR01P) UNRSTD;                           01S0173 00346000
*   RFY (GPR11P,GPR12P,GPR13P,GPR14P) UNRSTD;                   01S0174 00347000
* END; /* SETLOCK (RELEASE) TYPE(CMS) REGS(USE) RELATED(MVCA,IEFAB498(I 00348000
*FAB498)) */                                                    01S0175 00349000
* DO; /* SETLOCK (RELEASE) TYPE(LOCAL) REGS(USE) RELATED(MVCA,IEFAB498( 00350000
*EFAB498)) */                                                   01S0176 00351000
*   RFY (GPR11P,GPR12P,GPR13P,GPR14P) RSTD;                     01S0177 00352000
*   RFY (GPR15P,GPR00P,GPR01P) RSTD;                            01S0178 00353000
*   GPR15P = GPR11P; /* SAVE REG. 11 IN REG. 15. */             01S0179 00354000
         LR    GPR15P,GPR11P                                    01S0179 00355000
*   GPR00P = GPR12P; /* SAVE REG. 12 IN REG. 0. */              01S0180 00356000
         LR    GPR00P,GPR12P                                    01S0180 00357000
*   GPR01P = GPR13P; /* SAVE REG. 13 IN REG. 1. */              01S0181 00358000
         LR    GPR01P,GPR13P                                    01S0181 00359000
*   GPR13P = PSALITA; /* ADDRESS OF LOCK INTERFACE TABLE. */    01S0182 00360000
         L     GPR13P,PSALITA                                   01S0182 00361000
*   GEN(LM GPR11P,GPR13P,588(GPR13P)); /* LOAD LOCKWORD, CLHT AND ENTRY 00362000
*ADRS. */                                                       01S0183 00363000
         LM GPR11P,GPR13P,588(GPR13P)                                   00364000
*   GEN(BALR GPR14P,GPR13P); /* BALR TO SETLOCK RTN. */         01S0184 00365000
         BALR GPR14P,GPR13P                                             00366000
*   GPR11P = GPR15P; /* RESTORE REG. 11. */                     01S0185 00367000
         LR    GPR11P,GPR15P                                    01S0185 00368000
*   GPR15P = GPR13P; /* SAVE RETURN CODE. */                    01S0186 00369000
         LR    GPR15P,GPR13P                                    01S0186 00370000
*   GPR12P = GPR00P; /* RESTORE REG. 12 */                      01S0187 00371000
         LR    GPR12P,GPR00P                                    01S0187 00372000
*   GPR13P = GPR01P; /* RESTORE REG. 13. */                     01S0188 00373000
         LR    GPR13P,GPR01P                                    01S0188 00374000
*   RFY(GPR15P,GPR00P,GPR01P) UNRSTD;                           01S0189 00375000
*   RFY (GPR11P,GPR12P,GPR13P,GPR14P) UNRSTD;                   01S0190 00376000
* END; /* SETLOCK (RELEASE) TYPE(LOCAL) REGS(USE) RELATED(MVCA,IEFAB498 00377000
*IEFAB498)) */    /*RELEASE LOCAL LOCKS         */              01S0191 00378000
* DO; /*MODESET  EXTKEY(SCHED)*/                                01S0192 00379000
*   SPKA (16); /*SET PSW KEY*/                                  01S0193 00380000
         LA    @12,16                                           01S0193 00381000
         SPKA  0(@12)                                           01S0193 00382000
* END; /*MODESET  EXTKEY(SCHED)*/               /*GET SCHED KEY 01S0194 00383000
*      */                                                       01S0194 00384000
*RETURN CODE(RETCODE);                                          01S0195 00385000
         IC    @02,@OLDKEY                                      01S0195 00386000
         L     @13,4(,@13)                                      01S0195 00387000
         L     @00,@SIZDATD                                     01S0195 00388000
         LR    @01,@09                                          01S0195 00389000
         FSPACE   R,LV=(0),A=(1)                                        00390000
         MODESET KEYADDR=(2)                                            00391000
         LR    @15,@07                                          01S0195 00392000
         L     @14,12(,@13)                                     01S0195 00393000
         LM    @00,@12,20(@13)                                  01S0195 00394000
         BR    @14                                              01S0195 00395000
*END IEFAB498                                                   01S0196 00396000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00397000
*/*%INCLUDE SYSLIB  (B498SPEC)                                        * 00398000
*/*%INCLUDE SYSLIB  (B498DATA)                                        * 00399000
*/*%INCLUDE SYSLIB  (ADDRDATA)                                        * 00400000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        * 00401000
*/*%INCLUDE SYSLIB  (IEFZB432)                                        * 00402000
*/*%INCLUDE SYSLIB  (IEFZB433)                                        * 00403000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 00404000
*/*%INCLUDE SYSLIB  (IHAFRRS )                                        * 00405000
*/*%INCLUDE SYSLIB  (B498ADDR)                                        * 00406000
*/*%INCLUDE SYSLIB  (ADDRSPEC)                                        * 00407000
*;                                                              01S0196 00408000
@DATA    DS    0H                                                       00409000
@CH00081 DC    H'8'                                                     00410000
@DATD    DSECT                                                          00411000
         DS    0F                                                       00412000
@SA00001 DS    18F                                                      00413000
@PC00001 DS    2F                                                       00414000
IEFAB498 CSECT                                                          00415000
         DS    0F                                                       00416000
@DATD    DSECT                                                          00417000
         DS    0D                                                       00418000
MTENTPTR DS    A                                                        00419000
FRRSPTR  DS    A                                                        00420000
FRREPTR  DS    A                                                        00421000
LASTINDC DS    BL1                                                      00422000
ASIDINCD DS    BL1                                                      00423000
@OLDKEY  DS    AL1                                                      00424000
IEFAB498 CSECT                                                          00425000
         DS    0F                                                       00426000
@SIZDATD DC    AL1(230)                                                 00427000
         DC    AL3(@ENDDATD-@DATD)                                      00428000
@CV00058 DC    V(IEFAB4E1)                                              00429000
         DS    0D                                                       00430000
IEFAB498 CSECT                                                          00431000
         DS   0H                                                        00432000
PATCHLOC DC (50)X'00'                                                   00433000
@DATD    DSECT                                                          00434000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00435000
@ENDDATD EQU   *                                                        00436000
IEFAB498 CSECT                                                          00437000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00438000
@01      EQU   01                                                       00439000
@02      EQU   02                                                       00440000
@03      EQU   03                                                       00441000
@04      EQU   04                                                       00442000
@05      EQU   05                                                       00443000
@06      EQU   06                                                       00444000
@07      EQU   07                                                       00445000
@08      EQU   08                                                       00446000
@09      EQU   09                                                       00447000
@10      EQU   10                                                       00448000
@11      EQU   11                                                       00449000
@12      EQU   12                                                       00450000
@13      EQU   13                                                       00451000
@14      EQU   14                                                       00452000
@15      EQU   15                                                       00453000
RETCODE  EQU   @07                                                      00454000
NXTMVCAP EQU   @03                                                      00455000
MVCAPTR  EQU   @05                                                      00456000
LSTMVCAP EQU   @02                                                      00457000
FRRUSERP EQU   @12                                                      00458000
ATCAPTR  EQU   @06                                                      00459000
REG2     EQU   @02                                                      00460000
REG3     EQU   @03                                                      00461000
REG4     EQU   @04                                                      00462000
GPR00P   EQU   @00                                                      00463000
GPR01P   EQU   @01                                                      00464000
GPR14P   EQU   @14                                                      00465000
GPR15P   EQU   @15                                                      00466000
GPR13P   EQU   @13                                                      00467000
GPR12P   EQU   @12                                                      00468000
GPR11P   EQU   @11                                                      00469000
GPR00F   EQU   @00                                                      00470000
GPR01F   EQU   @01                                                      00471000
GPR11F   EQU   @11                                                      00472000
GPR12F   EQU   @12                                                      00473000
GPR13F   EQU   @13                                                      00474000
GPR14F   EQU   @14                                                      00475000
GPR15F   EQU   @15                                                      00476000
CVTPTR   EQU   16                                                       00477000
PSA      EQU   0                                                        00478000
FLCRNPSW EQU   PSA                                                      00479000
FLCROPSW EQU   PSA+8                                                    00480000
FLCICCW2 EQU   PSA+16                                                   00481000
PSAEEPSW EQU   PSA+132                                                  00482000
PSAESPSW EQU   PSA+136                                                  00483000
FLCSVILC EQU   PSAESPSW+1                                               00484000
PSAEPPSW EQU   PSA+140                                                  00485000
FLCPIILC EQU   PSAEPPSW+1                                               00486000
FLCPICOD EQU   PSAEPPSW+2                                               00487000
PSAPICOD EQU   FLCPICOD+1                                               00488000
FLCTEA   EQU   PSAEPPSW+4                                               00489000
FLCPER   EQU   PSA+152                                                  00490000
FLCMCLA  EQU   PSA+168                                                  00491000
FLCIOEL  EQU   FLCMCLA+4                                                00492000
FLCIOA   EQU   FLCMCLA+16                                               00493000
FLCFSA   EQU   FLCMCLA+80                                               00494000
PSASUPER EQU   PSA+552                                                  00495000
PSASUP1  EQU   PSASUPER                                                 00496000
PSASUP2  EQU   PSASUPER+1                                               00497000
PSASUP3  EQU   PSASUPER+2                                               00498000
PSASUP4  EQU   PSASUPER+3                                               00499000
PSACLHT  EQU   PSA+640                                                  00500000
PSALKSA  EQU   PSA+696                                                  00501000
PSAHLHI  EQU   PSA+760                                                  00502000
PSALITA  EQU   PSA+764                                                  00503000
PSADSSFL EQU   PSA+836                                                  00504000
PSADSSF1 EQU   PSADSSFL                                                 00505000
PSADSSF3 EQU   PSADSSFL+2                                               00506000
PSADSSF4 EQU   PSADSSFL+3                                               00507000
PSARSVT  EQU   PSA+896                                                  00508000
PARMAREA EQU   0                                                        00509000
FUNCMAP  EQU   PARMAREA                                                 00510000
DELTINDC EQU   FUNCMAP                                                  00511000
SRCHINDC EQU   FUNCMAP                                                  00512000
ASID     EQU   PARMAREA+2                                               00513000
MVCAMPTR EQU   PARMAREA+4                                               00514000
FRRPARMS EQU   0                                                        00515000
FRRP     EQU   FRRPARMS                                                 00516000
ATCA     EQU   0                                                        00517000
ATCA438P EQU   ATCA                                                     00518000
ATCAMVCP EQU   ATCA+12                                                  00519000
MVCA     EQU   0                                                        00520000
MVCAASID EQU   MVCA+2                                                   00521000
MVCAPRVP EQU   MVCA+4                                                   00522000
MVCANXTP EQU   MVCA+8                                                   00523000
MVCAXPTR EQU   MVCA+12                                                  00524000
MVCAX    EQU   0                                                        00525000
MVSWITCH EQU   MVCAX+4                                                  00526000
MTENTRY  EQU   0                                                        00527000
MTENBASE EQU   MTENTRY                                                  00528000
MTDEVPTR EQU   MTENBASE+12                                              00529000
MTDOMPTR EQU   MTENBASE+16                                              00530000
MTDEVENT EQU   0                                                        00531000
MTSTATUS EQU   MTDEVENT                                                 00532000
CVTMAP   EQU   0                                                        00533000
CVTDAR   EQU   CVTMAP+72                                                00534000
CVTFLGS1 EQU   CVTDAR                                                   00535000
CVTDCB   EQU   CVTMAP+116                                               00536000
CVTQMWR  EQU   CVTMAP+176                                               00537000
CVTOPTA  EQU   CVTMAP+182                                               00538000
CVTOPTB  EQU   CVTMAP+183                                               00539000
CVTGTF   EQU   CVTMAP+236                                               00540000
CVTGTFST EQU   CVTGTF                                                   00541000
CVTGTFS  EQU   CVTGTFST                                                 00542000
CVTSTATE EQU   CVTGTFST                                                 00543000
CVTTMODE EQU   CVTGTFST                                                 00544000
CVTFORM  EQU   CVTGTFST                                                 00545000
CVTUSR   EQU   CVTGTFST                                                 00546000
CVTAQAVT EQU   CVTMAP+240                                               00547000
CVTTCMFG EQU   CVTAQAVT                                                 00548000
CVTVOLM2 EQU   CVTMAP+244                                               00549000
CVTTATA  EQU   CVTVOLM2                                                 00550000
CVTTSKS  EQU   CVTTATA                                                  00551000
CVTVOLF2 EQU   CVTTSKS                                                  00552000
CVTTAT   EQU   CVTTATA+1                                                00553000
CVTATER  EQU   CVTMAP+248                                               00554000
CVTEXT1  EQU   CVTMAP+252                                               00555000
CVTPURG  EQU   CVTMAP+260                                               00556000
CVTQMSG  EQU   CVTMAP+268                                               00557000
CVTDMSR  EQU   CVTMAP+272                                               00558000
CVTAPF   EQU   CVTMAP+324                                               00559000
CVTEXT2  EQU   CVTMAP+328                                               00560000
CVTHJES  EQU   CVTMAP+332                                               00561000
CVTPGSIA EQU   CVTMAP+348                                               00562000
CVTA1F1  EQU   CVTMAP+356                                               00563000
CVTSYSK  EQU   CVTMAP+357                                               00564000
CVTVOLM1 EQU   CVTMAP+380                                               00565000
CVTVOLF1 EQU   CVTVOLM1                                                 00566000
CVTATMCT EQU   CVTMAP+388                                               00567000
CVTXTNT1 EQU   0                                                        00568000
CVTXTNT2 EQU   0                                                        00569000
CVTDSSV  EQU   CVTXTNT2                                                 00570000
CVTRSV90 EQU   CVTXTNT2+5                                               00571000
CVTQID   EQU   CVTXTNT2+24                                              00572000
CVTRV400 EQU   CVTXTNT2+52                                              00573000
CVTRV409 EQU   CVTXTNT2+53                                              00574000
CVTATCVT EQU   CVTXTNT2+64                                              00575000
CVTRV429 EQU   CVTXTNT2+84                                              00576000
CVTRV438 EQU   CVTXTNT2+85                                              00577000
CVTRV457 EQU   CVTXTNT2+112                                             00578000
CVTRV466 EQU   CVTXTNT2+113                                             00579000
CVTFIX   EQU   0                                                        00580000
CVTRELNO EQU   CVTFIX+252                                               00581000
FRRS     EQU   0                                                        00582000
FRRSHEAD EQU   FRRS                                                     00583000
FRRSENTR EQU   0                                                        00584000
FRRSFLGS EQU   FRRSENTR+4                                               00585000
FRRSFLG1 EQU   FRRSFLGS                                                 00586000
IEFAB438 EQU   0                                                        00587000
IKEBC    EQU   0                                                        00588000
IKEBF15  EQU   0                                                        00589000
IKEBF31  EQU   0                                                        00590000
IKEBP15  EQU   0                                                        00591000
IKEBP31  EQU   0                                                        00592000
IKEBP8   EQU   0                                                        00593000
MTDOMIDS EQU   0                                                        00594000
PARMPTR  EQU   0                                                        00595000
VMVEXITP EQU   0                                                        00596000
PSARSVTE EQU   PSARSVT                                                  00597000
CVTS01   EQU   CVTPGSIA                                                 00598000
CVTLPDIA EQU   CVTS01+12                                                00599000
CVTDIRST EQU   CVTLPDIA                                                 00600000
CVTSLIDA EQU   CVTS01+24                                                00601000
CVTCTLFG EQU   CVTS01+50                                                00602000
CVTRV210 EQU   CVTS01+424                                               00603000
CVTRV219 EQU   CVTS01+425                                               00604000
CVTRV228 EQU   CVTS01+426                                               00605000
CVTRV237 EQU   CVTS01+427                                               00606000
CVTMFRTR EQU   CVTS01+452                                               00607000
CVTRV262 EQU   CVTS01+468                                               00608000
CVTRV271 EQU   CVTS01+469                                               00609000
CVTRV280 EQU   CVTS01+470                                               00610000
CVTRV289 EQU   CVTS01+471                                               00611000
CVTGSDA  EQU   CVTS01+600                                               00612000
FLC      EQU   PSA                                                      00613000
*                                      START UNREFERENCED COMPONENTS    00614000
CVTTPIO  EQU   CVTS01+608                                               00615000
CVTADV   EQU   CVTS01+604                                               00616000
CVTGSDAB EQU   CVTGSDA                                                  00617000
CVTQV3   EQU   CVTS01+596                                               00618000
CVTQV2   EQU   CVTS01+592                                               00619000
CVTQV1   EQU   CVTS01+588                                               00620000
CVTRPT   EQU   CVTS01+584                                               00621000
CVTSSRB  EQU   CVTS01+580                                               00622000
CVTCSDRL EQU   CVTS01+576                                               00623000
CVTEXP1  EQU   CVTS01+572                                               00624000
CVTRMPMT EQU   CVTS01+568                                               00625000
CVTRMPTT EQU   CVTS01+564                                               00626000
CVTVPSA  EQU   CVTS01+560                                               00627000
CVTVSTOP EQU   CVTS01+556                                               00628000
CVTGTFR8 EQU   CVTS01+552                                               00629000
CVTQUIT  EQU   CVTS01+548                                               00630000
CVTVACR  EQU   CVTS01+544                                               00631000
CVTWTCB  EQU   CVTS01+540                                               00632000
CVTSTPRS EQU   CVTS01+536                                               00633000
CVT0PT02 EQU   CVTS01+532                                               00634000
CVTDARCM EQU   CVTS01+528                                               00635000
CVTIRECM EQU   CVTS01+524                                               00636000
CVTJRECM EQU   CVTS01+520                                               00637000
CVTVEMS0 EQU   CVTS01+516                                               00638000
CVTSPFRR EQU   CVTS01+512                                               00639000
CVTRLSTG EQU   CVTS01+508                                               00640000
CVT0TC0A EQU   CVTS01+504                                               00641000
CVTGMBR  EQU   CVTS01+500                                               00642000
CVTLFRM  EQU   CVTS01+496                                               00643000
CVTRMBR  EQU   CVTS01+492                                               00644000
CVTVIOP  EQU   CVTS01+488                                               00645000
CVTRV307 EQU   CVTS01+486                                               00646000
CVTRV306 EQU   CVTS01+484                                               00647000
CVTRV305 EQU   CVTS01+482                                               00648000
CVTRV304 EQU   CVTS01+480                                               00649000
CVTRV303 EQU   CVTS01+478                                               00650000
CVTRV302 EQU   CVTS01+476                                               00651000
CVTRV301 EQU   CVTS01+475                                               00652000
CVTRV300 EQU   CVTS01+474                                               00653000
CVTRV299 EQU   CVTS01+473                                               00654000
CVTRV298 EQU   CVTS01+472                                               00655000
CVTRV297 EQU   CVTRV289                                                 00656000
CVTRV296 EQU   CVTRV289                                                 00657000
CVTRV295 EQU   CVTRV289                                                 00658000
CVTRV294 EQU   CVTRV289                                                 00659000
CVTRV293 EQU   CVTRV289                                                 00660000
CVTRV292 EQU   CVTRV289                                                 00661000
CVTRV291 EQU   CVTRV289                                                 00662000
CVTRV290 EQU   CVTRV289                                                 00663000
CVTRV288 EQU   CVTRV280                                                 00664000
CVTRV287 EQU   CVTRV280                                                 00665000
CVTRV286 EQU   CVTRV280                                                 00666000
CVTRV285 EQU   CVTRV280                                                 00667000
CVTRV284 EQU   CVTRV280                                                 00668000
CVTRV283 EQU   CVTRV280                                                 00669000
CVTRV282 EQU   CVTRV280                                                 00670000
CVTRV281 EQU   CVTRV280                                                 00671000
CVTRV279 EQU   CVTRV271                                                 00672000
CVTRV278 EQU   CVTRV271                                                 00673000
CVTRV277 EQU   CVTRV271                                                 00674000
CVTRV276 EQU   CVTRV271                                                 00675000
CVTRV275 EQU   CVTRV271                                                 00676000
CVTRV274 EQU   CVTRV271                                                 00677000
CVTRV273 EQU   CVTRV271                                                 00678000
CVTRV272 EQU   CVTRV271                                                 00679000
CVTRV270 EQU   CVTRV262                                                 00680000
CVTRV269 EQU   CVTRV262                                                 00681000
CVTRV268 EQU   CVTRV262                                                 00682000
CVTRV267 EQU   CVTRV262                                                 00683000
CVTRV266 EQU   CVTRV262                                                 00684000
CVTRV265 EQU   CVTRV262                                                 00685000
CVTRV264 EQU   CVTRV262                                                 00686000
CVTRV263 EQU   CVTRV262                                                 00687000
CVTVFP   EQU   CVTS01+464                                               00688000
CVTVSI   EQU   CVTS01+460                                               00689000
CVTVPSIB EQU   CVTS01+456                                               00690000
CVTMFACT EQU   CVTMFRTR                                                 00691000
CVTMFCTL EQU   CVTS01+448                                               00692000
CVTPVBP  EQU   CVTS01+444                                               00693000
CVTPWI   EQU   CVTS01+440                                               00694000
CVTRV254 EQU   CVTS01+438                                               00695000
CVTRV253 EQU   CVTS01+436                                               00696000
CVTRV252 EQU   CVTS01+434                                               00697000
CVTRV251 EQU   CVTS01+433                                               00698000
CVTRV250 EQU   CVTS01+432                                               00699000
CVTRV249 EQU   CVTS01+431                                               00700000
CVTRV248 EQU   CVTS01+430                                               00701000
CVTRV247 EQU   CVTS01+429                                               00702000
CVTRV246 EQU   CVTS01+428                                               00703000
CVTRV245 EQU   CVTRV237                                                 00704000
CVTRV244 EQU   CVTRV237                                                 00705000
CVTRV243 EQU   CVTRV237                                                 00706000
CVTRV242 EQU   CVTRV237                                                 00707000
CVTRV241 EQU   CVTRV237                                                 00708000
CVTRV240 EQU   CVTRV237                                                 00709000
CVTRV239 EQU   CVTRV237                                                 00710000
CVTRV238 EQU   CVTRV237                                                 00711000
CVTRV236 EQU   CVTRV228                                                 00712000
CVTRV235 EQU   CVTRV228                                                 00713000
CVTRV234 EQU   CVTRV228                                                 00714000
CVTRV233 EQU   CVTRV228                                                 00715000
CVTRV232 EQU   CVTRV228                                                 00716000
CVTRV231 EQU   CVTRV228                                                 00717000
CVTRV230 EQU   CVTRV228                                                 00718000
CVTRV229 EQU   CVTRV228                                                 00719000
CVTRV227 EQU   CVTRV219                                                 00720000
CVTRV226 EQU   CVTRV219                                                 00721000
CVTRV225 EQU   CVTRV219                                                 00722000
CVTRV224 EQU   CVTRV219                                                 00723000
CVTRV223 EQU   CVTRV219                                                 00724000
CVTRV222 EQU   CVTRV219                                                 00725000
CVTRV221 EQU   CVTRV219                                                 00726000
CVTRV220 EQU   CVTRV219                                                 00727000
CVTRV218 EQU   CVTRV210                                                 00728000
CVTRV217 EQU   CVTRV210                                                 00729000
CVTRV216 EQU   CVTRV210                                                 00730000
CVTRV215 EQU   CVTRV210                                                 00731000
CVTRV214 EQU   CVTRV210                                                 00732000
CVTRV213 EQU   CVTRV210                                                 00733000
CVTRV212 EQU   CVTRV210                                                 00734000
CVTRV211 EQU   CVTRV210                                                 00735000
CVTLCCAT EQU   CVTS01+420                                               00736000
CVTPCCAT EQU   CVTS01+416                                               00737000
CVTIPCRP EQU   CVTS01+412                                               00738000
CVTIPCRI EQU   CVTS01+408                                               00739000
CVTIPCDS EQU   CVTS01+404                                               00740000
CVTAIDVT EQU   CVTS01+400                                               00741000
CVTSSAP  EQU   CVTS01+396                                               00742000
CVTEHCIR EQU   CVTS01+392                                               00743000
CVTEHDEF EQU   CVTS01+388                                               00744000
CVTDAIR  EQU   CVTS01+384                                               00745000
CVTPERFM EQU   CVTS01+380                                               00746000
CVT044R2 EQU   CVTS01+376                                               00747000
CVTFETCH EQU   CVTS01+372                                               00748000
CVTRSTWD EQU   CVTS01+368                                               00749000
CVTSPOST EQU   CVTS01+364                                               00750000
CVTIOBP  EQU   CVTS01+360                                               00751000
CVTASMVT EQU   CVTS01+356                                               00752000
CVTRECRQ EQU   CVTS01+352                                               00753000
CVTWSAC  EQU   CVTS01+348                                               00754000
CVTWSAG  EQU   CVTS01+344                                               00755000
CVTWSAL  EQU   CVTS01+340                                               00756000
CVTSPSA  EQU   CVTS01+336                                               00757000
CVTGLMN  EQU   CVTS01+332                                               00758000
CVTVEAC0 EQU   CVTS01+328                                               00759000
CVT062R1 EQU   CVTS01+324                                               00760000
CVTRPOST EQU   CVTS01+320                                               00761000
CVTDQIQE EQU   CVTS01+316                                               00762000
CVTCSD   EQU   CVTS01+312                                               00763000
CVTLKRMA EQU   CVTS01+308                                               00764000
CVTRSPIE EQU   CVTS01+304                                               00765000
CVTRENQ  EQU   CVTS01+300                                               00766000
CVTLQCB  EQU   CVTS01+296                                               00767000
CVTFQCB  EQU   CVTS01+292                                               00768000
CVTQCS01 EQU   CVTS01+288                                               00769000
CVTAPFT  EQU   CVTS01+284                                               00770000
CVTPARRL EQU   CVTS01+280                                               00771000
CVTVWAIT EQU   CVTS01+276                                               00772000
CVTGSPL  EQU   CVTS01+272                                               00773000
CVTLSMQ  EQU   CVTS01+268                                               00774000
CVTGSMQ  EQU   CVTS01+264                                               00775000
CVTEXPRO EQU   CVTS01+260                                               00776000
CVTOPCTP EQU   CVTS01+256                                               00777000
CVTSIC   EQU   CVTS01+252                                               00778000
CVTTPIOS EQU   CVTS01+248                                               00779000
CVTRTMS  EQU   CVTS01+244                                               00780000
CVTSDBF  EQU   CVTS01+240                                               00781000
CVTSCBP  EQU   CVTS01+236                                               00782000
CVTSDMP  EQU   CVTS01+232                                               00783000
CVTSV60  EQU   CVTS01+228                                               00784000
CVTRTMCT EQU   CVTS01+224                                               00785000
CVTASCBL EQU   CVTS01+220                                               00786000
CVTASCBH EQU   CVTS01+216                                               00787000
CVTGDA   EQU   CVTS01+212                                               00788000
CVTASVT  EQU   CVTS01+208                                               00789000
CVTVVMDI EQU   CVTS01+204                                               00790000
CVTAQTOP EQU   CVTS01+200                                               00791000
CVTIOSCS EQU   CVTS01+196                                               00792000
CVTSDRM  EQU   CVTS01+192                                               00793000
CVTOPTE  EQU   CVTS01+188                                               00794000
CVTSTXU  EQU   CVTS01+184                                               00795000
CVTQUIS  EQU   CVTS01+180                                               00796000
CVTPARS  EQU   CVTS01+176                                               00797000
CVTS1EE  EQU   CVTS01+172                                               00798000
CVTFRAS  EQU   CVTS01+168                                               00799000
CVTQSAS  EQU   CVTS01+164                                               00800000
CVTCRAS  EQU   CVTS01+160                                               00801000
CVTCRMN  EQU   CVTS01+156                                               00802000
CVTDELCP EQU   CVTS01+152                                               00803000
CVTFRECL EQU   CVTS01+148                                               00804000
CVTGETCL EQU   CVTS01+144                                               00805000
CVTBLDCP EQU   CVTS01+140                                               00806000
CVTAUTHL EQU   CVTS01+136                                               00807000
CVTSCAN  EQU   CVTS01+132                                               00808000
CVTRV144 EQU   CVTS01+130                                               00809000
CVTMAXMP EQU   CVTS01+128                                               00810000
CVTSTCK  EQU   CVTS01+124                                               00811000
CVTRV139 EQU   CVTS01+123                                               00812000
CVTDSSAC EQU   CVTS01+122                                               00813000
CVTRV513 EQU   CVTS01+121                                               00814000
CVTIOSPL EQU   CVTS01+120                                               00815000
CVTPTGT  EQU   CVTS01+116                                               00816000
CVTCSPIE EQU   CVTS01+112                                               00817000
CVTSMFEX EQU   CVTS01+108                                               00818000
CVTOLT0A EQU   CVTS01+104                                               00819000
CVTSRBRT EQU   CVTS01+100                                               00820000
CVTPUTL  EQU   CVTS01+96                                                00821000
CVTSYSWT EQU   CVTS01+92                                                00822000
CVTRV327 EQU   CVTS01+88                                                00823000
CVTRV326 EQU   CVTS01+84                                                00824000
CVTRV325 EQU   CVTS01+80                                                00825000
CVTRV324 EQU   CVTS01+76                                                00826000
CVT0VL01 EQU   CVTS01+72                                                00827000
CVTSHRVM EQU   CVTS01+68                                                00828000
CVTRV332 EQU   CVTS01+64                                                00829000
CVTTAS   EQU   CVTS01+60                                                00830000
CVTRSCN  EQU   CVTS01+56                                                00831000
CVTTRAC2 EQU   CVTS01+54                                                00832000
CVTTRACE EQU   CVTS01+52                                                00833000
CVTAPG   EQU   CVTS01+51                                                00834000
CVTSDTRC EQU   CVTCTLFG                                                 00835000
CVTGTRCE EQU   CVTCTLFG                                                 00836000
CVTNOMP  EQU   CVTCTLFG                                                 00837000
CVTRSV79 EQU   CVTCTLFG                                                 00838000
CVTDSTAT EQU   CVTCTLFG                                                 00839000
CVTRSV78 EQU   CVTCTLFG                                                 00840000
CVTRV333 EQU   CVTCTLFG                                                 00841000
CVTRV323 EQU   CVTCTLFG                                                 00842000
CVTSPVLK EQU   CVTS01+49                                                00843000
CVTRSV77 EQU   CVTS01+48                                                00844000
CVTRV331 EQU   CVTS01+44                                                00845000
CVTRV330 EQU   CVTS01+40                                                00846000
CVTRV329 EQU   CVTS01+36                                                00847000
CVTRV328 EQU   CVTS01+32                                                00848000
CVTRV322 EQU   CVTS01+28                                                00849000
CVTSLID  EQU   CVTSLIDA+1                                               00850000
CVTSYLK  EQU   CVTSLIDA                                                 00851000
CVTRV321 EQU   CVTS01+20                                                00852000
CVTRV320 EQU   CVTS01+16                                                00853000
CVTLPDIR EQU   CVTLPDIA+1                                               00854000
CVTRSV69 EQU   CVTDIRST                                                 00855000
CVTRSV68 EQU   CVTDIRST                                                 00856000
CVTRSV67 EQU   CVTDIRST                                                 00857000
CVTRSV66 EQU   CVTDIRST                                                 00858000
CVTRSV65 EQU   CVTDIRST                                                 00859000
CVTRSV64 EQU   CVTDIRST                                                 00860000
CVTRSV63 EQU   CVTDIRST                                                 00861000
CVTDICOM EQU   CVTDIRST                                                 00862000
CVTPVTP  EQU   CVTS01+8                                                 00863000
CVTLPDSR EQU   CVTS01+4                                                 00864000
CVTGETL  EQU   CVTS01                                                   00865000
PSARSAV  EQU   PSARSVTE+60                                              00866000
PSARSTK  EQU   PSARSVTE+56                                              00867000
PSAESAV3 EQU   PSARSVTE+52                                              00868000
PSAESTK3 EQU   PSARSVTE+48                                              00869000
PSAESAV2 EQU   PSARSVTE+44                                              00870000
PSAESTK2 EQU   PSARSVTE+40                                              00871000
PSAESAV1 EQU   PSARSVTE+36                                              00872000
PSAESTK1 EQU   PSARSVTE+32                                              00873000
PSAPSAV  EQU   PSARSVTE+28                                              00874000
PSAPSTK  EQU   PSARSVTE+24                                              00875000
PSAMSAV  EQU   PSARSVTE+20                                              00876000
PSAMSTK  EQU   PSARSVTE+16                                              00877000
PSASSAV  EQU   PSARSVTE+12                                              00878000
PSASSTK  EQU   PSARSVTE+8                                               00879000
PSANSTK  EQU   PSARSVTE+4                                               00880000
PSACSTK  EQU   PSARSVTE                                                 00881000
FRRSPARM EQU   FRRSENTR+8                                               00882000
@NM00035 EQU   FRRSFLGS+1                                               00883000
@NM00034 EQU   FRRSFLG1                                                 00884000
FRRSNEST EQU   FRRSFLG1                                                 00885000
FRRSRCUR EQU   FRRSFLG1                                                 00886000
FRRSFRRA EQU   FRRSENTR                                                 00887000
FRRSENTS EQU   FRRS+84                                                  00888000
FRRSRTMW EQU   FRRS+16                                                  00889000
FRRSCURR EQU   FRRSHEAD+12                                              00890000
FRRSELEN EQU   FRRSHEAD+8                                               00891000
FRRSLAST EQU   FRRSHEAD+4                                               00892000
FRRSEMP  EQU   FRRSHEAD                                                 00893000
CVTLEVL  EQU   CVTRELNO+2                                               00894000
CVTNUMB  EQU   CVTRELNO                                                 00895000
CVTMDL   EQU   CVTFIX+250                                               00896000
@NM00033 EQU   CVTFIX+248                                               00897000
@NM00032 EQU   CVTFIX                                                   00898000
CVTRV482 EQU   CVTXTNT2+128                                             00899000
CVTRV481 EQU   CVTXTNT2+124                                             00900000
CVTRV480 EQU   CVTXTNT2+120                                             00901000
CVTRV479 EQU   CVTXTNT2+118                                             00902000
CVTRV478 EQU   CVTXTNT2+117                                             00903000
CVTRV477 EQU   CVTXTNT2+116                                             00904000
CVTRV476 EQU   CVTXTNT2+115                                             00905000
CVTRV475 EQU   CVTXTNT2+114                                             00906000
CVTRV474 EQU   CVTRV466                                                 00907000
CVTRV473 EQU   CVTRV466                                                 00908000
CVTRV472 EQU   CVTRV466                                                 00909000
CVTRV471 EQU   CVTRV466                                                 00910000
CVTRV470 EQU   CVTRV466                                                 00911000
CVTRV469 EQU   CVTRV466                                                 00912000
CVTRV468 EQU   CVTRV466                                                 00913000
CVTRV467 EQU   CVTRV466                                                 00914000
CVTRV465 EQU   CVTRV457                                                 00915000
CVTRV464 EQU   CVTRV457                                                 00916000
CVTRV463 EQU   CVTRV457                                                 00917000
CVTRV462 EQU   CVTRV457                                                 00918000
CVTRV461 EQU   CVTRV457                                                 00919000
CVTRV460 EQU   CVTRV457                                                 00920000
CVTRV459 EQU   CVTRV457                                                 00921000
CVTRV458 EQU   CVTRV457                                                 00922000
CVTRV456 EQU   CVTXTNT2+108                                             00923000
CVTRV455 EQU   CVTXTNT2+104                                             00924000
CVTRV454 EQU   CVTXTNT2+100                                             00925000
CVTRV453 EQU   CVTXTNT2+96                                              00926000
CVTRV452 EQU   CVTXTNT2+94                                              00927000
CVTRV451 EQU   CVTXTNT2+92                                              00928000
CVTRV450 EQU   CVTXTNT2+90                                              00929000
CVTRV449 EQU   CVTXTNT2+88                                              00930000
CVTRV448 EQU   CVTXTNT2+87                                              00931000
CVTRV447 EQU   CVTXTNT2+86                                              00932000
CVTRV446 EQU   CVTRV438                                                 00933000
CVTRV445 EQU   CVTRV438                                                 00934000
CVTRV444 EQU   CVTRV438                                                 00935000
CVTRV443 EQU   CVTRV438                                                 00936000
CVTRV442 EQU   CVTRV438                                                 00937000
CVTRV441 EQU   CVTRV438                                                 00938000
CVTRV440 EQU   CVTRV438                                                 00939000
CVTRV439 EQU   CVTRV438                                                 00940000
CVTRV437 EQU   CVTRV429                                                 00941000
CVTRV436 EQU   CVTRV429                                                 00942000
CVTRV435 EQU   CVTRV429                                                 00943000
CVTRV434 EQU   CVTRV429                                                 00944000
CVTRV433 EQU   CVTRV429                                                 00945000
CVTRV432 EQU   CVTRV429                                                 00946000
CVTRV431 EQU   CVTRV429                                                 00947000
CVTRV430 EQU   CVTRV429                                                 00948000
CVTRV428 EQU   CVTXTNT2+80                                              00949000
CVTRV427 EQU   CVTXTNT2+76                                              00950000
CVTRV426 EQU   CVTXTNT2+72                                              00951000
CVTRV425 EQU   CVTXTNT2+68                                              00952000
CVTATACT EQU   CVTATCVT                                                 00953000
CVTRV423 EQU   CVTXTNT2+62                                              00954000
CVTRV422 EQU   CVTXTNT2+60                                              00955000
CVTRV421 EQU   CVTXTNT2+58                                              00956000
CVTRV420 EQU   CVTXTNT2+56                                              00957000
CVTRV419 EQU   CVTXTNT2+55                                              00958000
CVTRV418 EQU   CVTXTNT2+54                                              00959000
CVTRV417 EQU   CVTRV409                                                 00960000
CVTRV416 EQU   CVTRV409                                                 00961000
CVTRV415 EQU   CVTRV409                                                 00962000
CVTRV414 EQU   CVTRV409                                                 00963000
CVTRV413 EQU   CVTRV409                                                 00964000
CVTRV412 EQU   CVTRV409                                                 00965000
CVTRV411 EQU   CVTRV409                                                 00966000
CVTRV410 EQU   CVTRV409                                                 00967000
CVTRV408 EQU   CVTRV400                                                 00968000
CVTRV407 EQU   CVTRV400                                                 00969000
CVTRV406 EQU   CVTRV400                                                 00970000
CVTRV405 EQU   CVTRV400                                                 00971000
CVTRV404 EQU   CVTRV400                                                 00972000
CVTRV403 EQU   CVTRV400                                                 00973000
CVTRV402 EQU   CVTRV400                                                 00974000
CVTRV401 EQU   CVTRV400                                                 00975000
CVTRSVA1 EQU   CVTXTNT2+48                                              00976000
CVTRSVA0 EQU   CVTXTNT2+44                                              00977000
CVTRSV99 EQU   CVTXTNT2+40                                              00978000
CVTRSV98 EQU   CVTXTNT2+36                                              00979000
CVTRSV97 EQU   CVTXTNT2+34                                              00980000
CVTRSV96 EQU   CVTXTNT2+32                                              00981000
CVTOLTEP EQU   CVTXTNT2+28                                              00982000
CVTQIDA  EQU   CVTQID+1                                                 00983000
CVTRSV95 EQU   CVTQID                                                   00984000
CVTRSV94 EQU   CVTXTNT2+20                                              00985000
CVTRSV93 EQU   CVTXTNT2+16                                              00986000
CVTRSV92 EQU   CVTXTNT2+12                                              00987000
CVTDEBVR EQU   CVTXTNT2+8                                               00988000
CVTRSV91 EQU   CVTXTNT2+6                                               00989000
CVTRSV9H EQU   CVTRSV90                                                 00990000
CVTRSV9G EQU   CVTRSV90                                                 00991000
CVTRSV9F EQU   CVTRSV90                                                 00992000
CVTRSV9E EQU   CVTRSV90                                                 00993000
CVTRSV9D EQU   CVTRSV90                                                 00994000
CVTRSV9C EQU   CVTRSV90                                                 00995000
CVTRSV9B EQU   CVTRSV90                                                 00996000
CVTRSV9A EQU   CVTRSV90                                                 00997000
CVTNUCLS EQU   CVTXTNT2+4                                               00998000
CVTDSSVA EQU   CVTDSSV+1                                                00999000
CVTRSV89 EQU   CVTDSSV                                                  01000000
CVTRSV88 EQU   CVTXTNT1+8                                               01001000
CVTRSV87 EQU   CVTXTNT1+4                                               01002000
CVTFACHN EQU   CVTXTNT1                                                 01003000
CVTRV488 EQU   CVTMAP+412                                               01004000
CVTRV487 EQU   CVTMAP+408                                               01005000
CVTRV486 EQU   CVTMAP+404                                               01006000
CVTRV485 EQU   CVTMAP+400                                               01007000
CVTRV484 EQU   CVTMAP+396                                               01008000
CVTAUTH  EQU   CVTMAP+392                                               01009000
CVTATMCA EQU   CVTATMCT+1                                               01010000
CVTATMST EQU   CVTATMCT                                                 01011000
CVTRSV61 EQU   CVTMAP+384                                               01012000
CVTVOLT1 EQU   CVTVOLM1+1                                               01013000
CVTVOLI1 EQU   CVTVOLF1                                                 01014000
CVTSTOA  EQU   CVTMAP+376                                               01015000
CVTRSV58 EQU   CVTMAP+374                                               01016000
CVTRSV57 EQU   CVTMAP+372                                               01017000
CVTDDCE  EQU   CVTMAP+368                                               01018000
CVTPNWFR EQU   CVTMAP+364                                               01019000
CVTSMF   EQU   CVTMAP+360                                               01020000
CVTSULK  EQU   CVTMAP+358                                               01021000
CVTSLKO  EQU   CVTSYSK                                                  01022000
CVTSLKP  EQU   CVTSYSK                                                  01023000
CVTSLKQ  EQU   CVTSYSK                                                  01024000
CVTSLKR  EQU   CVTSYSK                                                  01025000
CVTRSV56 EQU   CVTSYSK                                                  01026000
CVTRSV55 EQU   CVTSYSK                                                  01027000
CVTRSV54 EQU   CVTSYSK                                                  01028000
CVTRSV53 EQU   CVTSYSK                                                  01029000
CVTRSV52 EQU   CVTA1F1                                                  01030000
CVTRSV51 EQU   CVTA1F1                                                  01031000
CVTRSV50 EQU   CVTA1F1                                                  01032000
CVTRSV49 EQU   CVTA1F1                                                  01033000
CVTRSV48 EQU   CVTA1F1                                                  01034000
CVTRSV47 EQU   CVTA1F1                                                  01035000
CVTSRSW  EQU   CVTA1F1                                                  01036000
CVTPFSW  EQU   CVTA1F1                                                  01037000
CVTPCVT  EQU   CVTMAP+352                                               01038000
CVTRSV46 EQU   CVTMAP+344                                               01039000
CVTRSV45 EQU   CVTMAP+340                                               01040000
CVTRSV44 EQU   CVTMAP+338                                               01041000
CVTRSV43 EQU   CVTMAP+336                                               01042000
CVTHJESA EQU   CVTHJES+1                                                01043000
CVTRSV42 EQU   CVTHJES                                                  01044000
CVTEXT2A EQU   CVTEXT2+1                                                01045000
CVTRSV41 EQU   CVTEXT2                                                  01046000
CVTAPFA  EQU   CVTAPF+1                                                 01047000
CVTRSV40 EQU   CVTAPF                                                   01048000
CVTINTLA EQU   CVTMAP+320                                               01049000
CVTERPV  EQU   CVTMAP+316                                               01050000
CVTEORM  EQU   CVTMAP+312                                               01051000
CVTMCHPR EQU   CVTMAP+308                                               01052000
CVTTZ    EQU   CVTMAP+304                                               01053000
CVTJEPS  EQU   CVTMAP+300                                               01054000
CVTJESCT EQU   CVTMAP+296                                               01055000
CVTMODE  EQU   CVTMAP+292                                               01056000
CVTPTRV  EQU   CVTMAP+288                                               01057000
CVTREAL  EQU   CVTMAP+284                                               01058000
CVTRSV39 EQU   CVTMAP+280                                               01059000
CVTRSV38 EQU   CVTMAP+276                                               01060000
CVTDMSRA EQU   CVTDMSR+1                                                01061000
CVTRSV37 EQU   CVTDMSR                                                  01062000
CVTQMSGA EQU   CVTQMSG+1                                                01063000
CVTRSV36 EQU   CVTQMSG                                                  01064000
CVTAMFF  EQU   CVTMAP+264                                               01065000
CVTPURGA EQU   CVTPURG+1                                                01066000
CVTRSV35 EQU   CVTPURG                                                  01067000
CVTCBSP  EQU   CVTMAP+256                                               01068000
CVTATERA EQU   CVTATER+1                                                01069000
CVTSYST  EQU   CVTATER                                                  01070000
CVTVOLT2 EQU   CVTTAT                                                   01071000
CVTVOLI2 EQU   CVTVOLF2                                                 01072000
CVTAQAVB EQU   CVTAQAVT+1                                               01073000
CVTRSV34 EQU   CVTTCMFG                                                 01074000
CVTRSV33 EQU   CVTTCMFG                                                 01075000
CVTRSV32 EQU   CVTTCMFG                                                 01076000
CVTRSV31 EQU   CVTTCMFG                                                 01077000
CVTRSV30 EQU   CVTTCMFG                                                 01078000
CVTRSV29 EQU   CVTTCMFG                                                 01079000
CVTRSV28 EQU   CVTTCMFG                                                 01080000
CVTTCRDY EQU   CVTTCMFG                                                 01081000
CVTGTFA  EQU   CVTGTF+1                                                 01082000
CVTRSV27 EQU   CVTGTFST                                                 01083000
CVTRNIO  EQU   CVTGTFST                                                 01084000
CVTRV319 EQU   CVTUSR                                                   01085000
CVTRV318 EQU   CVTFORM                                                  01086000
CVTRV317 EQU   CVTTMODE                                                 01087000
CVTRV316 EQU   CVTSTATE                                                 01088000
CVTRV315 EQU   CVTGTFS                                                  01089000
CVTGTFAV EQU   CVTGTFS                                                  01090000
CVT0SCR1 EQU   CVTMAP+232                                               01091000
CVTRV515 EQU   CVTMAP+228                                               01092000
CVTRMS   EQU   CVTMAP+224                                               01093000
CVTPATCH EQU   CVTMAP+220                                               01094000
CVTTSCE  EQU   CVTMAP+216                                               01095000
CVTLNKSC EQU   CVTMAP+214                                               01096000
CVTQABST EQU   CVTMAP+212                                               01097000
CVTMDLDS EQU   CVTMAP+208                                               01098000
CVTUSER  EQU   CVTMAP+204                                               01099000
CVTABEND EQU   CVTMAP+200                                               01100000
CVTSMCA  EQU   CVTMAP+196                                               01101000
CVTRSV18 EQU   CVTMAP+192                                               01102000
CVTQLPAQ EQU   CVTMAP+188                                               01103000
CVTQCDSR EQU   CVTMAP+184                                               01104000
CVTRSV17 EQU   CVTOPTB                                                  01105000
CVTRSV16 EQU   CVTOPTB                                                  01106000
CVTFP    EQU   CVTOPTB                                                  01107000
CVTAPTHR EQU   CVTOPTB                                                  01108000
CVTNLOG  EQU   CVTOPTB                                                  01109000
CVTTOD   EQU   CVTOPTB                                                  01110000
CVTCTIMS EQU   CVTOPTB                                                  01111000
CVTPROT  EQU   CVTOPTB                                                  01112000
CVTXPFP  EQU   CVTOPTA                                                  01113000
CVTASCII EQU   CVTOPTA                                                  01114000
CVTRSV13 EQU   CVTOPTA                                                  01115000
CVTRSV12 EQU   CVTOPTA                                                  01116000
CVTNIP   EQU   CVTOPTA                                                  01117000
CVTDDR   EQU   CVTOPTA                                                  01118000
CVTAPR   EQU   CVTOPTA                                                  01119000
CVTCCH   EQU   CVTOPTA                                                  01120000
CVTSNCTR EQU   CVTMAP+180                                               01121000
CVTQOCR  EQU   CVTMAP+172                                               01122000
CVT1EF00 EQU   CVTMAP+168                                               01123000
CVTMZ00  EQU   CVTMAP+164                                               01124000
CVTHEAD  EQU   CVTMAP+160                                               01125000
CVTRSV11 EQU   CVTMAP+156                                               01126000
CVT0PT01 EQU   CVTMAP+152                                               01127000
CVTMSER  EQU   CVTMAP+148                                               01128000
CVTIERLC EQU   CVTMAP+144                                               01129000
CVTILCH  EQU   CVTMAP+140                                               01130000
CVT0DS   EQU   CVTMAP+136                                               01131000
CVTFBOSV EQU   CVTMAP+132                                               01132000
CVTNUCB  EQU   CVTMAP+128                                               01133000
CVTIXAVL EQU   CVTMAP+124                                               01134000
CVTIOQET EQU   CVTMAP+120                                               01135000
CVTDCBA  EQU   CVTMAP+117                                               01136000
CVTMVS2  EQU   CVTDCB                                                   01137000
CVT6DAT  EQU   CVTDCB                                                   01138000
CVT4MPS  EQU   CVTDCB                                                   01139000
CVTRSV09 EQU   CVTDCB                                                   01140000
CVT4MS1  EQU   CVTDCB                                                   01141000
CVT2SPS  EQU   CVTDCB                                                   01142000
CVT1SSS  EQU   CVTDCB                                                   01143000
CVTRSV08 EQU   CVTDCB                                                   01144000
CVTSTB   EQU   CVTMAP+112                                               01145000
CVTQTD00 EQU   CVTMAP+108                                               01146000
CVTQTE00 EQU   CVTMAP+104                                               01147000
CVTCUCB  EQU   CVTMAP+100                                               01148000
CVTSJQ   EQU   CVTMAP+96                                                01149000
CVTPBLDL EQU   CVTMAP+92                                                01150000
CVTTPC   EQU   CVTMAP+88                                                01151000
CVTSVDCB EQU   CVTMAP+84                                                01152000
CVTBRET  EQU   CVTMAP+82                                                01153000
CVTEXIT  EQU   CVTMAP+80                                                01154000
CVT0FN00 EQU   CVTMAP+76                                                01155000
CVTDARA  EQU   CVTDAR+1                                                 01156000
CVTRSV07 EQU   CVTFLGS1                                                 01157000
CVTRSV06 EQU   CVTFLGS1                                                 01158000
CVTRSV05 EQU   CVTFLGS1                                                 01159000
CVTRSV04 EQU   CVTFLGS1                                                 01160000
CVTRSV03 EQU   CVTFLGS1                                                 01161000
CVTRSV02 EQU   CVTFLGS1                                                 01162000
CVTRSV01 EQU   CVTFLGS1                                                 01163000
CVTDMPLK EQU   CVTFLGS1                                                 01164000
CVTXITP  EQU   CVTMAP+68                                                01165000
CVTZDTAB EQU   CVTMAP+64                                                01166000
CVTMSLT  EQU   CVTMAP+60                                                01167000
CVTDATE  EQU   CVTMAP+56                                                01168000
CVTBTERM EQU   CVTMAP+52                                                01169000
CVTSYSAD EQU   CVTMAP+48                                                01170000
CVTXTLER EQU   CVTMAP+44                                                01171000
CVTILK2  EQU   CVTMAP+40                                                01172000
CVTILK1  EQU   CVTMAP+36                                                01173000
CVTPRLTV EQU   CVTMAP+32                                                01174000
CVTPCNVT EQU   CVTMAP+28                                                01175000
CVT0VL00 EQU   CVTMAP+24                                                01176000
CVTXAPG  EQU   CVTMAP+20                                                01177000
CVTBUF   EQU   CVTMAP+16                                                01178000
CVTJOB   EQU   CVTMAP+12                                                01179000
CVTLINK  EQU   CVTMAP+8                                                 01180000
CVT0EF00 EQU   CVTMAP+4                                                 01181000
CVTTCBP  EQU   CVTMAP                                                   01182000
CVT      EQU   CVTMAP                                                   01183000
MTDSNMP  EQU   MTDEVENT+4                                               01184000
MTUCBPTR EQU   MTDEVENT+1                                               01185000
MTVRSVRD EQU   MTSTATUS                                                 01186000
MTVRYVFY EQU   MTSTATUS                                                 01187000
MTVRYLBL EQU   MTSTATUS                                                 01188000
MTVRYPND EQU   MTSTATUS                                                 01189000
MTNXTPTR EQU   MTENBASE+8                                               01190000
MTPRVPTR EQU   MTENBASE+4                                               01191000
@NM00031 EQU   MTENBASE+2                                               01192000
MTLENGTH EQU   MTENBASE                                                 01193000
MVTPECB  EQU   MVCAX+20                                                 01194000
MVDAECB  EQU   MVCAX+16                                                 01195000
MVNODEVE EQU   MVCAX+14                                                 01196000
MVWTORRA EQU   MVCAX+12                                                 01197000
MVENTRYP EQU   MVCAX+8                                                  01198000
MVNUMWTS EQU   MVCAX+6                                                  01199000
MVWTORSW EQU   MVSWITCH                                                 01200000
MVDISDSN EQU   MVSWITCH                                                 01201000
MVDEVECB EQU   MVCAX                                                    01202000
@NM00030 EQU   MVCA                                                     01203000
@NM00029 EQU   ATCA+8                                                   01204000
@NM00028 EQU   ATCA+4                                                   01205000
@NM00003 EQU   FRRPARMS+8                                               01206000
@NM00002 EQU   FRRPARMS+4                                               01207000
@NM00001 EQU   FUNCMAP                                                  01208000
ADDINDC  EQU   FUNCMAP                                                  01209000
@NM00027 EQU   PSA+3412                                                 01210000
PSASTAK  EQU   PSA+3072                                                 01211000
@NM00026 EQU   PSA+1032                                                 01212000
PSAUSEND EQU   PSA+1032                                                 01213000
PSAPCPSW EQU   PSA+1024                                                 01214000
PSARV060 EQU   PSA+1020                                                 01215000
PSARV059 EQU   PSA+1018                                                 01216000
PSASVC13 EQU   PSA+1016                                                 01217000
PSALSFCC EQU   PSA+1012                                                 01218000
PSASFACC EQU   PSA+1008                                                 01219000
PSASTOP  EQU   PSA+992                                                  01220000
PSASTART EQU   PSA+976                                                  01221000
PSARSPSW EQU   PSA+968                                                  01222000
PSASRPSW EQU   PSA+960                                                  01223000
PSARV045 EQU   PSA+892                                                  01224000
PSARV044 EQU   PSA+888                                                  01225000
PSARV043 EQU   PSA+884                                                  01226000
PSARV042 EQU   PSA+880                                                  01227000
PSARV041 EQU   PSA+876                                                  01228000
PSARV040 EQU   PSA+872                                                  01229000
PSARV025 EQU   PSA+868                                                  01230000
PSADSSED EQU   PSA+868                                                  01231000
PSADSSPR EQU   PSA+864                                                  01232000
PSADSSFW EQU   PSA+860                                                  01233000
PSADSS14 EQU   PSA+856                                                  01234000
PSADSSPP EQU   PSA+848                                                  01235000
PSADSSRP EQU   PSA+840                                                  01236000
PSADSS05 EQU   PSADSSF4                                                 01237000
PSADSS10 EQU   PSADSSF4                                                 01238000
PSADSSVE EQU   PSADSSF4                                                 01239000
PSADSSDE EQU   PSADSSF4                                                 01240000
PSADSSC0 EQU   PSADSSF4                                                 01241000
PSADSSIE EQU   PSADSSF4                                                 01242000
PSADSS12 EQU   PSADSSF4                                                 01243000
PSADSSRC EQU   PSADSSF4                                                 01244000
PSARV057 EQU   PSADSSF3                                                 01245000
PSARV056 EQU   PSADSSF3                                                 01246000
PSARV055 EQU   PSADSSF3                                                 01247000
PSARV054 EQU   PSADSSF3                                                 01248000
PSADSSRW EQU   PSADSSF3                                                 01249000
PSADSSNM EQU   PSADSSF3                                                 01250000
PSADSSES EQU   PSADSSF3                                                 01251000
PSADSSGP EQU   PSADSSF3                                                 01252000
PSADSSF2 EQU   PSADSSFL+1                                               01253000
PSADSSPI EQU   PSADSSF1                                                 01254000
PSADSSOI EQU   PSADSSF1                                                 01255000
PSADSSSP EQU   PSADSSF1                                                 01256000
PSADSSTP EQU   PSADSSF1                                                 01257000
PSADSSDW EQU   PSADSSF1                                                 01258000
PSADSSDD EQU   PSADSSF1                                                 01259000
PSADSSDM EQU   PSADSSF1                                                 01260000
PSADSSMV EQU   PSADSSF1                                                 01261000
PSADSSTS EQU   PSA+816                                                  01262000
PSADSSWK EQU   PSA+812                                                  01263000
PSADSSR3 EQU   PSA+808                                                  01264000
PSADSSR2 EQU   PSA+804                                                  01265000
PSADSSRS EQU   PSA+800                                                  01266000
PSASTOR  EQU   PSA+796                                                  01267000
PSACPUSA EQU   PSA+794                                                  01268000
PSAVSTAP EQU   PSA+792                                                  01269000
PSAWKVAP EQU   PSA+788                                                  01270000
PSAWKRAP EQU   PSA+784                                                  01271000
PSAMCHIC EQU   PSA+783                                                  01272000
PSARV061 EQU   PSA+782                                                  01273000
PSASYMSK EQU   PSA+781                                                  01274000
PSAMCHFL EQU   PSA+780                                                  01275000
PSACR0   EQU   PSA+776                                                  01276000
PSAPSWSV EQU   PSA+768                                                  01277000
PSACLHS  EQU   PSAHLHI                                                  01278000
PSALKR15 EQU   PSALKSA+60                                               01279000
PSALKR14 EQU   PSALKSA+56                                               01280000
PSALKR13 EQU   PSALKSA+52                                               01281000
PSALKR12 EQU   PSALKSA+48                                               01282000
PSALKR11 EQU   PSALKSA+44                                               01283000
PSALKR10 EQU   PSALKSA+40                                               01284000
PSALKR9  EQU   PSALKSA+36                                               01285000
PSALKR8  EQU   PSALKSA+32                                               01286000
PSALKR7  EQU   PSALKSA+28                                               01287000
PSALKR6  EQU   PSALKSA+24                                               01288000
PSALKR5  EQU   PSALKSA+20                                               01289000
PSALKR4  EQU   PSALKSA+16                                               01290000
PSALKR3  EQU   PSALKSA+12                                               01291000
PSALKR2  EQU   PSALKSA+8                                                01292000
PSALKR1  EQU   PSALKSA+4                                                01293000
PSALKR0  EQU   PSALKSA                                                  01294000
PSARV023 EQU   PSACLHT+52                                               01295000
PSALOCAL EQU   PSACLHT+48                                               01296000
PSACMSL  EQU   PSACLHT+44                                               01297000
PSAOPTL  EQU   PSACLHT+40                                               01298000
PSATPACL EQU   PSACLHT+36                                               01299000
PSATPDNL EQU   PSACLHT+32                                               01300000
PSATPNCL EQU   PSACLHT+28                                               01301000
PSAIOSLL EQU   PSACLHT+24                                               01302000
PSAIOSUL EQU   PSACLHT+20                                               01303000
PSAIOSCL EQU   PSACLHT+16                                               01304000
PSAIOSSL EQU   PSACLHT+12                                               01305000
PSASALCL EQU   PSACLHT+8                                                01306000
PSAASML  EQU   PSACLHT+4                                                01307000
PSADISPL EQU   PSACLHT                                                  01308000
PSASRSA  EQU   PSA+636                                                  01309000
PSARV050 EQU   PSA+634                                                  01310000
PSADSSGO EQU   PSA+633                                                  01311000
PSARECUR EQU   PSA+632                                                  01312000
PSAHLHIS EQU   PSA+628                                                  01313000
PSAIPCSA EQU   PSA+624                                                  01314000
@NM00025 EQU   PSA+621                                                  01315000
PSAIPCDM EQU   PSA+620                                                  01316000
PSAIPCD  EQU   PSA+616                                                  01317000
@NM00024 EQU   PSA+613                                                  01318000
PSAIPCRM EQU   PSA+612                                                  01319000
PSAIPCR  EQU   PSA+608                                                  01320000
PSAMCHEX EQU   PSA+600                                                  01321000
PSAMPSW  EQU   PSA+592                                                  01322000
PSAEXPS2 EQU   PSA+584                                                  01323000
PSAEXPS1 EQU   PSA+576                                                  01324000
PSAPIREG EQU   PSA+572                                                  01325000
PSARSREG EQU   PSA+568                                                  01326000
PSAGPREG EQU   PSA+556                                                  01327000
PSARV022 EQU   PSASUP4                                                  01328000
PSARV021 EQU   PSASUP4                                                  01329000
PSARV020 EQU   PSASUP4                                                  01330000
PSARV019 EQU   PSASUP4                                                  01331000
PSARV018 EQU   PSASUP4                                                  01332000
PSARV017 EQU   PSASUP4                                                  01333000
PSARV016 EQU   PSASUP4                                                  01334000
PSARV015 EQU   PSASUP4                                                  01335000
PSARV014 EQU   PSASUP3                                                  01336000
PSARV013 EQU   PSASUP3                                                  01337000
PSARV012 EQU   PSASUP3                                                  01338000
PSARV011 EQU   PSASUP3                                                  01339000
PSARV010 EQU   PSASUP3                                                  01340000
PSARV009 EQU   PSASUP3                                                  01341000
PSARV008 EQU   PSASUP3                                                  01342000
PSAIOSUP EQU   PSASUP3                                                  01343000
PSALCR   EQU   PSASUP2                                                  01344000
PSARTM   EQU   PSASUP2                                                  01345000
PSAACR   EQU   PSASUP2                                                  01346000
PSAIPCE2 EQU   PSASUP2                                                  01347000
PSAIPCES EQU   PSASUP2                                                  01348000
PSAIPCEC EQU   PSASUP2                                                  01349000
PSAGTF   EQU   PSASUP2                                                  01350000
PSAIPCRI EQU   PSASUP2                                                  01351000
PSAIPCRP EQU   PSASUP1                                                  01352000
PSAIPCDR EQU   PSASUP1                                                  01353000
PSADISP  EQU   PSASUP1                                                  01354000
PSALOCK  EQU   PSASUP1                                                  01355000
PSAPI    EQU   PSASUP1                                                  01356000
PSAEXT   EQU   PSASUP1                                                  01357000
PSASVC   EQU   PSASUP1                                                  01358000
PSAIO    EQU   PSASUP1                                                  01359000
PSAAOLD  EQU   PSA+548                                                  01360000
PSAANEW  EQU   PSA+544                                                  01361000
PSATOLD  EQU   PSA+540                                                  01362000
PSATNEW  EQU   PSA+536                                                  01363000
PSALCCAR EQU   PSA+532                                                  01364000
PSALCCAV EQU   PSA+528                                                  01365000
PSAPCCAR EQU   PSA+524                                                  01366000
PSAPCCAV EQU   PSA+520                                                  01367000
PSACPULA EQU   PSA+518                                                  01368000
PSACPUPA EQU   PSA+516                                                  01369000
PSAPSA   EQU   PSA+512                                                  01370000
FLCHDEND EQU   PSA+512                                                  01371000
FLCCRSAV EQU   FLCMCLA+280                                              01372000
FLCGRSAV EQU   FLCMCLA+216                                              01373000
FLCFPSAV EQU   FLCMCLA+184                                              01374000
FLCFLA   EQU   FLCMCLA+88                                               01375000
FLCRGNCD EQU   FLCMCLA+84                                               01376000
FLCFSAA  EQU   FLCFSA+1                                                 01377000
@NM00023 EQU   FLCFSA                                                   01378000
@NM00022 EQU   FLCMCLA+72                                               01379000
FLCMCIC  EQU   FLCMCLA+64                                               01380000
@NM00021 EQU   FLCMCLA+20                                               01381000
FLCIOAA  EQU   FLCIOA+1                                                 01382000
@NM00020 EQU   FLCIOA                                                   01383000
@NM00019 EQU   FLCMCLA+15                                               01384000
@NM00018 EQU   FLCMCLA+14                                               01385000
@NM00017 EQU   FLCMCLA+12                                               01386000
FLCLCL   EQU   FLCMCLA+8                                                01387000
FLCIOELA EQU   FLCIOEL+1                                                01388000
@NM00016 EQU   FLCIOEL                                                  01389000
FLCCHNID EQU   FLCMCLA                                                  01390000
@NM00015 EQU   PSA+160                                                  01391000
FLCMTRCD EQU   PSA+157                                                  01392000
@NM00014 EQU   PSA+156                                                  01393000
FLCPERA  EQU   FLCPER+1                                                 01394000
@NM00013 EQU   FLCPER                                                   01395000
@NM00012 EQU   PSA+151                                                  01396000
FLCPERCD EQU   PSA+150                                                  01397000
FLCMCNUM EQU   PSA+149                                                  01398000
@NM00011 EQU   PSA+148                                                  01399000
FLCTEAA  EQU   FLCTEA+1                                                 01400000
@NM00010 EQU   FLCTEA                                                   01401000
PSAPIPC  EQU   PSAPICOD                                                 01402000
PSAPIMC  EQU   PSAPICOD                                                 01403000
PSAPIPER EQU   PSAPICOD                                                 01404000
PSARV049 EQU   FLCPICOD                                                 01405000
FLCPILCB EQU   FLCPIILC                                                 01406000
@NM00009 EQU   FLCPIILC                                                 01407000
@NM00008 EQU   PSAEPPSW                                                 01408000
FLCSVCN  EQU   PSAESPSW+2                                               01409000
FLCSILCB EQU   FLCSVILC                                                 01410000
@NM00007 EQU   FLCSVILC                                                 01411000
@NM00006 EQU   PSAESPSW                                                 01412000
FLCEICOD EQU   PSAEEPSW+2                                               01413000
PSASPAD  EQU   PSAEEPSW                                                 01414000
@NM00005 EQU   PSA+128                                                  01415000
FLCINPSW EQU   PSA+120                                                  01416000
FLCMNPSW EQU   PSA+112                                                  01417000
FLCPNPSW EQU   PSA+104                                                  01418000
FLCSNPSW EQU   PSA+96                                                   01419000
FLCENPSW EQU   PSA+88                                                   01420000
FLCTRACE EQU   PSA+84                                                   01421000
FLCTIMER EQU   PSA+80                                                   01422000
FLCCVT2  EQU   PSA+76                                                   01423000
FLCCAW   EQU   PSA+72                                                   01424000
FLCCSW   EQU   PSA+64                                                   01425000
FLCIOPSW EQU   PSA+56                                                   01426000
FLCMOPSW EQU   PSA+48                                                   01427000
FLCPOPSW EQU   PSA+40                                                   01428000
FLCSOPSW EQU   PSA+32                                                   01429000
FLCEOPSW EQU   PSA+24                                                   01430000
@NM00004 EQU   FLCICCW2+4                                               01431000
FLCCVT   EQU   FLCICCW2                                                 01432000
FLCICCW1 EQU   FLCROPSW                                                 01433000
FLCIPPSW EQU   FLCRNPSW                                                 01434000
*                                      END UNREFERENCED COMPONENTS      01435000
@RC00086 EQU   @RC00083                                                 01436000
@RF00124 EQU   @RC00086                                                 01437000
@ENDDATA EQU   *                                                        01438000
         END   IEFAB498                                                 01439000
