         TITLE 'IEFAB4ED - ALLOCATION COMMON ESTAE EXIT                *00001000
                        '                                               00002000
IEFAB4ED   CSECT                                                        00003000
@MAINENT   DS 0H                                                        00004000
           USING *,15                                                   00005000
           B @PROLOG                    BRANCH AROUND MODULE ID         00006000
           MODID  BR=NO                 MODULE ID             @G24LPSJ  00007000
           DROP 15                                                      00008000
@PROLOG    BALR 12,0                                                    00009000
@PSTART    DS 0H                                                        00010000
           USING @PSTART,12                                             00011000
           LA 11,12                     LOAD VALUE OF 12                00012000
           CR 0,11                      COMPARE WITH REG 0              00013000
           BNE SETPTR                   BR IF REG1 POINTS TO SDWA       00014000
           LR 11,2                      NO SDWA; REG2 HAS USER PARM @   00015000
           B COMMON                                                     00016000
SETPTR     L 11,0(1)                    GET USER PARMS @OUT OF SDWA     00017000
COMMON     EQU *                                                        00018000
           LR 9,11                      SAVE USER PARMS @               00019000
           L 11,32(11)                  AUTO-CORE @ OUT OF USER PARMS   00020000
           USING @DATD,11                                               00021000
           LR 13,11                     ADDR OF REG SAVE AREA           00022000
JSCBDISP EQU 188                                                        00023000
JSCBAOS1 EQU  72                                                        00024000
JSCBAOS2 EQU 192                                                        00025000
*SAVREG14 = R14;                       /*SAVE RETURN ADDRESS         */ 00026000
         ST    R14,SAVREG14                                     01S0064 00027000
*ASWAPTR1 = R9;                        /*SAVE PTR FOR USER PARMS     */ 00028000
         LR    ASWAPTR1,R9                                      01S0065 00029000
*IF R0 = TWELVE THEN                   /*DOES SDWA EXIST             */ 00030000
         CH    R0,@CH00032                                      01S0066 00031000
         BNE   @RF00066                                         01S0066 00032000
*  SDWAPTR = ZERO;                     /*NO ZERO BASE PTR            */ 00033000
         SLR   SDWAPTR,SDWAPTR                                  01S0067 00034000
*ELSE                                  /*YES - SDWA EXISTS           */ 00035000
*  SDWAPTR = R1;                       /*GET BASE PTR                */ 00036000
         B     @RC00066                                         01S0068 00037000
@RF00066 LR    SDWAPTR,R1                                       01S0068 00038000
*RFY (R0,R1,R9,R14) UNRSTD;                                     01S0069 00039000
@RC00066 DS    0H                                               01S0070 00040000
*TCBPTR = CURNTCBP;                    /*GET CURRENT TCB             */ 00041000
         L     @09,LOC16PTR                                     01S0070 00042000
         L     @09,TCBLISTP(,@09)                               01S0070 00043000
         L     TCBPTR,CURNTCBP(,@09)                            01S0070 00044000
*JSCBPTR = JSCBACT;                    /*ACTIVE JSCB FROM CURRENT    */ 00045000
         L     @09,TCBJSCB(,TCBPTR)                             01S0071 00046000
         L     JSCBPTR,JSCBACT(,@09)                            01S0071 00047000
*RFY IEZJSCB BASED(JSCBPTR);           /*WORK WITH ACTIVE            */ 00048000
*IF ASWAPTR1-> ASWANOCH = ON THEN      /*IS ASWA CHAINED TO     01S0073 00049000
*                                        JSCB                @ZA18154*/ 00050000
         TM    ASWANOCH(ASWAPTR1),B'00001000'                   01S0073 00051000
         BNO   @RF00073                                         01S0073 00052000
*  ASWAPTR = ASWAPTR1;                 /*IF NO PROCESS ONLY ONE 01S0074 00053000
*                                        ASWA                @ZA18154*/ 00054000
         LR    ASWAPTR,ASWAPTR1                                 01S0074 00055000
*ELSE                                  /*CHECK CHAIN         @ZA18154*/ 00056000
*  DO;                                                          01S0075 00057000
         B     @RC00073                                         01S0075 00058000
@RF00073 DS    0H                                               01S0076 00059000
*    IF JSCBASWA ^= ZERO &             /*AT LEAST ONE ASWA ON CHAIN? */ 00060000
*       JSCBASWA -> ASWASCBP = ASWAPTR1 ->ASWASCBP THEN /* AND IS FOR   00061000
*                                        SAME ESTAE AS THIS ONE      */ 00062000
         L     @09,JSCBASWA(,JSCBPTR)                           01S0076 00063000
         LTR   @09,@09                                          01S0076 00064000
         BZ    @RF00076                                         01S0076 00065000
         CLC   ASWASCBP(4,@09),ASWASCBP(ASWAPTR1)               01S0076 00066000
         BNE   @RF00076                                         01S0076 00067000
*      ASWAPTR = JSCBASWA;             /*START WITH LAST ASWA        */ 00068000
         LR    ASWAPTR,@09                                      01S0077 00069000
*    ELSE                              /*ERROR BEFORE 1ST CHAINED    */ 00070000
*      ASWAPTR = ASWAPTR1;             /*INPUT 1ST IS ALSO LAST      */ 00071000
         B     @RC00076                                         01S0078 00072000
@RF00076 LR    ASWAPTR,ASWAPTR1                                 01S0078 00073000
*    JSCBASWA = ASWAPTR1 -> ASWAOLDP;  /*RESET OLD JSCBASWA IF ANY   */ 00074000
@RC00076 MVC   JSCBASWA(4,JSCBPTR),ASWAOLDP(ASWAPTR1)           01S0079 00075000
*  END;                                                         01S0080 00076000
*LASTEXIT = ASWACSCT;                  /*SAVE CSECT OF LAST ASWA     */ 00077000
@RC00073 MVC   LASTEXIT(8),ASWACSCT(ASWAPTR)                    01S0081 00078000
*ASWALPTR = ASWAPTR;                   /*SAVE PTR TO LAST            */ 00079000
         LR    ASWALPTR,ASWAPTR                                 01S0082 00080000
*SWITCHES = ''B;                       /*ZERO INTERNAL SWITCHES      */ 00081000
         MVI   SWITCHES,X'00'                                   01S0083 00082000
*/********************************************************************/ 00083000
*/*                                                                  */ 00084000
*/* SEGMENT NAME - DUMPCHEK                                          */ 00085000
*/*                                                                  */ 00086000
*/* DESCRIPTIVE NAME - DUMP CHECKS                                   */ 00087000
*/*                                                                  */ 00088000
*/* FUNCTION - DETERMINE IF AN SDUMP SHOULD BE ISSUED                */ 00089000
*/*                                                                  */ 00090000
*/* OPERATION -                                                      */ 00091000
*/*            . IF NO SDWA EXISTS, A DUMP SHOULD BE TAKEN           */ 00092000
*/*            . IF ONE DOES EXIST, ADDITIONAL CHECKS ON THE         */ 00093000
*/*              NATURE OF THE ERROR ARE MADE TO DETERMINE           */ 00094000
*/*              IF SDUMP IS APPROPRIATE. THESE CHECKS ARE           */ 00095000
*/*              DOCUMENTED BY THE CODE.                             */ 00096000
*/*                                                                  */ 00097000
*/* ENTRY - INLINE SUBROUTINE ENTERED AT THE TOP                     */ 00098000
*/*                                                                  */ 00099000
*/*   PURPOSE - SEE FUNCTION                                         */ 00100000
*/*                                                                  */ 00101000
*/*   INPUT -                                                        */ 00102000
*/*          . SDWAPTR - PTR TO SDWA IF ONE EXISTS                   */ 00103000
*/*          . ASWAPTR - POINTS TO LAST ASWA ON THE CHAIN - THE ONE  */ 00104000
*/*                      RELATED TO THE SUB-FUNCTION OF ALLOCATION   */ 00105000
*/*                      THAT WAS PROCESSING WHEN THE ERROR OCCURRED.*/ 00106000
*/*                                                                  */ 00107000
*/* EXIT - INLINE SUBROUTINE THAT EXITS AT THE BOTTOM                */ 00108000
*/*                                                                  */ 00109000
*/*   CONDITION - SDUMP DETERMINATION MADE                           */ 00110000
*/*                                                                  */ 00111000
*/*   OUTPUT -                                                       */ 00112000
*/*          . DUMPSW - ON IF SDUMP TO BE ISSUED                     */ 00113000
*/*          . USERPROB - ON IF PROBLEM WAS DUE TO USER ERROR        */ 00114000
*/*                                                                  */ 00115000
*/*   RETURN CODES - NONE                                            */ 00116000
*/*                                                                  */ 00117000
*/********************************************************************/ 00118000
*IF SDWAPTR = ZERO THEN                /*IF NO SDWA EXISTS           */ 00119000
         LTR   SDWAPTR,SDWAPTR                                  02S0084 00120000
         BNZ   @RF00084                                         02S0084 00121000
*  DUMPSW = ON;                        /*DUMP TO BE TAKEN            */ 00122000
         OI    DUMPSW,B'10000000'                               02S0085 00123000
*ELSE                                  /*SDWA EXISTS                 */ 00124000
*  DO;                                 /*MAKE FURTHER CHECKS         */ 00125000
         B     @RC00084                                         02S0086 00126000
@RF00084 DS    0H                                               02S0087 00127000
*    IF ASWADYUE = ON  &               /*CHECK FOR DYNAMIC USER ERROR*/ 00128000
*       USERERSW = ON THEN             /*AND PROBLEM IS USER'S       */ 00129000
         TM    ASWADYUE(ASWAPTR),B'00010000'                    02S0087 00130000
         BNO   @RF00087                                         02S0087 00131000
         L     @01,ASWAPRMS(,ASWAPTR)                           02S0087 00132000
         L     @01,DEALFMAP(,@01)                               02S0087 00133000
         TM    USERERSW(@01),B'00100000'                        02S0087 00134000
         BNO   @RF00087                                         02S0087 00135000
*      USERPROB = ON;                  /*SAY SO INTERNALLY           */ 00136000
         OI    USERPROB,B'01000000'                             02S0088 00137000
*    IF ASWADYNF = ON THEN             /*CHECK DYNAMIC FRR PERC AND  */ 00138000
@RF00087 TM    ASWADYNF(ASWAPTR),B'10000000'                    02S0089 00139000
         BNO   @RF00089                                         02S0089 00140000
*      IF FRRPERSW = ON THEN           /*FRR PERCOLATION FOR SVC99   */ 00141000
         L     @01,ASWAPRMS(,ASWAPTR)                           02S0090 00142000
         L     @01,DEALFMAP(,@01)                               02S0090 00143000
         TM    FRRPERSW(@01),B'00000010'                        02S0090 00144000
         BNO   @RF00090                                         02S0090 00145000
*       FRRPERCD = ON;                 /*SAY SO INTERNALLY           */ 00146000
         OI    FRRPERCD,B'00100000'                             02S0091 00147000
*      ELSE;                           /*NO DYNAMIC FRR PERCOLATION  */ 00148000
@RF00090 DS    0H                                               02S0093 00149000
*    ELSE                              /*NO DYNAMIC FRR CHECK        */ 00150000
*      IF ASWACOMF = ON THEN           /*CHECK COMMON ALLOC FRR PERC */ 00151000
         B     @RC00089                                         02S0093 00152000
@RF00089 TM    ASWACOMF(ASWAPTR),B'01000000'                    02S0093 00153000
         BNO   @RF00093                                         02S0093 00154000
*        IF ASWAPRMS -> DUMPOK = ON THEN /*COMMON FRR PERCOLATION?   */ 00155000
         L     @01,ASWAPRMS(,ASWAPTR)                           02S0094 00156000
         TM    DUMPOK(@01),B'00001000'                          02S0094 00157000
         BNO   @RF00094                                         02S0094 00158000
*          FRRPERCD = ON;              /*SAY SO INTERNALLY           */ 00159000
         OI    FRRPERCD,B'00100000'                             02S0095 00160000
*        ELSE;                         /*NO COMMON FRR PERCOLATION   */ 00161000
@RF00094 DS    0H                                               02S0097 00162000
*      ELSE                            /*NO CHECK FOR COMMON         */ 00163000
*        IF ASWAVMVF = ON THEN         /*CHECK VM+V FRR PERCOLATION  */ 00164000
         B     @RC00093                                         02S0097 00165000
@RF00093 TM    ASWAVMVF(ASWAPTR),B'00100000'                    02S0097 00166000
         BNO   @RF00097                                         02S0097 00167000
*          IF ASWAPRMS -> VEXFRR = ON THEN /*WAS THERE ANY           */ 00168000
         L     @01,ASWAPRMS(,ASWAPTR)                           02S0098 00169000
         TM    VEXFRR(@01),B'10000000'                          02S0098 00170000
         BNO   @RF00098                                         02S0098 00171000
*            FRRPERCD = ON;            /*SAY SO INTERNALLY           */ 00172000
         OI    FRRPERCD,B'00100000'                             02S0099 00173000
*          ELSE;                       /*NO VM+V FRR PERCOLATION     */ 00174000
@RF00098 DS    0H                                               02S0101 00175000
*        ELSE;                         /*NO VM+V CHECK               */ 00176000
@RF00097 DS    0H                                               02S0102 00177000
*    IF (SDWAPCHK = ON  |              /*ERROR IS PROGRAM CHECK      */ 00178000
*        SDWARKEY = ON  |              /*RESTART KEY HIT             */ 00179000
*        SYSACODE^=ZEROBIN)&           /*NON USER ABEND      @ZA15017*/ 00180000
*       (SDWAPERC = OFF |              /*NOT PERCOLATED TO OR        */ 00181000
*        FRRPERCD = ON)      &         /*YES BUT FROM FRR            */ 00182000
*        USERPROB = OFF THEN           /*NOT A USER ERROR            */ 00183000
@RC00093 DS    0H                                               02S0102 00184000
@RC00089 TM    SDWAPCHK(SDWAPTR),B'01100000'                    02S0102 00185000
         BNZ   @GL00004                                         02S0102 00186000
         MVC   @TS00001(2),SYSACODE(SDWAPTR)                    02S0102 00187000
         NC    @TS00001(2),@CB02449                             02S0102 00188000
         BZ    @RF00102                                         02S0102 00189000
@GL00004 TM    SDWAPERC(SDWAPTR),B'00010000'                    02S0102 00190000
         BZ    @GL00003                                         02S0102 00191000
         TM    FRRPERCD,B'00100000'                             02S0102 00192000
         BNO   @RF00102                                         02S0102 00193000
@GL00003 TM    USERPROB,B'01000000'                             02S0102 00194000
         BNZ   @RF00102                                         02S0102 00195000
*      DUMPSW = ON;                    /*DUMP TO BE TAKEN            */ 00196000
         OI    DUMPSW,B'10000000'                               02S0103 00197000
*    ELSE;                             /*NO SDUMP                    */ 00198000
@RF00102 DS    0H                                               02S0105 00199000
*  END;                                /*END IF SDWA EXISTS          */ 00200000
*IF DUMPSW = ON THEN                   /*SHOULD DUMP BE TAKEN        */ 00201000
@RC00084 TM    DUMPSW,B'10000000'                               01S0106 00202000
         BNO   @RF00106                                         01S0106 00203000
*  DO;                                 /*YES,                        */ 00204000
*    SDMPCORE(ONE:SDMPLENG) = SDMPLIST(ONE:SDMPLENG); /*COPY MF=L    */ 00205000
         L     @06,SDMPLENG                                     01S0108 00206000
         BCTR  @06,0                                            01S0108 00207000
         EX    @06,@SM02451                                     01S0108 00208000
*    HDRCORE = HEDCORE;                /*COPY CONSTANT HDR SECTION   */ 00209000
         MVC   HDRCORE(36),HEDCORE                              01S0109 00210000
*    HDREXITN = LASTEXIT;              /*MOVE IN EXIT NAME           */ 00211000
         MVC   HDREXITN(8),LASTEXIT                             01S0110 00212000
*    GEN REFS(SDMPCORE,HDRCORE);                                01S0111 00213000
    LOAD  EP=IEFW21SD                                                   00214000
*                                    LOAD IEFW21SD FOR DUMP   @ZM41393  00215000
    SDUMP HDRAD=HDRCORE,MF=(E,SDMPCORE)                                 00216000
    DELETE EP=IEFW21SD                                                  00217000
*                                  DELETE IEFW21SD SFTER DUMP @ZM41393  00218000
*  END;                                /*END OF SDUMP                */ 00219000
*/********************************************************************/ 00220000
*/*                                                                  */ 00221000
*/* SEGMENT NAME - ROUTER                                            */ 00222000
*/*                                                                  */ 00223000
*/* DESCRIPTIVE NAME - ASWA EXITS CONTROL ROUTER                     */ 00224000
*/*                                                                  */ 00225000
*/* FUNCTION - GIVE CONTROL TO APPROPRIATE ROUTINES FOR              */ 00226000
*/*            SPECIFIC RECOVERY PROCESSING                          */ 00227000
*/*                                                                  */ 00228000
*/* OPERATION - LOOP BACKWARDS THROUGH THE CHAIN OF ASWA'S           */ 00229000
*/*             PASSING CONTROL TO THE EXIT ROUTINES POINTED TO.     */ 00230000
*/*                                                                  */ 00231000
*/*             NOTE THAT THESE ROUTINES FORMERLY RECEIVED           */ 00232000
*/*             CONTROL DIRECTLY FROM THE RTM AND HAVE ENTRY         */ 00233000
*/*             CODE AS SUCH. (SIMILAR TO THE ENTRY CODE OF          */ 00234000
*/*             THIS MODULE). BRANCHING TO THEM HERE THEREFORE       */ 00235000
*/*             REQUIRES THE SETTING UP OF THAT SAME INTERFACE,      */ 00236000
*/*             INCLUDING THE SETTING OF REGS 0,1,2, AND THE         */ 00237000
*/*             SAVING AND RESTORING OF REGISTERS BEFORE AND         */ 00238000
*/*             AFTER.                                               */ 00239000
*/*                                                                  */ 00240000
*/* ENTRY - INLINE SUBROUTINE ENTERED AT THE TOP                     */ 00241000
*/*                                                                  */ 00242000
*/*   PURPOSE - SEE FUNCTION                                         */ 00243000
*/*                                                                  */ 00244000
*/*   INPUT -                                                        */ 00245000
*/*        .SDWAPTR - PTR TO SDWA IF ONE EXISTS                      */ 00246000
*/*        .ASWALPTR - PTR TO LAST ASWA ON CHAIN                     */ 00247000
*/*                                                                  */ 00248000
*/* EXIT - INLINE SUBROUTINE THAT EXITS AT THE BOTTOM                */ 00249000
*/*                                                                  */ 00250000
*/*   CONDITION - CONTROL PASSED TO ALL EXIT ROUTINES                */ 00251000
*/*               WITH ASWA'S ON THE CHAIN                           */ 00252000
*/*                                                                  */ 00253000
*/*   OUTPUT - SPECIFIC CLEANUP PROCESSING PERFORMED                 */ 00254000
*/*            BY ROUTINES BRANCHED TO.                              */ 00255000
*/*                                                                  */ 00256000
*/*   RETURN CODES - NONE                                            */ 00257000
*/*                                                                  */ 00258000
*/********************************************************************/ 00259000
*RFY (R0,R1,R2,R13,R14,R15) RSTD;                               02S0113 00260000
@RF00106 DS    0H                                               02S0114 00261000
*IF SDWAPTR ^= ZERO THEN               /*SDWA EXIST?                 */ 00262000
         LTR   SDWAPTR,SDWAPTR                                  02S0114 00263000
         BZ    @RF00114                                         02S0114 00264000
*  DO;                                 /*SET UP REGS FOR THIS        */ 00265000
*    R0 = ZERO;                        /*SET REG. 0 ^= 12            */ 00266000
         SLR   R0,R0                                            02S0116 00267000
*    R1 = SDWAPTR;                     /*REG1 TO POINT TO SDWA       */ 00268000
         LR    R1,SDWAPTR                                       02S0117 00269000
*    PARMSAVP=SDWAPARM;                /*SAVE PARM PTR               */ 00270000
         L     PARMSAVP,SDWAPARM(,SDWAPTR)                      02S0118 00271000
*  END;                                /*END IF SDWA EXISTS          */ 00272000
*ELSE                                  /*NO SDWA                     */ 00273000
*  R0 = TWELVE;                        /*SET REG. 0 ACCORDINGLY      */ 00274000
         B     @RC00114                                         02S0120 00275000
@RF00114 LA    R0,12                                            02S0120 00276000
*R13 = ADDR(REGSAVE);                  /*ENSURE POINTING TO SAVE AREA*/ 00277000
@RC00114 LA    R13,REGSAVE                                      02S0121 00278000
*ASWAPTR = ASWALPTR;                   /*POINT TO LAST ASWA          */ 00279000
         LR    ASWAPTR,ASWALPTR                                 02S0122 00280000
*DO WHILE ASWAPTR ^= ZERO;             /*PROCESS ALL ASWA'S          */ 00281000
         B     @DE00123                                         02S0123 00282000
@DL00123 DS    0H                                               02S0124 00283000
*  IF R0 = TWELVE THEN                 /*IF NO SDWA                  */ 00284000
         CH    R0,@CH00032                                      02S0124 00285000
         BNE   @RF00124                                         02S0124 00286000
*    R2 = ASWAPRMS;                    /*REG.2 TO PROVIDE PARMS      */ 00287000
         L     R2,ASWAPRMS(,ASWAPTR)                            02S0125 00288000
*  ELSE                                /*SDWA EXISTS                 */ 00289000
*    SDWAPARM = ASWAPRMS;              /*SDWA CONTAINS PARM PTR      */ 00290000
         B     @RC00124                                         02S0126 00291000
@RF00124 MVC   SDWAPARM(4,SDWAPTR),ASWAPRMS(ASWAPTR)            02S0126 00292000
*  R15 = ASWARTNP;                     /*GET EXIT ADDR FOR THIS ASWA */ 00293000
@RC00124 L     R15,ASWARTNP(,ASWAPTR)                           02S0127 00294000
*  GEN;                                                         02S0128 00295000
     STM 14,12,12(13)                   SAVE REGISTERS                  00296000
     BALR 14,15                         BRANCH TO EXIT RTN.             00297000
     LM  14,12,12(13)                   RESTORE REGISTERS               00298000
*  ASWAPTR = ASWACHNP;                 /*POINT TO PRECEEDING ASWA    */ 00299000
         L     ASWAPTR,ASWACHNP(,ASWAPTR)                       02S0129 00300000
*END;                                  /*END ROUTING LOOP            */ 00301000
@DE00123 SLR   @09,@09                                          02S0130 00302000
         CR    ASWAPTR,@09                                      02S0130 00303000
         BNE   @DL00123                                         02S0130 00304000
*IF SDWAPTR ^= ZERO THEN               /*IF SDWA EXISTS              */ 00305000
         CR    SDWAPTR,@09                                      02S0131 00306000
         BE    @RF00131                                         02S0131 00307000
*  SDWAPARM=PARMSAVP;                  /*RESTORE TO ORIGINAL         */ 00308000
         ST    PARMSAVP,SDWAPARM(,SDWAPTR)                      02S0132 00309000
*RFY(R0,R1,R2,R13,R14,R15) UNRSTD;                              02S0133 00310000
@RF00131 DS    0H                                               02S0134 00311000
*IF SU24BIT = ON &                     /*IF MSS R3 INSTALLED @ZA27004*/ 00312000
*   CVTICB ^= ZERO THEN                /*AND MSS GEN'D THEN  @ZA27004*/ 00313000
         L     @10,CVTPTR                                       01S0134 00314000
         L     @09,CVTIHASU(,@10)                               01S0134 00315000
         TM    SU24BIT(@09),B'10000000'                         01S0134 00316000
         BNO   @RF00134                                         01S0134 00317000
         L     @10,CVTEXT2(,@10)                                01S0134 00318000
         ICM   @09,15,CVTICB(@10)                               01S0134 00319000
         BZ    @RF00134                                         01S0134 00320000
*  DO;                                 /*                    @G24LPSJ*/ 00321000
*/***********************************************************@G24LPSJ*/ 00322000
*/*                                                          @G24LPSJ*/ 00323000
*/* SEGMENT NAME - TERMCALL                                  @G24LPSJ*/ 00324000
*/*                                                          @G24LPSJ*/ 00325000
*/* DESCRIPTIVE NAME - MSSC TERMINATE PROCESSING             @G24LPSJ*/ 00326000
*/*                                                          @G24LPSJ*/ 00327000
*/* FUNCTION -                                               @G24LPSJ*/ 00328000
*/*                                                          @G24LPSJ*/ 00329000
*/*   THIS SEGMENT WILL ISSUE THE MSS TERMINATE REQUEST IF   @G24LPSJ*/ 00330000
*/*   THERE HAS BEEN AN ALLOCATION OR UNALLOCATION FAILURE   @G24LPSJ*/ 00331000
*/*   CAUSING ESTAE TO GAIN CONTROL.                         @G24LPSJ*/ 00332000
*/*                                                          @G24LPSJ*/ 00333000
*/* ENTRY - IN-LINE SEGMENT                                  @G24LPSJ*/ 00334000
*/*                                                          @G24LPSJ*/ 00335000
*/*   PURPOSE - SEE FUNCTION                                 @G24LPSJ*/ 00336000
*/*                                                          @G24LPSJ*/ 00337000
*/*   INPUT - ASCB                                           @G24LPSJ*/ 00338000
*/*                                                          @G24LPSJ*/ 00339000
*/* EXIT -                                                   @G24LPSJ*/ 00340000
*/*                                                          @G24LPSJ*/ 00341000
*/*   CONDITION - MSSC TERMINATE ISSUED                      @G24LPSJ*/ 00342000
*/*      OUTPUT -     - NONE                                 @G24LPSJ*/ 00343000
*/*      RETURN CODES - NONE                                 @G24LPSJ*/ 00344000
*/*                                                          @G24LPSJ*/ 00345000
*/***********************************************************@G24LPSJ*/ 00346000
*RFY TRMRB BASED(ADDR(TERMAREA));    /* SET ADDR FOR TERMINATE  02S0136 00347000
*                                       REQUEST BLOCK        @G24LPSJ*/ 00348000
*TRMRB = TRMRB && TRMRB;             /* CLEAR BLOCK          @G24LPSJ*/ 00349000
         LA    @10,TERMAREA                                     02S0137 00350000
         XC    TRMRB(16,@10),TRMRB(@10)                         02S0137 00351000
*TRMRBLEN = LENGTH(TRMRB);           /* SET TERM LENGTH      @G24LPSJ*/ 00352000
         MVC   TRMRBLEN(4,@10),@CF00038                         02S0138 00353000
*TRMRBOPC = TRMOPCD;                 /* SET TERM OP CODE     @G24LPSJ*/ 00354000
         MVI   TRMRBOPC(@10),X'8A'                              02S0139 00355000
*ASCBPTR = PSAAOLD;                  /* SET ASCB PTR         @G24LPSJ*/ 00356000
         L     ASCBPTR,PSAAOLD                                  02S0140 00357000
*TRMJOBID = ASCBASID;                /* SET ASID OF STEP     @G24LPSJ*/ 00358000
         SLR   @09,@09                                          02S0141 00359000
         ICM   @09,3,ASCBASID(ASCBPTR)                          02S0141 00360000
         ST    @09,TRMJOBID(,@10)                               02S0141 00361000
*RFY R1 RSTD;                        /* RESTRICT REG1        @G24LPSJ*/ 00362000
*R1 = ADDR(TRMRB);                   /* LOAD ADDR TRMRB      @G24LPSJ*/ 00363000
         LR    R1,@10                                           02S0143 00364000
*SVC (126);                          /* CALL MSSC            @G24LPSJ*/ 00365000
         SVC   126                                              02S0144 00366000
*RFY R1 UNRSTD;                      /* RELEASE REG 1        @G24LPSJ*/ 00367000
*  END;                                /*                    @G24LPSJ*/ 00368000
*RFY (R1) RSTD;                                                 01S0147 00369000
@RF00134 DS    0H                                               01S0148 00370000
*IF SDWAPTR ^= ZERO THEN               /*IF SDWA EXISTS              */ 00371000
         SLR   @10,@10                                          01S0148 00372000
         CR    SDWAPTR,@10                                      01S0148 00373000
         BE    @RF00148                                         01S0148 00374000
*  DO;                                 /*SETRP PROCESSING            */ 00375000
*    R1 = SDWAPTR;                     /*SDWA ADDRESS                */ 00376000
         LR    R1,SDWAPTR                                       01S0150 00377000
*    ASWAPTR = ASWAPTR1;               /*RESET TO 1ST ASWA           */ 00378000
         LR    ASWAPTR,ASWAPTR1                                 01S0151 00379000
*    IF ASWACSCT = STEPALEX THEN       /*IF FOR STEP ALLOCATION      */ 00380000
         CLC   ASWACSCT(8,ASWAPTR),@CC00142                     01S0152 00381000
         BNE   @RF00152                                         01S0152 00382000
*      DO;                             /*SPECIAL SETRP PROCESS       */ 00383000
*/********************************************************************/ 00384000
*/*                                                                  */ 00385000
*/* SEGMENT NAME - STPSETRP                                          */ 00386000
*/*                                                                  */ 00387000
*/* DESCRIPTIVE NAME - SETRP FOR STEP ALLOCATION                     */ 00388000
*/*                                                                  */ 00389000
*/* FUNCTION - IF THE EXIT FOR THE FIRST ASWA ON THE CHAIN IS THAT   */ 00390000
*/*            OF STEP ALLOCATION'S, SPECIAL SETRP PROCESSING        */ 00391000
*/*            IS NECESSARY TO ALLOW A RETRY ROUTINE TO GET CONTROL. */ 00392000
*/*            (THIS RETRY ROUTINE CAN THEN BR14 BACK TO THE         */ 00393000
*/*            INITIATOR, ENABLING HIM TO CONTINUE PROCESSING        */ 00394000
*/*            NORMALLY.)                                            */ 00395000
*/*                                                                  */ 00396000
*/* OPERATION - ALL THE INITIATOR'S REGISTERS ARE PLACED IN THE      */ 00397000
*/*             REGISTER UPDATE BLOCK (RUB) AND THE APPROPRIATE      */ 00398000
*/*             SETRP WITH RETRY IS ISSUED.                          */ 00399000
*/*                                                                  */ 00400000
*/* ENTRY - INLINE SUBROUTINE ENTERED AT THE TOP                     */ 00401000
*/*                                                                  */ 00402000
*/*   PURPOSE - SEE FUNCTION                                         */ 00403000
*/*                                                                  */ 00404000
*/*   INPUT -                                                        */ 00405000
*/*        .ASWAPTR - PTR TO ASWA FOR STEP ALLOCATION                */ 00406000
*/*        .DUMPSW - ON IF DUMP TAKEN - MEANS RECORD IN SETRP        */ 00407000
*/*        .LASTEXIT - EXIT NAME FROM LAST ASWA USED IN              */ 00408000
*/*                    HEADER OF SDUMP                               */ 00409000
*/*                                                                  */ 00410000
*/* EXIT - INLINE SUBROUTINE THAT EXITS FROM THE BOTTOM              */ 00411000
*/*                                                                  */ 00412000
*/*   CONDITION - SETRP ISSUED                                       */ 00413000
*/*                                                                  */ 00414000
*/*   OUTPUT - SDWA UPDATED WITH APPROPRIATE RETURN PARAMETERS       */ 00415000
*/*                                                                  */ 00416000
*/*   RETURN CODES - NONE                                            */ 00417000
*/*                                                                  */ 00418000
*/********************************************************************/ 00419000
*REGFLAG = ALLREGS;                    /*SAY ALL REGS TO BE UPDATED  */ 00420000
         MVC   REGFLAG(2),ALLREGS                               02S0154 00421000
*REGS(FOURTEEN) = INITSVP;             /*@ OF INIT'S SAVE AREA TO R13*/ 00422000
         L     @03,ASWAPRMS(,ASWAPTR)                           02S0155 00423000
         L     @03,JAEXSAVE(,@03)                               02S0155 00424000
         L     @03,INITSVP(,@03)                                02S0155 00425000
         ST    @03,REGS+52                                      02S0155 00426000
*REGS(FIFTEEN) = INITREGS(ONE);        /*REG14 WITH INIT'S REG14     */ 00427000
         MVC   REGS+56(4),INITREGS(@03)                         02S0156 00428000
*REGS(SIXTEEN) = INITREGS(TWO);        /*REG15 WITH INIT'S REG15     */ 00429000
         MVC   REGS+60(4),INITREGS+4(@03)                       02S0157 00430000
*INITCNT = THREE;                      /*START W 3RD REG IN SAVE AREA*/ 00431000
         LA    INITCNT,3                                        02S0158 00432000
*DO REGCNT = ZERO TO TWELVE;           /*GET INIT'S REGS 0 THRU 12   */ 00433000
         LR    REGCNT,@10                                       02S0159 00434000
@DL00159 DS    0H                                               02S0160 00435000
*  REGS(REGCNT+ONE) = INITREGS(INITCNT); /*INIT REG TO REG UPDATE BLK*/ 00436000
         LR    @10,REGCNT                                       02S0160 00437000
         SLA   @10,2                                            02S0160 00438000
         LR    @15,INITCNT                                      02S0160 00439000
         SLA   @15,2                                            02S0160 00440000
         L     @14,ASWAPRMS(,ASWAPTR)                           02S0160 00441000
         L     @14,JAEXSAVE(,@14)                               02S0160 00442000
         L     @14,INITSVP(,@14)                                02S0160 00443000
         L     @00,INITREGS-4(@15,@14)                          02S0160 00444000
         ST    @00,REGS(@10)                                    02S0160 00445000
*  INITCNT = INITCNT + ONE;            /*INDEX TO NEXT INIT REG      */ 00446000
         AH    INITCNT,@CH00093                                 02S0161 00447000
*END;                                  /*END INIT REGS TO RUB        */ 00448000
         AH    REGCNT,@CH00093                                  02S0162 00449000
         CH    REGCNT,@CH00032                                  02S0162 00450000
         BNH   @DL00159                                         02S0162 00451000
*IF DUMPSW = ON THEN                   /*DUMP TAKEN EARLIER?         */ 00452000
         TM    DUMPSW,B'10000000'                               02S0163 00453000
         BNO   @RF00163                                         02S0163 00454000
*  DO;                                 /*YES, RECORDING THEN IN SETRP*/ 00455000
*    RECRDPRM = RECPARMS;              /*COPY STATIC RECORD INFO     */ 00456000
         MVC   RECRDPRM(28),RECPARMS                            02S0165 00457000
*    RECRDCST = LASTEXIT;              /*PUT IN CSECT FROM LAST ASWA */ 00458000
         MVC   RECRDCST(8),LASTEXIT                             02S0166 00459000
*     DO;  /*SETRP RECORD(YES)DUMP(NO)RECPARM(RECRDPRM)FRESDWA(YES)RETA 00460000
*DR(IEFAB4E3)RC(4)RETREGS(YES)RUB(REGBLOCK)*/                   02S0167 00461000
*       RESPECIFY (GPR00P,GPR01P,GPR14P,GPR15P) RSTD;           02S0168 00462000
*       GPR01P->SDWARCDE = 4; /*STORE RC INTO SDWA*/            02S0169 00463000
         MVI   SDWARCDE(GPR01P),X'04'                           02S0169 00464000
*       GPR01P->SDWARTYA = ADDR(IEFAB4E3);  /*SAVE RETRY ADDRESS*/      00465000
         L     @10,@CV00140                                     02S0170 00466000
         ST    @10,SDWARTYA(,GPR01P)                            02S0170 00467000
*       GPR01P->SDWAFREE = '1'B;  /*SET FLAG TO FREE SDWA*/     02S0171 00468000
*       GPR01P->SDWARCRD = '1'B;  /*TURN ON RECORD INDICATOR*/  02S0172 00469000
         OI    SDWAFREE(GPR01P),B'10000100'                     02S0172 00470000
*       GPR15P = ADDR(RECRDPRM);  /*ACCESS RECORD PARAMETER LIST*/      00471000
         LA    GPR15P,RECRDPRM                                  02S0173 00472000
*       GPR01P->SDWARECP = GPR15P ->I256C(1:24);  /*COPY RECORD PARAMET 00473000
*RS*/                                                           02S0174 00474000
         MVC   SDWARECP(24,GPR01P),I256C(GPR15P)                02S0174 00475000
*       GPR01P->SDWAREQ = '0'B;  /*TURN OFF DUMP INDICATOR*/    02S0175 00476000
         NI    SDWAREQ(GPR01P),B'01111111'                      02S0175 00477000
*       GPR01P->SDWAUPRG = '1'B;  /*TURN ON RETREGS INDICATOR*/ 02S0176 00478000
         OI    SDWAUPRG(GPR01P),B'00001000'                     02S0176 00479000
*       GPR15P = ADDR(REGBLOCK);  /*GET PTR TO REG UPDATE BLOCK*/       00480000
         LA    GPR15P,REGBLOCK                                  02S0177 00481000
*       GPR00P = GPR15P->I015F;  /*ACCESS REGISTER BIT PATTERN*/        00482000
         LH    GPR00P,I015F(,GPR15P)                            02S0178 00483000
*       GPR15P = GPR15P + 2;  /*CREATE PTR TO USER REG VALUES*/ 02S0179 00484000
         AH    GPR15P,@CH00126                                  02S0179 00485000
*       GPR14P = ADDR(GPR01P->SDWASRSV);  /*CREATE PTR TO SDWA SAVE ARE 00486000
**/                                                             02S0180 00487000
         LA    GPR14P,SDWASRSV(,GPR01P)                         02S0180 00488000
*       GEN (SLL   0,16);  /*SHIFT BIT PATTERN TO HIGH ORDER*/  02S0181 00489000
         SLL   0,16                                                     00490000
*R0004:                                                         02S0182 00491000
*       GEN FLOWS(I0004);                                       02S0182 00492000
R0004    DS    0H                                               02S0182 00493000
        ALR   0,0                    SHIFT BIT TO SIGN POSITION         00494000
        BC    12,I0004               BRANCH IF BIT NOT ON               00495000
        MVC   0(4,14),0(15)          MODIFY REGISTER IN SDWA            00496000
        LA    15,4(15)               UPDATE POINTER                     00497000
*I0004:                                                         02S0183 00498000
*       GENERATE FLOWS(R0004);                                  02S0183 00499000
I0004    DS    0H                                               02S0183 00500000
        LA    14,4(14)               UPDATE PTR IN SDWA                 00501000
        BC    5,R0004                TEST ALR CONDITION CODE TO TEST    00502000
*                                    IF ALL BITS EXHAUSTED              00503000
*       RESPECIFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;         02S0184 00504000
*     END;   /*SETRP WITH RECORDING       */                    02S0185 00505000
*  END;                                /*END IF DUMP TAKEN           */ 00506000
*ELSE                                  /*NO DUMP TAKEN               */ 00507000
*  DO;                                 /*SETRP W/O RECORDING         */ 00508000
         B     @RC00163                                         02S0187 00509000
@RF00163 DS    0H                                               02S0188 00510000
*     DO;  /*SETRP RECORD(NO)DUMP(NO)FRESDWA(YES)RETADDR(IEFAB4E3)RC(4) 00511000
*ETREGS(YES)RUB(REGBLOCK)*/                                     02S0188 00512000
*       RESPECIFY (GPR00P,GPR01P,GPR14P,GPR15P) RSTD;           02S0189 00513000
*       GPR01P->SDWARCDE = 4; /*STORE RC INTO SDWA*/            02S0190 00514000
         MVI   SDWARCDE(GPR01P),X'04'                           02S0190 00515000
*       GPR01P->SDWARTYA = ADDR(IEFAB4E3);  /*SAVE RETRY ADDRESS*/      00516000
         L     @10,@CV00140                                     02S0191 00517000
         ST    @10,SDWARTYA(,GPR01P)                            02S0191 00518000
*       GPR01P->SDWAFREE = '1'B;  /*SET FLAG TO FREE SDWA*/     02S0192 00519000
*       GPR01P->SDWARCRD = '0'B;  /*TURN OFF RECORD INDICATOR*/ 02S0193 00520000
         OI    SDWAFREE(GPR01P),B'00000100'                     02S0193 00521000
         NI    SDWARCRD(GPR01P),B'01111111'                     02S0193 00522000
*       GPR01P->SDWAREQ = '0'B;  /*TURN OFF DUMP INDICATOR*/    02S0194 00523000
         NI    SDWAREQ(GPR01P),B'01111111'                      02S0194 00524000
*       GPR01P->SDWAUPRG = '1'B;  /*TURN ON RETREGS INDICATOR*/ 02S0195 00525000
         OI    SDWAUPRG(GPR01P),B'00001000'                     02S0195 00526000
*       GPR15P = ADDR(REGBLOCK);  /*GET PTR TO REG UPDATE BLOCK*/       00527000
         LA    GPR15P,REGBLOCK                                  02S0196 00528000
*       GPR00P = GPR15P->I015F;  /*ACCESS REGISTER BIT PATTERN*/        00529000
         LH    GPR00P,I015F(,GPR15P)                            02S0197 00530000
*       GPR15P = GPR15P + 2;  /*CREATE PTR TO USER REG VALUES*/ 02S0198 00531000
         AH    GPR15P,@CH00126                                  02S0198 00532000
*       GPR14P = ADDR(GPR01P->SDWASRSV);  /*CREATE PTR TO SDWA SAVE ARE 00533000
**/                                                             02S0199 00534000
         LA    GPR14P,SDWASRSV(,GPR01P)                         02S0199 00535000
*       GEN (SLL   0,16);  /*SHIFT BIT PATTERN TO HIGH ORDER*/  02S0200 00536000
         SLL   0,16                                                     00537000
*R0006:                                                         02S0201 00538000
*       GEN FLOWS(I0006);                                       02S0201 00539000
R0006    DS    0H                                               02S0201 00540000
        ALR   0,0                    SHIFT BIT TO SIGN POSITION         00541000
        BC    12,I0006               BRANCH IF BIT NOT ON               00542000
        MVC   0(4,14),0(15)          MODIFY REGISTER IN SDWA            00543000
        LA    15,4(15)               UPDATE POINTER                     00544000
*I0006:                                                         02S0202 00545000
*       GENERATE FLOWS(R0006);                                  02S0202 00546000
I0006    DS    0H                                               02S0202 00547000
        LA    14,4(14)               UPDATE PTR IN SDWA                 00548000
        BC    5,R0006                TEST ALR CONDITION CODE TO TEST    00549000
*                                    IF ALL BITS EXHAUSTED              00550000
*       RESPECIFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;         02S0203 00551000
*     END;               /*SETRP W/O RECORDING         */       02S0204 00552000
*  END;                                                         02S0205 00553000
*      END;                            /*END IF STEP ALLOC           */ 00554000
*    ELSE                              /*NO STEP ALLOCATION          */ 00555000
*      IF DUMPSW = ON THEN             /*WAS DUMP TAKEN              */ 00556000
         B     @RC00152                                         01S0207 00557000
@RF00152 TM    DUMPSW,B'10000000'                               01S0207 00558000
         BNO   @RF00207                                         01S0207 00559000
*        DO;                           /*RECORDING IN SETRP          */ 00560000
*          RECRDPRM = RECPARMS;        /*COPY STATIC RECORD INFO     */ 00561000
         MVC   RECRDPRM(28),RECPARMS                            01S0209 00562000
*          RECRDCST = LASTEXIT;        /*PUT IN CSECT FOR LAST ASWA  */ 00563000
         MVC   RECRDCST(8),LASTEXIT                             01S0210 00564000
*           DO;  /*SETRP RECORD(YES)DUMP(NO)RECPARM(RECRDPRM)*/ 01S0211 00565000
*             RESPECIFY (GPR00P,GPR01P,GPR14P,GPR15P) RSTD;     01S0212 00566000
*             GPR01P->SDWARCDE = 0;  /*SAVE RC VALUE*/          01S0213 00567000
         MVI   SDWARCDE(GPR01P),X'00'                           01S0213 00568000
*             GPR01P->SDWARCRD = '1'B;  /*TURN ON RECORD INDICATOR*/    00569000
         OI    SDWARCRD(GPR01P),B'10000000'                     01S0214 00570000
*             GPR15P = ADDR(RECRDPRM);  /*ACCESS RECORD PARAMETER LIST* 00571000
*                                                               01S0215 00572000
         LA    GPR15P,RECRDPRM                                  01S0215 00573000
*             GPR01P->SDWARECP = GPR15P ->I256C(1:24);  /*COPY RECORD P 00574000
*RAMETERS*/                                                     01S0216 00575000
         MVC   SDWARECP(24,GPR01P),I256C(GPR15P)                01S0216 00576000
*             GPR01P->SDWAREQ = '0'B;  /*TURN OFF DUMP INDICATOR*/      00577000
         NI    SDWAREQ(GPR01P),B'01111111'                      01S0217 00578000
*             RESPECIFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;   01S0218 00579000
*           END;                                                01S0219 00580000
*                                      /*SETRP WITH RECORDING        */ 00581000
*        END;                          /*END IF DUMP TAKEN           */ 00582000
*      ELSE                            /*NO RECORDING DONE           */ 00583000
*        IF USERPROB = ON THEN         /*IF ERROR DUE TO USER        */ 00584000
         B     @RC00207                                         01S0221 00585000
@RF00207 TM    USERPROB,B'01000000'                             01S0221 00586000
         BNO   @RF00221                                         01S0221 00587000
*          DO;                         /*DUMP IN SETRP               */ 00588000
*             DO;  /*SETRP RECORD(NO)DUMP(YES)*/                01S0223 00589000
*               RESPECIFY (GPR00P,GPR01P,GPR14P,GPR15P) RSTD;   01S0224 00590000
*               GPR01P->SDWARCDE = 0;  /*SAVE RC VALUE*/        01S0225 00591000
         MVI   SDWARCDE(GPR01P),X'00'                           01S0225 00592000
*               GPR01P->SDWARCRD = '0'B;  /*TURN OFF RECORD INDICATOR*/ 00593000
         NI    SDWARCRD(GPR01P),B'01111111'                     01S0226 00594000
*               GPR01P->SDWAREQ = '1'B;  /*TURN ON DUMP INDICATOR*/     00595000
         OI    SDWAREQ(GPR01P),B'10000000'                      01S0227 00596000
*               RESPECIFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD; 01S0228 00597000
*             END;   /*SETRP WITH DUMP          */              01S0229 00598000
*          END;                        /*END IF USER ERROR           */ 00599000
*        ELSE                          /*NO USER ERROR; SYSTEM ERROR */ 00600000
*          DO;                         /*NORMAL SETRP                */ 00601000
         B     @RC00221                                         01S0231 00602000
@RF00221 DS    0H                                               01S0232 00603000
*             DO;  /*SETRP RECORD(NO)DUMP(NO)*/                 01S0232 00604000
*               RESPECIFY (GPR00P,GPR01P,GPR14P,GPR15P) RSTD;   01S0233 00605000
*               GPR01P->SDWARCDE = 0;  /*SAVE RC VALUE*/        01S0234 00606000
         MVI   SDWARCDE(GPR01P),X'00'                           01S0234 00607000
*               GPR01P->SDWARCRD = '0'B;  /*TURN OFF RECORD INDICATOR*/ 00608000
         NI    SDWARCRD(GPR01P),B'01111111'                     01S0235 00609000
*               GPR01P->SDWAREQ = '0'B;  /*TURN OFF DUMP INDICATOR*/    00610000
         NI    SDWAREQ(GPR01P),B'01111111'                      01S0236 00611000
*               RESPECIFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD; 01S0237 00612000
*             END;   /*SETRP W/O DUMP OR RECORD  */             01S0238 00613000
*          END;                        /*END OF NORMAL SETRP         */ 00614000
*  END;                                /*END IF SDWA EXISTS          */ 00615000
*ELSE;                                 /*NO SDWA-NO SETRP            */ 00616000
@RF00148 DS    0H                                               01S0242 00617000
*RFY (R1,R14,R15) RSTD;                                         01S0242 00618000
@RC00148 DS    0H                                               01S0243 00619000
*R15 = ZERO;                           /*NO RETRY- NEEDED IF NO SDWA */ 00620000
         SLR   R15,R15                                          01S0243 00621000
*R1 = SDWAPTR;                         /*REG1 HAS SDWA IF ONE EXISTS */ 00622000
         LR    R1,SDWAPTR                                       01S0244 00623000
*R14 = SAVREG14;                       /*GET RETURN ADDRESS          */ 00624000
         L     R14,SAVREG14                                     01S0245 00625000
*GEN (BR 14);                          /*NORMAL RETURN               */ 00626000
*                                                               01S0246 00627000
*                                                               01S0246 00628000
         BR 14                                                          00629000
* DECLARE /*GENERAL PURPOSE REGISTERS */                        01S0247 00630000
*   GPR00P PTR(31) REG(0),                                      01S0247 00631000
*   GPR01P PTR(31) REG(1),                                      01S0247 00632000
*   GPR14P PTR(31) REG(14),                                     01S0247 00633000
*   GPR15P PTR(31) REG(15);                                     01S0247 00634000
*                                                               01S0247 00635000
* DECLARE /* COMMON VARIABLES */                                01S0248 00636000
*   I256C CHAR(256) BASED,                                      01S0248 00637000
*   I031F FIXED(31) BASED,                                      01S0248 00638000
*   I031P PTR(31)   BASED,                                      01S0248 00639000
*   I015F FIXED(15) BASED,                                      01S0248 00640000
*   I015P PTR(15)   BASED,                                      01S0248 00641000
*   I008P PTR(8)    BASED,                                      01S0248 00642000
*   I001C CHAR(1)   BASED;                                      01S0248 00643000
*END IEFAB4ED                                                   01S0249 00644000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00645000
*/*%INCLUDE SYSLIB  (AB4EDSPC)                                        * 00646000
*/*%INCLUDE SYSLIB  (COMESTDT)                                        * 00647000
*/*%INCLUDE SYSLIB  (IEFZB453)                                        * 00648000
*/*%INCLUDE SYSLIB  (IEFZB4D9)                                        * 00649000
*/*%INCLUDE SYSLIB  (IEFZB4D7)                                        * 00650000
*/*%INCLUDE SYSLIB  (IEFZB447)                                        * 00651000
*/*%INCLUDE SYSLIB  (IEFZB452)                                        * 00652000
*/*%INCLUDE SYSLIB  (IEZJSCB )                                        * 00653000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                        * 00654000
*/*%INCLUDE SYSLIB  (IHASDWA )                                        * 00655000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 00656000
*/*%INCLUDE SYSLIB  (IHASUBIT)                                        * 00657000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        * 00658000
*/*%INCLUDE SYSLIB  (IHAASCB )                                        * 00659000
*/*%INCLUDE SYSLIB  (DUMPCHEK)                                        * 00660000
*/*%INCLUDE SYSLIB  (DUMPCKSP)                                        * 00661000
*/*%INCLUDE SYSLIB  (ROUTER  )                                        * 00662000
*/*%INCLUDE SYSLIB  (ROUTERSP)                                        * 00663000
*/*%INCLUDE SYSLIB  (TERMCALL)                                        * 00664000
*/*%INCLUDE SYSLIB  (TERMSPEC)                                        * 00665000
*/*%INCLUDE SYSLIB  (STPSETRP)                                        * 00666000
*/*%INCLUDE SYSLIB  (STPSETSP)                                        * 00667000
*;                                                              01S0249 00668000
@DATA    DS    0H                                                       00669000
@CH00093 DC    H'1'                                                     00670000
@CH00126 DC    H'2'                                                     00671000
@CH00032 DC    H'12'                                                    00672000
@SM02451 MVC   SDMPCORE(0),SDMPLIST                                     00673000
@DATD    DSECT                                                          00674000
         DS    0F                                                       00675000
@SA00001 DS    18F                                                      00676000
IEFAB4ED CSECT                                                          00677000
         DS    0F                                                       00678000
@CF00038 DC    F'16'                                                    00679000
@DATD    DSECT                                                          00680000
         DS    0D                                                       00681000
SAVREG14 DS    A                                                        00682000
EXITPRMP DS    A                                                        00683000
VMVEXITP DS    A                                                        00684000
@TS00001 DS    CL2                                                      00685000
         DS    CL2                                                      00686000
REGSAVE  DS    CL76                                                     00687000
         ORG   REGSAVE                                                  00688000
@NM00001 DS    CL12                                                     00689000
REGSTERS DS    16F                                                      00690000
         ORG   REGSAVE+76                                               00691000
HDRCORE  DS    CL36                                                     00692000
         ORG   HDRCORE                                                  00693000
HDRLNG   DS    AL1                                                      00694000
HDRLOAD  DS    CL18                                                     00695000
         ORG   HDRLOAD                                                  00696000
HDRWRDS1 DS    CL9                                                      00697000
HDRLDMOD DS    CL9                                                      00698000
         ORG   HDRCORE+19                                               00699000
HDRCSECT DS    CL17                                                     00700000
         ORG   HDRCSECT                                                 00701000
HDRWRDS2 DS    CL9                                                      00702000
HDREXITN DS    CL8                                                      00703000
         ORG   HDRCORE+36                                               00704000
LASTEXIT DS    CL8                                                      00705000
RECRDPRM DS    CL28                                                     00706000
         ORG   RECRDPRM                                                 00707000
RECRDMOD DS    CL8                                                      00708000
RECRDCST DS    CL8                                                      00709000
RECRDFRR DS    CL8                                                      00710000
RECRDVAR DS    AL4                                                      00711000
         ORG   RECRDPRM+28                                              00712000
         DS    CL2                                                      00713000
REGBLOCK DS    CL66                                                     00714000
         ORG   REGBLOCK                                                 00715000
REGFLAG  DS    BL2                                                      00716000
REGS     DS    16F                                                      00717000
         ORG   REGBLOCK+66                                              00718000
SWITCHES DS    BL1                                                      00719000
         ORG   SWITCHES                                                 00720000
DUMPSW   DS    BL1                                                      00721000
USERPROB EQU   SWITCHES+0                                               00722000
FRRPERCD EQU   SWITCHES+0                                               00723000
@NM00005 EQU   SWITCHES+0                                               00724000
         ORG   SWITCHES+1                                               00725000
TERMAREA DS    CL16                                                     00726000
IEFAB4ED CSECT                                                          00727000
         NOPR  ((@ENDDATD-@DATD)/501*16)                                00728000
         DS    0F                                                       00729000
@SIZDATD DC    AL1(0)                                                   00730000
         DC    AL3(@ENDDATD-@DATD)                                      00731000
@CV00140 DC    V(IEFAB4E3)                                              00732000
         DS    0D                                                       00733000
@CC00142 DC    C'IEFAB4E4'                                              00734000
@CB02449 DC    B'1111111111110000'                                      00735000
ALLREGS  DC    X'FFFF'                                                  00736000
HEDCORE  DS    CL36                                                     00737000
         ORG   HEDCORE                                                  00738000
HEDLNG   DC    AL1(35)                                                  00739000
HEDLOAD  DS    CL18                                                     00740000
         ORG   HEDLOAD                                                  00741000
HEDWRDS1 DC    CL9'LOAD MOD-'                                           00742000
HEDLDMOD DC    CL9'IEFW21SD '                                           00743000
         ORG   HEDCORE+19                                               00744000
HEDCSECT DS    CL17                                                     00745000
         ORG   HEDCSECT                                                 00746000
HEDWRDS2 DC    CL9'EXIT RTN-'                                           00747000
HEDEXITN DC    CL8'        '                                            00748000
         ORG   HEDCORE+36                                               00749000
RECPARMS DS    CL28                                                     00750000
         ORG   RECPARMS                                                 00751000
RECMODNM DC    CL8'IEFW21SD'                                            00752000
RECCSECT DC    CL8'        '                                            00753000
RECFRR   DC    CL8'        '                                            00754000
RECVARPT DC    A(0)                                                     00755000
         ORG   RECPARMS+28                                              00756000
@DATD    DSECT                                                          00757000
SDMPCORE SDUMP SDATA=(NUC,RGN,LPA,TRT,CSA,ALLPSA,SQA),                **00758000
               QUIESCE=YES,MF=L                                         00759000
*                                                             @ZA10071  00760000
IEFAB4ED CSECT                                                          00761000
SDMPLIST SDUMP SDATA=(NUC,RGN,LPA,TRT,CSA,ALLPSA,SQA),                **00762000
               QUIESCE=YES,MF=L                                         00763000
*                                                             @ZA10071  00764000
SDMPLENG DC A(*-SDMPLIST)                                               00765000
IEFAB4ED CSECT                                                          00766000
         DS   0H                                                        00767000
PATCHLOC DC ((@DATA-@PSTART)/20)X'00'                                   00768000
@DATD    DSECT                                                          00769000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00770000
@ENDDATD EQU   *                                                        00771000
IEFAB4ED CSECT                                                          00772000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00773000
@01      EQU   01                                                       00774000
@02      EQU   02                                                       00775000
@03      EQU   03                                                       00776000
@04      EQU   04                                                       00777000
@05      EQU   05                                                       00778000
@06      EQU   06                                                       00779000
@07      EQU   07                                                       00780000
@08      EQU   08                                                       00781000
@09      EQU   09                                                       00782000
@10      EQU   10                                                       00783000
@11      EQU   11                                                       00784000
@12      EQU   12                                                       00785000
@13      EQU   13                                                       00786000
@14      EQU   14                                                       00787000
@15      EQU   15                                                       00788000
REGCNT   EQU   @03                                                      00789000
INITCNT  EQU   @02                                                      00790000
SDWAPTR  EQU   @07                                                      00791000
TCBPTR   EQU   @04                                                      00792000
PARMSAVP EQU   @10                                                      00793000
JSCBPTR  EQU   @02                                                      00794000
ASWAPTR1 EQU   @08                                                      00795000
ASWALPTR EQU   @09                                                      00796000
ASWAPTR  EQU   @06                                                      00797000
ASCBPTR  EQU   @02                                                      00798000
R0       EQU   @00                                                      00799000
R1       EQU   @01                                                      00800000
R2       EQU   @02                                                      00801000
R9       EQU   @09                                                      00802000
R13      EQU   @13                                                      00803000
R14      EQU   @14                                                      00804000
R15      EQU   @15                                                      00805000
GPR00P   EQU   @00                                                      00806000
GPR01P   EQU   @01                                                      00807000
GPR14P   EQU   @14                                                      00808000
GPR15P   EQU   @15                                                      00809000
CVTPTR   EQU   16                                                       00810000
LOC16PTR EQU   16                                                       00811000
PSA      EQU   0                                                        00812000
FLCRNPSW EQU   PSA                                                      00813000
FLCROPSW EQU   PSA+8                                                    00814000
FLCICCW2 EQU   PSA+16                                                   00815000
PSAEEPSW EQU   PSA+132                                                  00816000
PSAESPSW EQU   PSA+136                                                  00817000
FLCSVILC EQU   PSAESPSW+1                                               00818000
PSAEPPSW EQU   PSA+140                                                  00819000
FLCPIILC EQU   PSAEPPSW+1                                               00820000
FLCPICOD EQU   PSAEPPSW+2                                               00821000
PSAPICOD EQU   FLCPICOD+1                                               00822000
FLCTEA   EQU   PSAEPPSW+4                                               00823000
FLCPER   EQU   PSA+152                                                  00824000
FLCMCLA  EQU   PSA+168                                                  00825000
FLCIOEL  EQU   FLCMCLA+4                                                00826000
FLCIOA   EQU   FLCMCLA+16                                               00827000
FLCFSA   EQU   FLCMCLA+80                                               00828000
PSAAOLD  EQU   PSA+548                                                  00829000
PSASUPER EQU   PSA+552                                                  00830000
PSASUP1  EQU   PSASUPER                                                 00831000
PSASUP2  EQU   PSASUPER+1                                               00832000
PSASUP3  EQU   PSASUPER+2                                               00833000
PSASUP4  EQU   PSASUPER+3                                               00834000
PSACLHT  EQU   PSA+640                                                  00835000
PSALKSA  EQU   PSA+696                                                  00836000
PSAHLHI  EQU   PSA+760                                                  00837000
PSADSSFL EQU   PSA+836                                                  00838000
PSADSSF1 EQU   PSADSSFL                                                 00839000
PSADSSF3 EQU   PSADSSFL+2                                               00840000
PSADSSF4 EQU   PSADSSFL+3                                               00841000
PSARSVT  EQU   PSA+896                                                  00842000
TCBLISTP EQU   0                                                        00843000
TWOTCBPS EQU   0                                                        00844000
CURNTCBP EQU   TWOTCBPS+4                                               00845000
BB401SVE EQU   0                                                        00846000
INITSVP  EQU   BB401SVE+4                                               00847000
INITSAVE EQU   0                                                        00848000
INITREGS EQU   INITSAVE+12                                              00849000
JAEXPARM EQU   0                                                        00850000
JAEXSAVE EQU   JAEXPARM+260                                             00851000
JAEXFLAG EQU   JAEXPARM+268                                             00852000
ASWA     EQU   0                                                        00853000
ASWACSCT EQU   ASWA+4                                                   00854000
ASWARTNP EQU   ASWA+12                                                  00855000
ASWAPRMS EQU   ASWA+16                                                  00856000
ASWASCBP EQU   ASWA+20                                                  00857000
ASWAOLDP EQU   ASWA+24                                                  00858000
ASWAFLGS EQU   ASWA+28                                                  00859000
ASWADSWS EQU   ASWAFLGS                                                 00860000
ASWADYNF EQU   ASWADSWS                                                 00861000
ASWACOMF EQU   ASWADSWS                                                 00862000
ASWAVMVF EQU   ASWADSWS                                                 00863000
ASWADYUE EQU   ASWADSWS                                                 00864000
ASWANOCH EQU   ASWADSWS                                                 00865000
ASWACHNP EQU   ASWA+36                                                  00866000
DEPARMS  EQU   0                                                        00867000
DEALFMAP EQU   DEPARMS+200                                              00868000
DENQRETN EQU   DEPARMS+232                                              00869000
DEDMYEPA EQU   DEPARMS+240                                              00870000
DEDMYAS  EQU   DEPARMS+260                                              00871000
ALFNCMAP EQU   0                                                        00872000
INPUTSW  EQU   ALFNCMAP                                                 00873000
PROCESSW EQU   ALFNCMAP+6                                               00874000
ERRPROSW EQU   PROCESSW                                                 00875000
FRRPERSW EQU   PROCESSW                                                 00876000
USERERSW EQU   PROCESSW+1                                               00877000
PRMESTAE EQU   0                                                        00878000
PRMRESC  EQU   PRMESTAE+252                                             00879000
PRMFUNC  EQU   PRMESTAE+253                                             00880000
DUMPOK   EQU   PRMFUNC                                                  00881000
VMVEPRMS EQU   0                                                        00882000
VEXFLAGS EQU   VMVEPRMS+196                                             00883000
VEXFRR   EQU   VEXFLAGS                                                 00884000
IEZJSCB  EQU   0                                                        00885000
JSCBSEC1 EQU   IEZJSCB+188                                              00886000
JSCHPCE  EQU   JSCBSEC1+4                                               00887000
JSCBDCB  EQU   JSCBSEC1+36                                              00888000
JSCBOPTS EQU   JSCBSEC1+48                                              00889000
JSCBSWT1 EQU   JSCBSEC1+55                                              00890000
JSCBWTP  EQU   JSCBSEC1+64                                              00891000
JSCBWTFG EQU   JSCBWTP                                                  00892000
JSCBEND1 EQU   IEZJSCB+260                                              00893000
TCBFIX   EQU   0                                                        00894000
TCBFRS   EQU   TCBFIX                                                   00895000
TCB      EQU   0                                                        00896000
TCBPIE   EQU   TCB+4                                                    00897000
TCBPMASK EQU   TCBPIE                                                   00898000
TCBCMP   EQU   TCB+16                                                   00899000
TCBCMPF  EQU   TCBCMP                                                   00900000
TCBCPP   EQU   TCBCMPF                                                  00901000
TCBSTCC  EQU   TCBCMPF                                                  00902000
TCBCDBL  EQU   TCBCMPF                                                  00903000
TCBCWTO  EQU   TCBCMPF                                                  00904000
TCBCIND  EQU   TCBCMPF                                                  00905000
TCBCMSG  EQU   TCBCMPF                                                  00906000
TCBTRN   EQU   TCB+20                                                   00907000
TCBABF   EQU   TCBTRN                                                   00908000
TCBMSS   EQU   TCB+24                                                   00909000
TCBPKF   EQU   TCB+28                                                   00910000
TCBFLGS  EQU   TCB+29                                                   00911000
TCBFLGS1 EQU   TCBFLGS                                                  00912000
TCBFLGS2 EQU   TCBFLGS+1                                                00913000
TCBFLGS3 EQU   TCBFLGS+2                                                00914000
TCBFLGS4 EQU   TCBFLGS+3                                                00915000
TCBFLGS5 EQU   TCBFLGS+4                                                00916000
TCBABWF  EQU   TCBFLGS5                                                 00917000
TCBJPQ   EQU   TCB+44                                                   00918000
TCBPURGE EQU   TCBJPQ                                                   00919000
TCBGRS   EQU   TCB+48                                                   00920000
TCBFSA   EQU   TCB+112                                                  00921000
TCBTME   EQU   TCB+120                                                  00922000
TCBJSTCB EQU   TCB+124                                                  00923000
TCBTSFLG EQU   TCB+148                                                  00924000
TCBTSTSK EQU   TCBTSFLG                                                 00925000
TCBSTAB  EQU   TCB+160                                                  00926000
TCBNSTAE EQU   TCBSTAB                                                  00927000
TCBTCT   EQU   TCB+164                                                  00928000
TCBTCTGF EQU   TCBTCT                                                   00929000
TCBSCNDY EQU   TCB+172                                                  00930000
TCBNDSP  EQU   TCBSCNDY                                                 00931000
TCBNDSP1 EQU   TCBNDSP+1                                                00932000
TCBNDSP2 EQU   TCBNDSP+2                                                00933000
TCBNDSP3 EQU   TCBNDSP+3                                                00934000
TCBJSCB  EQU   TCB+180                                                  00935000
TCBRECDE EQU   TCBJSCB                                                  00936000
TCBEXT1  EQU   TCB+196                                                  00937000
TCBBITS  EQU   TCB+200                                                  00938000
TCBNDSP4 EQU   TCBBITS                                                  00939000
TCBNDSP5 EQU   TCBBITS+1                                                00940000
TCBFLGS6 EQU   TCBBITS+2                                                00941000
TCBFLGS7 EQU   TCBBITS+3                                                00942000
TCBDAR   EQU   TCB+204                                                  00943000
TCBDARC  EQU   TCBDAR                                                   00944000
TCBEXT2  EQU   TCB+208                                                  00945000
TCBXSCT  EQU   TCB+240                                                  00946000
TCBXSCT1 EQU   TCBXSCT                                                  00947000
TCBFOE   EQU   TCB+244                                                  00948000
TCBSTAWA EQU   TCB+252                                                  00949000
TCBESTAE EQU   TCB+264                                                  00950000
TCBESTRM EQU   TCBESTAE+1                                               00951000
TCBFBYT1 EQU   TCB+276                                                  00952000
TCBFBYT2 EQU   TCB+277                                                  00953000
TCBRV124 EQU   TCB+278                                                  00954000
TCBRV133 EQU   TCB+279                                                  00955000
TCBXTNT2 EQU   0                                                        00956000
TCBGTF   EQU   TCBXTNT2                                                 00957000
TCBTFLG  EQU   TCBGTF                                                   00958000
TCBRV146 EQU   TCBXTNT2+28                                              00959000
TCBRV155 EQU   TCBXTNT2+29                                              00960000
TCBRV164 EQU   TCBXTNT2+30                                              00961000
TCBRV173 EQU   TCBXTNT2+31                                              00962000
SDWA     EQU   0                                                        00963000
SDWAPARM EQU   SDWA                                                     00964000
SDWAFIOB EQU   SDWA+4                                                   00965000
SDWAABCC EQU   SDWAFIOB                                                 00966000
SDWACMPF EQU   SDWAABCC                                                 00967000
SDWAREQ  EQU   SDWACMPF                                                 00968000
SDWACMPC EQU   SDWAABCC+1                                               00969000
SDWACTL1 EQU   SDWA+8                                                   00970000
SDWACMKA EQU   SDWACTL1                                                 00971000
SDWAMWPA EQU   SDWACTL1+1                                               00972000
SDWAPMKA EQU   SDWACTL1+4                                               00973000
SDWACTL2 EQU   SDWA+16                                                  00974000
SDWACMKP EQU   SDWACTL2                                                 00975000
SDWAMWPP EQU   SDWACTL2+1                                               00976000
SDWAPMKP EQU   SDWACTL2+4                                               00977000
SDWAGRSV EQU   SDWA+24                                                  00978000
SDWANAME EQU   SDWA+88                                                  00979000
SDWAEC1  EQU   SDWA+104                                                 00980000
SDWAEMK1 EQU   SDWAEC1                                                  00981000
SDWAMWP1 EQU   SDWAEC1+1                                                00982000
SDWAINT1 EQU   SDWAEC1+2                                                00983000
SDWANXT1 EQU   SDWAEC1+4                                                00984000
SDWAAEC1 EQU   SDWA+112                                                 00985000
SDWAILC1 EQU   SDWAAEC1+1                                               00986000
SDWAINC1 EQU   SDWAAEC1+2                                               00987000
SDWAICD1 EQU   SDWAINC1+1                                               00988000
SDWAEC2  EQU   SDWA+120                                                 00989000
SDWAEMK2 EQU   SDWAEC2                                                  00990000
SDWAMWP2 EQU   SDWAEC2+1                                                00991000
SDWAINT2 EQU   SDWAEC2+2                                                00992000
SDWANXT2 EQU   SDWAEC2+4                                                00993000
SDWAAEC2 EQU   SDWA+128                                                 00994000
SDWAILC2 EQU   SDWAAEC2+1                                               00995000
SDWAINC2 EQU   SDWAAEC2+2                                               00996000
SDWAICD2 EQU   SDWAINC2+1                                               00997000
SDWASRSV EQU   SDWA+136                                                 00998000
SDWAIDNT EQU   SDWA+200                                                 00999000
SDWAMCH  EQU   SDWA+204                                                 01000000
SDWASTCK EQU   SDWAMCH                                                  01001000
SDWAMCHI EQU   SDWAMCH+8                                                01002000
SDWAMCHS EQU   SDWAMCHI                                                 01003000
SDWAMCHD EQU   SDWAMCHI+1                                               01004000
SDWARSR1 EQU   SDWAMCH+12                                               01005000
SDWARSR2 EQU   SDWAMCH+13                                               01006000
SDWAFLGS EQU   SDWA+232                                                 01007000
SDWAERRA EQU   SDWAFLGS                                                 01008000
SDWAPCHK EQU   SDWAERRA                                                 01009000
SDWARKEY EQU   SDWAERRA                                                 01010000
SDWAERRB EQU   SDWAFLGS+1                                               01011000
SDWAERRC EQU   SDWAFLGS+2                                               01012000
SDWAPERC EQU   SDWAERRC                                                 01013000
SDWAERRD EQU   SDWAFLGS+3                                               01014000
SDWAIOFS EQU   SDWA+238                                                 01015000
SDWARTYA EQU   SDWA+240                                                 01016000
SDWACPUA EQU   SDWA+248                                                 01017000
SDWAPARQ EQU   SDWA+252                                                 01018000
SDWARCDE EQU   SDWAPARQ                                                 01019000
SDWAACF2 EQU   SDWAPARQ+1                                               01020000
SDWARCRD EQU   SDWAACF2                                                 01021000
SDWAUPRG EQU   SDWAACF2                                                 01022000
SDWAFREE EQU   SDWAACF2                                                 01023000
SDWAACF3 EQU   SDWAPARQ+2                                               01024000
SDWAACF4 EQU   SDWAPARQ+3                                               01025000
SDWALKWA EQU   SDWA+256                                                 01026000
SDWALKWS EQU   SDWALKWA                                                 01027000
SDWARECP EQU   SDWA+292                                                 01028000
SDWASNPA EQU   SDWA+320                                                 01029000
SDWADUMP EQU   SDWASNPA                                                 01030000
SDWADPFS EQU   SDWADUMP+1                                               01031000
SDWADDAT EQU   SDWASNPA+4                                               01032000
SDWASDAT EQU   SDWADDAT                                                 01033000
SDWAPDAT EQU   SDWADDAT+2                                               01034000
SDWADPSA EQU   SDWA+328                                                 01035000
SDWADPSL EQU   SDWADPSA                                                 01036000
SDWARA   EQU   SDWA+400                                                 01037000
SDWADPVA EQU   SDWARA+2                                                 01038000
CVTMAP   EQU   0                                                        01039000
CVTDAR   EQU   CVTMAP+72                                                01040000
CVTFLGS1 EQU   CVTDAR                                                   01041000
CVTDCB   EQU   CVTMAP+116                                               01042000
CVTIOQET EQU   CVTMAP+120                                               01043000
CVTIERLC EQU   CVTMAP+144                                               01044000
CVTHEAD  EQU   CVTMAP+160                                               01045000
CVTSV76C EQU   CVTHEAD                                                  01046000
CVTOPTA  EQU   CVTMAP+182                                               01047000
CVTOPTB  EQU   CVTMAP+183                                               01048000
CVTGTF   EQU   CVTMAP+236                                               01049000
CVTGTFST EQU   CVTGTF                                                   01050000
CVTGTFS  EQU   CVTGTFST                                                 01051000
CVTSTATE EQU   CVTGTFST                                                 01052000
CVTTMODE EQU   CVTGTFST                                                 01053000
CVTFORM  EQU   CVTGTFST                                                 01054000
CVTAQAVT EQU   CVTMAP+240                                               01055000
CVTTCMFG EQU   CVTAQAVT                                                 01056000
CVTVOLM2 EQU   CVTMAP+244                                               01057000
CVTTATA  EQU   CVTVOLM2                                                 01058000
CVTTSKS  EQU   CVTTATA                                                  01059000
CVTVOLF2 EQU   CVTTSKS                                                  01060000
CVTTAT   EQU   CVTTATA+1                                                01061000
CVTATER  EQU   CVTMAP+248                                               01062000
CVTEXT1  EQU   CVTMAP+252                                               01063000
CVTPURG  EQU   CVTMAP+260                                               01064000
CVTQMSG  EQU   CVTMAP+268                                               01065000
CVTDMSR  EQU   CVTMAP+272                                               01066000
CVTRSV37 EQU   CVTDMSR                                                  01067000
CVTDMSRF EQU   CVTRSV37                                                 01068000
CVTERPV  EQU   CVTMAP+316                                               01069000
CVTINTLA EQU   CVTMAP+320                                               01070000
CVTAPF   EQU   CVTMAP+324                                               01071000
CVTEXT2  EQU   CVTMAP+328                                               01072000
CVTHJES  EQU   CVTMAP+332                                               01073000
CVTPGSIA EQU   CVTMAP+348                                               01074000
CVTA1F1  EQU   CVTMAP+356                                               01075000
CVTSYSK  EQU   CVTMAP+357                                               01076000
CVTVOLM1 EQU   CVTMAP+380                                               01077000
CVTVOLF1 EQU   CVTVOLM1                                                 01078000
CVTATMCT EQU   CVTMAP+388                                               01079000
CVTXTNT1 EQU   0                                                        01080000
CVTXTNT2 EQU   0                                                        01081000
CVTDSSV  EQU   CVTXTNT2                                                 01082000
CVTFLGBT EQU   CVTXTNT2+5                                               01083000
CVTQID   EQU   CVTXTNT2+24                                              01084000
CVTICB   EQU   CVTXTNT2+48                                              01085000
CVTRV400 EQU   CVTXTNT2+52                                              01086000
CVTRV409 EQU   CVTXTNT2+53                                              01087000
CVTATCVT EQU   CVTXTNT2+64                                              01088000
CVTRV429 EQU   CVTXTNT2+84                                              01089000
CVTRV438 EQU   CVTXTNT2+85                                              01090000
CVTRV457 EQU   CVTXTNT2+112                                             01091000
CVTRV466 EQU   CVTXTNT2+113                                             01092000
CVTFIX   EQU   0                                                        01093000
CVTRELNO EQU   CVTFIX+252                                               01094000
SUBITS   EQU   0                                                        01095000
SUBYTE1  EQU   SUBITS                                                   01096000
SUBYTE2  EQU   SUBITS+1                                                 01097000
SUBYTE3  EQU   SUBITS+2                                                 01098000
SUBYTE4  EQU   SUBITS+3                                                 01099000
SU24BIT  EQU   SUBYTE4                                                  01100000
SUBYTE5  EQU   SUBITS+4                                                 01101000
SUBYTE6  EQU   SUBITS+5                                                 01102000
SUBYTE7  EQU   SUBITS+6                                                 01103000
SUBYTE8  EQU   SUBITS+7                                                 01104000
SUBYTE9  EQU   SUBITS+8                                                 01105000
SUBYTE10 EQU   SUBITS+9                                                 01106000
SUBYTE11 EQU   SUBITS+10                                                01107000
SUBYTE12 EQU   SUBITS+11                                                01108000
SUBYTE13 EQU   SUBITS+12                                                01109000
ASCB     EQU   0                                                        01110000
ASCBSUPC EQU   ASCB+16                                                  01111000
ASCBASID EQU   ASCB+36                                                  01112000
ASCBRSM  EQU   ASCB+52                                                  01113000
ASCBRSMF EQU   ASCBRSM                                                  01114000
ASCBFW1  EQU   ASCB+100                                                 01115000
ASCBRCTF EQU   ASCBFW1+2                                                01116000
ASCBFLG1 EQU   ASCBFW1+3                                                01117000
ASCBDSP1 EQU   ASCB+114                                                 01118000
ASCBFLG2 EQU   ASCB+115                                                 01119000
ASCBLKGP EQU   ASCB+128                                                 01120000
ASCBSRQ  EQU   ASCB+180                                                 01121000
ASCBSRQ1 EQU   ASCBSRQ                                                  01122000
ASCBSRQ2 EQU   ASCBSRQ+1                                                01123000
ASCBSRQ3 EQU   ASCBSRQ+2                                                01124000
ASCBSRQ4 EQU   ASCBSRQ+3                                                01125000
TRMRB    EQU   0                                                        01126000
TRMRBLEN EQU   TRMRB                                                    01127000
TRMRBOPC EQU   TRMRB+4                                                  01128000
TRMFLAGS EQU   TRMRB+5                                                  01129000
TRMJOBID EQU   TRMRB+8                                                  01130000
I256C    EQU   0                                                        01131000
I015F    EQU   0                                                        01132000
AB4EDPMS EQU   0                                                        01133000
I001C    EQU   0                                                        01134000
I008P    EQU   0                                                        01135000
I015P    EQU   0                                                        01136000
I031F    EQU   0                                                        01137000
I031P    EQU   0                                                        01138000
ABENDCMP EQU   SDWACMPC                                                 01139000
SYSACODE EQU   ABENDCMP                                                 01140000
JSCBSEC2 EQU   JSCBEND1                                                 01141000
JSCBSEC3 EQU   JSCBEND1                                                 01142000
JSCBJCT  EQU   JSCBSEC3                                                 01143000
JSCBJCTA EQU   JSCBJCT+1                                                01144000
JSCBASID EQU   JSCBSEC3+8                                               01145000
JSCBFBYT EQU   JSCBSEC3+10                                              01146000
JSCBJNL  EQU   JSCBSEC3+28                                              01147000
JSCBJJSB EQU   JSCBJNL                                                  01148000
JSCBSUB  EQU   JSCBSEC3+40                                              01149000
JSCSCT   EQU   JSCBSEC3+68                                              01150000
JSCBACT  EQU   JSCBSEC3+88                                              01151000
JSCBASWA EQU   JSCBSEC3+96                                              01152000
JSCRSV45 EQU   JSCBSEC3+112                                             01153000
JSCRSV46 EQU   JSCRSV45                                                 01154000
JSCRSV47 EQU   JSCRSV45+2                                               01155000
CVTS01   EQU   CVTPGSIA                                                 01156000
CVTLPDIA EQU   CVTS01+12                                                01157000
CVTDIRST EQU   CVTLPDIA                                                 01158000
CVTSLIDA EQU   CVTS01+24                                                01159000
CVTCTLFG EQU   CVTS01+50                                                01160000
CVTRV210 EQU   CVTS01+424                                               01161000
CVTRV219 EQU   CVTS01+425                                               01162000
CVTRV228 EQU   CVTS01+426                                               01163000
CVTRV237 EQU   CVTS01+427                                               01164000
CVTMFRTR EQU   CVTS01+452                                               01165000
CVTRV262 EQU   CVTS01+468                                               01166000
CVTRV271 EQU   CVTS01+469                                               01167000
CVTRV280 EQU   CVTS01+470                                               01168000
CVTRV289 EQU   CVTS01+471                                               01169000
CVTGSDA  EQU   CVTS01+600                                               01170000
CVTIHASU EQU   CVTS01+696                                               01171000
PSARSVTE EQU   PSARSVT                                                  01172000
FLC      EQU   PSA                                                      01173000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01174000
PSARSAV  EQU   PSARSVTE+60                                              01175000
PSARSTK  EQU   PSARSVTE+56                                              01176000
PSAESAV3 EQU   PSARSVTE+52                                              01177000
PSAESTK3 EQU   PSARSVTE+48                                              01178000
PSAESAV2 EQU   PSARSVTE+44                                              01179000
PSAESTK2 EQU   PSARSVTE+40                                              01180000
PSAESAV1 EQU   PSARSVTE+36                                              01181000
PSAESTK1 EQU   PSARSVTE+32                                              01182000
PSAPSAV  EQU   PSARSVTE+28                                              01183000
PSAPSTK  EQU   PSARSVTE+24                                              01184000
PSAMSAV  EQU   PSARSVTE+20                                              01185000
PSAMSTK  EQU   PSARSVTE+16                                              01186000
PSASSAV  EQU   PSARSVTE+12                                              01187000
PSASSTK  EQU   PSARSVTE+8                                               01188000
PSANSTK  EQU   PSARSVTE+4                                               01189000
PSACSTK  EQU   PSARSVTE                                                 01190000
CVTRV628 EQU   CVTS01+728                                               01191000
CVTRV627 EQU   CVTS01+724                                               01192000
CVTRV626 EQU   CVTS01+720                                               01193000
CVTRV625 EQU   CVTS01+716                                               01194000
CVTRV624 EQU   CVTS01+712                                               01195000
CVTRV623 EQU   CVTS01+708                                               01196000
CVTRV622 EQU   CVTS01+704                                               01197000
CVTRV621 EQU   CVTS01+700                                               01198000
CVTSUSP  EQU   CVTS01+692                                               01199000
CVTT6SVC EQU   CVTS01+688                                               01200000
CVTCDAL  EQU   CVTS01+684                                               01201000
CVTTCTL  EQU   CVTS01+680                                               01202000
CVTRSUME EQU   CVTS01+676                                               01203000
CVTJTERM EQU   CVTS01+672                                               01204000
CVTASMRM EQU   CVTS01+668                                               01205000
CVTTCASP EQU   CVTS01+664                                               01206000
CVT0PT03 EQU   CVTS01+660                                               01207000
CVT0PT0E EQU   CVTS01+656                                               01208000
CVTRV609 EQU   CVTS01+652                                               01209000
CVTCGK   EQU   CVTS01+648                                               01210000
CVTRAC   EQU   CVTS01+644                                               01211000
CVTHSM   EQU   CVTS01+640                                               01212000
CVTRV605 EQU   CVTS01+636                                               01213000
CVTRV604 EQU   CVTS01+632                                               01214000
CVTEFF02 EQU   CVTS01+628                                               01215000
CVTCBBR  EQU   CVTS01+624                                               01216000
CVTSSCR  EQU   CVTS01+620                                               01217000
CVTEVENT EQU   CVTS01+616                                               01218000
CVTCRCA  EQU   CVTS01+612                                               01219000
CVTTPIO  EQU   CVTS01+608                                               01220000
CVTADV   EQU   CVTS01+604                                               01221000
CVTGSDAB EQU   CVTGSDA                                                  01222000
CVTQV3   EQU   CVTS01+596                                               01223000
CVTQV2   EQU   CVTS01+592                                               01224000
CVTQV1   EQU   CVTS01+588                                               01225000
CVTRPT   EQU   CVTS01+584                                               01226000
CVTSSRB  EQU   CVTS01+580                                               01227000
CVTCSDRL EQU   CVTS01+576                                               01228000
CVTEXP1  EQU   CVTS01+572                                               01229000
CVTRMPMT EQU   CVTS01+568                                               01230000
CVTRMPTT EQU   CVTS01+564                                               01231000
CVTVPSA  EQU   CVTS01+560                                               01232000
CVTVSTOP EQU   CVTS01+556                                               01233000
CVTGTFR8 EQU   CVTS01+552                                               01234000
CVTQUIT  EQU   CVTS01+548                                               01235000
CVTVACR  EQU   CVTS01+544                                               01236000
CVTWTCB  EQU   CVTS01+540                                               01237000
CVTSTPRS EQU   CVTS01+536                                               01238000
CVT0PT02 EQU   CVTS01+532                                               01239000
CVTDARCM EQU   CVTS01+528                                               01240000
CVTIRECM EQU   CVTS01+524                                               01241000
CVTJRECM EQU   CVTS01+520                                               01242000
CVTVEMS0 EQU   CVTS01+516                                               01243000
CVTSPFRR EQU   CVTS01+512                                               01244000
CVTRLSTG EQU   CVTS01+508                                               01245000
CVT0TC0A EQU   CVTS01+504                                               01246000
CVTGMBR  EQU   CVTS01+500                                               01247000
CVTLFRM  EQU   CVTS01+496                                               01248000
CVTRMBR  EQU   CVTS01+492                                               01249000
CVTVIOP  EQU   CVTS01+488                                               01250000
CVTRV307 EQU   CVTS01+486                                               01251000
CVTRV306 EQU   CVTS01+484                                               01252000
CVTRV305 EQU   CVTS01+482                                               01253000
CVTRV304 EQU   CVTS01+480                                               01254000
CVTRV303 EQU   CVTS01+478                                               01255000
CVTRV302 EQU   CVTS01+476                                               01256000
CVTTRCA  EQU   CVTS01+472                                               01257000
CVTRV297 EQU   CVTRV289                                                 01258000
CVTRV296 EQU   CVTRV289                                                 01259000
CVTRV295 EQU   CVTRV289                                                 01260000
CVTRV294 EQU   CVTRV289                                                 01261000
CVTRV293 EQU   CVTRV289                                                 01262000
CVTRV292 EQU   CVTRV289                                                 01263000
CVTRV291 EQU   CVTRV289                                                 01264000
CVTRV290 EQU   CVTRV289                                                 01265000
CVTRV288 EQU   CVTRV280                                                 01266000
CVTRV287 EQU   CVTRV280                                                 01267000
CVTRV286 EQU   CVTRV280                                                 01268000
CVTRV285 EQU   CVTRV280                                                 01269000
CVTRV284 EQU   CVTRV280                                                 01270000
CVTRV283 EQU   CVTRV280                                                 01271000
CVTRV282 EQU   CVTRV280                                                 01272000
CVTRV281 EQU   CVTRV280                                                 01273000
CVTRV279 EQU   CVTRV271                                                 01274000
CVTRV278 EQU   CVTRV271                                                 01275000
CVTRV277 EQU   CVTRV271                                                 01276000
CVTRV276 EQU   CVTRV271                                                 01277000
CVTRV275 EQU   CVTRV271                                                 01278000
CVTRV274 EQU   CVTRV271                                                 01279000
CVTRV273 EQU   CVTRV271                                                 01280000
CVTRV272 EQU   CVTRV271                                                 01281000
CVTRV270 EQU   CVTRV262                                                 01282000
CVTRV269 EQU   CVTRV262                                                 01283000
CVTRV268 EQU   CVTRV262                                                 01284000
CVTRV267 EQU   CVTRV262                                                 01285000
CVTRV266 EQU   CVTRV262                                                 01286000
CVTRV265 EQU   CVTRV262                                                 01287000
CVTRV264 EQU   CVTRV262                                                 01288000
CVTRV263 EQU   CVTRV262                                                 01289000
CVTVFP   EQU   CVTS01+464                                               01290000
CVTVSI   EQU   CVTS01+460                                               01291000
CVTVPSIB EQU   CVTS01+456                                               01292000
CVTMFACT EQU   CVTMFRTR                                                 01293000
CVTMFCTL EQU   CVTS01+448                                               01294000
CVTPVBP  EQU   CVTS01+444                                               01295000
CVTPWI   EQU   CVTS01+440                                               01296000
CVTRV254 EQU   CVTS01+438                                               01297000
CVTRV253 EQU   CVTS01+436                                               01298000
CVTRV252 EQU   CVTS01+434                                               01299000
CVTRV251 EQU   CVTS01+433                                               01300000
CVTRV250 EQU   CVTS01+432                                               01301000
CVTRV249 EQU   CVTS01+431                                               01302000
CVTRV248 EQU   CVTS01+430                                               01303000
CVTRV247 EQU   CVTS01+429                                               01304000
CVTRV246 EQU   CVTS01+428                                               01305000
CVTRV245 EQU   CVTRV237                                                 01306000
CVTRV244 EQU   CVTRV237                                                 01307000
CVTRV243 EQU   CVTRV237                                                 01308000
CVTRV242 EQU   CVTRV237                                                 01309000
CVTRV241 EQU   CVTRV237                                                 01310000
CVTRV240 EQU   CVTRV237                                                 01311000
CVTRV239 EQU   CVTRV237                                                 01312000
CVTRV238 EQU   CVTRV237                                                 01313000
CVTRV236 EQU   CVTRV228                                                 01314000
CVTRV235 EQU   CVTRV228                                                 01315000
CVTRV234 EQU   CVTRV228                                                 01316000
CVTRV233 EQU   CVTRV228                                                 01317000
CVTRV232 EQU   CVTRV228                                                 01318000
CVTRV231 EQU   CVTRV228                                                 01319000
CVTRV230 EQU   CVTRV228                                                 01320000
CVTRV229 EQU   CVTRV228                                                 01321000
CVTRV227 EQU   CVTRV219                                                 01322000
CVTRV226 EQU   CVTRV219                                                 01323000
CVTRV225 EQU   CVTRV219                                                 01324000
CVTRV224 EQU   CVTRV219                                                 01325000
CVTRV223 EQU   CVTRV219                                                 01326000
CVTRV222 EQU   CVTRV219                                                 01327000
CVTRV221 EQU   CVTRV219                                                 01328000
CVTRV220 EQU   CVTRV219                                                 01329000
CVTRV218 EQU   CVTRV210                                                 01330000
CVTRV217 EQU   CVTRV210                                                 01331000
CVTRV216 EQU   CVTRV210                                                 01332000
CVTRV215 EQU   CVTRV210                                                 01333000
CVTRV214 EQU   CVTRV210                                                 01334000
CVTRV213 EQU   CVTRV210                                                 01335000
CVTRV212 EQU   CVTRV210                                                 01336000
CVTRV211 EQU   CVTRV210                                                 01337000
CVTLCCAT EQU   CVTS01+420                                               01338000
CVTPCCAT EQU   CVTS01+416                                               01339000
CVTIPCRP EQU   CVTS01+412                                               01340000
CVTIPCRI EQU   CVTS01+408                                               01341000
CVTIPCDS EQU   CVTS01+404                                               01342000
CVTAIDVT EQU   CVTS01+400                                               01343000
CVTSSAP  EQU   CVTS01+396                                               01344000
CVTEHCIR EQU   CVTS01+392                                               01345000
CVTEHDEF EQU   CVTS01+388                                               01346000
CVTDAIR  EQU   CVTS01+384                                               01347000
CVTPERFM EQU   CVTS01+380                                               01348000
CVT044R2 EQU   CVTS01+376                                               01349000
CVTFETCH EQU   CVTS01+372                                               01350000
CVTRSTWD EQU   CVTS01+368                                               01351000
CVTSPOST EQU   CVTS01+364                                               01352000
CVTIOBP  EQU   CVTS01+360                                               01353000
CVTASMVT EQU   CVTS01+356                                               01354000
CVTRECRQ EQU   CVTS01+352                                               01355000
CVTWSAC  EQU   CVTS01+348                                               01356000
CVTRV149 EQU   CVTS01+344                                               01357000
CVTWSAL  EQU   CVTS01+340                                               01358000
CVTSPSA  EQU   CVTS01+336                                               01359000
CVTGLMN  EQU   CVTS01+332                                               01360000
CVTVEAC0 EQU   CVTS01+328                                               01361000
CVT062R1 EQU   CVTS01+324                                               01362000
CVTRPOST EQU   CVTS01+320                                               01363000
CVTDQIQE EQU   CVTS01+316                                               01364000
CVTCSD   EQU   CVTS01+312                                               01365000
CVTLKRMA EQU   CVTS01+308                                               01366000
CVTRSPIE EQU   CVTS01+304                                               01367000
CVTRENQ  EQU   CVTS01+300                                               01368000
CVTLQCB  EQU   CVTS01+296                                               01369000
CVTFQCB  EQU   CVTS01+292                                               01370000
CVTQCS01 EQU   CVTS01+288                                               01371000
CVTAPFT  EQU   CVTS01+284                                               01372000
CVTPARRL EQU   CVTS01+280                                               01373000
CVTVWAIT EQU   CVTS01+276                                               01374000
CVTGSPL  EQU   CVTS01+272                                               01375000
CVTLSMQ  EQU   CVTS01+268                                               01376000
CVTGSMQ  EQU   CVTS01+264                                               01377000
CVTEXPRO EQU   CVTS01+260                                               01378000
CVTOPCTP EQU   CVTS01+256                                               01379000
CVTSIC   EQU   CVTS01+252                                               01380000
CVTTPIOS EQU   CVTS01+248                                               01381000
CVTRTMS  EQU   CVTS01+244                                               01382000
CVTSDBF  EQU   CVTS01+240                                               01383000
CVTSCBP  EQU   CVTS01+236                                               01384000
CVTSDMP  EQU   CVTS01+232                                               01385000
CVTSV60  EQU   CVTS01+228                                               01386000
CVTRTMCT EQU   CVTS01+224                                               01387000
CVTASCBL EQU   CVTS01+220                                               01388000
CVTASCBH EQU   CVTS01+216                                               01389000
CVTGDA   EQU   CVTS01+212                                               01390000
CVTASVT  EQU   CVTS01+208                                               01391000
CVTVVMDI EQU   CVTS01+204                                               01392000
CVTAQTOP EQU   CVTS01+200                                               01393000
CVTIOSCS EQU   CVTS01+196                                               01394000
CVTSDRM  EQU   CVTS01+192                                               01395000
CVTOPTE  EQU   CVTS01+188                                               01396000
CVTSTXU  EQU   CVTS01+184                                               01397000
CVTQUIS  EQU   CVTS01+180                                               01398000
CVTPARS  EQU   CVTS01+176                                               01399000
CVTS1EE  EQU   CVTS01+172                                               01400000
CVTFRAS  EQU   CVTS01+168                                               01401000
CVTQSAS  EQU   CVTS01+164                                               01402000
CVTCRAS  EQU   CVTS01+160                                               01403000
CVTCRMN  EQU   CVTS01+156                                               01404000
CVTDELCP EQU   CVTS01+152                                               01405000
CVTFRECL EQU   CVTS01+148                                               01406000
CVTGETCL EQU   CVTS01+144                                               01407000
CVTBLDCP EQU   CVTS01+140                                               01408000
CVTAUTHL EQU   CVTS01+136                                               01409000
CVTSCAN  EQU   CVTS01+132                                               01410000
CVTRV144 EQU   CVTS01+130                                               01411000
CVTMAXMP EQU   CVTS01+128                                               01412000
CVTSTCK  EQU   CVTS01+124                                               01413000
CVTRV139 EQU   CVTS01+123                                               01414000
CVTDSSAC EQU   CVTS01+122                                               01415000
CVTRV513 EQU   CVTS01+121                                               01416000
CVTIOSPL EQU   CVTS01+120                                               01417000
CVTPTGT  EQU   CVTS01+116                                               01418000
CVTCSPIE EQU   CVTS01+112                                               01419000
CVTSMFEX EQU   CVTS01+108                                               01420000
CVTOLT0A EQU   CVTS01+104                                               01421000
CVTSRBRT EQU   CVTS01+100                                               01422000
CVTPUTL  EQU   CVTS01+96                                                01423000
CVTASCRL EQU   CVTS01+92                                                01424000
CVTASCRF EQU   CVTS01+88                                                01425000
CVTRV326 EQU   CVTS01+84                                                01426000
CVTRV325 EQU   CVTS01+80                                                01427000
CVTRV324 EQU   CVTS01+76                                                01428000
CVT0VL01 EQU   CVTS01+72                                                01429000
CVTSHRVM EQU   CVTS01+68                                                01430000
CVTRV332 EQU   CVTS01+64                                                01431000
CVTTAS   EQU   CVTS01+60                                                01432000
CVTRSCN  EQU   CVTS01+56                                                01433000
CVTTRAC2 EQU   CVTS01+54                                                01434000
CVTTRACE EQU   CVTS01+52                                                01435000
CVTAPG   EQU   CVTS01+51                                                01436000
CVTSDTRC EQU   CVTCTLFG                                                 01437000
CVTGTRCE EQU   CVTCTLFG                                                 01438000
CVTNOMP  EQU   CVTCTLFG                                                 01439000
CVTRSV79 EQU   CVTCTLFG                                                 01440000
CVTDSTAT EQU   CVTCTLFG                                                 01441000
CVTRSV78 EQU   CVTCTLFG                                                 01442000
CVTRV333 EQU   CVTCTLFG                                                 01443000
CVTRV323 EQU   CVTCTLFG                                                 01444000
CVTSPVLK EQU   CVTS01+49                                                01445000
CVTRSV77 EQU   CVTS01+48                                                01446000
CVTRV331 EQU   CVTS01+44                                                01447000
CVTRV330 EQU   CVTS01+40                                                01448000
CVTRV329 EQU   CVTS01+36                                                01449000
CVTRV328 EQU   CVTS01+32                                                01450000
CVTRV322 EQU   CVTS01+28                                                01451000
CVTSLID  EQU   CVTSLIDA+1                                               01452000
CVTSYLK  EQU   CVTSLIDA                                                 01453000
CVTRV321 EQU   CVTS01+20                                                01454000
CVTRV320 EQU   CVTS01+16                                                01455000
CVTLPDIR EQU   CVTLPDIA+1                                               01456000
CVTRSV69 EQU   CVTDIRST                                                 01457000
CVTRSV68 EQU   CVTDIRST                                                 01458000
CVTRSV67 EQU   CVTDIRST                                                 01459000
CVTRSV66 EQU   CVTDIRST                                                 01460000
CVTRSV65 EQU   CVTDIRST                                                 01461000
CVTRSV64 EQU   CVTDIRST                                                 01462000
CVTRSV63 EQU   CVTDIRST                                                 01463000
CVTDICOM EQU   CVTDIRST                                                 01464000
CVTPVTP  EQU   CVTS01+8                                                 01465000
CVTLPDSR EQU   CVTS01+4                                                 01466000
CVTGETL  EQU   CVTS01                                                   01467000
JSCBEND3 EQU   JSCBSEC3+120                                             01468000
JSCRSV52 EQU   JSCBSEC3+116                                             01469000
JSCRSV51 EQU   JSCRSV47+1                                               01470000
JSCRSV50 EQU   JSCRSV47                                                 01471000
JSCRSV49 EQU   JSCRSV46+1                                               01472000
JSCRSV48 EQU   JSCRSV46                                                 01473000
JSCRSV44 EQU   JSCBSEC3+108                                             01474000
JSCRSV43 EQU   JSCBSEC3+104                                             01475000
JSCRSV42 EQU   JSCBSEC3+100                                             01476000
JSCBUFPT EQU   JSCBSEC3+92                                              01477000
JSCBSWSP EQU   JSCBSEC3+87                                              01478000
JSCRSV33 EQU   JSCBSEC3+86                                              01479000
JSCDDNUM EQU   JSCBSEC3+84                                              01480000
JSCRSV53 EQU   JSCBSEC3+82                                              01481000
JSCDDNNO EQU   JSCBSEC3+80                                              01482000
JSCBVATA EQU   JSCBSEC3+76                                              01483000
JSCTMCOR EQU   JSCBSEC3+72                                              01484000
JSCSCTP  EQU   JSCSCT+1                                                 01485000
JSCRSV55 EQU   JSCSCT                                                   01486000
JSCRSV54 EQU   JSCBSEC3+64                                              01487000
JSCDSABQ EQU   JSCBSEC3+60                                              01488000
JSCBSSIB EQU   JSCBSEC3+56                                              01489000
JSCBFRBA EQU   JSCBSEC3+48                                              01490000
JSCRSV28 EQU   JSCBSEC3+46                                              01491000
JSCBSONO EQU   JSCBSEC3+44                                              01492000
JSCBSUBA EQU   JSCBSUB+1                                                01493000
JSCRSV31 EQU   JSCBSUB                                                  01494000
JSCBSMLR EQU   JSCBSEC3+36                                              01495000
JSCBJNLR EQU   JSCBSEC3+32                                              01496000
JSCBJNLA EQU   JSCBJNL+1                                                01497000
JSCBJSBT EQU   JSCBJJSB                                                 01498000
JSCBJSBX EQU   JSCBJJSB                                                 01499000
JSCBJSBA EQU   JSCBJJSB                                                 01500000
JSCBJSBI EQU   JSCBJJSB                                                 01501000
@NM00019 EQU   JSCBJJSB                                                 01502000
JSCBJNLE EQU   JSCBJJSB                                                 01503000
JSCBJNLF EQU   JSCBJJSB                                                 01504000
JSCBJNLN EQU   JSCBJJSB                                                 01505000
@NM00018 EQU   JSCBSEC3+24                                              01506000
JSCBJRBA EQU   JSCBSEC3+16                                              01507000
JSCBIECB EQU   JSCBSEC3+12                                              01508000
JSCBRV08 EQU   JSCBSEC3+11                                              01509000
JSCBRV07 EQU   JSCBFBYT                                                 01510000
JSCBRV06 EQU   JSCBFBYT                                                 01511000
JSCBRV05 EQU   JSCBFBYT                                                 01512000
JSCBRV04 EQU   JSCBFBYT                                                 01513000
JSCBRV03 EQU   JSCBFBYT                                                 01514000
JSCBRV02 EQU   JSCBFBYT                                                 01515000
JSCBADSP EQU   JSCBFBYT                                                 01516000
JSCBRV01 EQU   JSCBFBYT                                                 01517000
JSCBTJID EQU   JSCBASID                                                 01518000
JSCBPSCB EQU   JSCBSEC3+4                                               01519000
JSCJCTP  EQU   JSCBJCTA                                                 01520000
JSCRSV24 EQU   JSCBJCT                                                  01521000
JSCBEND2 EQU   JSCBSEC2                                                 01522000
USEABEND EQU   ABENDCMP+1                                               01523000
TRMSTHDR EQU   TRMRB+12                                                 01524000
@NM00099 EQU   TRMRB+6                                                  01525000
@NM00098 EQU   TRMFLAGS                                                 01526000
TRMSCHAB EQU   TRMFLAGS                                                 01527000
TRMALLOK EQU   TRMFLAGS                                                 01528000
ASCBEND  EQU   ASCB+208                                                 01529000
ASCBSRBT EQU   ASCB+200                                                 01530000
ASCBSWTL EQU   ASCB+196                                                 01531000
ASCBRS14 EQU   ASCB+195                                                 01532000
ASCBSMCT EQU   ASCB+194                                                 01533000
ASCBRS12 EQU   ASCB+192                                                 01534000
ASCBPCTT EQU   ASCB+188                                                 01535000
ASCBVGTT EQU   ASCB+184                                                 01536000
ASCBRV43 EQU   ASCBSRQ4                                                 01537000
ASCBRV42 EQU   ASCBSRQ4                                                 01538000
ASCBRV41 EQU   ASCBSRQ4                                                 01539000
ASCBRV40 EQU   ASCBSRQ4                                                 01540000
ASCBRV39 EQU   ASCBSRQ4                                                 01541000
ASCBRV38 EQU   ASCBSRQ4                                                 01542000
ASCBRV37 EQU   ASCBSRQ4                                                 01543000
ASCBRV36 EQU   ASCBSRQ4                                                 01544000
ASCBRV35 EQU   ASCBSRQ3                                                 01545000
ASCBRV34 EQU   ASCBSRQ3                                                 01546000
ASCBRV33 EQU   ASCBSRQ3                                                 01547000
ASCBRV32 EQU   ASCBSRQ3                                                 01548000
ASCBRV31 EQU   ASCBSRQ3                                                 01549000
ASCBRV30 EQU   ASCBSRQ3                                                 01550000
ASCBRV29 EQU   ASCBSRQ3                                                 01551000
ASCBRV28 EQU   ASCBSRQ3                                                 01552000
ASCBRV27 EQU   ASCBSRQ2                                                 01553000
ASCBRV26 EQU   ASCBSRQ2                                                 01554000
ASCBRV25 EQU   ASCBSRQ2                                                 01555000
ASCBRV24 EQU   ASCBSRQ2                                                 01556000
ASCBRV23 EQU   ASCBSRQ2                                                 01557000
ASCBRV22 EQU   ASCBSRQ2                                                 01558000
ASCBRV21 EQU   ASCBSRQ2                                                 01559000
ASCBRV20 EQU   ASCBSRQ2                                                 01560000
ASCBRV19 EQU   ASCBSRQ1                                                 01561000
ASCBRV18 EQU   ASCBSRQ1                                                 01562000
ASCBRV17 EQU   ASCBSRQ1                                                 01563000
ASCBRV16 EQU   ASCBSRQ1                                                 01564000
ASCBRV15 EQU   ASCBSRQ1                                                 01565000
ASCBRV14 EQU   ASCBSRQ1                                                 01566000
ASCBRV13 EQU   ASCBSRQ1                                                 01567000
ASCBSTA  EQU   ASCBSRQ1                                                 01568000
ASCBJBNS EQU   ASCB+176                                                 01569000
ASCBJBNI EQU   ASCB+172                                                 01570000
ASCBMCC  EQU   ASCB+168                                                 01571000
ASCBRTWA EQU   ASCB+164                                                 01572000
ASCBIQEA EQU   ASCB+160                                                 01573000
ASCBXMPQ EQU   ASCB+156                                                 01574000
ASCBRS01 EQU   ASCB+154                                                 01575000
ASCBFMCT EQU   ASCB+152                                                 01576000
ASCBOUXB EQU   ASCB+148                                                 01577000
ASCBOUCB EQU   ASCB+144                                                 01578000
ASCBMECB EQU   ASCB+140                                                 01579000
ASCBQECB EQU   ASCB+136                                                 01580000
ASCBLSQH EQU   ASCBLKGP+4                                               01581000
ASCBLOCK EQU   ASCBLKGP                                                 01582000
ASCBTCBS EQU   ASCB+124                                                 01583000
ASCBNVSC EQU   ASCB+122                                                 01584000
ASCBVSC  EQU   ASCB+120                                                 01585000
ASCBSRBS EQU   ASCB+118                                                 01586000
ASCBSSRB EQU   ASCB+116                                                 01587000
ASCBRV06 EQU   ASCBFLG2                                                 01588000
ASCBRV05 EQU   ASCBFLG2                                                 01589000
ASCBRV04 EQU   ASCBFLG2                                                 01590000
ASCBSNQS EQU   ASCBFLG2                                                 01591000
ASCBS2S  EQU   ASCBFLG2                                                 01592000
ASCBCEXT EQU   ASCBFLG2                                                 01593000
ASCBPXMT EQU   ASCBFLG2                                                 01594000
ASCBXMPT EQU   ASCBFLG2                                                 01595000
ASCBRF07 EQU   ASCBDSP1                                                 01596000
ASCBRF06 EQU   ASCBDSP1                                                 01597000
ASCBRF05 EQU   ASCBDSP1                                                 01598000
ASCBRF04 EQU   ASCBDSP1                                                 01599000
ASCBRF03 EQU   ASCBDSP1                                                 01600000
ASCBRF02 EQU   ASCBDSP1                                                 01601000
ASCBFAIL EQU   ASCBDSP1                                                 01602000
ASCBNOQ  EQU   ASCBDSP1                                                 01603000
ASCBSWCT EQU   ASCB+112                                                 01604000
ASCBASXB EQU   ASCB+108                                                 01605000
ASCBTMCH EQU   ASCB+104                                                 01606000
ASCBNSWP EQU   ASCBFLG1                                                 01607000
ASCBTYP1 EQU   ASCBFLG1                                                 01608000
ASCBSTND EQU   ASCBFLG1                                                 01609000
ASCBABNT EQU   ASCBFLG1                                                 01610000
ASCBTERM EQU   ASCBFLG1                                                 01611000
ASCBS3S  EQU   ASCBFLG1                                                 01612000
ASCBCMSH EQU   ASCBFLG1                                                 01613000
ASCBTOFF EQU   ASCBFLG1                                                 01614000
ASCBRF01 EQU   ASCBRCTF                                                 01615000
ASCBTMLW EQU   ASCBRCTF                                                 01616000
ASCBOUT  EQU   ASCBRCTF                                                 01617000
ASCBWAIT EQU   ASCBRCTF                                                 01618000
ASCBRV08 EQU   ASCBRCTF                                                 01619000
ASCBFQU  EQU   ASCBRCTF                                                 01620000
ASCBFRS  EQU   ASCBRCTF                                                 01621000
ASCBTMNO EQU   ASCBRCTF                                                 01622000
ASCBAFFN EQU   ASCBFW1                                                  01623000
ASCBDUMP EQU   ASCB+96                                                  01624000
ASCBRV44 EQU   ASCB+92                                                  01625000
ASCBUBET EQU   ASCB+88                                                  01626000
ASCBECB  EQU   ASCB+84                                                  01627000
ASCBJSTL EQU   ASCB+80                                                  01628000
ASCBEWST EQU   ASCB+72                                                  01629000
ASCBEJST EQU   ASCB+64                                                  01630000
ASCBTSB  EQU   ASCB+60                                                  01631000
ASCBCSCB EQU   ASCB+56                                                  01632000
ASCBRSMA EQU   ASCBRSM+1                                                01633000
ASCBRV54 EQU   ASCBRSMF                                                 01634000
ASCBRV53 EQU   ASCBRSMF                                                 01635000
ASCBRV52 EQU   ASCBRSMF                                                 01636000
ASCBRV51 EQU   ASCBRSMF                                                 01637000
ASCBVEQR EQU   ASCBRSMF                                                 01638000
ASCBN2LP EQU   ASCBRSMF                                                 01639000
ASCB1LPU EQU   ASCBRSMF                                                 01640000
ASCB2LPU EQU   ASCBRSMF                                                 01641000
ASCBLDA  EQU   ASCB+48                                                  01642000
ASCBSTOR EQU   ASCB+44                                                  01643000
ASCBDP   EQU   ASCB+43                                                  01644000
ASCBRV07 EQU   ASCB+42                                                  01645000
ASCBIOSM EQU   ASCB+40                                                  01646000
ASCBSEQN EQU   ASCB+38                                                  01647000
ASCBCPUS EQU   ASCB+32                                                  01648000
ASCBSPL  EQU   ASCB+28                                                  01649000
ASCBIOSP EQU   ASCB+24                                                  01650000
ASCBSYNC EQU   ASCBSUPC+4                                               01651000
ASCBSVRB EQU   ASCBSUPC                                                 01652000
ASCBCMSF EQU   ASCB+12                                                  01653000
ASCBBWDP EQU   ASCB+8                                                   01654000
ASCBFWDP EQU   ASCB+4                                                   01655000
ASCBASCB EQU   ASCB                                                     01656000
ASCBEGIN EQU   ASCB                                                     01657000
SURV104  EQU   SUBITS+13                                                01658000
SURV103  EQU   SUBYTE13                                                 01659000
SURV102  EQU   SUBYTE13                                                 01660000
SURV101  EQU   SUBYTE13                                                 01661000
SU100BT  EQU   SUBYTE13                                                 01662000
SU99BIT  EQU   SUBYTE13                                                 01663000
SU98BIT  EQU   SUBYTE13                                                 01664000
SU97BIT  EQU   SUBYTE13                                                 01665000
SU96BIT  EQU   SUBYTE13                                                 01666000
SU95BIT  EQU   SUBYTE12                                                 01667000
SU94BIT  EQU   SUBYTE12                                                 01668000
SU93BIT  EQU   SUBYTE12                                                 01669000
SU92BIT  EQU   SUBYTE12                                                 01670000
SU91BIT  EQU   SUBYTE12                                                 01671000
SU90BIT  EQU   SUBYTE12                                                 01672000
SU89BIT  EQU   SUBYTE12                                                 01673000
SU88BIT  EQU   SUBYTE12                                                 01674000
SU87BIT  EQU   SUBYTE11                                                 01675000
SU86BIT  EQU   SUBYTE11                                                 01676000
SU85BIT  EQU   SUBYTE11                                                 01677000
SU84BIT  EQU   SUBYTE11                                                 01678000
SU83BIT  EQU   SUBYTE11                                                 01679000
SU82BIT  EQU   SUBYTE11                                                 01680000
SU81BIT  EQU   SUBYTE11                                                 01681000
SU80BIT  EQU   SUBYTE11                                                 01682000
SU79BIT  EQU   SUBYTE10                                                 01683000
SU78BIT  EQU   SUBYTE10                                                 01684000
SU77BIT  EQU   SUBYTE10                                                 01685000
SU76BIT  EQU   SUBYTE10                                                 01686000
SU75BIT  EQU   SUBYTE10                                                 01687000
SU74BIT  EQU   SUBYTE10                                                 01688000
SU73BIT  EQU   SUBYTE10                                                 01689000
SU72BIT  EQU   SUBYTE10                                                 01690000
SU71BIT  EQU   SUBYTE9                                                  01691000
SU70BIT  EQU   SUBYTE9                                                  01692000
SU69BIT  EQU   SUBYTE9                                                  01693000
SU68BIT  EQU   SUBYTE9                                                  01694000
SU67BIT  EQU   SUBYTE9                                                  01695000
SU66BIT  EQU   SUBYTE9                                                  01696000
SU65BIT  EQU   SUBYTE9                                                  01697000
SU64BIT  EQU   SUBYTE9                                                  01698000
SU63BIT  EQU   SUBYTE8                                                  01699000
SU62BIT  EQU   SUBYTE8                                                  01700000
SU61BIT  EQU   SUBYTE8                                                  01701000
SU60BIT  EQU   SUBYTE8                                                  01702000
SU59BIT  EQU   SUBYTE8                                                  01703000
SU58BIT  EQU   SUBYTE8                                                  01704000
SU57BIT  EQU   SUBYTE8                                                  01705000
SU56BIT  EQU   SUBYTE8                                                  01706000
SU55BIT  EQU   SUBYTE7                                                  01707000
SU54BIT  EQU   SUBYTE7                                                  01708000
SU53BIT  EQU   SUBYTE7                                                  01709000
SU52BIT  EQU   SUBYTE7                                                  01710000
SU51BIT  EQU   SUBYTE7                                                  01711000
SU50BIT  EQU   SUBYTE7                                                  01712000
SU49BIT  EQU   SUBYTE7                                                  01713000
SU48BIT  EQU   SUBYTE7                                                  01714000
SU47BIT  EQU   SUBYTE6                                                  01715000
SU46BIT  EQU   SUBYTE6                                                  01716000
SU45BIT  EQU   SUBYTE6                                                  01717000
SU44BIT  EQU   SUBYTE6                                                  01718000
SU43BIT  EQU   SUBYTE6                                                  01719000
SU42BIT  EQU   SUBYTE6                                                  01720000
SU41BIT  EQU   SUBYTE6                                                  01721000
SU40BIT  EQU   SUBYTE6                                                  01722000
SU39BIT  EQU   SUBYTE5                                                  01723000
SU38BIT  EQU   SUBYTE5                                                  01724000
SU37BIT  EQU   SUBYTE5                                                  01725000
SU36BIT  EQU   SUBYTE5                                                  01726000
SU35BIT  EQU   SUBYTE5                                                  01727000
SU34BIT  EQU   SUBYTE5                                                  01728000
SU33BIT  EQU   SUBYTE5                                                  01729000
SU32BIT  EQU   SUBYTE5                                                  01730000
SU31BIT  EQU   SUBYTE4                                                  01731000
SU30BIT  EQU   SUBYTE4                                                  01732000
SU29BIT  EQU   SUBYTE4                                                  01733000
SU28BIT  EQU   SUBYTE4                                                  01734000
SU27BIT  EQU   SUBYTE4                                                  01735000
SU26BIT  EQU   SUBYTE4                                                  01736000
SU25BIT  EQU   SUBYTE4                                                  01737000
SU23BIT  EQU   SUBYTE3                                                  01738000
SU22BIT  EQU   SUBYTE3                                                  01739000
SU21BIT  EQU   SUBYTE3                                                  01740000
SU20BIT  EQU   SUBYTE3                                                  01741000
SU19BIT  EQU   SUBYTE3                                                  01742000
SU18BIT  EQU   SUBYTE3                                                  01743000
SU17BIT  EQU   SUBYTE3                                                  01744000
SU16BIT  EQU   SUBYTE3                                                  01745000
SU15BIT  EQU   SUBYTE2                                                  01746000
SU14BIT  EQU   SUBYTE2                                                  01747000
SU13BIT  EQU   SUBYTE2                                                  01748000
SU12BIT  EQU   SUBYTE2                                                  01749000
SU11BIT  EQU   SUBYTE2                                                  01750000
SU10BIT  EQU   SUBYTE2                                                  01751000
SU9BIT   EQU   SUBYTE2                                                  01752000
SU8BIT   EQU   SUBYTE2                                                  01753000
SU7BIT   EQU   SUBYTE1                                                  01754000
SU6BIT   EQU   SUBYTE1                                                  01755000
SU5BIT   EQU   SUBYTE1                                                  01756000
SU4BIT   EQU   SUBYTE1                                                  01757000
SU3BIT   EQU   SUBYTE1                                                  01758000
SU2BIT   EQU   SUBYTE1                                                  01759000
SU1BIT   EQU   SUBYTE1                                                  01760000
SU0BIT   EQU   SUBYTE1                                                  01761000
CVTLEVL  EQU   CVTRELNO+2                                               01762000
CVTNUMB  EQU   CVTRELNO                                                 01763000
CVTMDL   EQU   CVTFIX+250                                               01764000
@NM00073 EQU   CVTFIX+248                                               01765000
@NM00072 EQU   CVTFIX                                                   01766000
CVTRV482 EQU   CVTXTNT2+128                                             01767000
CVTRV481 EQU   CVTXTNT2+124                                             01768000
CVTRV480 EQU   CVTXTNT2+120                                             01769000
CVTRV479 EQU   CVTXTNT2+118                                             01770000
CVTRV478 EQU   CVTXTNT2+117                                             01771000
CVTRV477 EQU   CVTXTNT2+116                                             01772000
CVTRV476 EQU   CVTXTNT2+115                                             01773000
CVTRV475 EQU   CVTXTNT2+114                                             01774000
CVTRV474 EQU   CVTRV466                                                 01775000
CVTRV473 EQU   CVTRV466                                                 01776000
CVTRV472 EQU   CVTRV466                                                 01777000
CVTRV471 EQU   CVTRV466                                                 01778000
CVTRV470 EQU   CVTRV466                                                 01779000
CVTRV469 EQU   CVTRV466                                                 01780000
CVTRV468 EQU   CVTRV466                                                 01781000
CVTRV467 EQU   CVTRV466                                                 01782000
CVTRV465 EQU   CVTRV457                                                 01783000
CVTRV464 EQU   CVTRV457                                                 01784000
CVTRV463 EQU   CVTRV457                                                 01785000
CVTRV462 EQU   CVTRV457                                                 01786000
CVTRV461 EQU   CVTRV457                                                 01787000
CVTRV460 EQU   CVTRV457                                                 01788000
CVTRV459 EQU   CVTRV457                                                 01789000
CVTRV458 EQU   CVTRV457                                                 01790000
CVTRV456 EQU   CVTXTNT2+108                                             01791000
CVTRV455 EQU   CVTXTNT2+104                                             01792000
CVTRV454 EQU   CVTXTNT2+100                                             01793000
CVTRV453 EQU   CVTXTNT2+96                                              01794000
CVTRV452 EQU   CVTXTNT2+94                                              01795000
CVTRV451 EQU   CVTXTNT2+92                                              01796000
CVTRV450 EQU   CVTXTNT2+90                                              01797000
CVTRV449 EQU   CVTXTNT2+88                                              01798000
CVTRV448 EQU   CVTXTNT2+87                                              01799000
CVTRV447 EQU   CVTXTNT2+86                                              01800000
CVTRV446 EQU   CVTRV438                                                 01801000
CVTRV445 EQU   CVTRV438                                                 01802000
CVTRV444 EQU   CVTRV438                                                 01803000
CVTRV443 EQU   CVTRV438                                                 01804000
CVTRV442 EQU   CVTRV438                                                 01805000
CVTRV441 EQU   CVTRV438                                                 01806000
CVTRV440 EQU   CVTRV438                                                 01807000
CVTRV439 EQU   CVTRV438                                                 01808000
CVTRV437 EQU   CVTRV429                                                 01809000
CVTRV436 EQU   CVTRV429                                                 01810000
CVTRV435 EQU   CVTRV429                                                 01811000
CVTRV434 EQU   CVTRV429                                                 01812000
CVTRV433 EQU   CVTRV429                                                 01813000
CVTRV432 EQU   CVTRV429                                                 01814000
CVTRV431 EQU   CVTRV429                                                 01815000
CVTRV430 EQU   CVTRV429                                                 01816000
CVTRV428 EQU   CVTXTNT2+80                                              01817000
CVTRV427 EQU   CVTXTNT2+76                                              01818000
CVTRV426 EQU   CVTXTNT2+72                                              01819000
CVTRV425 EQU   CVTXTNT2+68                                              01820000
CVTATACT EQU   CVTATCVT                                                 01821000
CVTRV423 EQU   CVTXTNT2+62                                              01822000
CVTRV422 EQU   CVTXTNT2+60                                              01823000
CVTRV421 EQU   CVTXTNT2+58                                              01824000
CVTRV420 EQU   CVTXTNT2+56                                              01825000
CVTRV419 EQU   CVTXTNT2+55                                              01826000
CVTRV418 EQU   CVTXTNT2+54                                              01827000
CVTRV417 EQU   CVTRV409                                                 01828000
CVTRV416 EQU   CVTRV409                                                 01829000
CVTRV415 EQU   CVTRV409                                                 01830000
CVTRV414 EQU   CVTRV409                                                 01831000
CVTRV413 EQU   CVTRV409                                                 01832000
CVTRV412 EQU   CVTRV409                                                 01833000
CVTRV411 EQU   CVTRV409                                                 01834000
CVTRV410 EQU   CVTRV409                                                 01835000
CVTRV408 EQU   CVTRV400                                                 01836000
CVTRV407 EQU   CVTRV400                                                 01837000
CVTRV406 EQU   CVTRV400                                                 01838000
CVTRV405 EQU   CVTRV400                                                 01839000
CVTRV404 EQU   CVTRV400                                                 01840000
CVTRV403 EQU   CVTRV400                                                 01841000
CVTRV402 EQU   CVTRV400                                                 01842000
CVTRV401 EQU   CVTRV400                                                 01843000
CVTSKTA  EQU   CVTXTNT2+44                                              01844000
CVTCCVT  EQU   CVTXTNT2+40                                              01845000
CVTRSV98 EQU   CVTXTNT2+36                                              01846000
CVTRSV97 EQU   CVTXTNT2+34                                              01847000
CVTRSV96 EQU   CVTXTNT2+32                                              01848000
CVTOLTEP EQU   CVTXTNT2+28                                              01849000
CVTQIDA  EQU   CVTQID+1                                                 01850000
CVTRSV95 EQU   CVTQID                                                   01851000
CVTRSV94 EQU   CVTXTNT2+20                                              01852000
CVTRSV93 EQU   CVTXTNT2+16                                              01853000
CVTRSV92 EQU   CVTXTNT2+12                                              01854000
CVTDEBVR EQU   CVTXTNT2+8                                               01855000
CVTRSV91 EQU   CVTXTNT2+6                                               01856000
CVTRSV9H EQU   CVTFLGBT                                                 01857000
CVTRSV9G EQU   CVTFLGBT                                                 01858000
CVTRSV9F EQU   CVTFLGBT                                                 01859000
CVTRSV9E EQU   CVTFLGBT                                                 01860000
CVTRSV9D EQU   CVTFLGBT                                                 01861000
CVTRSV9C EQU   CVTFLGBT                                                 01862000
CVTVME   EQU   CVTFLGBT                                                 01863000
CVTNPE   EQU   CVTFLGBT                                                 01864000
CVTNUCLS EQU   CVTXTNT2+4                                               01865000
CVTDSSVA EQU   CVTDSSV+1                                                01866000
CVTRSV89 EQU   CVTDSSV                                                  01867000
CVTRSV88 EQU   CVTXTNT1+8                                               01868000
CVTRSV87 EQU   CVTXTNT1+4                                               01869000
CVTFACHN EQU   CVTXTNT1                                                 01870000
CVTRV488 EQU   CVTMAP+412                                               01871000
CVTRV487 EQU   CVTMAP+408                                               01872000
CVTRV486 EQU   CVTMAP+404                                               01873000
CVTRV485 EQU   CVTMAP+400                                               01874000
CVTACTAP EQU   CVTMAP+396                                               01875000
CVTAUTH  EQU   CVTMAP+392                                               01876000
CVTATMCA EQU   CVTATMCT+1                                               01877000
CVTATMST EQU   CVTATMCT                                                 01878000
CVTRSV61 EQU   CVTMAP+384                                               01879000
CVTVOLT1 EQU   CVTVOLM1+1                                               01880000
CVTVOLI1 EQU   CVTVOLF1                                                 01881000
CVTSTOA  EQU   CVTMAP+376                                               01882000
CVTRSV58 EQU   CVTMAP+374                                               01883000
CVTRSV57 EQU   CVTMAP+372                                               01884000
CVTDDCE  EQU   CVTMAP+368                                               01885000
CVTPNWFR EQU   CVTMAP+364                                               01886000
CVTSMF   EQU   CVTMAP+360                                               01887000
CVTSULK  EQU   CVTMAP+358                                               01888000
CVTSLKO  EQU   CVTSYSK                                                  01889000
CVTSLKP  EQU   CVTSYSK                                                  01890000
CVTSLKQ  EQU   CVTSYSK                                                  01891000
CVTSLKR  EQU   CVTSYSK                                                  01892000
CVTRSV56 EQU   CVTSYSK                                                  01893000
CVTRSV55 EQU   CVTSYSK                                                  01894000
CVTRSV54 EQU   CVTSYSK                                                  01895000
CVTRSV53 EQU   CVTSYSK                                                  01896000
CVTRSV52 EQU   CVTA1F1                                                  01897000
CVTRSV51 EQU   CVTA1F1                                                  01898000
CVTRSV50 EQU   CVTA1F1                                                  01899000
CVTRSV49 EQU   CVTA1F1                                                  01900000
CVTRSV48 EQU   CVTA1F1                                                  01901000
CVTRSV47 EQU   CVTA1F1                                                  01902000
CVTSRSW  EQU   CVTA1F1                                                  01903000
CVTPFSW  EQU   CVTA1F1                                                  01904000
CVTPCVT  EQU   CVTMAP+352                                               01905000
CVTRSV46 EQU   CVTMAP+344                                               01906000
CVTRSV45 EQU   CVTMAP+340                                               01907000
CVTRSV44 EQU   CVTMAP+338                                               01908000
CVTRSV43 EQU   CVTMAP+336                                               01909000
CVTHJESA EQU   CVTHJES+1                                                01910000
CVTRSV42 EQU   CVTHJES                                                  01911000
CVTEXT2A EQU   CVTEXT2+1                                                01912000
CVTRSV41 EQU   CVTEXT2                                                  01913000
CVTAPFA  EQU   CVTAPF+1                                                 01914000
CVTRSV40 EQU   CVTAPF                                                   01915000
CVTRV518 EQU   CVTINTLA                                                 01916000
CVTRV517 EQU   CVTERPV                                                  01917000
CVTEORM  EQU   CVTMAP+312                                               01918000
CVTMCHPR EQU   CVTMAP+308                                               01919000
CVTTZ    EQU   CVTMAP+304                                               01920000
CVTJEPS  EQU   CVTMAP+300                                               01921000
CVTJESCT EQU   CVTMAP+296                                               01922000
CVTMODE  EQU   CVTMAP+292                                               01923000
CVTPTRV  EQU   CVTMAP+288                                               01924000
CVTREAL  EQU   CVTMAP+284                                               01925000
CVTRSV39 EQU   CVTMAP+280                                               01926000
CVTRSV38 EQU   CVTMAP+276                                               01927000
CVTDMSRA EQU   CVTDMSR+1                                                01928000
CVTRV634 EQU   CVTDMSRF                                                 01929000
CVTRV633 EQU   CVTDMSRF                                                 01930000
CVTRV632 EQU   CVTDMSRF                                                 01931000
CVTRV631 EQU   CVTDMSRF                                                 01932000
CVTRV630 EQU   CVTDMSRF                                                 01933000
CVTRV629 EQU   CVTDMSRF                                                 01934000
CVTUDUMP EQU   CVTDMSRF                                                 01935000
CVTSDUMP EQU   CVTDMSRF                                                 01936000
CVTQMSGA EQU   CVTQMSG+1                                                01937000
CVTRSV36 EQU   CVTQMSG                                                  01938000
CVTAMFF  EQU   CVTMAP+264                                               01939000
CVTPURGA EQU   CVTPURG+1                                                01940000
CVTRSV35 EQU   CVTPURG                                                  01941000
CVTCBSP  EQU   CVTMAP+256                                               01942000
CVTATERA EQU   CVTATER+1                                                01943000
CVTSYST  EQU   CVTATER                                                  01944000
CVTVOLT2 EQU   CVTTAT                                                   01945000
CVTVOLI2 EQU   CVTVOLF2                                                 01946000
CVTAQAVB EQU   CVTAQAVT+1                                               01947000
CVTRSV34 EQU   CVTTCMFG                                                 01948000
CVTRSV33 EQU   CVTTCMFG                                                 01949000
CVTRSV32 EQU   CVTTCMFG                                                 01950000
CVTRSV31 EQU   CVTTCMFG                                                 01951000
CVTRSV30 EQU   CVTTCMFG                                                 01952000
CVTRSV29 EQU   CVTTCMFG                                                 01953000
CVTLDEV  EQU   CVTTCMFG                                                 01954000
CVTTCRDY EQU   CVTTCMFG                                                 01955000
CVTGTFA  EQU   CVTGTF+1                                                 01956000
CVTRSV27 EQU   CVTGTFST                                                 01957000
CVTRNIO  EQU   CVTGTFST                                                 01958000
CVTUSR   EQU   CVTGTFST                                                 01959000
CVTRV318 EQU   CVTFORM                                                  01960000
CVTRV317 EQU   CVTTMODE                                                 01961000
CVTRV316 EQU   CVTSTATE                                                 01962000
CVTRV315 EQU   CVTGTFS                                                  01963000
CVTGTFAV EQU   CVTGTFS                                                  01964000
CVT0SCR1 EQU   CVTMAP+232                                               01965000
CVTRV515 EQU   CVTMAP+228                                               01966000
CVTRMS   EQU   CVTMAP+224                                               01967000
CVTPATCH EQU   CVTMAP+220                                               01968000
CVTTSCE  EQU   CVTMAP+216                                               01969000
CVTLNKSC EQU   CVTMAP+214                                               01970000
CVTQABST EQU   CVTMAP+212                                               01971000
CVTMDLDS EQU   CVTMAP+208                                               01972000
CVTUSER  EQU   CVTMAP+204                                               01973000
CVTABEND EQU   CVTMAP+200                                               01974000
CVTSMCA  EQU   CVTMAP+196                                               01975000
CVTRSV18 EQU   CVTMAP+192                                               01976000
CVTQLPAQ EQU   CVTMAP+188                                               01977000
CVTQCDSR EQU   CVTMAP+184                                               01978000
CVTRSV17 EQU   CVTOPTB                                                  01979000
CVTRSV16 EQU   CVTOPTB                                                  01980000
CVTFP    EQU   CVTOPTB                                                  01981000
CVTAPTHR EQU   CVTOPTB                                                  01982000
CVTNLOG  EQU   CVTOPTB                                                  01983000
CVTTOD   EQU   CVTOPTB                                                  01984000
CVTCTIMS EQU   CVTOPTB                                                  01985000
CVTPROT  EQU   CVTOPTB                                                  01986000
CVTXPFP  EQU   CVTOPTA                                                  01987000
CVTASCII EQU   CVTOPTA                                                  01988000
CVTRSV13 EQU   CVTOPTA                                                  01989000
CVTRSV12 EQU   CVTOPTA                                                  01990000
CVTNIP   EQU   CVTOPTA                                                  01991000
CVTDDR   EQU   CVTOPTA                                                  01992000
CVTAPR   EQU   CVTOPTA                                                  01993000
CVTCCH   EQU   CVTOPTA                                                  01994000
CVTSNCTR EQU   CVTMAP+180                                               01995000
CVTQMWR  EQU   CVTMAP+176                                               01996000
CVTQOCR  EQU   CVTMAP+172                                               01997000
CVT1EF00 EQU   CVTMAP+168                                               01998000
CVTMZ00  EQU   CVTMAP+164                                               01999000
CVTSV76Q EQU   CVTSV76C                                                 02000000
CVTRSV11 EQU   CVTMAP+156                                               02001000
CVT0PT01 EQU   CVTMAP+152                                               02002000
CVTMSER  EQU   CVTMAP+148                                               02003000
CVTRV516 EQU   CVTIERLC                                                 02004000
CVTILCH  EQU   CVTMAP+140                                               02005000
CVT0DS   EQU   CVTMAP+136                                               02006000
CVTFBOSV EQU   CVTMAP+132                                               02007000
CVTNUCB  EQU   CVTMAP+128                                               02008000
CVTIXAVL EQU   CVTMAP+124                                               02009000
CVTSV76M EQU   CVTIOQET                                                 02010000
CVTDCBA  EQU   CVTMAP+117                                               02011000
CVTMVS2  EQU   CVTDCB                                                   02012000
CVT6DAT  EQU   CVTDCB                                                   02013000
CVT4MPS  EQU   CVTDCB                                                   02014000
CVTRSV09 EQU   CVTDCB                                                   02015000
CVT4MS1  EQU   CVTDCB                                                   02016000
CVT2SPS  EQU   CVTDCB                                                   02017000
CVT1SSS  EQU   CVTDCB                                                   02018000
CVTRSV08 EQU   CVTDCB                                                   02019000
CVTSTB   EQU   CVTMAP+112                                               02020000
CVTQTD00 EQU   CVTMAP+108                                               02021000
CVTQTE00 EQU   CVTMAP+104                                               02022000
CVTCUCB  EQU   CVTMAP+100                                               02023000
CVTSJQ   EQU   CVTMAP+96                                                02024000
CVTPBLDL EQU   CVTMAP+92                                                02025000
CVTTPC   EQU   CVTMAP+88                                                02026000
CVTSVDCB EQU   CVTMAP+84                                                02027000
CVTBRET  EQU   CVTMAP+82                                                02028000
CVTEXIT  EQU   CVTMAP+80                                                02029000
CVT0FN00 EQU   CVTMAP+76                                                02030000
CVTDARA  EQU   CVTDAR+1                                                 02031000
CVTRSV07 EQU   CVTFLGS1                                                 02032000
CVTRSV06 EQU   CVTFLGS1                                                 02033000
CVTRSV05 EQU   CVTFLGS1                                                 02034000
CVTRSV04 EQU   CVTFLGS1                                                 02035000
CVTRSV03 EQU   CVTFLGS1                                                 02036000
CVTRSV02 EQU   CVTFLGS1                                                 02037000
CVTRSV01 EQU   CVTFLGS1                                                 02038000
CVTDMPLK EQU   CVTFLGS1                                                 02039000
CVTXITP  EQU   CVTMAP+68                                                02040000
CVTZDTAB EQU   CVTMAP+64                                                02041000
CVTMSLT  EQU   CVTMAP+60                                                02042000
CVTDATE  EQU   CVTMAP+56                                                02043000
CVTBTERM EQU   CVTMAP+52                                                02044000
CVTSYSAD EQU   CVTMAP+48                                                02045000
CVTXTLER EQU   CVTMAP+44                                                02046000
CVTILK2  EQU   CVTMAP+40                                                02047000
CVTILK1  EQU   CVTMAP+36                                                02048000
CVTPRLTV EQU   CVTMAP+32                                                02049000
CVTPCNVT EQU   CVTMAP+28                                                02050000
CVT0VL00 EQU   CVTMAP+24                                                02051000
CVTXAPG  EQU   CVTMAP+20                                                02052000
CVTBUF   EQU   CVTMAP+16                                                02053000
CVTJOB   EQU   CVTMAP+12                                                02054000
CVTLINK  EQU   CVTMAP+8                                                 02055000
CVT0EF00 EQU   CVTMAP+4                                                 02056000
CVTTCBP  EQU   CVTMAP                                                   02057000
CVT      EQU   CVTMAP                                                   02058000
@NM00071 EQU   SDWA+512                                                 02059000
SDWAVRA  EQU   SDWARA+4                                                 02060000
SDWAURAL EQU   SDWARA+3                                                 02061000
@NM00070 EQU   SDWADPVA                                                 02062000
SDWAEBC  EQU   SDWADPVA                                                 02063000
SDWAHEX  EQU   SDWADPVA                                                 02064000
SDWAVRAL EQU   SDWARA                                                   02065000
@NM00069 EQU   SDWA+396                                                 02066000
SDWACOMP EQU   SDWA+392                                                 02067000
SDWARCPL EQU   SDWA+364                                                 02068000
@NM00068 EQU   SDWADPSA+32                                              02069000
SDWATO4  EQU   SDWADPSL+28                                              02070000
SDWAFRM4 EQU   SDWADPSL+24                                              02071000
SDWATO3  EQU   SDWADPSL+20                                              02072000
SDWAFRM3 EQU   SDWADPSL+16                                              02073000
SDWATO2  EQU   SDWADPSL+12                                              02074000
SDWAFRM2 EQU   SDWADPSL+8                                               02075000
SDWATO1  EQU   SDWADPSL+4                                               02076000
SDWAFRM1 EQU   SDWADPSL                                                 02077000
@NM00067 EQU   SDWADDAT+3                                               02078000
@NM00066 EQU   SDWAPDAT                                                 02079000
SDWAUSPL EQU   SDWAPDAT                                                 02080000
SDWADPSW EQU   SDWAPDAT                                                 02081000
SDWATJPA EQU   SDWAPDAT                                                 02082000
SDWATLPA EQU   SDWAPDAT                                                 02083000
SDWADREG EQU   SDWAPDAT                                                 02084000
SDWADSAH EQU   SDWAPDAT                                                 02085000
SDWADSAS EQU   SDWAPDAT                                                 02086000
@NM00065 EQU   SDWADDAT+1                                               02087000
@NM00064 EQU   SDWASDAT                                                 02088000
SDWAQQS  EQU   SDWASDAT                                                 02089000
SDWACBS  EQU   SDWASDAT                                                 02090000
SDWAGTF  EQU   SDWASDAT                                                 02091000
SDWASWA  EQU   SDWASDAT                                                 02092000
SDWALSQA EQU   SDWASDAT                                                 02093000
SDWASQA  EQU   SDWASDAT                                                 02094000
SDWANUC  EQU   SDWASDAT                                                 02095000
@NM00063 EQU   SDWADUMP+2                                               02096000
@NM00062 EQU   SDWADPFS                                                 02097000
SDWASLST EQU   SDWADPFS                                                 02098000
@NM00061 EQU   SDWADPFS                                                 02099000
SDWADLST EQU   SDWADPFS                                                 02100000
SDWADPT  EQU   SDWADPFS                                                 02101000
SDWADPID EQU   SDWADUMP                                                 02102000
SDWADPLA EQU   SDWA+316                                                 02103000
SDWAREXN EQU   SDWARECP+16                                              02104000
SDWACSCT EQU   SDWARECP+8                                               02105000
SDWAMODN EQU   SDWARECP                                                 02106000
@NM00060 EQU   SDWA+290                                                 02107000
SDWAASID EQU   SDWA+288                                                 02108000
SDWATALW EQU   SDWALKWS+28                                              02109000
SDWATDLW EQU   SDWALKWS+24                                              02110000
SDWATNLW EQU   SDWALKWS+20                                              02111000
SDWAAPLW EQU   SDWALKWS+16                                              02112000
SDWAIPLW EQU   SDWALKWS+12                                              02113000
SDWAILLW EQU   SDWALKWS+8                                               02114000
SDWAIULW EQU   SDWALKWS+4                                               02115000
SDWAICLW EQU   SDWALKWS                                                 02116000
SDWAFLLK EQU   SDWAACF4                                                 02117000
SDWACMS  EQU   SDWAACF4                                                 02118000
SDWAOPTM EQU   SDWAACF4                                                 02119000
SDWATADB EQU   SDWAACF4                                                 02120000
SDWATDNB EQU   SDWAACF4                                                 02121000
SDWATNCB EQU   SDWAACF4                                                 02122000
SDWAILCH EQU   SDWAACF4                                                 02123000
SDWAIUCB EQU   SDWAACF4                                                 02124000
SDWAICAT EQU   SDWAACF3                                                 02125000
SDWAIPRG EQU   SDWAACF3                                                 02126000
SDWASALL EQU   SDWAACF3                                                 02127000
SDWAASMP EQU   SDWAACF3                                                 02128000
SDWADISP EQU   SDWAACF3                                                 02129000
@NM00059 EQU   SDWAACF3                                                 02130000
@NM00058 EQU   SDWAACF2                                                 02131000
@NM00057 EQU   SDWAACF2                                                 02132000
SDWASPIN EQU   SDWAACF2                                                 02133000
@NM00056 EQU   SDWAACF2                                                 02134000
SDWALCPU EQU   SDWACPUA+2                                               02135000
@NM00055 EQU   SDWACPUA                                                 02136000
SDWARECA EQU   SDWA+244                                                 02137000
@NM00054 EQU   SDWA+239                                                 02138000
@NM00053 EQU   SDWAIOFS                                                 02139000
SDWANIOP EQU   SDWAIOFS                                                 02140000
SDWANOIO EQU   SDWAIOFS                                                 02141000
SDWAIOHT EQU   SDWAIOFS                                                 02142000
SDWAIOQR EQU   SDWAIOFS                                                 02143000
SDWAFMID EQU   SDWA+236                                                 02144000
@NM00052 EQU   SDWAERRD                                                 02145000
SDWAMCIV EQU   SDWAERRD                                                 02146000
SDWARPIV EQU   SDWAERRD                                                 02147000
SDWAMABD EQU   SDWAERRD                                                 02148000
SDWACTS  EQU   SDWAERRD                                                 02149000
SDWASTAE EQU   SDWAERRD                                                 02150000
SDWANRBE EQU   SDWAERRD                                                 02151000
SDWACLUP EQU   SDWAERRD                                                 02152000
@NM00051 EQU   SDWAERRC                                                 02153000
SDWAEAS  EQU   SDWAERRC                                                 02154000
SDWAIRB  EQU   SDWAERRC                                                 02155000
SDWASTAI EQU   SDWAERRC                                                 02156000
SDWASTAF EQU   SDWAERRC                                                 02157000
SDWASRBM EQU   SDWAERRB                                                 02158000
SDWALDIS EQU   SDWAERRB                                                 02159000
SDWAENRB EQU   SDWAERRB                                                 02160000
SDWATYP1 EQU   SDWAERRB                                                 02161000
@NM00050 EQU   SDWAERRB                                                 02162000
SDWAPGIO EQU   SDWAERRA                                                 02163000
SDWATEXC EQU   SDWAERRA                                                 02164000
SDWASVCE EQU   SDWAERRA                                                 02165000
SDWAABTM EQU   SDWAERRA                                                 02166000
SDWASVCD EQU   SDWAERRA                                                 02167000
SDWAMCHK EQU   SDWAERRA                                                 02168000
SDWATIME EQU   SDWAMCH+20                                               02169000
SDWARFSA EQU   SDWAMCH+16                                               02170000
@NM00049 EQU   SDWAMCH+14                                               02171000
SDWAVEQR EQU   SDWARSR2                                                 02172000
SDWAPGFX EQU   SDWARSR2                                                 02173000
SDWAFLSQ EQU   SDWARSR2                                                 02174000
SDWAFSQA EQU   SDWARSR2                                                 02175000
SDWANUCL EQU   SDWARSR2                                                 02176000
SDWASPER EQU   SDWARSR2                                                 02177000
SDWAINTC EQU   SDWARSR2                                                 02178000
SDWAOFLN EQU   SDWARSR2                                                 02179000
SDWACHNG EQU   SDWARSR1                                                 02180000
SDWAMSER EQU   SDWARSR1                                                 02181000
@NM00048 EQU   SDWARSR1                                                 02182000
SDWACPID EQU   SDWAMCH+10                                               02183000
SDWATERR EQU   SDWAMCHD                                                 02184000
SDWAFPRX EQU   SDWAMCHD                                                 02185000
SDWAINSF EQU   SDWAMCHD                                                 02186000
SDWAACR  EQU   SDWAMCHD                                                 02187000
SDWASCK  EQU   SDWAMCHD                                                 02188000
SDWAPSWU EQU   SDWAMCHD                                                 02189000
SDWAREGU EQU   SDWAMCHD                                                 02190000
SDWASKYF EQU   SDWAMCHD                                                 02191000
@NM00047 EQU   SDWAMCHS                                                 02192000
SDWARSRF EQU   SDWAMCHS                                                 02193000
SDWARSRC EQU   SDWAMCHS                                                 02194000
SDWAINVP EQU   SDWAMCHS                                                 02195000
SDWATSVL EQU   SDWAMCHS                                                 02196000
SDWARCDF EQU   SDWAMCHS                                                 02197000
SDWASRVL EQU   SDWAMCHS                                                 02198000
SDWASCKE EQU   SDWASTCK+4                                               02199000
SDWASCKB EQU   SDWASTCK                                                 02200000
SDWALNTH EQU   SDWAIDNT+1                                               02201000
SDWASPID EQU   SDWAIDNT                                                 02202000
SDWASR15 EQU   SDWASRSV+60                                              02203000
SDWASR14 EQU   SDWASRSV+56                                              02204000
SDWASR13 EQU   SDWASRSV+52                                              02205000
SDWASR12 EQU   SDWASRSV+48                                              02206000
SDWASR11 EQU   SDWASRSV+44                                              02207000
SDWASR10 EQU   SDWASRSV+40                                              02208000
SDWASR09 EQU   SDWASRSV+36                                              02209000
SDWASR08 EQU   SDWASRSV+32                                              02210000
SDWASR07 EQU   SDWASRSV+28                                              02211000
SDWASR06 EQU   SDWASRSV+24                                              02212000
SDWASR05 EQU   SDWASRSV+20                                              02213000
SDWASR04 EQU   SDWASRSV+16                                              02214000
SDWASR03 EQU   SDWASRSV+12                                              02215000
SDWASR02 EQU   SDWASRSV+8                                               02216000
SDWASR01 EQU   SDWASRSV+4                                               02217000
SDWASR00 EQU   SDWASRSV                                                 02218000
SDWATRN2 EQU   SDWAAEC2+4                                               02219000
SDWAIPC2 EQU   SDWAICD2                                                 02220000
SDWAIMC2 EQU   SDWAICD2                                                 02221000
SDWAIPR2 EQU   SDWAICD2                                                 02222000
@NM00046 EQU   SDWAINC2                                                 02223000
@NM00045 EQU   SDWAILC2                                                 02224000
SDWAIL2  EQU   SDWAILC2                                                 02225000
@NM00044 EQU   SDWAILC2                                                 02226000
@NM00043 EQU   SDWAAEC2                                                 02227000
SDWAADD2 EQU   SDWANXT2+1                                               02228000
@NM00042 EQU   SDWANXT2                                                 02229000
@NM00041 EQU   SDWAEC2+3                                                02230000
SDWASGN2 EQU   SDWAINT2                                                 02231000
SDWAEXP2 EQU   SDWAINT2                                                 02232000
SDWADEC2 EQU   SDWAINT2                                                 02233000
SDWAFPO2 EQU   SDWAINT2                                                 02234000
SDWACC2  EQU   SDWAINT2                                                 02235000
@NM00040 EQU   SDWAINT2                                                 02236000
SDWAPGM2 EQU   SDWAMWP2                                                 02237000
SDWAWAT2 EQU   SDWAMWP2                                                 02238000
SDWAMCK2 EQU   SDWAMWP2                                                 02239000
SDWAECT2 EQU   SDWAMWP2                                                 02240000
SDWAKEY2 EQU   SDWAMWP2                                                 02241000
SDWAEXT2 EQU   SDWAEMK2                                                 02242000
SDWAIO2  EQU   SDWAEMK2                                                 02243000
SDWATRM2 EQU   SDWAEMK2                                                 02244000
@NM00039 EQU   SDWAEMK2                                                 02245000
SDWAPER2 EQU   SDWAEMK2                                                 02246000
@NM00038 EQU   SDWAEMK2                                                 02247000
SDWATRAN EQU   SDWAAEC1+4                                               02248000
SDWAIPC1 EQU   SDWAICD1                                                 02249000
SDWAIMC1 EQU   SDWAICD1                                                 02250000
SDWAIPR1 EQU   SDWAICD1                                                 02251000
@NM00037 EQU   SDWAINC1                                                 02252000
@NM00036 EQU   SDWAILC1                                                 02253000
SDWAIL1  EQU   SDWAILC1                                                 02254000
@NM00035 EQU   SDWAILC1                                                 02255000
@NM00034 EQU   SDWAAEC1                                                 02256000
SDWAADD1 EQU   SDWANXT1+1                                               02257000
@NM00033 EQU   SDWANXT1                                                 02258000
@NM00032 EQU   SDWAEC1+3                                                02259000
SDWASGN1 EQU   SDWAINT1                                                 02260000
SDWAEXP1 EQU   SDWAINT1                                                 02261000
SDWADEC1 EQU   SDWAINT1                                                 02262000
SDWAFPO1 EQU   SDWAINT1                                                 02263000
SDWACC1  EQU   SDWAINT1                                                 02264000
@NM00031 EQU   SDWAINT1                                                 02265000
SDWAPGM1 EQU   SDWAMWP1                                                 02266000
SDWAWAT1 EQU   SDWAMWP1                                                 02267000
SDWAMCK1 EQU   SDWAMWP1                                                 02268000
SDWAECT1 EQU   SDWAMWP1                                                 02269000
SDWAKEY1 EQU   SDWAMWP1                                                 02270000
SDWAEXT1 EQU   SDWAEMK1                                                 02271000
SDWAIO1  EQU   SDWAEMK1                                                 02272000
SDWATRM1 EQU   SDWAEMK1                                                 02273000
@NM00030 EQU   SDWAEMK1                                                 02274000
SDWAPER1 EQU   SDWAEMK1                                                 02275000
@NM00029 EQU   SDWAEMK1                                                 02276000
SDWAIOBR EQU   SDWA+100                                                 02277000
SDWAEPA  EQU   SDWA+96                                                  02278000
@NM00028 EQU   SDWANAME+4                                               02279000
SDWARBAD EQU   SDWANAME                                                 02280000
SDWAGR15 EQU   SDWAGRSV+60                                              02281000
SDWAGR14 EQU   SDWAGRSV+56                                              02282000
SDWAGR13 EQU   SDWAGRSV+52                                              02283000
SDWAGR12 EQU   SDWAGRSV+48                                              02284000
SDWAGR11 EQU   SDWAGRSV+44                                              02285000
SDWAGR10 EQU   SDWAGRSV+40                                              02286000
SDWAGR09 EQU   SDWAGRSV+36                                              02287000
SDWAGR08 EQU   SDWAGRSV+32                                              02288000
SDWAGR07 EQU   SDWAGRSV+28                                              02289000
SDWAGR06 EQU   SDWAGRSV+24                                              02290000
SDWAGR05 EQU   SDWAGRSV+20                                              02291000
SDWAGR04 EQU   SDWAGRSV+16                                              02292000
SDWAGR03 EQU   SDWAGRSV+12                                              02293000
SDWAGR02 EQU   SDWAGRSV+8                                               02294000
SDWAGR01 EQU   SDWAGRSV+4                                               02295000
SDWAGR00 EQU   SDWAGRSV                                                 02296000
SDWANXTP EQU   SDWACTL2+5                                               02297000
SDWASGP  EQU   SDWAPMKP                                                 02298000
SDWAEUP  EQU   SDWAPMKP                                                 02299000
SDWADOP  EQU   SDWAPMKP                                                 02300000
SDWAFPP  EQU   SDWAPMKP                                                 02301000
SDWACCP  EQU   SDWAPMKP                                                 02302000
SDWAILP  EQU   SDWAPMKP                                                 02303000
SDWAINTP EQU   SDWACTL2+2                                               02304000
SDWASPVP EQU   SDWAMWPP                                                 02305000
SDWAWATP EQU   SDWAMWPP                                                 02306000
SDWAMCKP EQU   SDWAMWPP                                                 02307000
@NM00027 EQU   SDWAMWPP                                                 02308000
SDWAKEYP EQU   SDWAMWPP                                                 02309000
SDWAEXTP EQU   SDWACMKP                                                 02310000
SDWAIOP  EQU   SDWACMKP                                                 02311000
SDWANXTA EQU   SDWACTL1+5                                               02312000
SDWASGA  EQU   SDWAPMKA                                                 02313000
SDWAEUA  EQU   SDWAPMKA                                                 02314000
SDWADOA  EQU   SDWAPMKA                                                 02315000
SDWAFPA  EQU   SDWAPMKA                                                 02316000
SDWACCA  EQU   SDWAPMKA                                                 02317000
SDWAILA  EQU   SDWAPMKA                                                 02318000
SDWAINTA EQU   SDWACTL1+2                                               02319000
SDWASPVA EQU   SDWAMWPA                                                 02320000
SDWAWATA EQU   SDWAMWPA                                                 02321000
SDWAMCKA EQU   SDWAMWPA                                                 02322000
@NM00026 EQU   SDWAMWPA                                                 02323000
SDWAKEYA EQU   SDWAMWPA                                                 02324000
SDWAEXTA EQU   SDWACMKA                                                 02325000
SDWAIOA  EQU   SDWACMKA                                                 02326000
@NM00025 EQU   SDWACMPF                                                 02327000
SDWASTCC EQU   SDWACMPF                                                 02328000
@NM00024 EQU   SDWACMPF                                                 02329000
SDWASTEP EQU   SDWACMPF                                                 02330000
@NM00023 EQU   TCBXTNT2+32                                              02331000
TCBRV181 EQU   TCBRV173                                                 02332000
TCBRV180 EQU   TCBRV173                                                 02333000
TCBRV179 EQU   TCBRV173                                                 02334000
TCBRV178 EQU   TCBRV173                                                 02335000
TCBRV177 EQU   TCBRV173                                                 02336000
TCBRV176 EQU   TCBRV173                                                 02337000
TCBRV175 EQU   TCBRV173                                                 02338000
TCBRV174 EQU   TCBRV173                                                 02339000
TCBRV172 EQU   TCBRV164                                                 02340000
TCBRV171 EQU   TCBRV164                                                 02341000
TCBRV170 EQU   TCBRV164                                                 02342000
TCBRV169 EQU   TCBRV164                                                 02343000
TCBRV168 EQU   TCBRV164                                                 02344000
TCBRV167 EQU   TCBRV164                                                 02345000
TCBRV166 EQU   TCBRV164                                                 02346000
TCBRV165 EQU   TCBRV164                                                 02347000
TCBRV163 EQU   TCBRV155                                                 02348000
TCBRV162 EQU   TCBRV155                                                 02349000
TCBRV161 EQU   TCBRV155                                                 02350000
TCBRV160 EQU   TCBRV155                                                 02351000
TCBRV159 EQU   TCBRV155                                                 02352000
TCBRV158 EQU   TCBRV155                                                 02353000
TCBRV157 EQU   TCBRV155                                                 02354000
TCBRV156 EQU   TCBRV155                                                 02355000
TCBRV154 EQU   TCBRV146                                                 02356000
TCBRV153 EQU   TCBRV146                                                 02357000
TCBRV152 EQU   TCBRV146                                                 02358000
TCBRV151 EQU   TCBRV146                                                 02359000
TCBRV150 EQU   TCBRV146                                                 02360000
TCBRV149 EQU   TCBRV146                                                 02361000
TCBRV148 EQU   TCBRV146                                                 02362000
TCBRV147 EQU   TCBRV146                                                 02363000
TCBRV145 EQU   TCBXTNT2+26                                              02364000
TCBRV144 EQU   TCBXTNT2+24                                              02365000
TCBCAUF  EQU   TCBXTNT2+20                                              02366000
TCBRV142 EQU   TCBXTNT2+16                                              02367000
TCBRSV49 EQU   TCBXTNT2+12                                              02368000
TCBEVENT EQU   TCBXTNT2+8                                               02369000
TCBRCMP  EQU   TCBXTNT2+5                                               02370000
TCBRSVAB EQU   TCBXTNT2+4                                               02371000
TCBGTFA  EQU   TCBGTF+1                                                 02372000
TCBRSV47 EQU   TCBTFLG                                                  02373000
TCBRSV46 EQU   TCBTFLG                                                  02374000
TCBRSV45 EQU   TCBTFLG                                                  02375000
TCBRSV44 EQU   TCBTFLG                                                  02376000
TCBRSV43 EQU   TCBTFLG                                                  02377000
TCBDSPIT EQU   TCBTFLG                                                  02378000
TCBERRTN EQU   TCBTFLG                                                  02379000
TCBASYNC EQU   TCBTFLG                                                  02380000
@NM00022 EQU   TCB+296                                                  02381000
TCBSVCA2 EQU   TCB+292                                                  02382000
TCBSWASA EQU   TCB+288                                                  02383000
TCBDBTB  EQU   TCB+284                                                  02384000
TCBRPT   EQU   TCB+280                                                  02385000
TCBRV141 EQU   TCBRV133                                                 02386000
TCBRV140 EQU   TCBRV133                                                 02387000
TCBRV139 EQU   TCBRV133                                                 02388000
TCBRV138 EQU   TCBRV133                                                 02389000
TCBRV137 EQU   TCBRV133                                                 02390000
TCBRV136 EQU   TCBRV133                                                 02391000
TCBRV135 EQU   TCBRV133                                                 02392000
TCBRV134 EQU   TCBRV133                                                 02393000
TCBRV132 EQU   TCBRV124                                                 02394000
TCBRV131 EQU   TCBRV124                                                 02395000
TCBRV130 EQU   TCBRV124                                                 02396000
TCBRV129 EQU   TCBRV124                                                 02397000
TCBRV128 EQU   TCBRV124                                                 02398000
TCBRV127 EQU   TCBRV124                                                 02399000
TCBRV126 EQU   TCBRV124                                                 02400000
TCBRV125 EQU   TCBRV124                                                 02401000
TCBRV123 EQU   TCBFBYT2                                                 02402000
TCBRV122 EQU   TCBFBYT2                                                 02403000
TCBECBNV EQU   TCBFBYT2                                                 02404000
TCBSSSYN EQU   TCBFBYT2                                                 02405000
TCBFPRAP EQU   TCBFBYT2                                                 02406000
TCBFDW   EQU   TCBFBYT2                                                 02407000
TCBFMW   EQU   TCBFBYT2                                                 02408000
TCBCNCB  EQU   TCBFBYT2                                                 02409000
TCBLLH   EQU   TCBFBYT1                                                 02410000
TCBRV113 EQU   TCBFBYT1                                                 02411000
TCBEOT   EQU   TCBFBYT1                                                 02412000
TCBRTM2  EQU   TCBFBYT1                                                 02413000
TCBPGNLY EQU   TCBFBYT1                                                 02414000
TCBNDIOS EQU   TCBFBYT1                                                 02415000
TCBRV327 EQU   TCBFBYT1                                                 02416000
TCBEOTFM EQU   TCBFBYT1                                                 02417000
TCBAFFN  EQU   TCB+274                                                  02418000
TCBRV326 EQU   TCB+272                                                  02419000
TCBUKYSP EQU   TCB+268                                                  02420000
TCBMODE  EQU   TCBESTAE+3                                               02421000
TCBERTYP EQU   TCBESTAE+2                                               02422000
TCBRV314 EQU   TCBESTRM                                                 02423000
TCBRV313 EQU   TCBESTRM                                                 02424000
TCBRV312 EQU   TCBESTRM                                                 02425000
TCBRV311 EQU   TCBESTRM                                                 02426000
TCBRV310 EQU   TCBESTRM                                                 02427000
TCBRV309 EQU   TCBESTRM                                                 02428000
TCBRV308 EQU   TCBESTRM                                                 02429000
TCBETERM EQU   TCBESTRM                                                 02430000
TCBSCBKY EQU   TCBESTAE                                                 02431000
TCBRTM12 EQU   TCB+260                                                  02432000
TCBTCBID EQU   TCB+256                                                  02433000
TCBSTAFX EQU   TCBSTAWA                                                 02434000
TCBSWA   EQU   TCB+248                                                  02435000
TCBFOEA  EQU   TCBFOE+1                                                 02436000
TCBRSV42 EQU   TCBFOE                                                   02437000
TCBCCPVI EQU   TCBXSCT+2                                                02438000
TCBRV325 EQU   TCBXSCT+1                                                02439000
TCBRV324 EQU   TCBXSCT1                                                 02440000
TCBRV323 EQU   TCBXSCT1                                                 02441000
TCBRV322 EQU   TCBXSCT1                                                 02442000
TCBRV321 EQU   TCBXSCT1                                                 02443000
TCBRV320 EQU   TCBXSCT1                                                 02444000
TCBRV319 EQU   TCBXSCT1                                                 02445000
TCBS3A   EQU   TCBXSCT1                                                 02446000
TCBACTIV EQU   TCBXSCT1                                                 02447000
TCBRSV41 EQU   TCB+239                                                  02448000
TCBTID   EQU   TCB+238                                                  02449000
TCBRSVAA EQU   TCB+237                                                  02450000
TCBABCUR EQU   TCB+236                                                  02451000
TCBTMSAV EQU   TCB+232                                                  02452000
TCBIOTIM EQU   TCB+228                                                  02453000
TCBRTWA  EQU   TCB+224                                                  02454000
TCBBACK  EQU   TCB+220                                                  02455000
TCBTIRB  EQU   TCB+216                                                  02456000
TCBAECB  EQU   TCB+212                                                  02457000
TCBEXT2A EQU   TCBEXT2+1                                                02458000
TCBRSV39 EQU   TCBEXT2                                                  02459000
TCBSTMCT EQU   TCB+207                                                  02460000
TCBSYSCT EQU   TCB+206                                                  02461000
TCBRSV37 EQU   TCB+205                                                  02462000
TCBEXSVC EQU   TCBDAR                                                   02463000
TCBDARMS EQU   TCBDAR                                                   02464000
TCBDARWT EQU   TCBDAR                                                   02465000
TCBDARO  EQU   TCBDAR                                                   02466000
TCBDARMC EQU   TCBDARC                                                  02467000
TCBDARD  EQU   TCBDAR                                                   02468000
TCBDARS  EQU   TCBDAR                                                   02469000
TCBDARP  EQU   TCBDAR                                                   02470000
TCBGTOFM EQU   TCBFLGS7                                                 02471000
TCBADMP  EQU   TCBFLGS7                                                 02472000
TCBRSTSK EQU   TCBFLGS7                                                 02473000
TCBSVCS  EQU   TCBFLGS7                                                 02474000
TCBSTACK EQU   TCBFLGS7                                                 02475000
TCBRSV34 EQU   TCBFLGS7                                                 02476000
TCBRSV33 EQU   TCBFLGS7                                                 02477000
TCBGPECB EQU   TCBFLGS7                                                 02478000
TCBNTJS  EQU   TCBFLGS6                                                 02479000
TCBAPG   EQU   TCBFLGS6                                                 02480000
TCBMIGR  EQU   TCBFLGS6                                                 02481000
TCBRV303 EQU   TCBFLGS6                                                 02482000
TCBSPVLK EQU   TCBFLGS6                                                 02483000
TCBCPU   EQU   TCBFLGS6                                                 02484000
TCBPIE17 EQU   TCBFLGS6                                                 02485000
TCBRV    EQU   TCBFLGS6                                                 02486000
TCBRSV79 EQU   TCBNDSP5                                                 02487000
TCBRSV78 EQU   TCBNDSP5                                                 02488000
TCBRSV77 EQU   TCBNDSP5                                                 02489000
TCBRSV76 EQU   TCBNDSP5                                                 02490000
TCBRSV75 EQU   TCBNDSP5                                                 02491000
TCBRSV74 EQU   TCBNDSP5                                                 02492000
TCBRSV95 EQU   TCBNDSP5                                                 02493000
TCBRSV94 EQU   TCBNDSP5                                                 02494000
TCBRSV93 EQU   TCBNDSP4                                                 02495000
TCBRSV92 EQU   TCBNDSP4                                                 02496000
TCBRSV91 EQU   TCBNDSP4                                                 02497000
TCBRSV90 EQU   TCBNDSP4                                                 02498000
TCBRSV89 EQU   TCBNDSP4                                                 02499000
TCBRSV88 EQU   TCBNDSP4                                                 02500000
TCBRSV87 EQU   TCBNDSP4                                                 02501000
TCBRSV86 EQU   TCBNDSP4                                                 02502000
TCBEXT1A EQU   TCBEXT1+1                                                02503000
TCBRSV32 EQU   TCBEXT1                                                  02504000
TCBEXCPD EQU   TCB+192                                                  02505000
TCBIOBRC EQU   TCB+188                                                  02506000
TCBDDWTC EQU   TCB+186                                                  02507000
TCBDDEXC EQU   TCB+184                                                  02508000
TCBJSCBB EQU   TCBJSCB+1                                                02509000
@NM00021 EQU   TCBRECDE                                                 02510000
TCBREC   EQU   TCBRECDE                                                 02511000
TCBMDIDS EQU   TCB+176                                                  02512000
TCBNDINT EQU   TCBNDSP3                                                 02513000
TCBRSV27 EQU   TCBNDSP3                                                 02514000
TCBRSV26 EQU   TCBNDSP3                                                 02515000
TCBRSV25 EQU   TCBNDSP3                                                 02516000
TCBRSV24 EQU   TCBNDSP3                                                 02517000
TCBSRBND EQU   TCBNDSP3                                                 02518000
TCBRV302 EQU   TCBNDSP3                                                 02519000
TCBLJSND EQU   TCBNDSP3                                                 02520000
TCBABE   EQU   TCBNDSP2                                                 02521000
TCBDSS   EQU   TCBNDSP2                                                 02522000
TCBOWAIT EQU   TCBNDSP2                                                 02523000
TCBIWAIT EQU   TCBNDSP2                                                 02524000
TCBNDTS  EQU   TCBNDSP2                                                 02525000
TCBNDSVC EQU   TCBNDSP2                                                 02526000
TCBSTPP  EQU   TCBNDSP2                                                 02527000
TCBABD   EQU   TCBNDSP2                                                 02528000
TCBRSV22 EQU   TCBNDSP1                                                 02529000
TCBPIEND EQU   TCBNDSP1                                                 02530000
TCBTPSP  EQU   TCBNDSP1                                                 02531000
TCBDDRND EQU   TCBNDSP1                                                 02532000
TCBRSPND EQU   TCBNDSP1                                                 02533000
TCBRSTND EQU   TCBNDSP1                                                 02534000
TCBDARPN EQU   TCBNDSP1                                                 02535000
TCBDARTN EQU   TCBNDSP1                                                 02536000
TCBNDSP0 EQU   TCBNDSP                                                  02537000
TCBUSER  EQU   TCB+168                                                  02538000
TCBTCTB  EQU   TCBTCT+1                                                 02539000
TCBRSV9C EQU   TCBTCTGF                                                 02540000
TCBRSV9B EQU   TCBTCTGF                                                 02541000
TCBRSV9A EQU   TCBTCTGF                                                 02542000
TCBRSV99 EQU   TCBTCTGF                                                 02543000
TCBRSV98 EQU   TCBTCTGF                                                 02544000
TCBRSV97 EQU   TCBTCTGF                                                 02545000
TCBRSV20 EQU   TCBTCTGF                                                 02546000
TCBSMFGF EQU   TCBTCTGF                                                 02547000
TCBSTABB EQU   TCBSTAB+1                                                02548000
TCBSTCUR EQU   TCBNSTAE                                                 02549000
TCBRV301 EQU   TCBNSTAE                                                 02550000
TCBSYNCH EQU   TCBNSTAE                                                 02551000
TCBHALT  EQU   TCBNSTAE                                                 02552000
TCBPPSUP EQU   TCBNSTAE                                                 02553000
TCB33E   EQU   TCBNSTAE                                                 02554000
TCBQUIES EQU   TCBNSTAE                                                 02555000
TCBSTABE EQU   TCBNSTAE                                                 02556000
TCBAQE   EQU   TCB+156                                                  02557000
TCBPQE   EQU   TCB+152                                                  02558000
TCBTSDP  EQU   TCB+151                                                  02559000
TCBTSLP  EQU   TCB+150                                                  02560000
TCBSTPCT EQU   TCB+149                                                  02561000
TCBCPUBN EQU   TCBTSFLG                                                 02562000
TCBDYDSP EQU   TCBTSFLG                                                 02563000
TCBRSV18 EQU   TCBTSFLG                                                 02564000
TCBRSV17 EQU   TCBTSFLG                                                 02565000
TCBTIOTG EQU   TCBTSFLG                                                 02566000
TCBATT   EQU   TCBTSFLG                                                 02567000
TCBSTPPR EQU   TCBTSFLG                                                 02568000
TCBRV300 EQU   TCBTSTSK                                                 02569000
TCBECB   EQU   TCB+144                                                  02570000
TCBIQE   EQU   TCB+140                                                  02571000
TCBLTC   EQU   TCB+136                                                  02572000
TCBOTC   EQU   TCB+132                                                  02573000
TCBNTC   EQU   TCB+128                                                  02574000
TCBJSTCA EQU   TCBJSTCB+1                                               02575000
TCBRSV16 EQU   TCBJSTCB                                                 02576000
TCBTQET  EQU   TCBTME                                                   02577000
TCBTCB   EQU   TCB+116                                                  02578000
TCBFSAB  EQU   TCBFSA+1                                                 02579000
TCBQEL   EQU   TCBFSA                                                   02580000
TCBGRS15 EQU   TCBGRS+60                                                02581000
TCBGRS14 EQU   TCBGRS+56                                                02582000
TCBGRS13 EQU   TCBGRS+52                                                02583000
TCBGRS12 EQU   TCBGRS+48                                                02584000
TCBGRS11 EQU   TCBGRS+44                                                02585000
TCBGRS10 EQU   TCBGRS+40                                                02586000
TCBGRS9  EQU   TCBGRS+36                                                02587000
TCBGRS8  EQU   TCBGRS+32                                                02588000
TCBGRS7  EQU   TCBGRS+28                                                02589000
TCBGRS6  EQU   TCBGRS+24                                                02590000
TCBGRS5  EQU   TCBGRS+20                                                02591000
TCBGRS4  EQU   TCBGRS+16                                                02592000
TCBGRS3  EQU   TCBGRS+12                                                02593000
TCBGRS2  EQU   TCBGRS+8                                                 02594000
TCBGRS1  EQU   TCBGRS+4                                                 02595000
TCBGRS0  EQU   TCBGRS                                                   02596000
TCBJPQB  EQU   TCBJPQ+1                                                 02597000
TCBRSV15 EQU   TCBPURGE                                                 02598000
TCBRSV14 EQU   TCBPURGE                                                 02599000
TCBRSV13 EQU   TCBPURGE                                                 02600000
TCBRSV12 EQU   TCBPURGE                                                 02601000
TCBRSV11 EQU   TCBPURGE                                                 02602000
TCBRSV10 EQU   TCBPURGE                                                 02603000
TCBRSV09 EQU   TCBPURGE                                                 02604000
TCBJPQF  EQU   TCBPURGE                                                 02605000
TCBJLB   EQU   TCB+40                                                   02606000
TCBLLS   EQU   TCB+36                                                   02607000
TCBDSP   EQU   TCB+35                                                   02608000
TCBLMP   EQU   TCB+34                                                   02609000
TCBPNDSP EQU   TCBFLGS5                                                 02610000
TCBFCD1  EQU   TCBFLGS5                                                 02611000
TCBSTP   EQU   TCBFLGS5                                                 02612000
TCBSYS   EQU   TCBFLGS5                                                 02613000
TCBANDSP EQU   TCBFLGS5                                                 02614000
TCBPAGE  EQU   TCBFLGS5                                                 02615000
TCBUXNDF EQU   TCBABWF                                                  02616000
TCBFC    EQU   TCBFLGS5                                                 02617000
TCBONDSP EQU   TCBFLGS4                                                 02618000
TCBMPCND EQU   TCBFLGS4                                                 02619000
TCBMPCVQ EQU   TCBFLGS4                                                 02620000
TCBUXNDV EQU   TCBFLGS4                                                 02621000
TCBHNDSP EQU   TCBFLGS4                                                 02622000
TCBRQENA EQU   TCBFLGS4                                                 02623000
TCBSER   EQU   TCBFLGS4                                                 02624000
TCBNDUMP EQU   TCBFLGS4                                                 02625000
TCBDWSTA EQU   TCBFLGS3                                                 02626000
TCBRSV08 EQU   TCBFLGS3                                                 02627000
TCBRSV07 EQU   TCBFLGS3                                                 02628000
TCBRSV06 EQU   TCBFLGS3                                                 02629000
TCBABGM  EQU   TCBFLGS3                                                 02630000
TCBABTRM EQU   TCBFLGS3                                                 02631000
TCBADINP EQU   TCBFLGS3                                                 02632000
TCBFSM   EQU   TCBFLGS3                                                 02633000
TCBFTS   EQU   TCBFLGS2                                                 02634000
TCBFETXR EQU   TCBFLGS2                                                 02635000
TCBFDSOP EQU   TCBFLGS2                                                 02636000
TCBFJMC  EQU   TCBFLGS2                                                 02637000
TCBFSMC  EQU   TCBFLGS2                                                 02638000
TCBFABOP EQU   TCBFLGS2                                                 02639000
TCBFSTI  EQU   TCBFLGS2                                                 02640000
TCBFOINP EQU   TCBFLGS2                                                 02641000
TCBFX    EQU   TCBFLGS1                                                 02642000
TCBFS    EQU   TCBFLGS1                                                 02643000
TCBFT    EQU   TCBFLGS1                                                 02644000
TCBPDUMP EQU   TCBFLGS1                                                 02645000
TCBNONPR EQU   TCBFLGS1                                                 02646000
TCBFERA  EQU   TCBFLGS1                                                 02647000
TCBFE    EQU   TCBFLGS1                                                 02648000
TCBFA    EQU   TCBFLGS1                                                 02649000
TCBZERO  EQU   TCBPKF                                                   02650000
TCBFLAG  EQU   TCBPKF                                                   02651000
TCBMSSB  EQU   TCBMSS+1                                                 02652000
TCBRSV03 EQU   TCBMSS                                                   02653000
TCBTRNB  EQU   TCBTRN+1                                                 02654000
TCBRSV02 EQU   TCBABF                                                   02655000
TCBOLTEP EQU   TCBABF                                                   02656000
TCBTCP   EQU   TCBABF                                                   02657000
TCBTCPP  EQU   TCBABF                                                   02658000
TCBRSV01 EQU   TCBABF                                                   02659000
TCBGRPH  EQU   TCBABF                                                   02660000
TCBNOCHK EQU   TCBABF                                                   02661000
TCBMOD91 EQU   TCBABF                                                   02662000
TCBCMPC  EQU   TCBCMP+1                                                 02663000
TCBRV318 EQU   TCBCMSG                                                  02664000
TCBRV317 EQU   TCBCIND                                                  02665000
TCBRV316 EQU   TCBCWTO                                                  02666000
TCBCASID EQU   TCBCDBL                                                  02667000
TCBNOCC  EQU   TCBSTCC                                                  02668000
TCBDMPO  EQU   TCBCPP                                                   02669000
TCBCSTEP EQU   TCBCMPF                                                  02670000
TCBCREQ  EQU   TCBCMPF                                                  02671000
TCBTIO   EQU   TCB+12                                                   02672000
TCBDEB   EQU   TCB+8                                                    02673000
TCBPIEA  EQU   TCBPIE+1                                                 02674000
TCBPM    EQU   TCBPMASK                                                 02675000
@NM00020 EQU   TCBPMASK                                                 02676000
TCBRBP   EQU   TCB                                                      02677000
TCBFRS6  EQU   TCBFRS+24                                                02678000
TCBFRS4  EQU   TCBFRS+16                                                02679000
TCBFRS2  EQU   TCBFRS+8                                                 02680000
TCBFRS0  EQU   TCBFRS                                                   02681000
JSCBCSCB EQU   JSCBSEC1+68                                              02682000
JSCBPMG  EQU   JSCBWTP+2                                                02683000
JSCBWTSP EQU   JSCBWTP+1                                                02684000
JSCRSV23 EQU   JSCBWTFG                                                 02685000
JSCRSV22 EQU   JSCBWTFG                                                 02686000
JSCRSV21 EQU   JSCBWTFG                                                 02687000
JSCRSV20 EQU   JSCBWTFG                                                 02688000
JSCRSV19 EQU   JSCBWTFG                                                 02689000
JSCRSV18 EQU   JSCBWTFG                                                 02690000
JSCBRET  EQU   JSCBWTFG                                                 02691000
JSCBIOFG EQU   JSCBWTFG                                                 02692000
@NM00017 EQU   JSCBSEC1+60                                              02693000
JSCBQMPI EQU   JSCBSEC1+56                                              02694000
JSCBPMSG EQU   JSCBSWT1                                                 02695000
JSCRSV16 EQU   JSCBSWT1                                                 02696000
JSCRSV15 EQU   JSCBSWT1                                                 02697000
JSCRSV14 EQU   JSCBSWT1                                                 02698000
JSCRSV13 EQU   JSCBSWT1                                                 02699000
JSCRSV12 EQU   JSCBSWT1                                                 02700000
JSCRSV11 EQU   JSCBSWT1                                                 02701000
JSCBPASS EQU   JSCBSWT1                                                 02702000
JSCBTTTR EQU   JSCBSEC1+52                                              02703000
JSCRSV10 EQU   JSCBSEC1+49                                              02704000
JSCBAUTH EQU   JSCBOPTS                                                 02705000
JSCSIOTS EQU   JSCBOPTS                                                 02706000
JSCRSV08 EQU   JSCBOPTS                                                 02707000
JSCRSV07 EQU   JSCBOPTS                                                 02708000
JSCRSV06 EQU   JSCBOPTS                                                 02709000
JSCBLONG EQU   JSCBOPTS                                                 02710000
JSCRSV05 EQU   JSCBOPTS                                                 02711000
JSCRSV04 EQU   JSCBOPTS                                                 02712000
JSCBSECB EQU   JSCBSEC1+44                                              02713000
JSCRSV03 EQU   JSCBSEC1+41                                              02714000
JSCBSTEP EQU   JSCBSEC1+40                                              02715000
JSCBDCBA EQU   JSCBDCB+1                                                02716000
JSCRSV02 EQU   JSCBDCB                                                  02717000
JSCBID   EQU   JSCBSEC1+32                                              02718000
JSCBDBTB EQU   JSCBSEC1+28                                              02719000
JSCBIJSC EQU   JSCBSEC1+24                                              02720000
JSCBTCBP EQU   JSCBSEC1+20                                              02721000
JSCBPCC  EQU   JSCBSEC1+16                                              02722000
JSCBTCP  EQU   JSCBSEC1+12                                              02723000
JSCBSHR  EQU   JSCBSEC1+8                                               02724000
JSCHPCEA EQU   JSCHPCE+1                                                02725000
JSCRSV32 EQU   JSCHPCE                                                  02726000
JSCRSV01 EQU   JSCBSEC1                                                 02727000
@NM00016 EQU   IEZJSCB                                                  02728000
VEXASID  EQU   VMVEPRMS+198                                             02729000
@NM00015 EQU   VEXFLAGS                                                 02730000
VEXMVCAF EQU   VEXFLAGS                                                 02731000
VEXMVCAP EQU   VMVEPRMS+192                                             02732000
VMVEAUTO EQU   VMVEPRMS                                                 02733000
PRMWTOID EQU   PRMESTAE+292                                             02734000
PRMNELM  EQU   PRMESTAE+288                                             02735000
PRMDSQF  EQU   PRMESTAE+284                                             02736000
PRMDSQL  EQU   PRMESTAE+280                                             02737000
PRMQDBP  EQU   PRMESTAE+276                                             02738000
PRMQMBP  EQU   PRMESTAE+272                                             02739000
PRMQMBLN EQU   PRMESTAE+268                                             02740000
PRMQMGP  EQU   PRMESTAE+264                                             02741000
PRMUCBP  EQU   PRMESTAE+260                                             02742000
PRMSIOTP EQU   PRMESTAE+256                                             02743000
PRMASID  EQU   PRMESTAE+254                                             02744000
@NM00014 EQU   PRMFUNC                                                  02745000
VMVCALL  EQU   PRMFUNC                                                  02746000
FREECORE EQU   PRMFUNC                                                  02747000
TIOTBLT  EQU   PRMFUNC                                                  02748000
DSABCHN  EQU   PRMFUNC                                                  02749000
UPDSABCK EQU   PRMFUNC                                                  02750000
GENCLNUP EQU   PRMFUNC                                                  02751000
@NM00013 EQU   PRMRESC                                                  02752000
MLWTO    EQU   PRMRESC                                                  02753000
TPQ      EQU   PRMRESC                                                  02754000
DSSUNREC EQU   PRMRESC                                                  02755000
DSSTAP   EQU   PRMRESC                                                  02756000
CHNGQ    EQU   PRMRESC                                                  02757000
DDRQ     EQU   PRMRESC                                                  02758000
ENQQ4    EQU   PRMRESC                                                  02759000
@NM00012 EQU   PRMESTAE                                                 02760000
@NM00011 EQU   PROCESSW+1                                               02761000
DYNMSSOK EQU   PROCESSW+1                                               02762000
HSKPDQSW EQU   PROCESSW+1                                               02763000
DISMSGSW EQU   PROCESSW+1                                               02764000
EPALSISW EQU   PROCESSW+1                                               02765000
EPASCTSW EQU   PROCESSW+1                                               02766000
EPAJCTSW EQU   PROCESSW                                                 02767000
DCBSPCSW EQU   PROCESSW                                                 02768000
NQEXCLSW EQU   PROCESSW                                                 02769000
UNALOCSW EQU   ERRPROSW                                                 02770000
DEQDSNSW EQU   ERRPROSW                                                 02771000
COPYSW   EQU   PROCESSW                                                 02772000
DYNMSSTM EQU   PROCESSW                                                 02773000
@NM00010 EQU   INPUTSW+3                                                02774000
PCATINIT EQU   INPUTSW+3                                                02775000
UNITDEVT EQU   INPUTSW+3                                                02776000
MOUNTSW  EQU   INPUTSW+2                                                02777000
CATLOGSW EQU   INPUTSW+2                                                02778000
TIOTNQSW EQU   INPUTSW+2                                                02779000
OFFLINSW EQU   INPUTSW+2                                                02780000
WTUNTSW  EQU   INPUTSW+2                                                02781000
NORESSW  EQU   INPUTSW+2                                                02782000
WTDSNSW  EQU   INPUTSW+2                                                02783000
WTVOLSW  EQU   INPUTSW+2                                                02784000
@NM00009 EQU   INPUTSW                                                  02785000
JOBRLSYS EQU   INPUTSW                                                  02786000
NOMONTSW EQU   INPUTSW                                                  02787000
NOCNVTSW EQU   INPUTSW                                                  02788000
ONCNVTSW EQU   INPUTSW                                                  02789000
@NM00008 EQU   DEPARMS+304                                              02790000
DETCTIOL EQU   DEPARMS+300                                              02791000
DETCTIOP EQU   DEPARMS+296                                              02792000
DETDQLST EQU   DEPARMS+280                                              02793000
DEALASTP EQU   DEPARMS+276                                              02794000
DEASGNP  EQU   DEDMYAS+12                                               02795000
@NM00007 EQU   DEDMYAS                                                  02796000
DEWLASTP EQU   DEPARMS+256                                              02797000
DEWRITP  EQU   DEDMYEPA+12                                              02798000
@NM00006 EQU   DEDMYEPA                                                 02799000
DEDSNQRC EQU   DENQRETN+4                                               02800000
DEDSNQEN EQU   DENQRETN                                                 02801000
DECPYLEN EQU   DEPARMS+228                                              02802000
DECPYLOC EQU   DEPARMS+224                                              02803000
DEJSCB   EQU   DEPARMS+220                                              02804000
DESCT    EQU   DEPARMS+216                                              02805000
DEJCT    EQU   DEPARMS+212                                              02806000
DESIOT   EQU   DEPARMS+208                                              02807000
DETCB    EQU   DEPARMS+204                                              02808000
DECORE   EQU   DEPARMS                                                  02809000
ASWAAUTO EQU   ASWA+32                                                  02810000
ASWRSV02 EQU   ASWAFLGS+1                                               02811000
ASWRSV01 EQU   ASWADSWS                                                 02812000
ASWAID   EQU   ASWA                                                     02813000
@NM00004 EQU   JAEXFLAG                                                 02814000
SOMEALC  EQU   JAEXFLAG                                                 02815000
JAEXEPAP EQU   JAEXPARM+264                                             02816000
JAEXLCTP EQU   JAEXPARM+256                                             02817000
JAEXAUTO EQU   JAEXPARM                                                 02818000
@NM00003 EQU   INITSAVE                                                 02819000
@NM00002 EQU   BB401SVE                                                 02820000
NEXTTCBP EQU   TWOTCBPS                                                 02821000
@NM00097 EQU   PSA+3668                                                 02822000
PSASTAK  EQU   PSA+3072                                                 02823000
@NM00096 EQU   PSA+1048                                                 02824000
PSAUSEND EQU   PSA+1048                                                 02825000
PSARV062 EQU   PSA+1044                                                 02826000
PSACDAL  EQU   PSA+1040                                                 02827000
PSAWTCOD EQU   PSA+1036                                                 02828000
PSAATCVT EQU   PSA+1032                                                 02829000
PSAPCPSW EQU   PSA+1024                                                 02830000
PSAPIR2  EQU   PSA+1020                                                 02831000
PSARV059 EQU   PSA+1018                                                 02832000
PSASVC13 EQU   PSA+1016                                                 02833000
PSALSFCC EQU   PSA+1012                                                 02834000
PSASFACC EQU   PSA+1008                                                 02835000
PSASTOP  EQU   PSA+992                                                  02836000
PSASTART EQU   PSA+976                                                  02837000
PSARSPSW EQU   PSA+968                                                  02838000
PSASRPSW EQU   PSA+960                                                  02839000
PSARV045 EQU   PSA+892                                                  02840000
PSARV044 EQU   PSA+888                                                  02841000
PSARV043 EQU   PSA+884                                                  02842000
PSARV042 EQU   PSA+880                                                  02843000
PSARV041 EQU   PSA+876                                                  02844000
PSARV040 EQU   PSA+872                                                  02845000
PSARV025 EQU   PSA+868                                                  02846000
PSADSSED EQU   PSA+868                                                  02847000
PSADSSPR EQU   PSA+864                                                  02848000
PSADSSFW EQU   PSA+860                                                  02849000
PSADSS14 EQU   PSA+856                                                  02850000
PSADSSPP EQU   PSA+848                                                  02851000
PSADSSRP EQU   PSA+840                                                  02852000
PSADSS05 EQU   PSADSSF4                                                 02853000
PSADSS10 EQU   PSADSSF4                                                 02854000
PSADSSVE EQU   PSADSSF4                                                 02855000
PSADSSDE EQU   PSADSSF4                                                 02856000
PSADSSC0 EQU   PSADSSF4                                                 02857000
PSADSSIE EQU   PSADSSF4                                                 02858000
PSADSS12 EQU   PSADSSF4                                                 02859000
PSADSSRC EQU   PSADSSF4                                                 02860000
PSARV057 EQU   PSADSSF3                                                 02861000
PSARV056 EQU   PSADSSF3                                                 02862000
PSARV055 EQU   PSADSSF3                                                 02863000
PSADSSMC EQU   PSADSSF3                                                 02864000
PSADSSRW EQU   PSADSSF3                                                 02865000
PSADSSNM EQU   PSADSSF3                                                 02866000
PSADSSES EQU   PSADSSF3                                                 02867000
PSADSSGP EQU   PSADSSF3                                                 02868000
PSADSSF2 EQU   PSADSSFL+1                                               02869000
PSADSSPI EQU   PSADSSF1                                                 02870000
PSADSSOI EQU   PSADSSF1                                                 02871000
PSADSSSP EQU   PSADSSF1                                                 02872000
PSADSSTP EQU   PSADSSF1                                                 02873000
PSADSSDW EQU   PSADSSF1                                                 02874000
PSADSSDD EQU   PSADSSF1                                                 02875000
PSADSSDM EQU   PSADSSF1                                                 02876000
PSADSSMV EQU   PSADSSF1                                                 02877000
PSADSSTS EQU   PSA+816                                                  02878000
PSADSSWK EQU   PSA+812                                                  02879000
PSADSSR3 EQU   PSA+808                                                  02880000
PSADSSR2 EQU   PSA+804                                                  02881000
PSADSSRS EQU   PSA+800                                                  02882000
PSASTOR  EQU   PSA+796                                                  02883000
PSACPUSA EQU   PSA+794                                                  02884000
PSAVSTAP EQU   PSA+792                                                  02885000
PSAWKVAP EQU   PSA+788                                                  02886000
PSAWKRAP EQU   PSA+784                                                  02887000
PSAMCHIC EQU   PSA+783                                                  02888000
PSARV061 EQU   PSA+782                                                  02889000
PSASYMSK EQU   PSA+781                                                  02890000
PSAMCHFL EQU   PSA+780                                                  02891000
PSACR0   EQU   PSA+776                                                  02892000
PSAPSWSV EQU   PSA+768                                                  02893000
PSALITA  EQU   PSA+764                                                  02894000
PSACLHS  EQU   PSAHLHI                                                  02895000
PSALKR15 EQU   PSALKSA+60                                               02896000
PSALKR14 EQU   PSALKSA+56                                               02897000
PSALKR13 EQU   PSALKSA+52                                               02898000
PSALKR12 EQU   PSALKSA+48                                               02899000
PSALKR11 EQU   PSALKSA+44                                               02900000
PSALKR10 EQU   PSALKSA+40                                               02901000
PSALKR9  EQU   PSALKSA+36                                               02902000
PSALKR8  EQU   PSALKSA+32                                               02903000
PSALKR7  EQU   PSALKSA+28                                               02904000
PSALKR6  EQU   PSALKSA+24                                               02905000
PSALKR5  EQU   PSALKSA+20                                               02906000
PSALKR4  EQU   PSALKSA+16                                               02907000
PSALKR3  EQU   PSALKSA+12                                               02908000
PSALKR2  EQU   PSALKSA+8                                                02909000
PSALKR1  EQU   PSALKSA+4                                                02910000
PSALKR0  EQU   PSALKSA                                                  02911000
PSARV023 EQU   PSACLHT+52                                               02912000
PSALOCAL EQU   PSACLHT+48                                               02913000
PSACMSL  EQU   PSACLHT+44                                               02914000
PSAOPTL  EQU   PSACLHT+40                                               02915000
PSATPACL EQU   PSACLHT+36                                               02916000
PSATPDNL EQU   PSACLHT+32                                               02917000
PSATPNCL EQU   PSACLHT+28                                               02918000
PSAIOSLL EQU   PSACLHT+24                                               02919000
PSAIOSUL EQU   PSACLHT+20                                               02920000
PSAIOSCL EQU   PSACLHT+16                                               02921000
PSAIOSSL EQU   PSACLHT+12                                               02922000
PSASALCL EQU   PSACLHT+8                                                02923000
PSAASML  EQU   PSACLHT+4                                                02924000
PSADISPL EQU   PSACLHT                                                  02925000
PSASRSA  EQU   PSA+636                                                  02926000
PSARV050 EQU   PSA+634                                                  02927000
PSADSSGO EQU   PSA+633                                                  02928000
PSARECUR EQU   PSA+632                                                  02929000
PSAHLHIS EQU   PSA+628                                                  02930000
PSAIPCSA EQU   PSA+624                                                  02931000
@NM00095 EQU   PSA+621                                                  02932000
PSAIPCDM EQU   PSA+620                                                  02933000
PSAIPCD  EQU   PSA+616                                                  02934000
@NM00094 EQU   PSA+613                                                  02935000
PSAIPCRM EQU   PSA+612                                                  02936000
PSAIPCR  EQU   PSA+608                                                  02937000
PSAMCHEX EQU   PSA+600                                                  02938000
PSAMPSW  EQU   PSA+592                                                  02939000
PSAEXPS2 EQU   PSA+584                                                  02940000
PSAEXPS1 EQU   PSA+576                                                  02941000
PSAPIREG EQU   PSA+572                                                  02942000
PSARSREG EQU   PSA+568                                                  02943000
PSAGPREG EQU   PSA+556                                                  02944000
PSARV022 EQU   PSASUP4                                                  02945000
PSARV021 EQU   PSASUP4                                                  02946000
PSARV020 EQU   PSASUP4                                                  02947000
PSARV019 EQU   PSASUP4                                                  02948000
PSARV018 EQU   PSASUP4                                                  02949000
PSARV017 EQU   PSASUP4                                                  02950000
PSARV016 EQU   PSASUP4                                                  02951000
PSARV015 EQU   PSASUP4                                                  02952000
PSARV014 EQU   PSASUP3                                                  02953000
PSAULCMS EQU   PSASUP3                                                  02954000
PSARV012 EQU   PSASUP3                                                  02955000
PSAESTA  EQU   PSASUP3                                                  02956000
PSASPR   EQU   PSASUP3                                                  02957000
PSAPSREG EQU   PSASUP3                                                  02958000
PSAPI2   EQU   PSASUP3                                                  02959000
PSAIOSUP EQU   PSASUP3                                                  02960000
PSALCR   EQU   PSASUP2                                                  02961000
PSARTM   EQU   PSASUP2                                                  02962000
PSAACR   EQU   PSASUP2                                                  02963000
PSAIPCE2 EQU   PSASUP2                                                  02964000
PSAIPCES EQU   PSASUP2                                                  02965000
PSAIPCEC EQU   PSASUP2                                                  02966000
PSAGTF   EQU   PSASUP2                                                  02967000
PSAIPCRI EQU   PSASUP2                                                  02968000
PSATYPE6 EQU   PSASUP1                                                  02969000
PSATCTL  EQU   PSASUP1                                                  02970000
PSADISP  EQU   PSASUP1                                                  02971000
PSALOCK  EQU   PSASUP1                                                  02972000
PSAPI    EQU   PSASUP1                                                  02973000
PSAEXT   EQU   PSASUP1                                                  02974000
PSASVC   EQU   PSASUP1                                                  02975000
PSAIO    EQU   PSASUP1                                                  02976000
PSAANEW  EQU   PSA+544                                                  02977000
PSATOLD  EQU   PSA+540                                                  02978000
PSATNEW  EQU   PSA+536                                                  02979000
PSALCCAR EQU   PSA+532                                                  02980000
PSALCCAV EQU   PSA+528                                                  02981000
PSAPCCAR EQU   PSA+524                                                  02982000
PSAPCCAV EQU   PSA+520                                                  02983000
PSACPULA EQU   PSA+518                                                  02984000
PSACPUPA EQU   PSA+516                                                  02985000
PSAPSA   EQU   PSA+512                                                  02986000
FLCHDEND EQU   PSA+512                                                  02987000
FLCCRSAV EQU   FLCMCLA+280                                              02988000
FLCGRSAV EQU   FLCMCLA+216                                              02989000
FLCFPSAV EQU   FLCMCLA+184                                              02990000
FLCFLA   EQU   FLCMCLA+88                                               02991000
FLCRGNCD EQU   FLCMCLA+84                                               02992000
FLCFSAA  EQU   FLCFSA+1                                                 02993000
@NM00093 EQU   FLCFSA                                                   02994000
@NM00092 EQU   FLCMCLA+72                                               02995000
FLCMCIC  EQU   FLCMCLA+64                                               02996000
@NM00091 EQU   FLCMCLA+20                                               02997000
FLCIOAA  EQU   FLCIOA+1                                                 02998000
@NM00090 EQU   FLCIOA                                                   02999000
@NM00089 EQU   FLCMCLA+15                                               03000000
@NM00088 EQU   FLCMCLA+14                                               03001000
@NM00087 EQU   FLCMCLA+12                                               03002000
FLCLCL   EQU   FLCMCLA+8                                                03003000
FLCIOELA EQU   FLCIOEL+1                                                03004000
@NM00086 EQU   FLCIOEL                                                  03005000
FLCCHNID EQU   FLCMCLA                                                  03006000
@NM00085 EQU   PSA+160                                                  03007000
FLCMTRCD EQU   PSA+157                                                  03008000
@NM00084 EQU   PSA+156                                                  03009000
FLCPERA  EQU   FLCPER+1                                                 03010000
@NM00083 EQU   FLCPER                                                   03011000
@NM00082 EQU   PSA+151                                                  03012000
FLCPERCD EQU   PSA+150                                                  03013000
FLCMCNUM EQU   PSA+149                                                  03014000
@NM00081 EQU   PSA+148                                                  03015000
FLCTEAA  EQU   FLCTEA+1                                                 03016000
@NM00080 EQU   FLCTEA                                                   03017000
PSAPIPC  EQU   PSAPICOD                                                 03018000
PSAPIMC  EQU   PSAPICOD                                                 03019000
PSAPIPER EQU   PSAPICOD                                                 03020000
PSARV049 EQU   FLCPICOD                                                 03021000
FLCPILCB EQU   FLCPIILC                                                 03022000
@NM00079 EQU   FLCPIILC                                                 03023000
@NM00078 EQU   PSAEPPSW                                                 03024000
FLCSVCN  EQU   PSAESPSW+2                                               03025000
FLCSILCB EQU   FLCSVILC                                                 03026000
@NM00077 EQU   FLCSVILC                                                 03027000
@NM00076 EQU   PSAESPSW                                                 03028000
FLCEICOD EQU   PSAEEPSW+2                                               03029000
PSASPAD  EQU   PSAEEPSW                                                 03030000
@NM00075 EQU   PSA+128                                                  03031000
FLCINPSW EQU   PSA+120                                                  03032000
FLCMNPSW EQU   PSA+112                                                  03033000
FLCPNPSW EQU   PSA+104                                                  03034000
FLCSNPSW EQU   PSA+96                                                   03035000
FLCENPSW EQU   PSA+88                                                   03036000
FLCTRACE EQU   PSA+84                                                   03037000
FLCTIMER EQU   PSA+80                                                   03038000
FLCCVT2  EQU   PSA+76                                                   03039000
FLCCAW   EQU   PSA+72                                                   03040000
FLCCSW   EQU   PSA+64                                                   03041000
FLCIOPSW EQU   PSA+56                                                   03042000
FLCMOPSW EQU   PSA+48                                                   03043000
FLCPOPSW EQU   PSA+40                                                   03044000
FLCSOPSW EQU   PSA+32                                                   03045000
FLCEOPSW EQU   PSA+24                                                   03046000
@NM00074 EQU   FLCICCW2+4                                               03047000
FLCCVT   EQU   FLCICCW2                                                 03048000
FLCICCW1 EQU   FLCROPSW                                                 03049000
FLCIPPSW EQU   FLCRNPSW                                                 03050000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03051000
@RC00221 EQU   @RC00148                                                 03052000
@RC00207 EQU   @RC00148                                                 03053000
@RC00152 EQU   @RC00148                                                 03054000
@RC00163 EQU   @RC00152                                                 03055000
@ENDDATA EQU   *                                                        03056000
         END   IEFAB4ED,(C'PLS1955',0701,78006)                         03057000
