         TITLE 'IEFBB410 - INITIATOR/UNALLOCATION INTERFACE            *00001000
                        '                                               00002000
IEFBB410 CSECT ,                                                01S0001 00003000
@MAINENT DS    0H                                               01S0001 00004000
         USING *,@15                                            01S0001 00005000
         B     @PROLOG                                          01S0001 00006000
         DC    AL1(24)                                          01S0001 00007000
         DC    C'IEFBB410 77089  UZ09944 '                      01S0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00010000
         BALR  @11,0                                            01S0001 00011000
@PSTART  LA    @12,4095(,@11)                                   01S0001 00012000
         USING @PSTART,@11                                      01S0001 00013000
         USING @PSTART+4095,@12                                 01S0001 00014000
         L     @00,@SIZDATD                                     01S0001 00015000
         MODESET EXTKEY=SCHED,SAVEKEY=(2)                               00016000
         GSPACE   R,LV=(0)                                              00017000
         LR    @10,@01                                          01S0001 00018000
         USING @DATD,@10                                        01S0001 00019000
         ST    @13,@SA00001+4                                   01S0001 00020000
         STC   @02,@OLDKEY                                      01S0001 00021000
         MODESET KEYADDR=(2)                                            00022000
         LM    @00,@02,20(@13)                                  01S0001 00023000
         ST    @10,8(,@13)                                      01S0001 00024000
         LR    @13,@10                                          01S0001 00025000
         MODESET EXTKEY=ZERO                                            00026000
         MVC   @PC00001(4),0(@01)                               01S0001 00027000
         MODESET EXTKEY=SCHED                                           00028000
JSCBDISP EQU 188                                                        00029000
JSCBAOS1 EQU  72                                                        00030000
JSCBAOS2 EQU 192                                                        00031000
*PARMPTR = REG1;                       /* SET PARAMETER LIST BASE    */ 00032000
         ST    REG1,PARMPTR                                     01S0112 00033000
*/********************************************************************/ 00034000
*/*                                                                  */ 00035000
*/* SEGMENT NAME - B410INIT                                          */ 00036000
*/*                                                                  */ 00037000
*/* DESCRIPTIVE NAME - INITIALIZE FOR IEFBB410                       */ 00038000
*/*                                                                  */ 00039000
*/* FUNCTION -                                                       */ 00040000
*/*   THE FUNCTION OF THIS SEGMENT IS TO INITIALIZE FOR THE          */ 00041000
*/*   INITIATOR/UNALLOCATION ROUTINE AND FOR FURTHER UNALLOCATION    */ 00042000
*/*   PROCESSING. THE FUNCTIONS PERFORMED ARE:                       */ 00043000
*/*                                                                  */ 00044000
*/*   1. ESTABLISH AN ESTAE ENVIRONMENT                      @Z40FPPG*/ 00045000
*/*                                                                  */ 00046000
*/*   2. SET LCT AND JSCB FIELDS -                           @ZA00061*/ 00047000
*/*      THE JCT AND SCT POINTERS IN THE LCT ARE SET TO THE JCT AND  */ 00048000
*/*      SCT ADDRESS THAT WERE PASSED AS INPUT. THESE FIELD WILL BE  */ 00049000
*/*      USED BY IEFRPREP. THE SCT SVA IN THE JSCB IS USED   @ZA00061*/ 00050000
*/*      BY DYNAMIC ALLOC, WHICH MAY BE INVOKED DURING       @ZA00061*/ 00051000
*/*      UNALLOCATION.                                       @ZA00061*/ 00052000
*/*                                                                  */ 00053000
*/*   3. READ IN SWA CONTROL BLOCKS -                                */ 00054000
*/*      THE SWA READER ROUTINE IS INVOKED TO READ IN AND CHAIN ALL  */ 00055000
*/*      SIOTS, JFCBS, AND JFCBXS FOR THE STEP. IF THE ENVIRONMENT   */ 00056000
*/*      IS WARM START OR NO DATA SETS HAVE BEEN ALLOCATED,  @ZA02992*/ 00057000
*/*      THE SCT WILL BE USED TO READ THESE BLOCKS.          @ZA02992*/ 00058000
*/*      OTHERWISE THE DSABS WILL BE USED. THE SIOTS ARE READ@ZA02992*/ 00059000
*/*      EVEN WHEN NO DATA SETS HAVE BEEN ALLOCATED SO THAT  @ZA02992*/ 00060000
*/*      THERE WILL BE A VALID CHAIN FOR SCRATCH PROCESSING  @ZA02992*/ 00061000
*/*      DURING JOB UNALLOCATION. IF THE DSABS ARE           @ZA02992*/ 00062000
*/*      USED, THE 'LAST SIOT PTR' IN THE SCT IS UPDATED     @ZA01873*/ 00063000
*/*      TO POINT TO THE SIOT POINTED TO BY THE LAST DSAB ON @ZA01873*/ 00064000
*/*      THE CHAIN.                                          @ZA01873*/ 00065000
*/*      TO CUT DOWN ON THE USE OF GETMAIN FOR EPA'S, A      @ZM41392*/ 00066000
*/*      BLOCK OF CORE IS OBTAINED AND PASSED TO THE SWA     @ZM41392*/ 00067000
*/*      BLOCK READ ROUTINE.  ENOUGH CORE FOR 3 EPA'S PER    @ZM41392*/ 00068000
*/*      REQUEST (SIOT) IS OBTAINED.  IF THAT'S NOT ENOUGH,  @ZM41392*/ 00069000
*/*      MORE WILL BE OBTAINED BY THE SIOT READER AND        @ZM41392*/ 00070000
*/*      CHAINED TO THE FIRST BLOCK.                         @ZM41392*/ 00071000
*/*                                                                  */ 00072000
*/* ENTRY - IN-LINE SEGMENT                                          */ 00073000
*/*                                                                  */ 00074000
*/*   PURPOSE - SEE FUNCTION                                         */ 00075000
*/*                                                                  */ 00076000
*/*   INPUT -                                                        */ 00077000
*/*     LCT -                                                        */ 00078000
*/*       LCTJSCB - JSCB PTR                                         */ 00079000
*/*                                                                  */ 00080000
*/*     JCTPTR - JCT ADDRESS                                         */ 00081000
*/*     SCTPTR - SCT ADDRESS                                         */ 00082000
*/*                                                                  */ 00083000
*/* EXITS -                                                          */ 00084000
*/* 1 CONDITION - NORMAL                                             */ 00085000
*/*                                                                  */ 00086000
*/*   OUTPUT -                                                       */ 00087000
*/*     STEP ESTAE PARAMETER AREA                                    */ 00088000
*/*                                                                  */ 00089000
*/*     LCT                                                          */ 00090000
*/*       LCTJCTAD - JCT ADDRESS                                     */ 00091000
*/*       LCTSCTAD - SCT ADDRESS                                     */ 00092000
*/*                                                                  */ 00093000
*/*     FSIOTP - ADDRESS OF THE FIRST SIOT OR 0                      */ 00094000
*/*     FEPAPTR - ADDRESS OF THE FIRST EPA OR 0                      */ 00095000
*/*     LEPAPTR - ADDRESS OF THE LAST EPA OR 0                       */ 00096000
*/*                                                                  */ 00097000
*/*   RETURN CODE - 0                                                */ 00098000
*/*                                                                  */ 00099000
*/* 2 CONDITION - UNABLE TO ESTABLISH ESTAE ENVIRONMENT              */ 00100000
*/*                                                                  */ 00101000
*/*   OUTPUT -                                                       */ 00102000
*/*     FEPAPTR - SET TO ZERO TO INDICATE SWA BLOCKS NOT READ        */ 00103000
*/*     ESTAE ERROR REASON CODE SET                                  */ 00104000
*/*                                                                  */ 00105000
*/*   RETURN CODE - 4                                                */ 00106000
*/*                                                                  */ 00107000
*/********************************************************************/ 00108000
*CONDFAIL = OFF;                       /* INIT COND FAIL SW          */ 00109000
         NI    CONDFAIL,B'11101111'                             02S0113 00110000
*RETCODE = ZERO;                                                02S0114 00111000
         SLR   @15,@15                                          02S0114 00112000
         ST    @15,RETCODE                                      02S0114 00113000
*FUNC4FD = FUNC4FD && FUNC4FD;         /* CLEAR IEFAB4FD FUNCTION MAP*/ 00114000
         XC    FUNC4FD(1),FUNC4FD                               02S0115 00115000
*WTPONLY = ON;                         /* INIT FUNC MAP FOR WTP FUNC */ 00116000
         OI    WTPONLY,B'00100000'                              02S0116 00117000
*DO MSGCTR = ONE TO DIM(RESNCODE);     /* ZERO ALL RESN CODES        */ 00118000
         LA    MSGCTR,1                                         02S0117 00119000
@DL00117 DS    0H                                               02S0118 00120000
*  RESNCODE(MSGCTR) = ZERO;                                     02S0118 00121000
         LR    @03,MSGCTR                                       02S0118 00122000
         ALR   @03,@03                                          02S0118 00123000
         SLR   @15,@15                                          02S0118 00124000
         STH   @15,RESNCODE-2(@03)                              02S0118 00125000
*END;                                                           02S0119 00126000
         AH    MSGCTR,@CH00070                                  02S0119 00127000
         CH    MSGCTR,@CH00137                                  02S0119 00128000
         BNH   @DL00117                                         02S0119 00129000
*ESTAPTR = ADDR(ESTPARMS);             /* ADDR OF ESTAE PARM LIST    */ 00130000
         LA    @15,ESTPARMS                                     02S0120 00131000
         ST    @15,ESTAPTR                                      02S0120 00132000
*ESTUSERP = ESTUSERP && ESTUSERP;      /* CLEAR USER PARMS FIELD     */ 00133000
         XC    ESTUSERP(24,@15),ESTUSERP(@15)                   02S0121 00134000
*ESTALCTP = LCTPTR;                    /* ADDR OF LCT TO ESTAE PARMS */ 00135000
         L     @14,PARMPTR                                      02S0122 00136000
         L     @09,LCTPTR(,@14)                                 02S0122 00137000
         ST    @09,ESTALCTP(,@15)                               02S0122 00138000
*ESTAJCTP = JCTPTR;                    /* ADDR OF JCT TO ESTAE PARMS */ 00139000
         L     @08,JCTPTR(,@14)                                 02S0123 00140000
         ST    @08,ESTAJCTP(,@15)                               02S0123 00141000
*ESTASCTP = SCTPTR;                    /* ADDR OF SCT TO ESTAE PARMS */ 00142000
         L     @14,SCTPTR(,@14)                                 02S0124 00143000
         ST    @14,ESTASCTP(,@15)                               02S0124 00144000
*LCTJCTAD = JCTPTR;                    /* PUT JCT ADDRESS IN LCT     */ 00145000
         ST    @08,LCTJCTAD(,@09)                               02S0125 00146000
*LCTSCTAD = SCTPTR;                    /* PUT SCT ADDRESS IN LCT     */ 00147000
         ST    @14,LCTSCTAD(,@09)                               02S0126 00148000
*LCTSCTVA = SCTDISKA;                  /* SET LCT TTR OF SCT         */ 00149000
         SLR   @08,@08                                          02S0127 00150000
         ICM   @08,7,SCTDISKA(@14)                              02S0127 00151000
         STCM  @08,7,LCTSCTVA(@09)                              02S0127 00152000
* DO; /*MODESET  KEYADDR(ZERO)*/                                02S0128 00153000
*   SPKA (ZERO); /*SET PSW KEY*/                                02S0129 00154000
         SLR   @01,@01                                          02S0129 00155000
         SPKA  0(@01)                                           02S0129 00156000
* END; /*MODESET  KEYADDR(ZERO)*/               /* TO CHANGE JSCB     @ 00157000
*A00061*/                                                       02S0130 00158000
*JSCSCTP = SCTDISKA;                   /* SCT SVA INTO JSCB  @ZA00061*/ 00159000
         L     @09,LCTJSCB(,@09)                                02S0131 00160000
         STCM  @08,7,JSCSCTP(@09)                               02S0131 00161000
* DO; /*MODESET  EXTKEY(SCHED)*/                                02S0132 00162000
*   SPKA (16); /*SET PSW KEY*/                                  02S0133 00163000
         LA    @05,16                                           02S0133 00164000
         SPKA  0(@05)                                           02S0133 00165000
* END; /*MODESET  EXTKEY(SCHED)*/               /* BACK TO SCHED KEY  @ 00166000
*A00061*/                                                       02S0134 00167000
*FEPBLKP = ZERO;                       /* INIT EPA BLK PTR   @ZM41392*/ 00168000
         ST    @01,FEPBLKP                                      02S0135 00169000
*SWARDRET = SWARDRET && SWARDRET;      /* ZERO OUT SWA RETURN INFO   */ 00170000
         XC    SWARDRET(12),SWARDRET                            02S0136 00171000
*/********************************************************************/ 00172000
*/*                                                                  */ 00173000
*/* THIS SEGMENT IS ADDED FOR REL4 ALLOCATION PERFORMANCE _  @Z40FPPG*/ 00174000
*/* ESTAE                                                    @Z40FPPG*/ 00175000
*/*                                                                  */ 00176000
*/* SEGMENT NAME - ESTAECOD                                          */ 00177000
*/*                                                                  */ 00178000
*/* DESCRIPTIVE NAME - ESTAE CODE                                    */ 00179000
*/*                                                                  */ 00180000
*/* FUNCTION - SET UP THE APPROPRIATE ESTAE ENVIRONMENT              */ 00181000
*/*                                                                  */ 00182000
*/* OPERATION -                                                      */ 00183000
*/*          . AN ALLOCATION STAE WORK AREA (ASWA) IS FILLED         */ 00184000
*/*            IN. THIS ALLOWS THE ALLOCATION COMMON ESTAE           */ 00185000
*/*            EXIT (IEFAB4ED) TO ROUTE CONTROL TO THE OTHER         */ 00186000
*/*            APPROPRIATE EXIT ROUTINES FOR SPECIFIC                */ 00187000
*/*            RECOVERY PROCESSING.                                  */ 00188000
*/*          . ESTAE IS ISSUED, THE ASWA BUILT BECOMES THE FIRST     */ 00189000
*/*            BY THE COMMON ESTAE EXIT, AND MUST PROVIDE THE        */ 00190000
*/*            AUTOMATIC CORE FOR THE DATA THAT ROUTINE USES.        */ 00191000
*/*            NOTE THAT THE STAE CONTROL BLOCK                      */ 00192000
*/*            ADDRESS IN THE ASWA IS NOT UPDATED UNTIL              */ 00193000
*/*            AFTER THE ESTAE IS ISSUED SO THAT IT REFLECTS         */ 00194000
*/*            THE CURRENT ONE.                                      */ 00195000
*/*          . THE ADDRESS OF THE NEW ASWA IS PLACED IN              */ 00196000
*/*            THE JSCB AS THE LAST ONE IN THE CHAIN FOR THE         */ 00197000
*/*            CURRENT ALLOCATION ESTAE                              */ 00198000
*/*                                                                  */ 00199000
*/* ENTRY - INLINE SUBROUTINE ENTERED AT THE TOP                     */ 00200000
*/*                                                                  */ 00201000
*/*   PURPOSE - SEE FUNCTION                                         */ 00202000
*/*                                                                  */ 00203000
*/*   INPUT -                                                        */ 00204000
*/*        .RETCODE - RETURN CODE - ZERO ON ENTRY                    */ 00205000
*/*        .ESTPARMS - STEP UNALLOC ESTAE PARMS                      */ 00206000
*/*                                                                  */ 00207000
*/* EXIT - INLINE SUBROUTINE THAT EXITS AT THE BOTTOM                */ 00208000
*/*                                                                  */ 00209000
*/*   CONDITION - ESTAE SETUP COMPLETED                              */ 00210000
*/*                                                                  */ 00211000
*/*   OUTPUT -                                                       */ 00212000
*/*           .ASWA - FILLED IN AND PLACED ON THE CHAIN              */ 00213000
*/*           .JSCBASWA - POINTS TO ASWA AS LAST ON CHAIN            */ 00214000
*/*                                                                  */ 00215000
*/*   RETURN CODES - RETCODE HAS ESTAE RETURN CODE                   */ 00216000
*/*                                                                  */ 00217000
*/********************************************************************/ 00218000
*ASWAPTR = ADDR(ASWACORE);             /*ADDRESS ASWA CORE   @Z40FPPG*/ 00219000
         LA    ASWAPTR,ASWACORE                                 03S0137 00220000
*ASWA = ASWA && ASWA;                  /*ZERO OUT ASWA       @Z40FPPG*/ 00221000
         XC    ASWA(40,ASWAPTR),ASWA(ASWAPTR)                   03S0138 00222000
*ASWAID =CHARASWA;                     /*FILL IN BLOCK ID    @Z40FPPG*/ 00223000
         MVC   ASWAID(4,ASWAPTR),@CC00237                       03S0139 00224000
*ASWACSCT = EXITCSCT;                  /*CSECT NAME OF EXIT  @Z40FPPG*/ 00225000
         MVC   ASWACSCT(8,ASWAPTR),@CC00245                     03S0140 00226000
*ASWARTNP = ADDR(IEFAB4DD);            /*ADDRESS OF EXIT RTN @Z40FPPG*/ 00227000
         L     @05,@CV00283                                     03S0141 00228000
         ST    @05,ASWARTNP(,ASWAPTR)                           03S0141 00229000
*ASWAPRMS = ESTAPTR;                   /*PARMS FOR THIS EXIT @Z40FPPG*/ 00230000
         ST    @15,ASWAPRMS(,ASWAPTR)                           03S0142 00231000
*ASWAAUTO = ADDR(AB4EDPMS);            /*1ST ASWA GIVES W/A  @Z40FPPG*/ 00232000
         LA    @05,AB4EDPMS                                     03S0143 00233000
         ST    @05,ASWAAUTO(,ASWAPTR)                           03S0143 00234000
*ASWAOLDP = JSCBASWA;                  /*OLD LAST IF ANY     @Z40FPPG*/ 00235000
         MVC   ASWAOLDP(4,ASWAPTR),JSCBASWA(@09)                03S0144 00236000
*RFY (EXITADDR,PARMADDR) RSTD;         /*RESTRICT WORK REGS  @Z40FPPG*/ 00237000
*EXITADDR = ADDR(IEFAB4ED);            /*COMMON ESTAE EXIT   @Z40FPPG*/ 00238000
         L     EXITADDR,@CV00284                                03S0146 00239000
*PARMADDR = ASWAPTR;                   /*ASWA IS EXIT PARMS  @Z40FPPG*/ 00240000
         LR    PARMADDR,ASWAPTR                                 03S0147 00241000
*ESTAEL(1:ESTAELTH) = ESTAEP(1:ESTAELTH);                       03S0148 00242000
         L     @05,ESTAELTH                                     03S0148 00243000
         BCTR  @05,0                                            03S0148 00244000
         EX    @05,@SM02994                                     03S0148 00245000
*                                      /*MOVE TO AUTO CORE   @Z40FPPG*/ 00246000
*GEN REFS(ESTAEL) SETS(REG15,TCBSTABB);                         03S0149 00247000
  ESTAE (EXITADDR),TERM=YES,RECORD=YES,PARAM=(PARMADDR),MF=(E,ESTAEL)   00248000
*RFY (EXITADDR,PARMADDR) UNRSTD;                                03S0150 00249000
*RETCODE = REG15;                      /*SAVE RETURN CODE    @Z40FPPG*/ 00250000
         ST    REG15,RETCODE                                    03S0151 00251000
*IF RETCODE = ZERO THEN                /*IF NO ERROR         @Z40FPPG*/ 00252000
         L     @05,RETCODE                                      03S0152 00253000
         SLR   @15,@15                                          03S0152 00254000
         CR    @05,@15                                          03S0152 00255000
         BNE   @RF00152                                         03S0152 00256000
*  DO;                                 /*PUT ASWA ONTO CHAIN @Z40FPPG*/ 00257000
*    ASWASCBP = TCBPTR->TCBSTABB;      /*CURRENT SCB ADDRESS @Z40FPPG*/ 00258000
         L     @05,CVTPTR                                       03S0154 00259000
         L     @05,CVTTCBP(,@05)                                03S0154 00260000
         L     @05,TCBPTR(,@05)                                 03S0154 00261000
         SLR   @14,@14                                          03S0154 00262000
         ICM   @14,7,TCBSTABB(@05)                              03S0154 00263000
         ST    @14,ASWASCBP(,ASWAPTR)                           03S0154 00264000
*     DO; /*MODESET  KEYADDR(ZERO)*/                            03S0155 00265000
*       SPKA (ZERO); /*SET PSW KEY*/                            03S0156 00266000
         SPKA  0(@15)                                           03S0156 00267000
*     END; /*MODESET  KEYADDR(ZERO)*/           /*KEY TO UPDATE JSCB  @ 00268000
*40FPPG*/                                                       03S0157 00269000
*    JSCBASWA = ASWAPTR;               /*NEW LAST ASWA PTR   @Z40FPPG*/ 00270000
         L     @05,PARMPTR                                      03S0158 00271000
         L     @05,LCTPTR(,@05)                                 03S0158 00272000
         L     @05,LCTJSCB(,@05)                                03S0158 00273000
         ST    ASWAPTR,JSCBASWA(,@05)                           03S0158 00274000
*     DO; /*MODESET  EXTKEY(SCHED)*/                            03S0159 00275000
*       SPKA (16); /*SET PSW KEY*/                              03S0160 00276000
         LA    @01,16                                           03S0160 00277000
         SPKA  0(@01)                                           03S0160 00278000
*     END; /*MODESET  EXTKEY(SCHED)*/           /*BACK TO SCHED KEY   @ 00279000
*40FPPG*/                                                       03S0161 00280000
*  END;                                /*END IF NO ERROR     @Z40FPPG*/ 00281000
*IF RETCODE = ZERO THEN                /* ESTAE SUCCESSFUL           */ 00282000
@RF00152 ICM   @15,15,RETCODE                                   02S0163 00283000
         BNZ   @RF00163                                         02S0163 00284000
*  DO;                                                          02S0164 00285000
*    IF LCTPALCD = ON | LCTSALCD = ON THEN /* JOB UNALLOC IF ABEND      00286000
*                                             OCCURS         @YM08146*/ 00287000
         L     @01,PARMPTR                                      02S0165 00288000
         L     @01,LCTPTR(,@01)                                 02S0165 00289000
         TM    LCTPALCD(@01),B'01100000'                        02S0165 00290000
         BZ    @RF00165                                         02S0165 00291000
*      ESTAJOB = ON;                   /* INDICATOR TO ESTAE    02S0166 00292000
*                                         PARMS              @YM08146*/ 00293000
         L     @01,ESTAPTR                                      02S0166 00294000
         OI    ESTAJOB(@01),B'00010000'                         02S0166 00295000
*    IF SCTLSIOT ^= ZERO THEN          /* ANY DD'S           @ZM41392*/ 00296000
@RF00165 L     @01,PARMPTR                                      02S0167 00297000
         L     @15,SCTPTR(,@01)                                 02S0167 00298000
         ICM   @14,7,SCTLSIOT(@15)                              02S0167 00299000
         BZ    @RF00167                                         02S0167 00300000
*      DO;                             /* GET SPACE FOR EPAS @ZM41392*/ 00301000
*        SIZEEPAB =                    /* AMNT TO GET FOR EPAS TO BE    00302000
*                                         READ IN BY IEFAB4FE@ZM41392*/ 00303000
*          LENGTH(EPABHDR)        +    /* BLOCK HEADER SIZE  @ZM41392*/ 00304000
*          (3 * SCTLALOC *             /* 3 EPAS PER DD      @ZM41392*/ 00305000
*             LENGTH(SWAEPA));         /* LENGTH OF AN EPA   @ZM41392*/ 00306000
         LH    SIZEEPAB,SCTLALOC(,@15)                          02S0169 00307000
         MH    SIZEEPAB,@CH02964                                02S0169 00308000
         AH    SIZEEPAB,@CH00054                                02S0169 00309000
*        RFY (REG0,REG1) RSTD;         /*RESTRICT REGS 0 & 1 @ZA17379*/ 00310000
*        REG0 = SIZEEPAB | SUBPL230;   /*SET SIZE AND SUBPOOL@ZA17379*/ 00311000
         LR    REG0,SIZEEPAB                                    02S0171 00312000
         O     REG0,@CF00271                                    02S0171 00313000
*        GEN(GETMAIN R,LV=(0));        /*GET CORE FOR EPAS   @ZA17379*/ 00314000
         GETMAIN R,LV=(0)                                               00315000
*        FEPBLKP = REG1;               /*SET CORE ADDRESS    @ZA17379*/ 00316000
         ST    REG1,FEPBLKP                                     02S0173 00317000
*        RFY (REG0,REG1) UNRSTD;       /*UNRESTRICT REGS 0&1 @ZA17379*/ 00318000
*        RFY (REG4,REG5,REG6,REG7) RSTD; /*RESTRICT REGS FOR MVCL TO    00319000
*                                          ZERO CORE         @ZA17379*/ 00320000
*        REG4 = FEPBLKP;               /*ADDR OF CORE        @ZA17379*/ 00321000
         L     @15,FEPBLKP                                      02S0176 00322000
         LR    REG4,@15                                         02S0176 00323000
*        REG5 = SIZEEPAB;              /*SIZE OF CORE        @ZA17379*/ 00324000
         LR    REG5,SIZEEPAB                                    02S0177 00325000
*        REG6 = ZERO;                  /*PADDING CHAR        @ZA17379*/ 00326000
         SLR   REG6,REG6                                        02S0178 00327000
*        REG7 = ZERO;                  /*LENGTH              @ZA17379*/ 00328000
         SLR   REG7,REG7                                        02S0179 00329000
*        GEN REFS(REG4,REG6);          /*                    @ZA17379*/ 00330000
          MVCL  REG4,REG6               ZERO CORE             @ZA17379  00331000
*        RFY (REG4,REG5,REG6,REG7) UNRSTD; /*FREE REGS       @ZA17379*/ 00332000
*        EPBLKPTR = FEPBLKP;           /* BASE OF EPA BLK    @ZM41392*/ 00333000
         L     EPBLKPTR,FEPBLKP                                 02S0182 00334000
*        EPABSIZE = SIZEEPAB;          /* PUT SIZE IN BLOCK  @ZM41392*/ 00335000
         ST    SIZEEPAB,EPABSIZE(,EPBLKPTR)                     02S0183 00336000
*        EPABCNT = SCTLALOC * 3;       /* # OF EPA'S WHICH WILL FIT     00337000
*                                         IN THE BLOCK       @ZM41392*/ 00338000
         L     @03,PARMPTR                                      02S0184 00339000
         L     @03,SCTPTR(,@03)                                 02S0184 00340000
         LH    @03,SCTLALOC(,@03)                               02S0184 00341000
         MH    @03,@CH00115                                     02S0184 00342000
         ST    @03,EPABCNT(,EPBLKPTR)                           02S0184 00343000
*      END;                            /* EPA SPACE GOTTEN   @ZM41392*/ 00344000
*    A4FEFMAP = A4FEFMAP && A4FEFMAP;      /* ZERO SWA RDR FUNC MAP  */ 00345000
@RF00167 XC    A4FEFMAP(1),A4FEFMAP                             02S0186 00346000
*    EPASGOTN = ON;                    /* TELL IEFAB4FE THAT SPACE      00347000
*                                         FOR EPA'S EXISTS.  @ZM41392*/ 00348000
         OI    EPASGOTN,B'00000010'                             02S0187 00349000
*    IF JCTWARMS = ON |                /* WARM START, NO DSAB@ZA02992*/ 00350000
*       LCTPALCD=OFF THEN              /*NO DATA SETS ALLOCED@ZA02992*/ 00351000
         L     @15,PARMPTR                                      02S0188 00352000
         L     @01,JCTPTR(,@15)                                 02S0188 00353000
         TM    JCTWARMS(@01),B'10000000'                        02S0188 00354000
         BO    @RT00188                                         02S0188 00355000
         L     @01,LCTPTR(,@15)                                 02S0188 00356000
         TM    LCTPALCD(@01),B'00100000'                        02S0188 00357000
         BNZ   @RF00188                                         02S0188 00358000
@RT00188 DS    0H                                               02S0189 00359000
*      SCANSCT = ON;                   /* USE SCT SIOT CHAIN         */ 00360000
         OI    SCANSCT,B'10000000'                              02S0189 00361000
*    ELSE                              /*DSABS EXIST         @ZA02992*/ 00362000
*      SCANDSAB = ON;                  /* USE DSAB CHAIN TO READ SIOT*/ 00363000
         B     @RC00188                                         02S0190 00364000
@RF00188 OI    SCANDSAB,B'01000000'                             02S0190 00365000
*    CALL IEFAB4FE(A4FEFMAP,SCTPTR,LCTJSCB,SWARDRET,FEPBLKP); /* READ   00366000
*                                         SIOTS,JFCBS,JFCBXS @ZM41392*/ 00367000
@RC00188 LA    @15,A4FEFMAP                                     02S0191 00368000
         ST    @15,@AL00001                                     02S0191 00369000
         L     @15,PARMPTR                                      02S0191 00370000
         LA    @14,SCTPTR(,@15)                                 02S0191 00371000
         ST    @14,@AL00001+4                                   02S0191 00372000
         L     @01,LCTPTR(,@15)                                 02S0191 00373000
         LA    @15,LCTJSCB(,@01)                                02S0191 00374000
         ST    @15,@AL00001+8                                   02S0191 00375000
         LA    @15,SWARDRET                                     02S0191 00376000
         ST    @15,@AL00001+12                                  02S0191 00377000
         LA    @15,FEPBLKP                                      02S0191 00378000
         ST    @15,@AL00001+16                                  02S0191 00379000
         L     @15,@CV00287                                     02S0191 00380000
         LA    @01,@AL00001                                     02S0191 00381000
         BALR  @14,@15                                          02S0191 00382000
*    IF JSCDSABQ ^= ZERO &             /* DSAB QDB EXISTS.   @ZA01873*/ 00383000
*       DSQLASTP ^= ZERO THEN          /* LAST DSAB EXISTS.  @ZA01873*/ 00384000
         SLR   @15,@15                                          02S0192 00385000
         L     @14,PARMPTR                                      02S0192 00386000
         L     @01,LCTPTR(,@14)                                 02S0192 00387000
         L     @01,LCTJSCB(,@01)                                02S0192 00388000
         L     @09,JSCDSABQ(,@01)                               02S0192 00389000
         CR    @09,@15                                          02S0192 00390000
         BE    @RF00192                                         02S0192 00391000
         L     @09,DSQLASTP(,@09)                               02S0192 00392000
         CR    @09,@15                                          02S0192 00393000
         BE    @RF00192                                         02S0192 00394000
*      DO;                             /* FILL IN SCT'S SVA OF LAST     00395000
*                                         SIOT READ IN.      @ZA01873*/ 00396000
*        DSABPTR = DSQLASTP;           /* GET LAST DSAB.     @ZA01873*/ 00397000
         LR    DSABPTR,@09                                      02S0194 00398000
*        SCTLSIOT = DSABSSVA;          /* PUT SIOT SVA IN SCT@ZA01873*/ 00399000
         L     @03,SCTPTR(,@14)                                 02S0195 00400000
         MVC   SCTLSIOT(3,@03),DSABSSVA(DSABPTR)                02S0195 00401000
*      END;                            /* END SCT FILL-IN.   @ZA01873*/ 00402000
*    ELSE;                             /* NO DSABS           @ZA01873*/ 00403000
@RF00192 DS    0H                                               02S0198 00404000
*    ESTLEPAP = LEPAPTR;               /* PTR TO LAST EPA TO ESTAE PR*/ 00405000
         L     @15,ESTAPTR                                      02S0198 00406000
         MVC   ESTLEPAP(4,@15),LEPAPTR                          02S0198 00407000
*    ESTSIOTP = FSIOTP;                /* PTR TO 1ST SIOT TO ESTAE PR*/ 00408000
         L     @14,FSIOTP                                       02S0199 00409000
         ST    @14,ESTSIOTP(,@15)                               02S0199 00410000
*    IF FSIOTP ^= ZERO THEN            /* STEP UNALLOC NEEDED@YM08146*/ 00411000
         LTR   @14,@14                                          02S0200 00412000
         BZ    @RF00200                                         02S0200 00413000
*      ESTASTEP = ON;                  /* INDICATOR TO ESTAE PARMS   */ 00414000
*                                                               02S0201 00415000
         OI    ESTASTEP(@15),B'10000000'                        02S0201 00416000
*  END;                                                         02S0202 00417000
*ELSE                                  /* ESTAE ERROR                */ 00418000
*  DO;                                                          02S0203 00419000
         B     @RC00163                                         02S0203 00420000
@RF00163 DS    0H                                               02S0204 00421000
*    FEPAPTR = ZERO;                   /* NO SWA RECORDS READ        */ 00422000
         SLR   @15,@15                                          02S0204 00423000
         ST    @15,FEPAPTR                                      02S0204 00424000
*    RESNCODE(1) = ESTAERR;            /* ESTAE ERROR REASON CODE    */ 00425000
         LA    @15,4                                            02S0205 00426000
         STH   @15,RESNCODE                                     02S0205 00427000
*    RETCODE = ERROR;                  /* ERROR RETURN CODE          */ 00428000
         ST    @15,RETCODE                                      02S0206 00429000
*  END;                                                         02S0207 00430000
*IF RETCODE = ZERO THEN                /* NO ERROR OCURRED           */ 00431000
@RC00163 ICM   @15,15,RETCODE                                   01S0208 00432000
         BNZ   @RF00208                                         01S0208 00433000
*  DO;                                 /* CONTINUE                   */ 00434000
*/********************************************************************/ 00435000
*/* SEGMENT NAME - ISSUMSGS                                          */ 00436000
*/*                                                                  */ 00437000
*/* DESCRIPTIVE NAME - ISSUE END OF STEP MESSAGES                    */ 00438000
*/*                                                                  */ 00439000
*/* FUNCTION -                                                       */ 00440000
*/*   THE FUNCTION OF THIS SEGMENT IS TO PERFORM THE FOLLOWING       */ 00441000
*/*   FUNCTIONS AT THE END OF EACH STEP:                             */ 00442000
*/*                                                                  */ 00443000
*/*   1. ISSUE MESSAGES - MESSAGES ARE ISSUED ACCORDING TO THE       */ 00444000
*/*      FOLLOWING RULES:                                            */ 00445000
*/*                                                                  */ 00446000
*/*      . STEP TERMINATED NORMALLY                                  */ 00447000
*/*        THE STEP WAS EXECUTED MESSAGE IS ISSUED TO THE            */ 00448000
*/*        PROGRAMMER. THE RETURN CODE FROM THE STEP IS INCLUDED     */ 00449000
*/*        IN THIS MESSAGE.                                          */ 00450000
*/*                                                                  */ 00451000
*/*      . STEP ABNORMALLY TERMINATED                                */ 00452000
*/*        THE STEP ABENDED MESSAGE IS ISSUED TO THE OPERATOR AND    */ 00453000
*/*        THE COMPLETION CODE MESSAGE IS ISSUED TO THE PROGRAMMER.  */ 00454000
*/*                                                                  */ 00455000
*/*      . STEP WAS NOT EXECUTED                                     */ 00456000
*/*        THE STEP WAS NOT EXECUTED MESSAGE IS ISSUED TO THE        */ 00457000
*/*        PROGRAMMER. IF THE STEP IS IN ALLOCATION WHEN THE @ZA08480*/ 00458000
*/*        SYSTEM RESTART IS REQUIRED, ANOTHER MESSAGE IS    @ZA08480*/ 00459000
*/*        ISSUED TO NOTIFY THE PROGRAMMER.                  @ZA08480*/ 00460000
*/*                                                                  */ 00461000
*/*    OPERATION -                                                   */ 00462000
*/*      MESSAGES ARE KEPT IN EXTERNAL PROCS. THESE PROCS ALSO       */ 00463000
*/*      CONTAIN DESCRIPTIVE INFORMATION ABOUT THE MESSAGE. THE      */ 00464000
*/*      LENGTH OF ALL MESSAGES IS KEPT. IN ADDITION, ANY MESSAGES   */ 00465000
*/*      WHICH CONTAIN VARIABLE FIELDS OTHER THAN JOB NAME,STEP      */ 00466000
*/*      NAME, AND PROC STEP NAME (E.G. COMPLETION CODE), HAVE AN    */ 00467000
*/*      OFFSET WITHIN THE MESSAGE WHERE THE VARIABLE INFORMATION    */ 00468000
*/*      GOES. SEE B410DATA FOR MORE DETAIL ON THE USE OF THESE      */ 00469000
*/*      FIELDS.                                                     */ 00470000
*/*                                                                  */ 00471000
*/* ENTRY - IN-LINE SEGMENT                                          */ 00472000
*/*                                                                  */ 00473000
*/*   PURPOSE - SEE FUNCTION                                         */ 00474000
*/*                                                                  */ 00475000
*/*   INPUT -                                                        */ 00476000
*/*                                                                  */ 00477000
*/*     LCT -                                                        */ 00478000
*/*       LCTJFAIL - JOB FAILED BIT                                  */ 00479000
*/*       LCTSFAIL - STEP BYPASSED BIT                               */ 00480000
*/*       LCTJSCB - P/P JSCB ADDRESS                                 */ 00481000
*/*                                                                  */ 00482000
*/*     JCT -                                                        */ 00483000
*/*       JCTSTEPR - STEP WILL AUTOMATICALLY RESTART FROM THE        */ 00484000
*/*         BEGINNING                                                */ 00485000
*/*       JCTCKPTR - STEP WILL AUTOMATICALLY RESTART FROM A          */ 00486000
*/*         CHECK POINT.                                             */ 00487000
*/*       JCTSWSM - SUPRESS ALL MESSAGES                             */ 00488000
*/*                                                                  */ 00489000
*/*     TCB -                                                        */ 00490000
*/*       TCBFA - ABEND BIT                                          */ 00491000
*/*                                                                  */ 00492000
*/* EXIT -                                                           */ 00493000
*/* 1 CONDITION - NORMAL                                             */ 00494000
*/*                                                                  */ 00495000
*/*   OUTPUT -                                                       */ 00496000
*/*                                                                  */ 00497000
*/*     MESSAGES TO PROGRAMMER AND OPERATOR                          */ 00498000
*/*                                                                  */ 00499000
*/*    RETURN CODE - NONE                                            */ 00500000
*/*                                                                  */ 00501000
*/********************************************************************/ 00502000
*WTOSW = OFF;                          /* INIT MSG TO OPER SWITCH    */ 00503000
*TIMESW = OFF;                         /* INIT TIME SWITCH           */ 00504000
         NI    WTOSW,B'01110111'                                02S0211 00505000
*IF JCTWARMS = OFF |                   /* NOT WARM START             */ 00506000
*    (JCTWARMS = ON & JCTSWSM = OFF) THEN /*WARMSTART,MSG NOT SUPRESD*/ 00507000
         L     @01,PARMPTR                                      02S0212 00508000
         L     @15,JCTPTR(,@01)                                 02S0212 00509000
         TM    JCTWARMS(@15),B'10000000'                        02S0212 00510000
         BZ    @RT00212                                         02S0212 00511000
         TM    JCTWARMS(@15),B'10000000'                        02S0212 00512000
         BNO   @RF00212                                         02S0212 00513000
         TM    JCTSWSM(@15),B'00010000'                         02S0212 00514000
         BNZ   @RF00212                                         02S0212 00515000
@RT00212 DS    0H                                               02S0213 00516000
*  DO;                                 /* ISSUE END OF STEP MESSAGES */ 00517000
*/********************************************************************/ 00518000
*/*                                                                  */ 00519000
*/* SEGMENT NAME - SETCODES                                          */ 00520000
*/*                                                                  */ 00521000
*/* DESCRIPTIVE NAME - SET UP COMPLETION CODES AND TIME              */ 00522000
*/*                                                                  */ 00523000
*/* FUNCTION -                                                       */ 00524000
*/*   THE FUNCTION OF THIS SEGMENT IS TO SET UP THE SYSTEM AND USER  */ 00525000
*/*   ABEND CODES, THE RETURN CODE FROM THE STEP, AND THE TIME       */ 00526000
*/*   FOR LATER INSERTION INTO A MESSAGE.                            */ 00527000
*/*                                                                  */ 00528000
*/*   OPERATION -                                                    */ 00529000
*/*   . CONVERT THE ABEND CODE - (DONE ONLY IF THE STEP ABENDED)     */ 00530000
*/*     THE SYSTEM ABEND CODE IS CONVERTED TO EBCDIC. IF THE SYSTEM  */ 00531000
*/*     ABEND CODE IS NOT 0C0, D0D, OR E0D, THE USER ABEND CODE IS   */ 00532000
*/*     CONVERTED TO DECIMAL AND THEN TO EBCDIC. IF THE SYSTEM       */ 00533000
*/*     ABEND CODE IS 0C0, THE USER ABEND CODE IS SET TO ZERO.       */ 00534000
*/*     IF THE SYSTEM ABEND CODE IS D0D OR E0D, AN INVALID RECURSION */ 00535000
*/*     THROUGH ABEND HAS OCCURRED AND THE ORIGINAL SYSTEM           */ 00536000
*/*     COMPLETION CODE IS IN THE USER CODE FIELD. THEREFORE, IN     */ 00537000
*/*     THIS CASE THE USER ABEND CODE IS JUST CONVERTED TO EBCDIC.   */ 00538000
*/*                                                                  */ 00539000
*/*   . CONVERT THE STEP RETURN CODE - (DONE IF STEP DID NOT ABEND)  */ 00540000
*/*     THE STEP RETURN CODE IS CONVERTED TO DECIMAL AND THEN TO     */ 00541000
*/*     EBCDIC.                                                      */ 00542000
*/*                                                                  */ 00543000
*/*   . SET UP THE TIME -                                            */ 00544000
*/*     A TIME MACRO IS ISSUED AND THE TIME IS CONVERTED TO EBCDIC   */ 00545000
*/*     IF THE OPERATOR ISSUED THE MONITOR COMMAND WITH THE TIME     */ 00546000
*/*     OPTION.                                                      */ 00547000
*/*                                                                  */ 00548000
*/* ENTRY - IN-LINE SEGMENT                                          */ 00549000
*/*                                                                  */ 00550000
*/*   PURPOSE - SEE FUNCTION                                         */ 00551000
*/*                                                                  */ 00552000
*/*   INPUT -                                                        */ 00553000
*/*     TCB -                                                        */ 00554000
*/*       TCBCMP - STEP COMPLETION CODE IF ABEND, OTHERWISE STEP     */ 00555000
*/*         RETURN CODE.                                             */ 00556000
*/*                                                                  */ 00557000
*/*     CSCB -                                                       */ 00558000
*/*       CHCLD - CANCELLED BIT                                      */ 00559000
*/*                                                                  */ 00560000
*/*     MASTER SCHEDULER RESIDENT DATA AREA -                        */ 00561000
*/*       MSTN - MN ,T ISSUED                                        */ 00562000
*/*                                                                  */ 00563000
*/* EXIT -                                                           */ 00564000
*/*   CONDITION - NORMAL                                             */ 00565000
*/*                                                                  */ 00566000
*/*   OUTPUT -                                                       */ 00567000
*/*     SYSABCDE - SYSTEM ABEND CODE (IN EBCDIC)                     */ 00568000
*/*     USRABCDE - USER ABEND CODE (IN EBCDIC)                       */ 00569000
*/*     COMPCODE - STEP RETURN CODE                                  */ 00570000
*/*     TIME - THE TIME IN THE FORM HHMMSS (IN EBCDIC)               */ 00571000
*/*     TIMESW - SET ON IF MN ,T REQUESTED                           */ 00572000
*/*                                                                  */ 00573000
*/*   RETURN CODE - NONE                                             */ 00574000
*/*                                                                  */ 00575000
*/********************************************************************/ 00576000
*IF TCBFA = ON | CHCLD = ON THEN       /* STEP WAS ABENDED           */ 00577000
         L     @01,PARMPTR                                      03S0214 00578000
         L     @15,LCTPTR(,@01)                                 03S0214 00579000
         L     @01,LCTTCBAD(,@15)                               03S0214 00580000
         TM    TCBFA(@01),B'10000000'                           03S0214 00581000
         BO    @RT00214                                         03S0214 00582000
         L     @01,LCTQDRTY(,@15)                               03S0214 00583000
         TM    CHCLD(@01),B'00000100'                           03S0214 00584000
         BNO   @RF00214                                         03S0214 00585000
@RT00214 DS    0H                                               03S0215 00586000
*  DO;                                                          03S0215 00587000
*    UNPK (BCDCCODE(1:5),TCBCMPCH(1:3)); /* UNPK SYS ABEND CODE      */ 00588000
         L     @01,PARMPTR                                      03S0216 00589000
         L     @01,LCTPTR(,@01)                                 03S0216 00590000
         L     @15,LCTTCBAD(,@01)                               03S0216 00591000
         UNPK  BCDCCODE(5),TCBCMPCH(3,@15)                      03S0216 00592000
*    TR (BCDCCODE(1:3),TRTABLE);       /* TRANSLATE TO EBCDIC        */ 00593000
         LA    @14,@CC00272                                     03S0217 00594000
         SH    @14,@CH00185                                     03S0217 00595000
         TR    BCDCCODE(3),TRTABLE(@14)                         03S0217 00596000
*    SYSABCDE = BCDCCODE(1:3);         /* MOVE TO OUTPUT AREA        */ 00597000
         MVC   SYSABCDE(3),BCDCCODE                             03S0218 00598000
*    IF SYSABCDE(2:3) = ABNDABND THEN  /* USER ABEND FIELD HAS SYSTEM   00599000
*                                         ABEND CODE                 */ 00600000
         CLC   SYSABCDE+1(2),@CC00233                           03S0219 00601000
         BNE   @RF00219                                         03S0219 00602000
*      DO;                                                      03S0220 00603000
*        UNPK (BCDCCODE(1:5),TCBCMPCH(2:4)); /* UNPK ABEND CODE      */ 00604000
         UNPK  BCDCCODE(5),TCBCMPCH+1(3,@15)                    03S0221 00605000
*        TR (BCDCCODE(2:4),TRTABLE);   /* TRANSLATE TO EBCDIC        */ 00606000
         TR    BCDCCODE+1(3),TRTABLE(@14)                       03S0222 00607000
*        USRABCDE = BCDCCODE(2:4);     /* SET USR CODE IN OUTPUT AREA*/ 00608000
         MVI   USRABCDE+3,C' '                                  03S0223 00609000
         MVC   USRABCDE(3),BCDCCODE+1                           03S0223 00610000
*      END;                                                     03S0224 00611000
*    ELSE                              /* NOT D0D OR E0D             */ 00612000
*      IF SYSABCDE = IMPRCISE THEN     /* 0C0 ABEND                  */ 00613000
         B     @RC00219                                         03S0225 00614000
@RF00219 CLC   SYSABCDE(3),@CC00250                             03S0225 00615000
         BNE   @RF00225                                         03S0225 00616000
*        USRABCDE = CHARZERO;          /* SET USER CODE TO ZERO      */ 00617000
         MVC   USRABCDE(4),@CC00239                             03S0226 00618000
*      ELSE                            /* CONVERT USER ABEND FIELD   */ 00619000
*        DO;                                                    03S0227 00620000
         B     @RC00225                                         03S0227 00621000
@RF00225 DS    0H                                               03S0228 00622000
*          USERCODE = TCBCMPC(2:3);    /* MOVE USER CODE TO LCL AREA */ 00623000
         L     @01,PARMPTR                                      03S0228 00624000
         L     @01,LCTPTR(,@01)                                 03S0228 00625000
         L     @01,LCTTCBAD(,@01)                               03S0228 00626000
         SLR   USERCODE,USERCODE                                03S0228 00627000
         ICM   USERCODE,3,TCBCMPC+1(@01)                        03S0228 00628000
*          USERCODE = USERCODE & HIZERO; /* ZERO FIRST HALF BYTE     */ 00629000
         N     USERCODE,@CF00248                                03S0229 00630000
*          CVD (USERCODE,DECUSRCD);    /* CONVERT TO DECIMAL         */ 00631000
         CVD   USERCODE,DECUSRCD                                03S0230 00632000
*          MVN (DECUSRCD(8),ZEROFOX);  /* INSURE CORRECT ZONE        */ 00633000
         MVN   DECUSRCD+7(1),@CB00278                           03S0231 00634000
*          UNPK (DECUSRCD(1:5),DECUSRCD(6:8)); /* CONVERT TO EBCDIC  */ 00635000
         UNPK  DECUSRCD(5),DECUSRCD+5(3)                        03S0232 00636000
*          USRABCDE = DECUSRCD(2:5);   /* MOVE TO OUTPUT AREA        */ 00637000
         MVC   USRABCDE(4),DECUSRCD+1                           03S0233 00638000
*        END;                                                   03S0234 00639000
*  END;                                                         03S0235 00640000
*ELSE                                  /* STEP DID NOT ABEND         */ 00641000
*  DO;                                 /* SET UP STEP RETURN CODE    */ 00642000
         B     @RC00214                                         03S0236 00643000
@RF00214 DS    0H                                               03S0237 00644000
*    CVD (TCBCMPFW,DECCODE);           /* CONVERT RETURN CODE TO DEC */ 00645000
         L     @01,PARMPTR                                      03S0237 00646000
         L     @01,LCTPTR(,@01)                                 03S0237 00647000
         L     @01,LCTTCBAD(,@01)                               03S0237 00648000
         L     @15,TCBCMPFW(,@01)                               03S0237 00649000
         CVD   @15,DECCODE                                      03S0237 00650000
*    MVN (DECCODE(8),ZEROFOX);         /* INSURE CORRECT ZONE        */ 00651000
         MVN   DECCODE+7(1),@CB00278                            03S0238 00652000
*    UNPK (DECCODE(1:5),DECCODE(6:8)); /* CONVERT TO EBCDIC          */ 00653000
         UNPK  DECCODE(5),DECCODE+5(3)                          03S0239 00654000
*    COMPCODE = DECCODE(2:5);          /* MOVE TO OUTPUT AREA        */ 00655000
         MVC   COMPCODE(4),DECCODE+1                            03S0240 00656000
*  END;                                                         03S0241 00657000
*IF MSTN = ON THEN                     /* MN ,T ISSUED               */ 00658000
@RC00214 L     @01,CVTPTR                                       03S0242 00659000
         L     @01,CVTMSER(,@01)                                03S0242 00660000
         TM    MSTN+136(@01),B'00000010'                        03S0242 00661000
         BNO   @RF00242                                         03S0242 00662000
*  DO;                                 /* SET UP THE TIME            */ 00663000
*    TIMESW = ON;                      /* TIME NEEDED IN MSG         */ 00664000
         OI    TIMESW,B'00001000'                               03S0244 00665000
*    RFY (REG0,REG1) RSTD;             /* RESERVE REGISTERS          */ 00666000
*    GEN (TIME DEC);                   /* GET THE TIME               */ 00667000
         TIME DEC                                                       00668000
*    DECTIME = REG0;                   /* MOVE TIME OUT OF REG0      */ 00669000
         ST    REG0,DECTIME                                     03S0247 00670000
*    RFY (REG0,REG1) UNRSTD;           /* RELEASE REGISTERS          */ 00671000
*    UNPK (TIME(1:7),DECTIME);         /* CONVERT TO EBCDIC          */ 00672000
         UNPK  TIME(7),DECTIME(4)                               03S0249 00673000
*  END;                                                         03S0250 00674000
*    IF LCTJFAIL = OFF & LCTSFAIL = OFF | /* STEP WAS EXECUTED       */ 00675000
*        CHCLD = ON THEN               /* JOB CANCELED               */ 00676000
@RF00242 L     @01,PARMPTR                                      02S0251 00677000
         L     @01,LCTPTR(,@01)                                 02S0251 00678000
         TM    LCTJFAIL(@01),B'10010000'                        02S0251 00679000
         BZ    @RT00251                                         02S0251 00680000
         L     @01,PARMPTR                                      02S0251 00681000
         L     @01,LCTPTR(,@01)                                 02S0251 00682000
         L     @01,LCTQDRTY(,@01)                               02S0251 00683000
         TM    CHCLD(@01),B'00000100'                           02S0251 00684000
         BNO   @RF00251                                         02S0251 00685000
@RT00251 DS    0H                                               02S0252 00686000
*      IF TCBFA = ON | CHCLD = ON THEN /* STEP ABENDED OR CANCELED   */ 00687000
         L     @01,PARMPTR                                      02S0252 00688000
         L     @15,LCTPTR(,@01)                                 02S0252 00689000
         L     @01,LCTTCBAD(,@15)                               02S0252 00690000
         TM    TCBFA(@01),B'10000000'                           02S0252 00691000
         BO    @RT00252                                         02S0252 00692000
         L     @01,LCTQDRTY(,@15)                               02S0252 00693000
         TM    CHCLD(@01),B'00000100'                           02S0252 00694000
         BNO   @RF00252                                         02S0252 00695000
@RT00252 DS    0H                                               02S0253 00696000
*          DO;                                                  02S0253 00697000
*            WTOSW = ON;               /* ISSUE A WTO                */ 00698000
         OI    WTOSW,B'10000000'                                02S0254 00699000
*            WTOL = WTOL && WTOL;      /* ZERO WTO PARM LIST         */ 00700000
         XC    WTOL(138),WTOL                                   02S0255 00701000
*            MSG ='';                  /* BLANK OUT PGMR MESSAGE     */ 00702000
         MVI   MSG,C' '                                         02S0256 00703000
         MVC   MSG+1(119),MSG                                   02S0256 00704000
*            WPLTXT(1:WTOABNDL) = WTOABNDM(1:WTOABNDL); /* MOVE MSG     00705000
*                                         TO WTO PARM LIST           */ 00706000
         LA    @15,WTOL                                         02S0257 00707000
         L     @14,@CA00332                                     02S0257 00708000
         LH    @09,WTOABNDL-WTOABEND(,@14)                      02S0257 00709000
         LR    @08,@09                                          02S0257 00710000
         BCTR  @08,0                                            02S0257 00711000
         EX    @08,@SM03000                                     02S0257 00712000
*            WMSGLNTH = WTOABNDL;      /* MOVE LENGTH TO LOCAL AREA  */ 00713000
         ST    @09,WMSGLNTH                                     02S0258 00714000
*            WTOSYSCD(2:4) = SYSABCDE; /* MOVE ABEND CODE TO MSG        00715000
*                                                            @ZA01930*/ 00716000
         LA    @15,WPLTXT(,@15)                                 02S0259 00717000
         LH    @09,WTOSDISP-WTOABEND(,@14)                      02S0259 00718000
         ALR   @09,@15                                          02S0259 00719000
         MVC   WTOSYSCD+1(3,@09),SYSABCDE                       02S0259 00720000
*            WTOUSRCD(2:5) = USRABCDE; /* MOVE ABEND CODE TO MSG        00721000
*                                                            @ZA01930*/ 00722000
         AH    @15,WTOUDISP-WTOABEND(,@14)                      02S0260 00723000
         MVC   WTOUSRCD+1(4,@15),USRABCDE                       02S0260 00724000
*            MSG(1:PGMABNDL) = PGMABNDM(1:PGMABNDL); /* MOVE MSG        00725000
*                                         TO LOCAL AREA              */ 00726000
         L     @15,@CA00314                                     02S0261 00727000
         LH    @14,PGMABNDL-PGMABEND(,@15)                      02S0261 00728000
         LR    @09,@14                                          02S0261 00729000
         BCTR  @09,0                                            02S0261 00730000
         EX    @09,@SM03002                                     02S0261 00731000
*            LMSGLNTH = PGMABNDL;      /* MOVE LENGTH TO LCL AREA    */ 00732000
         ST    @14,LMSGLNTH                                     02S0262 00733000
*            MSGSYSCD = SYSABCDE;      /* MOVE SYS CODE TO MESSAGE   */ 00734000
         LA    @14,MSG                                          02S0263 00735000
         LH    @09,PGMSDISP-PGMABEND(,@15)                      02S0263 00736000
         ALR   @09,@14                                          02S0263 00737000
         MVC   MSGSYSCD(3,@09),SYSABCDE                         02S0263 00738000
*            MSGUSRCD = USRABCDE;      /* MOVE USER CODE TO MESSAGE  */ 00739000
         AH    @14,PGMUDISP-PGMABEND(,@15)                      02S0264 00740000
         MVC   MSGUSRCD(4,@14),USRABCDE                         02S0264 00741000
*          END;                                                 02S0265 00742000
*      ELSE                            /* STEP DID NOT ABEND         */ 00743000
*        DO;                           /* ISSUE STEP WAS RUN MSG     */ 00744000
         B     @RC00252                                         02S0266 00745000
@RF00252 DS    0H                                               02S0267 00746000
*          MSG(1:STEPRUNL) = STEPRUNM(1:STEPRUNL); /* MOVE IN MSG    */ 00747000
         L     @15,@CA00320                                     02S0267 00748000
         LH    @14,STEPRUNL-STEPRUN(,@15)                       02S0267 00749000
         LR    @09,@14                                          02S0267 00750000
         BCTR  @09,0                                            02S0267 00751000
         EX    @09,@SM03004                                     02S0267 00752000
*          MSGCCODE = COMPCODE;        /* MOVE COMP CODE TO MSG      */ 00753000
         LA    @09,MSG                                          02S0268 00754000
         AH    @09,STPCDISP-STEPRUN(,@15)                       02S0268 00755000
         MVC   MSGCCODE(4,@09),COMPCODE                         02S0268 00756000
*          LMSGLNTH = STEPRUNL;        /* MOVE LENGTH TO LCL AREA    */ 00757000
         ST    @14,LMSGLNTH                                     02S0269 00758000
*        END;                                                   02S0270 00759000
*    ELSE                              /* STEP DID NOT EXECUTE       */ 00760000
*      DO;                                                      02S0271 00761000
         B     @RC00251                                         02S0271 00762000
@RF00251 DS    0H                                               02S0272 00763000
*        MSG(1:STNOTRNL) = STNOTRNM(1:STNOTRNL); /* MOVE IN MSG      */ 00764000
         L     @15,@CA00323                                     02S0272 00765000
         LH    @14,STNOTRNL-STNOTRUN(,@15)                      02S0272 00766000
         LR    @09,@14                                          02S0272 00767000
         BCTR  @09,0                                            02S0272 00768000
         EX    @09,@SM03006                                     02S0272 00769000
*        LMSGLNTH = STNOTRNL;          /* SET LENGTH OF MSG          */ 00770000
         ST    @14,LMSGLNTH                                     02S0273 00771000
*        IF JCTJSBAL = ON &            /* WAS STEP IN ALLOC  @ZA08480*/ 00772000
*           JCTWARMS = ON THEN         /* IS THIS WARMSTART? @ZA08480*/ 00773000
         L     @01,PARMPTR                                      02S0274 00774000
         L     @15,JCTPTR(,@01)                                 02S0274 00775000
         TM    JCTJSBAL(@15),B'00000100'                        02S0274 00776000
         BNO   @RF00274                                         02S0274 00777000
         TM    JCTWARMS(@15),B'10000000'                        02S0274 00778000
         BNO   @RF00274                                         02S0274 00779000
*          DO;                         /*                    @ZA08480*/ 00780000
*            CALL ENDSMSG;             /* WRITE STEP NOT EXECUTED MSG   00781000
*                                                            @ZA08480*/ 00782000
         BAL   @14,ENDSMSG                                      02S0276 00783000
*            MSG(1:STNOATOL) = STNOATOM(1:STNOATOL); /*      @ZA08480*/ 00784000
         L     @15,@CA00326                                     02S0277 00785000
         LH    @14,STNOATOL-STNOAUTO(,@15)                      02S0277 00786000
         LR    @09,@14                                          02S0277 00787000
         BCTR  @09,0                                            02S0277 00788000
         EX    @09,@SM03008                                     02S0277 00789000
*            LMSGLNTH = STNOATOL;      /* SET LENGTH OF MSG  @ZA08480*/ 00790000
         ST    @14,LMSGLNTH                                     02S0278 00791000
*          END;                        /*                    @ZA08480*/ 00792000
*      END;                                                     02S0280 00793000
@RF00274 DS    0H                                               02S0281 00794000
*    CALL ENDSMSG;                     /* ISSUE THE MESSAGES @ZA08480*/ 00795000
@RC00251 BAL   @14,ENDSMSG                                      02S0281 00796000
*  END;                                                         02S0282 00797000
*    IF TCBFA = ON & CHCLD = OFF THEN  /* STEP ABENDED BUT NOT CANCEL*/ 00798000
@RF00212 L     @01,PARMPTR                                      01S0283 00799000
         L     @15,LCTPTR(,@01)                                 01S0283 00800000
         L     @01,LCTTCBAD(,@15)                               01S0283 00801000
         TM    TCBFA(@01),B'10000000'                           01S0283 00802000
         BNO   @RF00283                                         01S0283 00803000
         L     @01,LCTQDRTY(,@15)                               01S0283 00804000
         TM    CHCLD(@01),B'00000100'                           01S0283 00805000
         BNZ   @RF00283                                         01S0283 00806000
*      DO;                                                      01S0284 00807000
*        RFY REG1 RSTD;                                         01S0285 00808000
*        REG1 = LCTPTR;                /* SET REG1 FOR IEFRPREP      */ 00809000
         LR    REG1,@15                                         01S0286 00810000
*        CALL IEFRPREP;                /* INVOKE RESTART PREPARATION */ 00811000
         L     @15,@CV00295                                     01S0287 00812000
         BALR  @14,@15                                          01S0287 00813000
*        RFY REG1 UNRSTD;                                       01S0288 00814000
*      END;                                                     01S0289 00815000
*    IF JCTWARMS = ON &                /* WARMSTART                  */ 00816000
*         (JCTSTEPR = OFF & JCTCKPTR = OFF & JCTCONTR = OFF) THEN /* NO 00817000
*                                         RESTART                    */ 00818000
@RF00283 L     @01,PARMPTR                                      01S0290 00819000
         L     @01,JCTPTR(,@01)                                 01S0290 00820000
         TM    JCTWARMS(@01),B'10000000'                        01S0290 00821000
         BNO   @RF00290                                         01S0290 00822000
         TM    JCTSTEPR(@01),B'00101100'                        01S0290 00823000
         BNZ   @RF00290                                         01S0290 00824000
*      RETCODE = ERROR;                /* INDIC JOB IS FAILED        */ 00825000
         MVC   RETCODE(4),@CF00089                              01S0291 00826000
*    IF ((LCTSFAIL = OFF &      /* STEP NOT BYPASSED          */        00827000
*       LCTJFAIL = ON &         /* JOB FAILED                 */        00828000
*       LCTPALCD = ON) |        /* SOME DATA SETS ALLOCED     */        00829000
*       (LCTSFAIL = OFF &                                       01S0292 00830000
*       LCTJFAIL = OFF)) &                                      01S0292 00831000
*       FSIOTP ^= ZERO THEN/*                                   01S0292 00832000
*                                         MUST DO STEP UNALLOCATION  */ 00833000
@RF00290 L     @01,PARMPTR                                      01S0292 00834000
         L     @01,LCTPTR(,@01)                                 01S0292 00835000
         TM    LCTJFAIL(@01),B'10100000'                        01S0292 00836000
         BNO   @GL00011                                         01S0292 00837000
         TM    LCTSFAIL(@01),B'00010000'                        01S0292 00838000
         BZ    @GL00010                                         01S0292 00839000
@GL00011 L     @01,PARMPTR                                      01S0292 00840000
         L     @01,LCTPTR(,@01)                                 01S0292 00841000
         TM    LCTSFAIL(@01),B'10010000'                        01S0292 00842000
         BNZ   @RF00292                                         01S0292 00843000
@GL00010 SLR   @15,@15                                          01S0292 00844000
         C     @15,FSIOTP                                       01S0292 00845000
         BE    @RF00292                                         01S0292 00846000
*      DO;                                                      01S0293 00847000
*/********************************************************************/ 00848000
*/*                                                                  */ 00849000
*/* SEGMENT NAME - CALLUNAL                                          */ 00850000
*/*                                                                  */ 00851000
*/* DESCRIPTIVE NAME - SET UP FOR AND INVOKE STEP UNALLOCATION       */ 00852000
*/*                                                                  */ 00853000
*/* FUNCTION -                                                       */ 00854000
*/*   THE FUNCTION OF THIS SEGMENT IS TO SET UP FOR AND INVOKE       */ 00855000
*/*   STEP UNALLOCATION CONTROL.                                     */ 00856000
*/*                                                                  */ 00857000
*/*   OPERATION -                                                    */ 00858000
*/*   1. SET UP THE UNALLOCATION FUNCTION MAP -                      */ 00859000
*/*      EACH BIT IN THE UNALLOCATION FUNCTION MAP IS SET AS         */ 00860000
*/*      REQUIRED (SEE THE CODE FOR DETAILS) .                       */ 00861000
*/*                                                                  */ 00862000
*/*   2. MESSAGE INFORMATION (JOB NAME, STEP NAME, PROC STEP NAME)   */ 00863000
*/*      IS SET UP.                                                  */ 00864000
*/*                                                                  */ 00865000
*/*   3. STEP UNALLOCATION IS INVOKED TO UNALLOCATE FOR THE          */ 00866000
*/*      STEP. IF A NON-ZERO RETURN CODE IS RECEIVED, THE RETURN     */ 00867000
*/*      CODE FROM THIS SEGMENT IS SET.                              */ 00868000
*/*                                                          @ZA06981*/ 00869000
*/*   4. IF THIS IS A WARM START, THEN CHECK FOR STEPCATS.   @ZA06981*/ 00870000
*/*      IF STEPCATS EXIST, BUILD A TABLE OF PTRS. TO DATA   @ZA06981*/ 00871000
*/*      SET NAMES FOR ALL SIOTS THAT HAVE THE SIOTJSCT BIT  @ZA06981*/ 00872000
*/*      ON.  TURN ON A BIT IN THE FUNCTION MAP TO BE PASSED @ZA06981*/ 00873000
*/*      TO STEP UNALLOCATION TO INDICATE THAT STEPCATS MAY  @ZA06981*/ 00874000
*/*      BE ALLOCATED AND CATALOG MANAGEMENT MAY DYNAMICALLY @ZA06981*/ 00875000
*/*      ALLOCATE PRIVATE CATALOGS.                          @ZA06981*/ 00876000
*/*                                                                  */ 00877000
*/* ENTRY - IN-LINE SEGMENT                                          */ 00878000
*/*   PURPOSE - SEE FUNCTION                                         */ 00879000
*/*                                                                  */ 00880000
*/*   INPUT -                                                        */ 00881000
*/*     LCT -                                                        */ 00882000
*/*       LCTERROR -                                                 */ 00883000
*/*         LCTJFAIL - JOB HAS FAILED                                */ 00884000
*/*                                                                  */ 00885000
*/*     JCT -                                                        */ 00886000
*/*       JCTSTEPR - STEP WILL RESTART AUTOMATICALLY FROM THE        */ 00887000
*/*                  BEGINNING                                       */ 00888000
*/*       JCTCKPTR - STEP WILL RESTART AUTOMATICALLY FROM A          */ 00889000
*/*                  CHECKPOINT                                      */ 00890000
*/*       JCTWARMS - A WARM START IS IN PROGRESS                     */ 00891000
*/*       INCMALL - MSGLEVEL                                         */ 00892000
*/*       JCTJNAME - JOB NAME                                        */ 00893000
*/*     TCB -                                                        */ 00894000
*/*        TCBFA - STEP ABENDED                                      */ 00895000
*/*                                                                  */ 00896000
*/*     SCT -                                                        */ 00897000
*/*       SCTSNAME - STEP NAME                                       */ 00898000
*/*       SCTSCLPC - PROC STEP NAME                                  */ 00899000
*/*                                                                  */ 00900000
*/*     MASTER SCHEDULER RESIDENT DATA AREA                          */ 00901000
*/*       MSDISPST - MONITOR STATUS IS ACTIVE                        */ 00902000
*/*                                                                  */ 00903000
*/* EXITS -                                                          */ 00904000
*/* 1 CONDITION - NORMAL                                             */ 00905000
*/*                                                                  */ 00906000
*/*   OUTPUT -                                                       */ 00907000
*/*     REQUESTS UNALLOCATED                                         */ 00908000
*/*                                                                  */ 00909000
*/*     STEP ESTAE PARAMETER AREA UPDATED                            */ 00910000
*/*                                                                  */ 00911000
*/*   RETURN CODE - 0                                                */ 00912000
*/*                                                                  */ 00913000
*/* 2 CONDITION - ERROR IN STEP UNALLOCATION                         */ 00914000
*/*                                                                  */ 00915000
*/*   OUTPUT -                                                       */ 00916000
*/*     SOME REQUESTS (OR NONE) UNALLOCATED                          */ 00917000
*/*                                                                  */ 00918000
*/*     STEP ESTAE PARAMETER AREA UPDATED                            */ 00919000
*/*                                                                  */ 00920000
*/*   RETURN CODE - 4                                                */ 00921000
*/********************************************************************/ 00922000
*STUFMAP = STUFMAP && STUFMAP;         /* INIT. STEP UNAL FUNC. MAP  */ 00923000
         XC    STUFMAP(3),STUFMAP                               02S0294 00924000
*STDISPRC = ON;                        /* PROCESS DISPOSITIONS       */ 00925000
         OI    STDISPRC,B'10000000'                             02S0295 00926000
*CATDSNSZ = ZERO;                      /* CLEAR THE POINTER  @ZA06981*/ 00927000
         ST    @15,CATDSNSZ                                     02S0296 00928000
*IF TCBFA = ON & INCMALL = OFF & JCTWARMS = OFF THEN /* ABEND AND       00929000
*                                         MSGLEVEL=0                 */ 00930000
         L     @15,PARMPTR                                      02S0297 00931000
         L     @01,LCTPTR(,@15)                                 02S0297 00932000
         L     @01,LCTTCBAD(,@01)                               02S0297 00933000
         TM    TCBFA(@01),B'10000000'                           02S0297 00934000
         BNO   @RF00297                                         02S0297 00935000
         L     @15,JCTPTR(,@15)                                 02S0297 00936000
         TM    INCMALL(@15),B'10000000'                         02S0297 00937000
         BNZ   @RF00297                                         02S0297 00938000
         TM    JCTWARMS(@15),B'10000000'                        02S0297 00939000
         BNZ   @RF00297                                         02S0297 00940000
*  STALCMSG = ON;                      /* ISSUE ALLOCATION MSGS.     */ 00941000
         OI    STALCMSG,B'01000000'                             02S0298 00942000
*IF INCMALL = ON | TCBFA = ON THEN     /* MSGLEVEL=1 OR ABEND        */ 00943000
@RF00297 L     @15,PARMPTR                                      02S0299 00944000
         L     @01,JCTPTR(,@15)                                 02S0299 00945000
         TM    INCMALL(@01),B'10000000'                         02S0299 00946000
         BO    @RT00299                                         02S0299 00947000
         L     @01,LCTPTR(,@15)                                 02S0299 00948000
         L     @01,LCTTCBAD(,@01)                               02S0299 00949000
         TM    TCBFA(@01),B'10000000'                           02S0299 00950000
         BNO   @RF00299                                         02S0299 00951000
@RT00299 DS    0H                                               02S0300 00952000
*  STDSPMSG = ON;                      /* ISSUE DISP MESSAGES        */ 00953000
         OI    STDSPMSG,B'00100000'                             02S0300 00954000
*IF JCTWARMS = ON THEN                 /* WARM START IN PROGRESS     */ 00955000
@RF00299 L     @15,PARMPTR                                      02S0301 00956000
         L     @01,JCTPTR(,@15)                                 02S0301 00957000
         TM    JCTWARMS(@01),B'10000000'                        02S0301 00958000
         BNO   @RF00301                                         02S0301 00959000
*  DO;                                                          02S0302 00960000
*    STSPSCR = ON;                     /* SPECIAL SCRATCH PROCESSING */ 00961000
         OI    STSPSCR,B'00100000'                              02S0303 00962000
*    STINVUCB = ON;                    /* UCBS IN SIOTS ARE INVALID  */ 00963000
         OI    STINVUCB,B'00001000'                             02S0304 00964000
*    STNOSSDS = ON;                    /* DON'T PROCESS SUBSYSTEM       00965000
*                                         DATA SETS          @YM02473*/ 00966000
         OI    STNOSSDS,B'00010000'                             02S0305 00967000
*    IF SCTPCAT ^= ZERO &              /* DO STEPCATS EXIST? @ZA06981*/ 00968000
*       FSIOTP ^= ZERO &               /* ARE THERE ANY SIOT @ZA06981*/ 00969000
*       SCTCATCT ^= ZERO THEN          /* IS THE NUMBER ZERO @ZA06981*/ 00970000
         SLR   @14,@14                                          02S0306 00971000
         L     @15,SCTPTR(,@15)                                 02S0306 00972000
         CL    @14,SCTPCAT(,@15)                                02S0306 00973000
         BE    @RF00306                                         02S0306 00974000
         C     @14,FSIOTP                                       02S0306 00975000
         BE    @RF00306                                         02S0306 00976000
         SLR   @09,@09                                          02S0306 00977000
         ICM   @09,3,SCTCATCT(@15)                              02S0306 00978000
         CR    @09,@14                                          02S0306 00979000
         BE    @RF00306                                         02S0306 00980000
*      DO;                             /*                    @ZA06981*/ 00981000
*        CATDSNSZ = LENGTH(CATHDR) +   /*                    @ZA06981*/ 00982000
*                   SCTCATCT * LENGTH(CATDSNP); /* SIZE CORE @ZA06981*/ 00983000
         SLA   @09,2                                            02S0308 00984000
         AL    @09,@CF00089                                     02S0308 00985000
         ST    @09,CATDSNSZ                                     02S0308 00986000
*         /* ?GETSTORG (SPID,CATDSNSZ,CATALDSN);*/              02S0309 00987000
*           /* DEFINITIONS OF GETMAIN PARMS */                  02S0309 00988000
*           DCL                                                 02S0309 00989000
*             GTSTR0   FIXED(31) REG(0),/*GTMN PARM REG*/       02S0309 00990000
*             GTSTR1   FIXED(31) REG(1),/*GTMN PARM REG*/       02S0309 00991000
*             GTSTR2   PTR(31)   REG(2),/*GTMN PARM REG*/       02S0309 00992000
*             GTSTR15  FIXED(31) REG(15),/*GTMN RET COD*/       02S0309 00993000
*             GTSTRTCD FIXED(31); /* GETMAIN RTN CODE  */       02S0309 00994000
*           DCL                                                 02S0310 00995000
*             GTSTR3   FIXED(31) REG(3),/* CLEARING REG*/       02S0310 00996000
*             GTSTR4   FIXED(31) REG(4),/* CLEARING REG*/       02S0310 00997000
*             GTSTR5   FIXED(31) REG(5),/* CLEARING REG*/       02S0310 00998000
*             GTSTR6   FIXED(31) REG(6),/* CLEARING REG*/       02S0310 00999000
*             GTSTR7   FIXED(31) REG(7),/* CLEARING REG*/       02S0310 01000000
*             GTSTR8   FIXED(31) REG(8),/* CLEARING REG*/       02S0310 01001000
*             GTSTZERO FIXED(31) INIT(0),                       02S0310 01002000
*             GTST253  FIXED(31) CONSTANT(253);                 02S0310 01003000
*           RFY (GTSTR0,GTSTR1,GTSTR2) RSTD; /*SAVE RGS*/       02S0311 01004000
*           GTSTR0 = CATDSNSZ; /* SET AMOUNT*/                  02S0312 01005000
         LR    GTSTR0,@09                                       02S0312 01006000
*           GTSTR2 = SPID; /* SET SUBPOOL*/                     02S0313 01007000
         LA    GTSTR2,230                                       02S0313 01008000
*           GENERATE CODE;                                      02S0314 01009000
             GETMAIN RC,LV=(0),SP=(2)  DO GETMAIN                       01010000
*           GTSTRTCD = GTSTR15; /* SAVE GETMAIN RET COD*/       02S0315 01011000
         ST    GTSTR15,GTSTRTCD                                 02S0315 01012000
*           CATALDSN = GTSTR1; /* ADDR OF GOTN STORG*/          02S0316 01013000
         ST    GTSTR1,CATALDSN                                  02S0316 01014000
*           RFY (GTSTR0,GTSTR1,GTSTR2) UNRSTD; /*RLSE */        02S0317 01015000
*           IF GTSTRTCD = 0 THEN /*GETMAIN SUCCESSFUL? */       02S0318 01016000
         L     @15,GTSTRTCD                                     02S0318 01017000
         LTR   @15,@15                                          02S0318 01018000
         BNZ   @RF00318                                         02S0318 01019000
*             DO;               /* YES, CLEAR STORAGE.*/        02S0319 01020000
*               RFY (GTSTR2,GTSTR4,GTSTR5,GTSTR6,               02S0320 01021000
*                                  GTSTR7,GTSTR8) RSTD;         02S0320 01022000
*               GTSTR4 = CATALDSN; /*STORG PTR*/                02S0321 01023000
         L     @09,CATALDSN                                     02S0321 01024000
         LR    GTSTR4,@09                                       02S0321 01025000
*               GTSTR5 = CATDSNSZ; /*STORG AMNT*/               02S0322 01026000
         L     GTSTR5,CATDSNSZ                                  02S0322 01027000
*               GTSTR7 = '00000000'X; /*PAD CHAR & LNTH*/       02S0323 01028000
         SLR   GTSTR7,GTSTR7                                    02S0323 01029000
*               IF SPID = GTST253 THEN                          02S0324 01030000
         B     @RF00324                                         02S0324 01031000
*              GEN                                              02S0325 01032000
*           (MODESET KEYADDR=GTSTZERO,SAVEKEY=(2),WORKREG=8);   02S0325 01033000
         MODESET KEYADDR=GTSTZERO,SAVEKEY=(2),WORKREG=8                 01034000
*               GEN REFS(GTSTR4,GTSTR6);                        02S0326 01035000
@RF00324 DS    0H                                               02S0326 01036000
                  MVCL  GTSTR4,GTSTR6 CLEAR GOTTEN STORG                01037000
*               IF SPID = GTST253 THEN                          02S0327 01038000
         B     @RF00327                                         02S0327 01039000
*                 GEN (MODESET KEYADDR=(2));                    02S0328 01040000
         MODESET KEYADDR=(2)                                            01041000
*               RFY (GTSTR2,GTSTR4,GTSTR5,GTSTR6,               02S0329 01042000
*                                  GTSTR7,GTSTR8) UNRSTD;       02S0329 01043000
@RF00327 DS    0H                                               02S0330 01044000
*             END;       /* STORAGE CLEARING COMPLETED */       02S0330 01045000
*           ELSE                                                02S0331 01046000
*           CATALDSN= 0;   /* CLEAR RETURN ADDR. */             02S0331 01047000
         B     @RC00318                                         02S0331 01048000
@RF00318 SLR   @15,@15                                          02S0331 01049000
         ST    @15,CATALDSN                                     02S0331 01050000
*           GTSTR15 = GTSTRTCD;    /* GTMN RETURN CODE */       02S0332 01051000
@RC00318 L     GTSTR15,GTSTRTCD                                 02S0332 01052000
*                                      /* RESTORE LIST PRINT STATUS  */ 01053000
*/* GET CATDSNT   @ZA06981*/                                    02S0333 01054000
*        RFY REG15 RSTD;               /* RESERVE REGISTER   @ZA06981*/ 01055000
*        IF REG15 = ZERO THEN          /* WAS GETMAIN OKAY?  @ZA06981*/ 01056000
         LTR   REG15,REG15                                      02S0334 01057000
         BNZ   @RF00334                                         02S0334 01058000
*          DO;                         /*                    @ZA06981*/ 01059000
*            SIOTPTR = FSIOTP;         /* SET SIOT BASE PTR  @ZA06981*/ 01060000
         L     SIOTPTR,FSIOTP                                   02S0336 01061000
*            DO WHILE (SIOTDSKA ^= SCTPCAT(1:3)); /*FIND PCAT@ZA06981*/ 01062000
         B     @DE00337                                         02S0337 01063000
@DL00337 DS    0H                                               02S0338 01064000
*              SIOTPTR = SIOTNPTR;     /* UPDATE             @ZA06981*/ 01065000
         L     SIOTPTR,SIOTNPTR(,SIOTPTR)                       02S0338 01066000
*            END;                      /*                    @ZA06981*/ 01067000
@DE00337 L     @14,PARMPTR                                      02S0339 01068000
         L     @14,SCTPTR(,@14)                                 02S0339 01069000
         CLC   SIOTDSKA(3,SIOTPTR),SCTPCAT(@14)                 02S0339 01070000
         BNE   @DL00337                                         02S0339 01071000
*            CATNUM = SCTCATCT;        /* SET NUMBER STEPCAT @ZA06981*/ 01072000
         SLR   @09,@09                                          02S0340 01073000
         ICM   @09,3,SCTCATCT(@14)                              02S0340 01074000
         L     @14,CATALDSN                                     02S0340 01075000
         ST    @09,CATNUM(,@14)                                 02S0340 01076000
*            INDEX1 = 1;               /* SET CATDSNP INDEX  @ZA06981*/ 01077000
         LA    @14,1                                            02S0341 01078000
         LR    INDEX1,@14                                       02S0341 01079000
*            DO INDEX = 1 TO SCTCATCT; /* STEPCAT LOOP CNTRL @ZA06981*/ 01080000
         LR    INDEX,@14                                        02S0342 01081000
         B     @DE00342                                         02S0342 01082000
@DL00342 DS    0H                                               02S0343 01083000
*              IF SIOTJSCT = ON THEN   /* DID HSKP TURN OFF? @ZA06981*/ 01084000
         TM    SIOTJSCT(SIOTPTR),B'00000001'                    02S0343 01085000
         BNO   @RF00343                                         02S0343 01086000
*                DO;                   /* NO                 @ZA06981*/ 01087000
*                  CATDSNP(INDEX1)=SJFCBPTR; /* PUT IN TABLE @ZA06981*/ 01088000
         LR    @14,INDEX1                                       02S0345 01089000
         SLA   @14,2                                            02S0345 01090000
         L     @05,SJFCBPTR(,SIOTPTR)                           02S0345 01091000
         L     @01,CATALDSN                                     02S0345 01092000
         ST    @05,CATDSNP-4(@14,@01)                           02S0345 01093000
*                  INDEX1 = INDEX1 + 1;/* UPDATE CATDSNP PTR @ZA06981*/ 01094000
         AH    INDEX1,@CH00070                                  02S0346 01095000
*                END;                  /*                    @ZA06981*/ 01096000
*              ELSE                    /* YES                @ZA06981*/ 01097000
*                CATNUM = CATNUM - 1;  /* DECREASE STEPCATS  @ZA06981*/ 01098000
         B     @RC00343                                         02S0348 01099000
@RF00343 L     @14,CATALDSN                                     02S0348 01100000
         L     @05,CATNUM(,@14)                                 02S0348 01101000
         BCTR  @05,0                                            02S0348 01102000
         ST    @05,CATNUM(,@14)                                 02S0348 01103000
*              SIOTPTR = SIOTNPTR;     /* POINT TO NEXT SIOT @ZA06981*/ 01104000
@RC00343 L     SIOTPTR,SIOTNPTR(,SIOTPTR)                       02S0349 01105000
*            END;                      /* LOOP               @ZA06981*/ 01106000
         AH    INDEX,@CH00070                                   02S0350 01107000
@DE00342 L     @14,PARMPTR                                      02S0350 01108000
         L     @14,SCTPTR(,@14)                                 02S0350 01109000
         SLR   @05,@05                                          02S0350 01110000
         ICM   @05,3,SCTCATCT(@14)                              02S0350 01111000
         CR    INDEX,@05                                        02S0350 01112000
         BNH   @DL00342                                         02S0350 01113000
*            STALSTCT = ON;            /* ALLOCATE STEPCATS  @ZA06981*/ 01114000
         OI    STALSTCT,B'00001000'                             02S0351 01115000
*          END;                        /*                    @ZA06981*/ 01116000
*        ELSE                          /* GET STORG FAILED   @ZA06981*/ 01117000
*          DO;                         /* GETMAIN ERROR      @ZA06981*/ 01118000
         B     @RC00334                                         02S0353 01119000
@RF00334 DS    0H                                               02S0354 01120000
*            CATDSNSZ = ZERO;          /* MAKE SIZE ZERO     @ZA06981*/ 01121000
         SLR   @14,@14                                          02S0354 01122000
         ST    @14,CATDSNSZ                                     02S0354 01123000
*            RETCODE = REG15;          /* SAVE RETURN CODE   @ZA06981*/ 01124000
         ST    REG15,RETCODE                                    02S0355 01125000
*            RESNCODE(1) = GETMAIN;    /* SET REASON CODE    @ZA06981*/ 01126000
         MVC   RESNCODE(2),@CH00070                             02S0356 01127000
*            RFY REG15 UNRSTD;         /* RELEASE REGISTER   @ZA06981*/ 01128000
*          END;                        /* END GETMAIN ERROR  @ZA06981*/ 01129000
*      END;                            /*                    @ZA06981*/ 01130000
*    ELSE                              /*                    @ZA06981*/ 01131000
*      IF SCTPCAT = ZERO &             /* IF PCAT PTR = ZERO @ZA06981*/ 01132000
*         SCTCATCT = ZERO THEN         /* AND COUNT IS ZERO  @ZA06981*/ 01133000
         B     @RC00306                                         02S0360 01134000
@RF00306 SLR   @15,@15                                          02S0360 01135000
         L     @01,PARMPTR                                      02S0360 01136000
         L     @14,SCTPTR(,@01)                                 02S0360 01137000
         CL    @15,SCTPCAT(,@14)                                02S0360 01138000
         BNE   @RF00360                                         02S0360 01139000
         SLR   @09,@09                                          02S0360 01140000
         ICM   @09,3,SCTCATCT(@14)                              02S0360 01141000
         CR    @15,@09                                          02S0360 01142000
         BNE   @RF00360                                         02S0360 01143000
*        DO;                           /*                    @ZA06981*/ 01144000
*          CATALDSN = ZERO;            /* NO PCATS TO ALLOC  @ZA06981*/ 01145000
         ST    @15,CATALDSN                                     02S0362 01146000
*          STALSTCT = ON;              /* ALLOW CAT MGT ALOC @ZA06981*/ 01147000
         OI    STALSTCT,B'00001000'                             02S0363 01148000
*        END;                          /*                    @ZA06981*/ 01149000
*      ELSE                            /* IF PCAT UNLIKE CNT @ZA06981*/ 01150000
*        CATALDSN = ZERO;              /* DONT ALLOC OR ALOW @ZA06981*/ 01151000
         B     @RC00360                                         02S0365 01152000
@RF00360 SLR   @15,@15                                          02S0365 01153000
         ST    @15,CATALDSN                                     02S0365 01154000
*  END;                                                         02S0366 01155000
*ELSE                                  /* NOT WARM START             */ 01156000
*  DO;                                                          02S0367 01157000
         B     @RC00301                                         02S0367 01158000
@RF00301 DS    0H                                               02S0368 01159000
*    STFRDSAB = ON;                    /* FREE DSABS                 */ 01160000
*    STUNUNIT = ON;                    /* UNALLOCATE UNITS           */ 01161000
*    STJES3 = ON;                      /* DO INVOKE JES3     @Y30QPPB*/ 01162000
         OI    STFRDSAB,B'00010011'                             02S0370 01163000
*    STPPCATS = ON;                    /* PROCESS PRIV. CATS @ZA06981*/ 01164000
         OI    STPPCATS,B'00000100'                             02S0371 01165000
*  END;                                                         02S0372 01166000
*IF BASTCNT > ZERO THEN                /* MN STATUS ISSUED           */ 01167000
@RC00301 L     @01,CVTPTR                                       02S0373 01168000
         L     @01,CVTMSER(,@01)                                02S0373 01169000
         ICM   @00,3,BASTCNT(@01)                               02S0373 01170000
         BNP   @RF00373                                         02S0373 01171000
*  STMNSTAT = ON;                      /* ISSUE MN STATUS MESSAGES   */ 01172000
         OI    STMNSTAT,B'00001000'                             02S0374 01173000
*IF TCBFA = ON THEN                    /* STEP HAS ABENDED           */ 01174000
@RF00373 L     @15,PARMPTR                                      02S0375 01175000
         L     @01,LCTPTR(,@15)                                 02S0375 01176000
         L     @01,LCTTCBAD(,@01)                               02S0375 01177000
         TM    TCBFA(@01),B'10000000'                           02S0375 01178000
         BNO   @RF00375                                         02S0375 01179000
*  IF JCTSTEPR = ON THEN               /* STEP WILL RESTART FROM        01180000
*                                         THE BEGINNING              */ 01181000
         L     @01,JCTPTR(,@15)                                 02S0376 01182000
         TM    JCTSTEPR(@01),B'00000100'                        02S0376 01183000
         BNO   @RF00376                                         02S0376 01184000
*    DO;                                                        02S0377 01185000
*      STKPDEL = ON;                   /* KEEP OLD, DELETE NEW       */ 01186000
         OI    STKPDEL,B'00010000'                              02S0378 01187000
*      STUPJFCB = ON;                  /* UPDATE MOD JFCBS           */ 01188000
         OI    STUPJFCB,B'00000100'                             02S0379 01189000
*      STPURGE = ON;                   /* USE OVRD FOR SCRATCH       */ 01190000
         OI    STPURGE,B'00000010'                              02S0380 01191000
*    END;                                                       02S0381 01192000
*  ELSE                                /* NO STEP RESTART            */ 01193000
*    IF JCTCKPTR = ON THEN             /* RESTART FROM A CHECKPOINT  */ 01194000
         B     @RC00376                                         02S0382 01195000
@RF00376 L     @01,PARMPTR                                      02S0382 01196000
         L     @01,JCTPTR(,@01)                                 02S0382 01197000
         TM    JCTCKPTR(@01),B'00001000'                        02S0382 01198000
         BNO   @RF00382                                         02S0382 01199000
*      DO;                                                      02S0383 01200000
*        STNOVUT = ON;                 /* DON'T DO VUT PROCESSING    */ 01201000
*        STPUBPRV = ON;                /* CHANGE OPENED PUB TAPES TO    01202000
*                                         PRIVATE SO OTHER JOBS WON'T   01203000
*                                         ALLOCATE THEM FOR PUBLIC      01204000
*                                         USE                        */ 01205000
         OI    STNOVUT,B'11000000'                              02S0385 01206000
*        STKEEP = ON;                  /* KEEP ALL DATA SETS         */ 01207000
         OI    STKEEP,B'01000000'                               02S0386 01208000
*      END;                                                     02S0387 01209000
*    ELSE                              /* NO RESTART                 */ 01210000
*      DO;                                                      02S0388 01211000
         B     @RC00382                                         02S0388 01212000
@RF00382 DS    0H                                               02S0389 01213000
*        STPASS = ON;                  /* ALWAYS DO PASS AS PASS     */ 01214000
*        STCNDISP = ON;                /* USE CONDITIONAL DISP       */ 01215000
         OI    STPASS,B'00100100'                               02S0390 01216000
*      END;                                                     02S0391 01217000
*ELSE                                  /* STEP DID NOT ABEND         */ 01218000
*  IF LCTJFAIL = ON THEN               /* JOB FAILED IN ALLOCATION   */ 01219000
         B     @RC00375                                         02S0392 01220000
@RF00375 L     @01,PARMPTR                                      02S0392 01221000
         L     @01,LCTPTR(,@01)                                 02S0392 01222000
         TM    LCTJFAIL(@01),B'10000000'                        02S0392 01223000
         BNO   @RF00392                                         02S0392 01224000
*    DO;                                                        02S0393 01225000
*      STPASS = ON;                    /* ALWAYS DO PASS AS PASS     */ 01226000
*      STKPDEL = ON;                   /* KEEP OLD, DELETE NEW       */ 01227000
*      STPURGE = ON;                   /* USE OVRD ON SCRATCH        */ 01228000
*      STCHKPAS = ON;                  /* CHECK FOR DATA SET IN PDI  */ 01229000
         OI    STPASS,B'00010111'                               02S0397 01230000
*    END;                                                       02S0398 01231000
*  ELSE                                /* JOB HAS NOT FAILED         */ 01232000
*    STNMDISP = ON;                    /* USE NORMAL DISPOSITION     */ 01233000
         B     @RC00392                                         02S0399 01234000
@RF00392 OI    STNMDISP,B'10000000'                             02S0399 01235000
*MSGJNAME = JCTJNAME;                  /* JOB NAME TO MSG HDR AREA   */ 01236000
@RC00392 DS    0H                                               02S0400 01237000
@RC00375 L     @15,PARMPTR                                      02S0400 01238000
         L     @14,JCTPTR(,@15)                                 02S0400 01239000
         MVC   MSGJNAME(8),JCTJNAME(@14)                        02S0400 01240000
*MSGSNAME = SCTSNAME;                  /* STEP NAME TO MSG HDR AREA  */ 01241000
         L     @09,SCTPTR(,@15)                                 02S0401 01242000
         MVC   MSGSNAME(8),SCTSNAME(@09)                        02S0401 01243000
*MSGPSNAM = SCTSCLPC;                  /* PROC NAME TO MSG HDR AREA  */ 01244000
         MVC   MSGPSNAM(8),SCTSCLPC(@09)                        02S0402 01245000
*ESTASTEP = OFF;                       /* STEP UNALOC TRIED INDICATOR*/ 01246000
         L     @01,ESTAPTR                                      02S0403 01247000
         NI    ESTASTEP(@01),B'01111111'                        02S0403 01248000
*CALL IEFBB414                         /* INVOKE STEP UNALLOCATION   */ 01249000
*   (STUFMAP,LCTJSCB,FSIOTP,JCTDETDA,MSGINFO,SCTSNUMB,          02S0404 01250000
*    JCTVULDP,RESNCODE(3),CATALDSN);   /* PASS CATDSNT PTR   @ZA06981*/ 01251000
         LA    @08,STUFMAP                                      02S0404 01252000
         ST    @08,@AL00001                                     02S0404 01253000
         L     @01,LCTPTR(,@15)                                 02S0404 01254000
         LA    @15,LCTJSCB(,@01)                                02S0404 01255000
         ST    @15,@AL00001+4                                   02S0404 01256000
         LA    @15,FSIOTP                                       02S0404 01257000
         ST    @15,@AL00001+8                                   02S0404 01258000
         LA    @15,JCTDETDA(,@14)                               02S0404 01259000
         ST    @15,@AL00001+12                                  02S0404 01260000
         LA    @15,MSGINFO                                      02S0404 01261000
         ST    @15,@AL00001+16                                  02S0404 01262000
         LA    @15,SCTSNUMB(,@09)                               02S0404 01263000
         ST    @15,@AL00001+20                                  02S0404 01264000
         LA    @15,JCTVULDP(,@14)                               02S0404 01265000
         ST    @15,@AL00001+24                                  02S0404 01266000
         LA    @15,RESNCODE+4                                   02S0404 01267000
         ST    @15,@AL00001+28                                  02S0404 01268000
         LA    @15,CATALDSN                                     02S0404 01269000
         ST    @15,@AL00001+32                                  02S0404 01270000
         L     @15,@CV00293                                     02S0404 01271000
         LA    @01,@AL00001                                     02S0404 01272000
         BALR  @14,@15                                          02S0404 01273000
*RFY REG15 RSTD;                       /* RESERVE REGISTER           */ 01274000
*IF REG15 ^= ZERO THEN                 /* ERROR IN STEP UNALLOCATION */ 01275000
         LTR   REG15,REG15                                      02S0406 01276000
         BZ    @RF00406                                         02S0406 01277000
*  RETCODE = ERROR;                    /* SET BAD RETURN CODE        */ 01278000
         MVC   RETCODE(4),@CF00089                              02S0407 01279000
*RFY REG15 UNRSTD;                     /* RELEASE REGISTER           */ 01280000
@RF00406 DS    0H                                               02S0409 01281000
*IF CATDSNSZ ^= ZERO THEN              /* WAS GETMAIN OKAY?  @ZA06981*/ 01282000
         L     @15,CATDSNSZ                                     02S0409 01283000
         LTR   @15,@15                                          02S0409 01284000
         BZ    @RF00409                                         02S0409 01285000
*  DO;                                 /* YES                @ZA06981*/ 01286000
*    RFY (REG0,REG1) RSTD;             /* RESTRICT REGISTERS @ZA06981*/ 01287000
*    REG0 = CATDSNSZ;                  /* GET SIZE TO FREE   @ZA06981*/ 01288000
         LR    REG0,@15                                         02S0412 01289000
*    REG0 = REG0 | SUBPL230;           /* SUBPOOL ID TO FREE @ZA06981*/ 01290000
         O     REG0,@CF00271                                    02S0413 01291000
*    REG1 = CATALDSN;                  /* ADDRESS TO FREE    @ZA06981*/ 01292000
         L     REG1,CATALDSN                                    02S0414 01293000
*    GEN(FREEMAIN R,LV=(0),A=(1));     /* FREEMAIN CATDSNT   @ZA06981*/ 01294000
         FREEMAIN R,LV=(0),A=(1)                                        01295000
*    RFY (REG0,REG1) UNRSTD;           /* RELEASE THE REGS   @ZA06981*/ 01296000
*  END;                                /*                    @ZA06981*/ 01297000
*ELSE;                                 /* GET FAILED NO FREE @ZA06981*/ 01298000
@RF00409 DS    0H                                               02S0419 01299000
*      END;                                                     01S0419 01300000
*    ELSE                              /* INSURE CATALOGS    @YM04224*/ 01301000
*      DO;                             /* ARE CLOSED AND     @YM04224*/ 01302000
         B     @RC00292                                         01S0420 01303000
@RF00292 DS    0H                                               01S0421 01304000
*        UCCNTRLS = ZERO;              /* THEIR PCCBS FREE'D @YM04224*/ 01305000
         SLR   @15,@15                                          01S0421 01306000
         STH   @15,UCCNTRLS                                     01S0421 01307000
*        UCALLACB = ON;                /* IF STEP UNALOC     @YM04224*/ 01308000
*        UCALPCCB = ON;                /* IS BYPASSED.       @YM04224*/ 01309000
         OI    UCALLACB,B'00000101'                             01S0423 01310000
*        UNCATRTN = ZERO;              /* DUMMY RETURN INFO  @YM04224*/ 01311000
         ST    @15,UNCATRTN                                     01S0424 01312000
*        CALL IEFAB4F4(UCCNTRLS,ADDR(UNCATRTN),ZERO,ZERO,ZERO,LCTJSCB); 01313000
         LA    @15,UCCNTRLS                                     01S0425 01314000
         ST    @15,@AL00001                                     01S0425 01315000
         LA    @15,UNCATRTN                                     01S0425 01316000
         ST    @15,@TF00001                                     01S0425 01317000
         LA    @15,@TF00001                                     01S0425 01318000
         ST    @15,@AL00001+4                                   01S0425 01319000
         LA    @15,@CF00276                                     01S0425 01320000
         ST    @15,@AL00001+8                                   01S0425 01321000
         LA    @15,@CF00276                                     01S0425 01322000
         ST    @15,@AL00001+12                                  01S0425 01323000
         LA    @15,@CF00276                                     01S0425 01324000
         ST    @15,@AL00001+16                                  01S0425 01325000
         L     @01,PARMPTR                                      01S0425 01326000
         L     @01,LCTPTR(,@01)                                 01S0425 01327000
         LA    @15,LCTJSCB(,@01)                                01S0425 01328000
         ST    @15,@AL00001+20                                  01S0425 01329000
         L     @15,@CV00289                                     01S0425 01330000
         LA    @01,@AL00001                                     01S0425 01331000
         BALR  @14,@15                                          01S0425 01332000
*      END;                                                     01S0426 01333000
*/********************************************************************/ 01334000
*/* SEGMENT NAME - ENDOSTEP                                          */ 01335000
*/*                                                                  */ 01336000
*/* DESCRIPTIVE NAME - END OF STEP PROCESSING                        */ 01337000
*/*                                                                  */ 01338000
*/* FUNCTION -                                                       */ 01339000
*/*   THE FUNCTION OF THIS SEGMENT IS TO PERFORM THE FOLLOWING       */ 01340000
*/*   FUNCTIONS AT THE END OF EACH STEP:                             */ 01341000
*/*                                                                  */ 01342000
*/*    1. INVOKE THE SMF/USER ACCOUNTING ROUTINE                     */ 01343000
*/*       THE SMF ACCOUNTING ROUTINE IS INVOKED TO WRITE THE         */ 01344000
*/*       END OF STEP RECORD AND INVOKE THE USER ACCOUNTING          */ 01345000
*/*       ROUTINE. THE USER ACCOUNTING ROUTINE MAY FAIL THE          */ 01346000
*/*       JOB AT THIS TIME.                                          */ 01347000
*/*                                                                  */ 01348000
*/*    2. FREE THE TIOT AND DSAB QDB                                 */ 01349000
*/*       THE TIOT MANAGER IS INVOKED TO FREE THE TIOT AND           */ 01350000
*/*       THE DSAB QDB FOR THIS STEP.                                */ 01351000
*/*                                                                  */ 01352000
*/*    3. SET END OF STEP INFORMATION - THE FOLLOWING FIELDS AND     */ 01353000
*/*       INDICATORS ARE SET:                                        */ 01354000
*/*                                                                  */ 01355000
*/*       SCT STEP ABEND BIT - IF THE STEP ABENDED                   */ 01356000
*/*       JCT STEP ABEND BIT - IF THE STEP ABENDED                   */ 01357000
*/*       SCT STEP ENDED BIT - ALWAYS SET ON                         */ 01358000
*/*       JSCB JSCSIOTS BIT - INDICATES THAT A CHECKPOINT TAKEN IN A */ 01359000
*/*                           SUBSEQUENT STEP SHOULD NOT SCAN THE    */ 01360000
*/*                           SIOT CHAIN FOR DYNAMICALLY UNALLOCATED */ 01361000
*/*                           SIOTS                                  */ 01362000
*/*       JCT CHECKPOINT - TAKEN BIT - SET OFF IF THIS       @YM08130*/ 01363000
*/*         STEP WILL NOT AUTOMATICALLY RESTART. THIS        @YM08130*/ 01364000
*/*         MUST BE DONE TO PREVENT SUBSEQUENT STEPS         @YM08130*/ 01365000
*/*         FROM APPEARING TO HAVE TAKEN A CHECKPOINT        @YM08130*/ 01366000
*/*         WITHOUT HAVING DONE SO.                          @YM08130*/ 01367000
*/*                                                          @G24LPSJ*/ 01368000
*/*    4. IF THE LCTVTERM FLAG IS ON, MSS SELECTS WERE       @G24LPSJ*/ 01369000
*/*       DONE AND AN MSS TERMINATE IS REQUIRED. THE         @G24LPSJ*/ 01370000
*/*       MSS TERMINATE IS ISSUED.                           @G24LPSJ*/ 01371000
*/*                                                                  */ 01372000
*/*    OPERATION -                                                   */ 01373000
*/*      OPERATION IS DOCUMENTED IN THE CODE                         */ 01374000
*/*                                                                  */ 01375000
*/* ENTRY - IN-LINE SEGMENT                                          */ 01376000
*/*                                                                  */ 01377000
*/*   PURPOSE - SEE FUNCTION                                         */ 01378000
*/*                                                                  */ 01379000
*/*   INPUT -                                                        */ 01380000
*/*                                                                  */ 01381000
*/*     LCT -                                                        */ 01382000
*/*       LCTJFAIL - JOB FAILED BIT                                  */ 01383000
*/*       LCTSFAIL - STEP BYPASSED BIT                               */ 01384000
*/*       LCTJSCB - P/P JSCB ADDRESS                                 */ 01385000
*/*       LCTVTERM - MSS TERMINATE REQUIRED IF ON            @G24LPSJ*/ 01386000
*/*                                                                  */ 01387000
*/*     JCT -                                                        */ 01388000
*/*       JCTSTEPR - STEP WILL AUTOMATICALLY RESTART FROM THE        */ 01389000
*/*         BEGINNING                                                */ 01390000
*/*       JCTCKPTR - STEP WILL AUTOMATICALLY RESTART FROM A          */ 01391000
*/*         CHECK POINT.                                             */ 01392000
*/*       JCTSWSM - SUPRESS ALL MESSAGES                             */ 01393000
*/*                                                                  */ 01394000
*/*     TCB -                                                        */ 01395000
*/*       TCBFA - ABEND BIT                                          */ 01396000
*/*                                                                  */ 01397000
*/* EXIT -                                                           */ 01398000
*/* 1 CONDITION - NORMAL                                             */ 01399000
*/*                                                                  */ 01400000
*/*   OUTPUT -                                                       */ 01401000
*/*                                                                  */ 01402000
*/*     TIOT AND DSAB QDB FREED                                      */ 01403000
*/*                                                                  */ 01404000
*/*     SCT -                                                        */ 01405000
*/*       SCTABCND - EIGHTH CONDITION CODE                           */ 01406000
*/*       SCTABEND - SCT ABEND BIT                                   */ 01407000
*/*       SCTSTPND - STEP ENDED BIT                                  */ 01408000
*/*                                                                  */ 01409000
*/*     JCT -                                                        */ 01410000
*/*       JCTABEND - JCT ABEND BIT                                   */ 01411000
*/*       JCTCKFT - CHECKPOINT TAKEN                         @YM08130*/ 01412000
*/*                                                                  */ 01413000
*/*    RETURN CODE - 0                                               */ 01414000
*/*                                                                  */ 01415000
*/* 2 CONDITION - JOB FAILED BY USER ACCOUNTING ROUTINE OR JOB       */ 01416000
*/*               CANCELLED                                          */ 01417000
*/*                                                                  */ 01418000
*/*   OUTPUT - SAME AS ABOVE                                         */ 01419000
*/*                                                                  */ 01420000
*/*   RETURN CODE - 4                                                */ 01421000
*/*                                                                  */ 01422000
*/********************************************************************/ 01423000
*LCTPARM1 = SMFEOS;                    /* SET EOS CODE FOR SMF       */ 01424000
@RC00292 L     @15,PARMPTR                                      02S0427 01425000
         L     @01,LCTPTR(,@15)                                 02S0427 01426000
         MVC   LCTPARM1(4,@01),@CF00034                         02S0427 01427000
*CALL IEFTB721(LCTPTR,TIOTPTR);        /* SET UP FOR USER ACCT RTN   */ 01428000
         ST    @15,@AL00001                                     02S0428 01429000
         L     @01,TIOTLP(,@15)                                 02S0428 01430000
         ST    @01,@AL00001+4                                   02S0428 01431000
         L     @15,@CV00291                                     02S0428 01432000
         LA    @01,@AL00001                                     02S0428 01433000
         BALR  @14,@15                                          02S0428 01434000
*RFY REG15 RSTD;                       /* RESERVE REGISTER           */ 01435000
*IF REG15 ^= ZERO THEN                 /* JOB FAILED BY ACCT RTN     */ 01436000
         LTR   REG15,REG15                                      02S0430 01437000
         BZ    @RF00430                                         02S0430 01438000
*  RETCODE = ERROR;                    /* INDIC JOB FAILED           */ 01439000
         MVC   RETCODE(4),@CF00089                              02S0431 01440000
*RFY REG15 UNRSTD;                     /* RELEASE REGISTER           */ 01441000
@RF00430 DS    0H                                               02S0433 01442000
*TIOMGRRB = TIOMGRRB && TIOMGRRB;      /* ZERO TIOT MGR RB           */ 01443000
         LA    @15,TMCORE                                       02S0433 01444000
         XC    TIOMGRRB(38,@15),TIOMGRRB(@15)                   02S0433 01445000
*TIOMFREE = ON;                        /* FREE TIOT AND DSAB QDB     */ 01446000
         OI    TIOMFREE(@15),B'00000001'                        02S0434 01447000
*TIOMJSCP = LCTJSCB;                   /* SET JSCB PTR               */ 01448000
         L     @01,PARMPTR                                      02S0435 01449000
         L     @01,LCTPTR(,@01)                                 02S0435 01450000
         MVC   TIOMJSCP(4,@15),LCTJSCB(@01)                     02S0435 01451000
*CALL IEFAB4FC(ADDR(TIOMGRRB));        /* FREE TIOT & QDB            */ 01452000
         ST    @15,@TF00001                                     02S0436 01453000
         LA    @15,@TF00001                                     02S0436 01454000
         ST    @15,@AL00001                                     02S0436 01455000
         L     @15,@CV00285                                     02S0436 01456000
         LA    @01,@AL00001                                     02S0436 01457000
         BALR  @14,@15                                          02S0436 01458000
* DO; /*MODESET  KEYADDR(ZERO)*/                                02S0437 01459000
*   SPKA (ZERO); /*SET PSW KEY*/                                02S0438 01460000
         SLR   @01,@01                                          02S0438 01461000
         SPKA  0(@01)                                           02S0438 01462000
* END; /*MODESET  KEYADDR(ZERO)*/                               02S0439 01463000
*JSCSIOTS = OFF;                       /* CHKPT MUST NOT SCAN SIOTS  */ 01464000
         L     @15,PARMPTR                                      02S0440 01465000
         L     @14,LCTPTR(,@15)                                 02S0440 01466000
         L     @09,LCTJSCB(,@14)                                02S0440 01467000
         NI    JSCSIOTS(@09),B'11111101'                        02S0440 01468000
*TIOTLP = ZERO;                        /* TIOT IS GONE               */ 01469000
         ST    @01,TIOTLP(,@15)                                 02S0441 01470000
* DO; /*MODESET  EXTKEY(SCHED)*/                                02S0442 01471000
*   SPKA (16); /*SET PSW KEY*/                                  02S0443 01472000
         LA    @01,16                                           02S0443 01473000
         SPKA  0(@01)                                           02S0443 01474000
* END; /*MODESET  EXTKEY(SCHED)*/                               02S0444 01475000
*SCTCDENT(8) = SCTCDENT(8) && SCTCDENT(8); /*0 8TH COND CODE @YM04230*/ 01476000
         L     @09,SCTPTR(,@15)                                 02S0445 01477000
         XC    SCTCDENT+42(6,@09),SCTCDENT+42(@09)              02S0445 01478000
*IF TCBFA = ON &                       /* STEP ABENDED               */ 01479000
*    (JCTSTEPR = OFF & JCTCKPTR = OFF) THEN /* NO RESTART            */ 01480000
         L     @01,LCTTCBAD(,@14)                               02S0446 01481000
         TM    TCBFA(@01),B'10000000'                           02S0446 01482000
         BNO   @RF00446                                         02S0446 01483000
         L     @15,JCTPTR(,@15)                                 02S0446 01484000
         TM    JCTSTEPR(@15),B'00001100'                        02S0446 01485000
         BNZ   @RF00446                                         02S0446 01486000
*  DO;                                                          02S0447 01487000
*    SCTABEND = ON;                    /* SCT STEP ABEND BIT         */ 01488000
         LA    @14,SCTCDENT(,@09)                               02S0448 01489000
         OI    SCTABEND+42(@14),B'00000100'                     02S0448 01490000
*    JCTABEND = ON;                    /* JCT ABEND BIT              */ 01491000
         OI    JCTABEND(@15),B'00001000'                        02S0449 01492000
*  END;                                                         02S0450 01493000
*IF JCTSTEPR = OFF &                   /* NO STEP RESTART    @YM08130*/ 01494000
*   JCTCKPTR = OFF THEN                /* NO CKPT RESTART    @YM08130*/ 01495000
@RF00446 L     @01,PARMPTR                                      02S0451 01496000
         L     @15,JCTPTR(,@01)                                 02S0451 01497000
         TM    JCTSTEPR(@15),B'00001100'                        02S0451 01498000
         BNZ   @RF00451                                         02S0451 01499000
*  JCTCKFT = OFF;                      /* RESET 'CHECKPOINT     02S0452 01500000
*                                         TAKEN' INDICATOR.  @YM08130*/ 01501000
         NI    JCTCKFT(@15),B'11101111'                         02S0452 01502000
*IF CHCLD = ON THEN                    /* JOB WAS CANCELLED          */ 01503000
@RF00451 L     @01,PARMPTR                                      02S0453 01504000
         L     @01,LCTPTR(,@01)                                 02S0453 01505000
         L     @01,LCTQDRTY(,@01)                               02S0453 01506000
         TM    CHCLD(@01),B'00000100'                           02S0453 01507000
         BNO   @RF00453                                         02S0453 01508000
*  RETCODE = ERROR;                    /* INDIC JOB FAILED           */ 01509000
         MVC   RETCODE(4),@CF00089                              02S0454 01510000
*SCTSTPND = ON;                        /* STEP HAS ENDED             */ 01511000
@RF00453 L     @15,PARMPTR                                      02S0455 01512000
         L     @01,SCTPTR(,@15)                                 02S0455 01513000
         OI    SCTSTPND(@01),B'01000000'                        02S0455 01514000
*IF LCTVTERM = ON THEN                 /* IF MSS TERMINATE   @G24LPSJ*/ 01515000
         L     @15,LCTPTR(,@15)                                 02S0456 01516000
         TM    LCTVTERM(@15),B'00000010'                        02S0456 01517000
         BNO   @RF00456                                         02S0456 01518000
*  DO;                                 /* REQUIRED THEN      @G24LPSJ*/ 01519000
*/********************************************************** @G24LPSJ*/ 01520000
*/*                                                          @G24LPSJ*/ 01521000
*/* SEGMENT NAME - TERMCALL                                  @G24LPSJ*/ 01522000
*/*                                                          @G24LPSJ*/ 01523000
*/* DESCRIPTIVE NAME - MSS TERMINATE PROCESSOR               @G24LPSJ*/ 01524000
*/*                                                          @G24LPSJ*/ 01525000
*/* FUNCTION -                                               @G24LPSJ*/ 01526000
*/*                                                          @G24LPSJ*/ 01527000
*/*     THIS SEGMENT ISSUES THE MSS TERMINATE IF THERE       @G24LPSJ*/ 01528000
*/*     WAS A COMMON ALLOCATION FAILURE.                     @G24LPSJ*/ 01529000
*/*                                                          @G24LPSJ*/ 01530000
*/* OPERATION -                                              @G24LPSJ*/ 01531000
*/*                                                          @G24LPSJ*/ 01532000
*/*      THE TERMINATE CONTROL BLOCK AREA IS CLEARED AND     @G24LPSJ*/ 01533000
*/*      INITIALIZED. THE ADDRESS OF THIS AREA IS PASSED     @G24LPSJ*/ 01534000
*/*      TO THE MSSC IN REGISTER 1 VIA SVC 126. NO RETURN    @G24LPSJ*/ 01535000
*/*      CODES ARE PROCESSED UPON RETURN.                    @G24LPSJ*/ 01536000
*/*                                                          @G24LPSJ*/ 01537000
*/* ENTRY - IN-LINE SEGMENT                                  @G24LPSJ*/ 01538000
*/*                                                          @G24LPSJ*/ 01539000
*/*   PURPOSE - SEE FUNCTION                                 @G24LPSJ*/ 01540000
*/*   INPUT   - ASCBASID                                     @G24LPSJ*/ 01541000
*/*                                                          @G24LPSJ*/ 01542000
*/* EXIT -                                                   @G24LPSJ*/ 01543000
*/*                                                          @G24LPSJ*/ 01544000
*/*   CONDITION - MSS TERMINATE ISSUED                       @G24LPSJ*/ 01545000
*/*       OUTPUT       - NONE                                @G24LPSJ*/ 01546000
*/*       RETURN CODES - NONE                                @G24LPSJ*/ 01547000
*/*                                                          @G24LPSJ*/ 01548000
*/********************************************************** @G24LPSJ*/ 01549000
*RFY TRMRB BASED(ADDR(TERMAREA)); /* SET ADDR FOR TERMINATE     03S0458 01550000
*                                    REQUEST BLOCK           @G24LPSJ*/ 01551000
*TRMRB = TRMRB && TRMRB;          /* CLEAR BLOCK             @G24LPSJ*/ 01552000
         LA    @03,TERMAREA                                     03S0459 01553000
         XC    TRMRB(16,@03),TRMRB(@03)                         03S0459 01554000
*TRMRBLEN = LENGTH(TRMRB);        /* SET TERM LENGTH         @G24LPSJ*/ 01555000
         MVC   TRMRBLEN(4,@03),@CF00054                         03S0460 01556000
*TRMRBOPC = TRMOPCD;              /* SET TERM OP CODE        @G24LPSJ*/ 01557000
         MVI   TRMRBOPC(@03),X'8A'                              03S0461 01558000
*ASCBPTR = LCTASCBA;              /* SET ASCB ADDRESS        @G24LPSJ*/ 01559000
         L     ASCBPTR,LCTASCBA(,@15)                           03S0462 01560000
*TRMJOBID = ASCBASID;             /* SET ASID OF STEP        @G24LPSJ*/ 01561000
         SLR   @15,@15                                          03S0463 01562000
         ICM   @15,3,ASCBASID(ASCBPTR)                          03S0463 01563000
         ST    @15,TRMJOBID(,@03)                               03S0463 01564000
*RFY REG1 RSTD;                   /* RESTRICT REG 1          @G24LPSJ*/ 01565000
*REG1 = ADDR(TRMRB);              /* LOAD ADDR TRMTRB        @G24LPSJ*/ 01566000
         LR    REG1,@03                                         03S0465 01567000
*SVC (126);                       /* CALL MSSC               @G24LPSJ*/ 01568000
         SVC   126                                              03S0466 01569000
*RFY REG1 UNRSTD;                 /* RELEASE REG 1TH         @G24LPSJ*/ 01570000
*  END;                                /*                    @G24LPSJ*/ 01571000
*    IF RETCODE ^= ZERO THEN           /* JOB NEEDS TO BE FAILED     */ 01572000
@RF00456 ICM   @15,15,RETCODE                                   01S0469 01573000
         BZ    @RF00469                                         01S0469 01574000
*      LCTJFAIL = ON;                  /* FAIL THE JOB               */ 01575000
         L     @01,PARMPTR                                      01S0470 01576000
         L     @01,LCTPTR(,@01)                                 01S0470 01577000
         OI    LCTJFAIL(@01),B'10000000'                        01S0470 01578000
*    IF LCTJFAIL = OFF &        /* JOB HAS NOT FAILED         */        01579000
*      SCTANSCT ^= ZERO &       /* NOT THE LAST STEP          */        01580000
*      (JCTSTEPR = OFF & JCTCKPTR = OFF) & /* NO RESTART      */        01581000
*      JCTWARMS = OFF &         /* NOT WARM START             */        01582000
*      TCBFA = OFF THEN/*                                       01S0471 01583000
*                                         CHECK JOB COND CODE        */ 01584000
@RF00469 L     @15,PARMPTR                                      01S0471 01585000
         L     @14,LCTPTR(,@15)                                 01S0471 01586000
         TM    LCTJFAIL(@14),B'10000000'                        01S0471 01587000
         BNZ   @RF00471                                         01S0471 01588000
         L     @01,SCTPTR(,@15)                                 01S0471 01589000
         ICM   @00,7,SCTANSCT(@01)                              01S0471 01590000
         BZ    @RF00471                                         01S0471 01591000
         L     @01,JCTPTR(,@15)                                 01S0471 01592000
         TM    JCTSTEPR(@01),B'10001100'                        01S0471 01593000
         BNZ   @RF00471                                         01S0471 01594000
         L     @01,LCTTCBAD(,@14)                               01S0471 01595000
         TM    TCBFA(@01),B'10000000'                           01S0471 01596000
         BNZ   @RF00471                                         01S0471 01597000
*      DO;                                                      01S0472 01598000
*        CALL IEFBB412                 /* PROCESS JOB COND CODES     */ 01599000
*            (JCTPTR,SCTPTR);                                   01S0473 01600000
         LA    @14,JCTPTR(,@15)                                 01S0473 01601000
         ST    @14,@AL00001                                     01S0473 01602000
         LA    @15,SCTPTR(,@15)                                 01S0473 01603000
         ST    @15,@AL00001+4                                   01S0473 01604000
         L     @15,@CV00292                                     01S0473 01605000
         LA    @01,@AL00001                                     01S0473 01606000
         BALR  @14,@15                                          01S0473 01607000
*        RFY REG15 RSTD;               /* RESERVE REGISTER           */ 01608000
*        IF REG15 ^= ZERO THEN         /* PROCESSING FAILED          */ 01609000
         LTR   REG15,REG15                                      01S0475 01610000
         BZ    @RF00475                                         01S0475 01611000
*          DO;                                                  01S0476 01612000
*            LCTJFAIL = ON;            /* MARK JOB AS FAILED         */ 01613000
         L     @14,PARMPTR                                      01S0477 01614000
         L     @14,LCTPTR(,@14)                                 01S0477 01615000
         OI    LCTJFAIL(@14),B'10000000'                        01S0477 01616000
*            CONDFAIL = ON;            /* SET COND FAIL              */ 01617000
         OI    CONDFAIL,B'00010000'                             01S0478 01618000
*          END;                                                 01S0479 01619000
*        RFY REG15 UNRSTD;             /* RELEASE REGISTER           */ 01620000
@RF00475 DS    0H                                               01S0481 01621000
*      END;                                                     01S0481 01622000
*    IF (JCTSTEPR = ON | JCTCKPTR = ON) /* STEP WILL RESTART         */ 01623000
*      | LCTJFAIL = ON                 /* JOB IS FAILED              */ 01624000
*      | SCTANSCT = ZERO THEN          /* JOB IS ENDING              */ 01625000
@RF00471 L     @15,PARMPTR                                      01S0482 01626000
         L     @01,JCTPTR(,@15)                                 01S0482 01627000
         TM    JCTSTEPR(@01),B'00001100'                        01S0482 01628000
         BNZ   @RT00482                                         01S0482 01629000
         L     @01,LCTPTR(,@15)                                 01S0482 01630000
         TM    LCTJFAIL(@01),B'10000000'                        01S0482 01631000
         BO    @RT00482                                         01S0482 01632000
         L     @01,SCTPTR(,@15)                                 01S0482 01633000
         ICM   @00,7,SCTANSCT(@01)                              01S0482 01634000
         BNZ   @RF00482                                         01S0482 01635000
@RT00482 DS    0H                                               01S0483 01636000
*      DO;                                                      01S0483 01637000
*        DEQLIST(1:DEQENTLN) =         /*MOVE DEQ LIST SKELETON      */ 01638000
*           DEQFMT(1:DEQENTLN);                                 01S0484 01639000
         L     @15,DEQENTLN                                     01S0484 01640000
         BCTR  @15,0                                            01S0484 01641000
         EX    @15,@SM03014                                     01S0484 01642000
*        GEN REFS(DEQLIST,VOLUMES,DATASETS,OPENJ); /*DEQ'S   @ZA13820*/ 01643000
          DEQ (VOLUMES,,,SYSTEM),MF=(E,DEQLIST),RET=HAVE,GENERIC=YES    01644000
          DEQ (DATASETS,,,SYSTEM),MF=(E,DEQLIST),RET=HAVE,GENERIC=YES   01645000
          DEQ (OPENJ,,,SYSTEM),MF=(E,DEQLIST),RET=HAVE,GENERIC=YES      01646000
*                                      DEQ ON OPENJ RESOURCE @ZA13820   01647000
*      END;                                                     01S0486 01648000
*    IF (SCTANSCT = ZERO &      /* LAST STEP                  */        01649000
*       (JCTSTEPR = OFF & JCTCKPTR = OFF)) | /* NO RESTART    */        01650000
*       LCTJFAIL = ON & LCTSALCD = ON THEN/*                    01S0487 01651000
*                                         INVOKE JOB UNALLOCATION    */ 01652000
@RF00482 L     @15,PARMPTR                                      01S0487 01653000
         L     @01,SCTPTR(,@15)                                 01S0487 01654000
         ICM   @00,7,SCTANSCT(@01)                              01S0487 01655000
         BNZ   @GL00024                                         01S0487 01656000
         L     @01,JCTPTR(,@15)                                 01S0487 01657000
         TM    JCTSTEPR(@01),B'00001100'                        01S0487 01658000
         BZ    @RT00487                                         01S0487 01659000
@GL00024 L     @01,PARMPTR                                      01S0487 01660000
         L     @01,LCTPTR(,@01)                                 01S0487 01661000
         TM    LCTJFAIL(@01),B'11000000'                        01S0487 01662000
         BNO   @RF00487                                         01S0487 01663000
@RT00487 DS    0H                                               01S0488 01664000
*      DO;                                                      01S0488 01665000
*        JOBFNMAP = JOBFNMAP && JOBFNMAP;/* INIT JOB UNALOC FUNC. MAP*/ 01666000
         XC    JOBFNMAP(1),JOBFNMAP                             01S0489 01667000
*        IF JCTABEND = ON THEN         /* AN ABEND HAS OCCURRED      */ 01668000
         L     @01,PARMPTR                                      01S0490 01669000
         L     @01,JCTPTR(,@01)                                 01S0490 01670000
         TM    JCTABEND(@01),B'00001000'                        01S0490 01671000
         BNO   @RF00490                                         01S0490 01672000
*          DO;                                                  01S0491 01673000
*            JOBCNDSP = ON;            /* USE CONDITIONAL DISPS      */ 01674000
*            JOBMSGS = ON;             /* ISSUE DISP. MESSAGES       */ 01675000
         OI    JOBCNDSP,B'11000000'                             01S0493 01676000
*          END;                                                 01S0494 01677000
*        IF BASTCNT > ZERO THEN        /* MONITOR STATUS REQUESTED   */ 01678000
@RF00490 L     @01,CVTPTR                                       01S0495 01679000
         L     @01,CVTMSER(,@01)                                01S0495 01680000
         ICM   @00,3,BASTCNT(@01)                               01S0495 01681000
         BNP   @RF00495                                         01S0495 01682000
*          JOBMSTAT = ON;              /* ISSUE MN STATUS MESSAGES   */ 01683000
         OI    JOBMSTAT,B'00010000'                             01S0496 01684000
*        IF INCMALL = ON THEN          /* MSGLEVEL=1                 */ 01685000
@RF00495 L     @01,PARMPTR                                      01S0497 01686000
         L     @01,JCTPTR(,@01)                                 01S0497 01687000
         TM    INCMALL(@01),B'10000000'                         01S0497 01688000
         BNO   @RF00497                                         01S0497 01689000
*          JOBMSGS = ON;               /* ISSUE DISP MESSAGES        */ 01690000
         OI    JOBMSGS,B'01000000'                              01S0498 01691000
*        JOBDSPRC = ON;                /* DO DISPOSITION PROCESSING  */ 01692000
@RF00497 OI    JOBDSPRC,B'00100000'                             01S0499 01693000
*        CALL IEFBB416                 /* INVOKE JOB UNALLOCATION    */ 01694000
*           (JOBFNMAP,LCTJSCB,JCTPTR,ESTAPTR,LEPAPTR,RESNCODE(2),       01695000
*             CVTILK2);                                         01S0500 01696000
         LA    @15,JOBFNMAP                                     01S0500 01697000
         ST    @15,@AL00001                                     01S0500 01698000
         L     @15,PARMPTR                                      01S0500 01699000
         L     @01,LCTPTR(,@15)                                 01S0500 01700000
         LA    @14,LCTJSCB(,@01)                                01S0500 01701000
         ST    @14,@AL00001+4                                   01S0500 01702000
         LA    @15,JCTPTR(,@15)                                 01S0500 01703000
         ST    @15,@AL00001+8                                   01S0500 01704000
         LA    @15,ESTAPTR                                      01S0500 01705000
         ST    @15,@AL00001+12                                  01S0500 01706000
         LA    @15,LEPAPTR                                      01S0500 01707000
         ST    @15,@AL00001+16                                  01S0500 01708000
         LA    @15,RESNCODE+2                                   01S0500 01709000
         ST    @15,@AL00001+20                                  01S0500 01710000
         L     @01,CVTPTR                                       01S0500 01711000
         LA    @15,CVTILK2(,@01)                                01S0500 01712000
         ST    @15,@AL00001+24                                  01S0500 01713000
         L     @15,@CV00294                                     01S0500 01714000
         LA    @01,@AL00001                                     01S0500 01715000
         BALR  @14,@15                                          01S0500 01716000
*      END;                                                     01S0501 01717000
*    IF (SCTANSCT = ZERO &      /* LAST STEP                  */        01718000
*       (JCTSTEPR = OFF & JCTCKPTR = OFF)) | /* NO RESTART    */        01719000
*       LCTJFAIL = ON THEN/*                                    01S0502 01720000
*                                         PROCESS END OF JOB         */ 01721000
@RF00487 L     @15,PARMPTR                                      01S0502 01722000
         L     @01,SCTPTR(,@15)                                 01S0502 01723000
         ICM   @00,7,SCTANSCT(@01)                              01S0502 01724000
         BNZ   @GL00026                                         01S0502 01725000
         L     @01,JCTPTR(,@15)                                 01S0502 01726000
         TM    JCTSTEPR(@01),B'00001100'                        01S0502 01727000
         BZ    @RT00502                                         01S0502 01728000
@GL00026 L     @01,PARMPTR                                      01S0502 01729000
         L     @01,LCTPTR(,@01)                                 01S0502 01730000
         TM    LCTJFAIL(@01),B'10000000'                        01S0502 01731000
         BNO   @RF00502                                         01S0502 01732000
@RT00502 DS    0H                                               01S0503 01733000
*      DO;                                                      01S0503 01734000
*/********************************************************************/ 01735000
*/*                                                                  */ 01736000
*/* SEGMENT NAME - ENDOFJOB                                          */ 01737000
*/*                                                                  */ 01738000
*/* DESCRIPTIVE NAME - END OF JOB PROCESSING                         */ 01739000
*/*                                                                  */ 01740000
*/* FUNCTION -                                                       */ 01741000
*/*   THE FOLLOWING FUNCTIONS ARE PERFORMED IN THIS SEGMENT:         */ 01742000
*/*                                                                  */ 01743000
*/*   1. ISSUE END OF JOB STATUS MESSAGES -                          */ 01744000
*/*      END OF JOB STATUS MESSAGES ARE ISSUED ACCORDING TO THE      */ 01745000
*/*      FOLLOWING RULES:                                            */ 01746000
*/*                                                                  */ 01747000
*/*      . THE JOB IS NOT FAILED -                                   */ 01748000
*/*        IF THE JOB IS A BACKGROUND JOB AND MN JOBNAMES WAS        */ 01749000
*/*        REQUESTED BY AN OPERATOR, THE JOB ENDED MESSAGE IS        */ 01750000
*/*        ISSUED. IF THE JOB IS FOREGROUND AND MN JOBNAMES OR       */ 01751000
*/*        MN SESSIONS WAS REQUESTED BY AN OPERATOR, THE LOGGED OFF  */ 01752000
*/*        MESSAGE IS ISSUED. IF MN TIME IS ACTIVE THE TIME IS       */ 01753000
*/*        PUT IN THE MESSAGE.                                       */ 01754000
*/*                                                                  */ 01755000
*/*      . THE JOB IS FAILED -                                       */ 01756000
*/*                                                                  */ 01757000
*/*        . THE JOB FAILED BECAUSE OF JOB CONDITION CODES -         */ 01758000
*/*          THE JOB ENDED BY CC MESSAGE IS ISSUED TO THE PROGRAMMER */ 01759000
*/*          AND THE OPERATOR. IF THE MN TIME IS ACTIVE              */ 01760000
*/*          THE TIME IS INCLUDED IN THE MESSAGE TO THE OPERATOR.    */ 01761000
*/*          LCTJCFAL IS SET ON TO INDICATE JOB FAILED DUE   @Z30CPPD*/ 01762000
*/*          TO COND CODES.                                  @Z30CPPD*/ 01763000
*/*                                                                  */ 01764000
*/*        . THE JOB DID NOT FAIL BECAUSE OF JOB CONDITION CODES -   */ 01765000
*/*          IF THE END-OF-JOB-STATUS-MESSAGE-ISSUED BIT IS NOT ON,  */ 01766000
*/*          THE JOB FAILED MESSAGE IS ISSUED TO THE OEPRATOR.       */ 01767000
*/*          IF MN TIME IS ACTIVE, THE TIME IS INCLUDED IN THE       */ 01768000
*/*          MESSAGE.                                                */ 01769000
*/*                                                                  */ 01770000
*/*   2. INVOKE THE SMF/USER ACCOUNTING ROUTINE -                    */ 01771000
*/*      THE SMF/USER ACCOUNTING ROUTINE IS INVOKED AND A PARAMETER  */ 01772000
*/*      PASSED INDICATING THAT THIS IS THE END OF THE JOB.          */ 01773000
*/*                                                                  */ 01774000
*/* ENTRY - IN-LINE SEGMENT                                          */ 01775000
*/*   PURPOSE - SEE FUNCTION                                         */ 01776000
*/*                                                                  */ 01777000
*/*   INPUT -                                                        */ 01778000
*/*                                                                  */ 01779000
*/*     LCT -                                                        */ 01780000
*/*       LCTJFAIL - JOB FAILED BIT                                  */ 01781000
*/*       LCTENQU - FOREGROUND JOB                                   */ 01782000
*/*       LCTERRM - END-OF-JOB-STATUS-MESSAGE-ISSUED BIT             */ 01783000
*/*                                                                  */ 01784000
*/*      MASTER SCHEDULER RESIDENT DATA AREA -                       */ 01785000
*/*        BAJN - MN JOBNAMES BIT                                    */ 01786000
*/*        BAMSESSC - MN SESSIONS BIT                                */ 01787000
*/*        MSTN - MN TIME BIT                                        */ 01788000
*/*                                                                  */ 01789000
*/* EXIT -                                                           */ 01790000
*/*   CONDITION - NORMAL                                             */ 01791000
*/*                                                                  */ 01792000
*/*   OUTPUT -                                                       */ 01793000
*/*     MESSAGES TO OPERATOR AND PROGRAMMER                  @Z30CPPD*/ 01794000
*/*     LCT -                                                        */ 01795000
*/*       LCTERRM - SET OFF (IN CASE LCT IS USED FOR NEXT JOB)       */ 01796000
*/*       LCTJCFAL - SET ON IF JOB FAILED DUE TO COND CODES  @Z30CPPD*/ 01797000
*/*                                                                  */ 01798000
*/*   RETURN CODE - NONE                                             */ 01799000
*/********************************************************************/ 01800000
*WTOL = WTOL && WTOL;                  /* CLEAR WTO PARM LIST        */ 01801000
         XC    WTOL(138),WTOL                                   02S0504 01802000
*WTOSW = OFF;                          /* INIT WTO SWITCH            */ 01803000
*MSGSW = OFF;                          /* INIT PGMR MSG SWITCH       */ 01804000
*JOBNSW = OFF;                         /* INIT MSGTYP=JOBNAMES SW    */ 01805000
         NI    WTOSW,B'00011111'                                02S0507 01806000
*IF JCTWARMS = OFF |                   /* NOT WARM START             */ 01807000
*    (JCTWARMS = ON & JCTSWSM = OFF) THEN /* ISSUE MSGS              */ 01808000
         L     @01,PARMPTR                                      02S0508 01809000
         L     @15,JCTPTR(,@01)                                 02S0508 01810000
         TM    JCTWARMS(@15),B'10000000'                        02S0508 01811000
         BZ    @RT00508                                         02S0508 01812000
         TM    JCTWARMS(@15),B'10000000'                        02S0508 01813000
         BNO   @RF00508                                         02S0508 01814000
         TM    JCTSWSM(@15),B'00010000'                         02S0508 01815000
         BNZ   @RF00508                                         02S0508 01816000
@RT00508 DS    0H                                               02S0509 01817000
*  DO;                                 /* SET UP THE MESSAGES        */ 01818000
*    IF LCTJFAIL = OFF THEN            /* JOB NOT FAILED             */ 01819000
         L     @01,PARMPTR                                      02S0510 01820000
         L     @15,LCTPTR(,@01)                                 02S0510 01821000
         TM    LCTJFAIL(@15),B'10000000'                        02S0510 01822000
         BNZ   @RF00510                                         02S0510 01823000
*      DO;                                                      02S0511 01824000
*        IF BAJNCNT > ZERO &           /* MN JOBNAMES        @Z30CPPD*/ 01825000
*           CHTRKID ^= '01'X THEN      /* NOT TSO JOB                */ 01826000
         L     @01,CVTPTR                                       02S0512 01827000
         L     @01,CVTMSER(,@01)                                02S0512 01828000
         ICM   @00,3,BAJNCNT(@01)                               02S0512 01829000
         BNP   @RF00512                                         02S0512 01830000
         L     @01,LCTQDRTY(,@15)                               02S0512 01831000
         CLI   CHTRKID(@01),X'01'                               02S0512 01832000
         BE    @RF00512                                         02S0512 01833000
*          DO;                         /* SET UP ENDED MESSAGE       */ 01834000
*            WTOSW = ON;               /* ISSUE WTO MESSAGE          */ 01835000
*            JOBNSW = ON;              /* MSGTYP = JOBNAMES          */ 01836000
         OI    WTOSW,B'10100000'                                02S0515 01837000
*            WMSGLNTH = ENDEDLN;       /* SET WTO MESSAGE LENGTH     */ 01838000
         L     @15,@CA00302                                     02S0516 01839000
         LH    @14,ENDEDLN-JOBENDED(,@15)                       02S0516 01840000
         ST    @14,WMSGLNTH                                     02S0516 01841000
*            WPLTXT(1:ENDEDLN) = ENDEDM(1:ENDEDLN); /* MOVE MSG      */ 01842000
         LA    @09,WTOL                                         02S0517 01843000
         BCTR  @14,0                                            02S0517 01844000
         EX    @14,@SM03016                                     02S0517 01845000
*          END;                                                 02S0518 01846000
*        IF (BASESCT > ZERO | BAJNCNT > ZERO) & /*MN JOBNAMES OR SESS*/ 01847000
*            CHTRKID = '01'X THEN      /* FOREGROUND JOB             */ 01848000
@RF00512 SLR   @15,@15                                          02S0519 01849000
         L     @01,CVTPTR                                       02S0519 01850000
         L     @14,CVTMSER(,@01)                                02S0519 01851000
         CH    @15,BASESCT(,@14)                                02S0519 01852000
         BL    @GL00031                                         02S0519 01853000
         CH    @15,BAJNCNT(,@14)                                02S0519 01854000
         BNL   @RF00519                                         02S0519 01855000
@GL00031 L     @01,PARMPTR                                      02S0519 01856000
         L     @01,LCTPTR(,@01)                                 02S0519 01857000
         L     @01,LCTQDRTY(,@01)                               02S0519 01858000
         CLI   CHTRKID(@01),X'01'                               02S0519 01859000
         BNE   @RF00519                                         02S0519 01860000
*          DO;                                                  02S0520 01861000
*            WTOSW = ON;               /* ISSUE WTO MESSAGE          */ 01862000
         OI    WTOSW,B'10000000'                                02S0521 01863000
*            WMSGLNTH = LOGOFFLN;      /* SET WTO MESSAGE LENGTH     */ 01864000
         L     @15,@CA00310                                     02S0522 01865000
         LH    @14,LOGOFFLN-LOGGDOFF(,@15)                      02S0522 01866000
         ST    @14,WMSGLNTH                                     02S0522 01867000
*            WPLTXT(1:LOGOFFLN) = LOGOFFM(1:LOGOFFLN); /* MOVE MSG   */ 01868000
         LA    @09,WTOL                                         02S0523 01869000
         BCTR  @14,0                                            02S0523 01870000
         EX    @14,@SM03018                                     02S0523 01871000
*            IF BAJNCNT > ZERO THEN    /* MN JOBNAMES REQUESTED      */ 01872000
         L     @01,CVTPTR                                       02S0524 01873000
         L     @01,CVTMSER(,@01)                                02S0524 01874000
         ICM   @00,3,BAJNCNT(@01)                               02S0524 01875000
         BNP   @RF00524                                         02S0524 01876000
*              JOBNSW = ON;            /* MSGTYP = JOBNAMES          */ 01877000
         OI    JOBNSW,B'00100000'                               02S0525 01878000
*          END;                                                 02S0526 01879000
*      END;                                                     02S0527 01880000
*    ELSE                              /* JOB IS FAILED              */ 01881000
*      IF CONDFAIL = ON THEN           /* JOB COND CODE FAILURE      */ 01882000
         B     @RC00510                                         02S0528 01883000
@RF00510 TM    CONDFAIL,B'00010000'                             02S0528 01884000
         BNO   @RF00528                                         02S0528 01885000
*        DO;                           /* SET UP COND FAIL MESSAGES  */ 01886000
*          LCTJCFAL = ON;              /*INDICATE THAT JOB COND CODES   01887000
*                                        CAUSED JOB TO FAIL  @Z30CPPD*/ 01888000
         L     @01,PARMPTR                                      02S0530 01889000
         L     @01,LCTPTR(,@01)                                 02S0530 01890000
         OI    LCTJCFAL(@01),B'00000100'                        02S0530 01891000
*          JOBNSW = ON;                /* MSGTYP = JOBNAMES          */ 01892000
*          WTOSW = ON;                 /* ISSUE WTO MESSAGE          */ 01893000
         OI    JOBNSW,B'10100000'                               02S0532 01894000
*          WMSGLNTH = CCFAILLN;        /* SET WTO LENGTH             */ 01895000
         L     @15,@CA00298                                     02S0533 01896000
         LH    @14,CCFAILLN-CCFAIL(,@15)                        02S0533 01897000
         ST    @14,WMSGLNTH                                     02S0533 01898000
*          WPLTXT(1:CCFAILLN) = CCFAILM(1:CCFAILLN); /* MOVE MSG     */ 01899000
         LA    @09,WTOL                                         02S0534 01900000
         BCTR  @14,0                                            02S0534 01901000
         EX    @14,@SM03020                                     02S0534 01902000
*          MSGSW = ON;                 /* ISSUE MESSAGE TO PGMR      */ 01903000
         OI    MSGSW,B'01000000'                                02S0535 01904000
*          LMSGLNTH = PGMCLNTH;        /* SET MSG LENGTH             */ 01905000
         L     @15,@CA00317                                     02S0536 01906000
         LH    @14,PGMCLNTH-PGMCFAIL(,@15)                      02S0536 01907000
         ST    @14,LMSGLNTH                                     02S0536 01908000
*          MSG(1:PGMCLNTH) = PGMCTEXT(1:PGMCLNTH); /* MOVE MSG       */ 01909000
         BCTR  @14,0                                            02S0537 01910000
         EX    @14,@SM03022                                     02S0537 01911000
*        END;                                                   02S0538 01912000
*      ELSE                            /* NOT COND CODE FAILURE      */ 01913000
*        IF LCTERRM = OFF THEN         /* MESSAGE MUST BE SENT TO       01914000
*                                         OPERATOR           @Z30CPPD*/ 01915000
         B     @RC00528                                         02S0539 01916000
@RF00528 L     @01,PARMPTR                                      02S0539 01917000
         L     @01,LCTPTR(,@01)                                 02S0539 01918000
         TM    LCTERRM(@01),B'00000001'                         02S0539 01919000
         BNZ   @RF00539                                         02S0539 01920000
*          DO;                         /* SET UP MESSAGE             */ 01921000
*            WTOSW = ON;               /* ISSUE WTO MESSAGE          */ 01922000
*            JOBNSW = ON;              /* MSGTYP = JOBNAMES          */ 01923000
         OI    WTOSW,B'10100000'                                02S0542 01924000
*            WMSGLNTH = JOBFAILL;      /* SET LENGTH OF MSG          */ 01925000
         L     @15,@CA00306                                     02S0543 01926000
         LH    @14,JOBFAILL-JOBFAILD(,@15)                      02S0543 01927000
         ST    @14,WMSGLNTH                                     02S0543 01928000
*            WPLTXT(1:JOBFAILL) = JOBFAILM(1:JOBFAILL); /* MOVE MSG  */ 01929000
         LA    @09,WTOL                                         02S0544 01930000
         BCTR  @14,0                                            02S0544 01931000
         EX    @14,@SM03024                                     02S0544 01932000
*          END;                                                 02S0545 01933000
*/********************************************************************/ 01934000
*/*                                                                  */ 01935000
*/* SEGMENT NAME - ENDJMSG                                           */ 01936000
*/*                                                                  */ 01937000
*/* DESCRIPTIVE NAME - ISSUE END OF JOB STATUS MESSAGES              */ 01938000
*/*                                                                  */ 01939000
*/* FUNCTION -                                                       */ 01940000
*/*   THE FUNCTION OF THIS SEGMENT IS TO ISSUE END OF JOB STATUS     */ 01941000
*/*   MESSAGES.                                                      */ 01942000
*/*                                                                  */ 01943000
*/*   OPERATION -                                                    */ 01944000
*/*   1. COMPLETE THE MESSAGE(S) -                                   */ 01945000
*/*      IF MN TIME IS ACTIVE, THE TIME IS PUT IN THE OPERATOR       */ 01946000
*/*      MESSAGE .  IF THE MESSAGE IS A CONDITION CODE       @Z30CPPD*/ 01947000
*/*      FAILURE MESSAGE, THE CONDITION CODE IS PUT IN THE           */ 01948000
*/*      MESSAGE. THE JOBNAME IS INSERTED IN ALL MESSAGES.           */ 01949000
*/*                                                                  */ 01950000
*/*   2. ISSUE THE MESSAGE(S) -                                      */ 01951000
*/*      IF A WTO IS REQUESTED THE MESSAGE IS ISSUED TO THE          */ 01952000
*/*      OPERATOR. IF A MESSAGE TO THE PROGRAMMER IS REQUESTED       */ 01953000
*/*      THE MESSAGE IS ISSUED TO THE PROGRAMMER.                    */ 01954000
*/*                                                                  */ 01955000
*/*    NOTES -                                                       */ 01956000
*/*                                                                  */ 01957000
*/*         MESSAGES ARE KEPT IN EXTERNAL PROCEDURES. THE LENGTH     */ 01958000
*/*         OF EACH MESSAGE IS KEPT WITH THE MESSAGE AND FOR MESSAGES*/ 01959000
*/*         THAT HAVE VARIABLE INFORMATION (E.G. THE TIME), A        */ 01960000
*/*         DISPLACEMENT WITHIN THE MESSAGE WHERE THE VARIABLE       */ 01961000
*/*         INFORMATION GOES IS KEPT. THESE LENGTHS AND DISPLACEMENTS*/ 01962000
*/*         ARE USED WHEN CONSTRUCTING THE MESSAGES: SEE B410DATA    */ 01963000
*/*         FOR MORE DETAIL.                                         */ 01964000
*/*                                                                  */ 01965000
*/* ENTRY - IN-LINE SEGMENT                                          */ 01966000
*/*                                                                  */ 01967000
*/*   PURPOSE - SEE FUNCTION                                         */ 01968000
*/*                                                                  */ 01969000
*/*   INPUT -                                                        */ 01970000
*/*                                                                  */ 01971000
*/*     LCT -                                                        */ 01972000
*/*       LCTJFAIL - JOB FAILED BIT                                  */ 01973000
*/*       LCTENQU - FOREGROUND JOB                                   */ 01974000
*/*                                                                  */ 01975000
*/*     JCT -                                                        */ 01976000
*/*       JCTJNAME - JOB NAME                                        */ 01977000
*/*                                                                  */ 01978000
*/*     SCT -                                                        */ 01979000
*/*       SCTSNAME - STEP NAME                                       */ 01980000
*/*       SCTSCLPC - PROC STEP NAME                                  */ 01981000
*/*                                                                  */ 01982000
*/*     MASTER SCHEDULER RESIDENT DATA AREA -                        */ 01983000
*/*        MSTN - MN TIME IS ACTIVE                                  */ 01984000
*/*                                                                  */ 01985000
*/*     WTOSW - ISSUE A MESSAGE TO THE OPERATOR                      */ 01986000
*/*                                                                  */ 01987000
*/*     MSGSW - ISSUE A MESSAGE TO THE PROGRAMMER                    */ 01988000
*/*                                                                  */ 01989000
*/*     CONDFAIL - JOB FAILED BECAUSE OF CONDITION CODES             */ 01990000
*/*                                                                  */ 01991000
*/*     COMPCODE - CONDITION CODE THAT CAUSED THE JOB TO FAIL        */ 01992000
*/*                                                                  */ 01993000
*/* EXIT -                                                           */ 01994000
*/*   CONDITION - NORMAL                                             */ 01995000
*/*                                                                  */ 01996000
*/*   OUTPUT -                                                       */ 01997000
*/*     MESSAGES ISSUED                                              */ 01998000
*/*                                                                  */ 01999000
*/*   RETURN CODE - NONE                                             */ 02000000
*/*                                                                  */ 02001000
*/********************************************************************/ 02002000
*IF WTOSW = ON THEN                    /* ISSUE WTO          @Z30CPPD*/ 02003000
@RF00539 DS    0H                                               03S0546 02004000
@RC00528 DS    0H                                               03S0546 02005000
@RC00510 TM    WTOSW,B'10000000'                                03S0546 02006000
         BNO   @RF00546                                         03S0546 02007000
*  DO;                                                          03S0547 02008000
*    WTOJNAME = JCTJNAME;              /* MOVE JOB NAME TO MSG       */ 02009000
         LA    @15,WTOL                                         03S0548 02010000
         LA    @14,4                                            03S0548 02011000
         ALR   @14,@15                                          03S0548 02012000
         L     @09,PARMPTR                                      03S0548 02013000
         L     @01,JCTPTR(,@09)                                 03S0548 02014000
         MVC   WTOJNAME(8,@14),JCTJNAME(@01)                    03S0548 02015000
*    IF CONDFAIL = ON THEN             /* COND CODE FAILURE          */ 02016000
         TM    CONDFAIL,B'00010000'                             03S0549 02017000
         BNO   @RF00549                                         03S0549 02018000
*      DO;                             /* MOVE IN MORE NAMES         */ 02019000
*        WTOSNAME = SCTSNAME;          /* MOVE IN STEP NAME          */ 02020000
         L     @09,SCTPTR(,@09)                                 03S0551 02021000
         MVC   WTOSNAME(8,@14),SCTSNAME(@09)                    03S0551 02022000
*        WTOPSNAM = SCTSCLPC;          /* MOVE IN PROC STEP NAME     */ 02023000
         MVC   WTOPSNAM(8,@14),SCTSCLPC(@09)                    03S0552 02024000
*        WTOJCOND = COMPCODE;          /* MOVE COND CODE TO MESSAGE  */ 02025000
         LA    @15,WPLTXT(,@15)                                 03S0553 02026000
         L     @14,@CA00298                                     03S0553 02027000
         AH    @15,CCFLCDSP-CCFAIL(,@14)                        03S0553 02028000
         MVC   WTOJCOND(4,@15),COMPCODE                         03S0553 02029000
*      END;                                                     03S0554 02030000
*/********************************************************************/ 02031000
*/*                                                                  */ 02032000
*/* SEGMENT NAME - SETTIME                                           */ 02033000
*/*                                                                  */ 02034000
*/* DESCRIPTIVE NAME - PUT THE TIME IN THE END OF JOB MSG            */ 02035000
*/*                                                                  */ 02036000
*/* FUNCTION -                                                       */ 02037000
*/*   THE FUNCTION OF THIS SEGMENT IS TO OBTAIN THE CURRENT TIME,    */ 02038000
*/*   CONVERT IT TO PRINTABLE FORM AND INSERT IT INTO THE            */ 02039000
*/*   WTO MESSAGE OR, IF MN TIME WAS NOT SPECIFIED, BLANK OUT        */ 02040000
*/*   THE TIME FIELD IN THE MESSAGE.                                 */ 02041000
*/*                                                                  */ 02042000
*/* ENTRY - IN-LINE SEGMENT                                          */ 02043000
*/*                                                                  */ 02044000
*/*   PURPOSE - SEE FUNCTION                                         */ 02045000
*/*                                                                  */ 02046000
*/*   INPUT -                                                        */ 02047000
*/*                                                                  */ 02048000
*/*     LCT -                                                        */ 02049000
*/*       LCTJFAIL - JOB IS FAILED                                   */ 02050000
*/*       LCTENQU - FOREGROUND JOB                                   */ 02051000
*/*                                                                  */ 02052000
*/*     MASTER SCHEDULER RESIDENT DATA AREA -                        */ 02053000
*/*       MSTN - MN TIME IS ACTIVE                                   */ 02054000
*/*                                                                  */ 02055000
*/*     WTOSW - WTO MUST BE ISSUED                                   */ 02056000
*/*                                                                  */ 02057000
*/* EXIT -                                                           */ 02058000
*/*                                                                  */ 02059000
*/*   CONDITION - NORMAL                                             */ 02060000
*/*                                                                  */ 02061000
*/*   OUTPUT -                                                       */ 02062000
*/*                                                                  */ 02063000
*/*     TIME - FIELD TO CONTAIN THE TIME IN WPLTXT                   */ 02064000
*/*                                                                  */ 02065000
*/*   RETURN CODE - NONE                                             */ 02066000
*/*                                                                  */ 02067000
*/********************************************************************/ 02068000
*IF LCTJFAIL = OFF THEN                /* JOB NOT FAILED             */ 02069000
@RF00549 L     @01,PARMPTR                                      04S0555 02070000
         L     @15,LCTPTR(,@01)                                 04S0555 02071000
         TM    LCTJFAIL(@15),B'10000000'                        04S0555 02072000
         BNZ   @RF00555                                         04S0555 02073000
*  IF CHTRKID = '01'X THEN             /* FOREGROUND JOB             */ 02074000
         L     @01,LCTQDRTY(,@15)                               04S0556 02075000
         CLI   CHTRKID(@01),X'01'                               04S0556 02076000
         BNE   @RF00556                                         04S0556 02077000
*    TIMEPTR = ADDR(WPLTXT)+LOGTDISP;  /* SET LENGTH OF MSG          */ 02078000
         LA    TIMEPTR,WTOL                                     04S0557 02079000
         LA    TIMEPTR,WPLTXT(,TIMEPTR)                         04S0557 02080000
         L     @03,@CA00310                                     04S0557 02081000
         AH    TIMEPTR,LOGTDISP-LOGGDOFF(,@03)                  04S0557 02082000
*  ELSE                                /* BACKGROUND JOB             */ 02083000
*    TIMEPTR = ADDR(WPLTXT)+ENDTDISP;  /* SET TIME POINTER           */ 02084000
         B     @RC00556                                         04S0558 02085000
@RF00556 LA    TIMEPTR,WTOL                                     04S0558 02086000
         LA    TIMEPTR,WPLTXT(,TIMEPTR)                         04S0558 02087000
         L     @03,@CA00302                                     04S0558 02088000
         AH    TIMEPTR,ENDTDISP-JOBENDED(,@03)                  04S0558 02089000
*ELSE                                  /* JOB WAS FAILED             */ 02090000
*  IF CONDFAIL = ON THEN               /* COND CODE FAILURE          */ 02091000
         B     @RC00555                                         04S0559 02092000
@RF00555 TM    CONDFAIL,B'00010000'                             04S0559 02093000
         BNO   @RF00559                                         04S0559 02094000
*    TIMEPTR = ADDR(WPLTXT)+CCFLTDSP;  /* SET TIME POINTER           */ 02095000
         LA    TIMEPTR,WTOL                                     04S0560 02096000
         LA    TIMEPTR,WPLTXT(,TIMEPTR)                         04S0560 02097000
         L     @03,@CA00298                                     04S0560 02098000
         AH    TIMEPTR,CCFLTDSP-CCFAIL(,@03)                    04S0560 02099000
*  ELSE                                /* NOT COND CODE FAILURE      */ 02100000
*    TIMEPTR = ADDR(WPLTXT)+JOBFTDSP;  /* SET TIME POINTER           */ 02101000
         B     @RC00559                                         04S0561 02102000
@RF00559 LA    TIMEPTR,WTOL                                     04S0561 02103000
         LA    TIMEPTR,WPLTXT(,TIMEPTR)                         04S0561 02104000
         L     @03,@CA00306                                     04S0561 02105000
         AH    TIMEPTR,JOBFTDSP-JOBFAILD(,@03)                  04S0561 02106000
*IF MSTN = ON & WTOSW = ON THEN        /* PUT TIME IN WTO MSG        */ 02107000
@RC00559 DS    0H                                               04S0562 02108000
@RC00555 L     @03,CVTPTR                                       04S0562 02109000
         L     @03,CVTMSER(,@03)                                04S0562 02110000
         TM    MSTN+136(@03),B'00000010'                        04S0562 02111000
         BNO   @RF00562                                         04S0562 02112000
         TM    WTOSW,B'10000000'                                04S0562 02113000
         BNO   @RF00562                                         04S0562 02114000
*  DO;                                                          04S0563 02115000
*    RFY (REG0,REG1) RSTD;             /* RESERVE REGISTERS          */ 02116000
*    GEN (TIME DEC);                   /* GET THE TIME               */ 02117000
         TIME DEC                                                       02118000
*    DECTIME = REG0;                   /* MOVE TIME TO LCL AREA      */ 02119000
         ST    REG0,DECTIME                                     04S0566 02120000
*    RFY (REG0,REG1) UNRSTD;           /* RELEASE REGISTERS          */ 02121000
*    UNPK (TIME(1:7),DECTIME);         /* CONVERT TIME TO EBCDIC     */ 02122000
         UNPK  TIME(7),DECTIME(4)                               04S0568 02123000
*    WTOHH = HOURS;                    /* MOVE HOURS TO MESSAGE      */ 02124000
         MVC   WTOHH(2,TIMEPTR),HOURS                           04S0569 02125000
*    WTOMM = MINUTES;                  /* MOVE MINUTES TO MESSAGE    */ 02126000
         MVC   WTOMM(2,TIMEPTR),MINUTES                         04S0570 02127000
*    WTOSS = SECONDS;                  /* MOVE SECONDS TO MESSAGE    */ 02128000
         MVC   WTOSS(2,TIMEPTR),SECONDS                         04S0571 02129000
*  END;                                                         04S0572 02130000
*ELSE                                  /* TIME NOT WANTED            */ 02131000
*  WTOTIME = '';                       /* BLANK OUT THE TIME         */ 02132000
         B     @RC00562                                         04S0573 02133000
@RF00562 MVI   WTOTIME(TIMEPTR),C' '                            04S0573 02134000
         MVC   WTOTIME+1(14,TIMEPTR),WTOTIME(TIMEPTR)           04S0573 02135000
*    CALL IEFAB4F3(ADDR(WPLTXT),WMSGLNTH,CMSGLNTH); /* COMPRESS BLNKS*/ 02136000
@RC00562 LA    @15,WTOL                                         03S0574 02137000
         LA    @15,WPLTXT(,@15)                                 03S0574 02138000
         ST    @15,@TF00001                                     03S0574 02139000
         LA    @15,@TF00001                                     03S0574 02140000
         ST    @15,@AL00001                                     03S0574 02141000
         LA    @15,WMSGLNTH                                     03S0574 02142000
         ST    @15,@AL00001+4                                   03S0574 02143000
         LA    @15,CMSGLNTH                                     03S0574 02144000
         ST    @15,@AL00001+8                                   03S0574 02145000
         L     @15,@CV00288                                     03S0574 02146000
         LA    @01,@AL00001                                     03S0574 02147000
         BALR  @14,@15                                          03S0574 02148000
*    IF WTOSW = ON THEN                /* WRITE MSG TO OPERATOR      */ 02149000
         TM    WTOSW,B'10000000'                                03S0575 02150000
         BNO   @RF00575                                         03S0575 02151000
*      DO;                                                      03S0576 02152000
*        WPLLGH = CMSGLNTH + LWTOBYTE; /* SET WTO LIST LENGTH        */ 02153000
         LA    @15,WTOL                                         03S0577 02154000
         L     @14,CMSGLNTH                                     03S0577 02155000
         AL    @14,LWTOBYTE                                     03S0577 02156000
         STH   @14,WPLLGH(,@15)                                 03S0577 02157000
*        RFY WPLFLGS BASED(ADDR(WPL)+WPLLGH);                   03S0578 02158000
*        WPLFLGS = WPLFLGS && WPLFLGS; /* CLEAR WTO FLAG BITS        */ 02159000
         ALR   @14,@15                                          03S0579 02160000
         XC    WPLFLGS(8,@14),WPLFLGS(@14)                      03S0579 02161000
*        WPLMCSFA = ON;                /* ROUT/DESC CODES PRESENT    */ 02162000
*        WPLMCSFC = ON;                /* COMMAND RESPONSE           */ 02163000
*        WPLMCSFD = ON;                /* MSGTYP FIELD PRESENT       */ 02164000
         OI    WPLMCSFA(@15),B'10110000'                        03S0582 02165000
*        WPLDESCF = ON;                /* DESC CODE = JOB STATUS     */ 02166000
         OI    WPLDESCF(@14),B'00000100'                        03S0583 02167000
*        WPLROUTB = ON;                /* ROUTCODE=MSTR CNSL INFO       02168000
*                                                            @ZA03525*/ 02169000
         OI    WPLROUTB(@14),B'01000000'                        03S0584 02170000
*        IF JOBNSW = ON THEN           /* MSGTYP JOBNAMES REQUESTED  */ 02171000
         TM    JOBNSW,B'00100000'                               03S0585 02172000
         BNO   @RF00585                                         03S0585 02173000
*          WPLMSGTA = ON;              /* MSGTYP = JOBNAMES          */ 02174000
         OI    WPLMSGTA(@14),B'10000000'                        03S0586 02175000
*        IF CHTRKID = '01'X THEN       /* FOREGROUND JOB             */ 02176000
@RF00585 L     @01,PARMPTR                                      03S0587 02177000
         L     @01,LCTPTR(,@01)                                 03S0587 02178000
         L     @01,LCTQDRTY(,@01)                               03S0587 02179000
         CLI   CHTRKID(@01),X'01'                               03S0587 02180000
         BNE   @RF00587                                         03S0587 02181000
*          WPLMSGTF = ON;              /* MSGTYPE = SESSIONS         */ 02182000
         LA    @15,WTOL                                         03S0588 02183000
         LH    @14,WPLLGH(,@15)                                 03S0588 02184000
         ALR   @14,@15                                          03S0588 02185000
         OI    WPLMSGTF(@14),B'00000100'                        03S0588 02186000
*        GEN REFS(WTOL)                /* ISSUE WTO                  */ 02187000
*           (WTO MF=(E,WTOL));                                  03S0589 02188000
@RF00587 DS    0H                                               03S0589 02189000
         WTO MF=(E,WTOL)                                                02190000
*      END;                                                     03S0590 02191000
*  END;                                                         03S0591 02192000
@RF00575 DS    0H                                               03S0592 02193000
*IF MSGSW = ON THEN                    /* ISSUE MSG TO PROGRAMMER    */ 02194000
@RF00546 TM    MSGSW,B'01000000'                                03S0592 02195000
         BNO   @RF00592                                         03S0592 02196000
*  DO;                                                          03S0593 02197000
*    MS1JNAME = JCTJNAME;              /* MOVE JOBNAME TO MSG        */ 02198000
         L     @15,PARMPTR                                      03S0594 02199000
         L     @01,JCTPTR(,@15)                                 03S0594 02200000
         MVC   MS1JNAME(8),JCTJNAME(@01)                        03S0594 02201000
*    MS1SNAME = SCTSNAME;              /* PUT IN STEP NAME           */ 02202000
         L     @15,SCTPTR(,@15)                                 03S0595 02203000
         MVC   MS1SNAME(8),SCTSNAME(@15)                        03S0595 02204000
*    MS1PSNAM = SCTSCLPC;              /* PUT IN PROC STEP NAME      */ 02205000
         MVC   MS1PSNAM(8),SCTSCLPC(@15)                        03S0596 02206000
*    CALL IEFAB4F3(ADDR(MSG),LMSGLNTH,CMSGLNTH); /*COMPRESS BLANKS   */ 02207000
         LA    @15,MSG                                          03S0597 02208000
         ST    @15,@TF00001                                     03S0597 02209000
         LA    @15,@TF00001                                     03S0597 02210000
         ST    @15,@AL00001                                     03S0597 02211000
         LA    @15,LMSGLNTH                                     03S0597 02212000
         ST    @15,@AL00001+4                                   03S0597 02213000
         LA    @15,CMSGLNTH                                     03S0597 02214000
         ST    @15,@AL00001+8                                   03S0597 02215000
         L     @15,@CV00288                                     03S0597 02216000
         LA    @01,@AL00001                                     03S0597 02217000
         BALR  @14,@15                                          03S0597 02218000
*    CALL IEFAB4FD                     /* ISSUE MSG TO PGMR          */ 02219000
*       (FUNC4FD,ADDR(MSG),CMSGLNTH,0,LCTJSCB);                 03S0598 02220000
         LA    @15,FUNC4FD                                      03S0598 02221000
         ST    @15,@AL00001                                     03S0598 02222000
         LA    @15,MSG                                          03S0598 02223000
         ST    @15,@TF00001                                     03S0598 02224000
         LA    @15,@TF00001                                     03S0598 02225000
         ST    @15,@AL00001+4                                   03S0598 02226000
         LA    @15,CMSGLNTH                                     03S0598 02227000
         ST    @15,@AL00001+8                                   03S0598 02228000
         LA    @15,@CF00276                                     03S0598 02229000
         ST    @15,@AL00001+12                                  03S0598 02230000
         L     @01,PARMPTR                                      03S0598 02231000
         L     @01,LCTPTR(,@01)                                 03S0598 02232000
         LA    @15,LCTJSCB(,@01)                                03S0598 02233000
         ST    @15,@AL00001+16                                  03S0598 02234000
         L     @15,@CV00286                                     03S0598 02235000
         LA    @01,@AL00001                                     03S0598 02236000
         BALR  @14,@15                                          03S0598 02237000
*  END;                                                         03S0599 02238000
*  END;                                                         02S0600 02239000
@RF00592 DS    0H                                               02S0601 02240000
*LCTPARM1 = SMFEOJ;                    /* SET PARM FOR SMF           */ 02241000
@RF00508 L     @15,PARMPTR                                      02S0601 02242000
         L     @01,LCTPTR(,@15)                                 02S0601 02243000
         MVC   LCTPARM1(4,@01),@CF00054                         02S0601 02244000
*CALL IEFTB721(LCTPTR,ZERO);           /* INVOKE SMF/USER ACCT RTN   */ 02245000
         ST    @15,@AL00001                                     02S0602 02246000
         LA    @15,@CF00276                                     02S0602 02247000
         ST    @15,@AL00001+4                                   02S0602 02248000
         L     @15,@CV00291                                     02S0602 02249000
         LA    @01,@AL00001                                     02S0602 02250000
         BALR  @14,@15                                          02S0602 02251000
*LCTERRM = OFF;                        /* RESET EOJ MSG INDICATOR    */ 02252000
         L     @01,PARMPTR                                      02S0603 02253000
         L     @01,LCTPTR(,@01)                                 02S0603 02254000
         NI    LCTERRM(@01),B'11111110'                         02S0603 02255000
*      END;                                                     01S0604 02256000
*  END;                                                         01S0605 02257000
*ELSE                                  /* INITIALIZATION FAILED      */ 02258000
*  DO;                                                          01S0606 02259000
         B     @RC00208                                         01S0606 02260000
@RF00208 DS    0H                                               01S0607 02261000
*    DEQLIST(1:DEQENTLN) = DEQFMT(1:DEQENTLN); /*MOVE LIST SKELETON  */ 02262000
         L     @15,DEQENTLN                                     01S0607 02263000
         BCTR  @15,0                                            01S0607 02264000
         EX    @15,@SM03014                                     01S0607 02265000
*    GEN REFS(DEQLIST,VOLUMES,DATASETS,OPENJ); /*DEQ'S       @ZA13820*/ 02266000
      DEQ (VOLUMES,,,SYSTEM),MF=(E,DEQLIST),RET=HAVE,GENERIC=YES        02267000
      DEQ (DATASETS,,,SYSTEM),MF=(E,DEQLIST),RET=HAVE,GENERIC=YES       02268000
      DEQ (OPENJ,,,SYSTEM),MF=(E,DEQLIST),RET=HAVE,GENERIC=YES          02269000
*                                      DEQ ON OPENJ RESOURCE @ZA13820   02270000
*    LCTJFAIL = ON;                    /* FAIL THE JOB               */ 02271000
         L     @01,PARMPTR                                      01S0609 02272000
         L     @01,LCTPTR(,@01)                                 01S0609 02273000
         OI    LCTJFAIL(@01),B'10000000'                        01S0609 02274000
*  END;                                                         01S0610 02275000
*/********************************************************************/ 02276000
*/*                                                                  */ 02277000
*/* SEGMENT NAME - B410CLNP                                          */ 02278000
*/*                                                                  */ 02279000
*/* DESCRIPTIVE NAME - CLEANUP PROCESSING FOR IEFBB410               */ 02280000
*/*                                                                  */ 02281000
*/* FUNCTION -                                                       */ 02282000
*/*   THE FUNCTION OF THIS SEGMENT IS TO CLEAN UP FOR IEFBB410.      */ 02283000
*/*                                                                  */ 02284000
*/*   OPERATION -                                                    */ 02285000
*/*   . WRITE SWA CONTROL BLOCKS / FREE EPAS                         */ 02286000
*/*     THE SWA MANAGER INTERFACE ROUTINE IS INVOKED TO ISSUE A      */ 02287000
*/*     WRITE LOCATE FOR ALL EPAS ON THE CHAIN               @ZM41392*/ 02288000
*/*                                                          @ZMF1392*/ 02289000
*/*   . FREE EPA CORE                                        @ZM41392*/ 02290000
*/*     IF ANY BLOCKS OF CORE WERE OBTAINED FOR EPA'S IN     @ZM41392*/ 02291000
*/*     THIS MODULE OR THE SIOT READER, THEY ARE FREED HERE. @ZM41392*/ 02292000
*/*                                                                  */ 02293000
*/*   . ISSUE ERROR MESSAGES -                                       */ 02294000
*/*     IF ANY NON-ZERO REASON CODES EXIST, A MESSAGE IS ISSUED      */ 02295000
*/*     TO THE PROGRAMMER. THE REASON CODE DETERMINES WHICH          */ 02296000
*/*     MESSAGE WILL BE ISSUED. IF ANY NON-ZERO REASON CODE IS       */ 02297000
*/*     ENCOUNTERED, A MESSAGE IS SENT TO THE OPERATOR INFORMING     */ 02298000
*/*     HIM THAT UNALLOCATION FOR THIS STEP WAS NOT COMPLETE AND     */ 02299000
*/*     SOME RESOURCES MAY NOT HAVE BEEN RELEASED.                   */ 02300000
*/*                                                                  */ 02301000
*/*   . THE ESATE ENVIRONMENT IS CANCELLED -                         */ 02302000
*/*     AN ESTAE MACRO SPECIFYING CANCEL IS ISSUED.                  */ 02303000
*/*                                                                  */ 02304000
*/*   . THE LCT SCT SVA FIELD IS UPDATED TO THE NEXT STEP'S SCT      */ 02305000
*/*     SVA (ZERO IF THIS WAS THE LAST STEP).                        */ 02306000
*/*                                                                  */ 02307000
*/*   . INSURE WTP MESSAGES ARE WRITTEN -                            */ 02308000
*/*     IEEAB401 IS INVOKED TO WRITE ANY MESSAGES TO THE PROGRAMMER  */ 02309000
*/*     WHICH MAY STILL IN BUFFERS.                                  */ 02310000
*/*                                                                  */ 02311000
*/* ENTRY - IN-LINE SEGMENT                                          */ 02312000
*/*                                                                  */ 02313000
*/*   PURPOSE - SEE FUNCTION                                         */ 02314000
*/*                                                                  */ 02315000
*/*   INPUT -                                                        */ 02316000
*/*     RESNCODE - ARRAY OF REASON CODES                             */ 02317000
*/*                                                                  */ 02318000
*/*     FEPAPTR - ADDRESS OF THE FIRST EPA                           */ 02319000
*/*                                                                  */ 02320000
*/*     EPA -                                                        */ 02321000
*/*       SWCHNPTR - ADDRESS OF THE NEXT EPA                         */ 02322000
*/*                                                                  */ 02323000
*/*     JCT -                                                        */ 02324000
*/*       JCTJNAME - JOB NAME                                        */ 02325000
*/*                                                                  */ 02326000
*/*     SCT -                                                        */ 02327000
*/*       SCTSNAME - STEP NAME                                       */ 02328000
*/*       SCTSCLPC - PROC STEP NAME                                  */ 02329000
*/*                                                                  */ 02330000
*/* EXIT -                                                           */ 02331000
*/*                                                                  */ 02332000
*/*   CONDITION - NORMAL                                             */ 02333000
*/*                                                                  */ 02334000
*/*   OUTPUT -                                                       */ 02335000
*/*                                                                  */ 02336000
*/*     MESSAGE TO PROGRAMMER AND OPERATOR                           */ 02337000
*/*                                                                  */ 02338000
*/*     SWA BLOCKS WRITTEN                                           */ 02339000
*/*                                                                  */ 02340000
*/*     EPAS FREED                                                   */ 02341000
*/*                                                                  */ 02342000
*/*   RETURN CODE - NONE                                             */ 02343000
*/********************************************************************/ 02344000
*IF FEPAPTR ^= ZERO THEN               /* EPA CHAIN EXISTS           */ 02345000
@RC00208 ICM   @15,15,FEPAPTR                                   02S0611 02346000
         BZ    @RF00611                                         02S0611 02347000
*  DO;                                                          02S0612 02348000
*    SWACTLS = SWACTLS && SWACTLS;     /* CLEAR SWA MGR INTF CONTROLS*/ 02349000
         SLR   @15,@15                                          02S0613 02350000
         ICM   @15,3,SWACTLS                                    02S0613 02351000
         LR    @14,@15                                          02S0613 02352000
         XR    @14,@15                                          02S0613 02353000
         STH   @14,SWACTLS                                      02S0613 02354000
*    SWWRT = ON;                       /* INDICATE WRITE FUNCTION    */ 02355000
*    SWOLD = ON;                       /* INDICATE TO USE OLD EPAS   */ 02356000
         OI    SWWRT,B'00010001'                                02S0615 02357000
*    CALL IEFAB4F7(SWACTLS,FEPAPTR,0,0,0,0,0); /* WRITE TABLES, FREE    02358000
*                                         EPAS VIA SWA MSG INTF. RTN */ 02359000
         MVC   @AL00001+8(20),@AL00616                          02S0616 02360000
         LA    @15,SWACTLS                                      02S0616 02361000
         ST    @15,@AL00001                                     02S0616 02362000
         LA    @15,FEPAPTR                                      02S0616 02363000
         ST    @15,@AL00001+4                                   02S0616 02364000
         L     @15,@CV00290                                     02S0616 02365000
         LA    @01,@AL00001                                     02S0616 02366000
         BALR  @14,@15                                          02S0616 02367000
*  END;                                                         02S0617 02368000
*EPBLKPTR = FEPBLKP;                   /* SET BLK BASE       @ZM41392*/ 02369000
@RF00611 L     EPBLKPTR,FEPBLKP                                 02S0618 02370000
*DO WHILE EPBLKPTR ^= ZERO;            /* FREE ALL BLOCKS    @ZM41392*/ 02371000
         B     @DE00619                                         02S0619 02372000
@DL00619 DS    0H                                               02S0620 02373000
*  SAVNEXTP = EPABNXTP;                /* SAVE NEXT BLK PTR  @ZM41392*/ 02374000
         L     SAVNEXTP,EPABNXTP(,EPBLKPTR)                     02S0620 02375000
*  RFY (REG0,REG1) RSTD;               /* RESERVE SVC REGS   @ZM41392*/ 02376000
*  REG1 = EPBLKPTR;                    /* BLK TO FREE        @ZM41392*/ 02377000
         LR    REG1,EPBLKPTR                                    02S0622 02378000
*  REG0 = EPABSIZE;                    /* SIZE OF BLK        @ZM41392*/ 02379000
         L     REG0,EPABSIZE(,EPBLKPTR)                         02S0623 02380000
*  REG0 = REG0 | SUBPL230;             /* INDICATE SUBPOOL   @ZM41392*/ 02381000
         O     REG0,@CF00271                                    02S0624 02382000
*  GEN (FREEMAIN R,LV=(0),A=(1));      /* FREE EPA BLOCK     @ZM41392*/ 02383000
         FREEMAIN R,LV=(0),A=(1)                                        02384000
*  RFY (REG0,REG1) UNRSTD;             /* RELEASE SVC REGS   @ZM41392*/ 02385000
*  EPBLKPTR = SAVNEXTP;                /* GET NEXT BLOCK     @ZM41392*/ 02386000
         LR    EPBLKPTR,SAVNEXTP                                02S0627 02387000
*END;                                  /* END FREE EPA BLKS  @ZM41392*/ 02388000
@DE00619 LTR   EPBLKPTR,EPBLKPTR                                02S0628 02389000
         BNZ   @DL00619                                         02S0628 02390000
*WTOSW = OFF;                          /* WTO NOT ISSUED YET         */ 02391000
         NI    WTOSW,B'01111111'                                02S0629 02392000
*DO MSGCTR = ONE TO DIM(RESNCODE);     /* LOOK AT ALL REASON CODES   */ 02393000
         LA    MSGCTR,1                                         02S0630 02394000
@DL00630 DS    0H                                               02S0631 02395000
*  IF RESNCODE(MSGCTR) ^= ZERO THEN    /* VALID REASON CODE          */ 02396000
         LR    @03,MSGCTR                                       02S0631 02397000
         ALR   @03,@03                                          02S0631 02398000
         LH    @03,RESNCODE-2(@03)                              02S0631 02399000
         LTR   @03,@03                                          02S0631 02400000
         BZ    @RF00631                                         02S0631 02401000
*    DO;                                                        02S0632 02402000
*      MSG(1:MSGLNTH) = STEPMSG(1:MSGLNTH); /* MOVE MSG TO LCL AREA  */ 02403000
         SLA   @03,2                                            02S0633 02404000
         L     @15,@CA00296                                     02S0633 02405000
         LA    @01,0(@03,@15)                                   02S0633 02406000
         BCTR  @01,0                                            02S0633 02407000
         BCTR  @01,0                                            02S0633 02408000
         LH    @14,MSGLNTH(,@01)                                02S0633 02409000
         LR    @09,@14                                          02S0633 02410000
         BCTR  @09,0                                            02S0633 02411000
         L     @08,@CA00142                                     02S0633 02412000
         AL    @15,@CF03027                                     02S0633 02413000
         AH    @08,MOTOFFST-B410MOFT(@03,@15)                   02S0633 02414000
         EX    @09,@SM03028                                     02S0633 02415000
*      MS1JNAME = JCTJNAME;            /* MOVE JOB NAME TO MSG       */ 02416000
         L     @03,PARMPTR                                      02S0634 02417000
         L     @01,JCTPTR(,@03)                                 02S0634 02418000
         MVC   MS1JNAME(8),JCTJNAME(@01)                        02S0634 02419000
*      MS1SNAME = SCTSNAME;            /* MOVE STEP NAME TO MSG      */ 02420000
         L     @03,SCTPTR(,@03)                                 02S0635 02421000
         MVC   MS1SNAME(8),SCTSNAME(@03)                        02S0635 02422000
*      MS1PSNAM = SCTSCLPC;            /* MOVE PROC NAME TO MESSAGE  */ 02423000
         MVC   MS1PSNAM(8),SCTSCLPC(@03)                        02S0636 02424000
*      LMSGLNTH = MSGLNTH;             /* MOVE LENGTH TO LCL AREA    */ 02425000
         ST    @14,LMSGLNTH                                     02S0637 02426000
*      CALL IEFAB4F3(ADDR(MSG),LMSGLNTH,CMSGLNTH); /* COMPRESS BLANKS*/ 02427000
         LA    @03,MSG                                          02S0638 02428000
         ST    @03,@TF00001                                     02S0638 02429000
         LA    @03,@TF00001                                     02S0638 02430000
         ST    @03,@AL00001                                     02S0638 02431000
         LA    @03,LMSGLNTH                                     02S0638 02432000
         ST    @03,@AL00001+4                                   02S0638 02433000
         LA    @03,CMSGLNTH                                     02S0638 02434000
         ST    @03,@AL00001+8                                   02S0638 02435000
         L     @15,@CV00288                                     02S0638 02436000
         LA    @01,@AL00001                                     02S0638 02437000
         BALR  @14,@15                                          02S0638 02438000
*      CALL IEFAB4FD                   /* ISSUE THE MESSAGE          */ 02439000
*        (FUNC4FD,ADDR(MSG),CMSGLNTH,0,LCTJSCB);                02S0639 02440000
         LA    @03,FUNC4FD                                      02S0639 02441000
         ST    @03,@AL00001                                     02S0639 02442000
         LA    @03,MSG                                          02S0639 02443000
         ST    @03,@TF00001                                     02S0639 02444000
         LA    @03,@TF00001                                     02S0639 02445000
         ST    @03,@AL00001+4                                   02S0639 02446000
         LA    @03,CMSGLNTH                                     02S0639 02447000
         ST    @03,@AL00001+8                                   02S0639 02448000
         LA    @03,@CF00276                                     02S0639 02449000
         ST    @03,@AL00001+12                                  02S0639 02450000
         L     @03,PARMPTR                                      02S0639 02451000
         L     @03,LCTPTR(,@03)                                 02S0639 02452000
         LA    @03,LCTJSCB(,@03)                                02S0639 02453000
         ST    @03,@AL00001+16                                  02S0639 02454000
         L     @15,@CV00286                                     02S0639 02455000
         LA    @01,@AL00001                                     02S0639 02456000
         BALR  @14,@15                                          02S0639 02457000
*      IF WTOSW = OFF THEN             /* WTO NOT YET ISSUED         */ 02458000
         TM    WTOSW,B'10000000'                                02S0640 02459000
         BNZ   @RF00640                                         02S0640 02460000
*        DO;                                                    02S0641 02461000
*          WTOL = WTOL && WTOL;        /* ZERO WTO LIST              */ 02462000
         XC    WTOL(138),WTOL                                   02S0642 02463000
*          WPLMCSFA = ON;              /* ROUT/DESC CODES PRESENT    */ 02464000
         LA    @03,WTOL                                         02S0643 02465000
         OI    WPLMCSFA(@03),B'10000000'                        02S0643 02466000
*          WPLTXT(1:UNERMSGL) = UNERMSGT(1:UNERMSGL); /* MOVE TEXT   */ 02467000
         L     @15,@CA00329                                     02S0644 02468000
         LH    @14,UNERMSGL-UNERRMSG(,@15)                      02S0644 02469000
         LR    @09,@14                                          02S0644 02470000
         BCTR  @09,0                                            02S0644 02471000
         EX    @09,@SM03030                                     02S0644 02472000
*          LMSGLNTH = UNERMSGL;        /* MOVE LENGTH TO LCL AREA    */ 02473000
         ST    @14,LMSGLNTH                                     02S0645 02474000
*          WTOJNAME = JCTJNAME;        /* MOVE JOB NAME TO MSG       */ 02475000
         LA    @15,4                                            02S0646 02476000
         ALR   @15,@03                                          02S0646 02477000
         L     @14,PARMPTR                                      02S0646 02478000
         L     @01,JCTPTR(,@14)                                 02S0646 02479000
         MVC   WTOJNAME(8,@15),JCTJNAME(@01)                    02S0646 02480000
*          WTOSNAME = SCTSNAME;        /* MOVE STEP NAME TO MSG      */ 02481000
         L     @14,SCTPTR(,@14)                                 02S0647 02482000
         MVC   WTOSNAME(8,@15),SCTSNAME(@14)                    02S0647 02483000
*          WTOPSNAM = SCTSCLPC;        /* MOVE PROC NAME TO MSG      */ 02484000
         MVC   WTOPSNAM(8,@15),SCTSCLPC(@14)                    02S0648 02485000
*          CALL IEFAB4F3               /* COMPRESS BLANKS            */ 02486000
*             (ADDR(WPLTXT),LMSGLNTH,CMSGLNTH);                 02S0649 02487000
         LA    @03,WPLTXT(,@03)                                 02S0649 02488000
         ST    @03,@TF00001                                     02S0649 02489000
         LA    @03,@TF00001                                     02S0649 02490000
         ST    @03,@AL00001                                     02S0649 02491000
         LA    @03,LMSGLNTH                                     02S0649 02492000
         ST    @03,@AL00001+4                                   02S0649 02493000
         LA    @03,CMSGLNTH                                     02S0649 02494000
         ST    @03,@AL00001+8                                   02S0649 02495000
         L     @15,@CV00288                                     02S0649 02496000
         LA    @01,@AL00001                                     02S0649 02497000
         BALR  @14,@15                                          02S0649 02498000
*          WPLLGH = CMSGLNTH + LWTOBYTE; /* SET LENGTH IN WTO LIST   */ 02499000
         LA    @03,WTOL                                         02S0650 02500000
         L     @15,CMSGLNTH                                     02S0650 02501000
         AL    @15,LWTOBYTE                                     02S0650 02502000
         STH   @15,WPLLGH(,@03)                                 02S0650 02503000
*          RFY WPLFLGS BASED(ADDR(WPL)+WPLLGH);                 02S0651 02504000
*          WPLFLGS = WPLFLGS && WPLFLGS; /* ZERO OUT WPL FLAGS       */ 02505000
         ALR   @03,@15                                          02S0652 02506000
         XC    WPLFLGS(8,@03),WPLFLGS(@03)                      02S0652 02507000
*          WPLDESCD = ON;              /* DESC CODE = SYS STATUS MSG */ 02508000
         OI    WPLDESCD(@03),B'00010000'                        02S0653 02509000
*          WPLROUTB = ON;              /* ROUT CODE = MASTER CONSOLE */ 02510000
         OI    WPLROUTB(@03),B'01000000'                        02S0654 02511000
*          GEN REFS(WTOL)              /* ISSUE MESSAGE TO OPERATOR  */ 02512000
*             (WTO MF=(E,WTOL));                                02S0655 02513000
         WTO MF=(E,WTOL)                                                02514000
*          WTOSW = ON;                 /* WTO HAS BEEN ISSUED        */ 02515000
         OI    WTOSW,B'10000000'                                02S0656 02516000
*        END;                                                   02S0657 02517000
*    END;                                                       02S0658 02518000
@RF00640 DS    0H                                               02S0659 02519000
*END;                                                           02S0659 02520000
@RF00631 AH    MSGCTR,@CH00070                                  02S0659 02521000
         CH    MSGCTR,@CH00137                                  02S0659 02522000
         BNH   @DL00630                                         02S0659 02523000
*IF RESNCODE(1) ^= ESTAERR THEN        /* ESTAE WAS ISSUED           */ 02524000
         CLC   RESNCODE(2),@CH00089                             02S0660 02525000
         BE    @RF00660                                         02S0660 02526000
*  DO;                                                          02S0661 02527000
*     DO; /*MODESET  KEYADDR(ZERO)*/                            02S0662 02528000
*       SPKA (ZERO); /*SET PSW KEY*/                            02S0663 02529000
         SLR   @01,@01                                          02S0663 02530000
         SPKA  0(@01)                                           02S0663 02531000
*     END; /*MODESET  KEYADDR(ZERO)*/           /* KEY TO UPDATE JSCB @ 02532000
*40FPPG*/                                                       02S0664 02533000
*    JSCBASWA = ZERO;                  /* RESET TO ZERO      @Z40FPPG*/ 02534000
         L     @15,PARMPTR                                      02S0665 02535000
         L     @15,LCTPTR(,@15)                                 02S0665 02536000
         L     @15,LCTJSCB(,@15)                                02S0665 02537000
         ST    @01,JSCBASWA(,@15)                               02S0665 02538000
*     DO; /*MODESET  EXTKEY(SCHED)*/                            02S0666 02539000
*       SPKA (16); /*SET PSW KEY*/                              02S0667 02540000
         LA    @01,16                                           02S0667 02541000
         SPKA  0(@01)                                           02S0667 02542000
*     END; /*MODESET  EXTKEY(SCHED)*/           /* BACK TO SCHED KEY  @ 02543000
*40FPPG*/                                                       02S0668 02544000
*    GEN REFS(ESTAEL)                  /* CANCEL ESTAE               */ 02545000
*     (ESTAE 0,MF=(E,ESTAEL));                                  02S0669 02546000
         ESTAE 0,MF=(E,ESTAEL)                                          02547000
*  END;                                                         02S0670 02548000
*LCTSCTVA = SCTANSCT;                  /* SET SVA OF NEXT SCT        */ 02549000
@RF00660 L     @15,PARMPTR                                      02S0671 02550000
         L     @14,LCTPTR(,@15)                                 02S0671 02551000
         L     @15,SCTPTR(,@15)                                 02S0671 02552000
         MVC   LCTSCTVA(3,@14),SCTANSCT(@15)                    02S0671 02553000
* DO; /*MODESET  KEYADDR(ZERO)*/                                02S0672 02554000
*   SPKA (ZERO); /*SET PSW KEY*/                                02S0673 02555000
         SLR   @01,@01                                          02S0673 02556000
         SPKA  0(@01)                                           02S0673 02557000
* END; /*MODESET  KEYADDR(ZERO)*/               /* KEY ZERO TO ALTER TC 02558000
*      */                                                       02S0674 02559000
*TCBCMP = TCBCMP && TCBCMP;            /* RESET TCB COMP. FIELD      */ 02560000
         L     @01,LCTTCBAD(,@14)                               02S0675 02561000
         XC    TCBCMP(4,@01),TCBCMP(@01)                        02S0675 02562000
* DO; /*MODESET  EXTKEY(SCHED)*/                                02S0676 02563000
*   SPKA (16); /*SET PSW KEY*/                                  02S0677 02564000
         LA    @01,16                                           02S0677 02565000
         SPKA  0(@01)                                           02S0677 02566000
* END; /*MODESET  EXTKEY(SCHED)*/               /* BACK TO SCHED KEY    02567000
*      */                                                       02S0678 02568000
*RFY (REG1) RSTD;                                               02S0679 02569000
*REG1 = LCTJSCB;                       /* PARM FOR WTP PUT ROUTINE   */ 02570000
         L     REG1,LCTJSCB(,@14)                               02S0680 02571000
*CALL IEEAB401;                        /* WTP PPUT ROUTINE           */ 02572000
         L     @15,@CV00282                                     02S0681 02573000
         BALR  @14,@15                                          02S0681 02574000
*RFY (REG1) UNRSTD;                                             02S0682 02575000
*IF (JCTSTEPR = ON | JCTCKPTR = ON) & LCTJFAIL = OFF THEN /* STEP       02576000
*                                         WILL RESTART               */ 02577000
         L     @15,PARMPTR                                      01S0683 02578000
         L     @01,JCTPTR(,@15)                                 01S0683 02579000
         TM    JCTSTEPR(@01),B'00001100'                        01S0683 02580000
         BZ    @RF00683                                         01S0683 02581000
         L     @01,LCTPTR(,@15)                                 01S0683 02582000
         TM    LCTJFAIL(@01),B'10000000'                        01S0683 02583000
         BNZ   @RF00683                                         01S0683 02584000
*  RETCODE = RESTART;                  /* RESTART RETURN CODE        */ 02585000
         MVC   RETCODE(4),@CF00066                              01S0684 02586000
*ELSE                                                           01S0685 02587000
*  IF SCTANSCT = ZERO | LCTJFAIL = ON THEN /* END OF JOB HAS OCCURRED*/ 02588000
         B     @RC00683                                         01S0685 02589000
@RF00683 L     @15,PARMPTR                                      01S0685 02590000
         L     @01,SCTPTR(,@15)                                 01S0685 02591000
         ICM   @00,7,SCTANSCT(@01)                              01S0685 02592000
         BZ    @RT00685                                         01S0685 02593000
         L     @01,LCTPTR(,@15)                                 01S0685 02594000
         TM    LCTJFAIL(@01),B'10000000'                        01S0685 02595000
         BNO   @RF00685                                         01S0685 02596000
@RT00685 DS    0H                                               01S0686 02597000
*    RETCODE = JOBEND;                 /* JOB END RETURN CODE        */ 02598000
         MVC   RETCODE(4),@CF00089                              01S0686 02599000
*  ELSE                                /* NOT END OF JOB             */ 02600000
*    RETCODE = ZERO;                   /* NORMAL RETURN CODE         */ 02601000
         B     @RC00685                                         01S0687 02602000
@RF00685 SLR   @15,@15                                          01S0687 02603000
         ST    @15,RETCODE                                      01S0687 02604000
*RETURN CODE(RETCODE);                                          01S0688 02605000
@RC00685 DS    0H                                               01S0688 02606000
@RC00683 L     @03,RETCODE                                      01S0688 02607000
         IC    @02,@OLDKEY                                      01S0688 02608000
         L     @13,4(,@13)                                      01S0688 02609000
         L     @00,@SIZDATD                                     01S0688 02610000
         LR    @01,@10                                          01S0688 02611000
         FSPACE   R,LV=(0),A=(1)                                        02612000
         MODESET KEYADDR=(2)                                            02613000
         LR    @15,@03                                          01S0688 02614000
         L     @14,12(,@13)                                     01S0688 02615000
         LM    @00,@12,20(@13)                                  01S0688 02616000
         BR    @14                                              01S0688 02617000
*/********************************************************************/ 02618000
*/*                                                                  */ 02619000
*/* SEGMENT NAME - ENDSMSG                                           */ 02620000
*/*                                                                  */ 02621000
*/* DESCRIPTIVE NAME - ISSUE END OF STEP MESSAGES                    */ 02622000
*/*                                                                  */ 02623000
*/* FUNCTION -                                                       */ 02624000
*/*   THE FUNCTION OF THIS SEGMENT IS TO ISSUE END OF STEP STATUS    */ 02625000
*/*   MESSAGES TO THE OPERATOR AND THE PROGRAMMER.                   */ 02626000
*/*                                                                  */ 02627000
*/*   OPERATION -                                                    */ 02628000
*/*   1. COMPLETE THE MESSAGE -                                      */ 02629000
*/*      THE JOB NAME, STEP NAME, AND PROC STEP NAME ARE PUT IN      */ 02630000
*/*      THE MESSAGES. IN ADDITION IF THE MESSAGE IS TO BE SENT TO   */ 02631000
*/*      THE OPERATOR AND TIME IS REQUESTED, THE TIME IS INSERTED    */ 02632000
*/*      INTO THE MESSAGE.                                           */ 02633000
*/*                                                                  */ 02634000
*/*   2. ISSUE THE MESSAGE(S) -                                      */ 02635000
*/*      THE MESSAGE IS ISSUED TO THE PROGRAMMER. IN ADDITION        */ 02636000
*/*      A MESSAGE IS ISSUED TO THE OPERATOR IF REQUESTED.           */ 02637000
*/*                                                                  */ 02638000
*/* ENTRY - IN-LINE SEGMENT                                          */ 02639000
*/*                                                                  */ 02640000
*/*   INPUT -                                                        */ 02641000
*/*                                                                  */ 02642000
*/*     WPL - WTO PARAMETER LIST                                     */ 02643000
*/*       WPLTXT - TEXT OF MESSAGE                                   */ 02644000
*/*                                                                  */ 02645000
*/*     WTOSW - ISSUE WTO IF ON                                      */ 02646000
*/*                                                                  */ 02647000
*/*     TIMESW - PUT TIME IN THE MESSAGE                             */ 02648000
*/*                                                                  */ 02649000
*/*     TIME - STRUCTURE CONTAINING:                                 */ 02650000
*/*       HOURS - HOUR OF THE DAY                                    */ 02651000
*/*       MINUTES - MINUTE OF THE HOUR                               */ 02652000
*/*       SECONDS - SECOND OF THE MINUTE                             */ 02653000
*/*                                                                  */ 02654000
*/*     WMSGLNTH - LENGTH OF WTO MESSAGE TEXT                        */ 02655000
*/*                                                                  */ 02656000
*/*     LMSGLNTH - LENGTH OF PROGRAMMER MESSAGE TEXT                 */ 02657000
*/*                                                                  */ 02658000
*/*     JCT -                                                        */ 02659000
*/*       JCTJNAME - JOB NAME                                        */ 02660000
*/*                                                                  */ 02661000
*/*     SCT -                                                        */ 02662000
*/*       SCTSNAME - STEP NAME                                       */ 02663000
*/*       SCTSCLPC - PROC STEP NAME                                  */ 02664000
*/*                                                                  */ 02665000
*/* EXIT -                                                           */ 02666000
*/*   CONDITION - NORMAL                                             */ 02667000
*/*                                                                  */ 02668000
*/*   OUTPUT -                                                       */ 02669000
*/*     MESSAGE(S) ISSUED                                            */ 02670000
*/*     LCT                                                          */ 02671000
*/*       LCTERRM - SET ON IF JOB ABENDED MSG ISSUED                 */ 02672000
*/*                                                                  */ 02673000
*/*     RETURN CODE - NONE                                           */ 02674000
*/*                                                                  */ 02675000
*/********************************************************************/ 02676000
*ENDSMSG: PROC;                        /* MAKE ENDSMSG A PROCEDURE      02677000
*                                         SINCE IT IS CALLED TWICE      02678000
*                                         FROM ISSUMSGS SEG  @ZA08480*/ 02679000
ENDSMSG  STM   @14,@12,@SA00002                                 02S0689 02680000
*IF WTOSW = ON THEN                    /* ISSUE A WTO                */ 02681000
         TM    WTOSW,B'10000000'                                02S0690 02682000
         BNO   @RF00690                                         02S0690 02683000
*  DO;                                                          02S0691 02684000
*    WTOJNAME = JCTJNAME;              /* PUT JOB NAME IN MESSAGE    */ 02685000
         LA    @03,WTOL                                         02S0692 02686000
         LA    @15,4                                            02S0692 02687000
         ALR   @15,@03                                          02S0692 02688000
         L     @14,PARMPTR                                      02S0692 02689000
         L     @01,JCTPTR(,@14)                                 02S0692 02690000
         MVC   WTOJNAME(8,@15),JCTJNAME(@01)                    02S0692 02691000
*    WTOSNAME = SCTSNAME;              /* PUT STEP NAME IN MESSAGE   */ 02692000
         L     @14,SCTPTR(,@14)                                 02S0693 02693000
         MVC   WTOSNAME(8,@15),SCTSNAME(@14)                    02S0693 02694000
*    WTOPSNAM = SCTSCLPC;              /* PUT PROC STEP IN MESSAGE   */ 02695000
         MVC   WTOPSNAM(8,@15),SCTSCLPC(@14)                    02S0694 02696000
*    TIMEPTR = ADDR(WPLTXT)+WTOTDISP;  /* SET TIME POINTER           */ 02697000
*                                                               02S0695 02698000
         LA    TIMEPTR,WPLTXT(,@03)                             02S0695 02699000
         L     @03,@CA00332                                     02S0695 02700000
         AH    TIMEPTR,WTOTDISP-WTOABEND(,@03)                  02S0695 02701000
*    IF TIMESW = ON THEN               /* TIME REQUESTED             */ 02702000
         TM    TIMESW,B'00001000'                               02S0696 02703000
         BNO   @RF00696                                         02S0696 02704000
*      DO;                             /* PUT TIME IN MESSAGE        */ 02705000
*        WTOHH = HOURS;                /* HOURS IN MESSAGE           */ 02706000
         MVC   WTOHH(2,TIMEPTR),HOURS                           02S0698 02707000
*        WTOMM = MINUTES;              /* MINUTES IN MESSAGE         */ 02708000
         MVC   WTOMM(2,TIMEPTR),MINUTES                         02S0699 02709000
*        WTOSS = SECONDS;              /* SECONDS IN MESSAGE         */ 02710000
         MVC   WTOSS(2,TIMEPTR),SECONDS                         02S0700 02711000
*      END;                                                     02S0701 02712000
*    ELSE                              /* TIME NOT WANTED            */ 02713000
*      WTOTIME = '';                   /* BLANK OUT TIME             */ 02714000
         B     @RC00696                                         02S0702 02715000
@RF00696 MVI   WTOTIME(TIMEPTR),C' '                            02S0702 02716000
         MVC   WTOTIME+1(14,TIMEPTR),WTOTIME(TIMEPTR)           02S0702 02717000
*    CALL IEFAB4F3(ADDR(WPLTXT),WMSGLNTH,CMSGLNTH); /*COMPRESS BLANKS*/ 02718000
@RC00696 LA    @15,WTOL                                         02S0703 02719000
         LA    @15,WPLTXT(,@15)                                 02S0703 02720000
         ST    @15,@TF00001                                     02S0703 02721000
         LA    @15,@TF00001                                     02S0703 02722000
         ST    @15,@AL00001                                     02S0703 02723000
         LA    @15,WMSGLNTH                                     02S0703 02724000
         ST    @15,@AL00001+4                                   02S0703 02725000
         LA    @15,CMSGLNTH                                     02S0703 02726000
         ST    @15,@AL00001+8                                   02S0703 02727000
         L     @15,@CV00288                                     02S0703 02728000
         LA    @01,@AL00001                                     02S0703 02729000
         BALR  @14,@15                                          02S0703 02730000
*    WPLLGH = CMSGLNTH + LWTOBYTE;     /* SET LENGTH IN WTO PARM LIST*/ 02731000
         LA    @15,WTOL                                         02S0704 02732000
         L     @14,CMSGLNTH                                     02S0704 02733000
         AL    @14,LWTOBYTE                                     02S0704 02734000
         STH   @14,WPLLGH(,@15)                                 02S0704 02735000
*    WPLMCSFA = ON;                    /* ROUT/DESC CODES PRESENT    */ 02736000
*    WPLMCSFC = ON;                    /* COMMAND RESPONSE           */ 02737000
         OI    WPLMCSFA(@15),B'10100000'                        02S0706 02738000
*    RFY WPLFLGS BASED(ADDR(WPL)+WPLLGH);                       02S0707 02739000
*    WPLFLGS = WPLFLGS && WPLFLGS;     /* CLEAR FLAGS                */ 02740000
         ALR   @15,@14                                          02S0708 02741000
         XC    WPLFLGS(8,@15),WPLFLGS(@15)                      02S0708 02742000
*    WPLDESCF = ON;                    /* DESC CODE = JOB STATUS     */ 02743000
         OI    WPLDESCF(@15),B'00000100'                        02S0709 02744000
*    WPLROUTB = ON;                    /* ROUT CODE = MSTR CNSL INFO */ 02745000
         OI    WPLROUTB(@15),B'01000000'                        02S0710 02746000
*    GEN REFS(WTOL)                    /* WRITE TO THE OPERATOR      */ 02747000
*       (WTO MF=(E,WTOL));                                      02S0711 02748000
         WTO MF=(E,WTOL)                                                02749000
*  END;                                                         02S0712 02750000
*IF CHCLD = ON THEN                    /* JOB CANCELLED              */ 02751000
@RF00690 L     @01,PARMPTR                                      02S0713 02752000
         L     @15,LCTPTR(,@01)                                 02S0713 02753000
         L     @01,LCTQDRTY(,@15)                               02S0713 02754000
         TM    CHCLD(@01),B'00000100'                           02S0713 02755000
         BNO   @RF00713                                         02S0713 02756000
*  LCTERRM = ON;                       /* SET EOJ MSG ISSUED         */ 02757000
         OI    LCTERRM(@15),B'00000001'                         02S0714 02758000
*MS1JNAME = JCTJNAME;                  /* JOB NAME IN MESSAGE        */ 02759000
@RF00713 L     @15,PARMPTR                                      02S0715 02760000
         L     @01,JCTPTR(,@15)                                 02S0715 02761000
         MVC   MS1JNAME(8),JCTJNAME(@01)                        02S0715 02762000
*MS1SNAME = SCTSNAME;                  /* STEP NAME TO MESSAGE       */ 02763000
         L     @15,SCTPTR(,@15)                                 02S0716 02764000
         MVC   MS1SNAME(8),SCTSNAME(@15)                        02S0716 02765000
*MS1PSNAM = SCTSCLPC;                  /* PROC NAME TO MESSAGE       */ 02766000
         MVC   MS1PSNAM(8),SCTSCLPC(@15)                        02S0717 02767000
*CALL IEFAB4F3(ADDR(MSG),LMSGLNTH,CMSGLNTH); /* COMPRESS BLANKS      */ 02768000
         LA    @15,MSG                                          02S0718 02769000
         ST    @15,@TF00001                                     02S0718 02770000
         LA    @15,@TF00001                                     02S0718 02771000
         ST    @15,@AL00001                                     02S0718 02772000
         LA    @15,LMSGLNTH                                     02S0718 02773000
         ST    @15,@AL00001+4                                   02S0718 02774000
         LA    @15,CMSGLNTH                                     02S0718 02775000
         ST    @15,@AL00001+8                                   02S0718 02776000
         L     @15,@CV00288                                     02S0718 02777000
         LA    @01,@AL00001                                     02S0718 02778000
         BALR  @14,@15                                          02S0718 02779000
*CALL IEFAB4FD                         /* SEND MESSAGE TO PGMR       */ 02780000
*  (FUNC4FD,ADDR(MSG),CMSGLNTH,0,LCTJSCB);                      02S0719 02781000
         LA    @15,FUNC4FD                                      02S0719 02782000
         ST    @15,@AL00001                                     02S0719 02783000
         LA    @15,MSG                                          02S0719 02784000
         ST    @15,@TF00001                                     02S0719 02785000
         LA    @15,@TF00001                                     02S0719 02786000
         ST    @15,@AL00001+4                                   02S0719 02787000
         LA    @15,CMSGLNTH                                     02S0719 02788000
         ST    @15,@AL00001+8                                   02S0719 02789000
         LA    @15,@CF00276                                     02S0719 02790000
         ST    @15,@AL00001+12                                  02S0719 02791000
         L     @01,PARMPTR                                      02S0719 02792000
         L     @01,LCTPTR(,@01)                                 02S0719 02793000
         LA    @15,LCTJSCB(,@01)                                02S0719 02794000
         ST    @15,@AL00001+16                                  02S0719 02795000
         L     @15,@CV00286                                     02S0719 02796000
         LA    @01,@AL00001                                     02S0719 02797000
         BALR  @14,@15                                          02S0719 02798000
*END ENDSMSG;                          /* PROCEDURE END      @ZA08480*/ 02799000
@EL00002 DS    0H                                               02S0720 02800000
@EF00002 DS    0H                                               02S0720 02801000
@ER00002 LM    @14,@12,@SA00002                                 02S0720 02802000
         BR    @14                                              02S0720 02803000
*END IEFBB410                                                   01S0721 02804000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 02805000
*/*%INCLUDE SYSLIB  (B410SPEC)                                        * 02806000
*/*%INCLUDE SYSLIB  (B410DATA)                                        * 02807000
*/*%INCLUDE SYSLIB  (IEFZB505)                                        * 02808000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 02809000
*/*%INCLUDE SYSLIB  (IEEBASEA)                                        * 02810000
*/*%INCLUDE SYSLIB  (IEECHAIN)                                        * 02811000
*/*%INCLUDE SYSLIB  (IEFAJCTB)                                        * 02812000
*/*%INCLUDE SYSLIB  (IEFALLCT)                                        * 02813000
*/*%INCLUDE SYSLIB  (IEFASCTB)                                        * 02814000
*/*%INCLUDE SYSLIB  (IEFASIOT)                                        * 02815000
*/*%INCLUDE SYSLIB  (IEFZB424)                                        * 02816000
*/*%INCLUDE SYSLIB  (IEFZB440)                                        * 02817000
*/*%INCLUDE SYSLIB  (IEFZB436)                                        * 02818000
*/*%INCLUDE SYSLIB  (IEFZB443)                                        * 02819000
*/*%INCLUDE SYSLIB  (IEZWPL  )                                        * 02820000
*/*%INCLUDE SYSLIB  (IEZJSCB )                                        * 02821000
*/*%INCLUDE SYSLIB  (IHADSAB )                                        * 02822000
*/*%INCLUDE SYSLIB  (IHAQDB  )                                        * 02823000
*/*%INCLUDE SYSLIB  (IEFZB4D5)                                        * 02824000
*/*%INCLUDE SYSLIB  (IEFZB453)                                        * 02825000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                        * 02826000
*/*%INCLUDE SYSLIB  (IHAASCB )                                        * 02827000
*/*%INCLUDE SYSLIB  (B410INIT)                                        * 02828000
*/*%INCLUDE SYSLIB  (INTUSPEC)                                        * 02829000
*/*%INCLUDE SYSLIB  (ESTAECOD)                                        * 02830000
*/*%INCLUDE SYSLIB  (ESTAESPC)                                        * 02831000
*/*%INCLUDE SYSLIB  (ISSUMSGS)                                        * 02832000
*/*%INCLUDE SYSLIB  (ISSUSPEC)                                        * 02833000
*/*%INCLUDE SYSLIB  (SETCODES)                                        * 02834000
*/*%INCLUDE SYSLIB  (SETCSPEC)                                        * 02835000
*/*%INCLUDE SYSLIB  (CALLUNAL)                                        * 02836000
*/*%INCLUDE SYSLIB  (CALUSPEC)                                        * 02837000
*/*%INCLUDE SYSLIB  (ENDOSTEP)                                        * 02838000
*/*%INCLUDE SYSLIB  (ENDSSPEC)                                        * 02839000
*/*%INCLUDE SYSLIB  (TERMCALL)                                        * 02840000
*/*%INCLUDE SYSLIB  (TERMSPEC)                                        * 02841000
*/*%INCLUDE SYSLIB  (ENDOFJOB)                                        * 02842000
*/*%INCLUDE SYSLIB  (JENDSPEC)                                        * 02843000
*/*%INCLUDE SYSLIB  (ENDJMSG )                                        * 02844000
*/*%INCLUDE SYSLIB  (ENDJMSPC)                                        * 02845000
*/*%INCLUDE SYSLIB  (SETTIME )                                        * 02846000
*/*%INCLUDE SYSLIB  (SETTSPEC)                                        * 02847000
*/*%INCLUDE SYSLIB  (B410CLNP)                                        * 02848000
*/*%INCLUDE SYSLIB  (CLNUSPEC)                                        * 02849000
*/*%INCLUDE SYSLIB  (ENDSMSG )                                        * 02850000
*/*%INCLUDE SYSLIB  (ENDMSPEC)                                        * 02851000
*;                                                              01S0721 02852000
@DATA    DS    0H                                                       02853000
@CH00070 DC    H'1'                                                     02854000
@CH00115 DC    H'3'                                                     02855000
@CH00137 DC    H'6'                                                     02856000
@CH02964 DC    H'48'                                                    02857000
@CH00185 DC    H'240'                                                   02858000
@SM02994 MVC   ESTAEL(0),ESTAEP                                         02859000
@SM03000 MVC   WPLTXT(0,@15),WTOABNDM-WTOABEND(@14)                     02860000
@SM03002 MVC   MSG(0),PGMABNDM-PGMABEND(@15)                            02861000
@SM03004 MVC   MSG(0),STEPRUNM-STEPRUN(@15)                             02862000
@SM03006 MVC   MSG(0),STNOTRNM-STNOTRUN(@15)                            02863000
@SM03008 MVC   MSG(0),STNOATOM-STNOAUTO(@15)                            02864000
@SM03014 MVC   DEQLIST(0),DEQFMT                                        02865000
@SM03016 MVC   WPLTXT(0,@09),ENDEDM-JOBENDED(@15)                       02866000
@SM03018 MVC   WPLTXT(0,@09),LOGOFFM-LOGGDOFF(@15)                      02867000
@SM03020 MVC   WPLTXT(0,@09),CCFAILM-CCFAIL(@15)                        02868000
@SM03022 MVC   MSG(0),PGMCTEXT-PGMCFAIL(@15)                            02869000
@SM03024 MVC   WPLTXT(0,@09),JOBFAILM-JOBFAILD(@15)                     02870000
@SM03028 MVC   MSG(0),STEPMSG(@08)                                      02871000
@SM03030 MVC   WPLTXT(0,@03),UNERMSGT-UNERRMSG(@15)                     02872000
         DS    0F                                                       02873000
@AL00616 DC    A(@CF00276)             LIST WITH   5 ARGUMENT(S)        02874000
         DC    A(@CF00276)                                              02875000
         DC    A(@CF00276)                                              02876000
         DC    A(@CF00276)                                              02877000
         DC    A(@CF00276)                                              02878000
@DATD    DSECT                                                          02879000
         DS    0F                                                       02880000
@SA00001 DS    18F                                                      02881000
@PC00001 DS    1F                                                       02882000
@SA00002 DS    15F                                                      02883000
@AL00001 DS    9A                                                       02884000
@TF00001 DS    F                                                        02885000
IEFBB410 CSECT                                                          02886000
         DS    0F                                                       02887000
@CF00276 DC    F'0'                                                     02888000
@CF00089 DC    F'4'                                                     02889000
@CH00089 EQU   @CF00089+2                                               02890000
@CF00066 DC    F'8'                                                     02891000
@CF00034 DC    F'12'                                                    02892000
@CF00054 DC    F'16'                                                    02893000
@CH00054 EQU   @CF00054+2                                               02894000
@CF03027 DC    F'-4'                                                    02895000
@CF00271 DC    XL4'E6000000'                                            02896000
@CF00248 DC    XL4'0FFF'                                                02897000
@DATD    DSECT                                                          02898000
         DS    0D                                                       02899000
PARMPTR  DS    A                                                        02900000
CSCBPTR  DS    A                                                        02901000
ESTAPTR  DS    A                                                        02902000
FEPBLKP  DS    A                                                        02903000
QDBPTR   DS    A                                                        02904000
SWEPAPTR DS    A                                                        02905000
TIORBPTR DS    A                                                        02906000
WPLPTR   DS    A                                                        02907000
CMSGLNTH DS    F                                                        02908000
LMSGLNTH DS    F                                                        02909000
UNCATRTN DS    F                                                        02910000
RETCODE  DS    F                                                        02911000
WMSGLNTH DS    F                                                        02912000
CATDSNSZ DS    F                                                        02913000
CATALDSN DS    A                                                        02914000
GTSTRTCD DS    F                                                        02915000
SWACTLS  DS    FL2                                                      02916000
         ORG   SWACTLS                                                  02917000
SWASN    DS    BL1                                                      02918000
SWDEL    EQU   SWACTLS+0                                                02919000
SWREAD   EQU   SWACTLS+0                                                02920000
SWWRT    EQU   SWACTLS+0                                                02921000
SWNEW    EQU   SWACTLS+0                                                02922000
SWFREE   EQU   SWACTLS+0                                                02923000
SWMOD    EQU   SWACTLS+0                                                02924000
SWOLD    EQU   SWACTLS+0                                                02925000
SWCHN    DS    BL1                                                      02926000
@NM00204 EQU   SWACTLS+1                                                02927000
         ORG   SWACTLS+2                                                02928000
UCCNTRLS DS    FL2                                                      02929000
         ORG   UCCNTRLS                                                 02930000
UCCAJSCB DS    BL1                                                      02931000
UCNTIONQ EQU   UCCNTRLS+0                                               02932000
UCONECAT EQU   UCCNTRLS+0                                               02933000
UCALLCAT EQU   UCCNTRLS+0                                               02934000
UCONEACB EQU   UCCNTRLS+0                                               02935000
UCALLACB EQU   UCCNTRLS+0                                               02936000
UCONPCCB EQU   UCCNTRLS+0                                               02937000
UCALPCCB EQU   UCCNTRLS+0                                               02938000
UCTEMP   DS    BL1                                                      02939000
UCSWTIOT EQU   UCCNTRLS+1                                               02940000
@NM00205 EQU   UCCNTRLS+1                                               02941000
         ORG   UCCNTRLS+2                                               02942000
FUNC4FD  DS    BL1                                                      02943000
         ORG   FUNC4FD                                                  02944000
@NM00001 DS    BL1                                                      02945000
WTPONLY  EQU   FUNC4FD+0                                                02946000
         ORG   FUNC4FD+1                                                02947000
         DS    CL3                                                      02948000
SWARDRET DS    CL12                                                     02949000
         ORG   SWARDRET                                                 02950000
FSIOTP   DS    AL4                                                      02951000
FEPAPTR  DS    AL4                                                      02952000
LEPAPTR  DS    AL4                                                      02953000
         ORG   SWARDRET+12                                              02954000
ASWACORE DS    CL40                                                     02955000
A4FEFMAP DS    BL1                                                      02956000
         ORG   A4FEFMAP                                                 02957000
SCANSCT  DS    BL1                                                      02958000
SCANDSAB EQU   A4FEFMAP+0                                               02959000
@NM00003 EQU   A4FEFMAP+0                                               02960000
EPASGOTN EQU   A4FEFMAP+0                                               02961000
@NM00004 EQU   A4FEFMAP+0                                               02962000
         ORG   A4FEFMAP+1                                               02963000
BCDCCODE DS    CL5                                                      02964000
COMPCODE DS    CL4                                                      02965000
DECCODE  DS    CL8                                                      02966000
DECTIME  DS    CL4                                                      02967000
DECUSRCD DS    CL8                                                      02968000
JOBFNMAP DS    BL1                                                      02969000
         ORG   JOBFNMAP                                                 02970000
JOBCNDSP DS    BL1                                                      02971000
JOBMSGS  EQU   JOBFNMAP+0                                               02972000
JOBDSPRC EQU   JOBFNMAP+0                                               02973000
JOBMSTAT EQU   JOBFNMAP+0                                               02974000
         ORG   JOBFNMAP+1                                               02975000
MSG      DS    CL120                                                    02976000
         ORG   MSG                                                      02977000
@NM00005 DS    CL8                                                      02978000
MS1JNAME DS    CL8                                                      02979000
@NM00006 DS    CL1                                                      02980000
MS1SNAME DS    CL8                                                      02981000
@NM00007 DS    CL1                                                      02982000
MS1PSNAM DS    CL8                                                      02983000
         ORG   MSG+120                                                  02984000
MSGINFO  DS    CL24                                                     02985000
         ORG   MSGINFO                                                  02986000
MSGJNAME DS    CL8                                                      02987000
MSGSNAME DS    CL8                                                      02988000
MSGPSNAM DS    CL8                                                      02989000
         ORG   MSGINFO+24                                               02990000
STUFMAP  DS    CL3                                                      02991000
         ORG   STUFMAP                                                  02992000
STFMBYT1 DS    BL1                                                      02993000
         ORG   STFMBYT1                                                 02994000
STDISPRC DS    BL1                                                      02995000
STALCMSG EQU   STFMBYT1+0                                               02996000
STDSPMSG EQU   STFMBYT1+0                                               02997000
STUNUNIT EQU   STFMBYT1+0                                               02998000
STMNSTAT EQU   STFMBYT1+0                                               02999000
STUPJFCB EQU   STFMBYT1+0                                               03000000
STFRDSAB EQU   STFMBYT1+0                                               03001000
STJES3   EQU   STFMBYT1+0                                               03002000
         ORG   STUFMAP+1                                                03003000
STFMBYT2 DS    BL1                                                      03004000
         ORG   STFMBYT2                                                 03005000
STNMDISP DS    BL1                                                      03006000
STKEEP   EQU   STFMBYT2+0                                               03007000
STCNDISP EQU   STFMBYT2+0                                               03008000
STKPDEL  EQU   STFMBYT2+0                                               03009000
STINVUCB EQU   STFMBYT2+0                                               03010000
STPASS   EQU   STFMBYT2+0                                               03011000
STPURGE  EQU   STFMBYT2+0                                               03012000
STCHKPAS EQU   STFMBYT2+0                                               03013000
         ORG   STUFMAP+2                                                03014000
STFMBYT3 DS    BL1                                                      03015000
         ORG   STFMBYT3                                                 03016000
STNOVUT  DS    BL1                                                      03017000
STPUBPRV EQU   STFMBYT3+0                                               03018000
STSPSCR  EQU   STFMBYT3+0                                               03019000
STNOSSDS EQU   STFMBYT3+0                                               03020000
STALSTCT EQU   STFMBYT3+0                                               03021000
STPPCATS EQU   STFMBYT3+0                                               03022000
@NM00008 EQU   STFMBYT3+0                                               03023000
         ORG   STUFMAP+3                                                03024000
SWITCHES DS    BL1                                                      03025000
         ORG   SWITCHES                                                 03026000
WTOSW    DS    BL1                                                      03027000
MSGSW    EQU   SWITCHES+0                                               03028000
JOBNSW   EQU   SWITCHES+0                                               03029000
CONDFAIL EQU   SWITCHES+0                                               03030000
TIMESW   EQU   SWITCHES+0                                               03031000
         ORG   SWITCHES+1                                               03032000
SYSABCDE DS    CL3                                                      03033000
TIME     DS    CL7                                                      03034000
         ORG   TIME                                                     03035000
HOURS    DS    CL2                                                      03036000
MINUTES  DS    CL2                                                      03037000
SECONDS  DS    CL2                                                      03038000
         ORG   TIME+7                                                   03039000
USRABCDE DS    CL4                                                      03040000
         DS    CL3                                                      03041000
TMCORE   DS    CL38                                                     03042000
ESTPARMS DS    CL272                                                    03043000
         DS    CL2                                                      03044000
WTOL     DS    CL138                                                    03045000
         ORG   WTOL                                                     03046000
@NM00207 DS    CL130                                                    03047000
@NM00208 DS    CL8                                                      03048000
         ORG   WTOL+138                                                 03049000
AB4EDPMS DS    CL500                                                    03050000
TERMAREA DS    CL16                                                     03051000
RESNCODE DS    6H                                                       03052000
@OLDKEY  DS    AL1                                                      03053000
IEFBB410 CSECT                                                          03054000
         DS    0F                                                       03055000
@SIZDATD DC    AL1(230)                                                 03056000
         DC    AL3(@ENDDATD-@DATD)                                      03057000
@CA00142 DC    A(B410MSGT)                                              03058000
@CV00282 DC    V(IEEAB401)                                              03059000
@CV00283 DC    V(IEFAB4DD)                                              03060000
@CV00284 DC    V(IEFAB4ED)                                              03061000
@CV00285 DC    V(IEFAB4FC)                                              03062000
@CV00286 DC    V(IEFAB4FD)                                              03063000
@CV00287 DC    V(IEFAB4FE)                                              03064000
@CV00288 DC    V(IEFAB4F3)                                              03065000
@CV00289 DC    V(IEFAB4F4)                                              03066000
@CV00290 DC    V(IEFAB4F7)                                              03067000
@CV00291 DC    V(IEFTB721)                                              03068000
@CV00292 DC    V(IEFBB412)                                              03069000
@CV00293 DC    V(IEFBB414)                                              03070000
@CV00294 DC    V(IEFBB416)                                              03071000
@CV00295 DC    V(IEFRPREP)                                              03072000
@CA00296 DC    A(B410MOFT)                                              03073000
@CA00298 DC    A(CCFAIL)                                                03074000
@CA00302 DC    A(JOBENDED)                                              03075000
@CA00306 DC    A(JOBFAILD)                                              03076000
@CA00310 DC    A(LOGGDOFF)                                              03077000
@CA00314 DC    A(PGMABEND)                                              03078000
@CA00317 DC    A(PGMCFAIL)                                              03079000
@CA00320 DC    A(STEPRUN)                                               03080000
@CA00323 DC    A(STNOTRUN)                                              03081000
@CA00326 DC    A(STNOAUTO)                                              03082000
@CA00329 DC    A(UNERRMSG)                                              03083000
@CA00332 DC    A(WTOABEND)                                              03084000
@CV00281 DC    V(IEEAB400)                                              03085000
         DS    0D                                                       03086000
LWTOBYTE DC    AL4(2+2)                                                 03087000
GTSTZERO DC    F'0'                                                     03088000
@CC00272 DC    C'0123456789ABCDEF'                                      03089000
@CC00245 DC    C'IEFAB4DD'                                              03090000
@CC00237 DC    C'ASWA'                                                  03091000
@CC00239 DC    C'0000'                                                  03092000
@CC00250 DC    C'0C0'                                                   03093000
@CC00233 DC    C'0D'                                                    03094000
@CB00278 DC    X'0F'                                                    03095000
VOLUMES  DC    CL8'SYSZVOLS'                                            03096000
DATASETS DC    CL8'SYSDSN  '                                            03097000
OPENJ    DC    CL8'SYSZOPEN'                                            03098000
IEFBB410 CSECT                                                          03099000
DEQFMT DEQ (VOLUMES,,,SYSTEM),MF=L,RET=HAVE,GENERIC=YES                 03100000
DEQENTLN DC A(*-DEQFMT)                                                 03101000
ESTAEP  ESTAE TERM=YES,RECORD=YES,MF=L                                  03102000
ESTAELTH DC   A(*-ESTAEP)                                               03103000
@DATD    DSECT                                                          03104000
DEQLIST DEQ (VOLUMES,,,SYSTEM),MF=L,RET=HAVE,GENERIC=YES                03105000
ESTAEL ESTAE TERM=YES,RECORD=YES,MF=L                                   03106000
IEFBB410 CSECT                                                          03107000
         DS   0H                                                        03108000
B410PTCH DC ((@DATA-@PSTART)/20)X'00'                                   03109000
@DATD    DSECT                                                          03110000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                03111000
@ENDDATD EQU   *                                                        03112000
IEFBB410 CSECT                                                          03113000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       03114000
@01      EQU   01                                                       03115000
@02      EQU   02                                                       03116000
@03      EQU   03                                                       03117000
@04      EQU   04                                                       03118000
@05      EQU   05                                                       03119000
@06      EQU   06                                                       03120000
@07      EQU   07                                                       03121000
@08      EQU   08                                                       03122000
@09      EQU   09                                                       03123000
@10      EQU   10                                                       03124000
@11      EQU   11                                                       03125000
@12      EQU   12                                                       03126000
@13      EQU   13                                                       03127000
@14      EQU   14                                                       03128000
@15      EQU   15                                                       03129000
INDEX    EQU   @04                                                      03130000
INDEX1   EQU   @03                                                      03131000
USERCODE EQU   @02                                                      03132000
SIZEEPAB EQU   @03                                                      03133000
MSGCTR   EQU   @02                                                      03134000
TIMEPTR  EQU   @02                                                      03135000
SAVNEXTP EQU   @03                                                      03136000
SIOTPTR  EQU   @02                                                      03137000
EPBLKPTR EQU   @02                                                      03138000
DSABPTR  EQU   @02                                                      03139000
ASCBPTR  EQU   @02                                                      03140000
ASWAPTR  EQU   @04                                                      03141000
EXITADDR EQU   @02                                                      03142000
PARMADDR EQU   @03                                                      03143000
REG0     EQU   @00                                                      03144000
REG1     EQU   @01                                                      03145000
REG4     EQU   @04                                                      03146000
REG5     EQU   @05                                                      03147000
REG6     EQU   @06                                                      03148000
REG7     EQU   @07                                                      03149000
REG15    EQU   @15                                                      03150000
GTSTR0   EQU   @00                                                      03151000
GTSTR1   EQU   @01                                                      03152000
GTSTR2   EQU   @02                                                      03153000
GTSTR15  EQU   @15                                                      03154000
GTSTR4   EQU   @04                                                      03155000
GTSTR5   EQU   @05                                                      03156000
GTSTR6   EQU   @06                                                      03157000
GTSTR7   EQU   @07                                                      03158000
GTSTR8   EQU   @08                                                      03159000
GTSTR3   EQU   @03                                                      03160000
         EXTRN B410MSGT                                                 03161000
         EXTRN B410MOFT                                                 03162000
         EXTRN CCFAIL                                                   03163000
         EXTRN JOBENDED                                                 03164000
         EXTRN JOBFAILD                                                 03165000
         EXTRN LOGGDOFF                                                 03166000
         EXTRN PGMABEND                                                 03167000
         EXTRN PGMCFAIL                                                 03168000
         EXTRN STEPRUN                                                  03169000
         EXTRN STNOTRUN                                                 03170000
         EXTRN STNOAUTO                                                 03171000
         EXTRN UNERRMSG                                                 03172000
         EXTRN WTOABEND                                                 03173000
CVTPTR   EQU   16                                                       03174000
PARMS    EQU   0                                                        03175000
LCTPTR   EQU   PARMS                                                    03176000
JCTPTR   EQU   PARMS+4                                                  03177000
SCTPTR   EQU   PARMS+8                                                  03178000
TIOTLP   EQU   PARMS+12                                                 03179000
TIOTLIST EQU   0                                                        03180000
TIOTPTR  EQU   TIOTLIST                                                 03181000
TCBPTRS  EQU   0                                                        03182000
TCBPTR   EQU   TCBPTRS+4                                                03183000
ASWA     EQU   0                                                        03184000
ASWAID   EQU   ASWA                                                     03185000
ASWACSCT EQU   ASWA+4                                                   03186000
ASWARTNP EQU   ASWA+12                                                  03187000
ASWAPRMS EQU   ASWA+16                                                  03188000
ASWASCBP EQU   ASWA+20                                                  03189000
ASWAOLDP EQU   ASWA+24                                                  03190000
ASWAFLGS EQU   ASWA+28                                                  03191000
ASWADSWS EQU   ASWAFLGS                                                 03192000
ASWAAUTO EQU   ASWA+32                                                  03193000
MSGCCODE EQU   0                                                        03194000
MSGLNTH  EQU   0                                                        03195000
MSGSYSCD EQU   0                                                        03196000
MSGUSRCD EQU   0                                                        03197000
STEPMSG  EQU   0                                                        03198000
TRTABLE  EQU   0                                                        03199000
WTOJCOND EQU   0                                                        03200000
WTONAMES EQU   0                                                        03201000
WTOJNAME EQU   WTONAMES+8                                               03202000
WTOSNAME EQU   WTONAMES+17                                              03203000
WTOPSNAM EQU   WTONAMES+26                                              03204000
WTOSYSCD EQU   0                                                        03205000
WTOTIME  EQU   0                                                        03206000
WTOHH    EQU   WTOTIME+7                                                03207000
WTOMM    EQU   WTOTIME+10                                               03208000
WTOSS    EQU   WTOTIME+13                                               03209000
WTOUSRCD EQU   0                                                        03210000
CATDSNT  EQU   0                                                        03211000
CATHDR   EQU   CATDSNT                                                  03212000
CATNUM   EQU   CATHDR                                                   03213000
CATDSNP  EQU   CATDSNT+4                                                03214000
SWAEPA   EQU   0                                                        03215000
SWVAFW   EQU   SWAEPA+4                                                 03216000
EPABLK   EQU   0                                                        03217000
EPABHDR  EQU   EPABLK                                                   03218000
EPABSIZE EQU   EPABHDR                                                  03219000
EPABCNT  EQU   EPABHDR+4                                                03220000
EPABNXTP EQU   EPABHDR+8                                                03221000
CVTMAP   EQU   0                                                        03222000
CVTTCBP  EQU   CVTMAP                                                   03223000
CVTILK2  EQU   CVTMAP+40                                                03224000
CVTDAR   EQU   CVTMAP+72                                                03225000
CVTFLGS1 EQU   CVTDAR                                                   03226000
CVTDCB   EQU   CVTMAP+116                                               03227000
CVTIERLC EQU   CVTMAP+144                                               03228000
CVTMSER  EQU   CVTMAP+148                                               03229000
CVTOPTA  EQU   CVTMAP+182                                               03230000
CVTOPTB  EQU   CVTMAP+183                                               03231000
CVTGTF   EQU   CVTMAP+236                                               03232000
CVTGTFST EQU   CVTGTF                                                   03233000
CVTGTFS  EQU   CVTGTFST                                                 03234000
CVTSTATE EQU   CVTGTFST                                                 03235000
CVTTMODE EQU   CVTGTFST                                                 03236000
CVTFORM  EQU   CVTGTFST                                                 03237000
CVTAQAVT EQU   CVTMAP+240                                               03238000
CVTTCMFG EQU   CVTAQAVT                                                 03239000
CVTVOLM2 EQU   CVTMAP+244                                               03240000
CVTTATA  EQU   CVTVOLM2                                                 03241000
CVTTSKS  EQU   CVTTATA                                                  03242000
CVTVOLF2 EQU   CVTTSKS                                                  03243000
CVTTAT   EQU   CVTTATA+1                                                03244000
CVTATER  EQU   CVTMAP+248                                               03245000
CVTEXT1  EQU   CVTMAP+252                                               03246000
CVTPURG  EQU   CVTMAP+260                                               03247000
CVTQMSG  EQU   CVTMAP+268                                               03248000
CVTDMSR  EQU   CVTMAP+272                                               03249000
CVTRSV37 EQU   CVTDMSR                                                  03250000
CVTDMSRF EQU   CVTRSV37                                                 03251000
CVTERPV  EQU   CVTMAP+316                                               03252000
CVTINTLA EQU   CVTMAP+320                                               03253000
CVTAPF   EQU   CVTMAP+324                                               03254000
CVTEXT2  EQU   CVTMAP+328                                               03255000
CVTHJES  EQU   CVTMAP+332                                               03256000
CVTPGSIA EQU   CVTMAP+348                                               03257000
CVTA1F1  EQU   CVTMAP+356                                               03258000
CVTSYSK  EQU   CVTMAP+357                                               03259000
CVTVOLM1 EQU   CVTMAP+380                                               03260000
CVTVOLF1 EQU   CVTVOLM1                                                 03261000
CVTATMCT EQU   CVTMAP+388                                               03262000
CVTXTNT1 EQU   0                                                        03263000
CVTXTNT2 EQU   0                                                        03264000
CVTDSSV  EQU   CVTXTNT2                                                 03265000
CVTFLGBT EQU   CVTXTNT2+5                                               03266000
CVTQID   EQU   CVTXTNT2+24                                              03267000
CVTRV400 EQU   CVTXTNT2+52                                              03268000
CVTRV409 EQU   CVTXTNT2+53                                              03269000
CVTATCVT EQU   CVTXTNT2+64                                              03270000
CVTRV429 EQU   CVTXTNT2+84                                              03271000
CVTRV438 EQU   CVTXTNT2+85                                              03272000
CVTRV457 EQU   CVTXTNT2+112                                             03273000
CVTRV466 EQU   CVTXTNT2+113                                             03274000
CVTFIX   EQU   0                                                        03275000
CVTRELNO EQU   CVTFIX+252                                               03276000
BASE     EQU   0                                                        03277000
@NM00018 EQU   BASE+13                                                  03278000
BALGSTAT EQU   BASE+24                                                  03279000
BALOG    EQU   BALGSTAT+4                                               03280000
BASFL    EQU   BASE+36                                                  03281000
BARSW    EQU   BASFL                                                    03282000
MSLOGST  EQU   BASE+46                                                  03283000
BASPBYTE EQU   BASE+47                                                  03284000
BAMONITR EQU   BASE+56                                                  03285000
BAJNCNT  EQU   BASE+84                                                  03286000
BASESCT  EQU   BASE+86                                                  03287000
BASTCNT  EQU   BASE+88                                                  03288000
@NM00040 EQU   BASE+104                                                 03289000
MSLGCLOZ EQU   BASE+108                                                 03290000
MSCLOSSW EQU   MSLGCLOZ                                                 03291000
MSLGWLOG EQU   BASE+112                                                 03292000
MSWLOGSW EQU   MSLGWLOG                                                 03293000
MSLGWTR  EQU   BASE+116                                                 03294000
MSWTRSW  EQU   MSLGWTR                                                  03295000
MSLGSTRT EQU   BASE+120                                                 03296000
MSSTRTSW EQU   MSLGSTRT                                                 03297000
MS1BASEX EQU   BASE+136                                                 03298000
BASES01  EQU   0                                                        03299000
MSNTAL   EQU   BASES01                                                  03300000
MSSSB    EQU   BASES01+1                                                03301000
MSBTN    EQU   MSSSB                                                    03302000
MSTN     EQU   MSBTN                                                    03303000
MSPFG    EQU   BASES01+2                                                03304000
MSECBFL  EQU   BASES01+3                                                03305000
MSTUS    EQU   BASES01+4                                                03306000
MSSSA    EQU   MSTUS                                                    03307000
MSINLSW  EQU   MSSSA                                                    03308000
MSREOF   EQU   MSSSA                                                    03309000
MSNWP    EQU   MSSSA                                                    03310000
MSFHF    EQU   BASES01+5                                                03311000
CHAIN    EQU   0                                                        03312000
CHFLG    EQU   CHAIN+4                                                  03313000
CHSTS    EQU   CHFLG+2                                                  03314000
CHACT    EQU   CHFLG+3                                                  03315000
CHCLD    EQU   CHACT                                                    03316000
CHKEY    EQU   CHAIN+8                                                  03317000
CHPARM   EQU   CHKEY                                                    03318000
CHPKE    EQU   CHAIN+28                                                 03319000
CHTRKID  EQU   CHPKE                                                    03320000
CHTJID   EQU   CHAIN+30                                                 03321000
CHPROCSN EQU   CHAIN+32                                                 03322000
CHACT1   EQU   CHPROCSN+3                                               03323000
CHASM    EQU   CHAIN+40                                                 03324000
CHCIBP   EQU   CHASM+4                                                  03325000
CHRGNSZ  EQU   CHASM+8                                                  03326000
CHSTEP   EQU   CHASM+24                                                 03327000
CHSWT    EQU   CHSTEP                                                   03328000
CHSHORT  EQU   CHASM+32                                                 03329000
INJMJCT  EQU   0                                                        03330000
JCTJSTAT EQU   INJMJCT+5                                                03331000
JCTABEND EQU   JCTJSTAT                                                 03332000
INDMCTLG EQU   JCTJSTAT                                                 03333000
JCTJBYTE EQU   INJMJCT+7                                                03334000
JCTJMGLV EQU   JCTJBYTE                                                 03335000
INCMALL  EQU   JCTJMGLV                                                 03336000
JCTJNAME EQU   INJMJCT+8                                                03337000
JCTCCODE EQU   INJMJCT+54                                               03338000
JCTRSW1  EQU   INJMJCT+86                                               03339000
JCTWARMS EQU   JCTRSW1                                                  03340000
JCTCONTR EQU   JCTRSW1                                                  03341000
JCTCKFT  EQU   JCTRSW1                                                  03342000
JCTCKPTR EQU   JCTRSW1                                                  03343000
JCTSTEPR EQU   JCTRSW1                                                  03344000
JCTRSW2  EQU   INJMJCT+87                                               03345000
JCTDETDA EQU   INJMJCT+88                                               03346000
JCTJSB   EQU   INJMJCT+111                                              03347000
JCTJSBAL EQU   JCTJSB                                                   03348000
JCTSTAT2 EQU   INJMJCT+116                                              03349000
JCTSWSM  EQU   JCTSTAT2                                                 03350000
JCTVULDP EQU   INJMJCT+172                                              03351000
IEFAACTB EQU   0                                                        03352000
LCT      EQU   0                                                        03353000
LCTQDRTY EQU   LCT                                                      03354000
LCTSRTAD EQU   LCT+4                                                    03355000
LCTTCBAD EQU   LCT+8                                                    03356000
LCTQENTY EQU   LCT+12                                                   03357000
@NM00085 EQU   LCTQENTY                                                 03358000
LCTERRM  EQU   @NM00085                                                 03359000
LCTJCTAD EQU   LCT+16                                                   03360000
LCTSCTAD EQU   LCT+20                                                   03361000
LCTSCTDA EQU   LCT+24                                                   03362000
LCTWORKA EQU   LCTSCTDA                                                 03363000
LCTSCTVA EQU   LCTWORKA                                                 03364000
LCTPSPAR EQU   LCT+28                                                   03365000
LCTERROR EQU   LCT+32                                                   03366000
LCTERR   EQU   LCTERROR                                                 03367000
LCTJFAIL EQU   LCTERR                                                   03368000
LCTSALCD EQU   LCTERR                                                   03369000
LCTPALCD EQU   LCTERR                                                   03370000
LCTSFAIL EQU   LCTERR                                                   03371000
LCTJCFAL EQU   LCTERR                                                   03372000
LCTVTERM EQU   LCTERR                                                   03373000
LCTPARM1 EQU   LCT+36                                                   03374000
LCTCMCBA EQU   LCT+52                                                   03375000
LCTNSPAD EQU   LCT+56                                                   03376000
LCTJFCBH EQU   LCT+57                                                   03377000
LCTSMBAD EQU   LCT+60                                                   03378000
LCTCOMCD EQU   LCT+68                                                   03379000
LCTRTRN  EQU   LCT+72                                                   03380000
LCTSREG  EQU   LCTRTRN                                                  03381000
@NM00112 EQU   LCT+76                                                   03382000
LCTINTSW EQU   @NM00112                                                 03383000
LCTPUBYT EQU   @NM00112+1                                               03384000
LCTTMWRK EQU   LCT+80                                                   03385000
LCTTJTU4 EQU   LCTTMWRK                                                 03386000
LCTTSTL4 EQU   LCTTMWRK+4                                               03387000
LCTTSTR4 EQU   LCTTMWRK+8                                               03388000
LCTSMF   EQU   LCTTSTR4                                                 03389000
LCTTMBYT EQU   LCTSMF                                                   03390000
LCTTSTU4 EQU   LCTTMWRK+12                                              03391000
LCTJOBLB EQU   LCT+96                                                   03392000
LCTATLST EQU   LCT+100                                                  03393000
LCTASCBA EQU   LCT+320                                                  03394000
LCTECBAD EQU   LCT+328                                                  03395000
ECBLIST  EQU   LCTECBAD                                                 03396000
LCTIDENT EQU   LCT+332                                                  03397000
LCTSPIL  EQU   LCTIDENT+4                                               03398000
LCTALCFG EQU   LCTSPIL+2                                                03399000
LCTTSRB4 EQU   LCT+348                                                  03400000
LCTENTR  EQU   LCT+352                                                  03401000
LCTEXIT  EQU   LCTENTR                                                  03402000
LCTOPSW1 EQU   LCTEXIT                                                  03403000
@NM00142 EQU   LCT+356                                                  03404000
LCTOPSW2 EQU   @NM00142                                                 03405000
LCTJSCB  EQU   LCT+360                                                  03406000
LCTOPSW3 EQU   LCTJSCB                                                  03407000
LCTJCTDA EQU   LCT+408                                                  03408000
LCTSTATA EQU   LCT+416                                                  03409000
LCTSTATB EQU   LCT+417                                                  03410000
LCTRFB   EQU   LCT+418                                                  03411000
@NM00155 EQU   LCT+420                                                  03412000
LCTINTS2 EQU   @NM00155+1                                               03413000
INSMSCT  EQU   0                                                        03414000
SCTDISKA EQU   INSMSCT                                                  03415000
SCTSSTAT EQU   INSMSCT+4                                                03416000
SCTLALOC EQU   INSMSCT+10                                               03417000
SCTANSCT EQU   INSMSCT+20                                               03418000
SCTLSIOT EQU   INSMSCT+24                                               03419000
SCTSCLPC EQU   INSMSCT+44                                               03420000
SCTSNAME EQU   INSMSCT+52                                               03421000
SCTSNUMB EQU   INSMSCT+64                                               03422000
SCTSTYPE EQU   INSMSCT+67                                               03423000
SCTPCAT  EQU   INSMSCT+84                                               03424000
SCTSDPTY EQU   INSMSCT+94                                               03425000
SCTSTAT2 EQU   INSMSCT+104                                              03426000
SCTBCT   EQU   SCTSTAT2                                                 03427000
SCTCDENT EQU   INSMSCT+118                                              03428000
SCTCATCT EQU   INSMSCT+166                                              03429000
SCTSTEND EQU   INSMSCT+172                                              03430000
SCTSTPND EQU   SCTSTEND                                                 03431000
@NM00179 EQU   0                                                        03432000
SCTABCND EQU   @NM00179                                                 03433000
SCTABEND EQU   SCTABCND                                                 03434000
INDMSIOT EQU   0                                                        03435000
SIOTDSKA EQU   INDMSIOT                                                 03436000
SCTUSADD EQU   INDMSIOT+20                                              03437000
SIOTBYT1 EQU   INDMSIOT+43                                              03438000
SIOTBYT3 EQU   INDMSIOT+46                                              03439000
SIOTTSTC EQU   INDMSIOT+47                                              03440000
SIOTBYT0 EQU   INDMSIOT+52                                              03441000
SCTSDISP EQU   INDMSIOT+55                                              03442000
SCTSBYT1 EQU   INDMSIOT+56                                              03443000
SIOTJSCT EQU   SCTSBYT1                                                 03444000
SCTSBYT2 EQU   INDMSIOT+57                                              03445000
SCTSBYT3 EQU   INDMSIOT+58                                              03446000
SCTSBYT4 EQU   INDMSIOT+59                                              03447000
SCTUTYPE EQU   INDMSIOT+60                                              03448000
SIOTDEVT EQU   SCTUTYPE                                                 03449000
SIOUBYT3 EQU   SIOTDEVT+2                                               03450000
SIOTBYT4 EQU   INDMSIOT+81                                              03451000
SIOTALTD EQU   INDMSIOT+92                                              03452000
SIOTBYT2 EQU   INDMSIOT+103                                             03453000
SIOTNPTR EQU   INDMSIOT+152                                             03454000
SJFCBPTR EQU   INDMSIOT+156                                             03455000
TIOMGRRB EQU   0                                                        03456000
TIOMFMAP EQU   TIOMGRRB                                                 03457000
TIOMFREE EQU   TIOMFMAP                                                 03458000
TIOMTSZE EQU   TIOMGRRB+2                                               03459000
TIOMJSCP EQU   TIOMGRRB+4                                               03460000
ESTAPARM EQU   0                                                        03461000
ESTUSERP EQU   ESTAPARM+248                                             03462000
ESTAFLGS EQU   ESTUSERP                                                 03463000
ESTASTEP EQU   ESTAFLGS                                                 03464000
ESTAJOB  EQU   ESTAFLGS                                                 03465000
ESTALCTP EQU   ESTUSERP+4                                               03466000
ESTAJCTP EQU   ESTUSERP+8                                               03467000
ESTASCTP EQU   ESTUSERP+12                                              03468000
ESTSIOTP EQU   ESTUSERP+16                                              03469000
ESTLEPAP EQU   ESTUSERP+20                                              03470000
WPLRF    EQU   0                                                        03471000
WPLRPTR  EQU   WPLRF                                                    03472000
WPL      EQU   0                                                        03473000
WPLLGH   EQU   WPL                                                      03474000
WPLMCSF  EQU   WPL+2                                                    03475000
WPLMCSF1 EQU   WPLMCSF                                                  03476000
WPLMCSFA EQU   WPLMCSF1                                                 03477000
WPLMCSFC EQU   WPLMCSF1                                                 03478000
WPLMCSFD EQU   WPLMCSF1                                                 03479000
WPLMCSF2 EQU   WPLMCSF+1                                                03480000
WPLTXT   EQU   WPL+4                                                    03481000
WPLFLGS  EQU   0                                                        03482000
WPLDESC  EQU   WPLFLGS                                                  03483000
WPLDESC1 EQU   WPLDESC                                                  03484000
WPLDESCD EQU   WPLDESC1                                                 03485000
WPLDESCF EQU   WPLDESC1                                                 03486000
WPLDESC2 EQU   WPLDESC+1                                                03487000
WPLROUT  EQU   WPLFLGS+2                                                03488000
WPLROUT1 EQU   WPLROUT                                                  03489000
WPLROUTB EQU   WPLROUT1                                                 03490000
WPLROUT2 EQU   WPLROUT+1                                                03491000
WPLMSGTY EQU   WPLFLGS+4                                                03492000
WPLMSGT1 EQU   WPLMSGTY                                                 03493000
WPLMSGTA EQU   WPLMSGT1                                                 03494000
WPLMSGTF EQU   WPLMSGT1                                                 03495000
WPLMSGT2 EQU   WPLMSGTY+1                                               03496000
WPLLS01  EQU   0                                                        03497000
WPLLTF   EQU   WPLLS01                                                  03498000
WPLLTF1  EQU   WPLLTF                                                   03499000
WPLML    EQU   0                                                        03500000
WPLMLLTF EQU   WPLML+2                                                  03501000
WPLMLLT1 EQU   WPLMLLTF                                                 03502000
IEZJSCB  EQU   0                                                        03503000
JSCBSEC1 EQU   IEZJSCB+188                                              03504000
JSCHPCE  EQU   JSCBSEC1+4                                               03505000
JSCBDCB  EQU   JSCBSEC1+36                                              03506000
JSCBOPTS EQU   JSCBSEC1+48                                              03507000
JSCSIOTS EQU   JSCBOPTS                                                 03508000
JSCBSWT1 EQU   JSCBSEC1+55                                              03509000
JSCBWTP  EQU   JSCBSEC1+64                                              03510000
JSCBWTFG EQU   JSCBWTP                                                  03511000
JSCBEND1 EQU   IEZJSCB+260                                              03512000
DSAB     EQU   0                                                        03513000
DSABSSVA EQU   DSAB+21                                                  03514000
DSABGIDP EQU   DSAB+24                                                  03515000
DSABANMP EQU   DSAB+28                                                  03516000
DSABORG  EQU   DSAB+32                                                  03517000
DSABORG1 EQU   DSABORG                                                  03518000
DSABORG2 EQU   DSABORG+1                                                03519000
DSABFLG1 EQU   DSAB+34                                                  03520000
DSABFLG2 EQU   DSAB+35                                                  03521000
DSABFLG3 EQU   DSAB+36                                                  03522000
DSABFLG4 EQU   DSAB+37                                                  03523000
DSABANMI EQU   0                                                        03524000
DSABGIDL EQU   0                                                        03525000
QDB      EQU   0                                                        03526000
TCBFIX   EQU   0                                                        03527000
TCBFRS   EQU   TCBFIX                                                   03528000
TCB      EQU   0                                                        03529000
TCBPIE   EQU   TCB+4                                                    03530000
TCBPMASK EQU   TCBPIE                                                   03531000
TCBCMP   EQU   TCB+16                                                   03532000
TCBCMPF  EQU   TCBCMP                                                   03533000
TCBCPP   EQU   TCBCMPF                                                  03534000
TCBSTCC  EQU   TCBCMPF                                                  03535000
TCBCDBL  EQU   TCBCMPF                                                  03536000
TCBCWTO  EQU   TCBCMPF                                                  03537000
TCBCIND  EQU   TCBCMPF                                                  03538000
TCBCMSG  EQU   TCBCMPF                                                  03539000
TCBCMPC  EQU   TCBCMP+1                                                 03540000
TCBTRN   EQU   TCB+20                                                   03541000
TCBABF   EQU   TCBTRN                                                   03542000
TCBMSS   EQU   TCB+24                                                   03543000
TCBPKF   EQU   TCB+28                                                   03544000
TCBFLGS  EQU   TCB+29                                                   03545000
TCBFLGS1 EQU   TCBFLGS                                                  03546000
TCBFA    EQU   TCBFLGS1                                                 03547000
TCBFLGS2 EQU   TCBFLGS+1                                                03548000
TCBFLGS3 EQU   TCBFLGS+2                                                03549000
TCBFLGS4 EQU   TCBFLGS+3                                                03550000
TCBFLGS5 EQU   TCBFLGS+4                                                03551000
TCBABWF  EQU   TCBFLGS5                                                 03552000
TCBJPQ   EQU   TCB+44                                                   03553000
TCBPURGE EQU   TCBJPQ                                                   03554000
TCBGRS   EQU   TCB+48                                                   03555000
TCBFSA   EQU   TCB+112                                                  03556000
TCBTME   EQU   TCB+120                                                  03557000
TCBJSTCB EQU   TCB+124                                                  03558000
TCBTSFLG EQU   TCB+148                                                  03559000
TCBTSTSK EQU   TCBTSFLG                                                 03560000
TCBSTAB  EQU   TCB+160                                                  03561000
TCBNSTAE EQU   TCBSTAB                                                  03562000
TCBSTABB EQU   TCBSTAB+1                                                03563000
TCBTCT   EQU   TCB+164                                                  03564000
TCBTCTGF EQU   TCBTCT                                                   03565000
TCBSCNDY EQU   TCB+172                                                  03566000
TCBNDSP  EQU   TCBSCNDY                                                 03567000
TCBNDSP1 EQU   TCBNDSP+1                                                03568000
TCBNDSP2 EQU   TCBNDSP+2                                                03569000
TCBNDSP3 EQU   TCBNDSP+3                                                03570000
TCBJSCB  EQU   TCB+180                                                  03571000
TCBRECDE EQU   TCBJSCB                                                  03572000
TCBEXT1  EQU   TCB+196                                                  03573000
TCBBITS  EQU   TCB+200                                                  03574000
TCBNDSP4 EQU   TCBBITS                                                  03575000
TCBNDSP5 EQU   TCBBITS+1                                                03576000
TCBFLGS6 EQU   TCBBITS+2                                                03577000
TCBFLGS7 EQU   TCBBITS+3                                                03578000
TCBDAR   EQU   TCB+204                                                  03579000
TCBDARC  EQU   TCBDAR                                                   03580000
TCBEXT2  EQU   TCB+208                                                  03581000
TCBXSCT  EQU   TCB+240                                                  03582000
TCBXSCT1 EQU   TCBXSCT                                                  03583000
TCBFOE   EQU   TCB+244                                                  03584000
TCBESTAE EQU   TCB+264                                                  03585000
TCBESTRM EQU   TCBESTAE+1                                               03586000
TCBFBYT1 EQU   TCB+276                                                  03587000
TCBFBYT2 EQU   TCB+277                                                  03588000
TCBRV124 EQU   TCB+278                                                  03589000
TCBRV133 EQU   TCB+279                                                  03590000
TCBXTNT2 EQU   0                                                        03591000
TCBGTF   EQU   TCBXTNT2                                                 03592000
TCBTFLG  EQU   TCBGTF                                                   03593000
TCBRV146 EQU   TCBXTNT2+28                                              03594000
TCBRV155 EQU   TCBXTNT2+29                                              03595000
TCBRV164 EQU   TCBXTNT2+30                                              03596000
TCBRV173 EQU   TCBXTNT2+31                                              03597000
ASCB     EQU   0                                                        03598000
ASCBSUPC EQU   ASCB+16                                                  03599000
ASCBASID EQU   ASCB+36                                                  03600000
ASCBRSM  EQU   ASCB+52                                                  03601000
ASCBRSMF EQU   ASCBRSM                                                  03602000
ASCBFW1  EQU   ASCB+100                                                 03603000
ASCBRCTF EQU   ASCBFW1+2                                                03604000
ASCBFLG1 EQU   ASCBFW1+3                                                03605000
ASCBDSP1 EQU   ASCB+114                                                 03606000
ASCBFLG2 EQU   ASCB+115                                                 03607000
ASCBLKGP EQU   ASCB+128                                                 03608000
ASCBSRQ  EQU   ASCB+180                                                 03609000
ASCBSRQ1 EQU   ASCBSRQ                                                  03610000
ASCBSRQ2 EQU   ASCBSRQ+1                                                03611000
ASCBSRQ3 EQU   ASCBSRQ+2                                                03612000
ASCBSRQ4 EQU   ASCBSRQ+3                                                03613000
TRMRB    EQU   0                                                        03614000
TRMRBLEN EQU   TRMRB                                                    03615000
TRMRBOPC EQU   TRMRB+4                                                  03616000
TRMFLAGS EQU   TRMRB+5                                                  03617000
TRMJOBID EQU   TRMRB+8                                                  03618000
INDMDSNT EQU   0                                                        03619000
MOTENTRY EQU   B410MOFT                                                 03620000
MOTOFFST EQU   MOTENTRY                                                 03621000
MOTLNTH  EQU   MOTENTRY+2                                               03622000
CCFAILLN EQU   CCFAIL                                                   03623000
CCFLTDSP EQU   CCFAIL+2                                                 03624000
CCFLCDSP EQU   CCFAIL+4                                                 03625000
CCFAILM  EQU   CCFAIL+6                                                 03626000
ENDEDLN  EQU   JOBENDED                                                 03627000
ENDTDISP EQU   JOBENDED+2                                               03628000
ENDEDM   EQU   JOBENDED+4                                               03629000
JOBFAILL EQU   JOBFAILD                                                 03630000
JOBFTDSP EQU   JOBFAILD+2                                               03631000
JOBFAILM EQU   JOBFAILD+4                                               03632000
LOGOFFLN EQU   LOGGDOFF                                                 03633000
LOGTDISP EQU   LOGGDOFF+2                                               03634000
LOGOFFM  EQU   LOGGDOFF+4                                               03635000
PGMABNDL EQU   PGMABEND                                                 03636000
PGMSDISP EQU   PGMABEND+2                                               03637000
PGMUDISP EQU   PGMABEND+4                                               03638000
PGMABNDM EQU   PGMABEND+6                                               03639000
PGMCLNTH EQU   PGMCFAIL                                                 03640000
PGMCTEXT EQU   PGMCFAIL+2                                               03641000
STEPRUNL EQU   STEPRUN                                                  03642000
STPCDISP EQU   STEPRUN+2                                                03643000
STEPRUNM EQU   STEPRUN+4                                                03644000
STNOTRNL EQU   STNOTRUN                                                 03645000
STNOTRNM EQU   STNOTRUN+2                                               03646000
STNOATOL EQU   STNOAUTO                                                 03647000
STNOATOM EQU   STNOAUTO+2                                               03648000
UNERMSGL EQU   UNERRMSG                                                 03649000
UNERMSGT EQU   UNERRMSG+2                                               03650000
WTOABNDL EQU   WTOABEND                                                 03651000
WTOSDISP EQU   WTOABEND+2                                               03652000
WTOUDISP EQU   WTOABEND+4                                               03653000
WTOTDISP EQU   WTOABEND+6                                               03654000
WTOABNDM EQU   WTOABEND+8                                               03655000
DPARMP   EQU   0                                                        03656000
CVTS01   EQU   CVTPGSIA                                                 03657000
CVTLPDIA EQU   CVTS01+12                                                03658000
CVTDIRST EQU   CVTLPDIA                                                 03659000
CVTSLIDA EQU   CVTS01+24                                                03660000
CVTCTLFG EQU   CVTS01+50                                                03661000
CVTRV210 EQU   CVTS01+424                                               03662000
CVTRV219 EQU   CVTS01+425                                               03663000
CVTRV228 EQU   CVTS01+426                                               03664000
CVTRV237 EQU   CVTS01+427                                               03665000
CVTMFRTR EQU   CVTS01+452                                               03666000
CVTRV262 EQU   CVTS01+468                                               03667000
CVTRV271 EQU   CVTS01+469                                               03668000
CVTRV280 EQU   CVTS01+470                                               03669000
CVTRV289 EQU   CVTS01+471                                               03670000
CVTGSDA  EQU   CVTS01+600                                               03671000
CHAINS01 EQU   CHASM                                                    03672000
CHTYPE   EQU   CHAINS01+124                                             03673000
CHTRSTAT EQU   CHAINS01+125                                             03674000
CHCSYSO  EQU   CHAINS01+134                                             03675000
JSCBSEC2 EQU   JSCBEND1                                                 03676000
JSCBSEC3 EQU   JSCBEND1                                                 03677000
JSCBJCT  EQU   JSCBSEC3                                                 03678000
JSCBJCTA EQU   JSCBJCT+1                                                03679000
JSCBASID EQU   JSCBSEC3+8                                               03680000
JSCBFBYT EQU   JSCBSEC3+10                                              03681000
JSCBJNL  EQU   JSCBSEC3+28                                              03682000
JSCBJJSB EQU   JSCBJNL                                                  03683000
JSCBSUB  EQU   JSCBSEC3+40                                              03684000
JSCDSABQ EQU   JSCBSEC3+60                                              03685000
JSCSCT   EQU   JSCBSEC3+68                                              03686000
JSCSCTP  EQU   JSCSCT+1                                                 03687000
JSCBASWA EQU   JSCBSEC3+96                                              03688000
JSCRSV45 EQU   JSCBSEC3+112                                             03689000
JSCRSV46 EQU   JSCRSV45                                                 03690000
JSCRSV47 EQU   JSCRSV45+2                                               03691000
DSABQDB  EQU   QDB                                                      03692000
DSQFRSTP EQU   DSABQDB+12                                               03693000
DSQLASTP EQU   DSABQDB+16                                               03694000
TCBCMPCH EQU   TCBCMPC                                                  03695000
TCBCMPFW EQU   TCBCMP                                                   03696000
TIOMELEN EQU   TIOMTSZE                                                 03697000
TIOMNDSA EQU   TIOMTSZE                                                 03698000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    03699000
@NM00218 EQU   DSABQDB+24                                               03700000
DSQBDSP  EQU   DSABQDB+22                                               03701000
DSQFDSP  EQU   DSABQDB+20                                               03702000
DSQBADFC EQU   DSQLASTP                                                 03703000
DSQBADBC EQU   DSQFRSTP                                                 03704000
DSQNELMS EQU   DSABQDB+8                                                03705000
DSQDBLN  EQU   DSABQDB+6                                                03706000
DSQATTRS EQU   DSABQDB+4                                                03707000
DSQDBID  EQU   DSABQDB                                                  03708000
JSCBEND3 EQU   JSCBSEC3+120                                             03709000
JSCRSV52 EQU   JSCBSEC3+116                                             03710000
JSCRSV51 EQU   JSCRSV47+1                                               03711000
JSCRSV50 EQU   JSCRSV47                                                 03712000
JSCRSV49 EQU   JSCRSV46+1                                               03713000
JSCRSV48 EQU   JSCRSV46                                                 03714000
JSCRSV44 EQU   JSCBSEC3+108                                             03715000
JSCRSV43 EQU   JSCBSEC3+104                                             03716000
JSCRSV42 EQU   JSCBSEC3+100                                             03717000
JSCBUFPT EQU   JSCBSEC3+92                                              03718000
JSCBACT  EQU   JSCBSEC3+88                                              03719000
JSCBSWSP EQU   JSCBSEC3+87                                              03720000
JSCRSV33 EQU   JSCBSEC3+86                                              03721000
JSCDDNUM EQU   JSCBSEC3+84                                              03722000
JSCRSV53 EQU   JSCBSEC3+82                                              03723000
JSCDDNNO EQU   JSCBSEC3+80                                              03724000
JSCBVATA EQU   JSCBSEC3+76                                              03725000
JSCTMCOR EQU   JSCBSEC3+72                                              03726000
JSCRSV55 EQU   JSCSCT                                                   03727000
JSCRSV54 EQU   JSCBSEC3+64                                              03728000
JSCBSSIB EQU   JSCBSEC3+56                                              03729000
JSCBFRBA EQU   JSCBSEC3+48                                              03730000
JSCRSV28 EQU   JSCBSEC3+46                                              03731000
JSCBSONO EQU   JSCBSEC3+44                                              03732000
JSCBSUBA EQU   JSCBSUB+1                                                03733000
JSCRSV31 EQU   JSCBSUB                                                  03734000
JSCBSMLR EQU   JSCBSEC3+36                                              03735000
JSCBJNLR EQU   JSCBSEC3+32                                              03736000
JSCBJNLA EQU   JSCBJNL+1                                                03737000
JSCBJSBT EQU   JSCBJJSB                                                 03738000
JSCBJSBX EQU   JSCBJJSB                                                 03739000
JSCBJSBA EQU   JSCBJJSB                                                 03740000
JSCBJSBI EQU   JSCBJJSB                                                 03741000
@NM00212 EQU   JSCBJJSB                                                 03742000
JSCBJNLE EQU   JSCBJJSB                                                 03743000
JSCBJNLF EQU   JSCBJJSB                                                 03744000
JSCBJNLN EQU   JSCBJJSB                                                 03745000
@NM00211 EQU   JSCBSEC3+24                                              03746000
JSCBJRBA EQU   JSCBSEC3+16                                              03747000
JSCBIECB EQU   JSCBSEC3+12                                              03748000
JSCBRV08 EQU   JSCBSEC3+11                                              03749000
JSCBRV07 EQU   JSCBFBYT                                                 03750000
JSCBRV06 EQU   JSCBFBYT                                                 03751000
JSCBRV05 EQU   JSCBFBYT                                                 03752000
JSCBRV04 EQU   JSCBFBYT                                                 03753000
JSCBRV03 EQU   JSCBFBYT                                                 03754000
JSCBRV02 EQU   JSCBFBYT                                                 03755000
JSCBADSP EQU   JSCBFBYT                                                 03756000
JSCBRV01 EQU   JSCBFBYT                                                 03757000
JSCBTJID EQU   JSCBASID                                                 03758000
JSCBPSCB EQU   JSCBSEC3+4                                               03759000
JSCJCTP  EQU   JSCBJCTA                                                 03760000
JSCRSV24 EQU   JSCBJCT                                                  03761000
JSCBEND2 EQU   JSCBSEC2                                                 03762000
CHLAST   EQU   CHAINS01+136                                             03763000
CHSPA    EQU   CHAINS01+135                                             03764000
CHUSERID EQU   CHCSYSO                                                  03765000
CHJB     EQU   CHCSYSO                                                  03766000
CHDUMP   EQU   CHCSYSO                                                  03767000
CHQUE    EQU   CHCSYSO                                                  03768000
CHHOLD   EQU   CHCSYSO                                                  03769000
CHOUT    EQU   CHCSYSO                                                  03770000
CHINN    EQU   CHCSYSO                                                  03771000
CHALL    EQU   CHCSYSO                                                  03772000
CHINC    EQU   CHAINS01+132                                             03773000
CHPEND   EQU   CHAINS01+128                                             03774000
CHARID   EQU   CHAINS01+127                                             03775000
CHCNID   EQU   CHAINS01+126                                             03776000
@NM00060 EQU   CHTRSTAT                                                 03777000
CHTSL    EQU   CHTRSTAT                                                 03778000
CHTS     EQU   CHTRSTAT                                                 03779000
CHINITL  EQU   CHTRSTAT                                                 03780000
CHINIT   EQU   CHTRSTAT                                                 03781000
CHJOBSL  EQU   CHTRSTAT                                                 03782000
CHJOBS   EQU   CHTRSTAT                                                 03783000
CHDEF    EQU   CHTYPE                                                   03784000
CHHIAR   EQU   CHTYPE                                                   03785000
CHARSV29 EQU   CHTYPE                                                   03786000
CHARSV28 EQU   CHTYPE                                                   03787000
CHARSV27 EQU   CHTYPE                                                   03788000
CHARSV26 EQU   CHTYPE                                                   03789000
CHARSV25 EQU   CHTYPE                                                   03790000
CHDSTAT  EQU   CHTYPE                                                   03791000
CHBUF    EQU   CHAINS01                                                 03792000
CVTRV628 EQU   CVTS01+728                                               03793000
CVTRV627 EQU   CVTS01+724                                               03794000
CVTRV626 EQU   CVTS01+720                                               03795000
CVTRV625 EQU   CVTS01+716                                               03796000
CVTRV624 EQU   CVTS01+712                                               03797000
CVTRV623 EQU   CVTS01+708                                               03798000
CVTRV622 EQU   CVTS01+704                                               03799000
CVTRV621 EQU   CVTS01+700                                               03800000
CVTIHASU EQU   CVTS01+696                                               03801000
CVTSUSP  EQU   CVTS01+692                                               03802000
CVTT6SVC EQU   CVTS01+688                                               03803000
CVTCDAL  EQU   CVTS01+684                                               03804000
CVTTCTL  EQU   CVTS01+680                                               03805000
CVTRSUME EQU   CVTS01+676                                               03806000
CVTJTERM EQU   CVTS01+672                                               03807000
CVTASMRM EQU   CVTS01+668                                               03808000
CVTTCASP EQU   CVTS01+664                                               03809000
CVT0PT03 EQU   CVTS01+660                                               03810000
CVT0PT0E EQU   CVTS01+656                                               03811000
CVTRV609 EQU   CVTS01+652                                               03812000
CVTCGK   EQU   CVTS01+648                                               03813000
CVTRAC   EQU   CVTS01+644                                               03814000
CVTRV606 EQU   CVTS01+640                                               03815000
CVTRV605 EQU   CVTS01+636                                               03816000
CVTRV604 EQU   CVTS01+632                                               03817000
CVTEFF02 EQU   CVTS01+628                                               03818000
CVTCBBR  EQU   CVTS01+624                                               03819000
CVTSSCR  EQU   CVTS01+620                                               03820000
CVTEVENT EQU   CVTS01+616                                               03821000
CVTCRCA  EQU   CVTS01+612                                               03822000
CVTTPIO  EQU   CVTS01+608                                               03823000
CVTADV   EQU   CVTS01+604                                               03824000
CVTGSDAB EQU   CVTGSDA                                                  03825000
CVTQV3   EQU   CVTS01+596                                               03826000
CVTQV2   EQU   CVTS01+592                                               03827000
CVTQV1   EQU   CVTS01+588                                               03828000
CVTRPT   EQU   CVTS01+584                                               03829000
CVTSSRB  EQU   CVTS01+580                                               03830000
CVTCSDRL EQU   CVTS01+576                                               03831000
CVTEXP1  EQU   CVTS01+572                                               03832000
CVTRMPMT EQU   CVTS01+568                                               03833000
CVTRMPTT EQU   CVTS01+564                                               03834000
CVTVPSA  EQU   CVTS01+560                                               03835000
CVTVSTOP EQU   CVTS01+556                                               03836000
CVTGTFR8 EQU   CVTS01+552                                               03837000
CVTQUIT  EQU   CVTS01+548                                               03838000
CVTVACR  EQU   CVTS01+544                                               03839000
CVTWTCB  EQU   CVTS01+540                                               03840000
CVTSTPRS EQU   CVTS01+536                                               03841000
CVT0PT02 EQU   CVTS01+532                                               03842000
CVTDARCM EQU   CVTS01+528                                               03843000
CVTIRECM EQU   CVTS01+524                                               03844000
CVTJRECM EQU   CVTS01+520                                               03845000
CVTVEMS0 EQU   CVTS01+516                                               03846000
CVTSPFRR EQU   CVTS01+512                                               03847000
CVTRLSTG EQU   CVTS01+508                                               03848000
CVT0TC0A EQU   CVTS01+504                                               03849000
CVTGMBR  EQU   CVTS01+500                                               03850000
CVTLFRM  EQU   CVTS01+496                                               03851000
CVTRMBR  EQU   CVTS01+492                                               03852000
CVTVIOP  EQU   CVTS01+488                                               03853000
CVTRV307 EQU   CVTS01+486                                               03854000
CVTRV306 EQU   CVTS01+484                                               03855000
CVTRV305 EQU   CVTS01+482                                               03856000
CVTRV304 EQU   CVTS01+480                                               03857000
CVTRV303 EQU   CVTS01+478                                               03858000
CVTRV302 EQU   CVTS01+476                                               03859000
CVTTRCA  EQU   CVTS01+472                                               03860000
CVTRV297 EQU   CVTRV289                                                 03861000
CVTRV296 EQU   CVTRV289                                                 03862000
CVTRV295 EQU   CVTRV289                                                 03863000
CVTRV294 EQU   CVTRV289                                                 03864000
CVTRV293 EQU   CVTRV289                                                 03865000
CVTRV292 EQU   CVTRV289                                                 03866000
CVTRV291 EQU   CVTRV289                                                 03867000
CVTRV290 EQU   CVTRV289                                                 03868000
CVTRV288 EQU   CVTRV280                                                 03869000
CVTRV287 EQU   CVTRV280                                                 03870000
CVTRV286 EQU   CVTRV280                                                 03871000
CVTRV285 EQU   CVTRV280                                                 03872000
CVTRV284 EQU   CVTRV280                                                 03873000
CVTRV283 EQU   CVTRV280                                                 03874000
CVTRV282 EQU   CVTRV280                                                 03875000
CVTRV281 EQU   CVTRV280                                                 03876000
CVTRV279 EQU   CVTRV271                                                 03877000
CVTRV278 EQU   CVTRV271                                                 03878000
CVTRV277 EQU   CVTRV271                                                 03879000
CVTRV276 EQU   CVTRV271                                                 03880000
CVTRV275 EQU   CVTRV271                                                 03881000
CVTRV274 EQU   CVTRV271                                                 03882000
CVTRV273 EQU   CVTRV271                                                 03883000
CVTRV272 EQU   CVTRV271                                                 03884000
CVTRV270 EQU   CVTRV262                                                 03885000
CVTRV269 EQU   CVTRV262                                                 03886000
CVTRV268 EQU   CVTRV262                                                 03887000
CVTRV267 EQU   CVTRV262                                                 03888000
CVTRV266 EQU   CVTRV262                                                 03889000
CVTRV265 EQU   CVTRV262                                                 03890000
CVTRV264 EQU   CVTRV262                                                 03891000
CVTRV263 EQU   CVTRV262                                                 03892000
CVTVFP   EQU   CVTS01+464                                               03893000
CVTVSI   EQU   CVTS01+460                                               03894000
CVTVPSIB EQU   CVTS01+456                                               03895000
CVTMFACT EQU   CVTMFRTR                                                 03896000
CVTMFCTL EQU   CVTS01+448                                               03897000
CVTPVBP  EQU   CVTS01+444                                               03898000
CVTPWI   EQU   CVTS01+440                                               03899000
CVTRV254 EQU   CVTS01+438                                               03900000
CVTRV253 EQU   CVTS01+436                                               03901000
CVTRV252 EQU   CVTS01+434                                               03902000
CVTRV251 EQU   CVTS01+433                                               03903000
CVTRV250 EQU   CVTS01+432                                               03904000
CVTRV249 EQU   CVTS01+431                                               03905000
CVTRV248 EQU   CVTS01+430                                               03906000
CVTRV247 EQU   CVTS01+429                                               03907000
CVTRV246 EQU   CVTS01+428                                               03908000
CVTRV245 EQU   CVTRV237                                                 03909000
CVTRV244 EQU   CVTRV237                                                 03910000
CVTRV243 EQU   CVTRV237                                                 03911000
CVTRV242 EQU   CVTRV237                                                 03912000
CVTRV241 EQU   CVTRV237                                                 03913000
CVTRV240 EQU   CVTRV237                                                 03914000
CVTRV239 EQU   CVTRV237                                                 03915000
CVTRV238 EQU   CVTRV237                                                 03916000
CVTRV236 EQU   CVTRV228                                                 03917000
CVTRV235 EQU   CVTRV228                                                 03918000
CVTRV234 EQU   CVTRV228                                                 03919000
CVTRV233 EQU   CVTRV228                                                 03920000
CVTRV232 EQU   CVTRV228                                                 03921000
CVTRV231 EQU   CVTRV228                                                 03922000
CVTRV230 EQU   CVTRV228                                                 03923000
CVTRV229 EQU   CVTRV228                                                 03924000
CVTRV227 EQU   CVTRV219                                                 03925000
CVTRV226 EQU   CVTRV219                                                 03926000
CVTRV225 EQU   CVTRV219                                                 03927000
CVTRV224 EQU   CVTRV219                                                 03928000
CVTRV223 EQU   CVTRV219                                                 03929000
CVTRV222 EQU   CVTRV219                                                 03930000
CVTRV221 EQU   CVTRV219                                                 03931000
CVTRV220 EQU   CVTRV219                                                 03932000
CVTRV218 EQU   CVTRV210                                                 03933000
CVTRV217 EQU   CVTRV210                                                 03934000
CVTRV216 EQU   CVTRV210                                                 03935000
CVTRV215 EQU   CVTRV210                                                 03936000
CVTRV214 EQU   CVTRV210                                                 03937000
CVTRV213 EQU   CVTRV210                                                 03938000
CVTRV212 EQU   CVTRV210                                                 03939000
CVTRV211 EQU   CVTRV210                                                 03940000
CVTLCCAT EQU   CVTS01+420                                               03941000
CVTPCCAT EQU   CVTS01+416                                               03942000
CVTIPCRP EQU   CVTS01+412                                               03943000
CVTIPCRI EQU   CVTS01+408                                               03944000
CVTIPCDS EQU   CVTS01+404                                               03945000
CVTAIDVT EQU   CVTS01+400                                               03946000
CVTSSAP  EQU   CVTS01+396                                               03947000
CVTEHCIR EQU   CVTS01+392                                               03948000
CVTEHDEF EQU   CVTS01+388                                               03949000
CVTDAIR  EQU   CVTS01+384                                               03950000
CVTPERFM EQU   CVTS01+380                                               03951000
CVT044R2 EQU   CVTS01+376                                               03952000
CVTFETCH EQU   CVTS01+372                                               03953000
CVTRSTWD EQU   CVTS01+368                                               03954000
CVTSPOST EQU   CVTS01+364                                               03955000
CVTIOBP  EQU   CVTS01+360                                               03956000
CVTASMVT EQU   CVTS01+356                                               03957000
CVTRECRQ EQU   CVTS01+352                                               03958000
CVTWSAC  EQU   CVTS01+348                                               03959000
CVTRV149 EQU   CVTS01+344                                               03960000
CVTWSAL  EQU   CVTS01+340                                               03961000
CVTSPSA  EQU   CVTS01+336                                               03962000
CVTGLMN  EQU   CVTS01+332                                               03963000
CVTVEAC0 EQU   CVTS01+328                                               03964000
CVT062R1 EQU   CVTS01+324                                               03965000
CVTRPOST EQU   CVTS01+320                                               03966000
CVTDQIQE EQU   CVTS01+316                                               03967000
CVTCSD   EQU   CVTS01+312                                               03968000
CVTLKRMA EQU   CVTS01+308                                               03969000
CVTRSPIE EQU   CVTS01+304                                               03970000
CVTRENQ  EQU   CVTS01+300                                               03971000
CVTLQCB  EQU   CVTS01+296                                               03972000
CVTFQCB  EQU   CVTS01+292                                               03973000
CVTQCS01 EQU   CVTS01+288                                               03974000
CVTAPFT  EQU   CVTS01+284                                               03975000
CVTPARRL EQU   CVTS01+280                                               03976000
CVTVWAIT EQU   CVTS01+276                                               03977000
CVTGSPL  EQU   CVTS01+272                                               03978000
CVTLSMQ  EQU   CVTS01+268                                               03979000
CVTGSMQ  EQU   CVTS01+264                                               03980000
CVTEXPRO EQU   CVTS01+260                                               03981000
CVTOPCTP EQU   CVTS01+256                                               03982000
CVTSIC   EQU   CVTS01+252                                               03983000
CVTTPIOS EQU   CVTS01+248                                               03984000
CVTRTMS  EQU   CVTS01+244                                               03985000
CVTSDBF  EQU   CVTS01+240                                               03986000
CVTSCBP  EQU   CVTS01+236                                               03987000
CVTSDMP  EQU   CVTS01+232                                               03988000
CVTSV60  EQU   CVTS01+228                                               03989000
CVTRTMCT EQU   CVTS01+224                                               03990000
CVTASCBL EQU   CVTS01+220                                               03991000
CVTASCBH EQU   CVTS01+216                                               03992000
CVTGDA   EQU   CVTS01+212                                               03993000
CVTASVT  EQU   CVTS01+208                                               03994000
CVTVVMDI EQU   CVTS01+204                                               03995000
CVTAQTOP EQU   CVTS01+200                                               03996000
CVTIOSCS EQU   CVTS01+196                                               03997000
CVTSDRM  EQU   CVTS01+192                                               03998000
CVTOPTE  EQU   CVTS01+188                                               03999000
CVTSTXU  EQU   CVTS01+184                                               04000000
CVTQUIS  EQU   CVTS01+180                                               04001000
CVTPARS  EQU   CVTS01+176                                               04002000
CVTS1EE  EQU   CVTS01+172                                               04003000
CVTFRAS  EQU   CVTS01+168                                               04004000
CVTQSAS  EQU   CVTS01+164                                               04005000
CVTCRAS  EQU   CVTS01+160                                               04006000
CVTCRMN  EQU   CVTS01+156                                               04007000
CVTDELCP EQU   CVTS01+152                                               04008000
CVTFRECL EQU   CVTS01+148                                               04009000
CVTGETCL EQU   CVTS01+144                                               04010000
CVTBLDCP EQU   CVTS01+140                                               04011000
CVTAUTHL EQU   CVTS01+136                                               04012000
CVTSCAN  EQU   CVTS01+132                                               04013000
CVTRV144 EQU   CVTS01+130                                               04014000
CVTMAXMP EQU   CVTS01+128                                               04015000
CVTSTCK  EQU   CVTS01+124                                               04016000
CVTRV139 EQU   CVTS01+123                                               04017000
CVTDSSAC EQU   CVTS01+122                                               04018000
CVTRV513 EQU   CVTS01+121                                               04019000
CVTIOSPL EQU   CVTS01+120                                               04020000
CVTPTGT  EQU   CVTS01+116                                               04021000
CVTCSPIE EQU   CVTS01+112                                               04022000
CVTSMFEX EQU   CVTS01+108                                               04023000
CVTOLT0A EQU   CVTS01+104                                               04024000
CVTSRBRT EQU   CVTS01+100                                               04025000
CVTPUTL  EQU   CVTS01+96                                                04026000
CVTASCRL EQU   CVTS01+92                                                04027000
CVTASCRF EQU   CVTS01+88                                                04028000
CVTRV326 EQU   CVTS01+84                                                04029000
CVTRV325 EQU   CVTS01+80                                                04030000
CVTRV324 EQU   CVTS01+76                                                04031000
CVT0VL01 EQU   CVTS01+72                                                04032000
CVTSHRVM EQU   CVTS01+68                                                04033000
CVTRV332 EQU   CVTS01+64                                                04034000
CVTTAS   EQU   CVTS01+60                                                04035000
CVTRSCN  EQU   CVTS01+56                                                04036000
CVTTRAC2 EQU   CVTS01+54                                                04037000
CVTTRACE EQU   CVTS01+52                                                04038000
CVTAPG   EQU   CVTS01+51                                                04039000
CVTSDTRC EQU   CVTCTLFG                                                 04040000
CVTGTRCE EQU   CVTCTLFG                                                 04041000
CVTNOMP  EQU   CVTCTLFG                                                 04042000
CVTRSV79 EQU   CVTCTLFG                                                 04043000
CVTDSTAT EQU   CVTCTLFG                                                 04044000
CVTRSV78 EQU   CVTCTLFG                                                 04045000
CVTRV333 EQU   CVTCTLFG                                                 04046000
CVTRV323 EQU   CVTCTLFG                                                 04047000
CVTSPVLK EQU   CVTS01+49                                                04048000
CVTRSV77 EQU   CVTS01+48                                                04049000
CVTRV331 EQU   CVTS01+44                                                04050000
CVTRV330 EQU   CVTS01+40                                                04051000
CVTRV329 EQU   CVTS01+36                                                04052000
CVTRV328 EQU   CVTS01+32                                                04053000
CVTRV322 EQU   CVTS01+28                                                04054000
CVTSLID  EQU   CVTSLIDA+1                                               04055000
CVTSYLK  EQU   CVTSLIDA                                                 04056000
CVTRV321 EQU   CVTS01+20                                                04057000
CVTRV320 EQU   CVTS01+16                                                04058000
CVTLPDIR EQU   CVTLPDIA+1                                               04059000
CVTRSV69 EQU   CVTDIRST                                                 04060000
CVTRSV68 EQU   CVTDIRST                                                 04061000
CVTRSV67 EQU   CVTDIRST                                                 04062000
CVTRSV66 EQU   CVTDIRST                                                 04063000
CVTRSV65 EQU   CVTDIRST                                                 04064000
CVTRSV64 EQU   CVTDIRST                                                 04065000
CVTRSV63 EQU   CVTDIRST                                                 04066000
CVTDICOM EQU   CVTDIRST                                                 04067000
CVTPVTP  EQU   CVTS01+8                                                 04068000
CVTLPDSR EQU   CVTS01+4                                                 04069000
CVTGETL  EQU   CVTS01                                                   04070000
TRMSTHDR EQU   TRMRB+12                                                 04071000
@NM00224 EQU   TRMRB+6                                                  04072000
@NM00223 EQU   TRMFLAGS                                                 04073000
TRMSCHAB EQU   TRMFLAGS                                                 04074000
TRMALLOK EQU   TRMFLAGS                                                 04075000
ASCBEND  EQU   ASCB+208                                                 04076000
ASCBSRBT EQU   ASCB+200                                                 04077000
ASCBSWTL EQU   ASCB+196                                                 04078000
ASCBRS14 EQU   ASCB+195                                                 04079000
ASCBSMCT EQU   ASCB+194                                                 04080000
ASCBRS12 EQU   ASCB+192                                                 04081000
ASCBPCTT EQU   ASCB+188                                                 04082000
ASCBVGTT EQU   ASCB+184                                                 04083000
ASCBRV43 EQU   ASCBSRQ4                                                 04084000
ASCBRV42 EQU   ASCBSRQ4                                                 04085000
ASCBRV41 EQU   ASCBSRQ4                                                 04086000
ASCBRV40 EQU   ASCBSRQ4                                                 04087000
ASCBRV39 EQU   ASCBSRQ4                                                 04088000
ASCBRV38 EQU   ASCBSRQ4                                                 04089000
ASCBRV37 EQU   ASCBSRQ4                                                 04090000
ASCBRV36 EQU   ASCBSRQ4                                                 04091000
ASCBRV35 EQU   ASCBSRQ3                                                 04092000
ASCBRV34 EQU   ASCBSRQ3                                                 04093000
ASCBRV33 EQU   ASCBSRQ3                                                 04094000
ASCBRV32 EQU   ASCBSRQ3                                                 04095000
ASCBRV31 EQU   ASCBSRQ3                                                 04096000
ASCBRV30 EQU   ASCBSRQ3                                                 04097000
ASCBRV29 EQU   ASCBSRQ3                                                 04098000
ASCBRV28 EQU   ASCBSRQ3                                                 04099000
ASCBRV27 EQU   ASCBSRQ2                                                 04100000
ASCBRV26 EQU   ASCBSRQ2                                                 04101000
ASCBRV25 EQU   ASCBSRQ2                                                 04102000
ASCBRV24 EQU   ASCBSRQ2                                                 04103000
ASCBRV23 EQU   ASCBSRQ2                                                 04104000
ASCBRV22 EQU   ASCBSRQ2                                                 04105000
ASCBRV21 EQU   ASCBSRQ2                                                 04106000
ASCBRV20 EQU   ASCBSRQ2                                                 04107000
ASCBRV19 EQU   ASCBSRQ1                                                 04108000
ASCBRV18 EQU   ASCBSRQ1                                                 04109000
ASCBRV17 EQU   ASCBSRQ1                                                 04110000
ASCBRV16 EQU   ASCBSRQ1                                                 04111000
ASCBRV15 EQU   ASCBSRQ1                                                 04112000
ASCBRV14 EQU   ASCBSRQ1                                                 04113000
ASCBRV13 EQU   ASCBSRQ1                                                 04114000
ASCBSTA  EQU   ASCBSRQ1                                                 04115000
ASCBJBNS EQU   ASCB+176                                                 04116000
ASCBJBNI EQU   ASCB+172                                                 04117000
ASCBMCC  EQU   ASCB+168                                                 04118000
ASCBRTWA EQU   ASCB+164                                                 04119000
ASCBIQEA EQU   ASCB+160                                                 04120000
ASCBXMPQ EQU   ASCB+156                                                 04121000
ASCBRS01 EQU   ASCB+154                                                 04122000
ASCBFMCT EQU   ASCB+152                                                 04123000
ASCBOUXB EQU   ASCB+148                                                 04124000
ASCBOUCB EQU   ASCB+144                                                 04125000
ASCBMECB EQU   ASCB+140                                                 04126000
ASCBQECB EQU   ASCB+136                                                 04127000
ASCBLSQH EQU   ASCBLKGP+4                                               04128000
ASCBLOCK EQU   ASCBLKGP                                                 04129000
ASCBTCBS EQU   ASCB+124                                                 04130000
ASCBNVSC EQU   ASCB+122                                                 04131000
ASCBVSC  EQU   ASCB+120                                                 04132000
ASCBSRBS EQU   ASCB+118                                                 04133000
ASCBSSRB EQU   ASCB+116                                                 04134000
ASCBRV06 EQU   ASCBFLG2                                                 04135000
ASCBRV05 EQU   ASCBFLG2                                                 04136000
ASCBRV04 EQU   ASCBFLG2                                                 04137000
ASCBSNQS EQU   ASCBFLG2                                                 04138000
ASCBS2S  EQU   ASCBFLG2                                                 04139000
ASCBCEXT EQU   ASCBFLG2                                                 04140000
ASCBPXMT EQU   ASCBFLG2                                                 04141000
ASCBXMPT EQU   ASCBFLG2                                                 04142000
ASCBRF07 EQU   ASCBDSP1                                                 04143000
ASCBRF06 EQU   ASCBDSP1                                                 04144000
ASCBRF05 EQU   ASCBDSP1                                                 04145000
ASCBRF04 EQU   ASCBDSP1                                                 04146000
ASCBRF03 EQU   ASCBDSP1                                                 04147000
ASCBRF02 EQU   ASCBDSP1                                                 04148000
ASCBFAIL EQU   ASCBDSP1                                                 04149000
ASCBNOQ  EQU   ASCBDSP1                                                 04150000
ASCBSWCT EQU   ASCB+112                                                 04151000
ASCBASXB EQU   ASCB+108                                                 04152000
ASCBTMCH EQU   ASCB+104                                                 04153000
ASCBNSWP EQU   ASCBFLG1                                                 04154000
ASCBTYP1 EQU   ASCBFLG1                                                 04155000
ASCBSTND EQU   ASCBFLG1                                                 04156000
ASCBABNT EQU   ASCBFLG1                                                 04157000
ASCBTERM EQU   ASCBFLG1                                                 04158000
ASCBS3S  EQU   ASCBFLG1                                                 04159000
ASCBCMSH EQU   ASCBFLG1                                                 04160000
ASCBTOFF EQU   ASCBFLG1                                                 04161000
ASCBRF01 EQU   ASCBRCTF                                                 04162000
ASCBTMLW EQU   ASCBRCTF                                                 04163000
ASCBOUT  EQU   ASCBRCTF                                                 04164000
ASCBWAIT EQU   ASCBRCTF                                                 04165000
ASCBRV08 EQU   ASCBRCTF                                                 04166000
ASCBFQU  EQU   ASCBRCTF                                                 04167000
ASCBFRS  EQU   ASCBRCTF                                                 04168000
ASCBTMNO EQU   ASCBRCTF                                                 04169000
ASCBAFFN EQU   ASCBFW1                                                  04170000
ASCBDUMP EQU   ASCB+96                                                  04171000
ASCBRV44 EQU   ASCB+92                                                  04172000
ASCBUBET EQU   ASCB+88                                                  04173000
ASCBECB  EQU   ASCB+84                                                  04174000
ASCBJSTL EQU   ASCB+80                                                  04175000
ASCBEWST EQU   ASCB+72                                                  04176000
ASCBEJST EQU   ASCB+64                                                  04177000
ASCBTSB  EQU   ASCB+60                                                  04178000
ASCBCSCB EQU   ASCB+56                                                  04179000
ASCBRSMA EQU   ASCBRSM+1                                                04180000
ASCBRV54 EQU   ASCBRSMF                                                 04181000
ASCBRV53 EQU   ASCBRSMF                                                 04182000
ASCBRV52 EQU   ASCBRSMF                                                 04183000
ASCBRV51 EQU   ASCBRSMF                                                 04184000
ASCBVEQR EQU   ASCBRSMF                                                 04185000
ASCBN2LP EQU   ASCBRSMF                                                 04186000
ASCB1LPU EQU   ASCBRSMF                                                 04187000
ASCB2LPU EQU   ASCBRSMF                                                 04188000
ASCBLDA  EQU   ASCB+48                                                  04189000
ASCBSTOR EQU   ASCB+44                                                  04190000
ASCBDP   EQU   ASCB+43                                                  04191000
ASCBRV07 EQU   ASCB+42                                                  04192000
ASCBIOSM EQU   ASCB+40                                                  04193000
ASCBSEQN EQU   ASCB+38                                                  04194000
ASCBCPUS EQU   ASCB+32                                                  04195000
ASCBSPL  EQU   ASCB+28                                                  04196000
ASCBIOSP EQU   ASCB+24                                                  04197000
ASCBSYNC EQU   ASCBSUPC+4                                               04198000
ASCBSVRB EQU   ASCBSUPC                                                 04199000
ASCBCMSF EQU   ASCB+12                                                  04200000
ASCBBWDP EQU   ASCB+8                                                   04201000
ASCBFWDP EQU   ASCB+4                                                   04202000
ASCBASCB EQU   ASCB                                                     04203000
ASCBEGIN EQU   ASCB                                                     04204000
@NM00222 EQU   TCBXTNT2+32                                              04205000
TCBRV181 EQU   TCBRV173                                                 04206000
TCBRV180 EQU   TCBRV173                                                 04207000
TCBRV179 EQU   TCBRV173                                                 04208000
TCBRV178 EQU   TCBRV173                                                 04209000
TCBRV177 EQU   TCBRV173                                                 04210000
TCBRV176 EQU   TCBRV173                                                 04211000
TCBRV175 EQU   TCBRV173                                                 04212000
TCBRV174 EQU   TCBRV173                                                 04213000
TCBRV172 EQU   TCBRV164                                                 04214000
TCBRV171 EQU   TCBRV164                                                 04215000
TCBRV170 EQU   TCBRV164                                                 04216000
TCBRV169 EQU   TCBRV164                                                 04217000
TCBRV168 EQU   TCBRV164                                                 04218000
TCBRV167 EQU   TCBRV164                                                 04219000
TCBRV166 EQU   TCBRV164                                                 04220000
TCBRV165 EQU   TCBRV164                                                 04221000
TCBRV163 EQU   TCBRV155                                                 04222000
TCBRV162 EQU   TCBRV155                                                 04223000
TCBRV161 EQU   TCBRV155                                                 04224000
TCBRV160 EQU   TCBRV155                                                 04225000
TCBRV159 EQU   TCBRV155                                                 04226000
TCBRV158 EQU   TCBRV155                                                 04227000
TCBRV157 EQU   TCBRV155                                                 04228000
TCBRV156 EQU   TCBRV155                                                 04229000
TCBRV154 EQU   TCBRV146                                                 04230000
TCBRV153 EQU   TCBRV146                                                 04231000
TCBRV152 EQU   TCBRV146                                                 04232000
TCBRV151 EQU   TCBRV146                                                 04233000
TCBRV150 EQU   TCBRV146                                                 04234000
TCBRV149 EQU   TCBRV146                                                 04235000
TCBRV148 EQU   TCBRV146                                                 04236000
TCBRV147 EQU   TCBRV146                                                 04237000
TCBRV145 EQU   TCBXTNT2+26                                              04238000
TCBRV144 EQU   TCBXTNT2+24                                              04239000
TCBRV143 EQU   TCBXTNT2+20                                              04240000
TCBRV142 EQU   TCBXTNT2+16                                              04241000
TCBRSV49 EQU   TCBXTNT2+12                                              04242000
TCBEVENT EQU   TCBXTNT2+8                                               04243000
TCBRCMP  EQU   TCBXTNT2+5                                               04244000
TCBRSVAB EQU   TCBXTNT2+4                                               04245000
TCBGTFA  EQU   TCBGTF+1                                                 04246000
TCBRSV47 EQU   TCBTFLG                                                  04247000
TCBRSV46 EQU   TCBTFLG                                                  04248000
TCBRSV45 EQU   TCBTFLG                                                  04249000
TCBRSV44 EQU   TCBTFLG                                                  04250000
TCBRSV43 EQU   TCBTFLG                                                  04251000
TCBDSPIT EQU   TCBTFLG                                                  04252000
TCBERRTN EQU   TCBTFLG                                                  04253000
TCBASYNC EQU   TCBTFLG                                                  04254000
@NM00221 EQU   TCB+296                                                  04255000
TCBSVCA2 EQU   TCB+292                                                  04256000
TCBSWASA EQU   TCB+288                                                  04257000
TCBDBTB  EQU   TCB+284                                                  04258000
TCBRPT   EQU   TCB+280                                                  04259000
TCBRV141 EQU   TCBRV133                                                 04260000
TCBRV140 EQU   TCBRV133                                                 04261000
TCBRV139 EQU   TCBRV133                                                 04262000
TCBRV138 EQU   TCBRV133                                                 04263000
TCBRV137 EQU   TCBRV133                                                 04264000
TCBRV136 EQU   TCBRV133                                                 04265000
TCBRV135 EQU   TCBRV133                                                 04266000
TCBRV134 EQU   TCBRV133                                                 04267000
TCBRV132 EQU   TCBRV124                                                 04268000
TCBRV131 EQU   TCBRV124                                                 04269000
TCBRV130 EQU   TCBRV124                                                 04270000
TCBRV129 EQU   TCBRV124                                                 04271000
TCBRV128 EQU   TCBRV124                                                 04272000
TCBRV127 EQU   TCBRV124                                                 04273000
TCBRV126 EQU   TCBRV124                                                 04274000
TCBRV125 EQU   TCBRV124                                                 04275000
TCBRV123 EQU   TCBFBYT2                                                 04276000
TCBRV122 EQU   TCBFBYT2                                                 04277000
TCBECBNV EQU   TCBFBYT2                                                 04278000
TCBSSSYN EQU   TCBFBYT2                                                 04279000
TCBFPRAP EQU   TCBFBYT2                                                 04280000
TCBFDW   EQU   TCBFBYT2                                                 04281000
TCBFMW   EQU   TCBFBYT2                                                 04282000
TCBCNCB  EQU   TCBFBYT2                                                 04283000
TCBLLH   EQU   TCBFBYT1                                                 04284000
TCBRV113 EQU   TCBFBYT1                                                 04285000
TCBEOT   EQU   TCBFBYT1                                                 04286000
TCBRTM2  EQU   TCBFBYT1                                                 04287000
TCBPGNLY EQU   TCBFBYT1                                                 04288000
TCBNDIOS EQU   TCBFBYT1                                                 04289000
TCBRV327 EQU   TCBFBYT1                                                 04290000
TCBEOTFM EQU   TCBFBYT1                                                 04291000
TCBAFFN  EQU   TCB+274                                                  04292000
TCBRV326 EQU   TCB+272                                                  04293000
TCBUKYSP EQU   TCB+268                                                  04294000
TCBMODE  EQU   TCBESTAE+3                                               04295000
TCBERTYP EQU   TCBESTAE+2                                               04296000
TCBRV314 EQU   TCBESTRM                                                 04297000
TCBRV313 EQU   TCBESTRM                                                 04298000
TCBRV312 EQU   TCBESTRM                                                 04299000
TCBRV311 EQU   TCBESTRM                                                 04300000
TCBRV310 EQU   TCBESTRM                                                 04301000
TCBRV309 EQU   TCBESTRM                                                 04302000
TCBRV308 EQU   TCBESTRM                                                 04303000
TCBETERM EQU   TCBESTRM                                                 04304000
TCBSCBKY EQU   TCBESTAE                                                 04305000
TCBRTM12 EQU   TCB+260                                                  04306000
TCBTCBID EQU   TCB+256                                                  04307000
TCBSTAWA EQU   TCB+252                                                  04308000
TCBSWA   EQU   TCB+248                                                  04309000
TCBFOEA  EQU   TCBFOE+1                                                 04310000
TCBRSV42 EQU   TCBFOE                                                   04311000
TCBCCPVI EQU   TCBXSCT+2                                                04312000
TCBRV325 EQU   TCBXSCT+1                                                04313000
TCBRV324 EQU   TCBXSCT1                                                 04314000
TCBRV323 EQU   TCBXSCT1                                                 04315000
TCBRV322 EQU   TCBXSCT1                                                 04316000
TCBRV321 EQU   TCBXSCT1                                                 04317000
TCBRV320 EQU   TCBXSCT1                                                 04318000
TCBRV319 EQU   TCBXSCT1                                                 04319000
TCBS3A   EQU   TCBXSCT1                                                 04320000
TCBACTIV EQU   TCBXSCT1                                                 04321000
TCBRSV41 EQU   TCB+239                                                  04322000
TCBTID   EQU   TCB+238                                                  04323000
TCBRSVAA EQU   TCB+237                                                  04324000
TCBABCUR EQU   TCB+236                                                  04325000
TCBTMSAV EQU   TCB+232                                                  04326000
TCBIOTIM EQU   TCB+228                                                  04327000
TCBRTWA  EQU   TCB+224                                                  04328000
TCBBACK  EQU   TCB+220                                                  04329000
TCBTIRB  EQU   TCB+216                                                  04330000
TCBAECB  EQU   TCB+212                                                  04331000
TCBEXT2A EQU   TCBEXT2+1                                                04332000
TCBRSV39 EQU   TCBEXT2                                                  04333000
TCBSTMCT EQU   TCB+207                                                  04334000
TCBSYSCT EQU   TCB+206                                                  04335000
TCBRSV37 EQU   TCB+205                                                  04336000
TCBEXSVC EQU   TCBDAR                                                   04337000
TCBDARMS EQU   TCBDAR                                                   04338000
TCBDARWT EQU   TCBDAR                                                   04339000
TCBDARO  EQU   TCBDAR                                                   04340000
TCBDARMC EQU   TCBDARC                                                  04341000
TCBDARD  EQU   TCBDAR                                                   04342000
TCBDARS  EQU   TCBDAR                                                   04343000
TCBDARP  EQU   TCBDAR                                                   04344000
TCBGTOFM EQU   TCBFLGS7                                                 04345000
TCBADMP  EQU   TCBFLGS7                                                 04346000
TCBRSTSK EQU   TCBFLGS7                                                 04347000
TCBSVCS  EQU   TCBFLGS7                                                 04348000
TCBSTACK EQU   TCBFLGS7                                                 04349000
TCBRSV34 EQU   TCBFLGS7                                                 04350000
TCBRSV33 EQU   TCBFLGS7                                                 04351000
TCBGPECB EQU   TCBFLGS7                                                 04352000
TCBNTJS  EQU   TCBFLGS6                                                 04353000
TCBAPG   EQU   TCBFLGS6                                                 04354000
TCBMIGR  EQU   TCBFLGS6                                                 04355000
TCBRV303 EQU   TCBFLGS6                                                 04356000
TCBSPVLK EQU   TCBFLGS6                                                 04357000
TCBCPU   EQU   TCBFLGS6                                                 04358000
TCBPIE17 EQU   TCBFLGS6                                                 04359000
TCBRV    EQU   TCBFLGS6                                                 04360000
TCBRSV79 EQU   TCBNDSP5                                                 04361000
TCBRSV78 EQU   TCBNDSP5                                                 04362000
TCBRSV77 EQU   TCBNDSP5                                                 04363000
TCBRSV76 EQU   TCBNDSP5                                                 04364000
TCBRSV75 EQU   TCBNDSP5                                                 04365000
TCBRSV74 EQU   TCBNDSP5                                                 04366000
TCBRSV95 EQU   TCBNDSP5                                                 04367000
TCBRSV94 EQU   TCBNDSP5                                                 04368000
TCBRSV93 EQU   TCBNDSP4                                                 04369000
TCBRSV92 EQU   TCBNDSP4                                                 04370000
TCBRSV91 EQU   TCBNDSP4                                                 04371000
TCBRSV90 EQU   TCBNDSP4                                                 04372000
TCBRSV89 EQU   TCBNDSP4                                                 04373000
TCBRSV88 EQU   TCBNDSP4                                                 04374000
TCBRSV87 EQU   TCBNDSP4                                                 04375000
TCBRSV86 EQU   TCBNDSP4                                                 04376000
TCBEXT1A EQU   TCBEXT1+1                                                04377000
TCBRSV32 EQU   TCBEXT1                                                  04378000
TCBEXCPD EQU   TCB+192                                                  04379000
TCBIOBRC EQU   TCB+188                                                  04380000
TCBDDWTC EQU   TCB+186                                                  04381000
TCBDDEXC EQU   TCB+184                                                  04382000
TCBJSCBB EQU   TCBJSCB+1                                                04383000
@NM00220 EQU   TCBRECDE                                                 04384000
TCBREC   EQU   TCBRECDE                                                 04385000
TCBMDIDS EQU   TCB+176                                                  04386000
TCBNDINT EQU   TCBNDSP3                                                 04387000
TCBRSV27 EQU   TCBNDSP3                                                 04388000
TCBRSV26 EQU   TCBNDSP3                                                 04389000
TCBRSV25 EQU   TCBNDSP3                                                 04390000
TCBRSV24 EQU   TCBNDSP3                                                 04391000
TCBSRBND EQU   TCBNDSP3                                                 04392000
TCBRV302 EQU   TCBNDSP3                                                 04393000
TCBLJSND EQU   TCBNDSP3                                                 04394000
TCBABE   EQU   TCBNDSP2                                                 04395000
TCBDSS   EQU   TCBNDSP2                                                 04396000
TCBOWAIT EQU   TCBNDSP2                                                 04397000
TCBIWAIT EQU   TCBNDSP2                                                 04398000
TCBNDTS  EQU   TCBNDSP2                                                 04399000
TCBNDSVC EQU   TCBNDSP2                                                 04400000
TCBSTPP  EQU   TCBNDSP2                                                 04401000
TCBABD   EQU   TCBNDSP2                                                 04402000
TCBRSV22 EQU   TCBNDSP1                                                 04403000
TCBPIEND EQU   TCBNDSP1                                                 04404000
TCBTPSP  EQU   TCBNDSP1                                                 04405000
TCBDDRND EQU   TCBNDSP1                                                 04406000
TCBRSPND EQU   TCBNDSP1                                                 04407000
TCBRSTND EQU   TCBNDSP1                                                 04408000
TCBDARPN EQU   TCBNDSP1                                                 04409000
TCBDARTN EQU   TCBNDSP1                                                 04410000
TCBNDSP0 EQU   TCBNDSP                                                  04411000
TCBUSER  EQU   TCB+168                                                  04412000
TCBTCTB  EQU   TCBTCT+1                                                 04413000
TCBRSV9C EQU   TCBTCTGF                                                 04414000
TCBRSV9B EQU   TCBTCTGF                                                 04415000
TCBRSV9A EQU   TCBTCTGF                                                 04416000
TCBRSV99 EQU   TCBTCTGF                                                 04417000
TCBRSV98 EQU   TCBTCTGF                                                 04418000
TCBRSV97 EQU   TCBTCTGF                                                 04419000
TCBRSV20 EQU   TCBTCTGF                                                 04420000
TCBSMFGF EQU   TCBTCTGF                                                 04421000
TCBSTCUR EQU   TCBNSTAE                                                 04422000
TCBRV301 EQU   TCBNSTAE                                                 04423000
TCBSYNCH EQU   TCBNSTAE                                                 04424000
TCBHALT  EQU   TCBNSTAE                                                 04425000
TCBPPSUP EQU   TCBNSTAE                                                 04426000
TCB33E   EQU   TCBNSTAE                                                 04427000
TCBQUIES EQU   TCBNSTAE                                                 04428000
TCBSTABE EQU   TCBNSTAE                                                 04429000
TCBAQE   EQU   TCB+156                                                  04430000
TCBPQE   EQU   TCB+152                                                  04431000
TCBTSDP  EQU   TCB+151                                                  04432000
TCBTSLP  EQU   TCB+150                                                  04433000
TCBSTPCT EQU   TCB+149                                                  04434000
TCBCPUBN EQU   TCBTSFLG                                                 04435000
TCBDYDSP EQU   TCBTSFLG                                                 04436000
TCBRSV18 EQU   TCBTSFLG                                                 04437000
TCBRSV17 EQU   TCBTSFLG                                                 04438000
TCBTIOTG EQU   TCBTSFLG                                                 04439000
TCBATT   EQU   TCBTSFLG                                                 04440000
TCBSTPPR EQU   TCBTSFLG                                                 04441000
TCBRV300 EQU   TCBTSTSK                                                 04442000
TCBECB   EQU   TCB+144                                                  04443000
TCBIQE   EQU   TCB+140                                                  04444000
TCBLTC   EQU   TCB+136                                                  04445000
TCBOTC   EQU   TCB+132                                                  04446000
TCBNTC   EQU   TCB+128                                                  04447000
TCBJSTCA EQU   TCBJSTCB+1                                               04448000
TCBRSV16 EQU   TCBJSTCB                                                 04449000
TCBTQET  EQU   TCBTME                                                   04450000
TCBTCB   EQU   TCB+116                                                  04451000
TCBFSAB  EQU   TCBFSA+1                                                 04452000
TCBQEL   EQU   TCBFSA                                                   04453000
TCBGRS15 EQU   TCBGRS+60                                                04454000
TCBGRS14 EQU   TCBGRS+56                                                04455000
TCBGRS13 EQU   TCBGRS+52                                                04456000
TCBGRS12 EQU   TCBGRS+48                                                04457000
TCBGRS11 EQU   TCBGRS+44                                                04458000
TCBGRS10 EQU   TCBGRS+40                                                04459000
TCBGRS9  EQU   TCBGRS+36                                                04460000
TCBGRS8  EQU   TCBGRS+32                                                04461000
TCBGRS7  EQU   TCBGRS+28                                                04462000
TCBGRS6  EQU   TCBGRS+24                                                04463000
TCBGRS5  EQU   TCBGRS+20                                                04464000
TCBGRS4  EQU   TCBGRS+16                                                04465000
TCBGRS3  EQU   TCBGRS+12                                                04466000
TCBGRS2  EQU   TCBGRS+8                                                 04467000
TCBGRS1  EQU   TCBGRS+4                                                 04468000
TCBGRS0  EQU   TCBGRS                                                   04469000
TCBJPQB  EQU   TCBJPQ+1                                                 04470000
TCBRSV15 EQU   TCBPURGE                                                 04471000
TCBRSV14 EQU   TCBPURGE                                                 04472000
TCBRSV13 EQU   TCBPURGE                                                 04473000
TCBRSV12 EQU   TCBPURGE                                                 04474000
TCBRSV11 EQU   TCBPURGE                                                 04475000
TCBRSV10 EQU   TCBPURGE                                                 04476000
TCBRSV09 EQU   TCBPURGE                                                 04477000
TCBJPQF  EQU   TCBPURGE                                                 04478000
TCBJLB   EQU   TCB+40                                                   04479000
TCBLLS   EQU   TCB+36                                                   04480000
TCBDSP   EQU   TCB+35                                                   04481000
TCBLMP   EQU   TCB+34                                                   04482000
TCBPNDSP EQU   TCBFLGS5                                                 04483000
TCBFCD1  EQU   TCBFLGS5                                                 04484000
TCBSTP   EQU   TCBFLGS5                                                 04485000
TCBSYS   EQU   TCBFLGS5                                                 04486000
TCBANDSP EQU   TCBFLGS5                                                 04487000
TCBPAGE  EQU   TCBFLGS5                                                 04488000
TCBUXNDF EQU   TCBABWF                                                  04489000
TCBFC    EQU   TCBFLGS5                                                 04490000
TCBONDSP EQU   TCBFLGS4                                                 04491000
TCBMPCND EQU   TCBFLGS4                                                 04492000
TCBMPCVQ EQU   TCBFLGS4                                                 04493000
TCBUXNDV EQU   TCBFLGS4                                                 04494000
TCBHNDSP EQU   TCBFLGS4                                                 04495000
TCBRQENA EQU   TCBFLGS4                                                 04496000
TCBSER   EQU   TCBFLGS4                                                 04497000
TCBNDUMP EQU   TCBFLGS4                                                 04498000
TCBDWSTA EQU   TCBFLGS3                                                 04499000
TCBRSV08 EQU   TCBFLGS3                                                 04500000
TCBRSV07 EQU   TCBFLGS3                                                 04501000
TCBRSV06 EQU   TCBFLGS3                                                 04502000
TCBABGM  EQU   TCBFLGS3                                                 04503000
TCBABTRM EQU   TCBFLGS3                                                 04504000
TCBADINP EQU   TCBFLGS3                                                 04505000
TCBFSM   EQU   TCBFLGS3                                                 04506000
TCBFTS   EQU   TCBFLGS2                                                 04507000
TCBFETXR EQU   TCBFLGS2                                                 04508000
TCBFDSOP EQU   TCBFLGS2                                                 04509000
TCBFJMC  EQU   TCBFLGS2                                                 04510000
TCBFSMC  EQU   TCBFLGS2                                                 04511000
TCBFABOP EQU   TCBFLGS2                                                 04512000
TCBFSTI  EQU   TCBFLGS2                                                 04513000
TCBFOINP EQU   TCBFLGS2                                                 04514000
TCBFX    EQU   TCBFLGS1                                                 04515000
TCBFS    EQU   TCBFLGS1                                                 04516000
TCBFT    EQU   TCBFLGS1                                                 04517000
TCBPDUMP EQU   TCBFLGS1                                                 04518000
TCBNONPR EQU   TCBFLGS1                                                 04519000
TCBFERA  EQU   TCBFLGS1                                                 04520000
TCBFE    EQU   TCBFLGS1                                                 04521000
TCBZERO  EQU   TCBPKF                                                   04522000
TCBFLAG  EQU   TCBPKF                                                   04523000
TCBMSSB  EQU   TCBMSS+1                                                 04524000
TCBRSV03 EQU   TCBMSS                                                   04525000
TCBTRNB  EQU   TCBTRN+1                                                 04526000
TCBRSV02 EQU   TCBABF                                                   04527000
TCBOLTEP EQU   TCBABF                                                   04528000
TCBTCP   EQU   TCBABF                                                   04529000
TCBTCPP  EQU   TCBABF                                                   04530000
TCBRSV01 EQU   TCBABF                                                   04531000
TCBGRPH  EQU   TCBABF                                                   04532000
TCBNOCHK EQU   TCBABF                                                   04533000
TCBMOD91 EQU   TCBABF                                                   04534000
TCBRV318 EQU   TCBCMSG                                                  04535000
TCBRV317 EQU   TCBCIND                                                  04536000
TCBRV316 EQU   TCBCWTO                                                  04537000
TCBCASID EQU   TCBCDBL                                                  04538000
TCBNOCC  EQU   TCBSTCC                                                  04539000
TCBDMPO  EQU   TCBCPP                                                   04540000
TCBCSTEP EQU   TCBCMPF                                                  04541000
TCBCREQ  EQU   TCBCMPF                                                  04542000
TCBTIO   EQU   TCB+12                                                   04543000
TCBDEB   EQU   TCB+8                                                    04544000
TCBPIEA  EQU   TCBPIE+1                                                 04545000
TCBPM    EQU   TCBPMASK                                                 04546000
@NM00219 EQU   TCBPMASK                                                 04547000
TCBRBP   EQU   TCB                                                      04548000
TCBFRS6  EQU   TCBFRS+24                                                04549000
TCBFRS4  EQU   TCBFRS+16                                                04550000
TCBFRS2  EQU   TCBFRS+8                                                 04551000
TCBFRS0  EQU   TCBFRS                                                   04552000
QDBRV002 EQU   QDB+28                                                   04553000
QDBPRDS  EQU   QDB+26                                                   04554000
QDBPRSZ  EQU   QDB+24                                                   04555000
QDBBPTDS EQU   QDB+22                                                   04556000
QDBFPTDS EQU   QDB+20                                                   04557000
QDBLELMP EQU   QDB+16                                                   04558000
QDBFELMP EQU   QDB+12                                                   04559000
QDBNELMS EQU   QDB+8                                                    04560000
QDBRV001 EQU   QDB+6                                                    04561000
QDBATTR  EQU   QDB+4                                                    04562000
QDBQDB   EQU   QDB                                                      04563000
DSABGRID EQU   DSABGIDL+4                                               04564000
DSABLLEN EQU   DSABGIDL                                                 04565000
DSABANAM EQU   DSABANMI+1                                               04566000
DSABANML EQU   DSABANMI                                                 04567000
DSABRS04 EQU   DSAB+68                                                  04568000
DSABSIOT EQU   DSAB+64                                                  04569000
DSABRS03 EQU   DSAB+62                                                  04570000
DSABDCBM EQU   DSAB+56                                                  04571000
DSABSSCM EQU   DSAB+52                                                  04572000
DSABSSNM EQU   DSAB+48                                                  04573000
DSABPTTR EQU   DSAB+44                                                  04574000
DSABTCBP EQU   DSAB+40                                                  04575000
DSABRS02 EQU   DSAB+38                                                  04576000
@NM00217 EQU   DSABFLG4                                                 04577000
DSABCKSI EQU   DSABFLG4                                                 04578000
DSABCKVL EQU   DSABFLG4                                                 04579000
DSABCKDS EQU   DSABFLG4                                                 04580000
@NM00216 EQU   DSABFLG3                                                 04581000
DSABJSCT EQU   DSABFLG3                                                 04582000
DSABCATL EQU   DSABFLG3                                                 04583000
DSABVMSC EQU   DSABFLG3                                                 04584000
DSABVAM  EQU   DSABFLG3                                                 04585000
DSABPASS EQU   DSABFLG3                                                 04586000
DSABDEFR EQU   DSABFLG3                                                 04587000
@NM00215 EQU   DSABFLG2                                                 04588000
DSABUNAL EQU   DSABFLG2                                                 04589000
DSABIRM  EQU   DSABFLG2                                                 04590000
DSABOPEN EQU   DSABFLG2                                                 04591000
DSABNUSE EQU   DSABFLG1                                                 04592000
DSABCATM EQU   DSABFLG1                                                 04593000
DSABPCAT EQU   DSABFLG1                                                 04594000
DSABDCAT EQU   DSABFLG1                                                 04595000
DSABCONV EQU   DSABFLG1                                                 04596000
DSABDCNV EQU   DSABFLG1                                                 04597000
DSABPALC EQU   DSABFLG1                                                 04598000
DSABDALC EQU   DSABFLG1                                                 04599000
@NM00214 EQU   DSABORG2                                                 04600000
DSABTR   EQU   DSABORG2                                                 04601000
DSABAM   EQU   DSABORG2                                                 04602000
@NM00213 EQU   DSABORG2                                                 04603000
DSABTQ   EQU   DSABORG2                                                 04604000
DSABTX   EQU   DSABORG2                                                 04605000
DSABGS   EQU   DSABORG2                                                 04606000
DSABU    EQU   DSABORG1                                                 04607000
DSABPO   EQU   DSABORG1                                                 04608000
DSABMQ   EQU   DSABORG1                                                 04609000
DSABCQ   EQU   DSABORG1                                                 04610000
DSABCX   EQU   DSABORG1                                                 04611000
DSABDA   EQU   DSABORG1                                                 04612000
DSABPS   EQU   DSABORG1                                                 04613000
DSABIS   EQU   DSABORG1                                                 04614000
DSABRS01 EQU   DSAB+20                                                  04615000
DSABTIOT EQU   DSAB+16                                                  04616000
DSABOPCT EQU   DSAB+14                                                  04617000
DSABLNTH EQU   DSAB+12                                                  04618000
DSABBCHN EQU   DSAB+8                                                   04619000
DSABFCHN EQU   DSAB+4                                                   04620000
DSABID   EQU   DSAB                                                     04621000
JSCBCSCB EQU   JSCBSEC1+68                                              04622000
JSCBPMG  EQU   JSCBWTP+2                                                04623000
JSCBWTSP EQU   JSCBWTP+1                                                04624000
JSCRSV23 EQU   JSCBWTFG                                                 04625000
JSCRSV22 EQU   JSCBWTFG                                                 04626000
JSCRSV21 EQU   JSCBWTFG                                                 04627000
JSCRSV20 EQU   JSCBWTFG                                                 04628000
JSCRSV19 EQU   JSCBWTFG                                                 04629000
JSCRSV18 EQU   JSCBWTFG                                                 04630000
JSCBRET  EQU   JSCBWTFG                                                 04631000
JSCBIOFG EQU   JSCBWTFG                                                 04632000
@NM00210 EQU   JSCBSEC1+60                                              04633000
JSCBQMPI EQU   JSCBSEC1+56                                              04634000
JSCBPMSG EQU   JSCBSWT1                                                 04635000
JSCRSV16 EQU   JSCBSWT1                                                 04636000
JSCRSV15 EQU   JSCBSWT1                                                 04637000
JSCRSV14 EQU   JSCBSWT1                                                 04638000
JSCRSV13 EQU   JSCBSWT1                                                 04639000
JSCRSV12 EQU   JSCBSWT1                                                 04640000
JSCRSV11 EQU   JSCBSWT1                                                 04641000
JSCBPASS EQU   JSCBSWT1                                                 04642000
JSCBTTTR EQU   JSCBSEC1+52                                              04643000
JSCRSV10 EQU   JSCBSEC1+49                                              04644000
JSCBAUTH EQU   JSCBOPTS                                                 04645000
JSCRSV08 EQU   JSCBOPTS                                                 04646000
JSCRSV07 EQU   JSCBOPTS                                                 04647000
JSCRSV06 EQU   JSCBOPTS                                                 04648000
JSCBLONG EQU   JSCBOPTS                                                 04649000
JSCRSV05 EQU   JSCBOPTS                                                 04650000
JSCRSV04 EQU   JSCBOPTS                                                 04651000
JSCBSECB EQU   JSCBSEC1+44                                              04652000
JSCRSV03 EQU   JSCBSEC1+41                                              04653000
JSCBSTEP EQU   JSCBSEC1+40                                              04654000
JSCBDCBA EQU   JSCBDCB+1                                                04655000
JSCRSV02 EQU   JSCBDCB                                                  04656000
JSCBID   EQU   JSCBSEC1+32                                              04657000
JSCBDBTB EQU   JSCBSEC1+28                                              04658000
JSCBIJSC EQU   JSCBSEC1+24                                              04659000
JSCBTCBP EQU   JSCBSEC1+20                                              04660000
JSCBPCC  EQU   JSCBSEC1+16                                              04661000
JSCBTCP  EQU   JSCBSEC1+12                                              04662000
JSCBSHR  EQU   JSCBSEC1+8                                               04663000
JSCHPCEA EQU   JSCHPCE+1                                                04664000
JSCRSV32 EQU   JSCHPCE                                                  04665000
JSCRSV01 EQU   JSCBSEC1                                                 04666000
@NM00209 EQU   IEZJSCB                                                  04667000
WPLMLTXT EQU   WPLML+4                                                  04668000
WPLMLLT2 EQU   WPLMLLTF+1                                               04669000
WPLRSV24 EQU   WPLMLLT1                                                 04670000
WPLRSV23 EQU   WPLMLLT1                                                 04671000
WPLRSV22 EQU   WPLMLLT1                                                 04672000
WPLRSV21 EQU   WPLMLLT1                                                 04673000
WPLMLLTD EQU   WPLMLLT1                                                 04674000
WPLMLLTC EQU   WPLMLLT1                                                 04675000
WPLMLLTB EQU   WPLMLLT1                                                 04676000
WPLMLLTA EQU   WPLMLLT1                                                 04677000
WPLMLLEN EQU   WPLML+1                                                  04678000
WPLML0   EQU   WPLML                                                    04679000
WPLLINES EQU   WPLLS01+3                                                04680000
WPLAREA  EQU   WPLLS01+2                                                04681000
WPLLTF2  EQU   WPLLTF+1                                                 04682000
WPLRSV20 EQU   WPLLTF1                                                  04683000
WPLRSV19 EQU   WPLLTF1                                                  04684000
WPLRSV18 EQU   WPLLTF1                                                  04685000
WPLRSV17 EQU   WPLLTF1                                                  04686000
WPLLTFD  EQU   WPLLTF1                                                  04687000
WPLLTFC  EQU   WPLLTF1                                                  04688000
WPLLTFB  EQU   WPLLTF1                                                  04689000
WPLLTFA  EQU   WPLLTF1                                                  04690000
WPLQID   EQU   WPLFLGS+6                                                04691000
WPLRSV32 EQU   WPLMSGT2                                                 04692000
WPLRSV31 EQU   WPLMSGT2                                                 04693000
WPLRSV30 EQU   WPLMSGT2                                                 04694000
WPLRSV29 EQU   WPLMSGT2                                                 04695000
WPLRSV28 EQU   WPLMSGT2                                                 04696000
WPLRSV27 EQU   WPLMSGT2                                                 04697000
WPLRSV26 EQU   WPLMSGT2                                                 04698000
WPLRSV25 EQU   WPLMSGT2                                                 04699000
WPLRSV16 EQU   WPLMSGT1                                                 04700000
WPLRSV15 EQU   WPLMSGT1                                                 04701000
WPLRSV14 EQU   WPLMSGT1                                                 04702000
WPLMSGTD EQU   WPLMSGT1                                                 04703000
WPLMSGTC EQU   WPLMSGT1                                                 04704000
WPLMSGTB EQU   WPLMSGT1                                                 04705000
WPLRSV13 EQU   WPLROUT2                                                 04706000
WPLROUTO EQU   WPLROUT2                                                 04707000
WPLROUTN EQU   WPLROUT2                                                 04708000
WPLROUTM EQU   WPLROUT2                                                 04709000
WPLROUTL EQU   WPLROUT2                                                 04710000
WPLROUTK EQU   WPLROUT2                                                 04711000
WPLROUTJ EQU   WPLROUT2                                                 04712000
WPLROUTI EQU   WPLROUT2                                                 04713000
WPLROUTH EQU   WPLROUT1                                                 04714000
WPLROUTG EQU   WPLROUT1                                                 04715000
WPLROUTF EQU   WPLROUT1                                                 04716000
WPLROUTE EQU   WPLROUT1                                                 04717000
WPLROUTD EQU   WPLROUT1                                                 04718000
WPLROUTC EQU   WPLROUT1                                                 04719000
WPLROUTA EQU   WPLROUT1                                                 04720000
WPLRSV12 EQU   WPLDESC2                                                 04721000
WPLRSV11 EQU   WPLDESC2                                                 04722000
WPLRSV10 EQU   WPLDESC2                                                 04723000
WPLRSV09 EQU   WPLDESC2                                                 04724000
WPLRSV08 EQU   WPLDESC2                                                 04725000
WPLRSV07 EQU   WPLDESC2                                                 04726000
WPLDESCJ EQU   WPLDESC2                                                 04727000
WPLDESCI EQU   WPLDESC2                                                 04728000
WPLDESCH EQU   WPLDESC1                                                 04729000
WPLDESCG EQU   WPLDESC1                                                 04730000
WPLDESCE EQU   WPLDESC1                                                 04731000
WPLDESCC EQU   WPLDESC1                                                 04732000
WPLDESCB EQU   WPLDESC1                                                 04733000
WPLDESCA EQU   WPLDESC1                                                 04734000
WPLTXTL  EQU   WPLTXT+125                                               04735000
@NM00206 EQU   WPLTXT                                                   04736000
WPLRSV05 EQU   WPLMCSF2                                                 04737000
WPLRSV04 EQU   WPLMCSF2                                                 04738000
WPLMCSFN EQU   WPLMCSF2                                                 04739000
WPLRSV03 EQU   WPLMCSF2                                                 04740000
WPLNOWTP EQU   WPLMCSF2                                                 04741000
WPLMCSFK EQU   WPLMCSF2                                                 04742000
WPLMCSFJ EQU   WPLMCSF2                                                 04743000
WPLMCSFI EQU   WPLMCSF2                                                 04744000
WPLMCSFH EQU   WPLMCSF1                                                 04745000
WPLMCSFG EQU   WPLMCSF1                                                 04746000
WPLMCSFF EQU   WPLMCSF1                                                 04747000
WPLMCSFE EQU   WPLMCSF1                                                 04748000
WPLMCSFB EQU   WPLMCSF1                                                 04749000
WPLRECB  EQU   WPLRF+4                                                  04750000
WPLRPTRA EQU   WPLRPTR+1                                                04751000
WPLRLN   EQU   WPLRPTR                                                  04752000
@NM00203 EQU   ESTAFLGS                                                 04753000
ESTRECRD EQU   ESTAFLGS                                                 04754000
ESTAJOBU EQU   ESTAFLGS                                                 04755000
ESTRECUR EQU   ESTAFLGS                                                 04756000
ESTAAUTO EQU   ESTAPARM                                                 04757000
TIOMIUSL EQU   TIOMGRRB+36                                              04758000
TIOMPSNP EQU   TIOMGRRB+32                                              04759000
TIOMRETP EQU   TIOMGRRB+28                                              04760000
TIOMSIOP EQU   TIOMGRRB+24                                              04761000
TIOMDSAP EQU   TIOMGRRB+20                                              04762000
TIOMENTP EQU   TIOMGRRB+16                                              04763000
TIOMSNMP EQU   TIOMGRRB+12                                              04764000
TIOMJNMP EQU   TIOMGRRB+8                                               04765000
@NM00202 EQU   TIOMFMAP+1                                               04766000
@NM00201 EQU   TIOMFMAP+1                                               04767000
@NM00200 EQU   TIOMFMAP+1                                               04768000
@NM00199 EQU   TIOMFMAP+1                                               04769000
@NM00198 EQU   TIOMFMAP+1                                               04770000
@NM00197 EQU   TIOMFMAP+1                                               04771000
@NM00196 EQU   TIOMFMAP+1                                               04772000
TIOMRENT EQU   TIOMFMAP+1                                               04773000
TIOMUNAL EQU   TIOMFMAP                                                 04774000
TIOMCCAT EQU   TIOMFMAP                                                 04775000
TIOMUPD  EQU   TIOMFMAP                                                 04776000
TIOMRLSE EQU   TIOMFMAP                                                 04777000
TIOMALOC EQU   TIOMFMAP                                                 04778000
@NM00195 EQU   TIOMFMAP                                                 04779000
TIOMBLD  EQU   TIOMFMAP                                                 04780000
SIODDSNL EQU   INDMSIOT+173                                             04781000
SIOVDSNL EQU   INDMSIOT+172                                             04782000
SIOVDSNT EQU   INDMSIOT+170                                             04783000
SVOLUNNO EQU   INDMSIOT+168                                             04784000
SIOTVMVP EQU   INDMSIOT+164                                             04785000
SIOTJFX  EQU   INDMSIOT+160                                             04786000
SIOTETIO EQU   INDMSIOT+148                                             04787000
SIOTATE  EQU   INDMSIOT+144                                             04788000
SVOLUNAD EQU   INDMSIOT+140                                             04789000
SIOTEDLP EQU   INDMSIOT+136                                             04790000
SIOTEDLS EQU   INDMSIOT+132                                             04791000
SIOTRSNC EQU   INDMSIOT+130                                             04792000
SCTANAME EQU   INDMSIOT+122                                             04793000
SIOTSSIC EQU   INDMSIOT+120                                             04794000
@NM00194 EQU   INDMSIOT+108                                             04795000
SIOTSSNM EQU   INDMSIOT+104                                             04796000
@NM00193 EQU   SIOTBYT2                                                 04797000
SIOTCVOL EQU   SIOTBYT2                                                 04798000
SIOTCNEW EQU   SIOTBYT2                                                 04799000
SIOTCALC EQU   SIOTBYT2                                                 04800000
SIOTGALL EQU   SIOTBYT2                                                 04801000
SIOTDSPD EQU   SIOTBYT2                                                 04802000
SIOTDMND EQU   SIOTBYT2                                                 04803000
SIOTOPUC EQU   INDMSIOT+99                                              04804000
SIOTOUTR EQU   INDMSIOT+97                                              04805000
SIOTOUTC EQU   INDMSIOT+96                                              04806000
SIOTSSWA EQU   INDMSIOT+93                                              04807000
SIOTAUNC EQU   SIOTALTD                                                 04808000
SIOTACAT EQU   SIOTALTD                                                 04809000
SIOTADEL EQU   SIOTALTD                                                 04810000
SIOTAKEP EQU   SIOTALTD                                                 04811000
SIOTNPRV EQU   SIOTALTD                                                 04812000
SIOJCATS EQU   SIOTALTD                                                 04813000
@NM00192 EQU   SIOTALTD                                                 04814000
@NM00191 EQU   SIOTALTD                                                 04815000
@NM00190 EQU   INDMSIOT+91                                              04816000
SIOTNDSB EQU   INDMSIOT+88                                              04817000
@NM00189 EQU   INDMSIOT+84                                              04818000
SIOTDPCD EQU   INDMSIOT+82                                              04819000
@NM00188 EQU   SIOTBYT4                                                 04820000
SIOTRACT EQU   SIOTBYT4                                                 04821000
SIOTRACD EQU   SIOTBYT4                                                 04822000
SIOTPROT EQU   SIOTBYT4                                                 04823000
SCTOUTPN EQU   INDMSIOT+80                                              04824000
SCTOUTNO EQU   INDMSIOT+76                                              04825000
SCTOUTNM EQU   INDMSIOT+68                                              04826000
SIOUCBAD EQU   SCTUTYPE+5                                               04827000
SIOUCNVT EQU   SCTUTYPE+4                                               04828000
SIOUBYT4 EQU   SIOTDEVT+3                                               04829000
@NM00187 EQU   SIOUBYT3                                                 04830000
SIO3UREC EQU   SIOUBYT3                                                 04831000
SIO3DISP EQU   SIOUBYT3                                                 04832000
SIO3DACC EQU   SIOUBYT3                                                 04833000
SIO3COMM EQU   SIOUBYT3                                                 04834000
SIO3TAPE EQU   SIOUBYT3                                                 04835000
SIOUBYT2 EQU   SIOTDEVT+1                                               04836000
SIOUBYT1 EQU   SIOTDEVT                                                 04837000
SIOTOMN  EQU   SCTSBYT4                                                 04838000
SIOTIPDI EQU   SCTSBYT4                                                 04839000
SIOTVAFF EQU   SCTSBYT4                                                 04840000
SIOTSTEP EQU   SCTSBYT4                                                 04841000
SIOTASCI EQU   SCTSBYT4                                                 04842000
@NM00186 EQU   SCTSBYT4                                                 04843000
SIOTGDGA EQU   SCTSBYT4                                                 04844000
SCTSGDGS EQU   SCTSBYT4                                                 04845000
SCTSOLD  EQU   SCTSBYT3                                                 04846000
SCTSMOD  EQU   SCTSBYT3                                                 04847000
SCTSNEW  EQU   SCTSBYT3                                                 04848000
SCTSYSOU EQU   SCTSBYT3                                                 04849000
SCTVREF  EQU   SCTSBYT3                                                 04850000
SCTALCHK EQU   SCTSBYT3                                                 04851000
SCTSYSNE EQU   SCTSBYT3                                                 04852000
SCTDSNRF EQU   SCTSBYT3                                                 04853000
SCTRECVD EQU   SCTSBYT2                                                 04854000
SCTDEFER EQU   SCTSBYT2                                                 04855000
SCTLABEL EQU   SCTSBYT2                                                 04856000
SCTUNLBD EQU   SCTSBYT2                                                 04857000
SCTJOBLB EQU   SCTSBYT2                                                 04858000
SCTVOLAF EQU   SCTSBYT2                                                 04859000
SIOTCATL EQU   SCTSBYT2                                                 04860000
SIOCLUNL EQU   SCTSBYT2                                                 04861000
SCTUNAFF EQU   SCTSBYT1                                                 04862000
SCTPARLM EQU   SCTSBYT1                                                 04863000
SIOTQDSN EQU   SCTSBYT1                                                 04864000
SIOTGDSN EQU   SCTSBYT1                                                 04865000
SIOTCCAT EQU   SCTSBYT1                                                 04866000
SCTSYSIN EQU   SCTSBYT1                                                 04867000
SCTDUMMY EQU   SCTSBYT1                                                 04868000
SIOTUNCT EQU   SCTSDISP                                                 04869000
SIOTCTLG EQU   SCTSDISP                                                 04870000
SIOTDLET EQU   SCTSDISP                                                 04871000
SIOTKEEP EQU   SCTSDISP                                                 04872000
SIOTPASS EQU   SCTSDISP                                                 04873000
SIOTPRIV EQU   SCTSDISP                                                 04874000
S3400DSP EQU   SCTSDISP                                                 04875000
SIOTRETN EQU   SCTSDISP                                                 04876000
SIOTVLCT EQU   INDMSIOT+54                                              04877000
SCTNMBUT EQU   INDMSIOT+53                                              04878000
SIOTRTRY EQU   SIOTBYT0                                                 04879000
SIOTPUPV EQU   SIOTBYT0                                                 04880000
SIOTNOPV EQU   SIOTBYT0                                                 04881000
SIOTGIGN EQU   SIOTBYT0                                                 04882000
SPVTAMSG EQU   SIOTBYT0                                                 04883000
SIOTFUDA EQU   SIOTBYT0                                                 04884000
SIOTDYAL EQU   SIOTBYT0                                                 04885000
SIOTSSDS EQU   SIOTBYT0                                                 04886000
SIOTGIID EQU   INDMSIOT+50                                              04887000
SCTVOLCT EQU   INDMSIOT+49                                              04888000
SCTSPOOL EQU   INDMSIOT+48                                              04889000
SIOTQNAM EQU   SIOTTSTC                                                 04890000
SIOTDSNM EQU   SIOTTSTC                                                 04891000
SIOTTRKM EQU   SIOTTSTC                                                 04892000
SIOTSSMG EQU   SIOTTSTC                                                 04893000
SIOTSSGP EQU   SIOTTSTC                                                 04894000
@NM00185 EQU   SIOTTSTC                                                 04895000
SIOTTERM EQU   SIOTTSTC                                                 04896000
SIOTINFC EQU   SIOTTSTC                                                 04897000
@NM00184 EQU   SIOTBYT3                                                 04898000
S3400OFF EQU   SIOTBYT3                                                 04899000
SIOTJES3 EQU   SIOTBYT3                                                 04900000
SIOCDEVT EQU   SIOTBYT3                                                 04901000
SIOALIAS EQU   SIOTBYT3                                                 04902000
SCTDDINO EQU   INDMSIOT+44                                              04903000
SIOTDDNT EQU   SIOTBYT1                                                 04904000
SIOTALCD EQU   SIOTBYT1                                                 04905000
SIODADSM EQU   SIOTBYT1                                                 04906000
SIOTDADR EQU   SIOTBYT1                                                 04907000
SIODUNAL EQU   SIOTBYT1                                                 04908000
SIOVAMDS EQU   SIOTBYT1                                                 04909000
SIOTHOLD EQU   SIOTBYT1                                                 04910000
SIOTOCKP EQU   SIOTBYT1                                                 04911000
SIOPSCNT EQU   INDMSIOT+42                                              04912000
SIOTREFN EQU   INDMSIOT+40                                              04913000
SIOTOTUN EQU   INDMSIOT+39                                              04914000
SIOTVRSB EQU   INDMSIOT+36                                              04915000
@NM00183 EQU   INDMSIOT+35                                              04916000
SCTPJFCB EQU   INDMSIOT+32                                              04917000
@NM00182 EQU   INDMSIOT+31                                              04918000
SCTPSIOT EQU   INDMSIOT+28                                              04919000
SIOTAFID EQU   INDMSIOT+26                                              04920000
SIOTVLSP EQU   INDMSIOT+24                                              04921000
SIODSNTE EQU   INDMSIOT+22                                              04922000
SIOTUNAF EQU   SCTUSADD                                                 04923000
SIOTDEST EQU   INDMSIOT+12                                              04924000
SCTDDNAM EQU   INDMSIOT+4                                               04925000
SIOTTYPE EQU   INDMSIOT+3                                               04926000
@NM00181 EQU   @NM00179+1                                               04927000
SCTONLY  EQU   SCTABCND                                                 04928000
SCTEVEN  EQU   SCTABCND                                                 04929000
SCTONLYC EQU   SCTABCND                                                 04930000
SCTABCAN EQU   SCTABCND                                                 04931000
@NM00180 EQU   SCTABCND                                                 04932000
@NM00178 EQU   INSMSCT+173                                              04933000
@NM00177 EQU   SCTSTEND                                                 04934000
SCTSYSCK EQU   SCTSTEND                                                 04935000
SCTSTSRT EQU   SCTSTEND                                                 04936000
@NM00176 EQU   INSMSCT+168                                              04937000
SCTSDPSA EQU   SCTCDENT+3                                               04938000
SCTSDPOP EQU   SCTCDENT+2                                               04939000
SCTSDPCD EQU   SCTCDENT                                                 04940000
@NM00175 EQU   INSMSCT+117                                              04941000
SCTPRFMF EQU   INSMSCT+116                                              04942000
SCTPGMNM EQU   INSMSCT+108                                              04943000
SCTTIOT  EQU   INSMSCT+105                                              04944000
@NM00174 EQU   SCTBCT                                                   04945000
SCTJBEND EQU   SCTBCT                                                   04946000
SCTSPSYS EQU   SCTBCT                                                   04947000
SCTSTPLB EQU   SCTBCT                                                   04948000
@NM00173 EQU   SCTBCT                                                   04949000
SCTMCVOL EQU   SCTBCT                                                   04950000
@NM00172 EQU   SCTBCT                                                   04951000
SCTGOTTR EQU   INSMSCT+100                                              04952000
SCTSMF   EQU   INSMSCT+96                                               04953000
@NM00171 EQU   SCTSDPTY+1                                               04954000
SCTSDP   EQU   SCTSDPTY                                                 04955000
SCTFSTEP EQU   SCTSDPTY                                                 04956000
@NM00170 EQU   SCTSDPTY                                                 04957000
@NM00169 EQU   SCTSDPTY                                                 04958000
SCTNIUSL EQU   INSMSCT+92                                               04959000
@NM00168 EQU   INSMSCT+90                                               04960000
SCTMSSZE EQU   INSMSCT+88                                               04961000
SCTLDSTB EQU   INSMSCT+80                                               04962000
SCTSRBT  EQU   INSMSCT+76                                               04963000
SCTMSADR EQU   INSMSCT+72                                               04964000
@NM00167 EQU   INSMSCT+71                                               04965000
SCTXBTTR EQU   INSMSCT+68                                               04966000
SCTJSCAT EQU   SCTSTYPE                                                 04967000
SCTINITB EQU   SCTSTYPE                                                 04968000
SCTSJFHK EQU   SCTSTYPE                                                 04969000
SCTOUTMC EQU   SCTSTYPE                                                 04970000
SCTINPUT EQU   SCTSTYPE                                                 04971000
SCTGOSTP EQU   SCTSTYPE                                                 04972000
@NM00166 EQU   INSMSCT+66                                               04973000
SCTNSMSG EQU   INSMSCT+65                                               04974000
@NM00165 EQU   INSMSCT+62                                               04975000
SCTRPACT EQU   INSMSCT+60                                               04976000
@NM00164 EQU   INSMSCT+43                                               04977000
SCTADSTB EQU   INSMSCT+40                                               04978000
@NM00163 EQU   INSMSCT+36                                               04979000
@NM00162 EQU   INSMSCT+35                                               04980000
SCTAFACT EQU   INSMSCT+32                                               04981000
SCTDDNT  EQU   INSMSCT+28                                               04982000
@NM00161 EQU   INSMSCT+27                                               04983000
@NM00160 EQU   INSMSCT+23                                               04984000
@NM00159 EQU   INSMSCT+19                                               04985000
SCTAALOC EQU   INSMSCT+16                                               04986000
@NM00158 EQU   INSMSCT+15                                               04987000
SCTFSIOT EQU   INSMSCT+12                                               04988000
SCTSEXEC EQU   INSMSCT+8                                                04989000
SCTSTIME EQU   INSMSCT+5                                                04990000
INCMSSTS EQU   SCTSSTAT                                                 04991000
SCTGRPH  EQU   SCTSSTAT                                                 04992000
SCTKEY0  EQU   SCTSSTAT                                                 04993000
SCTDORST EQU   SCTSSTAT                                                 04994000
SCTNOCKP EQU   SCTSSTAT                                                 04995000
SCTNORST EQU   SCTSSTAT                                                 04996000
EACAUSER EQU   SCTSSTAT                                                 04997000
EAADDRBT EQU   SCTSSTAT                                                 04998000
SCTTBLID EQU   INSMSCT+3                                                04999000
LCTLABEL EQU   LCT+504                                                  05000000
LCTIWORK EQU   LCT+440                                                  05001000
@NM00157 EQU   LCT+436                                                  05002000
LCTIMSG  EQU   LCT+432                                                  05003000
LCTLBWAP EQU   LCT+428                                                  05004000
@NM00156 EQU   LCT+424                                                  05005000
LCTATTC  EQU   LCTINTS2                                                 05006000
LCTTSWPC EQU   LCTINTS2                                                 05007000
LCTBPPAS EQU   LCTINTS2                                                 05008000
LCTSYS   EQU   LCTINTS2                                                 05009000
LCTTSIZ  EQU   @NM00155                                                 05010000
LCTRFB1  EQU   LCT+419                                                  05011000
@NM00154 EQU   LCTRFB                                                   05012000
LCTRFBRP EQU   LCTRFB                                                   05013000
LCTRFBEF EQU   LCTRFB                                                   05014000
LCTRFBMS EQU   LCTRFB                                                   05015000
LCTRFBDC EQU   LCTRFB                                                   05016000
LCTRFBRV EQU   LCTRFB                                                   05017000
LCTRFBCR EQU   LCTRFB                                                   05018000
LCTRFBSM EQU   LCTRFB                                                   05019000
LCTMFTIO EQU   LCTSTATB                                                 05020000
LCTNPKEY EQU   LCTSTATB                                                 05021000
LCTSBPOL EQU   LCTSTATB                                                 05022000
LCTNREAD EQU   LCTSTATB                                                 05023000
LCTWRITE EQU   LCTSTATB                                                 05024000
LCTNOATC EQU   LCTSTATB                                                 05025000
LCTNOREG EQU   LCTSTATB                                                 05026000
LCTECBPB EQU   LCTSTATB                                                 05027000
LCTCPART EQU   LCTSTATA                                                 05028000
LCTNOGCB EQU   LCTSTATA                                                 05029000
LCTNOSDP EQU   LCTSTATA                                                 05030000
LCTJCPIB EQU   LCTSTATA                                                 05031000
LCTNECBL EQU   LCTSTATA                                                 05032000
LCTBTJOB EQU   LCTSTATA                                                 05033000
LCTSNOWK EQU   LCTSTATA                                                 05034000
LCTSUSPD EQU   LCTSTATA                                                 05035000
LCTTIOTI EQU   LCT+412                                                  05036000
@NM00153 EQU   LCTJCTDA+3                                               05037000
LCTJCTVA EQU   LCTJCTDA                                                 05038000
LCTSSOBA EQU   LCT+404                                                  05039000
LCTSTEPL EQU   LCT+400                                                  05040000
@NM00152 EQU   LCT+364                                                  05041000
@NM00151 EQU   LCTJSCB+1                                                05042000
@NM00150 EQU   LCTOPSW3                                                 05043000
@NM00149 EQU   LCTOPSW3                                                 05044000
LCTALERR EQU   LCTOPSW3                                                 05045000
LCTJNLF  EQU   LCTOPSW3                                                 05046000
@NM00148 EQU   LCTOPSW3                                                 05047000
LCTNSYS  EQU   LCTOPSW3                                                 05048000
LCTRDER  EQU   LCTOPSW3                                                 05049000
@NM00147 EQU   LCTOPSW3                                                 05050000
@NM00146 EQU   @NM00142+1                                               05051000
LCTENQU  EQU   LCTOPSW2                                                 05052000
LCTNORC  EQU   LCTOPSW2                                                 05053000
LCTBPRAC EQU   LCTOPSW2                                                 05054000
@NM00145 EQU   LCTOPSW2                                                 05055000
@NM00144 EQU   LCTOPSW2                                                 05056000
@NM00143 EQU   LCTOPSW2                                                 05057000
LCTCRF   EQU   LCTOPSW2                                                 05058000
LCTTIMEF EQU   LCTOPSW2                                                 05059000
@NM00141 EQU   LCTEXIT+1                                                05060000
@NM00140 EQU   LCTOPSW1                                                 05061000
@NM00139 EQU   LCTOPSW1                                                 05062000
LCTONEJF EQU   LCTOPSW1                                                 05063000
LCTCANF  EQU   LCTOPSW1                                                 05064000
@NM00138 EQU   LCTOPSW1                                                 05065000
@NM00137 EQU   LCTOPSW1                                                 05066000
LCTDWFF  EQU   LCTOPSW1                                                 05067000
LCTDPSWA EQU   LCTOPSW1                                                 05068000
LCTTSRB3 EQU   LCTTSRB4+1                                               05069000
@NM00136 EQU   LCTTSRB4                                                 05070000
@NM00135 EQU   LCT+340                                                  05071000
@NM00134 EQU   LCTSPIL+3                                                05072000
@NM00133 EQU   LCTALCFG                                                 05073000
@NM00132 EQU   LCTALCFG                                                 05074000
@NM00131 EQU   LCTALCFG                                                 05075000
@NM00130 EQU   LCTALCFG                                                 05076000
@NM00129 EQU   LCTALCFG                                                 05077000
@NM00128 EQU   LCTALCFG                                                 05078000
LCTMSGWT EQU   LCTALCFG                                                 05079000
LCTODSFL EQU   LCTALCFG                                                 05080000
LCTDSBCT EQU   LCTSPIL                                                  05081000
LCTPIB   EQU   LCTIDENT                                                 05082000
@NM00127 EQU   ECBLIST+1                                                05083000
@NM00126 EQU   ECBLIST                                                  05084000
LCTJMRAD EQU   LCT+324                                                  05085000
@NM00125 EQU   LCT+284                                                  05086000
QMGR1    EQU   LCT+248                                                  05087000
REGSAVE  EQU   LCT+104                                                  05088000
@NM00124 EQU   LCTATLST+1                                               05089000
@NM00123 EQU   LCTATLST                                                 05090000
@NM00122 EQU   LCTJOBLB+1                                               05091000
@NM00121 EQU   LCTJOBLB                                                 05092000
LCTTSTU3 EQU   LCTTSTU4+1                                               05093000
@NM00120 EQU   LCTTSTU4                                                 05094000
LCTTSTR3 EQU   LCTSMF+1                                                 05095000
LCTTTIFJ EQU   LCTTMBYT                                                 05096000
LCTTSTL3 EQU   LCTTSTL4+1                                               05097000
@NM00119 EQU   LCTTSTL4                                                 05098000
LCTTJTU3 EQU   LCTTJTU4+1                                               05099000
@NM00118 EQU   LCTTJTU4                                                 05100000
@NM00117 EQU   @NM00112+2                                               05101000
@NM00116 EQU   LCTPUBYT                                                 05102000
@NM00115 EQU   LCTPUBYT                                                 05103000
@NM00114 EQU   LCTPUBYT                                                 05104000
@NM00113 EQU   LCTPUBYT                                                 05105000
LCTNSWP  EQU   LCTPUBYT                                                 05106000
LCTN2LP  EQU   LCTPUBYT                                                 05107000
LCT1LPU  EQU   LCTPUBYT                                                 05108000
LCT2LPU  EQU   LCTPUBYT                                                 05109000
LCTNDSI  EQU   LCTINTSW                                                 05110000
LCTABEND EQU   LCTINTSW                                                 05111000
LCTSTOP  EQU   LCTINTSW                                                 05112000
LCTSTART EQU   LCTINTSW                                                 05113000
LCTMINRG EQU   LCTINTSW                                                 05114000
LCTPPAA  EQU   LCTINTSW                                                 05115000
LCTPRIV  EQU   LCTINTSW                                                 05116000
LCTINPPT EQU   LCTINTSW                                                 05117000
@NM00111 EQU   LCTSREG+1                                                05118000
@NM00110 EQU   LCTSREG                                                  05119000
LCTCOMD2 EQU   LCTCOMCD+2                                               05120000
LCTCOMD1 EQU   LCTCOMCD                                                 05121000
LCTBATMN EQU   LCT+64                                                   05122000
@NM00109 EQU   LCTSMBAD+1                                               05123000
@NM00108 EQU   LCTSMBAD                                                 05124000
LCTACTON EQU   LCT+59                                                   05125000
LCTSNUMB EQU   LCT+58                                                   05126000
@NM00107 EQU   LCTJFCBH                                                 05127000
@NM00106 EQU   LCTJFCBH                                                 05128000
@NM00105 EQU   LCTJFCBH                                                 05129000
@NM00104 EQU   LCTJFCBH                                                 05130000
@NM00103 EQU   LCTJFCBH                                                 05131000
LCTS2FES EQU   LCTJFCBH                                                 05132000
LCTS2COP EQU   LCTJFCBH                                                 05133000
LCTS2PEM EQU   LCTJFCBH                                                 05134000
LCTSTIND EQU   LCTNSPAD                                                 05135000
@NM00102 EQU   LCTCMCBA+1                                               05136000
@NM00101 EQU   LCTCMCBA                                                 05137000
LCTPARM4 EQU   LCT+48                                                   05138000
LCTPARM3 EQU   LCT+44                                                   05139000
LCTPARM2 EQU   LCT+40                                                   05140000
LCTACOMP EQU   LCTERR                                                   05141000
@NM00100 EQU   LCTPSPAR+1                                               05142000
@NM00099 EQU   LCTPSPAR                                                 05143000
@NM00098 EQU   LCTWORKA+3                                               05144000
@NM00097 EQU   LCTSCTAD+1                                               05145000
@NM00096 EQU   LCTSCTAD                                                 05146000
@NM00095 EQU   LCTJCTAD+1                                               05147000
@NM00094 EQU   LCTJCTAD                                                 05148000
@NM00093 EQU   LCTQENTY+1                                               05149000
@NM00092 EQU   @NM00085                                                 05150000
@NM00091 EQU   @NM00085                                                 05151000
@NM00090 EQU   @NM00085                                                 05152000
@NM00089 EQU   @NM00085                                                 05153000
@NM00088 EQU   @NM00085                                                 05154000
@NM00087 EQU   @NM00085                                                 05155000
@NM00086 EQU   @NM00085                                                 05156000
@NM00084 EQU   LCTTCBAD+1                                               05157000
@NM00083 EQU   LCTTCBAD                                                 05158000
@NM00082 EQU   LCTSRTAD+1                                               05159000
@NM00081 EQU   LCTSRTAD                                                 05160000
@NM00080 EQU   LCTQDRTY+1                                               05161000
@NM00079 EQU   LCTQDRTY                                                 05162000
ACTACCNT EQU   IEFAACTB+32                                              05163000
ACTJNFLD EQU   IEFAACTB+31                                              05164000
ACTJTIME EQU   IEFAACTB+28                                              05165000
ACTPRGNM EQU   IEFAACTB+8                                               05166000
@NM00078 EQU   IEFAACTB+7                                               05167000
ACTNEXT  EQU   IEFAACTB+4                                               05168000
ACTIDENT EQU   IEFAACTB+3                                               05169000
ACTDSKAD EQU   IEFAACTB                                                 05170000
@NM00077 EQU   INJMJCT+175                                              05171000
JCTACODE EQU   INJMJCT+168                                              05172000
JCTPRFMF EQU   INJMJCT+167                                              05173000
JCTUSER  EQU   INJMJCT+160                                              05174000
JCTSSD   EQU   INJMJCT+157                                              05175000
@NM00076 EQU   INJMJCT+156                                              05176000
JCTSRBT  EQU   INJMJCT+152                                              05177000
JCTJMRJD EQU   INJMJCT+149                                              05178000
JCTJMRJT EQU   INJMJCT+146                                              05179000
JCTJMRSS EQU   INJMJCT+143                                              05180000
JCTJMRTL EQU   INJMJCT+140                                              05181000
JCTJMRCL EQU   INJMJCT+139                                              05182000
JCTJMROP EQU   INJMJCT+138                                              05183000
JCTJMRD  EQU   INJMJCT+137                                              05184000
JCTJMR   EQU   INJMJCT+134                                              05185000
JCTCKIDT EQU   INJMJCT+118                                              05186000
JCTCKIDL EQU   INJMJCT+117                                              05187000
@NM00075 EQU   JCTSTAT2                                                 05188000
JCTBLP   EQU   JCTSTAT2                                                 05189000
JCTPERFM EQU   JCTSTAT2                                                 05190000
JCTENDIT EQU   JCTSTAT2                                                 05191000
JCTADSPC EQU   JCTSTAT2                                                 05192000
JCTSPSYS EQU   JCTSTAT2                                                 05193000
@NM00074 EQU   INJMJCT+115                                              05194000
JCTSSTR  EQU   INJMJCT+112                                              05195000
JCTJSBTM EQU   JCTJSB                                                   05196000
JCTJSBEX EQU   JCTJSB                                                   05197000
JCTJSBIN EQU   JCTJSB                                                   05198000
@NM00073 EQU   JCTJSB                                                   05199000
JCTVOLSQ EQU   INJMJCT+110                                              05200000
JCTNRCKP EQU   INJMJCT+108                                              05201000
JCTNTRK  EQU   INJMJCT+107                                              05202000
JCTCKTTR EQU   INJMJCT+104                                              05203000
JCTDEVT  EQU   INJMJCT+100                                              05204000
@NM00072 EQU   INJMJCT+99                                               05205000
JCTSTIOT EQU   INJMJCT+96                                               05206000
JCTSNUMB EQU   INJMJCT+95                                               05207000
JCTQIDNT EQU   INJMJCT+94                                               05208000
JCTEQREG EQU   INJMJCT+92                                               05209000
@NM00071 EQU   INJMJCT+91                                               05210000
JCTDSDRA EQU   JCTRSW2                                                  05211000
JCTDSOJB EQU   JCTRSW2                                                  05212000
JCTDSOCR EQU   JCTRSW2                                                  05213000
JCTRESTT EQU   JCTRSW2                                                  05214000
JCTNOCKP EQU   JCTRSW2                                                  05215000
JCTNORST EQU   JCTRSW2                                                  05216000
JCTNARST EQU   JCTRSW2                                                  05217000
JCTSYSCK EQU   JCTRSW2                                                  05218000
@NM00070 EQU   JCTRSW1                                                  05219000
JCTSTERM EQU   JCTRSW1                                                  05220000
@NM00069 EQU   JCTCCODE+3                                               05221000
JCTJDPOP EQU   JCTCCODE+2                                               05222000
JCTJDPCD EQU   JCTCCODE                                                 05223000
@NM00068 EQU   INJMJCT+53                                               05224000
JCTSCT   EQU   INJMJCT+52                                               05225000
JCTSMRBA EQU   INJMJCT+44                                               05226000
@NM00067 EQU   INJMJCT+43                                               05227000
JCTACTAD EQU   INJMJCT+40                                               05228000
@NM00066 EQU   INJMJCT+39                                               05229000
JCTJCTX  EQU   INJMJCT+36                                               05230000
@NM00065 EQU   INJMJCT+35                                               05231000
JCTSDKAD EQU   INJMJCT+32                                               05232000
JCTJCSMF EQU   INJMJCT+31                                               05233000
JCTGDGNT EQU   INJMJCT+28                                               05234000
@NM00064 EQU   INJMJCT+27                                               05235000
JCTPDIP  EQU   INJMJCT+24                                               05236000
JCTJTPTN EQU   INJMJCT+16                                               05237000
JCTJPRTY EQU   JCTJBYTE                                                 05238000
INCMMGL1 EQU   JCTJMGLV                                                 05239000
INCMMGL2 EQU   JCTJMGLV                                                 05240000
@NM00063 EQU   JCTJMGLV                                                 05241000
JCTJMGPO EQU   INJMJCT+6                                                05242000
INCMNSET EQU   JCTJSTAT                                                 05243000
INCMCAT  EQU   INDMCTLG                                                 05244000
INCMSTS  EQU   JCTJSTAT                                                 05245000
@NM00062 EQU   JCTJSTAT                                                 05246000
JCTJSTPC EQU   JCTJSTAT                                                 05247000
@NM00061 EQU   JCTJSTAT                                                 05248000
JCTJBLBS EQU   JCTJSTAT                                                 05249000
JCTJSRNO EQU   INJMJCT+4                                                05250000
JCTIDENT EQU   INJMJCT+3                                                05251000
JCTDSKAD EQU   INJMJCT                                                  05252000
CHARSV16 EQU   CHSHORT+100                                              05253000
CHARSV15 EQU   CHSHORT+96                                               05254000
CHJSCBVS EQU   CHSHORT+92                                               05255000
CHUSCVS  EQU   CHSHORT+88                                               05256000
@NM00059 EQU   CHSHORT+84                                               05257000
@NM00058 EQU   CHSHORT+80                                               05258000
CHSQA    EQU   CHSHORT+44                                               05259000
CHQPA    EQU   CHSHORT+8                                                05260000
CHJCL    EQU   CHSHORT+4                                                05261000
CHSPC    EQU   CHSHORT                                                  05262000
CHSPB    EQU   CHSTEP+4                                                 05263000
CHTCB    EQU   CHSTEP+1                                                 05264000
CHARSV23 EQU   CHSWT                                                    05265000
CHARSV22 EQU   CHSWT                                                    05266000
CHARSV21 EQU   CHSWT                                                    05267000
CHAC     EQU   CHSWT                                                    05268000
CHPSF    EQU   CHSWT                                                    05269000
CHPSD    EQU   CHSWT                                                    05270000
CHJCT    EQU   CHSWT                                                    05271000
CHARSV20 EQU   CHSWT                                                    05272000
CHCECB   EQU   CHASM+20                                                 05273000
CHECB    EQU   CHASM+16                                                 05274000
CHRGNAD  EQU   CHASM+12                                                 05275000
CHARSV18 EQU   CHRGNSZ+1                                                05276000
CHRPRTY  EQU   CHRGNSZ                                                  05277000
@NM00057 EQU   CHCIBP                                                   05278000
CHEND    EQU   CHCIBP                                                   05279000
CHECBP   EQU   CHASM                                                    05280000
CHDER    EQU   CHPROCSN+4                                               05281000
CHARSV10 EQU   CHACT1                                                   05282000
CHARSV09 EQU   CHACT1                                                   05283000
CHARSV08 EQU   CHACT1                                                   05284000
CHARSV07 EQU   CHACT1                                                   05285000
CHARSV06 EQU   CHACT1                                                   05286000
CHARSV05 EQU   CHACT1                                                   05287000
CHARSV04 EQU   CHACT1                                                   05288000
CHRDWTR  EQU   CHACT1                                                   05289000
CHARSV30 EQU   CHPROCSN+2                                               05290000
CHQID    EQU   CHPROCSN                                                 05291000
CHASID   EQU   CHTJID                                                   05292000
CHUCMP   EQU   CHAIN+29                                                 05293000
CHCIBCTR EQU   CHAIN+27                                                 05294000
CHUNIT   EQU   CHAIN+24                                                 05295000
CHCLS    EQU   CHAIN+16                                                 05296000
CHPCOI   EQU   CHPARM                                                   05297000
CHIFY    EQU   CHACT                                                    05298000
CHAIFX   EQU   CHACT                                                    05299000
CHCL     EQU   CHACT                                                    05300000
CHDSI    EQU   CHACT                                                    05301000
CHDISC   EQU   CHACT                                                    05302000
CHTERM   EQU   CHACT                                                    05303000
CHSWAP   EQU   CHACT                                                    05304000
CHABTERM EQU   CHSTS                                                    05305000
CHFC     EQU   CHSTS                                                    05306000
CHDL     EQU   CHSTS                                                    05307000
CHAD     EQU   CHSTS                                                    05308000
CHQSPC   EQU   CHSTS                                                    05309000
CHSOUT   EQU   CHSTS                                                    05310000
CHSYS    EQU   CHSTS                                                    05311000
CHAP     EQU   CHSTS                                                    05312000
CHSZE    EQU   CHFLG+1                                                  05313000
CHVCD    EQU   CHFLG                                                    05314000
CHPTR    EQU   CHAIN                                                    05315000
MSSPARE  EQU   BASES01+48                                               05316000
MSUCBAL  EQU   BASES01+44                                               05317000
MSUCBPR  EQU   BASES01+40                                               05318000
MSBOBECB EQU   BASES01+36                                               05319000
MSSJQ    EQU   BASES01+32                                               05320000
MSECB    EQU   BASES01+28                                               05321000
MSPBP    EQU   BASES01+24                                               05322000
MSERM    EQU   BASES01+22                                               05323000
MSPASS   EQU   BASES01+14                                               05324000
MSVRB    EQU   BASES01+6                                                05325000
MSQHR    EQU   MSFHF                                                    05326000
@NM00056 EQU   MSFHF                                                    05327000
MSPSDT   EQU   MSFHF                                                    05328000
MSREPLYB EQU   MSFHF                                                    05329000
MSFAX    EQU   MSFHF                                                    05330000
MSTTT    EQU   MSFHF                                                    05331000
MSCSD    EQU   MSFHF                                                    05332000
MSNMF    EQU   MSFHF                                                    05333000
MSJNF    EQU   MSSSA                                                    05334000
MSYOUT   EQU   MSNWP                                                    05335000
MSNRP    EQU   MSSSA                                                    05336000
MSSRDR   EQU   MSREOF                                                   05337000
MSWRLOG  EQU   MSSSA                                                    05338000
MSNUPSW  EQU   MSSSA                                                    05339000
MSWRPEN  EQU   MSSSA                                                    05340000
MSSSSIPL EQU   MSINLSW                                                  05341000
MSSUM    EQU   MSECBFL                                                  05342000
MSMCR    EQU   MSECBFL                                                  05343000
MSYSOUT  EQU   MSECBFL                                                  05344000
MSYSIN   EQU   MSECBFL                                                  05345000
MSATTN   EQU   MSECBFL                                                  05346000
MSWTL    EQU   MSECBFL                                                  05347000
MSWTO    EQU   MSECBFL                                                  05348000
MSEXT    EQU   MSECBFL                                                  05349000
MSCCS    EQU   MSPFG                                                    05350000
MSBSP    EQU   MSPFG                                                    05351000
MSSYT    EQU   MSPFG                                                    05352000
MSSYN    EQU   MSPFG                                                    05353000
MSICR    EQU   MSPFG                                                    05354000
MSCMC    EQU   MSPFG                                                    05355000
MSPNB    EQU   MSPFG                                                    05356000
MSDATE   EQU   MSPFG                                                    05357000
@NM00055 EQU   MSBTN                                                    05358000
@NM00054 EQU   MSBTN                                                    05359000
@NM00053 EQU   MSBTN                                                    05360000
MSSO     EQU   MSBTN                                                    05361000
MSROLFLG EQU   MSBTN                                                    05362000
MSCANFLG EQU   MSBTN                                                    05363000
MSCONFLG EQU   MSBTN                                                    05364000
MSPNIP   EQU   MSNTAL                                                   05365000
MSQNIP   EQU   MSNTAL                                                   05366000
MSCURE34 EQU   MSNTAL                                                   05367000
@NM00052 EQU   MSNTAL                                                   05368000
@NM00051 EQU   MSNTAL                                                   05369000
@NM00050 EQU   MSNTAL                                                   05370000
@NM00049 EQU   MSNTAL                                                   05371000
MSNIP    EQU   MSNTAL                                                   05372000
@NM00048 EQU   MS1BASEX+40                                              05373000
@NM00047 EQU   MS1BASEX+20                                              05374000
@NM00046 EQU   MS1BASEX                                                 05375000
@NM00045 EQU   BASE+128                                                 05376000
MSLGJSCB EQU   BASE+124                                                 05377000
@NM00044 EQU   MSSTRTSW                                                 05378000
MSSTRTP  EQU   MSSTRTSW                                                 05379000
MSSTRTW  EQU   MSSTRTSW                                                 05380000
@NM00043 EQU   MSWTRSW                                                  05381000
MSWTRP   EQU   MSWTRSW                                                  05382000
MSWTRW   EQU   MSWTRSW                                                  05383000
@NM00042 EQU   MSWLOGSW                                                 05384000
MSWLOGP  EQU   MSWLOGSW                                                 05385000
MSWLOGW  EQU   MSWLOGSW                                                 05386000
@NM00041 EQU   MSCLOSSW                                                 05387000
MSCLOSP  EQU   MSCLOSSW                                                 05388000
MSCLOSW  EQU   MSCLOSSW                                                 05389000
MSLOGLMT EQU   @NM00040+1                                               05390000
MSLOGCLS EQU   @NM00040                                                 05391000
BAASCB   EQU   BASE+100                                                 05392000
MSSMFPRM EQU   BASE+96                                                  05393000
MSCOMMND EQU   BASE+92                                                  05394000
BASP12   EQU   BASE+90                                                  05395000
BASUBECB EQU   BASE+80                                                  05396000
BALOGCOM EQU   BASE+76                                                  05397000
BADACNT  EQU   BASE+74                                                  05398000
BATACNT  EQU   BASE+72                                                  05399000
BAJBNR   EQU   BASE+64                                                  05400000
BASP11   EQU   BASE+62                                                  05401000
BALCCNT  EQU   BASE+61                                                  05402000
BADUMPID EQU   BASE+60                                                  05403000
BABCMAX  EQU   BASE+58                                                  05404000
BAMONTR2 EQU   BASE+57                                                  05405000
@NM00039 EQU   BAMONITR                                                 05406000
BAMACTVE EQU   BAMONITR                                                 05407000
@NM00038 EQU   BAMONITR                                                 05408000
@NM00037 EQU   BAMONITR                                                 05409000
@NM00036 EQU   BAMONITR                                                 05410000
@NM00035 EQU   BAMONITR                                                 05411000
BASPACE  EQU   BAMONITR                                                 05412000
BADSN    EQU   BAMONITR                                                 05413000
BADSO    EQU   BASE+52                                                  05414000
BALOGECB EQU   BASE+48                                                  05415000
@NM00034 EQU   BASPBYTE                                                 05416000
@NM00033 EQU   BASPBYTE                                                 05417000
@NM00032 EQU   BASPBYTE                                                 05418000
@NM00031 EQU   BASPBYTE                                                 05419000
@NM00030 EQU   BASPBYTE                                                 05420000
BAMASCH  EQU   BASPBYTE                                                 05421000
BATRACE  EQU   BASPBYTE                                                 05422000
BAMSSTAR EQU   BASPBYTE                                                 05423000
@NM00029 EQU   MSLOGST                                                  05424000
@NM00028 EQU   MSLOGST                                                  05425000
MSLOGSTA EQU   MSLOGST                                                  05426000
MSLOGIPL EQU   MSLOGST                                                  05427000
MSLOGDAR EQU   MSLOGST                                                  05428000
MSLOGCOM EQU   MSLOGST                                                  05429000
MSLOGTHD EQU   MSLOGST                                                  05430000
MSLOGENQ EQU   MSLOGST                                                  05431000
BAMIPAR2 EQU   BASE+44                                                  05432000
BAMINPAR EQU   BASE+42                                                  05433000
BAPKES   EQU   BASE+40                                                  05434000
BAICTR   EQU   BASE+38                                                  05435000
@NM00027 EQU   BASE+37                                                  05436000
BADSET   EQU   BARSW                                                    05437000
BANOSET  EQU   BARSW                                                    05438000
BAMIDNT  EQU   BARSW                                                    05439000
BAHR     EQU   BARSW                                                    05440000
BAVU     EQU   BARSW                                                    05441000
BAINTSET EQU   BARSW                                                    05442000
MSTODWTO EQU   BARSW                                                    05443000
BAIN     EQU   BARSW                                                    05444000
BACV     EQU   BASE+32                                                  05445000
@NM00026 EQU   BALOG                                                    05446000
@NM00025 EQU   BALOG                                                    05447000
@NM00024 EQU   BALOG                                                    05448000
@NM00023 EQU   BALOG                                                    05449000
@NM00022 EQU   BALOG                                                    05450000
@NM00021 EQU   BALOG                                                    05451000
@NM00020 EQU   BALOG                                                    05452000
BALOGINT EQU   BALOG                                                    05453000
MSLOGSVC EQU   BALGSTAT                                                 05454000
BAPRC    EQU   BASE+20                                                  05455000
BAQ      EQU   BASE+16                                                  05456000
BAIPLCC  EQU   @NM00018+2                                               05457000
@NM00019 EQU   @NM00018                                                 05458000
BAIPL    EQU   BASE+12                                                  05459000
BALAD    EQU   BASE+8                                                   05460000
BATRM    EQU   BASE+4                                                   05461000
BACHN    EQU   BASE                                                     05462000
CVTLEVL  EQU   CVTRELNO+2                                               05463000
CVTNUMB  EQU   CVTRELNO                                                 05464000
CVTMDL   EQU   CVTFIX+250                                               05465000
@NM00017 EQU   CVTFIX+248                                               05466000
@NM00016 EQU   CVTFIX                                                   05467000
CVTRV482 EQU   CVTXTNT2+128                                             05468000
CVTRV481 EQU   CVTXTNT2+124                                             05469000
CVTRV480 EQU   CVTXTNT2+120                                             05470000
CVTRV479 EQU   CVTXTNT2+118                                             05471000
CVTRV478 EQU   CVTXTNT2+117                                             05472000
CVTRV477 EQU   CVTXTNT2+116                                             05473000
CVTRV476 EQU   CVTXTNT2+115                                             05474000
CVTRV475 EQU   CVTXTNT2+114                                             05475000
CVTRV474 EQU   CVTRV466                                                 05476000
CVTRV473 EQU   CVTRV466                                                 05477000
CVTRV472 EQU   CVTRV466                                                 05478000
CVTRV471 EQU   CVTRV466                                                 05479000
CVTRV470 EQU   CVTRV466                                                 05480000
CVTRV469 EQU   CVTRV466                                                 05481000
CVTRV468 EQU   CVTRV466                                                 05482000
CVTRV467 EQU   CVTRV466                                                 05483000
CVTRV465 EQU   CVTRV457                                                 05484000
CVTRV464 EQU   CVTRV457                                                 05485000
CVTRV463 EQU   CVTRV457                                                 05486000
CVTRV462 EQU   CVTRV457                                                 05487000
CVTRV461 EQU   CVTRV457                                                 05488000
CVTRV460 EQU   CVTRV457                                                 05489000
CVTRV459 EQU   CVTRV457                                                 05490000
CVTRV458 EQU   CVTRV457                                                 05491000
CVTRV456 EQU   CVTXTNT2+108                                             05492000
CVTRV455 EQU   CVTXTNT2+104                                             05493000
CVTRV454 EQU   CVTXTNT2+100                                             05494000
CVTRV453 EQU   CVTXTNT2+96                                              05495000
CVTRV452 EQU   CVTXTNT2+94                                              05496000
CVTRV451 EQU   CVTXTNT2+92                                              05497000
CVTRV450 EQU   CVTXTNT2+90                                              05498000
CVTRV449 EQU   CVTXTNT2+88                                              05499000
CVTRV448 EQU   CVTXTNT2+87                                              05500000
CVTRV447 EQU   CVTXTNT2+86                                              05501000
CVTRV446 EQU   CVTRV438                                                 05502000
CVTRV445 EQU   CVTRV438                                                 05503000
CVTRV444 EQU   CVTRV438                                                 05504000
CVTRV443 EQU   CVTRV438                                                 05505000
CVTRV442 EQU   CVTRV438                                                 05506000
CVTRV441 EQU   CVTRV438                                                 05507000
CVTRV440 EQU   CVTRV438                                                 05508000
CVTRV439 EQU   CVTRV438                                                 05509000
CVTRV437 EQU   CVTRV429                                                 05510000
CVTRV436 EQU   CVTRV429                                                 05511000
CVTRV435 EQU   CVTRV429                                                 05512000
CVTRV434 EQU   CVTRV429                                                 05513000
CVTRV433 EQU   CVTRV429                                                 05514000
CVTRV432 EQU   CVTRV429                                                 05515000
CVTRV431 EQU   CVTRV429                                                 05516000
CVTRV430 EQU   CVTRV429                                                 05517000
CVTRV428 EQU   CVTXTNT2+80                                              05518000
CVTRV427 EQU   CVTXTNT2+76                                              05519000
CVTRV426 EQU   CVTXTNT2+72                                              05520000
CVTRV425 EQU   CVTXTNT2+68                                              05521000
CVTATACT EQU   CVTATCVT                                                 05522000
CVTRV423 EQU   CVTXTNT2+62                                              05523000
CVTRV422 EQU   CVTXTNT2+60                                              05524000
CVTRV421 EQU   CVTXTNT2+58                                              05525000
CVTRV420 EQU   CVTXTNT2+56                                              05526000
CVTRV419 EQU   CVTXTNT2+55                                              05527000
CVTRV418 EQU   CVTXTNT2+54                                              05528000
CVTRV417 EQU   CVTRV409                                                 05529000
CVTRV416 EQU   CVTRV409                                                 05530000
CVTRV415 EQU   CVTRV409                                                 05531000
CVTRV414 EQU   CVTRV409                                                 05532000
CVTRV413 EQU   CVTRV409                                                 05533000
CVTRV412 EQU   CVTRV409                                                 05534000
CVTRV411 EQU   CVTRV409                                                 05535000
CVTRV410 EQU   CVTRV409                                                 05536000
CVTRV408 EQU   CVTRV400                                                 05537000
CVTRV407 EQU   CVTRV400                                                 05538000
CVTRV406 EQU   CVTRV400                                                 05539000
CVTRV405 EQU   CVTRV400                                                 05540000
CVTRV404 EQU   CVTRV400                                                 05541000
CVTRV403 EQU   CVTRV400                                                 05542000
CVTRV402 EQU   CVTRV400                                                 05543000
CVTRV401 EQU   CVTRV400                                                 05544000
CVTICB   EQU   CVTXTNT2+48                                              05545000
CVTSKTA  EQU   CVTXTNT2+44                                              05546000
CVTRSV99 EQU   CVTXTNT2+40                                              05547000
CVTRSV98 EQU   CVTXTNT2+36                                              05548000
CVTRSV97 EQU   CVTXTNT2+34                                              05549000
CVTRSV96 EQU   CVTXTNT2+32                                              05550000
CVTOLTEP EQU   CVTXTNT2+28                                              05551000
CVTQIDA  EQU   CVTQID+1                                                 05552000
CVTRSV95 EQU   CVTQID                                                   05553000
CVTRSV94 EQU   CVTXTNT2+20                                              05554000
CVTRSV93 EQU   CVTXTNT2+16                                              05555000
CVTRSV92 EQU   CVTXTNT2+12                                              05556000
CVTDEBVR EQU   CVTXTNT2+8                                               05557000
CVTRSV91 EQU   CVTXTNT2+6                                               05558000
CVTRSV9H EQU   CVTFLGBT                                                 05559000
CVTRSV9G EQU   CVTFLGBT                                                 05560000
CVTRSV9F EQU   CVTFLGBT                                                 05561000
CVTRSV9E EQU   CVTFLGBT                                                 05562000
CVTRSV9D EQU   CVTFLGBT                                                 05563000
CVTRSV9C EQU   CVTFLGBT                                                 05564000
CVTVME   EQU   CVTFLGBT                                                 05565000
CVTNPE   EQU   CVTFLGBT                                                 05566000
CVTNUCLS EQU   CVTXTNT2+4                                               05567000
CVTDSSVA EQU   CVTDSSV+1                                                05568000
CVTRSV89 EQU   CVTDSSV                                                  05569000
CVTRSV88 EQU   CVTXTNT1+8                                               05570000
CVTRSV87 EQU   CVTXTNT1+4                                               05571000
CVTFACHN EQU   CVTXTNT1                                                 05572000
CVTRV488 EQU   CVTMAP+412                                               05573000
CVTRV487 EQU   CVTMAP+408                                               05574000
CVTRV486 EQU   CVTMAP+404                                               05575000
CVTRV485 EQU   CVTMAP+400                                               05576000
CVTACTAP EQU   CVTMAP+396                                               05577000
CVTAUTH  EQU   CVTMAP+392                                               05578000
CVTATMCA EQU   CVTATMCT+1                                               05579000
CVTATMST EQU   CVTATMCT                                                 05580000
CVTRSV61 EQU   CVTMAP+384                                               05581000
CVTVOLT1 EQU   CVTVOLM1+1                                               05582000
CVTVOLI1 EQU   CVTVOLF1                                                 05583000
CVTSTOA  EQU   CVTMAP+376                                               05584000
CVTRSV58 EQU   CVTMAP+374                                               05585000
CVTRSV57 EQU   CVTMAP+372                                               05586000
CVTDDCE  EQU   CVTMAP+368                                               05587000
CVTPNWFR EQU   CVTMAP+364                                               05588000
CVTSMF   EQU   CVTMAP+360                                               05589000
CVTSULK  EQU   CVTMAP+358                                               05590000
CVTSLKO  EQU   CVTSYSK                                                  05591000
CVTSLKP  EQU   CVTSYSK                                                  05592000
CVTSLKQ  EQU   CVTSYSK                                                  05593000
CVTSLKR  EQU   CVTSYSK                                                  05594000
CVTRSV56 EQU   CVTSYSK                                                  05595000
CVTRSV55 EQU   CVTSYSK                                                  05596000
CVTRSV54 EQU   CVTSYSK                                                  05597000
CVTRSV53 EQU   CVTSYSK                                                  05598000
CVTRSV52 EQU   CVTA1F1                                                  05599000
CVTRSV51 EQU   CVTA1F1                                                  05600000
CVTRSV50 EQU   CVTA1F1                                                  05601000
CVTRSV49 EQU   CVTA1F1                                                  05602000
CVTRSV48 EQU   CVTA1F1                                                  05603000
CVTRSV47 EQU   CVTA1F1                                                  05604000
CVTSRSW  EQU   CVTA1F1                                                  05605000
CVTPFSW  EQU   CVTA1F1                                                  05606000
CVTPCVT  EQU   CVTMAP+352                                               05607000
CVTRSV46 EQU   CVTMAP+344                                               05608000
CVTRSV45 EQU   CVTMAP+340                                               05609000
CVTRSV44 EQU   CVTMAP+338                                               05610000
CVTRSV43 EQU   CVTMAP+336                                               05611000
CVTHJESA EQU   CVTHJES+1                                                05612000
CVTRSV42 EQU   CVTHJES                                                  05613000
CVTEXT2A EQU   CVTEXT2+1                                                05614000
CVTRSV41 EQU   CVTEXT2                                                  05615000
CVTAPFA  EQU   CVTAPF+1                                                 05616000
CVTRSV40 EQU   CVTAPF                                                   05617000
CVTRV518 EQU   CVTINTLA                                                 05618000
CVTRV517 EQU   CVTERPV                                                  05619000
CVTEORM  EQU   CVTMAP+312                                               05620000
CVTMCHPR EQU   CVTMAP+308                                               05621000
CVTTZ    EQU   CVTMAP+304                                               05622000
CVTJEPS  EQU   CVTMAP+300                                               05623000
CVTJESCT EQU   CVTMAP+296                                               05624000
CVTMODE  EQU   CVTMAP+292                                               05625000
CVTPTRV  EQU   CVTMAP+288                                               05626000
CVTREAL  EQU   CVTMAP+284                                               05627000
CVTRSV39 EQU   CVTMAP+280                                               05628000
CVTRSV38 EQU   CVTMAP+276                                               05629000
CVTDMSRA EQU   CVTDMSR+1                                                05630000
CVTRV634 EQU   CVTDMSRF                                                 05631000
CVTRV633 EQU   CVTDMSRF                                                 05632000
CVTRV632 EQU   CVTDMSRF                                                 05633000
CVTRV631 EQU   CVTDMSRF                                                 05634000
CVTRV630 EQU   CVTDMSRF                                                 05635000
CVTRV629 EQU   CVTDMSRF                                                 05636000
CVTUDUMP EQU   CVTDMSRF                                                 05637000
CVTSDUMP EQU   CVTDMSRF                                                 05638000
CVTQMSGA EQU   CVTQMSG+1                                                05639000
CVTRSV36 EQU   CVTQMSG                                                  05640000
CVTAMFF  EQU   CVTMAP+264                                               05641000
CVTPURGA EQU   CVTPURG+1                                                05642000
CVTRSV35 EQU   CVTPURG                                                  05643000
CVTCBSP  EQU   CVTMAP+256                                               05644000
CVTATERA EQU   CVTATER+1                                                05645000
CVTSYST  EQU   CVTATER                                                  05646000
CVTVOLT2 EQU   CVTTAT                                                   05647000
CVTVOLI2 EQU   CVTVOLF2                                                 05648000
CVTAQAVB EQU   CVTAQAVT+1                                               05649000
CVTRSV34 EQU   CVTTCMFG                                                 05650000
CVTRSV33 EQU   CVTTCMFG                                                 05651000
CVTRSV32 EQU   CVTTCMFG                                                 05652000
CVTRSV31 EQU   CVTTCMFG                                                 05653000
CVTRSV30 EQU   CVTTCMFG                                                 05654000
CVTRSV29 EQU   CVTTCMFG                                                 05655000
CVTLDEV  EQU   CVTTCMFG                                                 05656000
CVTTCRDY EQU   CVTTCMFG                                                 05657000
CVTGTFA  EQU   CVTGTF+1                                                 05658000
CVTRSV27 EQU   CVTGTFST                                                 05659000
CVTRNIO  EQU   CVTGTFST                                                 05660000
CVTUSR   EQU   CVTGTFST                                                 05661000
CVTRV318 EQU   CVTFORM                                                  05662000
CVTRV317 EQU   CVTTMODE                                                 05663000
CVTRV316 EQU   CVTSTATE                                                 05664000
CVTRV315 EQU   CVTGTFS                                                  05665000
CVTGTFAV EQU   CVTGTFS                                                  05666000
CVT0SCR1 EQU   CVTMAP+232                                               05667000
CVTRV515 EQU   CVTMAP+228                                               05668000
CVTRMS   EQU   CVTMAP+224                                               05669000
CVTPATCH EQU   CVTMAP+220                                               05670000
CVTTSCE  EQU   CVTMAP+216                                               05671000
CVTLNKSC EQU   CVTMAP+214                                               05672000
CVTQABST EQU   CVTMAP+212                                               05673000
CVTMDLDS EQU   CVTMAP+208                                               05674000
CVTUSER  EQU   CVTMAP+204                                               05675000
CVTABEND EQU   CVTMAP+200                                               05676000
CVTSMCA  EQU   CVTMAP+196                                               05677000
CVTRSV18 EQU   CVTMAP+192                                               05678000
CVTQLPAQ EQU   CVTMAP+188                                               05679000
CVTQCDSR EQU   CVTMAP+184                                               05680000
CVTRSV17 EQU   CVTOPTB                                                  05681000
CVTRSV16 EQU   CVTOPTB                                                  05682000
CVTFP    EQU   CVTOPTB                                                  05683000
CVTAPTHR EQU   CVTOPTB                                                  05684000
CVTNLOG  EQU   CVTOPTB                                                  05685000
CVTTOD   EQU   CVTOPTB                                                  05686000
CVTCTIMS EQU   CVTOPTB                                                  05687000
CVTPROT  EQU   CVTOPTB                                                  05688000
CVTXPFP  EQU   CVTOPTA                                                  05689000
CVTASCII EQU   CVTOPTA                                                  05690000
CVTRSV13 EQU   CVTOPTA                                                  05691000
CVTRSV12 EQU   CVTOPTA                                                  05692000
CVTNIP   EQU   CVTOPTA                                                  05693000
CVTDDR   EQU   CVTOPTA                                                  05694000
CVTAPR   EQU   CVTOPTA                                                  05695000
CVTCCH   EQU   CVTOPTA                                                  05696000
CVTSNCTR EQU   CVTMAP+180                                               05697000
CVTQMWR  EQU   CVTMAP+176                                               05698000
CVTQOCR  EQU   CVTMAP+172                                               05699000
CVT1EF00 EQU   CVTMAP+168                                               05700000
CVTMZ00  EQU   CVTMAP+164                                               05701000
CVTHEAD  EQU   CVTMAP+160                                               05702000
CVTRSV11 EQU   CVTMAP+156                                               05703000
CVT0PT01 EQU   CVTMAP+152                                               05704000
CVTRV516 EQU   CVTIERLC                                                 05705000
CVTILCH  EQU   CVTMAP+140                                               05706000
CVT0DS   EQU   CVTMAP+136                                               05707000
CVTFBOSV EQU   CVTMAP+132                                               05708000
CVTNUCB  EQU   CVTMAP+128                                               05709000
CVTIXAVL EQU   CVTMAP+124                                               05710000
CVTIOQET EQU   CVTMAP+120                                               05711000
CVTDCBA  EQU   CVTMAP+117                                               05712000
CVTMVS2  EQU   CVTDCB                                                   05713000
CVT6DAT  EQU   CVTDCB                                                   05714000
CVT4MPS  EQU   CVTDCB                                                   05715000
CVTRSV09 EQU   CVTDCB                                                   05716000
CVT4MS1  EQU   CVTDCB                                                   05717000
CVT2SPS  EQU   CVTDCB                                                   05718000
CVT1SSS  EQU   CVTDCB                                                   05719000
CVTRSV08 EQU   CVTDCB                                                   05720000
CVTSTB   EQU   CVTMAP+112                                               05721000
CVTQTD00 EQU   CVTMAP+108                                               05722000
CVTQTE00 EQU   CVTMAP+104                                               05723000
CVTCUCB  EQU   CVTMAP+100                                               05724000
CVTSJQ   EQU   CVTMAP+96                                                05725000
CVTPBLDL EQU   CVTMAP+92                                                05726000
CVTTPC   EQU   CVTMAP+88                                                05727000
CVTSVDCB EQU   CVTMAP+84                                                05728000
CVTBRET  EQU   CVTMAP+82                                                05729000
CVTEXIT  EQU   CVTMAP+80                                                05730000
CVT0FN00 EQU   CVTMAP+76                                                05731000
CVTDARA  EQU   CVTDAR+1                                                 05732000
CVTRSV07 EQU   CVTFLGS1                                                 05733000
CVTRSV06 EQU   CVTFLGS1                                                 05734000
CVTRSV05 EQU   CVTFLGS1                                                 05735000
CVTRSV04 EQU   CVTFLGS1                                                 05736000
CVTRSV03 EQU   CVTFLGS1                                                 05737000
CVTRSV02 EQU   CVTFLGS1                                                 05738000
CVTRSV01 EQU   CVTFLGS1                                                 05739000
CVTDMPLK EQU   CVTFLGS1                                                 05740000
CVTXITP  EQU   CVTMAP+68                                                05741000
CVTZDTAB EQU   CVTMAP+64                                                05742000
CVTMSLT  EQU   CVTMAP+60                                                05743000
CVTDATE  EQU   CVTMAP+56                                                05744000
CVTBTERM EQU   CVTMAP+52                                                05745000
CVTSYSAD EQU   CVTMAP+48                                                05746000
CVTXTLER EQU   CVTMAP+44                                                05747000
CVTILK1  EQU   CVTMAP+36                                                05748000
CVTPRLTV EQU   CVTMAP+32                                                05749000
CVTPCNVT EQU   CVTMAP+28                                                05750000
CVT0VL00 EQU   CVTMAP+24                                                05751000
CVTXAPG  EQU   CVTMAP+20                                                05752000
CVTBUF   EQU   CVTMAP+16                                                05753000
CVTJOB   EQU   CVTMAP+12                                                05754000
CVTLINK  EQU   CVTMAP+8                                                 05755000
CVT0EF00 EQU   CVTMAP+4                                                 05756000
CVT      EQU   CVTMAP                                                   05757000
EPABEPA  EQU   EPABLK+16                                                05758000
EPABSW   EQU   EPABHDR+12                                               05759000
SWCHNPTR EQU   SWAEPA+12                                                05760000
SWLNGTH  EQU   SWAEPA+8                                                 05761000
SWBLKID  EQU   SWVAFW+3                                                 05762000
SWVA     EQU   SWVAFW                                                   05763000
SWBLKPTR EQU   SWAEPA                                                   05764000
@NM00015 EQU   WTOTIME+12                                               05765000
@NM00014 EQU   WTOTIME+9                                                05766000
@NM00013 EQU   WTOTIME+2                                                05767000
@NM00012 EQU   WTOTIME                                                  05768000
@NM00011 EQU   WTONAMES+25                                              05769000
@NM00010 EQU   WTONAMES+16                                              05770000
@NM00009 EQU   WTONAMES                                                 05771000
ASWACHNP EQU   ASWA+36                                                  05772000
ASWRSV02 EQU   ASWAFLGS+1                                               05773000
ASWRSV01 EQU   ASWADSWS                                                 05774000
ASWADYUE EQU   ASWADSWS                                                 05775000
ASWAVMVF EQU   ASWADSWS                                                 05776000
ASWACOMF EQU   ASWADSWS                                                 05777000
ASWADYNF EQU   ASWADSWS                                                 05778000
@NM00002 EQU   TCBPTRS                                                  05779000
TIOTLNTH EQU   TIOTLIST+4                                               05780000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      05781000
@RF00200 EQU   @RC00163                                                 05782000
@RC00225 EQU   @RC00214                                                 05783000
@RC00219 EQU   @RC00214                                                 05784000
@RC00252 EQU   @RC00251                                                 05785000
@RC00360 EQU   @RC00301                                                 05786000
@RC00306 EQU   @RC00301                                                 05787000
@RC00382 EQU   @RC00375                                                 05788000
@RC00376 EQU   @RC00375                                                 05789000
@RF00519 EQU   @RC00510                                                 05790000
@RF00524 EQU   @RC00510                                                 05791000
@RC00556 EQU   @RC00555                                                 05792000
@RF00502 EQU   @RC00208                                                 05793000
@RC00334 EQU   @RC00306                                                 05794000
@ENDDATA EQU   *                                                        05795000
         END   IEFBB410,(C'PLS2019',0701,77089)                         05796000
