         TITLE 'IEFDB413 - NORMAL DYNAMIC ALLOCATION CONTROL           *00001000
                        '                                               00002000
IEFDB413 CSECT ,                                                01S0001 00003000
@MAINENT DS    0H                                               01S0001 00004000
         USING *,@15                                            01S0001 00005000
         B     @PROLOG                                          01S0001 00006000
         DC    AL1(24)                                          01S0001 00007000
         DC    C'IEFDB413 78089  UZ17548 '                      01S0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00010000
         BALR  @12,0                                            01S0001 00011000
@PSTART  LA    @09,4095(,@12)                                   01S0001 00012000
         USING @PSTART,@12                                      01S0001 00013000
         USING @PSTART+4095,@09                                 01S0001 00014000
         L     @00,@SIZDATD                                     01S0001 00015000
         GSPACE   R,LV=(0)                                              00016000
         LR    @11,@01                                          01S0001 00017000
         USING @DATD,@11                                        01S0001 00018000
         ST    @13,@SA00001+4                                   01S0001 00019000
         LM    @00,@01,20(@13)                                  01S0001 00020000
         ST    @11,8(,@13)                                      01S0001 00021000
         LR    @13,@11                                          01S0001 00022000
         MVC   @PC00001(32),0(@01)                              01S0001 00023000
JSCBDISP EQU 188                                                        00024000
JSCBAOS1 EQU  72                                                        00025000
JSCBAOS2 EQU 192                                                        00026000
*/********************************************************************/ 00027000
*FSIOTPTR=ZEROPTR;                     /*CLEAR PTR TO FIRST SIOT     */ 00028000
         L     @08,@PC00001+24                                  01S0134 00029000
         SLR   @06,@06                                          01S0134 00030000
         ST    @06,FSIOTPTR(,@08)                               01S0134 00031000
*SSERRBLK = SSERRBLK && SSERRBLK;      /*CLEAR SUBSYSTEM ERROR  01S0135 00032000
*                                        BLOCK               @G29AN2F*/ 00033000
         XC    SSERRBLK(8),SSERRBLK                             01S0135 00034000
*CALL IEFDB414                         /*BUILD SIOT,JFCB,AND JFCBX'S */ 00035000
*              (SYSCTBLK,LSJXEPAP,KEYTABP,FSIOTPTR,ALFNCMAP,    01S0136 00036000
*               REASONCD,LASTEPAP);                             01S0136 00037000
         L     @06,@PC00001+4                                   01S0136 00038000
         ST    @06,@AL00001                                     01S0136 00039000
         LA    @06,LSJXEPAP(,@08)                               01S0136 00040000
         ST    @06,@AL00001+4                                   01S0136 00041000
         L     @06,@PC00001                                     01S0136 00042000
         ST    @06,@AL00001+8                                   01S0136 00043000
         LA    @08,FSIOTPTR(,@08)                               01S0136 00044000
         ST    @08,@AL00001+12                                  01S0136 00045000
         L     @08,@PC00001+20                                  01S0136 00046000
         ST    @08,@AL00001+16                                  01S0136 00047000
         L     @08,@PC00001+16                                  01S0136 00048000
         ST    @08,@AL00001+20                                  01S0136 00049000
         L     @08,@PC00001+8                                   01S0136 00050000
         ST    @08,@AL00001+24                                  01S0136 00051000
         L     @15,@CV00100                                     01S0136 00052000
         LA    @01,@AL00001                                     01S0136 00053000
         BALR  @14,@15                                          01S0136 00054000
*IF ERRCODE=ZERO                       /*SUCCESSFUL BUILD?           */ 00055000
*  & SIOTGDSN=OFF                      /*AND NOT A GENERATED DSNAME? */ 00056000
*  & SIOTSSDS=OFF                      /*AND NOT A SUBSYSTEM  D.S.?  */ 00057000
*  & SCTDUMMY=OFF                      /*AND NOT DUMMY (TERM,QNAME)? */ 00058000
*  & NORESSW=OFF THEN                  /*AND BYPASS DSN ENQ NOT SPEC?*/ 00059000
         L     @08,@PC00001+16                                  01S0137 00060000
         ICM   @06,3,ERRCODE(@08)                               01S0137 00061000
         BNZ   @RF00137                                         01S0137 00062000
         L     @08,@PC00001+24                                  01S0137 00063000
         L     @08,FSIOTPTR(,@08)                               01S0137 00064000
         TM    SIOTGDSN(@08),B'00010000'                        01S0137 00065000
         BNZ   @RF00137                                         01S0137 00066000
         TM    SIOTSSDS(@08),B'10000000'                        01S0137 00067000
         BNZ   @RF00137                                         01S0137 00068000
         TM    SCTDUMMY(@08),B'10000000'                        01S0137 00069000
         BNZ   @RF00137                                         01S0137 00070000
         L     @06,@PC00001+20                                  01S0137 00071000
         TM    NORESSW(@06),B'00100000'                         01S0137 00072000
         BNZ   @RF00137                                         01S0137 00073000
*  DO;                                 /*YES,RESERVE DATA SET VIA ENQ*/ 00074000
*/********************************************************************/ 00075000
*/*                                                                  */ 00076000
*/* SEGMENT NAME - DSRRINTF                                          */ 00077000
*/*                                                                  */ 00078000
*/* DESCRIPTIVE NAME - DATA SET RESERVATION/RELEASE ROUTINE INTERFACE*/ 00079000
*/*                                                                  */ 00080000
*/* FUNCTION -                                                       */ 00081000
*/*   RESERVE USE OF THE DATA SET TO INSURE DATA SET INTEGRITY, AND  */ 00082000
*/*   UPDATE THE DATA SET ENQUEUE TABLE.                             */ 00083000
*/*                                                                  */ 00084000
*/*   OPERATION -                                                    */ 00085000
*/*     THE INPUT TO THE DATA SET RESERVATION/RELEASE ROUTINE,       */ 00086000
*/*     IEFAB4DC, IS SET UP AS DESCRIBED BY THE CODE, AND NOTES      */ 00087000
*/*     SECTION BELOW. THE ROUTINE IS THEN INVOKED. IF THE ROUTINE   */ 00088000
*/*     INDICATES THAT THE JCT HAS BEEN UPDATED AND AN EPA FOR IT    */ 00089000
*/*     HAS BEEN CHAINED, AN INDICATOR IS SET SO THAT A DUPLICATE    */ 00090000
*/*     EPA WILL NOT BE CHAINED IF THE JCT IS UPDATED DURING         */ 00091000
*/*     SUBSEQUENT DYNAMIC ALLOCATION PROCESSING OF THE REQUEST.     */ 00092000
*/*                                                                  */ 00093000
*/* INPUT -                                                          */ 00094000
*/*   EPAJCTSW - IF ON, INDICATES THAT A JCT EPA HAS ALREADY BEEN    */ 00095000
*/*              CHAINED, AND THEREFORE, IEFAB4DC SHOULD NOT CHAIN   */ 00096000
*/*              AN EPA IF IT UPDATES THE JCT.                       */ 00097000
*/*                                                                  */ 00098000
*/* OUTPUT -                                                         */ 00099000
*/*   EPAJCTSW - SET ON IF A JCT EPA HAS BEEN CHAINED.               */ 00100000
*/*                                                                  */ 00101000
*/* NOTES -                                                          */ 00102000
*/*   * AN INDICATOR IS SET TO PREVENT IEFAB4DC FROM CHANGING THE    */ 00103000
*/*     USE ATTRIBUTE FROM SHARED TO EXCLUSIVE, IF IT DETERMINES     */ 00104000
*/*     THIS TO BE NECESSARY (THAT IS, THE USER CURRENTLY HAS SHARED */ 00105000
*/*     USAGE OF THE DATA SET BUT NOW REQUIRES EXCLUSIVE USE). THIS  */ 00106000
*/*     IS NECESSARY BECAUSE THERE IS NO WAY TO RETURN THE USE       */ 00107000
*/*     ATTRIBUTE TO SHARE IF AN ERROR OCCURS DURING SUBSEQUENT      */ 00108000
*/*     DYNAMIC ALLOCATION. AN INDICATOR (RETINDIC) IS SET TO HAVE   */ 00109000
*/*     IEFAB4DC SET ON AN INDICATOR IF THIS SITUATION OCCURS, AND   */ 00110000
*/*     THE CHANGE FROM SHARED TO EXCLUSIVE USAGE WILL BE DONE AT THE*/ 00111000
*/*     END OF DYNAMIC ALLOCATION PROCESSING (SEE ALWRAPUP SEGMENT). */ 00112000
*/*     THIS SAME INDICATOR CAUSES IEFAB4DC TO INDICATE TO DYNAMIC   */ 00113000
*/*     ALLOCATION THAT THE DATA SET SHOULD BE DEQUEUED              */ 00114000
*/*     (CASE WHEN THE USER DID NOT ALREADY HAVE USE OF THE DATA SET */ 00115000
*/*     BEFORE THIS DYNAMIC ALLOCATION REQUEST) IF AN ERROR          */ 00116000
*/*     OCCURS DURING SUBSEQUENT DYNAMIC ALLOCATION PROCESSING.      */ 00117000
*/*   * AN INDICATOR IS SET TO HAVE IEFAB4DC RETURN THE ADDRESS OF   */ 00118000
*/*     THE DSNAME IN THE DSENQ TABLE. THIS INFORMATION WILL BE      */ 00119000
*/*     RETURNED TO IEFAB4DC IF IT IS CALLED TO DEQ THE DATA SET (IF */ 00120000
*/*     AN ERROR OCCURS DURING LATER DYNAMIC ALLOCATION PROCESSING)  */ 00121000
*/*     OR TO CHANGE THE USE ATTRIBUTE FROM SHARED TO EXCLUSIVE.     */ 00122000
*/*                                                                  */ 00123000
*/********************************************************************/ 00124000
*DSRRFMAP=DSRRFMAP && DSRRFMAP;        /*CLEAR FUNCTION MAP          */ 00125000
         XC    DSRRFMAP(2),DSRRFMAP                             02S0139 00126000
*ADCHENQ=ON;                           /*ADD DSNQ TABLE ENTRY AND ENQ*/ 00127000
         OI    ADCHENQ,B'00100000'                              02S0140 00128000
*IF JFCSHARE=ON THEN                   /*STATUS = SHR?               */ 00129000
         L     @08,SJFCBPTR(,@08)                               02S0141 00130000
         TM    JFCSHARE(@08),B'00001000'                        02S0141 00131000
         BNO   @RF00141                                         02S0141 00132000
*  ENQSHR=ON;                          /*YES,RESERVE D.S. AS SHR     */ 00133000
         OI    ENQSHR,B'00000010'                               02S0142 00134000
*ELSE                                  /*OR, IF                      */ 00135000
*  DO;                                                          02S0143 00136000
         B     @RC00141                                         02S0143 00137000
@RF00141 DS    0H                                               02S0144 00138000
*    ENQEXCL=ON;                       /*NO,RESERVE D.S. AS EXCLUSIVE*/ 00139000
*    NOSHRXCL=ON;                      /*DON'T DO SHR TO EXCL ENQ    */ 00140000
         OI    ENQEXCL,B'00000101'                              02S0145 00141000
*  END;                                                         02S0146 00142000
*IF WTDSNSW=ON THEN                    /*AUTH USER REQ WAIT FOR D.S.?*/ 00143000
@RC00141 L     @08,@PC00001+20                                  02S0147 00144000
         TM    WTDSNSW(@08),B'01000000'                         02S0147 00145000
         BNO   @RF00147                                         02S0147 00146000
*  DO;                                 /*YES, DO UNCONDITIONAL ENQ   */ 00147000
*    ENQWAIT=ON;                       /*USE UNCONDITIONAL ENQ       */ 00148000
         OI    ENQWAIT,B'10000000'                              02S0149 00149000
*    DSRRMSGP=TCBTIO;                  /*ADDR OF JOBNAME AND STEPNAME*/ 00150000
         L     @08,@PC00001+4                                   02S0150 00151000
         L     @08,TCBPTR(,@08)                                 02S0150 00152000
         L     @08,TCBTIO(,@08)                                 02S0150 00153000
         ST    @08,DSRRMSGP                                     02S0150 00154000
*  END;                                /*END UNCONDITIONAL ENQ       */ 00155000
*ELSE                                  /*DO CONDITIONAL ENQ          */ 00156000
*  DSRRMSGP=ZEROPTR;                   /*MSG PARMS NOT NEEDED        */ 00157000
         B     @RC00147                                         02S0152 00158000
@RF00147 SLR   @08,@08                                          02S0152 00159000
         ST    @08,DSRRMSGP                                     02S0152 00160000
*IF EPAJCTSW=ON THEN                   /*EPA FOR JCT ON CHAIN        */ 00161000
@RC00147 L     @08,@PC00001+20                                  02S0153 00162000
         TM    EPAJCTSW(@08),B'00000001'                        02S0153 00163000
         BNO   @RF00153                                         02S0153 00164000
*  EPAJCTEX=ON;                        /*YES, INDICATE THAT IN DSRR     00165000
*                                        INPUT FUNCTION MAP          */ 00166000
         OI    EPAJCTEX,B'00000100'                             02S0154 00167000
*RETADDR=ON;                           /*RETURN ADDRESS OF DSNQ ENTRY   00168000
*                                        AND DSNQ RECORD (IN NQRETPS)*/ 00169000
@RF00153 DS    0H                                               02S0156 00170000
*RETINDIC=ON;                          /*RETURN RESULTS INDICATORS   */ 00171000
         OI    RETADDR,B'01100000'                              02S0156 00172000
*NQRETPS = NQRETPS && NQRETPS;         /*CLEAR RETURN AREA           */ 00173000
         L     @08,@PC00001+24                                  02S0157 00174000
         XC    NQRETPS(8,@08),NQRETPS(@08)                      02S0157 00175000
*IF JSCBTCBP ^= ZEROPTR THEN           /*IF INIT. TCB IS IN JSCB        00176000
*                                                            @YM03580*/ 00177000
         L     @08,@PC00001+4                                   02S0158 00178000
         L     @08,JSCBPTR(,@08)                                02S0158 00179000
         L     @08,JSCBTCBP(,@08)                               02S0158 00180000
         LTR   @08,@08                                          02S0158 00181000
         BZ    @RF00158                                         02S0158 00182000
*  ENQTCBP = JSCBTCBP;                 /*USE IT FOR DIRECTED ENQ        00183000
*                                                            @YM03580*/ 00184000
         ST    @08,ENQTCBP                                      02S0159 00185000
*ELSE                                  /*INITIATOR'S TCB FIELD IS       00186000
*                                        ZERO                @YM03580*/ 00187000
*  ENQTCBP = TCBPTR;                   /*USE CURRENT TCB FOR ENQ        00188000
*                                                            @YM03580*/ 00189000
         B     @RC00158                                         02S0160 00190000
@RF00158 L     @08,@PC00001+4                                   02S0160 00191000
         L     @08,TCBPTR(,@08)                                 02S0160 00192000
         ST    @08,ENQTCBP                                      02S0160 00193000
*CALL IEFAB4DC                         /*DSENQ RTN           @YM03580*/ 00194000
*              (DSRRFMAP,JCTPTR,DSNAMTUP->TEXTULNG,LASTEPAP,    02S0161 00195000
*  ENQTCBP,SCTSNUMB,NQRETPS,ALFNCMAP,REASONCD,0,DSRRMSGP);      02S0161 00196000
*                                                               02S0161 00197000
@RC00158 LA    @08,DSRRFMAP                                     02S0161 00198000
         ST    @08,@AL00001                                     02S0161 00199000
         L     @08,@PC00001+4                                   02S0161 00200000
         LA    @06,JCTPTR(,@08)                                 02S0161 00201000
         ST    @06,@AL00001+4                                   02S0161 00202000
         L     @06,@PC00001                                     02S0161 00203000
         L     @06,KEYTABP(,@06)                                02S0161 00204000
         L     @06,DSNAMTUP(,@06)                               02S0161 00205000
         LA    @06,TEXTULNG(,@06)                               02S0161 00206000
         ST    @06,@AL00001+8                                   02S0161 00207000
         L     @06,@PC00001+8                                   02S0161 00208000
         ST    @06,@AL00001+12                                  02S0161 00209000
         LA    @06,ENQTCBP                                      02S0161 00210000
         ST    @06,@AL00001+16                                  02S0161 00211000
         L     @08,SCTPTR(,@08)                                 02S0161 00212000
         LA    @08,SCTSNUMB(,@08)                               02S0161 00213000
         ST    @08,@AL00001+20                                  02S0161 00214000
         L     @08,@PC00001+24                                  02S0161 00215000
         LA    @08,NQRETPS(,@08)                                02S0161 00216000
         ST    @08,@AL00001+24                                  02S0161 00217000
         L     @08,@PC00001+20                                  02S0161 00218000
         ST    @08,@AL00001+28                                  02S0161 00219000
         L     @08,@PC00001+16                                  02S0161 00220000
         ST    @08,@AL00001+32                                  02S0161 00221000
         LA    @08,@CF00125                                     02S0161 00222000
         ST    @08,@AL00001+36                                  02S0161 00223000
         LA    @08,DSRRMSGP                                     02S0161 00224000
         ST    @08,@AL00001+40                                  02S0161 00225000
         L     @15,@CV00098                                     02S0161 00226000
         LA    @01,@AL00001                                     02S0161 00227000
         BALR  @14,@15                                          02S0161 00228000
*IF EPAJCTEX=ON THEN                   /*EPA FOR JCT ON CHAIN OR PUT    00229000
*                                        ON CHAIN BY IEFAB4DC        */ 00230000
         TM    EPAJCTEX,B'00000100'                             02S0162 00231000
         BNO   @RF00162                                         02S0162 00232000
*  EPAJCTSW=ON;                        /*YES, INDICATE THAT IN THE      00233000
*                                        ALLOCATION FUNCTION MAP     */ 00234000
         L     @08,@PC00001+20                                  02S0163 00235000
         OI    EPAJCTSW(@08),B'00000001'                        02S0163 00236000
*  END;                                                         01S0164 00237000
@RF00162 DS    0H                                               01S0165 00238000
*IF ERRCODE=ZERO THEN                  /*SUCCESSFUL SO FAR?          */ 00239000
@RF00137 L     @08,@PC00001+16                                  01S0165 00240000
         ICM   @06,3,ERRCODE(@08)                               01S0165 00241000
         BNZ   @RF00165                                         01S0165 00242000
*  DO;                                 /*YES                         */ 00243000
*    IF COPYSW = ON THEN               /* SHOULD VOLUME AND UNIT INFO   00244000
*                                         BE COPIED ?                */ 00245000
         L     @08,@PC00001+20                                  01S0167 00246000
         TM    COPYSW(@08),B'01000000'                          01S0167 00247000
         BNO   @RF00167                                         01S0167 00248000
*      DO;                             /* YES                        */ 00249000
*/********************************************************************/ 00250000
*/*                                                                  */ 00251000
*/* SEGMENT NAME - COPYINFO                                          */ 00252000
*/*                                                                  */ 00253000
*/* DESCRIPTIVE NAME - COPY VOLUME AND UNIT INFORMATION              */ 00254000
*/*                                                                  */ 00255000
*/* FUNCTION - COPY VOLUME AND UNIT INFORMATION ASSOCIATED WITH      */ 00256000
*/*   A DSAB OF THE DATA SET WHICH COULD NOT BE CONVERTED.           */ 00257000
*/*                                                                  */ 00258000
*/*   OPERATION -                                                    */ 00259000
*/*     VOLUME AND UNIT INFORMATION IS COPIED AS DOCUMENTED IN THE   */ 00260000
*/*     CODE.  THE VAM (SIOVAMDS) AND SUBSYSTEM (SIOTSSDS)           */ 00261000
*/*     DATA SET INDICATORS ARE SET IF NECESSARY.  IF AN &DSNAME     */ 00262000
*/*     WAS SUPPLIED, THE GENERATED DSNAME FROM THE JFCB OF THE      */ 00263000
*/*     NON-CONVERTIBLE ALLOCATION IS COPIED.                        */ 00264000
*/*                                                                  */ 00265000
*/*  NOTE -                                                          */ 00266000
*/*   * COPY PROCESSING IS ONLY DONE IF THE USER HAS NOT             */ 00267000
*/*     SPECIFIED VOLUME AND UNIT INFORMATION. THIS IS ACCOMPLISHED  */ 00268000
*/*     BY THE FACT THAT THE COPY SWITCH WILL NOT BE SET ON BY       */ 00269000
*/*     IEFDB410 IF ANY VOLUME OR UNIT INFORMATION IS SPECIFIED.     */ 00270000
*/*                                                                  */ 00271000
*/*   * IF COPY IS DONE FOR A CATALOGED DATA SET THE DEVICE  @YA00080*/ 00272000
*/*     TYPE FROM THE CATALOG IS PLACED IN THE JFCBX (THIS   @YA00080*/ 00273000
*/*     ALLOWS RE-CATALOGING WITHOUT CHANGING THE CATALOG    @YA00080*/ 00274000
*/*     DEVICE TYPE). ALSO, IF COPY IS FROM A REQUEST THAT   @YA00080*/ 00275000
*/*     HAS AN ALIAS NAME IN THE JFCBX, THAT ALIAS NAME IS   @YA00080*/ 00276000
*/*     COPIED TO THIS JFCBX.                                @YA00080*/ 00277000
*/*                                                                  */ 00278000
*/*   * CERTAIN OPTIONAL FEATURE BITS MAY BE SET IN THE      @YM05476*/ 00279000
*/*     DEVICE TYPE OF THE SIOT BEING COPIED FROM.           @YM05476*/ 00280000
*/*     THIS WILL HAPPEN IF THE DEVICE TYPE WAS ORIGINALLY   @YM06172*/ 00281000
*/*     TAKEN FROM THE UCB (AS IN A DEMAND REQUEST).         @YM06172*/ 00282000
*/*     IN THIS CASE THESE BITS MUST BE MARKED OFF IN        @YM05476*/ 00283000
*/*     THE NEW SIOT TO BE ALLOCATED, SO THAT COMMON         @YM05476*/ 00284000
*/*     ALLOCATION CAN FIND A MATCH WHILE SEARCHING ITS      @YM05476*/ 00285000
*/*     ELIGIBLE DEVICE TABLE.                               @YM05476*/ 00286000
*/*                                                          @ZA00897*/ 00287000
*/*   * ONE OR MORE JFCBX'S MAY EXIST FOR THE DATA SET FROM  @ZA00897*/ 00288000
*/*     WHICH DATA IS BEING COPIED.  JFCBX/S MAY EXIST FOR   @ZA00897*/ 00289000
*/*     ONE OF THE FOLLOWING REASONS: 1-IF THERE ARE > 5 VOL @ZA00897*/ 00290000
*/*     SERS, ONE JFCBX EXISTS FOR EACH ADDITIONAL 15 VOL    @ZA00897*/ 00291000
*/*     SERS.  2-IF THE DATA SET HAD BEEN LOCATED IN THE     @ZA00897*/ 00292000
*/*     CATALOG, ONE JFCBX MUST EXIST TO CONTAIN THE DEVICE  @ZA00897*/ 00293000
*/*     TYPE RETRIEVED FROM THE CATALOG.  3-IF THE DATA SET  @ZA00897*/ 00294000
*/*     NAME SPECIFIED IS AN ALIAS, ONE JFCBX MUST EXIST TO  @ZA00897*/ 00295000
*/*     CONTAIN THE ALIAS NAME.  THE ALIAS NAME AND DEVICE   @ZA00897*/ 00296000
*/*     TYPE ONLY EXIST IN THE FIRST JFCBX.                  @ZA00897*/ 00297000
*/*                                                                  */ 00298000
*/* INPUT -                                                          */ 00299000
*/*   COPYDSAB - PTR TO DSAB FROM WHICH ASSOCIATED VOLUME AND        */ 00300000
*/*              UNIT INFORMATION IS COPIED                          */ 00301000
*/*   FSIOTPTR - PTR TO SIOT TO BE PROCESSED                         */ 00302000
*/*   JCTPTR,SCTPTR,JSCBPTR,LASTEPAP,LSJXEPAP - PASSED TO            */ 00303000
*/*     HOUSEKEEPING                                                 */ 00304000
*/*   CVT - PTR TO IOS UCB LOOK-UP TABLE FOR HOUSEKEEPING            */ 00305000
*/*   LSJXEPAP - PASSED TO SWA MANAGER INTERFACE ROUTINE, TO CHAIN   */ 00306000
*/*               EPA'S FOR ASSIGNED JFCBX'S                         */ 00307000
*/*                                                                  */ 00308000
*/* OUTPUT -                                                         */ 00309000
*/*   SIOT'S,JFCB'S, AND JFCBX'S UPDATED                             */ 00310000
*/*                                                                  */ 00311000
*/********************************************************************/ 00312000
*SCTUTYPE = COPYDSAB->DSABSIOT->SCTUTYPE; /*COPY UNIT TYPE           */ 00313000
         L     @08,@PC00001+24                                  02S0169 00314000
         L     @08,FSIOTPTR(,@08)                               02S0169 00315000
         L     @06,@PC00001+12                                  02S0169 00316000
         L     @06,COPYDSAB(,@06)                               02S0169 00317000
         L     @06,DSABSIOT(,@06)                               02S0169 00318000
         MVC   SCTUTYPE(8,@08),SCTUTYPE(@06)                    02S0169 00319000
*IF COPYDSAB->DSABSIOT->SIOTDMND=ON THEN /*COPIED DD DEMAND REQ 02S0170 00320000
*                                                            @YM06172*/ 00321000
         TM    SIOTDMND(@06),B'10000000'                        02S0170 00322000
         BNO   @RF00170                                         02S0170 00323000
*  DO;                                   /*YES,CHECK OPT BITS@YM06172*/ 00324000
*    IF SIO3DACC = ON THEN             /*DIRECT ACCESS DEVICE@YM05476*/ 00325000
         TM    SIO3DACC(@08),B'00100000'                        02S0172 00326000
         BNO   @RF00172                                         02S0172 00327000
*      DO;                             /*TURN OFF OPTION BITS@YM05476*/ 00328000
*        SIOUBYT2 = SIOUBYT2 & SHPOWOFF; /*SHARED DASD AND ALTERNATE    00329000
*                                        POWER BITS OFF      @YM05477*/ 00330000
         NI    SIOUBYT2(@08),X'DC'                              02S0174 00331000
*        IF SIOUBYT4 = DA3340 THEN     /*IF A 3340 DEVICE    @YM05476*/ 00332000
         CLI   SIOUBYT4(@08),X'0A'                              02S0175 00333000
         BNE   @RF00175                                         02S0175 00334000
*          SIOUBYT2 = SIOUBYT2 & RPSOFF; /*RPS BIT OFF ALSO  @YM05476*/ 00335000
         NI    SIOUBYT2(@08),X'EF'                              02S0176 00336000
*      END;                            /*END IF DIRECT ACCESS@YM05476*/ 00337000
@RF00175 DS    0H                                               02S0178 00338000
*    IF SIO3TAPE = ON THEN             /*TAPE DEVICE         @YM05477*/ 00339000
@RF00172 L     @08,@PC00001+24                                  02S0178 00340000
         L     @08,FSIOTPTR(,@08)                               02S0178 00341000
         TM    SIO3TAPE(@08),B'10000000'                        02S0178 00342000
         BNO   @RF00178                                         02S0178 00343000
*      SIOUBYT2 = SIOUBYT2 & OPTIONS;  /*OPTIONS BITS OFF    @ZA04104*/ 00344000
         NI    SIOUBYT2(@08),X'F4'                              02S0179 00345000
*    IF SIO3UREC = ON THEN             /*UNIT RECORD DEVICE  @YM05476*/ 00346000
@RF00178 L     @08,@PC00001+24                                  02S0180 00347000
         L     @08,FSIOTPTR(,@08)                               02S0180 00348000
         TM    SIO3UREC(@08),B'00001000'                        02S0180 00349000
         BNO   @RF00180                                         02S0180 00350000
*      IF SIOUBYT4 ^= UR3211 THEN      /*NOT A 3211          @YM05476*/ 00351000
         CLI   SIOUBYT4(@08),X'09'                              02S0181 00352000
         BE    @RF00181                                         02S0181 00353000
*        SIOUBYT2 = OPTSOFF;           /*ALL OPT BITS OFF    @YM05476*/ 00354000
         MVI   SIOUBYT2(@08),X'00'                              02S0182 00355000
*      ELSE                            /*3211 UNIT RECORD DEV@YM05476*/ 00356000
*        SIOUBYT2 = SIOUBYT2 & UCSOPMSK; /*ALLOW UCS BIT     @YM05476*/ 00357000
         B     @RC00181                                         02S0183 00358000
@RF00181 L     @08,@PC00001+24                                  02S0183 00359000
         L     @08,FSIOTPTR(,@08)                               02S0183 00360000
         NI    SIOUBYT2(@08),X'80'                              02S0183 00361000
*    IF SIO3DISP = ON THEN             /*GRAPHICS DEVICE     @YM05476*/ 00362000
@RC00181 DS    0H                                               02S0184 00363000
@RF00180 L     @08,@PC00001+24                                  02S0184 00364000
         L     @08,FSIOTPTR(,@08)                               02S0184 00365000
         TM    SIO3DISP(@08),B'00010000'                        02S0184 00366000
         BNO   @RF00184                                         02S0184 00367000
*      SIOUBYT2 = OPTSOFF;             /*ALL OPTION BITS OFF @YM05476*/ 00368000
         MVI   SIOUBYT2(@08),X'00'                              02S0185 00369000
*  END;                                /*END DEMAND DD COPIED@YM06172*/ 00370000
@RF00184 DS    0H                                               02S0187 00371000
*SCTNMBUT = COPYDSAB->DSABSIOT->SCTNMBUT; /*COPY UNIT COUNT          */ 00372000
@RF00170 L     @08,@PC00001+24                                  02S0187 00373000
         L     @08,FSIOTPTR(,@08)                               02S0187 00374000
         L     @06,@PC00001+12                                  02S0187 00375000
         L     @06,COPYDSAB(,@06)                               02S0187 00376000
         L     @06,DSABSIOT(,@06)                               02S0187 00377000
         MVC   SCTNMBUT(1,@08),SCTNMBUT(@06)                    02S0187 00378000
*IF COPYDSAB->DSABSIOT->SIOTSSDS = ON THEN /* COPY SUB-SYSTEM   02S0188 00379000
*                                             DATA SET BIT           */ 00380000
         TM    SIOTSSDS(@06),B'10000000'                        02S0188 00381000
         BNO   @RF00188                                         02S0188 00382000
*  SIOTSSDS = ON;                                               02S0189 00383000
         OI    SIOTSSDS(@08),B'10000000'                        02S0189 00384000
*IF COPYDSAB->DSABSIOT->SIOVAMDS = ON THEN /* COPY VAM DATA SET BIT  */ 00385000
@RF00188 L     @08,@PC00001+12                                  02S0190 00386000
         L     @08,COPYDSAB(,@08)                               02S0190 00387000
         L     @08,DSABSIOT(,@08)                               02S0190 00388000
         TM    SIOVAMDS(@08),B'00100000'                        02S0190 00389000
         BNO   @RF00190                                         02S0190 00390000
*  SIOVAMDS = ON;                                               02S0191 00391000
         L     @08,@PC00001+24                                  02S0191 00392000
         L     @08,FSIOTPTR(,@08)                               02S0191 00393000
         OI    SIOVAMDS(@08),B'00100000'                        02S0191 00394000
*IF COPYDSAB->DSABSIOT->SCTPARLM = ON THEN /*COPY PARALLEL MOUNT BIT */ 00395000
@RF00190 L     @08,@PC00001+12                                  02S0192 00396000
         L     @08,COPYDSAB(,@08)                               02S0192 00397000
         L     @08,DSABSIOT(,@08)                               02S0192 00398000
         TM    SCTPARLM(@08),B'00000100'                        02S0192 00399000
         BNO   @RF00192                                         02S0192 00400000
*  SCTPARLM = ON;                                               02S0193 00401000
         L     @08,@PC00001+24                                  02S0193 00402000
         L     @08,FSIOTPTR(,@08)                               02S0193 00403000
         OI    SCTPARLM(@08),B'00000100'                        02S0193 00404000
*IF COPYDSAB->DSABSIOT->SIOTPRIV = ON THEN /*COPY PRIVATE INDICATION */ 00405000
@RF00192 L     @08,@PC00001+12                                  02S0194 00406000
         L     @08,COPYDSAB(,@08)                               02S0194 00407000
         L     @08,DSABSIOT(,@08)                               02S0194 00408000
         TM    SIOTPRIV(@08),B'00100000'                        02S0194 00409000
         BNO   @RF00194                                         02S0194 00410000
*  SIOTPRIV = ON;                                               02S0195 00411000
         L     @08,@PC00001+24                                  02S0195 00412000
         L     @08,FSIOTPTR(,@08)                               02S0195 00413000
         OI    SIOTPRIV(@08),B'00100000'                        02S0195 00414000
*SIOTVLCT = COPYDSAB->DSABSIOT->SIOTVLCT; /*COPY VOLUME COUNT        */ 00415000
@RF00194 L     @08,@PC00001+24                                  02S0196 00416000
         L     @08,FSIOTPTR(,@08)                               02S0196 00417000
         L     @06,@PC00001+12                                  02S0196 00418000
         L     @06,COPYDSAB(,@06)                               02S0196 00419000
         L     @06,DSABSIOT(,@06)                               02S0196 00420000
         MVC   SIOTVLCT(1,@08),SIOTVLCT(@06)                    02S0196 00421000
*JFCBVLCT = SIOTVLCT;                  /*VOLUME COUNT TO JFCB        */ 00422000
         L     @15,SJFCBPTR(,@08)                               02S0197 00423000
         MVC   JFCBVLCT(1,@15),SIOTVLCT(@08)                    02S0197 00424000
*JFCBVLSQ = COPYDSAB->DSABSIOT->SJFCBPTR->JFCBVLSQ; /*COPY VOL SEQ # */ 00425000
         L     @14,SJFCBPTR(,@06)                               02S0198 00426000
         LH    @05,JFCBVLSQ(,@14)                               02S0198 00427000
         STH   @05,JFCBVLSQ(,@15)                               02S0198 00428000
*JFCBNVOL = COPYDSAB->DSABSIOT->SJFCBPTR->JFCBNVOL; /* COPY # OF VOL    00429000
*                                        SERS INTO JFCB              */ 00430000
         MVC   JFCBNVOL(1,@15),JFCBNVOL(@14)                    02S0199 00431000
*SCTVOLCT = JFCBNVOL;                  /*COPY # OF VOL SERS TO SIOT  */ 00432000
         IC    @05,JFCBNVOL(,@15)                               02S0200 00433000
         STC   @05,SCTVOLCT(,@08)                               02S0200 00434000
*JFCBVOLS = COPYDSAB->DSABSIOT->SJFCBPTR->JFCBVOLS; /*COPY 5 VOL SERS*/ 00435000
         MVC   JFCBVOLS(30,@15),JFCBVOLS(@14)                   02S0201 00436000
*IF COPYDSAB->DSABSIOT->SIOTGDSN = ON THEN /* IS THIS A GEN'D DSNAME?*/ 00437000
         TM    SIOTGDSN(@06),B'00010000'                        02S0202 00438000
         BNO   @RF00202                                         02S0202 00439000
*  JFCBDSNM = COPYDSAB->DSABSIOT->SJFCBPTR->JFCBDSNM; /*COPY DSNAME  */ 00440000
         MVC   JFCBDSNM(44,@15),JFCBDSNM(@14)                   02S0203 00441000
*IF SIO3DACC = ON THEN                 /*IF A DA DEVICE      @YM05476*/ 00442000
@RF00202 L     @08,@PC00001+24                                  02S0204 00443000
         L     @08,FSIOTPTR(,@08)                               02S0204 00444000
         TM    SIO3DACC(@08),B'00100000'                        02S0204 00445000
         BNO   @RF00204                                         02S0204 00446000
*  JFCBDSCB = COPYDSAB->DSABSIOT->SJFCBPTR->JFCBDSCB;           02S0205 00447000
         L     @08,SJFCBPTR(,@08)                               02S0205 00448000
         L     @06,@PC00001+12                                  02S0205 00449000
         L     @06,COPYDSAB(,@06)                               02S0205 00450000
         L     @06,DSABSIOT(,@06)                               02S0205 00451000
         L     @06,SJFCBPTR(,@06)                               02S0205 00452000
         MVC   JFCBDSCB(3,@08),JFCBDSCB(@06)                    02S0205 00453000
*                                      /*COPY TTR OF DSCB    @YM05476*/ 00454000
*IF COPYDSAB->DSABSIOT->SJFCBPTR->JFCCAT=ON THEN /*IF CATLG'D DS        00455000
*                                                            @YM05476*/ 00456000
@RF00204 L     @08,@PC00001+12                                  02S0206 00457000
         L     @08,COPYDSAB(,@08)                               02S0206 00458000
         L     @08,DSABSIOT(,@08)                               02S0206 00459000
         L     @08,SJFCBPTR(,@08)                               02S0206 00460000
         TM    JFCCAT(@08),B'10000000'                          02S0206 00461000
         BNO   @RF00206                                         02S0206 00462000
*  JFCCAT = ON;                        /*COPY CATLG BIT      @YM05476*/ 00463000
         L     @08,@PC00001+24                                  02S0207 00464000
         L     @08,FSIOTPTR(,@08)                               02S0207 00465000
         L     @08,SJFCBPTR(,@08)                               02S0207 00466000
         OI    JFCCAT(@08),B'10000000'                          02S0207 00467000
*NUMJFCBX = MAX(SCTNMBUT,SIOTVLCT,JFCBNVOL); /*WORK AREA FOR # JFCBX -  00468000
*                                        SET TO GREATER OF UNIT COUNT,  00469000
*                                        VOLUME COUNT, AND # OF 02S0208 00470000
*                                        VOLUME SERIALS              */ 00471000
@RF00206 L     @08,@PC00001+24                                  02S0208 00472000
         L     @08,FSIOTPTR(,@08)                               02S0208 00473000
         SLR   @06,@06                                          02S0208 00474000
         IC    @06,SCTNMBUT(,@08)                               02S0208 00475000
         SLR   @15,@15                                          02S0208 00476000
         IC    @15,SIOTVLCT(,@08)                               02S0208 00477000
         CR    @06,@15                                          02S0208 00478000
         BNL   *+6                                                      00479000
         LR    @06,@15                                          02S0208 00480000
         L     @08,SJFCBPTR(,@08)                               02S0208 00481000
         SLR   @15,@15                                          02S0208 00482000
         IC    @15,JFCBNVOL(,@08)                               02S0208 00483000
         CR    @06,@15                                          02S0208 00484000
         BNL   *+6                                                      00485000
         LR    @06,@15                                          02S0208 00486000
         ST    @06,NUMJFCBX                                     02S0208 00487000
*NUMJFCBX = NUMJFCBX-5;                /*LESS # JFCB SER =# JFCBX SER*/ 00488000
         SL    @06,@CF00493                                     02S0209 00489000
         ST    @06,NUMJFCBX                                     02S0209 00490000
*IF NUMJFCBX ^> 0                      /*JFCBX REQUIRED?     @YA00080*/ 00491000
*   & (COPYDSAB->DSABSIOT->SIOCDEVT=ON | /*DEVICE TYPE IN JFCBX?        00492000
*                                                            @ZA00897*/ 00493000
*      COPYDSAB->DSABSIOT->SIOALIAS=ON) THEN /*ALIAS NAME IN JFCBX?     00494000
*                                                            @ZA00897*/ 00495000
         LTR   @06,@06                                          02S0210 00496000
         BP    @RF00210                                         02S0210 00497000
         L     @08,@PC00001+12                                  02S0210 00498000
         L     @08,COPYDSAB(,@08)                               02S0210 00499000
         L     @08,DSABSIOT(,@08)                               02S0210 00500000
         TM    SIOCDEVT(@08),B'11000000'                        02S0210 00501000
         BZ    @RF00210                                         02S0210 00502000
*  NUMJFCBX = 1;                       /*YES, CREATE A JFCBX @YA00080*/ 00503000
         MVC   NUMJFCBX(4),@CF00103                             02S0211 00504000
*IF NUMJFCBX > ZERO THEN               /*JFCBX REQUIRED?             */ 00505000
@RF00210 L     @08,NUMJFCBX                                     02S0212 00506000
         LTR   @08,@08                                          02S0212 00507000
         BNP   @RF00212                                         02S0212 00508000
*  DO;                                 /*YES,CALCULATE # REQUIRED    */ 00509000
*    NUMJFCBX = NUMJFCBX / 15          /*ONE JFCBX PER 15 VOL SERS   */ 00510000
*      + MIN(1,NUMJFCBX//15);          /*PLUS 1 FOR REMAINDER, IF ANY*/ 00511000
         LA    @06,15                                           02S0214 00512000
         LR    @00,@08                                          02S0214 00513000
         SRDA  @00,32                                           02S0214 00514000
         DR    @00,@06                                          02S0214 00515000
         LA    @15,1                                            02S0214 00516000
         LR    @02,@08                                          02S0214 00517000
         SRDA  @02,32                                           02S0214 00518000
         DR    @02,@06                                          02S0214 00519000
         CR    @02,@15                                          02S0214 00520000
         BNH   *+6                                                      00521000
         LR    @02,@15                                          02S0214 00522000
         ALR   @01,@02                                          02S0214 00523000
         ST    @01,NUMJFCBX                                     02S0214 00524000
*    DO I=1 TO NUMJFCBX;               /*LOOP FOR EACH JFCBX NEEDED  */ 00525000
         LR    I,@15                                            02S0215 00526000
         B     @DE00215                                         02S0215 00527000
@DL00215 DS    0H                                               02S0216 00528000
*      SMIID(I) = JFCBXID;             /*JFCBX TABLE ID IN SMI PARMS */ 00529000
         LR    @08,I                                            02S0216 00530000
         SLA   @08,2                                            02S0216 00531000
         LA    @06,SMIID-4(@08)                                 02S0216 00532000
         MVI   0(@06),X'1D'                                     02S0216 00533000
*    END;                                                       02S0217 00534000
         AL    I,@CF00103                                       02S0217 00535000
@DE00215 C     I,NUMJFCBX                                       02S0217 00536000
         BNH   @DL00215                                         02S0217 00537000
*    SWACTLS = SWACTLS && SWACTLS;     /*CLEAR SWA INTERFACE CONTROLS*/ 00538000
         LH    @08,SWACTLS                                      02S0218 00539000
         N     @08,@CF03511                                     02S0218 00540000
         LR    @06,@08                                          02S0218 00541000
         XR    @06,@08                                          02S0218 00542000
         STH   @06,SWACTLS                                      02S0218 00543000
*    SWASN = ON;                       /*INDICATE ASSIGN FUNCTION    */ 00544000
*    SWNEW = ON;                       /*INDICATE TO CREATE EPA'S    */ 00545000
         OI    SWASN,B'10001000'                                02S0220 00546000
*    SWCHN = ON;                       /*INDICATE TO CHAIN EPA'S     */ 00547000
         OI    SWCHN,B'10000000'                                02S0221 00548000
*    CALL IEFAB4F7                     /*ASSIGN FOR JFCBX VIA SWA       00549000
*                                        MANAGER INTERFACE RTN-RECORDS  00550000
*                                        ARE INITIALIZED TO ZERO BY     00551000
*                                        SWA MANAGER                 */ 00552000
*                  (SWACTLS,0,LSJXEPAP,ADDR(SMISVAID),          02S0222 00553000
*                   ADDR(SMISVAB),RCORDLEN,NUMJFCBX);           02S0222 00554000
         LA    @08,SWACTLS                                      02S0222 00555000
         ST    @08,@AL00001                                     02S0222 00556000
         LA    @08,@CF00125                                     02S0222 00557000
         ST    @08,@AL00001+4                                   02S0222 00558000
         L     @08,@PC00001+24                                  02S0222 00559000
         LA    @08,LSJXEPAP(,@08)                               02S0222 00560000
         ST    @08,@AL00001+8                                   02S0222 00561000
         LA    @08,SMISVAID                                     02S0222 00562000
         ST    @08,@TF00001                                     02S0222 00563000
         LA    @08,@TF00001                                     02S0222 00564000
         ST    @08,@AL00001+12                                  02S0222 00565000
         LA    @08,SMISVAB                                      02S0222 00566000
         ST    @08,@TF00002                                     02S0222 00567000
         LA    @08,@TF00002                                     02S0222 00568000
         ST    @08,@AL00001+16                                  02S0222 00569000
         LA    @08,@CF00166                                     02S0222 00570000
         ST    @08,@AL00001+20                                  02S0222 00571000
         LA    @08,NUMJFCBX                                     02S0222 00572000
         ST    @08,@AL00001+24                                  02S0222 00573000
         L     @15,@CV00099                                     02S0222 00574000
         LA    @01,@AL00001                                     02S0222 00575000
         BALR  @14,@15                                          02S0222 00576000
*    JFCBXPTR = SMISVAB(1);            /*INIT JFCBX MAP BASE         */ 00577000
         L     @08,SMISVAB                                      02S0223 00578000
         LR    JFCBXPTR,@08                                     02S0223 00579000
*    SIOTJFX = SMISVAB(1);             /*SET SIOT JFCBX CORE PTR     */ 00580000
         L     @06,@PC00001+24                                  02S0224 00581000
         L     @06,FSIOTPTR(,@06)                               02S0224 00582000
         ST    @08,SIOTJFX(,@06)                                02S0224 00583000
*    JFCBEXAD = SMISVA(1);             /*SET JFCB JFCBX SVA          */ 00584000
         L     @08,SJFCBPTR(,@06)                               02S0225 00585000
         MVC   JFCBEXAD(3,@08),SMISVA                           02S0225 00586000
*    COPYJFX = COPYDSAB->DSABSIOT->SIOTJFX; /*JFCBX TO COPY FROM     */ 00587000
         L     @08,@PC00001+12                                  02S0226 00588000
         L     @08,COPYDSAB(,@08)                               02S0226 00589000
         L     @08,DSABSIOT(,@08)                               02S0226 00590000
         L     COPYJFX,SIOTJFX(,@08)                            02S0226 00591000
*    DO I=1 TO NUMJFCBX;               /*LOOP FOR EACH JFCBX         */ 00592000
         LA    I,1                                              02S0227 00593000
         B     @DE00227                                         02S0227 00594000
@DL00227 DS    0H                                               02S0228 00595000
*      JXVOLSER = COPYJFX->JXVOLSER;   /*COPY VOL SERS TO JFCBX      */ 00596000
         MVC   JXVOLSER(90,JFCBXPTR),JXVOLSER(COPYJFX)          02S0228 00597000
*      IF I = 1 THEN                   /*FIRST JFCBX?        @YA00080*/ 00598000
         C     I,@CF00103                                       02S0229 00599000
         BNE   @RF00229                                         02S0229 00600000
*        DO;                           /*YES, GET CATALOG DEVTYPE &     00601000
*                                        ALIAS DSN           @YA00080*/ 00602000
*          IF COPYDSAB->DSABSIOT->SIOCDEVT=ON THEN /*DEVTYPE IN 02S0231 00603000
*                                        JFCBX?              @ZA00897*/ 00604000
         L     @08,@PC00001+12                                  02S0231 00605000
         L     @08,COPYDSAB(,@08)                               02S0231 00606000
         L     @08,DSABSIOT(,@08)                               02S0231 00607000
         TM    SIOCDEVT(@08),B'01000000'                        02S0231 00608000
         BNO   @RF00231                                         02S0231 00609000
*            DO;                       /*                    @ZA00897*/ 00610000
*              SIOCDEVT = ON;          /*DEVTYPE IN JFCBX.   @ZA00897*/ 00611000
         L     @08,@PC00001+24                                  02S0233 00612000
         L     @08,FSIOTPTR(,@08)                               02S0233 00613000
         OI    SIOCDEVT(@08),B'01000000'                        02S0233 00614000
*              JFCBXDEV = COPYJFX->JFCBXDEV; /*GET CATLG DEVTYPE        00615000
*                                                            @ZA00897*/ 00616000
         MVC   JFCBXDEV(4,JFCBXPTR),JFCBXDEV(COPYJFX)           02S0234 00617000
*            END;                      /*                    @ZA00897*/ 00618000
*          IF COPYDSAB->DSABSIOT->SIOALIAS=ON THEN /*CATALOGED DATASET  00619000
*                                                            @YA00080*/ 00620000
@RF00231 L     @08,@PC00001+12                                  02S0236 00621000
         L     @08,COPYDSAB(,@08)                               02S0236 00622000
         L     @08,DSABSIOT(,@08)                               02S0236 00623000
         TM    SIOALIAS(@08),B'10000000'                        02S0236 00624000
         BNO   @RF00236                                         02S0236 00625000
*            DO;                       /*WITH ALIAS?         @YA00080*/ 00626000
*              SIOALIAS = ON;          /*YES, INDICATE ALIAS DSN        00627000
*                                                            @YA00080*/ 00628000
         L     @06,@PC00001+24                                  02S0238 00629000
         L     @06,FSIOTPTR(,@06)                               02S0238 00630000
         OI    SIOALIAS(@06),B'10000000'                        02S0238 00631000
*              JFCBDSNM=COPYDSAB->DSABSIOT->SJFCBPTR->JFCBDSNM; /*      00632000
*                                        COPY REAL DSN       @ZA00897*/ 00633000
         L     @06,SJFCBPTR(,@06)                               02S0239 00634000
         L     @08,SJFCBPTR(,@08)                               02S0239 00635000
         MVC   JFCBDSNM(44,@06),JFCBDSNM(@08)                   02S0239 00636000
*              JFCBXNAM=COPYJFX->JFCBXNAM; /*COPY ALIAS DSN  @YA00080*/ 00637000
         MVC   JFCBXNAM(44,JFCBXPTR),JFCBXNAM(COPYJFX)          02S0240 00638000
*            END;                      /*END ALIAS DSN       @YA00080*/ 00639000
*        END;                          /*END FIRST JFCBX     @YA00080*/ 00640000
@RF00236 DS    0H                                               02S0243 00641000
*      IF I < NUMJFCBX THEN            /*LAST JFCBX?                 */ 00642000
@RF00229 C     I,NUMJFCBX                                       02S0243 00643000
         BNL   @RF00243                                         02S0243 00644000
*        DO;                                                    02S0244 00645000
*          JFCBXTTR = SMISVA(I+1);     /*NO,SET SVA OF NEXT JFCBX    */ 00646000
         LR    @08,I                                            02S0245 00647000
         SLA   @08,2                                            02S0245 00648000
         LA    @06,SMISVA(@08)                                  02S0245 00649000
         MVC   JFCBXTTR(3,JFCBXPTR),0(@06)                      02S0245 00650000
*          JFCBXNXT = SMISVAB(I+1);    /*SET NEXT JFCBX IN-CORE PTR  */ 00651000
         L     @08,SMISVAB(@08)                                 02S0246 00652000
         ST    @08,JFCBXNXT(,JFCBXPTR)                          02S0246 00653000
*          JFCBXPTR = JFCBXNXT;        /*SET MAP BASE TO NEXT JFCBX  */ 00654000
         LR    JFCBXPTR,@08                                     02S0247 00655000
*          COPYJFX = COPYJFX->JFCBXNXT; /*NEXT JFCBX TO COPY FROM    */ 00656000
         L     COPYJFX,JFCBXNXT(,COPYJFX)                       02S0248 00657000
*        END;                                                   02S0249 00658000
*    END;                                                       02S0250 00659000
@RF00243 AL    I,@CF00103                                       02S0250 00660000
@DE00227 C     I,NUMJFCBX                                       02S0250 00661000
         BNH   @DL00227                                         02S0250 00662000
*  END;                                /*END JFCBX REQUIRED PROCESS  */ 00663000
*      END;                            /* END COPY OF VOL & UNIT INFO*/ 00664000
@RF00212 DS    0H                                               01S0253 00665000
*/********************************************************************/ 00666000
*/*                                                                  */ 00667000
*/* SEGMENT NAME - HSKPINTF                                          */ 00668000
*/*                                                                  */ 00669000
*/* DESCRIPTIVE NAME - INTERFACE WITH JFCB HOUSEKEEPING              */ 00670000
*/*                                                                  */ 00671000
*/* FUNCTION - INVOKE JFCB HOUSEKEEPING TO PREPARE THE SIOT, JFCB,   */ 00672000
*/*   AND JFCBX OF THE REQUEST FOR ALLOCATION PROCESSING.            */ 00673000
*/*                                                                  */ 00674000
*/*   OPERATION -                                                    */ 00675000
*/*     THE PARAMETER LIST FOR HOUSEKEEPING IS SET UP AS DESCRIBED   */ 00676000
*/*     BY THE CODE. HOUSEKEEPING IS THEN INVOKED.   ERROR CODES     */ 00677000
*/*     FROM HOUSEKEEPING ARE TRANSLATED  INTO DYNAMIC               */ 00678000
*/*     ALLOCATION REASON CODES.                                     */ 00679000
*/*                                                                  */ 00680000
*/* NOTES -                                                          */ 00681000
*/*   * A BIT IS SET TO INDICATE NOT TO PROCESS STEPCATS, AS         */ 00682000
*/*     HOUSEKEEPING'S PROCESSING FOR STEPCATS SHOULD BE DONE ONLY   */ 00683000
*/*     AT STEP ALLOCATION.                                          */ 00684000
*/*   * IF THE JCT HAS NOT BEEN PREVIOUSLY UPDATED BY DYNAMIC        */ 00685000
*/*     ALLOCATION PROCESSING FOR THIS REQUEST, AN INDICATOR IS      */ 00686000
*/*     SET TO HAVE HOUSEKEEPING ADD AN EPA TO THE EPA CHAIN         */ 00687000
*/*     FOR THE JCT IF IT IS UPDATED. THE INDICATOR IS RESET BY      */ 00688000
*/*     HOUSEKEEPING TO INFORM DYNAMIC ALLOC IF IT CHAINS AN EPA     */ 00689000
*/*     FOR THE JCT.                                                 */ 00690000
*/*   * A BIT IS SET TO INDICATE THAT THE TIOT IS ENQ'D ON,          */ 00691000
*/*     SO THAT IF HOUSEKEEPING MUST INVOKE DYNAMIC ALLOCATION TO    */ 00692000
*/*     PROCESS PRIVATE CATALOGS, IT CAN INFORM DYNAMIC ALLOCATION   */ 00693000
*/*     THAT THE TIOT IS ALREADY ENQ'D ON.                           */ 00694000
*/*   * (PRIVATE CATALOGS REQUIRED BY HOUSEKEEPING'S PROCESSING FOR  */ 00695000
*/*     BOTH STEP AND DYNAMIC REQUESTS ARE DYNAMICALLY ALLOCATED.    */ 00696000
*/*     THESE CATALOGS MUST ALSO BE ALLOCATED DURING PROBLEM         */ 00697000
*/*     PROGRAM EXECUTION FOR OPEN'S PROCESSING.)                    */ 00698000
*/*     WHEN HOUSEKEEPING PROCESSES FOR STEP ALLOCATION, ANY         */ 00699000
*/*     PRIVATE CATALOGS WHICH WERE ALLOCATED ARE UNALLOCATED,       */ 00700000
*/*     AND THEREFORE, MUST BE REALLOCATED DURING COMMON             */ 00701000
*/*     ALLOCATION. THIS IS NECESSARY SINCE NO RESOURCES             */ 00702000
*/*     CAN BE ALLOCATED TO THE USER PRIOR TO COMMON ALLOCATION      */ 00703000
*/*     PROCESSING BECAUSE OF POSSIBLE DEADLOCK SITUATIONS. THE      */ 00704000
*/*     REALLOCATION IS ACCOMPLISHED BY HOUSEKEEPING'S CREATING AND  */ 00705000
*/*     CHAINING A SIOT AND JFCB INTO THE SIOT CHAIN OF THE          */ 00706000
*/*     STEP, WHICH IS THE INPUT TO COMMON ALLOCATION. DEADLOCKS     */ 00707000
*/*     ARE NOT POSSIBLE WHEN COMMON ALLOCATION PROCESSES            */ 00708000
*/*     FOR DYNAMIC ALLOCATION, SINCE WAITING FOR VOLUMES AND UNITS  */ 00709000
*/*     IS NOT DONE (EXCEPT FOR AUTHORIZED USERS). THEREFORE         */ 00710000
*/*     HOUSEKEEPING NEED NOT UNALLOCATE ANY PRIVATE CATALOGS        */ 00711000
*/*     ALLOCATED ON BEHALF OF A DYNAMIC ALLOCATION REQUEST.         */ 00712000
*/*   * IF NO UNIT PARAMETER WAS SPECIFIED FOR THIS          @YA00060*/ 00713000
*/*     ALLOCATION, A BIT IS SET IN THE HSKP FUNCTION MAP    @YA00060*/ 00714000
*/*     INDICATING 'IGNORE UNIT OVERRIDE'. THIS WILL INSURE  @YA00060*/ 00715000
*/*     THE DEFAULT UNIT, FROM UADS OR DEFAULT 'SYSALLDA',   @YA00060*/ 00716000
*/*     WILL NOT OVERRIDE UNIT TYPE RETRIEVED FROM THE       @YA00060*/ 00717000
*/*     CATALOG.                                             @YA00060*/ 00718000
*/*   * HSKP RETURN MAP IS PASSED SO THAT SELECTS DONE       @G24LPSJ*/ 00719000
*/*     DURING HOUSEKEEPING CAN BE DETECTED. IF MSS VOLUME   @G24LPSJ*/ 00720000
*/*     SELECTS WERE DONE, THEN AN MSS TERMINATE MUST BE     @G24LPSJ*/ 00721000
*/*     ISSUED.                                              @G24LPSJ*/ 00722000
*/*                                                                  */ 00723000
*/* INPUT -                                                          */ 00724000
*/*   ALFNCMAP - USER INPUT AND JCT EPA FLAG                         */ 00725000
*/*   ASCBTSB - DETERMINE IF USER IS A TSO USER                      */ 00726000
*/*   PSCBVMNT - DETERMINE IF TSO USER HAS MOUNT AUTHORIZATION       */ 00727000
*/*   FSIOTPTR - PTR TO SIOT TO BE PROCESSED                         */ 00728000
*/*   JCTPTR - PASSED TO HOUSEKEEPING                                */ 00729000
*/*   SCTPTR - PASSED TO HOUSEKEEPING                                */ 00730000
*/*   JSCBPTR - PASSED TO HOUSEKEEPING                               */ 00731000
*/*   CVT - PTR TO IOS UCB BOOK-UP TABLE FOR HOUSEKEEPING            */ 00732000
*/*   KEYTABLE - DETERMINE IF TEXT UNITS ARE SPECIFIED               */ 00733000
*/*   COPYDSAB - PTR TO DSAB FROM WHICH ASSOCIATED VOLUME AND UNIT   */ 00734000
*/*              INFORMATION IS COPIED                               */ 00735000
*/*   LASTEPAP - PTR TO LAST EPA, PASSED TO HOUSEKEEPING             */ 00736000
*/*   LSJXEPAP - PTR TO LAST EPA FOR ASSIGNED SIOT'S, JFCB'S, AND    */ 00737000
*/*              JFCBX'S, USED BY HOUSEKEEPING IF THIS TYPE OF       */ 00738000
*/*              RECORD IS ASSIGNED.                                 */ 00739000
*/*                                                                  */ 00740000
*/* OUTPUT -                                                         */ 00741000
*/*   SIOT'S, JFCB'S, AND JFCBX'S - UPDATED (AND CREATED FOR GDG ALL */ 00742000
*/*                                 REQUESTS, ETC.)                  */ 00743000
*/*   ALFNCMAP - JCT EPA BIT UPDATED IF JCT UPDATED BY HOUSEKEEPING  */ 00744000
*/*   JHRETMAP - MSS TERM BIT ON IF MSS SELECTS DONE         @G24LPSJ*/ 00745000
*/*   ERRCODE - REMAINS ZERO IF HOUSEKEEPING IS SUCCESSFUL, CONTAINS */ 00746000
*/*             ERROR REASON CODE IF HOUSEKEEPING FAILS              */ 00747000
*/*                                                                  */ 00748000
*/********************************************************************/ 00749000
*HSKFLAGS ='';                         /*CLEAR HOUSEKEEPING FLAGS    */ 00750000
@RF00167 XC    HSKFLAGS(2),HSKFLAGS                             02S0253 00751000
*JHRETMAP = '';                        /* CLEAR RETURN AREA  @G24LPSJ*/ 00752000
         MVI   JHRETMAP,X'00'                                   02S0254 00753000
*IF NOMONTSW = OFF THEN                /*USER WANT MOUNTING?         */ 00754000
         L     @08,@PC00001+20                                  02S0255 00755000
         TM    NOMONTSW(@08),B'00100000'                        02S0255 00756000
         BNZ   @RF00255                                         02S0255 00757000
*  DO;                                 /*YES, SET INDICATORS         */ 00758000
*    IF (ASCBTSB = ZERO                /*NOT A TSO USER?             */ 00759000
*        | PSCBVMNT = ON) THEN         /*OR TSO USER WITH MOUNT OPT? */ 00760000
         L     @08,@PC00001+4                                   02S0257 00761000
         L     @06,ASCBPTR(,@08)                                02S0257 00762000
         L     @06,ASCBTSB(,@06)                                02S0257 00763000
         LTR   @06,@06                                          02S0257 00764000
         BZ    @RT00257                                         02S0257 00765000
         L     @08,JSCBPTR(,@08)                                02S0257 00766000
         L     @08,JSCBPSCB(,@08)                               02S0257 00767000
         TM    PSCBVMNT(@08),B'00010000'                        02S0257 00768000
         BNO   @RF00257                                         02S0257 00769000
@RT00257 DS    0H                                               02S0258 00770000
*      DO;                                                      02S0258 00771000
*        HSKMOUNT = ON;                /*YES,SET MAY MOUNT BIT       */ 00772000
         OI    HSKMOUNT,B'00100000'                             02S0259 00773000
*        HSKOFFDV = ON;                /*MAY USE OFFLINE DEVICES BIT */ 00774000
         OI    HSKOFFDV,B'10000000'                             02S0260 00775000
*      END;                                                     02S0261 00776000
*    ELSE                              /*USER IS TSO W/O MOUNT OPT   */ 00777000
*      DO;                             /*CHECK AUTHORIZED FLAGS      */ 00778000
         B     @RC00257                                         02S0262 00779000
@RF00257 DS    0H                                               02S0263 00780000
*        IF MOUNTSW = ON THEN          /*MOUNT VOLUMES?              */ 00781000
         L     @08,@PC00001+20                                  02S0263 00782000
         TM    MOUNTSW(@08),B'00000001'                         02S0263 00783000
         BNO   @RF00263                                         02S0263 00784000
*          HSKMOUNT = ON;              /*YES, SET INDICATOR          */ 00785000
         OI    HSKMOUNT,B'00100000'                             02S0264 00786000
*        IF OFFLINSW = ON THEN         /*CONSIDER OFFLINE UNITS?     */ 00787000
@RF00263 L     @08,@PC00001+20                                  02S0265 00788000
         TM    OFFLINSW(@08),B'00001000'                        02S0265 00789000
         BNO   @RF00265                                         02S0265 00790000
*          HSKOFFDV = ON;              /*YES, SET INDICATOR          */ 00791000
         OI    HSKOFFDV,B'10000000'                             02S0266 00792000
*      END;                                                     02S0267 00793000
@RF00265 DS    0H                                               02S0268 00794000
*  END;                                /*END USER MOUNT TEST         */ 00795000
@RC00257 DS    0H                                               02S0269 00796000
*HSKNOREC = ON;                        /*DON'T CREATE/CHAIN SIOT &      00797000
*                                        JFCB FOR CATALOG    @ZA08440*/ 00798000
@RF00255 DS    0H                                               02S0270 00799000
*HSKNOCHN = ON;                        /*DON'T CHAIN GEN SIOTS TO SCT*/ 00800000
         OI    HSKNOREC,B'01000100'                             02S0270 00801000
*IF WTUNTSW = ON THEN                  /*OKAY TO WAIT FOR UNITS?     */ 00802000
         L     @08,@PC00001+20                                  02S0271 00803000
         TM    WTUNTSW(@08),B'00010000'                         02S0271 00804000
         BNO   @RF00271                                         02S0271 00805000
*  HSKWTUNT = ON;                      /*YES,SET INDICATOR           */ 00806000
         OI    HSKWTUNT,B'00010000'                             02S0272 00807000
*IF WTVOLSW = ON THEN                  /*OKAY TO WAIT FOR VOLUMES?   */ 00808000
@RF00271 L     @08,@PC00001+20                                  02S0273 00809000
         TM    WTVOLSW(@08),B'10000000'                         02S0273 00810000
         BNO   @RF00273                                         02S0273 00811000
*  HSKWTVOL = ON;                      /*YES,SET INDICATOR           */ 00812000
         OI    HSKWTVOL,B'00000010'                             02S0274 00813000
*HSKNSCAT = ON;                        /*DON'T PROCESS STEPCATS      */ 00814000
@RF00273 OI    HSKNSCAT,B'00000001'                             02S0275 00815000
*HSKNOENQ = ON;                        /*TIOT ENQ'D UPON             */ 00816000
         OI    HSKNOENQ,B'01000000'                             02S0276 00817000
*IF EPAJCTSW = OFF THEN                /*EPA FOR JCT ALREADY CHAINED?*/ 00818000
         L     @08,@PC00001+20                                  02S0277 00819000
         TM    EPAJCTSW(@08),B'00000001'                        02S0277 00820000
         BNZ   @RF00277                                         02S0277 00821000
*  HSKJCT = ON;                        /*NO,CREATE EPA IF UPDATE JCT */ 00822000
         OI    HSKJCT,B'00010000'                               02S0278 00823000
*IF NORESSW = ON THEN                  /*DATA SET NOT TO BE RESV'D   */ 00824000
@RF00277 L     @08,@PC00001+20                                  02S0279 00825000
         TM    NORESSW(@08),B'00100000'                         02S0279 00826000
         BNO   @RF00279                                         02S0279 00827000
*  HSKNORES = ON;                      /*YES, INFORM HOUSEKEEPING    */ 00828000
         OI    HSKNORES,B'00001000'                             02S0280 00829000
*ELSE                                  /*OK FOR DSN ENQS     @YM06112*/ 00830000
*  HSKPDQSW = ON;                      /*DO DEQ IF ERROR     @YM06112*/ 00831000
         B     @RC00279                                         02S0281 00832000
@RF00279 L     @08,@PC00001+20                                  02S0281 00833000
         OI    HSKPDQSW(@08),B'00001000'                        02S0281 00834000
*IF UNITTUP = 0 THEN                   /*NO UNIT GIVEN       @YA00060*/ 00835000
@RC00279 L     @08,@PC00001                                     02S0282 00836000
         L     @08,KEYTABP(,@08)                                02S0282 00837000
         L     @08,UNITTUP(,@08)                                02S0282 00838000
         LTR   @08,@08                                          02S0282 00839000
         BNZ   @RF00282                                         02S0282 00840000
*  HSKNOVRD = ON;                      /*NO UNIT OVERRIDE.   @YA00060*/ 00841000
         OI    HSKNOVRD,B'00000010'                             02S0283 00842000
*NSIOTERR = ZERO;                      /*INIT NON-SIOT RELATED RCODE */ 00843000
@RF00282 SLR   @08,@08                                          02S0284 00844000
         STH   @08,NSIOTERR                                     02S0284 00845000
*CALL IEFAB451                         /*INVOKE HOUSEKEEPING         */ 00846000
*              (HSKFLAGS,FSIOTPTR,SCTSNUMB,JCTPTR,SCTPTR,LASTEPAP,      00847000
*       LSJXEPAP,JSCBPTR,CVTILK2,NSIOTERR,JHRETMAP);            02S0285 00848000
         LA    @08,HSKFLAGS                                     02S0285 00849000
         ST    @08,@AL00001                                     02S0285 00850000
         L     @08,@PC00001+24                                  02S0285 00851000
         LA    @06,FSIOTPTR(,@08)                               02S0285 00852000
         ST    @06,@AL00001+4                                   02S0285 00853000
         L     @06,@PC00001+4                                   02S0285 00854000
         L     @01,SCTPTR(,@06)                                 02S0285 00855000
         LA    @15,SCTSNUMB(,@01)                               02S0285 00856000
         ST    @15,@AL00001+8                                   02S0285 00857000
         LA    @15,JCTPTR(,@06)                                 02S0285 00858000
         ST    @15,@AL00001+12                                  02S0285 00859000
         LA    @15,SCTPTR(,@06)                                 02S0285 00860000
         ST    @15,@AL00001+16                                  02S0285 00861000
         L     @15,@PC00001+8                                   02S0285 00862000
         ST    @15,@AL00001+20                                  02S0285 00863000
         LA    @08,LSJXEPAP(,@08)                               02S0285 00864000
         ST    @08,@AL00001+24                                  02S0285 00865000
         ST    @06,@AL00001+28                                  02S0285 00866000
         L     @08,CVTPTR                                       02S0285 00867000
         LA    @08,CVTILK2(,@08)                                02S0285 00868000
         ST    @08,@AL00001+32                                  02S0285 00869000
         LA    @08,NSIOTERR                                     02S0285 00870000
         ST    @08,@AL00001+36                                  02S0285 00871000
         LA    @08,JHRETMAP                                     02S0285 00872000
         ST    @08,@AL00001+40                                  02S0285 00873000
         L     @15,@CV00162                                     02S0285 00874000
         LA    @01,@AL00001                                     02S0285 00875000
         BALR  @14,@15                                          02S0285 00876000
*                                      /* ADD RETURN FMAP    @G24LPSJ*/ 00877000
*IF R15 ^= ZERO THEN                   /*ERROR?                      */ 00878000
         LTR   R15,R15                                          02S0286 00879000
         BZ    @RF00286                                         02S0286 00880000
*    CALL SETRCODE;                    /*SET DYNAMIC ERR REASON CODE */ 00881000
         BAL   @14,SETRCODE                                     02S0287 00882000
*IF HSKJCT = OFF THEN                  /*EPA FOR JCT CHAINED?        */ 00883000
@RF00286 TM    HSKJCT,B'00010000'                               02S0288 00884000
         BNZ   @RF00288                                         02S0288 00885000
*  EPAJCTSW = ON;                      /*YES,SET INDICATOR           */ 00886000
         L     @08,@PC00001+20                                  02S0289 00887000
         OI    EPAJCTSW(@08),B'00000001'                        02S0289 00888000
*  END;                                                         01S0290 00889000
@RF00288 DS    0H                                               01S0291 00890000
*IF ERRCODE=ZERO THEN                  /*SUCCESSFUL SO FAR?          */ 00891000
@RF00165 SLR   @08,@08                                          01S0291 00892000
         L     @06,@PC00001+16                                  01S0291 00893000
         SLR   @15,@15                                          01S0291 00894000
         ICM   @15,3,ERRCODE(@06)                               01S0291 00895000
         CR    @08,@15                                          01S0291 00896000
         BNE   @RF00291                                         01S0291 00897000
*  DO;                                 /*YES                         */ 00898000
*/********************************************************************/ 00899000
*/*                                                                  */ 00900000
*/* SEGMENT NAME - SPACEDEF                                          */ 00901000
*/*                                                                  */ 00902000
*/* DESCRIPTIVE NAME - DEFAULT SPACE PARAMETERS                      */ 00903000
*/*                                                                  */ 00904000
*/* FUNCTION - IF SPACE PARMS ARE NOT SPECIFIED FOR SUBSYSTEM        */ 00905000
*/*   OR NEW DIRECT ACCESS DATA SETS, DEFAULT THEM USING             */ 00906000
*/*   ALLOCATION DEFAULTS.                                           */ 00907000
*/*                                                                  */ 00908000
*/*   OPERATION - SPACE PARMS ARE DETERMINED TO BE NOT SPECIFIED     */ 00909000
*/*     BY THE ABSENCE OF THE PRIMARY AND SECONDARY SPACE QUANTITY   */ 00910000
*/*     TEXT UNITS, AND THE RLSE, SPACE FORMAT, AND ROUND            */ 00911000
*/*     TEXT UNITS. (NOTE:  ALL OTHER SPACE                          */ 00912000
*/*     TEXT UNITS ARE MUTUALLY INCLUSIVE WITH THESE.) THE           */ 00913000
*/*     ALLOCATION DEFAULTS ARE CONTAINED IN THE CSECT, IEFAB445.    */ 00914000
*/*                                                                  */ 00915000
*/* INPUT -                                                          */ 00916000
*/*   IEFAB445 - SPACE DEFAULTS                                      */ 00917000
*/*   KEYTABLE - TO DETERMINE IF TEXT UNITS ARE SPECIFIED            */ 00918000
*/*   SIOT - TO DETERMINE IF THE DATA SET IS NEW AND                 */ 00919000
*/*          DIRECT ACCESS, OR A SUBSYSTEM DATA SET.                 */ 00920000
*/*                                                                  */ 00921000
*/* OUTPUT -                                                         */ 00922000
*/*   JFCB - UPDATED WITH SPACE PARAMETERS                           */ 00923000
*/*                                                                  */ 00924000
*/********************************************************************/ 00925000
*IF (PRIMETUP = ZERO                                            02S0293 00926000
*    & SECNDTUP = ZERO                                          02S0293 00927000
*    & RLSETUP = ZERO                                           02S0293 00928000
*    & SPFRMTUP = ZERO                                          02S0293 00929000
*    & ROUNDTUP = ZERO)                /* SPACE NOT SPECIFIED?       */ 00930000
*   & (SIOTSSDS = ON                   /* AND SUBSYSTEM DATA SET?    */ 00931000
*      | SIO3DACC = ON & SCTSNEW = ON) THEN /*OR NEW,D.A. DATA SET?  */ 00932000
         L     @06,@PC00001                                     02S0293 00933000
         L     @06,KEYTABP(,@06)                                02S0293 00934000
         C     @08,PRIMETUP(,@06)                               02S0293 00935000
         BNE   @RF00293                                         02S0293 00936000
         C     @08,SECNDTUP(,@06)                               02S0293 00937000
         BNE   @RF00293                                         02S0293 00938000
         C     @08,RLSETUP(,@06)                                02S0293 00939000
         BNE   @RF00293                                         02S0293 00940000
         C     @08,SPFRMTUP(,@06)                               02S0293 00941000
         BNE   @RF00293                                         02S0293 00942000
         C     @08,ROUNDTUP(,@06)                               02S0293 00943000
         BNE   @RF00293                                         02S0293 00944000
         L     @08,@PC00001+24                                  02S0293 00945000
         L     @08,FSIOTPTR(,@08)                               02S0293 00946000
         TM    SIOTSSDS(@08),B'10000000'                        02S0293 00947000
         BO    @RT00293                                         02S0293 00948000
         TM    SIO3DACC(@08),B'00100000'                        02S0293 00949000
         BNO   @RF00293                                         02S0293 00950000
         TM    SCTSNEW(@08),B'00000100'                         02S0293 00951000
         BNO   @RF00293                                         02S0293 00952000
@RT00293 DS    0H                                               02S0294 00953000
*  DO;                                 /* YES,DEFAULT SPACE PARMS    */ 00954000
*    JFCBPQTY = DEFPQTY;               /* PRIMARY QTY                */ 00955000
         L     @08,@PC00001+24                                  02S0295 00956000
         L     @08,FSIOTPTR(,@08)                               02S0295 00957000
         L     @08,SJFCBPTR(,@08)                               02S0295 00958000
         L     @06,@CA00650                                     02S0295 00959000
         MVC   JFCBPQTY(3,@08),DEFPQTY-IEFAB445(@06)            02S0295 00960000
*    JFCBSQTY = DEFSQTY;               /* SECONDARY QTY              */ 00961000
         MVC   JFCBSQTY(3,@08),DEFSQTY-IEFAB445(@06)            02S0296 00962000
*    JFCBDQTY = DEFDQTY;               /* DIRECTORY QUANTITY         */ 00963000
         MVC   JFCBDQTY(3,@08),DEFDQTY-IEFAB445(@06)            02S0297 00964000
*    IF DEFTRK = ON THEN               /* SPACE IN TRKS              */ 00965000
         TM    DEFTRK-IEFAB445(@06),B'10000000'                 02S0298 00966000
         BNO   @RF00298                                         02S0298 00967000
*      JFCBSPAC= '10'B;                                         02S0299 00968000
         NI    JFCBSPAC(@08),B'10111111'                        02S0299 00969000
         OI    JFCBSPAC(@08),B'10000000'                        02S0299 00970000
*    ELSE                              /* OR                         */ 00971000
*      IF DEFCYL = ON THEN             /* SPACE IN CYLINDERS         */ 00972000
         B     @RC00298                                         02S0300 00973000
@RF00298 L     @08,@CA00650                                     02S0300 00974000
         TM    DEFCYL-IEFAB445(@08),B'01000000'                 02S0300 00975000
         BNO   @RF00300                                         02S0300 00976000
*        JFCBSPAC = '11'B;                                      02S0301 00977000
         L     @08,@PC00001+24                                  02S0301 00978000
         L     @08,FSIOTPTR(,@08)                               02S0301 00979000
         L     @08,SJFCBPTR(,@08)                               02S0301 00980000
         OI    JFCBSPAC(@08),B'11000000'                        02S0301 00981000
*      ELSE                            /* OR                         */ 00982000
*        IF DEFBLKLN = ON THEN         /* SPACE IN AVG RECORD LENGTH */ 00983000
         B     @RC00300                                         02S0302 00984000
@RF00300 L     @08,@CA00650                                     02S0302 00985000
         TM    DEFBLKLN-IEFAB445(@08),B'00100000'               02S0302 00986000
         BNO   @RF00302                                         02S0302 00987000
*          DO;                                                  02S0303 00988000
*            JFCBSPAC = '01'B;                                  02S0304 00989000
         L     @06,@PC00001+24                                  02S0304 00990000
         L     @06,FSIOTPTR(,@06)                               02S0304 00991000
         L     @06,SJFCBPTR(,@06)                               02S0304 00992000
         NI    JFCBSPAC(@06),B'01111111'                        02S0304 00993000
         OI    JFCBSPAC(@06),B'01000000'                        02S0304 00994000
*            JFCBDRLH = DEFDRLH;       /* AVG RECORD LENGTH          */ 00995000
         MVC   JFCBDRLH(3,@06),DEFDRLH-IEFAB445(@08)            02S0305 00996000
*          END;                                                 02S0306 00997000
*    IF DEFRLSE = ON THEN              /* RLSE SPECIFIED             */ 00998000
@RF00302 DS    0H                                               02S0307 00999000
@RC00300 DS    0H                                               02S0307 01000000
@RC00298 L     @08,@CA00650                                     02S0307 01001000
         TM    DEFRLSE-IEFAB445(@08),B'00010000'                02S0307 01002000
         BNO   @RF00307                                         02S0307 01003000
*      JFCRLSE = RLSE;                                          02S0308 01004000
         L     @08,@PC00001+24                                  02S0308 01005000
         L     @08,FSIOTPTR(,@08)                               02S0308 01006000
         L     @08,SJFCBPTR(,@08)                               02S0308 01007000
         OI    JFCRLSE(@08),B'11000000'                         02S0308 01008000
*    IF DEFCONTG = ON THEN             /* CONTIG SPECIFIED           */ 01009000
@RF00307 L     @08,@CA00650                                     02S0309 01010000
         TM    DEFCONTG-IEFAB445(@08),B'00001000'               02S0309 01011000
         BNO   @RF00309                                         02S0309 01012000
*      JFCONTIG = ON;                                           02S0310 01013000
         L     @08,@PC00001+24                                  02S0310 01014000
         L     @08,FSIOTPTR(,@08)                               02S0310 01015000
         L     @08,SJFCBPTR(,@08)                               02S0310 01016000
         OI    JFCONTIG(@08),B'00001000'                        02S0310 01017000
*    IF DEFMIXG = ON THEN              /* MXIG SPECIFIED             */ 01018000
@RF00309 L     @08,@CA00650                                     02S0311 01019000
         TM    DEFMIXG-IEFAB445(@08),B'00000100'                02S0311 01020000
         BNO   @RF00311                                         02S0311 01021000
*      JFCMIXG = ON;                                            02S0312 01022000
         L     @08,@PC00001+24                                  02S0312 01023000
         L     @08,FSIOTPTR(,@08)                               02S0312 01024000
         L     @08,SJFCBPTR(,@08)                               02S0312 01025000
         OI    JFCMIXG(@08),B'00000100'                         02S0312 01026000
*    IF DEFALX = ON THEN               /* ALX  SPECIFIED             */ 01027000
@RF00311 L     @08,@CA00650                                     02S0313 01028000
         TM    DEFALX-IEFAB445(@08),B'00000010'                 02S0313 01029000
         BNO   @RF00313                                         02S0313 01030000
*      JFCALX = ON;                                             02S0314 01031000
         L     @08,@PC00001+24                                  02S0314 01032000
         L     @08,FSIOTPTR(,@08)                               02S0314 01033000
         L     @08,SJFCBPTR(,@08)                               02S0314 01034000
         OI    JFCALX(@08),B'00000010'                          02S0314 01035000
*    IF DEFROUND = ON THEN             /* ROUND SPECIFIED            */ 01036000
@RF00313 L     @08,@CA00650                                     02S0315 01037000
         TM    DEFROUND-IEFAB445(@08),B'00000001'               02S0315 01038000
         BNO   @RF00315                                         02S0315 01039000
*      JFCROUND = ON;                                           02S0316 01040000
         L     @08,@PC00001+24                                  02S0316 01041000
         L     @08,FSIOTPTR(,@08)                               02S0316 01042000
         L     @08,SJFCBPTR(,@08)                               02S0316 01043000
         OI    JFCROUND(@08),B'00000001'                        02S0316 01044000
*  END;                                                         02S0317 01045000
@RF00315 DS    0H                                               02S0318 01046000
*/********************************************************************/ 01047000
*/*                                                          @Y30QPPB*/ 01048000
*/* SEGMENT NAME - JES3INTF                                  @Y30QPPB*/ 01049000
*/*                                                          @Y30QPPB*/ 01050000
*/* DESCRIPTIVE NAME - INTERFACE WITH JES3                   @Y30QPPB*/ 01051000
*/*                                                          @Y30QPPB*/ 01052000
*/* FUNCTION - INVOKE JES3 TO PERFORM INITIALIZATION AND     @Y30QPPB*/ 01053000
*/*            SETUP FOR THE REQUEST BEING DYNAMICALLY       @Y30QPPB*/ 01054000
*/*            ALLOCATED.                                    @Y30QPPB*/ 01055000
*/*                                                          @Y30QPPB*/ 01056000
*/*  OPERATION - INITIALIZE THE SSOB, BUILD THE FUNCTION     @Y30QPPB*/ 01057000
*/*              DEPENDENT AREA. AN INTERNAL INDICATOR IS    @Y30QPPB*/ 01058000
*/*              SET WHICH WILL CAUSE ANY RESOURCES          @Y30QPPB*/ 01059000
*/*              ALLOCATED TO THE REQUEST OR SET UP          @Y30QPPB*/ 01060000
*/*              BY JES3 TO BE RELEASED IF AN ERROR          @Y30QPPB*/ 01061000
*/*              OCCURS DURING LATER PROCESSING OF           @Y30QPPB*/ 01062000
*/*              THE REQUEST.  THE INDICATOR IS SET          @Y30QPPB*/ 01063000
*/*              BEFORE INVOKING JES3, SINCE THE             @Y30QPPB*/ 01064000
*/*              INDICATOR IS ALSO USED BY THE DYNAMIC       @Y30QPPB*/ 01065000
*/*              ALLOCATION ESTAE EXIT.  THIS ENSURES        @Y30QPPB*/ 01066000
*/*              RESOURCES ARE RELEASED IF AN ABEND          @Y30QPPB*/ 01067000
*/*              OCCURS.  JES3 IS THEN INVOKED. IF AN        @Y30QPPB*/ 01068000
*/*              ERROR IS RETURNED BY JES3, TRANSLATE THE    @Y30QPPB*/ 01069000
*/*              JES3 RETURN CODE TO THE APPROPRIATE         @Y30QPPB*/ 01070000
*/*              DYNAMIC ALLOCATION RETURN CODE.             @Y30QPPB*/ 01071000
*/*                                                          @Y30QPPB*/ 01072000
*/* INPUT -                                                  @Y30QPPB*/ 01073000
*/*  FSIOTPTR - ADDRESS OF FIRST SIOT FOR THE REQUEST        @Y30QPPB*/ 01074000
*/*  JSCBPTR  - ADDRESS OF JSCB                              @Y30QPPB*/ 01075000
*/*  JSCBPSCB - ADDRESS OF PSCB                              @Y30QPPB*/ 01076000
*/*  PSCBVMNT - ON IF TSO USER HAS MOUNT AUTHORIZATION       @Y30QPPB*/ 01077000
*/*  ASCBPTR  - ADDRESS OF ASCB                              @Y30QPPB*/ 01078000
*/*  ASCBTSB  - ZERO IF TASK REPRESENTS A NON-TSO USER OR    @Y30QPPB*/ 01079000
*/*             ADDRESS OF TSB IF TASK REPRESENTS A TSO USER @Y30QPPB*/ 01080000
*/*  ALFNCMAP - FUNCTION MAP CONTAINING USER INPUT           @Y30QPPB*/ 01081000
*/*  REASONCD - DYNAMIC ALLOCATION ERROR CODE AREA           @Y30QPPB*/ 01082000
*/*                                                          @Y30QPPB*/ 01083000
*/* OUTPUT -                                                 @Y30QPPB*/ 01084000
*/*  IF JES3 SUCCESSFUL - JES3 INITIALIZATION AND SETUP      @Y30QPPB*/ 01085000
*/*   PERFORMED FOR THE REQUEST                              @Y30QPPB*/ 01086000
*/*  UNALOCSW - SET ON TO INVOKE COMMON UNALLOCATION         @Y30QPPB*/ 01087000
*/*             IF AN ERROR OCCURS                           @Y30QPPB*/ 01088000
*/*  IF JES3 UNSUCCESSFUL - ERRCODE (IN REASONCD) SET WITH   @Y30QPPB*/ 01089000
*/*             DYNAMIC    JES3                              @Y30QPPB*/ 01090000
*/*               CODE     CODE    MEANING                   @Y30QPPB*/ 01091000
*/*             RCVOLNMT     4     REQUESTED VOLUME NOT      @Y30QPPB*/ 01092000
*/*                                MOUNTED, VOLUME MOUNTING  @Y30QPPB*/ 01093000
*/*                                NOT ALLOWED.              @Y30QPPB*/ 01094000
*/*             RCVOLNAV     8     REQUESTED VOLUME BUSY,    @Y30QPPB*/ 01095000
*/*                                WAITING FOR VOLUME NOT    @Y30QPPB*/ 01096000
*/*                                ALLOWED.                  @Y30QPPB*/ 01097000
*/*             RCVOLNAV    12     REQUESTED VOLUME UNAVAIL- @Y30QPPB*/ 01098000
*/*                                ABLE, VOLUME FOUND IN     @Y30QPPB*/ 01099000
*/*                                JES3 UNAVAILABLE TABLE    @Y30QPPB*/ 01100000
*/*             RCDSUNAV    16     REQUESTED DATASET BUSY,   @Y30QPPB*/ 01101000
*/*                                WAITING FOR DATASET NOT   @Y30QPPB*/ 01102000
*/*                                ALLOWED.                  @Y30QPPB*/ 01103000
*/*             RCXCLUSV   16      REQUESTED DATASET BUSY,   @ZA04560*/ 01104000
*/*                                WAITING FOR DATASET NOT   @ZA04560*/ 01105000
*/*                                ALLOWED AND REQUEST IS TO @ZA04560*/ 01106000
*/*                                CHANGE DSNAME ENQ FROM    @ZA04560*/ 01107000
*/*                                SHR TO EXCLUSIVE.         @ZA04560*/ 01108000
*/*             RCUNITNA    20     REQUESTED UNIT(S) NOT     @Y30QPPB*/ 01109000
*/*                                AVAILABLE, NO UNITS OF    @Y30QPPB*/ 01110000
*/*                                TYPE REQUESTED AVAILABLE  @Y30QPPB*/ 01111000
*/*                                FOR USE.                  @Y30QPPB*/ 01112000
*/*             RCOUNIT     24     NOT ENOUGH DEVICES OF     @Y30QPPB*/ 01113000
*/*                                TYPE REQUESTED EXIST ON   @Y30QPPB*/ 01114000
*/*                                THE PROCESSOR FROM WHICH  @Y30QPPB*/ 01115000
*/*                                THE ALLOCATION REQUEST    @Y30QPPB*/ 01116000
*/*                                ORIGINATED.               @Y30QPPB*/ 01117000
*/*                                                          @Y30QPPB*/ 01118000
*/*             RCCANCEL    28     REQUEST CANCELLED BY      @ZM00424*/ 01119000
*/*                                OPERATOR                  @ZM00424*/ 01120000
*/********************************************************************/ 01121000
*SSOB = SSOB && SSOB;                  /*CLEAR THE SSOB      @Y30QPPB*/ 01122000
@RF00293 XC    SSOB(20),SSOB                                    02S0318 01123000
*SSOBID = SSOBCHAR;                    /*IDENTIFIER - 'SSOB' @Y30QPPB*/ 01124000
         MVC   SSOBID(4),@CC00181                               02S0319 01125000
*SSOBLEN = LENGTH(SSOB);               /*LENGTH OF HEADER    @Y30QPPB*/ 01126000
         MVC   SSOBLEN(2),@CH01930                              02S0320 01127000
*SSOBFUNC = SSOBDYCD;                  /*FUNCTION IDENTIFIER @Y30QPPB*/ 01128000
         MVC   SSOBFUNC(2),@CH03459                             02S0321 01129000
*/********************************************************************/ 01130000
*/*                                                          @Y30QPPB*/ 01131000
*/* SEGMENT NAME - BLDFUNCT                                  @Y30QPPB*/ 01132000
*/*                                                          @Y30QPPB*/ 01133000
*/* DESCRIPTIVE NAME - BUILD FUNCTION AREA OF SSOB           @Y30QPPB*/ 01134000
*/*                                                          @Y30QPPB*/ 01135000
*/* FUNCTION - TO BUILD THE FUNCTION DEPENDENT AREA OF THE   @Y30QPPB*/ 01136000
*/*            SSOB                                          @Y30QPPB*/ 01137000
*/*                                                          @Y30QPPB*/ 01138000
*/*  OPERATION - THE FUNCTION DEPENDENT AREA IS SET UP WITH  @Y30QPPB*/ 01139000
*/*                  . THE ADDRESS OF THE FIRST SIOT FOR THE @Y30QPPB*/ 01140000
*/*                    REQUEST        AND                    @Y30QPPB*/ 01141000
*/*                  . THE ADDRESS OF THE FLAG FIELD         @Y30QPPB*/ 01142000
*/*              THE BITS IN THE FLAG FIELDS ARE SET         @Y30QPPB*/ 01143000
*/*              THE ADDRESS OF THE FUNCTION DEPENDENT AREA  @Y30QPPB*/ 01144000
*/*              IS PLACED IN THE SSOBINDV FIELD OF THE SSOB.@Y30QPPB*/ 01145000
*/*                                                          @Y30QPPB*/ 01146000
*/* INPUT -                                                  @Y30QPPB*/ 01147000
*/*  FSIOTPTR - ADDRESS OF FIRST SIOT FOR REQUEST            @Y30QPPB*/ 01148000
*/*  ALFNCMAP - FUNCTION MAP CONTAINING USER INPUT           @Y30QPPB*/ 01149000
*/*  JSCBPTR  - ADDRESS OF JSCB                              @Y30QPPB*/ 01150000
*/*  JSCBPSCB - ADDRESS OF PSCB                              @Y30QPPB*/ 01151000
*/*  PSCBVMNT - ON IF TSO USER HAS MOUNT AUTHORIZATION       @Y30QPPB*/ 01152000
*/*  ASCBPTR  - ADDRESS OF ASCB                              @Y30QPPB*/ 01153000
*/*  ASCBTSB  - ZERO IF TASK REPRESENTS A NON-TSO USER OR    @Y30QPPB*/ 01154000
*/*             ADDRESS OF TSB IF TASK REPRESENTS A TSO USER @Y30QPPB*/ 01155000
*/*  SSOBINDV - FIELD IN SSOB WHICH CONTAINS THE ADDRESS OF  @Y30QPPB*/ 01156000
*/*             THE FUNCTION DEPENDENT AREA.  THIS FIELD IS  @Y30QPPB*/ 01157000
*/*             ZERO ON ENTRY TO THIS SEGMENT.               @Y30QPPB*/ 01158000
*/*                                                          @Y30QPPB*/ 01159000
*/* OUTPUT -                                                 @Y30QPPB*/ 01160000
*/*  THE FUNCTION DEPENDENT AREA OF THE SSOB BUILT.          @Y30QPPB*/ 01161000
*/*  SSOBINDV - ADDRESS OF FUNCTION DEPENDENT AREA           @Y30QPPB*/ 01162000
*/*                                                          @Y30QPPB*/ 01163000
*/********************************************************************/ 01164000
*SSDY = SSDY && SSDY;                  /*CLEAR THE FUNCT AREA@Y30QPPB*/ 01165000
         XC    SSDY(16),SSDY                                    03S0322 01166000
*SSDYLEN = LENGTH(SSDY);               /*LNGTH OF FUNCT AREA @Y30QPPB*/ 01167000
         MVC   SSDYLEN(2),@CH00069                              03S0323 01168000
*SSDYSIOT = FSIOTPTR;                  /*ADDR OF FIRST SIOT  @Y30QPPB*/ 01169000
         L     @08,@PC00001+24                                  03S0324 01170000
         L     @08,FSIOTPTR(,@08)                               03S0324 01171000
         ST    @08,SSDYSIOT                                     03S0324 01172000
*SSDYPFLG = ADDR(JESFLAGS);            /*ADDR OF FLAG FIELD  @Y30QPPB*/ 01173000
         LA    @08,JESFLAGS                                     03S0325 01174000
         ST    @08,SSDYPFLG                                     03S0325 01175000
*JESFLAGS = JESFLAGS && JESFLAGS;      /*ZERO THE FLAG FIELD @Y30QPPB*/ 01176000
         XC    JESFLAGS(2),JESFLAGS                             03S0326 01177000
*IF WTVOLSW = ON THEN                  /*INPUT WAIT FOR VOLS?@Y30QPPB*/ 01178000
         L     @08,@PC00001+20                                  03S0327 01179000
         TM    WTVOLSW(@08),B'10000000'                         03S0327 01180000
         BNO   @RF00327                                         03S0327 01181000
*  JSWTVOL=ON;                         /*YES,JES WAIT FOR VOL@Y30QPPB*/ 01182000
         OI    JSWTVOL,B'00001000'                              03S0328 01183000
*IF WTDSNSW = ON THEN                  /*INPUT WAIT FOR DSN? @Y30QPPB*/ 01184000
@RF00327 L     @08,@PC00001+20                                  03S0329 01185000
         TM    WTDSNSW(@08),B'01000000'                         03S0329 01186000
         BNO   @RF00329                                         03S0329 01187000
*  JSWTDSN=ON;                         /*YES,JES WAIT FOR DSN@Y30QPPB*/ 01188000
         OI    JSWTDSN,B'00010000'                              03S0330 01189000
*IF WTUNTSW = ON THEN                  /*INPUT WAIT FOR UNIT?@Y30QPPB*/ 01190000
@RF00329 L     @08,@PC00001+20                                  03S0331 01191000
         TM    WTUNTSW(@08),B'00010000'                         03S0331 01192000
         BNO   @RF00331                                         03S0331 01193000
*  JSWTADEV=ON;                        /*YES,JES UNIT WAIT   @Y30QPPB*/ 01194000
         OI    JSWTADEV,B'00100000'                             03S0332 01195000
*IF PCATINIT = ON THEN                 /*ALLOC PCAT TO INIT? @Y30QPPB*/ 01196000
@RF00331 L     @08,@PC00001+20                                  03S0333 01197000
         TM    PCATINIT(@08),B'01000000'                        03S0333 01198000
         BNO   @RF00333                                         03S0333 01199000
*  JSPCATIN =ON;                       /*YES,SET JES BIT     @Y30QPPB*/ 01200000
         OI    JSPCATIN,B'00000100'                             03S0334 01201000
*IF NOMONTSW = OFF THEN                /*USER WANT MOUNTING? @Y30QPPB*/ 01202000
@RF00333 L     @08,@PC00001+20                                  03S0335 01203000
         TM    NOMONTSW(@08),B'00100000'                        03S0335 01204000
         BNZ   @RF00335                                         03S0335 01205000
*  DO;                                 /*YES,SET JES BITS    @Y30QPPB*/ 01206000
*    IF (ASCBTSB = ZERO                /*NOT A TSO USER? OR  @Y30QPPB*/ 01207000
*        | PSCBVMNT = ON) THEN         /*TSO USER WITH MOUNT?@Y30QPPB*/ 01208000
         L     @08,@PC00001+4                                   03S0337 01209000
         L     @06,ASCBPTR(,@08)                                03S0337 01210000
         L     @06,ASCBTSB(,@06)                                03S0337 01211000
         LTR   @06,@06                                          03S0337 01212000
         BZ    @RT00337                                         03S0337 01213000
         L     @08,JSCBPTR(,@08)                                03S0337 01214000
         L     @08,JSCBPSCB(,@08)                               03S0337 01215000
         TM    PSCBVMNT(@08),B'00010000'                        03S0337 01216000
         BNO   @RF00337                                         03S0337 01217000
@RT00337 DS    0H                                               03S0338 01218000
*      DO;                             /*YES,SET JES BITS    @Y30QPPB*/ 01219000
*        JSVOLMNT  = ON;               /*ALLOW VOL MOUNTING  @Y30QPPB*/ 01220000
*        JSOFFLIN = ON;                /*CONSIDER OFFLINES   @Y30QPPB*/ 01221000
         OI    JSVOLMNT,B'11000000'                             03S0340 01222000
*      END;                            /*END SET JES BITS    @Y30QPPB*/ 01223000
*    ELSE                              /*TSO USER NO MOUNT   @Y30QPPB*/ 01224000
*      DO;                             /*CHECK AUTHORIZED BIT@Y30QPPB*/ 01225000
         B     @RC00337                                         03S0342 01226000
@RF00337 DS    0H                                               03S0343 01227000
*        IF MOUNTSW = ON THEN          /*MOUNT VOLUMES?      @Y30QPPB*/ 01228000
         L     @08,@PC00001+20                                  03S0343 01229000
         TM    MOUNTSW(@08),B'00000001'                         03S0343 01230000
         BNO   @RF00343                                         03S0343 01231000
*          JSVOLMNT = ON;              /*YES,SET JES MOUNT   @Y30QPPB*/ 01232000
         OI    JSVOLMNT,B'10000000'                             03S0344 01233000
*        IF OFFLINSW = ON THEN         /*USE OFFLINE UNITS?  @Y30QPPB*/ 01234000
@RF00343 L     @08,@PC00001+20                                  03S0345 01235000
         TM    OFFLINSW(@08),B'00001000'                        03S0345 01236000
         BNO   @RF00345                                         03S0345 01237000
*          JSOFFLIN = ON;              /*YES,SET JES OFFLINE @Y30QPPB*/ 01238000
         OI    JSOFFLIN,B'01000000'                             03S0346 01239000
*      END;                            /*END CHECK AUTH BITS @Y30QPPB*/ 01240000
@RF00345 DS    0H                                               03S0348 01241000
*  END;                                /*END SET JES BITS    @Y30QPPB*/ 01242000
@RC00337 DS    0H                                               03S0349 01243000
*SSOBINDV = ADDR(SSDY);                /*ADDR OF FUNCTION AREA  03S0349 01244000
*                                        IN SSOB             @Y30QPPB*/ 01245000
@RF00335 LA    @08,SSDY                                         03S0349 01246000
         ST    @08,SSOBINDV                                     03S0349 01247000
*UNALOCSW = ON;                        /*UNALLOC ON ERROR    @Y30QPPB*/ 01248000
*                                                               02S0350 01249000
         L     @08,@PC00001+20                                  02S0350 01250000
         OI    UNALOCSW(@08),B'00010000'                        02S0350 01251000
* /* ? IEFSSREQ  (SSOB);*/                                      02S0351 01252000
*/*                                           */                02S0351 01253000
*/*  PASS CONTROL TO JOB ENTRY SUBSYSTEM TO   */                02S0351 01254000
*/*  PROCESS REQUEST -                        */                02S0351 01255000
*/*                                           */                02S0351 01256000
*/*    INPUT - REGISTER 1 POINTS TO A ONE-    */                02S0351 01257000
*/*            WORD PARAMETER LIST WHICH      */                02S0351 01258000
*/*            POINTS TO THE SSOB             */                02S0351 01259000
*/*                                           */                02S0351 01260000
*CALL SSREQ(SSOB);                     /*INVOKE JES3         @Y30QPPB*/ 01261000
         LA    @08,SSOB                                         02S0351 01262000
         ST    @08,@AL00001                                     02S0351 01263000
         MVI   @AL00001,X'80'                                   02S0351 01264000
         L     @08,CVTPTR                                       02S0351 01265000
         L     @08,CVTJESCT(,@08)                               02S0351 01266000
         L     @15,JESSSREQ(,@08)                               02S0351 01267000
         LA    @01,@AL00001                                     02S0351 01268000
         BALR  @14,@15                                          02S0351 01269000
*IF SSOBRETN ^= SSDYSUCC THEN          /*DID JES3 HAVE ERROR?@Y30QPPB*/ 01270000
         L     @08,SSOBRETN                                     02S0352 01271000
         LTR   @08,@08                                          02S0352 01272000
         BZ    @RF00352                                         02S0352 01273000
*  DO;                                 /*YES TRANSLATE RC    @Y30QPPB*/ 01274000
*    JESERROR=SSOBRETN/4;              /*INDEX TO RC LIST    @Y30QPPB*/ 01275000
         SRL   @08,2                                            02S0354 01276000
         LR    JESERROR,@08                                     02S0354 01277000
*    ERRCODE=JESFLARY(JESERROR);       /*DYNAMIC RETURN CODE @ZM00424*/ 01278000
         L     @08,@PC00001+16                                  02S0355 01279000
         LR    @06,JESERROR                                     02S0355 01280000
         ALR   @06,@06                                          02S0355 01281000
         LA    @03,JESFLARY-2(@06)                              02S0355 01282000
         MVC   ERRCODE(2,@08),0(@03)                            02S0355 01283000
*    IF ERRCODE = RCDSUNAV             /*JES RET CODE 16     @ZA04560*/ 01284000
*      & NQEXCLSW = ON THEN            /*REQ ENQ SHR TO EXCL @ZA04560*/ 01285000
         CLC   ERRCODE(2,@08),@CB01029                          02S0356 01286000
         BNE   @RF00356                                         02S0356 01287000
         L     @06,@PC00001+20                                  02S0356 01288000
         TM    NQEXCLSW(@06),B'00001000'                        02S0356 01289000
         BNO   @RF00356                                         02S0356 01290000
*      ERRCODE = RCXCLUSV;             /*SET DYN RC X'020C'  @ZA04560*/ 01291000
         MVC   ERRCODE(2,@08),@CB01028                          02S0357 01292000
*    ELSE;                             /*ERRCODE SET ALREADY @ZA04560*/ 01293000
@RF00356 DS    0H                                               02S0359 01294000
*  END;                                /*END TRANSLATE RC    @Y30QPPB*/ 01295000
*  END;                                /*                    @ZM00424*/ 01296000
@RF00352 DS    0H                                               01S0361 01297000
*IF ERRCODE=ZERO THEN                  /*SUCCESSFUL SO FAR?  @ZM00424*/ 01298000
@RF00291 SLR   @08,@08                                          01S0361 01299000
         L     @06,@PC00001+16                                  01S0361 01300000
         SLR   @15,@15                                          01S0361 01301000
         ICM   @15,3,ERRCODE(@06)                               01S0361 01302000
         CR    @08,@15                                          01S0361 01303000
         BNE   @RF00361                                         01S0361 01304000
*  DO;                                 /*YES                 @ZM00424*/ 01305000
*/********************************************************************/ 01306000
*/*                                                                  */ 01307000
*/* SEGMENT NAME - ALLOCINT                                          */ 01308000
*/*                                                                  */ 01309000
*/* DESCRIPTIVE NAME - INTERFACE WITH COMMON ALLOCATION              */ 01310000
*/*                                                                  */ 01311000
*/* FUNCTION - INVOKE COMMON ALLOCATION TO PERFORM THE ACTUAL        */ 01312000
*/*   ALLOCATION AND TO CREATE THE DSAB FOR THE REQUEST.             */ 01313000
*/*                                                                  */ 01314000
*/*   OPERATION -                                                    */ 01315000
*/*     THE FUNCTION MAP FOR COMMON ALLOCATION IS SET UP AS          */ 01316000
*/*     DESCRIBED BY THE CODE.                               @Y30QPPB*/ 01317000
*/*     COMMON ALLOCATION IS THEN INVOKED.                   @Y30QPPB*/ 01318000
*/*     IF SUCCESSFUL AND MORE THAN ONE SIOT WAS PASSED TO COMMON    */ 01319000
*/*     ALLOCATION, E.G., A GDG-ALL REQUEST, THE TIOT ENTRIES AND    */ 01320000
*/*     DSABS ARE PERMANENTLY CONCATENATED IN THE ORDER              */ 01321000
*/*     OF THE SIOTS (SEE SEGMENT TIOTMGRI). IF COMMON ALLOC         */ 01322000
*/*     INDICATES NO RESOURCES WERE ALLOCATED, THE INTERNAL          */ 01323000
*/*     INDICATOR SET ABOVE TO RELEASE RESOURCES IS RESET.           */ 01324000
*/*     IF EITHER COMMON ALLOC OR THE TIOT MGR. RETURN AN ERROR      */ 01325000
*/*     CODE, IT IS TRANSLATED INTO A DYNAMIC ALLOCATION REASON      */ 01326000
*/*     CODE. IF MSS SELECTS DONE AND ALLOC UNSUCCESSFUL,    @G24LPSJ*/ 01327000
*/*     AN INDICATOR IS SET IN DYNAMIC ALLOC CONTROL AREA    @G24LPSJ*/ 01328000
*/*     WHICH WILL CAUSE AN MSS TERMINATE TO BE ISSUED WHEN  @G24LPSJ*/ 01329000
*/*     DYNAMIC UNALLOCATION ERROR ROUTINE IS INVOKED.       @G24LPSJ*/ 01330000
*/*                                                                  */ 01331000
*/* NOTES-                                                           */ 01332000
*/*   * THE MONITOR JOBNAMES INDICATOR IS SET IF MONITOR             */ 01333000
*/*     JOBNAMES IS IN EFFECT, SO THAT ALLOCATION MESSAGES FOR UNIT  */ 01334000
*/*     RECORD DEVICES ARE WRITTEN TO THE OPERATOR.                  */ 01335000
*/*   * THE BIT IN THE SVC99 FUNCTION MAP TO ISSUE           @YM04918*/ 01336000
*/*     DISPOSITION MESSAGES IF AN ERROR FORCES UNALLOCATION,@YM04918*/ 01337000
*/*     IS ONLY SET FOR A ZERO REG15 RETURNED FROM COMMON.   @YM04918*/ 01338000
*/*     THIS IS TO INSURE A BALANCE OF ALLOCATED AND         @YM04918*/ 01339000
*/*     DISPOSITION MESSAGES, AS COMMON WILL ONLY ISSUE      @YM04918*/ 01340000
*/*     ALLOCATED MESSAGES FOR A COMPLETE SUCCESS.           @YM04918*/ 01341000
*/*                                                                  */ 01342000
*/* INPUT -                                                          */ 01343000
*/*     ASCBTSB - TO DETERMINE IF USER IS A TSO USER                 */ 01344000
*/*     PSCBVMNT - TSO USER VOLUME MOUNT AUTHORIZATION               */ 01345000
*/*     ALFNCMAP - USER INPUT FLAGS                                  */ 01346000
*/*     JHRETMAP - MSS TERM BIT ON IF MSS SELECTS DONE       @G24LPSJ*/ 01347000
*/*     JCT - MSGLEVEL INDICATION                                    */ 01348000
*/*     BASEA - MONITOR JOBNAMES INDICATION                          */ 01349000
*/*     FSIOTPTR - PTR TO FIRST SIOT TO BE PROCESSED                 */ 01350000
*/*     JSCBPTR - PASSED TO COMMON ALLOC                             */ 01351000
*/*     CVT - PTR TO IOS UCB LOOK-UP TABLE                           */ 01352000
*/*         - PTR TO BASEA                                           */ 01353000
*/*     TCB - ADDRESS ASSED TO COMMON ALLOC                          */ 01354000
*/*         - PTR TO TIOT HEADER                                     */ 01355000
*/*     SCTSNUMB - STEP NUMBER                               @Y30QPPB*/ 01356000
*/*                                                                  */ 01357000
*/*   OUTPUT -                                                       */ 01358000
*/*     ALODSAB - PTR TO FIRST DSAB ALLOCATED                        */ 01359000
*/*     ERRCODE - ZERO IF SUCCESSFUL, ERROR REASON CODE IF ERROR     */ 01360000
*/*               IN COMMON ALLOC OR TIOT MGR.                       */ 01361000
*/*     DYNMSSTM- SET ON IF SELECTS DONE AND COMMON          @G24LPSJ*/ 01362000
*/*               ALLOCATION FAILURE.                        @G24LPSJ*/ 01363000
*/*                                                                  */ 01364000
*/********************************************************************/ 01365000
*ALCFLAGS = '';                        /*CLEAR COMMON ALLOC FLAGS    */ 01366000
         XC    ALCFLAGS(2),ALCFLAGS                             02S0363 01367000
*IF NOMONTSW = OFF THEN                /*USER WANT MOUNTING?         */ 01368000
         L     @06,@PC00001+20                                  02S0364 01369000
         TM    NOMONTSW(@06),B'00100000'                        02S0364 01370000
         BNZ   @RF00364                                         02S0364 01371000
*  DO;                                 /*YES, SET INDICATORS         */ 01372000
*    ALCCANCL = ON;                    /*ALLOW CANCEL OF MOUNT       */ 01373000
         LA    @06,ALCFLAGS                                     02S0366 01374000
         OI    ALCCANCL(@06),B'00000010'                        02S0366 01375000
*    IF (ASCBTSB = ZERO                /*NOT A TSO USER?             */ 01376000
*        | PSCBVMNT = ON) THEN         /*OR TSO USER WITH MOUNT OPT? */ 01377000
         L     @06,@PC00001+4                                   02S0367 01378000
         L     @01,ASCBPTR(,@06)                                02S0367 01379000
         C     @08,ASCBTSB(,@01)                                02S0367 01380000
         BE    @RT00367                                         02S0367 01381000
         L     @08,JSCBPTR(,@06)                                02S0367 01382000
         L     @08,JSCBPSCB(,@08)                               02S0367 01383000
         TM    PSCBVMNT(@08),B'00010000'                        02S0367 01384000
         BNO   @RF00367                                         02S0367 01385000
@RT00367 DS    0H                                               02S0368 01386000
*      DO;                                                      02S0368 01387000
*        ALCMOUNT = ON;                /*YES,SET MAY MOUNT BIT       */ 01388000
*        ALCOFFDV = ON;                /*MAY USE OFFLINE DEVICES BIT */ 01389000
         LA    @08,ALCFLAGS                                     02S0370 01390000
         OI    ALCMOUNT(@08),B'10000100'                        02S0370 01391000
*      END;                                                     02S0371 01392000
*    ELSE                              /*USER IS TSO W/O MOUNT OPT   */ 01393000
*      DO;                             /*CHECK AUTHORIZED FLAGS      */ 01394000
         B     @RC00367                                         02S0372 01395000
@RF00367 DS    0H                                               02S0373 01396000
*        IF MOUNTSW = ON THEN          /*MOUNT VOLUMES?              */ 01397000
         L     @08,@PC00001+20                                  02S0373 01398000
         TM    MOUNTSW(@08),B'00000001'                         02S0373 01399000
         BNO   @RF00373                                         02S0373 01400000
*          ALCMOUNT = ON;              /*YES, SET INDICATOR          */ 01401000
         LA    @08,ALCFLAGS                                     02S0374 01402000
         OI    ALCMOUNT(@08),B'10000000'                        02S0374 01403000
*        IF OFFLINSW = ON THEN         /*CONSIDER OFFLINE UNITS?     */ 01404000
@RF00373 L     @08,@PC00001+20                                  02S0375 01405000
         TM    OFFLINSW(@08),B'00001000'                        02S0375 01406000
         BNO   @RF00375                                         02S0375 01407000
*          ALCOFFDV = ON;              /*YES, SET INDICATOR          */ 01408000
         LA    @08,ALCFLAGS                                     02S0376 01409000
         OI    ALCOFFDV(@08),B'00000100'                        02S0376 01410000
*      END;                                                     02S0377 01411000
@RF00375 DS    0H                                               02S0378 01412000
*  END;                                                         02S0378 01413000
@RC00367 DS    0H                                               02S0379 01414000
*IF INCMALL = ON THEN                  /*ALLOC MSGLEVEL FROM JCT = 1?*/ 01415000
@RF00364 L     @08,@PC00001+4                                   02S0379 01416000
         L     @08,JCTPTR(,@08)                                 02S0379 01417000
         TM    INCMALL(@08),B'10000000'                         02S0379 01418000
         BNO   @RF00379                                         02S0379 01419000
*  ALCMSGLV = ON;                      /*YES,SET INDICATOR           */ 01420000
         LA    @08,ALCFLAGS                                     02S0380 01421000
         OI    ALCMSGLV(@08),B'01000000'                        02S0380 01422000
*IF WTUNTSW = ON THEN                  /*OKAY TO WAIT FOR UNITS?     */ 01423000
@RF00379 L     @08,@PC00001+20                                  02S0381 01424000
         TM    WTUNTSW(@08),B'00010000'                         02S0381 01425000
         BNO   @RF00381                                         02S0381 01426000
*  ALCWTUNT = ON;                      /*YES,SET INDICATOR           */ 01427000
         LA    @08,ALCFLAGS                                     02S0382 01428000
         OI    ALCWTUNT(@08),B'00100000'                        02S0382 01429000
*IF WTVOLSW = ON THEN                  /*OKAY TO WAIT FOR VOLUMES?   */ 01430000
@RF00381 L     @08,@PC00001+20                                  02S0383 01431000
         TM    WTVOLSW(@08),B'10000000'                         02S0383 01432000
         BNO   @RF00383                                         02S0383 01433000
*  ALCWTVOL = ON;                      /*SET COMMON ALLOC FLAG       */ 01434000
         LA    @08,ALCFLAGS                                     02S0384 01435000
         OI    ALCWTVOL(@08),B'00010000'                        02S0384 01436000
*IF BAJNCNT ^= ZERO THEN               /*MONITOR JOBNAMES REQUESTED? */ 01437000
@RF00383 L     @08,CVTPTR                                       02S0385 01438000
         L     @08,CVTMSER(,@08)                                02S0385 01439000
         LH    @08,BAJNCNT(,@08)                                02S0385 01440000
         LTR   @08,@08                                          02S0385 01441000
         BZ    @RF00385                                         02S0385 01442000
*  ALCJOBNM = ON;                      /*YES,SET INDICATOR           */ 01443000
         LA    @08,ALCFLAGS                                     02S0386 01444000
         OI    ALCJOBNM(@08),B'00100000'                        02S0386 01445000
*ALCNOENQ = ON;                        /*DONT HAVE SCRTCH ENQ ON TIOT*/ 01446000
@RF00385 LA    @08,ALCFLAGS                                     02S0387 01447000
         OI    ALCNOENQ(@08),B'00010000'                        02S0387 01448000
*IF SCTSYSOU = ON THEN                 /*SYSOUT DATA SET?            */ 01449000
         L     @06,@PC00001+24                                  02S0388 01450000
         L     @06,FSIOTPTR(,@06)                               02S0388 01451000
         TM    SCTSYSOU(@06),B'00001000'                        02S0388 01452000
         BNO   @RF00388                                         02S0388 01453000
*  DO;                                 /*YES, SET SPECIAL INDICATORS */ 01454000
*    IF JOBRLSYS = OFF THEN            /*NOT JOB RELATD SYS? @YM06125*/ 01455000
         L     @06,@PC00001+20                                  02S0390 01456000
         TM    JOBRLSYS(@06),B'00010000'                        02S0390 01457000
         BNZ   @RF00390                                         02S0390 01458000
*      ALCATRKM=ON;                    /*SUBSYSTEM-ASSIGN TRACK MASK */ 01459000
         OI    ALCATRKM(@08),B'00001000'                        02S0391 01460000
*    ALCASDSN=ON;                      /*SUBSYSTEM-ASSIGN DSNAME     */ 01461000
@RF00390 LA    @08,ALCFLAGS                                     02S0392 01462000
         OI    ALCASDSN(@08),B'00000010'                        02S0392 01463000
*  END;                                                         02S0393 01464000
*ALMSGINP = TCBTIO;                    /*PTR TO MSG INFORMATION      */ 01465000
@RF00388 L     @08,@PC00001+4                                   02S0394 01466000
         L     @08,TCBPTR(,@08)                                 02S0394 01467000
         L     @08,TCBTIO(,@08)                                 02S0394 01468000
         ST    @08,ALMSGINP                                     02S0394 01469000
*IF JHMSSTRM = ON THEN                 /* IF MSS TERM REQ    @G24LPSJ*/ 01470000
         TM    JHMSSTRM,B'10000000'                             02S0395 01471000
         BNO   @RF00395                                         02S0395 01472000
*  ALCMSSTM = ON;                      /* THEN SET ALLOC FMAP@G24LPSJ*/ 01473000
         LA    @08,ALCFLAGS                                     02S0396 01474000
         OI    ALCMSSTM(@08),B'00001000'                        02S0396 01475000
*DUMMYECB = ZERO;                      /*CLEAR DUMMY ECB             */ 01476000
@RF00395 SLR   @08,@08                                          02S0397 01477000
         ST    @08,DUMMYECB                                     02S0397 01478000
*CALL IEFAB421                         /*COMMON ALLOCATION   @Y30QPPB*/ 01479000
*              (ALCFLAGS,FSIOTPTR,JSCBPTR,CVTILK2,NSIOTERR,TCBPTR,      01480000
*               ALMSGINP,ADDR(DUMMYECB),SCTSNUMB,               02S0398 01481000
*               ADDR(SSERRBLK));       /*PASS POINTER TO SUBSYSTEM      01482000
*                                        ERROR BLOCK         @G29AN2F*/ 01483000
         LA    @08,ALCFLAGS                                     02S0398 01484000
         ST    @08,@AL00001                                     02S0398 01485000
         L     @08,@PC00001+24                                  02S0398 01486000
         LA    @08,FSIOTPTR(,@08)                               02S0398 01487000
         ST    @08,@AL00001+4                                   02S0398 01488000
         L     @08,@PC00001+4                                   02S0398 01489000
         ST    @08,@AL00001+8                                   02S0398 01490000
         L     @06,CVTPTR                                       02S0398 01491000
         LA    @06,CVTILK2(,@06)                                02S0398 01492000
         ST    @06,@AL00001+12                                  02S0398 01493000
         LA    @06,NSIOTERR                                     02S0398 01494000
         ST    @06,@AL00001+16                                  02S0398 01495000
         LA    @06,TCBPTR(,@08)                                 02S0398 01496000
         ST    @06,@AL00001+20                                  02S0398 01497000
         LA    @06,ALMSGINP                                     02S0398 01498000
         ST    @06,@AL00001+24                                  02S0398 01499000
         LA    @06,DUMMYECB                                     02S0398 01500000
         ST    @06,@TF00001                                     02S0398 01501000
         LA    @06,@TF00001                                     02S0398 01502000
         ST    @06,@AL00001+28                                  02S0398 01503000
         L     @08,SCTPTR(,@08)                                 02S0398 01504000
         LA    @08,SCTSNUMB(,@08)                               02S0398 01505000
         ST    @08,@AL00001+32                                  02S0398 01506000
         LA    @08,SSERRBLK                                     02S0398 01507000
         ST    @08,@TF00002                                     02S0398 01508000
         LA    @08,@TF00002                                     02S0398 01509000
         ST    @08,@AL00001+36                                  02S0398 01510000
         L     @15,@CV00234                                     02S0398 01511000
         LA    @01,@AL00001                                     02S0398 01512000
         BALR  @14,@15                                          02S0398 01513000
*RFY R15 RESTRICTED;                                            02S0399 01514000
*IF R15 = ZERO THEN                    /*SUCCESSFUL ALLOCATION?      */ 01515000
         SLR   @14,@14                                          02S0400 01516000
         CR    R15,@14                                          02S0400 01517000
         BNE   @RF00400                                         02S0400 01518000
*  DO;                                                          02S0401 01519000
*    DISMSGSW = ON;                    /*DISP MSGS ON ERROR  @YM04918*/ 01520000
         L     @08,@PC00001+20                                  02S0402 01521000
         OI    DISMSGSW(@08),B'00010000'                        02S0402 01522000
*    ALOCDSAB = SIOTETIO;              /*SET 1ST ALLOC DSAB PTR      */ 01523000
         L     @08,@PC00001+12                                  02S0403 01524000
         L     @06,@PC00001+24                                  02S0403 01525000
         L     @06,FSIOTPTR(,@06)                               02S0403 01526000
         L     @05,SIOTETIO(,@06)                               02S0403 01527000
         ST    @05,ALOCDSAB(,@08)                               02S0403 01528000
*    IF SIOTNPTR ^= ZERO THEN          /*MORE THAN ONE SIOT ALLOCATED*/ 01529000
         C     @14,SIOTNPTR(,@06)                               02S0404 01530000
         BE    @RF00404                                         02S0404 01531000
*      DO;                             /*YES,REORDER DSABS,TIOT ENT'S*/ 01532000
*/********************************************************************/ 01533000
*/*                                                                  */ 01534000
*/* SEGMENT NAME - TIOTMGRI                                          */ 01535000
*/*                                                                  */ 01536000
*/* DESCRIPTIVE NAME - INTERFACE WITH THE TIOT MANAGER               */ 01537000
*/*                                                                  */ 01538000
*/* FUNCTION - THIS SEGMENT PERMANENTLY CONCATENATES TIOT ENTRIES    */ 01539000
*/*   AND DSABS WHEN MORE THAN ONE SIOT IS ASSOCIATED WITH THE       */ 01540000
*/*   REQUEST. THE TIOT MANAGER IS USED TO REORDER THE DSABS AND     */ 01541000
*/*   THEIR ASSOCIATED TIOT ENTRIES IN THE ORDER OF THE SIOTS.       */ 01542000
*/*                                                                  */ 01543000
*/*   OPERATION - THE CONCAT FUNCTION OF THE TIOT MANAGER WILL       */ 01544000
*/*     BE USED TO ACCOMPLISH THE REORDERING. A LIST OF DSABS FOR    */ 01545000
*/*     EACH SIOT ASSOCIATED WITH THE DYNAMIC ALLOCATION REQUEST IS  */ 01546000
*/*     CONSTRUCTED FOR THE TIOT MANAGER. AS THE LIST IS CONSTRUCTED,*/ 01547000
*/*     THE  PERMANENTLY CONCATENATED BIT IS SET IN THE DSAB.        */ 01548000
*/*     THE DSAB 'MEMBER OF A CONCATENATED GROUP' BIT IS SET BY THE  */ 01549000
*/*     TIOT MANAGER. IF THE TIOT MANAGER IS UNSUCCESSFUL,           */ 01550000
*/*     AN ERROR CODE IS SET INDICATING THAT NO ROOM EXISTS IN       */ 01551000
*/*     THE TIOT FOR THE ENTRIES.                                    */ 01552000
*/*                                                                  */ 01553000
*/* INPUT -                                                          */ 01554000
*/*   FSIOTPTR - PTR TO FIRST SIOT ASSOCIATED WITH THE REQUEST       */ 01555000
*/*   JSCBPTR  - PASSED TO TIOT MANAGER                              */ 01556000
*/*                                                                  */ 01557000
*/* OUTPUT -                                                         */ 01558000
*/*   ERRCODE - ZERO IF TIOT MANAGER IS SUCCESSFUL, X'0238' IF ERROR */ 01559000
*/*                                                                  */ 01560000
*/********************************************************************/ 01561000
*                                                               03S0406 01562000
*TIORBPTR = ADDR(TMGRCORE);            /*PTR TO TIOT MGR.REQ BLOCK   */ 01563000
         LA    @14,TMGRCORE                                     03S0406 01564000
         ST    @14,TIORBPTR                                     03S0406 01565000
*TIOMGRRB = TIOMGRRB && TIOMGRRB;      /*ZERO REQUEST BLOCK          */ 01566000
         XC    TIOMGRRB(38,@14),TIOMGRRB(@14)                   03S0407 01567000
*TIOMCCAT = ON;                        /*INDICATE CONCAT FUNCTION    */ 01568000
         OI    TIOMCCAT(@14),B'00000100'                        03S0408 01569000
*TIOMJSCP = JSCBPTR;                   /*SET JSCB PTR                */ 01570000
         L     @08,@PC00001+4                                   03S0409 01571000
         L     @08,JSCBPTR(,@08)                                03S0409 01572000
         ST    @08,TIOMJSCP(,@14)                               03S0409 01573000
*CCATSIOT = FSIOTPTR;                  /*INIT WORK SIOT PTR          */ 01574000
         LR    CCATSIOT,@06                                     03S0410 01575000
*DO WHILE(CCATSIOT ^= ZERO);           /*LOOP THRU SIOTS             */ 01576000
         B     @DE00411                                         03S0411 01577000
@DL00411 DS    0H                                               03S0412 01578000
*  TIOMNDSA = TIOMNDSA + 1;            /*# OF DSABS TO CONCATENATE   */ 01579000
         L     @14,TIORBPTR                                     03S0412 01580000
         LA    @08,1                                            03S0412 01581000
         AH    @08,TIOMNDSA(,@14)                               03S0412 01582000
         STH   @08,TIOMNDSA(,@14)                               03S0412 01583000
*  CCATSIOT = CCATSIOT->SIOTNPTR;      /*POINT TO NEXT SIOT          */ 01584000
         L     CCATSIOT,SIOTNPTR(,CCATSIOT)                     03S0413 01585000
*END;                                                           03S0414 01586000
@DE00411 LTR   CCATSIOT,CCATSIOT                                03S0414 01587000
         BNZ   @DL00411                                         03S0414 01588000
*R0 = TIOMNDSA * LENGTH(TMGRLIST(1));  /*AMOUNT OF CORE FOR DSAB LIST*/ 01589000
         L     @14,TIORBPTR                                     03S0415 01590000
         LH    R0,TIOMNDSA(,@14)                                03S0415 01591000
         SLA   R0,2                                             03S0415 01592000
*R0 = R0 | SUBPOLNO;                   /*GET FROM CORRECT SUBPOOL    */ 01593000
         O     R0,@CF00119                                      03S0416 01594000
*GEN (GETMAIN R,LV=(0));               /*GET CORE FOR DSAB LIST      */ 01595000
         GETMAIN R,LV=(0)                                               01596000
*TIOMDSAP = R1;                        /*SET PTR TO DSAB LIST        */ 01597000
         L     @14,TIORBPTR                                     03S0418 01598000
         ST    R1,TIOMDSAP(,@14)                                03S0418 01599000
*CCATSIOT = FSIOTPTR;                  /*INIT WORK SIOT PTR          */ 01600000
         L     @14,@PC00001+24                                  03S0419 01601000
         L     CCATSIOT,FSIOTPTR(,@14)                          03S0419 01602000
*DO I=1 TO TIOMNDSA;                   /*LOOP THRU SIOTS             */ 01603000
         LA    I,1                                              03S0420 01604000
         B     @DE00420                                         03S0420 01605000
@DL00420 DS    0H                                               03S0421 01606000
*  TMGRLIST(I) = CCATSIOT->SIOTETIO;   /*SET DSAB PTR IN LIST        */ 01607000
         LR    @14,I                                            03S0421 01608000
         SLA   @14,2                                            03S0421 01609000
         L     @08,TIORBPTR                                     03S0421 01610000
         L     @08,TIOMDSAP(,@08)                               03S0421 01611000
         L     @06,SIOTETIO(,CCATSIOT)                          03S0421 01612000
         AL    @08,@CF03518                                     03S0421 01613000
         ST    @06,TMGRLIST(@14,@08)                            03S0421 01614000
*  TMGRLIST(I)->DSABPCAT = ON;         /*SET PERMANENTLY CONCAT'D BIT*/ 01615000
         OI    DSABPCAT(@06),B'00000100'                        03S0422 01616000
*  CCATSIOT = CCATSIOT->SIOTNPTR;      /*POINT TO NEXT SIOT          */ 01617000
         L     CCATSIOT,SIOTNPTR(,CCATSIOT)                     03S0423 01618000
*END;                                                           03S0424 01619000
         AL    I,@CF00103                                       03S0424 01620000
@DE00420 L     @14,TIORBPTR                                     03S0424 01621000
         CH    I,TIOMNDSA(,@14)                                 03S0424 01622000
         BNH   @DL00420                                         03S0424 01623000
*CALL IEFAB4FC (TIORBPTR);             /*INVOKE TIOT MANAGER         */ 01624000
         LA    @14,TIORBPTR                                     03S0425 01625000
         ST    @14,@AL00001                                     03S0425 01626000
         L     @15,@CV00269                                     03S0425 01627000
         LA    @01,@AL00001                                     03S0425 01628000
         BALR  @14,@15                                          03S0425 01629000
*IF R15 ^= ZERO THEN                   /*ERROR?                      */ 01630000
         LTR   R15,R15                                          03S0426 01631000
         BZ    @RF00426                                         03S0426 01632000
*  ERRCODE = RCNSTIOT;                 /*YES,'NO ROOM IN TIOT' CODE  */ 01633000
         L     @14,@PC00001+16                                  03S0427 01634000
         MVC   ERRCODE(2,@14),@CB01039                          03S0427 01635000
*R0 = TIOMNDSA * LENGTH(TMGRLIST(1));  /*LENGTH OF CORE TO FREE      */ 01636000
@RF00426 L     @14,TIORBPTR                                     03S0428 01637000
         LH    R0,TIOMNDSA(,@14)                                03S0428 01638000
         SLA   R0,2                                             03S0428 01639000
*R0 = R0 | SUBPOLNO;                   /*FREE FROM CORRECT SUBPOOL   */ 01640000
         O     R0,@CF00119                                      03S0429 01641000
*R1 = TIOMDSAP;                        /*ADDR OF CORE TO FREE        */ 01642000
         L     R1,TIOMDSAP(,@14)                                03S0430 01643000
*GEN (FREEMAIN R,LV=(0),A=(1));        /*FREE DSAB LIST CORE         */ 01644000
         FREEMAIN R,LV=(0),A=(1)                                        01645000
*      END;                                                     02S0432 01646000
*  END;                                                         02S0433 01647000
*ELSE                                  /*ALLOC WAS UNSUCCESSFUL      */ 01648000
*   DO;                                /*                    @G24LPSJ*/ 01649000
         B     @RC00400                                         02S0434 01650000
@RF00400 DS    0H                                               02S0435 01651000
*     IF JHMSSTRM = ON THEN            /* IF ALLOC FAILED AND MSS       01652000
*                                         SELECTS DONE       @G24LPSJ*/ 01653000
         TM    JHMSSTRM,B'10000000'                             02S0435 01654000
         BNO   @RF00435                                         02S0435 01655000
*       DYNMSSTM = ON;                 /* TURN ON DYN CONTROL FLAG      01656000
*                                         FOR MSS TERM       @G24LPSJ*/ 01657000
         L     @14,@PC00001+20                                  02S0436 01658000
         OI    DYNMSSTM(@14),B'10000000'                        02S0436 01659000
*     CALL SETRCODE;                   /* SET DYNAMIC ERR REASON        01660000
*                                         CODE               @G24LPSJ*/ 01661000
@RF00435 BAL   @14,SETRCODE                                     02S0437 01662000
*     IF PCATINIT = ON &               /* IF ALLOC FOR INIT FOR 02S0438 01663000
*                                         PVT CAT AND        @G24LPSJ*/ 01664000
*        (ERRCODE = RCUNITNA |         /* UNIT NOT AVAILABLE @G24LPSJ*/ 01665000
*         ERRCODE = RCVOLNAV) THEN     /* OR VOL NOT AVAILABLE  02S0438 01666000
*                                         THEN               @G24LPSJ*/ 01667000
         L     @14,@PC00001+20                                  02S0438 01668000
         TM    PCATINIT(@14),B'01000000'                        02S0438 01669000
         BNO   @RF00438                                         02S0438 01670000
         L     @14,@PC00001+16                                  02S0438 01671000
         CLC   ERRCODE(2,@14),@CB01030                          02S0438 01672000
         BE    @RT00438                                         02S0438 01673000
         CLC   ERRCODE(2,@14),@CB01033                          02S0438 01674000
         BNE   @RF00438                                         02S0438 01675000
@RT00438 DS    0H                                               02S0439 01676000
*        DYNMSSOK = ON;                /* FORCE SUCCESSFUL MSS TERM     01677000
*                                         SINCE ALLOC IS RETRIED        01678000
*                                         FOR THE PVT CAT    @G24LPSJ*/ 01679000
         L     @14,@PC00001+20                                  02S0439 01680000
         OI    DYNMSSOK(@14),B'00000100'                        02S0439 01681000
*   END;                               /*                    @G24LPSJ*/ 01682000
@RF00438 DS    0H                                               02S0441 01683000
*RFY R15 UNRESTRICTED;                                          02S0441 01684000
@RC00400 DS    0H                                               02S0442 01685000
*  END;                                                         01S0442 01686000
*IF ERRCODE=ZERO THEN                  /*SUCCESSFUL SO FAR?          */ 01687000
@RF00361 L     @08,@PC00001+16                                  01S0443 01688000
         ICM   @06,3,ERRCODE(@08)                               01S0443 01689000
         BNZ   @RF00443                                         01S0443 01690000
*  DO;                                 /*YES                         */ 01691000
*/********************************************************************/ 01692000
*/*                                                                  */ 01693000
*/* SEGMENT NAME - ALWRAPUP                                          */ 01694000
*/*                                                                  */ 01695000
*/* DESCRIPTIVE NAME - NORMAL ALLOC WRAPUP PROCESSING.               */ 01696000
*/*                                                                  */ 01697000
*/* FUNCTION - COMPLETE THE DYNAMIC ALLOCATION OF THE REQUEST BY     */ 01698000
*/*   PERFORMING THE FOLLOWING FUNCTIONS:                            */ 01699000
*/*   . MAKING FINAL UPDATES TO THE SIOT(S) AND DSAB(S)              */ 01700000
*/*   . OBTAINING THE DSORG IF REQUESTED BY THE USER                 */ 01701000
*/*   . CATALOGING THE DATA SET IF NECESSARY                         */ 01702000
*/*   . CHANGING THE DSNAME ENQ FROM SHR TO EXCLUSIVE, IF NECESSARY  */ 01703000
*/*   . CHAINING THE SIOT(S) INTO THE SIOT CHAIN WHILE DOING @YA00061*/ 01704000
*/*     THE NECESSARY WRITE EPA CHAINING.                    @YA00061*/ 01705000
*/*   . UPDATING THE TCTIOT.                                         */ 01706000
*/*                                                                  */ 01707000
*/*   OPERATION -                                                    */ 01708000
*/*     FINAL UPDATES ARE MADE TO THE SIOT(S) AND DSAB(S)            */ 01709000
*/*     OF THE DYNAMIC ALLOCATION REQUEST. (SEE UPSIODSA SEGMENT.)   */ 01710000
*/*                                                                  */ 01711000
*/*     IF THE DSORG IS TO BE RETURNED TO THE USER,                  */ 01712000
*/*     OR IF THE USER IS A TSO USER ALLOCATING A NEW DATA SET,      */ 01713000
*/*     MODULE IEFDB4FE IS INVOKED TO PLACE THE DSORG INTO THE       */ 01714000
*/*     DSAB. UPON RETURN, FOR TSO USERS ALLOCATING A NEW DATA SET,  */ 01715000
*/*     THE DSORG IS PLACED IN THE JFCB. THE DSORG WILL BE           */ 01716000
*/*     PLACED IN THE USER'S PARM LIST BY IEFDB410. IF AN            */ 01717000
*/*     ERROR OCCURS OBTAINING THE DSORG, AN ERROR CODE IS SET,      */ 01718000
*/*     AND NO FURTHER PROCESSING IS DONE.                           */ 01719000
*/*                                                                  */ 01720000
*/*     FOR NEW DIRECT ACCESS DATA SETS WITH A DISP OF CATALOG,      */ 01721000
*/*     THE DATA SET IS CATALOGED. (SEE CATDS SEGMENT.)              */ 01722000
*/*                                                                  */ 01723000
*/*     IF THE DSNAME ENQ IS TO BE CHANGED FROM SHARED TO EXCLUSIVE, */ 01724000
*/*     IEFAB4DC IS INVOKED. IF THE ENQ IS UNSUCCESSFUL, NO FURTHER  */ 01725000
*/*     PROCESSING IS DONE.                                          */ 01726000
*/*                                                                  */ 01727000
*/*     BEFORE SIOTS FOR THE REQUEST ARE CHAINED INTO THE SIOT       */ 01728000
*/*     CHAIN, THE PTR TO THE FIRST EPA FOR ASSIGNED SIOT'S,         */ 01729000
*/*     JFCB'S, AND JFCBX'S (USED TO DELETE THESE RECORDS IF         */ 01730000
*/*     AN ERROR OCCURS DURING DYNAMIC ALLOCATION PROCESSING OF THE  */ 01731000
*/*     REQUEST) IS ZEROED, AND THE INDICATORS TO DEQ THE    @YM06112*/ 01732000
*/*     DSNAME, DEQ DSNAMES ENQ'D BY JFCB HOUSEKEEPING AND   @YM06112*/ 01733000
*/*     INVOKE COMMON UNALLOC ON ERROR ARE RESET.            @YM06112*/ 01734000
*/*     THIS IS DONE BECAUSE THESE INDICATORS ARE ALSO USED BY THE   */ 01735000
*/*     ESTAE EXIT, AND THESE FUNCTIONS SHOULD NOT BE DONE ONCE      */ 01736000
*/*     SIOT(S) ARE CHAINED INTO THE SIOT CHAIN. THE DEQ SWITCHES    */ 01737000
*/*     AND THE EPA POINTER ARE RESET BEFORE THE UNALLOC SWITCH,     */ 01738000
*/*     SO THAT THE DATA SET WON'T BE ALLOCATED AND NOT BE ENQ'D ON  */ 01739000
*/*     NOR HAVE IT'S SWA RECORDS.                                   */ 01740000
*/*                                                                  */ 01741000
*/*     THE SIOT(S) FOR THE REQUEST ARE THEN CHAINED INTO THE STEP'S */ 01742000
*/*     SIOT CHAIN. IF EPA'S FOR THE SCT AND UPDATED OLD     @YA00061*/ 01743000
*/*     LAST SIOT ARE NOT ALREADY ON THE EPA CHAIN, THEY ARE @YA00061*/ 01744000
*/*     CREATED AND CHAINED, AND THIS CHAIN IS THEN LINKED   @YA00061*/ 01745000
*/*     INTO THE INPUT EPA CHAIN.                            @YA00061*/ 01746000
*/*     (SEE CHAINSIO AND CHAINEPA SEGMENTS)                 @YA00061*/ 01747000
*/*                                                                  */ 01748000
*/*     FINALLY, IEFDB4F9 IS INVOKED TO UPDATE THE TCTIOT FOR        */ 01749000
*/*     SMF PROCESSING. (SEE SMFINTF SEGMENT.)                       */ 01750000
*/*                                                                  */ 01751000
*/* NOTES -                                                          */ 01752000
*/*   * THE DSORG IS PLACED IN THE JFCB FOR TSO USERS ALLOCATING     */ 01753000
*/*     NEW DATA SETS TO BE COMPATIBLE WITH OS/VS2 REL. 1 DYNAMIC    */ 01754000
*/*     ALLOCATION, WHICH DEFAULTED DSORG IN THE JFCB FOR NEW        */ 01755000
*/*     DATA SETS.                                                   */ 01756000
*/*                                                                  */ 01757000
*/*   * THE CATALOGING  OF NEW DATA SETS IS DONE NOW, RATHER         */ 01758000
*/*     THAN WHEN THE DATA SET IS UNALLOCATED, TO BE COMPATIBLE WITH */ 01759000
*/*     OS/VS2 REL.1 DYNAMIC ALLOCATION. THIS ALLOWS THE TSO LISTCAT */ 01760000
*/*     COMMAND TO REFLECT NEW DATA SETS CATALOGED DURING A TSO      */ 01761000
*/*     SESSION.                                                     */ 01762000
*/*                                                                  */ 01763000
*/*   * IT IS NECESSARY THAT THE SHR TO EXCLUSIVE                    */ 01764000
*/*     ENQ BE DONE AFTER ALL FUNCTIONS WHICH MAY POSSIBLY           */ 01765000
*/*     FAIL, SINCE THERE IS NO WAY TO RESET THE ENQ TO SHR SHOULD   */ 01766000
*/*     AN ERROR OCCUR AFTER THE CHANGE ENQ.                         */ 01767000
*/*                                                                  */ 01768000
*/* INPUT -                                                          */ 01769000
*/*   ASCB      - TO DETERMINE IF USER IS A TSO USER                 */ 01770000
*/*   KEYTABLE  - DETERMINE IF TEXT UNITS ARE SPECIFIED              */ 01771000
*/*   FSIOTPTR  - PTR TO FIRST SIOT ASSOCIATED WITH THE REQUEST      */ 01772000
*/*   ALFNCMAP  - DETERMINE IF SHR TO EXCL ENQ IS TO BE DONE         */ 01773000
*/*             - DETERMINE IF EPA'S FOR SCT AND LAST SIOT ARE       */ 01774000
*/*               CHAINED                                            */ 01775000
*/*   SIOT      - INDICATION OF NEW, CATALOG, DUMMY, SUBSYSTEM,      */ 01776000
*/*               AND GDG SINGLE DATA SET                            */ 01777000
*/*             - PTR TO DSAB                                        */ 01778000
*/*   SCT       - SVA OF LAST SIOT                                   */ 01779000
*/*                                                                  */ 01780000
*/* OUTPUT -                                                         */ 01781000
*/*   ALFNCMAP - DSNAME DEQ AND UNALLOC ON ERROR INDICATORS RESET    */ 01782000
*/*   DSAB     - INDICATORS SET AS DOCUMENTED BY THE CODE            */ 01783000
*/*   JFCB     - INDICATORS SET AS DOCUMENTED BY THE CODE            */ 01784000
*/*   LASTEPAP - UPDATED TO NEW LAST EPA                             */ 01785000
*/*   SCT      - SVA OF LAST (AND POSSIBLY FIRST) SIOT UPDATED       */ 01786000
*/*   SIOT     - INDICATORS SET AS DOCUMENTED BY THE CODE            */ 01787000
*/*                                                                  */ 01788000
*/********************************************************************/ 01789000
*/********************************************************************/ 01790000
*/*                                                                  */ 01791000
*/* SEGMENT NAME - UPSIODSA                                          */ 01792000
*/*                                                                  */ 01793000
*/* DESCRIPTIVE NAME - UPDATE SIOT(S) AND DSAB(S)                    */ 01794000
*/*                                                                  */ 01795000
*/* FUNCTION - MAKE FINAL UPDATES TO SIOT(S) AND DSAB(S) FOR         */ 01796000
*/*   THE REQUEST.                                                   */ 01797000
*/*                                                                  */ 01798000
*/*   OPERATION -                                                    */ 01799000
*/*     THE SIOT AND DSAB 'DYNAMICALLY ALLOCATED' BITS AND THE       */ 01800000
*/*     DSAB IN-USE BIT, TCB ADDRESS, AND IN-CORE SIOT PTR ARE SET.  */ 01801000
*/*     THE PERMANENTLY ALLOCATED ATTRIBUTE, CONVERTIBLE ATTRIBUTE,  */ 01802000
*/*     AND PASSWORD TTR FIELDS MAY ALSO BE SET.                     */ 01803000
*/*                                                                  */ 01804000
*/* OUTPUT -                                                         */ 01805000
*/*   COUNTSIO - NUMBER OF SIOTS ASSOCIATED WITH THE REQUEST, FOR    */ 01806000
*/*              SMFINTF SEGMENT                                     */ 01807000
*/*                                                                  */ 01808000
*/*                                                                  */ 01809000
*/********************************************************************/ 01810000
*                                                               03S0445 01811000
*COUNTSIO = ZERO;                      /*INIT COUNT OF SIOTS         */ 01812000
         SLR   COUNTSIO,COUNTSIO                                03S0445 01813000
*WRKSIOTP = FSIOTPTR;                  /*WORK PTR TO LOOP THRU SIOTS */ 01814000
         L     @08,@PC00001+24                                  03S0446 01815000
         L     WRKSIOTP,FSIOTPTR(,@08)                          03S0446 01816000
*RFY INDMSIOT BASED(WRKSIOTP);         /*BASE FOR SIOT MAPPING, DSAB    01817000
*                                        IS BASED ON SIOT DSAB PTR   */ 01818000
*DO WHILE (WRKSIOTP ^= ZERO);          /*UPDATE SIOTS AND DSABS      */ 01819000
         B     @DE00448                                         03S0448 01820000
@DL00448 DS    0H                                               03S0449 01821000
*  SIOTDYAL = ON;                      /*INDICATE DYN ALLOC IN SIOT  */ 01822000
         OI    SIOTDYAL(WRKSIOTP),B'01000000'                   03S0449 01823000
*  DSABDALC = ON;                      /*INDICATE DYN ALLOC IN DSAB  */ 01824000
*  DSABNUSE = ON;                      /*MARK DSAB IN-USE            */ 01825000
         L     @10,SIOTETIO(,WRKSIOTP)                          03S0451 01826000
         OI    DSABDALC(@10),B'10000001'                        03S0451 01827000
*  DSABTCBP = TCBPTR;                  /*SET TCB ADDR SET INUSE UNDER*/ 01828000
         L     @08,@PC00001+4                                   03S0452 01829000
         L     @08,TCBPTR(,@08)                                 03S0452 01830000
         ST    @08,DSABTCBP(,@10)                               03S0452 01831000
*  DSABSIOT = WRKSIOTP;                /*SET DSAB IN-CORE SIOT ADDR  */ 01832000
         ST    WRKSIOTP,DSABSIOT(,@10)                          03S0453 01833000
*  IF PERMATUP ^= ZERO THEN            /*PERM ALLOC ATTRIBUTE REQ?   */ 01834000
         SLR   @08,@08                                          03S0454 01835000
         L     @03,@PC00001                                     03S0454 01836000
         L     @03,KEYTABP(,@03)                                03S0454 01837000
         C     @08,PERMATUP(,@03)                               03S0454 01838000
         BE    @RF00454                                         03S0454 01839000
*    DO;                                                        03S0455 01840000
*      DSABPALC = ON;                  /*YES,SET PERM ALLOC ATTRIBUTE*/ 01841000
         OI    DSABPALC(@10),B'01000000'                        03S0456 01842000
*      IF CNVRTTUP ^= ZERO THEN        /*CONVERTIBLE ATTRIBUTE REQ?  */ 01843000
         C     @08,CNVRTTUP(,@03)                               03S0457 01844000
         BE    @RF00457                                         03S0457 01845000
*        DSABCONV = ON;                /*YES, SET CONVERTIBLE ATTRIB */ 01846000
         OI    DSABCONV(@10),B'00010000'                        03S0458 01847000
*    END;                                                       03S0459 01848000
*  ELSE                                /*PERM ALLOC NOT REQUESTED    */ 01849000
*    DSABCONV = ON;                    /*DEFAULT CONVERTIBLE ATTRIBUT*/ 01850000
         B     @RC00454                                         03S0460 01851000
@RF00454 L     @10,SIOTETIO(,WRKSIOTP)                          03S0460 01852000
         OI    DSABCONV(@10),B'00010000'                        03S0460 01853000
*  IF PASSWTUP ^= ZERO THEN            /*PASSWORD SPECIFIED?         */ 01854000
@RC00454 SLR   @10,@10                                          03S0461 01855000
         L     @08,@PC00001                                     03S0461 01856000
         L     @08,KEYTABP(,@08)                                03S0461 01857000
         L     @08,PASSWTUP(,@08)                               03S0461 01858000
         CR    @08,@10                                          03S0461 01859000
         BE    @RF00461                                         03S0461 01860000
*    DO;                               /*YES,ISSUE PROTECT MACRO     */ 01861000
*      RFY TEXTUNIT BASED(PASSWTUP);                            03S0463 01862000
*      PWTTRADR = ADDR(DSABPTTR);      /*PUT TTR INTO DSAB           */ 01863000
         L     @03,SIOTETIO(,WRKSIOTP)                          03S0464 01864000
         LA    @15,DSABPTTR(,@03)                               03S0464 01865000
         ST    @15,PWTTRADR                                     03S0464 01866000
*      DSABPTTR = 0;                   /*INIT TTR RETURN AREA (DFLT) */ 01867000
         ST    @10,DSABPTTR(,@03)                               03S0465 01868000
*      PWENTRCD = 5;                   /*ENTRY CODE = RETN TTR       */ 01869000
         MVI   PWENTRCD,X'05'                                   03S0466 01870000
*      PWDSNADR = ADDR(JFCBDSNM);      /*ADDR OF DSN IN JCFB @YM08664*/ 01871000
         L     @10,SJFCBPTR(,WRKSIOTP)                          03S0467 01872000
         ST    @10,PWDSNADR                                     03S0467 01873000
*      PWDSNLEN = LENGTH(JFCBDSNM);    /*LENGTH OF DSNAME IN JFCB    */ 01874000
         MVI   PWDSNLEN,X'2C'                                   03S0468 01875000
*      WORK = '';                      /*INIT PADDED PASSWORD        */ 01876000
         MVI   WORK,C' '                                        03S0469 01877000
         MVC   WORK+1(7),WORK                                   03S0469 01878000
*      WORK(1:TEXTULNG) = TEXTUPAR(1:TEXTULNG); /*PAD PASSWD WITH ' '*/ 01879000
         ICM   @10,12,TEXTULNG(@08)                             03S0470 01880000
         SRA   @10,16                                           03S0470 01881000
         BCTR  @10,0                                            03S0470 01882000
         EX    @10,@SM03519                                     03S0470 01883000
*      PWPASADR = ADDR(WORK);          /*ADDR OF PASSWORD            */ 01884000
         LA    @10,WORK                                         03S0471 01885000
         ST    @10,PWPASADR                                     03S0471 01886000
*      GEN(PROTECT PWPARMS);           /*INVOKE PROTECT ROUTINE      */ 01887000
         PROTECT PWPARMS                                                01888000
*                                      /*NOTE - IF ERROR, A TTR OF      01889000
*                                        ZERO (NONE) IS DEFAULTED    */ 01890000
*    END;                                                       03S0473 01891000
*  COUNTSIO = COUNTSIO + 1;            /*INCREMENT SIOT COUNT        */ 01892000
@RF00461 AL    COUNTSIO,@CF00103                                03S0474 01893000
*  NEWLSIOT = WRKSIOTP;                /*SAVE POSSIBLE LAST SIOT ADDR*/ 01894000
         LR    NEWLSIOT,WRKSIOTP                                03S0475 01895000
*  WRKSIOTP = SIOTNPTR;                /*GET NEXT SIOT ADDRESS,IF ANY*/ 01896000
         L     WRKSIOTP,SIOTNPTR(,WRKSIOTP)                     03S0476 01897000
*END;                                                           03S0477 01898000
@DE00448 SLR   @08,@08                                          03S0477 01899000
         CR    WRKSIOTP,@08                                     03S0477 01900000
         BNE   @DL00448                                         03S0477 01901000
*RFY INDMSIOT BASED(FSIOTPTR);         /*RESET SIOT MAPPING BASE     */ 01902000
*                                                               02S0479 01903000
*IF RTORGTUP ^= ZERO                   /*DSORG TO BE RETURNED?       */ 01904000
*  | (ASCBTSB  ^= ZERO                 /*OR TSO USER                 */ 01905000
*     & SCTSNEW = ON) THEN             /*ALLOCATING A NEW DATA SET?  */ 01906000
         L     @15,@PC00001                                     02S0479 01907000
         L     @01,KEYTABP(,@15)                                02S0479 01908000
         C     @08,RTORGTUP(,@01)                               02S0479 01909000
         BNE   @RT00479                                         02S0479 01910000
         L     @15,@PC00001+4                                   02S0479 01911000
         L     @01,ASCBPTR(,@15)                                02S0479 01912000
         C     @08,ASCBTSB(,@01)                                02S0479 01913000
         BE    @RF00479                                         02S0479 01914000
         L     @08,@PC00001+24                                  02S0479 01915000
         L     @08,FSIOTPTR(,@08)                               02S0479 01916000
         TM    SCTSNEW(@08),B'00000100'                         02S0479 01917000
         BNO   @RF00479                                         02S0479 01918000
@RT00479 DS    0H                                               02S0480 01919000
*  DO;                                                          02S0480 01920000
*    CALL IEFDB4FE (SIOTETIO);         /*YES,INVOKE RETURN DSORG RTN.*/ 01921000
         L     @08,@PC00001+24                                  02S0481 01922000
         L     @08,FSIOTPTR(,@08)                               02S0481 01923000
         LA    @08,SIOTETIO(,@08)                               02S0481 01924000
         ST    @08,@AL00001                                     02S0481 01925000
         L     @15,@CV00388                                     02S0481 01926000
         LA    @01,@AL00001                                     02S0481 01927000
         BALR  @14,@15                                          02S0481 01928000
*    RFY R15 RESTRICTED;                                        02S0482 01929000
*    IF R15 ^= ZERO THEN               /*ERROR OBTAINING DSORG?      */ 01930000
         LTR   R15,R15                                          02S0483 01931000
         BZ    @RF00483                                         02S0483 01932000
*      ERRCODE = R15 | RCOBTNER;       /*YES,SET ERROR REASON CODE   */ 01933000
         L     @14,@PC00001+16                                  02S0484 01934000
         L     @08,@CF01160                                     02S0484 01935000
         OR    @08,R15                                          02S0484 01936000
         STCM  @08,3,ERRCODE(@14)                               02S0484 01937000
*    ELSE                              /*NO ERROR                    */ 01938000
*      IF ASCBTSB ^= ZERO              /*TSO USER?                   */ 01939000
*        & SCTSNEW = ON THEN           /*AND NEW DATA SET?           */ 01940000
         B     @RC00483                                         02S0485 01941000
@RF00483 L     @14,@PC00001+4                                   02S0485 01942000
         L     @14,ASCBPTR(,@14)                                02S0485 01943000
         L     @14,ASCBTSB(,@14)                                02S0485 01944000
         LTR   @14,@14                                          02S0485 01945000
         BZ    @RF00485                                         02S0485 01946000
         L     @14,@PC00001+24                                  02S0485 01947000
         L     @14,FSIOTPTR(,@14)                               02S0485 01948000
         TM    SCTSNEW(@14),B'00000100'                         02S0485 01949000
         BNO   @RF00485                                         02S0485 01950000
*        JFCDSORG = DSABORG;           /*YES,DEFAULT DSORG IN JFCB   */ 01951000
         L     @08,SJFCBPTR(,@14)                               02S0486 01952000
         L     @14,SIOTETIO(,@14)                               02S0486 01953000
         MVC   JFCDSORG(2,@08),DSABORG(@14)                     02S0486 01954000
*    RFY R15 UNRESTRICTED;                                      02S0487 01955000
@RF00485 DS    0H                                               02S0487 01956000
@RC00483 DS    0H                                               02S0488 01957000
*  END;                                                         02S0488 01958000
*                                                               02S0488 01959000
*IF SCTSNEW = ON & SIOTCTLG = ON       /*NEW,CATALOG DATA SET?       */ 01960000
*  & SIO3DACC = ON                     /*AND DIRECT ACCESS?          */ 01961000
*  & SCTDUMMY = OFF                    /*AND NOT DUMMY?              */ 01962000
*  & SIOTSSDS = OFF                    /*AND NOT SUBSYSTEM DS?       */ 01963000
*  & ERRCODE = ZERO THEN               /*AND NO ERROR ABOVE?         */ 01964000
@RF00479 L     @08,@PC00001+24                                  02S0489 01965000
         L     @08,FSIOTPTR(,@08)                               02S0489 01966000
         TM    SCTSNEW(@08),B'00000100'                         02S0489 01967000
         BNO   @RF00489                                         02S0489 01968000
         TM    SIOTCTLG(@08),B'00000010'                        02S0489 01969000
         BNO   @RF00489                                         02S0489 01970000
         TM    SIO3DACC(@08),B'00100000'                        02S0489 01971000
         BNO   @RF00489                                         02S0489 01972000
         TM    SCTDUMMY(@08),B'10000000'                        02S0489 01973000
         BNZ   @RF00489                                         02S0489 01974000
         TM    SIOTSSDS(@08),B'10000000'                        02S0489 01975000
         BNZ   @RF00489                                         02S0489 01976000
         L     @15,@PC00001+16                                  02S0489 01977000
         ICM   @14,3,ERRCODE(@15)                               02S0489 01978000
         BNZ   @RF00489                                         02S0489 01979000
*  DO;                                 /*YES,CATALOG THE DATA SET    */ 01980000
*/********************************************************************/ 01981000
*/*                                                                  */ 01982000
*/* SEGMENT NAME - CATDS                                             */ 01983000
*/*                                                                  */ 01984000
*/* DESCRIPTIVE NAME - CATALOG THE DATA SET                          */ 01985000
*/*                                                                  */ 01986000
*/* FUNCTION -                                                       */ 01987000
*/*   INVOKE COMMON UNALLOCATION TO CATALOG THE DATA SET.            */ 01988000
*/*                                                                  */ 01989000
*/*   OPERATION -                                                    */ 01990000
*/*     COMMON ALLOCATION'S DISPOSITION PROCESSING ROUTINE WILL      */ 01991000
*/*     INVOKE CATALOG MANAGEMENT. IF AN ERROR OCCURS DURING COMMON  */ 01992000
*/*     UNALLOCATION'S PROCESSING OR CATALOG MANAGEMENT'S PROCESSING,*/ 01993000
*/*     A DYNAMIC ALLOCATION ERROR REASON CODE IS SET. IF SUCCESSFUL */ 01994000
*/*     A BIT IS SET TO INDICATE TO COMMON UNALLOCATION, WHEN IT IS  */ 01995000
*/*     CALLED FROM EITHER DYNAMIC OR STEP UNALLOCATION TO UNALLOCATE*/ 01996000
*/*     THE DATA SET, THAT THE DATA SET HAS BEEN CATALOGED AT        */ 01997000
*/*     ALLOCATION AND TO UNCATALOG THE DATA SET IF THE DATA SET IS  */ 01998000
*/*     DELETED.                                                     */ 01999000
*/*                                                                  */ 02000000
*/********************************************************************/ 02001000
*                                                               03S0491 02002000
*RFY CMUNFMAP BASED(ADDR(UNALFMAP));   /*BASE FOR UNALLOC FUNC. MAP  */ 02003000
*CMUNFMAP = CMUNFMAP && CMUNFMAP;      /*CLEAR FUNCTION MAP          */ 02004000
         LA    @15,UNALFMAP                                     03S0492 02005000
         XC    CMUNFMAP(4,@15),CMUNFMAP(@15)                    03S0492 02006000
*CMDISPRC = ON;                        /*INDICATE TO PROCESS DISP    */ 02007000
         OI    CMDISPRC(@15),B'00100000'                        03S0493 02008000
*CMTIOTNQ = ON;                        /*INDICATE TIOT ENQ'D ON      */ 02009000
         OI    CMTIOTNQ(@15),B'00000001'                        03S0494 02010000
*RFY CMUNRB BASED(ADDR(UNALREQB));     /*COMMON UNALLOC REQ BLK BASE */ 02011000
*CMUNRB = CMUNRB && CMUNRB;            /*CLEAR REQUEST BLOCK         */ 02012000
         LA    @14,UNALREQB                                     03S0496 02013000
         XC    CMUNRB(16,@14),CMUNRB(@14)                       03S0496 02014000
*CMSIOPTR = FSIOTPTR;                  /*SET PTR TO SIOT             */ 02015000
         ST    @08,CMSIOPTR(,@14)                               03S0497 02016000
*CMNMDISP = ON;                        /*INDICATE TO USE NORMAL DISP */ 02017000
         OI    CMNMDISP(@14),B'01000000'                        03S0498 02018000
*UNALCARY = UNALCARY && UNALCARY;      /*CLEAR RETURN CODE ARRAY     */ 02019000
         XC    UNALCARY(8),UNALCARY                             03S0499 02020000
*CALL IEFAB4A0                         /*CATALOG BY COMMON UNALLOC   */ 02021000
*              (CMUNFMAP,ADDR(CMUNRB),JSCBPTR,0,0,              03S0500 02022000
*               0,0,UNALCARY,0);       /*                    @Z40LPPK*/ 02023000
         MVC   @AL00001+12(24),@AL00500                         03S0500 02024000
         ST    @15,@AL00001                                     03S0500 02025000
         ST    @14,@TF00001                                     03S0500 02026000
         LA    @08,@TF00001                                     03S0500 02027000
         ST    @08,@AL00001+4                                   03S0500 02028000
         L     @08,@PC00001+4                                   03S0500 02029000
         ST    @08,@AL00001+8                                   03S0500 02030000
         LA    @08,UNALCARY                                     03S0500 02031000
         ST    @08,@AL00001+28                                  03S0500 02032000
         L     @15,@CV00387                                     03S0500 02033000
         LA    @01,@AL00001                                     03S0500 02034000
         BALR  @14,@15                                          03S0500 02035000
*IF RSNCDARY(4) ^= ZERO THEN           /*ESTAE ERROR?                */ 02036000
         ICM   @08,3,RSNCDARY+6                                 03S0501 02037000
         BZ    @RF00501                                         03S0501 02038000
*  ERRCODE = RCESTAER;                 /*YES, SET REASON CODE        */ 02039000
         L     @08,@PC00001+16                                  03S0502 02040000
         MVC   ERRCODE(2,@08),@CB01112                          03S0502 02041000
*ELSE                                  /*OR                          */ 02042000
*  IF CMINTERR = ON THEN               /*NO,NO CORE FOR VOL LIST ERR?*/ 02043000
         B     @RC00501                                         03S0503 02044000
@RF00501 LA    @08,UNALREQB                                     03S0503 02045000
         TM    CMINTERR(@08),B'00010000'                        03S0503 02046000
         BNO   @RF00503                                         03S0503 02047000
*    ERRCODE = RCNOCORE;               /*YES, SET REASON CODE        */ 02048000
         L     @08,@PC00001+16                                  03S0504 02049000
         MVC   ERRCODE(2,@08),@CB01027                          03S0504 02050000
*  ELSE                                /*OR                          */ 02051000
*    IF CMCATERR = ON THEN             /*NO, ERROR FROM CATALOG?     */ 02052000
         B     @RC00503                                         03S0505 02053000
@RF00503 LA    @08,UNALREQB                                     03S0505 02054000
         TM    CMCATERR(@08),B'01000000'                        03S0505 02055000
         BNO   @RF00505                                         03S0505 02056000
*      ERRCODE = RCCTLGER | CMRETCDE;  /*YES, SET REASON CODE        */ 02057000
         L     @15,@PC00001+16                                  03S0506 02058000
         L     @14,@CF01158                                     03S0506 02059000
         LH    @08,CMRETCDE(,@08)                               03S0506 02060000
         OR    @14,@08                                          03S0506 02061000
         STCM  @14,3,ERRCODE(@15)                               03S0506 02062000
*    ELSE                              /*NO, CATALOG WAS SUCCESSFUL  */ 02063000
*      DO;                                                      03S0507 02064000
         B     @RC00505                                         03S0507 02065000
@RF00505 DS    0H                                               03S0508 02066000
*        JFCCAT = ON;                  /*INDICATE TO UNCAT IF DELETE */ 02067000
         L     @08,@PC00001+24                                  03S0508 02068000
         L     @08,FSIOTPTR(,@08)                               03S0508 02069000
         L     @01,SJFCBPTR(,@08)                               03S0508 02070000
         OI    JFCCAT(@01),B'10000000'                          03S0508 02071000
*        SIOTCALC = ON;                /*INDICATE CATALOGED AT ALLOC */ 02072000
         OI    SIOTCALC(@08),B'00010000'                        03S0509 02073000
*      END;                                                     03S0510 02074000
*  END;                                                         02S0511 02075000
*                                                               02S0511 02076000
@RC00505 DS    0H                                               02S0511 02077000
@RC00503 DS    0H                                               02S0511 02078000
@RC00501 DS    0H                                               02S0512 02079000
*IF NQEXCLSW = ON                      /*SHR TO EXCL ENQ TO BE DONE? */ 02080000
*  & ERRCODE = ZERO THEN               /*AND NO ERROR ABOVE?         */ 02081000
@RF00489 L     @08,@PC00001+20                                  02S0512 02082000
         TM    NQEXCLSW(@08),B'00001000'                        02S0512 02083000
         BNO   @RF00512                                         02S0512 02084000
         L     @08,@PC00001+16                                  02S0512 02085000
         ICM   @15,3,ERRCODE(@08)                               02S0512 02086000
         BNZ   @RF00512                                         02S0512 02087000
*  DO;                                                          02S0513 02088000
*    DSRRFMAP = DSRRFMAP && DSRRFMAP;  /*YES,CLEAR DSENQ RTN FLAGS   */ 02089000
         XC    DSRRFMAP(2),DSRRFMAP                             02S0514 02090000
*    ADDRPASS = ON;                    /*ADDRESS OF DSNQ ENTRY PASSED*/ 02091000
*    ADCHENQ  = ON;                    /*CHANGE ENTRY AND ENQ        */ 02092000
*    ENQEXCL  = ON;                    /*EXCLUSIVE USE               */ 02093000
         OI    ADDRPASS,B'10100001'                             02S0517 02094000
*    CALL IEFAB4DC                     /*INVOKE DSENQ ROUTINE@YM03580*/ 02095000
*                  (DSRRFMAP,0,0,LASTEPAP,ENQTCBP,SCTSNUMB,NQRETPS,     02096000
*                   0,REASONCD,0);                              02S0518 02097000
         LA    @15,DSRRFMAP                                     02S0518 02098000
         ST    @15,@AL00001                                     02S0518 02099000
         LA    @15,@CF00125                                     02S0518 02100000
         ST    @15,@AL00001+4                                   02S0518 02101000
         LA    @15,@CF00125                                     02S0518 02102000
         ST    @15,@AL00001+8                                   02S0518 02103000
         L     @15,@PC00001+8                                   02S0518 02104000
         ST    @15,@AL00001+12                                  02S0518 02105000
         LA    @15,ENQTCBP                                      02S0518 02106000
         ST    @15,@AL00001+16                                  02S0518 02107000
         L     @15,@PC00001+4                                   02S0518 02108000
         L     @01,SCTPTR(,@15)                                 02S0518 02109000
         LA    @15,SCTSNUMB(,@01)                               02S0518 02110000
         ST    @15,@AL00001+20                                  02S0518 02111000
         L     @15,@PC00001+24                                  02S0518 02112000
         LA    @15,NQRETPS(,@15)                                02S0518 02113000
         ST    @15,@AL00001+24                                  02S0518 02114000
         LA    @15,@CF00125                                     02S0518 02115000
         ST    @15,@AL00001+28                                  02S0518 02116000
         ST    @08,@AL00001+32                                  02S0518 02117000
         LA    @08,@CF00125                                     02S0518 02118000
         ST    @08,@AL00001+36                                  02S0518 02119000
         L     @15,@CV00098                                     02S0518 02120000
         LA    @01,@AL00001                                     02S0518 02121000
         BALR  @14,@15                                          02S0518 02122000
*  END;                                                         02S0519 02123000
*                                                               02S0519 02124000
*IF ERRCODE = ZERO THEN                /*SUCCESSFUL ABOVE?           */ 02125000
@RF00512 SLR   @08,@08                                          02S0520 02126000
         L     @15,@PC00001+16                                  02S0520 02127000
         SLR   @14,@14                                          02S0520 02128000
         ICM   @14,3,ERRCODE(@15)                               02S0520 02129000
         CR    @08,@14                                          02S0520 02130000
         BNE   @RF00520                                         02S0520 02131000
*  DO;                                 /*YES,COMPLETE PROCESSING     */ 02132000
*    SAVFEPAP = FSJXEPAP;              /*SAVE EPA PTR TO ASSIGNED BLK*/ 02133000
         L     @15,@PC00001+24                                  02S0522 02134000
         L     SAVFEPAP,FSJXEPAP(,@15)                          02S0522 02135000
*    FSJXEPAP = ZERO;                  /*CLEAR EPA PTR IN DEPARMS    */ 02136000
         ST    @08,FSJXEPAP(,@15)                               02S0523 02137000
*    DEQDSNSW = OFF;                   /*RESET DEQ DSNAME ON ERROR SW*/ 02138000
         L     @08,@PC00001+20                                  02S0524 02139000
         NI    DEQDSNSW(@08),B'11011111'                        02S0524 02140000
*    HSKPDQSW = OFF;                   /*RESET HSKP DEQ SW   @YM06112*/ 02141000
         NI    HSKPDQSW(@08),B'11110111'                        02S0525 02142000
*    UNALOCSW = OFF;                   /*RESET UNALLOC ON ERROR SW   */ 02143000
*                                                               02S0526 02144000
         NI    UNALOCSW(@08),B'11101111'                        02S0526 02145000
*/********************************************************************/ 02146000
*/*                                                                  */ 02147000
*/* SEGMENT NAME - CHAINSIO                                          */ 02148000
*/*                                                                  */ 02149000
*/* DESCRIPTIVE NAME - CHAIN SIOT(S)                                 */ 02150000
*/*                                                                  */ 02151000
*/* FUNCTION - CHAIN SIOT(S) FOR THE REQUEST INTO THE STEP'S SIOT    */ 02152000
*/*   CHAIN.                                                         */ 02153000
*/*                                                                  */ 02154000
*/*   OPERATION -                                                    */ 02155000
*/*     IF SIOTS EXIST FOR THE STEP, THE CURRENT LAST SIOT IS        */ 02156000
*/*     READ IN VIA THE SWA MANAGER INTERFACE RTN. THIS IS   @YA00061*/ 02157000
*/*     NECESSARY AS DSABS MAY NOT EXIST, OR THE SIOT        @YA00061*/ 02158000
*/*     CORRESPONDING TO THE LAST DSAB MAY NOT BE THE LAST           */ 02159000
*/*     SIOT IN THE CHAIN.                                           */ 02160000
*/*                                                                  */ 02161000
*/*     WRITE EPA CHAINING IS DONE FOR UPDATED/CREATED       @YA00061*/ 02162000
*/*     RECORDS, PLACING THESE EPAS ON THE INPUT EPA CHAIN.  @YA00061*/ 02163000
*/*     (SEE CHAINEPA SEGMENT)                               @YA00061*/ 02164000
*/*                                                                  */ 02165000
*/*     THE LAST SIOT'S SVA AND IN-CORE NEXT POINTERS ARE UPDATED TO */ 02166000
*/*     THOSE OF THE FIRST SIOT ASSOCIATED WITH THE REQUEST. IF      */ 02167000
*/*     SIOTS DID NOT EXIST FOR THE STEP, THE SCT FIRST SIOT SVA     */ 02168000
*/*     IS UPDATED. THE SCT LAST SIOT SVA IS UPDATED IN BOTH CASES   */ 02169000
*/*     TO THE SVA OF THE LAST SIOT ASSOCIATED WITH THE REQUEST.     */ 02170000
*/*                                                                  */ 02171000
*/*     (NOTE THAT THE WRITE EPA CHAINING IS DONE BEFORE     @YA00061*/ 02172000
*/*     THE CHAINING OF RECORDS THEMSELVES TO ENSURE THAT IN @YA00061*/ 02173000
*/*     THE EVENT OF PROGRAM INTERRUPTION, ASSIGNED RECORDS  @YA00061*/ 02174000
*/*     WILL BE WRITTEN BY ESTAE PROCESSING AND THEREFORE    @YA00061*/ 02175000
*/*     CAN BE READ IN SUBSEQUENT PROCESSING, E.G.           @YA00061*/ 02176000
*/*     UNALLOCATION.)                                       @YA00061*/ 02177000
*/*                                                                  */ 02178000
*/********************************************************************/ 02179000
*                                                               03S0527 02180000
*OLDLSISW = OFF;                       /*WORK SW,OLD LAST SIOT UPDATE*/ 02181000
         NI    OLDLSISW,B'01111111'                             03S0527 02182000
*IF SCTLSIOT ^= ZERO THEN              /*SIOTS ALREADY ON SIOT CHAIN?*/ 02183000
         L     @08,@PC00001+4                                   03S0528 02184000
         L     @08,SCTPTR(,@08)                                 03S0528 02185000
         SLR   @04,@04                                          03S0528 02186000
         ICM   @04,7,SCTLSIOT(@08)                              03S0528 02187000
         LTR   @04,@04                                          03S0528 02188000
         BZ    @RF00528                                         03S0528 02189000
*  DO;                                 /*YES, READ LAST ONE  @YA00061*/ 02190000
*    SWACTLS = SWACTLS && SWACTLS;     /*ZERO FUNCTION MAP   @YA00061*/ 02191000
         LH    @08,SWACTLS                                      03S0530 02192000
         N     @08,@CF03511                                     03S0530 02193000
         LR    @15,@08                                          03S0530 02194000
         XR    @15,@08                                          03S0530 02195000
         STH   @15,SWACTLS                                      03S0530 02196000
*    SWREAD = ON;                      /*REQUEST READ FN     @YA00061*/ 02197000
*    SWNEW = ON;                       /*CREATE EPAS         @YA00061*/ 02198000
*    SWFREE = ON;                      /*FREE EPAS WHEN DONE @YA00061*/ 02199000
         OI    SWREAD,B'00101100'                               03S0533 02200000
*    SMISVA(1) = SCTLSIOT;             /*SVA OF LAST SIOT    @YA00061*/ 02201000
         STCM  @04,7,SMISVA                                     03S0534 02202000
*    CALL IEFAB4F7(SWACTLS,0,0,ADDR(SMISVAID),ADDR(OLDLSIOT),   03S0535 02203000
*                  RCORDLEN,1);        /*SWA MGR I/F FOR READ@YA00061*/ 02204000
         MVC   @AL00001+4(24),@AL00535                          03S0535 02205000
         LA    @08,SWACTLS                                      03S0535 02206000
         ST    @08,@AL00001                                     03S0535 02207000
         LA    @08,SMISVAID                                     03S0535 02208000
         ST    @08,@TF00001                                     03S0535 02209000
         LA    @08,@TF00001                                     03S0535 02210000
         ST    @08,@AL00001+12                                  03S0535 02211000
         LA    @08,OLDLSIOT                                     03S0535 02212000
         ST    @08,@TF00002                                     03S0535 02213000
         LA    @08,@TF00002                                     03S0535 02214000
         ST    @08,@AL00001+16                                  03S0535 02215000
         L     @15,@CV00099                                     03S0535 02216000
         LA    @01,@AL00001                                     03S0535 02217000
         BALR  @14,@15                                          03S0535 02218000
*    OLDLSISW = ON;                    /*OLD LAST SIOT TO BE UPDATED    02219000
*                                                            @YA00061*/ 02220000
         OI    OLDLSISW,B'10000000'                             03S0536 02221000
*  END;                                                         03S0537 02222000
*ELSE;                                 /*NO SIOTS ON CHAIN YET       */ 02223000
@RF00528 DS    0H                                               03S0539 02224000
*/********************************************************************/ 02225000
*/*                                                                  */ 02226000
*/* SEGMENT NAME - CHAINEPA                                          */ 02227000
*/*                                                                  */ 02228000
*/* DESCRIPTIVE NAME - CHAIN EPA'S FOR THE SCT AND OLD LAST SIOT     */ 02229000
*/*                                                                  */ 02230000
*/* FUNCTION - COMPLETE EPA CHAIN FOR THE REQUEST.                   */ 02231000
*/*                                                                  */ 02232000
*/*   OPERATION -                                                    */ 02233000
*/*     IF EPA'S FOR THE SCT AND OLD LAST SIOT (IF ONE       @YA00061*/ 02234000
*/*     EXISTS) ARE NOT ALREADY ON THE                       @YA00061*/ 02235000
*/*     EPA CHAIN, THEY ARE CREATED. THESE EPA'S                     */ 02236000
*/*     ARE CHAINED TO THE EPA'S FOR THE SIOT(S), JFCB(S),           */ 02237000
*/*     AND JFCBX(S) OF THE REQUEST, AND THEN ALL OF THE EPA'S ARE   */ 02238000
*/*     CHAINED TO THE INPUT EPA CHAIN. (THIS METHOD OF CHAINING IS  */ 02239000
*/*     DONE FOR ESTAE PROCESSING, SO THAT EITHER ALL OR NONE OF THE */ 02240000
*/*     EPA'S ARE ON THE EPA CHAIN, AND THEREFORE, ALL OR NONE OF    */ 02241000
*/*     THE RECORDS WILL BE WRITTEN BY THE ESTAE EXIT.)              */ 02242000
*/*                                                                  */ 02243000
*/* INPUT -                                                          */ 02244000
*/*   OLDLSISW - INDICATES TO CHAINEPA SEGMENT IF OLD LAST SIOT      */ 02245000
*/*              WILL BE UPDATED.                            @YA00061*/ 02246000
*/*   OLDLSIOT - ADDRESS OF OLD LAST SIOT.                           */ 02247000
*/*                                                                  */ 02248000
*/********************************************************************/ 02249000
*RFY (EPACOREL,EPACOREP) RESTRICTED;   /*RESTRICT R0,R1 RESPECTIVELY */ 02250000
*EPACOREL = ZERO;                      /*INIT AMT OF CORE NEEDED     */ 02251000
         SLR   EPACOREL,EPACOREL                                04S0540 02252000
*IF EPASCTSW = OFF THEN                /*EPA FOR SCT ALREADY CHAINED?*/ 02253000
         L     @08,@PC00001+20                                  04S0541 02254000
         TM    EPASCTSW(@08),B'10000000'                        04S0541 02255000
         BNZ   @RF00541                                         04S0541 02256000
*   EPACOREL = EPACOREL+LENGTH(SWAEPA); /*NO, GET CORE FOR EPA       */ 02257000
         AL    EPACOREL,@CF00069                                04S0542 02258000
*IF EPALSISW = OFF                     /*EPA FOR LAST SIOT CHAINED?  */ 02259000
*   & OLDLSISW = ON THEN               /*NO, LAST SIOT TO BE UPDATED?   02260000
*                                                            @YA00061*/ 02261000
@RF00541 L     @08,@PC00001+20                                  04S0543 02262000
         TM    EPALSISW(@08),B'01000000'                        04S0543 02263000
         BNZ   @RF00543                                         04S0543 02264000
         TM    OLDLSISW,B'10000000'                             04S0543 02265000
         BNO   @RF00543                                         04S0543 02266000
*   EPACOREL=EPACOREL+LENGTH(SWAEPA);   /*YES, GET CORE FOR EPA      */ 02267000
         AL    EPACOREL,@CF00069                                04S0544 02268000
*IF EPACOREL > ZERO THEN               /*EPA'S TO BE CREATED/CHAINED?*/ 02269000
@RF00543 LTR   EPACOREL,EPACOREL                                04S0545 02270000
         BNP   @RF00545                                         04S0545 02271000
* DO;                                                           04S0546 02272000
*    R0 = EPACOREL;                    /*LENGTH OF EPA'S             */ 02273000
*    R0=R0 | SUBPOLNO;                 /*GET FROM CORRECT SUBPOOL    */ 02274000
         O     R0,@CF00119                                      04S0548 02275000
*    GEN (GETMAIN R,LV=(0));           /*YES, GET CORE FOR EPA'S     */ 02276000
         GETMAIN R,LV=(0)                                               02277000
*    SWEPAPTR = EPACOREP;              /*SET EPA MAP BASE            */ 02278000
         LR    SWEPAPTR,EPACOREP                                04S0550 02279000
*    IF EPASCTSW = OFF THEN            /*CORE GOTTEN FOR SCT EPA?    */ 02280000
         L     @08,@PC00001+20                                  04S0551 02281000
         TM    EPASCTSW(@08),B'10000000'                        04S0551 02282000
         BNZ   @RF00551                                         04S0551 02283000
*      DO;                             /*YES, SET UP EPA FOR SCT     */ 02284000
*        SWBLKPTR = SCTPTR;            /*SET BLOCK PTR               */ 02285000
         L     @08,@PC00001+4                                   04S0553 02286000
         L     @08,SCTPTR(,@08)                                 04S0553 02287000
         ST    @08,SWBLKPTR(,SWEPAPTR)                          04S0553 02288000
*        SWVA = SCTDISKA;              /*SET SVA                     */ 02289000
         MVC   SWVA(3,SWEPAPTR),SCTDISKA(@08)                   04S0554 02290000
*        SWBLKID = SCTTBLID;           /*SET BLOCK ID                */ 02291000
         MVC   SWBLKID(1,SWEPAPTR),SCTTBLID(@08)                04S0555 02292000
*        SWLNGTH=LENGTH(INSMSCT);      /*SET BLOCK LENGTH            */ 02293000
         MVC   SWLNGTH(4,SWEPAPTR),@CF00166                     04S0556 02294000
*      END;                                                     04S0557 02295000
*    IF EPALSISW = OFF                                          04S0558 02296000
*      & OLDLSISW = ON THEN            /*CORE FOR OLD LAST SIOT EPA? */ 02297000
@RF00551 L     @08,@PC00001+20                                  04S0558 02298000
         TM    EPALSISW(@08),B'01000000'                        04S0558 02299000
         BNZ   @RF00558                                         04S0558 02300000
         TM    OLDLSISW,B'10000000'                             04S0558 02301000
         BNO   @RF00558                                         04S0558 02302000
*      DO;                             /*YES, SET UP LAST SIOT EPA   */ 02303000
*        IF EPASCTSW = OFF THEN        /*EPA FOR SCT CREATED ABOVE?  */ 02304000
         TM    EPASCTSW(@08),B'10000000'                        04S0560 02305000
         BNZ   @RF00560                                         04S0560 02306000
*          DO;                         /*YES,CHAIN IT TO THIS EPA    */ 02307000
*            SWCHNPTR = SWEPAPTR+LENGTH(SWAEPA); /*SET CHAIN FIELD   */ 02308000
         LA    @08,16                                           04S0562 02309000
         ALR   @08,SWEPAPTR                                     04S0562 02310000
         ST    @08,SWCHNPTR(,SWEPAPTR)                          04S0562 02311000
*            SWEPAPTR = SWCHNPTR;      /*POINT TO SIOT EPA           */ 02312000
         LR    SWEPAPTR,@08                                     04S0563 02313000
*          END;                                                 04S0564 02314000
*        ELSE;                         /*NO,EPA PTR ALREADY SET UP   */ 02315000
@RF00560 DS    0H                                               04S0566 02316000
*        SWBLKPTR = OLDLSIOT;          /*SET BLOCK PTR               */ 02317000
         L     @08,OLDLSIOT                                     04S0566 02318000
         ST    @08,SWBLKPTR(,SWEPAPTR)                          04S0566 02319000
*        SWVA = OLDLSIOT->SIOTDSKA;    /*SET SVA                     */ 02320000
         MVC   SWVA(3,SWEPAPTR),SIOTDSKA(@08)                   04S0567 02321000
*        SWBLKID = OLDLSIOT->SIOTTYPE; /*SET BLOCK ID                */ 02322000
         MVC   SWBLKID(1,SWEPAPTR),SIOTTYPE(@08)                04S0568 02323000
*        SWLNGTH = SIOTLNTH;           /*SET BLOCK LENGTH            */ 02324000
         MVC   SWLNGTH(4,SWEPAPTR),@CF00166                     04S0569 02325000
*      END;                                                     04S0570 02326000
*    /* AT THIS POINT, EPACOREP POINTS TO THE FIRST EPA GETMAIN'D,   */ 02327000
*    /* AND SWEPAPTR POINTS TO THE LAST EPA GETMAIN'D.               */ 02328000
*    SWEPAPTR->SWCHNPTR = SAVFEPAP;    /*CHAIN EPA'S FOR ASSIGNED       02329000
*                                        RECORDS TO ABOVE EPA'S      */ 02330000
@RF00558 ST    SAVFEPAP,SWCHNPTR(,SWEPAPTR)                     04S0571 02331000
*    LASTEPAP->SWCHNPTR = EPACOREP;    /*CHAIN EPA'S TO INPUT CHAIN  */ 02332000
         L     @08,@PC00001+8                                   04S0572 02333000
         L     @08,LASTEPAP(,@08)                               04S0572 02334000
         ST    EPACOREP,SWCHNPTR(,@08)                          04S0572 02335000
*    EPASCTSW = ON;                    /*INDICATE EPA FOR SCT ON CHN */ 02336000
         L     @08,@PC00001+20                                  04S0573 02337000
         OI    EPASCTSW(@08),B'10000000'                        04S0573 02338000
*    IF OLDLSISW = ON THEN             /*OLD LAST SIOT TO BE UPDATED?   02339000
*                                                            @YA00061*/ 02340000
         TM    OLDLSISW,B'10000000'                             04S0574 02341000
         BNO   @RF00574                                         04S0574 02342000
*      EPALSISW = ON;                  /*YES INDICATE EPA ON CHAIN   */ 02343000
         OI    EPALSISW(@08),B'01000000'                        04S0575 02344000
*  END;                                                         04S0576 02345000
*ELSE                                  /*CORE NOT GOTTEN ABOVE       */ 02346000
*  LASTEPAP->SWCHNPTR = SAVFEPAP;      /*CHAIN EPA'S FOR ASSIGNED BLK   02347000
*                                        TO INPUT EPA CHAIN          */ 02348000
         B     @RC00545                                         04S0577 02349000
@RF00545 L     @08,@PC00001+8                                   04S0577 02350000
         L     @08,LASTEPAP(,@08)                               04S0577 02351000
         ST    SAVFEPAP,SWCHNPTR(,@08)                          04S0577 02352000
*LASTEPAP = LSJXEPAP;                  /*UPDATE LAST EPA POINTER     */ 02353000
@RC00545 L     @08,@PC00001+8                                   04S0578 02354000
         L     @15,@PC00001+24                                  04S0578 02355000
         L     @14,LSJXEPAP(,@15)                               04S0578 02356000
         ST    @14,LASTEPAP(,@08)                               04S0578 02357000
*RFY (EPACOREL,EPACOREP) UNRESTRICTED; /*RELEASE R0 AND R1           */ 02358000
*IF SCTLSIOT ^= ZERO THEN              /*SIOTS ALREADY EXIST?@YA00061*/ 02359000
         L     @08,@PC00001+4                                   03S0580 02360000
         L     @08,SCTPTR(,@08)                                 03S0580 02361000
         ICM   @14,7,SCTLSIOT(@08)                              03S0580 02362000
         BZ    @RF00580                                         03S0580 02363000
*  DO;                                 /*YES,CHAIN INTO LAST @YA00061*/ 02364000
*    OLDLSIOT->SCTPSIOT = SIOTDSKA;    /*NEW SVA INTO OLD LAST  03S0582 02365000
*                                                            @YA00061*/ 02366000
         L     @08,OLDLSIOT                                     03S0582 02367000
         L     @15,FSIOTPTR(,@15)                               03S0582 02368000
         MVC   SCTPSIOT(3,@08),SIOTDSKA(@15)                    03S0582 02369000
*    OLDLSIOT->SIOTNPTR = FSIOTPTR;    /*NEW IN-CORE PTR ALSO@YA00061*/ 02370000
         ST    @15,SIOTNPTR(,@08)                               03S0583 02371000
*  END;                                /*                    @YA00061*/ 02372000
*ELSE                                  /*NO SIOTS IN CHAIN   @YA00061*/ 02373000
*  SCTFSIOT = SIOTDSKA;                /*NEW SIOTS SVA INTO SCT 03S0585 02374000
*                                                            @YA00061*/ 02375000
         B     @RC00580                                         03S0585 02376000
@RF00580 L     @08,@PC00001+4                                   03S0585 02377000
         L     @08,SCTPTR(,@08)                                 03S0585 02378000
         L     @15,@PC00001+24                                  03S0585 02379000
         L     @01,FSIOTPTR(,@15)                               03S0585 02380000
         MVC   SCTFSIOT(3,@08),SIOTDSKA(@01)                    03S0585 02381000
*SCTLSIOT = NEWLSIOT->SIOTDSKA;        /*SET NEW SCT LAST SIOT SVA   */ 02382000
@RC00580 L     @08,@PC00001+4                                   03S0586 02383000
         L     @08,SCTPTR(,@08)                                 03S0586 02384000
         MVC   SCTLSIOT(3,@08),SIOTDSKA(NEWLSIOT)               03S0586 02385000
*                                                               02S0587 02386000
*/********************************************************************/ 02387000
*/*                                                                  */ 02388000
*/* SEGMENT NAME - SMFINTF                                           */ 02389000
*/*                                                                  */ 02390000
*/* DESCRIPTIVE NAME - SMF INTERFACE                                 */ 02391000
*/*                                                                  */ 02392000
*/* FUNCTION - INTERFACE TO SMF TCTIOT UPDATE ROUTINE.               */ 02393000
*/*                                                                  */ 02394000
*/*   OPERATION -                                                    */ 02395000
*/*     IF MORE THAN ONE SIOT IS ASSOCIATED WITH THE DYNAMIC         */ 02396000
*/*     ALLOCATION REQUEST (USUAL CASE), CORE FROM THE PL/S DSECT    */ 02397000
*/*     IS USED FOR A PARM LIST TO THE TCTIOT UPDATE ROUTINE,        */ 02398000
*/*     IEFDB4F9. OTHERWISE, CORE FOR THE PARM LIST IS OBTAINED      */ 02399000
*/*     VIA THE GETMAIN MACRO. THE PARM LIST IS SET UP AND THE       */ 02400000
*/*     TCTIOT UPDATE ROUTINE IS INVOKED. IF CORE WAS GETMAIN'D,     */ 02401000
*/*     THE FREEMAIN MACRO IS USED TO RELEASE THE CORE USED FOR      */ 02402000
*/*     THE PARM LIST.                                               */ 02403000
*/*                                                                  */ 02404000
*/* INPUT -                                                          */ 02405000
*/*   COUNTSIO - NUMBER OF SIOTS ASSOCIATED WITH THE REQUEST.        */ 02406000
*/*                                                                  */ 02407000
*/********************************************************************/ 02408000
*                                                               03S0587 02409000
*IF COUNTSIO = 1 THEN                  /*ONLY ONE SIOT TO PROCESS?   */ 02410000
         C     COUNTSIO,@CF00103                                03S0587 02411000
         BNE   @RF00587                                         03S0587 02412000
*  SMFLISTP = ADDR(SMFCORE);           /*YES,USE PLS CORE            */ 02413000
         LA    SMFLISTP,SMFCORE                                 03S0588 02414000
*ELSE                                  /*NO,MORE THAN ONE SIOT       */ 02415000
*  DO;                                 /*GET CORE FOR PARM LIST      */ 02416000
         B     @RC00587                                         03S0589 02417000
@RF00587 DS    0H                                               03S0590 02418000
*    SMFLSTLN = COUNTSIO*LENGTH(SMFLSTEL(1)); /*AMOUNT OF CORE       */ 02419000
         LR    SMFLSTLN,COUNTSIO                                03S0590 02420000
         MH    SMFLSTLN,@CH00493                                03S0590 02421000
*    R0 = SMFLSTLN;                    /*SET REGISTER FOR GETMAIN    */ 02422000
         LR    R0,SMFLSTLN                                      03S0591 02423000
*    R0 = R0 | SUBPOLNO;               /*GET FROM CORRECT SUBPOOL    */ 02424000
         O     R0,@CF00119                                      03S0592 02425000
*    GEN (GETMAIN R,LV=(0));           /*GET CORE                    */ 02426000
         GETMAIN R,LV=(0)                                               02427000
*    SMFLISTP = R1;                    /*SET PTR TO CORE             */ 02428000
         LR    SMFLISTP,R1                                      03S0594 02429000
*  END;                                                         03S0595 02430000
*WRKSIOTP = FSIOTPTR;                  /*WORK PTR TO LOOP THRU SIOT'S*/ 02431000
@RC00587 L     @10,@PC00001+24                                  03S0596 02432000
         L     WRKSIOTP,FSIOTPTR(,@10)                          03S0596 02433000
*RFY INDMSIOT BASED(WRKSIOTP);         /*BASE FOR SIOT MAPPING MACRO */ 02434000
*DO I = 1 TO COUNTSIO;                 /*PROCESS SIOT'S JUST ALLOC'D */ 02435000
         LA    I,1                                              03S0598 02436000
         B     @DE00598                                         03S0598 02437000
@DL00598 DS    0H                                               03S0599 02438000
*  SMFLSTEL(I) = SMFLSTEL(I) && SMFLSTEL(I); /*CLEAR PARMLIST ELEMENT*/ 02439000
         LR    @10,I                                            03S0599 02440000
         MH    @10,@CH00493                                     03S0599 02441000
         ST    @10,@TF00001                                     03S0599 02442000
         ALR   @10,SMFLISTP                                     03S0599 02443000
         AL    @10,@CF03524                                     03S0599 02444000
         XC    SMFLSTEL(5,@10),SMFLSTEL(@10)                    03S0599 02445000
*  SMFTIOTP(I) = DSABTIOT;             /*SET TIOT ENTRY PTR          */ 02446000
         L     @10,SIOTETIO(,WRKSIOTP)                          03S0600 02447000
         L     @08,DSABTIOT(,@10)                               03S0600 02448000
         LR    @04,SMFLISTP                                     03S0600 02449000
         AL    @04,@TF00001                                     03S0600 02450000
         AL    @04,@CF03524                                     03S0600 02451000
         STCM  @08,15,SMFTIOTP(@04)                             03S0600 02452000
*  IF DSABVAM=ON THEN                  /*IF DSAB IS VAM THEN @ZA02961*/ 02453000
         TM    DSABVAM(@10),B'00100000'                         03S0601 02454000
         BNO   @RF00601                                         03S0601 02455000
*    SMFVAM=ON;                        /*VAM ON IN SMFLIST   @ZA02961*/ 02456000
         OI    SMFVAM(SMFLISTP),B'01000000'                     03S0602 02457000
*  WRKSIOTP = SIOTNPTR;                /*GET NEXT SIOT ADDRESS       */ 02458000
@RF00601 L     WRKSIOTP,SIOTNPTR(,WRKSIOTP)                     03S0603 02459000
*END;                                                           03S0604 02460000
         AL    I,@CF00103                                       03S0604 02461000
@DE00598 CR    I,COUNTSIO                                       03S0604 02462000
         BNH   @DL00598                                         03S0604 02463000
*SMFLAST(COUNTSIO) = ON;               /*SET LAST ELEMENT INDICATOR  */ 02464000
         LR    @10,COUNTSIO                                     03S0605 02465000
         MH    @10,@CH00493                                     03S0605 02466000
         ALR   @10,SMFLISTP                                     03S0605 02467000
         BCTR  @10,0                                            03S0605 02468000
         OI    SMFLAST-4(@10),B'10000000'                       03S0605 02469000
*RFY INDMSIOT BASED(FSIOTPTR);         /*RESET SIOT MAPPING BASE     */ 02470000
*CALL IEFDB4F9 (VERBCODE,TCBPTR,SMFLIST,DEPARMS,JSCDSABQ,SMFPARMS);     02471000
         LA    @10,@CB00392                                     03S0607 02472000
         ST    @10,@AL00001                                     03S0607 02473000
         L     @10,@PC00001+4                                   03S0607 02474000
         LA    @08,TCBPTR(,@10)                                 03S0607 02475000
         ST    @08,@AL00001+4                                   03S0607 02476000
         ST    SMFLISTP,@AL00001+8                              03S0607 02477000
         L     @08,@PC00001+24                                  03S0607 02478000
         ST    @08,@AL00001+12                                  03S0607 02479000
         L     @10,JSCBPTR(,@10)                                03S0607 02480000
         LA    @10,JSCDSABQ(,@10)                               03S0607 02481000
         ST    @10,@AL00001+16                                  03S0607 02482000
         L     @10,@PC00001+28                                  03S0607 02483000
         ST    @10,@AL00001+20                                  03S0607 02484000
         L     @15,@CV00389                                     03S0607 02485000
         LA    @01,@AL00001                                     03S0607 02486000
         BALR  @14,@15                                          03S0607 02487000
*                                      /*SMF ROUTINE         @ZA02706*/ 02488000
*IF SMFLISTP ^= ADDR(SMFCORE) THEN     /*WAS CORE GETMAIN'D FOR PARMS*/ 02489000
         LA    @10,SMFCORE                                      03S0608 02490000
         CR    SMFLISTP,@10                                     03S0608 02491000
         BE    @RF00608                                         03S0608 02492000
*  DO;                                 /*YES,FREE IT                 */ 02493000
*    R0 = SMFLSTLN;                    /*REGISTER FOR FREEMAIN       */ 02494000
         LR    R0,SMFLSTLN                                      03S0610 02495000
*    R0 = R0 | SUBPOLNO;               /*FREE FROM CORRECT SUBPOOL   */ 02496000
         O     R0,@CF00119                                      03S0611 02497000
*    R1 = SMFLISTP;                    /*REGISTER FOR FREEMAIN       */ 02498000
         LR    R1,SMFLISTP                                      03S0612 02499000
*    GEN (FREEMAIN R,LV=(0),A=(1));    /*FREE PARM LIST CORE         */ 02500000
         FREEMAIN R,LV=(0),A=(1)                                        02501000
*  END;                                                         03S0614 02502000
*  END;                                                         02S0615 02503000
@RF00608 DS    0H                                               02S0616 02504000
*  END;                                                         01S0616 02505000
@RF00520 DS    0H                                               01S0617 02506000
*IF ERRCODE^=ZERO THEN                 /*ANY ERROR?                  */ 02507000
@RF00443 L     @10,@PC00001+16                                  01S0617 02508000
         ICM   @08,3,ERRCODE(@10)                               01S0617 02509000
         BZ    @RF00617                                         01S0617 02510000
*  CALL IEFDB418 (DEPARMS);            /*YES,DO ERROR CLEAN-UP       */ 02511000
         L     @10,@PC00001+24                                  01S0618 02512000
         ST    @10,@AL00001                                     01S0618 02513000
         L     @15,@CV00101                                     01S0618 02514000
         LA    @01,@AL00001                                     01S0618 02515000
         BALR  @14,@15                                          01S0618 02516000
*RETURN CODE(ZERO);                    /*RETURN CODE OF ZERO         */ 02517000
@RF00617 L     @13,4(,@13)                                      01S0619 02518000
         L     @00,@SIZDATD                                     01S0619 02519000
         LR    @01,@11                                          01S0619 02520000
         FSPACE   R,LV=(0),A=(1)                                        02521000
         SLR   @15,@15                                          01S0619 02522000
         L     @14,12(,@13)                                     01S0619 02523000
         LM    @00,@12,20(@13)                                  01S0619 02524000
         BR    @14                                              01S0619 02525000
*/********************************************************************/ 02526000
*/*                                                                  */ 02527000
*/* SEGMENT NAME - SETRCODE                                          */ 02528000
*/*                                                                  */ 02529000
*/* DESCRIPTIVE NAME - SET DYNAMIC ALLOC ERROR REASON CODE           */ 02530000
*/*                                                                  */ 02531000
*/* FUNCTION - TRANSLATE THE REASON CODES FROM JFCB HOUSEKEEPING AND */ 02532000
*/*   COMMON ALLOCATION INTO A DYNAMIC ALLOCATION ERROR REASON CODE. */ 02533000
*/*                                                                  */ 02534000
*/*   OPERATION - IF A NON-SIOT RELATED REASON CODE IS RETURNED FROM */ 02535000
*/*     HOUSEKEEPING OR ALLOCATION, SET THE DYNAMIC ALLOCATION REASON*/ 02536000
*/*     CODE AS DEFINED BY THE ARRAY, NSRSNCOD. IF A         @G29AN2F*/ 02537000
*/*     SUBSYSTEM RETURNED AN INFORMATION REASON CODE IN THE @G29AN2F*/ 02538000
*/*     SUBSYSTEM ERROR BLOCK, THE INFO CODE FROM THE        @G29AN2F*/ 02539000
*/*     SUBSYSTEM ERROR BLOCK IS PLACED IN THE DYNAMIC INFO  @G29AN2F*/ 02540000
*/*     REASON CODE FIELD.   FOR SIOT RELATED                @G29AN2F*/ 02541000
*/*     REASON CODES, IF THE REASON CODE IS 'INVALID GDG SINGLE      */ 02542000
*/*     RELATIVE NUMBER', SET THE DYNAMIC ERROR CODE TO THE VALUE FOR*/ 02543000
*/*     'INVALID TEXT UNIT PARM', AND SET THE DYNAMIC INFO REASON    */ 02544000
*/*     TO THE VALUE FOR MEMBER NAME KEY. (THE INFO CODE IS SET TO BE*/ 02545000
*/*     CONSISTANT WITH THE WAY THE 'INVALID TEXT UNIT PARM' REASON  */ 02546000
*/*     CODE IS RETURNED BY IEFDB412.) OTHERWISE USE THE ARRAY OF    */ 02547000
*/*     SIOT RELATED REASON CODES, SIRSNCOD, TO SET THE DYNAMIC ERROR*/ 02548000
*/*     REASON CODE. IF THE SIOT IS FOR A SUBSYSTEM DATA SET @G29AN2F*/ 02549000
*/*     THE DYNAMIC INFO REASON CODE IS SET WITH THE VALUE   @G29AN2F*/ 02550000
*/*     OR THE INDICATOR FOR AN INFORMATION CODE IS ON,      @G24LPSJ*/ 02551000
*/*     OF FIELD SIOTSSIC.                                   @G29AN2F*/ 02552000
*/*                                                                  */ 02553000
*/* INPUT -                                                          */ 02554000
*/*   NSIOTERR - NON-SIOT RELATED REASON CODE FROM HOUSEKEEPING OR   */ 02555000
*/*              ALLOCATION                                          */ 02556000
*/*   FSIOTPTR - PTR TO FIRST SIOT OF REQUEST                        */ 02557000
*/*                                                                  */ 02558000
*/* OUTPUT -                                                         */ 02559000
*/*   ERRCODE/INFOCODE - DYNAMIC ALLOC REASON CODES FILLED IN        */ 02560000
*/*                                                                  */ 02561000
*/********************************************************************/ 02562000
*SETRCODE: PROC;                                                02S0620 02563000
@EL00001 L     @13,4(,@13)                                      02S0620 02564000
@EF00001 L     @00,@SIZDATD                                     02S0620 02565000
         LR    @01,@11                                          02S0620 02566000
         FSPACE   R,LV=(0),A=(1)                                        02567000
@ER00001 LM    @14,@12,12(@13)                                  02S0620 02568000
         BR    @14                                              02S0620 02569000
SETRCODE STM   @14,@12,12(@13)                                  02S0620 02570000
*IF NSIOTERR ^= ZERO THEN              /*NON-SIOT RELATED ERROR?     */ 02571000
         LH    @10,NSIOTERR                                     02S0621 02572000
         SLR   @08,@08                                          02S0621 02573000
         CR    @10,@08                                          02S0621 02574000
         BE    @RF00621                                         02S0621 02575000
*  DO;                                                          02S0622 02576000
*    ERRCODE = NSRSNCOD(NSIOTERR);     /*YES,SET REASON CODE         */ 02577000
         L     @15,@PC00001+16                                  02S0623 02578000
         ALR   @10,@10                                          02S0623 02579000
         LA    @14,NSRSNCOD-2(@10)                              02S0623 02580000
         MVC   ERRCODE(2,@15),0(@14)                            02S0623 02581000
*    IF SSEINCDE ^= ZERO THEN          /*DID A SUBSYSTEM RETURN AN      02582000
*                                        INFO CODE ?         @G29AN2F*/ 02583000
         LH    @10,SSEINCDE                                     02S0624 02584000
         CR    @10,@08                                          02S0624 02585000
         BE    @RF00624                                         02S0624 02586000
*      INFOCODE = SSEINCDE;            /*YES, RETURN IT      @G29AN2F*/ 02587000
         STCM  @10,3,INFOCODE(@15)                              02S0625 02588000
*  END;                                                         02S0626 02589000
*ELSE                                  /*NO,ERROR FOR PARTICULAR SIOT*/ 02590000
*  IF SIOTRSNC = 52 THEN               /*GDG SINGLE REL # ERROR?     */ 02591000
         B     @RC00621                                         02S0627 02592000
@RF00621 L     @10,@PC00001+24                                  02S0627 02593000
         L     @10,FSIOTPTR(,@10)                               02S0627 02594000
         CLC   SIOTRSNC(2,@10),@CH03492                         02S0627 02595000
         BNE   @RF00627                                         02S0627 02596000
*    DO;                                                        02S0628 02597000
*      ERRCODE = RCINPARM;             /*YES,SET BAD PARM VALUE CODE */ 02598000
         L     @10,@PC00001+16                                  02S0629 02599000
         MVC   ERRCODE(2,@10),@CB01048                          02S0629 02600000
*      INFOCODE = DALMEMBR;            /*MEMBER KEY CAUSED ERROR     */ 02601000
         MVC   INFOCODE(2,@10),@CB00692                         02S0630 02602000
*    END;                                                       02S0631 02603000
*  ELSE                                /*NOT GDG SINGLE REL # ERROR  */ 02604000
*    DO;                                                        02S0632 02605000
         B     @RC00627                                         02S0632 02606000
@RF00627 DS    0H                                               02S0633 02607000
*      ERRSIOTP = FSIOTPTR;            /*INIT PTR TO SIOT WITH ERROR */ 02608000
         L     @10,@PC00001+24                                  02S0633 02609000
         L     ERRSIOTP,FSIOTPTR(,@10)                          02S0633 02610000
*      DO WHILE(ERRSIOTP->SIOTRSNC = ZERO); /*FIND SIOT WITH ERROR   */ 02611000
         B     @DE00634                                         02S0634 02612000
@DL00634 DS    0H                                               02S0635 02613000
*        ERRSIOTP = ERRSIOTP->SIOTNPTR; /*NOT ERR SIOT,GET NEXT SIOT */ 02614000
         L     ERRSIOTP,SIOTNPTR(,ERRSIOTP)                     02S0635 02615000
*      END;                                                     02S0636 02616000
@DE00634 LH    @10,SIOTRSNC(,ERRSIOTP)                          02S0636 02617000
         LTR   @10,@10                                          02S0636 02618000
         BZ    @DL00634                                         02S0636 02619000
*      ERRCODE = SIRSNCOD(ERRSIOTP->SIOTRSNC); /*SET DYN ERROR CODE  */ 02620000
         L     @08,@PC00001+16                                  02S0637 02621000
         ALR   @10,@10                                          02S0637 02622000
         LA    @03,SIRSNCOD-2(@10)                              02S0637 02623000
         MVC   ERRCODE(2,@08),0(@03)                            02S0637 02624000
*      IF ERRSIOTP->SIOTSSGP = ON |    /*WAS THE REQUEST FOR    02S0638 02625000
*                                        SSNAME KEY?         @G24LPSJ*/ 02626000
*         ERRSIOTP->SIOTINFC = ON THEN /* OR IF THERE IS AN INFO        02627000
*                                         CODE               @G24LPSJ*/ 02628000
         TM    SIOTSSGP(ERRSIOTP),B'10010000'                   02S0638 02629000
         BZ    @RF00638                                         02S0638 02630000
*        INFOCODE = SIOTSSIC;          /*YES, SET INFO CODE  @G29AN2F*/ 02631000
         L     @10,@PC00001+24                                  02S0639 02632000
         L     @10,FSIOTPTR(,@10)                               02S0639 02633000
         MVC   INFOCODE(2,@08),SIOTSSIC(@10)                    02S0639 02634000
*    END;                                                       02S0640 02635000
*END SETRCODE;                                                  02S0641 02636000
@EL00002 DS    0H                                               02S0641 02637000
@EF00002 DS    0H                                               02S0641 02638000
@ER00002 LM    @14,@12,12(@13)                                  02S0641 02639000
         BR    @14                                              02S0641 02640000
*END IEFDB413                                                   01S0642 02641000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 02642000
*/*%INCLUDE SYSLIB  (NORMALDT)                                        * 02643000
*/*%INCLUDE SYSLIB  (IEFZB428)                                        * 02644000
*/*%INCLUDE SYSLIB  (IEFZB424)                                        * 02645000
*/*%INCLUDE SYSLIB  (IEFZB439)                                        * 02646000
*/*%INCLUDE SYSLIB  (IEFZB4D7)                                        * 02647000
*/*%INCLUDE SYSLIB  (IEFZB4D9)                                        * 02648000
*/*%INCLUDE SYSLIB  (IEFZB436)                                        * 02649000
*/*%INCLUDE SYSLIB  (IEFZB445)                                        * 02650000
*/*%INCLUDE SYSLIB  (IEFZB454)                                        * 02651000
*/*%INCLUDE SYSLIB  (IEFZB4D6)                                        * 02652000
*/*%INCLUDE SYSLIB  (IEFZB4D2)                                        * 02653000
*/*%INCLUDE SYSLIB  (IEFZB4D1)                                        * 02654000
*/*%INCLUDE SYSLIB  (IEFZB4D3)                                        * 02655000
*/*%INCLUDE SYSLIB  (IEFZB4DA)                                        * 02656000
*/*%INCLUDE SYSLIB  (IEFZB505)                                        * 02657000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 02658000
*/*%INCLUDE SYSLIB  (IEEBASEA)                                        * 02659000
*/*%INCLUDE SYSLIB  (IEFAJCTB)                                        * 02660000
*/*%INCLUDE SYSLIB  (IEFASCTB)                                        * 02661000
*/*%INCLUDE SYSLIB  (IEFASIOT)                                        * 02662000
*/*%INCLUDE SYSLIB  (IEFJFCBN)                                        * 02663000
*/*%INCLUDE SYSLIB  (IEFJFCBX)                                        * 02664000
*/*%INCLUDE SYSLIB  (IEZJSCB )                                        * 02665000
*/*%INCLUDE SYSLIB  (IHAASCB )                                        * 02666000
*/*%INCLUDE SYSLIB  (IHADSAB )                                        * 02667000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                        * 02668000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                        * 02669000
*/*%INCLUDE SYSLIB  (IEFJESCT)                                        * 02670000
*/*%INCLUDE SYSLIB  (IEFJSSOB)                                        * 02671000
*/*%INCLUDE SYSLIB  (DSRRINTF)                                        * 02672000
*/*%INCLUDE SYSLIB  (COPYINFO)                                        * 02673000
*/*%INCLUDE SYSLIB  (HSKPINTF)                                        * 02674000
*/*%INCLUDE SYSLIB  (SPACEDEF)                                        * 02675000
*/*%INCLUDE SYSLIB  (JES3INTF)                                        * 02676000
*/*%INCLUDE SYSLIB  (BLDFUNCT)                                        * 02677000
*/*%INCLUDE SYSLIB  (ALLOCINT)                                        * 02678000
*/*%INCLUDE SYSLIB  (TIOTMGRI)                                        * 02679000
*/*%INCLUDE SYSLIB  (ALWRAPUP)                                        * 02680000
*/*%INCLUDE SYSLIB  (UPSIODSA)                                        * 02681000
*/*%INCLUDE SYSLIB  (CATDS   )                                        * 02682000
*/*%INCLUDE SYSLIB  (CHAINSIO)                                        * 02683000
*/*%INCLUDE SYSLIB  (CHAINEPA)                                        * 02684000
*/*%INCLUDE SYSLIB  (SMFINTF )                                        * 02685000
*/*%INCLUDE SYSLIB  (SETRCODE)                                        * 02686000
*;                                                              01S0642 02687000
@DATA    DS    0H                                                       02688000
@CH01930 DC    H'20'                                                    02689000
@CH03459 DC    H'23'                                                    02690000
@CH03492 DC    H'52'                                                    02691000
@SM03519 MVC   WORK(0),TEXTUPAR(@08)                                    02692000
         DS    0F                                                       02693000
@AL00500 DC    A(@CF00125)             LIST WITH   6 ARGUMENT(S)        02694000
         DC    A(@CF00125)                                              02695000
@AL00535 DC    A(@CF00125)             LIST WITH   6 ARGUMENT(S)        02696000
         DC    A(@CF00125)                                              02697000
         DC    A(@CF00125)                                              02698000
         DC    A(@CF00125)                                              02699000
         DC    A(@CF00166)                                              02700000
         DC    A(@CF00103)                                              02701000
@DATD    DSECT                                                          02702000
         DS    0F                                                       02703000
@SA00001 DS    18F                                                      02704000
@PC00001 DS    8F                                                       02705000
@AL00001 DS    11A                                                      02706000
@TF00001 DS    F                                                        02707000
@TF00002 DS    F                                                        02708000
IEFDB413 CSECT                                                          02709000
         DS    0F                                                       02710000
@CF00125 DC    F'0'                                                     02711000
@CF00103 DC    F'1'                                                     02712000
@CF00493 DC    F'5'                                                     02713000
@CH00493 EQU   @CF00493+2                                               02714000
@CF00069 DC    F'16'                                                    02715000
@CH00069 EQU   @CF00069+2                                               02716000
@CF00166 DC    F'176'                                                   02717000
@CF03524 DC    F'-5'                                                    02718000
@CF03518 DC    F'-4'                                                    02719000
@CF00119 DC    XL4'E6000000'                                            02720000
@CF03511 DC    XL4'0000FFFF'                                            02721000
@CF01158 DC    XL4'5700'                                                02722000
@CF01160 DC    XL4'6700'                                                02723000
@DATD    DSECT                                                          02724000
         DS    0D                                                       02725000
CFMAPTR  DS    A                                                        02726000
CMRBPTR  DS    A                                                        02727000
DSABPTR  DS    A                                                        02728000
DSRRMSGP DS    A                                                        02729000
ENQTCBP  DS    A                                                        02730000
FMAPPTR  DS    A                                                        02731000
JFCBPTR  DS    A                                                        02732000
PSCBPTR  DS    A                                                        02733000
SIOTPTR  DS    A                                                        02734000
S99TXTPP DS    A                                                        02735000
TXTUFLDP DS    A                                                        02736000
NUMJFCBX DS    F                                                        02737000
ALMSGINP DS    A                                                        02738000
DUMMYECB DS    F                                                        02739000
TIORBPTR DS    A                                                        02740000
OLDLSIOT DS    A                                                        02741000
NSIOTERR DS    H                                                        02742000
SWACTLS  DS    FL2                                                      02743000
         ORG   SWACTLS                                                  02744000
SWASN    DS    BL1                                                      02745000
SWDEL    EQU   SWACTLS+0                                                02746000
SWREAD   EQU   SWACTLS+0                                                02747000
SWWRT    EQU   SWACTLS+0                                                02748000
SWNEW    EQU   SWACTLS+0                                                02749000
SWFREE   EQU   SWACTLS+0                                                02750000
SWMOD    EQU   SWACTLS+0                                                02751000
SWOLD    EQU   SWACTLS+0                                                02752000
SWCHN    DS    BL1                                                      02753000
@NM00153 EQU   SWACTLS+1                                                02754000
         ORG   SWACTLS+2                                                02755000
HSKFLAGS DS    BL2                                                      02756000
         ORG   HSKFLAGS                                                 02757000
HSKPDISW DS    BL1                                                      02758000
HSKNOCHN EQU   HSKFLAGS+0                                               02759000
HSKMOUNT EQU   HSKFLAGS+0                                               02760000
HSKWTUNT EQU   HSKFLAGS+0                                               02761000
HSKUNALC EQU   HSKFLAGS+0                                               02762000
HSKNOREC EQU   HSKFLAGS+0                                               02763000
HSKWTVOL EQU   HSKFLAGS+0                                               02764000
HSKNSCAT EQU   HSKFLAGS+0                                               02765000
HSKOFFDV DS    BL1                                                      02766000
HSKNOENQ EQU   HSKFLAGS+1                                               02767000
HSKJSCBA EQU   HSKFLAGS+1                                               02768000
HSKJCT   EQU   HSKFLAGS+1                                               02769000
HSKNORES EQU   HSKFLAGS+1                                               02770000
HSKNAUTH EQU   HSKFLAGS+1                                               02771000
HSKNOVRD EQU   HSKFLAGS+1                                               02772000
@NM00001 EQU   HSKFLAGS+1                                               02773000
         ORG   HSKFLAGS+2                                               02774000
JHRETMAP DS    BL1                                                      02775000
         ORG   JHRETMAP                                                 02776000
JHMSSTRM DS    BL1                                                      02777000
@NM00002 EQU   JHRETMAP+0                                               02778000
         ORG   JHRETMAP+1                                               02779000
JESFLAGS DS    CL2                                                      02780000
         ORG   JESFLAGS                                                 02781000
JSVOLMNT DS    BL1                                                      02782000
JSOFFLIN EQU   JESFLAGS+0                                               02783000
JSWTADEV EQU   JESFLAGS+0                                               02784000
JSWTDSN  EQU   JESFLAGS+0                                               02785000
JSWTVOL  EQU   JESFLAGS+0                                               02786000
JSPCATIN EQU   JESFLAGS+0                                               02787000
@NM00003 EQU   JESFLAGS+0                                               02788000
         ORG   JESFLAGS+2                                               02789000
ALCFLAGS DS    BL2                                                      02790000
TMGRCORE DS    CL38                                                     02791000
UNALCARY DS    CL8                                                      02792000
WORK     DS    CL8                                                      02793000
         DS    CL3                                                      02794000
PWPARMS  DS    CL12                                                     02795000
         ORG   PWPARMS                                                  02796000
PWTTRADR DS    AL4                                                      02797000
         ORG   PWTTRADR                                                 02798000
PWENTRCD DS    AL1                                                      02799000
         ORG   PWPARMS+4                                                02800000
PWDSNADR DS    AL4                                                      02801000
         ORG   PWDSNADR                                                 02802000
PWDSNLEN DS    AL1                                                      02803000
         ORG   PWPARMS+8                                                02804000
PWPASADR DS    AL4                                                      02805000
         ORG   PWPARMS+12                                               02806000
SMFCORE  DS    CL5                                                      02807000
UNALCORE DS    CL20                                                     02808000
         ORG   UNALCORE                                                 02809000
UNALFMAP DS    CL4                                                      02810000
UNALREQB DS    CL16                                                     02811000
         ORG   UNALCORE+20                                              02812000
@NM00035 DS    BL1                                                      02813000
         ORG   @NM00035                                                 02814000
OLDLSISW DS    BL1                                                      02815000
         ORG   @NM00035+1                                               02816000
         DS    CL2                                                      02817000
SSERRBLK DS    CL8                                                      02818000
         ORG   SSERRBLK                                                 02819000
SSEINCDE DS    FL2                                                      02820000
SSESMSGI DS    FL2                                                      02821000
SSEMBPTR DS    AL4                                                      02822000
         ORG   SSERRBLK+8                                               02823000
DSRRFMAP DS    CL2                                                      02824000
         ORG   DSRRFMAP                                                 02825000
ADDRPASS DS    BL1                                                      02826000
ADCHONLY EQU   DSRRFMAP+0                                               02827000
ADCHENQ  EQU   DSRRFMAP+0                                               02828000
DELEONLY EQU   DSRRFMAP+0                                               02829000
DELEDEQ  EQU   DSRRFMAP+0                                               02830000
NOSHRXCL EQU   DSRRFMAP+0                                               02831000
ENQSHR   EQU   DSRRFMAP+0                                               02832000
ENQEXCL  EQU   DSRRFMAP+0                                               02833000
ENQWAIT  DS    BL1                                                      02834000
RETADDR  EQU   DSRRFMAP+1                                               02835000
RETINDIC EQU   DSRRFMAP+1                                               02836000
READALL  EQU   DSRRFMAP+1                                               02837000
INCORREC EQU   DSRRFMAP+1                                               02838000
EPAJCTEX EQU   DSRRFMAP+1                                               02839000
SRCHDSNM EQU   DSRRFMAP+1                                               02840000
NEPAPROC EQU   DSRRFMAP+1                                               02841000
         ORG   DSRRFMAP+2                                               02842000
         DS    CL2                                                      02843000
SSOB     DS    CL20                                                     02844000
         ORG   SSOB                                                     02845000
SSOBID   DS    CL4                                                      02846000
SSOBLEN  DS    FL2                                                      02847000
SSOBFUNC DS    FL2                                                      02848000
SSOBSSIB DS    AL4                                                      02849000
SSOBRETN DS    AL4                                                      02850000
SSOBINDV DS    AL4                                                      02851000
         ORG   SSOB+20                                                  02852000
SSDY     DS    CL16                                                     02853000
         ORG   SSDY                                                     02854000
SSDYLEN  DS    FL2                                                      02855000
SSDYRSV0 DS    FL2                                                      02856000
SSDYSIOT DS    AL4                                                      02857000
SSDYPFLG DS    AL4                                                      02858000
SSDYRSV1 DS    FL4                                                      02859000
         ORG   SSDY+16                                                  02860000
SMISVAB  DS    17F                                                      02861000
SMISVAID DS    FL4                                                      02862000
         ORG   SMISVAID+0                                               02863000
SMISVA   DS    CL3                                                      02864000
SMIID    DS    CL1                                                      02865000
         ORG   SMISVAID+68                                              02866000
IEFDB413 CSECT                                                          02867000
         DS    0F                                                       02868000
@SIZDATD DC    AL1(230)                                                 02869000
         DC    AL3(@ENDDATD-@DATD)                                      02870000
@CV00098 DC    V(IEFAB4DC)                                              02871000
@CV00099 DC    V(IEFAB4F7)                                              02872000
@CV00100 DC    V(IEFDB414)                                              02873000
@CV00101 DC    V(IEFDB418)                                              02874000
@CV00162 DC    V(IEFAB451)                                              02875000
@CV00234 DC    V(IEFAB421)                                              02876000
@CV00269 DC    V(IEFAB4FC)                                              02877000
@CV00387 DC    V(IEFAB4A0)                                              02878000
@CV00388 DC    V(IEFDB4FE)                                              02879000
@CV00389 DC    V(IEFDB4F9)                                              02880000
@CA00650 DC    A(IEFAB445)                                              02881000
         DS    0D                                                       02882000
@CC00181 DC    C'SSOB'                                                  02883000
@CB00692 DC    X'0003'                                                  02884000
@CB01027 DC    X'0204'                                                  02885000
@CB01028 DC    X'020C'                                                  02886000
@CB01029 DC    X'0210'                                                  02887000
@CB01030 DC    X'0214'                                                  02888000
@CB01033 DC    X'0220'                                                  02889000
@CB01039 DC    X'0238'                                                  02890000
@CB01048 DC    X'035C'                                                  02891000
@CB01112 DC    X'047C'                                                  02892000
@CB00392 DC    X'01'                                                    02893000
         DS    CL1                                                      02894000
JESFAIL  DS    CL14                                                     02895000
         ORG   JESFAIL                                                  02896000
@NM00004 DC    X'0218'                                                  02897000
@NM00005 DC    X'0220'                                                  02898000
@NM00006 DC    X'0220'                                                  02899000
@NM00007 DC    X'0210'                                                  02900000
@NM00008 DC    X'0214'                                                  02901000
@NM00009 DC    X'0224'                                                  02902000
@NM00010 DC    X'0484'                                                  02903000
         ORG   JESFAIL+14                                               02904000
NSRSCODE DS    CL60                                                     02905000
         ORG   NSRSCODE                                                 02906000
@NM00036 DC    X'023C'                                                  02907000
@NM00037 DC    X'0204'                                                  02908000
@NM00038 DC    X'0220'                                                  02909000
@NM00039 DC    X'FFFF'                                                  02910000
@NM00040 DC    X'0484'                                                  02911000
@NM00041 DC    X'0238'                                                  02912000
@NM00042 DC    X'0220'                                                  02913000
@NM00043 DC    X'049C'                                                  02914000
@NM00044 DC    X'0474'                                                  02915000
@NM00045 DC    X'0248'                                                  02916000
@NM00046 DC    X'0450'                                                  02917000
@NM00047 DC    X'172C'                                                  02918000
@NM00048 DC    X'1718'                                                  02919000
@NM00049 DC    X'670C'                                                  02920000
@NM00050 DC    X'0478'                                                  02921000
@NM00051 DC    X'047C'                                                  02922000
@NM00052 DC    X'0214'                                                  02923000
@NM00053 DC    X'0490'                                                  02924000
@NM00054 DC    X'0468'                                                  02925000
@NM00055 DC    X'FFFF'                                                  02926000
@NM00056 DC    X'FFFF'                                                  02927000
@NM00057 DC    X'FFFF'                                                  02928000
@NM00058 DC    X'0498'                                                  02929000
@NM00059 DC    X'04A0'                                                  02930000
@NM00060 DC    X'FFFF'                                                  02931000
@NM00061 DC    X'024C'                                                  02932000
@NM00062 DC    X'0250'                                                  02933000
@NM00063 DC    X'03A0'                                                  02934000
@NM00064 DC    X'04A4'                                                  02935000
@NM00065 DC    X'7700'                                                  02936000
         ORG   NSRSCODE+60                                              02937000
SIRSCODE DS    CL194                                                    02938000
         ORG   SIRSCODE                                                 02939000
@NM00066 DC    X'1708'                                                  02940000
@NM00067 DC    X'0244'                                                  02941000
@NM00068 DC    X'0210'                                                  02942000
@NM00069 DC    X'020C'                                                  02943000
@NM00070 DC    X'0458'                                                  02944000
@NM00071 DC    X'0214'                                                  02945000
@NM00072 DC    X'FFFF'                                                  02946000
@NM00073 DC    X'021C'                                                  02947000
@NM00074 DC    X'0480'                                                  02948000
@NM00075 DC    X'0224'                                                  02949000
@NM00076 DC    X'0398'                                                  02950000
@NM00077 DC    X'4714'                                                  02951000
@NM00078 DC    X'FFFF'                                                  02952000
@NM00079 DC    2X'FFFF'                                                 02953000
@NM00080 DC    X'47A8'                                                  02954000
@NM00081 DC    X'47AC'                                                  02955000
@NM00082 DC    2X'FFFF'                                                 02956000
@NM00083 DC    X'039C'                                                  02957000
@NM00084 DC    X'0228'                                                  02958000
@NM00085 DC    X'4704'                                                  02959000
@NM00086 DC    X'4708'                                                  02960000
@NM00087 DC    X'470C'                                                  02961000
@NM00088 DC    X'4710'                                                  02962000
@NM00089 DC    X'4714'                                                  02963000
@NM00090 DC    X'4718'                                                  02964000
@NM00091 DC    5X'FFFF'                                                 02965000
@NM00092 DC    X'4734'                                                  02966000
@NM00093 DC    X'4738'                                                  02967000
@NM00094 DC    X'FFFF'                                                  02968000
@NM00095 DC    X'4740'                                                  02969000
@NM00096 DC    X'4748'                                                  02970000
@NM00097 DC    X'474C'                                                  02971000
@NM00098 DC    7X'FFFF'                                                 02972000
@NM00099 DC    X'476C'                                                  02973000
@NM00100 DC    X'FFFF'                                                  02974000
@NM00101 DC    X'4780'                                                  02975000
@NM00102 DC    3X'FFFF'                                                 02976000
@NM00103 DC    X'035C'                                                  02977000
@NM00104 DC    X'0390'                                                  02978000
@NM00105 DC    X'0394'                                                  02979000
@NM00106 DC    X'FFFF'                                                  02980000
@NM00107 DC    X'0218'                                                  02981000
@NM00108 DC    X'0494'                                                  02982000
@NM00109 DC    X'022C'                                                  02983000
@NM00110 DC    X'0214'                                                  02984000
@NM00111 DC    X'0220'                                                  02985000
@NM00112 DC    X'4794'                                                  02986000
@NM00113 DC    X'4798'                                                  02987000
@NM00114 DC    X'479C'                                                  02988000
@NM00115 DC    2X'FFFF'                                                 02989000
@NM00116 DC    X'0230'                                                  02990000
@NM00117 DC    X'0488'                                                  02991000
@NM00118 DC    X'048C'                                                  02992000
@NM00119 DC    X'47A4'                                                  02993000
@NM00120 DC    X'0214'                                                  02994000
@NM00121 DC    X'0240'                                                  02995000
@NM00122 DC    X'04B8'                                                  02996000
@NM00123 DC    X'04BC'                                                  02997000
@NM00124 DC    X'0234'                                                  02998000
@NM00125 DC    2X'FFFF'                                                 02999000
@NM00126 DC    X'FFFF'                                                  03000000
@NM00127 DC    X'0470'                                                  03001000
@NM00128 DC    X'046C'                                                  03002000
@NM00129 DC    X'FFFF'                                                  03003000
@NM00130 DC    X'0490'                                                  03004000
@NM00131 DC    X'17FF'                                                  03005000
@NM00132 DC    X'022C'                                                  03006000
@NM00133 DC    X'024C'                                                  03007000
@NM00134 DC    X'0250'                                                  03008000
@NM00135 DC    X'03A0'                                                  03009000
@NM00136 DC    X'04A4'                                                  03010000
@NM00137 DC    X'0484'                                                  03011000
@NM00138 DC    X'7700'                                                  03012000
@NM00139 DC    X'04A8'                                                  03013000
@NM00140 DC    X'04AC'                                                  03014000
@NM00141 DC    X'04B0'                                                  03015000
@NM00142 DC    X'7704'                                                  03016000
@NM00143 DC    X'FFFF'                                                  03017000
@NM00144 DC    X'04B4'                                                  03018000
@NM00145 DC    X'03A4'                                                  03019000
@NM00146 DC    X'04C0'                                                  03020000
         ORG   SIRSCODE+194                                             03021000
IEFDB413 CSECT                                                          03022000
         DS   0H                                                        03023000
PATCHLOC DC ((@DATA-@PSTART)/20)X'00'                                   03024000
@DATD    DSECT                                                          03025000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                03026000
@ENDDATD EQU   *                                                        03027000
IEFDB413 CSECT                                                          03028000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       03029000
@01      EQU   01                                                       03030000
@02      EQU   02                                                       03031000
@03      EQU   03                                                       03032000
@04      EQU   04                                                       03033000
@05      EQU   05                                                       03034000
@06      EQU   06                                                       03035000
@07      EQU   07                                                       03036000
@08      EQU   08                                                       03037000
@09      EQU   09                                                       03038000
@10      EQU   10                                                       03039000
@11      EQU   11                                                       03040000
@12      EQU   12                                                       03041000
@13      EQU   13                                                       03042000
@14      EQU   14                                                       03043000
@15      EQU   15                                                       03044000
ERRSIOTP EQU   @02                                                      03045000
SMFLSTLN EQU   @07                                                      03046000
SAVFEPAP EQU   @05                                                      03047000
COUNTSIO EQU   @06                                                      03048000
WRKSIOTP EQU   @02                                                      03049000
SWEPAPTR EQU   @03                                                      03050000
SMFLISTP EQU   @05                                                      03051000
NEWLSIOT EQU   @10                                                      03052000
CCATSIOT EQU   @05                                                      03053000
JESERROR EQU   @02                                                      03054000
JFCBXPTR EQU   @02                                                      03055000
COPYJFX  EQU   @04                                                      03056000
I        EQU   @03                                                      03057000
R0       EQU   @00                                                      03058000
R1       EQU   @01                                                      03059000
R15      EQU   @15                                                      03060000
EPACOREP EQU   @01                                                      03061000
EPACOREL EQU   @00                                                      03062000
         EXTRN IEFAB445                                                 03063000
CVTPTR   EQU   16                                                       03064000
FUNCMAP  EQU   0                                                        03065000
VOLMNTSW EQU   FUNCMAP                                                  03066000
ALCMOUNT EQU   VOLMNTSW                                                 03067000
WRTMSGSW EQU   FUNCMAP                                                  03068000
ALCMSGLV EQU   WRTMSGSW                                                 03069000
UWAITSW  EQU   FUNCMAP                                                  03070000
ALCWTUNT EQU   UWAITSW                                                  03071000
VWAITSW  EQU   FUNCMAP                                                  03072000
ALCWTVOL EQU   VWAITSW                                                  03073000
MSSTRMSW EQU   FUNCMAP                                                  03074000
ALCMSSTM EQU   MSSTRMSW                                                 03075000
OFFDEVSW EQU   FUNCMAP                                                  03076000
ALCOFFDV EQU   OFFDEVSW                                                 03077000
CCLMNTSW EQU   FUNCMAP                                                  03078000
ALCCANCL EQU   CCLMNTSW                                                 03079000
GENLOKSW EQU   FUNCMAP                                                  03080000
SSEMSGSW EQU   FUNCMAP+1                                                03081000
HDRMSGSW EQU   FUNCMAP+1                                                03082000
MTRJOBSW EQU   FUNCMAP+1                                                03083000
ALCJOBNM EQU   MTRJOBSW                                                 03084000
NOTIOTNQ EQU   FUNCMAP+1                                                03085000
ALCNOENQ EQU   NOTIOTNQ                                                 03086000
TRKMSW   EQU   FUNCMAP+1                                                03087000
ALCATRKM EQU   TRKMSW                                                   03088000
WAITOKSW EQU   FUNCMAP+1                                                03089000
ASNMSW   EQU   FUNCMAP+1                                                03090000
ALCASDSN EQU   ASNMSW                                                   03091000
TIOMGRRB EQU   0                                                        03092000
TIOMFMAP EQU   TIOMGRRB                                                 03093000
TIOMCCAT EQU   TIOMFMAP                                                 03094000
TIOMTSZE EQU   TIOMGRRB+2                                               03095000
TIOMJSCP EQU   TIOMGRRB+4                                               03096000
TIOMDSAP EQU   TIOMGRRB+20                                              03097000
TMGRLIST EQU   0                                                        03098000
SMFLIST  EQU   0                                                        03099000
SMFLSTEL EQU   SMFLIST                                                  03100000
SMFTIOTP EQU   SMFLSTEL                                                 03101000
SMFFLAGS EQU   SMFLSTEL+4                                               03102000
SMFLAST  EQU   SMFFLAGS                                                 03103000
SMFVAM   EQU   SMFFLAGS                                                 03104000
CMUNFMAP EQU   0                                                        03105000
CMFMBYT1 EQU   CMUNFMAP                                                 03106000
CMDISPRC EQU   CMFMBYT1                                                 03107000
CMFMBYT2 EQU   CMUNFMAP+1                                               03108000
CMTIOTNQ EQU   CMFMBYT2                                                 03109000
CMFMBYT3 EQU   CMUNFMAP+2                                               03110000
CMFMBYT4 EQU   CMUNFMAP+3                                               03111000
CMUNRB   EQU   0                                                        03112000
CMSIOPTR EQU   CMUNRB+4                                                 03113000
CMINDIC  EQU   CMUNRB+8                                                 03114000
CMRBBYT1 EQU   CMINDIC                                                  03115000
CMNMDISP EQU   CMRBBYT1                                                 03116000
CMRBBYT2 EQU   CMINDIC+1                                                03117000
CMRBBYT3 EQU   CMINDIC+2                                                03118000
CMRBBYT4 EQU   CMINDIC+3                                                03119000
CMCATERR EQU   CMRBBYT4                                                 03120000
CMINTERR EQU   CMRBBYT4                                                 03121000
CMODISP  EQU   CMUNRB+12                                                03122000
CMRETCDE EQU   CMUNRB+14                                                03123000
CMOPTFLD EQU   CMUNRB+16                                                03124000
TXTUPLST EQU   0                                                        03125000
TXTUNITP EQU   TXTUPLST                                                 03126000
TXTUPELM EQU   0                                                        03127000
TXTPLENT EQU   TXTUPELM                                                 03128000
TEXTUNIT EQU   0                                                        03129000
TEXTUENT EQU   TEXTUNIT+4                                               03130000
TEXTULNG EQU   TEXTUENT                                                 03131000
TEXTUPAR EQU   TEXTUENT+2                                               03132000
TEXTUFLD EQU   0                                                        03133000
KEYTABLE EQU   0                                                        03134000
DSNAMTUP EQU   KEYTABLE+4                                               03135000
PRIMETUP EQU   KEYTABLE+36                                              03136000
SECNDTUP EQU   KEYTABLE+40                                              03137000
RLSETUP  EQU   KEYTABLE+48                                              03138000
SPFRMTUP EQU   KEYTABLE+52                                              03139000
ROUNDTUP EQU   KEYTABLE+56                                              03140000
UNITTUP  EQU   KEYTABLE+80                                              03141000
PASSWTUP EQU   KEYTABLE+316                                             03142000
PERMATUP EQU   KEYTABLE+324                                             03143000
CNVRTTUP EQU   KEYTABLE+328                                             03144000
RTORGTUP EQU   KEYTABLE+344                                             03145000
SWAEPA   EQU   0                                                        03146000
SWBLKPTR EQU   SWAEPA                                                   03147000
SWVAFW   EQU   SWAEPA+4                                                 03148000
SWVA     EQU   SWVAFW                                                   03149000
SWBLKID  EQU   SWVAFW+3                                                 03150000
SWLNGTH  EQU   SWAEPA+8                                                 03151000
SWCHNPTR EQU   SWAEPA+12                                                03152000
CVTMAP   EQU   0                                                        03153000
CVTILK2  EQU   CVTMAP+40                                                03154000
CVTDAR   EQU   CVTMAP+72                                                03155000
CVTFLGS1 EQU   CVTDAR                                                   03156000
CVTDCB   EQU   CVTMAP+116                                               03157000
CVTIOQET EQU   CVTMAP+120                                               03158000
CVTIERLC EQU   CVTMAP+144                                               03159000
CVTMSER  EQU   CVTMAP+148                                               03160000
CVTHEAD  EQU   CVTMAP+160                                               03161000
CVTSV76C EQU   CVTHEAD                                                  03162000
CVTOPTA  EQU   CVTMAP+182                                               03163000
CVTOPTB  EQU   CVTMAP+183                                               03164000
CVTGTF   EQU   CVTMAP+236                                               03165000
CVTGTFST EQU   CVTGTF                                                   03166000
CVTGTFS  EQU   CVTGTFST                                                 03167000
CVTSTATE EQU   CVTGTFST                                                 03168000
CVTTMODE EQU   CVTGTFST                                                 03169000
CVTFORM  EQU   CVTGTFST                                                 03170000
CVTAQAVT EQU   CVTMAP+240                                               03171000
CVTTCMFG EQU   CVTAQAVT                                                 03172000
CVTVOLM2 EQU   CVTMAP+244                                               03173000
CVTTATA  EQU   CVTVOLM2                                                 03174000
CVTTSKS  EQU   CVTTATA                                                  03175000
CVTVOLF2 EQU   CVTTSKS                                                  03176000
CVTTAT   EQU   CVTTATA+1                                                03177000
CVTATER  EQU   CVTMAP+248                                               03178000
CVTEXT1  EQU   CVTMAP+252                                               03179000
CVTPURG  EQU   CVTMAP+260                                               03180000
CVTQMSG  EQU   CVTMAP+268                                               03181000
CVTDMSR  EQU   CVTMAP+272                                               03182000
CVTRSV37 EQU   CVTDMSR                                                  03183000
CVTDMSRF EQU   CVTRSV37                                                 03184000
CVTJESCT EQU   CVTMAP+296                                               03185000
CVTERPV  EQU   CVTMAP+316                                               03186000
CVTINTLA EQU   CVTMAP+320                                               03187000
CVTAPF   EQU   CVTMAP+324                                               03188000
CVTEXT2  EQU   CVTMAP+328                                               03189000
CVTHJES  EQU   CVTMAP+332                                               03190000
CVTPGSIA EQU   CVTMAP+348                                               03191000
CVTA1F1  EQU   CVTMAP+356                                               03192000
CVTSYSK  EQU   CVTMAP+357                                               03193000
CVTVOLM1 EQU   CVTMAP+380                                               03194000
CVTVOLF1 EQU   CVTVOLM1                                                 03195000
CVTATMCT EQU   CVTMAP+388                                               03196000
CVTXTNT1 EQU   0                                                        03197000
CVTXTNT2 EQU   0                                                        03198000
CVTDSSV  EQU   CVTXTNT2                                                 03199000
CVTFLGBT EQU   CVTXTNT2+5                                               03200000
CVTQID   EQU   CVTXTNT2+24                                              03201000
CVTRV400 EQU   CVTXTNT2+52                                              03202000
CVTRV409 EQU   CVTXTNT2+53                                              03203000
CVTATCVT EQU   CVTXTNT2+64                                              03204000
CVTRV429 EQU   CVTXTNT2+84                                              03205000
CVTRV438 EQU   CVTXTNT2+85                                              03206000
CVTRV457 EQU   CVTXTNT2+112                                             03207000
CVTRV466 EQU   CVTXTNT2+113                                             03208000
CVTFIX   EQU   0                                                        03209000
CVTRELNO EQU   CVTFIX+252                                               03210000
BASE     EQU   0                                                        03211000
@NM00157 EQU   BASE+13                                                  03212000
BALGSTAT EQU   BASE+24                                                  03213000
BALOG    EQU   BALGSTAT+4                                               03214000
BASFL    EQU   BASE+36                                                  03215000
BARSW    EQU   BASFL                                                    03216000
MSLOGST  EQU   BASE+46                                                  03217000
BASPBYTE EQU   BASE+47                                                  03218000
BAMONITR EQU   BASE+56                                                  03219000
BAJNCNT  EQU   BASE+84                                                  03220000
@NM00179 EQU   BASE+104                                                 03221000
MSLGCLOZ EQU   BASE+108                                                 03222000
MSCLOSSW EQU   MSLGCLOZ                                                 03223000
MSLGWLOG EQU   BASE+112                                                 03224000
MSWLOGSW EQU   MSLGWLOG                                                 03225000
MSLGWTR  EQU   BASE+116                                                 03226000
MSWTRSW  EQU   MSLGWTR                                                  03227000
MSLGSTRT EQU   BASE+120                                                 03228000
MSSTRTSW EQU   MSLGSTRT                                                 03229000
MS1BASEX EQU   BASE+136                                                 03230000
BASES01  EQU   0                                                        03231000
MSNTAL   EQU   BASES01                                                  03232000
MSSSB    EQU   BASES01+1                                                03233000
MSBTN    EQU   MSSSB                                                    03234000
MSPFG    EQU   BASES01+2                                                03235000
MSECBFL  EQU   BASES01+3                                                03236000
MSTUS    EQU   BASES01+4                                                03237000
MSSSA    EQU   MSTUS                                                    03238000
MSINLSW  EQU   MSSSA                                                    03239000
MSREOF   EQU   MSSSA                                                    03240000
MSNWP    EQU   MSSSA                                                    03241000
MSFHF    EQU   BASES01+5                                                03242000
INJMJCT  EQU   0                                                        03243000
JCTJSTAT EQU   INJMJCT+5                                                03244000
INDMCTLG EQU   JCTJSTAT                                                 03245000
JCTJBYTE EQU   INJMJCT+7                                                03246000
JCTJMGLV EQU   JCTJBYTE                                                 03247000
INCMALL  EQU   JCTJMGLV                                                 03248000
JCTCCODE EQU   INJMJCT+54                                               03249000
JCTRSW1  EQU   INJMJCT+86                                               03250000
JCTRSW2  EQU   INJMJCT+87                                               03251000
JCTJSB   EQU   INJMJCT+111                                              03252000
JCTSTAT2 EQU   INJMJCT+116                                              03253000
IEFAACTB EQU   0                                                        03254000
INSMSCT  EQU   0                                                        03255000
SCTDISKA EQU   INSMSCT                                                  03256000
SCTTBLID EQU   INSMSCT+3                                                03257000
SCTSSTAT EQU   INSMSCT+4                                                03258000
SCTFSIOT EQU   INSMSCT+12                                               03259000
SCTLSIOT EQU   INSMSCT+24                                               03260000
SCTSNUMB EQU   INSMSCT+64                                               03261000
SCTSTYPE EQU   INSMSCT+67                                               03262000
SCTSDPTY EQU   INSMSCT+94                                               03263000
SCTSTAT2 EQU   INSMSCT+104                                              03264000
SCTBCT   EQU   SCTSTAT2                                                 03265000
SCTCDENT EQU   INSMSCT+118                                              03266000
SCTSTEND EQU   INSMSCT+172                                              03267000
@NM00235 EQU   0                                                        03268000
SCTABCND EQU   @NM00235                                                 03269000
INDMSIOT EQU   0                                                        03270000
SIOTDSKA EQU   INDMSIOT                                                 03271000
SIOTTYPE EQU   INDMSIOT+3                                               03272000
SCTUSADD EQU   INDMSIOT+20                                              03273000
SCTPSIOT EQU   INDMSIOT+28                                              03274000
SIOTBYT1 EQU   INDMSIOT+43                                              03275000
SIOVAMDS EQU   SIOTBYT1                                                 03276000
SIOTBYT3 EQU   INDMSIOT+46                                              03277000
SIOALIAS EQU   SIOTBYT3                                                 03278000
SIOCDEVT EQU   SIOTBYT3                                                 03279000
SIOTTSTC EQU   INDMSIOT+47                                              03280000
SIOTINFC EQU   SIOTTSTC                                                 03281000
SIOTSSGP EQU   SIOTTSTC                                                 03282000
SCTVOLCT EQU   INDMSIOT+49                                              03283000
SIOTBYT0 EQU   INDMSIOT+52                                              03284000
SIOTSSDS EQU   SIOTBYT0                                                 03285000
SIOTDYAL EQU   SIOTBYT0                                                 03286000
SCTNMBUT EQU   INDMSIOT+53                                              03287000
SIOTVLCT EQU   INDMSIOT+54                                              03288000
SCTSDISP EQU   INDMSIOT+55                                              03289000
SIOTPRIV EQU   SCTSDISP                                                 03290000
SIOTCTLG EQU   SCTSDISP                                                 03291000
SCTSBYT1 EQU   INDMSIOT+56                                              03292000
SCTDUMMY EQU   SCTSBYT1                                                 03293000
SIOTGDSN EQU   SCTSBYT1                                                 03294000
SCTPARLM EQU   SCTSBYT1                                                 03295000
SCTSBYT2 EQU   INDMSIOT+57                                              03296000
SCTSBYT3 EQU   INDMSIOT+58                                              03297000
SCTSYSOU EQU   SCTSBYT3                                                 03298000
SCTSNEW  EQU   SCTSBYT3                                                 03299000
SCTSBYT4 EQU   INDMSIOT+59                                              03300000
SCTUTYPE EQU   INDMSIOT+60                                              03301000
SIOTDEVT EQU   SCTUTYPE                                                 03302000
SIOUBYT2 EQU   SIOTDEVT+1                                               03303000
SIOUBYT3 EQU   SIOTDEVT+2                                               03304000
SIO3TAPE EQU   SIOUBYT3                                                 03305000
SIO3DACC EQU   SIOUBYT3                                                 03306000
SIO3DISP EQU   SIOUBYT3                                                 03307000
SIO3UREC EQU   SIOUBYT3                                                 03308000
SIOUBYT4 EQU   SIOTDEVT+3                                               03309000
SIOTBYT4 EQU   INDMSIOT+81                                              03310000
SIOTALTD EQU   INDMSIOT+92                                              03311000
SIOTBYT2 EQU   INDMSIOT+103                                             03312000
SIOTDMND EQU   SIOTBYT2                                                 03313000
SIOTCALC EQU   SIOTBYT2                                                 03314000
SIOTSSIC EQU   INDMSIOT+120                                             03315000
SIOTRSNC EQU   INDMSIOT+130                                             03316000
SIOTETIO EQU   INDMSIOT+148                                             03317000
SIOTNPTR EQU   INDMSIOT+152                                             03318000
SJFCBPTR EQU   INDMSIOT+156                                             03319000
SIOTJFX  EQU   INDMSIOT+160                                             03320000
INFMJFCB EQU   0                                                        03321000
JFCBDSNM EQU   INFMJFCB                                                 03322000
JFCBELNM EQU   INFMJFCB+44                                              03323000
JFCBTSDM EQU   INFMJFCB+52                                              03324000
JFCCAT   EQU   JFCBTSDM                                                 03325000
JFCBDSCB EQU   INFMJFCB+53                                              03326000
JFCFCBID EQU   INFMJFCB+56                                              03327000
JFCBFRID EQU   JFCFCBID                                                 03328000
JFCBLTYP EQU   INFMJFCB+66                                              03329000
JFCBOTTR EQU   INFMJFCB+67                                              03330000
JFCBUFOF EQU   JFCBOTTR                                                 03331000
JFCBFLSQ EQU   JFCBOTTR+1                                               03332000
JFCFUNC  EQU   JFCBFLSQ                                                 03333000
JFCBVLSQ EQU   INFMJFCB+70                                              03334000
JFCBMASK EQU   INFMJFCB+72                                              03335000
JFCBFLG1 EQU   JFCBMASK+5                                               03336000
JFCOPEN  EQU   JFCBFLG1                                                 03337000
JFCBFLG2 EQU   JFCBMASK+6                                               03338000
JFCDEFER EQU   JFCBFLG2                                                 03339000
JFCBIND1 EQU   INFMJFCB+86                                              03340000
JFCRLSE  EQU   JFCBIND1                                                 03341000
JFCBIND2 EQU   INFMJFCB+87                                              03342000
JFCSHARE EQU   JFCBIND2                                                 03343000
JFCAMPTR EQU   INFMJFCB+88                                              03344000
JFCBUFRQ EQU   JFCAMPTR                                                 03345000
JFCBUFNO EQU   JFCBUFRQ                                                 03346000
JFCBGNCP EQU   JFCAMPTR+1                                               03347000
JFCBHIAR EQU   JFCBGNCP                                                 03348000
JFCBFALN EQU   JFCBHIAR                                                 03349000
JFCBFTEK EQU   JFCBFALN                                                 03350000
JFCBBFTA EQU   JFCBFTEK                                                 03351000
JFCEROPT EQU   INFMJFCB+92                                              03352000
JFCTRTCH EQU   INFMJFCB+93                                              03353000
JFCBX    EQU   0                                                        03354000
JFCBXTTR EQU   JFCBX                                                    03355000
JFCBXVOL EQU   JFCBX+4                                                  03356000
JFCBXNAM EQU   JFCBX+96                                                 03357000
JFCBXDEV EQU   JFCBX+140                                                03358000
JFCBXNXT EQU   JFCBX+172                                                03359000
IEZJSCB  EQU   0                                                        03360000
JSCBSEC1 EQU   IEZJSCB+188                                              03361000
JSCHPCE  EQU   JSCBSEC1+4                                               03362000
JSCBTCBP EQU   JSCBSEC1+20                                              03363000
JSCBDCB  EQU   JSCBSEC1+36                                              03364000
JSCBOPTS EQU   JSCBSEC1+48                                              03365000
JSCBSWT1 EQU   JSCBSEC1+55                                              03366000
JSCBWTP  EQU   JSCBSEC1+64                                              03367000
JSCBWTFG EQU   JSCBWTP                                                  03368000
JSCBEND1 EQU   IEZJSCB+260                                              03369000
ASCB     EQU   0                                                        03370000
ASCBTSB  EQU   ASCB+60                                                  03371000
ASCBFW1  EQU   ASCB+100                                                 03372000
ASCBRCTF EQU   ASCBFW1+2                                                03373000
ASCBFLG1 EQU   ASCBFW1+3                                                03374000
ASCBDSP1 EQU   ASCB+114                                                 03375000
ASCBFLG2 EQU   ASCB+115                                                 03376000
DSAB     EQU   0                                                        03377000
DSABTIOT EQU   DSAB+16                                                  03378000
DSABGIDP EQU   DSAB+24                                                  03379000
DSABANMP EQU   DSAB+28                                                  03380000
DSABORG  EQU   DSAB+32                                                  03381000
DSABORG1 EQU   DSABORG                                                  03382000
DSABORG2 EQU   DSABORG+1                                                03383000
DSABFLG1 EQU   DSAB+34                                                  03384000
DSABDALC EQU   DSABFLG1                                                 03385000
DSABPALC EQU   DSABFLG1                                                 03386000
DSABCONV EQU   DSABFLG1                                                 03387000
DSABPCAT EQU   DSABFLG1                                                 03388000
DSABNUSE EQU   DSABFLG1                                                 03389000
DSABFLG2 EQU   DSAB+35                                                  03390000
DSABFLG3 EQU   DSAB+36                                                  03391000
DSABVAM  EQU   DSABFLG3                                                 03392000
DSABFLG4 EQU   DSAB+37                                                  03393000
DSABTCBP EQU   DSAB+40                                                  03394000
DSABPTTR EQU   DSAB+44                                                  03395000
DSABSIOT EQU   DSAB+64                                                  03396000
DSABANMI EQU   0                                                        03397000
DSABGIDL EQU   0                                                        03398000
PSCB     EQU   0                                                        03399000
PSCBATR1 EQU   PSCB+16                                                  03400000
PSCBVMNT EQU   PSCBATR1                                                 03401000
TCBFIX   EQU   0                                                        03402000
TCBFRS   EQU   TCBFIX                                                   03403000
TCB      EQU   0                                                        03404000
TCBPIE   EQU   TCB+4                                                    03405000
TCBPMASK EQU   TCBPIE                                                   03406000
TCBTIO   EQU   TCB+12                                                   03407000
TCBCMP   EQU   TCB+16                                                   03408000
TCBCMPF  EQU   TCBCMP                                                   03409000
TCBCPP   EQU   TCBCMPF                                                  03410000
TCBSTCC  EQU   TCBCMPF                                                  03411000
TCBCDBL  EQU   TCBCMPF                                                  03412000
TCBCWTO  EQU   TCBCMPF                                                  03413000
TCBCIND  EQU   TCBCMPF                                                  03414000
TCBCMSG  EQU   TCBCMPF                                                  03415000
TCBTRN   EQU   TCB+20                                                   03416000
TCBABF   EQU   TCBTRN                                                   03417000
TCBMSS   EQU   TCB+24                                                   03418000
TCBPKF   EQU   TCB+28                                                   03419000
TCBFLGS  EQU   TCB+29                                                   03420000
TCBFLGS1 EQU   TCBFLGS                                                  03421000
TCBFLGS2 EQU   TCBFLGS+1                                                03422000
TCBFLGS3 EQU   TCBFLGS+2                                                03423000
TCBFLGS4 EQU   TCBFLGS+3                                                03424000
TCBFLGS5 EQU   TCBFLGS+4                                                03425000
TCBABWF  EQU   TCBFLGS5                                                 03426000
TCBJPQ   EQU   TCB+44                                                   03427000
TCBPURGE EQU   TCBJPQ                                                   03428000
TCBGRS   EQU   TCB+48                                                   03429000
TCBFSA   EQU   TCB+112                                                  03430000
TCBTME   EQU   TCB+120                                                  03431000
TCBJSTCB EQU   TCB+124                                                  03432000
TCBTSFLG EQU   TCB+148                                                  03433000
TCBTSTSK EQU   TCBTSFLG                                                 03434000
TCBSTAB  EQU   TCB+160                                                  03435000
TCBNSTAE EQU   TCBSTAB                                                  03436000
TCBTCT   EQU   TCB+164                                                  03437000
TCBTCTGF EQU   TCBTCT                                                   03438000
TCBSCNDY EQU   TCB+172                                                  03439000
TCBNDSP  EQU   TCBSCNDY                                                 03440000
TCBNDSP1 EQU   TCBNDSP+1                                                03441000
TCBNDSP2 EQU   TCBNDSP+2                                                03442000
TCBNDSP3 EQU   TCBNDSP+3                                                03443000
TCBJSCB  EQU   TCB+180                                                  03444000
TCBRECDE EQU   TCBJSCB                                                  03445000
TCBEXT1  EQU   TCB+196                                                  03446000
TCBBITS  EQU   TCB+200                                                  03447000
TCBNDSP4 EQU   TCBBITS                                                  03448000
TCBNDSP5 EQU   TCBBITS+1                                                03449000
TCBFLGS6 EQU   TCBBITS+2                                                03450000
TCBFLGS7 EQU   TCBBITS+3                                                03451000
TCBDAR   EQU   TCB+204                                                  03452000
TCBDARC  EQU   TCBDAR                                                   03453000
TCBEXT2  EQU   TCB+208                                                  03454000
TCBFOE   EQU   TCB+244                                                  03455000
TCBESTAE EQU   TCB+264                                                  03456000
TCBESTRM EQU   TCBESTAE+1                                               03457000
TCBFBYT1 EQU   TCB+276                                                  03458000
TCBFBYT2 EQU   TCB+277                                                  03459000
TCBRV124 EQU   TCB+278                                                  03460000
TCBRV133 EQU   TCB+279                                                  03461000
TCBXTNT2 EQU   0                                                        03462000
TCBGTF   EQU   TCBXTNT2                                                 03463000
TCBTFLG  EQU   TCBGTF                                                   03464000
TCBRV146 EQU   TCBXTNT2+28                                              03465000
TCBRV155 EQU   TCBXTNT2+29                                              03466000
TCBRV164 EQU   TCBXTNT2+30                                              03467000
TCBRV173 EQU   TCBXTNT2+31                                              03468000
JESCT    EQU   0                                                        03469000
JESWAA   EQU   JESCT+8                                                  03470000
JESSSREQ EQU   JESCT+20                                                 03471000
JESALLOC EQU   JESCT+32                                                 03472000
JESUNALC EQU   JESCT+36                                                 03473000
JESCATL  EQU   JESCT+40                                                 03474000
SSREQ    EQU   0                                                        03475000
IEFAB4F5 EQU   0                                                        03476000
IEFBB410 EQU   0                                                        03477000
IEFW21SD EQU   0                                                        03478000
INDMDSNT EQU   0                                                        03479000
SWAMGR   EQU   0                                                        03480000
DEFSPACE EQU   IEFAB445                                                 03481000
DEFPQTY  EQU   DEFSPACE                                                 03482000
DEFSQTY  EQU   DEFSPACE+3                                               03483000
DEFDRLH  EQU   DEFSPACE+6                                               03484000
DEFDQTY  EQU   DEFSPACE+9                                               03485000
@NM00154 EQU   DEFSPACE+12                                              03486000
DEFTRK   EQU   @NM00154                                                 03487000
DEFCYL   EQU   @NM00154                                                 03488000
DEFBLKLN EQU   @NM00154                                                 03489000
DEFRLSE  EQU   @NM00154                                                 03490000
DEFCONTG EQU   @NM00154                                                 03491000
DEFMIXG  EQU   @NM00154                                                 03492000
DEFALX   EQU   @NM00154                                                 03493000
DEFROUND EQU   @NM00154                                                 03494000
KEYTABP  EQU   0                                                        03495000
SYSCTBLK EQU   0                                                        03496000
JSCBPTR  EQU   SYSCTBLK                                                 03497000
ASCBPTR  EQU   SYSCTBLK+4                                               03498000
TCBPTR   EQU   SYSCTBLK+8                                               03499000
JCTPTR   EQU   SYSCTBLK+12                                              03500000
SCTPTR   EQU   SYSCTBLK+16                                              03501000
LASTEPAP EQU   0                                                        03502000
DSABLIST EQU   0                                                        03503000
COPYDSAB EQU   DSABLIST                                                 03504000
ALOCDSAB EQU   DSABLIST+4                                               03505000
REASONCD EQU   0                                                        03506000
ERRCODE  EQU   REASONCD                                                 03507000
INFOCODE EQU   REASONCD+2                                               03508000
ALFNCMAP EQU   0                                                        03509000
INPUTSW  EQU   ALFNCMAP                                                 03510000
NOMONTSW EQU   INPUTSW                                                  03511000
JOBRLSYS EQU   INPUTSW                                                  03512000
WTVOLSW  EQU   INPUTSW+2                                                03513000
WTDSNSW  EQU   INPUTSW+2                                                03514000
NORESSW  EQU   INPUTSW+2                                                03515000
WTUNTSW  EQU   INPUTSW+2                                                03516000
OFFLINSW EQU   INPUTSW+2                                                03517000
MOUNTSW  EQU   INPUTSW+2                                                03518000
PCATINIT EQU   INPUTSW+3                                                03519000
PROCESSW EQU   ALFNCMAP+6                                               03520000
DYNMSSTM EQU   PROCESSW                                                 03521000
COPYSW   EQU   PROCESSW                                                 03522000
ERRPROSW EQU   PROCESSW                                                 03523000
DEQDSNSW EQU   ERRPROSW                                                 03524000
UNALOCSW EQU   ERRPROSW                                                 03525000
NQEXCLSW EQU   PROCESSW                                                 03526000
EPAJCTSW EQU   PROCESSW                                                 03527000
EPASCTSW EQU   PROCESSW+1                                               03528000
EPALSISW EQU   PROCESSW+1                                               03529000
DISMSGSW EQU   PROCESSW+1                                               03530000
HSKPDQSW EQU   PROCESSW+1                                               03531000
DYNMSSOK EQU   PROCESSW+1                                               03532000
DEPARMS  EQU   0                                                        03533000
DESIOT   EQU   DEPARMS+208                                              03534000
DENQRETN EQU   DEPARMS+232                                              03535000
DEDMYEPA EQU   DEPARMS+240                                              03536000
DEDMYAS  EQU   DEPARMS+260                                              03537000
DEASGNP  EQU   DEDMYAS+12                                               03538000
DEALASTP EQU   DEPARMS+276                                              03539000
SMFPARMS EQU   0                                                        03540000
FSIOTPTR EQU   DESIOT                                                   03541000
FSJXEPAP EQU   DEASGNP                                                  03542000
LSJXEPAP EQU   DEALASTP                                                 03543000
NQRETPS  EQU   DENQRETN                                                 03544000
JXVOLSER EQU   JFCBXVOL                                                 03545000
JESFLARY EQU   JESFAIL                                                  03546000
TIOMNDSA EQU   TIOMTSZE                                                 03547000
RSNCDARY EQU   UNALCARY                                                 03548000
NSRSNCOD EQU   NSRSCODE                                                 03549000
SIRSNCOD EQU   SIRSCODE                                                 03550000
CVTS01   EQU   CVTPGSIA                                                 03551000
CVTLPDIA EQU   CVTS01+12                                                03552000
CVTDIRST EQU   CVTLPDIA                                                 03553000
CVTSLIDA EQU   CVTS01+24                                                03554000
CVTCTLFG EQU   CVTS01+50                                                03555000
CVTRV210 EQU   CVTS01+424                                               03556000
CVTRV219 EQU   CVTS01+425                                               03557000
CVTRV228 EQU   CVTS01+426                                               03558000
CVTRV237 EQU   CVTS01+427                                               03559000
CVTMFRTR EQU   CVTS01+452                                               03560000
CVTRV262 EQU   CVTS01+468                                               03561000
CVTRV271 EQU   CVTS01+469                                               03562000
CVTRV280 EQU   CVTS01+470                                               03563000
CVTRV289 EQU   CVTS01+471                                               03564000
CVTGSDA  EQU   CVTS01+600                                               03565000
JFCKEYLE EQU   JFCTRTCH                                                 03566000
JFCCODE  EQU   JFCKEYLE                                                 03567000
JFCSTACK EQU   JFCTRTCH                                                 03568000
JFCMODE  EQU   JFCSTACK                                                 03569000
JFCSPPRT EQU   JFCTRTCH                                                 03570000
JFCBABFS EQU   JFCSPPRT+2                                               03571000
JFCLIMCT EQU   JFCBABFS                                                 03572000
JFCDSORG EQU   JFCSPPRT+5                                               03573000
JFCDSRG1 EQU   JFCDSORG                                                 03574000
JFCDSRG2 EQU   JFCDSORG+1                                               03575000
JFCRECFM EQU   JFCSPPRT+7                                               03576000
JFCRCFM  EQU   JFCRECFM                                                 03577000
JFCOPTCD EQU   JFCSPPRT+8                                               03578000
JFCWVCSP EQU   JFCOPTCD                                                 03579000
JFCWVCIS EQU   JFCWVCSP                                                 03580000
JFCWVCBD EQU   JFCWVCIS                                                 03581000
JFCALLOW EQU   JFCOPTCD                                                 03582000
JFCRSV17 EQU   JFCALLOW                                                 03583000
JFCOVER  EQU   JFCRSV17                                                 03584000
JFCPCIBT EQU   JFCOPTCD                                                 03585000
JFCMAST  EQU   JFCPCIBT                                                 03586000
JFCEXT   EQU   JFCMAST                                                  03587000
JFCBCKPT EQU   JFCOPTCD                                                 03588000
JFCIND   EQU   JFCBCKPT                                                 03589000
JFCRSV18 EQU   JFCOPTCD                                                 03590000
JFCCYL   EQU   JFCRSV18                                                 03591000
JFCACT   EQU   JFCCYL                                                   03592000
JFCREDUC EQU   JFCOPTCD                                                 03593000
JFCRSV19 EQU   JFCREDUC                                                 03594000
JFCRSV20 EQU   JFCRSV19                                                 03595000
JFCRSV21 EQU   JFCOPTCD                                                 03596000
JFCDEL   EQU   JFCRSV21                                                 03597000
JFCOPTJ  EQU   JFCOPTCD                                                 03598000
JFCREORG EQU   JFCOPTJ                                                  03599000
JFCBLKSI EQU   JFCSPPRT+9                                               03600000
JFCBUFSI EQU   JFCBLKSI                                                 03601000
JFCAMSYN EQU   JFCSPPRT+11                                              03602000
JFCNCP   EQU   JFCAMSYN+2                                               03603000
JFCNTM   EQU   JFCAMSYN+3                                               03604000
JFCBFSEQ EQU   JFCNTM                                                   03605000
JFCPCI   EQU   JFCBFSEQ                                                 03606000
JFCRESRV EQU   JFCAMSYN+4                                               03607000
JFCUCSEG EQU   JFCRESRV                                                 03608000
JFCUCSOP EQU   JFCUCSEG+4                                               03609000
JFCOUTLI EQU   JFCUCSEG+5                                               03610000
JFCTHRSH EQU   JFCOUTLI                                                 03611000
JFCCPRI  EQU   JFCTHRSH                                                 03612000
JFCBNVOL EQU   JFCUCSEG+9                                               03613000
JFCBVOLS EQU   JFCUCSEG+10                                              03614000
JFCBS001 EQU   JFCBVOLS                                                 03615000
JFCBEXAD EQU   JFCBS001+31                                              03616000
JFCBPQTY EQU   JFCBS001+34                                              03617000
JFCBCTRI EQU   JFCBS001+37                                              03618000
JFCBSPAC EQU   JFCBCTRI                                                 03619000
JFCONTIG EQU   JFCBCTRI                                                 03620000
JFCMIXG  EQU   JFCBCTRI                                                 03621000
JFCALX   EQU   JFCBCTRI                                                 03622000
JFCROUND EQU   JFCBCTRI                                                 03623000
JFCBSQTY EQU   JFCBS001+38                                              03624000
JFCFLGS1 EQU   JFCBS001+41                                              03625000
JFCBDQTY EQU   JFCBS001+42                                              03626000
JFCBSPNM EQU   JFCBS001+45                                              03627000
JFCBFLG3 EQU   JFCBSPNM                                                 03628000
JFCBDRLH EQU   JFCBS001+53                                              03629000
JFCBVLCT EQU   JFCBS001+56                                              03630000
JSCBSEC2 EQU   JSCBEND1                                                 03631000
JSCBSEC3 EQU   JSCBEND1                                                 03632000
JSCBJCT  EQU   JSCBSEC3                                                 03633000
JSCBJCTA EQU   JSCBJCT+1                                                03634000
JSCBPSCB EQU   JSCBSEC3+4                                               03635000
JSCBASID EQU   JSCBSEC3+8                                               03636000
JSCBFBYT EQU   JSCBSEC3+10                                              03637000
JSCBJNL  EQU   JSCBSEC3+28                                              03638000
JSCBJJSB EQU   JSCBJNL                                                  03639000
JSCBSUB  EQU   JSCBSEC3+40                                              03640000
JSCDSABQ EQU   JSCBSEC3+60                                              03641000
JSCSCT   EQU   JSCBSEC3+68                                              03642000
JSCRSV45 EQU   JSCBSEC3+112                                             03643000
JSCRSV46 EQU   JSCRSV45                                                 03644000
JSCRSV47 EQU   JSCRSV45+2                                               03645000
CMUIDPTR EQU   CMOPTFLD                                                 03646000
TIOMELEN EQU   TIOMTSZE                                                 03647000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    03648000
JSCBEND3 EQU   JSCBSEC3+120                                             03649000
JSCRSV52 EQU   JSCBSEC3+116                                             03650000
JSCRSV51 EQU   JSCRSV47+1                                               03651000
JSCRSV50 EQU   JSCRSV47                                                 03652000
JSCRSV49 EQU   JSCRSV46+1                                               03653000
JSCRSV48 EQU   JSCRSV46                                                 03654000
JSCRSV44 EQU   JSCBSEC3+108                                             03655000
JSCRSV43 EQU   JSCBSEC3+104                                             03656000
JSCRSV42 EQU   JSCBSEC3+100                                             03657000
JSCBASWA EQU   JSCBSEC3+96                                              03658000
JSCBUFPT EQU   JSCBSEC3+92                                              03659000
JSCBACT  EQU   JSCBSEC3+88                                              03660000
JSCBSWSP EQU   JSCBSEC3+87                                              03661000
JSCRSV33 EQU   JSCBSEC3+86                                              03662000
JSCDDNUM EQU   JSCBSEC3+84                                              03663000
JSCRSV53 EQU   JSCBSEC3+82                                              03664000
JSCDDNNO EQU   JSCBSEC3+80                                              03665000
JSCBVATA EQU   JSCBSEC3+76                                              03666000
JSCTMCOR EQU   JSCBSEC3+72                                              03667000
JSCSCTP  EQU   JSCSCT+1                                                 03668000
JSCRSV55 EQU   JSCSCT                                                   03669000
JSCRSV54 EQU   JSCBSEC3+64                                              03670000
JSCBSSIB EQU   JSCBSEC3+56                                              03671000
JSCBFRBA EQU   JSCBSEC3+48                                              03672000
JSCRSV28 EQU   JSCBSEC3+46                                              03673000
JSCBSONO EQU   JSCBSEC3+44                                              03674000
JSCBSUBA EQU   JSCBSUB+1                                                03675000
JSCRSV31 EQU   JSCBSUB                                                  03676000
JSCBSMLR EQU   JSCBSEC3+36                                              03677000
JSCBJNLR EQU   JSCBSEC3+32                                              03678000
JSCBJNLA EQU   JSCBJNL+1                                                03679000
JSCBJSBT EQU   JSCBJJSB                                                 03680000
JSCBJSBX EQU   JSCBJJSB                                                 03681000
JSCBJSBA EQU   JSCBJJSB                                                 03682000
JSCBJSBI EQU   JSCBJJSB                                                 03683000
@NM00261 EQU   JSCBJJSB                                                 03684000
JSCBJNLE EQU   JSCBJJSB                                                 03685000
JSCBJNLF EQU   JSCBJJSB                                                 03686000
JSCBJNLN EQU   JSCBJJSB                                                 03687000
@NM00260 EQU   JSCBSEC3+24                                              03688000
JSCBJRBA EQU   JSCBSEC3+16                                              03689000
JSCBIECB EQU   JSCBSEC3+12                                              03690000
JSCBRV08 EQU   JSCBSEC3+11                                              03691000
JSCBRV07 EQU   JSCBFBYT                                                 03692000
JSCBRV06 EQU   JSCBFBYT                                                 03693000
JSCBRV05 EQU   JSCBFBYT                                                 03694000
JSCBRV04 EQU   JSCBFBYT                                                 03695000
JSCBRV03 EQU   JSCBFBYT                                                 03696000
JSCBRV02 EQU   JSCBFBYT                                                 03697000
JSCBADSP EQU   JSCBFBYT                                                 03698000
JSCBRV01 EQU   JSCBFBYT                                                 03699000
JSCBTJID EQU   JSCBASID                                                 03700000
JSCJCTP  EQU   JSCBJCTA                                                 03701000
JSCRSV24 EQU   JSCBJCT                                                  03702000
JSCBEND2 EQU   JSCBSEC2                                                 03703000
JFCBEND  EQU   JFCBS001+58                                              03704000
JFCBSPTN EQU   JFCBS001+57                                              03705000
JFCBSBNM EQU   JFCBS001+50                                              03706000
JFCBABST EQU   JFCBS001+48                                              03707000
JFCBRV08 EQU   JFCBSPNM+1                                               03708000
JFCBRV07 EQU   JFCBFLG3                                                 03709000
JFCBRV06 EQU   JFCBFLG3                                                 03710000
JFCBRV05 EQU   JFCBFLG3                                                 03711000
JFCBRV04 EQU   JFCBFLG3                                                 03712000
JFCBRV03 EQU   JFCBFLG3                                                 03713000
JFCBRV02 EQU   JFCBFLG3                                                 03714000
JFCBEXP  EQU   JFCBFLG3                                                 03715000
JFCDQDSP EQU   JFCBFLG3                                                 03716000
JFCBUAFF EQU   JFCFLGS1                                                 03717000
JFCRSV45 EQU   JFCFLGS1                                                 03718000
JFCVRDS  EQU   JFCFLGS1                                                 03719000
JFCBCEOV EQU   JFCFLGS1                                                 03720000
JFCRSV42 EQU   JFCFLGS1                                                 03721000
JFCBADSP EQU   JFCFLGS1                                                 03722000
JFCTOPEN EQU   JFCFLGS1                                                 03723000
JFCBDLET EQU   JFCFLGS1                                                 03724000
JFCRQID  EQU   JFCBSQTY                                                 03725000
JFCRSV29 EQU   JFCBCTRI                                                 03726000
JFCBMSGP EQU   JFCBCTRI                                                 03727000
JFCRUNIT EQU   JFCBPQTY                                                 03728000
JFCBEXTL EQU   JFCBS001+30                                              03729000
JFCMSVGP EQU   JFCBS001+22                                              03730000
@NM00254 EQU   JFCBS001                                                 03731000
JFCAVOLS EQU   JFCBVOLS                                                 03732000
JFCBNTCS EQU   JFCUCSEG+8                                               03733000
JFCSOWA  EQU   JFCOUTLI+1                                               03734000
JFCSEND  EQU   JFCCPRI                                                  03735000
JFCEQUAL EQU   JFCCPRI                                                  03736000
JFCRECV  EQU   JFCCPRI                                                  03737000
JFCRSV34 EQU   JFCCPRI                                                  03738000
JFCRSV33 EQU   JFCCPRI                                                  03739000
JFCRSV55 EQU   JFCCPRI                                                  03740000
JFCRSV54 EQU   JFCCPRI                                                  03741000
JFCRSV53 EQU   JFCCPRI                                                  03742000
JFCRSV27 EQU   JFCUCSOP                                                 03743000
JFCRSV26 EQU   JFCUCSOP                                                 03744000
JFCFCBVR EQU   JFCUCSOP                                                 03745000
JFCFCBAL EQU   JFCUCSOP                                                 03746000
JFCVER   EQU   JFCUCSOP                                                 03747000
JFCRSV25 EQU   JFCUCSOP                                                 03748000
JFCFOLD  EQU   JFCUCSOP                                                 03749000
JFCBEXTP EQU   JFCUCSOP                                                 03750000
JFCUCSID EQU   JFCUCSEG                                                 03751000
JFCINTVL EQU   JFCSPPRT+19                                              03752000
JFCDBUFN EQU   JFCRESRV+3                                               03753000
JFCCYLOF EQU   JFCRESRV+2                                               03754000
JFCRKP   EQU   JFCRESRV                                                 03755000
JFCPCIR2 EQU   JFCPCI                                                   03756000
JFCPCIR1 EQU   JFCPCI                                                   03757000
JFCPCIN2 EQU   JFCPCI                                                   03758000
JFCPCIN1 EQU   JFCPCI                                                   03759000
JFCPCIA2 EQU   JFCPCI                                                   03760000
JFCPCIA1 EQU   JFCPCI                                                   03761000
JFCPCIX2 EQU   JFCPCI                                                   03762000
JFCPCIX1 EQU   JFCPCI                                                   03763000
JFCBUFMX EQU   JFCNCP                                                   03764000
JFCLRECL EQU   JFCAMSYN                                                 03765000
JFCBAXBF EQU   JFCBUFSI                                                 03766000
JFCREL   EQU   JFCREORG                                                 03767000
JFCRSV22 EQU   JFCDEL                                                   03768000
JFCSRCHD EQU   JFCRSV20                                                 03769000
JFCOPTQ  EQU   JFCACT                                                   03770000
JFCFEED  EQU   JFCIND                                                   03771000
JFCCBWU  EQU   JFCEXT                                                   03772000
JFCWUMSG EQU   JFCOVER                                                  03773000
JFCSDNAM EQU   JFCWVCBD                                                 03774000
@NM00253 EQU   JFCRECFM                                                 03775000
JFCCHAR  EQU   JFCRECFM                                                 03776000
JFCRFS   EQU   JFCRECFM                                                 03777000
JFCRFB   EQU   JFCRECFM                                                 03778000
JFCRFO   EQU   JFCRCFM                                                  03779000
JFCFMREC EQU   JFCRCFM                                                  03780000
JFCRSV16 EQU   JFCDSRG2                                                 03781000
JFCRSV15 EQU   JFCDSRG2                                                 03782000
JFCORGTR EQU   JFCDSRG2                                                 03783000
JFCORGAM EQU   JFCDSRG2                                                 03784000
JFCRSV13 EQU   JFCDSRG2                                                 03785000
JFCORGTQ EQU   JFCDSRG2                                                 03786000
JFCORGTX EQU   JFCDSRG2                                                 03787000
JFCORGGS EQU   JFCDSRG2                                                 03788000
JFCORGU  EQU   JFCDSRG1                                                 03789000
JFCORGPO EQU   JFCDSRG1                                                 03790000
JFCORGMQ EQU   JFCDSRG1                                                 03791000
JFCORGCQ EQU   JFCDSRG1                                                 03792000
JFCORGCX EQU   JFCDSRG1                                                 03793000
JFCORGDA EQU   JFCDSRG1                                                 03794000
JFCORGPS EQU   JFCDSRG1                                                 03795000
JFCORGIS EQU   JFCDSRG1                                                 03796000
JFCTRKBL EQU   JFCLIMCT+1                                               03797000
@NM00252 EQU   JFCLIMCT                                                 03798000
JFCDEN   EQU   JFCSPPRT+1                                               03799000
JFCPRTSP EQU   JFCSPPRT                                                 03800000
JFCONE   EQU   JFCMODE                                                  03801000
JFCTWO   EQU   JFCMODE                                                  03802000
JFCRSV07 EQU   JFCMODE                                                  03803000
JFCRSV06 EQU   JFCMODE                                                  03804000
JFCMODER EQU   JFCMODE                                                  03805000
JFCMODEO EQU   JFCMODE                                                  03806000
JFCEBCD  EQU   JFCMODE                                                  03807000
JFCBIN   EQU   JFCMODE                                                  03808000
JFCRSV32 EQU   JFCCODE                                                  03809000
JFCTTY   EQU   JFCCODE                                                  03810000
JFCASCII EQU   JFCCODE                                                  03811000
JFCNCR   EQU   JFCCODE                                                  03812000
JFCBUR   EQU   JFCCODE                                                  03813000
JFCFRI   EQU   JFCCODE                                                  03814000
JFCBCD   EQU   JFCCODE                                                  03815000
JFCNOCON EQU   JFCCODE                                                  03816000
CVTRV628 EQU   CVTS01+728                                               03817000
CVTRV627 EQU   CVTS01+724                                               03818000
CVTRV626 EQU   CVTS01+720                                               03819000
CVTRV625 EQU   CVTS01+716                                               03820000
CVTRV624 EQU   CVTS01+712                                               03821000
CVTRV623 EQU   CVTS01+708                                               03822000
CVTRV622 EQU   CVTS01+704                                               03823000
CVTRV621 EQU   CVTS01+700                                               03824000
CVTIHASU EQU   CVTS01+696                                               03825000
CVTRV619 EQU   CVTS01+692                                               03826000
CVTRV618 EQU   CVTS01+688                                               03827000
CVTRV617 EQU   CVTS01+684                                               03828000
CVTRV616 EQU   CVTS01+680                                               03829000
CVTRV615 EQU   CVTS01+676                                               03830000
CVTRV614 EQU   CVTS01+672                                               03831000
CVTRV613 EQU   CVTS01+668                                               03832000
CVTTCASP EQU   CVTS01+664                                               03833000
CVT0PT03 EQU   CVTS01+660                                               03834000
CVT0PT0E EQU   CVTS01+656                                               03835000
CVTRV609 EQU   CVTS01+652                                               03836000
CVTCGK   EQU   CVTS01+648                                               03837000
CVTRAC   EQU   CVTS01+644                                               03838000
CVTHSM   EQU   CVTS01+640                                               03839000
CVTRV605 EQU   CVTS01+636                                               03840000
CVTRV604 EQU   CVTS01+632                                               03841000
CVTEFF02 EQU   CVTS01+628                                               03842000
CVTCBBR  EQU   CVTS01+624                                               03843000
CVTSSCR  EQU   CVTS01+620                                               03844000
CVTEVENT EQU   CVTS01+616                                               03845000
CVTCRCA  EQU   CVTS01+612                                               03846000
CVTTPIO  EQU   CVTS01+608                                               03847000
CVTADV   EQU   CVTS01+604                                               03848000
CVTGSDAB EQU   CVTGSDA                                                  03849000
CVTQV3   EQU   CVTS01+596                                               03850000
CVTQV2   EQU   CVTS01+592                                               03851000
CVTQV1   EQU   CVTS01+588                                               03852000
CVTRPT   EQU   CVTS01+584                                               03853000
CVTSSRB  EQU   CVTS01+580                                               03854000
CVTCSDRL EQU   CVTS01+576                                               03855000
CVTEXP1  EQU   CVTS01+572                                               03856000
CVTRMPMT EQU   CVTS01+568                                               03857000
CVTRMPTT EQU   CVTS01+564                                               03858000
CVTVPSA  EQU   CVTS01+560                                               03859000
CVTVSTOP EQU   CVTS01+556                                               03860000
CVTGTFR8 EQU   CVTS01+552                                               03861000
CVTQUIT  EQU   CVTS01+548                                               03862000
CVTVACR  EQU   CVTS01+544                                               03863000
CVTWTCB  EQU   CVTS01+540                                               03864000
CVTSTPRS EQU   CVTS01+536                                               03865000
CVT0PT02 EQU   CVTS01+532                                               03866000
CVTDARCM EQU   CVTS01+528                                               03867000
CVTIRECM EQU   CVTS01+524                                               03868000
CVTJRECM EQU   CVTS01+520                                               03869000
CVTVEMS0 EQU   CVTS01+516                                               03870000
CVTSPFRR EQU   CVTS01+512                                               03871000
CVTRLSTG EQU   CVTS01+508                                               03872000
CVT0TC0A EQU   CVTS01+504                                               03873000
CVTGMBR  EQU   CVTS01+500                                               03874000
CVTLFRM  EQU   CVTS01+496                                               03875000
CVTRMBR  EQU   CVTS01+492                                               03876000
CVTVIOP  EQU   CVTS01+488                                               03877000
CVTRV307 EQU   CVTS01+486                                               03878000
CVTRV306 EQU   CVTS01+484                                               03879000
CVTRV305 EQU   CVTS01+482                                               03880000
CVTRV304 EQU   CVTS01+480                                               03881000
CVTRV303 EQU   CVTS01+478                                               03882000
CVTRV302 EQU   CVTS01+476                                               03883000
CVTTRCA  EQU   CVTS01+472                                               03884000
CVTRV297 EQU   CVTRV289                                                 03885000
CVTRV296 EQU   CVTRV289                                                 03886000
CVTRV295 EQU   CVTRV289                                                 03887000
CVTRV294 EQU   CVTRV289                                                 03888000
CVTRV293 EQU   CVTRV289                                                 03889000
CVTRV292 EQU   CVTRV289                                                 03890000
CVTRV291 EQU   CVTRV289                                                 03891000
CVTRV290 EQU   CVTRV289                                                 03892000
CVTRV288 EQU   CVTRV280                                                 03893000
CVTRV287 EQU   CVTRV280                                                 03894000
CVTRV286 EQU   CVTRV280                                                 03895000
CVTRV285 EQU   CVTRV280                                                 03896000
CVTRV284 EQU   CVTRV280                                                 03897000
CVTRV283 EQU   CVTRV280                                                 03898000
CVTRV282 EQU   CVTRV280                                                 03899000
CVTRV281 EQU   CVTRV280                                                 03900000
CVTRV279 EQU   CVTRV271                                                 03901000
CVTRV278 EQU   CVTRV271                                                 03902000
CVTRV277 EQU   CVTRV271                                                 03903000
CVTRV276 EQU   CVTRV271                                                 03904000
CVTRV275 EQU   CVTRV271                                                 03905000
CVTRV274 EQU   CVTRV271                                                 03906000
CVTRV273 EQU   CVTRV271                                                 03907000
CVTRV272 EQU   CVTRV271                                                 03908000
CVTRV270 EQU   CVTRV262                                                 03909000
CVTRV269 EQU   CVTRV262                                                 03910000
CVTRV268 EQU   CVTRV262                                                 03911000
CVTRV267 EQU   CVTRV262                                                 03912000
CVTRV266 EQU   CVTRV262                                                 03913000
CVTRV265 EQU   CVTRV262                                                 03914000
CVTRV264 EQU   CVTRV262                                                 03915000
CVTRV263 EQU   CVTRV262                                                 03916000
CVTVFP   EQU   CVTS01+464                                               03917000
CVTVSI   EQU   CVTS01+460                                               03918000
CVTVPSIB EQU   CVTS01+456                                               03919000
CVTMFACT EQU   CVTMFRTR                                                 03920000
CVTMFCTL EQU   CVTS01+448                                               03921000
CVTPVBP  EQU   CVTS01+444                                               03922000
CVTPWI   EQU   CVTS01+440                                               03923000
CVTRV254 EQU   CVTS01+438                                               03924000
CVTRV253 EQU   CVTS01+436                                               03925000
CVTRV252 EQU   CVTS01+434                                               03926000
CVTRV251 EQU   CVTS01+433                                               03927000
CVTRV250 EQU   CVTS01+432                                               03928000
CVTRV249 EQU   CVTS01+431                                               03929000
CVTRV248 EQU   CVTS01+430                                               03930000
CVTRV247 EQU   CVTS01+429                                               03931000
CVTRV246 EQU   CVTS01+428                                               03932000
CVTRV245 EQU   CVTRV237                                                 03933000
CVTRV244 EQU   CVTRV237                                                 03934000
CVTRV243 EQU   CVTRV237                                                 03935000
CVTRV242 EQU   CVTRV237                                                 03936000
CVTRV241 EQU   CVTRV237                                                 03937000
CVTRV240 EQU   CVTRV237                                                 03938000
CVTRV239 EQU   CVTRV237                                                 03939000
CVTRV238 EQU   CVTRV237                                                 03940000
CVTRV236 EQU   CVTRV228                                                 03941000
CVTRV235 EQU   CVTRV228                                                 03942000
CVTRV234 EQU   CVTRV228                                                 03943000
CVTRV233 EQU   CVTRV228                                                 03944000
CVTRV232 EQU   CVTRV228                                                 03945000
CVTRV231 EQU   CVTRV228                                                 03946000
CVTRV230 EQU   CVTRV228                                                 03947000
CVTRV229 EQU   CVTRV228                                                 03948000
CVTRV227 EQU   CVTRV219                                                 03949000
CVTRV226 EQU   CVTRV219                                                 03950000
CVTRV225 EQU   CVTRV219                                                 03951000
CVTRV224 EQU   CVTRV219                                                 03952000
CVTRV223 EQU   CVTRV219                                                 03953000
CVTRV222 EQU   CVTRV219                                                 03954000
CVTRV221 EQU   CVTRV219                                                 03955000
CVTRV220 EQU   CVTRV219                                                 03956000
CVTRV218 EQU   CVTRV210                                                 03957000
CVTRV217 EQU   CVTRV210                                                 03958000
CVTRV216 EQU   CVTRV210                                                 03959000
CVTRV215 EQU   CVTRV210                                                 03960000
CVTRV214 EQU   CVTRV210                                                 03961000
CVTRV213 EQU   CVTRV210                                                 03962000
CVTRV212 EQU   CVTRV210                                                 03963000
CVTRV211 EQU   CVTRV210                                                 03964000
CVTLCCAT EQU   CVTS01+420                                               03965000
CVTPCCAT EQU   CVTS01+416                                               03966000
CVTIPCRP EQU   CVTS01+412                                               03967000
CVTIPCRI EQU   CVTS01+408                                               03968000
CVTIPCDS EQU   CVTS01+404                                               03969000
CVTAIDVT EQU   CVTS01+400                                               03970000
CVTSSAP  EQU   CVTS01+396                                               03971000
CVTEHCIR EQU   CVTS01+392                                               03972000
CVTEHDEF EQU   CVTS01+388                                               03973000
CVTDAIR  EQU   CVTS01+384                                               03974000
CVTPERFM EQU   CVTS01+380                                               03975000
CVT044R2 EQU   CVTS01+376                                               03976000
CVTFETCH EQU   CVTS01+372                                               03977000
CVTRSTWD EQU   CVTS01+368                                               03978000
CVTSPOST EQU   CVTS01+364                                               03979000
CVTIOBP  EQU   CVTS01+360                                               03980000
CVTASMVT EQU   CVTS01+356                                               03981000
CVTRECRQ EQU   CVTS01+352                                               03982000
CVTWSAC  EQU   CVTS01+348                                               03983000
CVTRV149 EQU   CVTS01+344                                               03984000
CVTWSAL  EQU   CVTS01+340                                               03985000
CVTSPSA  EQU   CVTS01+336                                               03986000
CVTGLMN  EQU   CVTS01+332                                               03987000
CVTVEAC0 EQU   CVTS01+328                                               03988000
CVT062R1 EQU   CVTS01+324                                               03989000
CVTRPOST EQU   CVTS01+320                                               03990000
CVTDQIQE EQU   CVTS01+316                                               03991000
CVTCSD   EQU   CVTS01+312                                               03992000
CVTLKRMA EQU   CVTS01+308                                               03993000
CVTRSPIE EQU   CVTS01+304                                               03994000
CVTRENQ  EQU   CVTS01+300                                               03995000
CVTLQCB  EQU   CVTS01+296                                               03996000
CVTFQCB  EQU   CVTS01+292                                               03997000
CVTQCS01 EQU   CVTS01+288                                               03998000
CVTAPFT  EQU   CVTS01+284                                               03999000
CVTPARRL EQU   CVTS01+280                                               04000000
CVTVWAIT EQU   CVTS01+276                                               04001000
CVTGSPL  EQU   CVTS01+272                                               04002000
CVTLSMQ  EQU   CVTS01+268                                               04003000
CVTGSMQ  EQU   CVTS01+264                                               04004000
CVTEXPRO EQU   CVTS01+260                                               04005000
CVTOPCTP EQU   CVTS01+256                                               04006000
CVTSIC   EQU   CVTS01+252                                               04007000
CVTTPIOS EQU   CVTS01+248                                               04008000
CVTRTMS  EQU   CVTS01+244                                               04009000
CVTSDBF  EQU   CVTS01+240                                               04010000
CVTSCBP  EQU   CVTS01+236                                               04011000
CVTSDMP  EQU   CVTS01+232                                               04012000
CVTSV60  EQU   CVTS01+228                                               04013000
CVTRTMCT EQU   CVTS01+224                                               04014000
CVTASCBL EQU   CVTS01+220                                               04015000
CVTASCBH EQU   CVTS01+216                                               04016000
CVTGDA   EQU   CVTS01+212                                               04017000
CVTASVT  EQU   CVTS01+208                                               04018000
CVTVVMDI EQU   CVTS01+204                                               04019000
CVTAQTOP EQU   CVTS01+200                                               04020000
CVTIOSCS EQU   CVTS01+196                                               04021000
CVTSDRM  EQU   CVTS01+192                                               04022000
CVTOPTE  EQU   CVTS01+188                                               04023000
CVTSTXU  EQU   CVTS01+184                                               04024000
CVTQUIS  EQU   CVTS01+180                                               04025000
CVTPARS  EQU   CVTS01+176                                               04026000
CVTS1EE  EQU   CVTS01+172                                               04027000
CVTFRAS  EQU   CVTS01+168                                               04028000
CVTQSAS  EQU   CVTS01+164                                               04029000
CVTCRAS  EQU   CVTS01+160                                               04030000
CVTCRMN  EQU   CVTS01+156                                               04031000
CVTDELCP EQU   CVTS01+152                                               04032000
CVTFRECL EQU   CVTS01+148                                               04033000
CVTGETCL EQU   CVTS01+144                                               04034000
CVTBLDCP EQU   CVTS01+140                                               04035000
CVTAUTHL EQU   CVTS01+136                                               04036000
CVTSCAN  EQU   CVTS01+132                                               04037000
CVTRV144 EQU   CVTS01+130                                               04038000
CVTMAXMP EQU   CVTS01+128                                               04039000
CVTSTCK  EQU   CVTS01+124                                               04040000
CVTRV139 EQU   CVTS01+123                                               04041000
CVTDSSAC EQU   CVTS01+122                                               04042000
CVTRV513 EQU   CVTS01+121                                               04043000
CVTIOSPL EQU   CVTS01+120                                               04044000
CVTPTGT  EQU   CVTS01+116                                               04045000
CVTCSPIE EQU   CVTS01+112                                               04046000
CVTSMFEX EQU   CVTS01+108                                               04047000
CVTOLT0A EQU   CVTS01+104                                               04048000
CVTSRBRT EQU   CVTS01+100                                               04049000
CVTPUTL  EQU   CVTS01+96                                                04050000
CVTASCRL EQU   CVTS01+92                                                04051000
CVTASCRF EQU   CVTS01+88                                                04052000
CVTRV326 EQU   CVTS01+84                                                04053000
CVTRV325 EQU   CVTS01+80                                                04054000
CVTRV324 EQU   CVTS01+76                                                04055000
CVT0VL01 EQU   CVTS01+72                                                04056000
CVTSHRVM EQU   CVTS01+68                                                04057000
CVTRV332 EQU   CVTS01+64                                                04058000
CVTTAS   EQU   CVTS01+60                                                04059000
CVTRSCN  EQU   CVTS01+56                                                04060000
CVTTRAC2 EQU   CVTS01+54                                                04061000
CVTTRACE EQU   CVTS01+52                                                04062000
CVTAPG   EQU   CVTS01+51                                                04063000
CVTSDTRC EQU   CVTCTLFG                                                 04064000
CVTGTRCE EQU   CVTCTLFG                                                 04065000
CVTNOMP  EQU   CVTCTLFG                                                 04066000
CVTRSV79 EQU   CVTCTLFG                                                 04067000
CVTDSTAT EQU   CVTCTLFG                                                 04068000
CVTRSV78 EQU   CVTCTLFG                                                 04069000
CVTRV333 EQU   CVTCTLFG                                                 04070000
CVTRV323 EQU   CVTCTLFG                                                 04071000
CVTSPVLK EQU   CVTS01+49                                                04072000
CVTRSV77 EQU   CVTS01+48                                                04073000
CVTRV331 EQU   CVTS01+44                                                04074000
CVTRV330 EQU   CVTS01+40                                                04075000
CVTRV329 EQU   CVTS01+36                                                04076000
CVTRV328 EQU   CVTS01+32                                                04077000
CVTRV322 EQU   CVTS01+28                                                04078000
CVTSLID  EQU   CVTSLIDA+1                                               04079000
CVTSYLK  EQU   CVTSLIDA                                                 04080000
CVTRV321 EQU   CVTS01+20                                                04081000
CVTRV320 EQU   CVTS01+16                                                04082000
CVTLPDIR EQU   CVTLPDIA+1                                               04083000
CVTRSV69 EQU   CVTDIRST                                                 04084000
CVTRSV68 EQU   CVTDIRST                                                 04085000
CVTRSV67 EQU   CVTDIRST                                                 04086000
CVTRSV66 EQU   CVTDIRST                                                 04087000
CVTRSV65 EQU   CVTDIRST                                                 04088000
CVTRSV64 EQU   CVTDIRST                                                 04089000
CVTRSV63 EQU   CVTDIRST                                                 04090000
CVTDICOM EQU   CVTDIRST                                                 04091000
CVTPVTP  EQU   CVTS01+8                                                 04092000
CVTLPDSR EQU   CVTS01+4                                                 04093000
CVTGETL  EQU   CVTS01                                                   04094000
NQRECPTR EQU   NQRETPS+4                                                04095000
NQENTRYP EQU   NQRETPS                                                  04096000
SMFBUFLP EQU   SMFPARMS+4                                               04097000
SMFBUF1P EQU   SMFPARMS                                                 04098000
@NM00152 EQU   DEPARMS+304                                              04099000
DETCTIOL EQU   DEPARMS+300                                              04100000
DETCTIOP EQU   DEPARMS+296                                              04101000
DETDQLST EQU   DEPARMS+280                                              04102000
@NM00151 EQU   DEDMYAS                                                  04103000
DEWLASTP EQU   DEPARMS+256                                              04104000
DEWRITP  EQU   DEDMYEPA+12                                              04105000
@NM00150 EQU   DEDMYEPA                                                 04106000
DEDSNQRC EQU   DENQRETN+4                                               04107000
DEDSNQEN EQU   DENQRETN                                                 04108000
DECPYLEN EQU   DEPARMS+228                                              04109000
DECPYLOC EQU   DEPARMS+224                                              04110000
DEJSCB   EQU   DEPARMS+220                                              04111000
DESCT    EQU   DEPARMS+216                                              04112000
DEJCT    EQU   DEPARMS+212                                              04113000
DETCB    EQU   DEPARMS+204                                              04114000
DEALFMAP EQU   DEPARMS+200                                              04115000
DECORE   EQU   DEPARMS                                                  04116000
@NM00149 EQU   PROCESSW+1                                               04117000
USERERSW EQU   PROCESSW+1                                               04118000
FRRPERSW EQU   PROCESSW                                                 04119000
DCBSPCSW EQU   PROCESSW                                                 04120000
@NM00148 EQU   INPUTSW+3                                                04121000
UNITDEVT EQU   INPUTSW+3                                                04122000
CATLOGSW EQU   INPUTSW+2                                                04123000
TIOTNQSW EQU   INPUTSW+2                                                04124000
@NM00147 EQU   INPUTSW                                                  04125000
NOCNVTSW EQU   INPUTSW                                                  04126000
ONCNVTSW EQU   INPUTSW                                                  04127000
DEFUNIT  EQU   IEFAB445+13                                              04128000
JESSASTA EQU   JESCT+48                                                 04129000
JESNUCBS EQU   JESCT+44                                                 04130000
JESPJESN EQU   JESCT+28                                                 04131000
JESSSCT  EQU   JESCT+24                                                 04132000
JESRESQM EQU   JESCT+16                                                 04133000
JESQMGR  EQU   JESCT+12                                                 04134000
JESUNITS EQU   JESCT+4                                                  04135000
@NM00275 EQU   JESCT                                                    04136000
@NM00274 EQU   TCBXTNT2+32                                              04137000
TCBRV181 EQU   TCBRV173                                                 04138000
TCBRV180 EQU   TCBRV173                                                 04139000
TCBRV179 EQU   TCBRV173                                                 04140000
TCBRV178 EQU   TCBRV173                                                 04141000
TCBRV177 EQU   TCBRV173                                                 04142000
TCBRV176 EQU   TCBRV173                                                 04143000
TCBRV175 EQU   TCBRV173                                                 04144000
TCBRV174 EQU   TCBRV173                                                 04145000
TCBRV172 EQU   TCBRV164                                                 04146000
TCBRV171 EQU   TCBRV164                                                 04147000
TCBRV170 EQU   TCBRV164                                                 04148000
TCBRV169 EQU   TCBRV164                                                 04149000
TCBRV168 EQU   TCBRV164                                                 04150000
TCBRV167 EQU   TCBRV164                                                 04151000
TCBRV166 EQU   TCBRV164                                                 04152000
TCBRV165 EQU   TCBRV164                                                 04153000
TCBRV163 EQU   TCBRV155                                                 04154000
TCBRV162 EQU   TCBRV155                                                 04155000
TCBRV161 EQU   TCBRV155                                                 04156000
TCBRV160 EQU   TCBRV155                                                 04157000
TCBRV159 EQU   TCBRV155                                                 04158000
TCBRV158 EQU   TCBRV155                                                 04159000
TCBRV157 EQU   TCBRV155                                                 04160000
TCBRV156 EQU   TCBRV155                                                 04161000
TCBRV154 EQU   TCBRV146                                                 04162000
TCBRV153 EQU   TCBRV146                                                 04163000
TCBRV152 EQU   TCBRV146                                                 04164000
TCBRV151 EQU   TCBRV146                                                 04165000
TCBRV150 EQU   TCBRV146                                                 04166000
TCBRV149 EQU   TCBRV146                                                 04167000
TCBRV148 EQU   TCBRV146                                                 04168000
TCBRV147 EQU   TCBRV146                                                 04169000
TCBRV145 EQU   TCBXTNT2+26                                              04170000
TCBRV144 EQU   TCBXTNT2+24                                              04171000
TCBCAUF  EQU   TCBXTNT2+20                                              04172000
TCBRV142 EQU   TCBXTNT2+16                                              04173000
TCBRSV49 EQU   TCBXTNT2+12                                              04174000
TCBEVENT EQU   TCBXTNT2+8                                               04175000
TCBRCMP  EQU   TCBXTNT2+5                                               04176000
TCBRSVAB EQU   TCBXTNT2+4                                               04177000
TCBGTFA  EQU   TCBGTF+1                                                 04178000
TCBRSV47 EQU   TCBTFLG                                                  04179000
TCBRSV46 EQU   TCBTFLG                                                  04180000
TCBRSV45 EQU   TCBTFLG                                                  04181000
TCBRSV44 EQU   TCBTFLG                                                  04182000
TCBRSV43 EQU   TCBTFLG                                                  04183000
TCBDSPIT EQU   TCBTFLG                                                  04184000
TCBERRTN EQU   TCBTFLG                                                  04185000
TCBASYNC EQU   TCBTFLG                                                  04186000
@NM00273 EQU   TCB+296                                                  04187000
TCBSVCA2 EQU   TCB+292                                                  04188000
TCBSWASA EQU   TCB+288                                                  04189000
TCBDBTB  EQU   TCB+284                                                  04190000
TCBRPT   EQU   TCB+280                                                  04191000
TCBRV141 EQU   TCBRV133                                                 04192000
TCBRV140 EQU   TCBRV133                                                 04193000
TCBRV139 EQU   TCBRV133                                                 04194000
TCBRV138 EQU   TCBRV133                                                 04195000
TCBRV137 EQU   TCBRV133                                                 04196000
TCBRV136 EQU   TCBRV133                                                 04197000
TCBRV135 EQU   TCBRV133                                                 04198000
TCBRV134 EQU   TCBRV133                                                 04199000
TCBRV132 EQU   TCBRV124                                                 04200000
TCBRV131 EQU   TCBRV124                                                 04201000
TCBRV130 EQU   TCBRV124                                                 04202000
TCBRV129 EQU   TCBRV124                                                 04203000
TCBRV128 EQU   TCBRV124                                                 04204000
TCBRV127 EQU   TCBRV124                                                 04205000
TCBRV126 EQU   TCBRV124                                                 04206000
TCBRV125 EQU   TCBRV124                                                 04207000
TCBRV123 EQU   TCBFBYT2                                                 04208000
TCBRV122 EQU   TCBFBYT2                                                 04209000
TCBECBNV EQU   TCBFBYT2                                                 04210000
TCBSSSYN EQU   TCBFBYT2                                                 04211000
TCBFPRAP EQU   TCBFBYT2                                                 04212000
TCBFDW   EQU   TCBFBYT2                                                 04213000
TCBFMW   EQU   TCBFBYT2                                                 04214000
TCBCNCB  EQU   TCBFBYT2                                                 04215000
TCBLLH   EQU   TCBFBYT1                                                 04216000
TCBRV113 EQU   TCBFBYT1                                                 04217000
TCBEOT   EQU   TCBFBYT1                                                 04218000
TCBRTM2  EQU   TCBFBYT1                                                 04219000
TCBPGNLY EQU   TCBFBYT1                                                 04220000
TCBNDIOS EQU   TCBFBYT1                                                 04221000
TCBACTIV EQU   TCBFBYT1                                                 04222000
TCBEOTFM EQU   TCBFBYT1                                                 04223000
TCBAFFN  EQU   TCB+274                                                  04224000
TCBCCPVI EQU   TCB+272                                                  04225000
TCBUKYSP EQU   TCB+268                                                  04226000
TCBMODE  EQU   TCBESTAE+3                                               04227000
TCBERTYP EQU   TCBESTAE+2                                               04228000
TCBRV314 EQU   TCBESTRM                                                 04229000
TCBRV313 EQU   TCBESTRM                                                 04230000
TCBRV312 EQU   TCBESTRM                                                 04231000
TCBRV311 EQU   TCBESTRM                                                 04232000
TCBRV310 EQU   TCBESTRM                                                 04233000
TCBRV309 EQU   TCBESTRM                                                 04234000
TCBRV308 EQU   TCBESTRM                                                 04235000
TCBETERM EQU   TCBESTRM                                                 04236000
TCBSCBKY EQU   TCBESTAE                                                 04237000
TCBRTM12 EQU   TCB+260                                                  04238000
TCBTCBID EQU   TCB+256                                                  04239000
TCBRSV96 EQU   TCB+252                                                  04240000
TCBSWA   EQU   TCB+248                                                  04241000
TCBFOEA  EQU   TCBFOE+1                                                 04242000
TCBRSV42 EQU   TCBFOE                                                   04243000
TCBRV306 EQU   TCB+240                                                  04244000
TCBRSV41 EQU   TCB+239                                                  04245000
TCBTID   EQU   TCB+238                                                  04246000
TCBRSVAA EQU   TCB+237                                                  04247000
TCBABCUR EQU   TCB+236                                                  04248000
TCBTMSAV EQU   TCB+232                                                  04249000
TCBIOTIM EQU   TCB+228                                                  04250000
TCBRTWA  EQU   TCB+224                                                  04251000
TCBBACK  EQU   TCB+220                                                  04252000
TCBTIRB  EQU   TCB+216                                                  04253000
TCBAECB  EQU   TCB+212                                                  04254000
TCBEXT2A EQU   TCBEXT2+1                                                04255000
TCBRSV39 EQU   TCBEXT2                                                  04256000
TCBSTMCT EQU   TCB+207                                                  04257000
TCBSYSCT EQU   TCB+206                                                  04258000
TCBRSV37 EQU   TCB+205                                                  04259000
TCBEXSVC EQU   TCBDAR                                                   04260000
TCBDARMS EQU   TCBDAR                                                   04261000
TCBDARWT EQU   TCBDAR                                                   04262000
TCBDARO  EQU   TCBDAR                                                   04263000
TCBDARMC EQU   TCBDARC                                                  04264000
TCBDARD  EQU   TCBDAR                                                   04265000
TCBDARS  EQU   TCBDAR                                                   04266000
TCBDARP  EQU   TCBDAR                                                   04267000
TCBGTOFM EQU   TCBFLGS7                                                 04268000
TCBADMP  EQU   TCBFLGS7                                                 04269000
TCBRSTSK EQU   TCBFLGS7                                                 04270000
TCBSVCS  EQU   TCBFLGS7                                                 04271000
TCBSTACK EQU   TCBFLGS7                                                 04272000
TCBRSV34 EQU   TCBFLGS7                                                 04273000
TCBRSV33 EQU   TCBFLGS7                                                 04274000
TCBGPECB EQU   TCBFLGS7                                                 04275000
TCBNTJS  EQU   TCBFLGS6                                                 04276000
TCBAPG   EQU   TCBFLGS6                                                 04277000
TCBMIGR  EQU   TCBFLGS6                                                 04278000
TCBRV303 EQU   TCBFLGS6                                                 04279000
TCBSPVLK EQU   TCBFLGS6                                                 04280000
TCBCPU   EQU   TCBFLGS6                                                 04281000
TCBPIE17 EQU   TCBFLGS6                                                 04282000
TCBRV    EQU   TCBFLGS6                                                 04283000
TCBRSV79 EQU   TCBNDSP5                                                 04284000
TCBRSV78 EQU   TCBNDSP5                                                 04285000
TCBRSV77 EQU   TCBNDSP5                                                 04286000
TCBRSV76 EQU   TCBNDSP5                                                 04287000
TCBRSV75 EQU   TCBNDSP5                                                 04288000
TCBRSV74 EQU   TCBNDSP5                                                 04289000
TCBRSV95 EQU   TCBNDSP5                                                 04290000
TCBRSV94 EQU   TCBNDSP5                                                 04291000
TCBRSV93 EQU   TCBNDSP4                                                 04292000
TCBRSV92 EQU   TCBNDSP4                                                 04293000
TCBRSV91 EQU   TCBNDSP4                                                 04294000
TCBRSV90 EQU   TCBNDSP4                                                 04295000
TCBRSV89 EQU   TCBNDSP4                                                 04296000
TCBRSV88 EQU   TCBNDSP4                                                 04297000
TCBRSV87 EQU   TCBNDSP4                                                 04298000
TCBRSV86 EQU   TCBNDSP4                                                 04299000
TCBEXT1A EQU   TCBEXT1+1                                                04300000
TCBRSV32 EQU   TCBEXT1                                                  04301000
TCBEXCPD EQU   TCB+192                                                  04302000
TCBIOBRC EQU   TCB+188                                                  04303000
TCBDDWTC EQU   TCB+186                                                  04304000
TCBDDEXC EQU   TCB+184                                                  04305000
TCBJSCBB EQU   TCBJSCB+1                                                04306000
@NM00272 EQU   TCBRECDE                                                 04307000
TCBREC   EQU   TCBRECDE                                                 04308000
TCBMDIDS EQU   TCB+176                                                  04309000
TCBNDINT EQU   TCBNDSP3                                                 04310000
TCBRSV27 EQU   TCBNDSP3                                                 04311000
TCBRSV26 EQU   TCBNDSP3                                                 04312000
TCBRSV25 EQU   TCBNDSP3                                                 04313000
TCBRSV24 EQU   TCBNDSP3                                                 04314000
TCBSRBND EQU   TCBNDSP3                                                 04315000
TCBRV302 EQU   TCBNDSP3                                                 04316000
TCBLJSND EQU   TCBNDSP3                                                 04317000
TCBABE   EQU   TCBNDSP2                                                 04318000
TCBDSS   EQU   TCBNDSP2                                                 04319000
TCBOWAIT EQU   TCBNDSP2                                                 04320000
TCBIWAIT EQU   TCBNDSP2                                                 04321000
TCBNDTS  EQU   TCBNDSP2                                                 04322000
TCBNDSVC EQU   TCBNDSP2                                                 04323000
TCBSTPP  EQU   TCBNDSP2                                                 04324000
TCBABD   EQU   TCBNDSP2                                                 04325000
TCBRSV22 EQU   TCBNDSP1                                                 04326000
TCBPIEND EQU   TCBNDSP1                                                 04327000
TCBTPSP  EQU   TCBNDSP1                                                 04328000
TCBDDRND EQU   TCBNDSP1                                                 04329000
TCBRSPND EQU   TCBNDSP1                                                 04330000
TCBRSTND EQU   TCBNDSP1                                                 04331000
TCBDARPN EQU   TCBNDSP1                                                 04332000
TCBDARTN EQU   TCBNDSP1                                                 04333000
TCBNDSP0 EQU   TCBNDSP                                                  04334000
TCBUSER  EQU   TCB+168                                                  04335000
TCBTCTB  EQU   TCBTCT+1                                                 04336000
TCBRSV9C EQU   TCBTCTGF                                                 04337000
TCBRSV9B EQU   TCBTCTGF                                                 04338000
TCBRSV9A EQU   TCBTCTGF                                                 04339000
TCBRSV99 EQU   TCBTCTGF                                                 04340000
TCBRSV98 EQU   TCBTCTGF                                                 04341000
TCBRSV97 EQU   TCBTCTGF                                                 04342000
TCBRSV20 EQU   TCBTCTGF                                                 04343000
TCBSMFGF EQU   TCBTCTGF                                                 04344000
TCBSTABB EQU   TCBSTAB+1                                                04345000
TCBSTCUR EQU   TCBNSTAE                                                 04346000
TCBRV301 EQU   TCBNSTAE                                                 04347000
TCBSYNCH EQU   TCBNSTAE                                                 04348000
TCBHALT  EQU   TCBNSTAE                                                 04349000
TCBPPSUP EQU   TCBNSTAE                                                 04350000
TCB33E   EQU   TCBNSTAE                                                 04351000
TCBQUIES EQU   TCBNSTAE                                                 04352000
TCBSTABE EQU   TCBNSTAE                                                 04353000
TCBAQE   EQU   TCB+156                                                  04354000
TCBPQE   EQU   TCB+152                                                  04355000
TCBTSDP  EQU   TCB+151                                                  04356000
TCBTSLP  EQU   TCB+150                                                  04357000
TCBSTPCT EQU   TCB+149                                                  04358000
TCBCPUBN EQU   TCBTSFLG                                                 04359000
TCBDYDSP EQU   TCBTSFLG                                                 04360000
TCBRSV18 EQU   TCBTSFLG                                                 04361000
TCBRSV17 EQU   TCBTSFLG                                                 04362000
TCBTIOTG EQU   TCBTSFLG                                                 04363000
TCBATT   EQU   TCBTSFLG                                                 04364000
TCBSTPPR EQU   TCBTSFLG                                                 04365000
TCBRV300 EQU   TCBTSTSK                                                 04366000
TCBECB   EQU   TCB+144                                                  04367000
TCBIQE   EQU   TCB+140                                                  04368000
TCBLTC   EQU   TCB+136                                                  04369000
TCBOTC   EQU   TCB+132                                                  04370000
TCBNTC   EQU   TCB+128                                                  04371000
TCBJSTCA EQU   TCBJSTCB+1                                               04372000
TCBRSV16 EQU   TCBJSTCB                                                 04373000
TCBTQET  EQU   TCBTME                                                   04374000
TCBTCB   EQU   TCB+116                                                  04375000
TCBFSAB  EQU   TCBFSA+1                                                 04376000
TCBQEL   EQU   TCBFSA                                                   04377000
TCBGRS15 EQU   TCBGRS+60                                                04378000
TCBGRS14 EQU   TCBGRS+56                                                04379000
TCBGRS13 EQU   TCBGRS+52                                                04380000
TCBGRS12 EQU   TCBGRS+48                                                04381000
TCBGRS11 EQU   TCBGRS+44                                                04382000
TCBGRS10 EQU   TCBGRS+40                                                04383000
TCBGRS9  EQU   TCBGRS+36                                                04384000
TCBGRS8  EQU   TCBGRS+32                                                04385000
TCBGRS7  EQU   TCBGRS+28                                                04386000
TCBGRS6  EQU   TCBGRS+24                                                04387000
TCBGRS5  EQU   TCBGRS+20                                                04388000
TCBGRS4  EQU   TCBGRS+16                                                04389000
TCBGRS3  EQU   TCBGRS+12                                                04390000
TCBGRS2  EQU   TCBGRS+8                                                 04391000
TCBGRS1  EQU   TCBGRS+4                                                 04392000
TCBGRS0  EQU   TCBGRS                                                   04393000
TCBJPQB  EQU   TCBJPQ+1                                                 04394000
TCBRSV15 EQU   TCBPURGE                                                 04395000
TCBRSV14 EQU   TCBPURGE                                                 04396000
TCBRSV13 EQU   TCBPURGE                                                 04397000
TCBRSV12 EQU   TCBPURGE                                                 04398000
TCBRSV11 EQU   TCBPURGE                                                 04399000
TCBRSV10 EQU   TCBPURGE                                                 04400000
TCBRSV09 EQU   TCBPURGE                                                 04401000
TCBJPQF  EQU   TCBPURGE                                                 04402000
TCBJLB   EQU   TCB+40                                                   04403000
TCBLLS   EQU   TCB+36                                                   04404000
TCBDSP   EQU   TCB+35                                                   04405000
TCBLMP   EQU   TCB+34                                                   04406000
TCBPNDSP EQU   TCBFLGS5                                                 04407000
TCBFCD1  EQU   TCBFLGS5                                                 04408000
TCBSTP   EQU   TCBFLGS5                                                 04409000
TCBSYS   EQU   TCBFLGS5                                                 04410000
TCBANDSP EQU   TCBFLGS5                                                 04411000
TCBPAGE  EQU   TCBFLGS5                                                 04412000
TCBUXNDF EQU   TCBABWF                                                  04413000
TCBFC    EQU   TCBFLGS5                                                 04414000
TCBONDSP EQU   TCBFLGS4                                                 04415000
TCBMPCND EQU   TCBFLGS4                                                 04416000
TCBMPCVQ EQU   TCBFLGS4                                                 04417000
TCBUXNDV EQU   TCBFLGS4                                                 04418000
TCBHNDSP EQU   TCBFLGS4                                                 04419000
TCBRQENA EQU   TCBFLGS4                                                 04420000
TCBSER   EQU   TCBFLGS4                                                 04421000
TCBNDUMP EQU   TCBFLGS4                                                 04422000
TCBDWSTA EQU   TCBFLGS3                                                 04423000
TCBRSV08 EQU   TCBFLGS3                                                 04424000
TCBRSV07 EQU   TCBFLGS3                                                 04425000
TCBRSV06 EQU   TCBFLGS3                                                 04426000
TCBABGM  EQU   TCBFLGS3                                                 04427000
TCBABTRM EQU   TCBFLGS3                                                 04428000
TCBADINP EQU   TCBFLGS3                                                 04429000
TCBFSM   EQU   TCBFLGS3                                                 04430000
TCBFTS   EQU   TCBFLGS2                                                 04431000
TCBFETXR EQU   TCBFLGS2                                                 04432000
TCBFDSOP EQU   TCBFLGS2                                                 04433000
TCBFJMC  EQU   TCBFLGS2                                                 04434000
TCBFSMC  EQU   TCBFLGS2                                                 04435000
TCBFABOP EQU   TCBFLGS2                                                 04436000
TCBFSTI  EQU   TCBFLGS2                                                 04437000
TCBFOINP EQU   TCBFLGS2                                                 04438000
TCBFX    EQU   TCBFLGS1                                                 04439000
TCBFS    EQU   TCBFLGS1                                                 04440000
TCBFT    EQU   TCBFLGS1                                                 04441000
TCBPDUMP EQU   TCBFLGS1                                                 04442000
TCBNONPR EQU   TCBFLGS1                                                 04443000
TCBFERA  EQU   TCBFLGS1                                                 04444000
TCBFE    EQU   TCBFLGS1                                                 04445000
TCBFA    EQU   TCBFLGS1                                                 04446000
TCBZERO  EQU   TCBPKF                                                   04447000
TCBFLAG  EQU   TCBPKF                                                   04448000
TCBMSSB  EQU   TCBMSS+1                                                 04449000
TCBRSV03 EQU   TCBMSS                                                   04450000
TCBTRNB  EQU   TCBTRN+1                                                 04451000
TCBRSV02 EQU   TCBABF                                                   04452000
TCBOLTEP EQU   TCBABF                                                   04453000
TCBTCP   EQU   TCBABF                                                   04454000
TCBTCPP  EQU   TCBABF                                                   04455000
TCBRSV01 EQU   TCBABF                                                   04456000
TCBGRPH  EQU   TCBABF                                                   04457000
TCBNOCHK EQU   TCBABF                                                   04458000
TCBMOD91 EQU   TCBABF                                                   04459000
TCBCMPC  EQU   TCBCMP+1                                                 04460000
TCBRV318 EQU   TCBCMSG                                                  04461000
TCBRV317 EQU   TCBCIND                                                  04462000
TCBRV316 EQU   TCBCWTO                                                  04463000
TCBCASID EQU   TCBCDBL                                                  04464000
TCBNOCC  EQU   TCBSTCC                                                  04465000
TCBDMPO  EQU   TCBCPP                                                   04466000
TCBCSTEP EQU   TCBCMPF                                                  04467000
TCBCREQ  EQU   TCBCMPF                                                  04468000
TCBDEB   EQU   TCB+8                                                    04469000
TCBPIEA  EQU   TCBPIE+1                                                 04470000
TCBPM    EQU   TCBPMASK                                                 04471000
@NM00271 EQU   TCBPMASK                                                 04472000
TCBRBP   EQU   TCB                                                      04473000
TCBFRS6  EQU   TCBFRS+24                                                04474000
TCBFRS4  EQU   TCBFRS+16                                                04475000
TCBFRS2  EQU   TCBFRS+8                                                 04476000
TCBFRS0  EQU   TCBFRS                                                   04477000
PSCBU    EQU   PSCB+64                                                  04478000
PSCBRSZ  EQU   PSCB+60                                                  04479000
PSCBLINE EQU   PSCB+59                                                  04480000
PSCBCHAR EQU   PSCB+58                                                  04481000
PSCBUPTL EQU   PSCB+56                                                  04482000
PSCBUPT  EQU   PSCB+52                                                  04483000
PSCBRLGB EQU   PSCB+48                                                  04484000
PSCBDEST EQU   PSCB+40                                                  04485000
@NM00270 EQU   PSCB+36                                                  04486000
@NM00269 EQU   PSCB+32                                                  04487000
PSCBSOUT EQU   PSCB+31                                                  04488000
PSCBSUBM EQU   PSCB+30                                                  04489000
PSCBSUBC EQU   PSCB+29                                                  04490000
PSCBSUBH EQU   PSCB+28                                                  04491000
PSCBLTI2 EQU   PSCB+24                                                  04492000
PSCBLTIM EQU   PSCB+20                                                  04493000
PSCBATR2 EQU   PSCB+18                                                  04494000
@NM00268 EQU   PSCBATR1                                                 04495000
@NM00267 EQU   PSCBATR1                                                 04496000
PSCBRCVR EQU   PSCBATR1                                                 04497000
PSCBATTN EQU   PSCBATR1                                                 04498000
PSCBJCL  EQU   PSCBATR1                                                 04499000
PSCBACCT EQU   PSCBATR1                                                 04500000
PSCBCTRL EQU   PSCBATR1                                                 04501000
PSCBGPNM EQU   PSCB+8                                                   04502000
PSCBUSRL EQU   PSCB+7                                                   04503000
PSCBUSER EQU   PSCB                                                     04504000
DSABGRID EQU   DSABGIDL+4                                               04505000
DSABLLEN EQU   DSABGIDL                                                 04506000
DSABANAM EQU   DSABANMI+1                                               04507000
DSABANML EQU   DSABANMI                                                 04508000
DSABRS04 EQU   DSAB+68                                                  04509000
DSABRS03 EQU   DSAB+62                                                  04510000
DSABDCBM EQU   DSAB+56                                                  04511000
DSABSSCM EQU   DSAB+52                                                  04512000
DSABSSNM EQU   DSAB+48                                                  04513000
DSABRS02 EQU   DSAB+38                                                  04514000
@NM00266 EQU   DSABFLG4                                                 04515000
DSABCKSI EQU   DSABFLG4                                                 04516000
DSABCKVL EQU   DSABFLG4                                                 04517000
DSABCKDS EQU   DSABFLG4                                                 04518000
@NM00265 EQU   DSABFLG3                                                 04519000
DSABJSCT EQU   DSABFLG3                                                 04520000
DSABCATL EQU   DSABFLG3                                                 04521000
DSABVMSC EQU   DSABFLG3                                                 04522000
DSABPASS EQU   DSABFLG3                                                 04523000
DSABDEFR EQU   DSABFLG3                                                 04524000
@NM00264 EQU   DSABFLG2                                                 04525000
DSABUNAL EQU   DSABFLG2                                                 04526000
DSABIRM  EQU   DSABFLG2                                                 04527000
DSABOPEN EQU   DSABFLG2                                                 04528000
DSABCATM EQU   DSABFLG1                                                 04529000
DSABDCAT EQU   DSABFLG1                                                 04530000
DSABDCNV EQU   DSABFLG1                                                 04531000
@NM00263 EQU   DSABORG2                                                 04532000
DSABTR   EQU   DSABORG2                                                 04533000
DSABAM   EQU   DSABORG2                                                 04534000
@NM00262 EQU   DSABORG2                                                 04535000
DSABTQ   EQU   DSABORG2                                                 04536000
DSABTX   EQU   DSABORG2                                                 04537000
DSABGS   EQU   DSABORG2                                                 04538000
DSABU    EQU   DSABORG1                                                 04539000
DSABPO   EQU   DSABORG1                                                 04540000
DSABMQ   EQU   DSABORG1                                                 04541000
DSABCQ   EQU   DSABORG1                                                 04542000
DSABCX   EQU   DSABORG1                                                 04543000
DSABDA   EQU   DSABORG1                                                 04544000
DSABPS   EQU   DSABORG1                                                 04545000
DSABIS   EQU   DSABORG1                                                 04546000
DSABSSVA EQU   DSAB+21                                                  04547000
DSABRS01 EQU   DSAB+20                                                  04548000
DSABOPCT EQU   DSAB+14                                                  04549000
DSABLNTH EQU   DSAB+12                                                  04550000
DSABBCHN EQU   DSAB+8                                                   04551000
DSABFCHN EQU   DSAB+4                                                   04552000
DSABID   EQU   DSAB                                                     04553000
ASCBEND  EQU   ASCB+208                                                 04554000
ASCBSRBT EQU   ASCB+200                                                 04555000
ASCBSWTL EQU   ASCB+196                                                 04556000
ASCBRS14 EQU   ASCB+195                                                 04557000
ASCBSMCT EQU   ASCB+194                                                 04558000
ASCBRS12 EQU   ASCB+192                                                 04559000
ASCBPCTT EQU   ASCB+188                                                 04560000
ASCBVGTT EQU   ASCB+184                                                 04561000
ASCBLGCB EQU   ASCB+180                                                 04562000
ASCBJBNS EQU   ASCB+176                                                 04563000
ASCBJBNI EQU   ASCB+172                                                 04564000
ASCBMCC  EQU   ASCB+168                                                 04565000
ASCBRTWA EQU   ASCB+164                                                 04566000
ASCBIQEA EQU   ASCB+160                                                 04567000
ASCBXMPQ EQU   ASCB+156                                                 04568000
ASCBRS01 EQU   ASCB+154                                                 04569000
ASCBFMCT EQU   ASCB+152                                                 04570000
ASCBOUXB EQU   ASCB+148                                                 04571000
ASCBOUCB EQU   ASCB+144                                                 04572000
ASCBMECB EQU   ASCB+140                                                 04573000
ASCBQECB EQU   ASCB+136                                                 04574000
ASCBCMSB EQU   ASCB+132                                                 04575000
ASCBCMSF EQU   ASCB+128                                                 04576000
ASCBTCBS EQU   ASCB+124                                                 04577000
ASCBNVSC EQU   ASCB+122                                                 04578000
ASCBVSC  EQU   ASCB+120                                                 04579000
ASCBSRBS EQU   ASCB+118                                                 04580000
ASCBSSRB EQU   ASCB+116                                                 04581000
ASCBRV06 EQU   ASCBFLG2                                                 04582000
ASCBRV05 EQU   ASCBFLG2                                                 04583000
ASCBRV04 EQU   ASCBFLG2                                                 04584000
ASCBSNQS EQU   ASCBFLG2                                                 04585000
ASCBS2S  EQU   ASCBFLG2                                                 04586000
ASCBCEXT EQU   ASCBFLG2                                                 04587000
ASCBPXMT EQU   ASCBFLG2                                                 04588000
ASCBXMPT EQU   ASCBFLG2                                                 04589000
ASCBRF07 EQU   ASCBDSP1                                                 04590000
ASCBRF06 EQU   ASCBDSP1                                                 04591000
ASCBRF05 EQU   ASCBDSP1                                                 04592000
ASCBRF04 EQU   ASCBDSP1                                                 04593000
ASCBRF03 EQU   ASCBDSP1                                                 04594000
ASCBRF02 EQU   ASCBDSP1                                                 04595000
ASCBFAIL EQU   ASCBDSP1                                                 04596000
ASCBNOQ  EQU   ASCBDSP1                                                 04597000
ASCBSWCT EQU   ASCB+112                                                 04598000
ASCBASXB EQU   ASCB+108                                                 04599000
ASCBTMCH EQU   ASCB+104                                                 04600000
ASCBNSWP EQU   ASCBFLG1                                                 04601000
ASCBTYP1 EQU   ASCBFLG1                                                 04602000
ASCBSTND EQU   ASCBFLG1                                                 04603000
ASCBABNT EQU   ASCBFLG1                                                 04604000
ASCBTERM EQU   ASCBFLG1                                                 04605000
ASCBS3S  EQU   ASCBFLG1                                                 04606000
ASCBCMSH EQU   ASCBFLG1                                                 04607000
ASCBTOFF EQU   ASCBFLG1                                                 04608000
ASCBRF01 EQU   ASCBRCTF                                                 04609000
ASCBTMLW EQU   ASCBRCTF                                                 04610000
ASCBOUT  EQU   ASCBRCTF                                                 04611000
ASCBWAIT EQU   ASCBRCTF                                                 04612000
ASCBRV08 EQU   ASCBRCTF                                                 04613000
ASCBFQU  EQU   ASCBRCTF                                                 04614000
ASCBFRS  EQU   ASCBRCTF                                                 04615000
ASCBTMNO EQU   ASCBRCTF                                                 04616000
ASCBAFFN EQU   ASCBFW1                                                  04617000
ASCBDUMP EQU   ASCB+96                                                  04618000
ASCBQSVC EQU   ASCB+92                                                  04619000
ASCBUBET EQU   ASCB+88                                                  04620000
ASCBECB  EQU   ASCB+84                                                  04621000
ASCBJSTL EQU   ASCB+80                                                  04622000
ASCBEWST EQU   ASCB+72                                                  04623000
ASCBEJST EQU   ASCB+64                                                  04624000
ASCBCSCB EQU   ASCB+56                                                  04625000
ASCBRSM  EQU   ASCB+52                                                  04626000
ASCBLDA  EQU   ASCB+48                                                  04627000
ASCBSTOR EQU   ASCB+44                                                  04628000
ASCBDP   EQU   ASCB+43                                                  04629000
ASCBRV07 EQU   ASCB+42                                                  04630000
ASCBIOSM EQU   ASCB+40                                                  04631000
ASCBSEQN EQU   ASCB+38                                                  04632000
ASCBASID EQU   ASCB+36                                                  04633000
ASCBCPUS EQU   ASCB+32                                                  04634000
ASCBSPL  EQU   ASCB+28                                                  04635000
ASCBLSLQ EQU   ASCB+24                                                  04636000
ASCBFSLQ EQU   ASCB+20                                                  04637000
ASCBIOSP EQU   ASCB+16                                                  04638000
ASCBLOCK EQU   ASCB+12                                                  04639000
ASCBBWDP EQU   ASCB+8                                                   04640000
ASCBFWDP EQU   ASCB+4                                                   04641000
ASCBASCB EQU   ASCB                                                     04642000
ASCBEGIN EQU   ASCB                                                     04643000
JSCBCSCB EQU   JSCBSEC1+68                                              04644000
JSCBPMG  EQU   JSCBWTP+2                                                04645000
JSCBWTSP EQU   JSCBWTP+1                                                04646000
JSCRSV23 EQU   JSCBWTFG                                                 04647000
JSCRSV22 EQU   JSCBWTFG                                                 04648000
JSCRSV21 EQU   JSCBWTFG                                                 04649000
JSCRSV20 EQU   JSCBWTFG                                                 04650000
JSCRSV19 EQU   JSCBWTFG                                                 04651000
JSCRSV18 EQU   JSCBWTFG                                                 04652000
JSCBRET  EQU   JSCBWTFG                                                 04653000
JSCBIOFG EQU   JSCBWTFG                                                 04654000
@NM00259 EQU   JSCBSEC1+60                                              04655000
JSCBQMPI EQU   JSCBSEC1+56                                              04656000
JSCBPMSG EQU   JSCBSWT1                                                 04657000
JSCRSV16 EQU   JSCBSWT1                                                 04658000
JSCRSV15 EQU   JSCBSWT1                                                 04659000
JSCRSV14 EQU   JSCBSWT1                                                 04660000
JSCRSV13 EQU   JSCBSWT1                                                 04661000
JSCRSV12 EQU   JSCBSWT1                                                 04662000
JSCRSV11 EQU   JSCBSWT1                                                 04663000
JSCBPASS EQU   JSCBSWT1                                                 04664000
JSCBTTTR EQU   JSCBSEC1+52                                              04665000
JSCRSV10 EQU   JSCBSEC1+49                                              04666000
JSCBAUTH EQU   JSCBOPTS                                                 04667000
JSCSIOTS EQU   JSCBOPTS                                                 04668000
JSCRSV08 EQU   JSCBOPTS                                                 04669000
JSCRSV07 EQU   JSCBOPTS                                                 04670000
JSCRSV06 EQU   JSCBOPTS                                                 04671000
JSCBLONG EQU   JSCBOPTS                                                 04672000
JSCRSV05 EQU   JSCBOPTS                                                 04673000
JSCRSV04 EQU   JSCBOPTS                                                 04674000
JSCBSECB EQU   JSCBSEC1+44                                              04675000
JSCRSV03 EQU   JSCBSEC1+41                                              04676000
JSCBSTEP EQU   JSCBSEC1+40                                              04677000
JSCBDCBA EQU   JSCBDCB+1                                                04678000
JSCRSV02 EQU   JSCBDCB                                                  04679000
JSCBID   EQU   JSCBSEC1+32                                              04680000
JSCBDBTB EQU   JSCBSEC1+28                                              04681000
JSCBIJSC EQU   JSCBSEC1+24                                              04682000
JSCBPCC  EQU   JSCBSEC1+16                                              04683000
JSCBTCP  EQU   JSCBSEC1+12                                              04684000
JSCBSHR  EQU   JSCBSEC1+8                                               04685000
JSCHPCEA EQU   JSCHPCE+1                                                04686000
JSCRSV32 EQU   JSCHPCE                                                  04687000
JSCRSV01 EQU   JSCBSEC1                                                 04688000
@NM00258 EQU   IEZJSCB                                                  04689000
@NM00257 EQU   JFCBX+144                                                04690000
@NM00256 EQU   JFCBX+94                                                 04691000
@NM00255 EQU   JFCBX+3                                                  04692000
JFCRSV05 EQU   JFCEROPT                                                 04693000
JFCRSV04 EQU   JFCEROPT                                                 04694000
JFCRSV03 EQU   JFCEROPT                                                 04695000
JFCRSV02 EQU   JFCEROPT                                                 04696000
JFCTOPT  EQU   JFCEROPT                                                 04697000
JFCABN   EQU   JFCEROPT                                                 04698000
JFCSKP   EQU   JFCEROPT                                                 04699000
JFCACC   EQU   JFCEROPT                                                 04700000
JFCBUFL  EQU   JFCAMPTR+2                                               04701000
JFCFWORD EQU   JFCBFTEK                                                 04702000
JFCDWORD EQU   JFCBFTEK                                                 04703000
JFCHIER1 EQU   JFCBFTEK                                                 04704000
JFCDYN   EQU   JFCBFTEK                                                 04705000
JFCEXC   EQU   JFCBFTEK                                                 04706000
JFCBBFTR EQU   JFCBBFTA                                                 04707000
JFCSIM   EQU   JFCBBFTA                                                 04708000
JFCHIER  EQU   JFCBFTEK                                                 04709000
JFCBFOUT EQU   JFCBUFNO                                                 04710000
JFCBUFIN EQU   JFCBUFNO                                                 04711000
JFCTEMP  EQU   JFCBIND2                                                 04712000
JFCREQ   EQU   JFCBIND2                                                 04713000
JFCENT   EQU   JFCBIND2                                                 04714000
JFCSECUR EQU   JFCBIND2                                                 04715000
JFCDISP  EQU   JFCBIND2                                                 04716000
JFCPDS   EQU   JFCBIND1                                                 04717000
JFCGDG   EQU   JFCBIND1                                                 04718000
JFCADDED EQU   JFCBIND1                                                 04719000
JFCLOC   EQU   JFCBIND1                                                 04720000
JFCBXPDT EQU   INFMJFCB+83                                              04721000
JFCBCRDT EQU   INFMJFCB+80                                              04722000
JFCBOPS2 EQU   JFCBMASK+7                                               04723000
JFCRCTLG EQU   JFCBFLG2                                                 04724000
JFCBBUFF EQU   JFCBFLG2                                                 04725000
JFCTRACE EQU   JFCBFLG2                                                 04726000
JFCSDRPS EQU   JFCBFLG2                                                 04727000
JFCMODNW EQU   JFCBFLG2                                                 04728000
JFCNRPS  EQU   JFCDEFER                                                 04729000
JFCOUTOP EQU   JFCBFLG2                                                 04730000
JFCINOP  EQU   JFCBFLG2                                                 04731000
JFCBPWBP EQU   JFCOPEN                                                  04732000
@NM00251 EQU   JFCOPEN                                                  04733000
JFCDUAL  EQU   JFCBFLG1                                                 04734000
JFCSLDES EQU   JFCBFLG1                                                 04735000
JFCSLCRE EQU   JFCBFLG1                                                 04736000
JFCSTAND EQU   JFCBFLG1                                                 04737000
JFCBOPS1 EQU   JFCBMASK                                                 04738000
JFCRSV31 EQU   JFCFUNC                                                  04739000
JFCFNCBT EQU   JFCFUNC                                                  04740000
JFCFNCBX EQU   JFCFUNC                                                  04741000
JFCFNCBD EQU   JFCFUNC                                                  04742000
JFCFNCBW EQU   JFCFUNC                                                  04743000
JFCFNCBP EQU   JFCFUNC                                                  04744000
JFCFNCBR EQU   JFCFUNC                                                  04745000
JFCFNCBI EQU   JFCFUNC                                                  04746000
JFCBFOFL EQU   JFCBUFOF                                                 04747000
JFCNL    EQU   JFCBLTYP                                                 04748000
JFCSL    EQU   JFCBLTYP                                                 04749000
JFCNSL   EQU   JFCBLTYP                                                 04750000
JFCSUL   EQU   JFCBLTYP                                                 04751000
JFCBLP   EQU   JFCBLTYP                                                 04752000
JFCBLTM  EQU   JFCBLTYP                                                 04753000
JFCBAL   EQU   JFCBLTYP                                                 04754000
JFCRSV38 EQU   JFCBLTYP                                                 04755000
JFCVINDX EQU   INFMJFCB+64                                              04756000
JFCNLREC EQU   INFMJFCB+62                                              04757000
JFCBADBF EQU   INFMJFCB+60                                              04758000
JFCAMSTR EQU   JFCBFRID+2                                               04759000
JFCAMCRO EQU   JFCBFRID                                                 04760000
JFCPAT   EQU   JFCBTSDM                                                 04761000
JFCNDCB  EQU   JFCBTSDM                                                 04762000
JFCNDSCB EQU   JFCBTSDM                                                 04763000
JFCNWRIT EQU   JFCBTSDM                                                 04764000
JFCTTR   EQU   JFCBTSDM                                                 04765000
JFCSDS   EQU   JFCBTSDM                                                 04766000
JFCVSL   EQU   JFCBTSDM                                                 04767000
JFCIPLTX EQU   JFCBELNM                                                 04768000
JFCBQNAM EQU   JFCBDSNM                                                 04769000
SIODDSNL EQU   INDMSIOT+173                                             04770000
SIOVDSNL EQU   INDMSIOT+172                                             04771000
SIOVDSNT EQU   INDMSIOT+170                                             04772000
SVOLUNNO EQU   INDMSIOT+168                                             04773000
SIOTVMVP EQU   INDMSIOT+164                                             04774000
SIOTATE  EQU   INDMSIOT+144                                             04775000
SVOLUNAD EQU   INDMSIOT+140                                             04776000
SIOTEDLP EQU   INDMSIOT+136                                             04777000
SIOTEDLS EQU   INDMSIOT+132                                             04778000
SCTANAME EQU   INDMSIOT+122                                             04779000
@NM00250 EQU   INDMSIOT+108                                             04780000
SIOTSSNM EQU   INDMSIOT+104                                             04781000
@NM00249 EQU   SIOTBYT2                                                 04782000
SIOTCVOL EQU   SIOTBYT2                                                 04783000
SIOTCNEW EQU   SIOTBYT2                                                 04784000
SIOTGALL EQU   SIOTBYT2                                                 04785000
SIOTDSPD EQU   SIOTBYT2                                                 04786000
SIOTOPUC EQU   INDMSIOT+99                                              04787000
SIOTOUTR EQU   INDMSIOT+97                                              04788000
SIOTOUTC EQU   INDMSIOT+96                                              04789000
SIOTSSWA EQU   INDMSIOT+93                                              04790000
SIOTAUNC EQU   SIOTALTD                                                 04791000
SIOTACAT EQU   SIOTALTD                                                 04792000
SIOTADEL EQU   SIOTALTD                                                 04793000
SIOTAKEP EQU   SIOTALTD                                                 04794000
SIOTNPRV EQU   SIOTALTD                                                 04795000
SIOJCATS EQU   SIOTALTD                                                 04796000
@NM00248 EQU   SIOTALTD                                                 04797000
@NM00247 EQU   SIOTALTD                                                 04798000
@NM00246 EQU   INDMSIOT+91                                              04799000
SIOTNDSB EQU   INDMSIOT+88                                              04800000
@NM00245 EQU   INDMSIOT+84                                              04801000
SIOTDPCD EQU   INDMSIOT+82                                              04802000
@NM00244 EQU   SIOTBYT4                                                 04803000
SIOTRACT EQU   SIOTBYT4                                                 04804000
SIOTRACD EQU   SIOTBYT4                                                 04805000
SIOTPROT EQU   SIOTBYT4                                                 04806000
SCTOUTPN EQU   INDMSIOT+80                                              04807000
SCTOUTNO EQU   INDMSIOT+76                                              04808000
SCTOUTNM EQU   INDMSIOT+68                                              04809000
SIOUCBAD EQU   SCTUTYPE+5                                               04810000
SIOUCNVT EQU   SCTUTYPE+4                                               04811000
@NM00243 EQU   SIOUBYT3                                                 04812000
SIO3COMM EQU   SIOUBYT3                                                 04813000
SIOUBYT1 EQU   SIOTDEVT                                                 04814000
SIOTOMN  EQU   SCTSBYT4                                                 04815000
SIOTIPDI EQU   SCTSBYT4                                                 04816000
SIOTVAFF EQU   SCTSBYT4                                                 04817000
SIOTSTEP EQU   SCTSBYT4                                                 04818000
SIOTASCI EQU   SCTSBYT4                                                 04819000
@NM00242 EQU   SCTSBYT4                                                 04820000
SIOTGDGA EQU   SCTSBYT4                                                 04821000
SCTSGDGS EQU   SCTSBYT4                                                 04822000
SCTSOLD  EQU   SCTSBYT3                                                 04823000
SCTSMOD  EQU   SCTSBYT3                                                 04824000
SCTVREF  EQU   SCTSBYT3                                                 04825000
SCTALCHK EQU   SCTSBYT3                                                 04826000
SCTSYSNE EQU   SCTSBYT3                                                 04827000
SCTDSNRF EQU   SCTSBYT3                                                 04828000
SCTRECVD EQU   SCTSBYT2                                                 04829000
SCTDEFER EQU   SCTSBYT2                                                 04830000
SCTLABEL EQU   SCTSBYT2                                                 04831000
SCTUNLBD EQU   SCTSBYT2                                                 04832000
SCTJOBLB EQU   SCTSBYT2                                                 04833000
SCTVOLAF EQU   SCTSBYT2                                                 04834000
SIOTCATL EQU   SCTSBYT2                                                 04835000
SIOCLUNL EQU   SCTSBYT2                                                 04836000
SIOTJSCT EQU   SCTSBYT1                                                 04837000
SCTUNAFF EQU   SCTSBYT1                                                 04838000
SIOTQDSN EQU   SCTSBYT1                                                 04839000
SIOTCCAT EQU   SCTSBYT1                                                 04840000
SCTSYSIN EQU   SCTSBYT1                                                 04841000
SIOTUNCT EQU   SCTSDISP                                                 04842000
SIOTDLET EQU   SCTSDISP                                                 04843000
SIOTKEEP EQU   SCTSDISP                                                 04844000
SIOTPASS EQU   SCTSDISP                                                 04845000
S3400DSP EQU   SCTSDISP                                                 04846000
SIOTRETN EQU   SCTSDISP                                                 04847000
SIOTRTRY EQU   SIOTBYT0                                                 04848000
SIOTPUPV EQU   SIOTBYT0                                                 04849000
SIOTNOPV EQU   SIOTBYT0                                                 04850000
SIOTGIGN EQU   SIOTBYT0                                                 04851000
SPVTAMSG EQU   SIOTBYT0                                                 04852000
SIOTFUDA EQU   SIOTBYT0                                                 04853000
SIOTGIID EQU   INDMSIOT+50                                              04854000
SCTSPOOL EQU   INDMSIOT+48                                              04855000
SIOTQNAM EQU   SIOTTSTC                                                 04856000
SIOTDSNM EQU   SIOTTSTC                                                 04857000
SIOTTRKM EQU   SIOTTSTC                                                 04858000
SIOTSSMG EQU   SIOTTSTC                                                 04859000
@NM00241 EQU   SIOTTSTC                                                 04860000
SIOTTERM EQU   SIOTTSTC                                                 04861000
@NM00240 EQU   SIOTBYT3                                                 04862000
SIOTDSID EQU   SIOTBYT3                                                 04863000
S3400OFF EQU   SIOTBYT3                                                 04864000
SIOTJES3 EQU   SIOTBYT3                                                 04865000
SCTDDINO EQU   INDMSIOT+44                                              04866000
SIOTDDNT EQU   SIOTBYT1                                                 04867000
SIOTALCD EQU   SIOTBYT1                                                 04868000
SIODADSM EQU   SIOTBYT1                                                 04869000
SIOTDADR EQU   SIOTBYT1                                                 04870000
SIODUNAL EQU   SIOTBYT1                                                 04871000
SIOTHOLD EQU   SIOTBYT1                                                 04872000
SIOTOCKP EQU   SIOTBYT1                                                 04873000
SIOPSCNT EQU   INDMSIOT+42                                              04874000
SIOTREFN EQU   INDMSIOT+40                                              04875000
SIOTOTUN EQU   INDMSIOT+39                                              04876000
SIOTVRSB EQU   INDMSIOT+36                                              04877000
@NM00239 EQU   INDMSIOT+35                                              04878000
SCTPJFCB EQU   INDMSIOT+32                                              04879000
@NM00238 EQU   INDMSIOT+31                                              04880000
SIOTAFID EQU   INDMSIOT+26                                              04881000
SIOTVLSP EQU   INDMSIOT+24                                              04882000
SIODSNTE EQU   INDMSIOT+22                                              04883000
SIOTUNAF EQU   SCTUSADD                                                 04884000
SIOTDEST EQU   INDMSIOT+12                                              04885000
SCTDDNAM EQU   INDMSIOT+4                                               04886000
@NM00237 EQU   @NM00235+1                                               04887000
SCTONLY  EQU   SCTABCND                                                 04888000
SCTEVEN  EQU   SCTABCND                                                 04889000
SCTABEND EQU   SCTABCND                                                 04890000
SCTONLYC EQU   SCTABCND                                                 04891000
SCTABCAN EQU   SCTABCND                                                 04892000
@NM00236 EQU   SCTABCND                                                 04893000
@NM00234 EQU   INSMSCT+173                                              04894000
@NM00233 EQU   SCTSTEND                                                 04895000
SCTSYSCK EQU   SCTSTEND                                                 04896000
SCTSTPND EQU   SCTSTEND                                                 04897000
SCTSTSRT EQU   SCTSTEND                                                 04898000
@NM00232 EQU   INSMSCT+168                                              04899000
SCTCATCT EQU   INSMSCT+166                                              04900000
SCTSDPSA EQU   SCTCDENT+3                                               04901000
SCTSDPOP EQU   SCTCDENT+2                                               04902000
SCTSDPCD EQU   SCTCDENT                                                 04903000
@NM00231 EQU   INSMSCT+117                                              04904000
SCTPRFMF EQU   INSMSCT+116                                              04905000
SCTPGMNM EQU   INSMSCT+108                                              04906000
SCTTIOT  EQU   INSMSCT+105                                              04907000
@NM00230 EQU   SCTBCT                                                   04908000
SCTJBEND EQU   SCTBCT                                                   04909000
SCTSPSYS EQU   SCTBCT                                                   04910000
SCTSTPLB EQU   SCTBCT                                                   04911000
@NM00229 EQU   SCTBCT                                                   04912000
SCTMCVOL EQU   SCTBCT                                                   04913000
@NM00228 EQU   SCTBCT                                                   04914000
SCTGOTTR EQU   INSMSCT+100                                              04915000
SCTSMF   EQU   INSMSCT+96                                               04916000
@NM00227 EQU   SCTSDPTY+1                                               04917000
SCTSDP   EQU   SCTSDPTY                                                 04918000
SCTFSTEP EQU   SCTSDPTY                                                 04919000
@NM00226 EQU   SCTSDPTY                                                 04920000
@NM00225 EQU   SCTSDPTY                                                 04921000
SCTNIUSL EQU   INSMSCT+92                                               04922000
@NM00224 EQU   INSMSCT+90                                               04923000
SCTMSSZE EQU   INSMSCT+88                                               04924000
SCTPCAT  EQU   INSMSCT+84                                               04925000
SCTLDSTB EQU   INSMSCT+80                                               04926000
SCTSRBT  EQU   INSMSCT+76                                               04927000
SCTMSADR EQU   INSMSCT+72                                               04928000
@NM00223 EQU   INSMSCT+71                                               04929000
SCTXBTTR EQU   INSMSCT+68                                               04930000
SCTJSCAT EQU   SCTSTYPE                                                 04931000
SCTINITB EQU   SCTSTYPE                                                 04932000
SCTSJFHK EQU   SCTSTYPE                                                 04933000
SCTOUTMC EQU   SCTSTYPE                                                 04934000
SCTINPUT EQU   SCTSTYPE                                                 04935000
SCTGOSTP EQU   SCTSTYPE                                                 04936000
@NM00222 EQU   INSMSCT+66                                               04937000
SCTNSMSG EQU   INSMSCT+65                                               04938000
@NM00221 EQU   INSMSCT+62                                               04939000
SCTRPACT EQU   INSMSCT+60                                               04940000
SCTSNAME EQU   INSMSCT+52                                               04941000
SCTSCLPC EQU   INSMSCT+44                                               04942000
@NM00220 EQU   INSMSCT+43                                               04943000
SCTADSTB EQU   INSMSCT+40                                               04944000
@NM00219 EQU   INSMSCT+36                                               04945000
@NM00218 EQU   INSMSCT+35                                               04946000
SCTAFACT EQU   INSMSCT+32                                               04947000
SCTDDNT  EQU   INSMSCT+28                                               04948000
@NM00217 EQU   INSMSCT+27                                               04949000
@NM00216 EQU   INSMSCT+23                                               04950000
SCTANSCT EQU   INSMSCT+20                                               04951000
@NM00215 EQU   INSMSCT+19                                               04952000
SCTAALOC EQU   INSMSCT+16                                               04953000
@NM00214 EQU   INSMSCT+15                                               04954000
SCTLALOC EQU   INSMSCT+10                                               04955000
SCTSEXEC EQU   INSMSCT+8                                                04956000
SCTSTIME EQU   INSMSCT+5                                                04957000
INCMSSTS EQU   SCTSSTAT                                                 04958000
SCTGRPH  EQU   SCTSSTAT                                                 04959000
SCTKEY0  EQU   SCTSSTAT                                                 04960000
SCTDORST EQU   SCTSSTAT                                                 04961000
SCTNOCKP EQU   SCTSSTAT                                                 04962000
SCTNORST EQU   SCTSSTAT                                                 04963000
EACAUSER EQU   SCTSSTAT                                                 04964000
EAADDRBT EQU   SCTSSTAT                                                 04965000
ACTACCNT EQU   IEFAACTB+32                                              04966000
ACTJNFLD EQU   IEFAACTB+31                                              04967000
ACTJTIME EQU   IEFAACTB+28                                              04968000
ACTPRGNM EQU   IEFAACTB+8                                               04969000
@NM00213 EQU   IEFAACTB+7                                               04970000
ACTNEXT  EQU   IEFAACTB+4                                               04971000
ACTIDENT EQU   IEFAACTB+3                                               04972000
ACTDSKAD EQU   IEFAACTB                                                 04973000
@NM00212 EQU   INJMJCT+175                                              04974000
JCTVULDP EQU   INJMJCT+172                                              04975000
JCTACODE EQU   INJMJCT+168                                              04976000
JCTPRFMF EQU   INJMJCT+167                                              04977000
JCTUSER  EQU   INJMJCT+160                                              04978000
JCTSSD   EQU   INJMJCT+157                                              04979000
@NM00211 EQU   INJMJCT+156                                              04980000
JCTSRBT  EQU   INJMJCT+152                                              04981000
JCTJMRJD EQU   INJMJCT+149                                              04982000
JCTJMRJT EQU   INJMJCT+146                                              04983000
JCTJMRSS EQU   INJMJCT+143                                              04984000
JCTJMRTL EQU   INJMJCT+140                                              04985000
JCTJMRCL EQU   INJMJCT+139                                              04986000
JCTJMROP EQU   INJMJCT+138                                              04987000
JCTJMRD  EQU   INJMJCT+137                                              04988000
JCTJMR   EQU   INJMJCT+134                                              04989000
JCTCKIDT EQU   INJMJCT+118                                              04990000
JCTCKIDL EQU   INJMJCT+117                                              04991000
@NM00210 EQU   JCTSTAT2                                                 04992000
JCTBLP   EQU   JCTSTAT2                                                 04993000
JCTPERFM EQU   JCTSTAT2                                                 04994000
JCTSWSM  EQU   JCTSTAT2                                                 04995000
JCTENDIT EQU   JCTSTAT2                                                 04996000
JCTADSPC EQU   JCTSTAT2                                                 04997000
JCTSPSYS EQU   JCTSTAT2                                                 04998000
@NM00209 EQU   INJMJCT+115                                              04999000
JCTSSTR  EQU   INJMJCT+112                                              05000000
JCTJSBTM EQU   JCTJSB                                                   05001000
JCTJSBEX EQU   JCTJSB                                                   05002000
JCTJSBAL EQU   JCTJSB                                                   05003000
JCTJSBIN EQU   JCTJSB                                                   05004000
@NM00208 EQU   JCTJSB                                                   05005000
JCTVOLSQ EQU   INJMJCT+110                                              05006000
JCTNRCKP EQU   INJMJCT+108                                              05007000
JCTNTRK  EQU   INJMJCT+107                                              05008000
JCTCKTTR EQU   INJMJCT+104                                              05009000
JCTDEVT  EQU   INJMJCT+100                                              05010000
@NM00207 EQU   INJMJCT+99                                               05011000
JCTSTIOT EQU   INJMJCT+96                                               05012000
JCTSNUMB EQU   INJMJCT+95                                               05013000
JCTQIDNT EQU   INJMJCT+94                                               05014000
JCTEQREG EQU   INJMJCT+92                                               05015000
@NM00206 EQU   INJMJCT+91                                               05016000
JCTDETDA EQU   INJMJCT+88                                               05017000
JCTDSDRA EQU   JCTRSW2                                                  05018000
JCTDSOJB EQU   JCTRSW2                                                  05019000
JCTDSOCR EQU   JCTRSW2                                                  05020000
JCTRESTT EQU   JCTRSW2                                                  05021000
JCTNOCKP EQU   JCTRSW2                                                  05022000
JCTNORST EQU   JCTRSW2                                                  05023000
JCTNARST EQU   JCTRSW2                                                  05024000
JCTSYSCK EQU   JCTRSW2                                                  05025000
@NM00205 EQU   JCTRSW1                                                  05026000
JCTSTEPR EQU   JCTRSW1                                                  05027000
JCTCKPTR EQU   JCTRSW1                                                  05028000
JCTCKFT  EQU   JCTRSW1                                                  05029000
JCTCONTR EQU   JCTRSW1                                                  05030000
JCTSTERM EQU   JCTRSW1                                                  05031000
JCTWARMS EQU   JCTRSW1                                                  05032000
@NM00204 EQU   JCTCCODE+3                                               05033000
JCTJDPOP EQU   JCTCCODE+2                                               05034000
JCTJDPCD EQU   JCTCCODE                                                 05035000
@NM00203 EQU   INJMJCT+53                                               05036000
JCTSCT   EQU   INJMJCT+52                                               05037000
JCTSMRBA EQU   INJMJCT+44                                               05038000
@NM00202 EQU   INJMJCT+43                                               05039000
JCTACTAD EQU   INJMJCT+40                                               05040000
@NM00201 EQU   INJMJCT+39                                               05041000
JCTJCTX  EQU   INJMJCT+36                                               05042000
@NM00200 EQU   INJMJCT+35                                               05043000
JCTSDKAD EQU   INJMJCT+32                                               05044000
JCTJCSMF EQU   INJMJCT+31                                               05045000
JCTGDGNT EQU   INJMJCT+28                                               05046000
@NM00199 EQU   INJMJCT+27                                               05047000
JCTPDIP  EQU   INJMJCT+24                                               05048000
JCTJTPTN EQU   INJMJCT+16                                               05049000
JCTJNAME EQU   INJMJCT+8                                                05050000
JCTJPRTY EQU   JCTJBYTE                                                 05051000
INCMMGL1 EQU   JCTJMGLV                                                 05052000
INCMMGL2 EQU   JCTJMGLV                                                 05053000
@NM00198 EQU   JCTJMGLV                                                 05054000
JCTJMGPO EQU   INJMJCT+6                                                05055000
INCMNSET EQU   JCTJSTAT                                                 05056000
INCMCAT  EQU   INDMCTLG                                                 05057000
INCMSTS  EQU   JCTJSTAT                                                 05058000
JCTABEND EQU   JCTJSTAT                                                 05059000
@NM00197 EQU   JCTJSTAT                                                 05060000
JCTJSTPC EQU   JCTJSTAT                                                 05061000
@NM00196 EQU   JCTJSTAT                                                 05062000
JCTJBLBS EQU   JCTJSTAT                                                 05063000
JCTJSRNO EQU   INJMJCT+4                                                05064000
JCTIDENT EQU   INJMJCT+3                                                05065000
JCTDSKAD EQU   INJMJCT                                                  05066000
MSSPARE  EQU   BASES01+48                                               05067000
MSUCBAL  EQU   BASES01+44                                               05068000
MSUCBPR  EQU   BASES01+40                                               05069000
MSBOBECB EQU   BASES01+36                                               05070000
MSSJQ    EQU   BASES01+32                                               05071000
MSECB    EQU   BASES01+28                                               05072000
MSPBP    EQU   BASES01+24                                               05073000
MSERM    EQU   BASES01+22                                               05074000
MSPASS   EQU   BASES01+14                                               05075000
MSVRB    EQU   BASES01+6                                                05076000
MSQHR    EQU   MSFHF                                                    05077000
@NM00195 EQU   MSFHF                                                    05078000
MSPSDT   EQU   MSFHF                                                    05079000
MSREPLYB EQU   MSFHF                                                    05080000
MSFAX    EQU   MSFHF                                                    05081000
MSTTT    EQU   MSFHF                                                    05082000
MSCSD    EQU   MSFHF                                                    05083000
MSNMF    EQU   MSFHF                                                    05084000
MSJNF    EQU   MSSSA                                                    05085000
MSYOUT   EQU   MSNWP                                                    05086000
MSNRP    EQU   MSSSA                                                    05087000
MSSRDR   EQU   MSREOF                                                   05088000
MSWRLOG  EQU   MSSSA                                                    05089000
MSNUPSW  EQU   MSSSA                                                    05090000
MSWRPEN  EQU   MSSSA                                                    05091000
MSSSSIPL EQU   MSINLSW                                                  05092000
MSSUM    EQU   MSECBFL                                                  05093000
MSMCR    EQU   MSECBFL                                                  05094000
MSYSOUT  EQU   MSECBFL                                                  05095000
MSYSIN   EQU   MSECBFL                                                  05096000
MSATTN   EQU   MSECBFL                                                  05097000
MSWTL    EQU   MSECBFL                                                  05098000
MSWTO    EQU   MSECBFL                                                  05099000
MSEXT    EQU   MSECBFL                                                  05100000
MSCCS    EQU   MSPFG                                                    05101000
MSBSP    EQU   MSPFG                                                    05102000
MSSYT    EQU   MSPFG                                                    05103000
MSSYN    EQU   MSPFG                                                    05104000
MSICR    EQU   MSPFG                                                    05105000
MSCMC    EQU   MSPFG                                                    05106000
MSPNB    EQU   MSPFG                                                    05107000
MSDATE   EQU   MSPFG                                                    05108000
@NM00194 EQU   MSBTN                                                    05109000
MSTN     EQU   MSBTN                                                    05110000
@NM00193 EQU   MSBTN                                                    05111000
@NM00192 EQU   MSBTN                                                    05112000
MSSO     EQU   MSBTN                                                    05113000
MSROLFLG EQU   MSBTN                                                    05114000
MSCANFLG EQU   MSBTN                                                    05115000
MSCONFLG EQU   MSBTN                                                    05116000
MSPNIP   EQU   MSNTAL                                                   05117000
MSQNIP   EQU   MSNTAL                                                   05118000
MSCURE34 EQU   MSNTAL                                                   05119000
@NM00191 EQU   MSNTAL                                                   05120000
@NM00190 EQU   MSNTAL                                                   05121000
@NM00189 EQU   MSNTAL                                                   05122000
@NM00188 EQU   MSNTAL                                                   05123000
MSNIP    EQU   MSNTAL                                                   05124000
@NM00187 EQU   MS1BASEX+40                                              05125000
@NM00186 EQU   MS1BASEX+20                                              05126000
@NM00185 EQU   MS1BASEX                                                 05127000
@NM00184 EQU   BASE+128                                                 05128000
MSLGJSCB EQU   BASE+124                                                 05129000
@NM00183 EQU   MSSTRTSW                                                 05130000
MSSTRTP  EQU   MSSTRTSW                                                 05131000
MSSTRTW  EQU   MSSTRTSW                                                 05132000
@NM00182 EQU   MSWTRSW                                                  05133000
MSWTRP   EQU   MSWTRSW                                                  05134000
MSWTRW   EQU   MSWTRSW                                                  05135000
@NM00181 EQU   MSWLOGSW                                                 05136000
MSWLOGP  EQU   MSWLOGSW                                                 05137000
MSWLOGW  EQU   MSWLOGSW                                                 05138000
@NM00180 EQU   MSCLOSSW                                                 05139000
MSCLOSP  EQU   MSCLOSSW                                                 05140000
MSCLOSW  EQU   MSCLOSSW                                                 05141000
MSLOGLMT EQU   @NM00179+1                                               05142000
MSLOGCLS EQU   @NM00179                                                 05143000
BAASCB   EQU   BASE+100                                                 05144000
MSSMFPRM EQU   BASE+96                                                  05145000
MSCOMMND EQU   BASE+92                                                  05146000
BASP12   EQU   BASE+90                                                  05147000
BASTCNT  EQU   BASE+88                                                  05148000
BASESCT  EQU   BASE+86                                                  05149000
BASUBECB EQU   BASE+80                                                  05150000
BALOGCOM EQU   BASE+76                                                  05151000
BADACNT  EQU   BASE+74                                                  05152000
BATACNT  EQU   BASE+72                                                  05153000
BAJBNR   EQU   BASE+64                                                  05154000
BASP11   EQU   BASE+62                                                  05155000
BALCCNT  EQU   BASE+61                                                  05156000
BADUMPID EQU   BASE+60                                                  05157000
BABCMAX  EQU   BASE+58                                                  05158000
BAMONTR2 EQU   BASE+57                                                  05159000
@NM00178 EQU   BAMONITR                                                 05160000
BAMACTVE EQU   BAMONITR                                                 05161000
@NM00177 EQU   BAMONITR                                                 05162000
@NM00176 EQU   BAMONITR                                                 05163000
@NM00175 EQU   BAMONITR                                                 05164000
@NM00174 EQU   BAMONITR                                                 05165000
BASPACE  EQU   BAMONITR                                                 05166000
BADSN    EQU   BAMONITR                                                 05167000
BADSO    EQU   BASE+52                                                  05168000
BALOGECB EQU   BASE+48                                                  05169000
@NM00173 EQU   BASPBYTE                                                 05170000
@NM00172 EQU   BASPBYTE                                                 05171000
@NM00171 EQU   BASPBYTE                                                 05172000
@NM00170 EQU   BASPBYTE                                                 05173000
@NM00169 EQU   BASPBYTE                                                 05174000
BAMASCH  EQU   BASPBYTE                                                 05175000
BATRACE  EQU   BASPBYTE                                                 05176000
BAMSSTAR EQU   BASPBYTE                                                 05177000
@NM00168 EQU   MSLOGST                                                  05178000
@NM00167 EQU   MSLOGST                                                  05179000
MSLOGSTA EQU   MSLOGST                                                  05180000
MSLOGIPL EQU   MSLOGST                                                  05181000
MSLOGDAR EQU   MSLOGST                                                  05182000
MSLOGCOM EQU   MSLOGST                                                  05183000
MSLOGTHD EQU   MSLOGST                                                  05184000
MSLOGENQ EQU   MSLOGST                                                  05185000
BAMIPAR2 EQU   BASE+44                                                  05186000
BAMINPAR EQU   BASE+42                                                  05187000
BAPKES   EQU   BASE+40                                                  05188000
BAICTR   EQU   BASE+38                                                  05189000
@NM00166 EQU   BASE+37                                                  05190000
BADSET   EQU   BARSW                                                    05191000
BANOSET  EQU   BARSW                                                    05192000
BAMIDNT  EQU   BARSW                                                    05193000
BAHR     EQU   BARSW                                                    05194000
BAVU     EQU   BARSW                                                    05195000
BAINTSET EQU   BARSW                                                    05196000
MSTODWTO EQU   BARSW                                                    05197000
BAIN     EQU   BARSW                                                    05198000
BACV     EQU   BASE+32                                                  05199000
@NM00165 EQU   BALOG                                                    05200000
@NM00164 EQU   BALOG                                                    05201000
@NM00163 EQU   BALOG                                                    05202000
@NM00162 EQU   BALOG                                                    05203000
@NM00161 EQU   BALOG                                                    05204000
@NM00160 EQU   BALOG                                                    05205000
@NM00159 EQU   BALOG                                                    05206000
BALOGINT EQU   BALOG                                                    05207000
MSLOGSVC EQU   BALGSTAT                                                 05208000
BAPRC    EQU   BASE+20                                                  05209000
BAQ      EQU   BASE+16                                                  05210000
BAIPLCC  EQU   @NM00157+2                                               05211000
@NM00158 EQU   @NM00157                                                 05212000
BAIPL    EQU   BASE+12                                                  05213000
BALAD    EQU   BASE+8                                                   05214000
BATRM    EQU   BASE+4                                                   05215000
BACHN    EQU   BASE                                                     05216000
CVTLEVL  EQU   CVTRELNO+2                                               05217000
CVTNUMB  EQU   CVTRELNO                                                 05218000
CVTMDL   EQU   CVTFIX+250                                               05219000
@NM00156 EQU   CVTFIX+248                                               05220000
@NM00155 EQU   CVTFIX                                                   05221000
CVTRV482 EQU   CVTXTNT2+128                                             05222000
CVTRV481 EQU   CVTXTNT2+124                                             05223000
CVTRV480 EQU   CVTXTNT2+120                                             05224000
CVTRV479 EQU   CVTXTNT2+118                                             05225000
CVTRV478 EQU   CVTXTNT2+117                                             05226000
CVTRV477 EQU   CVTXTNT2+116                                             05227000
CVTRV476 EQU   CVTXTNT2+115                                             05228000
CVTRV475 EQU   CVTXTNT2+114                                             05229000
CVTRV474 EQU   CVTRV466                                                 05230000
CVTRV473 EQU   CVTRV466                                                 05231000
CVTRV472 EQU   CVTRV466                                                 05232000
CVTRV471 EQU   CVTRV466                                                 05233000
CVTRV470 EQU   CVTRV466                                                 05234000
CVTRV469 EQU   CVTRV466                                                 05235000
CVTRV468 EQU   CVTRV466                                                 05236000
CVTRV467 EQU   CVTRV466                                                 05237000
CVTRV465 EQU   CVTRV457                                                 05238000
CVTRV464 EQU   CVTRV457                                                 05239000
CVTRV463 EQU   CVTRV457                                                 05240000
CVTRV462 EQU   CVTRV457                                                 05241000
CVTRV461 EQU   CVTRV457                                                 05242000
CVTRV460 EQU   CVTRV457                                                 05243000
CVTRV459 EQU   CVTRV457                                                 05244000
CVTRV458 EQU   CVTRV457                                                 05245000
CVTRV456 EQU   CVTXTNT2+108                                             05246000
CVTRV455 EQU   CVTXTNT2+104                                             05247000
CVTRV454 EQU   CVTXTNT2+100                                             05248000
CVTRV453 EQU   CVTXTNT2+96                                              05249000
CVTRV452 EQU   CVTXTNT2+94                                              05250000
CVTRV451 EQU   CVTXTNT2+92                                              05251000
CVTRV450 EQU   CVTXTNT2+90                                              05252000
CVTRV449 EQU   CVTXTNT2+88                                              05253000
CVTRV448 EQU   CVTXTNT2+87                                              05254000
CVTRV447 EQU   CVTXTNT2+86                                              05255000
CVTRV446 EQU   CVTRV438                                                 05256000
CVTRV445 EQU   CVTRV438                                                 05257000
CVTRV444 EQU   CVTRV438                                                 05258000
CVTRV443 EQU   CVTRV438                                                 05259000
CVTRV442 EQU   CVTRV438                                                 05260000
CVTRV441 EQU   CVTRV438                                                 05261000
CVTRV440 EQU   CVTRV438                                                 05262000
CVTRV439 EQU   CVTRV438                                                 05263000
CVTRV437 EQU   CVTRV429                                                 05264000
CVTRV436 EQU   CVTRV429                                                 05265000
CVTRV435 EQU   CVTRV429                                                 05266000
CVTRV434 EQU   CVTRV429                                                 05267000
CVTRV433 EQU   CVTRV429                                                 05268000
CVTRV432 EQU   CVTRV429                                                 05269000
CVTRV431 EQU   CVTRV429                                                 05270000
CVTRV430 EQU   CVTRV429                                                 05271000
CVTRV428 EQU   CVTXTNT2+80                                              05272000
CVTRV427 EQU   CVTXTNT2+76                                              05273000
CVTRV426 EQU   CVTXTNT2+72                                              05274000
CVTRV425 EQU   CVTXTNT2+68                                              05275000
CVTATACT EQU   CVTATCVT                                                 05276000
CVTRV423 EQU   CVTXTNT2+62                                              05277000
CVTRV422 EQU   CVTXTNT2+60                                              05278000
CVTRV421 EQU   CVTXTNT2+58                                              05279000
CVTRV420 EQU   CVTXTNT2+56                                              05280000
CVTRV419 EQU   CVTXTNT2+55                                              05281000
CVTRV418 EQU   CVTXTNT2+54                                              05282000
CVTRV417 EQU   CVTRV409                                                 05283000
CVTRV416 EQU   CVTRV409                                                 05284000
CVTRV415 EQU   CVTRV409                                                 05285000
CVTRV414 EQU   CVTRV409                                                 05286000
CVTRV413 EQU   CVTRV409                                                 05287000
CVTRV412 EQU   CVTRV409                                                 05288000
CVTRV411 EQU   CVTRV409                                                 05289000
CVTRV410 EQU   CVTRV409                                                 05290000
CVTRV408 EQU   CVTRV400                                                 05291000
CVTRV407 EQU   CVTRV400                                                 05292000
CVTRV406 EQU   CVTRV400                                                 05293000
CVTRV405 EQU   CVTRV400                                                 05294000
CVTRV404 EQU   CVTRV400                                                 05295000
CVTRV403 EQU   CVTRV400                                                 05296000
CVTRV402 EQU   CVTRV400                                                 05297000
CVTRV401 EQU   CVTRV400                                                 05298000
CVTICB   EQU   CVTXTNT2+48                                              05299000
CVTSKTA  EQU   CVTXTNT2+44                                              05300000
CVTCCVT  EQU   CVTXTNT2+40                                              05301000
CVTRSV98 EQU   CVTXTNT2+36                                              05302000
CVTRSV97 EQU   CVTXTNT2+34                                              05303000
CVTRSV96 EQU   CVTXTNT2+32                                              05304000
CVTOLTEP EQU   CVTXTNT2+28                                              05305000
CVTQIDA  EQU   CVTQID+1                                                 05306000
CVTRSV95 EQU   CVTQID                                                   05307000
CVTRSV94 EQU   CVTXTNT2+20                                              05308000
CVTRSV93 EQU   CVTXTNT2+16                                              05309000
CVTRSV92 EQU   CVTXTNT2+12                                              05310000
CVTDEBVR EQU   CVTXTNT2+8                                               05311000
CVTRSV91 EQU   CVTXTNT2+6                                               05312000
CVTRSV9H EQU   CVTFLGBT                                                 05313000
CVTRSV9G EQU   CVTFLGBT                                                 05314000
CVTRSV9F EQU   CVTFLGBT                                                 05315000
CVTRSV9E EQU   CVTFLGBT                                                 05316000
CVTRSV9D EQU   CVTFLGBT                                                 05317000
CVTRSV9C EQU   CVTFLGBT                                                 05318000
CVTVME   EQU   CVTFLGBT                                                 05319000
CVTNPE   EQU   CVTFLGBT                                                 05320000
CVTNUCLS EQU   CVTXTNT2+4                                               05321000
CVTDSSVA EQU   CVTDSSV+1                                                05322000
CVTRSV89 EQU   CVTDSSV                                                  05323000
CVTRSV88 EQU   CVTXTNT1+8                                               05324000
CVTRSV87 EQU   CVTXTNT1+4                                               05325000
CVTFACHN EQU   CVTXTNT1                                                 05326000
CVTRV488 EQU   CVTMAP+412                                               05327000
CVTRV487 EQU   CVTMAP+408                                               05328000
CVTRV486 EQU   CVTMAP+404                                               05329000
CVTRV485 EQU   CVTMAP+400                                               05330000
CVTACTAP EQU   CVTMAP+396                                               05331000
CVTAUTH  EQU   CVTMAP+392                                               05332000
CVTATMCA EQU   CVTATMCT+1                                               05333000
CVTATMST EQU   CVTATMCT                                                 05334000
CVTRSV61 EQU   CVTMAP+384                                               05335000
CVTVOLT1 EQU   CVTVOLM1+1                                               05336000
CVTVOLI1 EQU   CVTVOLF1                                                 05337000
CVTSTOA  EQU   CVTMAP+376                                               05338000
CVTRSV58 EQU   CVTMAP+374                                               05339000
CVTRSV57 EQU   CVTMAP+372                                               05340000
CVTDDCE  EQU   CVTMAP+368                                               05341000
CVTPNWFR EQU   CVTMAP+364                                               05342000
CVTSMF   EQU   CVTMAP+360                                               05343000
CVTSULK  EQU   CVTMAP+358                                               05344000
CVTSLKO  EQU   CVTSYSK                                                  05345000
CVTSLKP  EQU   CVTSYSK                                                  05346000
CVTSLKQ  EQU   CVTSYSK                                                  05347000
CVTSLKR  EQU   CVTSYSK                                                  05348000
CVTRSV56 EQU   CVTSYSK                                                  05349000
CVTRSV55 EQU   CVTSYSK                                                  05350000
CVTRSV54 EQU   CVTSYSK                                                  05351000
CVTRSV53 EQU   CVTSYSK                                                  05352000
CVTRSV52 EQU   CVTA1F1                                                  05353000
CVTRSV51 EQU   CVTA1F1                                                  05354000
CVTRSV50 EQU   CVTA1F1                                                  05355000
CVTRSV49 EQU   CVTA1F1                                                  05356000
CVTRSV48 EQU   CVTA1F1                                                  05357000
CVTRSV47 EQU   CVTA1F1                                                  05358000
CVTSRSW  EQU   CVTA1F1                                                  05359000
CVTPFSW  EQU   CVTA1F1                                                  05360000
CVTPCVT  EQU   CVTMAP+352                                               05361000
CVTRSV46 EQU   CVTMAP+344                                               05362000
CVTRSV45 EQU   CVTMAP+340                                               05363000
CVTRSV44 EQU   CVTMAP+338                                               05364000
CVTRSV43 EQU   CVTMAP+336                                               05365000
CVTHJESA EQU   CVTHJES+1                                                05366000
CVTRSV42 EQU   CVTHJES                                                  05367000
CVTEXT2A EQU   CVTEXT2+1                                                05368000
CVTRSV41 EQU   CVTEXT2                                                  05369000
CVTAPFA  EQU   CVTAPF+1                                                 05370000
CVTRSV40 EQU   CVTAPF                                                   05371000
CVTRV518 EQU   CVTINTLA                                                 05372000
CVTRV517 EQU   CVTERPV                                                  05373000
CVTEORM  EQU   CVTMAP+312                                               05374000
CVTMCHPR EQU   CVTMAP+308                                               05375000
CVTTZ    EQU   CVTMAP+304                                               05376000
CVTJEPS  EQU   CVTMAP+300                                               05377000
CVTMODE  EQU   CVTMAP+292                                               05378000
CVTPTRV  EQU   CVTMAP+288                                               05379000
CVTREAL  EQU   CVTMAP+284                                               05380000
CVTRSV39 EQU   CVTMAP+280                                               05381000
CVTRSV38 EQU   CVTMAP+276                                               05382000
CVTDMSRA EQU   CVTDMSR+1                                                05383000
CVTRV634 EQU   CVTDMSRF                                                 05384000
CVTRV633 EQU   CVTDMSRF                                                 05385000
CVTRV632 EQU   CVTDMSRF                                                 05386000
CVTRV631 EQU   CVTDMSRF                                                 05387000
CVTRV630 EQU   CVTDMSRF                                                 05388000
CVTRV629 EQU   CVTDMSRF                                                 05389000
CVTUDUMP EQU   CVTDMSRF                                                 05390000
CVTSDUMP EQU   CVTDMSRF                                                 05391000
CVTQMSGA EQU   CVTQMSG+1                                                05392000
CVTRSV36 EQU   CVTQMSG                                                  05393000
CVTAMFF  EQU   CVTMAP+264                                               05394000
CVTPURGA EQU   CVTPURG+1                                                05395000
CVTRSV35 EQU   CVTPURG                                                  05396000
CVTCBSP  EQU   CVTMAP+256                                               05397000
CVTATERA EQU   CVTATER+1                                                05398000
CVTSYST  EQU   CVTATER                                                  05399000
CVTVOLT2 EQU   CVTTAT                                                   05400000
CVTVOLI2 EQU   CVTVOLF2                                                 05401000
CVTAQAVB EQU   CVTAQAVT+1                                               05402000
CVTRSV34 EQU   CVTTCMFG                                                 05403000
CVTRSV33 EQU   CVTTCMFG                                                 05404000
CVTRSV32 EQU   CVTTCMFG                                                 05405000
CVTRSV31 EQU   CVTTCMFG                                                 05406000
CVTRSV30 EQU   CVTTCMFG                                                 05407000
CVTRSV29 EQU   CVTTCMFG                                                 05408000
CVTRSV28 EQU   CVTTCMFG                                                 05409000
CVTTCRDY EQU   CVTTCMFG                                                 05410000
CVTGTFA  EQU   CVTGTF+1                                                 05411000
CVTRSV27 EQU   CVTGTFST                                                 05412000
CVTRNIO  EQU   CVTGTFST                                                 05413000
CVTUSR   EQU   CVTGTFST                                                 05414000
CVTRV318 EQU   CVTFORM                                                  05415000
CVTRV317 EQU   CVTTMODE                                                 05416000
CVTRV316 EQU   CVTSTATE                                                 05417000
CVTRV315 EQU   CVTGTFS                                                  05418000
CVTGTFAV EQU   CVTGTFS                                                  05419000
CVT0SCR1 EQU   CVTMAP+232                                               05420000
CVTRV515 EQU   CVTMAP+228                                               05421000
CVTRMS   EQU   CVTMAP+224                                               05422000
CVTPATCH EQU   CVTMAP+220                                               05423000
CVTTSCE  EQU   CVTMAP+216                                               05424000
CVTLNKSC EQU   CVTMAP+214                                               05425000
CVTQABST EQU   CVTMAP+212                                               05426000
CVTMDLDS EQU   CVTMAP+208                                               05427000
CVTUSER  EQU   CVTMAP+204                                               05428000
CVTABEND EQU   CVTMAP+200                                               05429000
CVTSMCA  EQU   CVTMAP+196                                               05430000
CVTRSV18 EQU   CVTMAP+192                                               05431000
CVTQLPAQ EQU   CVTMAP+188                                               05432000
CVTQCDSR EQU   CVTMAP+184                                               05433000
CVTRSV17 EQU   CVTOPTB                                                  05434000
CVTRSV16 EQU   CVTOPTB                                                  05435000
CVTFP    EQU   CVTOPTB                                                  05436000
CVTAPTHR EQU   CVTOPTB                                                  05437000
CVTNLOG  EQU   CVTOPTB                                                  05438000
CVTTOD   EQU   CVTOPTB                                                  05439000
CVTCTIMS EQU   CVTOPTB                                                  05440000
CVTPROT  EQU   CVTOPTB                                                  05441000
CVTXPFP  EQU   CVTOPTA                                                  05442000
CVTASCII EQU   CVTOPTA                                                  05443000
CVTRSV13 EQU   CVTOPTA                                                  05444000
CVTRSV12 EQU   CVTOPTA                                                  05445000
CVTNIP   EQU   CVTOPTA                                                  05446000
CVTDDR   EQU   CVTOPTA                                                  05447000
CVTAPR   EQU   CVTOPTA                                                  05448000
CVTCCH   EQU   CVTOPTA                                                  05449000
CVTSNCTR EQU   CVTMAP+180                                               05450000
CVTQMWR  EQU   CVTMAP+176                                               05451000
CVTQOCR  EQU   CVTMAP+172                                               05452000
CVT1EF00 EQU   CVTMAP+168                                               05453000
CVTMZ00  EQU   CVTMAP+164                                               05454000
CVTSV76Q EQU   CVTSV76C                                                 05455000
CVTRSV11 EQU   CVTMAP+156                                               05456000
CVT0PT01 EQU   CVTMAP+152                                               05457000
CVTRV516 EQU   CVTIERLC                                                 05458000
CVTILCH  EQU   CVTMAP+140                                               05459000
CVT0DS   EQU   CVTMAP+136                                               05460000
CVTFBOSV EQU   CVTMAP+132                                               05461000
CVTNUCB  EQU   CVTMAP+128                                               05462000
CVTIXAVL EQU   CVTMAP+124                                               05463000
CVTSV76M EQU   CVTIOQET                                                 05464000
CVTDCBA  EQU   CVTMAP+117                                               05465000
CVTMVS2  EQU   CVTDCB                                                   05466000
CVT6DAT  EQU   CVTDCB                                                   05467000
CVT4MPS  EQU   CVTDCB                                                   05468000
CVTRSV09 EQU   CVTDCB                                                   05469000
CVT4MS1  EQU   CVTDCB                                                   05470000
CVT2SPS  EQU   CVTDCB                                                   05471000
CVT1SSS  EQU   CVTDCB                                                   05472000
CVTRSV08 EQU   CVTDCB                                                   05473000
CVTSTB   EQU   CVTMAP+112                                               05474000
CVTQTD00 EQU   CVTMAP+108                                               05475000
CVTQTE00 EQU   CVTMAP+104                                               05476000
CVTCUCB  EQU   CVTMAP+100                                               05477000
CVTSJQ   EQU   CVTMAP+96                                                05478000
CVTPBLDL EQU   CVTMAP+92                                                05479000
CVTTPC   EQU   CVTMAP+88                                                05480000
CVTSVDCB EQU   CVTMAP+84                                                05481000
CVTBRET  EQU   CVTMAP+82                                                05482000
CVTEXIT  EQU   CVTMAP+80                                                05483000
CVT0FN00 EQU   CVTMAP+76                                                05484000
CVTDARA  EQU   CVTDAR+1                                                 05485000
CVTRSV07 EQU   CVTFLGS1                                                 05486000
CVTRSV06 EQU   CVTFLGS1                                                 05487000
CVTRSV05 EQU   CVTFLGS1                                                 05488000
CVTRSV04 EQU   CVTFLGS1                                                 05489000
CVTRSV03 EQU   CVTFLGS1                                                 05490000
CVTRSV02 EQU   CVTFLGS1                                                 05491000
CVTRSV01 EQU   CVTFLGS1                                                 05492000
CVTDMPLK EQU   CVTFLGS1                                                 05493000
CVTXITP  EQU   CVTMAP+68                                                05494000
CVTZDTAB EQU   CVTMAP+64                                                05495000
CVTMSLT  EQU   CVTMAP+60                                                05496000
CVTDATE  EQU   CVTMAP+56                                                05497000
CVTBTERM EQU   CVTMAP+52                                                05498000
CVTSYSAD EQU   CVTMAP+48                                                05499000
CVTXTLER EQU   CVTMAP+44                                                05500000
CVTILK1  EQU   CVTMAP+36                                                05501000
CVTPRLTV EQU   CVTMAP+32                                                05502000
CVTPCNVT EQU   CVTMAP+28                                                05503000
CVT0VL00 EQU   CVTMAP+24                                                05504000
CVTXAPG  EQU   CVTMAP+20                                                05505000
CVTBUF   EQU   CVTMAP+16                                                05506000
CVTJOB   EQU   CVTMAP+12                                                05507000
CVTLINK  EQU   CVTMAP+8                                                 05508000
CVT0EF00 EQU   CVTMAP+4                                                 05509000
CVTTCBP  EQU   CVTMAP                                                   05510000
CVT      EQU   CVTMAP                                                   05511000
PROTTUP  EQU   KEYTABLE+384                                             05512000
SSPRMTUP EQU   KEYTABLE+380                                             05513000
SSNMTUP  EQU   KEYTABLE+376                                             05514000
MSVGPTUP EQU   KEYTABLE+372                                             05515000
RTVOLTUP EQU   KEYTABLE+368                                             05516000
SSREQTUP EQU   KEYTABLE+364                                             05517000
FRIDTUP  EQU   KEYTABLE+360                                             05518000
FUNCTUP  EQU   KEYTABLE+356                                             05519000
SHOLDTUP EQU   KEYTABLE+352                                             05520000
SUSERTUP EQU   KEYTABLE+348                                             05521000
RTDSNTUP EQU   KEYTABLE+340                                             05522000
RTDDNTUP EQU   KEYTABLE+336                                             05523000
DIAGNTUP EQU   KEYTABLE+332                                             05524000
IPLTXTUP EQU   KEYTABLE+320                                             05525000
TRTCHTUP EQU   KEYTABLE+312                                             05526000
THRSHTUP EQU   KEYTABLE+308                                             05527000
STACKTUP EQU   KEYTABLE+304                                             05528000
SOWATUP  EQU   KEYTABLE+300                                             05529000
RSRVSTUP EQU   KEYTABLE+296                                             05530000
RSRVFTUP EQU   KEYTABLE+292                                             05531000
RECFMTUP EQU   KEYTABLE+288                                             05532000
PRTSPTUP EQU   KEYTABLE+284                                             05533000
PCISTUP  EQU   KEYTABLE+280                                             05534000
PCIRTUP  EQU   KEYTABLE+276                                             05535000
OPTCDTUP EQU   KEYTABLE+272                                             05536000
NCPTUP   EQU   KEYTABLE+268                                             05537000
MODETUP  EQU   KEYTABLE+264                                             05538000
LRECLTUP EQU   KEYTABLE+260                                             05539000
LIMCTTUP EQU   KEYTABLE+256                                             05540000
KYLENTUP EQU   KEYTABLE+252                                             05541000
INTVLTUP EQU   KEYTABLE+248                                             05542000
GNCPTUP  EQU   KEYTABLE+244                                             05543000
EROPTTUP EQU   KEYTABLE+240                                             05544000
DSORGTUP EQU   KEYTABLE+236                                             05545000
DENTUP   EQU   KEYTABLE+232                                             05546000
CPRITUP  EQU   KEYTABLE+228                                             05547000
CODETUP  EQU   KEYTABLE+224                                             05548000
BUFSZTUP EQU   KEYTABLE+220                                             05549000
BUFRQTUP EQU   KEYTABLE+216                                             05550000
BUFOUTUP EQU   KEYTABLE+212                                             05551000
BUFOFTUP EQU   KEYTABLE+208                                             05552000
BUFNOTUP EQU   KEYTABLE+204                                             05553000
BUFMXTUP EQU   KEYTABLE+200                                             05554000
BUFLTUP  EQU   KEYTABLE+196                                             05555000
BUFINTUP EQU   KEYTABLE+192                                             05556000
BLKSZTUP EQU   KEYTABLE+188                                             05557000
BFTEKTUP EQU   KEYTABLE+184                                             05558000
BFALNTUP EQU   KEYTABLE+180                                             05559000
DCBDDTUP EQU   KEYTABLE+176                                             05560000
DCBDSTUP EQU   KEYTABLE+172                                             05561000
UVRFYTUP EQU   KEYTABLE+168                                             05562000
UFOLDTUP EQU   KEYTABLE+164                                             05563000
UCSTUP   EQU   KEYTABLE+160                                             05564000
TERMTUP  EQU   KEYTABLE+156                                             05565000
QNAMETUP EQU   KEYTABLE+152                                             05566000
FCBAVTUP EQU   KEYTABLE+148                                             05567000
FCBIMTUP EQU   KEYTABLE+144                                             05568000
DUMMYTUP EQU   KEYTABLE+140                                             05569000
RETPDTUP EQU   KEYTABLE+136                                             05570000
EXPDTTUP EQU   KEYTABLE+132                                             05571000
INOUTTUP EQU   KEYTABLE+128                                             05572000
PASPRTUP EQU   KEYTABLE+124                                             05573000
DSSEQTUP EQU   KEYTABLE+120                                             05574000
LABELTUP EQU   KEYTABLE+116                                             05575000
COPYSTUP EQU   KEYTABLE+112                                             05576000
CLOSETUP EQU   KEYTABLE+108                                             05577000
OUTLMTUP EQU   KEYTABLE+104                                             05578000
SFMNOTUP EQU   KEYTABLE+100                                             05579000
SPGNMTUP EQU   KEYTABLE+96                                              05580000
SYSOUTUP EQU   KEYTABLE+92                                              05581000
PARALTUP EQU   KEYTABLE+88                                              05582000
UNCNTTUP EQU   KEYTABLE+84                                              05583000
VLRDSTUP EQU   KEYTABLE+76                                              05584000
VLCNTTUP EQU   KEYTABLE+72                                              05585000
VLSEQTUP EQU   KEYTABLE+68                                              05586000
PRIVTTUP EQU   KEYTABLE+64                                              05587000
VLSERTUP EQU   KEYTABLE+60                                              05588000
DIRTUP   EQU   KEYTABLE+44                                              05589000
BLKLNTUP EQU   KEYTABLE+32                                              05590000
CYLTUP   EQU   KEYTABLE+28                                              05591000
TRKTUP   EQU   KEYTABLE+24                                              05592000
CDISPTUP EQU   KEYTABLE+20                                              05593000
NDISPTUP EQU   KEYTABLE+16                                              05594000
STATSTUP EQU   KEYTABLE+12                                              05595000
MEMBRTUP EQU   KEYTABLE+8                                               05596000
DDNAMTUP EQU   KEYTABLE                                                 05597000
TEXTUPRM EQU   TEXTUFLD+2                                               05598000
TEXTULEN EQU   TEXTUFLD                                                 05599000
TEXTUNUM EQU   TEXTUNIT+2                                               05600000
TEXTUKEY EQU   TEXTUNIT                                                 05601000
TXTPLEND EQU   TXTPLENT                                                 05602000
TXTUPEND EQU   TXTUNITP                                                 05603000
CMOSYOUT EQU   CMUNRB+13                                                05604000
CMOUNCAT EQU   CMODISP                                                  05605000
CMOCATLG EQU   CMODISP                                                  05606000
CMODEL   EQU   CMODISP                                                  05607000
CMOKEEP  EQU   CMODISP                                                  05608000
@NM00034 EQU   CMODISP                                                  05609000
@NM00033 EQU   CMRBBYT4                                                 05610000
@NM00032 EQU   CMRBBYT4                                                 05611000
CMNODEN  EQU   CMRBBYT4                                                 05612000
CMSSERR  EQU   CMRBBYT4                                                 05613000
CMSSIERR EQU   CMRBBYT4                                                 05614000
CMSCRERR EQU   CMRBBYT4                                                 05615000
@NM00031 EQU   CMRBBYT3                                                 05616000
CMSSKEEP EQU   CMRBBYT3                                                 05617000
CMNOHOLD EQU   CMRBBYT3                                                 05618000
CMOVSYOT EQU   CMRBBYT3                                                 05619000
CMWAIT   EQU   CMRBBYT3                                                 05620000
CMDYNUNA EQU   CMRBBYT3                                                 05621000
CMHOLD   EQU   CMRBBYT3                                                 05622000
CMDEL    EQU   CMRBBYT3                                                 05623000
@NM00030 EQU   CMRBBYT2                                                 05624000
@NM00029 EQU   CMRBBYT2                                                 05625000
@NM00028 EQU   CMRBBYT2                                                 05626000
CMSETPRV EQU   CMRBBYT2                                                 05627000
CMCKDAVL EQU   CMRBBYT2                                                 05628000
CMCKAVOL EQU   CMRBBYT2                                                 05629000
CMCHKUN  EQU   CMRBBYT2                                                 05630000
CMNODSR  EQU   CMRBBYT2                                                 05631000
@NM00027 EQU   CMRBBYT1                                                 05632000
CMINVUCB EQU   CMRBBYT1                                                 05633000
CMOUSRID EQU   CMRBBYT1                                                 05634000
CMORDISP EQU   CMRBBYT1                                                 05635000
CMCNDISP EQU   CMRBBYT1                                                 05636000
CMNODISP EQU   CMRBBYT1                                                 05637000
CMNRBPTR EQU   CMUNRB                                                   05638000
@NM00026 EQU   CMFMBYT4                                                 05639000
@NM00025 EQU   CMFMBYT4                                                 05640000
@NM00024 EQU   CMFMBYT4                                                 05641000
@NM00023 EQU   CMFMBYT4                                                 05642000
@NM00022 EQU   CMFMBYT4                                                 05643000
@NM00021 EQU   CMFMBYT4                                                 05644000
CMALSTCT EQU   CMFMBYT4                                                 05645000
CMLSTCJS EQU   CMFMBYT4                                                 05646000
CMJES3   EQU   CMFMBYT3                                                 05647000
@NM00020 EQU   CMFMBYT3                                                 05648000
@NM00019 EQU   CMFMBYT3                                                 05649000
CMSPSCR  EQU   CMFMBYT3                                                 05650000
CMPUBPRV EQU   CMFMBYT3                                                 05651000
CMSCRVL1 EQU   CMFMBYT3                                                 05652000
CMNOSMF  EQU   CMFMBYT3                                                 05653000
CMDSRALL EQU   CMFMBYT3                                                 05654000
CMPURGE  EQU   CMFMBYT2                                                 05655000
CMNERMSG EQU   CMFMBYT2                                                 05656000
CMRDDENT EQU   CMFMBYT2                                                 05657000
CMGENDEQ EQU   CMFMBYT2                                                 05658000
CMCHATTR EQU   CMFMBYT2                                                 05659000
CMNOVUT  EQU   CMFMBYT2                                                 05660000
CMNOPOST EQU   CMFMBYT2                                                 05661000
CMFDSABS EQU   CMFMBYT1                                                 05662000
CMVLRLSE EQU   CMFMBYT1                                                 05663000
CMUNUNIT EQU   CMFMBYT1                                                 05664000
CMDSRLSE EQU   CMFMBYT1                                                 05665000
CMDPCATS EQU   CMFMBYT1                                                 05666000
CMMNSTAT EQU   CMFMBYT1                                                 05667000
CMDMSGS  EQU   CMFMBYT1                                                 05668000
TIOMIUSL EQU   TIOMGRRB+36                                              05669000
TIOMPSNP EQU   TIOMGRRB+32                                              05670000
TIOMRETP EQU   TIOMGRRB+28                                              05671000
TIOMSIOP EQU   TIOMGRRB+24                                              05672000
TIOMENTP EQU   TIOMGRRB+16                                              05673000
TIOMSNMP EQU   TIOMGRRB+12                                              05674000
TIOMJNMP EQU   TIOMGRRB+8                                               05675000
@NM00018 EQU   TIOMFMAP+1                                               05676000
@NM00017 EQU   TIOMFMAP+1                                               05677000
@NM00016 EQU   TIOMFMAP+1                                               05678000
@NM00015 EQU   TIOMFMAP+1                                               05679000
@NM00014 EQU   TIOMFMAP+1                                               05680000
@NM00013 EQU   TIOMFMAP+1                                               05681000
@NM00012 EQU   TIOMFMAP+1                                               05682000
TIOMRENT EQU   TIOMFMAP+1                                               05683000
TIOMFREE EQU   TIOMFMAP                                                 05684000
TIOMUNAL EQU   TIOMFMAP                                                 05685000
TIOMUPD  EQU   TIOMFMAP                                                 05686000
TIOMRLSE EQU   TIOMFMAP                                                 05687000
TIOMALOC EQU   TIOMFMAP                                                 05688000
@NM00011 EQU   TIOMFMAP                                                 05689000
TIOMBLD  EQU   TIOMFMAP                                                 05690000
EXTRACAL EQU   FUNCMAP+1                                                05691000
ALCSUBWT EQU   WAITOKSW                                                 05692000
ALCHDMSG EQU   HDRMSGSW                                                 05693000
ALCSSMSG EQU   SSEMSGSW                                                 05694000
ALCGENER EQU   GENLOKSW                                                 05695000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      05696000
@RF00404 EQU   @RC00400                                                 05697000
@RF00457 EQU   @RC00454                                                 05698000
@RF00574 EQU   @RC00545                                                 05699000
@RC00627 EQU   @EL00002                                                 05700000
@RC00621 EQU   @EL00002                                                 05701000
@RF00638 EQU   @EL00002                                                 05702000
@RF00624 EQU   @RC00621                                                 05703000
@ENDDATA EQU   *                                                        05704000
         END   IEFDB413,(C'PLS1520',0701,78089)                         05705000
