         TITLE 'IEFDB400 - DYNAMIC ALLOCATION (SVC 99) CONTROL         *00001000
                        '                                               00002000
IEFDB400 CSECT ,                                                01S0001 00003000
IGC0009I DS    0H                                               01S0001 00004000
         ENTRY IGC0009I                                                 00005000
@MAINENT BALR  @15,0                                            01S0001 00006000
         USING *,@15                                            01S0001 00007000
         B     @PROLOG                                          01S0001 00008000
         DC    AL2(@EP00001-@MAINENT-2)                                 00009000
         DC    AL1(16)                                          01S0001 00010000
         DC    C'IEFDB400  78.089'                              01S0001 00011000
         DROP  @15                                                      00012000
@PROLOG  BALR  @12,0                                            01S0001 00013000
@PSTART  DS    0H                                               01S0001 00014000
         USING @PSTART,@12                                      01S0001 00015000
         LR    @09,@15                                          01S0001 00016000
         LR    @06,@01                                          01S0001 00017000
         L     @00,@SIZDATD                                     01S0001 00018000
         MODESET EXTKEY=SCHED,SAVEKEY=(2)                               00019000
         GSPACE   R,LV=(0)                                              00020000
         LR    @11,@01                                          01S0001 00021000
         USING @DATD,@11                                        01S0001 00022000
         LR    @15,@09                                          01S0001 00023000
         LR    @01,@06                                          01S0001 00024000
         ST    @13,@SA00001+4                                   01S0001 00025000
         STC   @02,@OLDKEY                                      01S0001 00026000
         LR    @13,@11                                          01S0001 00027000
         AH    @15,4(,@15)                                      01S0001 00028000
         BR    @15                                              01S0001 00029000
@EP00001 DS    0H                                               01S0001 00030000
         MODESET EXTKEY=ZERO                                            00031000
         MVC   @PC00001(4),0(@01)                               01S0001 00032000
         MODESET EXTKEY=SCHED                                           00033000
JSCBDISP EQU 188                                                        00034000
JSCBAOS1 EQU  72                                                        00035000
JSCBAOS2 EQU 192                                                        00036000
RBPRFXLN EQU 64                                                         00037000
RBPRFLNA EQU 32                                                         00038000
PRBLEN   EQU 136                                                        00039000
SIRBLEN  EQU 200                                                        00040000
TIRBLEN  EQU 136                                                        00041000
IRBLEN   EQU 128                                                        00042000
SVRBLEN  EQU 200                                                        00043000
*                                         ERROR              @G29AN2F*/ 00044000
*INPPARM  = R1;                        /* SAVE INCOMING PARM LIST PTR*/ 00045000
         LR    INPPARM,R1                                       01S0099 00046000
*RETCODE  = RETCOD0;                   /* INITIALIZE R15 RETN CODE   */ 00047000
         SLR   @09,@09                                          01S0100 00048000
         ST    @09,RETCODE                                      01S0100 00049000
*SWITCHES = SWITCHES && SWITCHES;      /* INIT CONTROL SWITCHES      */ 00050000
         XC    SWITCHES(1),SWITCHES                             01S0101 00051000
*ALFNCMAP = ALFNCMAP && ALFNCMAP;      /* INIT ALLOC. FUNC. MAP      */ 00052000
         XC    ALFNCMAP(8),ALFNCMAP                             01S0102 00053000
*SMFPARMS = SMFPARMS && SMFPARMS;      /*INIT SMF INFO       @ZA02706*/ 00054000
         XC    SMFPARMS(8),SMFPARMS                             01S0103 00055000
*DEPARMS(1:256) = DEPARMS(1:256) && DEPARMS(1:256);             01S0104 00056000
         XC    DEPARMS(256),DEPARMS                             01S0104 00057000
*DEPARMS(257:LENGTH(DEPARMS)) = DEPARMS(257:LENGTH(DEPARMS))    01S0105 00058000
*     && DEPARMS(257:LENGTH(DEPARMS)); /* ZERO ESTAE EXIT PARMS      */ 00059000
         XC    DEPARMS+256(52),DEPARMS+256                      01S0105 00060000
*DEALFMAP = ADDR(ALFNCMAP);            /* PASS TO ESTAE EXIT         */ 00061000
         LA    @09,ALFNCMAP                                     01S0106 00062000
         ST    @09,DEALFMAP                                     01S0106 00063000
*DEWLASTP = ADDR(DEDMYEPA);            /*INIT PTR TO DUMMY LAST EPA  */ 00064000
         LA    @09,DEDMYEPA                                     01S0107 00065000
         ST    @09,DEWLASTP                                     01S0107 00066000
*DEALASTP = ADDR(DEDMYAS);             /*SAME FOR ASSIGNED CHAIN     */ 00067000
         LA    @09,DEDMYAS                                      01S0108 00068000
         ST    @09,DEALASTP                                     01S0108 00069000
*LSTJSCBP = JSCBACT;                   /* PTR TO ACTIVE JSCB         */ 00070000
         L     @09,TCBJSCB(,TCBPTR)                             01S0109 00071000
         L     @09,JSCBACT(,@09)                                01S0109 00072000
         ST    @09,LSTJSCBP                                     01S0109 00073000
*DEJSCB   = JSCBACT;                   /* SAME INTO ESTAE EXIT PARMS */ 00074000
         ST    @09,DEJSCB                                       01S0110 00075000
*RFY IEZJSCB BASED(LSTJSCBP);          /*FOR FUTURE REFERENCES       */ 00076000
*LSTASCBP = ASCBPTR;                   /* PTR TO ASCB                */ 00077000
         ST    ASCBPTR,LSTASCBP                                 01S0112 00078000
*LSTTCBP  = TCBPTR;                    /* PTR TO TCB                 */ 00079000
         ST    TCBPTR,LSTTCBP                                   01S0113 00080000
*DETCB = TCBPTR;                       /* CURRENT TCB PTR FOR ESTAE     00081000
*                                                            #YM03580*/ 00082000
*                                                               01S0114 00083000
         ST    TCBPTR,DETCB                                     01S0114 00084000
*RFY (R15) RSTD;                       /*                    @Z40FPPG*/ 00085000
*R15 = 0;                              /* INIT RETURN CODE   @Z40FPPG*/ 00086000
         SLR   R15,R15                                          01S0116 00087000
*/********************************************************************/ 00088000
*/*                                                          @Z40FPPG*/ 00089000
*/* SEGMENT NAME - ESTAECOD                                  @Z40FPPG*/ 00090000
*/*                                                          @Z40FPPG*/ 00091000
*/* DESCRIPTIVE NAME - ESTAE CODE                            @Z40FPPG*/ 00092000
*/*                                                          @Z40FPPG*/ 00093000
*/* FUNCTION - SET UP THE APPROPRIATE ESTAE ENVIRONMENT      @Z40FPPG*/ 00094000
*/*                                                          @Z40FPPG*/ 00095000
*/* OPERATION -                                              @Z40FPPG*/ 00096000
*/*          . AN ALLOCATION STAE WORK AREA (ASWA) IS FILLED @Z40FPPG*/ 00097000
*/*            IN. THIS ALLOWS THE ALLOCATION COMMON ESTAE   @Z40FPPG*/ 00098000
*/*            EXIT (IEFAB4ED) TO ROUTE CONTROL TO THE       @ZA18154*/ 00099000
*/*            APPROPRIATE EXIT ROUTINE  FOR SPECIFIC        @ZA18154*/ 00100000
*/*            RECOVERY PROCESSING.                          @Z40FPPG*/ 00101000
*/*          . AN ESTAE IS ALWAYS ISSUED AND AN ASWA ALWAYS  @ZA18154*/ 00102000
*/*            CREATED EACH TIME DYNAMIC ALLOCATION IS       @ZA18154*/ 00103000
*/*            INVOKED.  THE ASWA IS HOWEVER NEVER CHAINED   @ZA18154*/ 00104000
*/*            TO AN EXISTING ASWA CHAIN NOR TO JSCBASWA.    @ZA18154*/ 00105000
*/*            THIS IS DONE BECAUSE THERE IS NO WAY TO       @ZA18154*/ 00106000
*/*            SERIALIZE ON THIS CHAIN. THUS IF AN ERROR     @ZA18154*/ 00107000
*/*            OCCURS THE ESTAE ISSUED BY DYNAMIC ALLOCATION @ZA18154*/ 00108000
*/*            WILL RECEIVE CONTROL THROUGH PERCOLATION OR   @ZA18154*/ 00109000
*/*            AS A RESULT OF BEING THE LAST ESTAE ISSUED FOR@ZA18154*/ 00110000
*/*            THIS TASK. THE ASWA IS BUILT SO THAT IEFA4ED  @ZA18154*/ 00111000
*/*            CAN ROUTE CONTROL TO THE ESTAE EXIT(IEFDB402) @ZA18154*/ 00112000
*/*            AND PERFORM ITS OTHER NORMAL FUNCTIONS.       @ZA18154*/ 00113000
*/*            SINCE NO ASWA WILL BE CHAINED TO THE ASWA     @ZA18154*/ 00114000
*/*            CREATED BY THIS ROUTINE, ONLY IEFDB402 WILL   @ZA18154*/ 00115000
*/*            RECEIVE CONTROL. OTHER ASWA'A WILL BE         @ZA18154*/ 00116000
*/*            PROCESSED WHEN THE ESTAE UNDER WHICH THEY ARE @ZA18154*/ 00117000
*/*            PROTECTED IS PERCOLATED TO.                   @ZA18154*/ 00118000
*/*                                                          @Z40FPPG*/ 00119000
*/*                                                          @Z40FPPG*/ 00120000
*/* ENTRY - INLINE SUBROUTINE ENTERED AT THE TOP             @Z40FPPG*/ 00121000
*/*                                                          @Z40FPPG*/ 00122000
*/*   PURPOSE - SEE FUNCTION                                 @Z40FPPG*/ 00123000
*/*                                                          @Z40FPPG*/ 00124000
*/*   INPUT -                                                @Z40FPPG*/ 00125000
*/*        .R15 - RETURN CODE (ZERO ON ENTRY)                @Z40FPPG*/ 00126000
*/*        .DEPARMPTR - PTR TO ESTAE PARMS                   @Z40FPPG*/ 00127000
*/*        .TCBSTABB - PTR TO CURRENT STAE CONTROL BLOCK     @Z40FPPG*/ 00128000
*/*                                                          @Z40FPPG*/ 00129000
*/* EXIT - INLINE SUBROUTINE THAT EXITS AT THE BOTTOM        @Z40FPPG*/ 00130000
*/*                                                          @Z40FPPG*/ 00131000
*/*   CONDITION - ESTAE SETUP COMPLETED                      @Z40FPPG*/ 00132000
*/*                                                          @Z40FPPG*/ 00133000
*/*   OUTPUT -                                               @Z40FPPG*/ 00134000
*/*           .ASWA - FILLED IN                              @ZA18154*/ 00135000
*/*                                                          @Z40FPPG*/ 00136000
*/*   RETURN CODES - R15 HAS ESTAE RETURN CODE               @Z40FPPG*/ 00137000
*/*                                                          @Z40FPPG*/ 00138000
*/********************************************************************/ 00139000
*ASWAPTR = ADDR(ASWACORE);             /*ADDRESS ASWA CORE   @Z40FPPG*/ 00140000
         LA    ASWAPTR,ASWACORE                                 02S0117 00141000
*ASWA = ASWA && ASWA;                  /*ZERO OUT ASWA       @Z40FPPG*/ 00142000
         XC    ASWA(40,ASWAPTR),ASWA(ASWAPTR)                   02S0118 00143000
*ASWAID =CHARASWA;                     /*FILL IN BLOCK ID    @Z40FPPG*/ 00144000
         MVC   ASWAID(4,ASWAPTR),@CC00143                       02S0119 00145000
*ASWACSCT = EXITCSCT;                  /*CSECT NAME OF EXIT  @Z40FPPG*/ 00146000
         MVC   ASWACSCT(8,ASWAPTR),@CC00145                     02S0120 00147000
*ASWARTNP = ADDR(IEFDB402);            /*ADDRESS OF EXIT RTN @Z40FPPG*/ 00148000
         L     @14,@CV00120                                     02S0121 00149000
         STCM  @14,15,ASWARTNP(ASWAPTR)                         02S0121 00150000
*ASWAPRMS = ADDR(DEPARMS);             /*PARMS FOR THIS EXIT @Z40FPPG*/ 00151000
         LA    @14,DEPARMS                                      02S0122 00152000
         STCM  @14,15,ASWAPRMS(ASWAPTR)                         02S0122 00153000
*ASWADYNF = ON;                        /*CHECK PERCOLATION   @Z40FPPG*/ 00154000
*ASWADYUE = ON;                        /*CHECK USER ERROR    @Z40FPPG*/ 00155000
*ASWANOCH = ON;                        /*INDICATE ASWA NOT CHAINED      00156000
*                                        TO JSCB             @ZA18154*/ 00157000
         OI    ASWADYNF(ASWAPTR),B'10011000'                    02S0125 00158000
*ASWAAUTO = ADDR(AB4EDPMS);            /*1ST ASWA GIVES W/A  @Z40FPPG*/ 00159000
         LA    @14,AB4EDPMS                                     02S0126 00160000
         STCM  @14,15,ASWAAUTO(ASWAPTR)                         02S0126 00161000
*RFY (R2,R3) RSTD;                     /*RESTRICT WORK REGS  @Z40FPPG*/ 00162000
*R2 = ADDR(IEFAB4ED);                  /*COMMON ESTAE EXIT   @Z40FPPG*/ 00163000
         L     R2,@CV00121                                      02S0128 00164000
*R3 = ASWAPTR;                         /*ASWA IS EXIT PARMS  @Z40FPPG*/ 00165000
         LR    R3,ASWAPTR                                       02S0129 00166000
*MACWORK(1:ESTALEN) = ESTALIST(1:ESTALEN);                      02S0130 00167000
         L     @14,ESTALEN                                      02S0130 00168000
         BCTR  @14,0                                            02S0130 00169000
         EX    @14,@SM01827                                     02S0130 00170000
*                                      /*MOVE TO AUTO CORE   @Z40FPPG*/ 00171000
*GEN REFS(MACWORK) SETS(R15,TCBSTABB);                          02S0131 00172000
      ESTAE (2),PARAM=(3),TERM=YES,MF=(E,MACWORK)             @ZA15007  00173000
*RFY (R2,R3) UNRSTD;                                            02S0132 00174000
*IF R15 = ZERO THEN                    /*IF ESTAE SUCCESSFUL @Z40FPPG*/ 00175000
         LTR   R15,R15                                          02S0133 00176000
         BNZ   @RF00133                                         02S0133 00177000
*  ASWASCBP = TCBSTABB;                /*CURRENT SCB @       @Z40FPPG*/ 00178000
         L     @14,TCBSTABB-1(,TCBPTR)                          02S0134 00179000
         LA    @14,0(,@14)                                      02S0134 00180000
         STCM  @14,15,ASWASCBP(ASWAPTR)                         02S0134 00181000
*RFY R15 UNRSTD;                      /*                     @Z40FPPG*/ 00182000
@RF00133 DS    0H                                               01S0136 00183000
*IF R15=0 THEN                         /* ESTAE SUCCESSFUL           */ 00184000
         SLR   @14,@14                                          01S0136 00185000
         CR    R15,@14                                          01S0136 00186000
         BNE   @RF00136                                         01S0136 00187000
*  DO;                                                          01S0137 00188000
*/********************************************************************/ 00189000
*/*                                                                  */ 00190000
*/* SEGMENT - SCAN                                                   */ 00191000
*/*                                                                  */ 00192000
*/* DESCRIPTIVE NAME - SCAN INPUT PARAMETER LIST                     */ 00193000
*/*                                                                  */ 00194000
*/* FUNCTION -                                                       */ 00195000
*/*             SCAN THE INPUT PARAMETER LIST IN PREPARATION FOR THE */ 00196000
*/*             'COPY' SEGMENT.                                      */ 00197000
*/*                                                                  */ 00198000
*/* OPERATION -                                                      */ 00199000
*/*             . SCAN THE PARAMETER LIST TO CALCULATE THE SIZE      */ 00200000
*/*               OF AN AREA FOR THE 'COPY' SEGMENT TO GETMAIN.      */ 00201000
*/*               THE SIZE OF THIS AREA IS THE SUM OF THE SIZES OF   */ 00202000
*/*                  - THE REQUEST BLOCK                             */ 00203000
*/*                  - THE TEXT UNIT POINTER ARRAY                   */ 00204000
*/*                  - A WORKAREA FOR THE INSTALLATION EXIT          */ 00205000
*/*                  - THE TEXTUNITS                                 */ 00206000
*/*                                                                  */ 00207000
*/*             . A SWITCH IS SET TO INDICATE TO THE ESTAE EXIT      */ 00208000
*/*               THAT AN ABNORMAL TERMINATION (DURING 'SCAN') IS    */ 00209000
*/*               PROBABLY DUE TO A USER ERROR, E.G., INVALID        */ 00210000
*/*               TEXT UNIT POINTERS. THE SWITCH IS TURNED OFF AT    */ 00211000
*/*               THE END OF THIS SEGMENT.                           */ 00212000
*/*                                                                  */ 00213000
*/*             . A SWITCH IS SET IF ANY PARAMETER LIST ERRORS ARE   */ 00214000
*/*               DETECTED WHICH PREVENT THE COPY FROM TAKING PLACE. */ 00215000
*/*                                                                  */ 00216000
*/* OUTPUT -                                                         */ 00217000
*/*          CPYSIZE  - SET TO SIZE OF AREA TO BE GETMAIN'D          */ 00218000
*/*          SWSCANER - SET ON IF A PARAMETER LIST FORMAT ERROR      */ 00219000
*/*                     IS FOUND THAT WOULD PREVENT A SUCCESSFUL     */ 00220000
*/*                     COPY.                                        */ 00221000
*/********************************************************************/ 00222000
*/* FIND THE SIZE OF THE USER PARM-LIST AND PUT INTO 'CPYSIZE'       */ 00223000
*/* TEXTUNIT POINTERS ARE CALLED 'TUPS'                              */ 00224000
*                                                               02S0138 00225000
*USERERSW = ON;                        /*INDICATE ABNORMAL TERMINATION  00226000
*                                        DUE TO USER ERROR           */ 00227000
*                                                               02S0138 00228000
         OI    USERERSW,B'00100000'                             02S0138 00229000
*KEYNUMLN = LENGTH(S99TUKEY) + LENGTH(S99TUNUM); /*COMMON EXPRESSION */ 00230000
         MVC   KEYNUMLN(4),@CF00074                             02S0139 00231000
*CPYSIZE  = LENGTH(S99RB) + EXITSIZE + LENGTH(S99RBPTR);        02S0140 00232000
         LA    @09,24                                           02S0140 00233000
         AL    @09,EXITSIZE                                     02S0140 00234000
         ST    @09,CPYSIZE                                      02S0140 00235000
*                                      /*BEGIN SIZE CALCULATION      */ 00236000
* DO; /*MODESET  KEYADDR(KEY0)*/                                02S0141 00237000
*   SPKA (KEY0); /*SET PSW KEY*/                                02S0142 00238000
         L     @09,KEY0                                         02S0142 00239000
         SPKA  0(@09)                                           02S0142 00240000
* END; /*MODESET  KEYADDR(KEY0)*/               /*NEED TO REF USER/SCHE 00241000
* CORE */                                                       02S0143 00242000
*IF S99TXTPP^=0 THEN                   /*IF TEXTUNITS PASSED         */ 00243000
         L     @09,S99RBPTR(,INPPARM)                           02S0144 00244000
         L     @09,S99TXTPP(,@09)                               02S0144 00245000
         CR    @09,@14                                          02S0144 00246000
         BE    @RF00144                                         02S0144 00247000
*  DO;                                                          02S0145 00248000
*    RFY S99TUP BASED(S99TUPP);        /*POINT TO SUCCESSIVE TUP'S   */ 00249000
*    S99TUPP  = S99TXTPP;              /*PTR TO 1ST TUP              */ 00250000
         LR    S99TUPP,@09                                      02S0147 00251000
*    SWQUIT   = OFF;                   /*INIT LOOP CONTROL SWITCH    */ 00252000
*    SWSCANER = OFF;                   /*INIT ERROR SWITCH           */ 00253000
         NI    SWQUIT,B'00111111'                               02S0149 00254000
*    TUPSIZE  = 0;                     /*INIT SIZE OF TUP ARRAY      */ 00255000
         ST    @14,TUPSIZE                                      02S0150 00256000
*    DO WHILE SWQUIT=OFF & SWSCANER=OFF; /*LOOP THRU TUP ARRAY       */ 00257000
         B     @DE00151                                         02S0151 00258000
@DL00151 DS    0H                                               02S0152 00259000
*      TUPSIZE  = TUPSIZE + 4;         /*ADD TO SIZE OF TUP ARRAY    */ 00260000
         LA    @09,4                                            02S0152 00261000
         L     @05,TUPSIZE                                      02S0152 00262000
         ALR   @05,@09                                          02S0152 00263000
         ST    @05,TUPSIZE                                      02S0152 00264000
*      CPYSIZE  = CPYSIZE + 4;         /*ALSO ADD TO TOTAL SIZE      */ 00265000
         AL    @09,CPYSIZE                                      02S0153 00266000
         ST    @09,CPYSIZE                                      02S0153 00267000
*      IF (S99TUP&'7FFFFFFF'X)^=0 THEN /*IF TEXTUNIT PRESENT         */ 00268000
         SLR   @05,@05                                          02S0154 00269000
         L     @15,S99TUP(,S99TUPP)                             02S0154 00270000
         LR    @14,@15                                          02S0154 00271000
         N     @14,@CF01800                                     02S0154 00272000
         CR    @14,@05                                          02S0154 00273000
         BE    @RF00154                                         02S0154 00274000
*        DO;                                                    02S0155 00275000
*          CPYSIZE  = CPYSIZE+KEYNUMLN; /* COMMON PART OF TU         */ 00276000
         AL    @09,KEYNUMLN                                     02S0156 00277000
         ST    @09,CPYSIZE                                      02S0156 00278000
*          IF S99TUNUM<0 THEN          /*ERROR IN NO. OF PARMS       */ 00279000
         ICM   @09,12,S99TUNUM(@15)                             02S0157 00280000
         SRA   @09,16                                           02S0157 00281000
         CR    @05,@09                                          02S0157 00282000
         BNH   @RF00157                                         02S0157 00283000
*            SWSCANER=ON;              /*REMEMBER AND EXIT LOOP      */ 00284000
         OI    SWSCANER,B'10000000'                             02S0158 00285000
*          ELSE                        /*S99TUNUM OK                 */ 00286000
*            IF S99TUNUM>0 THEN        /*LENGTH/PARM FIELDS PRESENT  */ 00287000
         B     @RC00157                                         02S0159 00288000
@RF00157 L     @09,S99TUP(,S99TUPP)                             02S0159 00289000
         ICM   @05,12,S99TUNUM(@09)                             02S0159 00290000
         SRA   @05,16                                           02S0159 00291000
         LTR   @05,@05                                          02S0159 00292000
         BNP   @RF00159                                         02S0159 00293000
*              DO;                                              02S0160 00294000
*                S99TUFP  = ADDR(S99TUENT); /*1ST LEN/PARM ENTRY     */ 00295000
         LA    @09,S99TUENT(,@09)                               02S0161 00296000
         ST    @09,S99TUFP                                      02S0161 00297000
*                DO I=S99TUNUM TO 1 BY -1 WHILE SWSCANER=OFF;   02S0162 00298000
         ST    @05,I                                            02S0162 00299000
         B     @DE00162                                         02S0162 00300000
@DL00162 TM    SWSCANER,B'10000000'                             02S0162 00301000
         BNZ   @DC00162                                         02S0162 00302000
*                                      /*LOOP THRU LEN/PARM ENTRIES  */ 00303000
*                  IF S99TULEN <0 THEN /*LENGTH INVALID      @G29AN2F*/ 00304000
         L     @09,S99TUFP                                      02S0163 00305000
         ICM   @05,3,S99TULEN(@09)                              02S0163 00306000
         BNM   @RF00163                                         02S0163 00307000
*                    SWSCANER=ON;      /*REMEMBER & EXIT LOOP        */ 00308000
         OI    SWSCANER,B'10000000'                             02S0164 00309000
*                  ELSE                /*LENGTH OK                   */ 00310000
*                    DO;                                        02S0165 00311000
         B     @RC00163                                         02S0165 00312000
@RF00163 DS    0H                                               02S0166 00313000
*                      CPYSIZE  = CPYSIZE+S99TULEN+LENGTH(S99TULEN);    00314000
         LA    @09,2                                            02S0166 00315000
         L     @05,S99TUFP                                      02S0166 00316000
         ICM   @15,12,S99TULEN(@05)                             02S0166 00317000
         SRA   @15,16                                           02S0166 00318000
         L     @14,CPYSIZE                                      02S0166 00319000
         ALR   @14,@15                                          02S0166 00320000
         ALR   @14,@09                                          02S0166 00321000
         ST    @14,CPYSIZE                                      02S0166 00322000
*                                      /*ADD SIZE OF LEN/PARM ENTRY  */ 00323000
*                      S99TUFP  = S99TUFP+S99TULEN+LENGTH(S99TULEN);    00324000
         ALR   @05,@15                                          02S0167 00325000
         ALR   @05,@09                                          02S0167 00326000
         ST    @05,S99TUFP                                      02S0167 00327000
*                                      /*POINT TO NEXT LEN/PARM ENTRY*/ 00328000
*                    END;                                       02S0168 00329000
*                END;                                           02S0169 00330000
@RC00163 SLR   @05,@05                                          02S0169 00331000
         BCTR  @05,0                                            02S0169 00332000
         AL    @05,I                                            02S0169 00333000
         ST    @05,I                                            02S0169 00334000
@DE00162 LTR   @05,@05                                          02S0169 00335000
         BP    @DL00162                                         02S0169 00336000
@DC00162 DS    0H                                               02S0170 00337000
*              END;                                             02S0170 00338000
*            ELSE;                     /*NO LENGTH/PARM FIELDS       */ 00339000
@RF00159 DS    0H                                               02S0172 00340000
*        END;                                                   02S0172 00341000
*      ELSE;                           /*TEXTUNIT NOT PRESENT (TUP=0)*/ 00342000
@RF00154 DS    0H                                               02S0174 00343000
*      IF S99TUPND=ON THEN             /*LAST TUP IN ARRAY           */ 00344000
@RC00154 TM    S99TUPND(S99TUPP),B'10000000'                    02S0174 00345000
         BNO   @RF00174                                         02S0174 00346000
*        SWQUIT = ON;                  /*YES, EXIT LOOP              */ 00347000
         OI    SWQUIT,B'01000000'                               02S0175 00348000
*      ELSE                            /*NO,                         */ 00349000
*        S99TUPP = S99TUPP + 4;        /*POINT TO NEXT TUP           */ 00350000
         B     @RC00174                                         02S0176 00351000
@RF00174 AL    S99TUPP,@CF00074                                 02S0176 00352000
*    END;                              /*END LOOP THRU TUP ARRAY     */ 00353000
@RC00174 DS    0H                                               02S0177 00354000
@DE00151 TM    SWQUIT,B'11000000'                               02S0177 00355000
         BZ    @DL00151                                         02S0177 00356000
*  END;                                                         02S0178 00357000
*ELSE;                                 /* NO TEXTUNITS               */ 00358000
*                                                               02S0179 00359000
@RF00144 DS    0H                                               02S0180 00360000
* DO; /*MODESET  EXTKEY(SCHED)*/                                02S0180 00361000
*   SPKA (16); /*SET PSW KEY*/                                  02S0181 00362000
         LA    @09,16                                           02S0181 00363000
         SPKA  0(@09)                                           02S0181 00364000
* END; /*MODESET  EXTKEY(SCHED)*/               /*RETURN TO SCHED KEY   00365000
*      */                                                       02S0182 00366000
*                                                               02S0182 00367000
*USERERSW = OFF;                       /*END OF PROBABLE USER ERROR     00368000
*                                        SITUATION                   */ 00369000
         NI    USERERSW,B'11011111'                             02S0183 00370000
*    IF SWSCANER=OFF THEN              /*NO ERROR IN SCAN            */ 00371000
         TM    SWSCANER,B'10000000'                             01S0184 00372000
         BNZ   @RF00184                                         01S0184 00373000
*      DO;                                                      01S0185 00374000
*/********************************************************************/ 00375000
*/*                                                                  */ 00376000
*/* SEGMENT - COPY                                                   */ 00377000
*/*                                                                  */ 00378000
*/* DESCRIPTIVE NAME - COPY USER PARAMETER LIST                      */ 00379000
*/*                                                                  */ 00380000
*/* FUNCTION -                                                       */ 00381000
*/*            COPY THE PARAMETER LIST FROM USER                     */ 00382000
*/*            (POSSIBLY FETCH-PROTECTED) CORE,                      */ 00383000
*/*            TO SCHEDULER-KEY FETCH-PROTECTED CORE. THIS           */ 00384000
*/*            ALLOWS THE REMAINDER OF DYNAMIC ALLOCATION TO RUN     */ 00385000
*/*            IN SCHEDULER-KEY AND BE ABLE TO REFERENCE THE         */ 00386000
*/*            INCOMING PARAMETERS, AND INSURES DATA SECURITY        */ 00387000
*/*            FOR THE USER AND SYSTEM.                              */ 00388000
*/*                                                                  */ 00389000
*/* OPERATION -                                                      */ 00390000
*/*             . GETMAIN A SCHEDULER-KEY FETCH-PROTECTED            */ 00391000
*/*               AREA OF CORE INTO WHICH THE USER'S PARM LIST CAN   */ 00392000
*/*               BE COPIED. (SEE THE 'SCAN' SEGMENT)                */ 00393000
*/*                                                                  */ 00394000
*/*             . LOOP THROUGH THE PARM LIST TO EFFECT THE COPY.     */ 00395000
*/*               DO THIS IN KEY ZERO SO THAT BOTH USER-CORE AND     */ 00396000
*/*               PL/S-GOTTEN CORE CAN BE REFERENCED SIMULTANEOUSLY. */ 00397000
*/*               NOTE THAT AFTER THE COPY, THE INSTALLATION         */ 00398000
*/*               EXIT WORK AREA FOLLOWS THE TEXTUNIT POINTERS SO    */ 00399000
*/*               THAT IT IS EASY FOR THE EXIT TO EXTEND THIS LIST.  */ 00400000
*/*                                                                  */ 00401000
*/*             . WHENEVER PART OF THE USER-PARM LIST IS ACTUALLY    */ 00402000
*/*               BEING COPIED, A CHECK IS MADE TO INSURE THAT       */ 00403000
*/*               THE RESULT WILL LIE WITHIN THE GETMAIN'D AREA,     */ 00404000
*/*               TO GUARD AGAINST THE USER DYNAMICALLY ALTERING     */ 00405000
*/*               THE INPUT PARAMETER LIST,                          */ 00406000
*/*               WHICH COULD CAUSE UNOWNED CORE TO BE               */ 00407000
*/*               OVERLAYED. IF AN ERROR IS FOUND, AN ERROR          */ 00408000
*/*               CODE IS PLACED IN THE -COPIED- REQUEST BLOCK,      */ 00409000
*/*               TO BE LATER SET IN THE ORIGINAL REQUEST BLOCK BY   */ 00410000
*/*               THE 'RESTORE' SEGMENT.  THE S99RBPTR IS COPIED     */ 00411000
*/*               ONLY TO ENABLE THE 'S99CKRB' SEGMENT TO TEST       */ 00412000
*/*               THE HIGH-ORDER BIT.                                */ 00413000
*/*                                                                  */ 00414000
*/********************************************************************/ 00415000
*RFY (R0,R1) RSTD;                                              02S0186 00416000
*R0       = CPYSIZE | CPYSUBP;         /*SET SIZE, SUBPOOL FOR GETM  */ 00417000
         L     R0,CPYSIZE                                       02S0187 00418000
         ICM   @06,15,CPYSUBP                                   02S0187 00419000
         OR    R0,@06                                           02S0187 00420000
*GEN(GETMAIN R,LV=(0));                /*GET SCH-KEY FETCH-PROT CORE */ 00421000
         GETMAIN R,LV=(0)                                               00422000
*CPYEND   = R1 + CPYSIZE - 1;          /*ADDR OF END OF AREA         */ 00423000
         L     @06,CPYSIZE                                      02S0189 00424000
         LR    CPYEND,R1                                        02S0189 00425000
         ALR   CPYEND,@06                                       02S0189 00426000
         BCTR  CPYEND,0                                         02S0189 00427000
*CPYSIZE  = CPYSIZE | CPYSUBP;         /*SAVE FOR FREEMAIN (& ESTAE) */ 00428000
         ICM   @05,15,CPYSUBP                                   02S0190 00429000
         OR    @06,@05                                          02S0190 00430000
         ST    @06,CPYSIZE                                      02S0190 00431000
*CPYLOC   = R1;                        /*SAVE ADDRESS OF GOTTEN CORE */ 00432000
         ST    R1,CPYLOC                                        02S0191 00433000
*CPYRBP = CPYLOC + LENGTH(S99RBPTR);   /*SET BASE FOR S99RB          */ 00434000
         L     @06,CPYLOC                                       02S0192 00435000
         LA    CPYRBP,4                                         02S0192 00436000
         ALR   CPYRBP,@06                                       02S0192 00437000
*RFY (R0,R1) UNRSTD;                                            02S0193 00438000
* DO; /*MODESET  KEYADDR(KEY0)*/                                02S0194 00439000
*   SPKA (KEY0); /*SET PSW KEY*/                                02S0195 00440000
         L     @05,KEY0                                         02S0195 00441000
         SPKA  0(@05)                                           02S0195 00442000
* END; /*MODESET  KEYADDR(KEY0)*/               /*NEED KEY ZERO TO REFE 00443000
*ENCE                                             BOTH USER AND SCHEDUL 00444000
*R CORE */                                                      02S0196 00445000
*                                                               02S0196 00446000
*/* POINTER NOTATION IS USED TO REFERENCE THE COPY, AND IMPLICIT     */ 00447000
*/* NOTATION IS USED TO REFERENCE THE USER'S SOURCE PARM-LIST        */ 00448000
*                                                               02S0197 00449000
*CPYLOC->S99RBPTR = S99RBPTR;          /*COPY THE REQUEST BLOCK PTR  */ 00450000
         L     @05,S99RBPTR(,INPPARM)                           02S0197 00451000
         ST    @05,S99RBPTR(,@06)                               02S0197 00452000
*CPYRBP->S99RB = S99RB;                /*COPY THE REQUEST BLOCK      */ 00453000
         MVC   S99RB(20,CPYRBP),S99RB(@05)                      02S0198 00454000
*CPYRBP->S99RSC = 0;                   /*INIT REASON CODE            */ 00455000
*                                                               02S0199 00456000
         SLR   @06,@06                                          02S0199 00457000
         ST    @06,S99RSC(,CPYRBP)                              02S0199 00458000
*IF S99TXTPP^=0 THEN                   /*IF TEXTUNITS PRESENT        */ 00459000
         L     @05,S99TXTPP(,@05)                               02S0200 00460000
         CR    @05,@06                                          02S0200 00461000
         BE    @RF00200                                         02S0200 00462000
*  DO;                                                          02S0201 00463000
*    CPYRBP->S99TXTPP = CPYRBP+LENGTH(S99RB); /*BEGIN NEW TUP ARRAY  */ 00464000
         LA    @02,20                                           02S0202 00465000
         ALR   @02,CPYRBP                                       02S0202 00466000
         ST    @02,S99TXTPP(,CPYRBP)                            02S0202 00467000
*    S99TUPP  = S99TXTPP;              /*PTR TO 1ST USER TUP         */ 00468000
         LR    S99TUPP,@05                                      02S0203 00469000
*    CPYTUPP  = CPYRBP->S99TXTPP;      /*PTR TO 1ST NEW (COPY) TUP   */ 00470000
         ST    @02,CPYTUPP                                      02S0204 00471000
*    RFY S99TUP BASED(S99TUPP);        /*POINT TO SUCCESSIVE USER       00472000
*                                        TUP'S                       */ 00473000
*    RFY CPYTUP BASED(CPYTUPP);        /*POINT TO SUCCESSIVE COPY       00474000
*                                        TUP'S                       */ 00475000
*    EXITLOC  = CPYTUPP + TUPSIZE;     /*ADDR OF EXIT WORKAREA       */ 00476000
         LR    @05,@02                                          02S0207 00477000
         AL    @05,TUPSIZE                                      02S0207 00478000
         ST    @05,EXITLOC                                      02S0207 00479000
*    IF (S99TUP&'7FFFFFFF'X)=0 THEN    /*1ST TUP IS 0                */ 00480000
         SLR   @15,@15                                          02S0208 00481000
         L     @14,S99TUP(,S99TUPP)                             02S0208 00482000
         N     @14,@CF01800                                     02S0208 00483000
         CR    @14,@15                                          02S0208 00484000
         BNE   @RF00208                                         02S0208 00485000
*      DO;                                                      02S0209 00486000
*        CPYTUP = 0;                   /*1ST COPY TUP IS 0 ALSO      */ 00487000
         ST    @15,CPYTUP(,@02)                                 02S0210 00488000
*        CPYTUFP = EXITLOC + EXITSIZE; /*VALUE OF 1ST NON-0 TUP -       00489000
*                                        USED LATER IN THIS SEGMENT  */ 00490000
         AL    @05,EXITSIZE                                     02S0211 00491000
         ST    @05,CPYTUFP                                      02S0211 00492000
*      END;                                                     02S0212 00493000
*    ELSE                              /*1ST TUP NON-0               */ 00494000
*      CPYTUP   = EXITLOC + EXITSIZE;  /*FILL IN 1ST NEW TUP - IT       00495000
*                                        POINTS JUST PAST THE END OF    00496000
*                                        THE EXIT WORKAREA, WHERE THE   00497000
*                                        1ST TEXTUNIT WILL BE COPIED */ 00498000
         B     @RC00208                                         02S0213 00499000
@RF00208 L     @05,EXITLOC                                      02S0213 00500000
         AL    @05,EXITSIZE                                     02S0213 00501000
         L     @02,CPYTUPP                                      02S0213 00502000
         ST    @05,CPYTUP(,@02)                                 02S0213 00503000
*    SWQUIT   = OFF;                   /*INIT LOOP CONTROL SWITCH    */ 00504000
@RC00208 NI    SWQUIT,B'10111111'                               02S0214 00505000
*    DO WHILE SWQUIT=OFF & CPYRBP->S99ERROR=0; /*LOOP THRU TUP'S WHILE  00506000
*                                                NO ERROR            */ 00507000
         B     @DE00215                                         02S0215 00508000
@DL00215 DS    0H                                               02S0216 00509000
*      IF (S99TUP&'7FFFFFFF'X)^=0 THEN /*IF TEXTUNIT PRESENT         */ 00510000
         L     @05,S99TUP(,S99TUPP)                             02S0216 00511000
         N     @05,@CF01800                                     02S0216 00512000
         LTR   @05,@05                                          02S0216 00513000
         BZ    @RF00216                                         02S0216 00514000
*        DO;                                                    02S0217 00515000
*          IF CPYTUP+KEYNUMLN-1>CPYEND THEN /*BNDRY ERROR            */ 00516000
         L     @05,CPYTUPP                                      02S0218 00517000
         L     @05,CPYTUP(,@05)                                 02S0218 00518000
         AL    @05,KEYNUMLN                                     02S0218 00519000
         BCTR  @05,0                                            02S0218 00520000
         CR    @05,CPYEND                                       02S0218 00521000
         BNH   @RF00218                                         02S0218 00522000
*            CPYRBP->S99ERROR = RCINFMAT; /* QUIT                    */ 00523000
         MVC   S99ERROR(2,CPYRBP),@CB01630                      02S0219 00524000
*          ELSE                                                 02S0220 00525000
*            DO;                                                02S0220 00526000
         B     @RC00218                                         02S0220 00527000
@RF00218 DS    0H                                               02S0221 00528000
*              CPYTUP->S99TUNIT(1:KEYNUMLN) = S99TUNIT(1:KEYNUMLN);     00529000
         L     @05,CPYTUPP                                      02S0221 00530000
         L     @05,CPYTUP(,@05)                                 02S0221 00531000
         L     @02,KEYNUMLN                                     02S0221 00532000
         BCTR  @02,0                                            02S0221 00533000
         L     @15,S99TUP(,S99TUPP)                             02S0221 00534000
         EX    @02,@SM01834                                     02S0221 00535000
*                                      /*COPY KEY, NUMBER FIELDS     */ 00536000
*              S99TUFP = ADDR(S99TUENT); /*POINT AT LEN/PARM ENTRY   */ 00537000
         LA    @02,S99TUENT(,@15)                               02S0222 00538000
         ST    @02,S99TUFP                                      02S0222 00539000
*              CPYTUFP = ADDR(CPYTUP->S99TUENT);                02S0223 00540000
         LA    @05,S99TUENT(,@05)                               02S0223 00541000
         ST    @05,CPYTUFP                                      02S0223 00542000
*                                      /*POINT AT WHERE TO COPY      */ 00543000
*              IF S99TUNUM>0 THEN      /*LEN/PARM FIELDS EXIST       */ 00544000
         ICM   @05,12,S99TUNUM(@15)                             02S0224 00545000
         SRA   @05,16                                           02S0224 00546000
         LTR   @05,@05                                          02S0224 00547000
         BNP   @RF00224                                         02S0224 00548000
*                DO;                                            02S0225 00549000
*                  DO I=S99TUNUM BY -1 TO 1 WHILE CPYRBP->S99ERROR=0;   00550000
         ST    @05,I                                            02S0226 00551000
         B     @DE00226                                         02S0226 00552000
@DL00226 LH    @05,S99ERROR(,CPYRBP)                            02S0226 00553000
         N     @05,@CF01836                                     02S0226 00554000
         LTR   @05,@05                                          02S0226 00555000
         BNZ   @DC00226                                         02S0226 00556000
*                                      /*LOOP THRU LEN/PARM ENTRIES  */ 00557000
*                    RFY R2 RSTD;      /*USE AS LENGTH TO MOVE       */ 00558000
*                    R2 = LENGTH(S99TULEN)+S99TULEN; /*LEN OF MOVE   */ 00559000
         LA    R2,2                                             02S0228 00560000
         L     @05,S99TUFP                                      02S0228 00561000
         ICM   @05,12,S99TULEN(@05)                             02S0228 00562000
         SRA   @05,16                                           02S0228 00563000
         ALR   R2,@05                                           02S0228 00564000
*                    IF CPYTUFP+R2-1>CPYEND THEN /*BOUNDRY ERROR     */ 00565000
         LR    @05,R2                                           02S0229 00566000
         AL    @05,CPYTUFP                                      02S0229 00567000
         BCTR  @05,0                                            02S0229 00568000
         CR    @05,CPYEND                                       02S0229 00569000
         BNH   @RF00229                                         02S0229 00570000
*                      CPYRBP->S99ERROR = RCINFMAT; /*QUIT COPY      */ 00571000
         MVC   S99ERROR(2,CPYRBP),@CB01630                      02S0230 00572000
*                    ELSE                                       02S0231 00573000
*                      DO;                                      02S0231 00574000
         B     @RC00229                                         02S0231 00575000
@RF00229 DS    0H                                               02S0232 00576000
*                        CPYTUFP->S99TUFLD(1:R2) = S99TUFLD(1:R2);      00577000
         L     @05,CPYTUFP                                      02S0232 00578000
         LR    @15,R2                                           02S0232 00579000
         BCTR  @15,0                                            02S0232 00580000
         L     @14,S99TUFP                                      02S0232 00581000
         EX    @15,@SM01837                                     02S0232 00582000
*                        S99TUFP  = S99TUFP + R2; /*NEXT ENTRY       */ 00583000
         ALR   @14,R2                                           02S0233 00584000
         ST    @14,S99TUFP                                      02S0233 00585000
*                        CPYTUFP  = CPYTUFP + R2; /*WHERE TO COPY    */ 00586000
         ALR   @05,R2                                           02S0234 00587000
         ST    @05,CPYTUFP                                      02S0234 00588000
*                      END;                                     02S0235 00589000
*                    RFY (R2) UNRSTD;                           02S0236 00590000
@RC00229 DS    0H                                               02S0237 00591000
*                  END;                /*END LEN/PARM LOOP           */ 00592000
         SLR   @05,@05                                          02S0237 00593000
         BCTR  @05,0                                            02S0237 00594000
         AL    @05,I                                            02S0237 00595000
         ST    @05,I                                            02S0237 00596000
@DE00226 LTR   @05,@05                                          02S0237 00597000
         BP    @DL00226                                         02S0237 00598000
@DC00226 DS    0H                                               02S0238 00599000
*                END;                  /*END LEN/PARM PROCESSING     */ 00600000
*              ELSE;                   /*NO LEN/PARM ENTRIES         */ 00601000
@RF00224 DS    0H                                               02S0240 00602000
*            END;                      /*END NO-BOUNDRY ERROR        */ 00603000
*        END;                          /*END TEXTUNIT PRESENT GROUP  */ 00604000
*      ELSE;                           /*TUP IS ZERO                 */ 00605000
@RF00216 DS    0H                                               02S0243 00606000
*      IF S99TUPND=ON THEN             /*LAST TUP JUST COPIED?       */ 00607000
@RC00216 TM    S99TUPND(S99TUPP),B'10000000'                    02S0243 00608000
         BNO   @RF00243                                         02S0243 00609000
*        DO;                                                    02S0244 00610000
*          SWQUIT = ON;                /*EXIT LOOP                   */ 00611000
         OI    SWQUIT,B'01000000'                               02S0245 00612000
*          CPYTUPP->S99TUPND = ON;     /*INDICATE END-OF-LIST        */ 00613000
         L     @05,CPYTUPP                                      02S0246 00614000
         OI    S99TUPND(@05),B'10000000'                        02S0246 00615000
*        END;                                                   02S0247 00616000
*      ELSE                            /*NOT END-OF-LIST             */ 00617000
*        DO;                                                    02S0248 00618000
         B     @RC00243                                         02S0248 00619000
@RF00243 DS    0H                                               02S0249 00620000
*          S99TUPP = S99TUPP+4;        /*NEXT ORIGINAL TUP           */ 00621000
         LA    @05,4                                            02S0249 00622000
         ALR   S99TUPP,@05                                      02S0249 00623000
*          CPYTUPP = CPYTUPP+4;        /*NEXT 'COPY' TUP             */ 00624000
         AL    @05,CPYTUPP                                      02S0250 00625000
         ST    @05,CPYTUPP                                      02S0250 00626000
*          IF CPYTUPP^<EXITLOC THEN    /*LIST DYNAMICALLY EXTENDED   */ 00627000
         C     @05,EXITLOC                                      02S0251 00628000
         BL    @RF00251                                         02S0251 00629000
*            CPYRBP->S99ERROR = RCINFMAT;  /*YES, FAIL REQUEST       */ 00630000
         MVC   S99ERROR(2,CPYRBP),@CB01630                      02S0252 00631000
*          ELSE                                                 02S0253 00632000
*            IF (S99TUP&'7FFFFFFF'X)^=0 THEN /*NON-0 TUP             */ 00633000
         B     @RC00251                                         02S0253 00634000
@RF00251 L     @05,S99TUP(,S99TUPP)                             02S0253 00635000
         N     @05,@CF01800                                     02S0253 00636000
         LTR   @05,@05                                          02S0253 00637000
         BZ    @RF00253                                         02S0253 00638000
*              CPYTUP  = CPYTUFP;      /*NEXT COPY TU BEGINS HERE    */ 00639000
         L     @05,CPYTUFP                                      02S0254 00640000
         L     @02,CPYTUPP                                      02S0254 00641000
         ST    @05,CPYTUP(,@02)                                 02S0254 00642000
*            ELSE                      /*TUP IS 0                    */ 00643000
*              CPYTUP = 0;             /*COPY IS 0 ALSO              */ 00644000
         B     @RC00253                                         02S0255 00645000
@RF00253 L     @05,CPYTUPP                                      02S0255 00646000
         SLR   @02,@02                                          02S0255 00647000
         ST    @02,CPYTUP(,@05)                                 02S0255 00648000
*        END;                                                   02S0256 00649000
@RC00253 DS    0H                                               02S0256 00650000
@RC00251 DS    0H                                               02S0257 00651000
*    END;                              /*END LOOP THRU TUP'S         */ 00652000
@RC00243 DS    0H                                               02S0257 00653000
@DE00215 TM    SWQUIT,B'01000000'                               02S0257 00654000
         BNZ   @DC00215                                         02S0257 00655000
         LH    @05,S99ERROR(,CPYRBP)                            02S0257 00656000
         N     @05,@CF01836                                     02S0257 00657000
         LTR   @05,@05                                          02S0257 00658000
         BZ    @DL00215                                         02S0257 00659000
@DC00215 DS    0H                                               02S0258 00660000
*  END;                                                         02S0258 00661000
*ELSE                                  /*NO TUP ARRAY PRESENT        */ 00662000
*  EXITLOC  = CPYRBP + LENGTH(S99RB);  /*ADDR OF EXIT WORKAREA       */ 00663000
*                                                               02S0259 00664000
         B     @RC00200                                         02S0259 00665000
@RF00200 LA    @06,20                                           02S0259 00666000
         ALR   @06,CPYRBP                                       02S0259 00667000
         ST    @06,EXITLOC                                      02S0259 00668000
*EXITCORE(1:256) = EXITCORE(1:256) && EXITCORE(1:256);/*INIT EXIT CORE* 00669000
@RC00200 L     @06,EXITLOC                                      02S0260 00670000
         XC    EXITCORE(256,@06),EXITCORE(@06)                  02S0260 00671000
*EXITCORE(257:EXITSIZE) = EXITCORE(257:EXITSIZE)                02S0261 00672000
*                                && EXITCORE(257:EXITSIZE);     02S0261 00673000
         L     @05,EXITSIZE                                     02S0261 00674000
         SL    @05,@CF01796                                     02S0261 00675000
         EX    @05,@SX01839                                     02S0261 00676000
* DO; /*MODESET  EXTKEY(SCHED)*/                                02S0262 00677000
*   SPKA (16); /*SET PSW KEY*/                                  02S0263 00678000
         LA    @06,16                                           02S0263 00679000
         SPKA  0(@06)                                           02S0263 00680000
* END; /*MODESET  EXTKEY(SCHED)*/               /*RETURN TO SCHED KEY   00681000
*      */                                                       02S0264 00682000
*RFY S99RB BASED(CPYRBP);              /*FOR ALL FUTURE REFERENCES      00683000
*                                        UNTIL 'RESTORE'             */ 00684000
*        IF S99ERROR=0 THEN            /*COPY SUCCESSFUL             */ 00685000
         SLR   @06,@06                                          01S0266 00686000
         LH    @05,S99ERROR(,CPYRBP)                            01S0266 00687000
         N     @05,@CF01836                                     01S0266 00688000
         CR    @06,@05                                          01S0266 00689000
         BNE   @RF00266                                         01S0266 00690000
*          DO;                                                  01S0267 00691000
*/********************************************************************/ 00692000
*/*                                                                  */ 00693000
*/* SEGMENT NAME - S99CKRB                                           */ 00694000
*/*                                                                  */ 00695000
*/* DESCRIPTIVE NAME - SVC99 REQUEST BLOCK VALIDITY CHECK            */ 00696000
*/*                                                                  */ 00697000
*/* FUNCTION -                                                       */ 00698000
*/*            VERIFY THE VALIDITY OF THE INCOMING SVC 99 PARAMETER  */ 00699000
*/*            LIST REQUEST BLOCK POINTER AND REQUEST BLOCK.         */ 00700000
*/*                                                                  */ 00701000
*/*   OPERATION -                                                    */ 00702000
*/*      IF ANY OF THE FOLLOWING ARE TRUE                            */ 00703000
*/*      THEN THE PARAMETER LIST FORMAT IS INVALID.                  */ 00704000
*/*      . END INDICATOR NOT ON IN REQUEST BLOCK POINTER             */ 00705000
*/*      . LENGTH OF RB IS INVALID                                   */ 00706000
*/*      . RESERVED FIELDS ARE NOT ZEROED                            */ 00707000
*/*      . FLAG FIELDS ARE SET INVALIDLY (UNDEFINED BITS ARE ON)     */ 00708000
*/*      . POINTER TO LIST OF TEXT UNIT POINTERS IS ZERO AND THE     */ 00709000
*/*        VERB CODE IS NOT '01'X (ALLOCATE)                         */ 00710000
*/*      . FLAGS REQUESTING A PRIVILEGED FUNCTION ARE SET            */ 00711000
*/*        AND THE CALLER IS NOT AUTHORIZED (VIA TESTAUTH).          */ 00712000
*/*                                                                  */ 00713000
*/********************************************************************/ 00714000
*IF CPYLOC->S99RBPND^=ON |             /* ONLY ONE REQUEST ALLOWED, SO  00715000
*                                         CHECK THAT END INDICATOR IS   00716000
*                                         ON IN RB POINTER           */ 00717000
*  S99RBLN^=LENGTH(S99RB)  |           /* CHECK FOR CORRECT RB LENGTH*/ 00718000
*  S99RSV01^=ZERO THEN                 /* CHECK FOR RESERVED AREA=0  */ 00719000
         L     @05,CPYLOC                                       02S0268 00720000
         TM    S99RBPND(@05),B'10000000'                        02S0268 00721000
         BNO   @RT00268                                         02S0268 00722000
         CLI   S99RBLN(CPYRBP),20                               02S0268 00723000
         BNE   @RT00268                                         02S0268 00724000
         C     @06,S99RSV01(,CPYRBP)                            02S0268 00725000
         BE    @RF00268                                         02S0268 00726000
@RT00268 DS    0H                                               02S0269 00727000
*    S99ERROR = RCINFMAT;              /* SET REASON CODE            */ 00728000
*                                                               02S0269 00729000
         MVC   S99ERROR(2,CPYRBP),@CB01630                      02S0269 00730000
*IF S99ERROR=0 THEN                    /* NO ERROR YET               */ 00731000
@RF00268 LH    @06,S99ERROR(,CPYRBP)                            02S0270 00732000
         N     @06,@CF01836                                     02S0270 00733000
         LTR   @06,@06                                          02S0270 00734000
         BNZ   @RF00270                                         02S0270 00735000
*  DO;                                 /* CHECK FOR VALID VERB       */ 00736000
*    SWFNDVRB = OFF;                   /* INIT SW FOR LOOP           */ 00737000
         NI    SWFNDVRB,B'11011111'                             02S0272 00738000
*    DO VRBINDEX=1 TO VERBNUMB WHILE(SWFNDVRB=OFF);             02S0273 00739000
         LA    VRBINDEX,1                                       02S0273 00740000
         B     @DE00273                                         02S0273 00741000
@DL00273 TM    SWFNDVRB,B'00100000'                             02S0273 00742000
         BNZ   @DC00273                                         02S0273 00743000
*      IF VERBCODE(VRBINDEX)=S99VERB THEN /* IF VERB OK              */ 00744000
         LR    @06,VRBINDEX                                     02S0274 00745000
         SLA   @06,3                                            02S0274 00746000
         LA    @05,VERBCODE-8(@06)                              02S0274 00747000
         CLC   0(1,@05),S99VERB(CPYRBP)                         02S0274 00748000
         BNE   @RF00274                                         02S0274 00749000
*        SWFNDVRB=ON;                  /* EXIT LOOP                  */ 00750000
         OI    SWFNDVRB,B'00100000'                             02S0275 00751000
*    END;                                                       02S0276 00752000
@RF00274 AL    VRBINDEX,@CF00078                                02S0276 00753000
@DE00273 CH    VRBINDEX,VERBNUMB                                02S0276 00754000
         BNH   @DL00273                                         02S0276 00755000
@DC00273 DS    0H                                               02S0277 00756000
*    VRBINDEX=VRBINDEX-1;              /*DECREMENT TO OFFSET EXTRA      00757000
*                                        INCREMENT DONE BY PL/S LOOP    00758000
*                                        LOGIC                       */ 00759000
         BCTR  VRBINDEX,0                                       02S0277 00760000
*    IF SWFNDVRB=OFF THEN              /* IF VERB INVALID            */ 00761000
         TM    SWFNDVRB,B'00100000'                             02S0278 00762000
         BNZ   @RF00278                                         02S0278 00763000
*      S99ERROR = RCINFMAT;                                     02S0279 00764000
         MVC   S99ERROR(2,CPYRBP),@CB01630                      02S0279 00765000
*  END;                                                         02S0280 00766000
*                                                               02S0280 00767000
@RF00278 DS    0H                                               02S0281 00768000
*IF S99ERROR=0 THEN                    /*NO ERROR - CONTINUE         */ 00769000
@RF00270 SLR   @06,@06                                          02S0281 00770000
         LH    @05,S99ERROR(,CPYRBP)                            02S0281 00771000
         N     @05,@CF01836                                     02S0281 00772000
         CR    @06,@05                                          02S0281 00773000
         BNE   @RF00281                                         02S0281 00774000
*  DO;                                 /*CHECK RESERVED FLAGS        */ 00775000
*    IF (S99FLG11&'00001111'B)^='00'X  /*RESERVED FLAGS SET? @YM06125*/ 00776000
*       | S99FLG12^=0                                           02S0283 00777000
*       | (S99FLG22&'00111111'B)^='00'X /*                   @Y30QPPB*/ 00778000
*       | S99FLAG2(3:4)^=0 THEN        /*                    @Y30QPPB*/ 00779000
         MVC   @TS00001(1),S99FLG11(CPYRBP)                     02S0283 00780000
         NI    @TS00001,B'00001111'                             02S0283 00781000
         CLI   @TS00001,X'00'                                   02S0283 00782000
         BNE   @RT00283                                         02S0283 00783000
         CLI   S99FLG12(CPYRBP),0                               02S0283 00784000
         BNE   @RT00283                                         02S0283 00785000
         MVC   @TS00001(1),S99FLG22(CPYRBP)                     02S0283 00786000
         NI    @TS00001,B'00111111'                             02S0283 00787000
         CLI   @TS00001,X'00'                                   02S0283 00788000
         BNE   @RT00283                                         02S0283 00789000
         SLR   @05,@05                                          02S0283 00790000
         ICM   @05,3,S99FLAG2+2(CPYRBP)                         02S0283 00791000
         CR    @06,@05                                          02S0283 00792000
         BE    @RF00283                                         02S0283 00793000
@RT00283 DS    0H                                               02S0284 00794000
*         S99ERROR = RCINFMAT;         /*BAD PARM LIST               */ 00795000
         MVC   S99ERROR(2,CPYRBP),@CB01630                      02S0284 00796000
*  END;                                                         02S0285 00797000
*                                                               02S0285 00798000
@RF00283 DS    0H                                               02S0286 00799000
*IF S99TXTPP=0 & S99VERB^='01'X THEN   /* NO TEXTUNIT PTRS AND VERB     00800000
*                                         NOT ALLOCATE               */ 00801000
@RF00281 L     @06,S99TXTPP(,CPYRBP)                            02S0286 00802000
         LTR   @06,@06                                          02S0286 00803000
         BNZ   @RF00286                                         02S0286 00804000
         CLI   S99VERB(CPYRBP),X'01'                            02S0286 00805000
         BE    @RF00286                                         02S0286 00806000
*  S99ERROR = RCINFMAT;                /* ERROR                      */ 00807000
         MVC   S99ERROR(2,CPYRBP),@CB01630                      02S0287 00808000
*                                      /* ONLY ALLOC SUPPORTS THIS   */ 00809000
*                                                               02S0288 00810000
*IF S99ERROR=0 THEN                    /* NO ERROR ABOVE             */ 00811000
@RF00286 SLR   @06,@06                                          02S0288 00812000
         LH    @05,S99ERROR(,CPYRBP)                            02S0288 00813000
         N     @05,@CF01836                                     02S0288 00814000
         CR    @06,@05                                          02S0288 00815000
         BNE   @RF00288                                         02S0288 00816000
*  IF S99FLAG2 ^=0 THEN                /* PRIVILEDGED FLAG   @YM05495*/ 00817000
         CL    @06,S99FLAG2(,CPYRBP)                            02S0289 00818000
         BE    @RF00289                                         02S0289 00819000
*    DO;                                                        02S0290 00820000
*      GEN(TESTAUTH FCTN=1,STATE=YES,KEY=YES);/*IS USER AUTHORIZED   */ 00821000
         TESTAUTH FCTN=1,STATE=YES,KEY=YES                              00822000
*      IF R15^=0 THEN                  /*NO,                         */ 00823000
         LTR   R15,R15                                          02S0292 00824000
         BZ    @RF00292                                         02S0292 00825000
*        S99ERROR = RCUNAUTH;          /* ERROR - REQUEST INVALID    */ 00826000
         MVC   S99ERROR(2,CPYRBP),@CB01628                      02S0293 00827000
*    END;                                                       02S0294 00828000
@RF00292 DS    0H                                               02S0295 00829000
*            IF S99ERROR=0 THEN         /* PARM LIST OK              */ 00830000
@RF00289 DS    0H                                               01S0295 00831000
@RF00288 LH    @06,S99ERROR(,CPYRBP)                            01S0295 00832000
         N     @06,@CF01836                                     01S0295 00833000
         LTR   @06,@06                                          01S0295 00834000
         BNZ   @RF00295                                         01S0295 00835000
*              DO;                                              01S0296 00836000
*                IF S99TIONQ=OFF THEN   /* TIOT ENQ NOT YET DONE     */ 00837000
         TM    S99TIONQ(CPYRBP),B'00000100'                     01S0297 00838000
         BNZ   @RF00297                                         01S0297 00839000
*                  DO;                                          01S0298 00840000
*                    ENQRASID = ASCBASID; /* BUILD ENQ RNAME         */ 00841000
         MVC   ENQRASID(2),ASCBASID(ASCBPTR)                    01S0299 00842000
*                    ENQRQDB  = JSCDSABQ; /* CONCAT ASID & QDB ADDR  */ 00843000
         L     @06,LSTJSCBP                                     01S0300 00844000
         MVC   ENQRQDB(4),JSCDSABQ(@06)                         01S0300 00845000
*                    DETDQLST(1:ENQLISTL)=ENQLIST(1:ENQLISTL);  01S0301 00846000
         L     @06,ENQLISTL                                     01S0301 00847000
         BCTR  @06,0                                            01S0301 00848000
         EX    @06,@SM01841                                     01S0301 00849000
*                                       /*PASS TO ESTAE EXIT @Z40FPPD*/ 00850000
*                    RFY (R3) RSTD;    /*                    @Z40FPPD*/ 00851000
*                    R3 = ADDR(DETDQLST); /*ADDR ENQ PARMS   @Z40FPPD*/ 00852000
         LA    R3,DETDQLST                                      01S0303 00853000
*                    GEN(ENQ (,ENQRNAME,,,),MF=(E,(R3)) TIOT ENQ);      00854000
         ENQ (,ENQRNAME,,,),MF=(E,(R3)) TIOT ENQ                        00855000
*                                      /*                    @Z40FPPD*/ 00856000
*                    RFY (R3) UNRSTD;  /*                    @Z40FPPD*/ 00857000
*                  END;                                         01S0306 00858000
*/********************************************************************/ 00859000
*/*                                                                  */ 00860000
*/* SEGMENT NAME - READSWA                                           */ 00861000
*/*                                                                  */ 00862000
*/* DESCRIPTIVE NAME - READ SWA BLOCKS FOR LATER USE                 */ 00863000
*/*                                                                  */ 00864000
*/* FUNCTION -                                                       */ 00865000
*/*           READ IN THE FOLLOWING BLOCKS FROM SWA:                 */ 00866000
*/*                                                                  */ 00867000
*/*              . JCT, SCT - PASSED TO FUNCTION INDICATED           */ 00868000
*/*                           BY VERB                                */ 00869000
*/*                                                                  */ 00870000
*/*              . JOB'S ACT AND STEP'S ACT FOR PASSING TO           */ 00871000
*/*                INSTALLATION EXIT.                                */ 00872000
*/*                                                                  */ 00873000
*/*              . SIOT'S, JFCB'S, AND JFCBX'S FOR ALL DSABS, IF     */ 00874000
*/*                NOT YET READ IN VIA PREVIOUS SVC99 INVOCATION.    */ 00875000
*/*                INVOKE IEFAB4FE, SWA READER, TO DO THIS VIA A     */ 00876000
*/*                SCAN OF THE SIOT'S FROM THE SCT SO THAT -ALL-     */ 00877000
*/*                SIOT'S, NOT JUST THOSE CURRENTLY ALLOCATED, ARE   */ 00878000
*/*                CHAINED.  DYNAMIC UNALLOCATION NEEDS TO HAVE      */ 00879000
*/*                -ALL- SIOT'S AVAILABLE FOR RE-CHAINING.           */ 00880000
*/*                                                                  */ 00881000
*/* OUTPUT -                                                         */ 00882000
*/*          THE FOLLOWING POINTERS ARE FILLED IN -                  */ 00883000
*/*          LSTJCTP - CORE ADDR OF THE JCT                          */ 00884000
*/*          LSTSCTP - CORE ADDR OF THE SCT (THIS POINTER MUST BE    */ 00885000
*/*                    CONTIGUOUS TO LSTJCTP - SEE THE CALL TO SWA   */ 00886000
*/*                    MGR I/F (IEFAB4F7) IN THE CODE).              */ 00887000
*/*          LSTJACT  - CORE ADDR OF THE JOB'S ACT                   */ 00888000
*/*          LSTSACT  - CORE ADDR OF THE STEP'S ACT (THIS POINTER    */ 00889000
*/*                     MUST BE CONTIGUOUS TO LSTJACT - SEE THE CALL */ 00890000
*/*                     TO SWA MGR I/F (IEFAB4F7) IN THE CODE).      */ 00891000
*/*          DEJCT - DEPARMS POINTER TO JCT                          */ 00892000
*/*          DESCT - DEPARMS POINTER TO SCT                          */ 00893000
*/*          DSABSIOT - VIA CALL TO IEFAB4FE - ACTUALLY, ALL         */ 00894000
*/*                     DSAB'S, SIOT'S, JFCB'S AND JFCBX'S ARE       */ 00895000
*/*                     CHAINED TOGETHER IN CORE.                    */ 00896000
*/*                                                                  */ 00897000
*/********************************************************************/ 00898000
*SWACTLS = SWACTLS && SWACTLS;         /* INIT SWA MGR I/F INPUT     */ 00899000
@RF00297 LH    @06,SWACTLS                                      02S0307 00900000
         N     @06,@CF01836                                     02S0307 00901000
         LR    @05,@06                                          02S0307 00902000
         XR    @05,@06                                          02S0307 00903000
         STH   @05,SWACTLS                                      02S0307 00904000
*SWREAD = ON;                          /* REQUEST READ OF BLOCKS     */ 00905000
*SWNEW = ON;                           /* LET I/F GET EPAS           */ 00906000
*SWFREE = ON;                          /* LET I/F FREE EPAS WHEN DONE*/ 00907000
         OI    SWREAD,B'00101100'                               02S0310 00908000
*SMISVA(1) = JSCBJCTA;                 /* SVA OF JCT TO READ         */ 00909000
         L     @06,LSTJSCBP                                     02S0311 00910000
         MVC   SMISVA(3),JSCBJCTA(@06)                          02S0311 00911000
*SMISVA(2) = JSCSCTP;                  /* SVA OF SCT  TO READ        */ 00912000
         MVC   SMISVA+4(3),JSCSCTP(@06)                         02S0312 00913000
*CALL IEFAB4F7 (SWACTLS,0,0,ADDR(SMIPARM),ADDR(LSTJCTP),0,2);   02S0313 00914000
*                                                               02S0313 00915000
         MVC   @AL00001+4(24),@AL00313                          02S0313 00916000
         LA    @06,SWACTLS                                      02S0313 00917000
         ST    @06,@AL00001                                     02S0313 00918000
         LA    @06,SMIPARM                                      02S0313 00919000
         ST    @06,@TF00001                                     02S0313 00920000
         LA    @06,@TF00001                                     02S0313 00921000
         ST    @06,@AL00001+12                                  02S0313 00922000
         LA    @06,LSTJCTP                                      02S0313 00923000
         ST    @06,@TF00002                                     02S0313 00924000
         LA    @06,@TF00002                                     02S0313 00925000
         ST    @06,@AL00001+16                                  02S0313 00926000
         L     @15,@CV00122                                     02S0313 00927000
         LA    @01,@AL00001                                     02S0313 00928000
         BALR  @14,@15                                          02S0313 00929000
*DEJCT = LSTJCTP;                      /* FILL IN DEPARMS            */ 00930000
         L     @06,LSTJCTP                                      02S0314 00931000
         ST    @06,DEJCT                                        02S0314 00932000
*DESCT = LSTSCTP;                                               02S0315 00933000
*                                                               02S0315 00934000
         L     @05,LSTSCTP                                      02S0315 00935000
         ST    @05,DESCT                                        02S0315 00936000
*SMISVA(1) = JCTACTAD;                 /*READ JOB'S ACT              */ 00937000
         MVC   SMISVA(3),JCTACTAD(@06)                          02S0316 00938000
*SMISVA(2) = SCTAFACT;                 /*READ IN STEP'S ACT          */ 00939000
         MVC   SMISVA+4(3),SCTAFACT(@05)                        02S0317 00940000
*CALL IEFAB4F7 (SWACTLS,0,0,ADDR(SMIPARM),ADDR(LSTJACT),0,2);   02S0318 00941000
*                                                               02S0318 00942000
         MVC   @AL00001+4(24),@AL00318                          02S0318 00943000
         LA    @06,SWACTLS                                      02S0318 00944000
         ST    @06,@AL00001                                     02S0318 00945000
         LA    @06,SMIPARM                                      02S0318 00946000
         ST    @06,@TF00001                                     02S0318 00947000
         LA    @06,@TF00001                                     02S0318 00948000
         ST    @06,@AL00001+12                                  02S0318 00949000
         LA    @06,LSTJACT                                      02S0318 00950000
         ST    @06,@TF00002                                     02S0318 00951000
         LA    @06,@TF00002                                     02S0318 00952000
         ST    @06,@AL00001+16                                  02S0318 00953000
         L     @15,@CV00122                                     02S0318 00954000
         LA    @01,@AL00001                                     02S0318 00955000
         BALR  @14,@15                                          02S0318 00956000
*IF DSQFRSTP^=0 THEN                   /*IF DSAB'S PRESENT           */ 00957000
         SLR   @06,@06                                          02S0319 00958000
         L     @05,LSTJSCBP                                     02S0319 00959000
         L     @05,JSCDSABQ(,@05)                               02S0319 00960000
         L     @05,DSQFRSTP(,@05)                               02S0319 00961000
         CR    @05,@06                                          02S0319 00962000
         BE    @RF00319                                         02S0319 00963000
*  IF DSQFRSTP->DSABSIOT=0 THEN        /*SWA BLOCKS NOT YET CHAINED  */ 00964000
         C     @06,DSABSIOT(,@05)                               02S0320 00965000
         BNE   @RF00320                                         02S0320 00966000
*    DO;                                                        02S0321 00967000
*      FUNCTMAP = FUNCTMAP && FUNCTMAP;/* INIT SWA READR INPUT       */ 00968000
         XC    FUNCTMAP(1),FUNCTMAP                             02S0322 00969000
*      SCANSCT  = ON;                  /* PUT SIOT ADDR'S IN DSABS   */ 00970000
*      NOEPA    = ON;                  /* NO EPA PROCESSING          */ 00971000
*      UPDTDSAB = ON;                  /*UPDATE DSABSIOT FIELD       */ 00972000
         OI    SCANSCT,B'10001100'                              02S0325 00973000
*      CALL IEFAB4FE (FUNCTMAP,LSTSCTP,ADDR(IEZJSCB),DMYRETNA); 02S0326 00974000
         LA    @06,FUNCTMAP                                     02S0326 00975000
         ST    @06,@AL00001                                     02S0326 00976000
         LA    @06,LSTSCTP                                      02S0326 00977000
         ST    @06,@AL00001+4                                   02S0326 00978000
         LA    @06,LSTJSCBP                                     02S0326 00979000
         ST    @06,@AL00001+8                                   02S0326 00980000
         LA    @06,DMYRETNA                                     02S0326 00981000
         ST    @06,@AL00001+12                                  02S0326 00982000
         L     @15,@CV00123                                     02S0326 00983000
         LA    @01,@AL00001                                     02S0326 00984000
         BALR  @14,@15                                          02S0326 00985000
*                                      /*INVOKE SWA READER           */ 00986000
*    END;                                                       02S0327 00987000
*                CALL IEFDB401 (S99RB,EXITLOC,EXITSIZE,JCTJNAME,        00988000
*                           LSTJACT->ACTPRGNM,LSTJACT->ACTJNFLD,        00989000
*                           SCTSNAME,SCTPGMNM,LSTSACT->ACTJNFLD);       00990000
@RF00320 DS    0H                                               01S0328 00991000
@RF00319 ST    CPYRBP,@AL00001                                  01S0328 00992000
         LA    @06,EXITLOC                                      01S0328 00993000
         ST    @06,@AL00001+4                                   01S0328 00994000
         LA    @06,EXITSIZE                                     01S0328 00995000
         ST    @06,@AL00001+8                                   01S0328 00996000
         L     @06,LSTJCTP                                      01S0328 00997000
         LA    @06,JCTJNAME(,@06)                               01S0328 00998000
         ST    @06,@AL00001+12                                  01S0328 00999000
         L     @06,LSTJACT                                      01S0328 01000000
         LA    @05,ACTPRGNM(,@06)                               01S0328 01001000
         ST    @05,@AL00001+16                                  01S0328 01002000
         LA    @06,ACTJNFLD(,@06)                               01S0328 01003000
         ST    @06,@AL00001+20                                  01S0328 01004000
         L     @06,LSTSCTP                                      01S0328 01005000
         LA    @05,SCTSNAME(,@06)                               01S0328 01006000
         ST    @05,@AL00001+24                                  01S0328 01007000
         LA    @06,SCTPGMNM(,@06)                               01S0328 01008000
         ST    @06,@AL00001+28                                  01S0328 01009000
         L     @06,LSTSACT                                      01S0328 01010000
         LA    @06,ACTJNFLD(,@06)                               01S0328 01011000
         ST    @06,@AL00001+32                                  01S0328 01012000
         L     @15,@CV00119                                     01S0328 01013000
         LA    @01,@AL00001                                     01S0328 01014000
         BALR  @14,@15                                          01S0328 01015000
*                                       /*INVOKE INSTALLATION EXIT   */ 01016000
*                IF R15^=0 THEN         /* EXIT REJECTS REQUEST      */ 01017000
         LTR   R15,R15                                          01S0329 01018000
         BZ    @RF00329                                         01S0329 01019000
*                  RETCODE=RETCOD8;     /* SET DYN ALLOC RETN CODE   */ 01020000
         MVC   RETCODE(4),@CF00089                              01S0330 01021000
*                ELSE                   /* REQUEST ACCEPTED          */ 01022000
*                  DO;                                          01S0331 01023000
         B     @RC00329                                         01S0331 01024000
@RF00329 DS    0H                                               01S0332 01025000
*                    INPUTSW(1:2)=S99FLAG1; /* MOVE RB FLAGS @YM05495*/ 01026000
         MVC   INPUTSW(2),S99FLAG1(CPYRBP)                      01S0332 01027000
*                    INPUTSW(3:6)=S99FLAG2; /* TO ALFNCMAP   @YM05495*/ 01028000
         MVC   INPUTSW+2(4),S99FLAG2(CPYRBP)                    01S0333 01029000
*                    CALL VERBFUNP(VRBINDEX)->FUNCTION (S99TXTPP,       01030000
*                            S99RSC,LISTBLK,ALFNCMAP,DEPARMS,DEWLASTP,  01031000
*                            SMFPARMS); /* INVOKE FUNCTION BY VERB      01032000
*                                                            @ZA02706*/ 01033000
         LA    @06,S99TXTPP(,CPYRBP)                            01S0334 01034000
         ST    @06,@AL00001                                     01S0334 01035000
         LA    @06,S99RSC(,CPYRBP)                              01S0334 01036000
         ST    @06,@AL00001+4                                   01S0334 01037000
         LA    @06,LISTBLK                                      01S0334 01038000
         ST    @06,@AL00001+8                                   01S0334 01039000
         LA    @06,ALFNCMAP                                     01S0334 01040000
         ST    @06,@AL00001+12                                  01S0334 01041000
         LA    @06,DEPARMS                                      01S0334 01042000
         ST    @06,@AL00001+16                                  01S0334 01043000
         LA    @06,DEWLASTP                                     01S0334 01044000
         ST    @06,@AL00001+20                                  01S0334 01045000
         LA    @06,SMFPARMS                                     01S0334 01046000
         ST    @06,@AL00001+24                                  01S0334 01047000
         LR    @06,VRBINDEX                                     01S0334 01048000
         SLA   @06,3                                            01S0334 01049000
         L     @15,VERBFUNP-8(@06)                              01S0334 01050000
         LA    @01,@AL00001                                     01S0334 01051000
         BALR  @14,@15                                          01S0334 01052000
*                    IF DEWRITP^=0 THEN /*ANYTHING TO WRITE TO SWA   */ 01053000
         L     @10,DEWRITP                                      01S0335 01054000
         LTR   @10,@10                                          01S0335 01055000
         BZ    @RF00335                                         01S0335 01056000
*                      DO;                                      01S0336 01057000
*                                                               01S0336 01058000
*                        SWACTLS = SWACTLS && SWACTLS; /*SWAMGR I/F  */ 01059000
         LH    @10,SWACTLS                                      01S0337 01060000
         N     @10,@CF01836                                     01S0337 01061000
         LR    @06,@10                                          01S0337 01062000
         XR    @06,@10                                          01S0337 01063000
         STH   @06,SWACTLS                                      01S0337 01064000
*                        SWWRT   = ON; /* OPERATION = WRITE          */ 01065000
*                        SWFREE  = ON; /* FREE EPA(S) WHEN DONE      */ 01066000
*                        SWOLD   = ON; /* EPA(S) ALREADY EXIST       */ 01067000
         OI    SWWRT,B'00010101'                                01S0340 01068000
*                        CALL IEFAB4F7 (SWACTLS,DEWRITP,0,0,0,0,0);     01069000
         MVC   @AL00001+8(20),@AL00341                          01S0341 01070000
         LA    @10,SWACTLS                                      01S0341 01071000
         ST    @10,@AL00001                                     01S0341 01072000
         LA    @10,DEWRITP                                      01S0341 01073000
         ST    @10,@AL00001+4                                   01S0341 01074000
         L     @15,@CV00122                                     01S0341 01075000
         LA    @01,@AL00001                                     01S0341 01076000
         BALR  @14,@15                                          01S0341 01077000
*                                      /*SWA MANAGER I/F             */ 01078000
*                      END;                                     01S0342 01079000
*                                                               01S0342 01080000
*                  END;                /*END EXIT-OK GROUP           */ 01081000
@RF00335 DS    0H                                               01S0344 01082000
*                IF S99TIONQ=OFF THEN  /* IF CALLER DIDN'T DO ENQ    */ 01083000
@RC00329 TM    S99TIONQ(CPYRBP),B'00000100'                     01S0344 01084000
         BNZ   @RF00344                                         01S0344 01085000
*                  DO;                 /*                    @Z40FPPD*/ 01086000
*                    RFY (R3) RSTD;    /*                    @Z40FPPD*/ 01087000
*                    R3 = ADDR(DETDQLST); /*ADDR OF DEQ PARM @Z40FPPD*/ 01088000
         LA    R3,DETDQLST                                      01S0347 01089000
*                    GEN(DEQ (,,,),MF=(E,(R3)));                01S0348 01090000
         DEQ (,,,),MF=(E,(R3))                                          01091000
*                                      /*DEQ OFF TIOT        @Z40FPPD*/ 01092000
*                    RFY (R3) UNRSTD;  /*                    @Z40FPPD*/ 01093000
*                  END;                /*                    @Z40FPPD*/ 01094000
*                IF SMFBUF1P ^= ZERO THEN /*SMF RECORD TO WRITE?        01095000
*                                                            @ZA02706*/ 01096000
@RF00344 L     @10,SMFBUF1P                                     01S0351 01097000
         LTR   @10,@10                                          01S0351 01098000
         BZ    @RF00351                                         01S0351 01099000
*                  CALL IEFDB4F9(SMFWRTFN,TCBPTR,0,DEPARMS,JSCDSABQ,    01100000
*                                SMFPARMS); /*WRITE AND FREE THEM       01101000
*                                                            @ZA02706*/ 01102000
         LA    @10,@CB00141                                     01S0352 01103000
         ST    @10,@AL00001                                     01S0352 01104000
         ST    TCBPTR,@TF00001                                  01S0352 01105000
         LA    @10,@TF00001                                     01S0352 01106000
         ST    @10,@AL00001+4                                   01S0352 01107000
         LA    @10,@CF00135                                     01S0352 01108000
         ST    @10,@AL00001+8                                   01S0352 01109000
         LA    @10,DEPARMS                                      01S0352 01110000
         ST    @10,@AL00001+12                                  01S0352 01111000
         L     @10,LSTJSCBP                                     01S0352 01112000
         LA    @10,JSCDSABQ(,@10)                               01S0352 01113000
         ST    @10,@AL00001+16                                  01S0352 01114000
         LA    @10,SMFPARMS                                     01S0352 01115000
         ST    @10,@AL00001+20                                  01S0352 01116000
         L     @15,@CV00124                                     01S0352 01117000
         LA    @01,@AL00001                                     01S0352 01118000
         BALR  @14,@15                                          01S0352 01119000
*              END;                    /*END PARM-LIST OK GROUP      */ 01120000
*            ELSE;                     /*PARM-LIST IN ERROR          */ 01121000
@RF00295 DS    0H                                               01S0355 01122000
*          END;                        /*END COPY-OK GROUP           */ 01123000
*        ELSE;                         /*COPY FAILED                 */ 01124000
@RF00266 DS    0H                                               01S0357 01125000
*/********************************************************************/ 01126000
*/* SEGMENT NAME - RESTORE                                           */ 01127000
*/*                                                                  */ 01128000
*/* DESCRIPTIVE NAME - RESTORE COPIED PARMLIST OVER ORIGINAL         */ 01129000
*/*                                                                  */ 01130000
*/* FUNCTION -                                                       */ 01131000
*/*           RESTORE THE COPIED USER PARAMETER LIST, AS             */ 01132000
*/*           MODIFIED BY VARIOUS DYNAMIC FUNCTIONS, OVER THE        */ 01133000
*/*           USER'S ORIGINAL PARM LIST. (SEE THE 'COPY' SEGMENT).   */ 01134000
*/*                                                                  */ 01135000
*/* OPERATION -                                                      */ 01136000
*/*            . SET A SWITCH WHICH INDICATES (TO THE ESTAE EXIT)    */ 01137000
*/*              THAT ABNORMAL TERMINATION WAS CAUSED BY A PROBABLE  */ 01138000
*/*              USER ERROR - I.E., THE PARAMETER LIST WAS NOT IN    */ 01139000
*/*              STORAGE OWNED BY THE USER.                          */ 01140000
*/*              THIS SWITCH IS SET OFF AT THE END OF THIS SEGMENT.  */ 01141000
*/*                                                                  */ 01142000
*/*            . ALL RESTORES INTO THE USER'S PARM LIST ARE DONE IN  */ 01143000
*/*              THE USER'S KEY, TO PREVENT OVERLAYING STORAGE       */ 01144000
*/*              NOT OWNED BY THE USER.                              */ 01145000
*/*                                                                  */ 01146000
*/*            . ONLY THE REASON CODE IS RESTORED IF IT INDICATES    */ 01147000
*/*              THAT THE USER PARAMETER LIST WAS IN (FORMAT) ERROR  */ 01148000
*/*                                                                  */ 01149000
*/*            . FOR LOOP CONTROL AND DECISION MAKING, USE THE       */ 01150000
*/*              VALUES IN THE COPIED (AND VERIFIED) PARM LIST, IN   */ 01151000
*/*              CASE THE USER HAS FREED AND/OR ALTERED THE          */ 01152000
*/*              ORIGINAL PARM LIST. AN EXCEPTION TO THIS IS THE     */ 01153000
*/*              TEST FOR THE END OF THE TEXTUNIT POINTER (TUP)      */ 01154000
*/*              LIST WHICH MAY HAVE BEEN MODIFIED BY THE            */ 01155000
*/*              INSTALLATION EXIT.  THE HI-ORDER BIT BEING ON IN A  */ 01156000
*/*              POINTER IN -EITHER- LIST IS SUFFICIENT TO STOP      */ 01157000
*/*              SCANNING OF THE POINTER LIST.                       */ 01158000
*/*                                                                  */ 01159000
*/*            . FREEMAIN THE COPY OF THE PARAMETER LIST             */ 01160000
*/*                                                                  */ 01161000
*/*            . THE FOLLOWING ASSUMPTIONS ARE MADE -                */ 01162000
*/*                . IN THE REQUEST BLOCK, ONLY THE REASON CODE      */ 01163000
*/*                  NEED BE RESTORED.                               */ 01164000
*/*                . ONLY TEXTUNITS WITH THE FOLLOWING       @ZA15319*/ 01165000
*/*                  PROPERTIES WILL BE RESTORED -           @ZA15319*/ 01166000
*/*                    NUMBER FIELD OF ONE AND               @ZA15319*/ 01167000
*/*                    THE COPIED TEXT UNIT POINTER HAS NOT  @ZA15319*/ 01168000
*/*                    BEEN ZEROED AND                       @ZA15319*/ 01169000
*/*                    THE COPIED PARAMETER LENGTH IS LESS   @ZA15319*/ 01170000
*/*                    THAN OR EQUAL TO THE ORIGINAL         @ZA15319*/ 01171000
*/*                    PARAMETER LENGTH.                     @ZA15319*/ 01172000
*/*                  THIS SIMPLIFIES THE CODE SINCE ALL KEYS @ZA15319*/ 01173000
*/*                  WHICH REQUEST INFORMATION RETRIEVAL WILL@ZA15319*/ 01174000
*/*                  HAVE THESE PROPERTIES.                  @ZA15319*/ 01175000
*/*                                                                  */ 01176000
*/********************************************************************/ 01177000
*RFY S99RB BASED(S99RBPTR);            /*RESTORE MACRO BASE  SO CAN     01178000
*                                        REFER TO USER'S ORIGINAL COPY  01179000
*                                        WITH IMPLICIT NOTATION      */ 01180000
@RC00266 DS    0H                                               02S0358 01181000
*RFY(R2,R3,R5) RSTD;                   /*REGS USED FOR RESTORING     */ 01182000
*                                                               02S0358 01183000
*USERERSW = ON;                        /*IF ABEND, TELL ESTAE EXIT      01184000
*                                        IT'S A PROBABLE USER ERROR  */ 01185000
         OI    USERERSW,B'00100000'                             02S0359 01186000
* DO; /*MODESET  KEYADDR(KEY0)*/                                02S0360 01187000
*   SPKA (KEY0); /*SET PSW KEY*/                                02S0361 01188000
         L     @10,KEY0                                         02S0361 01189000
         SPKA  0(@10)                                           02S0361 01190000
* END; /*MODESET  KEYADDR(KEY0)*/               /*NEED TO REFERENCE BOT 01191000
*                                                 COPIES SIMULTANEOUSLY 01192000
*      */                                                       02S0362 01193000
*R2 = CPYRBP->S99RSC;                  /*REASON CODE INTO R2         */ 01194000
         L     R2,S99RSC(,CPYRBP)                               02S0363 01195000
*R3 = ADDR(S99RSC);                    /*WHERE TO RESTORE IT         */ 01196000
         L     R3,S99RBPTR(,INPPARM)                            02S0364 01197000
         LA    R3,S99RSC(,R3)                                   02S0364 01198000
* DO; /*MODESET  EXTKEY(RBT234) WORKREG(SAVEKEY)*/              02S0365 01199000
*   SAVEKEY = TCBRBP; /*RB PTR FROM TCB*/                       02S0366 01200000
         L     SAVEKEY,TCBRBP(,TCBPTR)                          02S0366 01201000
*   SAVEKEY = SAVEKEY -> RBLINK; /*NEXT RB ADDRESS*/            02S0367 01202000
         L     SAVEKEY,RBLINK(,SAVEKEY)                         02S0367 01203000
*   SAVEKEY = SAVEKEY -> RBOPSW(2); /*PSW KEY FROM RB OLD PSW*/ 02S0368 01204000
         SLR   @06,@06                                          02S0368 01205000
         IC    @06,RBOPSW+1(,SAVEKEY)                           02S0368 01206000
         LR    SAVEKEY,@06                                      02S0368 01207000
*   SPKA (SAVEKEY); /*SET PSW KEY*/                             02S0369 01208000
         SPKA  0(SAVEKEY)                                       02S0369 01209000
* END; /*MODESET  EXTKEY(RBT234) WORKREG(SAVEKEY)*/ /*OBTAIN USER KEY   01210000
*      */                                                       02S0370 01211000
*GEN(ST R2,0(R3));                     /*RESTORE REASON CODE         */ 01212000
*                                                               02S0371 01213000
         ST R2,0(R3)                                                    01214000
* DO; /*MODESET  KEYADDR(KEY0)*/                                02S0372 01215000
*   SPKA (KEY0); /*SET PSW KEY*/                                02S0373 01216000
         L     @10,KEY0                                         02S0373 01217000
         SPKA  0(@10)                                           02S0373 01218000
* END; /*MODESET  KEYADDR(KEY0)*/               /*NEED TO REFERENCE BOT 01219000
*                                                 COPIES SIMULTANEOUSLY 01220000
*      */                                                       02S0374 01221000
*IF (CPYRBP->S99ERROR&'FF00'X)^='0300'X THEN /*DYN ALLOC. NOT ENDED     01222000
*                                              DUE TO BAD PARM LIST  */ 01223000
         MVC   @TS00001(2),S99ERROR(CPYRBP)                     02S0375 01224000
         NC    @TS00001(2),@CB01809                             02S0375 01225000
         CLC   @TS00001(2),@CB01810                             02S0375 01226000
         BE    @RF00375                                         02S0375 01227000
*  DO;                                                          02S0376 01228000
*    S99TUPP = S99TXTPP;               /*PTR TO USER'S TUP ARRAY     */ 01229000
         L     @10,S99RBPTR(,INPPARM)                           02S0377 01230000
         L     S99TUPP,S99TXTPP(,@10)                           02S0377 01231000
*    CPYTUPP = CPYRBP->S99TXTPP;       /*PTR TO COPY'S TUP ARRAY     */ 01232000
         L     @10,S99TXTPP(,CPYRBP)                            02S0378 01233000
         ST    @10,CPYTUPP                                      02S0378 01234000
*    IF CPYTUPP^=0 & S99TUPP^=0 THEN   /*IF TEXTUNITS TO RESTORE     */ 01235000
         SLR   @09,@09                                          02S0379 01236000
         CR    @10,@09                                          02S0379 01237000
         BE    @RF00379                                         02S0379 01238000
         CR    S99TUPP,@09                                      02S0379 01239000
         BE    @RF00379                                         02S0379 01240000
*      DO;                                                      02S0380 01241000
*        SWQUIT = OFF;                 /*INIT LOOP CONTROL SWITCH    */ 01242000
         NI    SWQUIT,B'10111111'                               02S0381 01243000
*        DO WHILE SWQUIT=OFF;          /*LOOP THRU TEXTUNIT PTRS     */ 01244000
         B     @DE00382                                         02S0382 01245000
@DL00382 DS    0H                                               02S0383 01246000
*          IF S99TUP ^= 0 & CPYTUP^=0 &/*NON-ZERO TEXT PTRS  @ZA15319*/ 01247000
*             S99TUKEY^=0 & S99TUNUM=1 &     /*POSSIBLE REQUEST FOR     01248000
*                                              RETURN INFO   @ZA25578*/ 01249000
*             CPYTUP->S99TULNG ^> S99TULNG THEN /*COPY LESS THAN OR     01250000
*                                                 EQUAL TO ORIGINAL     01251000
*                                                            @ZA15319*/ 01252000
         SLR   @10,@10                                          02S0383 01253000
         L     @09,S99TUP(,S99TUPP)                             02S0383 01254000
         CR    @09,@10                                          02S0383 01255000
         BE    @RF00383                                         02S0383 01256000
         L     @01,CPYTUPP                                      02S0383 01257000
         L     @15,CPYTUP(,@01)                                 02S0383 01258000
         CR    @15,@10                                          02S0383 01259000
         BE    @RF00383                                         02S0383 01260000
         SLR   @14,@14                                          02S0383 01261000
         ICM   @14,3,S99TUKEY(@09)                              02S0383 01262000
         CR    @10,@14                                          02S0383 01263000
         BE    @RF00383                                         02S0383 01264000
         LA    @10,1                                            02S0383 01265000
         ICM   @14,12,S99TUNUM(@09)                             02S0383 01266000
         SRA   @14,16                                           02S0383 01267000
         CR    @10,@14                                          02S0383 01268000
         BNE   @RF00383                                         02S0383 01269000
         ICM   @14,12,S99TULNG(@15)                             02S0383 01270000
         SRA   @14,16                                           02S0383 01271000
         ICM   @01,12,S99TULNG(@09)                             02S0383 01272000
         SRA   @01,16                                           02S0383 01273000
         CR    @14,@01                                          02S0383 01274000
         BH    @RF00383                                         02S0383 01275000
*            DO;                                                02S0384 01276000
*              S99TUFP = S99TUP + KEYNUMLN; /*ADDR OF ORIG LEN/PARM  */ 01277000
         L     @14,KEYNUMLN                                     02S0385 01278000
         ALR   @09,@14                                          02S0385 01279000
         ST    @09,S99TUFP                                      02S0385 01280000
*              CPYTUFP = CPYTUP + KEYNUMLN; /*ADDR OF COP LEN/PARM   */ 01281000
         ALR   @15,@14                                          02S0386 01282000
         ST    @15,CPYTUFP                                      02S0386 01283000
*              DO I=1 BY 1 TO (CPYTUFP->S99TULEN+LENGTH(S99TULEN));     01284000
         ST    @10,I                                            02S0387 01285000
         B     @DE00387                                         02S0387 01286000
@DL00387 DS    0H                                               02S0388 01287000
*                                      /*MOVE EACH BYTE      @ZA15319*/ 01288000
*                R5 = ADDR(S99TUFLD(I)); /*DIRECT PTR TO USER LOC    */ 01289000
         L     R5,S99TUFP                                       02S0388 01290000
         BCTR  R5,0                                             02S0388 01291000
         LA    R5,S99TUFLD(@10,R5)                              02S0388 01292000
*                R3 = ADDR(CPYTUFP->S99TUFLD(I)); /*DIRECT PTR TO COPY* 01293000
         L     R3,CPYTUFP                                       02S0389 01294000
         BCTR  R3,0                                             02S0389 01295000
         LA    R3,S99TUFLD(@10,R3)                              02S0389 01296000
*                GEN(IC R2,0(R3));     /*CHARACTER TO RESTORE        */ 01297000
         IC R2,0(R3)                                                    01298000
*                 DO; /*MODESET  EXTKEY(RBT234) WORKREG(SAVEKEY)*/      01299000
*                   SAVEKEY = TCBRBP; /*RB PTR FROM TCB*/       02S0392 01300000
         L     SAVEKEY,TCBRBP(,TCBPTR)                          02S0392 01301000
*                   SAVEKEY = SAVEKEY -> RBLINK; /*NEXT RB ADDRESS*/    01302000
         L     SAVEKEY,RBLINK(,SAVEKEY)                         02S0393 01303000
*                   SAVEKEY = SAVEKEY -> RBOPSW(2); /*PSW KEY FROM RB O 01304000
*D PSW*/            SPKA (SAVEKEY); /*SET PSW KEY*/             02S0394 01305000
         SLR   @09,@09                                          02S0394 01306000
         IC    @09,RBOPSW+1(,SAVEKEY)                           02S0394 01307000
         LR    SAVEKEY,@09                                      02S0394 01308000
         SPKA  0(SAVEKEY)                                       02S0395 01309000
*                 END; /*MODESET  EXTKEY(RBT234) WORKREG(SAVEKEY)*/     01310000
*                                      /*KEY OF CALLER               */ 01311000
*                GEN(STC R2,0(R5));    /*RESTORE 1 BYTE OF TEXT UNIT */ 01312000
         STC R2,0(R5)                                                   01313000
*                 DO; /*MODESET  KEYADDR(KEY0)*/                02S0398 01314000
*                   SPKA (KEY0); /*SET PSW KEY*/                02S0399 01315000
         L     @10,KEY0                                         02S0399 01316000
         SPKA  0(@10)                                           02S0399 01317000
*                 END; /*MODESET  KEYADDR(KEY0)*/ /*RETURN TO KEY ZERO  01318000
*      */                                                       02S0400 01319000
*              END;                    /*END 'RESTORE BYTES' LOOP    */ 01320000
         LA    @10,1                                            02S0401 01321000
         AL    @10,I                                            02S0401 01322000
         ST    @10,I                                            02S0401 01323000
@DE00387 LA    @09,2                                            02S0401 01324000
         L     @01,CPYTUFP                                      02S0401 01325000
         ICM   @15,12,S99TULEN(@01)                             02S0401 01326000
         SRA   @15,16                                           02S0401 01327000
         ALR   @09,@15                                          02S0401 01328000
         CR    @10,@09                                          02S0401 01329000
         BNH   @DL00387                                         02S0401 01330000
*            END;                                               02S0402 01331000
*          ELSE;                       /*NOT REQUEST FOR RETURNED INFO* 01332000
@RF00383 DS    0H                                               02S0404 01333000
*          IF CPYTUPP->S99TUPND=ON     /*END OF EITHER LIST          */ 01334000
*           | S99TUPP->S99TUPND=ON THEN                         02S0404 01335000
         L     @10,CPYTUPP                                      02S0404 01336000
         TM    S99TUPND(@10),B'10000000'                        02S0404 01337000
         BO    @RT00404                                         02S0404 01338000
         TM    S99TUPND(S99TUPP),B'10000000'                    02S0404 01339000
         BNO   @RF00404                                         02S0404 01340000
@RT00404 DS    0H                                               02S0405 01341000
*            SWQUIT = ON;              /*END LOOP                    */ 01342000
         OI    SWQUIT,B'01000000'                               02S0405 01343000
*          ELSE                        /*MORE TEXTUNIT POINTERS      */ 01344000
*            DO;                                                02S0406 01345000
         B     @RC00404                                         02S0406 01346000
@RF00404 DS    0H                                               02S0407 01347000
*              CPYTUPP = CPYTUPP + 4;  /*POINT TO NEXT 'COPY' TUP    */ 01348000
         LA    @10,4                                            02S0407 01349000
         L     @09,CPYTUPP                                      02S0407 01350000
         ALR   @09,@10                                          02S0407 01351000
         ST    @09,CPYTUPP                                      02S0407 01352000
*              S99TUPP = S99TUPP + 4;  /*POINT TO NEXT 'USER' TUP    */ 01353000
         ALR   S99TUPP,@10                                      02S0408 01354000
*            END;                                               02S0409 01355000
*        END;                          /*END LOOP THRU TUP'S         */ 01356000
@RC00404 DS    0H                                               02S0410 01357000
@DE00382 TM    SWQUIT,B'01000000'                               02S0410 01358000
         BZ    @DL00382                                         02S0410 01359000
*      END;                                                     02S0411 01360000
*    ELSE;                             /*NO TUP'S PRESENT            */ 01361000
@RF00379 DS    0H                                               02S0413 01362000
*  END;                                                         02S0413 01363000
*ELSE;                                 /*BAD PARMLIST ERRCODE        */ 01364000
@RF00375 DS    0H                                               02S0415 01365000
* DO; /*MODESET  EXTKEY(SCHED)*/                                02S0415 01366000
*   SPKA (16); /*SET PSW KEY*/                                  02S0416 01367000
         LA    @10,16                                           02S0416 01368000
         SPKA  0(@10)                                           02S0416 01369000
* END; /*MODESET  EXTKEY(SCHED)*/               /*RESTORE DONE  02S0417 01370000
*      */                                                       02S0417 01371000
*R0 = CPYSIZE;                         /*LENGTH AND SUBPOOL OF COPY     01372000
*                                        CORE                        */ 01373000
         L     R0,CPYSIZE                                       02S0418 01374000
*R1 = CPYLOC;                          /*ADDR OF COPY CORE           */ 01375000
         L     R1,CPYLOC                                        02S0419 01376000
*GEN(FREEMAIN R,LV=(0),A=(1));         /*FREE COPY CORE              */ 01377000
         FREEMAIN R,LV=(0),A=(1)                                        01378000
*RFY(R2,R3,R5) UNRSTD;                                          02S0421 01379000
*USERERSW = OFF;                       /*END OF USER ERROR SITUATION */ 01380000
         NI    USERERSW,B'11011111'                             02S0422 01381000
*      END;                            /*END SCAN-OK GROUP           */ 01382000
*    ELSE                              /*ERROR IN SCAN               */ 01383000
*      DO;                                                      01S0424 01384000
         B     @RC00184                                         01S0424 01385000
@RF00184 DS    0H                                               01S0425 01386000
*        USERERSW = ON;                /*IF ABEND, TELL ESTAE EXIT      01387000
*                                        IT'S A PROBABLE USER ERROR  */ 01388000
         OI    USERERSW,B'00100000'                             01S0425 01389000
*        RFY (R2) RSTD;                /*NEED TO SET ERROR CODE      */ 01390000
*        R2 = RCINFMAT;                /*ERROR CODE TO SET           */ 01391000
         LA    R2,876                                           01S0427 01392000
*        SLA(R2,SIXTEEN);              /* PUT IN HIGH ORDER  @YM07234*/ 01393000
         SLA   R2,16                                            01S0428 01394000
*         DO; /*MODESET  EXTKEY(RBT234) WORKREG(SAVEKEY)*/      01S0429 01395000
*           SAVEKEY = TCBRBP; /*RB PTR FROM TCB*/               01S0430 01396000
         L     SAVEKEY,TCBRBP(,TCBPTR)                          01S0430 01397000
*           SAVEKEY = SAVEKEY -> RBLINK; /*NEXT RB ADDRESS*/    01S0431 01398000
         L     SAVEKEY,RBLINK(,SAVEKEY)                         01S0431 01399000
*           SAVEKEY = SAVEKEY -> RBOPSW(2); /*PSW KEY FROM RB OLD PSW*/ 01400000
         SLR   @09,@09                                          01S0432 01401000
         IC    @09,RBOPSW+1(,SAVEKEY)                           01S0432 01402000
         LR    SAVEKEY,@09                                      01S0432 01403000
*           SPKA (SAVEKEY); /*SET PSW KEY*/                     01S0433 01404000
         SPKA  0(SAVEKEY)                                       01S0433 01405000
*         END; /*MODESET  EXTKEY(RBT234) WORKREG(SAVEKEY)*//*GET KEY OF 01406000
*CALLER*/                                                       01S0434 01407000
*        S99RSC = R2;                  /*SET INVALID PARM LIST CODE  */ 01408000
         L     @10,S99RBPTR(,INPPARM)                           01S0435 01409000
         ST    R2,S99RSC(,@10)                                  01S0435 01410000
*         DO; /*MODESET  EXTKEY(SCHED)*/                        01S0436 01411000
*           SPKA (16); /*SET PSW KEY*/                          01S0437 01412000
         LA    @10,16                                           01S0437 01413000
         SPKA  0(@10)                                           01S0437 01414000
*         END; /*MODESET  EXTKEY(SCHED)*/       /*BACK TO SCHED KEY     01415000
*      */                                                       01S0438 01416000
*        RFY (R2) UNRSTD;                                       01S0439 01417000
*        USERERSW = OFF;               /*END OF USER ERROR SITUATION */ 01418000
         NI    USERERSW,B'11011111'                             01S0440 01419000
*      END;                                                     01S0441 01420000
*    GEN;                                                       01S0442 01421000
@RC00184 DS    0H                                               01S0442 01422000
      ESTAE 0                                                           01423000
*  END;                                /*END ESTAE-OK GROUP          */ 01424000
*ELSE                                  /*ESTAE FAILED                */ 01425000
*  DO;                                                          01S0444 01426000
         B     @RC00136                                         01S0444 01427000
@RF00136 DS    0H                                               01S0445 01428000
*    RFY (R2) RSTD;                    /*NEED TO SET ERROR CODE      */ 01429000
*    R2 = RCESTAER;                    /*ERROR CODE TO SET           */ 01430000
         LA    R2,1148                                          01S0446 01431000
*    SLA(R2,SIXTEEN);                  /* PUT IN HIGH ORDER  @YM07234*/ 01432000
         SLA   R2,16                                            01S0447 01433000
*     DO; /*MODESET  EXTKEY(RBT234) WORKREG(SAVEKEY)*/          01S0448 01434000
*       SAVEKEY = TCBRBP; /*RB PTR FROM TCB*/                   01S0449 01435000
         L     SAVEKEY,TCBRBP(,TCBPTR)                          01S0449 01436000
*       SAVEKEY = SAVEKEY -> RBLINK; /*NEXT RB ADDRESS*/        01S0450 01437000
         L     SAVEKEY,RBLINK(,SAVEKEY)                         01S0450 01438000
*       SAVEKEY = SAVEKEY -> RBOPSW(2); /*PSW KEY FROM RB OLD PSW*/     01439000
         SLR   @09,@09                                          01S0451 01440000
         IC    @09,RBOPSW+1(,SAVEKEY)                           01S0451 01441000
         LR    SAVEKEY,@09                                      01S0451 01442000
*       SPKA (SAVEKEY); /*SET PSW KEY*/                         01S0452 01443000
         SPKA  0(SAVEKEY)                                       01S0452 01444000
*     END; /*MODESET  EXTKEY(RBT234) WORKREG(SAVEKEY)*/ /*GET KEY OF CA 01445000
*LER   */                                                       01S0453 01446000
*    S99RSC = R2;                      /*SET ESTAE FAILED CODE       */ 01447000
         L     @10,S99RBPTR(,INPPARM)                           01S0454 01448000
         ST    R2,S99RSC(,@10)                                  01S0454 01449000
*     DO; /*MODESET  EXTKEY(SCHED)*/                            01S0455 01450000
*       SPKA (16); /*SET PSW KEY*/                              01S0456 01451000
         LA    @10,16                                           01S0456 01452000
         SPKA  0(@10)                                           01S0456 01453000
*     END; /*MODESET  EXTKEY(SCHED)*/           /*BACK TO SCHED KEY     01454000
*      */                                                       01S0457 01455000
*    RFY (R2) UNRSTD;                                           01S0458 01456000
*  END;                                                         01S0459 01457000
*                                                               01S0459 01458000
*                                                               01S0459 01459000
* DO; /*MODESET  KEYADDR(KEY0)*/                                01S0460 01460000
@RC00136 DS    0H                                               01S0461 01461000
*   SPKA (KEY0); /*SET PSW KEY*/                                01S0461 01462000
         L     @10,KEY0                                         01S0461 01463000
         SPKA  0(@10)                                           01S0461 01464000
* END; /*MODESET  KEYADDR(KEY0)*/               /*REF BOTH USER AND SVC 01465000
*S CORE */                                                      01S0462 01466000
*                                                               01S0462 01467000
*IF S99ERROR^=0 THEN                   /* ANY ERROR                  */ 01468000
         L     @10,S99RBPTR(,INPPARM)                           01S0463 01469000
         LH    @09,S99ERROR(,@10)                               01S0463 01470000
         N     @09,@CF01836                                     01S0463 01471000
         LTR   @09,@09                                          01S0463 01472000
         BZ    @RF00463                                         01S0463 01473000
*  IF (S99ERROR&'FF00'X)='0300'X THEN  /* 300 SERIES ERROR           */ 01474000
         MVC   @TS00001(2),S99ERROR(@10)                        01S0464 01475000
         NC    @TS00001(2),@CB01809                             01S0464 01476000
         CLC   @TS00001(2),@CB01810                             01S0464 01477000
         BNE   @RF00464                                         01S0464 01478000
*    RETCODE = RETCOD12;               /* PARM LIST ERROR RETN CODE  */ 01479000
         MVC   RETCODE(4),@CF00106                              01S0465 01480000
*  ELSE                                                         01S0466 01481000
*    RETCODE = RETCOD4;                /* ENVIRONMENTAL ERROR        */ 01482000
*                                                               01S0466 01483000
         B     @RC00464                                         01S0466 01484000
@RF00464 MVC   RETCODE(4),@CF00074                              01S0466 01485000
*RFY (REASCODE) RSTD;                                           01S0467 01486000
@RC00464 DS    0H                                               01S0467 01487000
@RF00463 DS    0H                                               01S0468 01488000
*REASCODE = S99RSC;                    /*SAVE AROUND EPILOG          */ 01489000
*                                                               01S0468 01490000
         L     @10,S99RBPTR(,INPPARM)                           01S0468 01491000
         L     REASCODE,S99RSC(,@10)                            01S0468 01492000
* DO; /*MODESET  EXTKEY(SCHED)*/                                01S0469 01493000
*   SPKA (16); /*SET PSW KEY*/                                  01S0470 01494000
         LA    @10,16                                           01S0470 01495000
         SPKA  0(@10)                                           01S0470 01496000
* END; /*MODESET  EXTKEY(SCHED)*/               /*SCHED KEY FOR GSPACE  01497000
*      */                                                       01S0471 01498000
*                                                               01S0471 01499000
*RETURN CODE(RETCODE) TO EXIT;         /*GENERATE PL/S EPILOG        */ 01500000
         L     @10,RETCODE                                      01S0472 01501000
         IC    @02,@OLDKEY                                      01S0472 01502000
         L     @13,4(,@13)                                      01S0472 01503000
         L     @00,@SIZDATD                                     01S0472 01504000
         LR    @01,@11                                          01S0472 01505000
         FSPACE   R,LV=(0),A=(1)                                        01506000
         MODESET KEYADDR=(2)                                            01507000
         LR    @15,@10                                          01S0472 01508000
         LA    @14,EXIT                                         01S0472 01509000
         BR    @14                                              01S0472 01510000
*EXIT:                                 /*EXIT TO CALLER              */ 01511000
*R0 = REASCODE;                        /*REASON CODE FOR TRACE TABLE */ 01512000
EXIT     LR    R0,REASCODE                                      01S0473 01513000
*SVC(3);                               /*STANDARD SVC EXIT           */ 01514000
*                                                               01S0474 01515000
         SVC   3                                                01S0474 01516000
*END IEFDB400                                                   01S0475 01517000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 01518000
*/*%INCLUDE SYSLIB  (SVC99DAT)                                        * 01519000
*/*%INCLUDE SYSLIB  (IEFZB4D0)                                        * 01520000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                        * 01521000
*/*%INCLUDE SYSLIB  (IEZJSCB )                                        * 01522000
*/*%INCLUDE SYSLIB  (IHAASCB )                                        * 01523000
*/*%INCLUDE SYSLIB  (IEFZB4D9)                                        * 01524000
*/*%INCLUDE SYSLIB  (IEFZB4D7)                                        * 01525000
*/*%INCLUDE SYSLIB  (IEFZB453)                                        * 01526000
*/*%INCLUDE SYSLIB  (IEFZB505)                                        * 01527000
*/*%INCLUDE SYSLIB  (IEFAJCTB)                                        * 01528000
*/*%INCLUDE SYSLIB  (IEFASCTB)                                        * 01529000
*/*%INCLUDE SYSLIB  (IEFZB436)                                        * 01530000
*/*%INCLUDE SYSLIB  (IHAQDB  )                                        * 01531000
*/*%INCLUDE SYSLIB  (IEFZB4D5)                                        * 01532000
*/*%INCLUDE SYSLIB  (IHADSAB )                                        * 01533000
*/*%INCLUDE SYSLIB  (IHARB   )                                        * 01534000
*/*%INCLUDE SYSLIB  (IKJRB   )                                        * 01535000
*/*%INCLUDE SYSLIB  (IEFZB4DA)                                        * 01536000
*/*%INCLUDE SYSLIB  (ESTAECOD)                                        * 01537000
*/*%INCLUDE SYSLIB  (ESTAESPC)                                        * 01538000
*/*%INCLUDE SYSLIB  (SCAN    )                                        * 01539000
*/*%INCLUDE SYSLIB  (COPY    )                                        * 01540000
*/*%INCLUDE SYSLIB  (S99CHKRB)                                        * 01541000
*/*%INCLUDE SYSLIB  (READSWA )                                        * 01542000
*/*%INCLUDE SYSLIB  (RESTORE )                                        * 01543000
*;                                                              01S0475 01544000
@EL00001 IC    @02,@OLDKEY                                      01S0475 01545000
         L     @13,4(,@13)                                      01S0475 01546000
@EF00001 L     @00,@SIZDATD                                     01S0475 01547000
         LR    @01,@11                                          01S0475 01548000
         FSPACE   R,LV=(0),A=(1)                                        01549000
         MODESET KEYADDR=(2)                                            01550000
@ER00001 BR    @14                                              01S0475 01551000
@DATA    DS    0H                                                       01552000
@SM01827 MVC   MACWORK(0),ESTALIST                                      01553000
@SM01834 MVC   S99TUNIT(0,@05),S99TUNIT(@15)                            01554000
@SM01837 MVC   S99TUFLD(0,@05),S99TUFLD(@14)                            01555000
@SX01839 XC    EXITCORE+256(0,@06),EXITCORE+256(@06)                    01556000
@SM01841 MVC   DETDQLST(0),ENQLIST                                      01557000
         DS    0F                                                       01558000
@AL00313 EQU   *                       LIST WITH   6 ARGUMENT(S)        01559000
@AL00318 EQU   *                       LIST WITH   6 ARGUMENT(S)        01560000
@AL00341 DC    A(@CF00135)             LIST WITH   5 ARGUMENT(S)        01561000
         DC    A(@CF00135)                                              01562000
         DC    A(@CF00135)                                              01563000
         DC    A(@CF00135)                                              01564000
         DC    A(@CF00135)                                              01565000
         DC    A(@CF00073)                                              01566000
@DATD    DSECT                                                          01567000
         DS    0F                                                       01568000
@SA00001 DS    18F                                                      01569000
@PC00001 DS    1F                                                       01570000
@AL00001 DS    9A                                                       01571000
@TF00001 DS    F                                                        01572000
@TF00002 DS    F                                                        01573000
IEFDB400 CSECT                                                          01574000
         DS    0F                                                       01575000
@CF00135 DC    F'0'                                                     01576000
@CF00078 DC    F'1'                                                     01577000
@CF00073 DC    F'2'                                                     01578000
@CF00074 DC    F'4'                                                     01579000
@CF00089 DC    F'8'                                                     01580000
@CF00106 DC    F'12'                                                    01581000
@CF01796 DC    F'257'                                                   01582000
@CF01800 DC    XL4'7FFFFFFF'                                            01583000
@CF01836 DC    XL4'0000FFFF'                                            01584000
@DATD    DSECT                                                          01585000
         DS    0D                                                       01586000
LSTJACT  DS    A                                                        01587000
LSTSACT  DS    A                                                        01588000
RETCODE  DS    A                                                        01589000
DMYRETNA DS    F                                                        01590000
I        DS    A                                                        01591000
CPYTUPP  DS    A                                                        01592000
S99TUFP  DS    A                                                        01593000
CPYTUFP  DS    A                                                        01594000
EXITLOC  DS    A                                                        01595000
TUPSIZE  DS    F                                                        01596000
KEYNUMLN DS    F                                                        01597000
SWEPAPTR DS    A                                                        01598000
JCTPTR   DS    A                                                        01599000
SCTPTR   DS    A                                                        01600000
QDBPTR   DS    A                                                        01601000
DSABPTR  DS    A                                                        01602000
RBSECPTR DS    A                                                        01603000
SWACTLS  DS    FL2                                                      01604000
         ORG   SWACTLS                                                  01605000
SWASN    DS    BL1                                                      01606000
SWDEL    EQU   SWACTLS+0                                                01607000
SWREAD   EQU   SWACTLS+0                                                01608000
SWWRT    EQU   SWACTLS+0                                                01609000
SWNEW    EQU   SWACTLS+0                                                01610000
SWFREE   EQU   SWACTLS+0                                                01611000
SWMOD    EQU   SWACTLS+0                                                01612000
SWOLD    EQU   SWACTLS+0                                                01613000
SWCHN    DS    BL1                                                      01614000
@NM00059 EQU   SWACTLS+1                                                01615000
         ORG   SWACTLS+2                                                01616000
@TS00001 DS    CL2                                                      01617000
LISTBLK  DS    CL20                                                     01618000
         ORG   LISTBLK                                                  01619000
LSTJSCBP DS    AL4                                                      01620000
LSTASCBP DS    AL4                                                      01621000
LSTTCBP  DS    AL4                                                      01622000
LSTJCTP  DS    AL4                                                      01623000
LSTSCTP  DS    AL4                                                      01624000
         ORG   LISTBLK+20                                               01625000
SMFPARMS DS    CL8                                                      01626000
         ORG   SMFPARMS                                                 01627000
SMFBUF1P DS    AL4                                                      01628000
SMFBUFLP DS    AL4                                                      01629000
         ORG   SMFPARMS+8                                               01630000
ASWACORE DS    CL40                                                     01631000
MACWORK  DS    CL48                                                     01632000
FUNCTMAP DS    BL1                                                      01633000
         ORG   FUNCTMAP                                                 01634000
SCANSCT  DS    BL1                                                      01635000
SCANDSAB EQU   FUNCTMAP+0                                               01636000
SIOTONLY EQU   FUNCTMAP+0                                               01637000
NOJFCBX  EQU   FUNCTMAP+0                                               01638000
NOEPA    EQU   FUNCTMAP+0                                               01639000
UPDTDSAB EQU   FUNCTMAP+0                                               01640000
@NM00002 EQU   FUNCTMAP+0                                               01641000
         ORG   FUNCTMAP+1                                               01642000
SWITCHES DS    BL1                                                      01643000
         ORG   SWITCHES                                                 01644000
SWSCANER DS    BL1                                                      01645000
SWQUIT   EQU   SWITCHES+0                                               01646000
SWFNDVRB EQU   SWITCHES+0                                               01647000
         ORG   SWITCHES+1                                               01648000
ENQRNAME DS    CL6                                                      01649000
         ORG   ENQRNAME                                                 01650000
ENQRASID DS    CL2                                                      01651000
ENQRQDB  DS    CL4                                                      01652000
         ORG   ENQRNAME+6                                               01653000
DEPARMS  DS    CL308                                                    01654000
         ORG   DEPARMS                                                  01655000
DECORE   DS    CL200                                                    01656000
DEALFMAP DS    AL4                                                      01657000
DETCB    DS    AL4                                                      01658000
DESIOT   DS    AL4                                                      01659000
DEJCT    DS    AL4                                                      01660000
DESCT    DS    AL4                                                      01661000
DEJSCB   DS    AL4                                                      01662000
DECPYLOC DS    AL4                                                      01663000
DECPYLEN DS    FL4                                                      01664000
DENQRETN DS    CL8                                                      01665000
         ORG   DENQRETN                                                 01666000
DEDSNQEN DS    AL4                                                      01667000
DEDSNQRC DS    AL4                                                      01668000
         ORG   DEPARMS+240                                              01669000
DEDMYEPA DS    CL16                                                     01670000
         ORG   DEDMYEPA                                                 01671000
@NM00011 DS    3A                                                       01672000
DEWRITP  DS    AL4                                                      01673000
         ORG   DEPARMS+256                                              01674000
DEWLASTP DS    AL4                                                      01675000
DEDMYAS  DS    CL16                                                     01676000
         ORG   DEDMYAS                                                  01677000
@NM00012 DS    3A                                                       01678000
DEASGNP  DS    AL4                                                      01679000
         ORG   DEPARMS+276                                              01680000
DEALASTP DS    AL4                                                      01681000
DETDQLST DS    CL16                                                     01682000
DETCTIOP DS    AL4                                                      01683000
DETCTIOL DS    FL4                                                      01684000
@NM00013 DS    AL4                                                      01685000
         ORG   DEPARMS+308                                              01686000
ALFNCMAP DS    CL8                                                      01687000
         ORG   ALFNCMAP                                                 01688000
INPUTSW  DS    CL6                                                      01689000
         ORG   INPUTSW                                                  01690000
ONCNVTSW DS    BL1                                                      01691000
NOCNVTSW EQU   INPUTSW+0                                                01692000
NOMONTSW EQU   INPUTSW+0                                                01693000
JOBRLSYS EQU   INPUTSW+0                                                01694000
@NM00014 EQU   INPUTSW+0                                                01695000
         DS    CL1                                                      01696000
WTVOLSW  DS    BL1                                                      01697000
WTDSNSW  EQU   INPUTSW+2                                                01698000
NORESSW  EQU   INPUTSW+2                                                01699000
WTUNTSW  EQU   INPUTSW+2                                                01700000
OFFLINSW EQU   INPUTSW+2                                                01701000
TIOTNQSW EQU   INPUTSW+2                                                01702000
CATLOGSW EQU   INPUTSW+2                                                01703000
MOUNTSW  EQU   INPUTSW+2                                                01704000
UNITDEVT DS    BL1                                                      01705000
PCATINIT EQU   INPUTSW+3                                                01706000
@NM00015 EQU   INPUTSW+3                                                01707000
         ORG   ALFNCMAP+6                                               01708000
PROCESSW DS    CL2                                                      01709000
         ORG   PROCESSW                                                 01710000
DYNMSSTM DS    BL1                                                      01711000
COPYSW   EQU   PROCESSW+0                                               01712000
ERRPROSW EQU   PROCESSW+0                                               01713000
         ORG   ERRPROSW                                                 01714000
DEQDSNSW EQU   ERRPROSW+0                                               01715000
UNALOCSW EQU   ERRPROSW+0                                               01716000
         ORG   PROCESSW+0                                               01717000
NQEXCLSW EQU   PROCESSW+0                                               01718000
DCBSPCSW EQU   PROCESSW+0                                               01719000
FRRPERSW EQU   PROCESSW+0                                               01720000
EPAJCTSW EQU   PROCESSW+0                                               01721000
         DS    CL1                                                      01722000
EPASCTSW DS    BL1                                                      01723000
EPALSISW EQU   PROCESSW+1                                               01724000
USERERSW EQU   PROCESSW+1                                               01725000
DISMSGSW EQU   PROCESSW+1                                               01726000
HSKPDQSW EQU   PROCESSW+1                                               01727000
DYNMSSOK EQU   PROCESSW+1                                               01728000
@NM00016 EQU   PROCESSW+1                                               01729000
         ORG   ALFNCMAP+8                                               01730000
AB4EDPMS DS    CL500                                                    01731000
SMIPARM  DS    CL4                                                      01732000
         ORG   SMIPARM+0                                                01733000
SMISVA   DS    CL3                                                      01734000
SMIID    DS    CL1                                                      01735000
         ORG   SMIPARM+8                                                01736000
@OLDKEY  DS    AL1                                                      01737000
IEFDB400 CSECT                                                          01738000
         DS    0F                                                       01739000
@SIZDATD DC    AL1(230)                                                 01740000
         DC    AL3(@ENDDATD-@DATD)                                      01741000
@CV00119 DC    V(IEFDB401)                                              01742000
@CV00120 DC    V(IEFDB402)                                              01743000
@CV00121 DC    V(IEFAB4ED)                                              01744000
@CV00122 DC    V(IEFAB4F7)                                              01745000
@CV00123 DC    V(IEFAB4FE)                                              01746000
@CV00124 DC    V(IEFDB4F9)                                              01747000
@CV00125 DC    V(IEFDB410)                                              01748000
@CV00126 DC    V(IEFDB450)                                              01749000
@CV00127 DC    V(IEFDB460)                                              01750000
@CV00128 DC    V(IEFDB470)                                              01751000
@CV00129 DC    V(IEFDB480)                                              01752000
@CV00130 DC    V(IEFDB490)                                              01753000
@CV00131 DC    V(IEFDB4A0)                                              01754000
         DS    0D                                                       01755000
KEY0     DC    F'0'                                                     01756000
EXITSIZE DC    F'500'                                                   01757000
@CC00145 DC    C'IEFDB402'                                              01758000
@CC00143 DC    C'ASWA'                                                  01759000
@CB01628 DC    X'0368'                                                  01760000
@CB01630 DC    X'036C'                                                  01761000
@CB01809 DC    X'FF00'                                                  01762000
@CB01810 DC    X'0300'                                                  01763000
@CB00141 DC    X'05'                                                    01764000
         DS    CL1                                                      01765000
S99VDICT DS    CL58                                                     01766000
         ORG   S99VDICT                                                 01767000
S99VNB   DC    H'7'                                                     01768000
S99VRB1  DC    X'01000000'                                              01769000
S99FUN1  DC    VL4(IEFDB410)                                            01770000
S99VRB2  DC    X'03000000'                                              01771000
S99FUN2  DC    VL4(IEFDB450)                                            01772000
S99VRB3  DC    X'04000000'                                              01773000
S99FUN3  DC    VL4(IEFDB460)                                            01774000
S99VRB4  DC    X'07000000'                                              01775000
S99FUN4  DC    VL4(IEFDB470)                                            01776000
S99VRB5  DC    X'05000000'                                              01777000
S99FUN5  DC    VL4(IEFDB480)                                            01778000
S99VRB6  DC    X'06000000'                                              01779000
S99FUN6  DC    VL4(IEFDB490)                                            01780000
S99VRB7  DC    X'02000000'                                              01781000
S99FUN7  DC    VL4(IEFDB4A0)                                            01782000
         ORG   S99VDICT+58                                              01783000
ENQQNAME DC    CL8'SYSZTIOT'                                            01784000
CPYSUBP  DC    X'E5000000'                                              01785000
IEFDB400 CSECT                                                          01786000
ESTALIST ESTAE MF=L                                                     01787000
ESTALEN  DC   A(*-ESTALIST)           ESTAE LIST LENGTH       @Z40FPPG  01788000
*                                                                       01789000
ENQLIST  ENQ   (ENQQNAME,,E,6,SYSTEM),MF=L                              01790000
ENQLISTL DC    A(*-ENQLIST)           LEN OF ENQ/DEQ LIST FORM@Z40FPPD  01791000
IEFDB400 CSECT                                                          01792000
         DS   0H                                                        01793000
PATCHLOC DC ((@DATA-@PSTART)/20)X'00'                                   01794000
@DATD    DSECT                                                          01795000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01796000
@ENDDATD EQU   *                                                        01797000
IEFDB400 CSECT                                                          01798000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01799000
@01      EQU   01                                                       01800000
@02      EQU   02                                                       01801000
@03      EQU   03                                                       01802000
@04      EQU   04                                                       01803000
@05      EQU   05                                                       01804000
@06      EQU   06                                                       01805000
@07      EQU   07                                                       01806000
@08      EQU   08                                                       01807000
@09      EQU   09                                                       01808000
@10      EQU   10                                                       01809000
@11      EQU   11                                                       01810000
@12      EQU   12                                                       01811000
@13      EQU   13                                                       01812000
@14      EQU   14                                                       01813000
@15      EQU   15                                                       01814000
S99TUPP  EQU   @06                                                      01815000
CPYRBP   EQU   @09                                                      01816000
CPYEND   EQU   @03                                                      01817000
SAVEKEY  EQU   @10                                                      01818000
VRBINDEX EQU   @10                                                      01819000
ASWAPTR  EQU   @05                                                      01820000
INPPARM  EQU   @08                                                      01821000
ASCBPTR  EQU   @07                                                      01822000
TCBPTR   EQU   @04                                                      01823000
R0       EQU   @00                                                      01824000
R1       EQU   @01                                                      01825000
R2       EQU   @02                                                      01826000
R3       EQU   @03                                                      01827000
R5       EQU   @05                                                      01828000
R15      EQU   @15                                                      01829000
REASCODE EQU   @05                                                      01830000
R14      EQU   @14                                                      01831000
R4       EQU   @04                                                      01832000
ASWA     EQU   0                                                        01833000
ASWAID   EQU   ASWA                                                     01834000
ASWACSCT EQU   ASWA+4                                                   01835000
ASWARTNP EQU   ASWA+12                                                  01836000
ASWAPRMS EQU   ASWA+16                                                  01837000
ASWASCBP EQU   ASWA+20                                                  01838000
ASWAFLGS EQU   ASWA+28                                                  01839000
ASWADSWS EQU   ASWAFLGS                                                 01840000
ASWADYNF EQU   ASWADSWS                                                 01841000
ASWADYUE EQU   ASWADSWS                                                 01842000
ASWANOCH EQU   ASWADSWS                                                 01843000
ASWAAUTO EQU   ASWA+32                                                  01844000
FUNCTION EQU   0                                                        01845000
CPYTUP   EQU   0                                                        01846000
EXITCORE EQU   0                                                        01847000
S99RBPTR EQU   0                                                        01848000
S99RBPND EQU   S99RBPTR                                                 01849000
S99RB    EQU   0                                                        01850000
S99RBLN  EQU   S99RB                                                    01851000
S99VERB  EQU   S99RB+1                                                  01852000
S99FLAG1 EQU   S99RB+2                                                  01853000
S99FLG11 EQU   S99FLAG1                                                 01854000
S99FLG12 EQU   S99FLAG1+1                                               01855000
S99RSC   EQU   S99RB+4                                                  01856000
S99ERROR EQU   S99RSC                                                   01857000
S99TXTPP EQU   S99RB+8                                                  01858000
S99RSV01 EQU   S99RB+12                                                 01859000
S99FLAG2 EQU   S99RB+16                                                 01860000
S99FLG21 EQU   S99FLAG2                                                 01861000
S99TIONQ EQU   S99FLG21                                                 01862000
S99FLG22 EQU   S99FLAG2+1                                               01863000
S99TUPL  EQU   0                                                        01864000
S99TUPTR EQU   S99TUPL                                                  01865000
S99TUP   EQU   0                                                        01866000
S99TUPND EQU   S99TUP                                                   01867000
S99TUNIT EQU   0                                                        01868000
S99TUKEY EQU   S99TUNIT                                                 01869000
S99TUNUM EQU   S99TUNIT+2                                               01870000
S99TUENT EQU   S99TUNIT+4                                               01871000
S99TULNG EQU   S99TUENT                                                 01872000
S99TUFLD EQU   0                                                        01873000
S99TULEN EQU   S99TUFLD                                                 01874000
TCBFIX   EQU   0                                                        01875000
TCBFRS   EQU   TCBFIX                                                   01876000
TCB      EQU   0                                                        01877000
TCBRBP   EQU   TCB                                                      01878000
TCBPIE   EQU   TCB+4                                                    01879000
TCBPMASK EQU   TCBPIE                                                   01880000
TCBCMP   EQU   TCB+16                                                   01881000
TCBCMPF  EQU   TCBCMP                                                   01882000
TCBCPP   EQU   TCBCMPF                                                  01883000
TCBSTCC  EQU   TCBCMPF                                                  01884000
TCBCDBL  EQU   TCBCMPF                                                  01885000
TCBCWTO  EQU   TCBCMPF                                                  01886000
TCBCIND  EQU   TCBCMPF                                                  01887000
TCBCMSG  EQU   TCBCMPF                                                  01888000
TCBTRN   EQU   TCB+20                                                   01889000
TCBABF   EQU   TCBTRN                                                   01890000
TCBMSS   EQU   TCB+24                                                   01891000
TCBPKF   EQU   TCB+28                                                   01892000
TCBFLGS  EQU   TCB+29                                                   01893000
TCBFLGS1 EQU   TCBFLGS                                                  01894000
TCBFLGS2 EQU   TCBFLGS+1                                                01895000
TCBFLGS3 EQU   TCBFLGS+2                                                01896000
TCBFLGS4 EQU   TCBFLGS+3                                                01897000
TCBFLGS5 EQU   TCBFLGS+4                                                01898000
TCBABWF  EQU   TCBFLGS5                                                 01899000
TCBJPQ   EQU   TCB+44                                                   01900000
TCBPURGE EQU   TCBJPQ                                                   01901000
TCBGRS   EQU   TCB+48                                                   01902000
TCBFSA   EQU   TCB+112                                                  01903000
TCBTME   EQU   TCB+120                                                  01904000
TCBJSTCB EQU   TCB+124                                                  01905000
TCBTSFLG EQU   TCB+148                                                  01906000
TCBTSTSK EQU   TCBTSFLG                                                 01907000
TCBSTAB  EQU   TCB+160                                                  01908000
TCBNSTAE EQU   TCBSTAB                                                  01909000
TCBSTABB EQU   TCBSTAB+1                                                01910000
TCBTCT   EQU   TCB+164                                                  01911000
TCBTCTGF EQU   TCBTCT                                                   01912000
TCBSCNDY EQU   TCB+172                                                  01913000
TCBNDSP  EQU   TCBSCNDY                                                 01914000
TCBNDSP1 EQU   TCBNDSP+1                                                01915000
TCBNDSP2 EQU   TCBNDSP+2                                                01916000
TCBNDSP3 EQU   TCBNDSP+3                                                01917000
TCBJSCB  EQU   TCB+180                                                  01918000
TCBRECDE EQU   TCBJSCB                                                  01919000
TCBEXT1  EQU   TCB+196                                                  01920000
TCBBITS  EQU   TCB+200                                                  01921000
TCBNDSP4 EQU   TCBBITS                                                  01922000
TCBNDSP5 EQU   TCBBITS+1                                                01923000
TCBFLGS6 EQU   TCBBITS+2                                                01924000
TCBFLGS7 EQU   TCBBITS+3                                                01925000
TCBDAR   EQU   TCB+204                                                  01926000
TCBDARC  EQU   TCBDAR                                                   01927000
TCBEXT2  EQU   TCB+208                                                  01928000
TCBFOE   EQU   TCB+244                                                  01929000
TCBESTAE EQU   TCB+264                                                  01930000
TCBESTRM EQU   TCBESTAE+1                                               01931000
TCBFBYT1 EQU   TCB+276                                                  01932000
TCBFBYT2 EQU   TCB+277                                                  01933000
TCBRV124 EQU   TCB+278                                                  01934000
TCBRV133 EQU   TCB+279                                                  01935000
TCBXTNT2 EQU   0                                                        01936000
TCBGTF   EQU   TCBXTNT2                                                 01937000
TCBTFLG  EQU   TCBGTF                                                   01938000
TCBRV146 EQU   TCBXTNT2+28                                              01939000
TCBRV155 EQU   TCBXTNT2+29                                              01940000
TCBRV164 EQU   TCBXTNT2+30                                              01941000
TCBRV173 EQU   TCBXTNT2+31                                              01942000
IEZJSCB  EQU   0                                                        01943000
JSCBSEC1 EQU   IEZJSCB+188                                              01944000
JSCHPCE  EQU   JSCBSEC1+4                                               01945000
JSCBDCB  EQU   JSCBSEC1+36                                              01946000
JSCBOPTS EQU   JSCBSEC1+48                                              01947000
JSCBSWT1 EQU   JSCBSEC1+55                                              01948000
JSCBWTP  EQU   JSCBSEC1+64                                              01949000
JSCBWTFG EQU   JSCBWTP                                                  01950000
JSCBEND1 EQU   IEZJSCB+260                                              01951000
ASCB     EQU   0                                                        01952000
ASCBASID EQU   ASCB+36                                                  01953000
ASCBFW1  EQU   ASCB+100                                                 01954000
ASCBRCTF EQU   ASCBFW1+2                                                01955000
ASCBFLG1 EQU   ASCBFW1+3                                                01956000
ASCBDSP1 EQU   ASCB+114                                                 01957000
ASCBFLG2 EQU   ASCB+115                                                 01958000
SWAEPA   EQU   0                                                        01959000
SWVAFW   EQU   SWAEPA+4                                                 01960000
INJMJCT  EQU   0                                                        01961000
JCTJSTAT EQU   INJMJCT+5                                                01962000
INDMCTLG EQU   JCTJSTAT                                                 01963000
JCTJBYTE EQU   INJMJCT+7                                                01964000
JCTJMGLV EQU   JCTJBYTE                                                 01965000
JCTJNAME EQU   INJMJCT+8                                                01966000
JCTACTAD EQU   INJMJCT+40                                               01967000
JCTCCODE EQU   INJMJCT+54                                               01968000
JCTRSW1  EQU   INJMJCT+86                                               01969000
JCTRSW2  EQU   INJMJCT+87                                               01970000
JCTJSB   EQU   INJMJCT+111                                              01971000
JCTSTAT2 EQU   INJMJCT+116                                              01972000
IEFAACTB EQU   0                                                        01973000
ACTPRGNM EQU   IEFAACTB+8                                               01974000
ACTJNFLD EQU   IEFAACTB+31                                              01975000
INSMSCT  EQU   0                                                        01976000
SCTSSTAT EQU   INSMSCT+4                                                01977000
SCTAFACT EQU   INSMSCT+32                                               01978000
SCTSNAME EQU   INSMSCT+52                                               01979000
SCTSTYPE EQU   INSMSCT+67                                               01980000
SCTSDPTY EQU   INSMSCT+94                                               01981000
SCTSTAT2 EQU   INSMSCT+104                                              01982000
SCTBCT   EQU   SCTSTAT2                                                 01983000
SCTPGMNM EQU   INSMSCT+108                                              01984000
SCTCDENT EQU   INSMSCT+118                                              01985000
SCTSTEND EQU   INSMSCT+172                                              01986000
@NM00056 EQU   0                                                        01987000
SCTABCND EQU   @NM00056                                                 01988000
QDB      EQU   0                                                        01989000
DSAB     EQU   0                                                        01990000
DSABGIDP EQU   DSAB+24                                                  01991000
DSABANMP EQU   DSAB+28                                                  01992000
DSABORG  EQU   DSAB+32                                                  01993000
DSABORG1 EQU   DSABORG                                                  01994000
DSABORG2 EQU   DSABORG+1                                                01995000
DSABFLG1 EQU   DSAB+34                                                  01996000
DSABFLG2 EQU   DSAB+35                                                  01997000
DSABFLG3 EQU   DSAB+36                                                  01998000
DSABFLG4 EQU   DSAB+37                                                  01999000
DSABSIOT EQU   DSAB+64                                                  02000000
DSABANMI EQU   0                                                        02001000
DSABGIDL EQU   0                                                        02002000
RBPRFX   EQU   0                                                        02003000
RBBASIC  EQU   0                                                        02004000
RBEXRTNM EQU   RBBASIC                                                  02005000
RBTMFLD  EQU   RBEXRTNM                                                 02006000
RBSTAB   EQU   RBBASIC+10                                               02007000
XSTAB    EQU   RBSTAB                                                   02008000
RBSTAB1  EQU   XSTAB                                                    02009000
XSTAB1   EQU   RBSTAB1                                                  02010000
RBFTCKPT EQU   XSTAB1                                                   02011000
RBSTAB2  EQU   XSTAB+1                                                  02012000
XSTAB2   EQU   RBSTAB2                                                  02013000
RBTCBNXT EQU   XSTAB2                                                   02014000
RBFACTV  EQU   XSTAB2                                                   02015000
RBFDYN   EQU   XSTAB2                                                   02016000
RBECBWT  EQU   XSTAB2                                                   02017000
RBOPSW   EQU   RBBASIC+16                                               02018000
XRBPSW   EQU   RBOPSW                                                   02019000
RBOPSWB2 EQU   XRBPSW+1                                                 02020000
RBLINK   EQU   RBBASIC+28                                               02021000
XRBLNK   EQU   RBLINK                                                   02022000
RBWCF    EQU   XRBLNK                                                   02023000
RBLINKB  EQU   XRBLNK+1                                                 02024000
RBGRSAVE EQU   RBBASIC+32                                               02025000
XRBREG   EQU   RBGRSAVE                                                 02026000
RBGRS0   EQU   XRBREG                                                   02027000
RBGRS1   EQU   XRBREG+4                                                 02028000
RBGRS2   EQU   XRBREG+8                                                 02029000
RBGRS3   EQU   XRBREG+12                                                02030000
RBGRS4   EQU   XRBREG+16                                                02031000
RBGRS5   EQU   XRBREG+20                                                02032000
RBGRS6   EQU   XRBREG+24                                                02033000
RBGRS7   EQU   XRBREG+28                                                02034000
RBGRS8   EQU   XRBREG+32                                                02035000
RBGRS9   EQU   XRBREG+36                                                02036000
RBGRS10  EQU   XRBREG+40                                                02037000
RBGRS11  EQU   XRBREG+44                                                02038000
RBGRS12  EQU   XRBREG+48                                                02039000
RBGRS13  EQU   XRBREG+52                                                02040000
RBGRS14  EQU   XRBREG+56                                                02041000
RBGRS15  EQU   XRBREG+60                                                02042000
XRBESA   EQU   RBBASIC+96                                               02043000
RBPREFIX EQU   0                                                        02044000
RBRSV019 EQU   RBPREFIX+14                                              02045000
RBRSV028 EQU   RBPREFIX+15                                              02046000
RBRSV041 EQU   RBPREFIX+27                                              02047000
RBRSV054 EQU   RBPREFIX+39                                              02048000
RBRTOPSW EQU   RBPREFIX+40                                              02049000
RBRTPSW2 EQU   RBRTOPSW+8                                               02050000
RBRTICIL EQU   RBRTPSW2                                                 02051000
RBFLAGS1 EQU   RBPREFIX+56                                              02052000
RBINTCDA EQU   RBPREFIX+61                                              02053000
RBSECT   EQU   0                                                        02054000
RBPPSAV  EQU   RBSECT                                                   02055000
@NM00077 EQU   RBSECT+10                                                02056000
@NM00078 EQU   @NM00077                                                 02057000
RBTRSVRB EQU   @NM00078                                                 02058000
@NM00080 EQU   @NM00077+1                                               02059000
RBETXR   EQU   @NM00080                                                 02060000
RBEP     EQU   RBSECT+12                                                02061000
RBPGMQ   EQU   RBSECT+24                                                02062000
@NM00087 EQU   RBSECT+28                                                02063000
IRBEND   EQU   RBSECT+96                                                02064000
@NM00091 EQU   RBSECT+96                                                02065000
RBRSV138 EQU   @NM00091+7                                               02066000
RBRSV150 EQU   RBSECT+167                                               02067000
INDMDSNT EQU   0                                                        02068000
DUMMY    EQU   0                                                        02069000
VDICTMAP EQU   S99VDICT                                                 02070000
VERBNUMB EQU   VDICTMAP                                                 02071000
VDICTELM EQU   VDICTMAP+2                                               02072000
VERBCODE EQU   VDICTELM                                                 02073000
VERBFUNP EQU   VDICTELM+4                                               02074000
CPYSIZE  EQU   DECPYLEN                                                 02075000
CPYLOC   EQU   DECPYLOC                                                 02076000
JSCBSEC2 EQU   JSCBEND1                                                 02077000
JSCBSEC3 EQU   JSCBEND1                                                 02078000
JSCBJCT  EQU   JSCBSEC3                                                 02079000
JSCBJCTA EQU   JSCBJCT+1                                                02080000
JSCBASID EQU   JSCBSEC3+8                                               02081000
JSCBFBYT EQU   JSCBSEC3+10                                              02082000
JSCBJNL  EQU   JSCBSEC3+28                                              02083000
JSCBJJSB EQU   JSCBJNL                                                  02084000
JSCBSUB  EQU   JSCBSEC3+40                                              02085000
JSCDSABQ EQU   JSCBSEC3+60                                              02086000
JSCSCT   EQU   JSCBSEC3+68                                              02087000
JSCSCTP  EQU   JSCSCT+1                                                 02088000
JSCBACT  EQU   JSCBSEC3+88                                              02089000
JSCRSV45 EQU   JSCBSEC3+112                                             02090000
JSCRSV46 EQU   JSCRSV45                                                 02091000
JSCRSV47 EQU   JSCRSV45+2                                               02092000
DSABQDB  EQU   QDB                                                      02093000
DSQFRSTP EQU   DSABQDB+12                                               02094000
DSQLASTP EQU   DSABQDB+16                                               02095000
RBSECS03 EQU   RBEP                                                     02096000
RBCDE    EQU   RBSECS03                                                 02097000
RBCDFLGS EQU   RBCDE                                                    02098000
RBSECS05 EQU   RBPGMQ                                                   02099000
RBSQE    EQU   RBSECS05                                                 02100000
RBSECS06 EQU   RBPGMQ                                                   02101000
RBIQE    EQU   RBSECS06                                                 02102000
RBSECS07 EQU   RBPGMQ                                                   02103000
RBIQE2   EQU   RBSECS07                                                 02104000
RBSECS08 EQU   IRBEND                                                   02105000
RBSECS09 EQU   IRBEND                                                   02106000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02107000
RBRSV161 EQU   RBSECS09+64                                              02108000
RBSIRBWA EQU   RBSECS09                                                 02109000
RBIQEWRK EQU   RBSECS08+4                                               02110000
RBNEXAV  EQU   RBSECS08                                                 02111000
RBIQEA   EQU   RBIQE2                                                   02112000
RBIQE1   EQU   RBIQE+1                                                  02113000
RBUSE    EQU   RBIQE                                                    02114000
RBSQEA   EQU   RBSQE+1                                                  02115000
@NM00092 EQU   RBSQE                                                    02116000
RBCDE1   EQU   RBCDE+1                                                  02117000
RBCDLOAD EQU   RBCDFLGS                                                 02118000
RBCDXCTL EQU   RBCDFLGS                                                 02119000
RBCDSYNC EQU   RBCDFLGS                                                 02120000
RBCDNODE EQU   RBCDFLGS                                                 02121000
RBCDSAVE EQU   RBCDFLGS                                                 02122000
RBCDATCH EQU   RBCDFLGS                                                 02123000
RBRSV009 EQU   RBCDFLGS                                                 02124000
RBNOCELL EQU   RBCDFLGS                                                 02125000
@NM00060 EQU   DSABQDB+24                                               02126000
DSQBDSP  EQU   DSABQDB+22                                               02127000
DSQFDSP  EQU   DSABQDB+20                                               02128000
DSQBADFC EQU   DSQLASTP                                                 02129000
DSQBADBC EQU   DSQFRSTP                                                 02130000
DSQNELMS EQU   DSABQDB+8                                                02131000
DSQDBLN  EQU   DSABQDB+6                                                02132000
DSQATTRS EQU   DSABQDB+4                                                02133000
DSQDBID  EQU   DSABQDB                                                  02134000
JSCBEND3 EQU   JSCBSEC3+120                                             02135000
JSCRSV52 EQU   JSCBSEC3+116                                             02136000
JSCRSV51 EQU   JSCRSV47+1                                               02137000
JSCRSV50 EQU   JSCRSV47                                                 02138000
JSCRSV49 EQU   JSCRSV46+1                                               02139000
JSCRSV48 EQU   JSCRSV46                                                 02140000
JSCRSV44 EQU   JSCBSEC3+108                                             02141000
JSCRSV43 EQU   JSCBSEC3+104                                             02142000
JSCRSV42 EQU   JSCBSEC3+100                                             02143000
JSCBASWA EQU   JSCBSEC3+96                                              02144000
JSCBUFPT EQU   JSCBSEC3+92                                              02145000
JSCBSWSP EQU   JSCBSEC3+87                                              02146000
JSCRSV33 EQU   JSCBSEC3+86                                              02147000
JSCDDNUM EQU   JSCBSEC3+84                                              02148000
JSCRSV53 EQU   JSCBSEC3+82                                              02149000
JSCDDNNO EQU   JSCBSEC3+80                                              02150000
JSCBVATA EQU   JSCBSEC3+76                                              02151000
JSCTMCOR EQU   JSCBSEC3+72                                              02152000
JSCRSV55 EQU   JSCSCT                                                   02153000
JSCRSV54 EQU   JSCBSEC3+64                                              02154000
JSCBSSIB EQU   JSCBSEC3+56                                              02155000
JSCBFRBA EQU   JSCBSEC3+48                                              02156000
JSCRSV28 EQU   JSCBSEC3+46                                              02157000
JSCBSONO EQU   JSCBSEC3+44                                              02158000
JSCBSUBA EQU   JSCBSUB+1                                                02159000
JSCRSV31 EQU   JSCBSUB                                                  02160000
JSCBSMLR EQU   JSCBSEC3+36                                              02161000
JSCBJNLR EQU   JSCBSEC3+32                                              02162000
JSCBJNLA EQU   JSCBJNL+1                                                02163000
JSCBJSBT EQU   JSCBJJSB                                                 02164000
JSCBJSBX EQU   JSCBJJSB                                                 02165000
JSCBJSBA EQU   JSCBJJSB                                                 02166000
JSCBJSBI EQU   JSCBJJSB                                                 02167000
@NM00010 EQU   JSCBJJSB                                                 02168000
JSCBJNLE EQU   JSCBJJSB                                                 02169000
JSCBJNLF EQU   JSCBJJSB                                                 02170000
JSCBJNLN EQU   JSCBJJSB                                                 02171000
@NM00009 EQU   JSCBSEC3+24                                              02172000
JSCBJRBA EQU   JSCBSEC3+16                                              02173000
JSCBIECB EQU   JSCBSEC3+12                                              02174000
JSCBRV08 EQU   JSCBSEC3+11                                              02175000
JSCBRV07 EQU   JSCBFBYT                                                 02176000
JSCBRV06 EQU   JSCBFBYT                                                 02177000
JSCBRV05 EQU   JSCBFBYT                                                 02178000
JSCBRV04 EQU   JSCBFBYT                                                 02179000
JSCBRV03 EQU   JSCBFBYT                                                 02180000
JSCBRV02 EQU   JSCBFBYT                                                 02181000
JSCBADSP EQU   JSCBFBYT                                                 02182000
JSCBRV01 EQU   JSCBFBYT                                                 02183000
JSCBTJID EQU   JSCBASID                                                 02184000
JSCBPSCB EQU   JSCBSEC3+4                                               02185000
JSCJCTP  EQU   JSCBJCTA                                                 02186000
JSCRSV24 EQU   JSCBJCT                                                  02187000
JSCBEND2 EQU   JSCBSEC2                                                 02188000
@NM00001 EQU   VDICTELM+1                                               02189000
SIRBEND  EQU   RBSECT+168                                               02190000
SVRBEND  EQU   RBSECT+168                                               02191000
RBRSV158 EQU   RBRSV150                                                 02192000
RBRSV157 EQU   RBRSV150                                                 02193000
RBRSV156 EQU   RBRSV150                                                 02194000
RBRSV155 EQU   RBRSV150                                                 02195000
RBRSV154 EQU   RBRSV150                                                 02196000
RBRSV153 EQU   RBRSV150                                                 02197000
RBRSV152 EQU   RBRSV150                                                 02198000
RBRSV151 EQU   RBRSV150                                                 02199000
RBRSV149 EQU   RBSECT+166                                               02200000
RBRSV148 EQU   RBSECT+164                                               02201000
RBSCBB   EQU   RBSECT+144                                               02202000
TIRBEND  EQU   @NM00091+8                                               02203000
PRBEND   EQU   @NM00091+8                                               02204000
RBRSV146 EQU   RBRSV138                                                 02205000
RBRSV145 EQU   RBRSV138                                                 02206000
RBRSV144 EQU   RBRSV138                                                 02207000
RBRSV143 EQU   RBRSV138                                                 02208000
RBRSV142 EQU   RBRSV138                                                 02209000
RBRSV141 EQU   RBRSV138                                                 02210000
RBRSV140 EQU   RBRSV138                                                 02211000
RBRSV139 EQU   RBRSV138                                                 02212000
RBRSV137 EQU   @NM00091+6                                               02213000
RBRSV136 EQU   @NM00091+4                                               02214000
RBRSV135 EQU   @NM00091                                                 02215000
@NM00090 EQU   RBSECT+32                                                02216000
@NM00089 EQU   @NM00087+1                                               02217000
@NM00088 EQU   @NM00087                                                 02218000
RBPGMQ1  EQU   RBPGMQ+1                                                 02219000
@NM00086 EQU   RBPGMQ                                                   02220000
@NM00085 EQU   RBSECT+16                                                02221000
@NM00084 EQU   @NM00080                                                 02222000
@NM00083 EQU   @NM00080                                                 02223000
RBIQETP  EQU   @NM00080                                                 02224000
RBUSIQE  EQU   RBETXR                                                   02225000
RBATTN   EQU   @NM00080                                                 02226000
@NM00082 EQU   @NM00080                                                 02227000
@NM00081 EQU   @NM00080                                                 02228000
RBPMSVRB EQU   @NM00078                                                 02229000
RBATNXIT EQU   @NM00078                                                 02230000
@NM00079 EQU   @NM00078                                                 02231000
RBWAITP  EQU   @NM00078                                                 02232000
RBFNSVRB EQU   RBTRSVRB                                                 02233000
RBFTP    EQU   @NM00078                                                 02234000
RBSIZE   EQU   RBSECT+8                                                 02235000
RBABOPSW EQU   RBSECT+4                                                 02236000
RBPPSAV1 EQU   RBPPSAV+1                                                02237000
@NM00076 EQU   RBPPSAV                                                  02238000
RBPRFXND EQU   RBPREFIX+64                                              02239000
RBINTCOD EQU   RBINTCDA+1                                               02240000
RBINLNTH EQU   RBINTCDA                                                 02241000
RBWCSA   EQU   RBPREFIX+60                                              02242000
RBRSV004 EQU   RBPREFIX+57                                              02243000
RBSSSYN  EQU   RBFLAGS1                                                 02244000
RBSCB    EQU   RBFLAGS1                                                 02245000
RBLONGWT EQU   RBFLAGS1                                                 02246000
RBASIR   EQU   RBFLAGS1                                                 02247000
RBRSV159 EQU   RBFLAGS1                                                 02248000
RBABEND  EQU   RBFLAGS1                                                 02249000
RBXWAIT  EQU   RBFLAGS1                                                 02250000
RBSLOCK  EQU   RBFLAGS1                                                 02251000
RBRTRAN  EQU   RBRTPSW2+4                                               02252000
RBRTINCD EQU   RBRTICIL+2                                               02253000
RBRTILC  EQU   RBRTICIL+1                                               02254000
RBRSV160 EQU   RBRTICIL                                                 02255000
RBRTPSW1 EQU   RBRTOPSW                                                 02256000
RBRSV062 EQU   RBRSV054                                                 02257000
RBRSV061 EQU   RBRSV054                                                 02258000
RBRSV060 EQU   RBRSV054                                                 02259000
RBRSV059 EQU   RBRSV054                                                 02260000
RBRSV058 EQU   RBRSV054                                                 02261000
RBRSV057 EQU   RBRSV054                                                 02262000
RBRSV056 EQU   RBRSV054                                                 02263000
RBRSV055 EQU   RBRSV054                                                 02264000
RBRSV053 EQU   RBPREFIX+38                                              02265000
RBRSV052 EQU   RBPREFIX+36                                              02266000
RBRSV051 EQU   RBPREFIX+32                                              02267000
RBPRFXST EQU   RBPREFIX+32                                              02268000
RBRSV050 EQU   RBPREFIX+28                                              02269000
RBRSV049 EQU   RBRSV041                                                 02270000
RBRSV048 EQU   RBRSV041                                                 02271000
RBRSV047 EQU   RBRSV041                                                 02272000
RBRSV046 EQU   RBRSV041                                                 02273000
RBRSV045 EQU   RBRSV041                                                 02274000
RBRSV044 EQU   RBRSV041                                                 02275000
RBRSV043 EQU   RBRSV041                                                 02276000
RBRSV042 EQU   RBRSV041                                                 02277000
RBRSV040 EQU   RBPREFIX+26                                              02278000
RBRSV039 EQU   RBPREFIX+24                                              02279000
RBRSV038 EQU   RBPREFIX+20                                              02280000
RBRSV037 EQU   RBPREFIX+16                                              02281000
RBRSV036 EQU   RBRSV028                                                 02282000
RBRSV035 EQU   RBRSV028                                                 02283000
RBRSV034 EQU   RBRSV028                                                 02284000
RBRSV033 EQU   RBRSV028                                                 02285000
RBRSV032 EQU   RBRSV028                                                 02286000
RBRSV031 EQU   RBRSV028                                                 02287000
RBRSV030 EQU   RBRSV028                                                 02288000
RBRSV029 EQU   RBRSV028                                                 02289000
RBRSV027 EQU   RBRSV019                                                 02290000
RBRSV026 EQU   RBRSV019                                                 02291000
RBRSV025 EQU   RBRSV019                                                 02292000
RBRSV024 EQU   RBRSV019                                                 02293000
RBRSV023 EQU   RBRSV019                                                 02294000
RBRSV022 EQU   RBRSV019                                                 02295000
RBRSV021 EQU   RBRSV019                                                 02296000
RBRSV020 EQU   RBRSV019                                                 02297000
RBRSV018 EQU   RBPREFIX+13                                              02298000
RBRSV017 EQU   RBPREFIX+12                                              02299000
RBSRV016 EQU   RBPREFIX+11                                              02300000
RBRSV015 EQU   RBPREFIX+10                                              02301000
RBRSV014 EQU   RBPREFIX+8                                               02302000
RBRSV013 EQU   RBPREFIX+4                                               02303000
RBRSV012 EQU   RBPREFIX                                                 02304000
RBEXSAVE EQU   XRBESA                                                   02305000
XRBREG15 EQU   RBGRS15                                                  02306000
XRBREG14 EQU   RBGRS14                                                  02307000
XRBREG13 EQU   RBGRS13                                                  02308000
XRBREG12 EQU   RBGRS12                                                  02309000
XRBREG11 EQU   RBGRS11                                                  02310000
XRBREG10 EQU   RBGRS10                                                  02311000
XRBREG9  EQU   RBGRS9                                                   02312000
XRBREG8  EQU   RBGRS8                                                   02313000
XRBREG7  EQU   RBGRS7                                                   02314000
XRBREG6  EQU   RBGRS6                                                   02315000
XRBREG5  EQU   RBGRS5                                                   02316000
XRBREG4  EQU   RBGRS4                                                   02317000
XRBREG3  EQU   RBGRS3                                                   02318000
XRBREG2  EQU   RBGRS2                                                   02319000
XRBREG1  EQU   RBGRS1                                                   02320000
XRBREG0  EQU   RBGRS0                                                   02321000
XRBLNKA  EQU   RBLINKB                                                  02322000
XRBWT    EQU   RBWCF                                                    02323000
@NM00075 EQU   RBBASIC+24                                               02324000
RBOPSWPS EQU   RBOPSWB2                                                 02325000
@NM00074 EQU   RBOPSWB2                                                 02326000
@NM00073 EQU   XRBPSW                                                   02327000
@NM00072 EQU   RBBASIC+12                                               02328000
XRBWAIT  EQU   RBECBWT                                                  02329000
XRBFRRB  EQU   RBFDYN                                                   02330000
@NM00071 EQU   XSTAB2                                                   02331000
XRBACTV  EQU   RBFACTV                                                  02332000
XRBTCBP  EQU   RBTCBNXT                                                 02333000
@NM00070 EQU   XSTAB1                                                   02334000
XRBCKPT  EQU   RBFTCKPT                                                 02335000
@NM00069 EQU   XSTAB1                                                   02336000
@NM00068 EQU   RBBASIC+8                                                02337000
@NM00067 EQU   RBEXRTNM+1                                               02338000
RBTMIND3 EQU   RBTMFLD                                                  02339000
RBTMIND2 EQU   RBTMFLD                                                  02340000
RBTMCMP  EQU   RBTMFLD                                                  02341000
RBWLIM   EQU   RBTMFLD                                                  02342000
RBRSV005 EQU   RBTMFLD                                                  02343000
RBTMTOD  EQU   RBTMFLD                                                  02344000
RBTMQUE  EQU   RBTMFLD                                                  02345000
@NM00066 EQU   RBPRFX                                                   02346000
DSABGRID EQU   DSABGIDL+4                                               02347000
DSABLLEN EQU   DSABGIDL                                                 02348000
DSABANAM EQU   DSABANMI+1                                               02349000
DSABANML EQU   DSABANMI                                                 02350000
DSABRS04 EQU   DSAB+68                                                  02351000
DSABRS03 EQU   DSAB+62                                                  02352000
DSABDCBM EQU   DSAB+56                                                  02353000
DSABSSCM EQU   DSAB+52                                                  02354000
DSABSSNM EQU   DSAB+48                                                  02355000
DSABPTTR EQU   DSAB+44                                                  02356000
DSABTCBP EQU   DSAB+40                                                  02357000
DSABRS02 EQU   DSAB+38                                                  02358000
@NM00065 EQU   DSABFLG4                                                 02359000
DSABCKSI EQU   DSABFLG4                                                 02360000
DSABCKVL EQU   DSABFLG4                                                 02361000
DSABCKDS EQU   DSABFLG4                                                 02362000
@NM00064 EQU   DSABFLG3                                                 02363000
DSABJSCT EQU   DSABFLG3                                                 02364000
DSABCATL EQU   DSABFLG3                                                 02365000
DSABVMSC EQU   DSABFLG3                                                 02366000
DSABVAM  EQU   DSABFLG3                                                 02367000
DSABPASS EQU   DSABFLG3                                                 02368000
DSABDEFR EQU   DSABFLG3                                                 02369000
@NM00063 EQU   DSABFLG2                                                 02370000
DSABUNAL EQU   DSABFLG2                                                 02371000
DSABIRM  EQU   DSABFLG2                                                 02372000
DSABOPEN EQU   DSABFLG2                                                 02373000
DSABNUSE EQU   DSABFLG1                                                 02374000
DSABCATM EQU   DSABFLG1                                                 02375000
DSABPCAT EQU   DSABFLG1                                                 02376000
DSABDCAT EQU   DSABFLG1                                                 02377000
DSABCONV EQU   DSABFLG1                                                 02378000
DSABDCNV EQU   DSABFLG1                                                 02379000
DSABPALC EQU   DSABFLG1                                                 02380000
DSABDALC EQU   DSABFLG1                                                 02381000
@NM00062 EQU   DSABORG2                                                 02382000
DSABTR   EQU   DSABORG2                                                 02383000
DSABAM   EQU   DSABORG2                                                 02384000
@NM00061 EQU   DSABORG2                                                 02385000
DSABTQ   EQU   DSABORG2                                                 02386000
DSABTX   EQU   DSABORG2                                                 02387000
DSABGS   EQU   DSABORG2                                                 02388000
DSABU    EQU   DSABORG1                                                 02389000
DSABPO   EQU   DSABORG1                                                 02390000
DSABMQ   EQU   DSABORG1                                                 02391000
DSABCQ   EQU   DSABORG1                                                 02392000
DSABCX   EQU   DSABORG1                                                 02393000
DSABDA   EQU   DSABORG1                                                 02394000
DSABPS   EQU   DSABORG1                                                 02395000
DSABIS   EQU   DSABORG1                                                 02396000
DSABSSVA EQU   DSAB+21                                                  02397000
DSABRS01 EQU   DSAB+20                                                  02398000
DSABTIOT EQU   DSAB+16                                                  02399000
DSABOPCT EQU   DSAB+14                                                  02400000
DSABLNTH EQU   DSAB+12                                                  02401000
DSABBCHN EQU   DSAB+8                                                   02402000
DSABFCHN EQU   DSAB+4                                                   02403000
DSABID   EQU   DSAB                                                     02404000
QDBRV002 EQU   QDB+28                                                   02405000
QDBPRDS  EQU   QDB+26                                                   02406000
QDBPRSZ  EQU   QDB+24                                                   02407000
QDBBPTDS EQU   QDB+22                                                   02408000
QDBFPTDS EQU   QDB+20                                                   02409000
QDBLELMP EQU   QDB+16                                                   02410000
QDBFELMP EQU   QDB+12                                                   02411000
QDBNELMS EQU   QDB+8                                                    02412000
QDBRV001 EQU   QDB+6                                                    02413000
QDBATTR  EQU   QDB+4                                                    02414000
QDBQDB   EQU   QDB                                                      02415000
@NM00058 EQU   @NM00056+1                                               02416000
SCTONLY  EQU   SCTABCND                                                 02417000
SCTEVEN  EQU   SCTABCND                                                 02418000
SCTABEND EQU   SCTABCND                                                 02419000
SCTONLYC EQU   SCTABCND                                                 02420000
SCTABCAN EQU   SCTABCND                                                 02421000
@NM00057 EQU   SCTABCND                                                 02422000
@NM00055 EQU   INSMSCT+173                                              02423000
@NM00054 EQU   SCTSTEND                                                 02424000
SCTSYSCK EQU   SCTSTEND                                                 02425000
SCTSTPND EQU   SCTSTEND                                                 02426000
SCTSTSRT EQU   SCTSTEND                                                 02427000
@NM00053 EQU   INSMSCT+168                                              02428000
SCTCATCT EQU   INSMSCT+166                                              02429000
SCTSDPSA EQU   SCTCDENT+3                                               02430000
SCTSDPOP EQU   SCTCDENT+2                                               02431000
SCTSDPCD EQU   SCTCDENT                                                 02432000
@NM00052 EQU   INSMSCT+117                                              02433000
SCTPRFMF EQU   INSMSCT+116                                              02434000
SCTTIOT  EQU   INSMSCT+105                                              02435000
@NM00051 EQU   SCTBCT                                                   02436000
SCTJBEND EQU   SCTBCT                                                   02437000
SCTSPSYS EQU   SCTBCT                                                   02438000
SCTSTPLB EQU   SCTBCT                                                   02439000
@NM00050 EQU   SCTBCT                                                   02440000
SCTMCVOL EQU   SCTBCT                                                   02441000
@NM00049 EQU   SCTBCT                                                   02442000
SCTGOTTR EQU   INSMSCT+100                                              02443000
SCTSMF   EQU   INSMSCT+96                                               02444000
@NM00048 EQU   SCTSDPTY+1                                               02445000
SCTSDP   EQU   SCTSDPTY                                                 02446000
SCTFSTEP EQU   SCTSDPTY                                                 02447000
@NM00047 EQU   SCTSDPTY                                                 02448000
@NM00046 EQU   SCTSDPTY                                                 02449000
SCTNIUSL EQU   INSMSCT+92                                               02450000
@NM00045 EQU   INSMSCT+90                                               02451000
SCTMSSZE EQU   INSMSCT+88                                               02452000
SCTPCAT  EQU   INSMSCT+84                                               02453000
SCTLDSTB EQU   INSMSCT+80                                               02454000
SCTSRBT  EQU   INSMSCT+76                                               02455000
SCTMSADR EQU   INSMSCT+72                                               02456000
@NM00044 EQU   INSMSCT+71                                               02457000
SCTXBTTR EQU   INSMSCT+68                                               02458000
SCTJSCAT EQU   SCTSTYPE                                                 02459000
SCTINITB EQU   SCTSTYPE                                                 02460000
SCTSJFHK EQU   SCTSTYPE                                                 02461000
SCTOUTMC EQU   SCTSTYPE                                                 02462000
SCTINPUT EQU   SCTSTYPE                                                 02463000
SCTGOSTP EQU   SCTSTYPE                                                 02464000
@NM00043 EQU   INSMSCT+66                                               02465000
SCTNSMSG EQU   INSMSCT+65                                               02466000
SCTSNUMB EQU   INSMSCT+64                                               02467000
@NM00042 EQU   INSMSCT+62                                               02468000
SCTRPACT EQU   INSMSCT+60                                               02469000
SCTSCLPC EQU   INSMSCT+44                                               02470000
@NM00041 EQU   INSMSCT+43                                               02471000
SCTADSTB EQU   INSMSCT+40                                               02472000
@NM00040 EQU   INSMSCT+36                                               02473000
@NM00039 EQU   INSMSCT+35                                               02474000
SCTDDNT  EQU   INSMSCT+28                                               02475000
@NM00038 EQU   INSMSCT+27                                               02476000
SCTLSIOT EQU   INSMSCT+24                                               02477000
@NM00037 EQU   INSMSCT+23                                               02478000
SCTANSCT EQU   INSMSCT+20                                               02479000
@NM00036 EQU   INSMSCT+19                                               02480000
SCTAALOC EQU   INSMSCT+16                                               02481000
@NM00035 EQU   INSMSCT+15                                               02482000
SCTFSIOT EQU   INSMSCT+12                                               02483000
SCTLALOC EQU   INSMSCT+10                                               02484000
SCTSEXEC EQU   INSMSCT+8                                                02485000
SCTSTIME EQU   INSMSCT+5                                                02486000
INCMSSTS EQU   SCTSSTAT                                                 02487000
SCTGRPH  EQU   SCTSSTAT                                                 02488000
SCTKEY0  EQU   SCTSSTAT                                                 02489000
SCTDORST EQU   SCTSSTAT                                                 02490000
SCTNOCKP EQU   SCTSSTAT                                                 02491000
SCTNORST EQU   SCTSSTAT                                                 02492000
EACAUSER EQU   SCTSSTAT                                                 02493000
EAADDRBT EQU   SCTSSTAT                                                 02494000
SCTTBLID EQU   INSMSCT+3                                                02495000
SCTDISKA EQU   INSMSCT                                                  02496000
ACTACCNT EQU   IEFAACTB+32                                              02497000
ACTJTIME EQU   IEFAACTB+28                                              02498000
@NM00034 EQU   IEFAACTB+7                                               02499000
ACTNEXT  EQU   IEFAACTB+4                                               02500000
ACTIDENT EQU   IEFAACTB+3                                               02501000
ACTDSKAD EQU   IEFAACTB                                                 02502000
@NM00033 EQU   INJMJCT+175                                              02503000
JCTVULDP EQU   INJMJCT+172                                              02504000
JCTACODE EQU   INJMJCT+168                                              02505000
JCTPRFMF EQU   INJMJCT+167                                              02506000
JCTUSER  EQU   INJMJCT+160                                              02507000
JCTSSD   EQU   INJMJCT+157                                              02508000
@NM00032 EQU   INJMJCT+156                                              02509000
JCTSRBT  EQU   INJMJCT+152                                              02510000
JCTJMRJD EQU   INJMJCT+149                                              02511000
JCTJMRJT EQU   INJMJCT+146                                              02512000
JCTJMRSS EQU   INJMJCT+143                                              02513000
JCTJMRTL EQU   INJMJCT+140                                              02514000
JCTJMRCL EQU   INJMJCT+139                                              02515000
JCTJMROP EQU   INJMJCT+138                                              02516000
JCTJMRD  EQU   INJMJCT+137                                              02517000
JCTJMR   EQU   INJMJCT+134                                              02518000
JCTCKIDT EQU   INJMJCT+118                                              02519000
JCTCKIDL EQU   INJMJCT+117                                              02520000
@NM00031 EQU   JCTSTAT2                                                 02521000
JCTBLP   EQU   JCTSTAT2                                                 02522000
JCTPERFM EQU   JCTSTAT2                                                 02523000
JCTSWSM  EQU   JCTSTAT2                                                 02524000
JCTENDIT EQU   JCTSTAT2                                                 02525000
JCTADSPC EQU   JCTSTAT2                                                 02526000
JCTSPSYS EQU   JCTSTAT2                                                 02527000
@NM00030 EQU   INJMJCT+115                                              02528000
JCTSSTR  EQU   INJMJCT+112                                              02529000
JCTJSBTM EQU   JCTJSB                                                   02530000
JCTJSBEX EQU   JCTJSB                                                   02531000
JCTJSBAL EQU   JCTJSB                                                   02532000
JCTJSBIN EQU   JCTJSB                                                   02533000
@NM00029 EQU   JCTJSB                                                   02534000
JCTVOLSQ EQU   INJMJCT+110                                              02535000
JCTNRCKP EQU   INJMJCT+108                                              02536000
JCTNTRK  EQU   INJMJCT+107                                              02537000
JCTCKTTR EQU   INJMJCT+104                                              02538000
JCTDEVT  EQU   INJMJCT+100                                              02539000
@NM00028 EQU   INJMJCT+99                                               02540000
JCTSTIOT EQU   INJMJCT+96                                               02541000
JCTSNUMB EQU   INJMJCT+95                                               02542000
JCTQIDNT EQU   INJMJCT+94                                               02543000
JCTEQREG EQU   INJMJCT+92                                               02544000
@NM00027 EQU   INJMJCT+91                                               02545000
JCTDETDA EQU   INJMJCT+88                                               02546000
JCTDSDRA EQU   JCTRSW2                                                  02547000
JCTDSOJB EQU   JCTRSW2                                                  02548000
JCTDSOCR EQU   JCTRSW2                                                  02549000
JCTRESTT EQU   JCTRSW2                                                  02550000
JCTNOCKP EQU   JCTRSW2                                                  02551000
JCTNORST EQU   JCTRSW2                                                  02552000
JCTNARST EQU   JCTRSW2                                                  02553000
JCTSYSCK EQU   JCTRSW2                                                  02554000
@NM00026 EQU   JCTRSW1                                                  02555000
JCTSTEPR EQU   JCTRSW1                                                  02556000
JCTCKPTR EQU   JCTRSW1                                                  02557000
JCTCKFT  EQU   JCTRSW1                                                  02558000
JCTCONTR EQU   JCTRSW1                                                  02559000
JCTSTERM EQU   JCTRSW1                                                  02560000
JCTWARMS EQU   JCTRSW1                                                  02561000
@NM00025 EQU   JCTCCODE+3                                               02562000
JCTJDPOP EQU   JCTCCODE+2                                               02563000
JCTJDPCD EQU   JCTCCODE                                                 02564000
@NM00024 EQU   INJMJCT+53                                               02565000
JCTSCT   EQU   INJMJCT+52                                               02566000
JCTSMRBA EQU   INJMJCT+44                                               02567000
@NM00023 EQU   INJMJCT+43                                               02568000
@NM00022 EQU   INJMJCT+39                                               02569000
JCTJCTX  EQU   INJMJCT+36                                               02570000
@NM00021 EQU   INJMJCT+35                                               02571000
JCTSDKAD EQU   INJMJCT+32                                               02572000
JCTJCSMF EQU   INJMJCT+31                                               02573000
JCTGDGNT EQU   INJMJCT+28                                               02574000
@NM00020 EQU   INJMJCT+27                                               02575000
JCTPDIP  EQU   INJMJCT+24                                               02576000
JCTJTPTN EQU   INJMJCT+16                                               02577000
JCTJPRTY EQU   JCTJBYTE                                                 02578000
INCMMGL1 EQU   JCTJMGLV                                                 02579000
INCMMGL2 EQU   JCTJMGLV                                                 02580000
@NM00019 EQU   JCTJMGLV                                                 02581000
INCMALL  EQU   JCTJMGLV                                                 02582000
JCTJMGPO EQU   INJMJCT+6                                                02583000
INCMNSET EQU   JCTJSTAT                                                 02584000
INCMCAT  EQU   INDMCTLG                                                 02585000
INCMSTS  EQU   JCTJSTAT                                                 02586000
JCTABEND EQU   JCTJSTAT                                                 02587000
@NM00018 EQU   JCTJSTAT                                                 02588000
JCTJSTPC EQU   JCTJSTAT                                                 02589000
@NM00017 EQU   JCTJSTAT                                                 02590000
JCTJBLBS EQU   JCTJSTAT                                                 02591000
JCTJSRNO EQU   INJMJCT+4                                                02592000
JCTIDENT EQU   INJMJCT+3                                                02593000
JCTDSKAD EQU   INJMJCT                                                  02594000
SWCHNPTR EQU   SWAEPA+12                                                02595000
SWLNGTH  EQU   SWAEPA+8                                                 02596000
SWBLKID  EQU   SWVAFW+3                                                 02597000
SWVA     EQU   SWVAFW                                                   02598000
SWBLKPTR EQU   SWAEPA                                                   02599000
ASCBEND  EQU   ASCB+208                                                 02600000
ASCBSRBT EQU   ASCB+200                                                 02601000
ASCBSWTL EQU   ASCB+196                                                 02602000
ASCBRS14 EQU   ASCB+195                                                 02603000
ASCBSMCT EQU   ASCB+194                                                 02604000
ASCBRS12 EQU   ASCB+192                                                 02605000
ASCBPCTT EQU   ASCB+188                                                 02606000
ASCBVGTT EQU   ASCB+184                                                 02607000
ASCBLGCB EQU   ASCB+180                                                 02608000
ASCBJBNS EQU   ASCB+176                                                 02609000
ASCBJBNI EQU   ASCB+172                                                 02610000
ASCBMCC  EQU   ASCB+168                                                 02611000
ASCBRTWA EQU   ASCB+164                                                 02612000
ASCBIQEA EQU   ASCB+160                                                 02613000
ASCBXMPQ EQU   ASCB+156                                                 02614000
ASCBRS01 EQU   ASCB+154                                                 02615000
ASCBFMCT EQU   ASCB+152                                                 02616000
ASCBOUXB EQU   ASCB+148                                                 02617000
ASCBOUCB EQU   ASCB+144                                                 02618000
ASCBMECB EQU   ASCB+140                                                 02619000
ASCBQECB EQU   ASCB+136                                                 02620000
ASCBCMSB EQU   ASCB+132                                                 02621000
ASCBCMSF EQU   ASCB+128                                                 02622000
ASCBTCBS EQU   ASCB+124                                                 02623000
ASCBNVSC EQU   ASCB+122                                                 02624000
ASCBVSC  EQU   ASCB+120                                                 02625000
ASCBSRBS EQU   ASCB+118                                                 02626000
ASCBSSRB EQU   ASCB+116                                                 02627000
ASCBRV06 EQU   ASCBFLG2                                                 02628000
ASCBRV05 EQU   ASCBFLG2                                                 02629000
ASCBRV04 EQU   ASCBFLG2                                                 02630000
ASCBSNQS EQU   ASCBFLG2                                                 02631000
ASCBS2S  EQU   ASCBFLG2                                                 02632000
ASCBCEXT EQU   ASCBFLG2                                                 02633000
ASCBPXMT EQU   ASCBFLG2                                                 02634000
ASCBXMPT EQU   ASCBFLG2                                                 02635000
ASCBRF07 EQU   ASCBDSP1                                                 02636000
ASCBRF06 EQU   ASCBDSP1                                                 02637000
ASCBRF05 EQU   ASCBDSP1                                                 02638000
ASCBRF04 EQU   ASCBDSP1                                                 02639000
ASCBRF03 EQU   ASCBDSP1                                                 02640000
ASCBRF02 EQU   ASCBDSP1                                                 02641000
ASCBFAIL EQU   ASCBDSP1                                                 02642000
ASCBNOQ  EQU   ASCBDSP1                                                 02643000
ASCBSWCT EQU   ASCB+112                                                 02644000
ASCBASXB EQU   ASCB+108                                                 02645000
ASCBTMCH EQU   ASCB+104                                                 02646000
ASCBNSWP EQU   ASCBFLG1                                                 02647000
ASCBTYP1 EQU   ASCBFLG1                                                 02648000
ASCBSTND EQU   ASCBFLG1                                                 02649000
ASCBABNT EQU   ASCBFLG1                                                 02650000
ASCBTERM EQU   ASCBFLG1                                                 02651000
ASCBS3S  EQU   ASCBFLG1                                                 02652000
ASCBCMSH EQU   ASCBFLG1                                                 02653000
ASCBTOFF EQU   ASCBFLG1                                                 02654000
ASCBRF01 EQU   ASCBRCTF                                                 02655000
ASCBTMLW EQU   ASCBRCTF                                                 02656000
ASCBOUT  EQU   ASCBRCTF                                                 02657000
ASCBWAIT EQU   ASCBRCTF                                                 02658000
ASCBRV08 EQU   ASCBRCTF                                                 02659000
ASCBFQU  EQU   ASCBRCTF                                                 02660000
ASCBFRS  EQU   ASCBRCTF                                                 02661000
ASCBTMNO EQU   ASCBRCTF                                                 02662000
ASCBAFFN EQU   ASCBFW1                                                  02663000
ASCBDUMP EQU   ASCB+96                                                  02664000
ASCBQSVC EQU   ASCB+92                                                  02665000
ASCBUBET EQU   ASCB+88                                                  02666000
ASCBECB  EQU   ASCB+84                                                  02667000
ASCBJSTL EQU   ASCB+80                                                  02668000
ASCBEWST EQU   ASCB+72                                                  02669000
ASCBEJST EQU   ASCB+64                                                  02670000
ASCBTSB  EQU   ASCB+60                                                  02671000
ASCBCSCB EQU   ASCB+56                                                  02672000
ASCBRSM  EQU   ASCB+52                                                  02673000
ASCBLDA  EQU   ASCB+48                                                  02674000
ASCBSTOR EQU   ASCB+44                                                  02675000
ASCBDP   EQU   ASCB+43                                                  02676000
ASCBRV07 EQU   ASCB+42                                                  02677000
ASCBIOSM EQU   ASCB+40                                                  02678000
ASCBSEQN EQU   ASCB+38                                                  02679000
ASCBCPUS EQU   ASCB+32                                                  02680000
ASCBSPL  EQU   ASCB+28                                                  02681000
ASCBLSLQ EQU   ASCB+24                                                  02682000
ASCBFSLQ EQU   ASCB+20                                                  02683000
ASCBIOSP EQU   ASCB+16                                                  02684000
ASCBLOCK EQU   ASCB+12                                                  02685000
ASCBBWDP EQU   ASCB+8                                                   02686000
ASCBFWDP EQU   ASCB+4                                                   02687000
ASCBASCB EQU   ASCB                                                     02688000
ASCBEGIN EQU   ASCB                                                     02689000
JSCBCSCB EQU   JSCBSEC1+68                                              02690000
JSCBPMG  EQU   JSCBWTP+2                                                02691000
JSCBWTSP EQU   JSCBWTP+1                                                02692000
JSCRSV23 EQU   JSCBWTFG                                                 02693000
JSCRSV22 EQU   JSCBWTFG                                                 02694000
JSCRSV21 EQU   JSCBWTFG                                                 02695000
JSCRSV20 EQU   JSCBWTFG                                                 02696000
JSCRSV19 EQU   JSCBWTFG                                                 02697000
JSCRSV18 EQU   JSCBWTFG                                                 02698000
JSCBRET  EQU   JSCBWTFG                                                 02699000
JSCBIOFG EQU   JSCBWTFG                                                 02700000
@NM00008 EQU   JSCBSEC1+60                                              02701000
JSCBQMPI EQU   JSCBSEC1+56                                              02702000
JSCBPMSG EQU   JSCBSWT1                                                 02703000
JSCRSV16 EQU   JSCBSWT1                                                 02704000
JSCRSV15 EQU   JSCBSWT1                                                 02705000
JSCRSV14 EQU   JSCBSWT1                                                 02706000
JSCRSV13 EQU   JSCBSWT1                                                 02707000
JSCRSV12 EQU   JSCBSWT1                                                 02708000
JSCRSV11 EQU   JSCBSWT1                                                 02709000
JSCBPASS EQU   JSCBSWT1                                                 02710000
JSCBTTTR EQU   JSCBSEC1+52                                              02711000
JSCRSV10 EQU   JSCBSEC1+49                                              02712000
JSCBAUTH EQU   JSCBOPTS                                                 02713000
JSCSIOTS EQU   JSCBOPTS                                                 02714000
JSCRSV08 EQU   JSCBOPTS                                                 02715000
JSCRSV07 EQU   JSCBOPTS                                                 02716000
JSCRSV06 EQU   JSCBOPTS                                                 02717000
JSCBLONG EQU   JSCBOPTS                                                 02718000
JSCRSV05 EQU   JSCBOPTS                                                 02719000
JSCRSV04 EQU   JSCBOPTS                                                 02720000
JSCBSECB EQU   JSCBSEC1+44                                              02721000
JSCRSV03 EQU   JSCBSEC1+41                                              02722000
JSCBSTEP EQU   JSCBSEC1+40                                              02723000
JSCBDCBA EQU   JSCBDCB+1                                                02724000
JSCRSV02 EQU   JSCBDCB                                                  02725000
JSCBID   EQU   JSCBSEC1+32                                              02726000
JSCBDBTB EQU   JSCBSEC1+28                                              02727000
JSCBIJSC EQU   JSCBSEC1+24                                              02728000
JSCBTCBP EQU   JSCBSEC1+20                                              02729000
JSCBPCC  EQU   JSCBSEC1+16                                              02730000
JSCBTCP  EQU   JSCBSEC1+12                                              02731000
JSCBSHR  EQU   JSCBSEC1+8                                               02732000
JSCHPCEA EQU   JSCHPCE+1                                                02733000
JSCRSV32 EQU   JSCHPCE                                                  02734000
JSCRSV01 EQU   JSCBSEC1                                                 02735000
@NM00007 EQU   IEZJSCB                                                  02736000
@NM00006 EQU   TCBXTNT2+32                                              02737000
TCBRV181 EQU   TCBRV173                                                 02738000
TCBRV180 EQU   TCBRV173                                                 02739000
TCBRV179 EQU   TCBRV173                                                 02740000
TCBRV178 EQU   TCBRV173                                                 02741000
TCBRV177 EQU   TCBRV173                                                 02742000
TCBRV176 EQU   TCBRV173                                                 02743000
TCBRV175 EQU   TCBRV173                                                 02744000
TCBRV174 EQU   TCBRV173                                                 02745000
TCBRV172 EQU   TCBRV164                                                 02746000
TCBRV171 EQU   TCBRV164                                                 02747000
TCBRV170 EQU   TCBRV164                                                 02748000
TCBRV169 EQU   TCBRV164                                                 02749000
TCBRV168 EQU   TCBRV164                                                 02750000
TCBRV167 EQU   TCBRV164                                                 02751000
TCBRV166 EQU   TCBRV164                                                 02752000
TCBRV165 EQU   TCBRV164                                                 02753000
TCBRV163 EQU   TCBRV155                                                 02754000
TCBRV162 EQU   TCBRV155                                                 02755000
TCBRV161 EQU   TCBRV155                                                 02756000
TCBRV160 EQU   TCBRV155                                                 02757000
TCBRV159 EQU   TCBRV155                                                 02758000
TCBRV158 EQU   TCBRV155                                                 02759000
TCBRV157 EQU   TCBRV155                                                 02760000
TCBRV156 EQU   TCBRV155                                                 02761000
TCBRV154 EQU   TCBRV146                                                 02762000
TCBRV153 EQU   TCBRV146                                                 02763000
TCBRV152 EQU   TCBRV146                                                 02764000
TCBRV151 EQU   TCBRV146                                                 02765000
TCBRV150 EQU   TCBRV146                                                 02766000
TCBRV149 EQU   TCBRV146                                                 02767000
TCBRV148 EQU   TCBRV146                                                 02768000
TCBRV147 EQU   TCBRV146                                                 02769000
TCBRV145 EQU   TCBXTNT2+26                                              02770000
TCBRV144 EQU   TCBXTNT2+24                                              02771000
TCBCAUF  EQU   TCBXTNT2+20                                              02772000
TCBRV142 EQU   TCBXTNT2+16                                              02773000
TCBRSV49 EQU   TCBXTNT2+12                                              02774000
TCBEVENT EQU   TCBXTNT2+8                                               02775000
TCBRCMP  EQU   TCBXTNT2+5                                               02776000
TCBRSVAB EQU   TCBXTNT2+4                                               02777000
TCBGTFA  EQU   TCBGTF+1                                                 02778000
TCBRSV47 EQU   TCBTFLG                                                  02779000
TCBRSV46 EQU   TCBTFLG                                                  02780000
TCBRSV45 EQU   TCBTFLG                                                  02781000
TCBRSV44 EQU   TCBTFLG                                                  02782000
TCBRSV43 EQU   TCBTFLG                                                  02783000
TCBDSPIT EQU   TCBTFLG                                                  02784000
TCBERRTN EQU   TCBTFLG                                                  02785000
TCBASYNC EQU   TCBTFLG                                                  02786000
@NM00005 EQU   TCB+296                                                  02787000
TCBSVCA2 EQU   TCB+292                                                  02788000
TCBSWASA EQU   TCB+288                                                  02789000
TCBDBTB  EQU   TCB+284                                                  02790000
TCBRPT   EQU   TCB+280                                                  02791000
TCBRV141 EQU   TCBRV133                                                 02792000
TCBRV140 EQU   TCBRV133                                                 02793000
TCBRV139 EQU   TCBRV133                                                 02794000
TCBRV138 EQU   TCBRV133                                                 02795000
TCBRV137 EQU   TCBRV133                                                 02796000
TCBRV136 EQU   TCBRV133                                                 02797000
TCBRV135 EQU   TCBRV133                                                 02798000
TCBRV134 EQU   TCBRV133                                                 02799000
TCBRV132 EQU   TCBRV124                                                 02800000
TCBRV131 EQU   TCBRV124                                                 02801000
TCBRV130 EQU   TCBRV124                                                 02802000
TCBRV129 EQU   TCBRV124                                                 02803000
TCBRV128 EQU   TCBRV124                                                 02804000
TCBRV127 EQU   TCBRV124                                                 02805000
TCBRV126 EQU   TCBRV124                                                 02806000
TCBRV125 EQU   TCBRV124                                                 02807000
TCBRV123 EQU   TCBFBYT2                                                 02808000
TCBRV122 EQU   TCBFBYT2                                                 02809000
TCBECBNV EQU   TCBFBYT2                                                 02810000
TCBSSSYN EQU   TCBFBYT2                                                 02811000
TCBFPRAP EQU   TCBFBYT2                                                 02812000
TCBFDW   EQU   TCBFBYT2                                                 02813000
TCBFMW   EQU   TCBFBYT2                                                 02814000
TCBCNCB  EQU   TCBFBYT2                                                 02815000
TCBLLH   EQU   TCBFBYT1                                                 02816000
TCBRV113 EQU   TCBFBYT1                                                 02817000
TCBEOT   EQU   TCBFBYT1                                                 02818000
TCBRTM2  EQU   TCBFBYT1                                                 02819000
TCBPGNLY EQU   TCBFBYT1                                                 02820000
TCBNDIOS EQU   TCBFBYT1                                                 02821000
TCBACTIV EQU   TCBFBYT1                                                 02822000
TCBEOTFM EQU   TCBFBYT1                                                 02823000
TCBAFFN  EQU   TCB+274                                                  02824000
TCBCCPVI EQU   TCB+272                                                  02825000
TCBUKYSP EQU   TCB+268                                                  02826000
TCBMODE  EQU   TCBESTAE+3                                               02827000
TCBERTYP EQU   TCBESTAE+2                                               02828000
TCBRV314 EQU   TCBESTRM                                                 02829000
TCBRV313 EQU   TCBESTRM                                                 02830000
TCBRV312 EQU   TCBESTRM                                                 02831000
TCBRV311 EQU   TCBESTRM                                                 02832000
TCBRV310 EQU   TCBESTRM                                                 02833000
TCBRV309 EQU   TCBESTRM                                                 02834000
TCBRV308 EQU   TCBESTRM                                                 02835000
TCBETERM EQU   TCBESTRM                                                 02836000
TCBSCBKY EQU   TCBESTAE                                                 02837000
TCBRTM12 EQU   TCB+260                                                  02838000
TCBTCBID EQU   TCB+256                                                  02839000
TCBRSV96 EQU   TCB+252                                                  02840000
TCBSWA   EQU   TCB+248                                                  02841000
TCBFOEA  EQU   TCBFOE+1                                                 02842000
TCBRSV42 EQU   TCBFOE                                                   02843000
TCBRV306 EQU   TCB+240                                                  02844000
TCBRSV41 EQU   TCB+239                                                  02845000
TCBTID   EQU   TCB+238                                                  02846000
TCBRSVAA EQU   TCB+237                                                  02847000
TCBABCUR EQU   TCB+236                                                  02848000
TCBTMSAV EQU   TCB+232                                                  02849000
TCBIOTIM EQU   TCB+228                                                  02850000
TCBRTWA  EQU   TCB+224                                                  02851000
TCBBACK  EQU   TCB+220                                                  02852000
TCBTIRB  EQU   TCB+216                                                  02853000
TCBAECB  EQU   TCB+212                                                  02854000
TCBEXT2A EQU   TCBEXT2+1                                                02855000
TCBRSV39 EQU   TCBEXT2                                                  02856000
TCBSTMCT EQU   TCB+207                                                  02857000
TCBSYSCT EQU   TCB+206                                                  02858000
TCBRSV37 EQU   TCB+205                                                  02859000
TCBEXSVC EQU   TCBDAR                                                   02860000
TCBDARMS EQU   TCBDAR                                                   02861000
TCBDARWT EQU   TCBDAR                                                   02862000
TCBDARO  EQU   TCBDAR                                                   02863000
TCBDARMC EQU   TCBDARC                                                  02864000
TCBDARD  EQU   TCBDAR                                                   02865000
TCBDARS  EQU   TCBDAR                                                   02866000
TCBDARP  EQU   TCBDAR                                                   02867000
TCBGTOFM EQU   TCBFLGS7                                                 02868000
TCBADMP  EQU   TCBFLGS7                                                 02869000
TCBRSTSK EQU   TCBFLGS7                                                 02870000
TCBSVCS  EQU   TCBFLGS7                                                 02871000
TCBSTACK EQU   TCBFLGS7                                                 02872000
TCBRSV34 EQU   TCBFLGS7                                                 02873000
TCBRSV33 EQU   TCBFLGS7                                                 02874000
TCBGPECB EQU   TCBFLGS7                                                 02875000
TCBNTJS  EQU   TCBFLGS6                                                 02876000
TCBAPG   EQU   TCBFLGS6                                                 02877000
TCBMIGR  EQU   TCBFLGS6                                                 02878000
TCBRV303 EQU   TCBFLGS6                                                 02879000
TCBSPVLK EQU   TCBFLGS6                                                 02880000
TCBCPU   EQU   TCBFLGS6                                                 02881000
TCBPIE17 EQU   TCBFLGS6                                                 02882000
TCBRV    EQU   TCBFLGS6                                                 02883000
TCBRSV79 EQU   TCBNDSP5                                                 02884000
TCBRSV78 EQU   TCBNDSP5                                                 02885000
TCBRSV77 EQU   TCBNDSP5                                                 02886000
TCBRSV76 EQU   TCBNDSP5                                                 02887000
TCBRSV75 EQU   TCBNDSP5                                                 02888000
TCBRSV74 EQU   TCBNDSP5                                                 02889000
TCBRSV95 EQU   TCBNDSP5                                                 02890000
TCBRSV94 EQU   TCBNDSP5                                                 02891000
TCBRSV93 EQU   TCBNDSP4                                                 02892000
TCBRSV92 EQU   TCBNDSP4                                                 02893000
TCBRSV91 EQU   TCBNDSP4                                                 02894000
TCBRSV90 EQU   TCBNDSP4                                                 02895000
TCBRSV89 EQU   TCBNDSP4                                                 02896000
TCBRSV88 EQU   TCBNDSP4                                                 02897000
TCBRSV87 EQU   TCBNDSP4                                                 02898000
TCBRSV86 EQU   TCBNDSP4                                                 02899000
TCBEXT1A EQU   TCBEXT1+1                                                02900000
TCBRSV32 EQU   TCBEXT1                                                  02901000
TCBEXCPD EQU   TCB+192                                                  02902000
TCBIOBRC EQU   TCB+188                                                  02903000
TCBDDWTC EQU   TCB+186                                                  02904000
TCBDDEXC EQU   TCB+184                                                  02905000
TCBJSCBB EQU   TCBJSCB+1                                                02906000
@NM00004 EQU   TCBRECDE                                                 02907000
TCBREC   EQU   TCBRECDE                                                 02908000
TCBMDIDS EQU   TCB+176                                                  02909000
TCBNDINT EQU   TCBNDSP3                                                 02910000
TCBRSV27 EQU   TCBNDSP3                                                 02911000
TCBRSV26 EQU   TCBNDSP3                                                 02912000
TCBRSV25 EQU   TCBNDSP3                                                 02913000
TCBRSV24 EQU   TCBNDSP3                                                 02914000
TCBSRBND EQU   TCBNDSP3                                                 02915000
TCBRV302 EQU   TCBNDSP3                                                 02916000
TCBLJSND EQU   TCBNDSP3                                                 02917000
TCBABE   EQU   TCBNDSP2                                                 02918000
TCBDSS   EQU   TCBNDSP2                                                 02919000
TCBOWAIT EQU   TCBNDSP2                                                 02920000
TCBIWAIT EQU   TCBNDSP2                                                 02921000
TCBNDTS  EQU   TCBNDSP2                                                 02922000
TCBNDSVC EQU   TCBNDSP2                                                 02923000
TCBSTPP  EQU   TCBNDSP2                                                 02924000
TCBABD   EQU   TCBNDSP2                                                 02925000
TCBRSV22 EQU   TCBNDSP1                                                 02926000
TCBPIEND EQU   TCBNDSP1                                                 02927000
TCBTPSP  EQU   TCBNDSP1                                                 02928000
TCBDDRND EQU   TCBNDSP1                                                 02929000
TCBRSPND EQU   TCBNDSP1                                                 02930000
TCBRSTND EQU   TCBNDSP1                                                 02931000
TCBDARPN EQU   TCBNDSP1                                                 02932000
TCBDARTN EQU   TCBNDSP1                                                 02933000
TCBNDSP0 EQU   TCBNDSP                                                  02934000
TCBUSER  EQU   TCB+168                                                  02935000
TCBTCTB  EQU   TCBTCT+1                                                 02936000
TCBRSV9C EQU   TCBTCTGF                                                 02937000
TCBRSV9B EQU   TCBTCTGF                                                 02938000
TCBRSV9A EQU   TCBTCTGF                                                 02939000
TCBRSV99 EQU   TCBTCTGF                                                 02940000
TCBRSV98 EQU   TCBTCTGF                                                 02941000
TCBRSV97 EQU   TCBTCTGF                                                 02942000
TCBRSV20 EQU   TCBTCTGF                                                 02943000
TCBSMFGF EQU   TCBTCTGF                                                 02944000
TCBSTCUR EQU   TCBNSTAE                                                 02945000
TCBRV301 EQU   TCBNSTAE                                                 02946000
TCBSYNCH EQU   TCBNSTAE                                                 02947000
TCBHALT  EQU   TCBNSTAE                                                 02948000
TCBPPSUP EQU   TCBNSTAE                                                 02949000
TCB33E   EQU   TCBNSTAE                                                 02950000
TCBQUIES EQU   TCBNSTAE                                                 02951000
TCBSTABE EQU   TCBNSTAE                                                 02952000
TCBAQE   EQU   TCB+156                                                  02953000
TCBPQE   EQU   TCB+152                                                  02954000
TCBTSDP  EQU   TCB+151                                                  02955000
TCBTSLP  EQU   TCB+150                                                  02956000
TCBSTPCT EQU   TCB+149                                                  02957000
TCBCPUBN EQU   TCBTSFLG                                                 02958000
TCBDYDSP EQU   TCBTSFLG                                                 02959000
TCBRSV18 EQU   TCBTSFLG                                                 02960000
TCBRSV17 EQU   TCBTSFLG                                                 02961000
TCBTIOTG EQU   TCBTSFLG                                                 02962000
TCBATT   EQU   TCBTSFLG                                                 02963000
TCBSTPPR EQU   TCBTSFLG                                                 02964000
TCBRV300 EQU   TCBTSTSK                                                 02965000
TCBECB   EQU   TCB+144                                                  02966000
TCBIQE   EQU   TCB+140                                                  02967000
TCBLTC   EQU   TCB+136                                                  02968000
TCBOTC   EQU   TCB+132                                                  02969000
TCBNTC   EQU   TCB+128                                                  02970000
TCBJSTCA EQU   TCBJSTCB+1                                               02971000
TCBRSV16 EQU   TCBJSTCB                                                 02972000
TCBTQET  EQU   TCBTME                                                   02973000
TCBTCB   EQU   TCB+116                                                  02974000
TCBFSAB  EQU   TCBFSA+1                                                 02975000
TCBQEL   EQU   TCBFSA                                                   02976000
TCBGRS15 EQU   TCBGRS+60                                                02977000
TCBGRS14 EQU   TCBGRS+56                                                02978000
TCBGRS13 EQU   TCBGRS+52                                                02979000
TCBGRS12 EQU   TCBGRS+48                                                02980000
TCBGRS11 EQU   TCBGRS+44                                                02981000
TCBGRS10 EQU   TCBGRS+40                                                02982000
TCBGRS9  EQU   TCBGRS+36                                                02983000
TCBGRS8  EQU   TCBGRS+32                                                02984000
TCBGRS7  EQU   TCBGRS+28                                                02985000
TCBGRS6  EQU   TCBGRS+24                                                02986000
TCBGRS5  EQU   TCBGRS+20                                                02987000
TCBGRS4  EQU   TCBGRS+16                                                02988000
TCBGRS3  EQU   TCBGRS+12                                                02989000
TCBGRS2  EQU   TCBGRS+8                                                 02990000
TCBGRS1  EQU   TCBGRS+4                                                 02991000
TCBGRS0  EQU   TCBGRS                                                   02992000
TCBJPQB  EQU   TCBJPQ+1                                                 02993000
TCBRSV15 EQU   TCBPURGE                                                 02994000
TCBRSV14 EQU   TCBPURGE                                                 02995000
TCBRSV13 EQU   TCBPURGE                                                 02996000
TCBRSV12 EQU   TCBPURGE                                                 02997000
TCBRSV11 EQU   TCBPURGE                                                 02998000
TCBRSV10 EQU   TCBPURGE                                                 02999000
TCBRSV09 EQU   TCBPURGE                                                 03000000
TCBJPQF  EQU   TCBPURGE                                                 03001000
TCBJLB   EQU   TCB+40                                                   03002000
TCBLLS   EQU   TCB+36                                                   03003000
TCBDSP   EQU   TCB+35                                                   03004000
TCBLMP   EQU   TCB+34                                                   03005000
TCBPNDSP EQU   TCBFLGS5                                                 03006000
TCBFCD1  EQU   TCBFLGS5                                                 03007000
TCBSTP   EQU   TCBFLGS5                                                 03008000
TCBSYS   EQU   TCBFLGS5                                                 03009000
TCBANDSP EQU   TCBFLGS5                                                 03010000
TCBPAGE  EQU   TCBFLGS5                                                 03011000
TCBUXNDF EQU   TCBABWF                                                  03012000
TCBFC    EQU   TCBFLGS5                                                 03013000
TCBONDSP EQU   TCBFLGS4                                                 03014000
TCBMPCND EQU   TCBFLGS4                                                 03015000
TCBMPCVQ EQU   TCBFLGS4                                                 03016000
TCBUXNDV EQU   TCBFLGS4                                                 03017000
TCBHNDSP EQU   TCBFLGS4                                                 03018000
TCBRQENA EQU   TCBFLGS4                                                 03019000
TCBSER   EQU   TCBFLGS4                                                 03020000
TCBNDUMP EQU   TCBFLGS4                                                 03021000
TCBDWSTA EQU   TCBFLGS3                                                 03022000
TCBRSV08 EQU   TCBFLGS3                                                 03023000
TCBRSV07 EQU   TCBFLGS3                                                 03024000
TCBRSV06 EQU   TCBFLGS3                                                 03025000
TCBABGM  EQU   TCBFLGS3                                                 03026000
TCBABTRM EQU   TCBFLGS3                                                 03027000
TCBADINP EQU   TCBFLGS3                                                 03028000
TCBFSM   EQU   TCBFLGS3                                                 03029000
TCBFTS   EQU   TCBFLGS2                                                 03030000
TCBFETXR EQU   TCBFLGS2                                                 03031000
TCBFDSOP EQU   TCBFLGS2                                                 03032000
TCBFJMC  EQU   TCBFLGS2                                                 03033000
TCBFSMC  EQU   TCBFLGS2                                                 03034000
TCBFABOP EQU   TCBFLGS2                                                 03035000
TCBFSTI  EQU   TCBFLGS2                                                 03036000
TCBFOINP EQU   TCBFLGS2                                                 03037000
TCBFX    EQU   TCBFLGS1                                                 03038000
TCBFS    EQU   TCBFLGS1                                                 03039000
TCBFT    EQU   TCBFLGS1                                                 03040000
TCBPDUMP EQU   TCBFLGS1                                                 03041000
TCBNONPR EQU   TCBFLGS1                                                 03042000
TCBFERA  EQU   TCBFLGS1                                                 03043000
TCBFE    EQU   TCBFLGS1                                                 03044000
TCBFA    EQU   TCBFLGS1                                                 03045000
TCBZERO  EQU   TCBPKF                                                   03046000
TCBFLAG  EQU   TCBPKF                                                   03047000
TCBMSSB  EQU   TCBMSS+1                                                 03048000
TCBRSV03 EQU   TCBMSS                                                   03049000
TCBTRNB  EQU   TCBTRN+1                                                 03050000
TCBRSV02 EQU   TCBABF                                                   03051000
TCBOLTEP EQU   TCBABF                                                   03052000
TCBTCP   EQU   TCBABF                                                   03053000
TCBTCPP  EQU   TCBABF                                                   03054000
TCBRSV01 EQU   TCBABF                                                   03055000
TCBGRPH  EQU   TCBABF                                                   03056000
TCBNOCHK EQU   TCBABF                                                   03057000
TCBMOD91 EQU   TCBABF                                                   03058000
TCBCMPC  EQU   TCBCMP+1                                                 03059000
TCBRV318 EQU   TCBCMSG                                                  03060000
TCBRV317 EQU   TCBCIND                                                  03061000
TCBRV316 EQU   TCBCWTO                                                  03062000
TCBCASID EQU   TCBCDBL                                                  03063000
TCBNOCC  EQU   TCBSTCC                                                  03064000
TCBDMPO  EQU   TCBCPP                                                   03065000
TCBCSTEP EQU   TCBCMPF                                                  03066000
TCBCREQ  EQU   TCBCMPF                                                  03067000
TCBTIO   EQU   TCB+12                                                   03068000
TCBDEB   EQU   TCB+8                                                    03069000
TCBPIEA  EQU   TCBPIE+1                                                 03070000
TCBPM    EQU   TCBPMASK                                                 03071000
@NM00003 EQU   TCBPMASK                                                 03072000
TCBFRS6  EQU   TCBFRS+24                                                03073000
TCBFRS4  EQU   TCBFRS+16                                                03074000
TCBFRS2  EQU   TCBFRS+8                                                 03075000
TCBFRS0  EQU   TCBFRS                                                   03076000
S99TUPRM EQU   S99TUFLD+2                                               03077000
S99TUPAR EQU   S99TUENT+2                                               03078000
S99TUPLN EQU   S99TUPTR                                                 03079000
S99FLG24 EQU   S99FLAG2+3                                               03080000
S99FLG23 EQU   S99FLAG2+2                                               03081000
S99PCINT EQU   S99FLG22                                                 03082000
S99UDEVT EQU   S99FLG22                                                 03083000
S99MOUNT EQU   S99FLG21                                                 03084000
S99CATLG EQU   S99FLG21                                                 03085000
S99OFFLN EQU   S99FLG21                                                 03086000
S99WTUNT EQU   S99FLG21                                                 03087000
S99NORES EQU   S99FLG21                                                 03088000
S99WTDSN EQU   S99FLG21                                                 03089000
S99WTVOL EQU   S99FLG21                                                 03090000
S99INFO  EQU   S99RSC+2                                                 03091000
S99JBSYS EQU   S99FLG11                                                 03092000
S99NOMNT EQU   S99FLG11                                                 03093000
S99NOCNV EQU   S99FLG11                                                 03094000
S99ONCNV EQU   S99FLG11                                                 03095000
ASWACHNP EQU   ASWA+36                                                  03096000
ASWRSV02 EQU   ASWAFLGS+1                                               03097000
ASWRSV01 EQU   ASWADSWS                                                 03098000
ASWAVMVF EQU   ASWADSWS                                                 03099000
ASWACOMF EQU   ASWADSWS                                                 03100000
ASWAOLDP EQU   ASWA+24                                                  03101000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03102000
@RC00157 EQU   @RC00154                                                 03103000
@RC00218 EQU   @RC00216                                                 03104000
@RC00295 EQU   @RC00266                                                 03105000
@RF00351 EQU   @RC00295                                                 03106000
@ENDDATA EQU   *                                                        03107000
         END   IEFDB400,(C'PLS1335',0701,78089)                         03108000
