         TITLE 'IEFSD160-INITIATOR INITIALIZATION                      *00001000
                        '                                               00002000
IEFSD060 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IEFSD060  74.222'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         LR    @10,@01                                             0001 00013000
         L     @00,@SIZDATD                                        0001 00014000
         GETMAIN  R,LV=(0)                                              00015000
         LR    @11,@01                                             0001 00016000
         USING @DATD,@11                                           0001 00017000
         LR    @01,@10                                             0001 00018000
         MVC   @PC00001(4),0(@01)                                  0001 00019000
JSCBDISP EQU 188                                                        00020000
JSCBAOS1 EQU  72                                                        00021000
JSCBAOS2 EQU 192                                                        00022000
*   IELPTR=PARMPTR;                 /* SAVE THE IEL PTR              */ 00023000
         LR    IELPTR,PARMPTR                                      0054 00024000
*   RESPECIFY                                                      0055 00025000
*     PARMPTR UNRSTD;                                              0055 00026000
*                                                                  0055 00027000
*/* THE FOLLOWING SECTION OF CODE GET CORE FOR THE LCT, INITIALIZES     00028000
*   IT TO ZERO,AND MOVE FIELD TO IT FROM THE IEL                     */ 00029000
*                                                                  0056 00030000
*   RESPECIFY                                                      0056 00031000
*    (R0,                                                          0056 00032000
*     COREPTR) RSTD;                                               0056 00033000
*   SUBPOOOL=JSCBSWSP;              /* GET THE SWA SUBPOOL # FROM THE   00034000
*                                      JSCB                          */ 00035000
         L     @10,CVTPTR                                          0057 00036000
         L     @10,CVTTCBP(,@10)                                   0057 00037000
         L     @10,CURRTCB(,@10)                                   0057 00038000
         L     @10,TCBJSCB(,@10)                                   0057 00039000
         MVC   SUBPOOOL(1),JSCBSWSP(@10)                           0057 00040000
*   LCTLGTH=LENGTH(LCT);            /* GET THE LENGTH OF THE LCT     */ 00041000
*                                                                  0058 00042000
         MVC   LCTLGTH(3),@CF02222+1                               0058 00043000
*   /*****************************************************************/ 00044000
*   /*                                                               */ 00045000
*   /* THE MODESET IS ISSUED SO CORE FOR THE LCT WILL BE GOTTEN IN   */ 00046000
*   /* KEY ONE. THIS IS DONE BECAUSE TASKS EXECUTING IN KEY ONE      */ 00047000
*   /* MODIFY THE LCT.                                               */ 00048000
*   /*                                                               */ 00049000
*   /*****************************************************************/ 00050000
*                                                                  0059 00051000
*   GEN(MODESET EXTKEY=SCHED);      /* GET PSW KEY 1         @YM01566*/ 00052000
         MODESET EXTKEY=SCHED                                           00053000
*   R0=COREVAL;                     /* PUT SUBPOOL AND LENGTH OF LCT    00054000
*                                      IN R0                         */ 00055000
         L     R0,COREVAL                                          0060 00056000
*   GEN(GETMAIN R,LV=(0));          /* GET CORE FOR THE LCT          */ 00057000
         GETMAIN R,LV=(0)                                               00058000
*   LCTPTR=COREPTR;                                                0062 00059000
         LR    LCTPTR,COREPTR                                      0062 00060000
*   GEN(MODESET EXTKEY=SUPR);       /* GET PSW KEY 0         @YM01566*/ 00061000
         MODESET EXTKEY=SUPR                                            00062000
*   RESPECIFY                                                      0064 00063000
*    (R0,                                                          0064 00064000
*     COREPTR) UNRSTD;                                             0064 00065000
*   LCT(1:256)=''B;                 /* INITIALIZE THE LCT TO ZEROS   */ 00066000
         XC    LCT(256,LCTPTR),LCT(LCTPTR)                         0065 00067000
*   LCT(257:LENGTH(LCT))=''B;                                      0066 00068000
         XC    LCT+256(256,LCTPTR),LCT+256(LCTPTR)                 0066 00069000
*   LCTLABEL=NAMELCT;               /* INITIALIZE THE LCT NAME FIELD    00070000
*                                                            @Y02BPSD*/ 00071000
         MVC   LCTLABEL(8,LCTPTR),NAMELCT                          0067 00072000
*   IF CHTRKID='03'X THEN                                          0068 00073000
         L     @10,CVTPTR                                          0068 00074000
         L     @10,CVTTCBP(,@10)                                   0068 00075000
         L     @10,CURRTCB(,@10)                                   0068 00076000
         L     @01,TCBJSCB(,@10)                                   0068 00077000
         L     @01,JSCBCSCB(,@01)                                  0068 00078000
         CLI   CHTRKID(@01),X'03'                                  0068 00079000
         BNE   @RF00068                                            0068 00080000
*     DO;                           /* IF THIS IS AN INITIATOR THEN     00081000
*                                      DO                            */ 00082000
*       TIOCNJOB=TIOCSTEP;          /* MAKE THE TASK NAME THE JOBNAME*/ 00083000
         L     @10,TCBTIO(,@10)                                    0070 00084000
         MVC   TIOCNJOB(8,@10),TIOCSTEP(@10)                       0070 00085000
*       TIOCSTEP=' ';               /* BLANK OUT THE TASKNAME        */ 00086000
         MVI   TIOCSTEP+1(@10),C' '                                0071 00087000
         MVC   TIOCSTEP+2(14,@10),TIOCSTEP+1(@10)                  0071 00088000
         MVI   TIOCSTEP(@10),C' '                                  0071 00089000
*       RESPECIFY                                                  0072 00090000
*         R14 RSTD;                                                0072 00091000
*       R14=IELRTNA;                /* SAVE THE INITIATOR'S RETURN 0073 00092000
*                                      ADDR                          */ 00093000
         L     R14,IELRTNA(,IELPTR)                                0073 00094000
*     END;                                                         0074 00095000
*   LCTENTR=IELPTR;                 /* MOVE THE IEL PTR TO THE LCT   */ 00096000
@RF00068 ST    IELPTR,LCTENTR(,LCTPTR)                             0075 00097000
*   LCTQDRTY=IELCSCB;               /* MOVE THE CSCB PTR TO THE LCT  */ 00098000
         MVC   LCTQDRTY(4,LCTPTR),IELCSCB(IELPTR)                  0076 00099000
*   LCTOPSW1=IELOPSW1;                                             0077 00100000
         L     @15,IELOPLST(,IELPTR)                               0077 00101000
         MVC   LCTOPSW1(1,LCTPTR),IELOPSW1(@15)                    0077 00102000
*   LCTOPSW2=IELOPSW2;              /* MOVE THE OPTIONS TO THE LCT   */ 00103000
         MVC   LCTOPSW2(1,LCTPTR),IELOPSW2(@15)                    0078 00104000
*   LCTOPSW3=IELOPSW3;                                             0079 00105000
         MVC   LCTOPSW3(1,LCTPTR),IELOPSW3(@15)                    0079 00106000
*   LCTTSIZ=IELTSIZ;                /* SET TIOT SIZE FOR MSTR SCHED     00107000
*                                      AT 4K                 @YA00817*/ 00108000
         MVC   LCTTSIZ(1,LCTPTR),IELTSIZ(@15)                      0080 00109000
*   LCTRTRN=R14;                    /* SAVE THE RETURN ADDR IN THE 0081 00110000
*                                      LCT                           */ 00111000
         ST    R14,LCTRTRN(,LCTPTR)                                0081 00112000
*   RESPECIFY                                                      0082 00113000
*     R14 UNRSTD;                                                  0082 00114000
*   LCTIMSG=ADDR(IEFIB650);         /* SAVE THE ADDR OF THE        0083 00115000
*                                      INITIATOR'S MESSAGE MODULE IN    00116000
*                                      THE LCT                       */ 00117000
         L     @10,@CV00060                                        0083 00118000
         ST    @10,LCTIMSG(,LCTPTR)                                0083 00119000
*   LCTCMCBA=ADDR(REGSAVE);         /* SET UP A REGISTER SAVE AREA   */ 00120000
         LA    @10,REGSAVE(,LCTPTR)                                0084 00121000
         ST    @10,LCTCMCBA(,LCTPTR)                               0084 00122000
*   LCTTCBAD=CURRTCB;               /* SAVE ADDR OF CURRENT TCB      */ 00123000
         L     @10,CVTPTR                                          0085 00124000
         L     @10,CVTTCBP(,@10)                                   0085 00125000
         L     @10,CURRTCB(,@10)                                   0085 00126000
         ST    @10,LCTTCBAD(,LCTPTR)                               0085 00127000
*   IF IELCRF='1'B THEN                                            0086 00128000
         TM    IELCRF(@15),B'01000000'                             0086 00129000
         BNO   @RF00086                                            0086 00130000
*     TCBNOCHK='1'B;                /* PROPOGATE CHKPT RESTART     0087 00131000
*                                      INDICATOR TO THE TCB          */ 00132000
         OI    TCBNOCHK(@10),B'01000000'                           0087 00133000
*   LCTSRTAD=CVTILK2;               /* SAVE THE ADDR OF THE LOOK UP     00134000
*                                      TABLE                         */ 00135000
@RF00086 L     @10,CVTPTR                                          0088 00136000
         MVC   LCTSRTAD(4,LCTPTR),CVTILK2(@10)                     0088 00137000
*   LCTPSPAR=CVTQMWR;               /* ADDRESS OF SWA MANAGER'S    0089 00138000
*                                      COMMUNICATION DATA AREA       */ 00139000
         MVC   LCTPSPAR(4,LCTPTR),CVTQMWR(@10)                     0089 00140000
*   LCTSSOBA=IELSSOBA;              /* SAVE THE ADDR OF THE SSOB IN     00141000
*                                      THE LCT                       */ 00142000
         MVC   LCTSSOBA(4,LCTPTR),IELSSOBA(IELPTR)                 0090 00143000
*   QMPCL=ADDR(REGSAVE)+72;         /* SWA MANAGER WORK AREA         */ 00144000
         LA    @10,248                                             0091 00145000
         ALR   @10,LCTPTR                                          0091 00146000
         LA    @15,REGSAVE(,LCTPTR)                                0091 00147000
         AH    @15,@CH02215                                        0091 00148000
         ST    @15,QMPCL(,@10)                                     0091 00149000
*   QMSWSP=IELSWAS;                 /* SAVE THE SWA SUBPOOL NO.      */ 00150000
         L     @01,IELOPLST(,IELPTR)                               0092 00151000
         MVC   QMSWSP(1,@10),IELSWAS(@01)                          0092 00152000
*   LCTASCBA=PSAAOLD;               /* SAVE ADDR OF THE CURRENT ASCB */ 00153000
         MVC   LCTASCBA(4,LCTPTR),PSAAOLD                          0093 00154000
*/* THIS SECTION OF CODE GETS CORE FOR A STAE EXIT PARAMETER LIST  0094 00155000
*   AND ISSUES AN ESTAE TO ESTABLISH A STAE ENVIRONMENT FOR THE    0094 00156000
*   INITIATOR SUBROUTINE                                             */ 00157000
*                                                                  0094 00158000
*   RESPECIFY                                                      0094 00159000
*    (R0,                                                          0094 00160000
*     COREPTR) RSTD;                                               0094 00161000
*   R0=LENGTH(STEPL);               /* PUT THE LENGTH OF THE STAE  0095 00162000
*                                      EXIT PARAMETER LIST IN REG 0  */ 00163000
         LA    R0,16                                               0095 00164000
*   R0=R0|'FF000000'X;              /* PUT SUBPOOL 255 IN THE HIGH 0096 00165000
*                                      ORDER BYTE.                   */ 00166000
         O     R0,@CF02216                                         0096 00167000
*   GEN(GETMAIN R,LV=(0));          /* GET CORE FOR THE STEPL        */ 00168000
         GETMAIN R,LV=(0)                                               00169000
*   LCTSTEPL=COREPTR;               /* SAVE THE STEPL ADDRESS IN THE    00170000
*                                      LCT                           */ 00171000
         ST    COREPTR,LCTSTEPL(,LCTPTR)                           0098 00172000
*   RESPECIFY                                                      0099 00173000
*    (STEPLPTR,                                                    0099 00174000
*     IB620PTR) RSTD;                                              0099 00175000
*   STEPLPTR=LCTSTEPL;              /* ADDR OF STAE EXIT PARMLIST  0100 00176000
*                                                            @YM01890*/ 00177000
         L     @10,LCTSTEPL(,LCTPTR)                               0100 00178000
         LR    STEPLPTR,@10                                        0100 00179000
*   STEPL=''B;                      /* CLEAR THE STEPL       @YMO1890*/ 00180000
         XC    STEPL(16,STEPLPTR),STEPL(STEPLPTR)                  0101 00181000
*   STELCT=LCTPTR;                  /* SAVE ADDR OF LCT IN STEPL     */ 00182000
         ST    LCTPTR,STELCT(,STEPLPTR)                            0102 00183000
*   RESPECIFY                                                      0103 00184000
*    (R0,                                                          0103 00185000
*     COREPTR) UNRSTD;                                             0103 00186000
*   IB620PTR=ADDR(IEFIB620);        /* GET PTR TO IEFIB620           */ 00187000
         L     IB620PTR,@CV00062                                   0104 00188000
*   ESTAEDCT(1:ESTAELEN)=ESTAELST(1:ESTAELEN);/* MOVE LIST TO DSECT  */ 00189000
         L     @10,ESTAELEN                                        0105 00190000
         BCTR  @10,0                                               0105 00191000
         EX    @10,@SM02224                                        0105 00192000
*/*ISSUE AN ESTAE TO CREATE A STAE ENVIRONMENT FOR THIS INITIATOR    */ 00193000
*                                                                  0106 00194000
*   GEN REFS(ESTAEDCT);                                            0106 00195000
    ESTAE (4),PARAM=(2),XCTL=YES,RECORD=YES,MF=(E,ESTAEDCT)             00196000
*   RESPECIFY                                                      0107 00197000
*    (STEPLPTR,                                                    0107 00198000
*     IB620PTR) UNRSTD;                                            0107 00199000
*   RESPECIFY                                                      0108 00200000
*    (R1,                                                          0108 00201000
*     R15) RSTD;                                                   0108 00202000
*   IF R15^=0 THEN                                                 0109 00203000
         LTR   R15,R15                                             0109 00204000
         BZ    @RF00109                                            0109 00205000
*     DO;                           /* IF A STAE ENVIRONMENT COULD 0110 00206000
*                                      NOT BE ESTABLISHED FOR THIS 0110 00207000
*                                      INITIATOR, THEN THE STAE EXIT    00208000
*                                      PARAMETER LIST IS FREED AND 0110 00209000
*                                      ITS POINTER IN THE LCT IS   0110 00210000
*                                      ZEROED.                       */ 00211000
*       RESPECIFY                                                  0111 00212000
*         R0 RSTD;                                                 0111 00213000
*       R0=LENGTH(STEPL);           /* GET LENGTH OF STAE EXIT     0112 00214000
*                                      PARMLIST                      */ 00215000
         LA    R0,16                                               0112 00216000
*       R0=R0|'FF000000'X;          /* PUT SUBPOOL 255 IN THE HIGH 0113 00217000
*                                      ORDER BYTE.                   */ 00218000
         O     R0,@CF02216                                         0113 00219000
*       R1=LCTSTEPL;                /* GET THE ADDRESS OF THE STAE 0114 00220000
*                                      EXIT PARAMETER LIST.          */ 00221000
         L     R1,LCTSTEPL(,LCTPTR)                                0114 00222000
*       GEN(FREEMAIN R,LV=(0),A=(1));/* FREE THE STEPL               */ 00223000
         FREEMAIN R,LV=(0),A=(1)                                        00224000
*       RESPECIFY                                                  0116 00225000
*         R0 UNRSTD;                                               0116 00226000
*       LCTSTEPL=0;                 /* ZERO THE STEPL PTR IN THE LCT */ 00227000
         SLR   @14,@14                                             0117 00228000
         ST    @14,LCTSTEPL(,LCTPTR)                               0117 00229000
*     END;                                                         0118 00230000
*   RESPECIFY                                                      0119 00231000
*     R14 RSTD;                                                    0119 00232000
@RF00109 DS    0H                                                  0120 00233000
*   R14=ADDR(RTNADDR);              /* PUT RETURN ADDR IN 14         */ 00234000
         LA    R14,RTNADDR                                         0120 00235000
*   RETURN;                         /* ISSUE DUMMY RETURN TO FREE  0121 00236000
*                                      CORE                          */ 00237000
@EL00001 DS    0H                                                  0121 00238000
@EF00001 L     @00,@SIZDATD                                        0121 00239000
         LR    @01,@11                                             0121 00240000
         FREEMAIN R,LV=(0),A=(1)                                        00241000
@ER00001 BR    @14                                                 0121 00242000
*   RESPECIFY                                                      0122 00243000
*     R14 UNRSTD;                                                  0122 00244000
*RTNADDR:                                                          0123 00245000
*   R1=LCTPTR;                      /* PUT THE LCT ADDR IN REG 1     */ 00246000
RTNADDR  LR    R1,LCTPTR                                           0123 00247000
*   R15=ADDR(IEFSD061);             /* GET ADDRESS OF IEFSD061       */ 00248000
         L     R15,@CV00061                                        0124 00249000
*   GEN(BR 15);                     /* BRANCH TO JOB SELECTION       */ 00250000
         BR 15                                                          00251000
*   GEN DATA DEFS(ESTAELST,ESTAELEN);                              0126 00252000
*   GEN DATA DEFS(ESTAEDCT);                                       0127 00253000
*   END IEFSD060                                                   0128 00254000
*                                                                  0128 00255000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00256000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00257000
*/*%INCLUDE SYSLIB  (IEEBASEA)                                       */ 00258000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 00259000
*/*%INCLUDE SYSLIB  (IEZJSCB )                                       */ 00260000
*/*%INCLUDE SYSLIB  (IEFALLCT)                                       */ 00261000
*/*%INCLUDE SYSLIB  (IEZIELDF)                                       */ 00262000
*/*%INCLUDE SYSLIB  (IEZIEL  )                                       */ 00263000
*/*%INCLUDE SYSLIB  (IEFZB622)                                       */ 00264000
*/*%INCLUDE SYSLIB  (IEFTIOT1)                                       */ 00265000
*/*%INCLUDE SYSLIB  (IEECHAIN)                                       */ 00266000
*/*%INCLUDE SYSLIB  (IEFQMNGR)                                       */ 00267000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00268000
*                                                                  0128 00269000
*       ;                                                          0128 00270000
         B     @EL00001                                            0128 00271000
@DATA    DS    0H                                                       00272000
@CH02215 DC    H'72'                                                    00273000
@SM02224 MVC   ESTAEDCT(0),ESTAELST                                     00274000
@DATD    DSECT                                                          00275000
         DS    0F                                                       00276000
@PC00001 DS    1F                                                       00277000
IEFSD060 CSECT                                                          00278000
         DS    0F                                                       00279000
@CF02222 DC    F'512'                                                   00280000
@CF02216 DC    XL4'FF000000'                                            00281000
@DATD    DSECT                                                          00282000
         DS    0D                                                       00283000
TEMP     DS    CL4                                                      00284000
         ORG   TEMP                                                     00285000
COREVAL  DS    FL4                                                      00286000
         ORG   COREVAL                                                  00287000
SUBPOOOL DS    FL1                                                      00288000
LCTLGTH  DS    FL3                                                      00289000
         ORG   TEMP+4                                                   00290000
IEFSD060 CSECT                                                          00291000
         DS    0F                                                       00292000
@SIZDATD DC    AL1(0)                                                   00293000
         DC    AL3(@ENDDATD-@DATD)                                      00294000
@CV00060 DC    V(IEFIB650)                                              00295000
@CV00061 DC    V(IEFSD061)                                              00296000
@CV00062 DC    V(IEFIB620)                                              00297000
         DS    0D                                                       00298000
PATCH    DC    CL40' '                                                  00299000
NAMELCT  DC    CL8'ENDOFLCT'                                            00300000
IEFSD060 CSECT                                                          00301000
ESTAELST ESTAE XCTL=YES,RECORD=YES,MF=L                                 00302000
ESTAELEN DC  A(*-ESTAELST)                                              00303000
@DATD    DSECT                                                          00304000
ESTAEDCT ESTAE XCTL=YES,RECORD=YES,MF=L                                 00305000
@DATD    DSECT                                                          00306000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00307000
@ENDDATD EQU   *                                                        00308000
IEFSD060 CSECT                                                          00309000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00310000
@01      EQU   01                                                       00311000
@02      EQU   02                                                       00312000
@03      EQU   03                                                       00313000
@04      EQU   04                                                       00314000
@05      EQU   05                                                       00315000
@06      EQU   06                                                       00316000
@07      EQU   07                                                       00317000
@08      EQU   08                                                       00318000
@09      EQU   09                                                       00319000
@10      EQU   10                                                       00320000
@11      EQU   11                                                       00321000
@12      EQU   12                                                       00322000
@13      EQU   13                                                       00323000
@14      EQU   14                                                       00324000
@15      EQU   15                                                       00325000
R0       EQU   @00                                                      00326000
R1       EQU   @01                                                      00327000
COREPTR  EQU   @01                                                      00328000
PARMPTR  EQU   @01                                                      00329000
IELPTR   EQU   @02                                                      00330000
STEPLPTR EQU   @02                                                      00331000
LCTPTR   EQU   @03                                                      00332000
IB620PTR EQU   @04                                                      00333000
R14      EQU   @14                                                      00334000
R15      EQU   @15                                                      00335000
WORKREG  EQU   @04                                                      00336000
CVTPTR   EQU   16                                                       00337000
PSA      EQU   0                                                        00338000
FLCRNPSW EQU   PSA                                                      00339000
FLCROPSW EQU   PSA+8                                                    00340000
FLCICCW2 EQU   PSA+16                                                   00341000
PSAEEPSW EQU   PSA+132                                                  00342000
PSAESPSW EQU   PSA+136                                                  00343000
FLCSVILC EQU   PSAESPSW+1                                               00344000
PSAEPPSW EQU   PSA+140                                                  00345000
FLCPIILC EQU   PSAEPPSW+1                                               00346000
FLCPICOD EQU   PSAEPPSW+2                                               00347000
PSAPICOD EQU   FLCPICOD+1                                               00348000
FLCTEA   EQU   PSAEPPSW+4                                               00349000
FLCPER   EQU   PSA+152                                                  00350000
FLCMCLA  EQU   PSA+168                                                  00351000
FLCIOEL  EQU   FLCMCLA+4                                                00352000
FLCIOA   EQU   FLCMCLA+16                                               00353000
FLCFSA   EQU   FLCMCLA+80                                               00354000
PSAAOLD  EQU   PSA+548                                                  00355000
PSASUPER EQU   PSA+552                                                  00356000
PSASUP1  EQU   PSASUPER                                                 00357000
PSASUP2  EQU   PSASUPER+1                                               00358000
PSASUP3  EQU   PSASUPER+2                                               00359000
PSASUP4  EQU   PSASUPER+3                                               00360000
PSACLHT  EQU   PSA+640                                                  00361000
PSALKSA  EQU   PSA+696                                                  00362000
PSAHLHI  EQU   PSA+760                                                  00363000
PSADSSFL EQU   PSA+836                                                  00364000
PSADSSF1 EQU   PSADSSFL                                                 00365000
PSADSSF3 EQU   PSADSSFL+2                                               00366000
PSADSSF4 EQU   PSADSSFL+3                                               00367000
PSARSVT  EQU   PSA+896                                                  00368000
CVTMAP   EQU   0                                                        00369000
CVTTCBP  EQU   CVTMAP                                                   00370000
CVTILK2  EQU   CVTMAP+40                                                00371000
CVTDAR   EQU   CVTMAP+72                                                00372000
CVTFLGS1 EQU   CVTDAR                                                   00373000
CVTDCB   EQU   CVTMAP+116                                               00374000
CVTIERLC EQU   CVTMAP+144                                               00375000
CVTMSER  EQU   CVTMAP+148                                               00376000
CVTQMWR  EQU   CVTMAP+176                                               00377000
CVTOPTA  EQU   CVTMAP+182                                               00378000
CVTOPTB  EQU   CVTMAP+183                                               00379000
CVTGTF   EQU   CVTMAP+236                                               00380000
CVTGTFST EQU   CVTGTF                                                   00381000
CVTGTFS  EQU   CVTGTFST                                                 00382000
CVTSTATE EQU   CVTGTFST                                                 00383000
CVTTMODE EQU   CVTGTFST                                                 00384000
CVTFORM  EQU   CVTGTFST                                                 00385000
CVTAQAVT EQU   CVTMAP+240                                               00386000
CVTTCMFG EQU   CVTAQAVT                                                 00387000
CVTVOLM2 EQU   CVTMAP+244                                               00388000
CVTTATA  EQU   CVTVOLM2                                                 00389000
CVTTSKS  EQU   CVTTATA                                                  00390000
CVTVOLF2 EQU   CVTTSKS                                                  00391000
CVTTAT   EQU   CVTTATA+1                                                00392000
CVTATER  EQU   CVTMAP+248                                               00393000
CVTEXT1  EQU   CVTMAP+252                                               00394000
CVTPURG  EQU   CVTMAP+260                                               00395000
CVTQMSG  EQU   CVTMAP+268                                               00396000
CVTDMSR  EQU   CVTMAP+272                                               00397000
CVTERPV  EQU   CVTMAP+316                                               00398000
CVTINTLA EQU   CVTMAP+320                                               00399000
CVTAPF   EQU   CVTMAP+324                                               00400000
CVTEXT2  EQU   CVTMAP+328                                               00401000
CVTHJES  EQU   CVTMAP+332                                               00402000
CVTPGSIA EQU   CVTMAP+348                                               00403000
CVTA1F1  EQU   CVTMAP+356                                               00404000
CVTSYSK  EQU   CVTMAP+357                                               00405000
CVTVOLM1 EQU   CVTMAP+380                                               00406000
CVTVOLF1 EQU   CVTVOLM1                                                 00407000
CVTATMCT EQU   CVTMAP+388                                               00408000
CVTXTNT1 EQU   0                                                        00409000
CVTXTNT2 EQU   0                                                        00410000
CVTDSSV  EQU   CVTXTNT2                                                 00411000
CVTFLGBT EQU   CVTXTNT2+5                                               00412000
CVTQID   EQU   CVTXTNT2+24                                              00413000
CVTRV400 EQU   CVTXTNT2+52                                              00414000
CVTRV409 EQU   CVTXTNT2+53                                              00415000
CVTATCVT EQU   CVTXTNT2+64                                              00416000
CVTRV429 EQU   CVTXTNT2+84                                              00417000
CVTRV438 EQU   CVTXTNT2+85                                              00418000
CVTRV457 EQU   CVTXTNT2+112                                             00419000
CVTRV466 EQU   CVTXTNT2+113                                             00420000
CVTFIX   EQU   0                                                        00421000
CVTRELNO EQU   CVTFIX+252                                               00422000
NXTCUR   EQU   0                                                        00423000
CURRTCB  EQU   NXTCUR+4                                                 00424000
BASE     EQU   0                                                        00425000
@NM00004 EQU   BASE+13                                                  00426000
BALGSTAT EQU   BASE+24                                                  00427000
BALOG    EQU   BALGSTAT+4                                               00428000
BASFL    EQU   BASE+36                                                  00429000
BARSW    EQU   BASFL                                                    00430000
MSLOGST  EQU   BASE+46                                                  00431000
BASPBYTE EQU   BASE+47                                                  00432000
BAMONITR EQU   BASE+56                                                  00433000
@NM00026 EQU   BASE+104                                                 00434000
MSLGCLOZ EQU   BASE+108                                                 00435000
MSCLOSSW EQU   MSLGCLOZ                                                 00436000
MSLGWLOG EQU   BASE+112                                                 00437000
MSWLOGSW EQU   MSLGWLOG                                                 00438000
MSLGWTR  EQU   BASE+116                                                 00439000
MSWTRSW  EQU   MSLGWTR                                                  00440000
MSLGSTRT EQU   BASE+120                                                 00441000
MSSTRTSW EQU   MSLGSTRT                                                 00442000
MS1BASEX EQU   BASE+136                                                 00443000
BASES01  EQU   0                                                        00444000
MSNTAL   EQU   BASES01                                                  00445000
MSSSB    EQU   BASES01+1                                                00446000
MSBTN    EQU   MSSSB                                                    00447000
MSPFG    EQU   BASES01+2                                                00448000
MSECBFL  EQU   BASES01+3                                                00449000
MSTUS    EQU   BASES01+4                                                00450000
MSSSA    EQU   MSTUS                                                    00451000
MSINLSW  EQU   MSSSA                                                    00452000
MSREOF   EQU   MSSSA                                                    00453000
MSNWP    EQU   MSSSA                                                    00454000
MSFHF    EQU   BASES01+5                                                00455000
TCBFIX   EQU   0                                                        00456000
TCBFRS   EQU   TCBFIX                                                   00457000
TCB      EQU   0                                                        00458000
TCBPIE   EQU   TCB+4                                                    00459000
TCBPMASK EQU   TCBPIE                                                   00460000
TCBTIO   EQU   TCB+12                                                   00461000
TCBCMP   EQU   TCB+16                                                   00462000
TCBCMPF  EQU   TCBCMP                                                   00463000
TCBCPP   EQU   TCBCMPF                                                  00464000
TCBSTCC  EQU   TCBCMPF                                                  00465000
TCBCDBL  EQU   TCBCMPF                                                  00466000
TCBCWTO  EQU   TCBCMPF                                                  00467000
TCBCIND  EQU   TCBCMPF                                                  00468000
TCBCMSG  EQU   TCBCMPF                                                  00469000
TCBTRN   EQU   TCB+20                                                   00470000
TCBABF   EQU   TCBTRN                                                   00471000
TCBNOCHK EQU   TCBABF                                                   00472000
TCBMSS   EQU   TCB+24                                                   00473000
TCBPKF   EQU   TCB+28                                                   00474000
TCBFLGS  EQU   TCB+29                                                   00475000
TCBFLGS1 EQU   TCBFLGS                                                  00476000
TCBFLGS2 EQU   TCBFLGS+1                                                00477000
TCBFLGS3 EQU   TCBFLGS+2                                                00478000
TCBFLGS4 EQU   TCBFLGS+3                                                00479000
TCBFLGS5 EQU   TCBFLGS+4                                                00480000
TCBABWF  EQU   TCBFLGS5                                                 00481000
TCBJPQ   EQU   TCB+44                                                   00482000
TCBPURGE EQU   TCBJPQ                                                   00483000
TCBGRS   EQU   TCB+48                                                   00484000
TCBFSA   EQU   TCB+112                                                  00485000
TCBTME   EQU   TCB+120                                                  00486000
TCBJSTCB EQU   TCB+124                                                  00487000
TCBTSFLG EQU   TCB+148                                                  00488000
TCBTSTSK EQU   TCBTSFLG                                                 00489000
TCBSTAB  EQU   TCB+160                                                  00490000
TCBNSTAE EQU   TCBSTAB                                                  00491000
TCBTCT   EQU   TCB+164                                                  00492000
TCBTCTGF EQU   TCBTCT                                                   00493000
TCBSCNDY EQU   TCB+172                                                  00494000
TCBNDSP  EQU   TCBSCNDY                                                 00495000
TCBNDSP1 EQU   TCBNDSP+1                                                00496000
TCBNDSP2 EQU   TCBNDSP+2                                                00497000
TCBNDSP3 EQU   TCBNDSP+3                                                00498000
TCBJSCB  EQU   TCB+180                                                  00499000
TCBRECDE EQU   TCBJSCB                                                  00500000
TCBEXT1  EQU   TCB+196                                                  00501000
TCBBITS  EQU   TCB+200                                                  00502000
TCBNDSP4 EQU   TCBBITS                                                  00503000
TCBNDSP5 EQU   TCBBITS+1                                                00504000
TCBFLGS6 EQU   TCBBITS+2                                                00505000
TCBFLGS7 EQU   TCBBITS+3                                                00506000
TCBDAR   EQU   TCB+204                                                  00507000
TCBDARC  EQU   TCBDAR                                                   00508000
TCBEXT2  EQU   TCB+208                                                  00509000
TCBFOE   EQU   TCB+244                                                  00510000
TCBESTAE EQU   TCB+264                                                  00511000
TCBESTRM EQU   TCBESTAE+1                                               00512000
TCBFBYT1 EQU   TCB+276                                                  00513000
TCBFBYT2 EQU   TCB+277                                                  00514000
TCBRV124 EQU   TCB+278                                                  00515000
TCBRV133 EQU   TCB+279                                                  00516000
TCBXTNT2 EQU   0                                                        00517000
TCBGTF   EQU   TCBXTNT2                                                 00518000
TCBTFLG  EQU   TCBGTF                                                   00519000
TCBRV146 EQU   TCBXTNT2+28                                              00520000
TCBRV155 EQU   TCBXTNT2+29                                              00521000
TCBRV164 EQU   TCBXTNT2+30                                              00522000
TCBRV173 EQU   TCBXTNT2+31                                              00523000
IEZJSCB  EQU   0                                                        00524000
JSCBSEC1 EQU   IEZJSCB+188                                              00525000
JSCHPCE  EQU   JSCBSEC1+4                                               00526000
JSCBDCB  EQU   JSCBSEC1+36                                              00527000
JSCBOPTS EQU   JSCBSEC1+48                                              00528000
JSCBSWT1 EQU   JSCBSEC1+55                                              00529000
JSCBWTP  EQU   JSCBSEC1+64                                              00530000
JSCBWTFG EQU   JSCBWTP                                                  00531000
JSCBCSCB EQU   JSCBSEC1+68                                              00532000
JSCBEND1 EQU   IEZJSCB+260                                              00533000
LCT      EQU   0                                                        00534000
LCTQDRTY EQU   LCT                                                      00535000
LCTSRTAD EQU   LCT+4                                                    00536000
LCTTCBAD EQU   LCT+8                                                    00537000
LCTQENTY EQU   LCT+12                                                   00538000
@NM00057 EQU   LCTQENTY                                                 00539000
LCTJCTAD EQU   LCT+16                                                   00540000
LCTSCTAD EQU   LCT+20                                                   00541000
LCTSCTDA EQU   LCT+24                                                   00542000
LCTWORKA EQU   LCTSCTDA                                                 00543000
LCTPSPAR EQU   LCT+28                                                   00544000
LCTERROR EQU   LCT+32                                                   00545000
LCTERR   EQU   LCTERROR                                                 00546000
LCTCMCBA EQU   LCT+52                                                   00547000
LCTNSPAD EQU   LCT+56                                                   00548000
LCTJFCBH EQU   LCT+57                                                   00549000
LCTSMBAD EQU   LCT+60                                                   00550000
LCTCOMCD EQU   LCT+68                                                   00551000
LCTRTRN  EQU   LCT+72                                                   00552000
LCTSREG  EQU   LCTRTRN                                                  00553000
@NM00084 EQU   LCT+76                                                   00554000
LCTINTSW EQU   @NM00084                                                 00555000
LCTTMWRK EQU   LCT+80                                                   00556000
LCTTJTU4 EQU   LCTTMWRK                                                 00557000
LCTTSTL4 EQU   LCTTMWRK+4                                               00558000
LCTTSTR4 EQU   LCTTMWRK+8                                               00559000
LCTSMF   EQU   LCTTSTR4                                                 00560000
LCTTMBYT EQU   LCTSMF                                                   00561000
LCTTSTU4 EQU   LCTTMWRK+12                                              00562000
LCTJOBLB EQU   LCT+96                                                   00563000
LCTATLST EQU   LCT+100                                                  00564000
REGSAVE  EQU   LCT+104                                                  00565000
QMGR1    EQU   LCT+248                                                  00566000
LCTASCBA EQU   LCT+320                                                  00567000
LCTECBAD EQU   LCT+328                                                  00568000
ECBLIST  EQU   LCTECBAD                                                 00569000
LCTIDENT EQU   LCT+332                                                  00570000
LCTSPIL  EQU   LCTIDENT+4                                               00571000
LCTALCFG EQU   LCTSPIL+2                                                00572000
LCTTSRB4 EQU   LCT+348                                                  00573000
LCTENTR  EQU   LCT+352                                                  00574000
LCTEXIT  EQU   LCTENTR                                                  00575000
LCTOPSW1 EQU   LCTEXIT                                                  00576000
@NM00110 EQU   LCT+356                                                  00577000
LCTOPSW2 EQU   @NM00110                                                 00578000
LCTJSCB  EQU   LCT+360                                                  00579000
LCTOPSW3 EQU   LCTJSCB                                                  00580000
LCTSTEPL EQU   LCT+400                                                  00581000
LCTSSOBA EQU   LCT+404                                                  00582000
LCTJCTDA EQU   LCT+408                                                  00583000
LCTSTATA EQU   LCT+416                                                  00584000
LCTSTATB EQU   LCT+417                                                  00585000
LCTRFB   EQU   LCT+418                                                  00586000
@NM00124 EQU   LCT+420                                                  00587000
LCTTSIZ  EQU   @NM00124                                                 00588000
LCTINTS2 EQU   @NM00124+1                                               00589000
LCTIMSG  EQU   LCT+432                                                  00590000
LCTLABEL EQU   LCT+504                                                  00591000
IEL      EQU   0                                                        00592000
IELLIST  EQU   IEL                                                      00593000
IELSSOBA EQU   IELLIST                                                  00594000
IELCSCB  EQU   IELLIST+4                                                00595000
IELOPLST EQU   IELLIST+8                                                00596000
IELRTNA  EQU   IELLIST+12                                               00597000
IELEXIT  EQU   IELLIST+20                                               00598000
IELLAST  EQU   IELEXIT                                                  00599000
IELOPTS  EQU   0                                                        00600000
IELOPSW1 EQU   IELOPTS+2                                                00601000
IELOPSW2 EQU   IELOPTS+3                                                00602000
IELCRF   EQU   IELOPSW2                                                 00603000
IELTSIZ  EQU   IELOPTS+4                                                00604000
IELOPSW3 EQU   IELOPTS+5                                                00605000
IELSWAS  EQU   IELOPTS+6                                                00606000
IELEXITS EQU   0                                                        00607000
IELEXHDR EQU   IELEXITS                                                 00608000
RTNEXT   EQU   IELEXITS+8                                               00609000
RTNEXNM  EQU   RTNEXT+2                                                 00610000
RTNEXAD  EQU   RTNEXNM+2                                                00611000
STEPL    EQU   0                                                        00612000
STELCT   EQU   STEPL                                                    00613000
@NM00140 EQU   STEPL+8                                                  00614000
STEFLAGS EQU   @NM00140                                                 00615000
TIOT1    EQU   0                                                        00616000
TIOCNJOB EQU   TIOT1                                                    00617000
TIOCSTEP EQU   TIOT1+8                                                  00618000
CHAIN    EQU   0                                                        00619000
CHFLG    EQU   CHAIN+4                                                  00620000
CHSTS    EQU   CHFLG+2                                                  00621000
CHACT    EQU   CHFLG+3                                                  00622000
CHKEY    EQU   CHAIN+8                                                  00623000
CHPKE    EQU   CHAIN+28                                                 00624000
CHTRKID  EQU   CHPKE                                                    00625000
CHTJID   EQU   CHAIN+30                                                 00626000
CHPROCSN EQU   CHAIN+32                                                 00627000
CHACT1   EQU   CHPROCSN+3                                               00628000
CHASM    EQU   CHAIN+40                                                 00629000
CHCIBP   EQU   CHASM+4                                                  00630000
CHRGNSZ  EQU   CHASM+8                                                  00631000
CHSTEP   EQU   CHASM+24                                                 00632000
CHSWT    EQU   CHSTEP                                                   00633000
CHSHORT  EQU   CHASM+32                                                 00634000
QMPA     EQU   0                                                        00635000
QMNAM    EQU   QMPA                                                     00636000
QMSTA    EQU   QMPA+16                                                  00637000
QMPCL    EQU   QMPA+32                                                  00638000
QMPCMNC  EQU   QMPCL                                                    00639000
SWAQMPA  EQU   0                                                        00640000
QMSWSP   EQU   SWAQMPA                                                  00641000
PARMS    EQU   0                                                        00642000
CVTS01   EQU   CVTPGSIA                                                 00643000
CVTLPDIA EQU   CVTS01+12                                                00644000
CVTDIRST EQU   CVTLPDIA                                                 00645000
CVTSLIDA EQU   CVTS01+24                                                00646000
CVTCTLFG EQU   CVTS01+50                                                00647000
CVTRV210 EQU   CVTS01+424                                               00648000
CVTRV219 EQU   CVTS01+425                                               00649000
CVTRV228 EQU   CVTS01+426                                               00650000
CVTRV237 EQU   CVTS01+427                                               00651000
CVTMFRTR EQU   CVTS01+452                                               00652000
CVTRV262 EQU   CVTS01+468                                               00653000
CVTRV271 EQU   CVTS01+469                                               00654000
CVTRV280 EQU   CVTS01+470                                               00655000
CVTRV289 EQU   CVTS01+471                                               00656000
CVTGSDA  EQU   CVTS01+600                                               00657000
JSCBSEC2 EQU   JSCBEND1                                                 00658000
JSCBSEC3 EQU   JSCBEND1                                                 00659000
JSCBJCT  EQU   JSCBSEC3                                                 00660000
JSCBJCTA EQU   JSCBJCT+1                                                00661000
JSCBASID EQU   JSCBSEC3+8                                               00662000
JSCBJNL  EQU   JSCBSEC3+28                                              00663000
JSCBJJSB EQU   JSCBJNL                                                  00664000
JSCBSUB  EQU   JSCBSEC3+40                                              00665000
JSCSCT   EQU   JSCBSEC3+68                                              00666000
JSCBSWSP EQU   JSCBSEC3+87                                              00667000
JSCRSV35 EQU   JSCBSEC3+96                                              00668000
JSCRSV36 EQU   JSCRSV35                                                 00669000
JSCRSV37 EQU   JSCRSV35+2                                               00670000
JSCRSV45 EQU   JSCBSEC3+112                                             00671000
JSCRSV46 EQU   JSCRSV45                                                 00672000
JSCRSV47 EQU   JSCRSV45+2                                               00673000
TIOENTRY EQU   TIOT1+24                                                 00674000
TIOESTTA EQU   TIOENTRY+1                                               00675000
TIOERLOC EQU   TIOENTRY+2                                               00676000
TIOELINK EQU   TIOERLOC+1                                               00677000
TIOESYOT EQU   TIOELINK                                                 00678000
TIOESTTC EQU   TIOENTRY+15                                              00679000
TIOESTTB EQU   TIOENTRY+16                                              00680000
POOLSTAR EQU   TIOENTRY+20                                              00681000
TIOEDEVE EQU   TIOESTTB                                                 00682000
TIOSTTB  EQU   TIOEDEVE                                                 00683000
CHAINS01 EQU   CHASM                                                    00684000
CHTYPE   EQU   CHAINS01+124                                             00685000
CHTRSTAT EQU   CHAINS01+125                                             00686000
CHCSYSO  EQU   CHAINS01+134                                             00687000
PSARSVTE EQU   PSARSVT                                                  00688000
FLC      EQU   PSA                                                      00689000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00690000
PSARSAV  EQU   PSARSVTE+60                                              00691000
PSARSTK  EQU   PSARSVTE+56                                              00692000
PSAESAV3 EQU   PSARSVTE+52                                              00693000
PSAESTK3 EQU   PSARSVTE+48                                              00694000
PSAESAV2 EQU   PSARSVTE+44                                              00695000
PSAESTK2 EQU   PSARSVTE+40                                              00696000
PSAESAV1 EQU   PSARSVTE+36                                              00697000
PSAESTK1 EQU   PSARSVTE+32                                              00698000
PSAPSAV  EQU   PSARSVTE+28                                              00699000
PSAPSTK  EQU   PSARSVTE+24                                              00700000
PSAMSAV  EQU   PSARSVTE+20                                              00701000
PSAMSTK  EQU   PSARSVTE+16                                              00702000
PSASSAV  EQU   PSARSVTE+12                                              00703000
PSASSTK  EQU   PSARSVTE+8                                               00704000
PSANSTK  EQU   PSARSVTE+4                                               00705000
PSACSTK  EQU   PSARSVTE                                                 00706000
CHLAST   EQU   CHAINS01+136                                             00707000
CHSPA    EQU   CHAINS01+135                                             00708000
CHUSERID EQU   CHCSYSO                                                  00709000
CHJB     EQU   CHCSYSO                                                  00710000
CHDUMP   EQU   CHCSYSO                                                  00711000
CHQUE    EQU   CHCSYSO                                                  00712000
CHHOLD   EQU   CHCSYSO                                                  00713000
CHOUT    EQU   CHCSYSO                                                  00714000
CHINN    EQU   CHCSYSO                                                  00715000
CHALL    EQU   CHCSYSO                                                  00716000
CHINC    EQU   CHAINS01+132                                             00717000
CHPEND   EQU   CHAINS01+128                                             00718000
CHARID   EQU   CHAINS01+127                                             00719000
CHCNID   EQU   CHAINS01+126                                             00720000
@NM00147 EQU   CHTRSTAT                                                 00721000
CHTSL    EQU   CHTRSTAT                                                 00722000
CHTS     EQU   CHTRSTAT                                                 00723000
CHINITL  EQU   CHTRSTAT                                                 00724000
CHINIT   EQU   CHTRSTAT                                                 00725000
CHJOBSL  EQU   CHTRSTAT                                                 00726000
CHJOBS   EQU   CHTRSTAT                                                 00727000
CHDEF    EQU   CHTYPE                                                   00728000
CHHIAR   EQU   CHTYPE                                                   00729000
CHARSV29 EQU   CHTYPE                                                   00730000
CHARSV28 EQU   CHTYPE                                                   00731000
CHARSV27 EQU   CHTYPE                                                   00732000
CHARSV26 EQU   CHTYPE                                                   00733000
CHARSV25 EQU   CHTYPE                                                   00734000
CHDSTAT  EQU   CHTYPE                                                   00735000
CHBUF    EQU   CHAINS01                                                 00736000
TIOUCBP  EQU   TIOEDEVE+1                                               00737000
TIOVERF  EQU   TIOSTTB                                                  00738000
TIOUNLD  EQU   TIOSTTB                                                  00739000
TIOMNTD  EQU   TIOSTTB                                                  00740000
TIOSETU  EQU   TIOSTTB                                                  00741000
TIOVLSR  EQU   TIOSTTB                                                  00742000
TIOPVIO  EQU   TIOSTTB                                                  00743000
TIOREQD  EQU   TIOSTTB                                                  00744000
TIOUSED  EQU   TIOSTTB                                                  00745000
TIOTFEND EQU   POOLSTAR+16                                              00746000
TIOPSLOT EQU   POOLSTAR+13                                              00747000
TIOPSTTB EQU   POOLSTAR+12                                              00748000
TIOPPOOL EQU   POOLSTAR+4                                               00749000
TIOPNSRT EQU   POOLSTAR+3                                               00750000
@NM00143 EQU   POOLSTAR+2                                               00751000
TIOPNSLT EQU   POOLSTAR+1                                               00752000
@NM00142 EQU   POOLSTAR                                                 00753000
TIOEFSRT EQU   TIOENTRY+17                                              00754000
TIOSVERF EQU   TIOESTTB                                                 00755000
TIOSUNLD EQU   TIOESTTB                                                 00756000
TIOSMNTD EQU   TIOESTTB                                                 00757000
TIOSSETU EQU   TIOESTTB                                                 00758000
TIOSVLSR EQU   TIOESTTB                                                 00759000
TIOSPVIO EQU   TIOESTTB                                                 00760000
TIOSREQD EQU   TIOESTTB                                                 00761000
TIOSUSED EQU   TIOESTTB                                                 00762000
TIOSBALS EQU   TIOESTTC                                                 00763000
TIOSBALP EQU   TIOESTTC                                                 00764000
TIOSVOLS EQU   TIOESTTC                                                 00765000
TIOSVOLP EQU   TIOESTTC                                                 00766000
TIOSAFFS EQU   TIOESTTC                                                 00767000
TIOSAFFP EQU   TIOESTTC                                                 00768000
TIOSDEFR EQU   TIOESTTC                                                 00769000
TIOSDKCR EQU   TIOESTTC                                                 00770000
TIOEJFCB EQU   TIOENTRY+12                                              00771000
TIOEDDNM EQU   TIOENTRY+4                                               00772000
TIOTREM  EQU   TIOELINK                                                 00773000
TIOESSDS EQU   TIOESYOT                                                 00774000
TIOESYIN EQU   TIOELINK                                                 00775000
TIOEQNAM EQU   TIOELINK                                                 00776000
TIOEDYNM EQU   TIOELINK                                                 00777000
TIOTTERM EQU   TIOELINK                                                 00778000
TIOTRV01 EQU   TIOELINK                                                 00779000
TIOSYOUT EQU   TIOELINK                                                 00780000
TIOEWTCT EQU   TIOERLOC                                                 00781000
TIOSDSP2 EQU   TIOESTTA                                                 00782000
TIOSDSP1 EQU   TIOESTTA                                                 00783000
TIOSLABL EQU   TIOESTTA                                                 00784000
TIOSDADS EQU   TIOESTTA                                                 00785000
TIOSJBLB EQU   TIOESTTA                                                 00786000
TIOSPLTS EQU   TIOESTTA                                                 00787000
TIOSPLTP EQU   TIOESTTA                                                 00788000
TIOSLTYP EQU   TIOESTTA                                                 00789000
TIOELNGH EQU   TIOENTRY                                                 00790000
JSCBEND3 EQU   JSCBSEC3+120                                             00791000
JSCRSV52 EQU   JSCBSEC3+116                                             00792000
JSCRSV51 EQU   JSCRSV47+1                                               00793000
JSCRSV50 EQU   JSCRSV47                                                 00794000
JSCRSV49 EQU   JSCRSV46+1                                               00795000
JSCRSV48 EQU   JSCRSV46                                                 00796000
JSCRSV44 EQU   JSCBSEC3+108                                             00797000
JSCRSV43 EQU   JSCBSEC3+104                                             00798000
JSCRSV42 EQU   JSCBSEC3+100                                             00799000
JSCRSV41 EQU   JSCRSV37+1                                               00800000
JSCRSV40 EQU   JSCRSV37                                                 00801000
JSCRSV39 EQU   JSCRSV36+1                                               00802000
JSCRSV38 EQU   JSCRSV36                                                 00803000
JSCBUFPT EQU   JSCBSEC3+92                                              00804000
JSCBACT  EQU   JSCBSEC3+88                                              00805000
JSCRSV33 EQU   JSCBSEC3+86                                              00806000
JSCDDNUM EQU   JSCBSEC3+84                                              00807000
JSCRSV53 EQU   JSCBSEC3+82                                              00808000
JSCDDNNO EQU   JSCBSEC3+80                                              00809000
JSCBVATA EQU   JSCBSEC3+76                                              00810000
JSCTMCOR EQU   JSCBSEC3+72                                              00811000
JSCSCTP  EQU   JSCSCT+1                                                 00812000
JSCRSV55 EQU   JSCSCT                                                   00813000
JSCRSV54 EQU   JSCBSEC3+64                                              00814000
JSCDSABQ EQU   JSCBSEC3+60                                              00815000
JSCBSSIB EQU   JSCBSEC3+56                                              00816000
JSCBFRBA EQU   JSCBSEC3+48                                              00817000
JSCRSV28 EQU   JSCBSEC3+46                                              00818000
JSCBSONO EQU   JSCBSEC3+44                                              00819000
JSCBSUBA EQU   JSCBSUB+1                                                00820000
JSCRSV31 EQU   JSCBSUB                                                  00821000
JSCBSMLR EQU   JSCBSEC3+36                                              00822000
JSCBJNLR EQU   JSCBSEC3+32                                              00823000
JSCBJNLA EQU   JSCBJNL+1                                                00824000
JSCBJSBT EQU   JSCBJJSB                                                 00825000
JSCBJSBX EQU   JSCBJJSB                                                 00826000
JSCBJSBA EQU   JSCBJJSB                                                 00827000
JSCBJSBI EQU   JSCBJJSB                                                 00828000
@NM00050 EQU   JSCBJJSB                                                 00829000
JSCBJNLE EQU   JSCBJJSB                                                 00830000
JSCBJNLF EQU   JSCBJJSB                                                 00831000
JSCBJNLN EQU   JSCBJJSB                                                 00832000
@NM00049 EQU   JSCBSEC3+24                                              00833000
JSCBJRBA EQU   JSCBSEC3+16                                              00834000
JSCBIECB EQU   JSCBSEC3+12                                              00835000
JSCRSV25 EQU   JSCBSEC3+10                                              00836000
JSCBTJID EQU   JSCBASID                                                 00837000
JSCBPSCB EQU   JSCBSEC3+4                                               00838000
JSCJCTP  EQU   JSCBJCTA                                                 00839000
JSCRSV24 EQU   JSCBJCT                                                  00840000
JSCBEND2 EQU   JSCBSEC2                                                 00841000
CVTRV628 EQU   CVTS01+728                                               00842000
CVTRV627 EQU   CVTS01+724                                               00843000
CVTRV626 EQU   CVTS01+720                                               00844000
CVTRV625 EQU   CVTS01+716                                               00845000
CVTRV624 EQU   CVTS01+712                                               00846000
CVTRV623 EQU   CVTS01+708                                               00847000
CVTRV622 EQU   CVTS01+704                                               00848000
CVTRV621 EQU   CVTS01+700                                               00849000
CVTRV620 EQU   CVTS01+696                                               00850000
CVTRV619 EQU   CVTS01+692                                               00851000
CVTRV618 EQU   CVTS01+688                                               00852000
CVTRV617 EQU   CVTS01+684                                               00853000
CVTRV616 EQU   CVTS01+680                                               00854000
CVTRV615 EQU   CVTS01+676                                               00855000
CVTRV614 EQU   CVTS01+672                                               00856000
CVTRV613 EQU   CVTS01+668                                               00857000
CVTRV612 EQU   CVTS01+664                                               00858000
CVTRV611 EQU   CVTS01+660                                               00859000
CVTRV610 EQU   CVTS01+656                                               00860000
CVTRV609 EQU   CVTS01+652                                               00861000
CVTRV608 EQU   CVTS01+648                                               00862000
CVTRV607 EQU   CVTS01+644                                               00863000
CVTRV606 EQU   CVTS01+640                                               00864000
CVTRV605 EQU   CVTS01+636                                               00865000
CVTRV604 EQU   CVTS01+632                                               00866000
CVTRV603 EQU   CVTS01+628                                               00867000
CVTRV602 EQU   CVTS01+624                                               00868000
CVTSSCR  EQU   CVTS01+620                                               00869000
CVTEVENT EQU   CVTS01+616                                               00870000
CVTCRCA  EQU   CVTS01+612                                               00871000
CVTTPIO  EQU   CVTS01+608                                               00872000
CVTADV   EQU   CVTS01+604                                               00873000
CVTGSDAB EQU   CVTGSDA                                                  00874000
CVTQV3   EQU   CVTS01+596                                               00875000
CVTQV2   EQU   CVTS01+592                                               00876000
CVTQV1   EQU   CVTS01+588                                               00877000
CVTRPT   EQU   CVTS01+584                                               00878000
CVTSSRB  EQU   CVTS01+580                                               00879000
CVTCSDRL EQU   CVTS01+576                                               00880000
CVTEXP1  EQU   CVTS01+572                                               00881000
CVTRMPMT EQU   CVTS01+568                                               00882000
CVTRMPTT EQU   CVTS01+564                                               00883000
CVTVPSA  EQU   CVTS01+560                                               00884000
CVTVSTOP EQU   CVTS01+556                                               00885000
CVTGTFR8 EQU   CVTS01+552                                               00886000
CVTQUIT  EQU   CVTS01+548                                               00887000
CVTVACR  EQU   CVTS01+544                                               00888000
CVTWTCB  EQU   CVTS01+540                                               00889000
CVTSTPRS EQU   CVTS01+536                                               00890000
CVT0PT02 EQU   CVTS01+532                                               00891000
CVTDARCM EQU   CVTS01+528                                               00892000
CVTIRECM EQU   CVTS01+524                                               00893000
CVTJRECM EQU   CVTS01+520                                               00894000
CVTVEMS0 EQU   CVTS01+516                                               00895000
CVTSPFRR EQU   CVTS01+512                                               00896000
CVTRLSTG EQU   CVTS01+508                                               00897000
CVT0TC0A EQU   CVTS01+504                                               00898000
CVTGMBR  EQU   CVTS01+500                                               00899000
CVTLFRM  EQU   CVTS01+496                                               00900000
CVTRMBR  EQU   CVTS01+492                                               00901000
CVTVIOP  EQU   CVTS01+488                                               00902000
CVTRV307 EQU   CVTS01+486                                               00903000
CVTRV306 EQU   CVTS01+484                                               00904000
CVTRV305 EQU   CVTS01+482                                               00905000
CVTRV304 EQU   CVTS01+480                                               00906000
CVTRV303 EQU   CVTS01+478                                               00907000
CVTRV302 EQU   CVTS01+476                                               00908000
CVTRV301 EQU   CVTS01+475                                               00909000
CVTRV300 EQU   CVTS01+474                                               00910000
CVTRV299 EQU   CVTS01+473                                               00911000
CVTRV298 EQU   CVTS01+472                                               00912000
CVTRV297 EQU   CVTRV289                                                 00913000
CVTRV296 EQU   CVTRV289                                                 00914000
CVTRV295 EQU   CVTRV289                                                 00915000
CVTRV294 EQU   CVTRV289                                                 00916000
CVTRV293 EQU   CVTRV289                                                 00917000
CVTRV292 EQU   CVTRV289                                                 00918000
CVTRV291 EQU   CVTRV289                                                 00919000
CVTRV290 EQU   CVTRV289                                                 00920000
CVTRV288 EQU   CVTRV280                                                 00921000
CVTRV287 EQU   CVTRV280                                                 00922000
CVTRV286 EQU   CVTRV280                                                 00923000
CVTRV285 EQU   CVTRV280                                                 00924000
CVTRV284 EQU   CVTRV280                                                 00925000
CVTRV283 EQU   CVTRV280                                                 00926000
CVTRV282 EQU   CVTRV280                                                 00927000
CVTRV281 EQU   CVTRV280                                                 00928000
CVTRV279 EQU   CVTRV271                                                 00929000
CVTRV278 EQU   CVTRV271                                                 00930000
CVTRV277 EQU   CVTRV271                                                 00931000
CVTRV276 EQU   CVTRV271                                                 00932000
CVTRV275 EQU   CVTRV271                                                 00933000
CVTRV274 EQU   CVTRV271                                                 00934000
CVTRV273 EQU   CVTRV271                                                 00935000
CVTRV272 EQU   CVTRV271                                                 00936000
CVTRV270 EQU   CVTRV262                                                 00937000
CVTRV269 EQU   CVTRV262                                                 00938000
CVTRV268 EQU   CVTRV262                                                 00939000
CVTRV267 EQU   CVTRV262                                                 00940000
CVTRV266 EQU   CVTRV262                                                 00941000
CVTRV265 EQU   CVTRV262                                                 00942000
CVTRV264 EQU   CVTRV262                                                 00943000
CVTRV263 EQU   CVTRV262                                                 00944000
CVTVFP   EQU   CVTS01+464                                               00945000
CVTVSI   EQU   CVTS01+460                                               00946000
CVTVPSIB EQU   CVTS01+456                                               00947000
CVTMFACT EQU   CVTMFRTR                                                 00948000
CVTMFCTL EQU   CVTS01+448                                               00949000
CVTPVBP  EQU   CVTS01+444                                               00950000
CVTPWI   EQU   CVTS01+440                                               00951000
CVTRV254 EQU   CVTS01+438                                               00952000
CVTRV253 EQU   CVTS01+436                                               00953000
CVTRV252 EQU   CVTS01+434                                               00954000
CVTRV251 EQU   CVTS01+433                                               00955000
CVTRV250 EQU   CVTS01+432                                               00956000
CVTRV249 EQU   CVTS01+431                                               00957000
CVTRV248 EQU   CVTS01+430                                               00958000
CVTRV247 EQU   CVTS01+429                                               00959000
CVTRV246 EQU   CVTS01+428                                               00960000
CVTRV245 EQU   CVTRV237                                                 00961000
CVTRV244 EQU   CVTRV237                                                 00962000
CVTRV243 EQU   CVTRV237                                                 00963000
CVTRV242 EQU   CVTRV237                                                 00964000
CVTRV241 EQU   CVTRV237                                                 00965000
CVTRV240 EQU   CVTRV237                                                 00966000
CVTRV239 EQU   CVTRV237                                                 00967000
CVTRV238 EQU   CVTRV237                                                 00968000
CVTRV236 EQU   CVTRV228                                                 00969000
CVTRV235 EQU   CVTRV228                                                 00970000
CVTRV234 EQU   CVTRV228                                                 00971000
CVTRV233 EQU   CVTRV228                                                 00972000
CVTRV232 EQU   CVTRV228                                                 00973000
CVTRV231 EQU   CVTRV228                                                 00974000
CVTRV230 EQU   CVTRV228                                                 00975000
CVTRV229 EQU   CVTRV228                                                 00976000
CVTRV227 EQU   CVTRV219                                                 00977000
CVTRV226 EQU   CVTRV219                                                 00978000
CVTRV225 EQU   CVTRV219                                                 00979000
CVTRV224 EQU   CVTRV219                                                 00980000
CVTRV223 EQU   CVTRV219                                                 00981000
CVTRV222 EQU   CVTRV219                                                 00982000
CVTRV221 EQU   CVTRV219                                                 00983000
CVTRV220 EQU   CVTRV219                                                 00984000
CVTRV218 EQU   CVTRV210                                                 00985000
CVTRV217 EQU   CVTRV210                                                 00986000
CVTRV216 EQU   CVTRV210                                                 00987000
CVTRV215 EQU   CVTRV210                                                 00988000
CVTRV214 EQU   CVTRV210                                                 00989000
CVTRV213 EQU   CVTRV210                                                 00990000
CVTRV212 EQU   CVTRV210                                                 00991000
CVTRV211 EQU   CVTRV210                                                 00992000
CVTLCCAT EQU   CVTS01+420                                               00993000
CVTPCCAT EQU   CVTS01+416                                               00994000
CVTIPCRP EQU   CVTS01+412                                               00995000
CVTIPCRI EQU   CVTS01+408                                               00996000
CVTIPCDS EQU   CVTS01+404                                               00997000
CVTAIDVT EQU   CVTS01+400                                               00998000
CVTSSAP  EQU   CVTS01+396                                               00999000
CVTEHCIR EQU   CVTS01+392                                               01000000
CVTEHDEF EQU   CVTS01+388                                               01001000
CVTDAIR  EQU   CVTS01+384                                               01002000
CVTPERFM EQU   CVTS01+380                                               01003000
CVT044R2 EQU   CVTS01+376                                               01004000
CVTFETCH EQU   CVTS01+372                                               01005000
CVTRSTWD EQU   CVTS01+368                                               01006000
CVTSPOST EQU   CVTS01+364                                               01007000
CVTIOBP  EQU   CVTS01+360                                               01008000
CVTASMVT EQU   CVTS01+356                                               01009000
CVTRECRQ EQU   CVTS01+352                                               01010000
CVTWSAC  EQU   CVTS01+348                                               01011000
CVTRV149 EQU   CVTS01+344                                               01012000
CVTWSAL  EQU   CVTS01+340                                               01013000
CVTSPSA  EQU   CVTS01+336                                               01014000
CVTGLMN  EQU   CVTS01+332                                               01015000
CVTVEAC0 EQU   CVTS01+328                                               01016000
CVT062R1 EQU   CVTS01+324                                               01017000
CVTRPOST EQU   CVTS01+320                                               01018000
CVTDQIQE EQU   CVTS01+316                                               01019000
CVTCSD   EQU   CVTS01+312                                               01020000
CVTLKRMA EQU   CVTS01+308                                               01021000
CVTRSPIE EQU   CVTS01+304                                               01022000
CVTRENQ  EQU   CVTS01+300                                               01023000
CVTLQCB  EQU   CVTS01+296                                               01024000
CVTFQCB  EQU   CVTS01+292                                               01025000
CVTQCS01 EQU   CVTS01+288                                               01026000
CVTAPFT  EQU   CVTS01+284                                               01027000
CVTPARRL EQU   CVTS01+280                                               01028000
CVTVWAIT EQU   CVTS01+276                                               01029000
CVTGSPL  EQU   CVTS01+272                                               01030000
CVTLSMQ  EQU   CVTS01+268                                               01031000
CVTGSMQ  EQU   CVTS01+264                                               01032000
CVTEXPRO EQU   CVTS01+260                                               01033000
CVTOPCTP EQU   CVTS01+256                                               01034000
CVTSIC   EQU   CVTS01+252                                               01035000
CVTTPIOS EQU   CVTS01+248                                               01036000
CVTRTMS  EQU   CVTS01+244                                               01037000
CVTSDBF  EQU   CVTS01+240                                               01038000
CVTSCBP  EQU   CVTS01+236                                               01039000
CVTSDMP  EQU   CVTS01+232                                               01040000
CVTSV60  EQU   CVTS01+228                                               01041000
CVTRTMCT EQU   CVTS01+224                                               01042000
CVTASCBL EQU   CVTS01+220                                               01043000
CVTASCBH EQU   CVTS01+216                                               01044000
CVTGDA   EQU   CVTS01+212                                               01045000
CVTASVT  EQU   CVTS01+208                                               01046000
CVTVVMDI EQU   CVTS01+204                                               01047000
CVTAQTOP EQU   CVTS01+200                                               01048000
CVTIOSCS EQU   CVTS01+196                                               01049000
CVTSDRM  EQU   CVTS01+192                                               01050000
CVTOPTE  EQU   CVTS01+188                                               01051000
CVTSTXU  EQU   CVTS01+184                                               01052000
CVTQUIS  EQU   CVTS01+180                                               01053000
CVTPARS  EQU   CVTS01+176                                               01054000
CVTS1EE  EQU   CVTS01+172                                               01055000
CVTFRAS  EQU   CVTS01+168                                               01056000
CVTQSAS  EQU   CVTS01+164                                               01057000
CVTCRAS  EQU   CVTS01+160                                               01058000
CVTCRMN  EQU   CVTS01+156                                               01059000
CVTDELCP EQU   CVTS01+152                                               01060000
CVTFRECL EQU   CVTS01+148                                               01061000
CVTGETCL EQU   CVTS01+144                                               01062000
CVTBLDCP EQU   CVTS01+140                                               01063000
CVTAUTHL EQU   CVTS01+136                                               01064000
CVTSCAN  EQU   CVTS01+132                                               01065000
CVTRV144 EQU   CVTS01+130                                               01066000
CVTMAXMP EQU   CVTS01+128                                               01067000
CVTSTCK  EQU   CVTS01+124                                               01068000
CVTRV139 EQU   CVTS01+123                                               01069000
CVTDSSAC EQU   CVTS01+122                                               01070000
CVTRV513 EQU   CVTS01+121                                               01071000
CVTIOSPL EQU   CVTS01+120                                               01072000
CVTPTGT  EQU   CVTS01+116                                               01073000
CVTCSPIE EQU   CVTS01+112                                               01074000
CVTSMFEX EQU   CVTS01+108                                               01075000
CVTOLT0A EQU   CVTS01+104                                               01076000
CVTSRBRT EQU   CVTS01+100                                               01077000
CVTPUTL  EQU   CVTS01+96                                                01078000
CVTRV519 EQU   CVTS01+92                                                01079000
CVTRV327 EQU   CVTS01+88                                                01080000
CVTRV326 EQU   CVTS01+84                                                01081000
CVTRV325 EQU   CVTS01+80                                                01082000
CVTRV324 EQU   CVTS01+76                                                01083000
CVT0VL01 EQU   CVTS01+72                                                01084000
CVTSHRVM EQU   CVTS01+68                                                01085000
CVTRV332 EQU   CVTS01+64                                                01086000
CVTTAS   EQU   CVTS01+60                                                01087000
CVTRSCN  EQU   CVTS01+56                                                01088000
CVTTRAC2 EQU   CVTS01+54                                                01089000
CVTTRACE EQU   CVTS01+52                                                01090000
CVTAPG   EQU   CVTS01+51                                                01091000
CVTSDTRC EQU   CVTCTLFG                                                 01092000
CVTGTRCE EQU   CVTCTLFG                                                 01093000
CVTNOMP  EQU   CVTCTLFG                                                 01094000
CVTRSV79 EQU   CVTCTLFG                                                 01095000
CVTDSTAT EQU   CVTCTLFG                                                 01096000
CVTRSV78 EQU   CVTCTLFG                                                 01097000
CVTRV333 EQU   CVTCTLFG                                                 01098000
CVTRV323 EQU   CVTCTLFG                                                 01099000
CVTSPVLK EQU   CVTS01+49                                                01100000
CVTRSV77 EQU   CVTS01+48                                                01101000
CVTRV331 EQU   CVTS01+44                                                01102000
CVTRV330 EQU   CVTS01+40                                                01103000
CVTRV329 EQU   CVTS01+36                                                01104000
CVTRV328 EQU   CVTS01+32                                                01105000
CVTRV322 EQU   CVTS01+28                                                01106000
CVTSLID  EQU   CVTSLIDA+1                                               01107000
CVTSYLK  EQU   CVTSLIDA                                                 01108000
CVTRV321 EQU   CVTS01+20                                                01109000
CVTRV320 EQU   CVTS01+16                                                01110000
CVTLPDIR EQU   CVTLPDIA+1                                               01111000
CVTRSV69 EQU   CVTDIRST                                                 01112000
CVTRSV68 EQU   CVTDIRST                                                 01113000
CVTRSV67 EQU   CVTDIRST                                                 01114000
CVTRSV66 EQU   CVTDIRST                                                 01115000
CVTRSV65 EQU   CVTDIRST                                                 01116000
CVTRSV64 EQU   CVTDIRST                                                 01117000
CVTRSV63 EQU   CVTDIRST                                                 01118000
CVTDICOM EQU   CVTDIRST                                                 01119000
CVTPVTP  EQU   CVTS01+8                                                 01120000
CVTLPDSR EQU   CVTS01+4                                                 01121000
CVTGETL  EQU   CVTS01                                                   01122000
QMRBN    EQU   SWAQMPA+12                                               01123000
@NM00150 EQU   SWAQMPA+1                                                01124000
QMPACL   EQU   QMPCL+1                                                  01125000
QMPNC    EQU   QMPCMNC                                                  01126000
QMPCM    EQU   QMPCMNC                                                  01127000
QMEIA    EQU   QMPA+28                                                  01128000
QMWTQ    EQU   QMPA+24                                                  01129000
QMRSD1   EQU   QMPA+22                                                  01130000
QMTID    EQU   QMPA+20                                                  01131000
QMLNK    EQU   QMPA+18                                                  01132000
QMPRI    EQU   QMPA+17                                                  01133000
@NM00149 EQU   QMSTA                                                    01134000
QMSJNL   EQU   QMSTA                                                    01135000
@NM00148 EQU   QMSTA                                                    01136000
QMTPY    EQU   QMPA+15                                                  01137000
QMNOT    EQU   QMPA+14                                                  01138000
QMTLN    EQU   QMPA+12                                                  01139000
QMTST    EQU   QMPA+11                                                  01140000
QMFLT    EQU   QMPA+9                                                   01141000
QMPOP    EQU   QMPA+8                                                   01142000
QMPEB    EQU   QMNAM+4                                                  01143000
QMCAN    EQU   QMNAM                                                    01144000
CHARSV16 EQU   CHSHORT+100                                              01145000
CHARSV15 EQU   CHSHORT+96                                               01146000
CHJSCBVS EQU   CHSHORT+92                                               01147000
CHUSCVS  EQU   CHSHORT+88                                               01148000
@NM00146 EQU   CHSHORT+84                                               01149000
@NM00145 EQU   CHSHORT+80                                               01150000
CHSQA    EQU   CHSHORT+44                                               01151000
CHQPA    EQU   CHSHORT+8                                                01152000
CHJCL    EQU   CHSHORT+4                                                01153000
CHSPC    EQU   CHSHORT                                                  01154000
CHSPB    EQU   CHSTEP+4                                                 01155000
CHTCB    EQU   CHSTEP+1                                                 01156000
CHARSV23 EQU   CHSWT                                                    01157000
CHARSV22 EQU   CHSWT                                                    01158000
CHARSV21 EQU   CHSWT                                                    01159000
CHAC     EQU   CHSWT                                                    01160000
CHPSF    EQU   CHSWT                                                    01161000
CHPSD    EQU   CHSWT                                                    01162000
CHJCT    EQU   CHSWT                                                    01163000
CHARSV20 EQU   CHSWT                                                    01164000
CHCECB   EQU   CHASM+20                                                 01165000
CHECB    EQU   CHASM+16                                                 01166000
CHRGNAD  EQU   CHASM+12                                                 01167000
CHARSV18 EQU   CHRGNSZ+1                                                01168000
CHRPRTY  EQU   CHRGNSZ                                                  01169000
@NM00144 EQU   CHCIBP                                                   01170000
CHEND    EQU   CHCIBP                                                   01171000
CHECBP   EQU   CHASM                                                    01172000
CHDER    EQU   CHPROCSN+4                                               01173000
CHARSV10 EQU   CHACT1                                                   01174000
CHARSV09 EQU   CHACT1                                                   01175000
CHARSV08 EQU   CHACT1                                                   01176000
CHARSV07 EQU   CHACT1                                                   01177000
CHARSV06 EQU   CHACT1                                                   01178000
CHARSV05 EQU   CHACT1                                                   01179000
CHARSV04 EQU   CHACT1                                                   01180000
CHRDWTR  EQU   CHACT1                                                   01181000
CHARSV30 EQU   CHPROCSN+2                                               01182000
CHQID    EQU   CHPROCSN                                                 01183000
CHASID   EQU   CHTJID                                                   01184000
CHUCMP   EQU   CHAIN+29                                                 01185000
CHCIBCTR EQU   CHAIN+27                                                 01186000
CHUNIT   EQU   CHAIN+24                                                 01187000
CHCLS    EQU   CHAIN+16                                                 01188000
CHPARM   EQU   CHKEY                                                    01189000
CHIFY    EQU   CHACT                                                    01190000
CHAIFX   EQU   CHACT                                                    01191000
CHCLD    EQU   CHACT                                                    01192000
CHCL     EQU   CHACT                                                    01193000
CHDSI    EQU   CHACT                                                    01194000
CHDISC   EQU   CHACT                                                    01195000
CHTERM   EQU   CHACT                                                    01196000
CHSWAP   EQU   CHACT                                                    01197000
CHABTERM EQU   CHSTS                                                    01198000
CHFC     EQU   CHSTS                                                    01199000
CHDL     EQU   CHSTS                                                    01200000
CHAD     EQU   CHSTS                                                    01201000
CHQSPC   EQU   CHSTS                                                    01202000
CHSOUT   EQU   CHSTS                                                    01203000
CHSYS    EQU   CHSTS                                                    01204000
CHAP     EQU   CHSTS                                                    01205000
CHSZE    EQU   CHFLG+1                                                  01206000
CHVCD    EQU   CHFLG                                                    01207000
CHPTR    EQU   CHAIN                                                    01208000
@NM00141 EQU   STEPL+12                                                 01209000
STEFCHLB EQU   STEFLAGS                                                 01210000
STESTPLB EQU   STEFLAGS                                                 01211000
STEJOBLB EQU   STEFLAGS                                                 01212000
STETJMR  EQU   STEFLAGS                                                 01213000
STERETRY EQU   STEFLAGS                                                 01214000
STEPARAM EQU   STEPL+4                                                  01215000
@NM00139 EQU   RTNEXAD                                                  01216000
@NM00138 EQU   RTNEXNM                                                  01217000
RTNEXID  EQU   RTNEXT+1                                                 01218000
RTNEXLK  EQU   RTNEXT                                                   01219000
IELCOM   EQU   IELEXHDR+4                                               01220000
IELRCXT  EQU   IELEXHDR+3                                               01221000
IELRTNCD EQU   IELEXHDR+2                                               01222000
IELXTLEN EQU   IELEXHDR                                                 01223000
@NM00137 EQU   IELOPTS+7                                                01224000
IELNSYS  EQU   IELOPSW3                                                 01225000
@NM00136 EQU   IELOPSW3                                                 01226000
@NM00135 EQU   IELOPSW3                                                 01227000
IELOENQU EQU   IELOPSW2                                                 01228000
IELONORC EQU   IELOPSW2                                                 01229000
@NM00134 EQU   IELOPSW2                                                 01230000
@NM00133 EQU   IELOPSW2                                                 01231000
@NM00132 EQU   IELOPSW2                                                 01232000
@NM00131 EQU   IELOPSW2                                                 01233000
IELTIMEF EQU   IELOPSW2                                                 01234000
@NM00130 EQU   IELOPSW1                                                 01235000
IELICMDF EQU   IELOPSW1                                                 01236000
IELONEJF EQU   IELOPSW1                                                 01237000
IELCANF  EQU   IELOPSW1                                                 01238000
@NM00129 EQU   IELOPSW1                                                 01239000
@NM00128 EQU   IELOPSW1                                                 01240000
IELDWFF  EQU   IELOPSW1                                                 01241000
IELDPSWA EQU   IELOPSW1                                                 01242000
IELOPLEN EQU   IELOPTS                                                  01243000
@NM00127 EQU   IELLAST                                                  01244000
IELEND   EQU   IELLAST                                                  01245000
IELSTEPL EQU   IELLIST+16                                               01246000
LCTIWORK EQU   LCT+440                                                  01247000
@NM00126 EQU   LCT+436                                                  01248000
LCTLBWAP EQU   LCT+428                                                  01249000
@NM00125 EQU   LCT+424                                                  01250000
LCTSYS   EQU   LCTINTS2                                                 01251000
LCTRFB1  EQU   LCT+419                                                  01252000
@NM00123 EQU   LCTRFB                                                   01253000
LCTRFBRP EQU   LCTRFB                                                   01254000
LCTRFBEF EQU   LCTRFB                                                   01255000
LCTRFBMS EQU   LCTRFB                                                   01256000
LCTRFBDC EQU   LCTRFB                                                   01257000
LCTRFBRV EQU   LCTRFB                                                   01258000
LCTRFBCR EQU   LCTRFB                                                   01259000
LCTRFBSM EQU   LCTRFB                                                   01260000
LCTMFTIO EQU   LCTSTATB                                                 01261000
LCTNPKEY EQU   LCTSTATB                                                 01262000
LCTSBPOL EQU   LCTSTATB                                                 01263000
LCTNREAD EQU   LCTSTATB                                                 01264000
LCTWRITE EQU   LCTSTATB                                                 01265000
LCTNOATC EQU   LCTSTATB                                                 01266000
LCTNOREG EQU   LCTSTATB                                                 01267000
LCTECBPB EQU   LCTSTATB                                                 01268000
LCTCPART EQU   LCTSTATA                                                 01269000
LCTNOGCB EQU   LCTSTATA                                                 01270000
LCTNOSDP EQU   LCTSTATA                                                 01271000
LCTJCPIB EQU   LCTSTATA                                                 01272000
LCTNECBL EQU   LCTSTATA                                                 01273000
LCTBTJOB EQU   LCTSTATA                                                 01274000
LCTSNOWK EQU   LCTSTATA                                                 01275000
LCTSUSPD EQU   LCTSTATA                                                 01276000
LCTTIOTI EQU   LCT+412                                                  01277000
@NM00122 EQU   LCTJCTDA+3                                               01278000
LCTJCTVA EQU   LCTJCTDA                                                 01279000
@NM00121 EQU   LCT+364                                                  01280000
@NM00120 EQU   LCTJSCB+1                                                01281000
@NM00119 EQU   LCTOPSW3                                                 01282000
@NM00118 EQU   LCTOPSW3                                                 01283000
LCTALERR EQU   LCTOPSW3                                                 01284000
LCTJNLF  EQU   LCTOPSW3                                                 01285000
@NM00117 EQU   LCTOPSW3                                                 01286000
LCTNSYS  EQU   LCTOPSW3                                                 01287000
LCTRDER  EQU   LCTOPSW3                                                 01288000
@NM00116 EQU   LCTOPSW3                                                 01289000
@NM00115 EQU   @NM00110+1                                               01290000
LCTENQU  EQU   LCTOPSW2                                                 01291000
LCTNORC  EQU   LCTOPSW2                                                 01292000
@NM00114 EQU   LCTOPSW2                                                 01293000
@NM00113 EQU   LCTOPSW2                                                 01294000
@NM00112 EQU   LCTOPSW2                                                 01295000
@NM00111 EQU   LCTOPSW2                                                 01296000
LCTCRF   EQU   LCTOPSW2                                                 01297000
LCTTIMEF EQU   LCTOPSW2                                                 01298000
@NM00109 EQU   LCTEXIT+1                                                01299000
@NM00108 EQU   LCTOPSW1                                                 01300000
@NM00107 EQU   LCTOPSW1                                                 01301000
LCTONEJF EQU   LCTOPSW1                                                 01302000
LCTCANF  EQU   LCTOPSW1                                                 01303000
@NM00106 EQU   LCTOPSW1                                                 01304000
@NM00105 EQU   LCTOPSW1                                                 01305000
LCTDWFF  EQU   LCTOPSW1                                                 01306000
LCTDPSWA EQU   LCTOPSW1                                                 01307000
LCTTSRB3 EQU   LCTTSRB4+1                                               01308000
@NM00104 EQU   LCTTSRB4                                                 01309000
@NM00103 EQU   LCT+340                                                  01310000
@NM00102 EQU   LCTSPIL+3                                                01311000
@NM00101 EQU   LCTALCFG                                                 01312000
@NM00100 EQU   LCTALCFG                                                 01313000
@NM00099 EQU   LCTALCFG                                                 01314000
@NM00098 EQU   LCTALCFG                                                 01315000
@NM00097 EQU   LCTALCFG                                                 01316000
@NM00096 EQU   LCTALCFG                                                 01317000
LCTMSGWT EQU   LCTALCFG                                                 01318000
LCTODSFL EQU   LCTALCFG                                                 01319000
LCTDSBCT EQU   LCTSPIL                                                  01320000
LCTPIB   EQU   LCTIDENT                                                 01321000
@NM00095 EQU   ECBLIST+1                                                01322000
@NM00094 EQU   ECBLIST                                                  01323000
LCTJMRAD EQU   LCT+324                                                  01324000
@NM00093 EQU   LCT+284                                                  01325000
@NM00092 EQU   LCTATLST+1                                               01326000
@NM00091 EQU   LCTATLST                                                 01327000
@NM00090 EQU   LCTJOBLB+1                                               01328000
@NM00089 EQU   LCTJOBLB                                                 01329000
LCTTSTU3 EQU   LCTTSTU4+1                                               01330000
@NM00088 EQU   LCTTSTU4                                                 01331000
LCTTSTR3 EQU   LCTSMF+1                                                 01332000
LCTTTIFJ EQU   LCTTMBYT                                                 01333000
LCTTSTL3 EQU   LCTTSTL4+1                                               01334000
@NM00087 EQU   LCTTSTL4                                                 01335000
LCTTJTU3 EQU   LCTTJTU4+1                                               01336000
@NM00086 EQU   LCTTJTU4                                                 01337000
@NM00085 EQU   @NM00084+1                                               01338000
LCTNDSI  EQU   LCTINTSW                                                 01339000
LCTABEND EQU   LCTINTSW                                                 01340000
LCTSTOP  EQU   LCTINTSW                                                 01341000
LCTSTART EQU   LCTINTSW                                                 01342000
LCTMINRG EQU   LCTINTSW                                                 01343000
LCTPPAA  EQU   LCTINTSW                                                 01344000
LCTPRIV  EQU   LCTINTSW                                                 01345000
LCTINPPT EQU   LCTINTSW                                                 01346000
@NM00083 EQU   LCTSREG+1                                                01347000
@NM00082 EQU   LCTSREG                                                  01348000
LCTCOMD2 EQU   LCTCOMCD+2                                               01349000
LCTCOMD1 EQU   LCTCOMCD                                                 01350000
LCTBATMN EQU   LCT+64                                                   01351000
@NM00081 EQU   LCTSMBAD+1                                               01352000
@NM00080 EQU   LCTSMBAD                                                 01353000
LCTACTON EQU   LCT+59                                                   01354000
LCTSNUMB EQU   LCT+58                                                   01355000
@NM00079 EQU   LCTJFCBH                                                 01356000
@NM00078 EQU   LCTJFCBH                                                 01357000
@NM00077 EQU   LCTJFCBH                                                 01358000
@NM00076 EQU   LCTJFCBH                                                 01359000
@NM00075 EQU   LCTJFCBH                                                 01360000
LCTS2FES EQU   LCTJFCBH                                                 01361000
LCTS2COP EQU   LCTJFCBH                                                 01362000
LCTS2PEM EQU   LCTJFCBH                                                 01363000
LCTSTIND EQU   LCTNSPAD                                                 01364000
@NM00074 EQU   LCTCMCBA+1                                               01365000
@NM00073 EQU   LCTCMCBA                                                 01366000
LCTPARM4 EQU   LCT+48                                                   01367000
LCTPARM3 EQU   LCT+44                                                   01368000
LCTPARM2 EQU   LCT+40                                                   01369000
LCTPARM1 EQU   LCT+36                                                   01370000
LCTACOMP EQU   LCTERR                                                   01371000
LCTSFAIL EQU   LCTERR                                                   01372000
LCTPALCD EQU   LCTERR                                                   01373000
LCTSALCD EQU   LCTERR                                                   01374000
LCTJFAIL EQU   LCTERR                                                   01375000
@NM00072 EQU   LCTPSPAR+1                                               01376000
@NM00071 EQU   LCTPSPAR                                                 01377000
@NM00070 EQU   LCTWORKA+3                                               01378000
LCTSCTVA EQU   LCTWORKA                                                 01379000
@NM00069 EQU   LCTSCTAD+1                                               01380000
@NM00068 EQU   LCTSCTAD                                                 01381000
@NM00067 EQU   LCTJCTAD+1                                               01382000
@NM00066 EQU   LCTJCTAD                                                 01383000
@NM00065 EQU   LCTQENTY+1                                               01384000
LCTERRM  EQU   @NM00057                                                 01385000
@NM00064 EQU   @NM00057                                                 01386000
@NM00063 EQU   @NM00057                                                 01387000
@NM00062 EQU   @NM00057                                                 01388000
@NM00061 EQU   @NM00057                                                 01389000
@NM00060 EQU   @NM00057                                                 01390000
@NM00059 EQU   @NM00057                                                 01391000
@NM00058 EQU   @NM00057                                                 01392000
@NM00056 EQU   LCTTCBAD+1                                               01393000
@NM00055 EQU   LCTTCBAD                                                 01394000
@NM00054 EQU   LCTSRTAD+1                                               01395000
@NM00053 EQU   LCTSRTAD                                                 01396000
@NM00052 EQU   LCTQDRTY+1                                               01397000
@NM00051 EQU   LCTQDRTY                                                 01398000
JSCBPMG  EQU   JSCBWTP+2                                                01399000
JSCBWTSP EQU   JSCBWTP+1                                                01400000
JSCRSV23 EQU   JSCBWTFG                                                 01401000
JSCRSV22 EQU   JSCBWTFG                                                 01402000
JSCRSV21 EQU   JSCBWTFG                                                 01403000
JSCRSV20 EQU   JSCBWTFG                                                 01404000
JSCRSV19 EQU   JSCBWTFG                                                 01405000
JSCRSV18 EQU   JSCBWTFG                                                 01406000
JSCBRET  EQU   JSCBWTFG                                                 01407000
JSCBIOFG EQU   JSCBWTFG                                                 01408000
@NM00048 EQU   JSCBSEC1+60                                              01409000
JSCBQMPI EQU   JSCBSEC1+56                                              01410000
JSCBPMSG EQU   JSCBSWT1                                                 01411000
JSCRSV16 EQU   JSCBSWT1                                                 01412000
JSCRSV15 EQU   JSCBSWT1                                                 01413000
JSCRSV14 EQU   JSCBSWT1                                                 01414000
JSCRSV13 EQU   JSCBSWT1                                                 01415000
JSCRSV12 EQU   JSCBSWT1                                                 01416000
JSCRSV11 EQU   JSCBSWT1                                                 01417000
JSCBPASS EQU   JSCBSWT1                                                 01418000
JSCBTTTR EQU   JSCBSEC1+52                                              01419000
JSCRSV10 EQU   JSCBSEC1+49                                              01420000
JSCBAUTH EQU   JSCBOPTS                                                 01421000
JSCSIOTS EQU   JSCBOPTS                                                 01422000
JSCRSV08 EQU   JSCBOPTS                                                 01423000
JSCRSV07 EQU   JSCBOPTS                                                 01424000
JSCRSV06 EQU   JSCBOPTS                                                 01425000
JSCBLONG EQU   JSCBOPTS                                                 01426000
JSCRSV05 EQU   JSCBOPTS                                                 01427000
JSCRSV04 EQU   JSCBOPTS                                                 01428000
JSCBSECB EQU   JSCBSEC1+44                                              01429000
JSCRSV03 EQU   JSCBSEC1+41                                              01430000
JSCBSTEP EQU   JSCBSEC1+40                                              01431000
JSCBDCBA EQU   JSCBDCB+1                                                01432000
JSCRSV02 EQU   JSCBDCB                                                  01433000
JSCBID   EQU   JSCBSEC1+32                                              01434000
JSCBDBTB EQU   JSCBSEC1+28                                              01435000
JSCBIJSC EQU   JSCBSEC1+24                                              01436000
JSCBTCBP EQU   JSCBSEC1+20                                              01437000
JSCBPCC  EQU   JSCBSEC1+16                                              01438000
JSCBTCP  EQU   JSCBSEC1+12                                              01439000
JSCBSHR  EQU   JSCBSEC1+8                                               01440000
JSCHPCEA EQU   JSCHPCE+1                                                01441000
JSCRSV32 EQU   JSCHPCE                                                  01442000
JSCRSV01 EQU   JSCBSEC1                                                 01443000
@NM00047 EQU   IEZJSCB                                                  01444000
@NM00046 EQU   TCBXTNT2+32                                              01445000
TCBRV181 EQU   TCBRV173                                                 01446000
TCBRV180 EQU   TCBRV173                                                 01447000
TCBRV179 EQU   TCBRV173                                                 01448000
TCBRV178 EQU   TCBRV173                                                 01449000
TCBRV177 EQU   TCBRV173                                                 01450000
TCBRV176 EQU   TCBRV173                                                 01451000
TCBRV175 EQU   TCBRV173                                                 01452000
TCBRV174 EQU   TCBRV173                                                 01453000
TCBRV172 EQU   TCBRV164                                                 01454000
TCBRV171 EQU   TCBRV164                                                 01455000
TCBRV170 EQU   TCBRV164                                                 01456000
TCBRV169 EQU   TCBRV164                                                 01457000
TCBRV168 EQU   TCBRV164                                                 01458000
TCBRV167 EQU   TCBRV164                                                 01459000
TCBRV166 EQU   TCBRV164                                                 01460000
TCBRV165 EQU   TCBRV164                                                 01461000
TCBRV163 EQU   TCBRV155                                                 01462000
TCBRV162 EQU   TCBRV155                                                 01463000
TCBRV161 EQU   TCBRV155                                                 01464000
TCBRV160 EQU   TCBRV155                                                 01465000
TCBRV159 EQU   TCBRV155                                                 01466000
TCBRV158 EQU   TCBRV155                                                 01467000
TCBRV157 EQU   TCBRV155                                                 01468000
TCBRV156 EQU   TCBRV155                                                 01469000
TCBRV154 EQU   TCBRV146                                                 01470000
TCBRV153 EQU   TCBRV146                                                 01471000
TCBRV152 EQU   TCBRV146                                                 01472000
TCBRV151 EQU   TCBRV146                                                 01473000
TCBRV150 EQU   TCBRV146                                                 01474000
TCBRV149 EQU   TCBRV146                                                 01475000
TCBRV148 EQU   TCBRV146                                                 01476000
TCBRV147 EQU   TCBRV146                                                 01477000
TCBRV145 EQU   TCBXTNT2+26                                              01478000
TCBRV144 EQU   TCBXTNT2+24                                              01479000
TCBRV143 EQU   TCBXTNT2+20                                              01480000
TCBRV142 EQU   TCBXTNT2+16                                              01481000
TCBRSV49 EQU   TCBXTNT2+12                                              01482000
TCBEVENT EQU   TCBXTNT2+8                                               01483000
TCBRCMP  EQU   TCBXTNT2+5                                               01484000
TCBRSVAB EQU   TCBXTNT2+4                                               01485000
TCBGTFA  EQU   TCBGTF+1                                                 01486000
TCBRSV47 EQU   TCBTFLG                                                  01487000
TCBRSV46 EQU   TCBTFLG                                                  01488000
TCBRSV45 EQU   TCBTFLG                                                  01489000
TCBRSV44 EQU   TCBTFLG                                                  01490000
TCBRSV43 EQU   TCBTFLG                                                  01491000
TCBDSPIT EQU   TCBTFLG                                                  01492000
TCBERRTN EQU   TCBTFLG                                                  01493000
TCBASYNC EQU   TCBTFLG                                                  01494000
@NM00045 EQU   TCB+296                                                  01495000
TCBSCBQ  EQU   TCB+292                                                  01496000
TCBSWASA EQU   TCB+288                                                  01497000
TCBDBTB  EQU   TCB+284                                                  01498000
TCBRPT   EQU   TCB+280                                                  01499000
TCBRV141 EQU   TCBRV133                                                 01500000
TCBRV140 EQU   TCBRV133                                                 01501000
TCBRV139 EQU   TCBRV133                                                 01502000
TCBRV138 EQU   TCBRV133                                                 01503000
TCBRV137 EQU   TCBRV133                                                 01504000
TCBRV136 EQU   TCBRV133                                                 01505000
TCBRV135 EQU   TCBRV133                                                 01506000
TCBRV134 EQU   TCBRV133                                                 01507000
TCBRV132 EQU   TCBRV124                                                 01508000
TCBRV131 EQU   TCBRV124                                                 01509000
TCBRV130 EQU   TCBRV124                                                 01510000
TCBRV129 EQU   TCBRV124                                                 01511000
TCBRV128 EQU   TCBRV124                                                 01512000
TCBRV127 EQU   TCBRV124                                                 01513000
TCBRV126 EQU   TCBRV124                                                 01514000
TCBRV125 EQU   TCBRV124                                                 01515000
TCBRV123 EQU   TCBFBYT2                                                 01516000
TCBRV122 EQU   TCBFBYT2                                                 01517000
TCBECBNV EQU   TCBFBYT2                                                 01518000
TCBSSSYN EQU   TCBFBYT2                                                 01519000
TCBFPRAP EQU   TCBFBYT2                                                 01520000
TCBFDW   EQU   TCBFBYT2                                                 01521000
TCBFMW   EQU   TCBFBYT2                                                 01522000
TCBCNCB  EQU   TCBFBYT2                                                 01523000
TCBLLH   EQU   TCBFBYT1                                                 01524000
TCBRV113 EQU   TCBFBYT1                                                 01525000
TCBEOT   EQU   TCBFBYT1                                                 01526000
TCBRTM2  EQU   TCBFBYT1                                                 01527000
TCBPGNLY EQU   TCBFBYT1                                                 01528000
TCBNDIOS EQU   TCBFBYT1                                                 01529000
TCBACTIV EQU   TCBFBYT1                                                 01530000
TCBEOTFM EQU   TCBFBYT1                                                 01531000
TCBAFFN  EQU   TCB+274                                                  01532000
TCBCCPVI EQU   TCB+272                                                  01533000
TCBUKYSP EQU   TCB+268                                                  01534000
TCBMODE  EQU   TCBESTAE+3                                               01535000
TCBERTYP EQU   TCBESTAE+2                                               01536000
TCBRV314 EQU   TCBESTRM                                                 01537000
TCBRV313 EQU   TCBESTRM                                                 01538000
TCBRV312 EQU   TCBESTRM                                                 01539000
TCBRV311 EQU   TCBESTRM                                                 01540000
TCBRV310 EQU   TCBESTRM                                                 01541000
TCBRV309 EQU   TCBESTRM                                                 01542000
TCBRV308 EQU   TCBESTRM                                                 01543000
TCBETERM EQU   TCBESTRM                                                 01544000
TCBSCBKY EQU   TCBESTAE                                                 01545000
TCBRTM12 EQU   TCB+260                                                  01546000
TCBTCBID EQU   TCB+256                                                  01547000
TCBRSV96 EQU   TCB+252                                                  01548000
TCBSWA   EQU   TCB+248                                                  01549000
TCBFOEA  EQU   TCBFOE+1                                                 01550000
TCBRSV42 EQU   TCBFOE                                                   01551000
TCBRV306 EQU   TCB+240                                                  01552000
TCBRSV41 EQU   TCB+239                                                  01553000
TCBTID   EQU   TCB+238                                                  01554000
TCBRSVAA EQU   TCB+237                                                  01555000
TCBABCUR EQU   TCB+236                                                  01556000
TCBTMSAV EQU   TCB+232                                                  01557000
TCBIOTIM EQU   TCB+228                                                  01558000
TCBRTWA  EQU   TCB+224                                                  01559000
TCBBACK  EQU   TCB+220                                                  01560000
TCBTIRB  EQU   TCB+216                                                  01561000
TCBAECB  EQU   TCB+212                                                  01562000
TCBEXT2A EQU   TCBEXT2+1                                                01563000
TCBRSV39 EQU   TCBEXT2                                                  01564000
TCBSTMCT EQU   TCB+207                                                  01565000
TCBSYSCT EQU   TCB+206                                                  01566000
TCBRSV37 EQU   TCB+205                                                  01567000
TCBEXSVC EQU   TCBDAR                                                   01568000
TCBRSV36 EQU   TCBDAR                                                   01569000
TCBDARWT EQU   TCBDAR                                                   01570000
TCBDARO  EQU   TCBDAR                                                   01571000
TCBDARMC EQU   TCBDARC                                                  01572000
TCBDARD  EQU   TCBDAR                                                   01573000
TCBDARS  EQU   TCBDAR                                                   01574000
TCBDARP  EQU   TCBDAR                                                   01575000
TCBGTOFM EQU   TCBFLGS7                                                 01576000
TCBADMP  EQU   TCBFLGS7                                                 01577000
TCBRSTSK EQU   TCBFLGS7                                                 01578000
TCBRSV35 EQU   TCBFLGS7                                                 01579000
TCBSTACK EQU   TCBFLGS7                                                 01580000
TCBRSV34 EQU   TCBFLGS7                                                 01581000
TCBRSV33 EQU   TCBFLGS7                                                 01582000
TCBGPECB EQU   TCBFLGS7                                                 01583000
TCBNTJS  EQU   TCBFLGS6                                                 01584000
TCBAPG   EQU   TCBFLGS6                                                 01585000
TCBMIGR  EQU   TCBFLGS6                                                 01586000
TCBRV303 EQU   TCBFLGS6                                                 01587000
TCBSPVLK EQU   TCBFLGS6                                                 01588000
TCBCPU   EQU   TCBFLGS6                                                 01589000
TCBPIE17 EQU   TCBFLGS6                                                 01590000
TCBRV    EQU   TCBFLGS6                                                 01591000
TCBRSV79 EQU   TCBNDSP5                                                 01592000
TCBRSV78 EQU   TCBNDSP5                                                 01593000
TCBRSV77 EQU   TCBNDSP5                                                 01594000
TCBRSV76 EQU   TCBNDSP5                                                 01595000
TCBRSV75 EQU   TCBNDSP5                                                 01596000
TCBRSV74 EQU   TCBNDSP5                                                 01597000
TCBRSV95 EQU   TCBNDSP5                                                 01598000
TCBRSV94 EQU   TCBNDSP5                                                 01599000
TCBRSV93 EQU   TCBNDSP4                                                 01600000
TCBRSV92 EQU   TCBNDSP4                                                 01601000
TCBRSV91 EQU   TCBNDSP4                                                 01602000
TCBRSV90 EQU   TCBNDSP4                                                 01603000
TCBRSV89 EQU   TCBNDSP4                                                 01604000
TCBRSV88 EQU   TCBNDSP4                                                 01605000
TCBRSV87 EQU   TCBNDSP4                                                 01606000
TCBRSV86 EQU   TCBNDSP4                                                 01607000
TCBEXT1A EQU   TCBEXT1+1                                                01608000
TCBRSV32 EQU   TCBEXT1                                                  01609000
TCBEXCPD EQU   TCB+192                                                  01610000
TCBIOBRC EQU   TCB+188                                                  01611000
TCBDDWTC EQU   TCB+186                                                  01612000
TCBDDEXC EQU   TCB+184                                                  01613000
TCBJSCBB EQU   TCBJSCB+1                                                01614000
@NM00044 EQU   TCBRECDE                                                 01615000
TCBREC   EQU   TCBRECDE                                                 01616000
TCBMDIDS EQU   TCB+176                                                  01617000
TCBNDINT EQU   TCBNDSP3                                                 01618000
TCBRSV27 EQU   TCBNDSP3                                                 01619000
TCBRSV26 EQU   TCBNDSP3                                                 01620000
TCBRSV25 EQU   TCBNDSP3                                                 01621000
TCBRSV24 EQU   TCBNDSP3                                                 01622000
TCBSRBND EQU   TCBNDSP3                                                 01623000
TCBRV302 EQU   TCBNDSP3                                                 01624000
TCBLJSND EQU   TCBNDSP3                                                 01625000
TCBABE   EQU   TCBNDSP2                                                 01626000
TCBDSS   EQU   TCBNDSP2                                                 01627000
TCBOWAIT EQU   TCBNDSP2                                                 01628000
TCBIWAIT EQU   TCBNDSP2                                                 01629000
TCBNDTS  EQU   TCBNDSP2                                                 01630000
TCBNDSVC EQU   TCBNDSP2                                                 01631000
TCBSTPP  EQU   TCBNDSP2                                                 01632000
TCBABD   EQU   TCBNDSP2                                                 01633000
TCBRSV22 EQU   TCBNDSP1                                                 01634000
TCBPIEND EQU   TCBNDSP1                                                 01635000
TCBTPSP  EQU   TCBNDSP1                                                 01636000
TCBDDRND EQU   TCBNDSP1                                                 01637000
TCBRSPND EQU   TCBNDSP1                                                 01638000
TCBRSTND EQU   TCBNDSP1                                                 01639000
TCBDARPN EQU   TCBNDSP1                                                 01640000
TCBDARTN EQU   TCBNDSP1                                                 01641000
TCBNDSP0 EQU   TCBNDSP                                                  01642000
TCBUSER  EQU   TCB+168                                                  01643000
TCBTCTB  EQU   TCBTCT+1                                                 01644000
TCBRSV9C EQU   TCBTCTGF                                                 01645000
TCBRSV9B EQU   TCBTCTGF                                                 01646000
TCBRSV9A EQU   TCBTCTGF                                                 01647000
TCBRSV99 EQU   TCBTCTGF                                                 01648000
TCBRSV98 EQU   TCBTCTGF                                                 01649000
TCBRSV97 EQU   TCBTCTGF                                                 01650000
TCBRSV20 EQU   TCBTCTGF                                                 01651000
TCBSMFGF EQU   TCBTCTGF                                                 01652000
TCBSTABB EQU   TCBSTAB+1                                                01653000
TCBSTCUR EQU   TCBNSTAE                                                 01654000
TCBRV301 EQU   TCBNSTAE                                                 01655000
TCBSYNCH EQU   TCBNSTAE                                                 01656000
TCBHALT  EQU   TCBNSTAE                                                 01657000
TCBPPSUP EQU   TCBNSTAE                                                 01658000
TCB33E   EQU   TCBNSTAE                                                 01659000
TCBQUIES EQU   TCBNSTAE                                                 01660000
TCBSTABE EQU   TCBNSTAE                                                 01661000
TCBAQE   EQU   TCB+156                                                  01662000
TCBPQE   EQU   TCB+152                                                  01663000
TCBTSDP  EQU   TCB+151                                                  01664000
TCBTSLP  EQU   TCB+150                                                  01665000
TCBSTPCT EQU   TCB+149                                                  01666000
TCBCPUBN EQU   TCBTSFLG                                                 01667000
TCBDYDSP EQU   TCBTSFLG                                                 01668000
TCBRSV18 EQU   TCBTSFLG                                                 01669000
TCBRSV17 EQU   TCBTSFLG                                                 01670000
TCBTIOTG EQU   TCBTSFLG                                                 01671000
TCBATT   EQU   TCBTSFLG                                                 01672000
TCBSTPPR EQU   TCBTSFLG                                                 01673000
TCBRV300 EQU   TCBTSTSK                                                 01674000
TCBECB   EQU   TCB+144                                                  01675000
TCBIQE   EQU   TCB+140                                                  01676000
TCBLTC   EQU   TCB+136                                                  01677000
TCBOTC   EQU   TCB+132                                                  01678000
TCBNTC   EQU   TCB+128                                                  01679000
TCBJSTCA EQU   TCBJSTCB+1                                               01680000
TCBRSV16 EQU   TCBJSTCB                                                 01681000
TCBTQET  EQU   TCBTME                                                   01682000
TCBTCB   EQU   TCB+116                                                  01683000
TCBFSAB  EQU   TCBFSA+1                                                 01684000
TCBQEL   EQU   TCBFSA                                                   01685000
TCBGRS15 EQU   TCBGRS+60                                                01686000
TCBGRS14 EQU   TCBGRS+56                                                01687000
TCBGRS13 EQU   TCBGRS+52                                                01688000
TCBGRS12 EQU   TCBGRS+48                                                01689000
TCBGRS11 EQU   TCBGRS+44                                                01690000
TCBGRS10 EQU   TCBGRS+40                                                01691000
TCBGRS9  EQU   TCBGRS+36                                                01692000
TCBGRS8  EQU   TCBGRS+32                                                01693000
TCBGRS7  EQU   TCBGRS+28                                                01694000
TCBGRS6  EQU   TCBGRS+24                                                01695000
TCBGRS5  EQU   TCBGRS+20                                                01696000
TCBGRS4  EQU   TCBGRS+16                                                01697000
TCBGRS3  EQU   TCBGRS+12                                                01698000
TCBGRS2  EQU   TCBGRS+8                                                 01699000
TCBGRS1  EQU   TCBGRS+4                                                 01700000
TCBGRS0  EQU   TCBGRS                                                   01701000
TCBJPQB  EQU   TCBJPQ+1                                                 01702000
TCBRSV15 EQU   TCBPURGE                                                 01703000
TCBRSV14 EQU   TCBPURGE                                                 01704000
TCBRSV13 EQU   TCBPURGE                                                 01705000
TCBRSV12 EQU   TCBPURGE                                                 01706000
TCBRSV11 EQU   TCBPURGE                                                 01707000
TCBRSV10 EQU   TCBPURGE                                                 01708000
TCBRSV09 EQU   TCBPURGE                                                 01709000
TCBJPQF  EQU   TCBPURGE                                                 01710000
TCBJLB   EQU   TCB+40                                                   01711000
TCBLLS   EQU   TCB+36                                                   01712000
TCBDSP   EQU   TCB+35                                                   01713000
TCBLMP   EQU   TCB+34                                                   01714000
TCBPNDSP EQU   TCBFLGS5                                                 01715000
TCBFCD1  EQU   TCBFLGS5                                                 01716000
TCBSTP   EQU   TCBFLGS5                                                 01717000
TCBSYS   EQU   TCBFLGS5                                                 01718000
TCBANDSP EQU   TCBFLGS5                                                 01719000
TCBPAGE  EQU   TCBFLGS5                                                 01720000
TCBUXNDF EQU   TCBABWF                                                  01721000
TCBFC    EQU   TCBFLGS5                                                 01722000
TCBONDSP EQU   TCBFLGS4                                                 01723000
TCBMPCND EQU   TCBFLGS4                                                 01724000
TCBMPCVQ EQU   TCBFLGS4                                                 01725000
TCBUXNDV EQU   TCBFLGS4                                                 01726000
TCBHNDSP EQU   TCBFLGS4                                                 01727000
TCBRQENA EQU   TCBFLGS4                                                 01728000
TCBSER   EQU   TCBFLGS4                                                 01729000
TCBNDUMP EQU   TCBFLGS4                                                 01730000
TCBDWSTA EQU   TCBFLGS3                                                 01731000
TCBRSV08 EQU   TCBFLGS3                                                 01732000
TCBRSV07 EQU   TCBFLGS3                                                 01733000
TCBRSV06 EQU   TCBFLGS3                                                 01734000
TCBABGM  EQU   TCBFLGS3                                                 01735000
TCBABTRM EQU   TCBFLGS3                                                 01736000
TCBADINP EQU   TCBFLGS3                                                 01737000
TCBFSM   EQU   TCBFLGS3                                                 01738000
TCBFTS   EQU   TCBFLGS2                                                 01739000
TCBFETXR EQU   TCBFLGS2                                                 01740000
TCBFDSOP EQU   TCBFLGS2                                                 01741000
TCBFJMC  EQU   TCBFLGS2                                                 01742000
TCBFSMC  EQU   TCBFLGS2                                                 01743000
TCBFABOP EQU   TCBFLGS2                                                 01744000
TCBFSTI  EQU   TCBFLGS2                                                 01745000
TCBFOINP EQU   TCBFLGS2                                                 01746000
TCBFX    EQU   TCBFLGS1                                                 01747000
TCBFS    EQU   TCBFLGS1                                                 01748000
TCBFT    EQU   TCBFLGS1                                                 01749000
TCBPDUMP EQU   TCBFLGS1                                                 01750000
TCBRSV04 EQU   TCBFLGS1                                                 01751000
TCBFERA  EQU   TCBFLGS1                                                 01752000
TCBFE    EQU   TCBFLGS1                                                 01753000
TCBFA    EQU   TCBFLGS1                                                 01754000
TCBZERO  EQU   TCBPKF                                                   01755000
TCBFLAG  EQU   TCBPKF                                                   01756000
TCBMSSB  EQU   TCBMSS+1                                                 01757000
TCBRSV03 EQU   TCBMSS                                                   01758000
TCBTRNB  EQU   TCBTRN+1                                                 01759000
TCBRSV02 EQU   TCBABF                                                   01760000
TCBOLTEP EQU   TCBABF                                                   01761000
TCBTCP   EQU   TCBABF                                                   01762000
TCBTCPP  EQU   TCBABF                                                   01763000
TCBRSV01 EQU   TCBABF                                                   01764000
TCBGRPH  EQU   TCBABF                                                   01765000
TCBMOD91 EQU   TCBABF                                                   01766000
TCBCMPC  EQU   TCBCMP+1                                                 01767000
TCBRV318 EQU   TCBCMSG                                                  01768000
TCBRV317 EQU   TCBCIND                                                  01769000
TCBRV316 EQU   TCBCWTO                                                  01770000
TCBCASID EQU   TCBCDBL                                                  01771000
TCBNOCC  EQU   TCBSTCC                                                  01772000
TCBDMPO  EQU   TCBCPP                                                   01773000
TCBCSTEP EQU   TCBCMPF                                                  01774000
TCBCREQ  EQU   TCBCMPF                                                  01775000
TCBDEB   EQU   TCB+8                                                    01776000
TCBPIEA  EQU   TCBPIE+1                                                 01777000
TCBPM    EQU   TCBPMASK                                                 01778000
@NM00043 EQU   TCBPMASK                                                 01779000
TCBRBP   EQU   TCB                                                      01780000
TCBFRS6  EQU   TCBFRS+24                                                01781000
TCBFRS4  EQU   TCBFRS+16                                                01782000
TCBFRS2  EQU   TCBFRS+8                                                 01783000
TCBFRS0  EQU   TCBFRS                                                   01784000
MSSPARE  EQU   BASES01+48                                               01785000
MSUCBAL  EQU   BASES01+44                                               01786000
MSUCBPR  EQU   BASES01+40                                               01787000
MSBOBECB EQU   BASES01+36                                               01788000
MSSJQ    EQU   BASES01+32                                               01789000
MSECB    EQU   BASES01+28                                               01790000
MSPBP    EQU   BASES01+24                                               01791000
MSERM    EQU   BASES01+22                                               01792000
MSPASS   EQU   BASES01+14                                               01793000
MSVRB    EQU   BASES01+6                                                01794000
MSQHR    EQU   MSFHF                                                    01795000
@NM00042 EQU   MSFHF                                                    01796000
MSPSDT   EQU   MSFHF                                                    01797000
MSREPLYB EQU   MSFHF                                                    01798000
MSFAX    EQU   MSFHF                                                    01799000
MSTTT    EQU   MSFHF                                                    01800000
MSCSD    EQU   MSFHF                                                    01801000
MSNMF    EQU   MSFHF                                                    01802000
MSJNF    EQU   MSSSA                                                    01803000
MSYOUT   EQU   MSNWP                                                    01804000
MSNRP    EQU   MSSSA                                                    01805000
MSSRDR   EQU   MSREOF                                                   01806000
MSWRLOG  EQU   MSSSA                                                    01807000
MSNUPSW  EQU   MSSSA                                                    01808000
MSWRPEN  EQU   MSSSA                                                    01809000
MSSSSIPL EQU   MSINLSW                                                  01810000
MSSUM    EQU   MSECBFL                                                  01811000
MSMCR    EQU   MSECBFL                                                  01812000
MSYSOUT  EQU   MSECBFL                                                  01813000
MSYSIN   EQU   MSECBFL                                                  01814000
MSATTN   EQU   MSECBFL                                                  01815000
MSWTL    EQU   MSECBFL                                                  01816000
MSWTO    EQU   MSECBFL                                                  01817000
MSEXT    EQU   MSECBFL                                                  01818000
MSCCS    EQU   MSPFG                                                    01819000
MSBSP    EQU   MSPFG                                                    01820000
MSSYT    EQU   MSPFG                                                    01821000
MSSYN    EQU   MSPFG                                                    01822000
MSICR    EQU   MSPFG                                                    01823000
MSCMC    EQU   MSPFG                                                    01824000
MSPNB    EQU   MSPFG                                                    01825000
MSDATE   EQU   MSPFG                                                    01826000
@NM00041 EQU   MSBTN                                                    01827000
MSTN     EQU   MSBTN                                                    01828000
@NM00040 EQU   MSBTN                                                    01829000
@NM00039 EQU   MSBTN                                                    01830000
MSSO     EQU   MSBTN                                                    01831000
MSROLFLG EQU   MSBTN                                                    01832000
MSCANFLG EQU   MSBTN                                                    01833000
MSCONFLG EQU   MSBTN                                                    01834000
MSPNIP   EQU   MSNTAL                                                   01835000
MSQNIP   EQU   MSNTAL                                                   01836000
MSCURE34 EQU   MSNTAL                                                   01837000
@NM00038 EQU   MSNTAL                                                   01838000
@NM00037 EQU   MSNTAL                                                   01839000
@NM00036 EQU   MSNTAL                                                   01840000
@NM00035 EQU   MSNTAL                                                   01841000
MSNIP    EQU   MSNTAL                                                   01842000
@NM00034 EQU   MS1BASEX+40                                              01843000
@NM00033 EQU   MS1BASEX+20                                              01844000
@NM00032 EQU   MS1BASEX                                                 01845000
@NM00031 EQU   BASE+128                                                 01846000
MSLGJSCB EQU   BASE+124                                                 01847000
@NM00030 EQU   MSSTRTSW                                                 01848000
MSSTRTP  EQU   MSSTRTSW                                                 01849000
MSSTRTW  EQU   MSSTRTSW                                                 01850000
@NM00029 EQU   MSWTRSW                                                  01851000
MSWTRP   EQU   MSWTRSW                                                  01852000
MSWTRW   EQU   MSWTRSW                                                  01853000
@NM00028 EQU   MSWLOGSW                                                 01854000
MSWLOGP  EQU   MSWLOGSW                                                 01855000
MSWLOGW  EQU   MSWLOGSW                                                 01856000
@NM00027 EQU   MSCLOSSW                                                 01857000
MSCLOSP  EQU   MSCLOSSW                                                 01858000
MSCLOSW  EQU   MSCLOSSW                                                 01859000
MSLOGLMT EQU   @NM00026+1                                               01860000
MSLOGCLS EQU   @NM00026                                                 01861000
BAASCB   EQU   BASE+100                                                 01862000
MSSMFPRM EQU   BASE+96                                                  01863000
MSCOMMND EQU   BASE+92                                                  01864000
BASP12   EQU   BASE+90                                                  01865000
BASTCNT  EQU   BASE+88                                                  01866000
BASESCT  EQU   BASE+86                                                  01867000
BAJNCNT  EQU   BASE+84                                                  01868000
BASUBECB EQU   BASE+80                                                  01869000
BALOGCOM EQU   BASE+76                                                  01870000
BADACNT  EQU   BASE+74                                                  01871000
BATACNT  EQU   BASE+72                                                  01872000
BAJBNR   EQU   BASE+64                                                  01873000
BASP11   EQU   BASE+62                                                  01874000
BALCCNT  EQU   BASE+61                                                  01875000
BADUMPID EQU   BASE+60                                                  01876000
BABCMAX  EQU   BASE+58                                                  01877000
BAMONTR2 EQU   BASE+57                                                  01878000
@NM00025 EQU   BAMONITR                                                 01879000
BAMACTVE EQU   BAMONITR                                                 01880000
@NM00024 EQU   BAMONITR                                                 01881000
@NM00023 EQU   BAMONITR                                                 01882000
@NM00022 EQU   BAMONITR                                                 01883000
@NM00021 EQU   BAMONITR                                                 01884000
BASPACE  EQU   BAMONITR                                                 01885000
BADSN    EQU   BAMONITR                                                 01886000
BADSO    EQU   BASE+52                                                  01887000
BALOGECB EQU   BASE+48                                                  01888000
@NM00020 EQU   BASPBYTE                                                 01889000
@NM00019 EQU   BASPBYTE                                                 01890000
@NM00018 EQU   BASPBYTE                                                 01891000
@NM00017 EQU   BASPBYTE                                                 01892000
@NM00016 EQU   BASPBYTE                                                 01893000
BAMASCH  EQU   BASPBYTE                                                 01894000
BATRACE  EQU   BASPBYTE                                                 01895000
BAMSSTAR EQU   BASPBYTE                                                 01896000
@NM00015 EQU   MSLOGST                                                  01897000
@NM00014 EQU   MSLOGST                                                  01898000
MSLOGSTA EQU   MSLOGST                                                  01899000
MSLOGIPL EQU   MSLOGST                                                  01900000
MSLOGDAR EQU   MSLOGST                                                  01901000
MSLOGCOM EQU   MSLOGST                                                  01902000
MSLOGTHD EQU   MSLOGST                                                  01903000
MSLOGENQ EQU   MSLOGST                                                  01904000
BAMIPAR2 EQU   BASE+44                                                  01905000
BAMINPAR EQU   BASE+42                                                  01906000
BAPKES   EQU   BASE+40                                                  01907000
BAICTR   EQU   BASE+38                                                  01908000
@NM00013 EQU   BASE+37                                                  01909000
BADSET   EQU   BARSW                                                    01910000
BANOSET  EQU   BARSW                                                    01911000
BAMIDNT  EQU   BARSW                                                    01912000
BAHR     EQU   BARSW                                                    01913000
BAVU     EQU   BARSW                                                    01914000
BAINTSET EQU   BARSW                                                    01915000
MSTODWTO EQU   BARSW                                                    01916000
BAIN     EQU   BARSW                                                    01917000
BACV     EQU   BASE+32                                                  01918000
@NM00012 EQU   BALOG                                                    01919000
@NM00011 EQU   BALOG                                                    01920000
@NM00010 EQU   BALOG                                                    01921000
@NM00009 EQU   BALOG                                                    01922000
@NM00008 EQU   BALOG                                                    01923000
@NM00007 EQU   BALOG                                                    01924000
@NM00006 EQU   BALOG                                                    01925000
BALOGINT EQU   BALOG                                                    01926000
MSLOGSVC EQU   BALGSTAT                                                 01927000
BAPRC    EQU   BASE+20                                                  01928000
BAQ      EQU   BASE+16                                                  01929000
BAIPLCC  EQU   @NM00004+2                                               01930000
@NM00005 EQU   @NM00004                                                 01931000
BAIPL    EQU   BASE+12                                                  01932000
BALAD    EQU   BASE+8                                                   01933000
BATRM    EQU   BASE+4                                                   01934000
BACHN    EQU   BASE                                                     01935000
@NM00003 EQU   NXTCUR                                                   01936000
CVTLEVL  EQU   CVTRELNO+2                                               01937000
CVTNUMB  EQU   CVTRELNO                                                 01938000
CVTMDL   EQU   CVTFIX+250                                               01939000
@NM00002 EQU   CVTFIX+248                                               01940000
@NM00001 EQU   CVTFIX                                                   01941000
CVTRV482 EQU   CVTXTNT2+128                                             01942000
CVTRV481 EQU   CVTXTNT2+124                                             01943000
CVTRV480 EQU   CVTXTNT2+120                                             01944000
CVTRV479 EQU   CVTXTNT2+118                                             01945000
CVTRV478 EQU   CVTXTNT2+117                                             01946000
CVTRV477 EQU   CVTXTNT2+116                                             01947000
CVTRV476 EQU   CVTXTNT2+115                                             01948000
CVTRV475 EQU   CVTXTNT2+114                                             01949000
CVTRV474 EQU   CVTRV466                                                 01950000
CVTRV473 EQU   CVTRV466                                                 01951000
CVTRV472 EQU   CVTRV466                                                 01952000
CVTRV471 EQU   CVTRV466                                                 01953000
CVTRV470 EQU   CVTRV466                                                 01954000
CVTRV469 EQU   CVTRV466                                                 01955000
CVTRV468 EQU   CVTRV466                                                 01956000
CVTRV467 EQU   CVTRV466                                                 01957000
CVTRV465 EQU   CVTRV457                                                 01958000
CVTRV464 EQU   CVTRV457                                                 01959000
CVTRV463 EQU   CVTRV457                                                 01960000
CVTRV462 EQU   CVTRV457                                                 01961000
CVTRV461 EQU   CVTRV457                                                 01962000
CVTRV460 EQU   CVTRV457                                                 01963000
CVTRV459 EQU   CVTRV457                                                 01964000
CVTRV458 EQU   CVTRV457                                                 01965000
CVTRV456 EQU   CVTXTNT2+108                                             01966000
CVTRV455 EQU   CVTXTNT2+104                                             01967000
CVTRV454 EQU   CVTXTNT2+100                                             01968000
CVTRV453 EQU   CVTXTNT2+96                                              01969000
CVTRV452 EQU   CVTXTNT2+94                                              01970000
CVTRV451 EQU   CVTXTNT2+92                                              01971000
CVTRV450 EQU   CVTXTNT2+90                                              01972000
CVTRV449 EQU   CVTXTNT2+88                                              01973000
CVTRV448 EQU   CVTXTNT2+87                                              01974000
CVTRV447 EQU   CVTXTNT2+86                                              01975000
CVTRV446 EQU   CVTRV438                                                 01976000
CVTRV445 EQU   CVTRV438                                                 01977000
CVTRV444 EQU   CVTRV438                                                 01978000
CVTRV443 EQU   CVTRV438                                                 01979000
CVTRV442 EQU   CVTRV438                                                 01980000
CVTRV441 EQU   CVTRV438                                                 01981000
CVTRV440 EQU   CVTRV438                                                 01982000
CVTRV439 EQU   CVTRV438                                                 01983000
CVTRV437 EQU   CVTRV429                                                 01984000
CVTRV436 EQU   CVTRV429                                                 01985000
CVTRV435 EQU   CVTRV429                                                 01986000
CVTRV434 EQU   CVTRV429                                                 01987000
CVTRV433 EQU   CVTRV429                                                 01988000
CVTRV432 EQU   CVTRV429                                                 01989000
CVTRV431 EQU   CVTRV429                                                 01990000
CVTRV430 EQU   CVTRV429                                                 01991000
CVTRV428 EQU   CVTXTNT2+80                                              01992000
CVTRV427 EQU   CVTXTNT2+76                                              01993000
CVTRV426 EQU   CVTXTNT2+72                                              01994000
CVTRV425 EQU   CVTXTNT2+68                                              01995000
CVTATACT EQU   CVTATCVT                                                 01996000
CVTRV423 EQU   CVTXTNT2+62                                              01997000
CVTRV422 EQU   CVTXTNT2+60                                              01998000
CVTRV421 EQU   CVTXTNT2+58                                              01999000
CVTRV420 EQU   CVTXTNT2+56                                              02000000
CVTRV419 EQU   CVTXTNT2+55                                              02001000
CVTRV418 EQU   CVTXTNT2+54                                              02002000
CVTRV417 EQU   CVTRV409                                                 02003000
CVTRV416 EQU   CVTRV409                                                 02004000
CVTRV415 EQU   CVTRV409                                                 02005000
CVTRV414 EQU   CVTRV409                                                 02006000
CVTRV413 EQU   CVTRV409                                                 02007000
CVTRV412 EQU   CVTRV409                                                 02008000
CVTRV411 EQU   CVTRV409                                                 02009000
CVTRV410 EQU   CVTRV409                                                 02010000
CVTRV408 EQU   CVTRV400                                                 02011000
CVTRV407 EQU   CVTRV400                                                 02012000
CVTRV406 EQU   CVTRV400                                                 02013000
CVTRV405 EQU   CVTRV400                                                 02014000
CVTRV404 EQU   CVTRV400                                                 02015000
CVTRV403 EQU   CVTRV400                                                 02016000
CVTRV402 EQU   CVTRV400                                                 02017000
CVTRV401 EQU   CVTRV400                                                 02018000
CVTICB   EQU   CVTXTNT2+48                                              02019000
CVTSKTA  EQU   CVTXTNT2+44                                              02020000
CVTRSV99 EQU   CVTXTNT2+40                                              02021000
CVTRSV98 EQU   CVTXTNT2+36                                              02022000
CVTRSV97 EQU   CVTXTNT2+34                                              02023000
CVTRSV96 EQU   CVTXTNT2+32                                              02024000
CVTOLTEP EQU   CVTXTNT2+28                                              02025000
CVTQIDA  EQU   CVTQID+1                                                 02026000
CVTRSV95 EQU   CVTQID                                                   02027000
CVTRSV94 EQU   CVTXTNT2+20                                              02028000
CVTRSV93 EQU   CVTXTNT2+16                                              02029000
CVTRSV92 EQU   CVTXTNT2+12                                              02030000
CVTDEBVR EQU   CVTXTNT2+8                                               02031000
CVTRSV91 EQU   CVTXTNT2+6                                               02032000
CVTRSV9H EQU   CVTFLGBT                                                 02033000
CVTRSV9G EQU   CVTFLGBT                                                 02034000
CVTRSV9F EQU   CVTFLGBT                                                 02035000
CVTRSV9E EQU   CVTFLGBT                                                 02036000
CVTRSV9D EQU   CVTFLGBT                                                 02037000
CVTRSV9C EQU   CVTFLGBT                                                 02038000
CVTVME   EQU   CVTFLGBT                                                 02039000
CVTNPE   EQU   CVTFLGBT                                                 02040000
CVTNUCLS EQU   CVTXTNT2+4                                               02041000
CVTDSSVA EQU   CVTDSSV+1                                                02042000
CVTRSV89 EQU   CVTDSSV                                                  02043000
CVTRSV88 EQU   CVTXTNT1+8                                               02044000
CVTRSV87 EQU   CVTXTNT1+4                                               02045000
CVTFACHN EQU   CVTXTNT1                                                 02046000
CVTRV488 EQU   CVTMAP+412                                               02047000
CVTRV487 EQU   CVTMAP+408                                               02048000
CVTRV486 EQU   CVTMAP+404                                               02049000
CVTRV485 EQU   CVTMAP+400                                               02050000
CVTACTAP EQU   CVTMAP+396                                               02051000
CVTAUTH  EQU   CVTMAP+392                                               02052000
CVTATMCA EQU   CVTATMCT+1                                               02053000
CVTATMST EQU   CVTATMCT                                                 02054000
CVTRSV61 EQU   CVTMAP+384                                               02055000
CVTVOLT1 EQU   CVTVOLM1+1                                               02056000
CVTVOLI1 EQU   CVTVOLF1                                                 02057000
CVTSTOA  EQU   CVTMAP+376                                               02058000
CVTRSV58 EQU   CVTMAP+374                                               02059000
CVTRSV57 EQU   CVTMAP+372                                               02060000
CVTDDCE  EQU   CVTMAP+368                                               02061000
CVTPNWFR EQU   CVTMAP+364                                               02062000
CVTSMF   EQU   CVTMAP+360                                               02063000
CVTSULK  EQU   CVTMAP+358                                               02064000
CVTSLKO  EQU   CVTSYSK                                                  02065000
CVTSLKP  EQU   CVTSYSK                                                  02066000
CVTSLKQ  EQU   CVTSYSK                                                  02067000
CVTSLKR  EQU   CVTSYSK                                                  02068000
CVTRSV56 EQU   CVTSYSK                                                  02069000
CVTRSV55 EQU   CVTSYSK                                                  02070000
CVTRSV54 EQU   CVTSYSK                                                  02071000
CVTRSV53 EQU   CVTSYSK                                                  02072000
CVTRSV52 EQU   CVTA1F1                                                  02073000
CVTRSV51 EQU   CVTA1F1                                                  02074000
CVTRSV50 EQU   CVTA1F1                                                  02075000
CVTRSV49 EQU   CVTA1F1                                                  02076000
CVTRSV48 EQU   CVTA1F1                                                  02077000
CVTRSV47 EQU   CVTA1F1                                                  02078000
CVTSRSW  EQU   CVTA1F1                                                  02079000
CVTPFSW  EQU   CVTA1F1                                                  02080000
CVTPCVT  EQU   CVTMAP+352                                               02081000
CVTRSV46 EQU   CVTMAP+344                                               02082000
CVTRSV45 EQU   CVTMAP+340                                               02083000
CVTRSV44 EQU   CVTMAP+338                                               02084000
CVTRSV43 EQU   CVTMAP+336                                               02085000
CVTHJESA EQU   CVTHJES+1                                                02086000
CVTRSV42 EQU   CVTHJES                                                  02087000
CVTEXT2A EQU   CVTEXT2+1                                                02088000
CVTRSV41 EQU   CVTEXT2                                                  02089000
CVTAPFA  EQU   CVTAPF+1                                                 02090000
CVTRSV40 EQU   CVTAPF                                                   02091000
CVTRV518 EQU   CVTINTLA                                                 02092000
CVTRV517 EQU   CVTERPV                                                  02093000
CVTEORM  EQU   CVTMAP+312                                               02094000
CVTMCHPR EQU   CVTMAP+308                                               02095000
CVTTZ    EQU   CVTMAP+304                                               02096000
CVTJEPS  EQU   CVTMAP+300                                               02097000
CVTJESCT EQU   CVTMAP+296                                               02098000
CVTMODE  EQU   CVTMAP+292                                               02099000
CVTPTRV  EQU   CVTMAP+288                                               02100000
CVTREAL  EQU   CVTMAP+284                                               02101000
CVTRSV39 EQU   CVTMAP+280                                               02102000
CVTRSV38 EQU   CVTMAP+276                                               02103000
CVTDMSRA EQU   CVTDMSR+1                                                02104000
CVTRSV37 EQU   CVTDMSR                                                  02105000
CVTQMSGA EQU   CVTQMSG+1                                                02106000
CVTRSV36 EQU   CVTQMSG                                                  02107000
CVTAMFF  EQU   CVTMAP+264                                               02108000
CVTPURGA EQU   CVTPURG+1                                                02109000
CVTRSV35 EQU   CVTPURG                                                  02110000
CVTCBSP  EQU   CVTMAP+256                                               02111000
CVTATERA EQU   CVTATER+1                                                02112000
CVTSYST  EQU   CVTATER                                                  02113000
CVTVOLT2 EQU   CVTTAT                                                   02114000
CVTVOLI2 EQU   CVTVOLF2                                                 02115000
CVTAQAVB EQU   CVTAQAVT+1                                               02116000
CVTRSV34 EQU   CVTTCMFG                                                 02117000
CVTRSV33 EQU   CVTTCMFG                                                 02118000
CVTRSV32 EQU   CVTTCMFG                                                 02119000
CVTRSV31 EQU   CVTTCMFG                                                 02120000
CVTRSV30 EQU   CVTTCMFG                                                 02121000
CVTRSV29 EQU   CVTTCMFG                                                 02122000
CVTRSV28 EQU   CVTTCMFG                                                 02123000
CVTTCRDY EQU   CVTTCMFG                                                 02124000
CVTGTFA  EQU   CVTGTF+1                                                 02125000
CVTRSV27 EQU   CVTGTFST                                                 02126000
CVTRNIO  EQU   CVTGTFST                                                 02127000
CVTUSR   EQU   CVTGTFST                                                 02128000
CVTRV318 EQU   CVTFORM                                                  02129000
CVTRV317 EQU   CVTTMODE                                                 02130000
CVTRV316 EQU   CVTSTATE                                                 02131000
CVTRV315 EQU   CVTGTFS                                                  02132000
CVTGTFAV EQU   CVTGTFS                                                  02133000
CVT0SCR1 EQU   CVTMAP+232                                               02134000
CVTRV515 EQU   CVTMAP+228                                               02135000
CVTRMS   EQU   CVTMAP+224                                               02136000
CVTPATCH EQU   CVTMAP+220                                               02137000
CVTTSCE  EQU   CVTMAP+216                                               02138000
CVTLNKSC EQU   CVTMAP+214                                               02139000
CVTQABST EQU   CVTMAP+212                                               02140000
CVTMDLDS EQU   CVTMAP+208                                               02141000
CVTUSER  EQU   CVTMAP+204                                               02142000
CVTABEND EQU   CVTMAP+200                                               02143000
CVTSMCA  EQU   CVTMAP+196                                               02144000
CVTRSV18 EQU   CVTMAP+192                                               02145000
CVTQLPAQ EQU   CVTMAP+188                                               02146000
CVTQCDSR EQU   CVTMAP+184                                               02147000
CVTRSV17 EQU   CVTOPTB                                                  02148000
CVTRSV16 EQU   CVTOPTB                                                  02149000
CVTFP    EQU   CVTOPTB                                                  02150000
CVTAPTHR EQU   CVTOPTB                                                  02151000
CVTNLOG  EQU   CVTOPTB                                                  02152000
CVTTOD   EQU   CVTOPTB                                                  02153000
CVTCTIMS EQU   CVTOPTB                                                  02154000
CVTPROT  EQU   CVTOPTB                                                  02155000
CVTXPFP  EQU   CVTOPTA                                                  02156000
CVTASCII EQU   CVTOPTA                                                  02157000
CVTRSV13 EQU   CVTOPTA                                                  02158000
CVTRSV12 EQU   CVTOPTA                                                  02159000
CVTNIP   EQU   CVTOPTA                                                  02160000
CVTDDR   EQU   CVTOPTA                                                  02161000
CVTAPR   EQU   CVTOPTA                                                  02162000
CVTCCH   EQU   CVTOPTA                                                  02163000
CVTSNCTR EQU   CVTMAP+180                                               02164000
CVTQOCR  EQU   CVTMAP+172                                               02165000
CVT1EF00 EQU   CVTMAP+168                                               02166000
CVTMZ00  EQU   CVTMAP+164                                               02167000
CVTHEAD  EQU   CVTMAP+160                                               02168000
CVTRSV11 EQU   CVTMAP+156                                               02169000
CVT0PT01 EQU   CVTMAP+152                                               02170000
CVTRV516 EQU   CVTIERLC                                                 02171000
CVTILCH  EQU   CVTMAP+140                                               02172000
CVT0DS   EQU   CVTMAP+136                                               02173000
CVTFBOSV EQU   CVTMAP+132                                               02174000
CVTNUCB  EQU   CVTMAP+128                                               02175000
CVTIXAVL EQU   CVTMAP+124                                               02176000
CVTIOQET EQU   CVTMAP+120                                               02177000
CVTDCBA  EQU   CVTMAP+117                                               02178000
CVTMVS2  EQU   CVTDCB                                                   02179000
CVT6DAT  EQU   CVTDCB                                                   02180000
CVT4MPS  EQU   CVTDCB                                                   02181000
CVTRSV09 EQU   CVTDCB                                                   02182000
CVT4MS1  EQU   CVTDCB                                                   02183000
CVT2SPS  EQU   CVTDCB                                                   02184000
CVT1SSS  EQU   CVTDCB                                                   02185000
CVTRSV08 EQU   CVTDCB                                                   02186000
CVTSTB   EQU   CVTMAP+112                                               02187000
CVTQTD00 EQU   CVTMAP+108                                               02188000
CVTQTE00 EQU   CVTMAP+104                                               02189000
CVTCUCB  EQU   CVTMAP+100                                               02190000
CVTSJQ   EQU   CVTMAP+96                                                02191000
CVTPBLDL EQU   CVTMAP+92                                                02192000
CVTTPC   EQU   CVTMAP+88                                                02193000
CVTSVDCB EQU   CVTMAP+84                                                02194000
CVTBRET  EQU   CVTMAP+82                                                02195000
CVTEXIT  EQU   CVTMAP+80                                                02196000
CVT0FN00 EQU   CVTMAP+76                                                02197000
CVTDARA  EQU   CVTDAR+1                                                 02198000
CVTRSV07 EQU   CVTFLGS1                                                 02199000
CVTRSV06 EQU   CVTFLGS1                                                 02200000
CVTRSV05 EQU   CVTFLGS1                                                 02201000
CVTRSV04 EQU   CVTFLGS1                                                 02202000
CVTRSV03 EQU   CVTFLGS1                                                 02203000
CVTRSV02 EQU   CVTFLGS1                                                 02204000
CVTRSV01 EQU   CVTFLGS1                                                 02205000
CVTDMPLK EQU   CVTFLGS1                                                 02206000
CVTXITP  EQU   CVTMAP+68                                                02207000
CVTZDTAB EQU   CVTMAP+64                                                02208000
CVTMSLT  EQU   CVTMAP+60                                                02209000
CVTDATE  EQU   CVTMAP+56                                                02210000
CVTBTERM EQU   CVTMAP+52                                                02211000
CVTSYSAD EQU   CVTMAP+48                                                02212000
CVTXTLER EQU   CVTMAP+44                                                02213000
CVTILK1  EQU   CVTMAP+36                                                02214000
CVTPRLTV EQU   CVTMAP+32                                                02215000
CVTPCNVT EQU   CVTMAP+28                                                02216000
CVT0VL00 EQU   CVTMAP+24                                                02217000
CVTXAPG  EQU   CVTMAP+20                                                02218000
CVTBUF   EQU   CVTMAP+16                                                02219000
CVTJOB   EQU   CVTMAP+12                                                02220000
CVTLINK  EQU   CVTMAP+8                                                 02221000
CVT0EF00 EQU   CVTMAP+4                                                 02222000
CVT      EQU   CVTMAP                                                   02223000
@NM00174 EQU   PSA+3412                                                 02224000
PSASTAK  EQU   PSA+3072                                                 02225000
@NM00173 EQU   PSA+1040                                                 02226000
PSAUSEND EQU   PSA+1040                                                 02227000
PSARV062 EQU   PSA+1036                                                 02228000
PSAATCVT EQU   PSA+1032                                                 02229000
PSAPCPSW EQU   PSA+1024                                                 02230000
PSARV060 EQU   PSA+1020                                                 02231000
PSARV059 EQU   PSA+1018                                                 02232000
PSASVC13 EQU   PSA+1016                                                 02233000
PSALSFCC EQU   PSA+1012                                                 02234000
PSASFACC EQU   PSA+1008                                                 02235000
PSASTOP  EQU   PSA+992                                                  02236000
PSASTART EQU   PSA+976                                                  02237000
PSARSPSW EQU   PSA+968                                                  02238000
PSASRPSW EQU   PSA+960                                                  02239000
PSARV045 EQU   PSA+892                                                  02240000
PSARV044 EQU   PSA+888                                                  02241000
PSARV043 EQU   PSA+884                                                  02242000
PSARV042 EQU   PSA+880                                                  02243000
PSARV041 EQU   PSA+876                                                  02244000
PSARV040 EQU   PSA+872                                                  02245000
PSARV025 EQU   PSA+868                                                  02246000
PSADSSED EQU   PSA+868                                                  02247000
PSADSSPR EQU   PSA+864                                                  02248000
PSADSSFW EQU   PSA+860                                                  02249000
PSADSS14 EQU   PSA+856                                                  02250000
PSADSSPP EQU   PSA+848                                                  02251000
PSADSSRP EQU   PSA+840                                                  02252000
PSADSS05 EQU   PSADSSF4                                                 02253000
PSADSS10 EQU   PSADSSF4                                                 02254000
PSADSSVE EQU   PSADSSF4                                                 02255000
PSADSSDE EQU   PSADSSF4                                                 02256000
PSADSSC0 EQU   PSADSSF4                                                 02257000
PSADSSIE EQU   PSADSSF4                                                 02258000
PSADSS12 EQU   PSADSSF4                                                 02259000
PSADSSRC EQU   PSADSSF4                                                 02260000
PSARV057 EQU   PSADSSF3                                                 02261000
PSARV056 EQU   PSADSSF3                                                 02262000
PSARV055 EQU   PSADSSF3                                                 02263000
PSADSSMC EQU   PSADSSF3                                                 02264000
PSADSSRW EQU   PSADSSF3                                                 02265000
PSADSSNM EQU   PSADSSF3                                                 02266000
PSADSSES EQU   PSADSSF3                                                 02267000
PSADSSGP EQU   PSADSSF3                                                 02268000
PSADSSF2 EQU   PSADSSFL+1                                               02269000
PSADSSPI EQU   PSADSSF1                                                 02270000
PSADSSOI EQU   PSADSSF1                                                 02271000
PSADSSSP EQU   PSADSSF1                                                 02272000
PSADSSTP EQU   PSADSSF1                                                 02273000
PSADSSDW EQU   PSADSSF1                                                 02274000
PSADSSDD EQU   PSADSSF1                                                 02275000
PSADSSDM EQU   PSADSSF1                                                 02276000
PSADSSMV EQU   PSADSSF1                                                 02277000
PSADSSTS EQU   PSA+816                                                  02278000
PSADSSWK EQU   PSA+812                                                  02279000
PSADSSR3 EQU   PSA+808                                                  02280000
PSADSSR2 EQU   PSA+804                                                  02281000
PSADSSRS EQU   PSA+800                                                  02282000
PSASTOR  EQU   PSA+796                                                  02283000
PSACPUSA EQU   PSA+794                                                  02284000
PSAVSTAP EQU   PSA+792                                                  02285000
PSAWKVAP EQU   PSA+788                                                  02286000
PSAWKRAP EQU   PSA+784                                                  02287000
PSAMCHIC EQU   PSA+783                                                  02288000
PSARV061 EQU   PSA+782                                                  02289000
PSASYMSK EQU   PSA+781                                                  02290000
PSAMCHFL EQU   PSA+780                                                  02291000
PSACR0   EQU   PSA+776                                                  02292000
PSAPSWSV EQU   PSA+768                                                  02293000
PSALITA  EQU   PSA+764                                                  02294000
PSACLHS  EQU   PSAHLHI                                                  02295000
PSALKR15 EQU   PSALKSA+60                                               02296000
PSALKR14 EQU   PSALKSA+56                                               02297000
PSALKR13 EQU   PSALKSA+52                                               02298000
PSALKR12 EQU   PSALKSA+48                                               02299000
PSALKR11 EQU   PSALKSA+44                                               02300000
PSALKR10 EQU   PSALKSA+40                                               02301000
PSALKR9  EQU   PSALKSA+36                                               02302000
PSALKR8  EQU   PSALKSA+32                                               02303000
PSALKR7  EQU   PSALKSA+28                                               02304000
PSALKR6  EQU   PSALKSA+24                                               02305000
PSALKR5  EQU   PSALKSA+20                                               02306000
PSALKR4  EQU   PSALKSA+16                                               02307000
PSALKR3  EQU   PSALKSA+12                                               02308000
PSALKR2  EQU   PSALKSA+8                                                02309000
PSALKR1  EQU   PSALKSA+4                                                02310000
PSALKR0  EQU   PSALKSA                                                  02311000
PSARV023 EQU   PSACLHT+52                                               02312000
PSALOCAL EQU   PSACLHT+48                                               02313000
PSACMSL  EQU   PSACLHT+44                                               02314000
PSAOPTL  EQU   PSACLHT+40                                               02315000
PSATPACL EQU   PSACLHT+36                                               02316000
PSATPDNL EQU   PSACLHT+32                                               02317000
PSATPNCL EQU   PSACLHT+28                                               02318000
PSAIOSLL EQU   PSACLHT+24                                               02319000
PSAIOSUL EQU   PSACLHT+20                                               02320000
PSAIOSCL EQU   PSACLHT+16                                               02321000
PSAIOSSL EQU   PSACLHT+12                                               02322000
PSASALCL EQU   PSACLHT+8                                                02323000
PSAASML  EQU   PSACLHT+4                                                02324000
PSADISPL EQU   PSACLHT                                                  02325000
PSASRSA  EQU   PSA+636                                                  02326000
PSARV050 EQU   PSA+634                                                  02327000
PSADSSGO EQU   PSA+633                                                  02328000
PSARECUR EQU   PSA+632                                                  02329000
PSAHLHIS EQU   PSA+628                                                  02330000
PSAIPCSA EQU   PSA+624                                                  02331000
@NM00172 EQU   PSA+621                                                  02332000
PSAIPCDM EQU   PSA+620                                                  02333000
PSAIPCD  EQU   PSA+616                                                  02334000
@NM00171 EQU   PSA+613                                                  02335000
PSAIPCRM EQU   PSA+612                                                  02336000
PSAIPCR  EQU   PSA+608                                                  02337000
PSAMCHEX EQU   PSA+600                                                  02338000
PSAMPSW  EQU   PSA+592                                                  02339000
PSAEXPS2 EQU   PSA+584                                                  02340000
PSAEXPS1 EQU   PSA+576                                                  02341000
PSAPIREG EQU   PSA+572                                                  02342000
PSARSREG EQU   PSA+568                                                  02343000
PSAGPREG EQU   PSA+556                                                  02344000
PSARV022 EQU   PSASUP4                                                  02345000
PSARV021 EQU   PSASUP4                                                  02346000
PSARV020 EQU   PSASUP4                                                  02347000
PSARV019 EQU   PSASUP4                                                  02348000
PSARV018 EQU   PSASUP4                                                  02349000
PSARV017 EQU   PSASUP4                                                  02350000
PSARV016 EQU   PSASUP4                                                  02351000
PSARV015 EQU   PSASUP4                                                  02352000
PSARV014 EQU   PSASUP3                                                  02353000
PSARV013 EQU   PSASUP3                                                  02354000
PSARV012 EQU   PSASUP3                                                  02355000
PSARV011 EQU   PSASUP3                                                  02356000
PSARV010 EQU   PSASUP3                                                  02357000
PSARV009 EQU   PSASUP3                                                  02358000
PSARV008 EQU   PSASUP3                                                  02359000
PSAIOSUP EQU   PSASUP3                                                  02360000
PSALCR   EQU   PSASUP2                                                  02361000
PSARTM   EQU   PSASUP2                                                  02362000
PSAACR   EQU   PSASUP2                                                  02363000
PSAIPCE2 EQU   PSASUP2                                                  02364000
PSAIPCES EQU   PSASUP2                                                  02365000
PSAIPCEC EQU   PSASUP2                                                  02366000
PSAGTF   EQU   PSASUP2                                                  02367000
PSAIPCRI EQU   PSASUP2                                                  02368000
PSAIPCRP EQU   PSASUP1                                                  02369000
PSAIPCDR EQU   PSASUP1                                                  02370000
PSADISP  EQU   PSASUP1                                                  02371000
PSALOCK  EQU   PSASUP1                                                  02372000
PSAPI    EQU   PSASUP1                                                  02373000
PSAEXT   EQU   PSASUP1                                                  02374000
PSASVC   EQU   PSASUP1                                                  02375000
PSAIO    EQU   PSASUP1                                                  02376000
PSAANEW  EQU   PSA+544                                                  02377000
PSATOLD  EQU   PSA+540                                                  02378000
PSATNEW  EQU   PSA+536                                                  02379000
PSALCCAR EQU   PSA+532                                                  02380000
PSALCCAV EQU   PSA+528                                                  02381000
PSAPCCAR EQU   PSA+524                                                  02382000
PSAPCCAV EQU   PSA+520                                                  02383000
PSACPULA EQU   PSA+518                                                  02384000
PSACPUPA EQU   PSA+516                                                  02385000
PSAPSA   EQU   PSA+512                                                  02386000
FLCHDEND EQU   PSA+512                                                  02387000
FLCCRSAV EQU   FLCMCLA+280                                              02388000
FLCGRSAV EQU   FLCMCLA+216                                              02389000
FLCFPSAV EQU   FLCMCLA+184                                              02390000
FLCFLA   EQU   FLCMCLA+88                                               02391000
FLCRGNCD EQU   FLCMCLA+84                                               02392000
FLCFSAA  EQU   FLCFSA+1                                                 02393000
@NM00170 EQU   FLCFSA                                                   02394000
@NM00169 EQU   FLCMCLA+72                                               02395000
FLCMCIC  EQU   FLCMCLA+64                                               02396000
@NM00168 EQU   FLCMCLA+20                                               02397000
FLCIOAA  EQU   FLCIOA+1                                                 02398000
@NM00167 EQU   FLCIOA                                                   02399000
@NM00166 EQU   FLCMCLA+15                                               02400000
@NM00165 EQU   FLCMCLA+14                                               02401000
@NM00164 EQU   FLCMCLA+12                                               02402000
FLCLCL   EQU   FLCMCLA+8                                                02403000
FLCIOELA EQU   FLCIOEL+1                                                02404000
@NM00163 EQU   FLCIOEL                                                  02405000
FLCCHNID EQU   FLCMCLA                                                  02406000
@NM00162 EQU   PSA+160                                                  02407000
FLCMTRCD EQU   PSA+157                                                  02408000
@NM00161 EQU   PSA+156                                                  02409000
FLCPERA  EQU   FLCPER+1                                                 02410000
@NM00160 EQU   FLCPER                                                   02411000
@NM00159 EQU   PSA+151                                                  02412000
FLCPERCD EQU   PSA+150                                                  02413000
FLCMCNUM EQU   PSA+149                                                  02414000
@NM00158 EQU   PSA+148                                                  02415000
FLCTEAA  EQU   FLCTEA+1                                                 02416000
@NM00157 EQU   FLCTEA                                                   02417000
PSAPIPC  EQU   PSAPICOD                                                 02418000
PSAPIMC  EQU   PSAPICOD                                                 02419000
PSAPIPER EQU   PSAPICOD                                                 02420000
PSARV049 EQU   FLCPICOD                                                 02421000
FLCPILCB EQU   FLCPIILC                                                 02422000
@NM00156 EQU   FLCPIILC                                                 02423000
@NM00155 EQU   PSAEPPSW                                                 02424000
FLCSVCN  EQU   PSAESPSW+2                                               02425000
FLCSILCB EQU   FLCSVILC                                                 02426000
@NM00154 EQU   FLCSVILC                                                 02427000
@NM00153 EQU   PSAESPSW                                                 02428000
FLCEICOD EQU   PSAEEPSW+2                                               02429000
PSASPAD  EQU   PSAEEPSW                                                 02430000
@NM00152 EQU   PSA+128                                                  02431000
FLCINPSW EQU   PSA+120                                                  02432000
FLCMNPSW EQU   PSA+112                                                  02433000
FLCPNPSW EQU   PSA+104                                                  02434000
FLCSNPSW EQU   PSA+96                                                   02435000
FLCENPSW EQU   PSA+88                                                   02436000
FLCTRACE EQU   PSA+84                                                   02437000
FLCTIMER EQU   PSA+80                                                   02438000
FLCCVT2  EQU   PSA+76                                                   02439000
FLCCAW   EQU   PSA+72                                                   02440000
FLCCSW   EQU   PSA+64                                                   02441000
FLCIOPSW EQU   PSA+56                                                   02442000
FLCMOPSW EQU   PSA+48                                                   02443000
FLCPOPSW EQU   PSA+40                                                   02444000
FLCSOPSW EQU   PSA+32                                                   02445000
FLCEOPSW EQU   PSA+24                                                   02446000
@NM00151 EQU   FLCICCW2+4                                               02447000
FLCCVT   EQU   FLCICCW2                                                 02448000
FLCICCW1 EQU   FLCROPSW                                                 02449000
FLCIPPSW EQU   FLCRNPSW                                                 02450000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02451000
@ENDDATA EQU   *                                                        02452000
         END   IEFSD060,(C'PLS1805',0603,74222)                         02453000
