         MACRO                                                          02000020
         IEFSDWKX                                                       04000020
IEFSDWKX DSECT                                                          06000020
*                                                                MAPMAC 06010020
*****************************************************************MAPMAC 08000020
*                THE CONTROL AREA FOR SPANNING USED IN           MAPMAC 10000020
*                THE FOLLOWING SYSOUT WRITER MODULES - -         MAPMAC 12000020
*                IEFSD078,IEFSD087,IEFSDXYZ,IEFSDXXX             MAPMAC 14000020
*                                                                MAPMAC 16000020
*                ANY CHANGES MADE TO THIS MACRO MUST             MAPMAC 18000020
*                BE VALID FOR ALL MODULES CONTAINING             MAPMAC 20000020
*                THIS MACRO                                      MAPMAC 22000020
*****************************************************************MAPMAC 24000020
WORKFXXX DS    0F                                                MAPMAC 26000020
ATENW    DS    18F                      SAVE AREA                MAPMAC 28000020
SWXXX    DS    C                        SWITCHES                 MAPMAC 30000020
WATPT    EQU   1                        WORK AREA TO BE PUT SW   MAPMAC 32000020
WABPT    EQU   2                        WORK AREA BEING PUT SW   MAPMAC 34000020
DTASW    EQU   4                        DATA SET SWITCH          MAPMAC 36000020
INSEG    DS    C                        INPUT SEG INDICATION     MAPMAC 38000020
INSEW    DS    C                        SAVE FOR ABOVE           MAPMAC 40000020
         DS    C                                                 MAPMAC 42000020
MAXI1    DS    F                        INITIAL: MAX. INPUT      MAPMAC 44000020
MAXO1    DS    F                                 MAX. OUTPUT     MAPMAC 46000020
MINO1    DS    F                                 MIN. OUTPUT     MAPMAC 48000020
MAXI2    DS    F                        WORKING: MAX. INPUT      MAPMAC 50000020
MAXO2    DS    F                                 MAX. OUTPUT     MAPMAC 52000020
MINO2    DS    F                                 MIN. OUTPUT     MAPMAC 54000020
MAXI3    DS    F                        SAVED:   MAX. INPUT      MAPMAC 56000020
MAXO3    DS    F                                 MAX. OUTPUT     MAPMAC 58000020
MINO3    DS    F                                 MIN. OUTPUT     MAPMAC 60000020
SOUTL    DS    F                        OUTPUT LENGTH            MAPMAC 62000020
         DS    F                        OUTPUT LOCATION          MAPMAC 64000020
INLSW    DS    F                        SAVE INPUT LENGTH        MAPMAC 66000020
INLOW    DS    F                        SAVE INPUT LOCATION      MAPMAC 68000020
LENLO    DS    F                        LOC OF LENGTH OUTPUT     MAPMAC 70000020
         DS    F                        LNTH OUTPUT (SOMETIMES)  MAPMAC 72000020
WOKRL    DS    F                        LENGTH OF WORK AREA      MAPMAC 74000020
WOKRA    DS    F                        LOCATION OF WORK AREA    MAPMAC 76000020
         DS    F                        PLACE FOR GETMAIN STUFF  MAPMAC 78000020
WORKEEND EQU   *                                                 MAPMAC 80000020
BSKWA    DS    168C                     WK AREA FOR NON DS'S     MAPMAC 82000020
WORKFEND EQU   *                                                 MAPMAC 84000020
*****************************************************************MAPMAC 86000020
*                                                                MAPMAC 88000020
         MEND                                                           90000020
