IEFVGM13 CSECT                                                          00020000
*             THIS MODULE CONTAINS MESSAGES ASSOCIATED WITH THE         00040000
*             INTERPRETER KEYS                                    19874 00043019
*              OPTCD OF THE DCB FIELD                             19874 00046019
*              PRTSP OF THE DCB FIELD                             19874 00049019
*              RECFM OF THE DCB FIELD                             19874 00052019
*              RKP OF THE DCB FIELD                               19874 00055019
*              SOWA OF THE DCB FIELD                              19874 00058019
*              STACK OF THE DCB FIELD                             19874 00061019
*              TRTCH OF THE DCB FIELD                             19874 00064019
*              DD                                                 19874 00067019
         IEFVKEYS                                                 19874 00070019
M138     EQU   *                                                        00080000
         DC    AL1(OPTCDMK)                                       19874 00100019
         DC    AL1(M139-M138-2)                                         00120000
         DC    C'IN THE OPTCD SUBPARAMETER '                            00140000
         DC    C'OF THE DCB FIELD '                                     00160000
M139     EQU   *                                                        00180000
         DC    AL1(PRTSPMK)                                       19874 00200019
         DC    AL1(M13A-M139-2)                                         00220000
         DC    C'IN THE PRTSP SUBPARAMETER '                            00240000
         DC    C'OF THE DCB FIELD '                                     00260000
M13A     EQU   *                                                        00280000
         DC    AL1(RECFMMK)                                       19874 00300019
         DC    AL1(M13B-M13A-2)                                         00320000
         DC    C'IN THE RECFM SUBPARAMETER '                            00340000
         DC    C'OF THE DCB FIELD '                                     00360000
M13B     EQU   *                                                        00380000
         DC    AL1(RKPMK)                                         19874 00400019
         DC    AL1(M13C-M13B-2)                                         00420000
         DC    C'IN THE RKP SUBPARAMETER '                              00440000
         DC    C'OF THE DCB FIELD '                                     00460000
M13C     EQU   *                                                        00480000
         DC    AL1(SOWAMK)                                        19874 00500019
         DC    AL1(M13D-M13C-2)                                         00520000
         DC    C'IN THE SOWA SUBPARAMETER '                             00540000
         DC    C'OF THE DCB FIELD '                                     00560000
M13D     EQU   *                                                        00580000
         DC    AL1(STACKMK)                                       19874 00600019
         DC    AL1(M13E-M13D-2)                                         00620000
         DC    C'IN THE STACK SUBPARAMETER '                            00640000
         DC    C'OF THE DCB FIELD '                                     00660000
M13E     EQU   *                                                        00680000
         DC    AL1(TRTCHMK)                                       19874 00700019
         DC    AL1(M13F-M13E-2)                                         00720000
         DC    C'IN THE TRTCH SUBPARAMETER '                            00740000
         DC    C'OF THE DCB FIELD '                                     00760000
M13F     EQU   *                                                        00780000
         DC    AL1(DDK)                                           19874 00800019
         DC    AL1(MEE-M13F-2)                                          00820000
         DC    C'ON THE DD STATEMENT'                                   00840000
MEE      DC    X'FF'                                                    00860000
         MODID BR=NO                                             Y01886 00870001
         END                                                            00880000
