         TITLE 'IEFXB609 (IEFDSDRP) 11/21/75                           *00001000
                        '                                               00002000
IEFXB609 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IEFXB609  78.059'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @04,0                                               0001 00011000
@PSTART  LA    @05,4095(,@04)                                      0001 00012000
         LA    @06,4095(,@05)                                      0001 00013000
         LA    @10,4095(,@06)                                      0001 00014000
         USING @PSTART,@04                                         0001 00015000
         USING @PSTART+4095,@05                                    0001 00016000
         USING @PSTART+8190,@06                                    0001 00017000
         USING @PSTART+12285,@10                                   0001 00018000
         L     @00,@SIZDATD                                        0001 00019000
         MODESET EXTKEY=SCHED,SAVEKEY=(2)                               00020000
         GETMAIN  R,LV=(0)                                              00021000
         LR    @03,@01                                             0001 00022000
         LA    @08,4095(,@03)                                      0001 00023000
         USING @DATD,@03                                           0001 00024000
         USING @DATD+4095,@08                                      0001 00025000
         ST    @13,@SA00001+4                                      0001 00026000
         STC   @02,CALLKEY                                         0001 00027000
         MODESET KEYADDR=(2)                                            00028000
         LM    @00,@02,20(@13)                                     0001 00029000
         ST    @03,8(,@13)                                         0001 00030000
         LR    @13,@03                                             0001 00031000
         MODESET EXTKEY=ZERO                                            00032000
         MVC   @PC00001(4),0(@01)                                  0001 00033000
         MODESET EXTKEY=SCHED                                           00034000
JSCBDISP EQU 188                                                        00035000
JSCBAOS1 EQU  72                                                        00036000
JSCBAOS2 EQU 192                                                        00037000
*                                      PROCESSING                    */ 00038000
*   CALL SETUP;                     /* INITIALIZATION                */ 00039000
         BAL   @14,SETUP                                           0318 00040000
*   CALL FINDCHEK;                  /* FINDS SIOT AND JFCB FOR CKPT     00041000
*                                      DATASET                       */ 00042000
         BAL   @14,FINDCHEK                                        0319 00043000
*   CALL ALOCCHEK;                  /* DYNAMICALLY ALLOCS THE CHKPT     00044000
*                                      DATASET                       */ 00045000
         BAL   @14,ALOCCHEK                                        0320 00046000
*   CALL OPENCHEK;                  /* PERFORM OPEN VIA IEFXB610     */ 00047000
         BAL   @14,OPENCHEK                                        0321 00048000
*   CALL RNAMEPGM;                  /* INSURES PROPER SCT STRUCTURE -   00049000
*                                      AND CHANGES PGMNAME TO      0322 00050000
*                                      IEFRSTRT............          */ 00051000
         BAL   @14,RNAMEPGM                                        0322 00052000
*   CALL CHRPROC;                   /* PROCESS CHECKPOINT HEADER   0323 00053000
*                                      RECORD                        */ 00054000
         BAL   @14,CHRPROC                                         0323 00055000
*   CALL MSGSETUP;                  /* CONSTRUCT SUCCESS MESSAGE     */ 00056000
         BAL   @14,MSGSETUP                                        0324 00057000
*   CALL DDNTPROC;                  /* PROCESS THE DDNAME TABLE -  0325 00058000
*                                      HANDLE SITUATION CAUSED BY  0325 00059000
*                                      DYN. UNALLOCATING JCL DATA  0325 00060000
*                                      SETS.                         */ 00061000
         BAL   @14,DDNTPROC                                        0325 00062000
*   CALL MERGMAIN;                                                 0326 00063000
*                                                                  0326 00064000
         BAL   @14,MERGMAIN                                        0326 00065000
*   /*****************************************************************/ 00066000
*   /*                                                               */ 00067000
*   /* PROCESS THE TYPE 1 DSDRS AGAINST THE EXISTING SIOT/JFCB CHAIN.*/ 00068000
*   /* THIS PROC MAKES CALLS TO : READCHEK SIOTSCAN SIOTPROC JFCBPROC*/ 00069000
*   /* GDGNTJOB                                                      */ 00070000
*   /*                                                               */ 00071000
*   /*****************************************************************/ 00072000
*                                                                  0327 00073000
*   CALL LEFTOVER;                  /* PROCESS ANY SIOTS THAT ARE  0327 00074000
*                                      LEFT                          */ 00075000
         BAL   @14,LEFTOVER                                        0327 00076000
*   CALL SCTXPROC;                  /* BUILD RESTART PARAMETER LIST  */ 00077000
         BAL   @14,SCTXPROC                                        0328 00078000
*   CALL FREECHEK;                  /* DYN UNALLOCATE CKPT D.S.      */ 00079000
         BAL   @14,FREECHEK                                        0329 00080000
*   CALL WRAPUP;                    /* ISSUE SUCESS MSG AND CLEAN UP */ 00081000
         BAL   @14,WRAPUP                                          0330 00082000
*   DO;                             /* MODESET EXTKEY(SCHED)         */ 00083000
*     SPKA(16);                     /* SET PSW KEY                   */ 00084000
         LA    @12,16                                              0332 00085000
         SPKA  0(@12)                                              0332 00086000
*   END;                            /* MODESET EXTKEY(SCHED) INSURE     00087000
*                                      SCHEDULER KEY                 */ 00088000
*   RETURN CODE(ZEROPTR);           /* RETURN TO INIT...RC = 0       */ 00089000
         IC    @02,CALLKEY                                         0334 00090000
         L     @13,4(,@13)                                         0334 00091000
         L     @00,@SIZDATD                                        0334 00092000
         LR    @01,@03                                             0334 00093000
         FREEMAIN R,LV=(0),A=(1)                                        00094000
         MODESET KEYADDR=(2)                                            00095000
         SLR   @15,@15                                             0334 00096000
         L     @14,12(,@13)                                        0334 00097000
         LM    @00,@12,20(@13)                                     0334 00098000
         BR    @14                                                 0334 00099000
*SETUP:                                                            0335 00100000
*   PROC;                                                          0335 00101000
@EL00001 IC    @02,CALLKEY                                         0335 00102000
         L     @13,4(,@13)                                         0335 00103000
@EF00001 L     @00,@SIZDATD                                        0335 00104000
         LR    @01,@03                                             0335 00105000
         FREEMAIN R,LV=(0),A=(1)                                        00106000
         MODESET KEYADDR=(2)                                            00107000
@ER00001 LM    @14,@12,12(@13)                                     0335 00108000
         BR    @14                                                 0335 00109000
SETUP    STM   @14,@12,@SA00002                                    0335 00110000
*   DCL                                                            0336 00111000
*     LENSTAE PTR(31) LOCAL STATIC GEND;                           0336 00112000
*   DCL                                                            0337 00113000
*     STAELIST CHAR(*) GEND BDY(WORD);                             0337 00114000
*   DCL                                                            0338 00115000
*     STAENTR BIT(1);                                              0338 00116000
*   DCL                                                            0339 00117000
*     STALIST1 CHAR(*) GEND LOCAL STATIC BDY(WORD);                0339 00118000
*   DCL                                                            0340 00119000
*     LISTREL PTR(24) DEF(STAELIST) POS(2);                        0340 00120000
*   DCL                                                            0341 00121000
*     STAEREGS CHAR(72) BDY(WORD);  /* SAVEAREA FOR REGS FOR STAE    */ 00122000
*   DCL                                                            0342 00123000
*     REGPTR PTR(31) ABNL;                                         0342 00124000
*   LCTPTR=ADDR(LCTPTR1);           /* SAVE INPUT PARAMETER          */ 00125000
         L     @12,@PC00001                                        0343 00126000
         ST    @12,LCTPTR                                          0343 00127000
*   TCBPTR=TCBCURN;                 /* ADRESSABILITY TCB             */ 00128000
         LA    @12,16                                              0344 00129000
         L     @12,CVTPTR(,@12)                                    0344 00130000
         L     @12,CVTTCBP(,@12)                                   0344 00131000
         MVC   TCBPTR(4),TCBCURN(@12)                              0344 00132000
*   STAELIST(1:LENSTAE)=STALIST1(1:LENSTAE);/* COPY FOR RE-ENT     0345 00133000
*                                                            @YM07326*/ 00134000
         L     @12,LENSTAE                                         0345 00135000
         BCTR  @12,0                                               0345 00136000
         EX    @12,@SM04554                                        0345 00137000
*   LISTREL=ADDR(STAEPROC);         /* PUT RELOCATABLE ADDR IN LIST  */ 00138000
         LA    @12,STAEPROC                                        0346 00139000
         STCM  @12,7,LISTREL                                       0346 00140000
*   GEN(STM 0,15,STAEREGS);         /* REGS FOR STAE EXIT            */ 00141000
         STM 0,15,STAEREGS                                              00142000
*   REGPTR=ADDR(STAEREGS);          /* INITIALIZE PTR FOR STAE EXIT  */ 00143000
         LA    @12,STAEREGS                                        0348 00144000
         ST    @12,REGPTR                                          0348 00145000
*   TCBPTR=TCBCURN;                 /* INIT TCB ADDR'ABILITY         */ 00146000
         LA    @12,16                                              0349 00147000
         L     @12,CVTPTR(,@12)                                    0349 00148000
         L     @12,CVTTCBP(,@12)                                   0349 00149000
         ICM   @11,15,TCBCURN(@12)                                 0349 00150000
         ST    @11,TCBPTR                                          0349 00151000
*   UNCATSW=NOTON;                  /* INIT SWITCH TO INDICATE     0350 00152000
*                                      UNALOCAT HAS NOT BEEN ENTERED    00153000
*                                                            @YM06575*/ 00154000
         NI    UNCATSW,B'01111111'                                 0350 00155000
*   LASTDSAB=ZEROPTR;               /* INDICATE NO DSABS     @YM30745*/ 00156000
         SLR   @12,@12                                             0351 00157000
         ST    @12,LASTDSAB                                        0351 00158000
*   ALOCPARM=NOTON;                 /* INDICATE DYN ALLOC PARMS ARE     00159000
*                                      NOT INITIALIZED FOR STAE    0352 00160000
*                                                            @YM30745*/ 00161000
         NI    ALOCPARM,B'01111111'                                0352 00162000
*   SAVEJSCB=TCBJSCB->JSCBACT;      /* FOR USE BY STAEPROC   @YM08127*/ 00163000
         L     @12,TCBJSCB(,@11)                                   0353 00164000
         L     @12,JSCBACT(,@12)                                   0353 00165000
         ST    @12,SAVEJSCB                                        0353 00166000
*   GEN( ESTAE PARAM=REGPTR,MF=(E,STAELIST));                      0354 00167000
          ESTAE PARAM=REGPTR,MF=(E,STAELIST)                            00168000
*   STAENTR=NOTON;                  /* INIT FLAG                     */ 00169000
         NI    STAENTR,B'01111111'                                 0355 00170000
*   ADDR603=ADDR(IEFXB603);         /* PICK UP ADRESS OF MESSAGE   0356 00171000
*                                      MODULE                        */ 00172000
         L     @12,@CV04056                                        0356 00173000
         ST    @12,ADDR603                                         0356 00174000
*   IF LCTRFBDC=ON THEN             /* SET INDICATOR FOR RESTART TYPE*/ 00175000
         L     @12,LCTPTR                                          0357 00176000
         TM    LCTRFBDC(@12),B'00010000'                           0357 00177000
         BNO   @RF00357                                            0357 00178000
*     RESTYPE=ON;                   /* ON = DEFERRED                 */ 00179000
         OI    RESTYPE,B'10000000'                                 0358 00180000
*   ELSE                                                           0359 00181000
*     RESTYPE=NOTON;                /* OFF = AUTOMATIC               */ 00182000
         B     @RC00357                                            0359 00183000
@RF00357 NI    RESTYPE,B'01111111'                                 0359 00184000
*   QMPAPTR=ADDR(QMGR1);            /* ADDRESSABILITY FOR QMPA       */ 00185000
@RC00357 L     @12,LCTPTR                                          0360 00186000
         LA    @11,QMGR1(,@12)                                     0360 00187000
         ST    @11,QMPAPTR                                         0360 00188000
*   EPAPTR=ADDR(EPABUF);            /* ADDRESSABILITY FOR EPA        */ 00189000
         LA    @11,EPABUF                                          0361 00190000
         ST    @11,EPAPTR                                          0361 00191000
*   SWEPAPTR=ADDR(EPABUF);          /* EPA ADDRESSABILITY FOR MOVE   */ 00192000
         ST    @11,SWEPAPTR                                        0362 00193000
*   JCTPTR=LCTJCTAD;                /* INCORE JCT ADDRESS            */ 00194000
         L     @12,LCTJCTAD(,@12)                                  0363 00195000
         ST    @12,JCTPTR                                          0363 00196000
*   SWCHNPTR=ZEROPTR;               /* INDICATE LAST EPA             */ 00197000
         SLR   @09,@09                                             0364 00198000
         ST    @09,SWCHNPTR(,@11)                                  0364 00199000
*   SWVA=JCTDSKAD;                  /* SETUP FOR READ OF SWA JCT     */ 00200000
         MVC   SWVA(3,@11),JCTDSKAD(@12)                           0365 00201000
*   CALL READSWA;                   /* CALL SWAMGR                   */ 00202000
         BAL   @14,READSWA                                         0366 00203000
*   JCTPTR=SWBLKPTR;                /* NEW ADDRESSABILITY FOR JCT    */ 00204000
         L     @12,SWEPAPTR                                        0367 00205000
         L     @12,SWBLKPTR(,@12)                                  0367 00206000
         ST    @12,JCTPTR                                          0367 00207000
*   GEN DATA DEFS(DCBDSORG,DCBDEVT,DCBGEN,DCBOFLGS,DCBLRECL);      0368 00208000
*   DCBCKPT=DCBGEN;                 /* COPY TO AUTO STORAGE FOR RENT */ 00209000
         MVC   DCBCKPT(96),DCBGEN                                  0369 00210000
*   DCBREG=ADDR(DCBCKPT);           /* ADDRESSABILITY FOR DCB        */ 00211000
         LA    @12,DCBCKPT                                         0370 00212000
         LR    DCBREG,@12                                          0370 00213000
*   DCBPARM=ADDR(DCBCKPT);          /* INIT VALUE FOR CLIST          */ 00214000
         ST    @12,DCBPARM                                         0371 00215000
*   GEN DATA;                                                      0372 00216000
*   GEN(USING IHADCB,DCBREG);       /* ADDRESSABILITY FOR DSECT      */ 00217000
         USING IHADCB,DCBREG                                            00218000
*   SYNFLAG=NOTON;                  /* INITIALIZE FLAG FOR SYNADEXIT */ 00219000
         NI    SYNFLAG,B'01111111'                                 0374 00220000
*   LALOCCTR=0;                     /* INIT NUM OF SIOTS TO ZERO     */ 00221000
         SLR   @12,@12                                             0375 00222000
         STH   @12,LALOCCTR                                        0375 00223000
*   PROCSIOT=ZEROPTR;               /* INIT FOR SIOT SCAN PROC       */ 00224000
         ST    @12,PROCSIOT                                        0376 00225000
*   GEN DATA DEFS(STAELIST);                                       0377 00226000
*   GEN DATA DEFS(STALIST1,LENSTAE);                               0378 00227000
*                                                                  0378 00228000
*/******************************************                         */ 00229000
*                                                                  0379 00230000
*   GOTO SETUPOUT;                                                 0379 00231000
*                                                                  0379 00232000
         B     SETUPOUT                                            0379 00233000
*   /*****************************************************************/ 00234000
*   /*                                                               */ 00235000
*   /* USED AS SYNAD EXIT                                            */ 00236000
*   /*                                                               */ 00237000
*   /*****************************************************************/ 00238000
*                                                                  0380 00239000
*SYNEXIT:                                                          0380 00240000
*   SYNFLAG=ON;                     /* SHOW SYNAD EXIT ENTERED       */ 00241000
SYNEXIT  OI    SYNFLAG,B'10000000'                                 0380 00242000
*   GEN(BR 14);                     /* RETURN DIRECT TO DATA MGT   0381 00243000
*                                      &YM04748                      */ 00244000
         BR 14                                                          00245000
*/******************************************                         */ 00246000
*                                                                  0382 00247000
*SETUPOUT:                                                         0382 00248000
*   END SETUP;                                                     0382 00249000
@EL00002 DS    0H                                                  0382 00250000
@EF00002 DS    0H                                                  0382 00251000
@ER00002 LM    @14,@12,@SA00002                                    0382 00252000
         BR    @14                                                 0382 00253000
*FINDCHEK:                                                         0383 00254000
*   PROC;                                                          0383 00255000
*                                                                  0383 00256000
FINDCHEK STM   @14,@12,@SA00003                                    0383 00257000
*/*************************************************************      */ 00258000
*/* THE PURPOSE OF THIS ROUTINE IS TO FIND THE SIOT AND JFCB         */ 00259000
*/* FOR THE CHECKPOINT DATA SET AND INITIALIZE THE POINTERS TO       */ 00260000
*/* THESE BLOCKS FOR USE BY THE ALOCCHEK ROUTINE.                    */ 00261000
*/*************************************************************      */ 00262000
*                                                                  0384 00263000
*   DCL                                                            0384 00264000
*     CKPTSIOT PTR(31) ABNL;                                       0384 00265000
*   DCL                                                            0385 00266000
*     TTRSW BIT(1);                                                0385 00267000
*   IF RESTYPE=NOTON THEN           /* AUTO RESTART...               */ 00268000
         TM    RESTYPE,B'10000000'                                 0386 00269000
         BNZ   @RF00386                                            0386 00270000
*     DO;                                                          0387 00271000
*                                                                  0387 00272000
*       /*************************************************************/ 00273000
*       /*                                                           */ 00274000
*       /* FOLLOWING CODE IS NECESSARY TO FIND THE SIOT FOR THE CKPT */ 00275000
*       /* DS FOR AUTO RESTART. THE UNITTYPE FIELD FROM THE SIOT IS  */ 00276000
*       /* NEEDED FOR THE DYNALLOC PARM LIST.                        */ 00277000
*       /*                                                           */ 00278000
*       /*************************************************************/ 00279000
*                                                                  0388 00280000
*       SWVA=JCTSSTR;               /* PICK UP SCT ADDRESS           */ 00281000
         L     @12,SWEPAPTR                                        0388 00282000
         L     @11,JCTPTR                                          0388 00283000
         MVC   SWVA(3,@12),JCTSSTR(@11)                            0388 00284000
*       REALADD=LENGTH(SWAPFX);     /* INIT LENGTH OF PREFIX         */ 00285000
         MVC   REALADD(3),@CF00052+1                               0389 00286000
*       CALL READSWA;               /* READ PROB PROG SCT            */ 00287000
         BAL   @14,READSWA                                         0390 00288000
*       SCTPTR=SWBLKPTR;            /* ADDRESSABILITY SCT            */ 00289000
         L     @12,SWEPAPTR                                        0391 00290000
         L     @12,SWBLKPTR(,@12)                                  0391 00291000
         ST    @12,SCTPTR                                          0391 00292000
*       TTRSW=NOTON;                                               0392 00293000
         NI    TTRSW,B'01111111'                                   0392 00294000
*       IF SCTFSIOT^=ZEROPTR THEN   /* IF NO SIOTS, DONT TRY         */ 00295000
         SLR   @11,@11                                             0393 00296000
         ICM   @11,7,SCTFSIOT(@12)                                 0393 00297000
         LTR   @11,@11                                             0393 00298000
         BZ    @RF00393                                            0393 00299000
*         DO;                       /* TO READ               @YM08163*/ 00300000
*           CKPTSIOT=SCTFSIOT;      /* PICK UP 1ST SIOT              */ 00301000
         ST    @11,CKPTSIOT                                        0395 00302000
*           DO WHILE TTRSW=NOTON;   /* LOOP TIL FOUND OR END         */ 00303000
         B     @DE00396                                            0396 00304000
@DL00396 DS    0H                                                  0397 00305000
*             IF EVAL(CKPTSIOT+REALADD)->SCTPJFCB=JCTCKTTR THEN    0397 00306000
         L     @12,REALADD-1                                       0397 00307000
         LA    @12,0(,@12)                                         0397 00308000
         L     @11,CKPTSIOT                                        0397 00309000
         ALR   @11,@12                                             0397 00310000
         L     @09,JCTPTR                                          0397 00311000
         CLC   SCTPJFCB(3,@11),JCTCKTTR(@09)                       0397 00312000
         BNE   @RF00397                                            0397 00313000
*               DO;                                                0398 00314000
*                 SIOTPTR=(CKPTSIOT+REALADD);/* SET UP FOR ALLOCHEK  */ 00315000
         AL    @12,CKPTSIOT                                        0399 00316000
         ST    @12,SIOTPTR                                         0399 00317000
*                 TTRSW=ON;         /* STOP THE LOOP                 */ 00318000
         OI    TTRSW,B'10000000'                                   0400 00319000
*               END;                                               0401 00320000
*             ELSE                                                 0402 00321000
*               IF CKPTSIOT=SCTLSIOT THEN                          0402 00322000
         B     @RC00397                                            0402 00323000
@RF00397 L     @12,CKPTSIOT                                        0402 00324000
         L     @11,SCTPTR                                          0402 00325000
         SLR   @09,@09                                             0402 00326000
         ICM   @09,7,SCTLSIOT(@11)                                 0402 00327000
         CR    @12,@09                                             0402 00328000
         BNE   @RF00402                                            0402 00329000
*                 DO;                                              0403 00330000
*                   CKPTSIOT=ZEROPTR;/* INDICATE NO CKPT SIOT        */ 00331000
         SLR   @12,@12                                             0404 00332000
         ST    @12,CKPTSIOT                                        0404 00333000
*                   TTRSW=ON;       /* STOP THE LOOP                 */ 00334000
         OI    TTRSW,B'10000000'                                   0405 00335000
*                   IF EVAL(JCTCKTTR+REALADD)->JFCVRDS=ON THEN     0406 00336000
         L     @12,JCTPTR                                          0406 00337000
         SLR   @11,@11                                             0406 00338000
         ICM   @11,7,JCTCKTTR(@12)                                 0406 00339000
         L     @12,REALADD-1                                       0406 00340000
         LA    @12,0(,@12)                                         0406 00341000
         ALR   @11,@12                                             0406 00342000
         TM    JFCVRDS(@11),B'00000100'                            0406 00343000
         BNO   @RF00406                                            0406 00344000
*                     CALL VAMERR;  /* IF VAM WAS UNALLOCATED, NO UCB   00345000
*                                      ADDRESS CAN EVER BE RETRIEVED */ 00346000
         BAL   @14,VAMERR                                          0407 00347000
*                 END;                                             0408 00348000
*               ELSE                                               0409 00349000
*                 CKPTSIOT=(CKPTSIOT+REALADD)->SCTPSIOT;/* GET NEXT  */ 00350000
         B     @RC00402                                            0409 00351000
@RF00402 L     @12,REALADD-1                                       0409 00352000
         LA    @12,0(,@12)                                         0409 00353000
         AL    @12,CKPTSIOT                                        0409 00354000
         SLR   @11,@11                                             0409 00355000
         ICM   @11,7,SCTPSIOT(@12)                                 0409 00356000
         ST    @11,CKPTSIOT                                        0409 00357000
*           END;                                                   0410 00358000
@RC00402 DS    0H                                                  0410 00359000
@RC00397 DS    0H                                                  0410 00360000
@DE00396 TM    TTRSW,B'10000000'                                   0410 00361000
         BZ    @DL00396                                            0410 00362000
*         END;                      /*                       @YM08163*/ 00363000
*       SWVA=JCTCKTTR;              /* INIT FOR COMMON READ          */ 00364000
@RF00393 L     @12,SWEPAPTR                                        0412 00365000
         L     @11,JCTPTR                                          0412 00366000
         MVC   SWVA(3,@12),JCTCKTTR(@11)                           0412 00367000
*     END;                                                         0413 00368000
*   ELSE                                                           0414 00369000
*     DO;                           /* DEFERRED RESTART.....         */ 00370000
         B     @RC00386                                            0414 00371000
@RF00386 DS    0H                                                  0415 00372000
*       SWVA=JCTSSTR;               /* PICK UP DSDRP SCT             */ 00373000
         L     @12,SWEPAPTR                                        0415 00374000
         L     @11,JCTPTR                                          0415 00375000
         MVC   SWVA(3,@12),JCTSSTR(@11)                            0415 00376000
*       CALL READSWA;               /* READ IT                       */ 00377000
         BAL   @14,READSWA                                         0416 00378000
*       SCTPTR=SWBLKPTR;            /* ADDRESSABILITY SCT            */ 00379000
         L     @12,SWEPAPTR                                        0417 00380000
         L     @11,SWBLKPTR(,@12)                                  0417 00381000
         ST    @11,SCTPTR                                          0417 00382000
*       SWVA=SCTFSIOT;              /* PICK UP ADDR SIOT FOR CKPT DS */ 00383000
         MVC   SWVA(3,@12),SCTFSIOT(@11)                           0418 00384000
*       CALL READSWA;                                              0419 00385000
         BAL   @14,READSWA                                         0419 00386000
*       SIOTPTR=SWBLKPTR;           /* ADDRESSABILITY SIOT           */ 00387000
         L     @12,SWEPAPTR                                        0420 00388000
         L     @11,SWBLKPTR(,@12)                                  0420 00389000
         ST    @11,SIOTPTR                                         0420 00390000
*       SWVA=SCTANSCT;              /* GET P/P SCT FOR ALOCAT      0421 00391000
*                                                            @YM06575*/ 00392000
         L     @11,SCTPTR                                          0421 00393000
         MVC   SWVA(3,@12),SCTANSCT(@11)                           0421 00394000
*       CALL READSWA;               /* READ IT               @YM06575*/ 00395000
         BAL   @14,READSWA                                         0422 00396000
*       SCTPTR=SWBLKPTR;            /* ADDRESSABILITY SCT    @YM06575*/ 00397000
         L     @12,SWEPAPTR                                        0423 00398000
         L     @11,SWBLKPTR(,@12)                                  0423 00399000
         ST    @11,SCTPTR                                          0423 00400000
*       SWVA=SCTPJFCB;              /* SET UP FOR COMMON READ        */ 00401000
         L     @11,SIOTPTR                                         0424 00402000
         MVC   SWVA(3,@12),SCTPJFCB(@11)                           0424 00403000
*       JCTCKFT=ON;                 /* TURN ON CKPT TAKEN BIT        */ 00404000
         L     @12,JCTPTR                                          0425 00405000
         OI    JCTCKFT(@12),B'00010000'                            0425 00406000
*     END;                                                         0426 00407000
*   CALL READSWA;                   /* READ JFCB                     */ 00408000
@RC00386 BAL   @14,READSWA                                         0427 00409000
*   JFCBPTR=SWBLKPTR;               /* ADDRESSABILITY FOR JFCB       */ 00410000
         L     @12,SWEPAPTR                                        0428 00411000
         L     @12,SWBLKPTR(,@12)                                  0428 00412000
         ST    @12,JFCBPTR                                         0428 00413000
*   CALL ALOCAT;                    /* GO ALLOC ANY PVT CATALOGS   0429 00414000
*                                      NEEDED                @YM06575*/ 00415000
         BAL   @14,ALOCAT                                          0429 00416000
*   END FINDCHEK;                                                  0430 00417000
@EL00003 DS    0H                                                  0430 00418000
@EF00003 DS    0H                                                  0430 00419000
@ER00003 LM    @14,@12,@SA00003                                    0430 00420000
         BR    @14                                                 0430 00421000
*ALOCCHEK:                                                         0431 00422000
*   PROC;                                                          0431 00423000
*                                                                  0431 00424000
ALOCCHEK STM   @14,@12,@SA00004                                    0431 00425000
*/*************************************************************      */ 00426000
*/* THE PURPOSE OF THE ROUTINE IS TO DYNAMICALLY ALLOCATE THE        */ 00427000
*/* CHECKPOINT DATA SET.  SIOTPTR AND JFCBPTR WILL HAVE BEEN         */ 00428000
*/* INITIALIZED BY THE FINDCHEK PROCEDURE..                          */ 00429000
*/*************************************************************      */ 00430000
*                                                                  0432 00431000
*   RESPECIFY                                                      0432 00432000
*     S99RBPTR BASED(ADDR(EDBRBPTR));                              0432 00433000
*   RESPECIFY                                                      0433 00434000
*     S99RB BASED(S99RBPTR);                                       0433 00435000
*   DCL                                                            0434 00436000
*     ARITFLAG FIXED(31) DEFINED(S99FLAG2) BDY(BYTE);              0434 00437000
*   DCL                                                            0435 00438000
*     ARITFLG2 FIXED(15) DEFINED(S99FLAG1) BDY(BYTE);              0435 00439000
*   DCL                                                            0436 00440000
*     USEJCL BIT(1);                                               0436 00441000
*   DCL                                                            0437 00442000
*     SAVEDEVT CHAR(4);             /* HOLDER FOR DEVT               */ 00443000
*/****  GENERAL PARM LIST INFO  ***                                  */ 00444000
*                                                                  0438 00445000
*   DO;                             /* MODESET SAVEKEY(SAVEKEYA)   0438 00446000
*                                      KEYADDR(ZEROPTR)              */ 00447000
*     RESPECIFY                                                    0439 00448000
*      (GPR02F) RESTRICTED;                                        0439 00449000
*     IPK;                          /* SAVE CURRENT PSW KEY          */ 00450000
         IPK                                                       0440 00451000
*     SAVEKEYA=GPR02F;                                             0441 00452000
         STC   GPR02F,SAVEKEYA                                     0441 00453000
*     SPKA(ZEROPTR);                /* SET PSW KEY                   */ 00454000
         SLR   @12,@12                                             0442 00455000
         SPKA  0(@12)                                              0442 00456000
*     RESPECIFY                                                    0443 00457000
*      (GPR02F) UNRESTRICTED;                                      0443 00458000
*   END;                            /* MODESET SAVEKEY(SAVEKEYA)   0444 00459000
*                                      KEYADDR(ZEROPTR) SET KEY = 0  */ 00460000
*   EDBRBPTR=ADDR(EDB99RB);         /* INITIALIZE BASE               */ 00461000
         LA    @11,EDB99RB                                         0445 00462000
         ST    @11,EDBRBPTR                                        0445 00463000
*   S99RBPND=ON;                    /* INDICATE ONLY ONE RB          */ 00464000
         LA    @11,EDBRBPTR                                        0446 00465000
         OI    S99RBPND(@11),B'10000000'                           0446 00466000
*   S99RBLN=LENGTH(EDB99RB);        /* SET LENGTH OF RB              */ 00467000
         L     @11,S99RBPTR(,@11)                                  0447 00468000
         MVI   S99RBLN(@11),X'14'                                  0447 00469000
*   S99VERB=S99VRBAL;               /* SET VERB TO ALLOCATE          */ 00470000
         MVI   S99VERB(@11),X'01'                                  0448 00471000
*   S99TXTPP=ADDR(TUPLEDB);         /* POINT TO TXT UNIT PTR LIST    */ 00472000
         LA    @09,TUPLEDB                                         0449 00473000
         ST    @09,S99TXTPP(,@11)                                  0449 00474000
*   S99RSV01=ZEROPTR;               /* INIT TO ZERO          @YM04748*/ 00475000
         ST    @12,S99RSV01(,@11)                                  0450 00476000
*   ARITFLAG=ZEROPTR;               /* INIT PARM FLAGS TO ZERO     0451 00477000
*                                                            @YM04748*/ 00478000
         ST    @12,ARITFLAG(,@11)                                  0451 00479000
*   ARITFLG2=ZEROPTR;               /* FLAGS TO ZERO         @YM07031*/ 00480000
         STH   @12,ARITFLG2(,@11)                                  0452 00481000
*   S99WTDSN=ON;                    /* INDICATE WAIT OPTION          */ 00482000
*   S99WTUNT=ON;                    /* INDICATE WAIT OPTION          */ 00483000
         OI    S99WTDSN(@11),B'01010000'                           0454 00484000
*/***** SET TEXT UNIT POINTERS ****                                  */ 00485000
*                                                                  0455 00486000
*   TUPTR(1)=ADDR(TU1);                                            0455 00487000
         LA    @12,TU1                                             0455 00488000
         ST    @12,TUPTR                                           0455 00489000
*   TUPTR(2)=ADDR(TU2);                                            0456 00490000
         LA    @12,TU2                                             0456 00491000
         ST    @12,TUPTR+4                                         0456 00492000
*   TUPTR(3)=ADDR(TU3);                                            0457 00493000
         LA    @12,TU3                                             0457 00494000
         ST    @12,TUPTR+8                                         0457 00495000
*   TUPTR(4)=ADDR(TU4);                                            0458 00496000
         LA    @12,TU4                                             0458 00497000
         ST    @12,TUPTR+12                                        0458 00498000
*   TUPTR(5)=ADDR(TU5);                                            0459 00499000
         LA    @12,TU5                                             0459 00500000
         ST    @12,TUPTR+16                                        0459 00501000
*   TUPTR(6)=ADDR(TU6);                                            0460 00502000
         LA    @12,TU6                                             0460 00503000
         ST    @12,TUPTR+20                                        0460 00504000
*   TUPTR(7)=ADDR(TU61);                                           0461 00505000
         LA    @12,TU61                                            0461 00506000
         ST    @12,TUPTR+24                                        0461 00507000
*   TUPTR(8)=ADDR(TU7);                                            0462 00508000
*                                                                  0462 00509000
         LA    @12,TU7                                             0462 00510000
         ST    @12,TUPTR+28                                        0462 00511000
*/***** FILL IN SPECIFIC INFO  IN TEXT UNITS ****                    */ 00512000
*/*****    DDNAME     TEXT UNIT ****                                 */ 00513000
*                                                                  0463 00514000
*   TU1KEY=DALDDNAM;                /* SET KEY                       */ 00515000
         MVC   TU1KEY(2),@CB02945                                  0463 00516000
*   TU1NUM=ONEHEX;                  /* NUMBER OF PARMS THIS UNIT     */ 00517000
         LA    @12,1                                               0464 00518000
         STH   @12,TU1NUM                                          0464 00519000
*   TU1LEN=SIXHEX;                  /* SET LENGTH OF PARM            */ 00520000
         MVC   TU1LEN(2),@CH02955                                  0465 00521000
*   TU1PARM=SYSCHK;                 /* SET ACTUAL PARAMETER          */ 00522000
         MVC   TU1PARM(6),@CC03773                                 0466 00523000
*/*****    DSNAME     TEXT UNIT ****                                 */ 00524000
*                                                                  0467 00525000
*   TU2KEY=DALDSNAM;                /* SET KEY                       */ 00526000
         MVC   TU2KEY(2),@CB02947                                  0467 00527000
*   TU2NUM=ONEHEX;                  /* NUMBER OF PARMS THIS UNIT     */ 00528000
         STH   @12,TU2NUM                                          0468 00529000
*   TU2LEN=HEX2C;                   /* SET LENGTH OF PARM            */ 00530000
         MVC   TU2LEN(2),@CH03031                                  0469 00531000
*   TU2PARM=JFCBDSNM;               /* SET ACTUAL PARAMETER          */ 00532000
         L     @11,JFCBPTR                                         0470 00533000
         MVC   TU2PARM(44),JFCBDSNM(@11)                           0470 00534000
*/***** MEMBER NAME  TEXT UNIT ****                                  */ 00535000
*                                                                  0471 00536000
*   IF JFCBELNM^=BLANKS THEN        /* ELEMENT SPECIFIED?    @ZA12693*/ 00537000
         CLC   JFCBELNM(8,@11),@CC03776                            0471 00538000
         BE    @RF00471                                            0471 00539000
*     DO;                           /* YES THEN PASS IT      @ZA12693*/ 00540000
*       TU3KEY=DALMEMBR;            /* MEMBER KEY - DYNAM    @ZA12693*/ 00541000
         MVC   TU3KEY(2),@CB02949                                  0473 00542000
*       TU3NUM=ONEHEX;              /* ONE ELEMENT NAME      @ZA12693*/ 00543000
         STH   @12,TU3NUM                                          0474 00544000
*       TU3LEN=ATEHEX;              /* 8 BYTES IN LENGTH     @ZA12693*/ 00545000
         MVC   TU3LEN(2),@CH02959                                  0475 00546000
*       TU3PARM=JFCBELNM;           /* ELEMENT FROM JFCB     @ZA12693*/ 00547000
         MVC   TU3PARM(8),JFCBELNM(@11)                            0476 00548000
*     END;                          /* END ELEMENT PROC      @ZA12693*/ 00549000
*   ELSE                            /* NO ELEMENT SPECIFD    @ZA12693*/ 00550000
*     TUPTR(3)=ZEROPTR;             /* CLEAR PTR FOR DYN     @ZA12693*/ 00551000
         B     @RC00471                                            0478 00552000
@RF00471 SLR   @12,@12                                             0478 00553000
         ST    @12,TUPTR+8                                         0478 00554000
*/*****    STATUS     TEXT UNIT ****                                 */ 00555000
*                                                                  0479 00556000
*   TU4KEY=DALSTATS;                /* SET KEY                       */ 00557000
@RC00471 MVC   TU4KEY(2),@CB02951                                  0479 00558000
*   TU4NUM=ONEHEX;                  /* NUMBER OF PARMS THIS UNIT     */ 00559000
         LA    @12,1                                               0480 00560000
         STH   @12,TU4NUM                                          0480 00561000
*   TU4LEN=ONEHEX;                  /* SET LENGTH OF PARM            */ 00562000
         STH   @12,TU4LEN                                          0481 00563000
*   TU4PARM=OLDSTAT;                /* SET ACTUAL PARAMETER          */ 00564000
         MVI   TU4PARM,X'01'                                       0482 00565000
*/*****    DISP     TEXT UNIT ****                                   */ 00566000
*                                                                  0483 00567000
*   TU5KEY=DALNDISP;                /* SET KEY                       */ 00568000
         MVC   TU5KEY(2),@CB02953                                  0483 00569000
*   TU5NUM=ONEHEX;                  /* NUMBER OF PARMS THIS UNIT     */ 00570000
         STH   @12,TU5NUM                                          0484 00571000
*   TU5LEN=ONEHEX;                  /* SET LENGTH OF PARM            */ 00572000
         STH   @12,TU5LEN                                          0485 00573000
*   TU5PARM=KEEP;                   /* SET ACTUAL PARAMETER          */ 00574000
         MVI   TU5PARM,X'08'                                       0486 00575000
*/***** 1ST VOLSER TEXT UNIT    ****                                 */ 00576000
*                                                                  0487 00577000
*   IF JFCBNVOL=0 THEN              /* IF NVOL IS ZERO, LET THEM USE */ 00578000
         L     @12,JFCBPTR                                         0487 00579000
         CLI   JFCBNVOL(@12),0                                     0487 00580000
         BNE   @RF00487                                            0487 00581000
*     TUPTR(6)=ZEROPTR;             /* THE CATALOG                   */ 00582000
         SLR   @12,@12                                             0488 00583000
         ST    @12,TUPTR+20                                        0488 00584000
*   ELSE                                                           0489 00585000
*     DO;                                                          0489 00586000
         B     @RC00487                                            0489 00587000
@RF00487 DS    0H                                                  0490 00588000
*       TU6KEY=DALVLSER;            /* SET KEY                       */ 00589000
         MVC   TU6KEY(2),@CB02975                                  0490 00590000
*       TU6NUM=ONEHEX;              /* NUMBER OF PARMS THIS UNIT     */ 00591000
         MVC   TU6NUM(2),@CH02945                                  0491 00592000
*       TU6LEN=SIXHEX;              /* SET LENGTH OF PARM            */ 00593000
         MVC   TU6LEN(2),@CH02955                                  0492 00594000
*       IF JCTVOLSQ=0 THEN          /* CHECK FOR VOLSEQ..    @YM07353*/ 00595000
         L     @12,JCTPTR                                          0493 00596000
         CLI   JCTVOLSQ(@12),0                                     0493 00597000
         BNE   @RF00493                                            0493 00598000
*         TU6PARM=JFCAVOLS(1);      /* IF NONE, USE 1ST VOLUME       */ 00599000
         L     @12,JFCBPTR                                         0494 00600000
         MVC   TU6PARM(6),JFCAVOLS(@12)                            0494 00601000
*       ELSE                                                       0495 00602000
*         DO;                       /* VOLSEQ SPECIFIED..FIND PROPER    00603000
*                                      VOLSER                        */ 00604000
         B     @RC00493                                            0495 00605000
@RF00493 DS    0H                                                  0496 00606000
*           I=JCTVOLSQ;             /* FOR INDEX             @YM08182*/ 00607000
         L     @12,JCTPTR                                          0496 00608000
         SLR   @11,@11                                             0496 00609000
         IC    @11,JCTVOLSQ(,@12)                                  0496 00610000
         ST    @11,I                                               0496 00611000
*           IF I<SIX THEN           /* IF NO VOLS IN JFCBX, USE JFCB */ 00612000
         C     @11,@CF02926                                        0497 00613000
         BNL   @RF00497                                            0497 00614000
*             TU6PARM=JFCAVOLS(I);                                 0498 00615000
         MH    @11,@CH00035                                        0498 00616000
         L     @12,JFCBPTR                                         0498 00617000
         ALR   @12,@11                                             0498 00618000
         MVC   TU6PARM(6),JFCAVOLS-6(@12)                          0498 00619000
*           ELSE                                                   0499 00620000
*             DO;                                                  0499 00621000
         B     @RC00497                                            0499 00622000
@RF00497 DS    0H                                                  0500 00623000
*               I=I-FIVE;           /* SUBTRACT JFCB VOLS...         */ 00624000
         L     @12,I                                               0500 00625000
         SL    @12,@CF00034                                        0500 00626000
         ST    @12,I                                               0500 00627000
*               SWVA=JFCBEXAD;      /* GET READY FOR JFCBX READ      */ 00628000
         L     @12,SWEPAPTR                                        0501 00629000
         L     @11,JFCBPTR                                         0501 00630000
         MVC   SWVA(3,@12),JFCBEXAD(@11)                           0501 00631000
*               CALL READSWA;                                      0502 00632000
         BAL   @14,READSWA                                         0502 00633000
*               JFCBXPTR=SWBLKPTR;  /* ADDR.JFCBX                    */ 00634000
         L     @12,SWEPAPTR                                        0503 00635000
         L     @11,SWBLKPTR(,@12)                                  0503 00636000
         ST    @11,JFCBXPTR                                        0503 00637000
*               SWVA=JFCBXTTR;      /* PREPARE FOR READ IN LOOP      */ 00638000
         MVC   SWVA(3,@12),JFCBXTTR(@11)                           0504 00639000
*               DO WHILE I>FIFTEEN;                                0505 00640000
         B     @DE00505                                            0505 00641000
@DL00505 DS    0H                                                  0506 00642000
*                 CALL READSWA;     /* GET JFCBX                     */ 00643000
         BAL   @14,READSWA                                         0506 00644000
*                 JFCBXPTR=SWBLKPTR;/* SET UP ADDR                   */ 00645000
         L     @12,SWEPAPTR                                        0507 00646000
         L     @11,SWBLKPTR(,@12)                                  0507 00647000
         ST    @11,JFCBXPTR                                        0507 00648000
*                 SWVA=JFCBXTTR;    /* READY FOR NEXT READ           */ 00649000
         MVC   SWVA(3,@12),JFCBXTTR(@11)                           0508 00650000
*                 I=I-FIFTEEN;      /* GO PAST THIS JFCBX            */ 00651000
         L     @12,I                                               0509 00652000
         SL    @12,@CF03927                                        0509 00653000
         ST    @12,I                                               0509 00654000
*               END;                /* I SHOULD HAVE INDEX NOW       */ 00655000
@DE00505 L     @12,I                                               0510 00656000
         C     @12,@CF03927                                        0510 00657000
         BH    @DL00505                                            0510 00658000
*               TU6PARM=JFCBXVOL(I);/* FILL IN PARM                  */ 00659000
         MH    @12,@CH00035                                        0511 00660000
         L     @11,JFCBXPTR                                        0511 00661000
         ALR   @11,@12                                             0511 00662000
         BCTR  @11,0                                               0511 00663000
         BCTR  @11,0                                               0511 00664000
         MVC   TU6PARM(6),JFCBXVOL-4(@11)                          0511 00665000
*             END;                                                 0512 00666000
*         END;                      /*                       @YM07353*/ 00667000
@RC00497 DS    0H                                                  0514 00668000
*     END;                                                         0514 00669000
*                                                                  0514 00670000
@RC00493 DS    0H                                                  0515 00671000
*/********FILE SEQUENCE TEXT UNIT ***********                        */ 00672000
*                                                                  0515 00673000
*   IF JFCBFLSQ^=ZEROPTR THEN                                      0515 00674000
@RC00487 L     @12,JFCBPTR                                         0515 00675000
         LH    @12,JFCBFLSQ(,@12)                                  0515 00676000
         LTR   @12,@12                                             0515 00677000
         BZ    @RF00515                                            0515 00678000
*     DO;                                                          0516 00679000
*       TU61KEY=DALDSSEQ;           /* SET KEY               @YM07315*/ 00680000
         MVC   TU61KEY(2),@CB03005                                 0517 00681000
*       TU61NUM=ONEHEX;             /* NUM = 1               @YM07315*/ 00682000
         MVC   TU61NUM(2),@CH02945                                 0518 00683000
*       TU61LEN=TWOHEX;             /* LEN = 2               @YM07315*/ 00684000
         MVC   TU61LEN(2),@CH02947                                 0519 00685000
*       TU61PARM=JFCBFLSQ;          /* SET PARM FROM JFCB    @YM07315*/ 00686000
         STH   @12,TU61PARM                                        0520 00687000
*     END;                                                         0521 00688000
*   ELSE                                                           0522 00689000
*     TUPTR(7)=ZEROPTR;                                            0522 00690000
*                                                                  0522 00691000
         B     @RC00515                                            0522 00692000
@RF00515 SLR   @12,@12                                             0522 00693000
         ST    @12,TUPTR+24                                        0522 00694000
*/****** UNIT SPECIFACATION TEXT UNIT ****                           */ 00695000
*                                                                  0523 00696000
*   IF RESTYPE=ON THEN              /* FOR DEFERRED, USE JCL @YM07317*/ 00697000
@RC00515 TM    RESTYPE,B'10000000'                                 0523 00698000
         BNO   @RF00523                                            0523 00699000
*     DO;                                                          0524 00700000
*       TU7KEY=DALUNIT;             /* SET KEY                       */ 00701000
         MVC   TU7KEY(2),@CB02985                                  0525 00702000
*       TU7NUM=ONEHEX;              /* NUMBER OF PARMS THIS UNIT     */ 00703000
         MVC   TU7NUM(2),@CH02945                                  0526 00704000
*       TU7LEN=ATEHEX;              /* SET LENGTH OF PARM            */ 00705000
         MVC   TU7LEN(2),@CH02959                                  0527 00706000
*       TU7PARM=SCTUTYPE(1:8);      /* SET ACTUAL PARAMETER  @YM08193*/ 00707000
         L     @12,SIOTPTR                                         0528 00708000
         MVC   TU7PARM(8),SCTUTYPE(@12)                            0528 00709000
*     END;                                                         0529 00710000
*   ELSE                                                           0530 00711000
*     DO;                           /* FOR AUTO, CHECK VIO OR USE  0530 00712000
*                                      GENERIC               @YM07317*/ 00713000
         B     @RC00523                                            0530 00714000
@RF00523 DS    0H                                                  0531 00715000
*       USEJCL=NOTON;               /* INIT INTERNAL FLAG    @YM08163*/ 00716000
         NI    USEJCL,B'01111111'                                  0531 00717000
*       IF(CKPTSIOT^=ZEROPTR&SIOVAMDS^=ON) THEN/* IF THERE ARE SIOTS,   00718000
*                                      EXAMINE THE UTYPE TO DETERMINE   00719000
*                                      IF                            */ 00720000
         L     @12,CKPTSIOT                                        0532 00721000
         LTR   @12,@12                                             0532 00722000
         BZ    @RF00532                                            0532 00723000
         L     @12,SIOTPTR                                         0532 00724000
         TM    SIOVAMDS(@12),B'00100000'                           0532 00725000
         BO    @RF00532                                            0532 00726000
*         DO;                       /* ESOTERIC SHOULD BE USED     0533 00727000
*                                                            @YM08163*/ 00728000
*           EDTPTR=ADDR(EDTTAB);    /* ADDRESSABILITY                */ 00729000
         L     @12,@CV03915                                        0534 00730000
         ST    @12,EDTPTR                                          0534 00731000
*           LUVPTR=EDTLUVSP+LENGTH(LUVHDR);/* INIT SEARCH POINTER    */ 00732000
         LA    @11,8                                               0535 00733000
         AL    @11,EDTLUVSP(,@12)                                  0535 00734000
         ST    @11,LUVPTR                                          0535 00735000
*           DO I=1 TO LUVENTNO-1 WHILE/* SEARCH FOR MATCH IN EDT     */ 00736000
*                 SCTUTYPE^=UNITNAME;                              0536 00737000
         LA    @12,1                                               0536 00738000
         B     @DE00536                                            0536 00739000
@DL00536 L     @11,LUVPTR                                          0536 00740000
         L     @09,SIOTPTR                                         0536 00741000
         CLC   SCTUTYPE(8,@09),UNITNAME(@11)                       0536 00742000
         BE    @DC00536                                            0536 00743000
*             LUVPTR=LUVPTR+LUVENTLN;/* UPDATE TO NEXT ENTRY         */ 00744000
         L     @09,EDTPTR                                          0537 00745000
         L     @09,EDTLUVSP(,@09)                                  0537 00746000
         AL    @11,LUVENTLN(,@09)                                  0537 00747000
         ST    @11,LUVPTR                                          0537 00748000
*           END;                                                   0538 00749000
         AL    @12,@CF00069                                        0538 00750000
@DE00536 ST    @12,I                                               0538 00751000
         L     @11,EDTPTR                                          0538 00752000
         L     @11,EDTLUVSP(,@11)                                  0538 00753000
         L     @11,LUVENTNO(,@11)                                  0538 00754000
         BCTR  @11,0                                               0538 00755000
         CR    @12,@11                                             0538 00756000
         BNH   @DL00536                                            0538 00757000
@DC00536 DS    0H                                                  0539 00758000
*           IF(SCTUTYPE=UNITNAME    /* WAS MATCH FOUND ?             */ 00759000
*               &LUVGENNO=ONEHEX) THEN/* AND ONLY ONE GENERIC IN GRP */ 00760000
         L     @12,LUVPTR                                          0539 00761000
         L     @11,SIOTPTR                                         0539 00762000
         CLC   SCTUTYPE(8,@11),UNITNAME(@12)                       0539 00763000
         BNE   @RF00539                                            0539 00764000
         CLC   LUVGENNO(4,@12),@CF02945                            0539 00765000
         BNE   @RF00539                                            0539 00766000
*             USEJCL=ON;            /* SIGNAL TO USE JCL (SIOT)      */ 00767000
         OI    USEJCL,B'10000000'                                  0540 00768000
*         END;                                                     0541 00769000
@RF00539 DS    0H                                                  0542 00770000
*       IF USEJCL=ON THEN           /* ALWAYS USE JCT FOR VAM        */ 00771000
@RF00532 TM    USEJCL,B'10000000'                                  0542 00772000
         BNO   @RF00542                                            0542 00773000
*         DO;                                                      0543 00774000
*           TU7KEY=DALUNIT;         /* SET KEY                       */ 00775000
         MVC   TU7KEY(2),@CB02985                                  0544 00776000
*           TU7NUM=ONEHEX;          /* SET NUMBER OF PARMS           */ 00777000
         MVC   TU7NUM(2),@CH02945                                  0545 00778000
*           TU7LEN=ATEHEX;          /* SET LENGTH OF PARM            */ 00779000
         MVC   TU7LEN(2),@CH02959                                  0546 00780000
*           TU7PARM=SCTUTYPE(1:8);  /* SET PARM FROM SIOT    @YM08193*/ 00781000
         L     @12,SIOTPTR                                         0547 00782000
         MVC   TU7PARM(8),SCTUTYPE(@12)                            0547 00783000
*         END;                                                     0548 00784000
*       ELSE                                                       0549 00785000
*         DO;                       /* IN OTHER CASES, USE THE     0549 00786000
*                                      JCTDEVT                       */ 00787000
         B     @RC00542                                            0549 00788000
@RF00542 DS    0H                                                  0550 00789000
*           S99UDEVT=ON;            /* TELL DYNAM THIS IS GENERIC    */ 00790000
         LA    @12,EDBRBPTR                                        0550 00791000
         L     @12,S99RBPTR(,@12)                                  0550 00792000
         OI    S99UDEVT(@12),B'10000000'                           0550 00793000
*           TU7KEY=DALUNIT;                                        0551 00794000
         MVC   TU7KEY(2),@CB02985                                  0551 00795000
*           TU7NUM=ONEHEX;                                         0552 00796000
         MVC   TU7NUM(2),@CH02945                                  0552 00797000
*           TU7LEN=ATEHEX;                                         0553 00798000
         MVC   TU7LEN(2),@CH02959                                  0553 00799000
*           IF CKPTSIOT=0 THEN                                     0554 00800000
         L     @12,CKPTSIOT                                        0554 00801000
         LTR   @12,@12                                             0554 00802000
         BNZ   @RF00554                                            0554 00803000
*             DO;                                                  0555 00804000
*               SIOTPTR=ADDR(NULLSIOT);                            0556 00805000
         LA    @12,NULLSIOT                                        0556 00806000
         ST    @12,SIOTPTR                                         0556 00807000
*               SIOVAMDS=NOTON;                                    0557 00808000
         NI    SIOVAMDS(@12),B'11011111'                           0557 00809000
*             END;                                                 0558 00810000
*           SAVEDEVT=SIOTDEVT;      /* SAVE SIOT DEVT                */ 00811000
@RF00554 L     @12,SIOTPTR                                         0559 00812000
         MVC   SAVEDEVT(4),SIOTDEVT(@12)                           0559 00813000
*           SIOTDEVT=JCTDEVT;       /* GET READY FOR BITSOFF         */ 00814000
         L     @11,JCTPTR                                          0560 00815000
         MVC   SIOTDEVT(4,@12),JCTDEVT(@11)                        0560 00816000
*           CALL BITSOFF;           /* GET RID OF EXTRA BITS         */ 00817000
         BAL   @14,BITSOFF                                         0561 00818000
*           TU71TO4=SIOTDEVT;       /* PASS GENERIC TO ALLOC         */ 00819000
         L     @12,SIOTPTR                                         0562 00820000
         MVC   TU71TO4(4),SIOTDEVT(@12)                            0562 00821000
*           SIOTDEVT=SAVEDEVT;      /* RESTORE SIOT DEVT             */ 00822000
         MVC   SIOTDEVT(4,@12),SAVEDEVT                            0563 00823000
*           TU75TO8=ZEROPTR;        /* ZERO IN CASE NOT VIO  @YM07317*/ 00824000
         SLR   @11,@11                                             0564 00825000
         STCM  @11,15,TU75TO8                                      0564 00826000
*           IF SIOVAMDS=ON THEN                                    0565 00827000
         TM    SIOVAMDS(@12),B'00100000'                           0565 00828000
         BNO   @RF00565                                            0565 00829000
*             DO;                   /* IF VAM, USE UCB ADDR  @YM07317*/ 00830000
*               TU76TO8=SIOUCBAD;   /* UCB ADDR NEEDED FOR VIO     0567 00831000
*                                                            @YM07317*/ 00832000
         MVC   TU76TO8(3),SIOUCBAD(@12)                            0567 00833000
*               TUPTR(6)=ZEROPTR;   /* VOLSER IS INVALID FOR VAM   0568 00834000
*                                      DATASET               @YM07317*/ 00835000
         ST    @11,TUPTR+20                                        0568 00836000
*             END;                                                 0569 00837000
*         END;                                                     0570 00838000
@RF00565 DS    0H                                                  0571 00839000
*     END;                                                         0571 00840000
@RC00542 DS    0H                                                  0572 00841000
*   TUPLAST(8)=ON;                  /* SET LAST UNIT INDICATOR       */ 00842000
@RC00523 OI    TUPLAST+28,B'10000000'                              0572 00843000
*   ALOCPARM=ON;                    /* INDICATE DYN ALOC PARMS ARE 0573 00844000
*                                      COMPLETE FOR STAE     @YM30475*/ 00845000
         OI    ALOCPARM,B'10000000'                                0573 00846000
*/******* RESET JSCBACT TO FORCE DYNALLOC TO USE INIT SWA            */ 00847000
*                                                                  0574 00848000
*   SAVEJSCB=TCBJSCB->JSCBACT;      /* SAVE PTR FOR RESTORE          */ 00849000
         L     @12,TCBPTR                                          0574 00850000
         L     @12,TCBJSCB(,@12)                                   0574 00851000
         L     @12,JSCBACT(,@12)                                   0574 00852000
         ST    @12,SAVEJSCB                                        0574 00853000
*   TCBJSCB->JSCBACT=TCBJSCB;       /* CHANGE JSCBACT TO INIT SWA    */ 00854000
         L     @12,TCBPTR                                          0575 00855000
         L     @12,TCBJSCB(,@12)                                   0575 00856000
         ST    @12,JSCBACT(,@12)                                   0575 00857000
*   PARMPTR=ADDR(S99RBPTR);         /* RE-INITIALIZE R1 FOR DYNALLOC */ 00858000
         LA    PARMPTR,EDBRBPTR                                    0576 00859000
*/*  MACDATE Y-2 73082                                               */ 00860000
*                                                                  0577 00861000
*   SVC(99);                        /* INVOKE DYNAMIC ALLOCATION     */ 00862000
         SVC   99                                                  0577 00863000
*   IF RCODE^=ZEROPTR THEN                                         0578 00864000
         SLR   @14,@14                                             0578 00865000
         CR    RCODE,@14                                           0578 00866000
         BE    @RF00578                                            0578 00867000
*     DO;                                                          0579 00868000
*       TCBJSCB->JSCBACT=SAVEJSCB;  /*                       @YM08158*/ 00869000
         L     @12,TCBPTR                                          0580 00870000
         L     @12,TCBJSCB(,@12)                                   0580 00871000
         L     @11,SAVEJSCB                                        0580 00872000
         ST    @11,JSCBACT(,@12)                                   0580 00873000
*       RETCODE=RCODE;              /* SAVE RETURN CODE      @Z40MPSJ*/ 00874000
         ST    RCODE,RETCODE                                       0581 00875000
*       DFPARMS=DFPARMS&&DFPARMS;   /* CLEAR PARAMETER AREA  @Z40MPSJ*/ 00876000
         XC    DFPARMS(20),DFPARMS                                 0582 00877000
*       DFS99RBP=S99RBPTR;          /* PASS SVC 99 REQUEST BLK     0583 00878000
*                                                            @Z40MPSJ*/ 00879000
         LA    @12,EDBRBPTR                                        0583 00880000
         L     @12,S99RBPTR(,@12)                                  0583 00881000
         ST    @12,DFS99RBP                                        0583 00882000
*       DFRCP=ADDR(RETCODE);        /* PASS SVC 99 RETURN CODE     0584 00883000
*                                                            @Z40MPSJ*/ 00884000
         LA    @12,RETCODE                                         0584 00885000
         ST    @12,DFRCP                                           0584 00886000
*       DFJEFF02=ADDR(ZEROPTR);     /* PASS ZERO FOR INTERFACE     0585 00887000
*                                                            @Z40MPSJ*/ 00888000
         LA    @12,@CF00395                                        0585 00889000
         ST    @12,DFJEFF02                                        0585 00890000
*       DFIDP=ADDR(DYNFAIL);        /* PASS FAIL ID          @Z40MPSJ*/ 00891000
         LA    @12,DYNFAIL                                         0586 00892000
         ST    @12,DFIDP                                           0586 00893000
*       DFWTP=ON;                   /* REQUEST WTP MESSAGE   @Z40MPSJ*/ 00894000
         OI    DFWTP(@12),B'10000000'                              0587 00895000
*       DO;                         /* LINK EP(IKJEFF18) SF(DFPARMS) */ 00896000
*         I00601='00'X;             /* EP/DE FLAG                    */ 00897000
         MVI   I00601,X'00'                                        0589 00898000
*         I00602=ADDR(IKJEFF18);    /* ADDR OF EP/DE                 */ 00899000
         LA    @12,@CC04053                                        0590 00900000
         STCM  @12,7,I00602                                        0590 00901000
*         I00604=0;                 /* DCB PTR                       */ 00902000
         STCM  @14,7,I00604                                        0591 00903000
*         I00603='00'X;             /* ERRET FLAG                    */ 00904000
         MVI   I00603,X'00'                                        0592 00905000
*         RESPECIFY                                                0593 00906000
*          (GPR01P) RESTRICTED;                                    0593 00907000
*         GPR01P=ADDR(DFPARMS);     /* ADDR OF OPTLIST               */ 00908000
         LA    GPR01P,DFPARMS                                      0594 00909000
*         RESPECIFY                                                0595 00910000
*          (GPR15P) RESTRICTED;                                    0595 00911000
*         GPR15P=ADDR(I006);        /* ADDR OF LINK LIST             */ 00912000
         LA    GPR15P,I006                                         0596 00913000
*         SVC(6);                   /* ISSUE LINK SVC                */ 00914000
         SVC   6                                                   0597 00915000
*         RESPECIFY                                                0598 00916000
*          (GPR01P) UNRESTRICTED;                                  0598 00917000
*         RESPECIFY                                                0599 00918000
*          (GPR15P) UNRESTRICTED;                                  0599 00919000
*       END;                        /* LINK EP(IKJEFF18) SF(DFPARMS) */ 00920000
*       CALL DYNERROR;                                             0601 00921000
         BAL   @14,DYNERROR                                        0601 00922000
*     END;                                                         0602 00923000
*   END ALOCCHEK;                                                  0603 00924000
@EL00004 DS    0H                                                  0603 00925000
@EF00004 DS    0H                                                  0603 00926000
@ER00004 LM    @14,@12,@SA00004                                    0603 00927000
         BR    @14                                                 0603 00928000
*OPENCHEK:                                                         0604 00929000
*   PROC;                                                          0604 00930000
*                                                                  0604 00931000
OPENCHEK STM   @14,@12,@SA00005                                    0604 00932000
*/**************************************************************     */ 00933000
*/* THE FUNCTIONS OF THIS PROCEDURE ARE: FIND THE TIOT ENTRY FOR     */ 00934000
*/* THE SYSCHK DD ENTRY THAT WAS CREATED BY DYNAMIC ALLOCATION.      */ 00935000
*/* PICK UP THE NEW JFCB AND UCB ADDRESSES FOR FINAL INITIAL-        */ 00936000
*/* ZATION OF THE DCB FOR CHKPT DATA SET.  ATTACH IEFXB610 TO        */ 00937000
*/* PERFORM THE ACTUAL OPEN.  WAIT ON EITHER OF TWO ECBS.....        */ 00938000
*/* OPEN COMPLETE OR CANCEL FOR THE RESTARTING JOB.                  */ 00939000
*/**************************************************************     */ 00940000
*                                                                  0605 00941000
*   DCL                                                            0605 00942000
*     ADDR610 PTR(31) ABNL;                                        0605 00943000
*   DCL                                                            0606 00944000
*     ATT610 CHAR(*) GEND BDY(WORD);/* TELL COMPILER AVOUT ATTACHLIST*/ 00945000
*   DCL                                                            0607 00946000
*     ATT6101 CHAR(*) LOCAL STATIC GEND;                           0607 00947000
*   DCL                                                            0608 00948000
*     LENALIST PTR(31) LOCAL STATIC GEND;                          0608 00949000
*   DCL                                                            0609 00950000
*     NAMPTR PTR(31) DEFINED(ATT610);/* ADDR WORD 1 FOR RE-ENT       */ 00951000
*   DCL                                                            0610 00952000
*     ECBATT PTR(31) DEFINED(ATT610) POS(9);                       0610 00953000
*   DCL                                                            0611 00954000
*     NAMOFSET BIT(8) CONSTANT('1C'X);/* OFFSET OF NAME INLIST       */ 00955000
*   DCL                                                            0612 00956000
*     1 DSORGBITS BIT(16) DEF(DCBDSORG),                           0612 00957000
*      2 * BIT(6),                                                 0612 00958000
*      2 PARTBIT BIT(1),            /* PARTITIONED DSORG             */ 00959000
*      2 * BIT(9);                                                 0612 00960000
*   DCL                                                            0613 00961000
*     CKMEMNM CHAR(8) BDY(DWORD);   /* MNAME HOLDER FOR FIND         */ 00962000
*   DCL                                                            0614 00963000
*     1 OPENBITS BIT(8) DEF(DCBOFLGS),                             0614 00964000
*      2 * BIT(3),                                                 0614 00965000
*      2 GOODOPEN BIT(1),                                          0614 00966000
*      2 * BIT(4);                                                 0614 00967000
*   QDBPTR=JSCDSABQ;                /* ADDR'ABILITY FOR QDB          */ 00968000
         L     @12,TCBPTR                                          0615 00969000
         L     @12,TCBJSCB(,@12)                                   0615 00970000
         L     @12,JSCDSABQ(,@12)                                  0615 00971000
         ST    @12,QDBPTR                                          0615 00972000
*   DSABPTR=QDBFELMP;               /* ADDR'ABILITY 1ST DSAB.        */ 00973000
         L     @12,QDBFELMP(,@12)                                  0616 00974000
         ST    @12,DSABPTR                                         0616 00975000
*   DCBREG=ADDR(DCBCKPT);           /* RE-INIT DCB POINTER           */ 00976000
         LA    DCBREG,DCBCKPT                                      0617 00977000
*   DO WHILE TIOEDDNM^=SYSCHK;                                     0618 00978000
         B     @DE00618                                            0618 00979000
@DL00618 DS    0H                                                  0619 00980000
*     DSABPTR=DSABFCHN;             /* SEARCH TIOT ENTRIES UNTIL   0619 00981000
*                                      SYSCHK ENTRY( JUSTALLOCATED)     00982000
*                                      IS FOUND.                     */ 00983000
         L     @12,DSABPTR                                         0619 00984000
         L     @12,DSABFCHN(,@12)                                  0619 00985000
         ST    @12,DSABPTR                                         0619 00986000
*   END;                                                           0620 00987000
@DE00618 L     @12,DSABPTR                                         0620 00988000
         L     @12,DSABTIOT(,@12)                                  0620 00989000
         CLC   TIOEDDNM(6,@12),@CC03773                            0620 00990000
         BNE   @DL00618                                            0620 00991000
*   JFCBPTR=TIOEJFCB;               /* ADDRESSABILITY FOR JFCB       */ 00992000
         SLR   @11,@11                                             0621 00993000
         ICM   @11,7,TIOEJFCB(@12)                                 0621 00994000
         ST    @11,JFCBPTR                                         0621 00995000
*   DCBDSORG=JFCDSORG;              /* MOVE IN DSORG...IF IT WAS   0622 00996000
*                                      SPECIFIED, SOFAR SO GOOD. IF     00997000
*                                      IT WAS NOT...LET OPEN FILL IT    00998000
*                                      FROM DSCB             @YM06573*/ 00999000
         MVC   DCBDSORG(2),JFCDSORG(@11)                           0622 01000000
*   UCBPTR=TIOEFSRT;                /* ADDRESSABILITY FOR UCB        */ 01001000
         L     @12,TIOEFSRT-1(,@12)                                0623 01002000
         LA    @12,0(,@12)                                         0623 01003000
         ST    @12,UCBPTR                                          0623 01004000
*/* LINES 261600 THROUGH 262800 DELETED               @YM04288       */ 01005000
*                                                                  0624 01006000
*   IF RESTYPE=ON THEN              /* IF DEFERRED...FINISH JCT INIT */ 01007000
         TM    RESTYPE,B'10000000'                                 0624 01008000
         BNO   @RF00624                                            0624 01009000
*     DO;                           /* FOR AUTO AFTER DEFERRED       */ 01010000
*       JCTDEVT=UCBTYP;                                            0626 01011000
         L     @09,JCTPTR                                          0626 01012000
         MVC   JCTDEVT(4,@09),UCBTYP(@12)                          0626 01013000
*       JCTVOLSQ=DUMYVLSQ(2);                                      0627 01014000
         IC    @12,DUMYVLSQ+1(,@11)                                0627 01015000
         STC   @12,JCTVOLSQ(,@09)                                  0627 01016000
*     END;                                                         0628 01017000
*   CSCBPTR=LCTQDRTY;               /* ADDRESSABILITY FOR CSCB       */ 01018000
@RF00624 L     @12,LCTPTR                                          0629 01019000
         L     @12,LCTQDRTY(,@12)                                  0629 01020000
         ST    @12,CSCBPTR                                         0629 01021000
*   OPENECB=ZEROPTR;                /* ZERO ECB                      */ 01022000
         SLR   @12,@12                                             0630 01023000
         ST    @12,OPENECB                                         0630 01024000
*   ECB610=ZEROPTR;                 /* INITIALIZE IEFXB610'S ECB     */ 01025000
         SLR   @12,@12                                             0631 01026000
         ST    @12,ECB610                                          0631 01027000
*   ECBC1=ZEROPTR;                  /* ZERO ECB FOR WAIT IN SCTXPROC */ 01028000
         SLR   @12,@12                                             0632 01029000
         ST    @12,ECBC1                                           0632 01030000
*   ADECBC1=ADDR(ECBC1);            /* ADDR ECB INTO LIST FOR 610    */ 01031000
         LA    @12,ECBC1                                           0633 01032000
         ST    @12,ADECBC1                                         0633 01033000
*   ADECB610=ADDR(ECB610);          /* SET ECB ADDR INTO PARM LIST   */ 01034000
         LA    @12,ECB610                                          0634 01035000
         ST    @12,ADECB610                                        0634 01036000
*   ADOKECB=ADDR(OPENECB);          /* SET UP ECBLIST ADDRESSES      */ 01037000
         LA    @12,OPENECB                                         0635 01038000
         ST    @12,ADOKECB                                         0635 01039000
*   ADCANECB=ADDR(CHCECB);          /* "                             */ 01040000
         L     @12,CSCBPTR                                         0636 01041000
         LA    @12,CHCECB(,@12)                                    0636 01042000
         ST    @12,ADCANECB                                        0636 01043000
*   HIORD=ON;                       /* TURN ON LAST ENTRY IN LIST BIT*/ 01044000
         OI    HIORD,B'10000000'                                   0637 01045000
*   RESPECIFY                                                      0638 01046000
*     R1 RESTRICTED;                                               0638 01047000
*   R1=ADDR(PARM610);               /* PASS ADDR OF LIST TO 610      */ 01048000
         LA    R1,PARM610                                          0639 01049000
*   GEN DATA DEFS(ATT610);                                         0640 01050000
*   GEN DATA DEFS(ATT6101,LENALIST);                               0641 01051000
*   ATT610(1:LENALIST)=ATT6101(1:LENALIST);/* COPY TO AUTO STOR      */ 01052000
         L     @12,LENALIST                                        0642 01053000
         BCTR  @12,0                                               0642 01054000
         EX    @12,@SM04560                                        0642 01055000
*   NAMPTR=(ADDR(ATT610)+NAMOFSET);                                0643 01056000
         LA    @12,ATT610                                          0643 01057000
         AL    @12,@CF03876                                        0643 01058000
         ST    @12,NAMPTR                                          0643 01059000
*   ECBATT=ADECBC1;                 /* INSERT ECBADDR FOR ATTACH     */ 01060000
         L     @12,ADECBC1                                         0644 01061000
         ST    @12,ECBATT                                          0644 01062000
*   GEN(ATTACH SF=(E,ATT610));                                     0645 01063000
         ATTACH SF=(E,ATT610)                                           01064000
*   SAVETCB=R1;                     /* REMEMBER WHO TO DETACH        */ 01065000
         ST    R1,SAVETCB                                          0646 01066000
*   GENERATE;                                                      0647 01067000
         WAIT ECBLIST=ECBLIST1                                          01068000
*   RESPECIFY                                                      0648 01069000
*     R1 UNRESTRICTED;                                             0648 01070000
*   IF CANPOST=ON THEN                                             0649 01071000
         L     @12,CSCBPTR                                         0649 01072000
         TM    CANPOST(@12),B'01000000'                            0649 01073000
         BNO   @RF00649                                            0649 01074000
*     DO;                           /* CANCEL WAS ISSUED             */ 01075000
*       DO;                         /* DETACH (SAVETCB)              */ 01076000
*         RESPECIFY                                                0652 01077000
*          (GPR01P) RESTRICTED;                                    0652 01078000
*         GPR01P=ADDR(SAVETCB);     /* TCB ADDRESS                   */ 01079000
         LA    GPR01P,SAVETCB                                      0653 01080000
*         SVC(62);                  /* DETACH SVC                    */ 01081000
         SVC   62                                                  0654 01082000
*         RESPECIFY                                                0655 01083000
*          (GPR01P) UNRESTRICTED;                                  0655 01084000
*       END;                        /* DETACH (SAVETCB)      @YM08127*/ 01085000
*       STAENTR=ON;                 /* SIGNAL CANPROC NO DETACH    0657 01086000
*                                                            @YM08127*/ 01087000
         OI    STAENTR,B'10000000'                                 0657 01088000
*       CALL CANPROC;               /* EXIT TO INIT - FLUSH  @YM08127*/ 01089000
         BAL   @14,CANPROC                                         0658 01090000
*     END;                                                         0659 01091000
*   TCBJSCB->JSCBACT=SAVEJSCB;      /* RESTORE PP JSCB               */ 01092000
@RF00649 L     @12,TCBPTR                                          0660 01093000
         L     @12,TCBJSCB(,@12)                                   0660 01094000
         L     @11,SAVEJSCB                                        0660 01095000
         ST    @11,JSCBACT(,@12)                                   0660 01096000
*   IF POST610=ON THEN              /* 610 TOOK A DIVE               */ 01097000
         TM    POST610,B'01000000'                                 0661 01098000
         BNO   @RF00661                                            0661 01099000
*     CALL CANPROC;                                                0662 01100000
         BAL   @14,CANPROC                                         0662 01101000
*   IF GOODOPEN^=ON THEN                                           0663 01102000
@RF00661 TM    GOODOPEN,B'00010000'                                0663 01103000
         BO    @RF00663                                            0663 01104000
*     CALL ERR32;                   /* OPEN NO GOOD                  */ 01105000
         BAL   @14,ERR32                                           0664 01106000
*   IF DSABCKVL=NOTON THEN                                         0665 01107000
@RF00663 L     @12,DSABPTR                                         0665 01108000
         TM    DSABCKVL(@12),B'01000000'                           0665 01109000
         BNZ   @RF00665                                            0665 01110000
*     CALL SCRTYERR;                /* DO NOT ALLOW RESTART IF OPEN     01111000
*                                      FOUND THE CKPT D.S. TO BE NOT    01112000
*                                      SECURE.                       */ 01113000
         BAL   @14,SCRTYERR                                        0666 01114000
*   IF PARTBIT=ON THEN              /* IF DATASET IS PARTITIONED...  */ 01115000
@RF00665 TM    PARTBIT,B'00000010'                                 0667 01116000
         BNO   @RF00667                                            0667 01117000
*     DO;                                                          0668 01118000
*       CKMEMNM=JCTCKIDT;           /* MEMBER FOR FIND       @YM06573*/ 01119000
         L     @12,JCTPTR                                          0669 01120000
         MVC   CKMEMNM(8),JCTCKIDT(@12)                            0669 01121000
*       GEN( FIND (DCBREG),CKMEMNM,D);                             0670 01122000
          FIND (DCBREG),CKMEMNM,D                                       01123000
*       IF RCODE^=ZEROPTR THEN                                     0671 01124000
         LTR   RCODE,RCODE                                         0671 01125000
         BZ    @RF00671                                            0671 01126000
*         CALL ERR33;                                              0672 01127000
         BAL   @14,ERR33                                           0672 01128000
*     END;                                                         0673 01129000
@RF00671 DS    0H                                                  0674 01130000
*   DO;                             /* MODESET KEYADDR(SAVEKEYA)     */ 01131000
@RF00667 DS    0H                                                  0675 01132000
*     SPKA(SAVEKEYA);               /* SET PSW KEY                   */ 01133000
         SLR   @12,@12                                             0675 01134000
         IC    @12,SAVEKEYA                                        0675 01135000
         SPKA  0(@12)                                              0675 01136000
*   END;                            /* MODESET KEYADDR(SAVEKEYA) KEY    01137000
*                                      BACK TO SCHED                 */ 01138000
*   END OPENCHEK;                                                  0677 01139000
@EL00005 DS    0H                                                  0677 01140000
@EF00005 DS    0H                                                  0677 01141000
@ER00005 LM    @14,@12,@SA00005                                    0677 01142000
         BR    @14                                                 0677 01143000
*RNAMEPGM:                                                         0678 01144000
*   PROC;                                                          0678 01145000
*                                                                  0678 01146000
RNAMEPGM STM   @14,@12,@SA00006                                    0678 01147000
*/**************************************************************     */ 01148000
*/* THE PURPOSES OF THIS PROCEDURE ARE:                              */ 01149000
*/*       TO INSURE THE PROPER SCT STRUCTURE - FOR DEFERRED          */ 01150000
*/*       RESTART, THE DUMMY SCT IS REMOVED FROM THE CHAIN.          */ 01151000
*/*                                                                  */ 01152000
*/*       A BIT IS SET IN THE LCT TO INFORM IEFSD101         @ZA19269*/ 01153000
*/*       TO CHANGE THE SCT PROGRAM NAME TO 'IEFRSTRT TO INSURE      */ 01154000
*/*       THAT THE RESTART SVC GAINS CONTROL WHEN THE JOB IS         */ 01155000
*/*       INITIATED.                                                 */ 01156000
*/*       THE NAME IS CHANGED BY IEFSD101 AFTER PPT          @ZA19269*/ 01157000
*/*       PROCESSING USING THE REAL PROGRAM NAME THAT        @ZA19269*/ 01158000
*/*       WILL BE RESTARTED.                                 @ZA19269*/ 01159000
*/**************************************************************     */ 01160000
*                                                                  0679 01161000
*   SWVA=JCTSSTR;                   /* SET UP TO READ 1ST SCT        */ 01162000
         L     @12,SWEPAPTR                                        0679 01163000
         L     @11,JCTPTR                                          0679 01164000
         MVC   SWVA(3,@12),JCTSSTR(@11)                            0679 01165000
*   CALL READSWA;                   /* READ 1ST SCT                  */ 01166000
         BAL   @14,READSWA                                         0680 01167000
*   SCTPTR=SWBLKPTR;                /* ADDRESSABILITY FOR SCT        */ 01168000
         L     @12,SWEPAPTR                                        0681 01169000
         L     @11,SWBLKPTR(,@12)                                  0681 01170000
         ST    @11,SCTPTR                                          0681 01171000
*   IF RESTYPE=ON THEN              /* FOR DEFERRED RESTARTS CHAIN   */ 01172000
         TM    RESTYPE,B'10000000'                                 0682 01173000
         BNO   @RF00682                                            0682 01174000
*     DO;                           /* AROUND DSDRP STEP SCT         */ 01175000
*       LCTSCTVA=SCTANSCT;          /* SET LCT CURRENT SCT PTR TO  0684 01176000
*                                      PROB PGM SCT.                 */ 01177000
         L     @09,LCTPTR                                          0684 01178000
         MVC   LCTSCTVA(3,@09),SCTANSCT(@11)                       0684 01179000
*       JCTSSTR=SCTANSCT;           /* POINT JCT TO PP SCT           */ 01180000
         L     @09,JCTPTR                                          0685 01181000
         MVC   JCTSSTR(3,@09),SCTANSCT(@11)                        0685 01182000
*       JCTSDKAD=SCTANSCT;          /* POINT JCT TO PP SCT           */ 01183000
         MVC   JCTSDKAD(3,@09),SCTANSCT(@11)                       0686 01184000
*       SWVA=SCTANSCT;              /* SET UP TO READ PP SCT         */ 01185000
         MVC   SWVA(3,@12),SCTANSCT(@11)                           0687 01186000
*       CALL READSWA;               /* READ PP SCT                   */ 01187000
         BAL   @14,READSWA                                         0688 01188000
*       LCTSCTAD=SWBLKPTR;          /* SET LCT INCORE SCT PTR        */ 01189000
         L     @12,SWEPAPTR                                        0689 01190000
         L     @12,SWBLKPTR(,@12)                                  0689 01191000
         L     @11,LCTPTR                                          0689 01192000
         ST    @12,LCTSCTAD(,@11)                                  0689 01193000
*       SCTPTR=SWBLKPTR;            /* ADDRESSABILITY FOR PP SCT     */ 01194000
         ST    @12,SCTPTR                                          0690 01195000
*     END;                                                         0691 01196000
*   SCTGOSTP=NOTON;                 /* TURN OFF GOSTEP *. REFERBACKS */ 01197000
@RF00682 L     @12,SCTPTR                                          0692 01198000
         NI    SCTGOSTP(@12),B'01111111'                           0692 01199000
*   LCTCKRST=ON;                    /* TELL IEFSD101 TO RENAME     0693 01200000
*                                      SCTPGMNM TO IEFRSTRT SO     0693 01201000
*                                      RESTART SVC WILL GET CONTROL     01202000
*                                      TO COMPLETE RESTART         0693 01203000
*                                      PROCESSING.           @ZA19269*/ 01204000
         L     @12,LCTPTR                                          0693 01205000
         OI    LCTCKRST(@12),B'00100000'                           0693 01206000
*   END RNAMEPGM;                                                  0694 01207000
@EL00006 DS    0H                                                  0694 01208000
@EF00006 DS    0H                                                  0694 01209000
@ER00006 LM    @14,@12,@SA00006                                    0694 01210000
         BR    @14                                                 0694 01211000
*                                                                  0695 01212000
*/* LINES 284400 THROUGH 288600 DELETED               @YMO4288       */ 01213000
*                                                                  0695 01214000
*CHRPROC:                                                          0695 01215000
*   PROC OPTIONS(NOSAVE(IOBUFAD));                                 0695 01216000
*                                                                  0695 01217000
CHRPROC  STM   @14,@06,@SA00007                                    0695 01218000
         STM   @08,@12,@SA00007+36                                 0695 01219000
*/**************************************************************     */ 01220000
*/* PURPOSE:   TO PROCESS PERTINENT INFORMATION IN THE               */ 01221000
*/*            CHECKPOINT HEADER RECORD AND SAVE THE CHR FOR         */ 01222000
*/*            INCLUSION IN THE RESTART PARAMETER LIST.              */ 01223000
*/**************************************************************     */ 01224000
*                                                                  0696 01225000
*   DCL                                                            0696 01226000
*     CHRMATCH BIT(1);                                             0696 01227000
*   DCL                                                            0697 01228000
*     FOURC FIXED(15) CONSTANT(400);                               0697 01229000
*   DCL                                                            0698 01230000
*     RECLEN FIXED(15) DEFINED(DCBLRECL);                          0698 01231000
*   READCHR=ON;                     /* INDICATE CHRPROC TO READCHEK  */ 01232000
         OI    READCHR,B'10000000'                                 0699 01233000
*   IOBUFAD=ADDR(IOBUF);            /* INITIALIZE PTR FOR 1ST READ   */ 01234000
         LA    IOBUFAD,IOBUF                                       0700 01235000
*   CHRPTR=IOBUFAD;                 /* ADDRESSABILITY FOR CHR        */ 01236000
         ST    IOBUFAD,CHRPTR                                      0701 01237000
*   CHRCHKID=BLANKS;                /* INSURE NO RANDOM MATCH...     */ 01238000
         L     @12,CHRPTR                                          0702 01239000
         MVI   CHRCHKID+8(@12),C' '                                0702 01240000
         MVC   CHRCHKID+9(7,@12),CHRCHKID+8(@12)                   0702 01241000
         MVC   CHRCHKID(8,@12),@CC03776                            0702 01242000
*   CHRMATCH=NOTON;                 /*                       @YM08138*/ 01243000
         NI    CHRMATCH,B'01111111'                                0703 01244000
*   DCBREG=ADDR(DCBCKPT);           /* INIT DCB ADDR         @YM08138*/ 01245000
         LA    DCBREG,DCBCKPT                                      0704 01246000
*   DO WHILE CHRMATCH^=ON;          /* SCAN DATA SET UNTIL CHECKID   */ 01247000
         B     @DE00705                                            0705 01248000
@DL00705 DS    0H                                                  0706 01249000
*     CALL READCHEK;                /* MATCHES THE ONE SPECIFIED ON     01250000
*                                      THE USERS JCT PARAMETER       */ 01251000
         BAL   @14,READCHEK                                        0706 01252000
*     CHRPTR=IOBUFAD;               /* RE-INITIALIZE BUFFER POINTER  */ 01253000
         ST    IOBUFAD,CHRPTR                                      0707 01254000
*     IF(CHRCHKID=JCTCKIDT&RECLEN=FOURC) THEN/*              @YM08138*/ 01255000
         L     @12,CHRPTR                                          0708 01256000
         L     @11,JCTPTR                                          0708 01257000
         CLC   CHRCHKID(16,@12),JCTCKIDT(@11)                      0708 01258000
         BNE   @RF00708                                            0708 01259000
         CLC   RECLEN(2),@CH04201                                  0708 01260000
         BNE   @RF00708                                            0708 01261000
*       CHRMATCH=ON;                                               0709 01262000
         OI    CHRMATCH,B'10000000'                                0709 01263000
*   END;                                                           0710 01264000
@RF00708 DS    0H                                                  0710 01265000
@DE00705 TM    CHRMATCH,B'10000000'                                0710 01266000
         BNO   @DL00705                                            0710 01267000
*   GDAPTR=CVTGDA;                  /* ADDRESSABILITY FOR GDA        */ 01268000
         LA    @12,16                                              0711 01269000
         L     @12,CVTPTR(,@12)                                    0711 01270000
         L     @12,CVTGDA(,@12)                                    0711 01271000
         ST    @12,GDAPTR                                          0711 01272000
*   IF CHRPPM<PASTRT THEN           /* DO NOT ALLOW PROB PROG TO     */ 01273000
         L     @11,CHRPTR                                          0712 01274000
         CLC   CHRPPM(4,@11),PASTRT(@12)                           0712 01275000
         BNL   @RF00712                                            0712 01276000
*     CALL ADDRERR;                 /* RESTART AT AN ADDRESS THAT  0713 01277000
*                                      LIES BELOW AN EXPANDED NUC.   */ 01278000
         BAL   @14,ADDRERR                                         0713 01279000
*   IF(RESTYPE=NOTON                /* IF RESTART IS AUTOMATIC AND   */ 01280000
*       &JCTSYSCK=NOTON)            /* NOT AUTO AFTER DEFERRED, THEN */ 01281000
*     THEN                                                         0714 01282000
@RF00712 TM    RESTYPE,B'10000000'                                 0714 01283000
         BNZ   @RF00714                                            0714 01284000
         L     @12,JCTPTR                                          0714 01285000
         TM    JCTSYSCK(@12),B'10000000'                           0714 01286000
         BNZ   @RF00714                                            0714 01287000
*     AUTRSTRT=ON;                  /* TURN ON AUTO FLAG IN CHR......   01288000
*                                      ...WHICH BECOMES RESTART PLIST*/ 01289000
         L     @12,CHRPTR                                          0715 01290000
         OI    AUTRSTRT(@12),B'10000000'                           0715 01291000
*   JCTNRCKP=CHRCOUNT;              /* SAVE NUMBER OF CKPTS IN JCT   */ 01292000
@RF00714 L     @12,CHRPTR                                          0716 01293000
         L     @11,JCTPTR                                          0716 01294000
         MVC   JCTNRCKP(2,@11),CHRCOUNT(@12)                       0716 01295000
*   IF VEQRUSER=ON THEN             /* FORCE USER TO V = R IF V = R  */ 01296000
         TM    VEQRUSER(@12),B'00001000'                           0717 01297000
         BNO   @RF00717                                            0717 01298000
*     EAADDRBT=ON;                  /* WAS ORIGINALLY SPECIFIED.     */ 01299000
         L     @12,SCTPTR                                          0718 01300000
         OI    EAADDRBT(@12),B'10000000'                           0718 01301000
*   SCTMSADR=CHRPPM;                /* SET PP START ADDR FOR INIT    */ 01302000
@RF00717 L     @12,SCTPTR                                          0719 01303000
         L     @11,CHRPTR                                          0719 01304000
         MVC   SCTMSADR(4,@12),CHRPPM(@11)                         0719 01305000
*   CHRPPEK=(CHRPPE+KROUND)/KBOUND; /* CONVERT CHECKPOINTED SIZE TO     01306000
*                                      'K' BOUNDARY.                 */ 01307000
         LA    @00,1023                                            0720 01308000
         ICM   @09,15,CHRPPE(@11)                                  0720 01309000
         ALR   @00,@09                                             0720 01310000
         SRDA  @00,32                                              0720 01311000
         D     @00,@CF04089                                        0720 01312000
         STH   @01,CHRPPEK                                         0720 01313000
*   IF CHRPPEK>SCTMSSZE THEN        /* GIVE THE USER THE GREATEST    */ 01314000
         CH    @01,SCTMSSZE(,@12)                                  0721 01315000
         BNH   @RF00721                                            0721 01316000
*     SCTMSSZE=CHRPPEK;             /* REGION SIZE USED. THIS ALLOWS    01317000
*                                      GREATER SIZE SPEC. ON RESTART    01318000
*                                      JCL.                          */ 01319000
         STH   @01,SCTMSSZE(,@12)                                  0722 01320000
*   SAVEDD=CHRDDNM;                 /* PREPARE FOR AUTO AFTER DEF    */ 01321000
@RF00721 L     @12,CHRPTR                                          0723 01322000
         MVC   SAVEDD(8),CHRDDNM(@12)                              0723 01323000
*   CHRSAVE=IHJCHR;                 /* SAVE CHR AS PART OF RESTART 0724 01324000
*                                      PARAMETER LIST                */ 01325000
         MVC   CHRSAVE(45),IHJCHR(@12)                             0724 01326000
*   READCHR=NOTON;                  /* INDICATE NOT CHR TO READCHEK  */ 01327000
         NI    READCHR,B'01111111'                                 0725 01328000
*   END CHRPROC;                                                   0726 01329000
@EL00007 DS    0H                                                  0726 01330000
@EF00007 DS    0H                                                  0726 01331000
@ER00007 LM    @14,@06,@SA00007                                    0726 01332000
         LM    @08,@12,@SA00007+36                                 0726 01333000
         BR    @14                                                 0726 01334000
*DDNTPROC:                                                         0727 01335000
*   PROC OPTIONS(NOSAVE(IOBUFAD));                                 0727 01336000
*                                                                  0727 01337000
DDNTPROC STM   @14,@06,@SA00008                                    0727 01338000
         STM   @08,@12,@SA00008+36                                 0727 01339000
*/**************************************************************     */ 01340000
*/*  THIS ROUTINE WILL READ THE DDNTS (IF ANY) FROM THE CKPT DS      */ 01341000
*/*     AND CHAIN AROUND THE SIOTS FOR DDNAMES FOUND IN THE          */ 01342000
*/*     DDNT.  AN INTERFACE TO THE DATASET RESERVATION ROUTINE       */ 01343000
*/*     WILL BE MADE TO UPDATE THE DATA SET ENQUEUE TABLE.           */ 01344000
*/*     REMAINING SIOTS WILL BE SCANNED TO SEE IF ANY REQUEST        */ 01345000
*/*     UNIT AFFINITY TO THE ONE BEING REMOVED.  THESE SIOTS WILL    */ 01346000
*/*     BE MARKED WITH THE REQUESTED NUMBER AS ZERO. THIS WILL       */ 01347000
*/*     INDICATE TO THE UTYPPROC THAT AFFINITY IS NOT ALLOWED.       */ 01348000
*/*     ALSO, IF THE REMAINING SIOTS HAVE A REQUEST FOR AFFINITY     */ 01349000
*/*      TO A DD NUMBER GREATER THAN THE ONE BEING REMOVED, THAT     */ 01350000
*/*     NUMBER WILL BE DECREMENTED BY ONE.                           */ 01351000
*/**************************************************************     */ 01352000
*/**************************************                             */ 01353000
*/* PREPARE THE PARM LIST FOR THE DATA                               */ 01354000
*/* SET RESERVATION ROUTINE (DSENQ).                                 */ 01355000
*/**************************************                             */ 01356000
*                                                                  0728 01357000
*   DCL                                                            0728 01358000
*     ALIASDSN CHAR(44);            /* HOLDER FOR ALIAS NAME FROM  0728 01359000
*                                      JFCBX                         */ 01360000
*   DCL                                                            0729 01361000
*     PHAZ3SW BIT(1);               /* INTERNAL FLAG                 */ 01362000
*   BITMAP=''B;                     /* INIT FUNCTION TO ZERO         */ 01363000
         XC    BITMAP(2),BITMAP                                    0730 01364000
*   DELEONLY=ON;                    /* FUNCTION = DELETE BUT NOT DEQ */ 01365000
         OI    DELEONLY,B'00010000'                                0731 01366000
*   PASSJCT=JCTPTR;                 /* SET INCORE JCT POINTER        */ 01367000
         L     @12,JCTPTR                                          0732 01368000
         ST    @12,PASSJCT                                         0732 01369000
*   DSNLEN=HEX2C;                   /* DATASET LENGTH = 44           */ 01370000
         MVC   DSNLEN(2),@CH03031                                  0733 01371000
*   PASSEPA=EPAPTR;                 /* PASS NONZERO EPAPTR   @ZA12430*/ 01372000
         L     @12,EPAPTR                                          0734 01373000
         ST    @12,PASSEPA                                         0734 01374000
*   PASSTCB=ZEROPTR;                /* N/A                           */ 01375000
         SLR   @12,@12                                             0735 01376000
         ST    @12,PASSTCB                                         0735 01377000
*   STEPNO=SCTSNUMB;                /* SET STEP NUMBER               */ 01378000
         L     @11,SCTPTR                                          0736 01379000
         IC    @09,SCTSNUMB(,@11)                                  0736 01380000
         STC   @09,STEPNO                                          0736 01381000
*   PAD12=ZEROPTR;                  /* N/A                           */ 01382000
         STCM  @12,15,PAD12                                        0737 01383000
*   PAD13=ZEROPTR;                  /* N/A                           */ 01384000
         STCM  @12,15,PAD13                                        0738 01385000
*   PAD2=ZEROPTR;                   /* N/A                           */ 01386000
         ST    @12,PAD2                                            0739 01387000
*   RETPARM=ZEROPTR;                /* RETURN CODE AREA              */ 01388000
         ST    @12,RETPARM                                         0740 01389000
*/*     END OF DSENQ INITIALIZATION                                  */ 01390000
*                                                                  0741 01391000
*   REALADD=LENGTH(SWAPFX);         /* CONSTANT FOR ADDR TRANSLATION */ 01392000
         MVC   REALADD(3),@CF00052+1                               0741 01393000
*   DDNTPTR=IOBUFAD;                /* ADRESSABILITY FOR DDNT WHEN 0742 01394000
*                                      READ                          */ 01395000
         ST    IOBUFAD,DDNTPTR                                     0742 01396000
*   LOOPCTR=NOTON;                  /* SWITCH FOR LOOP CONTROL       */ 01397000
         NI    LOOPCTR,B'01111111'                                 0743 01398000
*   DO WHILE LOOPCTR=NOTON;                                        0744 01399000
         B     @DE00744                                            0744 01400000
@DL00744 DS    0H                                                  0745 01401000
*     CALL READCHEK;                /* READ POSSIBLE DDNT            */ 01402000
         BAL   @14,READCHEK                                        0745 01403000
*     DDNTPTR=IOBUFAD;              /* RESET BUFFER POINTER          */ 01404000
         ST    IOBUFAD,DDNTPTR                                     0746 01405000
*     IF DDNTIDNT^=ONEHEX THEN      /* THIS IS NOT A DDNT            */ 01406000
         L     @12,DDNTPTR                                         0747 01407000
         CLC   DDNTIDNT(2,@12),@CH02945                            0747 01408000
         BE    @RF00747                                            0747 01409000
*       LOOPCTR=ON;                 /* NO DDNT PROCESSING TO BE DONE.   01410000
*                                      STOP THE LOOP.                */ 01411000
         OI    LOOPCTR,B'10000000'                                 0748 01412000
*     ELSE                                                         0749 01413000
*       DO;                                                        0749 01414000
         B     @RC00747                                            0749 01415000
@RF00747 DS    0H                                                  0750 01416000
*         DO INDEX=1 TO DDNTUSCT-1;                                0750 01417000
         LA    @12,1                                               0750 01418000
         B     @DE00750                                            0750 01419000
@DL00750 DS    0H                                                  0751 01420000
*           CALL DDNTSIOT;          /* DDNTSIOT WILL SEARCH FOR THE     01421000
*                                      SIOT THAT MATCHES THE DDNAME     01422000
*                                      IN THE DDNT, CHAIN AROUND IT,    01423000
*                                      AND RETURN A POINTER TO IT.   */ 01424000
         BAL   @14,DDNTSIOT                                        0751 01425000
*           IF SIOTSIOT^=ZEROPTR THEN                              0752 01426000
         L     @12,SIOTSIOT-1                                      0752 01427000
         LA    @12,0(,@12)                                         0752 01428000
         LTR   @12,@12                                             0752 01429000
         BZ    @RF00752                                            0752 01430000
*             DO;                                                  0753 01431000
*               SIOTPTR=(SIOTSIOT+REALADD);/* TRANSLAT SWAADD        */ 01432000
*                                                                  0754 01433000
         L     @11,REALADD-1                                       0754 01434000
         LA    @11,0(,@11)                                         0754 01435000
         ALR   @11,@12                                             0754 01436000
         ST    @11,SIOTPTR                                         0754 01437000
*               /*****************************************************/ 01438000
*               /*                                                   */ 01439000
*               /* THE FOLLOWING CODE SCANS FOR UNIT AFFINITY        */ 01440000
*               /* REQUESTS AND UPDATES THE SIOTS TO REFLECT THE     */ 01441000
*               /* REMOVAL OF A SIOT FROM THE CHAIN.                 */ 01442000
*               /*                                                   */ 01443000
*               /*****************************************************/ 01444000
*                                                                  0755 01445000
*               IF SIOTSIOT^=PREVLAST THEN/* DONT SEARCH FURTHER IF     01446000
*                                      THE ONE REMOVED WAS THE LAST     01447000
*                                      ONE.                          */ 01448000
         C     @12,PREVLAST                                        0755 01449000
         BE    @RF00755                                            0755 01450000
*                 DO;                                              0756 01451000
*                   TEMPSW=ON;      /* LOOP CONTROL                  */ 01452000
         OI    TEMPSW,B'10000000'                                  0757 01453000
*                   TEMPPTR=SCTPSIOT;/* PICK UP PTR TO NEXT SIOT     */ 01454000
         MVC   TEMPPTR(3),SCTPSIOT(@11)                            0758 01455000
*                   DO WHILE TEMPSW=ON;                            0759 01456000
         B     @DE00759                                            0759 01457000
@DL00759 DS    0H                                                  0760 01458000
*                     IF TEMPPTR=SCTLSIOT THEN/* CLOSE LOOP AFTER  0760 01459000
*                                      EXAMINING                     */ 01460000
         L     @12,SCTPTR                                          0760 01461000
         CLC   TEMPPTR(3),SCTLSIOT(@12)                            0760 01462000
         BNE   @RF00760                                            0760 01463000
*                       TEMPSW=NOTON;/* LAST SIOT IN CHAIN           */ 01464000
         NI    TEMPSW,B'01111111'                                  0761 01465000
*                     TEMPPTR=TEMPPTR+REALADD;/* TEMPORARY SWA     0762 01466000
*                                      ADDRESSABILITY                */ 01467000
@RF00760 L     @12,TEMPPTR-1                                       0762 01468000
         LA    @12,0(,@12)                                         0762 01469000
         L     @11,REALADD-1                                       0762 01470000
         LA    @11,0(,@11)                                         0762 01471000
         ALR   @12,@11                                             0762 01472000
         STCM  @12,7,TEMPPTR                                       0762 01473000
*                     IF TEMPPTR->SIOTUNAF=SCTDDINO THEN/* ON EQUAL     01474000
*                                      COMPARE                       */ 01475000
         L     @11,SIOTPTR                                         0763 01476000
         CLC   SIOTUNAF(2,@12),SCTDDINO(@11)                       0763 01477000
         BNE   @RF00763                                            0763 01478000
*                       TEMPPTR->SIOTUNAF=0;/* SET THE REQUESTED   0764 01479000
*                                      NUMBER TO 0 FOR UTYPPROC.     */ 01480000
         SLR   @11,@11                                             0764 01481000
         STH   @11,SIOTUNAF(,@12)                                  0764 01482000
*                     ELSE                                         0765 01483000
*                       IF TEMPPTR->SIOTUNAF>SCTDDINO THEN/* FOR   0765 01484000
*                                      OTHER                         */ 01485000
         B     @RC00763                                            0765 01486000
@RF00763 L     @12,TEMPPTR-1                                       0765 01487000
         LA    @12,0(,@12)                                         0765 01488000
         LH    @11,SIOTUNAF(,@12)                                  0765 01489000
         L     @09,SIOTPTR                                         0765 01490000
         CH    @11,SCTDDINO(,@09)                                  0765 01491000
         BNH   @RF00765                                            0765 01492000
*                         TEMPPTR->SIOTUNAF=/* REQUESTS, DECREMENT 0766 01493000
*                                      THE                           */ 01494000
*                             TEMPPTR->SIOTUNAF-ONEHEX;/* NUMBER SO     01495000
*                                      THAT WHEN THE DD ENTRIES ARE     01496000
*                                      RENUMBERED THE PROPER AFFINITY   01497000
*                                      IS MADE.                      */ 01498000
         BCTR  @11,0                                               0766 01499000
         STH   @11,SIOTUNAF(,@12)                                  0766 01500000
*                     TEMPPTR=TEMPPTR->SCTPSIOT;/* GET NEXT  @YM07549*/ 01501000
@RF00765 DS    0H                                                  0767 01502000
@RC00763 L     @12,TEMPPTR-1                                       0767 01503000
         SLR   @11,@11                                             0767 01504000
         ICM   @11,7,SCTPSIOT(@12)                                 0767 01505000
         STCM  @11,7,TEMPPTR                                       0767 01506000
*                   END;                                           0768 01507000
@DE00759 TM    TEMPSW,B'10000000'                                  0768 01508000
         BO    @DL00759                                            0768 01509000
*                 END;                                             0769 01510000
*               SWVA=SCTPJFCB;      /* PREPARE TO READ JFCB          */ 01511000
@RF00755 L     @12,SWEPAPTR                                        0770 01512000
         L     @11,SIOTPTR                                         0770 01513000
         MVC   SWVA(3,@12),SCTPJFCB(@11)                           0770 01514000
*               CALL READSWA;       /* READ JFCB                     */ 01515000
         BAL   @14,READSWA                                         0771 01516000
*               JFCBPTR=SWBLKPTR;   /* ADDRESSABILITY JFCB           */ 01517000
         L     @12,SWEPAPTR                                        0772 01518000
         L     @12,SWBLKPTR(,@12)                                  0772 01519000
         ST    @12,JFCBPTR                                         0772 01520000
*               DSN=JFCBDSNM;       /* DSNAME TO DSENQ LIST          */ 01521000
         MVC   DSN(44),JFCBDSNM(@12)                               0773 01522000
*/*************************************************************      */ 01523000
*/* THE FOLLOWING SECTION OF CODE LOOPS THROUGH THE                  */ 01524000
*/*     SIOTS TO DETERMINE IF THERE ARE ANY MORE ENTRIES THAT        */ 01525000
*/*     REQUIRE THE SAME DATASET THAT WAS REFERENCED ON THE          */ 01526000
*/*     DD ENTRY THAT WAS JUST REMOVED. IF ANOTHER ENTRY             */ 01527000
*/*     NEEDS THE DATASET, THE CALL TO IEFAB4DC TO REMOVE THE        */ 01528000
*/*     DATASET FROM THE DSENQ TABLE WILL NOT BE MADE.               */ 01529000
*/*************************************************************      */ 01530000
*                                                                  0774 01531000
*               SIOT2ADD=SCTFSIOT;  /* PICK UP ADDR OF FIRST SIOT ON    01532000
*                                      THE CHAIN             @YM08192*/ 01533000
         L     @12,SCTPTR                                          0774 01534000
         SLR   @11,@11                                             0774 01535000
         ICM   @11,7,SCTFSIOT(@12)                                 0774 01536000
         ST    @11,SIOT2ADD                                        0774 01537000
*               IF SIOT2ADD=SCTLSIOT THEN/* DONT SEARCH PAST THE LAST   01538000
*                                      SIOT                  @YM08192*/ 01539000
         SLR   @09,@09                                             0775 01540000
         ICM   @09,7,SCTLSIOT(@12)                                 0775 01541000
         CR    @11,@09                                             0775 01542000
         BNE   @RF00775                                            0775 01543000
*                 SIOT2ADD=ZEROPTR; /* INDICATE NO MATCH             */ 01544000
         SLR   @12,@12                                             0776 01545000
         ST    @12,SIOT2ADD                                        0776 01546000
*               ELSE                                               0777 01547000
*                 DO;                                              0777 01548000
         B     @RC00775                                            0777 01549000
@RF00775 DS    0H                                                  0778 01550000
*                   SIOT2ADD=(SIOT2ADD+REALADD)->SCTPSIOT;/* @YM08191*/ 01551000
         L     @12,REALADD-1                                       0778 01552000
         LA    @12,0(,@12)                                         0778 01553000
         AL    @12,SIOT2ADD                                        0778 01554000
         SLR   @11,@11                                             0778 01555000
         ICM   @11,7,SCTPSIOT(@12)                                 0778 01556000
         ST    @11,SIOT2ADD                                        0778 01557000
*                   PHAZ2SW=NOTON;  /* LOOP CONTROL                  */ 01558000
         NI    PHAZ2SW,B'01111111'                                 0779 01559000
*                   DO WHILE PHAZ2SW=NOTON;                        0780 01560000
         B     @DE00780                                            0780 01561000
@DL00780 DS    0H                                                  0781 01562000
*                     SWVA=(SIOT2ADD+REALADD)->SCTPJFCB;/* PICK UP 0781 01563000
*                                      JFCBADD                       */ 01564000
         L     @12,REALADD-1                                       0781 01565000
         LA    @12,0(,@12)                                         0781 01566000
         AL    @12,SIOT2ADD                                        0781 01567000
         L     @11,SWEPAPTR                                        0781 01568000
         MVC   SWVA(3,@11),SCTPJFCB(@12)                           0781 01569000
*                     CALL READSWA; /* READ JFCB                     */ 01570000
         BAL   @14,READSWA                                         0782 01571000
*                     JFCBPTR=SWBLKPTR;/* ADDR'ABILITY FOR JFCB      */ 01572000
         L     @12,SWEPAPTR                                        0783 01573000
         L     @12,SWBLKPTR(,@12)                                  0783 01574000
         ST    @12,JFCBPTR                                         0783 01575000
*                     IF JFCBDSNM=DSN THEN                         0784 01576000
         CLC   JFCBDSNM(44,@12),DSN                                0784 01577000
         BNE   @RF00784                                            0784 01578000
*                       PHAZ2SW=ON; /* WHEN MATCH IS FOUND, LEAVE  0785 01579000
*                                      SIOT2ADD NONZERO AND TURN ON     01580000
*                                      THE LOOP CONTROL SWITCH       */ 01581000
         OI    PHAZ2SW,B'10000000'                                 0785 01582000
*                     ELSE                                         0786 01583000
*                       IF EVAL(SIOT2ADD+REALADD)->SIOALIAS=ON THEN/*   01584000
*                                      IF SIOT SAYS AN ALIAS EXISTS,    01585000
*                                      (THIS WILL ONLY BE TRUE FOR 0786 01586000
*                                      AUTO RESTART) GO COMPARE    0786 01587000
*                                      AGAINST THEALIAS TOO          */ 01588000
         B     @RC00784                                            0786 01589000
@RF00784 L     @12,SIOT2ADD                                        0786 01590000
         L     @11,REALADD-1                                       0786 01591000
         LA    @11,0(,@11)                                         0786 01592000
         LR    @09,@12                                             0786 01593000
         ALR   @09,@11                                             0786 01594000
         TM    SIOALIAS(@09),B'10000000'                           0786 01595000
         BNO   @RF00786                                            0786 01596000
*                         DO;                                      0787 01597000
*                           JFCBPTR=(SIOT2ADD+REALADD)->SCTPJFCB;  0788 01598000
         ALR   @12,@11                                             0788 01599000
         SLR   @09,@09                                             0788 01600000
         ICM   @09,7,SCTPJFCB(@12)                                 0788 01601000
         ST    @09,JFCBPTR                                         0788 01602000
*                           JFCBPTR=JFCBPTR+REALADD;               0789 01603000
         ALR   @09,@11                                             0789 01604000
         ST    @09,JFCBPTR                                         0789 01605000
*                           SWVA=JFCBEXAD;/* INIT FOR READ           */ 01606000
         L     @12,SWEPAPTR                                        0790 01607000
         MVC   SWVA(3,@12),JFCBEXAD(@09)                           0790 01608000
*                           CALL READSWA;/* DO THE READ              */ 01609000
         BAL   @14,READSWA                                         0791 01610000
*                           JFCBXPTR=SWBLKPTR;/* ADDRABILITY JFCBX   */ 01611000
         L     @12,SWEPAPTR                                        0792 01612000
         L     @12,SWBLKPTR(,@12)                                  0792 01613000
         ST    @12,JFCBXPTR                                        0792 01614000
*                           IF JFCBXNAM=DSN THEN/* IF NAME MATCHES,  */ 01615000
         CLC   JFCBXNAM(44,@12),DSN                                0793 01616000
         BNE   @RF00793                                            0793 01617000
*                             PHAZ2SW=ON;/* STOP THE LOOP WITH     0794 01618000
*                                      NONZERO SIOT ADDR             */ 01619000
         OI    PHAZ2SW,B'10000000'                                 0794 01620000
*                         END;                                     0795 01621000
*                       ELSE                                       0796 01622000
*                         DO;                                      0796 01623000
         B     @RC00786                                            0796 01624000
@RF00786 DS    0H                                                  0797 01625000
*                           IF SIOT2ADD=SCTLSIOT THEN/* ALL SIOTS  0797 01626000
*                                      SEARCHED BEFORE MATCH FOUND...*/ 01627000
         L     @12,SIOT2ADD                                        0797 01628000
         L     @11,SCTPTR                                          0797 01629000
         SLR   @09,@09                                             0797 01630000
         ICM   @09,7,SCTLSIOT(@11)                                 0797 01631000
         CR    @12,@09                                             0797 01632000
         BNE   @RF00797                                            0797 01633000
*                             DO;                                  0798 01634000
*                               SIOT2ADD=ZEROPTR;/* INDICATE NO MATCH*/ 01635000
         SLR   @12,@12                                             0799 01636000
         ST    @12,SIOT2ADD                                        0799 01637000
*                               PHAZ2SW=ON;/* STOP THE LOOP          */ 01638000
         OI    PHAZ2SW,B'10000000'                                 0800 01639000
*                             END;                                 0801 01640000
*                           ELSE                                   0802 01641000
*                             SIOT2ADD=(SIOT2ADD+REALADD)->SCTPSIOT;    01642000
         B     @RC00797                                            0802 01643000
@RF00797 L     @12,REALADD-1                                       0802 01644000
         LA    @12,0(,@12)                                         0802 01645000
         AL    @12,SIOT2ADD                                        0802 01646000
         SLR   @11,@11                                             0802 01647000
         ICM   @11,7,SCTPSIOT(@12)                                 0802 01648000
         ST    @11,SIOT2ADD                                        0802 01649000
*                                   /* GET LINK PTR                  */ 01650000
*                         END;                                     0803 01651000
@RC00797 DS    0H                                                  0804 01652000
*                   END;                                           0804 01653000
@RC00786 DS    0H                                                  0804 01654000
@RC00784 DS    0H                                                  0804 01655000
@DE00780 TM    PHAZ2SW,B'10000000'                                 0804 01656000
         BZ    @DL00780                                            0804 01657000
*                 END;                                             0805 01658000
*               IF SIOT2ADD=ZEROPTR THEN/* NO MATCH WAS FOUND FOR A     01659000
*                                      2ND USAGE OF THE DATASET. THE    01660000
*                                      DSENQ TABLE SHOULD BE UPDATED */ 01661000
@RC00775 L     @12,SIOT2ADD                                        0806 01662000
         LTR   @12,@12                                             0806 01663000
         BNZ   @RF00806                                            0806 01664000
*                 CALL REMDSNQ;     /* GO REMOVE THE DSN             */ 01665000
         BAL   @14,REMDSNQ                                         0807 01666000
*               IF SIOALIAS=ON THEN /* IF THE ENTRY BEING REMOVED HAD   01667000
*                                      AND ALIAS ( AUTO ONLY) TEST 0808 01668000
*                                      FOR MATCHES AGAINST IT.       */ 01669000
@RF00806 L     @12,SIOTPTR                                         0808 01670000
         TM    SIOALIAS(@12),B'10000000'                           0808 01671000
         BNO   @RF00808                                            0808 01672000
*                 DO;                                              0809 01673000
*                   JFCBPTR=SCTPJFCB+REALADD;                      0810 01674000
         SLR   @11,@11                                             0810 01675000
         ICM   @11,7,SCTPJFCB(@12)                                 0810 01676000
         L     @12,REALADD-1                                       0810 01677000
         LA    @12,0(,@12)                                         0810 01678000
         ALR   @11,@12                                             0810 01679000
         ST    @11,JFCBPTR                                         0810 01680000
*                   SWVA=JFCBEXAD;                                 0811 01681000
         L     @12,SWEPAPTR                                        0811 01682000
         MVC   SWVA(3,@12),JFCBEXAD(@11)                           0811 01683000
*                   CALL READSWA;                                  0812 01684000
         BAL   @14,READSWA                                         0812 01685000
*                   JFCBXPTR=SWBLKPTR;                             0813 01686000
         L     @12,SWEPAPTR                                        0813 01687000
         L     @12,SWBLKPTR(,@12)                                  0813 01688000
         ST    @12,JFCBXPTR                                        0813 01689000
*                   DSN=JFCBXNAM;                                  0814 01690000
         MVC   DSN(44),JFCBXNAM(@12)                               0814 01691000
*                   SIOT2ADD=SCTFSIOT;/* PICK UP ADDR OF FIRST SIOT     01692000
*                                      ON THE CHAIN          @YM08192*/ 01693000
         L     @12,SCTPTR                                          0815 01694000
         SLR   @11,@11                                             0815 01695000
         ICM   @11,7,SCTFSIOT(@12)                                 0815 01696000
         ST    @11,SIOT2ADD                                        0815 01697000
*                   IF SIOT2ADD=SCTLSIOT THEN/* DONT SEARCH PAST THE    01698000
*                                      LAST SIOT             @YM08192*/ 01699000
         SLR   @09,@09                                             0816 01700000
         ICM   @09,7,SCTLSIOT(@12)                                 0816 01701000
         CR    @11,@09                                             0816 01702000
         BNE   @RF00816                                            0816 01703000
*                     SIOT2ADD=ZEROPTR;/* INDICATE NO MATCH          */ 01704000
         SLR   @12,@12                                             0817 01705000
         ST    @12,SIOT2ADD                                        0817 01706000
*                   ELSE                                           0818 01707000
*                     DO;                                          0818 01708000
         B     @RC00816                                            0818 01709000
@RF00816 DS    0H                                                  0819 01710000
*                       SIOT2ADD=(SIOT2ADD+REALADD)->SCTPSIOT;/*   0819 01711000
*                                                            @YM08191*/ 01712000
         L     @12,REALADD-1                                       0819 01713000
         LA    @12,0(,@12)                                         0819 01714000
         AL    @12,SIOT2ADD                                        0819 01715000
         SLR   @11,@11                                             0819 01716000
         ICM   @11,7,SCTPSIOT(@12)                                 0819 01717000
         ST    @11,SIOT2ADD                                        0819 01718000
*                       PHAZ3SW=NOTON;/* LOOP CONTROL                */ 01719000
         NI    PHAZ3SW,B'01111111'                                 0820 01720000
*                       DO WHILE PHAZ3SW=NOTON;                    0821 01721000
         B     @DE00821                                            0821 01722000
@DL00821 DS    0H                                                  0822 01723000
*                         SWVA=(SIOT2ADD+REALADD)->SCTPJFCB;/* PICK     01724000
*                                      UP JFCBADD                    */ 01725000
         L     @12,REALADD-1                                       0822 01726000
         LA    @12,0(,@12)                                         0822 01727000
         AL    @12,SIOT2ADD                                        0822 01728000
         L     @11,SWEPAPTR                                        0822 01729000
         MVC   SWVA(3,@11),SCTPJFCB(@12)                           0822 01730000
*                         CALL READSWA;/* READ JFCB                  */ 01731000
         BAL   @14,READSWA                                         0823 01732000
*                         JFCBPTR=SWBLKPTR;/* ADDR'ABILITY FOR JFCB  */ 01733000
         L     @12,SWEPAPTR                                        0824 01734000
         L     @12,SWBLKPTR(,@12)                                  0824 01735000
         ST    @12,JFCBPTR                                         0824 01736000
*                         IF JFCBDSNM=DSN THEN                     0825 01737000
         CLC   JFCBDSNM(44,@12),DSN                                0825 01738000
         BNE   @RF00825                                            0825 01739000
*                           PHAZ3SW=ON;/* WHEN MATCH IS FOUND, LEAVE    01740000
*                                      SIOT2ADD NONZERO AND TURN ON     01741000
*                                      THE LOOP CONTROL SWITCH       */ 01742000
         OI    PHAZ3SW,B'10000000'                                 0826 01743000
*                         ELSE                                     0827 01744000
*                           IF EVAL(SIOT2ADD+REALADD)->SIOALIAS=ON THEN 01745000
         B     @RC00825                                            0827 01746000
@RF00825 L     @12,REALADD-1                                       0827 01747000
         LA    @12,0(,@12)                                         0827 01748000
         AL    @12,SIOT2ADD                                        0827 01749000
         TM    SIOALIAS(@12),B'10000000'                           0827 01750000
         BNO   @RF00827                                            0827 01751000
*                                   /* IF SIOT SAYS AN ALIAS EXISTS,    01752000
*                                      (THIS WILL ONLY BE TRUE FOR 0828 01753000
*                                      AUTO RESTART) GO COMPARE    0828 01754000
*                                      AGAINST THEALIAS TOO          */ 01755000
*                             DO;                                  0828 01756000
*                               SWVA=JFCBEXAD;/* INIT FOR READ       */ 01757000
         L     @12,SWEPAPTR                                        0829 01758000
         L     @11,JFCBPTR                                         0829 01759000
         MVC   SWVA(3,@12),JFCBEXAD(@11)                           0829 01760000
*                               CALL READSWA;/* DO THE READ          */ 01761000
         BAL   @14,READSWA                                         0830 01762000
*                               JFCBXPTR=SWBLKPTR;/* ADDRABILITY   0831 01763000
*                                      JFCBX                         */ 01764000
         L     @12,SWEPAPTR                                        0831 01765000
         L     @12,SWBLKPTR(,@12)                                  0831 01766000
         ST    @12,JFCBXPTR                                        0831 01767000
*                               IF JFCBXNAM=DSN THEN/* IF NAME     0832 01768000
*                                      MATCHES,                      */ 01769000
         CLC   JFCBXNAM(44,@12),DSN                                0832 01770000
         BNE   @RF00832                                            0832 01771000
*                                 PHAZ3SW=ON;/* STOP THE LOOP WITH 0833 01772000
*                                      NONZERO SIOT ADDR             */ 01773000
         OI    PHAZ3SW,B'10000000'                                 0833 01774000
*                             END;                                 0834 01775000
*                           ELSE                                   0835 01776000
*                             DO;                                  0835 01777000
         B     @RC00827                                            0835 01778000
@RF00827 DS    0H                                                  0836 01779000
*                               IF SIOT2ADD=SCTLSIOT THEN/* ALL SIOTS   01780000
*                                      SEARCHED BEFORE MATCH FOUND...*/ 01781000
         L     @12,SIOT2ADD                                        0836 01782000
         L     @11,SCTPTR                                          0836 01783000
         SLR   @09,@09                                             0836 01784000
         ICM   @09,7,SCTLSIOT(@11)                                 0836 01785000
         CR    @12,@09                                             0836 01786000
         BNE   @RF00836                                            0836 01787000
*                                 DO;                              0837 01788000
*                                   SIOT2ADD=ZEROPTR;/* INDICATE NO     01789000
*                                      MATCH                         */ 01790000
         SLR   @12,@12                                             0838 01791000
         ST    @12,SIOT2ADD                                        0838 01792000
*                                   PHAZ3SW=ON;/* STOP THE LOOP      */ 01793000
         OI    PHAZ3SW,B'10000000'                                 0839 01794000
*                                 END;                             0840 01795000
*                               ELSE                               0841 01796000
*                                 SIOT2ADD=(SIOT2ADD+REALADD)->SCTPSIOT 01797000
*                                   ;/* GET LINK PTR                 */ 01798000
         B     @RC00836                                            0841 01799000
@RF00836 L     @12,REALADD-1                                       0841 01800000
         LA    @12,0(,@12)                                         0841 01801000
         AL    @12,SIOT2ADD                                        0841 01802000
         SLR   @11,@11                                             0841 01803000
         ICM   @11,7,SCTPSIOT(@12)                                 0841 01804000
         ST    @11,SIOT2ADD                                        0841 01805000
*                             END;                                 0842 01806000
@RC00836 DS    0H                                                  0843 01807000
*                       END;                                       0843 01808000
@RC00827 DS    0H                                                  0843 01809000
@RC00825 DS    0H                                                  0843 01810000
@DE00821 TM    PHAZ3SW,B'10000000'                                 0843 01811000
         BZ    @DL00821                                            0843 01812000
*                     END;                                         0844 01813000
*                   IF SIOT2ADD=ZEROPTR THEN/* NO MATCH WAS FOUND FOR   01814000
*                                      A 2ND USAGE OF THE DATASET. 0845 01815000
*                                      THE DSENQ TABLE SHOULD BE   0845 01816000
*                                      UPDATED                       */ 01817000
@RC00816 L     @12,SIOT2ADD                                        0845 01818000
         LTR   @12,@12                                             0845 01819000
         BNZ   @RF00845                                            0845 01820000
*                     CALL REMDSNQ; /* GO REMOVE THE DSN             */ 01821000
         BAL   @14,REMDSNQ                                         0846 01822000
*                 END;                                             0847 01823000
@RF00845 DS    0H                                                  0848 01824000
*             END;                                                 0848 01825000
@RF00808 DS    0H                                                  0849 01826000
*         END;                                                     0849 01827000
@RF00752 LA    @12,1                                               0849 01828000
         SLR   @11,@11                                             0849 01829000
         IC    @11,INDEX                                           0849 01830000
         ALR   @12,@11                                             0849 01831000
@DE00750 STC   @12,INDEX                                           0849 01832000
         L     @11,DDNTPTR                                         0849 01833000
         ICM   @11,12,DDNTUSCT(@11)                                0849 01834000
         SRA   @11,16                                              0849 01835000
         BCTR  @11,0                                               0849 01836000
         CR    @12,@11                                             0849 01837000
         BNH   @DL00750                                            0849 01838000
*         DO;                       /* DDNTS MUST NOW BE PUT TO SWA  */ 01839000
*           SWLNGTH=LENGTH(IEFADDNT);/* SET LENGTH FOR ASSIGN        */ 01840000
*                                                                  0851 01841000
         L     @12,SWEPAPTR                                        0851 01842000
         MVC   SWLNGTH(4,@12),@CF00663                             0851 01843000
*           /*********************************************************/ 01844000
*           /*                                                       */ 01845000
*           /* ?SWAREQ (AL) EPA (EPAPTR);                            */ 01846000
*           /*                                                       */ 01847000
*           /*********************************************************/ 01848000
*                                                                  0852 01849000
*           CALL SWAMGR(EPAPTR,'AL');                              0852 01850000
         LA    @12,EPAPTR                                          0852 01851000
         ST    @12,@AL00001                                        0852 01852000
         LA    @12,@CC04213                                        0852 01853000
         ST    @12,@AL00001+4                                      0852 01854000
         LA    @12,16                                              0852 01855000
         L     @12,CVTPTR(,@12)                                    0852 01856000
         L     @12,CVTJESCT(,@12)                                  0852 01857000
         L     @15,JESWAA(,@12)                                    0852 01858000
         LA    @01,@AL00001                                        0852 01859000
         BALR  @14,@15                                             0852 01860000
*           SAVELOC=SWVA;                                          0853 01861000
         L     @12,SWEPAPTR                                        0853 01862000
         MVC   SAVELOC(3),SWVA(@12)                                0853 01863000
*           DDNTLINK=ZEROPTR;       /* THIS IS THE LAST DDNT...FOR 0854 01864000
*                                      THE MOMENT.                   */ 01865000
         L     @12,DDNTPTR                                         0854 01866000
         SLR   @11,@11                                             0854 01867000
         STCM  @11,15,DDNTLINK(@12)                                0854 01868000
*           SWBUFPTR=DDNTPTR;       /* POINT TO WRITE-FROM BUFFER    */ 01869000
         L     @11,EPAPTR                                          0855 01870000
         ST    @12,SWBUFPTR(,@11)                                  0855 01871000
*           SWROWVA=SAVELOC;        /* POINT TO WRITE-TO BUFFER      */ 01872000
         MVC   SWROWVA(3,@11),SAVELOC                              0856 01873000
*           SWWRTID=DDNT27;         /* BLOCK ID FOR 1ST WRITE        */ 01874000
         MVI   SWWRTID(@11),X'27'                                  0857 01875000
*           CALL WRITESWA;          /* WRITE-MOVE VIA SWA MANAGER    */ 01876000
         BAL   @14,WRITESWA                                        0858 01877000
*           IF SCTDDNT=ZEROPTR THEN /* IF THIS IS THE 1ST            */ 01878000
         L     @12,SCTPTR                                          0859 01879000
         L     @11,SCTDDNT(,@12)                                   0859 01880000
         LTR   @11,@11                                             0859 01881000
         BNZ   @RF00859                                            0859 01882000
*             SCTDDNT=SAVELOC;      /* PLUG TO SCT                   */ 01883000
         L     @11,SAVELOC-1                                       0860 01884000
         LA    @11,0(,@11)                                         0860 01885000
         ST    @11,SCTDDNT(,@12)                                   0860 01886000
*           ELSE                                                   0861 01887000
*             DO;                   /* FIND THE LAST ONE,THEN PLUG-IN*/ 01888000
         B     @RC00859                                            0861 01889000
@RF00859 DS    0H                                                  0862 01890000
*               SWVA=SCTDDNT;       /* GET 1ST DDNT FROM SWA...      */ 01891000
         L     @12,SWEPAPTR                                        0862 01892000
         L     @11,SCTPTR                                          0862 01893000
         MVC   SWVA(3,@12),SCTDDNT+1(@11)                          0862 01894000
*               CALL READSWA;       /* READ FIRST DDNT IN    @ZA09214*/ 01895000
         BAL   @14,READSWA                                         0863 01896000
*               DO WHILE SWBLKPTR->DDNTLINK^=ZEROPTR;              0864 01897000
         B     @DE00864                                            0864 01898000
@DL00864 DS    0H                                                  0865 01899000
*                 SWVA=DDNTLINK;    /* READ TILL LAST FOUND          */ 01900000
         L     @12,SWEPAPTR                                        0865 01901000
         L     @11,DDNTPTR                                         0865 01902000
         MVC   SWVA(3,@12),DDNTLINK+1(@11)                         0865 01903000
*                 CALL READSWA;                                    0866 01904000
         BAL   @14,READSWA                                         0866 01905000
*               END;                                               0867 01906000
@DE00864 L     @12,SWEPAPTR                                        0867 01907000
         L     @12,SWBLKPTR(,@12)                                  0867 01908000
         ICM   @11,15,DDNTLINK(@12)                                0867 01909000
         BNZ   @DL00864                                            0867 01910000
*               SWBLKPTR->DDNTLINK=SAVELOC;                        0868 01911000
         L     @11,SAVELOC-1                                       0868 01912000
         LA    @11,0(,@11)                                         0868 01913000
         STCM  @11,15,DDNTLINK(@12)                                0868 01914000
*             END;                                                 0869 01915000
*         END;                                                     0870 01916000
@RC00859 DS    0H                                                  0871 01917000
*       END;                                                       0871 01918000
*   END;                                                           0872 01919000
@RC00747 DS    0H                                                  0872 01920000
@DE00744 TM    LOOPCTR,B'10000000'                                 0872 01921000
         BZ    @DL00744                                            0872 01922000
*   END DDNTPROC;                                                  0873 01923000
@EL00008 DS    0H                                                  0873 01924000
@EF00008 DS    0H                                                  0873 01925000
@ER00008 LM    @14,@06,@SA00008                                    0873 01926000
         LM    @08,@12,@SA00008+36                                 0873 01927000
         BR    @14                                                 0873 01928000
*DDNTSIOT:                                                         0874 01929000
*   PROC;                                                          0874 01930000
*                                                                  0874 01931000
DDNTSIOT STM   @14,@12,12(@13)                                     0874 01932000
*/**************************************************************     */ 01933000
*/* THIS PROC SEARCHES THE SIOT CHAIN FOR A DDNAME THAT MATCHES      */ 01934000
*/* THE DDNAME FOUND IN THE DDNT.  IF FOUND, AND THE THE SIOT        */ 01935000
*/* IS NOT FOR A DYNAMIC ENTRY, THE SIOT IS REMOVED FROM THE         */ 01936000
*/* CHAIN.                                                           */ 01937000
*/**************************************************************     */ 01938000
*                                                                  0875 01939000
*   REALADD=LENGTH(SWAPFX);         /* CONSTANT FOR ADDR TRANSLATION */ 01940000
         LA    @12,16                                              0875 01941000
         STCM  @12,7,REALADD                                       0875 01942000
*   SIOTSIOT=ONEHEX;                /* GET A NON-ZERO VALUE          */ 01943000
         LA    @11,1                                               0876 01944000
         STCM  @11,7,SIOTSIOT                                      0876 01945000
*   FOUNDSW=NOTON;                  /* INTERNAL LOOP CONTROL - TURNED   01946000
*                                      ON WHEN MATCH FOUND           */ 01947000
         NI    FOUNDSW,B'01111111'                                 0877 01948000
*   IF(EVAL(SCTFSIOT+REALADD)->SCTDDNAM=DDNTDDNM(INDEX)/* IF THE   0878 01949000
*                                      FIRST SIOT                    */ 01950000
*       &EVAL(SCTFSIOT+REALADD)->SIOTDYAL=NOTON)                   0878 01951000
*                                                                  0878 01952000
*   /*****************************************************************/ 01953000
*   /*                                                               */ 01954000
*   /* DDNAME MATCHES, AND THE ENTRY IS NOT DYNAMIC, THE CHAINING IS */ 01955000
*   /* TRIVIAL.                                                      */ 01956000
*   /*                                                               */ 01957000
*   /*****************************************************************/ 01958000
*                                                                  0878 01959000
*     THEN                                                         0878 01960000
         L     @11,SCTPTR                                          0878 01961000
         SLR   @09,@09                                             0878 01962000
         ICM   @09,7,SCTFSIOT(@11)                                 0878 01963000
         LR    @15,@09                                             0878 01964000
         ALR   @15,@12                                             0878 01965000
         SLR   @14,@14                                             0878 01966000
         IC    @14,INDEX                                           0878 01967000
         SLA   @14,3                                               0878 01968000
         L     @01,DDNTPTR                                         0878 01969000
         ALR   @01,@14                                             0878 01970000
         CLC   SCTDDNAM(8,@15),DDNTDDNM-8(@01)                     0878 01971000
         BNE   @RF00878                                            0878 01972000
         LR    @15,@09                                             0878 01973000
         ALR   @15,@12                                             0878 01974000
         TM    SIOTDYAL(@15),B'01000000'                           0878 01975000
         BNZ   @RF00878                                            0878 01976000
*     DO;                                                          0879 01977000
*       SIOTSIOT=SCTFSIOT;          /* SET MATCHED SIOT ADDR FOR   0880 01978000
*                                      DDNTPROC                      */ 01979000
         STCM  @09,7,SIOTSIOT                                      0880 01980000
*       SCTFSIOT=(SCTFSIOT+REALADD)->SCTPSIOT;/* RESET FIRST SIOT  0881 01981000
*                                      PTR. THIS REMOVES THE SIOT  0881 01982000
*                                      THAT WAS MATCHED.             */ 01983000
         ALR   @09,@12                                             0881 01984000
         SLR   @12,@12                                             0881 01985000
         ICM   @12,7,SCTPSIOT(@09)                                 0881 01986000
         STCM  @12,7,SCTFSIOT(@11)                                 0881 01987000
*     END;                                                         0882 01988000
*                                                                  0882 01989000
*/**************************************************************     */ 01990000
*/* THE FOLLOWING CODE HANDLES THE SEARCH OF THE SIOT CHAIN IF       */ 01991000
*/* THE MATCH WAS NOT ON THE FIRST SIOT.                             */ 01992000
*/**************************************************************     */ 01993000
*                                                                  0883 01994000
*   ELSE                                                           0883 01995000
*     DO;                                                          0883 01996000
         B     @RC00878                                            0883 01997000
@RF00878 DS    0H                                                  0884 01998000
*       PROCSIOT=SCTFSIOT;          /* PROCSIOT WILL BE THE HOLDER 0884 01999000
*                                      FOR PREVIOUS SIOT ADDRESS.    */ 02000000
         L     @12,SCTPTR                                          0884 02001000
         SLR   @11,@11                                             0884 02002000
         ICM   @11,7,SCTFSIOT(@12)                                 0884 02003000
         ST    @11,PROCSIOT                                        0884 02004000
*       CURNSIOT=(SCTFSIOT+REALADD)->SCTPSIOT;/* CURNSIOT HOLDS    0885 02005000
*                                      ADDRESS OF SIOT BEING EXAM'D  */ 02006000
         L     @12,REALADD-1                                       0885 02007000
         LA    @12,0(,@12)                                         0885 02008000
         ALR   @11,@12                                             0885 02009000
         SLR   @12,@12                                             0885 02010000
         ICM   @12,7,SCTPSIOT(@11)                                 0885 02011000
         ST    @12,CURNSIOT                                        0885 02012000
*       DO WHILE(SIOTSIOT^=ZEROPTR&FOUNDSW^=ON);                   0886 02013000
*                                                                  0886 02014000
         B     @DE00886                                            0886 02015000
@DL00886 DS    0H                                                  0887 02016000
*         /***********************************************************/ 02017000
*         /*                                                         */ 02018000
*         /* RUN THIS LOOP UNTIL DDNAME MATCHES, OR UNTIL SIOTS ARE  */ 02019000
*         /* EXHAUSTED.                                              */ 02020000
*         /*                                                         */ 02021000
*         /***********************************************************/ 02022000
*                                                                  0887 02023000
*         IF(EVAL(CURNSIOT+REALADD)->SCTDDNAM=DDNTDDNM(INDEX)&EVAL(     02024000
*             CURNSIOT+REALADD)->SIOTDYAL=NOTON) THEN/* DONT REMOVE     02025000
*                                      DYNAMIC DD ENTRY              */ 02026000
         L     @12,CURNSIOT                                        0887 02027000
         L     @11,REALADD-1                                       0887 02028000
         LA    @11,0(,@11)                                         0887 02029000
         LR    @09,@12                                             0887 02030000
         ALR   @09,@11                                             0887 02031000
         SLR   @15,@15                                             0887 02032000
         IC    @15,INDEX                                           0887 02033000
         SLA   @15,3                                               0887 02034000
         L     @01,DDNTPTR                                         0887 02035000
         ALR   @01,@15                                             0887 02036000
         CLC   SCTDDNAM(8,@09),DDNTDDNM-8(@01)                     0887 02037000
         BNE   @RF00887                                            0887 02038000
         ALR   @11,@12                                             0887 02039000
         TM    SIOTDYAL(@11),B'01000000'                           0887 02040000
         BNZ   @RF00887                                            0887 02041000
*           DO;                     /* MATCH WAS FOUND...            */ 02042000
*             SIOTSIOT=CURNSIOT;    /* PARM FOR DDNTPROC             */ 02043000
         STCM  @12,7,SIOTSIOT                                      0889 02044000
*             FOUNDSW=ON;           /* STOP THE LOOP                 */ 02045000
         OI    FOUNDSW,B'10000000'                                 0890 02046000
*             IF SIOTSIOT=SCTLSIOT THEN/* FOR LAST SIOT ON CHAIN,  0891 02047000
*                                      ONLY UPDATE LSIOT TO REMOVE 0891 02048000
*                                      THE ENTRY.                    */ 02049000
         L     @11,SCTPTR                                          0891 02050000
         CLC   SIOTSIOT(3),SCTLSIOT(@11)                           0891 02051000
         BNE   @RF00891                                            0891 02052000
*               DO;                                                0892 02053000
*                 PREVLAST=CURNSIOT;/* FOR SECOND SEARCH     @YM07575*/ 02054000
         ST    @12,PREVLAST                                        0893 02055000
*                 SCTLSIOT=PROCSIOT;                               0894 02056000
         MVC   SCTLSIOT(3,@11),PROCSIOT+1                          0894 02057000
*               END;                                               0895 02058000
*             ELSE                  /* FOR OTHERS, POINT THE PREVIOUS   02059000
*                                      SIOT TO TO THE SIOT POINTED TO   02060000
*                                      BY THE SIOT BEING REMOVED.    */ 02061000
*               EVAL(PROCSIOT+REALADD)->SCTPSIOT=(CURNSIOT+REALADD)->   02062000
*                   SCTPSIOT;                                      0896 02063000
         B     @RC00891                                            0896 02064000
@RF00891 L     @12,REALADD-1                                       0896 02065000
         LA    @12,0(,@12)                                         0896 02066000
         L     @11,PROCSIOT                                        0896 02067000
         ALR   @11,@12                                             0896 02068000
         AL    @12,CURNSIOT                                        0896 02069000
         MVC   SCTPSIOT(3,@11),SCTPSIOT(@12)                       0896 02070000
*           END;                                                   0897 02071000
*         ELSE                                                     0898 02072000
*           DO;                     /* GET READY FOR NEXT SWING THRU */ 02073000
         B     @RC00887                                            0898 02074000
@RF00887 DS    0H                                                  0899 02075000
*             IF CURNSIOT=SCTLSIOT THEN/* ALL SIOTS EXAM'D           */ 02076000
         L     @12,CURNSIOT                                        0899 02077000
         L     @11,SCTPTR                                          0899 02078000
         SLR   @09,@09                                             0899 02079000
         ICM   @09,7,SCTLSIOT(@11)                                 0899 02080000
         CR    @12,@09                                             0899 02081000
         BNE   @RF00899                                            0899 02082000
*               SIOTSIOT=ZEROPTR;   /* INDICATE NOT FOUND            */ 02083000
         SLR   @12,@12                                             0900 02084000
         STCM  @12,7,SIOTSIOT                                      0900 02085000
*             ELSE                                                 0901 02086000
*               DO;                                                0901 02087000
         B     @RC00899                                            0901 02088000
@RF00899 DS    0H                                                  0902 02089000
*                 PROCSIOT=CURNSIOT;/* SET NEW PREVIOUS TO NEW VALUE */ 02090000
         L     @12,CURNSIOT                                        0902 02091000
         ST    @12,PROCSIOT                                        0902 02092000
*                 CURNSIOT=(CURNSIOT+REALADD)->SCTPSIOT;           0903 02093000
         L     @11,REALADD-1                                       0903 02094000
         LA    @11,0(,@11)                                         0903 02095000
         ALR   @12,@11                                             0903 02096000
         SLR   @11,@11                                             0903 02097000
         ICM   @11,7,SCTPSIOT(@12)                                 0903 02098000
         ST    @11,CURNSIOT                                        0903 02099000
*               END;                                               0904 02100000
*           END;                                                   0905 02101000
@RC00899 DS    0H                                                  0906 02102000
*       END;                                                       0906 02103000
@RC00887 DS    0H                                                  0906 02104000
@DE00886 L     @12,SIOTSIOT-1                                      0906 02105000
         LA    @12,0(,@12)                                         0906 02106000
         LTR   @12,@12                                             0906 02107000
         BZ    @DC00886                                            0906 02108000
         TM    FOUNDSW,B'10000000'                                 0906 02109000
         BNO   @DL00886                                            0906 02110000
@DC00886 DS    0H                                                  0907 02111000
*     END;                                                         0907 02112000
*   PROCSIOT=ZEROPTR;               /* RE-INITIALIZE FOR SIOTSCAN    */ 02113000
@RC00878 SLR   @12,@12                                             0908 02114000
         ST    @12,PROCSIOT                                        0908 02115000
*   END DDNTSIOT;                                                  0909 02116000
@EL00009 DS    0H                                                  0909 02117000
@EF00009 DS    0H                                                  0909 02118000
@ER00009 LM    @14,@12,12(@13)                                     0909 02119000
         BR    @14                                                 0909 02120000
*MERGMAIN:                                                         0910 02121000
*   PROC OPTIONS(NOSAVE(IOBUFAD));                                 0910 02122000
*                                                                  0910 02123000
MERGMAIN STM   @14,@06,@SA00010                                    0910 02124000
         STM   @08,@12,@SA00010+36                                 0910 02125000
*/**************************************************************     */ 02126000
*/* THIS PROCEDURE IS THE ROUTE CONTROLLER FOR THE MAIN MERGING      */ 02127000
*/*  FUNCTION OF IEFXB609.                                           */ 02128000
*/**************************************************************     */ 02129000
*/* DDNTPROC WILL HAVE LEFT ONE RECORD IN THE BUFFER...              */ 02130000
*                                                                  0911 02131000
*   TYPE1PTR=IOBUFAD;               /* ADDRESSABILITY FOR DSDR       */ 02132000
         ST    IOBUFAD,TYPE1PTR                                    0911 02133000
*   IGNORE=NOTON;                   /* INITIALIZE SWITCH FOR JOBCAT  */ 02134000
         NI    IGNORE,B'01111111'                                  0912 02135000
*   RESPECIFY                                                      0913 02136000
*     T1DSDR BASED(IOBUFAD);                                       0913 02137000
*   DO WHILE(DSDRIDNT=JFCID         /* READ AND PROCESS WHILE TYPE1  */ 02138000
*         |DSDRIDNT=SIOID           /* OR SIOT RECORD        @ZA06466*/ 02139000
*         |DSDRIDNT=EOBID           /* OR END OF BLOCK               */ 02140000
*         |DSDRIDNT=IDTYPE2);       /* OR (UNWANTED) JFCBX. THE DSDRS   02141000
*                                      FOR WANTED JFCBXS WILL BE   0914 02142000
*                                      HANDLED BY JFCBXJOB           */ 02143000
         B     @DE00914                                            0914 02144000
@DL00914 DS    0H                                                  0915 02145000
*     IF DSDRIDNT=JFCID THEN        /* FOR JFCB TYPE, TEST FOR     0915 02146000
*                                      SPECIAL CASES.                */ 02147000
         ICM   @12,3,DSDRIDNT(IOBUFAD)                             0915 02148000
         BNZ   @RF00915                                            0915 02149000
*       DO;                                                        0916 02150000
*         DJFCBPTR=ADDR(DSDRJFCB);  /* ADDR'ABILITY FOR DSDR JFCB  0917 02151000
*                                      LINE DELETED          @YM08160*/ 02152000
         LA    @12,DSDRJFCB(,IOBUFAD)                              0917 02153000
         ST    @12,DJFCBPTR                                        0917 02154000
*         IF DJFCBPTR->JFCENT^=ON THEN                             0918 02155000
         L     @12,DJFCBPTR                                        0918 02156000
         TM    JFCENT(@12),B'00000100'                             0918 02157000
         BO    @RF00918                                            0918 02158000
*           DO;                     /* IGNORE DSDRS FOR GDG        0919 02159000
*                                      GENERATIONS OR PRIVATE      0919 02160000
*                                      CATALOGS.                     */ 02161000
*             CALL SIOTSCAN;        /* FIND MATCHING SIOT            */ 02162000
         BAL   @14,SIOTSCAN                                        0920 02163000
*             IF IGNORE=NOTON THEN  /* PROCEED TO SIOTPROC UNLESS  0921 02164000
*                                      SIOT WAS FOR JOBCAT OR STEPCAT*/ 02165000
         TM    IGNORE,B'10000000'                                  0921 02166000
         BNZ   @RF00921                                            0921 02167000
*               DO;                                                0922 02168000
*                 IF NEWCCAT=ON THEN                               0923 02169000
         TM    NEWCCAT,B'10000000'                                 0923 02170000
         BNO   @RF00923                                            0923 02171000
*                   CALL SIOTSCAN;  /* IF LAST ENTRY WAS FOR ADDED 0924 02172000
*                                      CONCAT AT DEFERRED, DSDR HASNT   02173000
*                                      BEEN PROCESSED                */ 02174000
         BAL   @14,SIOTSCAN                                        0924 02175000
*                 CALL SIOTPROC;    /* MERGE SIOT FIELDS             */ 02176000
@RF00923 BAL   @14,SIOTPROC                                        0925 02177000
*                 CALL JFCBPROC;    /* MERGE JFCB FIELDS             */ 02178000
         BAL   @14,JFCBPROC                                        0926 02179000
*               END;                                               0927 02180000
*             ELSE                                                 0928 02181000
*               IGNORE=NOTON;       /* RESET SWITCH FOR NEXT LOOP    */ 02182000
         B     @RC00921                                            0928 02183000
@RF00921 NI    IGNORE,B'01111111'                                  0928 02184000
*           END;                                                   0929 02185000
*       END;                                                       0930 02186000
*     ELSE                                                         0931 02187000
*       ;                                                          0931 02188000
@RF00915 DS    0H                                                  0932 02189000
*     DO;                           /* DYNAMIC SIOT PROCESSING     0932 02190000
*                                                            @ZA06466*/ 02191000
@RC00915 DS    0H                                                  0933 02192000
*       IF DSDRIDNT=SIOID THEN      /* IS THIS A DYNAMIC SIOT      0933 02193000
*                                                            @ZA06466*/ 02194000
         CLC   DSDRIDNT(2,IOBUFAD),@CH02967                        0933 02195000
         BNE   @RF00933                                            0933 02196000
*         CALL DYNAPROC;            /* NEW PROCEDURE FOR HANDLING  0934 02197000
*                                      SIOTS THAT WERE SAVED BY    0934 02198000
*                                      CHECKPOINT BECAUSE OF DYNAMIC    02199000
*                                      ALLOCATION DONE BEFORE THE  0934 02200000
*                                      CHECKPOINT WAS TAKEN. @ZA06466*/ 02201000
         BAL   @14,DYNAPROC                                        0934 02202000
*       CALL READCHEK;              /* READ NEXT RECORD              */ 02203000
@RF00933 BAL   @14,READCHEK                                        0935 02204000
*       TYPE1PTR=IOBUFAD;           /* REFRESH BUFFER POINTER        */ 02205000
         ST    IOBUFAD,TYPE1PTR                                    0936 02206000
*     END;                                                         0937 02207000
*     IF DSDRIDNT=GDGNTID THEN                                     0938 02208000
         CLC   DSDRIDNT(2,IOBUFAD),@CH02959                        0938 02209000
         BNE   @RF00938                                            0938 02210000
*       DO;                                                        0939 02211000
*         CALL GDGNTJOB;            /* HANDLE PLUG-IN FOR GDGNT      */ 02212000
         BAL   @14,GDGNTJOB                                        0940 02213000
*         CALL READCHEK;            /* READ ONE MORE FOR NOTE        */ 02214000
         BAL   @14,READCHEK                                        0941 02215000
*       END;                                                       0942 02216000
*   END MERGMAIN;                                                  0943 02217000
@RF00938 DS    0H                                                  0943 02218000
@DE00914 ICM   @12,12,DSDRIDNT(IOBUFAD)                            0943 02219000
         SRA   @12,16                                              0943 02220000
         LTR   @12,@12                                             0943 02221000
         BZ    @DL00914                                            0943 02222000
         C     @12,@CF02967                                        0943 02223000
         BE    @DL00914                                            0943 02224000
         C     @12,@CF02983                                        0943 02225000
         BE    @DL00914                                            0943 02226000
         C     @12,@CF02951                                        0943 02227000
         BE    @DL00914                                            0943 02228000
@EL00010 DS    0H                                                  0944 02229000
@EF00010 DS    0H                                                  0944 02230000
@ER00010 LM    @14,@06,@SA00010                                    0944 02231000
         LM    @08,@12,@SA00010+36                                 0944 02232000
         BR    @14                                                 0944 02233000
*DYNAPROC:                                                         0945 02234000
*   PROC;                                                          0945 02235000
*                                                                  0945 02236000
DYNAPROC STM   @14,@12,@SA00011                                    0945 02237000
*/********************************************************************/ 02238000
*/*                                                                  */ 02239000
*/* THIS PROCEDURE HANDLES THE SIOTS SAVED BY CHECKPOINT     @ZA06466*/ 02240000
*/*   IN TYPE 4 DSDR RECORDS IDENTIFIED BY X'000C' AT OFFSET @ZA06466*/ 02241000
*/*   ZERO. CURRENTLY ONLY SYSOUT FIELDS ARE UPDATED AND     @ZA06466*/ 02242000
*/*   THEREFORE ONLY SIOTS IN TYPE 4 DSDR RECORDS WITH THE   @ZA06466*/ 02243000
*/*   SCTSYSOU BIT ON WILL HAVE ANY PROCESSING DONE.         @ZA06466*/ 02244000
*/* THE FIELDS BEING SET ARE: SCTOUTNM, SCTOUTNO, SCTOUTPN,  @ZA06466*/ 02245000
*/*   SIOTOUTC, SIOTDEST, SIOTSSDS, SIOTSSNM AND SIOTHOLD,   @ZA06466*/ 02246000
*/*   IF THE TYPE OF RESTART IS DEFERRED THEN TWO MORE SIOT  @ZA06466*/ 02247000
*/*   FIELDS ARE SET FOR ALLOCATION (IEFAB427) TO REQUEST A  @ZA06466*/ 02248000
*/*   NEW TRACK MASK (SIOTTRKM) AND A NEW DATA SET NAME      @ZA06466*/ 02249000
*/*   (SIOTDSNM) FROM THE SUBSYSTEM HANDLING SYSOUT.         @ZA06466*/ 02250000
*/*                                                                  */ 02251000
*/********************************************************************/ 02252000
*                                                                  0946 02253000
*   DSIOTPTR=ADDR(DSDRSIOT);        /* INPUT SIOT POINTER    @ZA06466*/ 02254000
         L     @12,TYPE1PTR                                        0946 02255000
         LA    @12,DSDRSIOT(,@12)                                  0946 02256000
         ST    @12,DSIOTPTR                                        0946 02257000
*   SIOTPTR=PROCSIOT+LENGTH(SWAPFX);/* GET CURRENT SIOT INCORE     0947 02258000
*                                      ADDRESS               @ZA06466*/ 02259000
         LA    @12,16                                              0947 02260000
         L     @11,PROCSIOT                                        0947 02261000
         ALR   @11,@12                                             0947 02262000
         ST    @11,SIOTPTR                                         0947 02263000
*   IF SIOTPTR->SCTDDNAM^=DSIOTPTR->SCTDDNAM THEN/* IS THIS SIOT FOR    02264000
*                                      THIS DSDR             @ZA06466*/ 02265000
         L     @09,DSIOTPTR                                        0948 02266000
         CLC   SCTDDNAM(8,@11),SCTDDNAM(@09)                       0948 02267000
         BE    @RF00948                                            0948 02268000
*     DO;                           /* MUST SEARCH SIOTS     @ZA06466*/ 02269000
*       SIOTPTR=SCTPTR->SCTFSIOT+LENGTH(SWAPFX);/* GET FIRST SIOT  0950 02270000
*                                      INCORE ADDRESS        @ZA06466*/ 02271000
         L     @11,SCTPTR                                          0950 02272000
         SLR   @09,@09                                             0950 02273000
         ICM   @09,7,SCTFSIOT(@11)                                 0950 02274000
         ALR   @12,@09                                             0950 02275000
         ST    @12,SIOTPTR                                         0950 02276000
*       DO WHILE(SIOTPTR^=ZEROPTR&  /* END OF SIOT CHAIN?    @ZA06466*/ 02277000
*             SIOTPTR->SCTDDNAM^=DSIOTPTR->SCTDDNAM);/* IS THIS SIOT    02278000
*                                      FOR THIS DSDR         @ZA06466*/ 02279000
         B     @DE00951                                            0951 02280000
@DL00951 DS    0H                                                  0952 02281000
*         SIOTPTR=SIOTPTR->SCTPSIOT+LENGTH(SWAPFX);/* GET NEXT SIOT     02282000
*                                      INCORE ADDR           @ZA06466*/ 02283000
         LA    @12,16                                              0952 02284000
         L     @11,SIOTPTR                                         0952 02285000
         SLR   @09,@09                                             0952 02286000
         ICM   @09,7,SCTPSIOT(@11)                                 0952 02287000
         ALR   @12,@09                                             0952 02288000
         ST    @12,SIOTPTR                                         0952 02289000
*       END;                        /*                       @ZA06466*/ 02290000
@DE00951 L     @12,SIOTPTR                                         0953 02291000
         LTR   @12,@12                                             0953 02292000
         BZ    @DC00951                                            0953 02293000
         L     @11,DSIOTPTR                                        0953 02294000
         CLC   SCTDDNAM(8,@12),SCTDDNAM(@11)                       0953 02295000
         BNE   @DL00951                                            0953 02296000
@DC00951 DS    0H                                                  0954 02297000
*     END;                          /*                       @ZA06466*/ 02298000
*   IF SIOTPTR^=ZEROPTR THEN        /* WAS THE SIOT FOUND    @ZA06466*/ 02299000
@RF00948 L     @12,SIOTPTR                                         0955 02300000
         LTR   @12,@12                                             0955 02301000
         BZ    @RF00955                                            0955 02302000
*     DO;                           /*                       @ZA06466*/ 02303000
*       IF SIOTPTR->SCTSYSOU=ON THEN/* IS SIOT FOR SYSOUT    @ZA06466*/ 02304000
         TM    SCTSYSOU(@12),B'00001000'                           0957 02305000
         BNO   @RF00957                                            0957 02306000
*         DO;                       /*                       @ZA06466*/ 02307000
*           SIOTPTR->SCTOUTNM=DSIOTPTR->SCTOUTNM;/* PROG NAME      0959 02308000
*                                                            @ZA06466*/ 02309000
         L     @11,DSIOTPTR                                        0959 02310000
         MVC   SCTOUTNM(8,@12),SCTOUTNM(@11)                       0959 02311000
*           SIOTPTR->SCTOUTNO=DSIOTPTR->SCTOUTNO;/* FORMS NUMBER   0960 02312000
*                                                            @ZA06466*/ 02313000
         L     @11,DSIOTPTR                                        0960 02314000
         MVC   SCTOUTNO(4,@12),SCTOUTNO(@11)                       0960 02315000
*           SIOTPTR->SCTOUTPN=DSIOTPTR->SCTOUTPN;/* SYSOUT CLASS   0961 02316000
*                                                            @ZA06466*/ 02317000
         L     @11,DSIOTPTR                                        0961 02318000
         MVC   SCTOUTPN(1,@12),SCTOUTPN(@11)                       0961 02319000
*           SIOTPTR->SIOTOUTC=DSIOTPTR->SIOTOUTC;/* NUMBER SYSOUT  0962 02320000
*                                      COPIES                @ZA06466*/ 02321000
         L     @11,DSIOTPTR                                        0962 02322000
         MVC   SIOTOUTC(1,@12),SIOTOUTC(@11)                       0962 02323000
*           SIOTPTR->SIOTDEST=DSIOTPTR->SIOTDEST;/* SYSOUT         0963 02324000
*                                      DESTINATION           @ZA06466*/ 02325000
         L     @11,DSIOTPTR                                        0963 02326000
         MVC   SIOTDEST(8,@12),SIOTDEST(@11)                       0963 02327000
*           SIOTPTR->SIOTSSNM=DSIOTPTR->SIOTSSNM;/* SUBSYSTEM NAME 0964 02328000
*                                                            @ZA06466*/ 02329000
         L     @11,DSIOTPTR                                        0964 02330000
         MVC   SIOTSSNM(4,@12),SIOTSSNM(@11)                       0964 02331000
*           SIOTPTR->SIOTSSDS=ON;   /* SUBSYSTEM DATASET     @ZA06466*/ 02332000
         OI    SIOTSSDS(@12),B'10000000'                           0965 02333000
*           IF DSIOTPTR->SIOTHOLD=ON THEN/* WAS HOLD SPECIFIED?    0966 02334000
*                                                            @ZA06466*/ 02335000
         L     @11,DSIOTPTR                                        0966 02336000
         TM    SIOTHOLD(@11),B'01000000'                           0966 02337000
         BNO   @RF00966                                            0966 02338000
*             SIOTPTR->SIOTHOLD=ON; /* SET HOLD IN SIOT      @ZA06466*/ 02339000
         OI    SIOTHOLD(@12),B'01000000'                           0967 02340000
*           IF RESTYPE=ON THEN      /* IS RESTART TYPE DEFERRED?   0968 02341000
*                                                            @ZA06466*/ 02342000
@RF00966 TM    RESTYPE,B'10000000'                                 0968 02343000
         BNO   @RF00968                                            0968 02344000
*             DO;                   /*                       @ZA06466*/ 02345000
*               SIOTPTR->SIOTTRKM=ON;/* REQUEST NEW TRACK MASK VIA 0970 02346000
*                                      ALLOCATION            @ZA06466*/ 02347000
*               SIOTPTR->SIOTDSNM=ON;/* REQUEST NEW DSNAME VIA     0971 02348000
*                                      ALLOCATION            @ZA06466*/ 02349000
         L     @12,SIOTPTR                                         0971 02350000
         OI    SIOTTRKM(@12),B'00000110'                           0971 02351000
*             END;                  /*                       @ZA06466*/ 02352000
*         END;                      /*                       @ZA06466*/ 02353000
*     END;                          /*                       @ZA06466*/ 02354000
*   ELSE                                                           0975 02355000
*     CALL ERR37;                   /* NO SIOT FOUND FOR THE TYPE 4     02356000
*                                      DSDR                  @ZA06466*/ 02357000
         B     @RC00955                                            0975 02358000
@RF00955 BAL   @14,ERR37                                           0975 02359000
*   END DYNAPROC;                   /* TYPE 4 DSDR DONE      @ZA06466*/ 02360000
@EL00011 DS    0H                                                  0976 02361000
@EF00011 DS    0H                                                  0976 02362000
@ER00011 LM    @14,@12,@SA00011                                    0976 02363000
         BR    @14                                                 0976 02364000
*SIOTSCAN:                                                         0977 02365000
*   PROC;                                                          0977 02366000
*                                                                  0977 02367000
SIOTSCAN STM   @14,@12,@SA00012                                    0977 02368000
*/**************************************************************     */ 02369000
*/* THIS PROC SCANS THE SIOT CHAIN FOR A MATCH ON THE DDNAME         */ 02370000
*/*   FOUND IN THE DSDR.  THE CHAIN IS SEARCHED IN SUCH A WAY        */ 02371000
*/*   THAT ALREADY MATCHED AND PROCESSED SIOTS REMAIN AT THE         */ 02372000
*/*   UPPER PORTION OF THE CHAIN, AND SIOTS THAT DO NOT MATCH        */ 02373000
*/*   THE CURRENT SEARCH ARGUMENT ARE BUBBLED-DOWN TO THE            */ 02374000
*/*   BOTTOM OF THE CHAIN.  THE SIOT THAT MATCHES WILL ALWAYS        */ 02375000
*/*   BE CHAINED IN AFTER THE PREVIOUSLY MATCHED AND PROCESSED       */ 02376000
*/*   SIOT ON THE CHAIN.                                             */ 02377000
*/*   ON EXIT, PROCSIOT IS THE SVA OF THE MATCHED SIOT.              */ 02378000
*/**************************************************************     */ 02379000
*                                                                  0978 02380000
*   DCL                                                            0978 02381000
*     DOUBLDD BIT(1);               /* FLAG TO INSURE NO PROBLEMS  0978 02382000
*                                      WITH DOUBLE DDS       @YM07532*/ 02383000
*   DCL                                                            0979 02384000
*     SAVEL PTR(24) BDY(WORD);      /* HOLDER FOR LAST SIOT PTR      */ 02385000
*   DCL                                                            0980 02386000
*     NEWCCAT BIT(1);               /* FLAG FOR ADDED CONCATS AT   0980 02387000
*                                      DEFERRED                      */ 02388000
*   REALADD=LENGTH(SWAPFX);         /* CONSTANT FOR ADRESS         0981 02389000
*                                      TRANSLATION                   */ 02390000
         MVC   REALADD(3),@CF00052+1                               0981 02391000
*/***************************************************************    */ 02392000
*/* IF THE RESTART TYPE IS DEFERRED, AND THE DSDR IS FOR A DATA      */ 02393000
*/*    SET THAT WAS DYNAMICALLY ALLOCATED, THERE WILL NOT BE A       */ 02394000
*/*    SIOT/JFCB TO MATCH AGAINST - AS THE INTERPRETER WAS NOT       */ 02395000
*/*    AWARE OF ITS PRESENCE.  THE PROCEDURE NOMATCH WILL BE         */ 02396000
*/*    CALLED TO BUILD A SIOT/JFCB AND CHAIN THEM INTO SWA.          */ 02397000
*/* IF THE RESTART IS AUTOMATIC, SIOTS FOR DYNAMICALLY ALLOCATED     */ 02398000
*/*    DATASETS WILL BE BUILT ONLY IF NO MATCH CAN BE MADE.          */ 02399000
*/***************************************************************    */ 02400000
*                                                                  0982 02401000
*   SAVEL=SCTLSIOT;                 /* SAVE PTR TO LAST SIOT ON ENTRY   02402000
*                                      TO PROC                       */ 02403000
         L     @12,SCTPTR                                          0982 02404000
         MVC   SAVEL(3),SCTLSIOT(@12)                              0982 02405000
*   BUILDSW=NOTON;                  /* INIT SWITCH FOR NOMATCH     0983 02406000
*                                      FUNCTION                      */ 02407000
         NI    BUILDSW,B'01111111'                                 0983 02408000
*   DOUBLDD=NOTON;                  /* SHOW NO MATCH SO FAR  @YM07532*/ 02409000
         NI    DOUBLDD,B'01111111'                                 0984 02410000
*   NEWCCAT=NOTON;                  /* INITIALIZE FLAG               */ 02411000
         NI    NEWCCAT,B'01111111'                                 0985 02412000
*   IF DSDRDALC=ON THEN                                            0986 02413000
         TM    DSDRDALC(IOBUFAD),B'10000000'                       0986 02414000
         BNO   @RF00986                                            0986 02415000
*     BUILDSW=ON;                   /* TURN ON BUILD SWITCH FOR ALL     02416000
*                                      DYNAMICALLY ALLOCATED DATASETS   02417000
*                                                            @YM07048*/ 02418000
         OI    BUILDSW,B'10000000'                                 0987 02419000
*   IF(RESTYPE=ON                   /* IF DEFERRED...                */ 02420000
*       &DSDRDALC=ON) THEN          /* AND D.S. WAS DYNALLOC         */ 02421000
@RF00986 TM    RESTYPE,B'10000000'                                 0988 02422000
         BNO   @RF00988                                            0988 02423000
         TM    DSDRDALC(IOBUFAD),B'10000000'                       0988 02424000
         BNO   @RF00988                                            0988 02425000
*     DO;                                                          0989 02426000
*       CALL NOMATCH;               /* INVOKE BUILD ROUTINE          */ 02427000
         BAL   @14,NOMATCH                                         0990 02428000
*       PROCSIOT=NEWSIOT;           /* PARM FOR SIOTPROC             */ 02429000
         L     @12,NEWSIOT-1                                       0991 02430000
         LA    @12,0(,@12)                                         0991 02431000
         ST    @12,PROCSIOT                                        0991 02432000
*     END;                                                         0992 02433000
*   ELSE                            /* INSERT DECISION FOR   @YM06021*/ 02434000
*     IF PROCSIOT=SAVEL THEN                                       0993 02435000
         B     @RC00988                                            0993 02436000
@RF00988 L     @12,PROCSIOT                                        0993 02437000
         SLR   @11,@11                                             0993 02438000
         ICM   @11,7,SAVEL                                         0993 02439000
         CR    @12,@11                                             0993 02440000
         BNE   @RF00993                                            0993 02441000
*       DO;                                                        0994 02442000
*         CALL NOMATCH;             /* IF SIOTSCAN IS BEING ENTERED     02443000
*                                      AGAIN AFTER ALL SIOTS HAVE  0995 02444000
*                                      BEEN PROCESSED, CALL THE ERROR   02445000
*                                      ROUTINE               @YM05442*/ 02446000
         BAL   @14,NOMATCH                                         0995 02447000
*         PROCSIOT=NEWSIOT;         /* FOR SIOTPROC          @YM08139*/ 02448000
         L     @12,NEWSIOT-1                                       0996 02449000
         LA    @12,0(,@12)                                         0996 02450000
         ST    @12,PROCSIOT                                        0996 02451000
*         RETURN;                   /* RETURN TO CALLER      @YM08139*/ 02452000
@EL00012 DS    0H                                                  0997 02453000
@EF00012 DS    0H                                                  0997 02454000
@ER00012 LM    @14,@12,@SA00012                                    0997 02455000
         BR    @14                                                 0997 02456000
*       END;                                                       0998 02457000
*                                                                  0998 02458000
*/***************************************************************    */ 02459000
*/* IN OTHER CASES, SEARCH SIOT CHAIN FOR MATCH AGAINST DSDRDNAM     */ 02460000
*/***************************************************************    */ 02461000
*                                                                  0999 02462000
*     ELSE                                                         0999 02463000
*       DO;                                                        0999 02464000
@RF00993 DS    0H                                                  1000 02465000
*         DO WHILE DOUBLDD^=ON;     /* LOOP TIL MATCH FOUND  @YM07532*/ 02466000
         B     @DE01000                                            1000 02467000
@DL01000 DS    0H                                                  1001 02468000
*           IF PROCSIOT=ZEROPTR THEN/* IS THIS FIRST ENTRY ?         */ 02469000
         L     @12,PROCSIOT                                        1001 02470000
         LTR   @12,@12                                             1001 02471000
         BNZ   @RF01001                                            1001 02472000
*             DO;                                                  1002 02473000
*               PROCSIOT=SCTFSIOT;  /* PICK UP FIRST SIOT            */ 02474000
         L     @12,SCTPTR                                          1003 02475000
         SLR   @11,@11                                             1003 02476000
         ICM   @11,7,SCTFSIOT(@12)                                 1003 02477000
         ST    @11,PROCSIOT                                        1003 02478000
*               CURNSIOT=PROCSIOT;  /* INIT. SEARCH SIOT ADDR        */ 02479000
         ST    @11,CURNSIOT                                        1004 02480000
*             END;                                                 1005 02481000
*                                                                  1005 02482000
*/* ON OTHER THAN THE FIRST ENTRY, BEGIN SEARCH WITH THE NEXT        */ 02483000
*/* SIOT AFTER THE LAST PROCESSED.                                   */ 02484000
*                                                                  1006 02485000
*           ELSE                                                   1006 02486000
*             CURNSIOT=(PROCSIOT+REALADD)->SCTPSIOT;/* PICK UP NEXT  */ 02487000
         B     @RC01001                                            1006 02488000
@RF01001 L     @12,REALADD-1                                       1006 02489000
         LA    @12,0(,@12)                                         1006 02490000
         AL    @12,PROCSIOT                                        1006 02491000
         SLR   @11,@11                                             1006 02492000
         ICM   @11,7,SCTPSIOT(@12)                                 1006 02493000
         ST    @11,CURNSIOT                                        1006 02494000
*           IF EVAL(CURNSIOT+REALADD)->SCTDDNAM=DSDRDNAM THEN      1007 02495000
@RC01001 L     @12,CURNSIOT                                        1007 02496000
         L     @11,REALADD-1                                       1007 02497000
         LA    @11,0(,@11)                                         1007 02498000
         ALR   @11,@12                                             1007 02499000
         CLC   SCTDDNAM(8,@11),DSDRDNAM(IOBUFAD)                   1007 02500000
         BNE   @RF01007                                            1007 02501000
*             DO;                                                  1008 02502000
*               DOUBLDD=ON;         /* SHOW MATCH FOUND      @YM07532*/ 02503000
         OI    DOUBLDD,B'10000000'                                 1009 02504000
*               PROCSIOT=CURNSIOT;  /* IF THE NEW NEXT MATCHES THE   */ 02505000
         ST    @12,PROCSIOT                                        1010 02506000
*/* DSDR DDNAME, RETURN THE ADDRESS OF THE NEW SIOT TO PROCESS       */ 02507000
*                                                                  1011 02508000
*             END;                                                 1011 02509000
*           ELSE                                                   1012 02510000
*             DO;                                                  1012 02511000
         B     @RC01007                                            1012 02512000
@RF01007 DS    0H                                                  1013 02513000
*               IF(CURNSIOT=SAVEL|(RESTYPE=ON&EVAL(CURNSIOT+REALADD)->  02514000
*                   SCTDDNAM=BLANKS)) THEN                         1013 02515000
         L     @12,CURNSIOT                                        1013 02516000
         SLR   @11,@11                                             1013 02517000
         ICM   @11,7,SAVEL                                         1013 02518000
         CR    @12,@11                                             1013 02519000
         BE    @RT01013                                            1013 02520000
         TM    RESTYPE,B'10000000'                                 1013 02521000
         BNO   @RF01013                                            1013 02522000
         L     @11,REALADD-1                                       1013 02523000
         LA    @11,0(,@11)                                         1013 02524000
         ALR   @12,@11                                             1013 02525000
         CLC   SCTDDNAM(8,@12),@CC03776                            1013 02526000
         BNE   @RF01013                                            1013 02527000
@RT01013 DS    0H                                                  1014 02528000
*                 DO;                                              1014 02529000
*                   CALL NOMATCH;   /* GO BUILD IF DYNAMIC, OR PUT 1015 02530000
*                                      OUT ERROR MSG IF NOT  @YM07048*/ 02531000
         BAL   @14,NOMATCH                                         1015 02532000
*                   PROCSIOT=NEWSIOT;/* IF RETURN WAS MADE FROM    1016 02533000
*                                      NOMATCH,SET UP PTR TO NEW SIOT*/ 02534000
         L     @12,NEWSIOT-1                                       1016 02535000
         LA    @12,0(,@12)                                         1016 02536000
         ST    @12,PROCSIOT                                        1016 02537000
*                   IF NEWCCAT=ON THEN                             1017 02538000
         TM    NEWCCAT,B'10000000'                                 1017 02539000
         BNO   @RF01017                                            1017 02540000
*                     DO;                                          1018 02541000
*                       LALOCCTR=LALOCCTR+1;/*               @YM08159*/ 02542000
         LA    @11,1                                               1019 02543000
         AH    @11,LALOCCTR                                        1019 02544000
         STH   @11,LALOCCTR                                        1019 02545000
*                       EVAL(PROCSIOT+REALADD)->SCTDDINO=LALOCCTR; 1020 02546000
         L     @09,REALADD-1                                       1020 02547000
         LA    @09,0(,@09)                                         1020 02548000
         ALR   @12,@09                                             1020 02549000
         STH   @11,SCTDDINO(,@12)                                  1020 02550000
*                       RETURN;                                    1021 02551000
         B     @EL00012                                            1021 02552000
*                     END;                                         1022 02553000
*                 END;              /* CLOSE ERROR DO        @YM08668*/ 02554000
@RF01017 DS    0H                                                  1024 02555000
*               NEXTSIOT=(CURNSIOT+REALADD)->SCTPSIOT;/* PICK UP ADDR   02556000
*                                      OF THE NEXT SIOT ON THE CHAIN */ 02557000
@RF01013 L     @12,REALADD-1                                       1024 02558000
         LA    @12,0(,@12)                                         1024 02559000
         L     @11,CURNSIOT                                        1024 02560000
         ALR   @11,@12                                             1024 02561000
         SLR   @09,@09                                             1024 02562000
         ICM   @09,7,SCTPSIOT(@11)                                 1024 02563000
         ST    @09,NEXTSIOT                                        1024 02564000
*               IF NEXTSIOT=SAVEL THEN/* IF THE NEXT SIOT ON THE   1025 02565000
*                                      CHAIN IS THE LAST,TEST FOR  1025 02566000
*                                      ERROR NOW....                 */ 02567000
         SLR   @11,@11                                             1025 02568000
         ICM   @11,7,SAVEL                                         1025 02569000
         CR    @09,@11                                             1025 02570000
         BNE   @RF01025                                            1025 02571000
*                 IF EVAL(NEXTSIOT+REALADD)->SCTDDNAM^=DSDRDNAM THEN    02572000
         ALR   @09,@12                                             1026 02573000
         CLC   SCTDDNAM(8,@09),DSDRDNAM(IOBUFAD)                   1026 02574000
         BE    @RF01026                                            1026 02575000
*                   DO;                                            1027 02576000
*                     CALL NOMATCH; /* GO BUILD IF DYNAMIC, OR PUT 1028 02577000
*                                      OUT ERROR MSG IF NOT  @YM07048*/ 02578000
         BAL   @14,NOMATCH                                         1028 02579000
*                     PROCSIOT=NEWSIOT;/* IF RETURN WAS MADE FROM  1029 02580000
*                                      NOMATCH,SET UP PTR TO NEW SIOT*/ 02581000
         L     @12,NEWSIOT-1                                       1029 02582000
         LA    @12,0(,@12)                                         1029 02583000
         ST    @12,PROCSIOT                                        1029 02584000
*                     RETURN;                                      1030 02585000
         B     @EL00012                                            1030 02586000
*                   END;                                           1031 02587000
*                                                                  1031 02588000
*/* OTHERWISE, RECHAINING TAKES PLACE TO KEEP THE SIOT THAT          */ 02589000
*/* MATCHES (WHEN IT IS FOUND) IN THE PROPER PLACE ON CHAIN          */ 02590000
*                                                                  1032 02591000
*               EVAL(SCTLSIOT+REALADD)->SCTPSIOT=CURNSIOT;/* MAKE THE   02592000
*                                      OLD LAST ENTRY POINT TO THE 1032 02593000
*                                      NEW LAST ENTRY                */ 02594000
@RF01026 DS    0H                                                  1032 02595000
@RF01025 L     @12,CURNSIOT                                        1032 02596000
         L     @11,REALADD-1                                       1032 02597000
         LA    @11,0(,@11)                                         1032 02598000
         L     @09,SCTPTR                                          1032 02599000
         SLR   @15,@15                                             1032 02600000
         ICM   @15,7,SCTLSIOT(@09)                                 1032 02601000
         ALR   @15,@11                                             1032 02602000
         STCM  @12,7,SCTPSIOT(@15)                                 1032 02603000
*               SCTLSIOT=CURNSIOT;  /* POINT SCT TO NEW LAST         */ 02604000
         STCM  @12,7,SCTLSIOT(@09)                                 1033 02605000
*               IF SCTFSIOT=CURNSIOT THEN                          1034 02606000
         SLR   @15,@15                                             1034 02607000
         ICM   @15,7,SCTFSIOT(@09)                                 1034 02608000
         CR    @12,@15                                             1034 02609000
         BNE   @RF01034                                            1034 02610000
*                 DO;               /* IF THIS IS THE FIRST SIOT, AND   02611000
*                                      IT DOESNT MATCH, ADJUST SCT 1035 02612000
*                                      FOR FIRST SIOT                */ 02613000
*                   SCTFSIOT=(CURNSIOT+REALADD)->SCTPSIOT;/* POINT 1036 02614000
*                                      SCT TO THE NEW FIRST          */ 02615000
         ALR   @12,@11                                             1036 02616000
         MVC   SCTFSIOT(3,@09),SCTPSIOT(@12)                       1036 02617000
*                   CURNSIOT=ZEROPTR;/* GET READY TO RESTART AT TOP  */ 02618000
         SLR   @12,@12                                             1037 02619000
         ST    @12,CURNSIOT                                        1037 02620000
*                   PROCSIOT=ZEROPTR;/* RESET PROCSIOT FOR TOP       */ 02621000
         ST    @12,PROCSIOT                                        1038 02622000
*                 END;                                             1039 02623000
*                                                                  1039 02624000
*/* IF THIS WAS NOT THE FIRST OR THE LAST, ADJUST TO NEXT SIOT       */ 02625000
*                                                                  1040 02626000
*               ELSE                                               1040 02627000
*                 EVAL(PROCSIOT+REALADD)->SCTPSIOT=NEXTSIOT;/* PICK     02628000
*                                      UP THE NEW SIOT ADDRESS FOR 1040 02629000
*                                      SEARCH                        */ 02630000
         B     @RC01034                                            1040 02631000
@RF01034 L     @12,REALADD-1                                       1040 02632000
         LA    @12,0(,@12)                                         1040 02633000
         AL    @12,PROCSIOT                                        1040 02634000
         MVC   SCTPSIOT(3,@12),NEXTSIOT+1                          1040 02635000
*             END;                                                 1041 02636000
@RC01034 DS    0H                                                  1042 02637000
*         END;                                                     1042 02638000
@RC01007 DS    0H                                                  1042 02639000
@DE01000 TM    DOUBLDD,B'10000000'                                 1042 02640000
         BNO   @DL01000                                            1042 02641000
*       END;                                                       1043 02642000
*   IF EVAL(PROCSIOT+REALADD)->SIOTJSCT=ON/*                 @YM07584*/ 02643000
*     THEN                                                         1044 02644000
@RC00988 L     @12,PROCSIOT                                        1044 02645000
         L     @11,REALADD-1                                       1044 02646000
         LA    @11,0(,@11)                                         1044 02647000
         LR    @09,@12                                             1044 02648000
         ALR   @09,@11                                             1044 02649000
         TM    SIOTJSCT(@09),B'00000001'                           1044 02650000
         BNO   @RF01044                                            1044 02651000
*     DO;                           /* PUT DDNUMBER INTO J/S CAT     */ 02652000
*       LALOCCTR=LALOCCTR+1;        /*                       @YM08159*/ 02653000
         LA    @09,1                                               1046 02654000
         AH    @09,LALOCCTR                                        1046 02655000
         STH   @09,LALOCCTR                                        1046 02656000
*       EVAL(PROCSIOT+REALADD)->SCTDDINO=LALOCCTR;                 1047 02657000
         ALR   @12,@11                                             1047 02658000
         STH   @09,SCTDDINO(,@12)                                  1047 02659000
*       IGNORE=ON;                  /* TELL MERGMAIN TO IGNORE THIS     02660000
*                                      JOBCAT OR STEPCAT SIOT        */ 02661000
         OI    IGNORE,B'10000000'                                  1048 02662000
*     END;                                                         1049 02663000
*   END SIOTSCAN;                                                  1050 02664000
         B     @EL00012                                            1050 02665000
*SIOTPROC:                                                         1051 02666000
*   PROC;                                                          1051 02667000
*                                                                  1051 02668000
SIOTPROC STM   @14,@12,@SA00013                                    1051 02669000
*/*************************************************************      */ 02670000
*/* THIS PROCEDURE PERFORMS THE NECESSARY UPDATES TO THE SIOT        */ 02671000
*/*    AFTER A MATCH TO THE DSDR HAS BEEN MADE.  THIS PROC IS        */ 02672000
*/*    CALLED BY MERGMAIN.  THE SVA OF THE SIOT TO BE UPDATED        */ 02673000
*/*    IS THE VARIABLE PROCSIOT PRODUCED BY THE PROC SIOTSCAN.       */ 02674000
*/*************************************************************      */ 02675000
*                                                                  1052 02676000
*   SWVA=PROCSIOT;                  /* SVA FOR READ                  */ 02677000
         L     @12,SWEPAPTR                                        1052 02678000
         MVC   SWVA(3,@12),PROCSIOT+1                              1052 02679000
*   CALL READSWA;                   /* GET SIOT VIA SWAMGR           */ 02680000
         BAL   @14,READSWA                                         1053 02681000
*   SIOTPTR=SWBLKPTR;               /* ADDRESSABILITY SIOT           */ 02682000
         L     @12,SWEPAPTR                                        1054 02683000
         L     @12,SWBLKPTR(,@12)                                  1054 02684000
         ST    @12,SIOTPTR                                         1054 02685000
*   IF RESTYPE=ON THEN              /* IF DEFERRED, TEST DDNAME FOR     02686000
*                                      AUTO AFTER DEFERRED SETUP   1055 02687000
*                                                            @YM08167*/ 02688000
         TM    RESTYPE,B'10000000'                                 1055 02689000
         BNO   @RF01055                                            1055 02690000
*     IF SCTDDNAM=SAVEDD THEN       /* IS THE ENTRY FOR CKPT DS ?    */ 02691000
         CLC   SCTDDNAM(8,@12),SAVEDD                              1056 02692000
         BNE   @RF01056                                            1056 02693000
*       JCTCKTTR=SCTPJFCB;          /* STORE JFCB ADDR               */ 02694000
         L     @11,JCTPTR                                          1057 02695000
         MVC   JCTCKTTR(3,@11),SCTPJFCB(@12)                       1057 02696000
*   SWVA=SCTPJFCB;                  /* SET UP FOR JFCB READ          */ 02697000
@RF01056 DS    0H                                                  1058 02698000
@RF01055 L     @12,SWEPAPTR                                        1058 02699000
         L     @11,SIOTPTR                                         1058 02700000
         MVC   SWVA(3,@12),SCTPJFCB(@11)                           1058 02701000
*   CALL READSWA;                   /* READ MATCHING JFCB            */ 02702000
         BAL   @14,READSWA                                         1059 02703000
*   JFCBPTR=SWBLKPTR;               /* ADDRESSABILITY FOR JFCB       */ 02704000
         L     @12,SWEPAPTR                                        1060 02705000
         L     @12,SWBLKPTR(,@12)                                  1060 02706000
         ST    @12,JFCBPTR                                         1060 02707000
*   LALOCCTR=LALOCCTR+1;            /* KEEP ACCURATE COUNT OF DD'S   */ 02708000
         LA    @12,1                                               1061 02709000
         AH    @12,LALOCCTR                                        1061 02710000
         STH   @12,LALOCCTR                                        1061 02711000
*   SCTDDINO=LALOCCTR;              /* INSURE INCREMENTAL,ASCENDING     02712000
*                                      INTERNAL DD NUMBERS.          */ 02713000
         L     @11,SIOTPTR                                         1062 02714000
         STH   @12,SCTDDINO(,@11)                                  1062 02715000
*   DJFCBPTR=ADDR(DSDRJFCB);        /* ADDRABILITY FOR DSDR JFCB     */ 02716000
         LA    @12,DSDRJFCB(,IOBUFAD)                              1063 02717000
         ST    @12,DJFCBPTR                                        1063 02718000
*   IF DSDRCCAT=ON THEN             /* IF THE CONCAT INDICATOR WAS   */ 02719000
         TM    DSDRCCAT(IOBUFAD),B'01000000'                       1064 02720000
         BNO   @RF01064                                            1064 02721000
*     SIOTCCAT=ON;                  /* SET AT CHKPT, TURN IT ON FOR     02722000
*                                      ALLOCATION.                   */ 02723000
         L     @12,SIOTPTR                                         1065 02724000
         OI    SIOTCCAT(@12),B'00100000'                           1065 02725000
*   SCTSDISP=DSDRDISP;              /* RESTORE DISPOSITION FIELD     */ 02726000
@RF01064 L     @12,SIOTPTR                                         1066 02727000
         MVC   SCTSDISP(1,@12),DSDRDISP(IOBUFAD)                   1066 02728000
*   SCTSBYT3=DSDRBYT3;              /* RESTORE STATUS FIELD          */ 02729000
         MVC   SCTSBYT3(1,@12),DSDRBYT3(IOBUFAD)                   1067 02730000
*   SIOTALTD=DSDRALTD;              /* RESTORE ALTERNATE DISP FIELD  */ 02731000
         MVC   SIOTALTD(1,@12),DSDRALTD(IOBUFAD)                   1068 02732000
*   IF DSDROCKP=ON THEN             /* RESTORE OPEN-AT-CHKPT BIT FOR */ 02733000
         TM    DSDROCKP(IOBUFAD),B'00100000'                       1069 02734000
         BNO   @RF01069                                            1069 02735000
*     SIOTOCKP=ON;                  /* RESTART SVC IF NECESSARY.     */ 02736000
         OI    SIOTOCKP(@12),B'10000000'                           1070 02737000
*   IF(SIOVAMDS=NOTON               /* UNITTYPE FIELD WILL NOT BE    */ 02738000
*       &SIOTSSDS=NOTON)            /* OVERLAYED FROM THE DSDR FOR   */ 02739000
*     THEN                                                         1071 02740000
@RF01069 L     @12,SIOTPTR                                         1071 02741000
         TM    SIOVAMDS(@12),B'00100000'                           1071 02742000
         BNZ   @RF01071                                            1071 02743000
         TM    SIOTSSDS(@12),B'10000000'                           1071 02744000
         BNZ   @RF01071                                            1071 02745000
*     CALL UTYPPROC;                /* VAM DATASETS OR SUB-SYSTEM DS */ 02746000
         BAL   @14,UTYPPROC                                        1072 02747000
*   IF(SCTVREF=ON                   /* ONLY LEAVE VOL REF VALID IF   */ 02748000
*       &SCTVOLAF=ON                /* REQUESTED AND NO VOLUMES ARE  */ 02749000
*       &(DJFCBPTR->JFCBVOLS(1)=FOXES|/*                     @YM08115*/ 02750000
*       DJFCBPTR->JFCBVOLS(1)=BLANKS))/* SHOWN IN THE JFCB (OR FFTTR    02751000
*                                      EXISTS)                       */ 02752000
*     THEN                                                         1073 02753000
@RF01071 L     @12,SIOTPTR                                         1073 02754000
         TM    SCTVREF(@12),B'00010000'                            1073 02755000
         BNO   @RF01073                                            1073 02756000
         TM    SCTVOLAF(@12),B'00100000'                           1073 02757000
         BNO   @RF01073                                            1073 02758000
         L     @12,DJFCBPTR                                        1073 02759000
         CLI   JFCBVOLS(@12),X'FF'                                 1073 02760000
         BE    @RT01073                                            1073 02761000
         L     @12,DJFCBPTR                                        1073 02762000
         CLI   JFCBVOLS(@12),C' '                                  1073 02763000
         BNE   @RF01073                                            1073 02764000
@RT01073 DS    0H                                                  1074 02765000
*     SCTDSNRF=NOTON;                                              1074 02766000
         L     @12,SIOTPTR                                         1074 02767000
         NI    SCTDSNRF(@12),B'01111111'                           1074 02768000
*   ELSE                                                           1075 02769000
*     IF SCTVOLAF=ON THEN                                          1075 02770000
         B     @RC01073                                            1075 02771000
@RF01073 L     @12,SIOTPTR                                         1075 02772000
         TM    SCTVOLAF(@12),B'00100000'                           1075 02773000
         BNO   @RF01075                                            1075 02774000
*       DO;                         /* DO NOT PROCESS UNLESS VOLREF     02775000
*                                      WAS DIS-ALLOWED       @YM07546*/ 02776000
*         SCTVREF=NOTON;            /* TURN OFF VREF/SUBALLOC      1077 02777000
*                                                            @YM04969*/ 02778000
*         SCTDSNRF=NOTON;                                          1078 02779000
         NI    SCTVREF(@12),B'01101111'                            1078 02780000
*         SCTVOLAF=NOTON;           /* TURN OFF ALL INDICATORS       */ 02781000
         NI    SCTVOLAF(@12),B'11011111'                           1079 02782000
*         SIOTDEVT=DSDRUTYP;        /* OVERLAY UNITTYPE      @YM06084*/ 02783000
         MVC   SIOTDEVT(4,@12),DSDRUTYP(IOBUFAD)                   1080 02784000
*         SIOUCNVT=0;               /* SHOW CONVERSION DONE          */ 02785000
         MVI   SIOUCNVT(@12),X'00'                                 1081 02786000
*         SIOUCBAD=ZEROPTR;         /* ZERO UCBADDR          @YM06084*/ 02787000
         SLR   @11,@11                                             1082 02788000
         STCM  @11,7,SIOUCBAD(@12)                                 1082 02789000
*         CALL BITSOFF;             /* CHECK FOR BAD BITS    @YM06574*/ 02790000
         BAL   @14,BITSOFF                                         1083 02791000
*       END;                                                       1084 02792000
*                                                                  1084 02793000
*/* NEW DATA SETS WITH NO DISPOSITION WILL BE MARKED DELETE          */ 02794000
*                                                                  1085 02795000
*   IF SCTSNEW=ON THEN                                             1085 02796000
@RF01075 DS    0H                                                  1085 02797000
@RC01073 L     @12,SIOTPTR                                         1085 02798000
         TM    SCTSNEW(@12),B'00000100'                            1085 02799000
         BNO   @RF01085                                            1085 02800000
*     IF SIOTPASS=NOTON THEN                                       1086 02801000
         TM    SIOTPASS(@12),B'00010000'                           1086 02802000
         BNZ   @RF01086                                            1086 02803000
*       IF SIOTKEEP=NOTON THEN                                     1087 02804000
         TM    SIOTKEEP(@12),B'00001000'                           1087 02805000
         BNZ   @RF01087                                            1087 02806000
*         IF SIOTDLET=NOTON THEN                                   1088 02807000
         TM    SIOTDLET(@12),B'00000100'                           1088 02808000
         BNZ   @RF01088                                            1088 02809000
*           IF SIOTCTLG=NOTON THEN                                 1089 02810000
         TM    SIOTCTLG(@12),B'00000010'                           1089 02811000
         BNZ   @RF01089                                            1089 02812000
*             IF SIOTUNCT=NOTON THEN                               1090 02813000
         TM    SIOTUNCT(@12),B'00000001'                           1090 02814000
         BNZ   @RF01090                                            1090 02815000
*               SIOTDLET=ON;                                       1091 02816000
*                                                                  1091 02817000
         OI    SIOTDLET(@12),B'00000100'                           1091 02818000
*/* HANDLE PUBLIC/PRIVATE DECISION FOR TAPES                         */ 02819000
*                                                                  1092 02820000
*   IF(DSDRTAPE=ON                  /* IS THIS TAPE                  */ 02821000
*       &SIOTPRIV^=ON)              /* AND PRIV NOT REQ      @YM08162*/ 02822000
*     THEN                          /* YES....                       */ 02823000
@RF01090 DS    0H                                                  1092 02824000
@RF01089 DS    0H                                                  1092 02825000
@RF01088 DS    0H                                                  1092 02826000
@RF01087 DS    0H                                                  1092 02827000
@RF01086 DS    0H                                                  1092 02828000
@RF01085 TM    DSDRTAPE(IOBUFAD),B'10000000'                       1092 02829000
         BNO   @RF01092                                            1092 02830000
         L     @12,SIOTPTR                                         1092 02831000
         TM    SIOTPRIV(@12),B'00100000'                           1092 02832000
         BO    @RF01092                                            1092 02833000
*     SIOTNPRV=ON;                  /* TURN ON NOT PRIVATE           */ 02834000
         OI    SIOTNPRV(@12),B'00010000'                           1093 02835000
*/**************************************************************     */ 02836000
*/* SHOULD THE DATA SET'S STATUS BE CHANGED FROM NEW TO OLD ??       */ 02837000
*/**************************************************************     */ 02838000
*/**************************************                             */ 02839000
*/* HASP EXPECTS SYSOUT TO LOOK OLD...                               */ 02840000
*/**************************************                             */ 02841000
*                                                                  1094 02842000
*   IF SCTSYSOU=ON THEN             /* IS THIS SYSOUT REQUEST      1094 02843000
*                                                            @ZA06466*/ 02844000
@RF01092 L     @12,SIOTPTR                                         1094 02845000
         TM    SCTSYSOU(@12),B'00001000'                           1094 02846000
         BNO   @RF01094                                            1094 02847000
*     IF RESTYPE=NOTON THEN         /* IS RESTART DEFERRED   @ZA06466*/ 02848000
         TM    RESTYPE,B'10000000'                                 1095 02849000
         BNZ   @RF01095                                            1095 02850000
*       DO;                         /* SETUP FOR AUTORESTART @ZA06466*/ 02851000
*         SCTSNEW=NOTON;            /* TURN NEW OFF FOR JES  @ZA06466*/ 02852000
*         SCTSOLD=ON;               /* TURN OLD ON FOR JES   @ZA06466*/ 02853000
         OI    SCTSOLD(@12),B'00000001'                            1098 02854000
         NI    SCTSNEW(@12),B'11111011'                            1098 02855000
*       END;                        /*                       @ZA06466*/ 02856000
*     ELSE                          /* RESTART IS DEFERRED   @ZA06466*/ 02857000
*       DO;                         /* SETUP FOR DEFERRED    @ZA06466*/ 02858000
         B     @RC01095                                            1100 02859000
@RF01095 DS    0H                                                  1101 02860000
*         SCTSOLD=NOTON;            /* TURN OLD OFF FOR JES  @ZA06466*/ 02861000
*         SCTSNEW=ON;               /* TURN NEW ON FOR JES   @ZA06466*/ 02862000
         L     @12,SIOTPTR                                         1102 02863000
         OI    SCTSNEW(@12),B'00000100'                            1102 02864000
         NI    SCTSOLD(@12),B'11111110'                            1102 02865000
*       END;                        /*                       @ZA06466*/ 02866000
*   ELSE                                                           1104 02867000
*     ;                             /*                       @ZA06466*/ 02868000
@RF01094 DS    0H                                                  1105 02869000
*/* NOW TEST OTHER NEW TO OLD CANDIDATES                             */ 02870000
*                                                                  1105 02871000
*   IF SCTSNEW=ON THEN              /* IS STATUS NEW...?             */ 02872000
@RC01094 L     @12,SIOTPTR                                         1105 02873000
         TM    SCTSNEW(@12),B'00000100'                            1105 02874000
         BNO   @RF01105                                            1105 02875000
*     DO;                                                          1106 02876000
*       IF DSDRTAPE=ON THEN         /* SPECIAL CASE FOR TAPES...     */ 02877000
         TM    DSDRTAPE(IOBUFAD),B'10000000'                       1107 02878000
         BNO   @RF01107                                            1107 02879000
*         IF DJFCBPTR->JFCBVOLS(1)^=FOXES THEN/* (A)                 */ 02880000
         L     @11,DJFCBPTR                                        1108 02881000
         CLI   JFCBVOLS(@11),X'FF'                                 1108 02882000
         BE    @RF01108                                            1108 02883000
*           IF DJFCBPTR->JFCBNVOL^=0 THEN/* (B)                      */ 02884000
*                                                                  1109 02885000
         L     @11,DJFCBPTR                                        1109 02886000
         CLI   JFCBNVOL(@11),0                                     1109 02887000
         BE    @RF01109                                            1109 02888000
*             /*******************************************************/ 02889000
*             /*                                                     */ 02890000
*             /* VOLREF TAPES NEVER OPENED WOULD HAVE THE FOXFOXTTR  */ 02891000
*             /* AND NOT QUALIFY FOR OLD STATUS. NOR WOULD NEW WITH  */ 02892000
*             /* NO-VOLS                                             */ 02893000
*             /*                                                     */ 02894000
*             /*******************************************************/ 02895000
*                                                                  1110 02896000
*             DO;                                                  1110 02897000
*               SCTSNEW=NOTON;      /* TURN OFF NEW                  */ 02898000
*               SCTSOLD=ON;         /* TURN ON OLD.                  */ 02899000
         OI    SCTSOLD(@12),B'00000001'                            1112 02900000
         NI    SCTSNEW(@12),B'11111011'                            1112 02901000
*               SCTVOLCT=DJFCBPTR->JFCBNVOL;/* REPLACE VOL CT      1113 02902000
*                                                            @YM05442*/ 02903000
         L     @11,DJFCBPTR                                        1113 02904000
         IC    @09,JFCBNVOL(,@11)                                  1113 02905000
         STC   @09,SCTVOLCT(,@12)                                  1113 02906000
*             END;                                                 1114 02907000
*           ELSE                                                   1115 02908000
*             ;                     /* CLOSE (B)                     */ 02909000
@RF01109 DS    0H                                                  1116 02910000
*         ELSE                                                     1116 02911000
*           ;                       /* CLOSE (A)             @YM03548*/ 02912000
@RF01108 DS    0H                                                  1117 02913000
*       ELSE                                                       1117 02914000
*         IF DJFCBPTR->JFCVRDS=ON   /* IS THIS A VAM DATASET?        */ 02915000
*           THEN                                                   1117 02916000
         B     @RC01107                                            1117 02917000
@RF01107 L     @12,DJFCBPTR                                        1117 02918000
         TM    JFCVRDS(@12),B'00000100'                            1117 02919000
         BNO   @RF01117                                            1117 02920000
*           IF SIOUCBAD^=0 THEN     /* NOT SCRATCHED                 */ 02921000
         L     @12,SIOTPTR                                         1118 02922000
         L     @11,SIOUCBAD-1(,@12)                                1118 02923000
         LA    @11,0(,@11)                                         1118 02924000
         LTR   @11,@11                                             1118 02925000
         BZ    @RF01118                                            1118 02926000
*             DO;                                                  1119 02927000
*               SCTSNEW=NOTON;      /* TURN OFF NEW                  */ 02928000
*               SCTSOLD=ON;         /* TURN ON OLD                   */ 02929000
         OI    SCTSOLD(@12),B'00000001'                            1121 02930000
         NI    SCTSNEW(@12),B'11111011'                            1121 02931000
*               DJFCBPTR->JFCBNVOL=ONEVOL;/* SET VOLS TO ONE         */ 02932000
         L     @12,DJFCBPTR                                        1122 02933000
         MVI   JFCBNVOL(@12),X'01'                                 1122 02934000
*               SCTVOLCT=DJFCBPTR->JFCBNVOL;/* REPLACE VOL COUNT     */ 02935000
         L     @12,DJFCBPTR                                        1123 02936000
         IC    @11,JFCBNVOL(,@12)                                  1123 02937000
         L     @12,SIOTPTR                                         1123 02938000
         STC   @11,SCTVOLCT(,@12)                                  1123 02939000
*             END;                                                 1124 02940000
*           ELSE                                                   1125 02941000
*             ;                     /* CLOSE SIOUCBAD ^= 0           */ 02942000
@RF01118 DS    0H                                                  1126 02943000
*         ELSE                                                     1126 02944000
*           IF DJFCBPTR->JFCBNVOL>0 THEN                           1126 02945000
         B     @RC01117                                            1126 02946000
@RF01117 L     @12,DJFCBPTR                                        1126 02947000
         CLI   JFCBNVOL(@12),0                                     1126 02948000
         BNH   @RF01126                                            1126 02949000
*             DO;                   /* OTHER NEW DATASETS WITH       */ 02950000
*               SCTSNEW=NOTON;      /* VOLUMES BECOME OLD.           */ 02951000
*               SCTSOLD=ON;                                        1129 02952000
         L     @12,SIOTPTR                                         1129 02953000
         OI    SCTSOLD(@12),B'00000001'                            1129 02954000
         NI    SCTSNEW(@12),B'11111011'                            1129 02955000
*               SCTVOLCT=DJFCBPTR->JFCBNVOL;/* REPLACE VOLCT @YM05442*/ 02956000
         L     @11,DJFCBPTR                                        1130 02957000
         IC    @09,JFCBNVOL(,@11)                                  1130 02958000
         STC   @09,SCTVOLCT(,@12)                                  1130 02959000
*             END;                                                 1131 02960000
*     END;                                                         1132 02961000
*   ELSE                                                           1133 02962000
*     IF DJFCBPTR->JFCBVOLS(1)^=FOXES THEN/*                 @YM08115*/ 02963000
         B     @RC01105                                            1133 02964000
@RF01105 L     @12,DJFCBPTR                                        1133 02965000
         CLI   JFCBVOLS(@12),X'FF'                                 1133 02966000
         BE    @RF01133                                            1133 02967000
*       SCTVOLCT=DJFCBPTR->JFCBNVOL;/* EVEN OLD DATASETS MAY HAVE  1134 02968000
*                                      VOLS ON RESTART       @YM07346*/ 02969000
         L     @12,DJFCBPTR                                        1134 02970000
         IC    @11,JFCBNVOL(,@12)                                  1134 02971000
         L     @12,SIOTPTR                                         1134 02972000
         STC   @11,SCTVOLCT(,@12)                                  1134 02973000
*   IF DJFCBPTR->JFCORGAM=ON THEN   /* FOR VSAM DATASETS     @YM08627*/ 02974000
@RF01133 DS    0H                                                  1135 02975000
@RC01105 L     @12,DJFCBPTR                                        1135 02976000
         TM    JFCORGAM(@12),B'00001000'                           1135 02977000
         BNO   @RF01135                                            1135 02978000
*     SCTVOLCT=0;                   /* FORCE CATALOG RETRIEVE        */ 02979000
         L     @12,SIOTPTR                                         1136 02980000
         MVI   SCTVOLCT(@12),X'00'                                 1136 02981000
*   IF SCTUTYPE=BLANKS THEN         /* NO UNIT SPECIFIED ?   @YM07591*/ 02982000
@RF01135 L     @12,SIOTPTR                                         1137 02983000
         CLC   SCTUTYPE(8,@12),@CC03776                            1137 02984000
         BNE   @RF01137                                            1137 02985000
*     DO;                                                          1138 02986000
*       SIOTDEVT=DSDRUTYP;          /* PICK UP A UTYPE       @YM07591*/ 02987000
         MVC   SIOTDEVT(4,@12),DSDRUTYP(IOBUFAD)                   1139 02988000
*       SIOUCNVT=0;                 /* SHOW CONVERTED        @YM07591*/ 02989000
         MVI   SIOUCNVT(@12),X'00'                                 1140 02990000
*       SIOUCBAD=ZEROPTR;           /* ZERO UCB              @YM07591*/ 02991000
         SLR   @11,@11                                             1141 02992000
         STCM  @11,7,SIOUCBAD(@12)                                 1141 02993000
*       CALL BITSOFF;               /* INSURE EDT MATCH      @YM07591*/ 02994000
         BAL   @14,BITSOFF                                         1142 02995000
*     END;                                                         1143 02996000
*   IF SCTSGDGS=NOTON THEN          /* DONT WORRY ABOUT CATALOG FOR     02997000
*                                      GDG SINGLE            @YM07511*/ 02998000
@RF01137 L     @12,SIOTPTR                                         1144 02999000
         TM    SCTSGDGS(@12),B'10000000'                           1144 03000000
         BNZ   @RF01144                                            1144 03001000
*     IF(DJFCBPTR->JFCGDG=ON        /* IF THIS IS GDG MOTHER SET UP  */ 03002000
*         &DJFCBPTR->JFCENT=NOTON)  /* TO CAUSE HOUSEKEEPING TO USE     03003000
*                                      THE CATALOG                   */ 03004000
*       THEN                                                       1145 03005000
         L     @11,DJFCBPTR                                        1145 03006000
         TM    JFCGDG(@11),B'00000010'                             1145 03007000
         BNO   @RF01145                                            1145 03008000
         L     @11,DJFCBPTR                                        1145 03009000
         TM    JFCENT(@11),B'00000100'                             1145 03010000
         BNZ   @RF01145                                            1145 03011000
*       DO;                                                        1146 03012000
*         JFCBNVOL=0;               /* ZERO OUT NUM OF VOLS          */ 03013000
         L     @11,JFCBPTR                                         1147 03014000
         MVI   JFCBNVOL(@11),X'00'                                 1147 03015000
*         JFCBVLCT=ONEVOL;          /* VOLUME COUNT TO ONE           */ 03016000
         MVI   JFCBVLCT(@11),X'01'                                 1148 03017000
*         JFCAVOLS(1)=BLANKS;       /* SET FIRST VOLSER TO BLANK.    */ 03018000
         MVC   JFCAVOLS(6,@11),@CC03776                            1149 03019000
*         SIOTVLCT=ONEVOL;          /* SIOT AND JFCB AGREE           */ 03020000
         MVI   SIOTVLCT(@12),X'01'                                 1150 03021000
*         SCTVOLCT=0;               /* CATALOG TRIGGER       @YM08169*/ 03022000
         MVI   SCTVOLCT(@12),X'00'                                 1151 03023000
*         JFCCAT=NOTON;             /* MAKE HSKEEP RETURN INFO-    1152 03024000
*                                      MATION IF GDGALL      @ZA12714*/ 03025000
         NI    JFCCAT(@11),B'01111111'                             1152 03026000
*       END;                                                       1153 03027000
*   END SIOTPROC;                                                  1154 03028000
@EL00013 DS    0H                                                  1154 03029000
@EF00013 DS    0H                                                  1154 03030000
@ER00013 LM    @14,@12,@SA00013                                    1154 03031000
         BR    @14                                                 1154 03032000
*UTYPPROC:                                                         1155 03033000
*   PROC;                                                          1155 03034000
*                                                                  1155 03035000
UTYPPROC STM   @14,@12,@SA00014                                    1155 03036000
*/**************************************************************     */ 03037000
*/* THIS PROC DECIDES WHETHER TO USE THE UNIT TYPE FOUND IN THE JCL  */ 03038000
*/* OR USE THE UNIT TYPE FOUND IN THE SIOT IN SWA.                   */ 03039000
*/**************************************************************     */ 03040000
*                                                                  1156 03041000
*   IF(SCTUNAFF=ON                  /* IF UNIT AFFINITY WAS        1156 03042000
*                                      ORIGINALLY REQUESTED...       */ 03043000
*       &SIOTUNAF=0) THEN           /* BUT DDNTPROC DETECTED THAT THE   03044000
*                                      AFFINITY WAS INVALID...       */ 03045000
         L     @12,SIOTPTR                                         1156 03046000
         TM    SCTUNAFF(@12),B'00000010'                           1156 03047000
         BNO   @RF01156                                            1156 03048000
         SLR   @11,@11                                             1156 03049000
         CH    @11,SIOTUNAF(,@12)                                  1156 03050000
         BNE   @RF01156                                            1156 03051000
*     DO;                           /* INDICATE THAT THE DD NUMBER 1157 03052000
*                                      WAS NOT FOUND AND THE AFFINITY   03053000
*                                      REQUESTED IS ALLOWED.       1157 03054000
*                                      OTHERWISE....                 */ 03055000
*       SCTUNAFF=NOTON;             /* TURN OFF UNIT AFF REQUEST     */ 03056000
         NI    SCTUNAFF(@12),B'11111101'                           1158 03057000
*       SIOTUNAF=0;                 /* TAKE OUT THE DD NUM.          */ 03058000
         STH   @11,SIOTUNAF(,@12)                                  1159 03059000
*       JFCBUAFF=NOTON;             /* TURN OFF REQUEST IN JFCB      */ 03060000
         L     @09,JFCBPTR                                         1160 03061000
         NI    JFCBUAFF(@09),B'11111110'                           1160 03062000
*       SIOTDEVT=DSDRUTYP;          /* OVERLAY UNITTYPE WITH DSDR. 1161 03063000
*                                      (RESTORES UNIT THAT WAS IN  1161 03064000
*                                      EFFECT AT CHKPT TIME.)        */ 03065000
         MVC   SIOTDEVT(4,@12),DSDRUTYP(IOBUFAD)                   1161 03066000
*       SIOUCNVT=0;                 /* TELL HSKP'ING THAT CONVERSION    03067000
*                                      HAS ALREADY BEEN DONE         */ 03068000
         MVI   SIOUCNVT(@12),X'00'                                 1162 03069000
*       SIOUCBAD=ZEROPTR;           /* ZERO OUT UCB POINTER          */ 03070000
         STCM  @11,7,SIOUCBAD(@12)                                 1163 03071000
*       CALL BITSOFF;               /* TURN OFF UNNEEDED BITS      1164 03072000
*                                                            @YM06547*/ 03073000
         BAL   @14,BITSOFF                                         1164 03074000
*     END;                                                         1165 03075000
*                                                                  1165 03076000
*/* DO NOT ALLOW TAPE DATASETS THAT WERE WRITTEN AT 1600 OR 6250     */ 03077000
*/*    DEFAULT DENSITY TO REVERT TO ANOTHER DENSITY AT RESTART.      */ 03078000
*                                                                  1166 03079000
*   ELSE                                                           1166 03080000
*     DO;                                                          1166 03081000
         B     @RC01156                                            1166 03082000
@RF01156 DS    0H                                                  1167 03083000
*       DJFCBPTR=ADDR(DSDRJFCB);    /* INSURE ADDR'ABILITY FOR DSDR  */ 03084000
         LA    @12,DSDRJFCB(,IOBUFAD)                              1167 03085000
         ST    @12,DJFCBPTR                                        1167 03086000
*       IF S3400DSP=NOTON THEN      /* S3400DSP OFF AT CHECKPOINT  1168 03087000
*                                                            @ZA13854*/ 03088000
         L     @12,SIOTPTR                                         1168 03089000
         TM    S3400DSP(@12),B'01000000'                           1168 03090000
         BNZ   @RF01168                                            1168 03091000
*         S3400OFF=ON;              /* TELL ALLOC TO INITIALIZE    1169 03092000
*                                      S3400DSP TO OFF       @ZA13854*/ 03093000
         OI    S3400OFF(@12),B'00010000'                           1169 03094000
*       IF(SCTUTYPE(1:6)=TWTYFOUR)|(SCTUTYPE(1:6)=TWTYFOR3)|(SCTUTYPE(1 03095000
*           :6)=TRTYFOR3) THEN                                     1170 03096000
@RF01168 L     @12,SIOTPTR                                         1170 03097000
         CLC   SCTUTYPE(6,@12),@CC03909                            1170 03098000
         BE    @RT01170                                            1170 03099000
         CLC   SCTUTYPE(6,@12),@CC03911                            1170 03100000
         BE    @RT01170                                            1170 03101000
         CLC   SCTUTYPE(6,@12),@CC03913                            1170 03102000
         BNE   @RF01170                                            1170 03103000
@RT01170 DS    0H                                                  1171 03104000
*         DO;                       /* IF 2400,2400-3,OR3400-3...    */ 03105000
*           IF SCTUTYPE(1:6)=TWTYFOUR THEN                         1172 03106000
         L     @12,SIOTPTR                                         1172 03107000
         CLC   SCTUTYPE(6,@12),@CC03909                            1172 03108000
         BNE   @RF01172                                            1172 03109000
*             IF DJFCBPTR->JFCDEN='C3'X THEN                       1173 03110000
         L     @11,DJFCBPTR                                        1173 03111000
         CLI   JFCDEN(@11),X'C3'                                   1173 03112000
         BNE   @RF01173                                            1173 03113000
*               DO;                 /* 2400 WRITTEN AT 1600 BPI MUST    03114000
*                                      BE RESTORED FROM THE DSDR.    */ 03115000
*                 SIOTDEVT=DSDRUTYP;/* OVERLAY UNIT TYPE             */ 03116000
         MVC   SIOTDEVT(4,@12),DSDRUTYP(IOBUFAD)                   1175 03117000
*                 SIOUCNVT=0;       /* SHOW CONVERSION IS DONE       */ 03118000
         MVI   SIOUCNVT(@12),X'00'                                 1176 03119000
*                 SIOUCBAD=ZEROPTR; /* ZERO OUT UCB POINTER          */ 03120000
         SLR   @11,@11                                             1177 03121000
         STCM  @11,7,SIOUCBAD(@12)                                 1177 03122000
*                 CALL BITSOFF;     /* TURN OFF UNNEEDED BITS      1178 03123000
*                                                            @YM06547*/ 03124000
         BAL   @14,BITSOFF                                         1178 03125000
*               END;                                               1179 03126000
*             ELSE                                                 1180 03127000
*               ;                                                  1180 03128000
@RF01173 DS    0H                                                  1181 03129000
*           ELSE                                                   1181 03130000
*             IF DJFCBPTR->JFCDEN='D3'X THEN                       1181 03131000
         B     @RC01172                                            1181 03132000
@RF01172 L     @12,DJFCBPTR                                        1181 03133000
         CLI   JFCDEN(@12),X'D3'                                   1181 03134000
         BNE   @RF01181                                            1181 03135000
*               DO;                 /* 2400-3 OR 3400-3 WRITTEN AT 1182 03136000
*                                      6250 BPI MUST BE RESTORED FROM   03137000
*                                      THE DSDR.                     */ 03138000
*                 SIOTDEVT=DSDRUTYP;/* OVERLAY UNIT TYPE             */ 03139000
         L     @12,SIOTPTR                                         1183 03140000
         MVC   SIOTDEVT(4,@12),DSDRUTYP(IOBUFAD)                   1183 03141000
*                 SIOUCNVT=0;       /* SHOW CONVERSION IS DONE.      */ 03142000
         MVI   SIOUCNVT(@12),X'00'                                 1184 03143000
*                 SIOUCBAD=ZEROPTR; /* ZERO OUT UCB POINTER          */ 03144000
         SLR   @11,@11                                             1185 03145000
         STCM  @11,7,SIOUCBAD(@12)                                 1185 03146000
*                 CALL BITSOFF;     /* TURN OFF UNNEEDED BITS      1186 03147000
*                                                            @YM06547*/ 03148000
         BAL   @14,BITSOFF                                         1186 03149000
*               END;                                               1187 03150000
*         END;                                                     1188 03151000
*                                                                  1188 03152000
*/* IN OTHER CASES, THE ELIGIBLE DEVICES TABLE WILL BE SEARCHED      */ 03153000
*/*   TO DETERMINE  IF THERE ARE GENERIC GROUPING PROBLEMS.          */ 03154000
*                                                                  1189 03155000
*       ELSE                                                       1189 03156000
*         DO;                                                      1189 03157000
         B     @RC01170                                            1189 03158000
@RF01170 DS    0H                                                  1190 03159000
*           EDTPTR=ADDR(EDTTAB);    /* ADDR'ABILITY FOR EDT          */ 03160000
         L     @12,@CV03915                                        1190 03161000
         ST    @12,EDTPTR                                          1190 03162000
*           LUVPTR=EDTLUVSP+LENGTH(LUVHDR);/* INIT SEARCH PTR.       */ 03163000
         LA    @11,8                                               1191 03164000
         AL    @11,EDTLUVSP(,@12)                                  1191 03165000
         ST    @11,LUVPTR                                          1191 03166000
*           DO I=1 TO LUVENTNO-1 WHILE SCTUTYPE^=UNITNAME;         1192 03167000
         LA    @12,1                                               1192 03168000
         B     @DE01192                                            1192 03169000
@DL01192 L     @11,LUVPTR                                          1192 03170000
         L     @09,SIOTPTR                                         1192 03171000
         CLC   SCTUTYPE(8,@09),UNITNAME(@11)                       1192 03172000
         BE    @DC01192                                            1192 03173000
*             LUVPTR=LUVPTR+LUVENTLN;/* UPDATE PTR TO NEXT ENTRY     */ 03174000
         L     @09,EDTPTR                                          1193 03175000
         L     @09,EDTLUVSP(,@09)                                  1193 03176000
         AL    @11,LUVENTLN(,@09)                                  1193 03177000
         ST    @11,LUVPTR                                          1193 03178000
*           END;                                                   1194 03179000
         AL    @12,@CF00069                                        1194 03180000
@DE01192 ST    @12,I                                               1194 03181000
         L     @11,EDTPTR                                          1194 03182000
         L     @11,EDTLUVSP(,@11)                                  1194 03183000
         L     @11,LUVENTNO(,@11)                                  1194 03184000
         BCTR  @11,0                                               1194 03185000
         CR    @12,@11                                             1194 03186000
         BNH   @DL01192                                            1194 03187000
@DC01192 DS    0H                                                  1195 03188000
*           IF(SCTUTYPE=UNITNAME    /* WAS MATCH FOUND? (IF NOT, THE    03189000
*                                      REQUEST WAS SPECIFIC).        */ 03190000
*               &LUVGENNO>ONEHEX    /* MORE THAN ONE GENERIC IN GRP? */ 03191000
*               &LUVMGENS^=ON)      /* AND CROSS-ALLOCATION IS NOT 1195 03192000
*                                      ALLOWED, THEN OVERLAY IS NEC. */ 03193000
*             THEN                                                 1195 03194000
         L     @12,SIOTPTR                                         1195 03195000
         L     @11,LUVPTR                                          1195 03196000
         CLC   SCTUTYPE(8,@12),UNITNAME(@11)                       1195 03197000
         BNE   @RF01195                                            1195 03198000
         L     @09,LUVGENNO(,@11)                                  1195 03199000
         C     @09,@CF02945                                        1195 03200000
         BNH   @RF01195                                            1195 03201000
         TM    LUVMGENS(@11),B'00100000'                           1195 03202000
         BO    @RF01195                                            1195 03203000
*             DO;                                                  1196 03204000
*               SIOTDEVT=DSDRUTYP;  /* OVERLAY UNITTYPE              */ 03205000
         MVC   SIOTDEVT(4,@12),DSDRUTYP(IOBUFAD)                   1197 03206000
*               SIOUCNVT=0;         /* SHOW CONVERSION DONE.         */ 03207000
         MVI   SIOUCNVT(@12),X'00'                                 1198 03208000
*               SIOUCBAD=ZEROPTR;   /* ZERO OUT UCB POINTER          */ 03209000
         SLR   @11,@11                                             1199 03210000
         STCM  @11,7,SIOUCBAD(@12)                                 1199 03211000
*               CALL BITSOFF;       /* TURN OFF UNNEEDED BITS      1200 03212000
*                                                            @YM06547*/ 03213000
         BAL   @14,BITSOFF                                         1200 03214000
*             END;                                                 1201 03215000
*         END;                                                     1202 03216000
*     END;                                                         1203 03217000
*   END UTYPPROC;                                                  1204 03218000
@EL00014 DS    0H                                                  1204 03219000
@EF00014 DS    0H                                                  1204 03220000
@ER00014 LM    @14,@12,@SA00014                                    1204 03221000
         BR    @14                                                 1204 03222000
*JFCBPROC:                                                         1205 03223000
*   PROC OPTIONS(NOSAVE(IOBUFAD));                                 1205 03224000
*                                                                  1205 03225000
JFCBPROC STM   @14,@06,@SA00015                                    1205 03226000
         STM   @08,@12,@SA00015+36                                 1205 03227000
*/**************************************************************     */ 03228000
*/* THIS PROCEDURE RESTORES ALL FIELDS FROM THE JFCB ON THE CKPT     */ 03229000
*/* EXCEPT THE VOLUME INFORMATION...WHICH IS DONE IN 'VOLSERS'       */ 03230000
*/**************************************************************     */ 03231000
*                                                                  1206 03232000
*   DCL                                                            1206 03233000
*     JFCBEFLG CHAR(1) BDY(BYTE);   /* TEMP JFCBEXTP FLAG    @Z40MPSJ*/ 03234000
*   DCL                                                            1207 03235000
*     JFCBEON BIT(8) CONSTANT('80'X);/* JFCBEXTP VALUE       @Z40MPSJ*/ 03236000
*   DCL                                                            1208 03237000
*     ARITXNAM FIXED(31) DEFINED(JFCBXNAM) BDY(BYTE);              1208 03238000
*   JFCBTVOL=DJFCBPTR->JFCBVOLS(1); /* SAVE ONE BYTE         @ZA07018*/ 03239000
         L     @12,DJFCBPTR                                        1209 03240000
         IC    @11,JFCBVOLS(,@12)                                  1209 03241000
         STC   @11,JFCBTVOL                                        1209 03242000
*   JFCBTENQ=DJFCBPTR->JFCBIND2;    /* SAVE FOR ENQ          @ZA07018*/ 03243000
         L     @12,DJFCBPTR                                        1210 03244000
         IC    @11,JFCBIND2(,@12)                                  1210 03245000
         STC   @11,JFCBTENQ                                        1210 03246000
*   IF SCTDUMMY=NOTON THEN          /* DO NOT PROCESS JFCB FOR DUMMY */ 03247000
         L     @12,SIOTPTR                                         1211 03248000
         TM    SCTDUMMY(@12),B'10000000'                           1211 03249000
         BNZ   @RF01211                                            1211 03250000
*     IF(SCTSGDGS=ON|DJFCBPTR->JFCGDG=NOTON) THEN/* ONLY MERGE JFCB     03251000
*                                      FOR GDG SINGLE OR NONGDG, NOT    03252000
*                                      FOR GDGALL            @ZA06230*/ 03253000
         TM    SCTSGDGS(@12),B'10000000'                           1212 03254000
         BO    @RT01212                                            1212 03255000
         L     @12,DJFCBPTR                                        1212 03256000
         TM    JFCGDG(@12),B'00000010'                             1212 03257000
         BNZ   @RF01212                                            1212 03258000
@RT01212 DS    0H                                                  1213 03259000
*       DO;                                                        1213 03260000
*         IF(RESTYPE=ON             /* FOR DEFERRED RESTART,         */ 03261000
*             &DJFCBPTR->JFCVRDS=ON) THEN/* AND DATASET IS VAM..   1214 03262000
*                                                            @YM07524*/ 03263000
         TM    RESTYPE,B'10000000'                                 1214 03264000
         BNO   @RF01214                                            1214 03265000
         L     @12,DJFCBPTR                                        1214 03266000
         TM    JFCVRDS(@12),B'00000100'                            1214 03267000
         BNO   @RF01214                                            1214 03268000
*           CALL VAMERR;            /* DO NOT ALLOW THE RESTART.     */ 03269000
         BAL   @14,VAMERR                                          1215 03270000
*         IF(RESTYPE=ON|(RESTYPE=NOTON&JCTSYSCK=ON))/* FOR DEF. OR 1216 03271000
*                                      AUTO AFTER DEFERRED           */ 03272000
*             &(SCTSYSIN=ON|SCTSYSOU=ON) THEN/* & D.S. IS SYSIN OR 1216 03273000
*                                      OUT..                         */ 03274000
@RF01214 TM    RESTYPE,B'10000000'                                 1216 03275000
         BO    @GL00028                                            1216 03276000
         TM    RESTYPE,B'10000000'                                 1216 03277000
         BNZ   @RF01216                                            1216 03278000
         L     @12,JCTPTR                                          1216 03279000
         TM    JCTSYSCK(@12),B'10000000'                           1216 03280000
         BNO   @RF01216                                            1216 03281000
@GL00028 L     @12,SIOTPTR                                         1216 03282000
         TM    SCTSYSIN(@12),B'01000000'                           1216 03283000
         BO    @RT01216                                            1216 03284000
         TM    SCTSYSOU(@12),B'00001000'                           1216 03285000
         BNO   @RF01216                                            1216 03286000
@RT01216 DS    0H                                                  1217 03287000
*           IF(RESTYPE=ON&SCTSYSOU=ON) THEN/* DEF. AND SYSOUT..      */ 03288000
         TM    RESTYPE,B'10000000'                                 1217 03289000
         BNO   @RF01217                                            1217 03290000
         L     @12,SIOTPTR                                         1217 03291000
         TM    SCTSYSOU(@12),B'00001000'                           1217 03292000
         BNO   @RF01217                                            1217 03293000
*             JFCBNVOL=0;           /* NVOLS NOW ZERO.               */ 03294000
         L     @12,JFCBPTR                                         1218 03295000
         MVI   JFCBNVOL(@12),X'00'                                 1218 03296000
*           ELSE                                                   1219 03297000
*             ;                                                    1219 03298000
@RF01217 DS    0H                                                  1220 03299000
*         ELSE                                                     1220 03300000
*           JFCBDSNM=DJFCBPTR->JFCBDSNM;/* MERGE DSNAME.             */ 03301000
         B     @RC01216                                            1220 03302000
@RF01216 L     @12,JFCBPTR                                         1220 03303000
         L     @11,DJFCBPTR                                        1220 03304000
         MVC   JFCBDSNM(44,@12),JFCBDSNM(@11)                      1220 03305000
*/**************************************************************     */ 03306000
*/* AT THIS POINT ALL DATASETS EXCEPT SYSIN,SYSOUT                   */ 03307000
*/*         HAVE HAD DSNAME MERGED.                                  */ 03308000
*/**************************************************************     */ 03309000
*/**************************************************************     */ 03310000
*/* FOLLOWING IS A FIELD BY FIELD MERGE OF MOST AREAS OF JFCB        */ 03311000
*/**************************************************************     */ 03312000
*                                                                  1221 03313000
*         JFCBELNM=DJFCBPTR->JFCBELNM;                             1221 03314000
@RC01216 L     @12,JFCBPTR                                         1221 03315000
         L     @11,DJFCBPTR                                        1221 03316000
         MVC   JFCBELNM(8,@12),JFCBELNM(@11)                       1221 03317000
*         JFCBTSDM=DJFCBPTR->JFCBTSDM;                             1222 03318000
         L     @11,DJFCBPTR                                        1222 03319000
         MVC   JFCBTSDM(1,@12),JFCBTSDM(@11)                       1222 03320000
*         JFCBDSCB=DJFCBPTR->JFCBDSCB;                             1223 03321000
         L     @11,DJFCBPTR                                        1223 03322000
         MVC   JFCBDSCB(3,@12),JFCBDSCB(@11)                       1223 03323000
*         IF JFCORGAM^=ON THEN      /* DO NOT MERGE VSAM RESTART   1224 03324000
*                                      OPTIONS               @ZA24441*/ 03325000
         TM    JFCORGAM(@12),B'00001000'                           1224 03326000
         BO    @RF01224                                            1224 03327000
*           JFCFCBID=DJFCBPTR->JFCFCBID;                           1225 03328000
         L     @11,DJFCBPTR                                        1225 03329000
         MVC   JFCFCBID(4,@12),JFCFCBID(@11)                       1225 03330000
*         JFCBADBF=DJFCBPTR->JFCBADBF;                             1226 03331000
@RF01224 L     @12,JFCBPTR                                         1226 03332000
         L     @11,DJFCBPTR                                        1226 03333000
         LH    @11,JFCBADBF(,@11)                                  1226 03334000
         STH   @11,JFCBADBF(,@12)                                  1226 03335000
*         JFCNLREC=DJFCBPTR->JFCNLREC;                             1227 03336000
*                                                                  1227 03337000
         L     @11,DJFCBPTR                                        1227 03338000
         LH    @11,JFCNLREC(,@11)                                  1227 03339000
         STH   @11,JFCNLREC(,@12)                                  1227 03340000
*/*   JFCVINDX WILL NOT BE MERGED                       @ZM30408     */ 03341000
*                                                                  1228 03342000
*         JFCBLTYP=DJFCBPTR->JFCBLTYP;                             1228 03343000
         L     @11,DJFCBPTR                                        1228 03344000
         MVC   JFCBLTYP(1,@12),JFCBLTYP(@11)                       1228 03345000
*         JFCBOTTR=DJFCBPTR->JFCBOTTR;                             1229 03346000
         L     @11,DJFCBPTR                                        1229 03347000
         MVC   JFCBOTTR(3,@12),JFCBOTTR(@11)                       1229 03348000
*         JFCBVLSQ=DJFCBPTR->JFCBVLSQ;                             1230 03349000
         L     @11,DJFCBPTR                                        1230 03350000
         LH    @11,JFCBVLSQ(,@11)                                  1230 03351000
         STH   @11,JFCBVLSQ(,@12)                                  1230 03352000
*         JFCBMASK=DJFCBPTR->JFCBMASK;                             1231 03353000
         L     @11,DJFCBPTR                                        1231 03354000
         MVC   JFCBMASK(8,@12),JFCBMASK(@11)                       1231 03355000
*         JFCBCRDT=DJFCBPTR->JFCBCRDT;                             1232 03356000
         L     @11,DJFCBPTR                                        1232 03357000
         MVC   JFCBCRDT(3,@12),JFCBCRDT(@11)                       1232 03358000
*         JFCBXPDT=DJFCBPTR->JFCBXPDT;                             1233 03359000
         L     @11,DJFCBPTR                                        1233 03360000
         MVC   JFCBXPDT(3,@12),JFCBXPDT(@11)                       1233 03361000
*         JFCBIND1=DJFCBPTR->JFCBIND1;                             1234 03362000
*                                                                  1234 03363000
         L     @11,DJFCBPTR                                        1234 03364000
         MVC   JFCBIND1(1,@12),JFCBIND1(@11)                       1234 03365000
*/* JFCBIND2 WILL BE MERGED LATER IN THIS PROC AFTER A TEST IS       */ 03366000
*/*   MADE TO DETERMINE IF THE DISP HAS CHANGED FROM SHR TO OLD      */ 03367000
*/*   VIA A DYNAMIC CONVERT.                                         */ 03368000
*                                                                  1235 03369000
*         JFCAMPTR=DJFCBPTR->JFCAMPTR;                             1235 03370000
         L     @11,DJFCBPTR                                        1235 03371000
         L     @11,JFCAMPTR(,@11)                                  1235 03372000
         ST    @11,JFCAMPTR(,@12)                                  1235 03373000
*         JFCEROPT=DJFCBPTR->JFCEROPT;                             1236 03374000
         L     @11,DJFCBPTR                                        1236 03375000
         MVC   JFCEROPT(1,@12),JFCEROPT(@11)                       1236 03376000
*         JFCTRTCH=DJFCBPTR->JFCTRTCH;                             1237 03377000
         L     @11,DJFCBPTR                                        1237 03378000
         MVC   JFCTRTCH(1,@12),JFCTRTCH(@11)                       1237 03379000
*         JFCCODE=DJFCBPTR->JFCCODE;                               1238 03380000
         L     @11,DJFCBPTR                                        1238 03381000
         MVC   JFCCODE(1,@12),JFCCODE(@11)                         1238 03382000
*         JFCMODE=DJFCBPTR->JFCMODE;                               1239 03383000
         L     @11,DJFCBPTR                                        1239 03384000
         MVC   JFCMODE(1,@12),JFCMODE(@11)                         1239 03385000
*         JFCPRTSP=DJFCBPTR->JFCPRTSP;                             1240 03386000
         L     @11,DJFCBPTR                                        1240 03387000
         MVC   JFCPRTSP(1,@12),JFCPRTSP(@11)                       1240 03388000
*         JFCDEN=DJFCBPTR->JFCDEN;                                 1241 03389000
         L     @11,DJFCBPTR                                        1241 03390000
         MVC   JFCDEN(1,@12),JFCDEN(@11)                           1241 03391000
*         JFCBABFS=DJFCBPTR->JFCBABFS;                             1242 03392000
         L     @11,DJFCBPTR                                        1242 03393000
         MVC   JFCBABFS(3,@12),JFCBABFS(@11)                       1242 03394000
*         JFCDSORG=DJFCBPTR->JFCDSORG;                             1243 03395000
         L     @11,DJFCBPTR                                        1243 03396000
         MVC   JFCDSORG(2,@12),JFCDSORG(@11)                       1243 03397000
*         JFCRECFM=DJFCBPTR->JFCRECFM;                             1244 03398000
         L     @11,DJFCBPTR                                        1244 03399000
         MVC   JFCRECFM(1,@12),JFCRECFM(@11)                       1244 03400000
*         JFCOPTCD=DJFCBPTR->JFCOPTCD;                             1245 03401000
         L     @11,DJFCBPTR                                        1245 03402000
         MVC   JFCOPTCD(1,@12),JFCOPTCD(@11)                       1245 03403000
*         JFCBLKSI=DJFCBPTR->JFCBLKSI;                             1246 03404000
         L     @11,DJFCBPTR                                        1246 03405000
         LH    @11,JFCBLKSI(,@11)                                  1246 03406000
         STH   @11,JFCBLKSI(,@12)                                  1246 03407000
*         JFCLRECL=DJFCBPTR->JFCLRECL;                             1247 03408000
         L     @11,DJFCBPTR                                        1247 03409000
         LH    @11,JFCLRECL(,@11)                                  1247 03410000
         STH   @11,JFCLRECL(,@12)                                  1247 03411000
*         JFCNCP=DJFCBPTR->JFCNCP;                                 1248 03412000
         L     @11,DJFCBPTR                                        1248 03413000
         MVC   JFCNCP(1,@12),JFCNCP(@11)                           1248 03414000
*         JFCNTM=DJFCBPTR->JFCNTM;                                 1249 03415000
         L     @11,DJFCBPTR                                        1249 03416000
         MVC   JFCNTM(1,@12),JFCNTM(@11)                           1249 03417000
*         JFCRKP=DJFCBPTR->JFCRKP;                                 1250 03418000
         L     @11,DJFCBPTR                                        1250 03419000
         LH    @11,JFCRKP(,@11)                                    1250 03420000
         STH   @11,JFCRKP(,@12)                                    1250 03421000
*         JFCCYLOF=DJFCBPTR->JFCCYLOF;                             1251 03422000
         L     @11,DJFCBPTR                                        1251 03423000
         MVC   JFCCYLOF(1,@12),JFCCYLOF(@11)                       1251 03424000
*         JFCDBUFN=DJFCBPTR->JFCDBUFN;                             1252 03425000
         L     @11,DJFCBPTR                                        1252 03426000
         MVC   JFCDBUFN(1,@12),JFCDBUFN(@11)                       1252 03427000
*         JFCBEFLG=JFCBEFLG&&JFCBEFLG;/* CLEAR FLAG          @Z40MPSJ*/ 03428000
         XC    JFCBEFLG(1),JFCBEFLG                                1253 03429000
*         IF JFCBEXTP=ON&JFCBEXAD^=ZEROPTR THEN                    1254 03430000
         TM    JFCBEXTP(@12),B'10000000'                           1254 03431000
         BNO   @RF01254                                            1254 03432000
         L     @12,JFCBEXAD-1(,@12)                                1254 03433000
         LA    @12,0(,@12)                                         1254 03434000
         LTR   @12,@12                                             1254 03435000
         BZ    @RF01254                                            1254 03436000
*           JFCBEFLG=JFCBEON;       /* RETAIN JFCBE INDICATOR      1255 03437000
*                                                            @Z40MPSJ*/ 03438000
         MVI   JFCBEFLG,X'80'                                      1255 03439000
*         JFCINTVL=DJFCBPTR->JFCUCSOP|JFCBEFLG;/* JFCUCSOP=JFCINTVL     03440000
*                                                            @Z40MPSJ*/ 03441000
@RF01254 L     @12,JFCBPTR                                         1256 03442000
         L     @11,DJFCBPTR                                        1256 03443000
         MVC   JFCINTVL(1,@12),JFCUCSOP(@11)                       1256 03444000
         OC    JFCINTVL(1,@12),JFCBEFLG                            1256 03445000
*         JFCOUTLI=DJFCBPTR->JFCOUTLI;                             1257 03446000
         L     @11,DJFCBPTR                                        1257 03447000
         MVC   JFCOUTLI(3,@12),JFCOUTLI(@11)                       1257 03448000
*         JFCSOWA=DJFCBPTR->JFCSOWA;                               1258 03449000
         L     @11,DJFCBPTR                                        1258 03450000
         LH    @11,JFCSOWA(,@11)                                   1258 03451000
         STH   @11,JFCSOWA(,@12)                                   1258 03452000
*         JFCBNTCS=DJFCBPTR->JFCBNTCS;                             1259 03453000
*                                                                  1259 03454000
         L     @11,DJFCBPTR                                        1259 03455000
         MVC   JFCBNTCS(1,@12),JFCBNTCS(@11)                       1259 03456000
*/* JFCBNVOL AND JFCBVOLS WILL BE SELECTIVELY MERGED IN VOLSERS.     */ 03457000
*                                                                  1260 03458000
*         JFCBEXTL=DJFCBPTR->JFCBEXTL;                             1260 03459000
*                                                                  1260 03460000
         L     @11,DJFCBPTR                                        1260 03461000
         MVC   JFCBEXTL(1,@12),JFCBEXTL(@11)                       1260 03462000
*/* JFCBEXAD WILL BE MERGED IN JFCBXJOB.                             */ 03463000
*                                                                  1261 03464000
*         JFCBPQTY=DJFCBPTR->JFCBPQTY;                             1261 03465000
         L     @11,DJFCBPTR                                        1261 03466000
         MVC   JFCBPQTY(3,@12),JFCBPQTY(@11)                       1261 03467000
*         JFCBCTRI=DJFCBPTR->JFCBCTRI;                             1262 03468000
         L     @11,DJFCBPTR                                        1262 03469000
         MVC   JFCBCTRI(1,@12),JFCBCTRI(@11)                       1262 03470000
*         IF(RESTYPE=ON&JFCBSQTY^>DJFCBPTR->JFCBSQTY) THEN         1263 03471000
         TM    RESTYPE,B'10000000'                                 1263 03472000
         BNO   @RF01263                                            1263 03473000
         L     @11,DJFCBPTR                                        1263 03474000
         CLC   JFCBSQTY(3,@12),JFCBSQTY(@11)                       1263 03475000
         BH    @RF01263                                            1263 03476000
*           JFCBSQTY=DJFCBPTR->JFCBSQTY;/* DONT OVERLAY A REQUEST FOR   03477000
*                                      MORE SEC ALLOC FOR DEFERRED 1264 03478000
*                                      RESTART               @YA66585*/ 03479000
         L     @11,DJFCBPTR                                        1264 03480000
         MVC   JFCBSQTY(3,@12),JFCBSQTY(@11)                       1264 03481000
*         JFCFLGS1=DJFCBPTR->JFCFLGS1;                             1265 03482000
@RF01263 L     @12,JFCBPTR                                         1265 03483000
         L     @11,DJFCBPTR                                        1265 03484000
         MVC   JFCFLGS1(1,@12),JFCFLGS1(@11)                       1265 03485000
*         JFCBFLG3=DJFCBPTR->JFCBFLG3;/* THIS FIELD UNUSED IN MVS  1266 03486000
*                                      PRIOR TO SU32         @ZA19250*/ 03487000
         L     @11,DJFCBPTR                                        1266 03488000
         MVC   JFCBFLG3(1,@12),JFCBFLG3(@11)                       1266 03489000
*         JFCBABST=DJFCBPTR->JFCBABST;                             1267 03490000
         L     @11,DJFCBPTR                                        1267 03491000
         LH    @11,JFCBABST(,@11)                                  1267 03492000
         STH   @11,JFCBABST(,@12)                                  1267 03493000
*         JFCBDRLH=DJFCBPTR->JFCBDRLH;                             1268 03494000
*                                                                  1268 03495000
         L     @11,DJFCBPTR                                        1268 03496000
         MVC   JFCBDRLH(3,@12),JFCBDRLH(@11)                       1268 03497000
*/* JFCBVLCT WILL BE MERGED IN VOLSERS PROC                          */ 03498000
*                                                                  1269 03499000
*         JFCBDQTY=DJFCBPTR->JFCBDQTY;                             1269 03500000
         L     @11,DJFCBPTR                                        1269 03501000
         MVC   JFCBDQTY(3,@12),JFCBDQTY(@11)                       1269 03502000
*         JFCBSPTN=DJFCBPTR->JFCBSPTN;                             1270 03503000
*                                                                  1270 03504000
         L     @11,DJFCBPTR                                        1270 03505000
         MVC   JFCBSPTN(1,@12),JFCBSPTN(@11)                       1270 03506000
*/********* END OF BASIC MERGE   ***********                         */ 03507000
*/**************************************************************     */ 03508000
*/* NOW TEST TO DETERMINE IF DISP WAS DYNAMICALLY CONVERTED          */ 03509000
*/*   FROM SHR TO OLD.  IF THE TEST IS POSITIVE, THE DSENQ TABLE     */ 03510000
*/*   MUST BE MODIFIED SO THE DATASET WILL BE ENQ'D EXCLUSIVE        */ 03511000
*/*   WHEN THE JOB IS INITIATED.                                     */ 03512000
*/**************************************************************     */ 03513000
*                                                                  1271 03514000
*         IF DJFCBPTR->JFCBIND2^=JFCBIND2 THEN/* IF DISPS ^=         */ 03515000
         L     @11,DJFCBPTR                                        1271 03516000
         CLC   JFCBIND2(1,@11),JFCBIND2(@12)                       1271 03517000
         BE    @RF01271                                            1271 03518000
*           IF(DJFCBPTR->JFCSHARE^=ON/* DSDR SAYS STAT WAS NON-SHR   */ 03519000
*               &JFCSHARE=ON)       /* JCL SAYS STAT WAS SHR @YM04969*/ 03520000
*             THEN                                                 1272 03521000
         L     @11,DJFCBPTR                                        1272 03522000
         TM    JFCSHARE(@11),B'00001000'                           1272 03523000
         BO    @RF01272                                            1272 03524000
         TM    JFCSHARE(@12),B'00001000'                           1272 03525000
         BNO   @RF01272                                            1272 03526000
*             DO;                   /* GO UPDATE THE DSENQ TABLE     */ 03527000
*               DSN=JFCBDSNM;       /* SET DSNAME INTO PARM LIST     */ 03528000
         MVC   DSN(44),JFCBDSNM(@12)                               1274 03529000
*               BITMAP=''B;         /* ZERO THE FUNCTION MAP         */ 03530000
         XC    BITMAP(2),BITMAP                                    1275 03531000
*               ENQEXCL=ON;         /* FUNCTION = ENQ EXCL.          */ 03532000
*               ADCHONLY=ON;        /* DONT'T DO THE ENQ, JUST MARK     03533000
*                                      THE ENTRY FOR INIIATOR'S USE  */ 03534000
         OI    ENQEXCL,B'01000001'                                 1277 03535000
*               DO;                 /* LINK EP('IEFAB4DC') PARAM(BITM   03536000
*                                      AP,PASSJCT,PASSDSNM,PASSEPA,PA   03537000
*                                      SSTCB,STEPNO,PAD1,PAD2,RETPARM   03538000
*                                      )                             */ 03539000
*                 I00601='00'X;     /* EP/DE FLAG                    */ 03540000
         MVI   I00601,X'00'                                        1279 03541000
*                 I00602=ADDR('IEFAB4DC');/* ADDR OF EP/DE           */ 03542000
         LA    @12,@CC04253                                        1280 03543000
         STCM  @12,7,I00602                                        1280 03544000
*                 I00604=0;         /* DCB PTR                       */ 03545000
         SLR   @12,@12                                             1281 03546000
         STCM  @12,7,I00604                                        1281 03547000
*                 I00603='00'X;     /* ERRET FLAG                    */ 03548000
         MVI   I00603,X'00'                                        1282 03549000
*                 IOPTLIST(1)=ADDR(BITMAP);/* ADDR OF PROB PROG PARM */ 03550000
         LA    @12,BITMAP                                          1283 03551000
         ST    @12,IOPTLIST                                        1283 03552000
*                 IOPTLIST(2)=ADDR(PASSJCT);/* ADDR OF PROB PROG PARM*/ 03553000
         LA    @12,PASSJCT                                         1284 03554000
         ST    @12,IOPTLIST+4                                      1284 03555000
*                 IOPTLIST(3)=ADDR(PASSDSNM);/* ADDR OF PROB PROG  1285 03556000
*                                      PARM                          */ 03557000
         LA    @12,PASSDSNM                                        1285 03558000
         ST    @12,IOPTLIST+8                                      1285 03559000
*                 IOPTLIST(4)=ADDR(PASSEPA);/* ADDR OF PROB PROG PARM*/ 03560000
         LA    @12,PASSEPA                                         1286 03561000
         ST    @12,IOPTLIST+12                                     1286 03562000
*                 IOPTLIST(5)=ADDR(PASSTCB);/* ADDR OF PROB PROG PARM*/ 03563000
         LA    @12,PASSTCB                                         1287 03564000
         ST    @12,IOPTLIST+16                                     1287 03565000
*                 IOPTLIST(6)=ADDR(STEPNO);/* ADDR OF PROB PROG PARM */ 03566000
         LA    @12,STEPNO                                          1288 03567000
         ST    @12,IOPTLIST+20                                     1288 03568000
*                 IOPTLIST(7)=ADDR(PAD1);/* ADDR OF PROB PROG PARM   */ 03569000
         LA    @12,PAD1                                            1289 03570000
         ST    @12,IOPTLIST+24                                     1289 03571000
*                 IOPTLIST(8)=ADDR(PAD2);/* ADDR OF PROB PROG PARM   */ 03572000
         LA    @12,PAD2                                            1290 03573000
         ST    @12,IOPTLIST+28                                     1290 03574000
*                 IOPTLIST(9)=ADDR(RETPARM);/* ADDR OF PROB PROG PARM*/ 03575000
         LA    @12,RETPARM                                         1291 03576000
         ST    @12,IOPTLIST+32                                     1291 03577000
*                 IOPTLIST(9)=IOPTLIST(9)|'80000000'X;/* SET VL BIT  */ 03578000
         O     @12,@CF04255                                        1292 03579000
         ST    @12,IOPTLIST+32                                     1292 03580000
*                 RESPECIFY                                        1293 03581000
*                  (GPR01P) RESTRICTED;                            1293 03582000
*                 GPR01P=ADDR(IOPTLIST);/* ADDR OF OPTLIST           */ 03583000
         LA    GPR01P,IOPTLIST                                     1294 03584000
*                 RESPECIFY                                        1295 03585000
*                  (GPR15P) RESTRICTED;                            1295 03586000
*                 GPR15P=ADDR(I006);/* ADDR OF LINK LIST             */ 03587000
         LA    GPR15P,I006                                         1296 03588000
*                 SVC(6);           /* ISSUE LINK SVC                */ 03589000
         SVC   6                                                   1297 03590000
*                 RESPECIFY                                        1298 03591000
*                  (GPR01P) UNRESTRICTED;                          1298 03592000
*                 RESPECIFY                                        1299 03593000
*                  (GPR15P) UNRESTRICTED;                          1299 03594000
*               END;                /* LINK EP('IEFAB4DC') PARAM(BITM   03595000
*                                      AP,PASSJCT,PASSDSNM,PASSEPA,PA   03596000
*                                      SSTCB,STEPNO,PAD1,PAD2,RETPARM   03597000
*                                      )                             */ 03598000
*               CALL FREEEPA;       /* FREE EXTRA EPA        @YM08161*/ 03599000
         BAL   @14,FREEEPA                                         1301 03600000
*             END;                                                 1302 03601000
*         JFCBIND2=DJFCBPTR->JFCBIND2;/* COMPLETE THE MERGE          */ 03602000
@RF01272 DS    0H                                                  1303 03603000
@RF01271 L     @12,JFCBPTR                                         1303 03604000
         L     @11,DJFCBPTR                                        1303 03605000
         MVC   JFCBIND2(1,@12),JFCBIND2(@11)                       1303 03606000
*         IF JFCDEFER=ON THEN       /* IF CHKPT DETECTED A VOLUME    */ 03607000
         TM    JFCDEFER(@12),B'00100000'                           1304 03608000
         BNO   @RF01304                                            1304 03609000
*           DO;                     /* SWITCH,CAUSE DEFERED MOUNT TO    03610000
*                                      TAKE PLACE.                   */ 03611000
*             JFCDEFER=NOTON;       /* TURN OFF JFCB SWITCH          */ 03612000
         NI    JFCDEFER(@12),B'11011111'                           1306 03613000
*             IF DJFCBPTR->JFCBNVOL>SCTNMBUT THEN/* TURN DEFER MOUNT    03614000
*                                      BIT ON IF MORE VOLS THAN    1307 03615000
*                                      DEVICES               @ZA16378*/ 03616000
         L     @12,SIOTPTR                                         1307 03617000
         L     @11,DJFCBPTR                                        1307 03618000
         CLC   JFCBNVOL(1,@11),SCTNMBUT(@12)                       1307 03619000
         BNH   @RF01307                                            1307 03620000
*               SCTDEFER=ON;        /* TURN ON SWITCH FOR DATA-MANG. */ 03621000
         OI    SCTDEFER(@12),B'00000010'                           1308 03622000
*           END;                                                   1309 03623000
@RF01307 DS    0H                                                  1310 03624000
*         IF(DJFCBPTR->JFCBVOLS(1)^=FOXES/*                  @YM08115*/ 03625000
*             &DJFCBPTR->JFCORGAM^=ON) THEN/*                @YM08116*/ 03626000
@RF01304 L     @12,DJFCBPTR                                        1310 03627000
         CLI   JFCBVOLS(@12),X'FF'                                 1310 03628000
         BE    @RF01310                                            1310 03629000
         L     @12,DJFCBPTR                                        1310 03630000
         TM    JFCORGAM(@12),B'00001000'                           1310 03631000
         BO    @RF01310                                            1310 03632000
*           IF(JFCBEXTP=ON|DJFCBPTR->JFCBEXTP=ON)/* IF ARGONAUT IS 1311 03633000
*                                      SPECIFIED ON JCL OR DSDR    1311 03634000
*                                      RECORD                @Z40MPSJ*/ 03635000
*             THEN                  /* THEN                  @Z40MPSJ*/ 03636000
         L     @12,JFCBPTR                                         1311 03637000
         TM    JFCBEXTP(@12),B'10000000'                           1311 03638000
         BO    @RT01311                                            1311 03639000
         L     @12,DJFCBPTR                                        1311 03640000
         TM    JFCBEXTP(@12),B'10000000'                           1311 03641000
         BNO   @RF01311                                            1311 03642000
@RT01311 DS    0H                                                  1312 03643000
*             DO;                   /*                       @Z40MPSJ*/ 03644000
*               SWAXADD=JFCBEXAD;   /* OBTAIN JFCBE PTR      @Z40MPSJ*/ 03645000
         L     @12,JFCBPTR                                         1313 03646000
         MVC   SWAXADD(3),JFCBEXAD(@12)                            1313 03647000
*               PREV=ADDR(JFCBEXAD);/* INIT CHAINING BASE FIELD    1314 03648000
*                                                            @Z40MPSJ*/ 03649000
         LA    @12,JFCBEXAD(,@12)                                  1314 03650000
         STCM  @12,7,PREV                                          1314 03651000
*               CALL JFCBEPRC;      /* CALL JFCBE MERGE ROUTINE    1315 03652000
*                                                            @Z40MPSJ*/ 03653000
         BAL   @14,JFCBEPRC                                        1315 03654000
*             END;                  /*                       @Z40MPSJ*/ 03655000
*           ELSE                    /* ELSE                  @Z40MPSJ*/ 03656000
*             CALL VOLSERS;                                        1317 03657000
*                                                                  1317 03658000
         B     @RC01311                                            1317 03659000
@RF01311 BAL   @14,VOLSERS                                         1317 03660000
*         /***********************************************************/ 03661000
*         /*                                                         */ 03662000
*         /* HANDLE VOLUME SERIAL NUMBER DECISIONS. INCLUDING:       */ 03663000
*         /* JFCBVOLS JFCBNVOL JFCBVLCT VOLSERS CALLS JFCBXJOB TO    */ 03664000
*         /* HANDLE JFCBX PROCESSING.                                */ 03665000
*         /*                                                         */ 03666000
*         /***********************************************************/ 03667000
*                                                                  1318 03668000
*         ELSE                                                     1318 03669000
*           JFCCAT=NOTON;           /* IF NO VOLUME INFO IS TO BE  1318 03670000
*                                      RESTORED, INSURE CATALOG USE     03671000
*                                                            @YM06106*/ 03672000
         B     @RC01310                                            1318 03673000
@RF01310 L     @12,JFCBPTR                                         1318 03674000
         NI    JFCCAT(@12),B'01111111'                             1318 03675000
*         IF RESTYPE=ON THEN        /* FOR DEFERRED, INSURE THAT NO     03676000
*                                      ENTRIES ARE LOST FROM THE   1319 03677000
*                                      DSENQ TABLE                   */ 03678000
@RC01310 TM    RESTYPE,B'10000000'                                 1319 03679000
         BNO   @RF01319                                            1319 03680000
*           DO;                                                    1320 03681000
*             DSN=JFCBDSNM;         /* SETUP DSN FOR ADDDSNQ         */ 03682000
         L     @12,JFCBPTR                                         1321 03683000
         MVC   DSN(44),JFCBDSNM(@12)                               1321 03684000
*             CALL ADDDSNQ;         /* ADD THE ENTRY                 */ 03685000
         BAL   @14,ADDDSNQ                                         1322 03686000
*             IF(JFCBEXAD^=0&JFCBEXTP=NOTON) THEN/* IF JFCBX       1323 03687000
*                                      EXISTS,@Z40MPSJ               */ 03688000
         L     @12,JFCBPTR                                         1323 03689000
         L     @11,JFCBEXAD-1(,@12)                                1323 03690000
         LA    @11,0(,@11)                                         1323 03691000
         LTR   @11,@11                                             1323 03692000
         BZ    @RF01323                                            1323 03693000
         TM    JFCBEXTP(@12),B'10000000'                           1323 03694000
         BNZ   @RF01323                                            1323 03695000
*               DO;                 /* TEST IT FOR ALIAS NAME        */ 03696000
*                 SWVA=JFCBEXAD;    /* SETUP FOR READ                */ 03697000
         L     @12,SWEPAPTR                                        1325 03698000
         STCM  @11,7,SWVA(@12)                                     1325 03699000
*                 CALL READSWA;     /* DO THE READ                   */ 03700000
         BAL   @14,READSWA                                         1326 03701000
*                 JFCBXPTR=SWBLKPTR;                               1327 03702000
         L     @12,SWEPAPTR                                        1327 03703000
         L     @12,SWBLKPTR(,@12)                                  1327 03704000
         ST    @12,JFCBXPTR                                        1327 03705000
*                 IF(JFCBXNAM^=BLANKS&ARITXNAM^=0) THEN/* IF ALIAS 1328 03706000
*                                      NAME EXISTS                   */ 03707000
         CLC   JFCBXNAM(8,@12),@CC03776                            1328 03708000
         BE    @RF01328                                            1328 03709000
         L     @11,ARITXNAM(,@12)                                  1328 03710000
         LTR   @11,@11                                             1328 03711000
         BZ    @RF01328                                            1328 03712000
*                   DO;                                            1329 03713000
*                     DSN=JFCBXNAM; /* SETUP FOR ADDDSNQ             */ 03714000
         MVC   DSN(44),JFCBXNAM(@12)                               1330 03715000
*                     CALL ADDDSNQ; /* ADD THE ENTRY                 */ 03716000
         BAL   @14,ADDDSNQ                                         1331 03717000
*                   END;                                           1332 03718000
*               END;                                               1333 03719000
@RF01328 DS    0H                                                  1334 03720000
*           END;                                                   1334 03721000
@RF01323 DS    0H                                                  1335 03722000
*         IF JFCBTVOL=FOXES THEN    /* USER SAVED BYTE FOR         1335 03723000
*                                      CHECK@ZA07018                 */ 03724000
@RF01319 CLI   JFCBTVOL,255                                        1335 03725000
         BNE   @RF01335                                            1335 03726000
*           JFCBNVOL=0;             /*                       @YM08115*/ 03727000
         L     @12,JFCBPTR                                         1336 03728000
         MVI   JFCBNVOL(@12),X'00'                                 1336 03729000
*       END;                                                       1337 03730000
*   END JFCBPROC;                                                  1338 03731000
@EL00015 DS    0H                                                  1338 03732000
@EF00015 DS    0H                                                  1338 03733000
@ER00015 LM    @14,@06,@SA00015                                    1338 03734000
         LM    @08,@12,@SA00015+36                                 1338 03735000
         BR    @14                                                 1338 03736000
*JFCBEPRC:                                                         1339 03737000
*   PROC OPTIONS(NOSAVE(IOBUFAD));  /*                       @Z40MPSJ*/ 03738000
JFCBEPRC STM   @14,@06,@SA00016                                    1339 03739000
         STM   @08,@12,@SA00016+36                                 1339 03740000
*/*    THIS PROC MERGES THE JFCBE FROM THE DSDR TO THE             1340 03741000
*      INCORE JFCBE. THIS PROC USES THE SAME PROGRAM               1340 03742000
*      VARIABLES AS JFCBXJOB PROC.                           @Z40MPSJ*/ 03743000
*                                                                  1340 03744000
*   IF(JFCBEXTP=ON&DJFCBPTR->JFCBEXTP=ON)/* IF ARGONAUT SPECIFIED FOR   03745000
*                                      JOB AND CHKPT DS.     @Z40MPSJ*/ 03746000
*     THEN                          /* THEN PROCESS JFCBE    @Z40MPSJ*/ 03747000
         L     @12,JFCBPTR                                         1340 03748000
         TM    JFCBEXTP(@12),B'10000000'                           1340 03749000
         BNO   @RF01340                                            1340 03750000
         L     @12,DJFCBPTR                                        1340 03751000
         TM    JFCBEXTP(@12),B'10000000'                           1340 03752000
         BNO   @RF01340                                            1340 03753000
*     DO;                           /*                       @Z40MPSJ*/ 03754000
*       STPXLOOP=NOTON;             /* INIT. LOOP CONTROL    @Z40MPSJ*/ 03755000
         NI    STPXLOOP,B'01111111'                                1342 03756000
*       DO WHILE STPXLOOP=NOTON;    /* DO FOR ALL JFCBE      @Z40MPSJ*/ 03757000
         B     @DE01343                                            1343 03758000
@DL01343 DS    0H                                                  1344 03759000
*         CALL READCHEK;            /* READ JFCBE            @Z40MPSJ*/ 03760000
         BAL   @14,READCHEK                                        1344 03761000
*         TYPE2PTR=IOBUFAD;         /* REFRESH BUFFER PTR    @Z40MPSJ*/ 03762000
         ST    IOBUFAD,TYPE2PTR                                    1345 03763000
*         DJFCXPTR=ADDR(DSDJFCBX);  /* ESTABLISH DSDR JFCBE        1346 03764000
*                                      ADDRESSABILITY        @Z40MPSJ*/ 03765000
         L     @12,TYPE2PTR                                        1346 03766000
         LA    @12,DSDJFCBX(,@12)                                  1346 03767000
         ST    @12,DJFCXPTR                                        1346 03768000
*         IF SWAXADD^=ZEROPTR       /* IF SWA JFCBE EXISTS   @Z40MPSJ*/ 03769000
*           THEN                    /* THEN                  @Z40MPSJ*/ 03770000
         L     @12,SWAXADD-1                                       1347 03771000
         LA    @12,0(,@12)                                         1347 03772000
         LTR   @12,@12                                             1347 03773000
         BZ    @RF01347                                            1347 03774000
*           DO;                     /*                       @Z40MPSJ*/ 03775000
*             SWVA=SWAXADD;         /* PREPARE FOR READ      @Z40MPSJ*/ 03776000
         L     @12,SWEPAPTR                                        1349 03777000
         MVC   SWVA(3,@12),SWAXADD                                 1349 03778000
*             CALL READSWA;         /* READ JFCBE            @Z40MPSJ*/ 03779000
         BAL   @14,READSWA                                         1350 03780000
*             JFCBEPTR=SWBLKPTR;    /* ESTABLISH ADDRESSABILITY    1351 03781000
*                                                            @Z40MPSJ*/ 03782000
         L     @12,SWEPAPTR                                        1351 03783000
         L     @12,SWBLKPTR(,@12)                                  1351 03784000
         ST    @12,JFCBEPTR                                        1351 03785000
*             SWAXADD=JFCBEXTR;     /* SAVE NEXT SWA JFCBE ADDR    1352 03786000
*                                                            @Z40MPSJ*/ 03787000
         MVC   SWAXADD(3),JFCBEXTR(@12)                            1352 03788000
*             IF DJFCXPTR->JFCBEOPN=ON THEN/* IF JFCBE MODIFIED AT 1353 03789000
*                                      OPEN                  @Z40MPSJ*/ 03790000
         L     @11,DJFCXPTR                                        1353 03791000
         TM    JFCBEOPN(@11),B'10000000'                           1353 03792000
         BNO   @RF01353                                            1353 03793000
*               JFCBE(STARTMRG:ENDMRG)=DJFCXPTR->JFCBE(STARTMRG:ENDMRG) 03794000
*                 ;                                                1354 03795000
*                                                                  1354 03796000
         LH    @09,STARTMRG                                        1354 03797000
         ALR   @12,@09                                             1354 03798000
         BCTR  @12,0                                               1354 03799000
         LH    @15,ENDMRG                                          1354 03800000
         SLR   @15,@09                                             1354 03801000
         ALR   @11,@09                                             1354 03802000
         BCTR  @11,0                                               1354 03803000
         EX    @15,@SM04568                                        1354 03804000
*             /*******************************************************/ 03805000
*             /*                                                     */ 03806000
*             /* MERGE ENTIRE JFCBE EXCEPT CHAIN PTR         @Z40MPSJ*/ 03807000
*             /*                                                     */ 03808000
*             /*******************************************************/ 03809000
*                                                                  1355 03810000
*           END;                    /*                       @Z40MPSJ*/ 03811000
*         ELSE                      /*                       @Z40MPSJ*/ 03812000
*           DO;                     /*                       @Z40MPSJ*/ 03813000
         B     @RC01347                                            1356 03814000
@RF01347 DS    0H                                                  1357 03815000
*             CALL ASGNPROC;        /* ASSIGN SWA BLOCK      @Z40MPSJ*/ 03816000
         BAL   @14,ASGNPROC                                        1357 03817000
*             SLOT=ASGNADD;         /* CHAIN SWA BLK TO JFCBE OR JFCB   03818000
*                                                            @Z40MPSJ*/ 03819000
         L     @12,PREV-1                                          1358 03820000
         MVC   SLOT(3,@12),ASGNADD                                 1358 03821000
*             SWBUFPTR=DJFCXPTR;    /* ADDRESS DSDR JFCBE    @Z40MPSJ*/ 03822000
         L     @12,EPAPTR                                          1359 03823000
         L     @11,DJFCXPTR                                        1359 03824000
         ST    @11,SWBUFPTR(,@12)                                  1359 03825000
*             SWROWVA=ASGNADD;      /* ADDRESS SWA BLOCK     @Z40MPSJ*/ 03826000
         MVC   SWROWVA(3,@12),ASGNADD                              1360 03827000
*             SWWRTID=JFCBEID;      /* SET JFCBE ID          @Z40MPSJ*/ 03828000
         MVI   SWWRTID(@12),X'29'                                  1361 03829000
*             CALL WRITESWA;        /* WRITE SWA JFCBE       @Z40MPSJ*/ 03830000
         BAL   @14,WRITESWA                                        1362 03831000
*             SWVA=ASGNADD;         /* PREPARE FOR READ      @Z40MPSJ*/ 03832000
         L     @12,SWEPAPTR                                        1363 03833000
         MVC   SWVA(3,@12),ASGNADD                                 1363 03834000
*             CALL READSWA;         /* READ SWA BLK          @Z40MPSJ*/ 03835000
         BAL   @14,READSWA                                         1364 03836000
*             JFCBEPTR=SWBLKPTR;    /* ESTABLISH ADDR        @Z40MPSJ*/ 03837000
         L     @12,SWEPAPTR                                        1365 03838000
         L     @12,SWBLKPTR(,@12)                                  1365 03839000
         ST    @12,JFCBEPTR                                        1365 03840000
*           END;                    /*                       @Z40MPSJ*/ 03841000
*         PREV=ADDR(JFCBEXTR);      /* RESET CHAIN LINK PTR  @Z40MPSJ*/ 03842000
@RC01347 MVC   PREV(3),JFCBEPTR+1                                  1367 03843000
*         IF DJFCXPTR->JFCBEXTR=ZEROPTR                            1368 03844000
*                                                                  1368 03845000
*         /***********************************************************/ 03846000
*         /*                                                         */ 03847000
*         /* IF DSDR HAS NO MORE JFCBES                      @Z40MPSJ*/ 03848000
*         /*                                                         */ 03849000
*         /***********************************************************/ 03850000
*                                                                  1368 03851000
*           THEN                    /*                       @Z40MPSJ*/ 03852000
         L     @12,DJFCXPTR                                        1368 03853000
         ICM   @11,7,JFCBEXTR(@12)                                 1368 03854000
         BNZ   @RF01368                                            1368 03855000
*           STPXLOOP=ON;            /* STOP PROCESSING       @Z40MPSJ*/ 03856000
         OI    STPXLOOP,B'10000000'                                1369 03857000
*       END;                        /*                       @Z40MPSJ*/ 03858000
@RF01368 DS    0H                                                  1370 03859000
@DE01343 TM    STPXLOOP,B'10000000'                                1370 03860000
         BZ    @DL01343                                            1370 03861000
*     END;                          /*                       @Z40MPSJ*/ 03862000
*   END JFCBEPRC;                   /*                       @Z40MPSJ*/ 03863000
@EL00016 DS    0H                                                  1372 03864000
@EF00016 DS    0H                                                  1372 03865000
@ER00016 LM    @14,@06,@SA00016                                    1372 03866000
         LM    @08,@12,@SA00016+36                                 1372 03867000
         BR    @14                                                 1372 03868000
*VOLSERS:                                                          1373 03869000
*   PROC OPTIONS(NOSAVE(IOBUFAD));                                 1373 03870000
*                                                                  1373 03871000
VOLSERS  STM   @14,@06,@SA00017                                    1373 03872000
         STM   @08,@12,@SA00017+36                                 1373 03873000
*/**************************************************************     */ 03874000
*/* THE FOLLOWING FIELDS ARE CONSIDERED IN THIS PROC:                */ 03875000
*/*  JFCBNVOL,JFCBVOLS AND JFCBVLCT                                  */ 03876000
*/* FOR AUTO RESTART, ALL FIELDS WILL BE MERGED FROM THE DSDR TO     */ 03877000
*/*     THE JFCB.  FOR DEFERRED, VOLSERS IN THE JFCB WILL BE         */ 03878000
*/*     LEFT INTACT.  ANY VOLSERS BEYOND THE NUMBER IN THE JFCB      */ 03879000
*/*      WILL BE APPENDED FROM THE DSDR(S).                          */ 03880000
*/**************************************************************     */ 03881000
*                                                                  1374 03882000
*   TYPE2PTR=IOBUFAD;               /* ADDR'ABILITY FOR TYPE 2 DSDR  */ 03883000
         ST    IOBUFAD,TYPE2PTR                                    1374 03884000
*   DJFCXPTR=ADDR(DSDJFCBX);        /* ADDR'ABILITY FOR DSDR JFCBX   */ 03885000
         L     @12,TYPE2PTR                                        1375 03886000
         LA    @12,DSDJFCBX(,@12)                                  1375 03887000
         ST    @12,DJFCXPTR                                        1375 03888000
*   IF RESTYPE=NOTON THEN           /* AUTO RESTART...EVERYTHING WILL   03889000
*                                      BE BROUGHT OVER FROM THE DSDR    03890000
*                                      TO THE JFCB.                  */ 03891000
         TM    RESTYPE,B'10000000'                                 1376 03892000
         BNZ   @RF01376                                            1376 03893000
*     DO;                                                          1377 03894000
*       JFCBNVOL=DJFCBPTR->JFCBNVOL;/* SET NUMBER OF SPECIFIC VOLS TO   03895000
*                                      NUMBER AT CHKPT.              */ 03896000
         L     @12,JFCBPTR                                         1378 03897000
         L     @11,DJFCBPTR                                        1378 03898000
         MVC   JFCBNVOL(1,@12),JFCBNVOL(@11)                       1378 03899000
*       JFCBVLCT=DJFCBPTR->JFCBVLCT;/* SET TOTAL NUMBER OF REQUESTED    03900000
*                                      VOLS TO NUM. AT CHKPT.        */ 03901000
         L     @11,DJFCBPTR                                        1379 03902000
         MVC   JFCBVLCT(1,@12),JFCBVLCT(@11)                       1379 03903000
*       JFCBVOLS=DJFCBPTR->JFCBVOLS;/* MERGE THE FIRST 5 VOLSERS.    */ 03904000
         L     @11,DJFCBPTR                                        1380 03905000
         MVC   JFCBVOLS(30,@12),JFCBVOLS(@11)                      1380 03906000
*       IF JFCBEXAD^=0 THEN         /* IF NVOL IS NOT< 6 THEN THERE     03907000
*                                      ARE JFCBXS TO PROCESS.        */ 03908000
         L     @11,JFCBEXAD-1(,@12)                                1381 03909000
         LA    @11,0(,@11)                                         1381 03910000
         LTR   @11,@11                                             1381 03911000
         BZ    @RF01381                                            1381 03912000
*         DO;                                                      1382 03913000
*           PREV=ADDR(JFCBEXAD);    /* USED BY JFCBXJOB FOR CHAINING */ 03914000
         LA    @12,JFCBEXAD(,@12)                                  1383 03915000
         STCM  @12,7,PREV                                          1383 03916000
*           SWAXADD=JFCBEXAD;       /* ADDRESS OF SWA JFCBX (IF ANY) */ 03917000
         STCM  @11,7,SWAXADD                                       1384 03918000
*           CALL JFCBXJOB;          /* DO THE JFCBX PROCESSING.      */ 03919000
         BAL   @14,JFCBXJOB                                        1385 03920000
*         END;                                                     1386 03921000
*     END;                                                         1387 03922000
*                                                                  1387 03923000
*/**************************************************************     */ 03924000
*/* REMAINDER OF PROCEDURE IS FOR DEFERRED RESTARTS.                 */ 03925000
*/**************************************************************     */ 03926000
*                                                                  1388 03927000
*   ELSE                                                           1388 03928000
*     DO;                                                          1388 03929000
         B     @RC01376                                            1388 03930000
@RF01376 DS    0H                                                  1389 03931000
*       IF DJFCBPTR->JFCBNVOL>JFCBNVOL/* ONLY PROCESS EXTRA VOLUMES  */ 03932000
*         THEN                      /* FROM THE DSDR IS THERE ARE    */ 03933000
         L     @12,JFCBPTR                                         1389 03934000
         L     @11,DJFCBPTR                                        1389 03935000
         CLC   JFCBNVOL(1,@11),JFCBNVOL(@12)                       1389 03936000
         BNH   @RF01389                                            1389 03937000
*         DO;                       /* MORE ON THE DSDR THAN JFCB    */ 03938000
*           SAVEVOL=JFCBNVOL;       /* SAVEVOL REPRESENTS THE NUMBER    03939000
*                                      OF VOLSERS THAT WILL NOT BE 1391 03940000
*                                      OVERLAYED.                    */ 03941000
         SLR   @11,@11                                             1391 03942000
         IC    @11,JFCBNVOL(,@12)                                  1391 03943000
         STH   @11,SAVEVOL                                         1391 03944000
*           JFCBNVOL=DJFCBPTR->JFCBNVOL;/* MERGE NEW NVOL FROM DSDR     03945000
*                                      TO JFCB.                      */ 03946000
         L     @11,DJFCBPTR                                        1392 03947000
         MVC   JFCBNVOL(1,@12),JFCBNVOL(@11)                       1392 03948000
*           IF DJFCBPTR->JFCBVLCT   /* THE VLCT MUST REFLECT THE     */ 03949000
*               >JFCBVLCT THEN      /* LARGEST USED VALUE, AS THE  1393 03950000
*                                      NUMBER OF JFCBX'S IS BASED ON    03951000
*                                      IT                            */ 03952000
         L     @11,DJFCBPTR                                        1393 03953000
         CLC   JFCBVLCT(1,@11),JFCBVLCT(@12)                       1393 03954000
         BNH   @RF01393                                            1393 03955000
*             JFCBVLCT=DJFCBPTR->JFCBVLCT;                         1394 03956000
         L     @11,DJFCBPTR                                        1394 03957000
         MVC   JFCBVLCT(1,@12),JFCBVLCT(@11)                       1394 03958000
*           IF SAVEVOL<SIX THEN     /* IF LESS THAN 6, VOLSERS ONLY     03959000
*                                      EXIST ON THE JFCB...NO NEED TO   03960000
*                                      SEARCH FOR JFCBX'S.           */ 03961000
@RF01393 LH    @12,SAVEVOL                                         1395 03962000
         C     @12,@CF02926                                        1395 03963000
         BNL   @RF01395                                            1395 03964000
*             DO;                                                  1396 03965000
*               XADD=DJFCBPTR->JFCBEXAD;/* NON-ZERO VALUE INDICATES     03966000
*                                      THERE ARE MORE JFCBX'S ON D.S.*/ 03967000
         L     @12,DJFCBPTR                                        1397 03968000
         MVC   XADD(3),JFCBEXAD(@12)                               1397 03969000
*               DO I=1 TO 5;        /* THIS LOOP WILL NOT OVERLAY A     03970000
*                                      VOLSER IN THE JFCB. WHEN THE     03971000
*                                      JFCB GOES BLANK,ANY REMAINING    03972000
*                                      VOLSERS IN THE DSDR ARE     1398 03973000
*                                      BROUGHT OVER TO THE JFCB.     */ 03974000
         LA    @12,1                                               1398 03975000
         ST    @12,I                                               1398 03976000
@DL01398 DS    0H                                                  1399 03977000
*                 IF(JFCAVOLS(I)=BLANKS/* IF JFCB SLOT IS BLANK...   */ 03978000
*                     &DJFCBPTR->JFCAVOLS(I)^=BLANKS)/* AND        1399 03979000
*                                      CORRESPONDING                 */ 03980000
*                   THEN            /* DSDR SLOT IS NOT BLANK...     */ 03981000
         L     @11,JFCBPTR                                         1399 03982000
         MH    @12,@CH00035                                        1399 03983000
         ST    @12,@TF00001                                        1399 03984000
         ALR   @12,@11                                             1399 03985000
         CLC   JFCAVOLS-6(6,@12),@CC03776                          1399 03986000
         BNE   @RF01399                                            1399 03987000
         L     @12,DJFCBPTR                                        1399 03988000
         AL    @12,@TF00001                                        1399 03989000
         CLC   JFCAVOLS-6(6,@12),@CC03776                          1399 03990000
         BE    @RF01399                                            1399 03991000
*                   JFCAVOLS(I)=DJFCBPTR->JFCAVOLS(I);/* OVERLAY.    */ 03992000
         AL    @11,@TF00001                                        1400 03993000
         L     @12,DJFCBPTR                                        1400 03994000
         AL    @12,@TF00001                                        1400 03995000
         MVC   JFCAVOLS-6(6,@11),JFCAVOLS-6(@12)                   1400 03996000
*               END;                                               1401 03997000
@RF01399 LA    @12,1                                               1401 03998000
         AL    @12,I                                               1401 03999000
         ST    @12,I                                               1401 04000000
         C     @12,@CF00034                                        1401 04001000
         BNH   @DL01398                                            1401 04002000
*               IF XADD^=0 THEN     /* THE JFCB HAD NO VOLSERS IN A     04003000
*                                      JFCBX. THE DSDR MAY HAVE SOME.   04004000
*                                      GO INSURE THAT THE PROPER   1402 04005000
*                                      AMOUNT OF JFCBX'S REACH SWA.     04006000
*                                      THIS CORRELATES TO THE NEW  1402 04007000
*                                      JFCBVLCT VALUE.               */ 04008000
         L     @12,XADD-1                                          1402 04009000
         LA    @12,0(,@12)                                         1402 04010000
         LTR   @12,@12                                             1402 04011000
         BZ    @RF01402                                            1402 04012000
*                 DO;                                              1403 04013000
*                   PREV=ADDR(JFCBEXAD);/* INPUT TO JFCBXJOB       1404 04014000
*                                      CHAINING.                     */ 04015000
         L     @12,JFCBPTR                                         1404 04016000
         LA    @11,JFCBEXAD(,@12)                                  1404 04017000
         STCM  @11,7,PREV                                          1404 04018000
*                   SWAXADD=JFCBEXAD;/* POINTER TO SWA JFCBX (IF ANY)*/ 04019000
         MVC   SWAXADD(3),JFCBEXAD(@12)                            1405 04020000
*                   CALL JFCBXJOB;  /* GO PROCESS JFCBXS             */ 04021000
         BAL   @14,JFCBXJOB                                        1406 04022000
*                 END;                                             1407 04023000
*             END;                                                 1408 04024000
*           ELSE                                                   1409 04025000
*             DO;                                                  1409 04026000
*                                                                  1409 04027000
         B     @RC01395                                            1409 04028000
@RF01395 DS    0H                                                  1410 04029000
*               /*****************************************************/ 04030000
*               /*                                                   */ 04031000
*               /* REMAINDER OF PROCEDURE PROCESSES CASES WHERE THERE*/ 04032000
*               /* ARE MORE THAN 5 VOLSERS SPECIFIES IN THE JFCB.    */ 04033000
*               /*                                                   */ 04034000
*               /*****************************************************/ 04035000
*                                                                  1410 04036000
*               SWVA=JFCBEXAD;      /* PREPARE FOR LOOP - JFCBX INSWA*/ 04037000
         L     @12,SWEPAPTR                                        1410 04038000
         L     @11,JFCBPTR                                         1410 04039000
         MVC   SWVA(3,@12),JFCBEXAD(@11)                           1410 04040000
*               DO WHILE SAVEVOL>FIVE;/* READ JFCBXS FROM SWA AND  1411 04041000
*                                      CHKPT D.S. UNTIL DOWN TO LAST    04042000
*                                      SWA JFCBX.            @YM03547*/ 04043000
         B     @DE01411                                            1411 04044000
@DL01411 DS    0H                                                  1412 04045000
*                 CALL READCHEK;    /* GET DSDR JFCBX.               */ 04046000
         BAL   @14,READCHEK                                        1412 04047000
*                 TYPE2PTR=IOBUFAD; /* REFRESH BUFFER POINTER        */ 04048000
         ST    IOBUFAD,TYPE2PTR                                    1413 04049000
*                 CALL READSWA;     /* GET SWA JFCBX.                */ 04050000
         BAL   @14,READSWA                                         1414 04051000
*                 JFCBXPTR=SWBLKPTR;/* ADDR'ABILITY FOR SWA JFCBX    */ 04052000
         L     @12,SWEPAPTR                                        1415 04053000
         L     @11,SWBLKPTR(,@12)                                  1415 04054000
         ST    @11,JFCBXPTR                                        1415 04055000
*                 SWVA=JFCBXTTR;    /* PREPARE FOR NEXT READ.        */ 04056000
         MVC   SWVA(3,@12),JFCBXTTR(@11)                           1416 04057000
*                 SAVEVOL=SAVEVOL-FIFTEEN;/* LOOP CONTROL.           */ 04058000
         LH    @12,SAVEVOL                                         1417 04059000
         SL    @12,@CF03927                                        1417 04060000
         STH   @12,SAVEVOL                                         1417 04061000
*               END;                                               1418 04062000
@DE01411 LH    @12,SAVEVOL                                         1418 04063000
         C     @12,@CF00034                                        1418 04064000
         BH    @DL01411                                            1418 04065000
*               XADD=DJFCXPTR->JFCBXTTR;/* TO REMEMBER IF ANYMORE  1419 04066000
*                                      JFCBX'S ON CHKPT D.S.         */ 04067000
         L     @12,DJFCXPTR                                        1419 04068000
         MVC   XADD(3),JFCBXTTR(@12)                               1419 04069000
*               DO I=1 TO FIFTEEN;  /* DONT OVERLAY ANY SWA VOLSERS,    04070000
*                                      BUT PICK UP ANY EXTRAS ON DSDR*/ 04071000
         LA    @12,1                                               1420 04072000
         ST    @12,I                                               1420 04073000
@DL01420 DS    0H                                                  1421 04074000
*                 IF(JFCBXVOL(I)=BLANKS/* IF SWA VOLSER IS BLANK...  */ 04075000
*                     &DJFCXPTR->JFCBXVOL(I)^=BLANKS)/* & DSDR     1421 04076000
*                                      ISN'T...                      */ 04077000
*                   THEN                                           1421 04078000
         L     @11,JFCBXPTR                                        1421 04079000
         MH    @12,@CH00035                                        1421 04080000
         ST    @12,@TF00001                                        1421 04081000
         ALR   @12,@11                                             1421 04082000
         BCTR  @12,0                                               1421 04083000
         BCTR  @12,0                                               1421 04084000
         CLC   JFCBXVOL-4(6,@12),@CC03776                          1421 04085000
         BNE   @RF01421                                            1421 04086000
         L     @12,DJFCXPTR                                        1421 04087000
         LR    @09,@12                                             1421 04088000
         AL    @09,@TF00001                                        1421 04089000
         BCTR  @09,0                                               1421 04090000
         BCTR  @09,0                                               1421 04091000
         CLC   JFCBXVOL-4(6,@09),@CC03776                          1421 04092000
         BE    @RF01421                                            1421 04093000
*                   JFCBXVOL(I)=DJFCXPTR->JFCBXVOL(I);/* OVERLAY     */ 04094000
         AL    @11,@TF00001                                        1422 04095000
         BCTR  @11,0                                               1422 04096000
         BCTR  @11,0                                               1422 04097000
         AL    @12,@TF00001                                        1422 04098000
         BCTR  @12,0                                               1422 04099000
         BCTR  @12,0                                               1422 04100000
         MVC   JFCBXVOL-4(6,@11),JFCBXVOL-4(@12)                   1422 04101000
*               END;                                               1423 04102000
@RF01421 LA    @12,1                                               1423 04103000
         AL    @12,I                                               1423 04104000
         ST    @12,I                                               1423 04105000
         C     @12,@CF03927                                        1423 04106000
         BNH   @DL01420                                            1423 04107000
*               IF XADD^=0 THEN     /* IF THERE ARE MORE JFCBXS ON 1424 04108000
*                                      D.S. GO SEE IF THEY CAN     1424 04109000
*                                      OVERLAY OLD ONES OR IF ASSIGNS   04110000
*                                      ARE NEEDED                    */ 04111000
         L     @12,XADD-1                                          1424 04112000
         LA    @12,0(,@12)                                         1424 04113000
         LTR   @12,@12                                             1424 04114000
         BZ    @RF01424                                            1424 04115000
*                 DO;                                              1425 04116000
*                   PREV=ADDR(JFCBXTTR);/* INPUT TO JFCBXJOB CHAINING*/ 04117000
         L     @12,JFCBXPTR                                        1426 04118000
         STCM  @12,7,PREV                                          1426 04119000
*                   SWAXADD=JFCBXTTR;/* ADDRESS OF SWA JFCBX (IF ANY)*/ 04120000
         MVC   SWAXADD(3),JFCBXTTR(@12)                            1427 04121000
*                   CALL JFCBXJOB;  /* GO PROCESS JFCBXS             */ 04122000
         BAL   @14,JFCBXJOB                                        1428 04123000
*                 END;                                             1429 04124000
*             END;                                                 1430 04125000
*         END;                                                     1431 04126000
*     END;                                                         1432 04127000
*   END VOLSERS;                                                   1433 04128000
@EL00017 DS    0H                                                  1433 04129000
@EF00017 DS    0H                                                  1433 04130000
@ER00017 LM    @14,@06,@SA00017                                    1433 04131000
         LM    @08,@12,@SA00017+36                                 1433 04132000
         BR    @14                                                 1433 04133000
*JFCBXJOB:                                                         1434 04134000
*   PROC OPTIONS(NOSAVE(IOBUFAD));                                 1434 04135000
*                                                                  1434 04136000
JFCBXJOB STM   @14,@06,@SA00018                                    1434 04137000
         STM   @08,@12,@SA00018+36                                 1434 04138000
*/*************************************************************      */ 04139000
*/* THIS PROC PROCESSES THE VOLSERS IN JFCBXS AFTER IT HAS BEEN      */ 04140000
*/* DETERMINED THAT THERE ARE JFCBXS ON THE CKPT DS.  IF THERE       */ 04141000
*/* ARE JFCBXS EXISTING IN SWA, THEY WILL BE OVERLAYED RATHER        */ 04142000
*/* THAN ASSIGNING SPACE FOR NEW ONES.                               */ 04143000
*/*************************************************************      */ 04144000
*                                                                  1435 04145000
*   STPXLOOP=NOTON;                 /* LOOP CONTROL                  */ 04146000
         NI    STPXLOOP,B'01111111'                                1435 04147000
*   DO WHILE STPXLOOP=NOTON;                                       1436 04148000
         B     @DE01436                                            1436 04149000
@DL01436 DS    0H                                                  1437 04150000
*     CALL READCHEK;                /* GET JFCBX FROM CHKPT D.S.     */ 04151000
         BAL   @14,READCHEK                                        1437 04152000
*     TYPE2PTR=IOBUFAD;             /* REFRESH BUFFER POINTER        */ 04153000
         ST    IOBUFAD,TYPE2PTR                                    1438 04154000
*     DJFCXPTR=ADDR(DSDJFCBX);      /* RE-INITIALIZE DSDR ADDRABILITY*/ 04155000
         L     @12,TYPE2PTR                                        1439 04156000
         LA    @12,DSDJFCBX(,@12)                                  1439 04157000
         ST    @12,DJFCXPTR                                        1439 04158000
*     IF SWAXADD^=0 THEN            /* A JFCBX EXISTS IN SWA. USE IT */ 04159000
         L     @12,SWAXADD-1                                       1440 04160000
         LA    @12,0(,@12)                                         1440 04161000
         LTR   @12,@12                                             1440 04162000
         BZ    @RF01440                                            1440 04163000
*       DO;                         /* INSTEAD OF ASSIGNING NEW SPACE*/ 04164000
*         SWVA=SWAXADD;             /* PREPARE FOR READ.             */ 04165000
         L     @12,SWEPAPTR                                        1442 04166000
         MVC   SWVA(3,@12),SWAXADD                                 1442 04167000
*         CALL READSWA;             /* READ SWA JFCBX.               */ 04168000
         BAL   @14,READSWA                                         1443 04169000
*         JFCBXPTR=SWBLKPTR;        /* ADDR'ABILITY FOR JFCBX.       */ 04170000
         L     @12,SWEPAPTR                                        1444 04171000
         L     @12,SWBLKPTR(,@12)                                  1444 04172000
         ST    @12,JFCBXPTR                                        1444 04173000
*         SWAXADD=JFCBXTTR;         /* FOR NEXT TIME THRU THE LOOP,     04174000
*                                      IF ANOTHER SWA JFCBX EXISTS.  */ 04175000
         MVC   SWAXADD(3),JFCBXTTR(@12)                            1445 04176000
*         DO I=1 TO FIFTEEN;        /* MOVE THE VOLSERS OVER.        */ 04177000
         LA    @12,1                                               1446 04178000
         ST    @12,I                                               1446 04179000
@DL01446 DS    0H                                                  1447 04180000
*           JFCBXVOL(I)=DJFCXPTR->JFCBXVOL(I);                     1447 04181000
         LR    @11,@12                                             1447 04182000
         MH    @11,@CH00035                                        1447 04183000
         L     @09,JFCBXPTR                                        1447 04184000
         ALR   @09,@11                                             1447 04185000
         BCTR  @09,0                                               1447 04186000
         BCTR  @09,0                                               1447 04187000
         L     @01,DJFCXPTR                                        1447 04188000
         ALR   @01,@11                                             1447 04189000
         BCTR  @01,0                                               1447 04190000
         BCTR  @01,0                                               1447 04191000
         MVC   JFCBXVOL-4(6,@09),JFCBXVOL-4(@01)                   1447 04192000
*         END;                                                     1448 04193000
         AL    @12,@CF00069                                        1448 04194000
         ST    @12,I                                               1448 04195000
         C     @12,@CF03927                                        1448 04196000
         BNH   @DL01446                                            1448 04197000
*         JFCBXDEV=DJFCXPTR->JFCBXDEV;/* CAT. DEVICE         @YM08615*/ 04198000
         L     @12,JFCBXPTR                                        1449 04199000
         L     @11,DJFCXPTR                                        1449 04200000
         MVC   JFCBXDEV(4,@12),JFCBXDEV(@11)                       1449 04201000
*         JFCBXNAM=DJFCXPTR->JFCBXNAM;/* ALIAS NAME FROM CAT @YM08616*/ 04202000
         MVC   JFCBXNAM(44,@12),JFCBXNAM(@11)                      1450 04203000
*       END;                                                       1451 04204000
*     ELSE                                                         1452 04205000
*       DO;                         /* NO JFCBX IN SWA- ASSIGN ONE   */ 04206000
         B     @RC01440                                            1452 04207000
@RF01440 DS    0H                                                  1453 04208000
*         CALL ASGNPROC;            /* DO THE ASSIGN                 */ 04209000
         BAL   @14,ASGNPROC                                        1453 04210000
*         SLOT=ASGNADD;             /* PLUG IN NEW BLOCK - SLOT IS 1454 04211000
*                                      BASED ON PREV...              */ 04212000
         L     @12,PREV-1                                          1454 04213000
         MVC   SLOT(3,@12),ASGNADD                                 1454 04214000
*         SWAXADD=0;                /* LOOP CONTROL...PREVENTS SEARCH   04215000
*                                      FOR ANY MORE SWA JFCBX'S.     */ 04216000
         SLR   @12,@12                                             1455 04217000
         STCM  @12,7,SWAXADD                                       1455 04218000
*         SWBUFPTR=DJFCXPTR;        /* PREPARE FOR WITE MOVE MODE    */ 04219000
         L     @12,EPAPTR                                          1456 04220000
         L     @11,DJFCXPTR                                        1456 04221000
         ST    @11,SWBUFPTR(,@12)                                  1456 04222000
*         SWROWVA=ASGNADD;          /* INPUT TO MOVE MODE            */ 04223000
         MVC   SWROWVA(3,@12),ASGNADD                              1457 04224000
*         SWWRTID=JFCBX1D;          /* SET JFCBX ID INTO INPUT       */ 04225000
         MVI   SWWRTID(@12),X'1D'                                  1458 04226000
*         CALL WRITESWA;            /* DO THE WRITE.                 */ 04227000
         BAL   @14,WRITESWA                                        1459 04228000
*         REALADD=LENGTH(SWAPFX);                                  1460 04229000
         LA    @12,16                                              1460 04230000
         STCM  @12,7,REALADD                                       1460 04231000
*         JFCBXPTR=(ASGNADD+REALADD);/* TRANSLATE PAST PREFIX...     */ 04232000
         L     @11,ASGNADD-1                                       1461 04233000
         LA    @11,0(,@11)                                         1461 04234000
         ALR   @12,@11                                             1461 04235000
         ST    @12,JFCBXPTR                                        1461 04236000
*       END;                                                       1462 04237000
*     PREV=ADDR(JFCBXTTR);          /* RE-SET BACK-LINK PTR          */ 04238000
@RC01440 L     @12,JFCBXPTR                                        1463 04239000
         STCM  @12,7,PREV                                          1463 04240000
*     IF(DJFCXPTR->JFCBXTTR=0       /* IF DSDR HAS NO JFCBX          */ 04241000
*         &JFCBXTTR=0) THEN         /* AND SWA HAS NO JFCBX          */ 04242000
         SLR   @11,@11                                             1464 04243000
         L     @09,DJFCXPTR                                        1464 04244000
         SLR   @15,@15                                             1464 04245000
         ICM   @15,7,JFCBXTTR(@09)                                 1464 04246000
         CR    @11,@15                                             1464 04247000
         BNE   @RF01464                                            1464 04248000
         SLR   @09,@09                                             1464 04249000
         ICM   @09,7,JFCBXTTR(@12)                                 1464 04250000
         CR    @11,@09                                             1464 04251000
         BNE   @RF01464                                            1464 04252000
*       DO;                         /*                       @YM08181*/ 04253000
*         STPXLOOP=ON;              /* STOP THE LOOP                 */ 04254000
         OI    STPXLOOP,B'10000000'                                1466 04255000
*         SLOT=0;                                                  1467 04256000
         STCM  @11,7,SLOT(@12)                                     1467 04257000
*       END;                                                       1468 04258000
*     ELSE                                                         1469 04259000
*       IF(DJFCXPTR->JFCBXTTR=0     /* IF DSDR HAS NONE...           */ 04260000
*           &JFCBXTTR^=0) THEN      /* BUT SWA DOES...               */ 04261000
         B     @RC01464                                            1469 04262000
@RF01464 SLR   @12,@12                                             1469 04263000
         L     @11,DJFCXPTR                                        1469 04264000
         SLR   @09,@09                                             1469 04265000
         ICM   @09,7,JFCBXTTR(@11)                                 1469 04266000
         CR    @12,@09                                             1469 04267000
         BNE   @RF01469                                            1469 04268000
         L     @11,JFCBXPTR                                        1469 04269000
         SLR   @09,@09                                             1469 04270000
         ICM   @09,7,JFCBXTTR(@11)                                 1469 04271000
         CR    @12,@09                                             1469 04272000
         BE    @RF01469                                            1469 04273000
*         STPXLOOP=ON;              /* STOP THE LOOP BUT TEST        */ 04274000
         OI    STPXLOOP,B'10000000'                                1470 04275000
*/***********************************************************@ZA20563*/ 04276000
*/*  CODE TO ZERO THE JFCBXTTR FIELD ON A DEFERRED CHECKPOINT@ZA20563*/ 04277000
*/*  RESTART WAS REMOVED TO ALLOW THE VOLUME COUNT TO BE     @ZA20563*/ 04278000
*/*  INCREASED WHEN THE JOB WAS RESUMED                      @ZA20563*/ 04279000
*/***********************************************************@ZA20563*/ 04280000
*                                                                  1471 04281000
*   END;                                                           1471 04282000
@RF01469 DS    0H                                                  1471 04283000
@RC01464 DS    0H                                                  1471 04284000
@DE01436 TM    STPXLOOP,B'10000000'                                1471 04285000
         BZ    @DL01436                                            1471 04286000
*   END JFCBXJOB;                                                  1472 04287000
@EL00018 DS    0H                                                  1472 04288000
@EF00018 DS    0H                                                  1472 04289000
@ER00018 LM    @14,@06,@SA00018                                    1472 04290000
         LM    @08,@12,@SA00018+36                                 1472 04291000
         BR    @14                                                 1472 04292000
*GDGNTJOB:                                                         1473 04293000
*   PROC OPTIONS(NOSAVE(IOBUFAD));                                 1473 04294000
*                                                                  1473 04295000
GDGNTJOB STM   @14,@06,@SA00019                                    1473 04296000
         STM   @08,@12,@SA00019+36                                 1473 04297000
*/*************************************************************      */ 04298000
*/* THE GDG NAME TABLE WILL BE MADE TO APPEAR AS IT DID AT THE       */ 04299000
*/* CHECKPOINT. NEW SPACE FOR A GDGNT WILL BE ASSIGNED ONLY IF       */ 04300000
*/* NONE EXISTS IN SWA TO BE OVERLAYED.                              */ 04301000
*/*************************************************************      */ 04302000
*                                                                  1474 04303000
*   TYPE3PTR=IOBUFAD;               /* ADDR'ABILITY TYPE3 DSDR       */ 04304000
         ST    IOBUFAD,TYPE3PTR                                    1474 04305000
*   DGDGPTR=ADDR(DSGDGNT);          /* ADDR'ABILITY DSDR GDGNT       */ 04306000
         L     @12,TYPE3PTR                                        1475 04307000
         LA    @12,DSGDGNT(,@12)                                   1475 04308000
         ST    @12,DGDGPTR                                         1475 04309000
*   GDGSWTCH=NOTON;                 /* LOOP CONTROL.                 */ 04310000
         NI    GDGSWTCH,B'01111111'                                1476 04311000
*   PREV=ADDR(JCTGDGNT);            /* INITIALIZE BACK-CHAIN BASE.   */ 04312000
         L     @12,JCTPTR                                          1477 04313000
         LA    @11,JCTGDGNT(,@12)                                  1477 04314000
         STCM  @11,7,PREV                                          1477 04315000
*   GDGSWA=JCTGDGNT;                /* INIT ADDR SWA GDGNT           */ 04316000
         MVC   GDGSWA(3),JCTGDGNT(@12)                             1478 04317000
*   DO WHILE GDGSWTCH=NOTON;                                       1479 04318000
         B     @DE01479                                            1479 04319000
@DL01479 DS    0H                                                  1480 04320000
*     IF GDGSWA^=0 THEN             /* A GDGNT EXISTS IN SWA. USE IT */ 04321000
         L     @12,GDGSWA-1                                        1480 04322000
         LA    @12,0(,@12)                                         1480 04323000
         LTR   @12,@12                                             1480 04324000
         BZ    @RF01480                                            1480 04325000
*       DO;                         /* INSTEAD OF ASSIGNING SPACE    */ 04326000
*         SWVA=GDGSWA;              /* PREPARE FOR READ              */ 04327000
         L     @12,SWEPAPTR                                        1482 04328000
         MVC   SWVA(3,@12),GDGSWA                                  1482 04329000
*         CALL READSWA;             /* READ GDGNT FROM SWA           */ 04330000
         BAL   @14,READSWA                                         1483 04331000
*         GDGNTPTR=SWBLKPTR;        /* ADDR'ABILITY FOR SWA GDGNT    */ 04332000
         L     @12,SWEPAPTR                                        1484 04333000
         L     @12,SWBLKPTR(,@12)                                  1484 04334000
         ST    @12,GDGNTPTR                                        1484 04335000
*         GDGSWA=GNTNEXTP;          /* PREPARE FOR NEXT POSSIBLE   1485 04336000
*                                      LOOPTHRU.                     */ 04337000
*                                                                  1485 04338000
         MVC   GDGSWA(3),GNTNEXTP(@12)                             1485 04339000
*         /***********************************************************/ 04340000
*         /*                                                         */ 04341000
*         /* NOW OVERLAY VARIABLE GDG INFO BUT NOT LINK FIELD        */ 04342000
*         /*                                                         */ 04343000
*         /***********************************************************/ 04344000
*                                                                  1486 04345000
*         DO I=1 TO DIM(GNTGRPEN);                                 1486 04346000
         LA    @12,1                                               1486 04347000
         ST    @12,I                                               1486 04348000
@DL01486 DS    0H                                                  1487 04349000
*           GNTGRPEN(I)=DGDGPTR->GNTGRPEN(I);                      1487 04350000
         LR    @11,@12                                             1487 04351000
         MH    @11,@CH03357                                        1487 04352000
         L     @09,GDGNTPTR                                        1487 04353000
         ALR   @09,@11                                             1487 04354000
         AL    @09,@CF04570                                        1487 04355000
         L     @01,DGDGPTR                                         1487 04356000
         ALR   @01,@11                                             1487 04357000
         AL    @01,@CF04570                                        1487 04358000
         MVC   GNTGRPEN-8(39,@09),GNTGRPEN-8(@01)                  1487 04359000
*         END;                                                     1488 04360000
         AL    @12,@CF00069                                        1488 04361000
         ST    @12,I                                               1488 04362000
         C     @12,@CF00033                                        1488 04363000
         BNH   @DL01486                                            1488 04364000
*         GNTENT=DGDGPTR->GNTENT;                                  1489 04365000
         L     @12,DGDGPTR                                         1489 04366000
         IC    @11,GNTENT(,@12)                                    1489 04367000
         L     @12,GDGNTPTR                                        1489 04368000
         STC   @11,GNTENT(,@12)                                    1489 04369000
*       END;                                                       1490 04370000
*     ELSE                                                         1491 04371000
*       DO;                         /* NO GDGNT EXISTS IN SWA. ASSIGN   04372000
*                                      AND CHAIN.                    */ 04373000
         B     @RC01480                                            1491 04374000
@RF01480 DS    0H                                                  1492 04375000
*         CALL ASGNPROC;            /* DO THE ASSIGN.                */ 04376000
         BAL   @14,ASGNPROC                                        1492 04377000
*         SLOT=ASGNADD;             /* CHAIN NEW TO OLD              */ 04378000
         L     @12,PREV-1                                          1493 04379000
         MVC   SLOT(3,@12),ASGNADD                                 1493 04380000
*         GDGSWA=0;                 /* LOOP CONTROL - PREVENTS SEARCH   04381000
*                                      ANY MORE SWA GDGNTS           */ 04382000
         SLR   @12,@12                                             1494 04383000
         STCM  @12,7,GDGSWA                                        1494 04384000
*         SWBUFPTR=DGDGPTR;         /* POINT TO DSDR GDG BUFFER      */ 04385000
         L     @12,EPAPTR                                          1495 04386000
         L     @11,DGDGPTR                                         1495 04387000
         ST    @11,SWBUFPTR(,@12)                                  1495 04388000
*         SWROWVA=ASGNADD;          /* POINT TO SWA BLOCK PREFIX     */ 04389000
         MVC   SWROWVA(3,@12),ASGNADD                              1496 04390000
*         SWWRTID=GDGID;            /* SET BLOCK ID FOR WRITE        */ 04391000
         MVI   SWWRTID(@12),X'23'                                  1497 04392000
*         CALL WRITESWA;                                           1498 04393000
         BAL   @14,WRITESWA                                        1498 04394000
*         REALADD=LENGTH(SWAPFX);                                  1499 04395000
         LA    @12,16                                              1499 04396000
         STCM  @12,7,REALADD                                       1499 04397000
*         GDGNTPTR=(ASGNADD+REALADD);/* TRANSLATE PAST PREFIX        */ 04398000
         L     @11,ASGNADD-1                                       1500 04399000
         LA    @11,0(,@11)                                         1500 04400000
         ALR   @12,@11                                             1500 04401000
         ST    @12,GDGNTPTR                                        1500 04402000
*       END;                                                       1501 04403000
*     PREV=ADDR(GNTNEXTP);          /* RE-SET BACK-CHAIN BASE        */ 04404000
@RC01480 L     @12,GDGNTPTR                                        1502 04405000
         STCM  @12,7,PREV                                          1502 04406000
*     IF DGDGPTR->GNTNEXTP=0 THEN   /* IF LAST DSDR GDGNT...         */ 04407000
         L     @11,DGDGPTR                                         1503 04408000
         ICM   @09,7,GNTNEXTP(@11)                                 1503 04409000
         BNZ   @RF01503                                            1503 04410000
*       DO;                                                        1504 04411000
*         SLOT=0;                   /* CLOSE OFF SWA CHAIN           */ 04412000
         SLR   @11,@11                                             1505 04413000
         STCM  @11,7,SLOT(@12)                                     1505 04414000
*         GDGSWTCH=ON;              /* LOOP CONTROL - ALL DONE       */ 04415000
         OI    GDGSWTCH,B'10000000'                                1506 04416000
*       END;                                                       1507 04417000
*     ELSE                                                         1508 04418000
*       CALL READCHEK;              /* MORE TO GO...READ CHKPT D.S., */ 04419000
         B     @RC01503                                            1508 04420000
@RF01503 BAL   @14,READCHEK                                        1508 04421000
*     TYPE3PTR=IOBUFAD;             /* REFRESH BUFFER PTR AND START     04422000
*                                      THE LOOP OVER.                */ 04423000
@RC01503 ST    IOBUFAD,TYPE3PTR                                    1509 04424000
*     DGDGPTR=ADDR(DSGDGNT);        /* REFRESH GDG PTR       @ZA02560*/ 04425000
         L     @12,TYPE3PTR                                        1510 04426000
         LA    @12,DSGDGNT(,@12)                                   1510 04427000
         ST    @12,DGDGPTR                                         1510 04428000
*   END;                                                           1511 04429000
@DE01479 TM    GDGSWTCH,B'10000000'                                1511 04430000
         BZ    @DL01479                                            1511 04431000
*   END GDGNTJOB;                                                  1512 04432000
@EL00019 DS    0H                                                  1512 04433000
@EF00019 DS    0H                                                  1512 04434000
@ER00019 LM    @14,@06,@SA00019                                    1512 04435000
         LM    @08,@12,@SA00019+36                                 1512 04436000
         BR    @14                                                 1512 04437000
*SCTXPROC:                                                         1513 04438000
*   PROC;                                                          1513 04439000
*                                                                  1513 04440000
SCTXPROC STM   @14,@12,@SA00020                                    1513 04441000
*/*************************************************************      */ 04442000
*/* THE SCTX, WHICH NORMALLY CONTAINS PARAMETER INFORMATION FROM     */ 04443000
*/* THE EXEC CARD IS USED TO PASS THE RESTART PARAMETER LIST TO      */ 04444000
*/* THE RESTART SVC.  A 'NOTE' IS DONE ON THE CKPT DS, AND THE       */ 04445000
*/* 'NOTED' TTR IS PLACED IN THE PARM LIST.  THE REST OF THE         */ 04446000
*/* LIST CONSISTS OF THE CHR INFORMATION LEFT BY THE CHECKPOINT      */ 04447000
*/* SVC. IF THERE IS A AN OLD SCTX, IT WILL BE OVERLAYED.            */ 04448000
*/*************************************************************      */ 04449000
*                                                                  1514 04450000
*   DO;                             /* MODESET SAVEKEY(SAVEKEYA)   1514 04451000
*                                      KEYADDR(ZEROPTR)              */ 04452000
*     RESPECIFY                                                    1515 04453000
*      (GPR02F) RESTRICTED;                                        1515 04454000
*     IPK;                          /* SAVE CURRENT PSW KEY          */ 04455000
         IPK                                                       1516 04456000
*     SAVEKEYA=GPR02F;                                             1517 04457000
         STC   GPR02F,SAVEKEYA                                     1517 04458000
*     SPKA(ZEROPTR);                /* SET PSW KEY                   */ 04459000
         SLR   @12,@12                                             1518 04460000
         SPKA  0(@12)                                              1518 04461000
*     RESPECIFY                                                    1519 04462000
*      (GPR02F) UNRESTRICTED;                                      1519 04463000
*   END;                            /* MODESET SAVEKEY(SAVEKEYA)   1520 04464000
*                                      KEYADDR(ZEROPTR) KEY = 0      */ 04465000
*   CALL READCHEK;                  /* READ THE CIR FOR NOTE @YM04748*/ 04466000
         BAL   @14,READCHEK                                        1521 04467000
*   R1=DCBPARM;                     /* SET R1 PTR TO DCB FOR NOTE    */ 04468000
         L     R1,DCBPARM                                          1522 04469000
*   GEN(NOTE (1));                  /* GET TTR OR BLOCKNO FOR RESTART*/ 04470000
         NOTE (1)                                                       04471000
*   NOTEPARM=R1;                    /* PUT INTO RESTART PARAMETER  1524 04472000
*                                      LIST                          */ 04473000
         ST    R1,NOTEPARM                                         1524 04474000
*/**************************************                             */ 04475000
*/* XB609 IS NOW THROUGH WITH CKPT DS                                */ 04476000
*/**************************************                             */ 04477000
*                                                                  1525 04478000
*   SAVEJSCB=JSCBACT;               /* SAVE JSCBACT FIELD    @YM01981*/ 04479000
         L     @12,TCBPTR                                          1525 04480000
         L     @12,TCBJSCB(,@12)                                   1525 04481000
         L     @12,JSCBACT(,@12)                                   1525 04482000
         ST    @12,SAVEJSCB                                        1525 04483000
*   JSCBACT=TCBJSCB;                /* FORCE CLOSE TO INIT JSCB      */ 04484000
         L     @12,TCBPTR                                          1526 04485000
         L     @12,TCBJSCB(,@12)                                   1526 04486000
         ST    @12,JSCBACT(,@12)                                   1526 04487000
*   DO;                             /* POST (ECB610)                 */ 04488000
*     RESPECIFY                                                    1528 04489000
*      (GPR00F,                                                    1528 04490000
*       GPR01P) RESTRICTED;                                        1528 04491000
*     GPR00F=0;                     /* POST CODE IN R0               */ 04492000
         SLR   GPR00F,GPR00F                                       1529 04493000
*     GPR01P=ADDR(ECB610);          /* ECB ADDRESS                   */ 04494000
         LA    GPR01P,ECB610                                       1530 04495000
*     SVC(2);                       /* ISSUE POST SVC                */ 04496000
         SVC   2                                                   1531 04497000
*     RESPECIFY                                                    1532 04498000
*      (GPR00F,                                                    1532 04499000
*       GPR01P) UNRESTRICTED;                                      1532 04500000
*   END;                            /* POST (ECB610) POST 610 TO   1533 04501000
*                                      CLOSE AND TERM                */ 04502000
*/*************************************************                  */ 04503000
*/*NOW WAIT FOR XB610 TO COMPLETE THE CLOSE...                       */ 04504000
*/* OTHERWISE 609 WILL TERM AND FREE THE DCB                         */ 04505000
*/************************************************                   */ 04506000
*                                                                  1534 04507000
*   HIBITC1=ON;                     /* SETUP WAIT ECBLIST END        */ 04508000
         OI    HIBITC1,B'10000000'                                 1534 04509000
*   DO;                             /* WAIT ECBLIST(ADECBC1)         */ 04510000
*     RESPECIFY                                                    1536 04511000
*      (GPR00P,                                                    1536 04512000
*       GPR01P) RESTRICTED;                                        1536 04513000
*     GPR00P=1;                     /* LOAD WAIT COUNT               */ 04514000
         LA    GPR00P,1                                            1537 04515000
*     GPR01P=-ADDR(ADECBC1);        /* ADDRESS OF LIST OF ECB'S      */ 04516000
         LA    GPR01P,ADECBC1                                      1538 04517000
         LCR   GPR01P,GPR01P                                       1538 04518000
*     SVC(1);                       /* WAIT SVC                      */ 04519000
         SVC   1                                                   1539 04520000
*     RESPECIFY                                                    1540 04521000
*      (GPR00P,                                                    1540 04522000
*       GPR01P) UNRESTRICTED;                                      1540 04523000
*   END;                            /* WAIT ECBLIST(ADECBC1) ISSUE 1541 04524000
*                                      WAIT FOR CLOSE COMPLETE       */ 04525000
*   JSCBACT=SAVEJSCB;               /* RESTORE PP JSCB       @YM01981*/ 04526000
         L     @12,TCBPTR                                          1542 04527000
         L     @12,TCBJSCB(,@12)                                   1542 04528000
         L     @11,SAVEJSCB                                        1542 04529000
         ST    @11,JSCBACT(,@12)                                   1542 04530000
*   DO;                             /* MODESET KEYADDR(SAVEKEYA)     */ 04531000
*     SPKA(SAVEKEYA);               /* SET PSW KEY                   */ 04532000
         SLR   @12,@12                                             1544 04533000
         IC    @12,SAVEKEYA                                        1544 04534000
         SPKA  0(@12)                                              1544 04535000
*   END;                            /* MODESET KEYADDR(SAVEKEYA) KEY    04536000
*                                      BACK TO SCHED                 */ 04537000
*/* READY TO COMPLETE 609 PROCESSING NOW                             */ 04538000
*                                                                  1546 04539000
*   DO;                             /* DETACH (SAVETCB)              */ 04540000
*     RESPECIFY                                                    1547 04541000
*      (GPR01P) RESTRICTED;                                        1547 04542000
*     GPR01P=ADDR(SAVETCB);         /* TCB ADDRESS                   */ 04543000
         LA    GPR01P,SAVETCB                                      1548 04544000
*     SVC(62);                      /* DETACH SVC                    */ 04545000
         SVC   62                                                  1549 04546000
*     RESPECIFY                                                    1550 04547000
*      (GPR01P) UNRESTRICTED;                                      1550 04548000
*   END;                            /* DETACH (SAVETCB)      @YM06577*/ 04549000
*   IF SCTXBTTR^=0 THEN             /* IF AN OLD SCTX EXISTS,USE IT  */ 04550000
         L     @12,SCTPTR                                          1552 04551000
         ICM   @11,7,SCTXBTTR(@12)                                 1552 04552000
         BZ    @RF01552                                            1552 04553000
*     DO;                                                          1553 04554000
*       SWVA=SCTXBTTR;              /* SET UP FOR READ               */ 04555000
         L     @11,SWEPAPTR                                        1554 04556000
         MVC   SWVA(3,@11),SCTXBTTR(@12)                           1554 04557000
*       CALL READSWA;               /* GET SCTX FROM SWA             */ 04558000
         BAL   @14,READSWA                                         1555 04559000
*       SCTXPTR=SWBLKPTR;           /* ADDR'ABILITY SCTX             */ 04560000
         L     @12,SWEPAPTR                                        1556 04561000
         L     @12,SWBLKPTR(,@12)                                  1556 04562000
         ST    @12,SCTXPTR                                         1556 04563000
*       PARMX(1:LENGTH(RSTRTLST))=RSTRTLST;/* OVERLAY SWA WITH NEW 1557 04564000
*                                      LIST                          */ 04565000
         MVC   PARMX(49,@12),RSTRTLST                              1557 04566000
*     END;                                                         1558 04567000
*   ELSE                                                           1559 04568000
*     DO;                                                          1559 04569000
         B     @RC01552                                            1559 04570000
@RF01552 DS    0H                                                  1560 04571000
*       CALL ASGNPROC;              /* NO SCTX IN SWA...ASSIGN ONE   */ 04572000
         BAL   @14,ASGNPROC                                        1560 04573000
*       SCTXBTTR=ASGNADD;           /* PLUG IN TO SCT.               */ 04574000
         L     @12,ASGNADD-1                                       1561 04575000
         LA    @12,0(,@12)                                         1561 04576000
         L     @11,SCTPTR                                          1561 04577000
         STCM  @12,7,SCTXBTTR(@11)                                 1561 04578000
*       SCTXSVA=ASGNADD;            /* SCTX SELF PTR                 */ 04579000
         STCM  @12,7,SCTXSVA                                       1562 04580000
*       SCTXID1=SCTXID;             /* PUT IDENTIFIER IN BLOCK       */ 04581000
         MVI   SCTXID1,X'0C'                                       1563 04582000
*       SWBUFPTR=ADDR(SCTX);        /* FROM ADDRESS FOR WRITE        */ 04583000
         L     @11,EPAPTR                                          1564 04584000
         LA    @09,SCTX                                            1564 04585000
         ST    @09,SWBUFPTR(,@11)                                  1564 04586000
*       SWROWVA=ASGNADD;            /* TO BUFFER ADDRESS FOR WRITE   */ 04587000
         STCM  @12,7,SWROWVA(@11)                                  1565 04588000
*       SWWRTID='00'X;              /* ZERO ID IN EPA, ITS IN BLOCK  */ 04589000
         MVI   SWWRTID(@11),X'00'                                  1566 04590000
*       CALL WRITESWA;              /* WRITE THE BLOCK               */ 04591000
         BAL   @14,WRITESWA                                        1567 04592000
*     END;                                                         1568 04593000
*   SCTSEXEC=LENGTH(RSTRTLST);      /* SET LENGTH OF LIST INTO SCT   */ 04594000
@RC01552 L     @12,SCTPTR                                          1569 04595000
         MVC   SCTSEXEC(2,@12),@CH03812                            1569 04596000
*   END SCTXPROC;                                                  1570 04597000
@EL00020 DS    0H                                                  1570 04598000
@EF00020 DS    0H                                                  1570 04599000
@ER00020 LM    @14,@12,@SA00020                                    1570 04600000
         BR    @14                                                 1570 04601000
*ASGNPROC:                                                         1571 04602000
*   PROC;                                                          1571 04603000
ASGNPROC STM   @14,@12,@SA00021                                    1571 04604000
*   QMPOP=ASSIGN;                   /* SET FUNCTION = 'ASSIGN'       */ 04605000
         L     @12,QMPAPTR                                         1572 04606000
         MVI   QMPOP(@12),X'01'                                    1572 04607000
*   QMPCM=ONEBLOK;                  /* NUMBER BLOCKS TO WRITE = 1    */ 04608000
         NI    QMPCM(@12),B'00011111'                              1573 04609000
         OI    QMPCM(@12),B'00010000'                              1573 04610000
*   QMPACL=EPAPTR;                  /* POINT TO EPA                  */ 04611000
         MVC   QMPACL(3,@12),EPAPTR+1                              1574 04612000
*   R1=QMPAPTR;                     /* INPUT TO SWA MANAGER          */ 04613000
         LR    R1,@12                                              1575 04614000
*/*      06/30/72  R2                                                */ 04615000
*                                                                  1576 04616000
*   DCL                                                            1576 04617000
*     SWAMGPTR REG(15) PTR(31);                                    1576 04618000
*   SWAMGPTR=CVTJESCT->JESQMGR;                                    1577 04619000
         LA    @12,16                                              1577 04620000
         L     @12,CVTPTR(,@12)                                    1577 04621000
         L     @12,CVTJESCT(,@12)                                  1577 04622000
         L     SWAMGPTR,JESQMGR(,@12)                              1577 04623000
*   GEN(BALR 14,15);                /* GO TO SWA MANAGER             */ 04624000
         BALR 14,15                                                     04625000
*   ASGNADD=SWASNVA;                /* RETURN ADRESS TO CALLER       */ 04626000
         L     @12,EPAPTR                                          1579 04627000
         MVC   ASGNADD(3),SWASNVA(@12)                             1579 04628000
*   END ASGNPROC;                                                  1580 04629000
@EL00021 DS    0H                                                  1580 04630000
@EF00021 DS    0H                                                  1580 04631000
@ER00021 LM    @14,@12,@SA00021                                    1580 04632000
         BR    @14                                                 1580 04633000
*WRITESWA:                                                         1581 04634000
*   PROC;                                                          1581 04635000
*                                                                  1581 04636000
WRITESWA STM   @14,@12,@SA00022                                    1581 04637000
*/***********************************************                    */ 04638000
*/* SWBUFPTR, SWROWVA, AND SWRTIID (IF NEEDED)                       */ 04639000
*/* WILL HAVE BEEN SET BY THE CALLER.                                */ 04640000
*/**********************************************                     */ 04641000
*                                                                  1582 04642000
*   QMPOP=WRITE;                    /* FUNCTION = WRITE.             */ 04643000
         L     @12,QMPAPTR                                         1582 04644000
         MVI   QMPOP(@12),X'03'                                    1582 04645000
*   QMPNC=ONEBLOK;                                                 1583 04646000
         NI    QMPNC(@12),B'11110001'                              1583 04647000
         OI    QMPNC(@12),B'00000001'                              1583 04648000
*   QMPACL=EPAPTR;                                                 1584 04649000
         MVC   QMPACL(3,@12),EPAPTR+1                              1584 04650000
*   R1=QMPAPTR;                                                    1585 04651000
         LR    R1,@12                                              1585 04652000
*   GEN(IEFQMREQ);                                                 1586 04653000
         IEFQMREQ                                                       04654000
*   END WRITESWA;                                                  1587 04655000
@EL00022 DS    0H                                                  1587 04656000
@EF00022 DS    0H                                                  1587 04657000
@ER00022 LM    @14,@12,@SA00022                                    1587 04658000
         BR    @14                                                 1587 04659000
*READSWA:                                                          1588 04660000
*   PROC;                                                          1588 04661000
*                                                                  1588 04662000
READSWA  STM   @14,@12,@SA00023                                    1588 04663000
*/***************************************************************    */ 04664000
*/* THIS PROC ISSUES ONE READ (LOCATE MODE) TO THE SWA MANAGER.      */ 04665000
*/* THE EPA WILL HAVE BEEN SET UP BY THE CALLER.                     */ 04666000
*/***************************************************************    */ 04667000
*/* ?SWAREQ (RL) EPA (SWEPAPTR);                                     */ 04668000
*                                                                  1589 04669000
*   CALL SWAMGR(SWEPAPTR,'RL');                                    1589 04670000
         LA    @12,SWEPAPTR                                        1589 04671000
         ST    @12,@AL00001                                        1589 04672000
         LA    @12,@CC04290                                        1589 04673000
         ST    @12,@AL00001+4                                      1589 04674000
         LA    @12,16                                              1589 04675000
         L     @12,CVTPTR(,@12)                                    1589 04676000
         L     @12,CVTJESCT(,@12)                                  1589 04677000
         L     @15,JESWAA(,@12)                                    1589 04678000
         LA    @01,@AL00001                                        1589 04679000
         BALR  @14,@15                                             1589 04680000
*   END READSWA;                                                   1590 04681000
@EL00023 DS    0H                                                  1590 04682000
@EF00023 DS    0H                                                  1590 04683000
@ER00023 LM    @14,@12,@SA00023                                    1590 04684000
         BR    @14                                                 1590 04685000
*READCHEK:                                                         1591 04686000
*   PROC OPTIONS(NOSAVE(IOBUFAD));                                 1591 04687000
*                                                                  1591 04688000
READCHEK STM   @14,@06,@SA00024                                    1591 04689000
         STM   @08,@12,@SA00024+36                                 1591 04690000
*/*************************************************************      */ 04691000
*/* THIS PROC WILL ISSUE THE READ AND CHECK MACROS FOR ONE           */ 04692000
*/*   COMPLETE RECORD  FROM THE CHECKPOINT D.S. OR UPDATE            */ 04693000
*/*   AND SET IOBUFAD AS A POINTER TO THE NEW RECORD                 */ 04694000
*/* WITHIN THE READ BUFFER.                                          */ 04695000
*/*************************************************************      */ 04696000
*                                                                  1592 04697000
*   DO;                             /* MODESET SAVEKEY(SAVEKEYA)   1592 04698000
*                                      KEYADDR(ZEROPTR)              */ 04699000
*     RESPECIFY                                                    1593 04700000
*      (GPR02F) RESTRICTED;                                        1593 04701000
*     IPK;                          /* SAVE CURRENT PSW KEY          */ 04702000
         IPK                                                       1594 04703000
*     SAVEKEYA=GPR02F;                                             1595 04704000
         STC   GPR02F,SAVEKEYA                                     1595 04705000
*     SPKA(ZEROPTR);                /* SET PSW KEY                   */ 04706000
         SLR   @12,@12                                             1596 04707000
         SPKA  0(@12)                                              1596 04708000
*     RESPECIFY                                                    1597 04709000
*      (GPR02F) UNRESTRICTED;                                      1597 04710000
*   END;                            /* MODESET SAVEKEY(SAVEKEYA)   1598 04711000
*                                      KEYADDR(ZEROPTR) KEY = 0      */ 04712000
*   SAVEJSCB=JSCBACT;               /* SAVE OLD ACT          @YM04905*/ 04713000
         L     @12,TCBPTR                                          1599 04714000
         L     @12,TCBJSCB(,@12)                                   1599 04715000
         L     @12,JSCBACT(,@12)                                   1599 04716000
         ST    @12,SAVEJSCB                                        1599 04717000
*   JSCBACT=TCBJSCB;                /* POINT TO INIT         @YM04905*/ 04718000
         L     @12,TCBPTR                                          1600 04719000
         L     @12,TCBJSCB(,@12)                                   1600 04720000
         ST    @12,JSCBACT(,@12)                                   1600 04721000
*   DCBREG=ADDR(DCBCKPT);           /* RE-SET DCB BASE REGISTER      */ 04722000
         LA    DCBREG,DCBCKPT                                      1601 04723000
*   TYPE1PTR=IOBUFAD;               /* SETUP FOR ID CHECK            */ 04724000
         ST    IOBUFAD,TYPE1PTR                                    1602 04725000
*   CHRPTR=IOBUFAD;                 /* SETUP FOR ID CHECK            */ 04726000
         ST    IOBUFAD,CHRPTR                                      1603 04727000
*   IF READCHR^=ON                  /* PROCESS ALL RECORDS EXCEPT CHR*/ 04728000
*       &DSDRIDNT^=IDCIR THEN       /* OR CIRNEXT IND.       @YM04748*/ 04729000
         TM    READCHR,B'10000000'                                 1604 04730000
         BO    @RF01604                                            1604 04731000
         CLC   DSDRIDNT(2,IOBUFAD),@CH02975                        1604 04732000
         BE    @RF01604                                            1604 04733000
*     DO;                                                          1605 04734000
*                                                                  1605 04735000
*       /*************************************************************/ 04736000
*       /*                                                           */ 04737000
*       /* TEST TO SEE WHAT THE PREVIOUS RECORD WAS, AND INCREMENT TO*/ 04738000
*       /* THE NEW RECORD ACCORDINGLY                                */ 04739000
*       /*                                                           */ 04740000
*       /*************************************************************/ 04741000
*                                                                  1606 04742000
*       IF CHRCHKID=JCTCKIDT THEN   /* IF THE OLD RECORD WAS A CHR,  */ 04743000
         L     @12,CHRPTR                                          1606 04744000
         L     @11,JCTPTR                                          1606 04745000
         CLC   CHRCHKID(16,@12),JCTCKIDT(@11)                      1606 04746000
         BNE   @RF01606                                            1606 04747000
*         DO;                       /* A NEW READ IS NECESSARY       */ 04748000
*           GEN;                                                   1608 04749000
    READ CKDECB,SF,(DCBREG),IOBUF,'S','S',,MF=E                         04750000
    CHECK CKDECB                                                        04751000
*           IF SYNFLAG=ON THEN                                     1609 04752000
         TM    SYNFLAG,B'10000000'                                 1609 04753000
         BNO   @RF01609                                            1609 04754000
*             CALL ERR8;                                           1610 04755000
         BAL   @14,ERR8                                            1610 04756000
*           IOBUFAD=ADDR(IOBUF);    /* RESET RECORD ADDRESS POINTER  */ 04757000
@RF01609 LA    IOBUFAD,IOBUF                                       1611 04758000
*         END;                      /* CLOSE READ CHR                */ 04759000
*       ELSE                                                       1613 04760000
*         IF DSDRIDNT=IDTYPE0 THEN  /* OLD RECORD = DDNT?            */ 04761000
         B     @RC01606                                            1613 04762000
@RF01606 CLC   DSDRIDNT(2,IOBUFAD),@CH02945                        1613 04763000
         BNE   @RF01613                                            1613 04764000
*           IOBUFAD=IOBUFAD+LENGTH(IEFADDNT);                      1614 04765000
         AL    IOBUFAD,@CF00663                                    1614 04766000
*         ELSE                                                     1615 04767000
*           IF DSDRIDNT=JFCID THEN  /* OLD RECORD = JFCB(TYPE 1)?    */ 04768000
         B     @RC01613                                            1615 04769000
@RF01613 ICM   @12,3,DSDRIDNT(IOBUFAD)                             1615 04770000
         BNZ   @RF01615                                            1615 04771000
*             IOBUFAD=IOBUFAD+LENGTH(T1DSDR);                      1616 04772000
         AL    IOBUFAD,@CF03958                                    1616 04773000
*           ELSE                                                   1617 04774000
*             IF DSDRIDNT=IDTYPE2 THEN/* OLD RECORD = JFCBX(TYPE2)?  */ 04775000
         B     @RC01615                                            1617 04776000
@RF01615 CLC   DSDRIDNT(2,IOBUFAD),@CH02951                        1617 04777000
         BNE   @RF01617                                            1617 04778000
*               IOBUFAD=IOBUFAD+LENGTH(T2DSDR);                    1618 04779000
         AL    IOBUFAD,@CF03978                                    1618 04780000
*             ELSE                                                 1619 04781000
*               IF DSDRIDNT=GDGNTID THEN/* OLD RECORD = GDGNT(TYPE3)?*/ 04782000
         B     @RC01617                                            1619 04783000
@RF01617 CLC   DSDRIDNT(2,IOBUFAD),@CH02959                        1619 04784000
         BNE   @RF01619                                            1619 04785000
*                 IOBUFAD=IOBUFAD+LENGTH(T3DSDR);                  1620 04786000
         AL    IOBUFAD,@CF03978                                    1620 04787000
*               ELSE                                               1621 04788000
*                 IF DSDRIDNT=SIOID THEN/* OLD RECORD = SIOT(TYPE 4)    04789000
*                                                            @ZA06466*/ 04790000
         B     @RC01619                                            1621 04791000
@RF01619 CLC   DSDRIDNT(2,IOBUFAD),@CH02967                        1621 04792000
         BNE   @RF01621                                            1621 04793000
*                   IOBUFAD=IOBUFAD+LENGTH(T4DSDR);/* BUFFAD + 178 1622 04794000
*                                                            @ZA06466*/ 04795000
         AL    IOBUFAD,@CF03978                                    1622 04796000
*/*  IOBUFAD NOW POINTS TO A NEW RECORD EITHER THROUGH A READ OR     */ 04797000
*/* THROUGH BUMPING THE POINTER WITHIN THE BUFFER.  NOW TEST TO      */ 04798000
*/* INSURE THAT THE RECORD IS VALID.                                 */ 04799000
*                                                                  1623 04800000
*       IF DSDRIDNT=EOBID THEN      /* NEW RECORD IS END OF BLOCK    */ 04801000
@RF01621 DS    0H                                                  1623 04802000
@RC01619 DS    0H                                                  1623 04803000
@RC01617 DS    0H                                                  1623 04804000
@RC01615 DS    0H                                                  1623 04805000
@RC01613 DS    0H                                                  1623 04806000
@RC01606 CLC   DSDRIDNT(2,IOBUFAD),@CH02983                        1623 04807000
         BNE   @RF01623                                            1623 04808000
*         DO;                                                      1624 04809000
*           GEN;                                                   1625 04810000
        READ CKDECB,SF,(DCBREG),IOBUF,'S','S',,MF=E                     04811000
        CHECK CKDECB                                                    04812000
*           IF SYNFLAG=ON THEN                                     1626 04813000
         TM    SYNFLAG,B'10000000'                                 1626 04814000
         BNO   @RF01626                                            1626 04815000
*             CALL ERR8;                                           1627 04816000
         BAL   @14,ERR8                                            1627 04817000
*           IOBUFAD=ADDR(IOBUF);    /* RESET RECORD ADDRESS POINTER  */ 04818000
@RF01626 LA    IOBUFAD,IOBUF                                       1628 04819000
*         END;                                                     1629 04820000
*                                                                  1629 04821000
*/* TEST THE NEW RECORD FOR VALID RECORD TYPE                        */ 04822000
*                                                                  1630 04823000
*       TYPE1PTR=IOBUFAD;           /* RESET DSDR POINTER            */ 04824000
@RF01623 ST    IOBUFAD,TYPE1PTR                                    1630 04825000
*       IF DSDRIDNT^=JFCID&         /* TEST FOR VALID RECORD..JFCB   */ 04826000
*           DSDRIDNT^=SIOID&        /* ...SIOT               @ZA06466*/ 04827000
*           DSDRIDNT^=IDTYPE2&      /* ...JFCBX                      */ 04828000
*           DSDRIDNT^=GDGNTID&      /* ...GDGNT                      */ 04829000
*           DSDRIDNT^=IDTYPE0&      /* ...DDNT                       */ 04830000
*           DSDRIDNT^=IDCIR         /* ...CIR FOR RESTART            */ 04831000
*         THEN                                                     1631 04832000
         ICM   @12,12,DSDRIDNT(IOBUFAD)                            1631 04833000
         SRA   @12,16                                              1631 04834000
         LTR   @12,@12                                             1631 04835000
         BZ    @RF01631                                            1631 04836000
         C     @12,@CF02967                                        1631 04837000
         BE    @RF01631                                            1631 04838000
         C     @12,@CF02951                                        1631 04839000
         BE    @RF01631                                            1631 04840000
         C     @12,@CF02959                                        1631 04841000
         BE    @RF01631                                            1631 04842000
         C     @12,@CF02945                                        1631 04843000
         BE    @RF01631                                            1631 04844000
         C     @12,@CF02975                                        1631 04845000
         BE    @RF01631                                            1631 04846000
*         CALL ERR35;               /* IF NONE OF THE ABOVE PUT OUT     04847000
*                                      ERROR MSG                     */ 04848000
         BAL   @14,ERR35                                           1632 04849000
*     END;                          /* CLOSE MAIN READ               */ 04850000
*   ELSE                                                           1634 04851000
*     DO;                           /* READ THE CHR                  */ 04852000
         B     @RC01604                                            1634 04853000
@RF01604 DS    0H                                                  1635 04854000
*       GEN;                                                       1635 04855000
        READ CKDECB,SF,(DCBREG),IOBUF,'S','S',,MF=E                     04856000
        CHECK CKDECB                                                    04857000
*       IF SYNFLAG=ON THEN                                         1636 04858000
         TM    SYNFLAG,B'10000000'                                 1636 04859000
         BNO   @RF01636                                            1636 04860000
*         CALL ERR8;                                               1637 04861000
         BAL   @14,ERR8                                            1637 04862000
*       IOBUFAD=ADDR(IOBUF);        /* RESET RECORD ADDRESS POINTER  */ 04863000
@RF01636 LA    IOBUFAD,IOBUF                                       1638 04864000
*     END;                                                         1639 04865000
*   JSCBACT=SAVEJSCB;               /* RESTORE ACTIVE        @YM04905*/ 04866000
@RC01604 L     @12,TCBPTR                                          1640 04867000
         L     @12,TCBJSCB(,@12)                                   1640 04868000
         L     @11,SAVEJSCB                                        1640 04869000
         ST    @11,JSCBACT(,@12)                                   1640 04870000
*   DO;                             /* MODESET KEYADDR(SAVEKEYA)     */ 04871000
*     SPKA(SAVEKEYA);               /* SET PSW KEY                   */ 04872000
         SLR   @12,@12                                             1642 04873000
         IC    @12,SAVEKEYA                                        1642 04874000
         SPKA  0(@12)                                              1642 04875000
*   END;                            /* MODESET KEYADDR(SAVEKEYA) KEY    04876000
*                                      BACK TO SCHED                 */ 04877000
*   END READCHEK;                                                  1644 04878000
@EL00024 DS    0H                                                  1644 04879000
@EF00024 DS    0H                                                  1644 04880000
@ER00024 LM    @14,@06,@SA00024                                    1644 04881000
         LM    @08,@12,@SA00024+36                                 1644 04882000
         BR    @14                                                 1644 04883000
*ERRPROC:                                                          1645 04884000
*   PROC OPTIONS(NOSAVEAREA);                                      1645 04885000
ERRPROC  STM   @14,@12,12(@13)                                     1645 04886000
*   DCL                                                            1646 04887000
*     THIRTYX CHAR(3) DEF(MSGAREA) POS(50);                        1646 04888000
*   DCL                                                            1647 04889000
*     THIRTY0 CHAR(3) CONSTANT('230');                             1647 04890000
*   DCL                                                            1648 04891000
*     THIRTY1 CHAR(3) CONSTANT('231');                             1648 04892000
*   DCL                                                            1649 04893000
*     THIRTY2 CHAR(3) CONSTANT('232');                             1649 04894000
*   DCL                                                            1650 04895000
*     THIRTY3 CHAR(3) CONSTANT('233');                             1650 04896000
*   DCL                                                            1651 04897000
*     THIRTY4 CHAR(3) CONSTANT('034');                             1651 04898000
*   DCL                                                            1652 04899000
*     THIRTY5 CHAR(3) CONSTANT('235');                             1652 04900000
*   DCL                                                            1653 04901000
*     THIRTY6 CHAR(3) CONSTANT('236');                             1653 04902000
*   DCL                                                            1654 04903000
*     THIRTY7 CHAR(3) CONSTANT('237');                             1654 04904000
*   DCL                                                            1655 04905000
*     THIRTY8 CHAR(3) CONSTANT('038');                             1655 04906000
*   DCL                                                            1656 04907000
*     TWO38 CHAR(3) CONSTANT('238');                               1656 04908000
*   DCL                                                            1657 04909000
*     THIRTY9 CHAR(3) CONSTANT('239');                             1657 04910000
*   DCL                                                            1658 04911000
*     JOBERRN CHAR(8) DEF(MSGAREA) POS(40);                        1658 04912000
*                                                                  1658 04913000
*/********* FOLLOWING DECLARES ARE FOR BUILDING IEF209I ********     */ 04914000
*                                                                  1659 04915000
*   DCL                                                            1659 04916000
*     ORIGDC FIXED(16) DEFINED(MSGAREA) POS(47) BDY(BYTE);         1659 04917000
*   DCL                                                            1660 04918000
*     ORIGRC FIXED(16) DEFINED(MSGAREA) POS(49) BDY(BYTE);         1660 04919000
*   DCL                                                            1661 04920000
*     I209JOB CHAR(8) DEFINED(MSGAREA) POS(46);                    1661 04921000
*   DCL                                                            1662 04922000
*     I209STEP CHAR(8) DEFINED(MSGAREA) POS(55);                   1662 04923000
*   DCL                                                            1663 04924000
*     I209PROC CHAR(8) DEFINED(MSGAREA) POS(64);                   1663 04925000
*   DCL                                                            1664 04926000
*     DOT1 CHAR(1) DEFINED(MSGAREA) POS(54);                       1664 04927000
*   DCL                                                            1665 04928000
*     DOT2 CHAR(1) DEFINED(MSGAREA) POS(63);                       1665 04929000
*   DCL                                                            1666 04930000
*     SHORTDC FIXED(16) DEFINED(MSGAREA) POS(63) BDY(BYTE);        1666 04931000
*   DCL                                                            1667 04932000
*     SHORTRC FIXED(16) DEFINED(MSGAREA) POS(65) BDY(BYTE);        1667 04933000
*   DCL                                                            1668 04934000
*     LONGDC FIXED(16) DEFINED(MSGAREA) POS(72) BDY(BYTE);         1668 04935000
*   DCL                                                            1669 04936000
*     LONGRC FIXED(16) DEFINED(MSGAREA) POS(74) BDY(BYTE);         1669 04937000
*   DCL                                                            1670 04938000
*     WTOLEN FIXED(16) DEFINED(MSGAREA) POS(1);                    1670 04939000
*   DCL                                                            1671 04940000
*     SHORTLEN FIXED(16) CONSTANT(62);                             1671 04941000
*   DCL                                                            1672 04942000
*     LONGLEN FIXED(16) CONSTANT(71);                              1672 04943000
*   DCL                                                            1673 04944000
*     DOT CHAR(1) CONSTANT('.');                                   1673 04945000
*   DCL                                                            1674 04946000
*     HOLDDC FIXED(16);                                            1674 04947000
*   DCL                                                            1675 04948000
*     HOLDRC FIXED(16);                                            1675 04949000
*   RESPECIFY                                                      1676 04950000
*     R2 RESTRICTED;                                               1676 04951000
*SCRTYERR:                                                         1677 04952000
*   R2=ADDR603;                     /* PICK UP MSG MODULE ADDRESS    */ 04953000
SCRTYERR L     R2,ADDR603                                          1677 04954000
*   R2=R2+24;                       /* INDEX PAST MODULE HEADER      */ 04955000
         AL    R2,@CF00238                                         1678 04956000
*   DO WHILE ID^=M7;                /* SEARCH FOR IHJ0007I IDENT.    */ 04957000
         B     @DE01679                                            1679 04958000
@DL01679 DS    0H                                                  1680 04959000
*     R2=R2+ENTLEN;                 /* BUMP BY LENGTH OF ENTRY       */ 04960000
         AL    R2,@CF03780                                         1680 04961000
*   END;                                                           1681 04962000
@DE01679 CLC   ID(4,R2),@CC04061                                   1681 04963000
         BNE   @DL01679                                            1681 04964000
*   MSGAREA(ONEHEX:MSGLEN)=MSGTEXT(ONEHEX:MSGLEN);                 1682 04965000
         SLR   @12,@12                                             1682 04966000
         IC    @12,MSGLEN(,R2)                                     1682 04967000
         BCTR  @12,0                                               1682 04968000
         L     @11,MSGADD-1(,R2)                                   1682 04969000
         EX    @12,@SM04574                                        1682 04970000
*   THIRTYX=THIRTY0;                /* INSERT PROPER IDENTIFIER      */ 04971000
         MVC   THIRTYX(3),@CC04302                                 1683 04972000
*   JOBERRN=JCTJNAME;               /* INSERT JOBNAME IN MESSAGE     */ 04973000
         L     @12,JCTPTR                                          1684 04974000
         MVC   JOBERRN(8),JCTJNAME(@12)                            1684 04975000
*   CALL MSGPROC;                   /* PUT OUT THE MESSAGE           */ 04976000
         BAL   @14,MSGPROC                                         1685 04977000
*   CALL CANPROC;                   /* RETURN TO INITIATOR RC=12     */ 04978000
         BAL   @14,CANPROC                                         1686 04979000
*DYNERROR:                                                         1687 04980000
*   R2=ADDR603;                     /* PICK UP MSG MODULE ADDRESS    */ 04981000
DYNERROR L     R2,ADDR603                                          1687 04982000
*   R2=R2+24;                       /* INDEX PAST MODULE HEADER      */ 04983000
         AL    R2,@CF00238                                         1688 04984000
*   DO WHILE ID^=M7;                /* SEARCH FOR IHJ0007I IDENT.    */ 04985000
         B     @DE01689                                            1689 04986000
@DL01689 DS    0H                                                  1690 04987000
*     R2=R2+ENTLEN;                 /* BUMP BY LENGTH OF ENTRY       */ 04988000
         AL    R2,@CF03780                                         1690 04989000
*   END;                                                           1691 04990000
@DE01689 CLC   ID(4,R2),@CC04061                                   1691 04991000
         BNE   @DL01689                                            1691 04992000
*   MSGAREA(ONEHEX:MSGLEN)=MSGTEXT(ONEHEX:MSGLEN);                 1692 04993000
         SLR   @12,@12                                             1692 04994000
         IC    @12,MSGLEN(,R2)                                     1692 04995000
         BCTR  @12,0                                               1692 04996000
         L     @11,MSGADD-1(,R2)                                   1692 04997000
         EX    @12,@SM04574                                        1692 04998000
*   THIRTYX=THIRTY1;                /* INSERT PROPER IDENTIFIER      */ 04999000
         MVC   THIRTYX(3),@CC04304                                 1693 05000000
*   JOBERRN=JCTJNAME;               /* INSERT JOBNAME IN MESSAGE     */ 05001000
         L     @12,JCTPTR                                          1694 05002000
         MVC   JOBERRN(8),JCTJNAME(@12)                            1694 05003000
*   CALL MSGPROC;                   /* PUT OUT THE MESSAGE           */ 05004000
         BAL   @14,MSGPROC                                         1695 05005000
*   CALL CANPROC;                   /* RETURN TO INITIATOR RC=12     */ 05006000
         BAL   @14,CANPROC                                         1696 05007000
*ERR32:                                                            1697 05008000
*   R2=ADDR603;                     /* PICK UP MSG MODULE ADDRESS    */ 05009000
ERR32    L     R2,ADDR603                                          1697 05010000
*   R2=R2+24;                       /* INDEX PAST MODULE HEADER      */ 05011000
         AL    R2,@CF00238                                         1698 05012000
*   DO WHILE ID^=M7;                /* SEARCH FOR IHJ0007I IDENT.    */ 05013000
         B     @DE01699                                            1699 05014000
@DL01699 DS    0H                                                  1700 05015000
*     R2=R2+ENTLEN;                 /* BUMP BY LENGTH OF ENTRY       */ 05016000
         AL    R2,@CF03780                                         1700 05017000
*   END;                                                           1701 05018000
@DE01699 CLC   ID(4,R2),@CC04061                                   1701 05019000
         BNE   @DL01699                                            1701 05020000
*   MSGAREA(ONEHEX:MSGLEN)=MSGTEXT(ONEHEX:MSGLEN);                 1702 05021000
         SLR   @12,@12                                             1702 05022000
         IC    @12,MSGLEN(,R2)                                     1702 05023000
         BCTR  @12,0                                               1702 05024000
         L     @11,MSGADD-1(,R2)                                   1702 05025000
         EX    @12,@SM04574                                        1702 05026000
*   THIRTYX=THIRTY2;                /* INSERT PROPER IDENTIFIER      */ 05027000
         MVC   THIRTYX(3),@CC04306                                 1703 05028000
*   JOBERRN=JCTJNAME;               /* INSERT JOBNAME INTO MESSAGE   */ 05029000
         L     @12,JCTPTR                                          1704 05030000
         MVC   JOBERRN(8),JCTJNAME(@12)                            1704 05031000
*   CALL MSGPROC;                   /* PUT OUT THE MESSAGE           */ 05032000
         BAL   @14,MSGPROC                                         1705 05033000
*   CALL CANPROC;                   /* RETURN TO INITIATOR RC=12     */ 05034000
         BAL   @14,CANPROC                                         1706 05035000
*ERR33:                                                            1707 05036000
*   R2=ADDR603;                     /* PICK UP MSG MODULE ADDRESS    */ 05037000
ERR33    L     R2,ADDR603                                          1707 05038000
*   R2=R2+24;                       /* INDEX PAST MODULE HEADER      */ 05039000
         AL    R2,@CF00238                                         1708 05040000
*   DO WHILE ID^=M7;                /* SEARCH FOR IHJ0007I IDENT.    */ 05041000
         B     @DE01709                                            1709 05042000
@DL01709 DS    0H                                                  1710 05043000
*     R2=R2+ENTLEN;                 /* BUMP BY LENGTH OF ENTRY       */ 05044000
         AL    R2,@CF03780                                         1710 05045000
*   END;                                                           1711 05046000
@DE01709 CLC   ID(4,R2),@CC04061                                   1711 05047000
         BNE   @DL01709                                            1711 05048000
*   MSGAREA(ONEHEX:MSGLEN)=MSGTEXT(ONEHEX:MSGLEN);                 1712 05049000
         SLR   @12,@12                                             1712 05050000
         IC    @12,MSGLEN(,R2)                                     1712 05051000
         BCTR  @12,0                                               1712 05052000
         L     @11,MSGADD-1(,R2)                                   1712 05053000
         EX    @12,@SM04574                                        1712 05054000
*   THIRTYX=THIRTY3;                /* INSERT PROPER IDENTIFIER      */ 05055000
         MVC   THIRTYX(3),@CC04308                                 1713 05056000
*   JOBERRN=JCTJNAME;               /* INSERT JOBNAME INTO MESSAGE   */ 05057000
         L     @12,JCTPTR                                          1714 05058000
         MVC   JOBERRN(8),JCTJNAME(@12)                            1714 05059000
*   CALL MSGPROC;                   /* PUT OUT THE MESSAGE           */ 05060000
         BAL   @14,MSGPROC                                         1715 05061000
*   CALL CANPROC;                   /* RETURN TO INITIATOR RC=12     */ 05062000
         BAL   @14,CANPROC                                         1716 05063000
*ERR37:                                                            1717 05064000
*   R2=ADDR603;                     /* PICK UP MSG MODULE ADDRESS    */ 05065000
ERR37    L     R2,ADDR603                                          1717 05066000
*   R2=R2+24;                       /* INDEX PAST MODULE HEADER      */ 05067000
         AL    R2,@CF00238                                         1718 05068000
*   DO WHILE ID^=M7;                /* SEARCH FOR IHJ0007I IDENT.    */ 05069000
         B     @DE01719                                            1719 05070000
@DL01719 DS    0H                                                  1720 05071000
*     R2=R2+ENTLEN;                 /* BUMP BY LENGTH OF ENTRY       */ 05072000
         AL    R2,@CF03780                                         1720 05073000
*   END;                                                           1721 05074000
@DE01719 CLC   ID(4,R2),@CC04061                                   1721 05075000
         BNE   @DL01719                                            1721 05076000
*   MSGAREA(ONEHEX:MSGLEN)=MSGTEXT(ONEHEX:MSGLEN);                 1722 05077000
         SLR   @12,@12                                             1722 05078000
         IC    @12,MSGLEN(,R2)                                     1722 05079000
         BCTR  @12,0                                               1722 05080000
         L     @11,MSGADD-1(,R2)                                   1722 05081000
         EX    @12,@SM04574                                        1722 05082000
*   THIRTYX=THIRTY4;                /* INSERT PROPER IDENTIFIER      */ 05083000
         MVC   THIRTYX(3),@CC04310                                 1723 05084000
*   JOBERRN=JCTJNAME;               /* INSERT JOBNAME INTO JOBNAME   */ 05085000
         L     @12,JCTPTR                                          1724 05086000
         MVC   JOBERRN(8),JCTJNAME(@12)                            1724 05087000
*   CALL MSGPROC;                   /* PUT OUT THE MESSAGE           */ 05088000
         BAL   @14,MSGPROC                                         1725 05089000
*   CALL CANPROC;                   /* RETURN TO INITIATOR RC=12     */ 05090000
         BAL   @14,CANPROC                                         1726 05091000
*ERR35:                                                            1727 05092000
*   R2=ADDR603;                     /* PICK UP MSG MODULE ADDRESS    */ 05093000
ERR35    L     R2,ADDR603                                          1727 05094000
*   R2=R2+24;                       /* INDEX PAST MODULE HEADER      */ 05095000
         AL    R2,@CF00238                                         1728 05096000
*   DO WHILE ID^=M7;                /* SEARCH FOR IHJ0007I IDENT.    */ 05097000
         B     @DE01729                                            1729 05098000
@DL01729 DS    0H                                                  1730 05099000
*     R2=R2+ENTLEN;                 /* BUMP BY LENGTH OF ENTRY       */ 05100000
         AL    R2,@CF03780                                         1730 05101000
*   END;                                                           1731 05102000
@DE01729 CLC   ID(4,R2),@CC04061                                   1731 05103000
         BNE   @DL01729                                            1731 05104000
*   MSGAREA(ONEHEX:MSGLEN)=MSGTEXT(ONEHEX:MSGLEN);                 1732 05105000
         SLR   @12,@12                                             1732 05106000
         IC    @12,MSGLEN(,R2)                                     1732 05107000
         BCTR  @12,0                                               1732 05108000
         L     @11,MSGADD-1(,R2)                                   1732 05109000
         EX    @12,@SM04574                                        1732 05110000
*   THIRTYX=THIRTY5;                /* INSERT PROPER IDENTIFIER      */ 05111000
         MVC   THIRTYX(3),@CC04312                                 1733 05112000
*   JOBERRN=JCTJNAME;               /* INSERT JOBNAME INTO JOBNAME   */ 05113000
         L     @12,JCTPTR                                          1734 05114000
         MVC   JOBERRN(8),JCTJNAME(@12)                            1734 05115000
*   CALL MSGPROC;                   /* PUT OUT THE MESSAGE           */ 05116000
         BAL   @14,MSGPROC                                         1735 05117000
*   CALL CANPROC;                   /* RETURN TO INITIATOR RC=12     */ 05118000
         BAL   @14,CANPROC                                         1736 05119000
*ERROR7:                                                           1737 05120000
*   R2=ADDR603;                     /* PICK UP MSG MODULE ADDRESS    */ 05121000
ERROR7   L     R2,ADDR603                                          1737 05122000
*   R2=R2+24;                       /* INDEX PAST MODULE HEADER      */ 05123000
         AL    R2,@CF00238                                         1738 05124000
*   DO WHILE ID^=M7;                /* SEARCH FOR IHJ0007I IDENT.    */ 05125000
         B     @DE01739                                            1739 05126000
@DL01739 DS    0H                                                  1740 05127000
*     R2=R2+ENTLEN;                 /* BUMP BY LENGTH OF ENTRY       */ 05128000
         AL    R2,@CF03780                                         1740 05129000
*   END;                                                           1741 05130000
@DE01739 CLC   ID(4,R2),@CC04061                                   1741 05131000
         BNE   @DL01739                                            1741 05132000
*   MSGAREA(ONEHEX:MSGLEN)=MSGTEXT(ONEHEX:MSGLEN);                 1742 05133000
         SLR   @12,@12                                             1742 05134000
         IC    @12,MSGLEN(,R2)                                     1742 05135000
         BCTR  @12,0                                               1742 05136000
         L     @11,MSGADD-1(,R2)                                   1742 05137000
         EX    @12,@SM04574                                        1742 05138000
*   THIRTYX=THIRTY7;                /* INSERT PROPER IDENTIFIER      */ 05139000
         MVC   THIRTYX(3),@CC04316                                 1743 05140000
*   JOBERRN=JCTJNAME;               /* INSERT JOBNAME INTO MESSAGE   */ 05141000
         L     @12,JCTPTR                                          1744 05142000
         MVC   JOBERRN(8),JCTJNAME(@12)                            1744 05143000
*   CALL MSGPROC;                   /* PUT OUT THE MESSAGE           */ 05144000
         BAL   @14,MSGPROC                                         1745 05145000
*   CALL CANPROC;                   /* RETURN TO INITIATOR RC=12     */ 05146000
         BAL   @14,CANPROC                                         1746 05147000
*ERR8:                                                             1747 05148000
*   R2=ADDR603;                     /* PICK UP MSG MODULE ADDRESS    */ 05149000
ERR8     L     R2,ADDR603                                          1747 05150000
*   R2=R2+24;                       /* INDEX PAST MODULE HEADER      */ 05151000
         AL    R2,@CF00238                                         1748 05152000
*   DO WHILE ID^=M7;                /* SEARCH FOR IHJ0007I IDENT.    */ 05153000
         B     @DE01749                                            1749 05154000
@DL01749 DS    0H                                                  1750 05155000
*     R2=R2+ENTLEN;                 /* BUMP BY LENGTH OF ENTRY       */ 05156000
         AL    R2,@CF03780                                         1750 05157000
*   END;                                                           1751 05158000
@DE01749 CLC   ID(4,R2),@CC04061                                   1751 05159000
         BNE   @DL01749                                            1751 05160000
*   MSGAREA(ONEHEX:MSGLEN)=MSGTEXT(ONEHEX:MSGLEN);                 1752 05161000
         SLR   @12,@12                                             1752 05162000
         IC    @12,MSGLEN(,R2)                                     1752 05163000
         BCTR  @12,0                                               1752 05164000
         L     @11,MSGADD-1(,R2)                                   1752 05165000
         EX    @12,@SM04574                                        1752 05166000
*   THIRTYX=THIRTY8;                /* INSERT PROPER IDENTIFIER      */ 05167000
         MVC   THIRTYX(3),@CC04318                                 1753 05168000
*   JOBERRN=JCTJNAME;               /* INSERT JOBNAME INTO MESSAGE   */ 05169000
         L     @12,JCTPTR                                          1754 05170000
         MVC   JOBERRN(8),JCTJNAME(@12)                            1754 05171000
*   CALL MSGPROC;                   /* PUT OUT THE MESSAGE           */ 05172000
         BAL   @14,MSGPROC                                         1755 05173000
*   CALL CANPROC;                   /* RETURN TO INITIATOR RC=12     */ 05174000
         BAL   @14,CANPROC                                         1756 05175000
*ERROR238:                                                         1757 05176000
*   R2=ADDR603;                     /* PICK UP MSG MODULE ADDRESS    */ 05177000
ERROR238 L     R2,ADDR603                                          1757 05178000
*   R2=R2+24;                       /* INDEX PAST MODULE HEADER      */ 05179000
         AL    R2,@CF00238                                         1758 05180000
*   DO WHILE ID^=M7;                /* SEARCH FOR IHJ0007I IDENT.    */ 05181000
         B     @DE01759                                            1759 05182000
@DL01759 DS    0H                                                  1760 05183000
*     R2=R2+ENTLEN;                 /* BUMP BY LENGTH OF ENTRY       */ 05184000
         AL    R2,@CF03780                                         1760 05185000
*   END;                                                           1761 05186000
@DE01759 CLC   ID(4,R2),@CC04061                                   1761 05187000
         BNE   @DL01759                                            1761 05188000
*   MSGAREA(ONEHEX:MSGLEN)=MSGTEXT(ONEHEX:MSGLEN);                 1762 05189000
         SLR   @12,@12                                             1762 05190000
         IC    @12,MSGLEN(,R2)                                     1762 05191000
         BCTR  @12,0                                               1762 05192000
         L     @11,MSGADD-1(,R2)                                   1762 05193000
         EX    @12,@SM04574                                        1762 05194000
*   THIRTYX=TWO38;                  /* INSERT PROPER IDENTIFIER      */ 05195000
         MVC   THIRTYX(3),@CC04320                                 1763 05196000
*   JOBERRN=JCTJNAME;               /* INSERT JOBNAME INTO MESSAGE   */ 05197000
         L     @12,JCTPTR                                          1764 05198000
         MVC   JOBERRN(8),JCTJNAME(@12)                            1764 05199000
*   CALL MSGPROC;                   /* PUT OUT THE MESSAGE           */ 05200000
         BAL   @14,MSGPROC                                         1765 05201000
*   CALL CANPROC;                   /* RETURN TO INITIATOR RC=12     */ 05202000
         BAL   @14,CANPROC                                         1766 05203000
*VAMERR:                                                           1767 05204000
*   R2=ADDR603;                     /* PICK UP MSG MODULE ADDRESS    */ 05205000
VAMERR   L     R2,ADDR603                                          1767 05206000
*   R2=R2+24;                       /* INDEX PAST MODULE HEADER      */ 05207000
         AL    R2,@CF00238                                         1768 05208000
*   DO WHILE ID^=M7;                /* SEARCH FOR IHJ0007I IDENT.    */ 05209000
         B     @DE01769                                            1769 05210000
@DL01769 DS    0H                                                  1770 05211000
*     R2=R2+ENTLEN;                 /* BUMP BY LENGTH OF ENTRY       */ 05212000
         AL    R2,@CF03780                                         1770 05213000
*   END;                                                           1771 05214000
@DE01769 CLC   ID(4,R2),@CC04061                                   1771 05215000
         BNE   @DL01769                                            1771 05216000
*   MSGAREA(ONEHEX:MSGLEN)=MSGTEXT(ONEHEX:MSGLEN);                 1772 05217000
         SLR   @12,@12                                             1772 05218000
         IC    @12,MSGLEN(,R2)                                     1772 05219000
         BCTR  @12,0                                               1772 05220000
         L     @11,MSGADD-1(,R2)                                   1772 05221000
         EX    @12,@SM04574                                        1772 05222000
*   THIRTYX=THIRTY9;                /* INSERT PROPER IDENTIFIER      */ 05223000
         MVC   THIRTYX(3),@CC04322                                 1773 05224000
*   JOBERRN=JCTJNAME;               /* INSERT JOBNAME INTO MESSGAE   */ 05225000
         L     @12,JCTPTR                                          1774 05226000
         MVC   JOBERRN(8),JCTJNAME(@12)                            1774 05227000
*   CALL MSGPROC;                   /* PUT OUT THE MESSAGE           */ 05228000
         BAL   @14,MSGPROC                                         1775 05229000
*   CALL CANPROC;                   /* RETURN TO INITIATOR RC=12     */ 05230000
         BAL   @14,CANPROC                                         1776 05231000
*ADDRERR:                                                          1777 05232000
*   ;                                                              1777 05233000
ADDRERR  DS    0H                                                  1778 05234000
*   R2=ADDR603;                     /* PICK UP MSG MODULE ADDRESS    */ 05235000
         L     R2,ADDR603                                          1778 05236000
*   R2=R2+24;                       /* INDEX PAST MODULE HEADER      */ 05237000
         AL    R2,@CF00238                                         1779 05238000
*   DO WHILE ID^=M8;                /* SEARCH FOR IHJ0007I IDENT.    */ 05239000
         B     @DE01780                                            1780 05240000
@DL01780 DS    0H                                                  1781 05241000
*     R2=R2+ENTLEN;                 /* BUMP BY LENGTH OF ENTRY       */ 05242000
         AL    R2,@CF03780                                         1781 05243000
*   END;                                                           1782 05244000
@DE01780 CLC   ID(4,R2),@CC04063                                   1782 05245000
         BNE   @DL01780                                            1782 05246000
*   MSGAREA(ONEHEX:MSGLEN)=MSGTEXT(ONEHEX:MSGLEN);                 1783 05247000
         SLR   @12,@12                                             1783 05248000
         IC    @12,MSGLEN(,R2)                                     1783 05249000
         BCTR  @12,0                                               1783 05250000
         L     @11,MSGADD-1(,R2)                                   1783 05251000
         EX    @12,@SM04574                                        1783 05252000
*   HOLDDC=ORIGDC;                  /* RETAIN THE ORIGINAL DESC CODE */ 05253000
         LH    @12,ORIGDC                                          1784 05254000
         N     @12,@CF04576                                        1784 05255000
         STH   @12,HOLDDC                                          1784 05256000
*   HOLDRC=ORIGRC;                  /* RETAIN THE ORIGINAL ROUT CODE */ 05257000
         LH    @12,ORIGRC                                          1785 05258000
         N     @12,@CF04576                                        1785 05259000
         STH   @12,HOLDRC                                          1785 05260000
*   I209JOB=JCTJNAME;               /* INSERT JOBNAME IN MESSAGE     */ 05261000
         L     @12,JCTPTR                                          1786 05262000
         MVC   I209JOB(8),JCTJNAME(@12)                            1786 05263000
*   DOT1=DOT;                       /* INSERT DOT                    */ 05264000
         MVI   DOT1,C'.'                                           1787 05265000
*   I209STEP=SCTSNAME;              /* INSERT STEPNAME IN MESSAGE    */ 05266000
         L     @12,SCTPTR                                          1788 05267000
         MVC   I209STEP(8),SCTSNAME(@12)                           1788 05268000
*   IF SCTSCLPC^=BLANKS THEN        /* INSERT PROCNAME IF THERE IS 1789 05269000
*                                      ONE                           */ 05270000
         CLC   SCTSCLPC(8,@12),@CC03776                            1789 05271000
         BE    @RF01789                                            1789 05272000
*     DO;                                                          1790 05273000
*       DOT2=DOT;                   /* INSERT DOT                    */ 05274000
         MVI   DOT2,C'.'                                           1791 05275000
*       I209PROC=SCTSCLPC;          /* INSERT PROCNAME IN MESSAGE    */ 05276000
         MVC   I209PROC(8),SCTSCLPC(@12)                           1792 05277000
*       WTOLEN=LONGLEN;             /* ADJUST MSG LENGTH FOR PROCNAME*/ 05278000
         MVC   WTOLEN(2),@CH04345                                  1793 05279000
*       LONGDC=HOLDDC;              /* PUT DESC CODE IN PLACEIN    1794 05280000
*                                      WTOLST                        */ 05281000
         MVC   LONGDC(2),HOLDDC                                    1794 05282000
*       LONGRC=HOLDRC;              /* PUT ROUT CODE IN PLACE        */ 05283000
         MVC   LONGRC(2),HOLDRC                                    1795 05284000
*     END;                                                         1796 05285000
*   ELSE                                                           1797 05286000
*     DO;                           /* IF NO PROCNAME, THE MESSAGE IS   05287000
*                                      SHORTER.                      */ 05288000
         B     @RC01789                                            1797 05289000
@RF01789 DS    0H                                                  1798 05290000
*       WTOLEN=SHORTLEN;            /* ADJUST MSG LEN FOR NO PROCNAME*/ 05291000
         MVC   WTOLEN(2),@CH04188                                  1798 05292000
*       SHORTDC=HOLDDC;             /* INSERT DESC CODE IN SHORT MSG */ 05293000
         LH    @12,HOLDDC                                          1799 05294000
         N     @12,@CF04576                                        1799 05295000
         STH   @12,SHORTDC                                         1799 05296000
*       SHORTRC=HOLDRC;             /* INSERT ROUT CODE IN SHORT MSG */ 05297000
         LH    @12,HOLDRC                                          1800 05298000
         N     @12,@CF04576                                        1800 05299000
         STH   @12,SHORTRC                                         1800 05300000
*     END;                                                         1801 05301000
*   CALL MSGPROC;                   /* PUT OUT THE MESSAGE           */ 05302000
@RC01789 BAL   @14,MSGPROC                                         1802 05303000
*   CALL CANPROC;                   /* RETURN TO INITIATOR RC=12     */ 05304000
         BAL   @14,CANPROC                                         1803 05305000
*   RESPECIFY                                                      1804 05306000
*     R2 UNRESTRICTED;                                             1804 05307000
*   END ERRPROC;                                                   1805 05308000
@EL00025 DS    0H                                                  1805 05309000
@EF00025 DS    0H                                                  1805 05310000
@ER00025 LM    @14,@12,12(@13)                                     1805 05311000
         BR    @14                                                 1805 05312000
*NOMATCH:                                                          1806 05313000
*   PROC;                                                          1806 05314000
*                                                                  1806 05315000
NOMATCH  STM   @14,@12,@SA00026                                    1806 05316000
*/**************************************************************     */ 05317000
*/*  THE PURPOSE OF THIS PROC IS : 1) TO BUILD A SIOT/JFCB PAIR      */ 05318000
*/*     FOR A DYN ALLOCED DATA SET.                     2) TO        */ 05319000
*/* INVOKE THE ERROR PROC IF IT HAS BEEN FOUND THAT A DD ENTRY       */ 05320000
*/* WAS MISSING FROM THE JCL SUBMITTED FOR THE RESTART.              */ 05321000
*/**************************************************************     */ 05322000
*                                                                  1807 05323000
*   DCL                                                            1807 05324000
*     UNITS FIXED(8) DEFINED(SCTNMBUT) BDY(BYTE);/* NUMERIC UNIT CT  */ 05325000
*   DCL                                                            1808 05326000
*     CCATEND BIT(1);                                              1808 05327000
*   IF BUILDSW=ON THEN              /* SIOTSCAN DETERMINED THAT SIOT    05328000
*                                      WAS NEEDED BECAUSE OF A     1809 05329000
*                                      DYNALLOC AT DEFERRED RESTART  */ 05330000
         TM    BUILDSW,B'10000000'                                 1809 05331000
         BNO   @RF01809                                            1809 05332000
*     DO;                                                          1810 05333000
*       DJFCBPTR=ADDR(DSDRJFCB);    /* INSURE ADDR'ABILITY DSDRJFCB  */ 05334000
         LA    @12,DSDRJFCB(,IOBUFAD)                              1811 05335000
         ST    @12,DJFCBPTR                                        1811 05336000
*       IF DJFCBPTR->JFCVRDS=ON THEN/* IF DATA SET IS VAM....        */ 05337000
         L     @12,DJFCBPTR                                        1812 05338000
         TM    JFCVRDS(@12),B'00000100'                            1812 05339000
         BNO   @RF01812                                            1812 05340000
*         CALL VAMERR;              /* THE UCBADD CANNOT BE RECOVERED   05341000
*                                                            @YM08170*/ 05342000
         BAL   @14,VAMERR                                          1813 05343000
*       CALL ASGNPROC;              /* GET A NEW BLOCK ASSIGNED      */ 05344000
@RF01812 BAL   @14,ASGNPROC                                        1814 05345000
*       NEWPTR=ASGNADD+REALADD;     /* SWA ADDRESSABILITY NEW SIOT   */ 05346000
         L     @12,ASGNADD-1                                       1815 05347000
         LA    @12,0(,@12)                                         1815 05348000
         L     @11,REALADD-1                                       1815 05349000
         LA    @11,0(,@11)                                         1815 05350000
         ALR   @11,@12                                             1815 05351000
         STCM  @11,7,NEWPTR                                        1815 05352000
*       IF PROCSIOT=ZEROPTR THEN    /* THE ADDED SIOT MAY NEED TO BE    05353000
*                                      ADDED AS FIRST SIOT           */ 05354000
         L     @09,PROCSIOT                                        1816 05355000
         LTR   @09,@09                                             1816 05356000
         BNZ   @RF01816                                            1816 05357000
*         DO;                                                      1817 05358000
*           NEWPTR->SCTPSIOT=SCTFSIOT;/* MAKE THE OLD FIRST THE NEW     05359000
*                                      FIRST'S NEXT.                 */ 05360000
         L     @09,SCTPTR                                          1818 05361000
         MVC   SCTPSIOT(3,@11),SCTFSIOT(@09)                       1818 05362000
*           SCTFSIOT=ASGNADD;       /* PLUG IN NEW AS FIRST          */ 05363000
         STCM  @12,7,SCTFSIOT(@09)                                 1819 05364000
*           IF SCTLSIOT=ZEROPTR THEN/* FOR ONLY DD SET               */ 05365000
         ICM   @12,7,SCTLSIOT(@09)                                 1820 05366000
         BNZ   @RF01820                                            1820 05367000
*             SCTLSIOT=SCTFSIOT;    /* FIRST AND LAST =              */ 05368000
         MVC   SCTLSIOT(3,@09),SCTFSIOT(@09)                       1821 05369000
*         END;                                                     1822 05370000
*       ELSE                                                       1823 05371000
*         DO;                       /* THIS IS NOT THE FIRST.        */ 05372000
         B     @RC01816                                            1823 05373000
@RF01816 DS    0H                                                  1824 05374000
*           IF PROCSIOT=SCTLSIOT THEN/* IS IT THE LAST?              */ 05375000
         L     @12,PROCSIOT                                        1824 05376000
         L     @11,SCTPTR                                          1824 05377000
         SLR   @09,@09                                             1824 05378000
         ICM   @09,7,SCTLSIOT(@11)                                 1824 05379000
         CR    @12,@09                                             1824 05380000
         BNE   @RF01824                                            1824 05381000
*             DO;                                                  1825 05382000
*               EVAL(PROCSIOT+REALADD)->SCTPSIOT=ASGNADD;/* MAKE THE    05383000
*                                      OLD LAST POINT TO THE NEW   1826 05384000
*                                      LAST.                         */ 05385000
         L     @09,REALADD-1                                       1826 05386000
         LA    @09,0(,@09)                                         1826 05387000
         ALR   @12,@09                                             1826 05388000
         MVC   SCTPSIOT(3,@12),ASGNADD                             1826 05389000
*               SCTLSIOT=ASGNADD;   /* SET 'LAST' PTR IN SCT.        */ 05390000
         MVC   SCTLSIOT(3,@11),ASGNADD                             1827 05391000
*             END;                                                 1828 05392000
*           ELSE                                                   1829 05393000
*             DO;                   /* NEW SIOT WON'T BE THE 1ST OR     05394000
*                                      THE LAST                      */ 05395000
         B     @RC01824                                            1829 05396000
@RF01824 DS    0H                                                  1830 05397000
*               NEWPTR->SCTPSIOT=   /* PICK UP THE PREV SIOT'S       */ 05398000
*                   (PROCSIOT+REALADD)->SCTPSIOT;/* LINK POINTER     */ 05399000
         L     @12,NEWPTR-1                                        1830 05400000
         L     @11,PROCSIOT                                        1830 05401000
         L     @09,REALADD-1                                       1830 05402000
         LA    @09,0(,@09)                                         1830 05403000
         LR    @15,@11                                             1830 05404000
         ALR   @15,@09                                             1830 05405000
         MVC   SCTPSIOT(3,@12),SCTPSIOT(@15)                       1830 05406000
*               EVAL(PROCSIOT+REALADD)->/* PLUG IN PREV SIOT'S NEW   */ 05407000
*                   SCTPSIOT=ASGNADD;/* 'NEXT' POINTER.              */ 05408000
         ALR   @11,@09                                             1831 05409000
         MVC   SCTPSIOT(3,@11),ASGNADD                             1831 05410000
*             END;                                                 1832 05411000
*         END;                      /* CLOSE 'PLUG-IN' SECTION       */ 05412000
@RC01824 DS    0H                                                  1834 05413000
*/**************************************************************     */ 05414000
*/* NOW FILL IN  VITAL FIELDS IN THE NEW SIOT THAT WON'T BE          */ 05415000
*/*    FILLED IN BY THE NORMAL SIOTPROC PROCESSING.                  */ 05416000
*/**************************************************************     */ 05417000
*                                                                  1834 05418000
*       NEWPTR->SIOTDSKA=ASGNADD;   /* PLUG-IN SELFPTR               */ 05419000
@RC01816 L     @12,NEWPTR-1                                        1834 05420000
         MVC   SIOTDSKA(3,@12),ASGNADD                             1834 05421000
*       NEWSIOT=ASGNADD;            /* SAVE ADDRESS FOR RETURN TO  1835 05422000
*                                      SIOTSCAN. IT WILL BE DESTROYED   05423000
*                                      BY THE NEXT ASSIGN.           */ 05424000
         MVC   NEWSIOT(3),ASGNADD                                  1835 05425000
*       CALL ASGNPROC;              /* GET SPACE FOR THE JFCB.       */ 05426000
         BAL   @14,ASGNPROC                                        1836 05427000
*       NEWJFCB=ASGNADD;            /* SAVE ADDR FOR WRITE-OUT       */ 05428000
         MVC   NEWJFCB(3),ASGNADD                                  1837 05429000
*       NEWPTR->SCTPJFCB=ASGNADD;   /* PLUG-IN JFCB ADDRESS          */ 05430000
         L     @12,NEWPTR-1                                        1838 05431000
         LA    @12,0(,@12)                                         1838 05432000
         MVC   SCTPJFCB(3,@12),ASGNADD                             1838 05433000
*       NEWPTR->SIOTTYPE=SIOT03;    /* SET BUILT-IN BLOCKID          */ 05434000
         MVI   SIOTTYPE(@12),X'03'                                 1839 05435000
*       NEWPTR->SCTDDNAM=DSDRDNAM;  /* PLUG-IN DDNAME                */ 05436000
         MVC   SCTDDNAM(8,@12),DSDRDNAM(IOBUFAD)                   1840 05437000
*       NEWPTR->SIOTDYAL=ON;        /* TURN ON 'DYNAMICALLY        1841 05438000
*                                      ALLOCATED' BIT.               */ 05439000
         OI    SIOTDYAL(@12),B'01000000'                           1841 05440000
*       NEWPTR->SIOTVLCT=           /* SET TOTAL NUM REQUESTED VOLS  */ 05441000
*           DJFCBPTR->JFCBVLCT;                                    1842 05442000
         L     @11,DJFCBPTR                                        1842 05443000
         MVC   SIOTVLCT(1,@12),JFCBVLCT(@11)                       1842 05444000
*       NEWPTR->SCTANAME=BLANKS;    /* ASSIGN DEFAULT TEMP NAME      */ 05445000
         MVC   SCTANAME(8,@12),@CC03776                            1843 05446000
*       NEWPTR->UNITS=ONEVOL;       /* DEFAULT TO 1 UNIT     @YM07510*/ 05447000
         MVI   UNITS(@12),X'01'                                    1844 05448000
*       NEWPTR->SIOTDEVT=DSDRUTYP;  /* PUT UNIT TYPE IN      @YM07581*/ 05449000
         MVC   SIOTDEVT(4,@12),DSDRUTYP(IOBUFAD)                   1845 05450000
*       NEWPTR->SIOUCNVT=0;         /* CONV DONE             @YM07581*/ 05451000
         MVI   SIOUCNVT(@12),X'00'                                 1846 05452000
*       NEWPTR->SIOUCBAD=ZEROPTR;   /* UCB ADDR = 0          @YM07581*/ 05453000
         SLR   @11,@11                                             1847 05454000
         STCM  @11,7,SIOUCBAD(@12)                                 1847 05455000
*       SIOTPTR=NEWPTR;             /* PARM FOR BITSOFF      @YM08140*/ 05456000
         ST    @12,SIOTPTR                                         1848 05457000
*       CALL BITSOFF;               /* INSURE EDT            @YM07581*/ 05458000
         BAL   @14,BITSOFF                                         1849 05459000
*/**************************************                             */ 05460000
*/* IT IS NOT NECESSARY TO SET SIOCLUNL                              */ 05461000
*/* AS ITS ONLY USE IS TO SET THE CORR-                              */ 05462000
*/* ESSPONDING BIT IN THE DSAB. THE                                  */ 05463000
*/* DSAB BIT WILL BE RESTORED BY THE                                 */ 05464000
*/* RESTART SVC.                                                     */ 05465000
*/**************************************                             */ 05466000
*/**************************************************************     */ 05467000
*/* THE FOLLOWING CODE  LOOPS THROUGH THE REMAINING SIOTS            */ 05468000
*/* SEARCHING FOR UNIT AFFINITY REQUESTS TO DD NUMBERS GREATER       */ 05469000
*/* THAN THE NUMBER OF THE SIOT PREVIOUS TO THE ONE ADDED. IF        */ 05470000
*/* ANY ARE FOUND, THE NUMBER IS BUMPED BY ONE SINCE THE             */ 05471000
*/* CORRESPONDING DD NUMBER  WILL BE ONE GREATER WHEN                */ 05472000
*/* RE-NUMBERED IN SIOTPROC. (GOT THAT???)                           */ 05473000
*/**************************************************************     */ 05474000
*                                                                  1850 05475000
*       IF NEWPTR->SIOTDSKA^=SCTLSIOT THEN/* DONT TRY TO LOOK PAST 1850 05476000
*                                      LAST                          */ 05477000
         L     @12,NEWPTR-1                                        1850 05478000
         LA    @12,0(,@12)                                         1850 05479000
         L     @11,SCTPTR                                          1850 05480000
         CLC   SIOTDSKA(3,@12),SCTLSIOT(@11)                       1850 05481000
         BE    @RF01850                                            1850 05482000
*         DO;                                                      1851 05483000
*           TEMPSW=ON;              /* LOOP CONTROL                  */ 05484000
         OI    TEMPSW,B'10000000'                                  1852 05485000
*           TEMPPTR=NEWPTR->SCTPSIOT;/* PICK UP NEXT SIOT ADDRESS    */ 05486000
         MVC   TEMPPTR(3),SCTPSIOT(@12)                            1853 05487000
*           DO WHILE TEMPSW=ON;                                    1854 05488000
         B     @DE01854                                            1854 05489000
@DL01854 DS    0H                                                  1855 05490000
*             IF TEMPPTR=SCTLSIOT THEN/* CLOSE THE LOOP AFTER THE  1855 05491000
*                                      LAST                          */ 05492000
         L     @12,SCTPTR                                          1855 05493000
         CLC   TEMPPTR(3),SCTLSIOT(@12)                            1855 05494000
         BNE   @RF01855                                            1855 05495000
*               TEMPSW=NOTON;       /* SIOT HAS BEEN EXAMINED        */ 05496000
         NI    TEMPSW,B'01111111'                                  1856 05497000
*             TEMPPTR=TEMPPTR+REALADD;/* SWA ADDR'ABILITY            */ 05498000
@RF01855 L     @12,TEMPPTR-1                                       1857 05499000
         LA    @12,0(,@12)                                         1857 05500000
         L     @11,REALADD-1                                       1857 05501000
         LA    @11,0(,@11)                                         1857 05502000
         ALR   @12,@11                                             1857 05503000
         STCM  @12,7,TEMPPTR                                       1857 05504000
*             IF TEMPPTR->SIOTUNAF  /* IF REQUESTED AFFINITY NUMBER  */ 05505000
*                 >LALOCCTR THEN    /* IS GREATER THAN LAST DD NUMBER*/ 05506000
         LH    @11,SIOTUNAF(,@12)                                  1858 05507000
         CH    @11,LALOCCTR                                        1858 05508000
         BNH   @RF01858                                            1858 05509000
*               TEMPPTR->SIOTUNAF=TEMPPTR->SIOTUNAF+ONEHEX;/* BUMP IT   05510000
*                                      BY ONE                        */ 05511000
         AL    @11,@CF02945                                        1859 05512000
         STH   @11,SIOTUNAF(,@12)                                  1859 05513000
*             TEMPPTR=TEMPPTR->SCTPSIOT;/* PICK UP NEW 'NEXT' PTR    */ 05514000
@RF01858 L     @12,TEMPPTR-1                                       1860 05515000
         SLR   @11,@11                                             1860 05516000
         ICM   @11,7,SCTPSIOT(@12)                                 1860 05517000
         STCM  @11,7,TEMPPTR                                       1860 05518000
*           END;                    /* CLOSE SEARCH LOOP             */ 05519000
@DE01854 TM    TEMPSW,B'10000000'                                  1861 05520000
         BO    @DL01854                                            1861 05521000
*         END;                      /* CLOSE UNIT-AFFINITY-BUMP CODE */ 05522000
*/**************************************                             */ 05523000
*/* AN ENTRY MUST BE MADE IN THE DSENQ                               */ 05524000
*/* TABLE FOR THE NEW DATASET                                        */ 05525000
*/**************************************                             */ 05526000
*                                                                  1863 05527000
*       DSN=DJFCBPTR->JFCBDSNM;     /* PLUG IN THE DSNAME            */ 05528000
@RF01850 L     @12,DJFCBPTR                                        1863 05529000
         MVC   DSN(44),JFCBDSNM(@12)                               1863 05530000
*       CALL ADDDSNQ;               /* ADD THE ENTRY                 */ 05531000
         BAL   @14,ADDDSNQ                                         1864 05532000
*/**************************************                             */ 05533000
*/* WRITE THE SIOT TO SWA. IT WAS BUILT                              */ 05534000
*/* IN SWA,SO LOCATE MODE WILL BE USED                               */ 05535000
*/**************************************                             */ 05536000
*                                                                  1865 05537000
*       SWLNGTH=LENGTH(INDMSIOT);   /* SET LENGTH FOR WRITE          */ 05538000
         L     @12,SWEPAPTR                                        1865 05539000
         MVC   SWLNGTH(4,@12),@CF04526                             1865 05540000
*       SWBLKPTR=NEWPTR;            /* SET ACTUAL BLOCK ADDRESS      */ 05541000
         L     @11,NEWPTR-1                                        1866 05542000
         LA    @11,0(,@11)                                         1866 05543000
         ST    @11,SWBLKPTR(,@12)                                  1866 05544000
*       SWVA=NEWSIOT;               /* SET PREFIX ADDRESS            */ 05545000
         MVC   SWVA(3,@12),NEWSIOT                                 1867 05546000
*       SWBLKID='00'X;              /* BLOCKID IS IN BLOCK           */ 05547000
         MVI   SWBLKID(@12),X'00'                                  1868 05548000
*/* ?SWAREQ (WL) EPA (EPAPTR);                                       */ 05549000
*                                                                  1869 05550000
*       CALL SWAMGR(EPAPTR,'WL');                                  1869 05551000
*                                                                  1869 05552000
         LA    @12,EPAPTR                                          1869 05553000
         ST    @12,@AL00001                                        1869 05554000
         LA    @12,@CC04369                                        1869 05555000
         ST    @12,@AL00001+4                                      1869 05556000
         LA    @12,16                                              1869 05557000
         L     @12,CVTPTR(,@12)                                    1869 05558000
         L     @12,CVTJESCT(,@12)                                  1869 05559000
         L     @15,JESWAA(,@12)                                    1869 05560000
         LA    @01,@AL00001                                        1869 05561000
         BALR  @14,@15                                             1869 05562000
*/**************************************                             */ 05563000
*/* WRITE OUT THE JFCB. IT IS IN IOBUF                               */ 05564000
*/* SO MOVE MODE IS USED.                                            */ 05565000
*/**************************************                             */ 05566000
*                                                                  1870 05567000
*       SWBUFPTR=DJFCBPTR;          /* SET 'FROM' ADDRESS            */ 05568000
         L     @12,EPAPTR                                          1870 05569000
         L     @11,DJFCBPTR                                        1870 05570000
         ST    @11,SWBUFPTR(,@12)                                  1870 05571000
*       SWROWVA=NEWJFCB;            /* SET 'TO' ADDRESS              */ 05572000
         MVC   SWROWVA(3,@12),NEWJFCB                              1871 05573000
*       SWWRTID=JFCB1C;             /* SET THE BLOCK ID              */ 05574000
         MVI   SWWRTID(@12),X'1C'                                  1872 05575000
*       CALL WRITESWA;              /* WRITE THE BLOCK               */ 05576000
         BAL   @14,WRITESWA                                        1873 05577000
*       EVAL(NEWJFCB+REALADD)->JFCBEXAD=ZEROPTR;/* THE JFCBX ADDRESS    05578000
*                                      IN THE JFCB JUST WRITTEN IS NO   05579000
*                                      LONGER VALID. IT WILL BE    1874 05580000
*                                      RESOLVED IN JFCBXJOB          */ 05581000
         L     @12,NEWJFCB-1                                       1874 05582000
         LA    @12,0(,@12)                                         1874 05583000
         L     @11,REALADD-1                                       1874 05584000
         LA    @11,0(,@11)                                         1874 05585000
         ALR   @12,@11                                             1874 05586000
         SLR   @11,@11                                             1874 05587000
         STCM  @11,7,JFCBEXAD(@12)                                 1874 05588000
*     END;                          /* CLOSE ADD-SIOT PORTION        */ 05589000
*   ELSE                            /* IF NOMATCH WAS NOT ENTERED FOR   05590000
*                                      CONSTRUCTION OF A SIOT/ JFCB     05591000
*                                      PAIR, IT WAS ENTERED BECAUSE A   05592000
*                                      MATCH COULD NOT BE FOUND FOR A   05593000
*                                      DSDR ENTRY. THIS INDICATES  1876 05594000
*                                      THAT A DD CARD WAS OMITTED  1876 05595000
*                                      FROM THE RESTART DECK, OR THAT   05596000
*                                      A DD WAS ADDED AS A MEMBER OF    05597000
*                                      A CONCAT GROUP                */ 05598000
*     IF(RESTYPE=ON                 /* IF DEFERRED....               */ 05599000
*         &PROCSIOT^=SAVEL          /* AND AND NOT END OF CHAIN      */ 05600000
*         &PROCSIOT^=ZEROPTR) THEN  /* OR BEGINNING OF CHAIN         */ 05601000
         B     @RC01809                                            1876 05602000
@RF01809 TM    RESTYPE,B'10000000'                                 1876 05603000
         BNO   @RF01876                                            1876 05604000
         L     @12,PROCSIOT                                        1876 05605000
         SLR   @11,@11                                             1876 05606000
         ICM   @11,7,SAVEL                                         1876 05607000
         CR    @12,@11                                             1876 05608000
         BE    @RF01876                                            1876 05609000
         LTR   @12,@12                                             1876 05610000
         BZ    @RF01876                                            1876 05611000
*       DO;                         /* TEST FOR ADDED CONCAT         */ 05612000
*         CCATEND=NOTON;            /* FLAG = END NOT FOUND          */ 05613000
         NI    CCATEND,B'01111111'                                 1878 05614000
*         NEWSIOT=(PROCSIOT+REALADD)->SCTPSIOT;/* GET NEXT           */ 05615000
         L     @11,REALADD-1                                       1879 05616000
         LA    @11,0(,@11)                                         1879 05617000
         ALR   @12,@11                                             1879 05618000
         SLR   @09,@09                                             1879 05619000
         ICM   @09,7,SCTPSIOT(@12)                                 1879 05620000
         STCM  @09,7,NEWSIOT                                       1879 05621000
*         IF EVAL(NEWSIOT+REALADD)->SCTDDNAM=BLANKS THEN           1880 05622000
         ALR   @09,@11                                             1880 05623000
         CLC   SCTDDNAM(8,@09),@CC03776                            1880 05624000
         BNE   @RF01880                                            1880 05625000
*           DO;                     /*                       @YM08662*/ 05626000
*             NEWCCAT=ON;           /* TELL SIOTSCAN ADDED CONCAT    */ 05627000
         OI    NEWCCAT,B'10000000'                                 1882 05628000
*             DO WHILE CCATEND=NOTON;/* FIND END OF GROUP            */ 05629000
         B     @DE01883                                            1883 05630000
@DL01883 DS    0H                                                  1884 05631000
*               IF NEWSIOT^=SAVEL THEN                             1884 05632000
         CLC   NEWSIOT(3),SAVEL                                    1884 05633000
         BE    @RF01884                                            1884 05634000
*                 DO;                                              1885 05635000
*                   NEWPTR=(NEWSIOT+REALADD)->SCTPSIOT;/* GET NEW  1886 05636000
*                                      NEXT                          */ 05637000
         L     @12,REALADD-1                                       1886 05638000
         LA    @12,0(,@12)                                         1886 05639000
         L     @11,NEWSIOT-1                                       1886 05640000
         LA    @11,0(,@11)                                         1886 05641000
         ALR   @11,@12                                             1886 05642000
         SLR   @09,@09                                             1886 05643000
         ICM   @09,7,SCTPSIOT(@11)                                 1886 05644000
         STCM  @09,7,NEWPTR                                        1886 05645000
*                   IF EVAL(NEWPTR+REALADD)->SCTDDNAM=BLANKS THEN  1887 05646000
         ALR   @12,@09                                             1887 05647000
         CLC   SCTDDNAM(8,@12),@CC03776                            1887 05648000
         BNE   @RF01887                                            1887 05649000
*                     NEWSIOT=NEWPTR;/* UPDATE UNTIL END OF GRP      */ 05650000
         STCM  @09,7,NEWSIOT                                       1888 05651000
*                   ELSE                                           1889 05652000
*                     CCATEND=ON;   /* SIGNAL END OF GROUP           */ 05653000
         B     @RC01887                                            1889 05654000
@RF01887 OI    CCATEND,B'10000000'                                 1889 05655000
*                 END;                                             1890 05656000
@RC01887 DS    0H                                                  1891 05657000
*             END;                                                 1891 05658000
@RF01884 DS    0H                                                  1891 05659000
@DE01883 TM    CCATEND,B'10000000'                                 1891 05660000
         BZ    @DL01883                                            1891 05661000
*           END;                                                   1892 05662000
*         ELSE                                                     1893 05663000
*           CALL ERR37;                                            1893 05664000
         B     @RC01880                                            1893 05665000
@RF01880 BAL   @14,ERR37                                           1893 05666000
*       END;                                                       1894 05667000
*     ELSE                                                         1895 05668000
*       CALL ERR37;                                                1895 05669000
         B     @RC01876                                            1895 05670000
@RF01876 BAL   @14,ERR37                                           1895 05671000
*   END NOMATCH;                                                   1896 05672000
@EL00026 DS    0H                                                  1896 05673000
@EF00026 DS    0H                                                  1896 05674000
@ER00026 LM    @14,@12,@SA00026                                    1896 05675000
         BR    @14                                                 1896 05676000
*LEFTOVER:                                                         1897 05677000
*   PROC;                                                          1897 05678000
*                                                                  1897 05679000
LEFTOVER STM   @14,@12,@SA00027                                    1897 05680000
*/**************************************************************     */ 05681000
*/* THIS PROCEDURE HANDLES ANY SIOTS THAT REMAIN ON THE CHAIN        */ 05682000
*/*   AFTER ALL THE DSDRS HAVE BEEN PROCESSED. FOR DEFERRED          */ 05683000
*/*   RESTARTS, THESE EXTRAS REPRESENT ADDED DD ENTRIES.  THEY       */ 05684000
*/*   WILL BE LEFT ON THE CHAIN, AND THE NUMBER OF DD'S UPDATED      */ 05685000
*/*   TO REFLECT THEM. FOR AUTO REATARTS, THEY MAY REPRESENT         */ 05686000
*/*   EITHER GDG ALL GENERATIONS (IN WHICH CASE THEY ARE DELETED     */ 05687000
*/*   FROM THE CHAIN) OR DYNAMIC ALLOCATIONS AFTER THE CHKPT         */ 05688000
*/*   WAS TAKEN.  THESE DYNALLOCS WILL BE TESTED TO DETERMINE IF     */ 05689000
*/*   THEY WERE NEW.  IF NEW,THEY ARE UNCATALOGED AND SCRATCHED      */ 05690000
*/* SO THE USER MAY RE-ALLOCATE THEM.                                */ 05691000
*/**************************************************************     */ 05692000
*                                                                  1898 05693000
*   DCL                                                            1898 05694000
*     1 NULLSIOT CHAR(70),          /* DUMMY SIOT FOR SPECIAL CASE 1898 05695000
*                                                            @YM03604*/ 05696000
*      2 * CHAR(28),                                               1898 05697000
*      2 NULPSIOT PTR(24) BDY(WORD),                               1898 05698000
*      2 * CHAR(39);                                               1898 05699000
*   IF PROCSIOT=ZEROPTR THEN                                       1899 05700000
         L     @12,PROCSIOT                                        1899 05701000
         LTR   @12,@12                                             1899 05702000
         BNZ   @RF01899                                            1899 05703000
*     DO;                           /* ALL SIOTS NOT PROCESSED     1900 05704000
*                                                            @YM03604*/ 05705000
*       PROCSIOT=ADDR(NULLSIOT)-LENGTH(SWAPFX);/* TO PICK UP 1ST SIOT   05706000
*                                      WHEN LOOP STARTS      @YM03604*/ 05707000
         LA    @12,NULLSIOT                                        1901 05708000
         SL    @12,@CF00052                                        1901 05709000
         ST    @12,PROCSIOT                                        1901 05710000
*       NULPSIOT=SCTFSIOT;          /* IF NONE OF THE SIOTS HAVE BEEN   05711000
*                                      PROCESSED, START LOOKING FROM    05712000
*                                      THE 1ST.              @YM03604*/ 05713000
         L     @12,SCTPTR                                          1902 05714000
         MVC   NULPSIOT(3),SCTFSIOT(@12)                           1902 05715000
*     END;                          /* CLOSE SPECIAL DO LOOP @YM03604*/ 05716000
*   IF RESTYPE=ON THEN              /* THIS IS DEFERRED...           */ 05717000
@RF01899 TM    RESTYPE,B'10000000'                                 1904 05718000
         BNO   @RF01904                                            1904 05719000
*     DO;                           /* ADD THE LEFTOVERS             */ 05720000
*       IF PROCSIOT^=SCTLSIOT THEN  /* ARE THERE ANY LEFTOVERS?      */ 05721000
         L     @12,PROCSIOT                                        1906 05722000
         L     @11,SCTPTR                                          1906 05723000
         SLR   @09,@09                                             1906 05724000
         ICM   @09,7,SCTLSIOT(@11)                                 1906 05725000
         CR    @12,@09                                             1906 05726000
         BE    @RF01906                                            1906 05727000
*         DO;                       /* YES                           */ 05728000
*           TEMPSW=ON;              /* LOOP CONTROL                  */ 05729000
         OI    TEMPSW,B'10000000'                                  1908 05730000
*           DO WHILE TEMPSW=ON;                                    1909 05731000
         B     @DE01909                                            1909 05732000
@DL01909 DS    0H                                                  1910 05733000
*             PROCSIOT=(PROCSIOT+REALADD)->SCTPSIOT;/* PICK UP     1910 05734000
*                                      NEXTSIOT                      */ 05735000
         L     @12,REALADD-1                                       1910 05736000
         LA    @12,0(,@12)                                         1910 05737000
         AL    @12,PROCSIOT                                        1910 05738000
         SLR   @11,@11                                             1910 05739000
         ICM   @11,7,SCTPSIOT(@12)                                 1910 05740000
         ST    @11,PROCSIOT                                        1910 05741000
*             IF PROCSIOT=SCTLSIOT THEN/* IF THIS IS LAST SIOT,      */ 05742000
         L     @12,SCTPTR                                          1911 05743000
         SLR   @09,@09                                             1911 05744000
         ICM   @09,7,SCTLSIOT(@12)                                 1911 05745000
         CR    @11,@09                                             1911 05746000
         BNE   @RF01911                                            1911 05747000
*               TEMPSW=NOTON;       /* CLOSE THE LOOP                */ 05748000
         NI    TEMPSW,B'01111111'                                  1912 05749000
*             LALOCCTR=LALOCCTR+ONEHEX;/* BUMP TOTAL NUM DD'S        */ 05750000
@RF01911 LA    @12,1                                               1913 05751000
         AH    @12,LALOCCTR                                        1913 05752000
         STH   @12,LALOCCTR                                        1913 05753000
*             EVAL(PROCSIOT+REALADD)->SCTDDINO=/* ASSIGN NEW DDNUMBER*/ 05754000
*                 LALOCCTR;                                        1914 05755000
         L     @11,REALADD-1                                       1914 05756000
         LA    @11,0(,@11)                                         1914 05757000
         AL    @11,PROCSIOT                                        1914 05758000
         STH   @12,SCTDDINO(,@11)                                  1914 05759000
*           END;                    /* CLOSE ADD-ON LOOP             */ 05760000
@DE01909 TM    TEMPSW,B'10000000'                                  1915 05761000
         BO    @DL01909                                            1915 05762000
*         END;                      /* CLOSE SEARCH                  */ 05763000
*     END;                          /* CLOSE DEFERRED SECTION        */ 05764000
*   ELSE                                                           1918 05765000
*     DO;                           /* THIS IS AUTOMATIC... DELETE 1918 05766000
*                                      THE LEFTOVERS                 */ 05767000
         B     @RC01904                                            1918 05768000
@RF01904 DS    0H                                                  1919 05769000
*       SAVELAST=PROCSIOT;          /* RETAIN ADDR OF LAST PROCESSED    05770000
*                                      SIOT. IT BECOMES SCTLSIOT WHEN   05771000
*                                      OTHER ARE PROCESSED OUT.      */ 05772000
         L     @12,PROCSIOT                                        1919 05773000
         ST    @12,SAVELAST                                        1919 05774000
*       IF PROCSIOT^=SCTLSIOT THEN  /* ARE THER ANY LEFTOVER SIOTS/  */ 05775000
         L     @11,SCTPTR                                          1920 05776000
         SLR   @09,@09                                             1920 05777000
         ICM   @09,7,SCTLSIOT(@11)                                 1920 05778000
         CR    @12,@09                                             1920 05779000
         BE    @RF01920                                            1920 05780000
*         DO;                                                      1921 05781000
*           TEMPSW=ON;                                             1922 05782000
         OI    TEMPSW,B'10000000'                                  1922 05783000
*           DO WHILE TEMPSW=ON;                                    1923 05784000
         B     @DE01923                                            1923 05785000
@DL01923 DS    0H                                                  1924 05786000
*             PROCSIOT=(PROCSIOT+REALADD)->SCTPSIOT;/* PICK UP     1924 05787000
*                                      NEXTSIOT                      */ 05788000
         L     @12,REALADD-1                                       1924 05789000
         LA    @12,0(,@12)                                         1924 05790000
         AL    @12,PROCSIOT                                        1924 05791000
         SLR   @11,@11                                             1924 05792000
         ICM   @11,7,SCTPSIOT(@12)                                 1924 05793000
         ST    @11,PROCSIOT                                        1924 05794000
*             IF PROCSIOT=SCTLSIOT THEN/* IF THIS IS THE LAST,       */ 05795000
         L     @12,SCTPTR                                          1925 05796000
         SLR   @09,@09                                             1925 05797000
         ICM   @09,7,SCTLSIOT(@12)                                 1925 05798000
         CR    @11,@09                                             1925 05799000
         BNE   @RF01925                                            1925 05800000
*               TEMPSW=NOTON;       /* MAKE THIS LAST TIMETHRU LOOP  */ 05801000
         NI    TEMPSW,B'01111111'                                  1926 05802000
*             NEWPTR=PROCSIOT+REALADD;/* TEMPORARY ADDRESSABILITY    */ 05803000
@RF01925 L     @12,REALADD-1                                       1927 05804000
         LA    @12,0(,@12)                                         1927 05805000
         AL    @12,PROCSIOT                                        1927 05806000
         STCM  @12,7,NEWPTR                                        1927 05807000
*             IF(NEWPTR->SCTSNEW=ON /* IS THE DATA SET NEW ?         */ 05808000
*                 |NEWPTR->SIOTCNEW=ON)/* OR CONVERTED FROM NEW?     */ 05809000
*                 &NEWPTR->SIOTDYAL=ON THEN                        1928 05810000
         TM    SCTSNEW(@12),B'00000100'                            1928 05811000
         BO    @GL00053                                            1928 05812000
         TM    SIOTCNEW(@12),B'00001000'                           1928 05813000
         BNO   @RF01928                                            1928 05814000
@GL00053 L     @12,NEWPTR-1                                        1928 05815000
         LA    @12,0(,@12)                                         1928 05816000
         TM    SIOTDYAL(@12),B'01000000'                           1928 05817000
         BNO   @RF01928                                            1928 05818000
*               DO;                                                1929 05819000
*                 IF NEWPTR->SIOTCALC=ON THEN/* IF CAT AT          1930 05820000
*                                      ALLOC...@YM08190              */ 05821000
         TM    SIOTCALC(@12),B'00010000'                           1930 05822000
         BNO   @RF01930                                            1930 05823000
*                   CALL UNCATLOG(NEWPTR);/* UNCATALOG THE DATASET   */ 05824000
         LA    @12,NEWPTR                                          1931 05825000
         ST    @12,@AL00001                                        1931 05826000
         LA    @01,@AL00001                                        1931 05827000
         BAL   @14,UNCATLOG                                        1931 05828000
*                 IF(NEWPTR->SIOTSSDS^=ON/* IF NOT SUBSYSTEM @YM08190*/ 05829000
*                     &NEWPTR->SIOUCBAD->UCB3DACC=ON) THEN/* & UCB 1932 05830000
*                                      SAYS DA               @YM08190*/ 05831000
@RF01930 L     @12,NEWPTR-1                                        1932 05832000
         LA    @12,0(,@12)                                         1932 05833000
         TM    SIOTSSDS(@12),B'10000000'                           1932 05834000
         BO    @RF01932                                            1932 05835000
         L     @12,SIOUCBAD-1(,@12)                                1932 05836000
         TM    UCB3DACC(@12),B'00100000'                           1932 05837000
         BNO   @RF01932                                            1932 05838000
*                   CALL SCRATCH(NEWPTR);                          1933 05839000
         LA    @12,NEWPTR                                          1933 05840000
         ST    @12,@AL00001                                        1933 05841000
         LA    @01,@AL00001                                        1933 05842000
         BAL   @14,SCRATCH                                         1933 05843000
*               END;                                               1934 05844000
@RF01932 DS    0H                                                  1935 05845000
*           END;                                                   1935 05846000
@RF01928 DS    0H                                                  1935 05847000
@DE01923 TM    TEMPSW,B'10000000'                                  1935 05848000
         BO    @DL01923                                            1935 05849000
*         END;                                                     1936 05850000
*       SCTLSIOT=SAVELAST;          /* RESTORE REAL SCTLSIOT.        */ 05851000
@RF01920 L     @12,SCTPTR                                          1937 05852000
         MVC   SCTLSIOT(3,@12),SAVELAST+1                          1937 05853000
*     END;                                                         1938 05854000
*   END LEFTOVER;                                                  1939 05855000
@EL00027 DS    0H                                                  1939 05856000
@EF00027 DS    0H                                                  1939 05857000
@ER00027 LM    @14,@12,@SA00027                                    1939 05858000
         BR    @14                                                 1939 05859000
*FREECHEK:                                                         1940 05860000
*   PROC;                                                          1940 05861000
*                                                                  1940 05862000
FREECHEK STM   @14,@12,@SA00028                                    1940 05863000
*/**************************************************************     */ 05864000
*/* FREECHEK WILL DYNAMICALLY UNALLOCATE THE CHECKPOINT DATASET      */ 05865000
*/*     IT WILL USE THE SAME PARAMETER LIST THAT WAS USED TO         */ 05866000
*/*     ALLOCATE IT.                                                 */ 05867000
*/**************************************************************     */ 05868000
*                                                                  1941 05869000
*   DO;                             /* MODESET SAVEKEY(SAVEKEYA)   1941 05870000
*                                      KEYADDR(ZEROPTR)              */ 05871000
*     RESPECIFY                                                    1942 05872000
*      (GPR02F) RESTRICTED;                                        1942 05873000
*     IPK;                          /* SAVE CURRENT PSW KEY          */ 05874000
         IPK                                                       1943 05875000
*     SAVEKEYA=GPR02F;                                             1944 05876000
         STC   GPR02F,SAVEKEYA                                     1944 05877000
*     SPKA(ZEROPTR);                /* SET PSW KEY                   */ 05878000
         SLR   @12,@12                                             1945 05879000
         SPKA  0(@12)                                              1945 05880000
*     RESPECIFY                                                    1946 05881000
*      (GPR02F) UNRESTRICTED;                                      1946 05882000
*   END;                            /* MODESET SAVEKEY(SAVEKEYA)   1947 05883000
*                                      KEYADDR(ZEROPTR) KEY = 0      */ 05884000
*   S99VERB=S99VRBUN;               /* PARM VERB = UNALLOCATE        */ 05885000
         LA    @12,EDBRBPTR                                        1948 05886000
         L     @12,S99RBPTR(,@12)                                  1948 05887000
         MVI   S99VERB(@12),X'02'                                  1948 05888000
*   TUPLAST(1)=ON;                  /* DDNAME IS ALL THAT IS       1949 05889000
*                                      NECESSARY FOR AN UNALLOC SO 1949 05890000
*                                      USE ONLY ONE TEXT UNIT.       */ 05891000
         OI    TUPLAST,B'10000000'                                 1949 05892000
*   SAVEJSCB=JSCBACT;               /* FORCE DYNALLOC TO USE INIT'S  */ 05893000
         L     @12,TCBPTR                                          1950 05894000
         L     @12,TCBJSCB(,@12)                                   1950 05895000
         L     @12,JSCBACT(,@12)                                   1950 05896000
         ST    @12,SAVEJSCB                                        1950 05897000
*   JSCBACT=TCBJSCB;                /* CORE FOR CONTROL BLOCKS       */ 05898000
         L     @12,TCBPTR                                          1951 05899000
         L     @12,TCBJSCB(,@12)                                   1951 05900000
         ST    @12,JSCBACT(,@12)                                   1951 05901000
*   PARMPTR=ADDR(S99RBPTR);         /* RE-INITIALIZE R1 FOR UNALLOC  */ 05902000
         LA    PARMPTR,EDBRBPTR                                    1952 05903000
*/*  MACDATE Y-2 73082                                               */ 05904000
*                                                                  1953 05905000
*   SVC(99);                        /* INVOKE DYN (UN)ALLOCATION     */ 05906000
         SVC   99                                                  1953 05907000
*   CALL UNALOCAT;                  /* CLOSE & FREE ANY PVT CATS   1954 05908000
*                                                            @YM06575*/ 05909000
         BAL   @14,UNALOCAT                                        1954 05910000
*   JSCBACT=SAVEJSCB;               /* RESTORE JSCBACT FOR PP CORE   */ 05911000
         L     @12,TCBPTR                                          1955 05912000
         L     @12,TCBJSCB(,@12)                                   1955 05913000
         L     @11,SAVEJSCB                                        1955 05914000
         ST    @11,JSCBACT(,@12)                                   1955 05915000
*   DO;                             /* MODESET KEYADDR(SAVEKEYA)     */ 05916000
*     SPKA(SAVEKEYA);               /* SET PSW KEY                   */ 05917000
         SLR   @12,@12                                             1957 05918000
         IC    @12,SAVEKEYA                                        1957 05919000
         SPKA  0(@12)                                              1957 05920000
*   END;                            /* MODESET KEYADDR(SAVEKEYA) KEY    05921000
*                                      BACK TO SCHED                 */ 05922000
*   END FREECHEK;                                                  1959 05923000
@EL00028 DS    0H                                                  1959 05924000
@EF00028 DS    0H                                                  1959 05925000
@ER00028 LM    @14,@12,@SA00028                                    1959 05926000
         BR    @14                                                 1959 05927000
*UNCATLOG:                                                         1960 05928000
*   PROC(PTRSIOT);                                                 1960 05929000
*                                                                  1960 05930000
UNCATLOG STM   @14,@12,@SA00029                                    1960 05931000
         MVC   @PC00029(4),0(@01)                                  1960 05932000
*/**************************************************************     */ 05933000
*/* USING THE SIOT POINTER PASSED AS A PRAM, THIS PROC WILL READ     */ 05934000
*/*   A JFCB FROM SWA AND ISSUE AN UNCATALOG MACRO FOR THE DSNAME    */ 05935000
*/*   FOUND IN THAT JFCB.                                            */ 05936000
*/**************************************************************     */ 05937000
*                                                                  1961 05938000
*   DCL                                                            1961 05939000
*     PTRSIOT PTR(24);                                             1961 05940000
*   DCL                                                            1962 05941000
*     UNCATNAM CHAR(44);                                           1962 05942000
*   DCL                                                            1963 05943000
*     LCSTATNM CHAR(4) LOCAL STATIC BDY(WORD);                     1963 05944000
*   DCL                                                            1964 05945000
*     REMOVE CHAR(*) GEND;                                         1964 05946000
*   DCL                                                            1965 05947000
*     REMOVE1 CHAR(*) LOCAL STATIC GEND;                           1965 05948000
*   DCL                                                            1966 05949000
*     LENX PTR(31) LOCAL STATIC GEND;                              1966 05950000
*   SWVA=PTRSIOT->SCTPJFCB;         /* PREPARE FOR JFCB READ.        */ 05951000
         L     @12,@PC00029                                        1967 05952000
         BCTR  @12,0                                               1967 05953000
         L     @12,PTRSIOT(,@12)                                   1967 05954000
         L     @11,SWEPAPTR                                        1967 05955000
         MVC   SWVA(3,@11),SCTPJFCB(@12)                           1967 05956000
*   CALL READSWA;                   /* GET THE JFCB                  */ 05957000
         BAL   @14,READSWA                                         1968 05958000
*   JFCBPTR=SWBLKPTR;               /* ADDR'ABILITY FOR THE JFCB     */ 05959000
         L     @12,SWEPAPTR                                        1969 05960000
         L     @12,SWBLKPTR(,@12)                                  1969 05961000
         ST    @12,JFCBPTR                                         1969 05962000
*   GEN DATA DEFS(REMOVE);                                         1970 05963000
*   GEN DATA DEFS(REMOVE1,LENX);                                   1971 05964000
*   UNCATNAM=JFCBDSNM;              /* SET NAME TO BE UNCATALOGED    */ 05965000
         L     @12,JFCBPTR                                         1972 05966000
         MVC   UNCATNAM(44),JFCBDSNM(@12)                          1972 05967000
*   REMOVE(1:LENX)=REMOVE1(1:LENX); /* MOVE LOCAL TO GEN'D FOR RE-ENT*/ 05968000
         L     @12,LENX                                            1973 05969000
         BCTR  @12,0                                               1973 05970000
         EX    @12,@SM04577                                        1973 05971000
*   REMOVE(5:8)=ADDR(UNCATNAM);     /* INSERT RELOCATABLE ADDRESS    */ 05972000
         LA    @12,UNCATNAM                                        1974 05973000
         STCM  @12,15,REMOVE+4                                     1974 05974000
*   DO;                             /* MODESET SAVEKEY(SAVEKEYA)   1975 05975000
*                                      KEYADDR(ZEROPTR)              */ 05976000
*     RESPECIFY                                                    1976 05977000
*      (GPR02F) RESTRICTED;                                        1976 05978000
*     IPK;                          /* SAVE CURRENT PSW KEY          */ 05979000
         IPK                                                       1977 05980000
*     SAVEKEYA=GPR02F;                                             1978 05981000
         STC   GPR02F,SAVEKEYA                                     1978 05982000
*     SPKA(ZEROPTR);                /* SET PSW KEY                   */ 05983000
         SLR   @12,@12                                             1979 05984000
         SPKA  0(@12)                                              1979 05985000
*     RESPECIFY                                                    1980 05986000
*      (GPR02F) UNRESTRICTED;                                      1980 05987000
*   END;                            /* MODESET SAVEKEY(SAVEKEYA)   1981 05988000
*                                      KEYADDR(ZEROPTR)      @YM07301*/ 05989000
*   SAVEJSCB=JSCBACT;               /* SAVE OLD ACTIVE       @YM06121*/ 05990000
         L     @12,TCBPTR                                          1982 05991000
         L     @12,TCBJSCB(,@12)                                   1982 05992000
         L     @12,JSCBACT(,@12)                                   1982 05993000
         ST    @12,SAVEJSCB                                        1982 05994000
*   JSCBACT=TCBJSCB;                /* USE INITS JSCB        @YM06121*/ 05995000
         L     @12,TCBPTR                                          1983 05996000
         L     @12,TCBJSCB(,@12)                                   1983 05997000
         ST    @12,JSCBACT(,@12)                                   1983 05998000
*   GEN(  CATALOG REMOVE);          /* ISSUE EXECUTABLE MACRO        */ 05999000
           CATALOG REMOVE                                               06000000
*   JSCBACT=SAVEJSCB;               /* RESTORE PP JSCB       @YM06121*/ 06001000
         L     @12,TCBPTR                                          1985 06002000
         L     @12,TCBJSCB(,@12)                                   1985 06003000
         L     @11,SAVEJSCB                                        1985 06004000
         ST    @11,JSCBACT(,@12)                                   1985 06005000
*   DO;                             /* MODESET KEYADDR(SAVEKEYA)     */ 06006000
*     SPKA(SAVEKEYA);               /* SET PSW KEY                   */ 06007000
         SLR   @12,@12                                             1987 06008000
         IC    @12,SAVEKEYA                                        1987 06009000
         SPKA  0(@12)                                              1987 06010000
*   END;                            /* MODESET KEYADDR(SAVEKEYA)   1988 06011000
*                                                            @YM07301*/ 06012000
*   END UNCATLOG;                                                  1989 06013000
@EL00029 DS    0H                                                  1989 06014000
@EF00029 DS    0H                                                  1989 06015000
@ER00029 LM    @14,@12,@SA00029                                    1989 06016000
         BR    @14                                                 1989 06017000
*MSGPROC:                                                          1990 06018000
*   PROC;                                                          1990 06019000
*                                                                  1990 06020000
MSGPROC  STM   @14,@12,@SA00030                                    1990 06021000
*/* THIS PROC ISSUES THE WTO MACRO. THE VARIABLE MSGAREA HAS         */ 06022000
*/*   SET UP BY THE CALLER.                                          */ 06023000
*                                                                  1991 06024000
*   R1=ADDR(MSGAREA);               /* INPUT TO WTO MACRO            */ 06025000
         LA    R1,MSGAREA                                          1991 06026000
*   GEN(WTO MF=(E,(R1)));                                          1992 06027000
         WTO MF=(E,(R1))                                                06028000
*   END MSGPROC;                                                   1993 06029000
@EL00030 DS    0H                                                  1993 06030000
@EF00030 DS    0H                                                  1993 06031000
@ER00030 LM    @14,@12,@SA00030                                    1993 06032000
         BR    @14                                                 1993 06033000
*WRAPUP:                                                           1994 06034000
*   PROC;                                                          1994 06035000
WRAPUP   STM   @14,@12,@SA00031                                    1994 06036000
*   SCTLALOC=LALOCCTR;              /* SET TOTAL NUMBER OF DD'S IN 1995 06037000
*                                      STEP                          */ 06038000
         L     @12,SCTPTR                                          1995 06039000
         LH    @11,LALOCCTR                                        1995 06040000
         STH   @11,SCTLALOC(,@12)                                  1995 06041000
*   SCTSYSCK=ON;                    /* SIGNAL THE RESTART SVC THAT 1996 06042000
*                                      THE CKPT D.S. IS SECURE.      */ 06043000
         OI    SCTSYSCK(@12),B'00100000'                           1996 06044000
*/********************************                                   */ 06045000
*/*   PUT OUT SUCCESS MESSAGE                                        */ 06046000
*/********************************                                   */ 06047000
*                                                                  1997 06048000
*   RESPECIFY                                                      1997 06049000
*     R2 RESTRICTED;                                               1997 06050000
*   R2=ADDR603;                     /* POINT TO MESSAGE MODULE       */ 06051000
         L     R2,ADDR603                                          1998 06052000
*   R2=R2+SIXTEEN;                  /* GET PAST MODULE IDENTIFIER    */ 06053000
         AL    R2,@CF03784                                         1999 06054000
*   DO WHILE ID^=M6;                /* SEARCH FOR SUCCESS MSG ID     */ 06055000
         B     @DE02000                                            2000 06056000
@DL02000 DS    0H                                                  2001 06057000
*     R2=R2+ENTLEN;                 /* BUMP BY LENGTH OF ENTRY       */ 06058000
         AL    R2,@CF03780                                         2001 06059000
*   END;                                                           2002 06060000
@DE02000 CLC   ID(4,R2),@CC04059                                   2002 06061000
         BNE   @DL02000                                            2002 06062000
*   MSGAREA(ONEHEX:MSGLEN)=MSGTEXT(ONEHEX:MSGLEN);/* MOVE MESSAGE  2003 06063000
*                                      SKELETON FROM MODULE TO BUFFER*/ 06064000
         SLR   @12,@12                                             2003 06065000
         IC    @12,MSGLEN(,R2)                                     2003 06066000
         BCTR  @12,0                                               2003 06067000
         L     @11,MSGADD-1(,R2)                                   2003 06068000
         EX    @12,@SM04574                                        2003 06069000
*   JNAME=JCTJNAME;                 /* INSERT JOBNAME FROM JCT       */ 06070000
         L     @12,JCTPTR                                          2004 06071000
         MVC   JNAME(8),JCTJNAME(@12)                              2004 06072000
*   JSTART=JBSTART;                 /* INSERT START ADDR AS SAVED BY    06073000
*                                      MSGSETUP                      */ 06074000
         MVC   JSTART(4),JBSTART                                   2005 06075000
*   JEND=JBEND;                     /* SAME...FOR ENDING ADDRESS     */ 06076000
         MVC   JEND(4),JBEND                                       2006 06077000
*   FILLER1=FILL1;                  /* INSERT K INTO MSG             */ 06078000
         MVC   FILLER1(3),@CC04065                                 2007 06079000
*   FILLER2=FILL2;                  /* INSERT FINAL K                */ 06080000
         MVC   FILLER2(2),@CC04067                                 2008 06081000
*   CALL MSGPROC;                   /* ISSUE WTO MACRO               */ 06082000
         BAL   @14,MSGPROC                                         2009 06083000
*   RESPECIFY                                                      2010 06084000
*     R2 UNRESTRICTED;                                             2010 06085000
*   GEN REFS(STAELIST);                                            2011 06086000
*                             /* CLEAN UP STAE  */                      06087000
    ESTAE 0,MF=(E,STAELIST)                                             06088000
*   END WRAPUP;                                                    2012 06089000
@EL00031 DS    0H                                                  2012 06090000
@EF00031 DS    0H                                                  2012 06091000
@ER00031 LM    @14,@12,@SA00031                                    2012 06092000
         BR    @14                                                 2012 06093000
*MSGSETUP:                                                         2013 06094000
*   PROC;                                                          2013 06095000
*                                                                  2013 06096000
MSGSETUP STM   @14,@12,12(@13)                                     2013 06097000
*/*************************************************************      */ 06098000
*/* MSGSETUP WILL CONVERT THE START AND END ADDRESSES TO K           */ 06099000
*/*    BOUNDARIES AND STORE THEM FOR THE SUCESS MESSAGE.             */ 06100000
*/*    OUTPUT CONSISTS OF THE VARIABLES JBSTART AND JBEND IN         */ 06101000
*/*    PRINTABLE FORM.                                               */ 06102000
*/*************************************************************      */ 06103000
*                                                                  2014 06104000
*   DCL                                                            2014 06105000
*     TEMP1 CHAR(3);                                               2014 06106000
*   DCL                                                            2015 06107000
*     HOLDSTRT FIXED(15);                                          2015 06108000
*   DCL                                                            2016 06109000
*     SIGNOUT BIT(8) CONSTANT('F0'X);                              2016 06110000
*   HOLDSTRT=(SCTMSADR+KROUND)/KBOUND;/* CONVERT START ADDR TO K     */ 06111000
         L     @12,SCTPTR                                          2017 06112000
         LA    @00,1023                                            2017 06113000
         AL    @00,SCTMSADR(,@12)                                  2017 06114000
         SRDA  @00,32                                              2017 06115000
         D     @00,@CF04089                                        2017 06116000
         STH   @01,HOLDSTRT                                        2017 06117000
*   CVD(HOLDSTRT,TEMP1);            /* CONVERT TO DECIMAL            */ 06118000
         CVD   @01,@TS00001                                        2018 06119000
         MVC   TEMP1(3),@TS00001+5                                 2018 06120000
*   UNPK(JBSTART,TEMP1);            /* UNPACK- ALMOST PRINTABLE...   */ 06121000
         UNPK  JBSTART(4),TEMP1(3)                                 2019 06122000
*   JBSTART(4)=JBSTART(4)|SIGNOUT;  /* MAKE SIGN PRINTABLE           */ 06123000
         OI    JBSTART+3,X'F0'                                     2020 06124000
*   HOLDSTRT=HOLDSTRT+SCTMSSZE;     /* CALCULATE END ADDRESS IN K    */ 06125000
         AH    @01,SCTMSSZE(,@12)                                  2021 06126000
         STH   @01,HOLDSTRT                                        2021 06127000
*   CVD(HOLDSTRT,TEMP1);            /* CONVERT TO DECIMAL            */ 06128000
         CVD   @01,@TS00001                                        2022 06129000
         MVC   TEMP1(3),@TS00001+5                                 2022 06130000
*   UNPK(JBEND,TEMP1);              /* UNPACK- ALMOST PRINTABLE      */ 06131000
         UNPK  JBEND(4),TEMP1(3)                                   2023 06132000
*   JBEND(4)=JBEND(4)|SIGNOUT;      /* MAKE SIGN PRINTABLE           */ 06133000
         OI    JBEND+3,X'F0'                                       2024 06134000
*   END MSGSETUP;                                                  2025 06135000
@EL00032 DS    0H                                                  2025 06136000
@EF00032 DS    0H                                                  2025 06137000
@ER00032 LM    @14,@12,12(@13)                                     2025 06138000
         BR    @14                                                 2025 06139000
*SCRATCH:                                                          2026 06140000
*   PROC(SIOTIN);                                                  2026 06141000
*                                                                  2026 06142000
SCRATCH  STM   @14,@12,@SA00033                                    2026 06143000
         MVC   @PC00033(4),0(@01)                                  2026 06144000
*/**************************************************************     */ 06145000
*/* THIS PROC SETS UP THE PARMETER LIST NECESSARY FOR ISSUANCE       */ 06146000
*/* OF THE 'SCRATCH' MACRO, AND ISSUES THE MACRO.                    */ 06147000
*/**************************************************************     */ 06148000
*                                                                  2027 06149000
*   DCL                                                            2027 06150000
*     SIOTIN PTR(24);               /* MAKE PARM ALIGNED CORRECTLY   */ 06151000
*   DCL                                                            2028 06152000
*     LISTPTR PTR(31);              /* PTR TO PARM LIST FOR SCRATCH  */ 06153000
*   DCL                                                            2029 06154000
*     LISTLEN FIXED(31);            /* HOLDER FOR LENGTH OF LIST     */ 06155000
*   DCL                                                            2030 06156000
*     SCRCHDSN CHAR(44);            /* DSNAME FOR SCRATCH MACRO      */ 06157000
*   DCL                                                            2031 06158000
*     LCLDSN CHAR(4) LOCAL STATIC BDY(WORD);                       2031 06159000
*   DCL                                                            2032 06160000
*     LCLLST CHAR(4) LOCAL STATIC BDY(WORD);                       2032 06161000
*   DCL                                                            2033 06162000
*     LENY PTR(31) LOCAL STATIC GEND;                              2033 06163000
*   DCL                                                            2034 06164000
*     NEWVOLS CHAR(*) GEND;         /* DEFINE GENERATED AREA         */ 06165000
*   DCL                                                            2035 06166000
*     NEWVOLS1 CHAR(*) LOCAL STATIC GEND;/* DEFINE LOCAL FOR INIT    */ 06167000
*   DCL                                                            2036 06168000
*     1 VOLIST CHAR(*) BASED(LISTPTR),/* LIST FOR SCRATCH            */ 06169000
*      2 NUMVOLS FIXED(15),         /*                       @YM08609*/ 06170000
*      2 VOLENTRY(*) CHAR(12),      /* ARRAY OF VOLSERS              */ 06171000
*        4 UNIT CHAR(4),                                           2036 06172000
*        4 SERIAL CHAR(6),                                         2036 06173000
*        4 SEQNO FIXED(15);                                        2036 06174000
*   DCL                                                            2037 06175000
*     TWELVE BIT(8) CONSTANT('0C'X);                               2037 06176000
*   DCL                                                            2038 06177000
*     TWO BIT(8) CONSTANT('02'X);                                  2038 06178000
*   DCL                                                            2039 06179000
*     VOLHOLD FIXED(15);                                           2039 06180000
*   DCL                                                            2040 06181000
*     HOLDI FIXED(8);                                              2040 06182000
*   DCL                                                            2041 06183000
*     HOLDX FIXED(8);                                              2041 06184000
*   DCL                                                            2042 06185000
*     XVOLI FIXED(8);                                              2042 06186000
*   VOLHOLD=ZEROPTR;                /* INSURE ARITH AND ZERO @YM07552*/ 06187000
         SLR   @12,@12                                             2043 06188000
         STH   @12,VOLHOLD                                         2043 06189000
*   SWVA=SIOTIN->SCTPJFCB;          /* PREPARE FOR JFCB READ         */ 06190000
         L     @12,@PC00033                                        2044 06191000
         BCTR  @12,0                                               2044 06192000
         L     @12,SIOTIN(,@12)                                    2044 06193000
         L     @11,SWEPAPTR                                        2044 06194000
         MVC   SWVA(3,@11),SCTPJFCB(@12)                           2044 06195000
*   CALL READSWA;                   /* READ JFCB TO GET VOLSERS      */ 06196000
         BAL   @14,READSWA                                         2045 06197000
*   JFCBPTR=SWBLKPTR;               /* ADDR'ABILITY FOR JFCB         */ 06198000
         L     @12,SWEPAPTR                                        2046 06199000
         L     @12,SWBLKPTR(,@12)                                  2046 06200000
         ST    @12,JFCBPTR                                         2046 06201000
*   RESPECIFY                                                      2047 06202000
*     R0 RESTRICTED;                                               2047 06203000
*   R0=(JFCBNVOL*TWELVE)+TWO;       /* CALCULATE SPACE NEEDED        */ 06204000
         SLR   R0,R0                                               2048 06205000
         IC    R0,JFCBNVOL(,@12)                                   2048 06206000
         MH    R0,@CH03846                                         2048 06207000
         AL    R0,@CF02918                                         2048 06208000
*   LISTLEN=R0;                     /* SAVE THE LENGTH FOR FREEMAIN  */ 06209000
         ST    R0,LISTLEN                                          2049 06210000
*   GEN(GETMAIN R,LV=(R0));         /* GET SPACE FOR PARMLIST        */ 06211000
         GETMAIN R,LV=(R0)                                              06212000
*   LISTPTR=R1;                     /* PARMLIST ADDR'ABILITY         */ 06213000
         ST    R1,LISTPTR                                          2051 06214000
*   RESPECIFY                                                      2052 06215000
*     R0 UNRESTRICTED;                                             2052 06216000
*   NUMVOLS=JFCBNVOL;               /* SET NUM VOLSERS INTO LIST     */ 06217000
         L     @12,LISTPTR                                         2053 06218000
         L     @11,JFCBPTR                                         2053 06219000
         SLR   @09,@09                                             2053 06220000
         IC    @09,JFCBNVOL(,@11)                                  2053 06221000
         STCM  @09,3,NUMVOLS(@12)                                  2053 06222000
*   SCRCHDSN=JFCBDSNM;              /* SET DSNAME INTO LIST          */ 06223000
         MVC   SCRCHDSN(44),JFCBDSNM(@11)                          2054 06224000
*   VOLHOLD=JFCBNVOL;               /* USE VALUE W/OUT DESTROYING  2055 06225000
*                                      NVOL                          */ 06226000
         STH   @09,VOLHOLD                                         2055 06227000
*   DO I=1 TO VOLHOLD WHILE I<6;    /* PLUG IN THE FIRST 5 VOLSERS   */ 06228000
         LA    @12,1                                               2056 06229000
         B     @DE02056                                            2056 06230000
@DL02056 LA    @11,6                                               2056 06231000
         CR    @12,@11                                             2056 06232000
         BNL   @DC02056                                            2056 06233000
*     UNIT(I)=SIOTIN->SIOTDEVT;     /* INSERT UNIT TYPE      @YM06121*/ 06234000
         L     @09,LISTPTR                                         2057 06235000
         LR    @15,@12                                             2057 06236000
         MH    @15,@CH00558                                        2057 06237000
         ST    @15,@TF00001                                        2057 06238000
         ALR   @15,@09                                             2057 06239000
         AL    @15,@CF04579                                        2057 06240000
         L     @14,@PC00033                                        2057 06241000
         BCTR  @14,0                                               2057 06242000
         L     @01,SIOTIN(,@14)                                    2057 06243000
         MVC   UNIT-2(4,@15),SIOTDEVT(@01)                         2057 06244000
*     SERIAL(I)=JFCAVOLS(I);        /* INSERT VOLSER                 */ 06245000
         LR    @01,@09                                             2058 06246000
         AL    @01,@TF00001                                        2058 06247000
         AL    @01,@CF04580                                        2058 06248000
         LR    @15,@11                                             2058 06249000
         MR    @14,@12                                             2058 06250000
         L     @11,JFCBPTR                                         2058 06251000
         ALR   @11,@15                                             2058 06252000
         MVC   SERIAL-6(6,@01),JFCAVOLS-6(@11)                     2058 06253000
*     SEQNO(I)=0;                   /* SEQUENCE ALWAYS ZERO FOR DA   */ 06254000
         SLR   @11,@11                                             2059 06255000
         AL    @09,@TF00001                                        2059 06256000
         STCM  @11,3,SEQNO-12(@09)                                 2059 06257000
*     HOLDI=I;                      /* RETAIN POSITION IN LIST       */ 06258000
         STC   @12,HOLDI                                           2060 06259000
*   END;                                                           2061 06260000
*                                                                  2061 06261000
         AL    @12,@CF00069                                        2061 06262000
@DE02056 ST    @12,I                                               2061 06263000
         CH    @12,VOLHOLD                                         2061 06264000
         BNH   @DL02056                                            2061 06265000
@DC02056 DS    0H                                                  2062 06266000
*/**************************************                             */ 06267000
*/* IF THERE ARE LESS THAN 5 VOLUME                                  */ 06268000
*/* SERIALS FOR THIS DATA SET, PROCESS                               */ 06269000
*/* IS COMPLETE EXCEPT TO ISSUE THE                                  */ 06270000
*/* SCRATCH MACRO. FOLLOWING CODE                                    */ 06271000
*/* PULLS VOLSERS OUT OF THE JFCBX(S)                                */ 06272000
*/**************************************                             */ 06273000
*                                                                  2062 06274000
*   VOLHOLD=VOLHOLD-5;              /* DEDUCT JFCB CAPACITY          */ 06275000
         LH    @12,VOLHOLD                                         2062 06276000
         SL    @12,@CF00034                                        2062 06277000
         STH   @12,VOLHOLD                                         2062 06278000
*   IF VOLHOLD>0 THEN               /* MORE VOLSERS IN JFCBX(S)??    */ 06279000
         LTR   @12,@12                                             2063 06280000
         BNP   @RF02063                                            2063 06281000
*     DO;                           /* YES...                        */ 06282000
*       SWVA=JFCBEXAD;              /* SETUP FOR INITIAL READ        */ 06283000
         L     @12,SWEPAPTR                                        2065 06284000
         L     @11,JFCBPTR                                         2065 06285000
         MVC   SWVA(3,@12),JFCBEXAD(@11)                           2065 06286000
*       TEMPSW=ON;                  /* LOOP CONTROL                  */ 06287000
         OI    TEMPSW,B'10000000'                                  2066 06288000
*       DO WHILE TEMPSW=ON;                                        2067 06289000
         B     @DE02067                                            2067 06290000
@DL02067 DS    0H                                                  2068 06291000
*         CALL READSWA;             /* GET 1ST (NEXT) JFCBX          */ 06292000
         BAL   @14,READSWA                                         2068 06293000
*         IF VOLHOLD>FIFTEEN THEN                                  2069 06294000
         LH    @12,VOLHOLD                                         2069 06295000
         C     @12,@CF03927                                        2069 06296000
         BNH   @RF02069                                            2069 06297000
*           DO;                     /* HANDLE FULL JFCBX             */ 06298000
*             XVOLI=0;              /* PRIME FOR JFCBXVOL INDEX      */ 06299000
         MVI   XVOLI,X'00'                                         2071 06300000
*             SWVA=JFCBXTTR;        /* PREPARE FOR POSSIBLE NXTREAD  */ 06301000
         L     @12,SWEPAPTR                                        2072 06302000
         L     @11,JFCBXPTR                                        2072 06303000
         MVC   SWVA(3,@12),JFCBXTTR(@11)                           2072 06304000
*             HOLDX=HOLDI;          /* PICK UP POSITION IN LIST      */ 06305000
         SLR   @12,@12                                             2073 06306000
         IC    @12,HOLDI                                           2073 06307000
         STC   @12,HOLDX                                           2073 06308000
*             DO I=HOLDX TO(HOLDX+FIFTEEN);/* LOOP THRU 15 VOLS      */ 06309000
         B     @DE02074                                            2074 06310000
@DL02074 DS    0H                                                  2075 06311000
*               XVOLI=XVOLI+ONEHEX; /* JFCBXVOL INDEX                */ 06312000
         LA    @11,1                                               2075 06313000
         SLR   @09,@09                                             2075 06314000
         IC    @09,XVOLI                                           2075 06315000
         ALR   @09,@11                                             2075 06316000
         STC   @09,XVOLI                                           2075 06317000
*               UNIT(I)=SIOTIN->SIOTDEVT;/* INSERT UNIT TYPE @YM06121*/ 06318000
         L     @15,LISTPTR                                         2076 06319000
         LR    @14,@12                                             2076 06320000
         MH    @14,@CH00558                                        2076 06321000
         ST    @14,@TF00001                                        2076 06322000
         ALR   @14,@15                                             2076 06323000
         AL    @14,@CF04579                                        2076 06324000
         L     @01,@PC00033                                        2076 06325000
         BCTR  @01,0                                               2076 06326000
         L     @01,SIOTIN(,@01)                                    2076 06327000
         MVC   UNIT-2(4,@14),SIOTDEVT(@01)                         2076 06328000
*               SERIAL(I)=JFCBXVOL(XVOLI);/* INSERT VOLSER           */ 06329000
         LR    @14,@15                                             2077 06330000
         AL    @14,@TF00001                                        2077 06331000
         AL    @14,@CF04580                                        2077 06332000
         MH    @09,@CH00035                                        2077 06333000
         L     @01,JFCBXPTR                                        2077 06334000
         ALR   @01,@09                                             2077 06335000
         BCTR  @01,0                                               2077 06336000
         BCTR  @01,0                                               2077 06337000
         MVC   SERIAL-6(6,@14),JFCBXVOL-4(@01)                     2077 06338000
*               SEQNO(I)=0;         /* SEQUENCE ALWAYS 0 FOR DA      */ 06339000
         SLR   @09,@09                                             2078 06340000
         AL    @15,@TF00001                                        2078 06341000
         STCM  @09,3,SEQNO-12(@15)                                 2078 06342000
*               VOLHOLD=VOLHOLD-ONEHEX;/* CORRECT NUM VOLS LEFT      */ 06343000
         LCR   @11,@11                                             2079 06344000
         AH    @11,VOLHOLD                                         2079 06345000
         STH   @11,VOLHOLD                                         2079 06346000
*               HOLDI=I;            /* MAINTAIN PROPER PLACE IN LIST */ 06347000
         STC   @12,HOLDI                                           2080 06348000
*             END;                  /* CLOSE FULL JFCBX LOOP         */ 06349000
         AL    @12,@CF00069                                        2081 06350000
@DE02074 ST    @12,I                                               2081 06351000
         LA    @11,15                                              2081 06352000
         SLR   @09,@09                                             2081 06353000
         IC    @09,HOLDX                                           2081 06354000
         ALR   @11,@09                                             2081 06355000
         CR    @12,@11                                             2081 06356000
         BNH   @DL02074                                            2081 06357000
*           END;                    /* CLOSE FULL JFCBX(S) LOOP      */ 06358000
*         ELSE                                                     2083 06359000
*           DO;                     /* HANDLE PARTIALLY FILLED JFCBX */ 06360000
         B     @RC02069                                            2083 06361000
@RF02069 DS    0H                                                  2084 06362000
*             XVOLI=0;              /* PRIME JFCBXVOL INDEX AGAIN    */ 06363000
         MVI   XVOLI,X'00'                                         2084 06364000
*             TEMPSW=NOTON;         /* WILL STOP JFCBX PROCESSING    */ 06365000
         NI    TEMPSW,B'01111111'                                  2085 06366000
*             HOLDX=HOLDI;          /* GET PROPER PLACE IN LIST      */ 06367000
         SLR   @12,@12                                             2086 06368000
         IC    @12,HOLDI                                           2086 06369000
         STC   @12,HOLDX                                           2086 06370000
*             DO I=HOLDX TO(HOLDX+VOLHOLD);                        2087 06371000
         B     @DE02087                                            2087 06372000
@DL02087 DS    0H                                                  2088 06373000
*               XVOLI=XVOLI+ONEHEX; /* JFCBXVOL INDEX                */ 06374000
         LA    @11,1                                               2088 06375000
         SLR   @09,@09                                             2088 06376000
         IC    @09,XVOLI                                           2088 06377000
         ALR   @11,@09                                             2088 06378000
         STC   @11,XVOLI                                           2088 06379000
*               UNIT(I)=SIOTDEVT;   /* INSERT UNIT TYPE              */ 06380000
         L     @09,LISTPTR                                         2089 06381000
         LR    @15,@12                                             2089 06382000
         MH    @15,@CH00558                                        2089 06383000
         ST    @15,@TF00001                                        2089 06384000
         ALR   @15,@09                                             2089 06385000
         AL    @15,@CF04579                                        2089 06386000
         L     @14,SIOTPTR                                         2089 06387000
         MVC   UNIT-2(4,@15),SIOTDEVT(@14)                         2089 06388000
*               SERIAL(I)=JFCBXVOL(XVOLI);/* INSERT VOLSER           */ 06389000
         LR    @01,@09                                             2090 06390000
         AL    @01,@TF00001                                        2090 06391000
         AL    @01,@CF04580                                        2090 06392000
         MH    @11,@CH00035                                        2090 06393000
         L     @15,JFCBXPTR                                        2090 06394000
         ALR   @15,@11                                             2090 06395000
         BCTR  @15,0                                               2090 06396000
         BCTR  @15,0                                               2090 06397000
         MVC   SERIAL-6(6,@01),JFCBXVOL-4(@15)                     2090 06398000
*               SEQNO(I)=0;         /* SEQUENCE ALWAYS 0 FOR DA      */ 06399000
         SLR   @11,@11                                             2091 06400000
         AL    @09,@TF00001                                        2091 06401000
         STCM  @11,3,SEQNO-12(@09)                                 2091 06402000
*             END;                  /* END INSERT VOLSER LOOP        */ 06403000
         AL    @12,@CF00069                                        2092 06404000
@DE02087 ST    @12,I                                               2092 06405000
         SLR   @11,@11                                             2092 06406000
         IC    @11,HOLDX                                           2092 06407000
         AH    @11,VOLHOLD                                         2092 06408000
         CR    @12,@11                                             2092 06409000
         BNH   @DL02087                                            2092 06410000
*           END;                    /* END PARTIAL JFCBX GROUP       */ 06411000
*       END;                        /* END TOTAL JFCBX GROUP         */ 06412000
@RC02069 DS    0H                                                  2094 06413000
@DE02067 TM    TEMPSW,B'10000000'                                  2094 06414000
         BO    @DL02067                                            2094 06415000
*     END;                          /* END JFCBXTEST GROUP           */ 06416000
*/**************************************                             */ 06417000
*/* NOW ISSUE THE SCRATCH MACRO...                                   */ 06418000
*/**************************************                             */ 06419000
*                                                                  2096 06420000
*   RESPECIFY                                                      2096 06421000
*    (R0,                                                          2096 06422000
*     R1) RESTRICTED;                                              2096 06423000
@RF02063 DS    0H                                                  2097 06424000
*   GEN DATA DEFS(NEWVOLS);                                        2097 06425000
*   GEN DATA DEFS(NEWVOLS1,LENY);                                  2098 06426000
*   NEWVOLS(1:LENY)=NEWVOLS1(1:LENY);/* COPY LOCAL TO RE-ENTRANT     */ 06427000
         L     @12,LENY                                            2099 06428000
         BCTR  @12,0                                               2099 06429000
         EX    @12,@SM04581                                        2099 06430000
*   NEWVOLS(5:8)=ADDR(SCRCHDSN);    /* SET RELOCATABLE ADDR OF DSN   */ 06431000
         LA    @12,SCRCHDSN                                        2100 06432000
         STCM  @12,15,NEWVOLS+4                                    2100 06433000
*   NEWVOLS(13:16)=LISTPTR;         /* SET RELOCATABLE LIST ADDR     */ 06434000
         MVC   NEWVOLS+12(4),LISTPTR                               2101 06435000
*   R0=ZEROPTR;                     /* INDICATE NO UCB PASSED FOR  2102 06436000
*                                      MOUNTS                        */ 06437000
         SLR   R0,R0                                               2102 06438000
*   DO;                             /* MODESET SAVEKEY(SAVEKEYA)   2103 06439000
*                                      KEYADDR(ZEROPTR)              */ 06440000
*     RESPECIFY                                                    2104 06441000
*      (GPR02F) RESTRICTED;                                        2104 06442000
*     IPK;                          /* SAVE CURRENT PSW KEY          */ 06443000
         IPK                                                       2105 06444000
*     SAVEKEYA=GPR02F;                                             2106 06445000
         STC   GPR02F,SAVEKEYA                                     2106 06446000
*     SPKA(ZEROPTR);                /* SET PSW KEY                   */ 06447000
         SLR   @12,@12                                             2107 06448000
         SPKA  0(@12)                                              2107 06449000
*     RESPECIFY                                                    2108 06450000
*      (GPR02F) UNRESTRICTED;                                      2108 06451000
*   END;                            /* MODESET SAVEKEY(SAVEKEYA)   2109 06452000
*                                      KEYADDR(ZEROPTR)      @YM07301*/ 06453000
*   SAVEJSCB=JSCBACT;               /* SAVE OLD ACTIVE       @YM06121*/ 06454000
         L     @12,TCBPTR                                          2110 06455000
         L     @12,TCBJSCB(,@12)                                   2110 06456000
         L     @12,JSCBACT(,@12)                                   2110 06457000
         ST    @12,SAVEJSCB                                        2110 06458000
*   JSCBACT=TCBJSCB;                /* USE INITS JSCB        @YM06121*/ 06459000
         L     @12,TCBPTR                                          2111 06460000
         L     @12,TCBJSCB(,@12)                                   2111 06461000
         ST    @12,JSCBACT(,@12)                                   2111 06462000
*   GEN( SCRATCH NEWVOLS);          /* ISSUE EXECUTABLE MACRO        */ 06463000
          SCRATCH NEWVOLS                                               06464000
*   JSCBACT=SAVEJSCB;               /* RESTORE PP JSCB       @YM06121*/ 06465000
         L     @12,TCBPTR                                          2113 06466000
         L     @12,TCBJSCB(,@12)                                   2113 06467000
         L     @11,SAVEJSCB                                        2113 06468000
         ST    @11,JSCBACT(,@12)                                   2113 06469000
*   DO;                             /* MODESET KEYADDR(SAVEKEYA)     */ 06470000
*     SPKA(SAVEKEYA);               /* SET PSW KEY                   */ 06471000
         SLR   @12,@12                                             2115 06472000
         IC    @12,SAVEKEYA                                        2115 06473000
         SPKA  0(@12)                                              2115 06474000
*   END;                            /* MODESET KEYADDR(SAVEKEYA)   2116 06475000
*                                                            @YM07301*/ 06476000
*/**************************************                             */ 06477000
*/* FREE THE AREA USED FOR THE LIST                                  */ 06478000
*/**************************************                             */ 06479000
*                                                                  2117 06480000
*   R1=LISTPTR;                     /* SET AREA ADDRESS FOR FREEMAIN */ 06481000
         L     R1,LISTPTR                                          2117 06482000
*   R0=LISTLEN;                     /* SET LENGTH OF AREA            */ 06483000
         L     R0,LISTLEN                                          2118 06484000
*   GEN(FREEMAIN R,LV=(0),A=(1));   /* ISSUE THE FREEMAIN            */ 06485000
         FREEMAIN R,LV=(0),A=(1)                                        06486000
*   RESPECIFY                                                      2120 06487000
*    (R0,                                                          2120 06488000
*     R1) UNRESTRICTED;                                            2120 06489000
*   END SCRATCH;                                                   2121 06490000
@EL00033 DS    0H                                                  2121 06491000
@EF00033 DS    0H                                                  2121 06492000
@ER00033 LM    @14,@12,@SA00033                                    2121 06493000
         BR    @14                                                 2121 06494000
*STAEPROC:                                                         2122 06495000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               2122 06496000
STAEPROC DS    0H                                                  2123 06497000
*   DCL                                                            2123 06498000
*     M10 CHAR(4) CONSTANT('MG10');                                2123 06499000
*   DCL                                                            2124 06500000
*     DUMPLIST CHAR(*) GEND BDY(WORD);/* DYNAMIC LIST                */ 06501000
*   DCL                                                            2125 06502000
*     DLIST1 CHAR(*) GEND LOCAL STATIC BDY(WORD);/* LOCAL LIST       */ 06503000
*   DCL                                                            2126 06504000
*     LENLIST1 PTR(31) LOCAL STATIC GEND;                          2126 06505000
*   DCL                                                            2127 06506000
*     ADDRDATA PTR(31) DEF(DUMPLIST) POS(13);                      2127 06507000
*   DCL                                                            2128 06508000
*     DUMPDATA CHAR(*) DEF(DUMPLIST) POS(25);                      2128 06509000
*   DCL                                                            2129 06510000
*     JINSERT CHAR(8) DEF(MSGAREA) POS(39);                        2129 06511000
*   DCL                                                            2130 06512000
*     REG9X REG(9) PTR(31) RESTRICTED;                             2130 06513000
*   DCL                                                            2131 06514000
*     REGPICUP PTR(31) BASED(SDWAPARM);                            2131 06515000
*   DCL                                                            2132 06516000
*     SDWAPTR REG(1) PTR(31) RESTRICTED;                           2132 06517000
*   DCL                                                            2133 06518000
*     SAVEONE PTR(31) ABNL;                                        2133 06519000
*   DCL                                                            2134 06520000
*     SAVE14 PTR(31) ABNL;                                         2134 06521000
*   DCL                                                            2135 06522000
*     R14 REG(14) RESTRICTED;                                      2135 06523000
*   DCL                                                            2136 06524000
*     R15 PTR(31) REG(15);                                         2136 06525000
*   DCL                                                            2137 06526000
*     NOSDWA BIT(1);                                               2137 06527000
*                                                                  2137 06528000
*/**************************************                             */ 06529000
*/* PUT OUT A MESSAGE TO THE OPER AND                                */ 06530000
*/* THE PROGRAMMER THAT THE RESTART HAS                              */ 06531000
*/* ABENDED.(UNLESS THIS IS CANCEL)                                  */ 06532000
*/**************************************                             */ 06533000
*                                                                  2138 06534000
*   GENERATE;                                                      2138 06535000
*         /*                                                            06536000
    BALR 15,0       ADRESSABILITY                                       06537000
    LA   9,12       FOR SDWA COMPARE                                    06538000
    CR   9,0        SDWA PRESENT ?                                      06539000
    BNE  18(15)     YES, GO GET REGS FROM SDWA                          06540000
    L    9,0(2)     NO, PICKUP  FROM R2                                 06541000
    B    26(15)     NOW GET REGS                                        06542000
    L    9,0(1)     PICK UP PARM POINTER                                06543000
    L    9,0(9)     PICK UP PARM                                        06544000
    LM   2,13,8(9)  GET THE REGS                                        06545000
    STM 0,15,136(1)  STORE FOR RETRY ROUTINE                            06546000
*   IF R0=12 THEN                                                  2139 06547000
         C     R0,@CF00558                                         2139 06548000
         BNE   @RF02139                                            2139 06549000
*     NOSDWA=ON;                    /* INDICATE TYPE OF EXIT         */ 06550000
         OI    NOSDWA,B'10000000'                                  2140 06551000
*   ELSE                                                           2141 06552000
*     NOSDWA=NOTON;                 /* INSURE ZERO FLAG              */ 06553000
         B     @RC02139                                            2141 06554000
@RF02139 NI    NOSDWA,B'01111111'                                  2141 06555000
*   SAVEONE=R1;                                                    2142 06556000
@RC02139 ST    R1,SAVEONE                                          2142 06557000
*   SAVE14=R14;                                                    2143 06558000
         ST    R14,SAVE14                                          2143 06559000
*   RESPECIFY                                                      2144 06560000
*     R2 RESTRICTED;                                               2144 06561000
*   TCBJSCB->JSCBACT=SAVEJSCB;      /* P/P JSCB              @YM08127*/ 06562000
         L     @15,TCBPTR                                          2145 06563000
         L     @15,TCBJSCB(,@15)                                   2145 06564000
         L     @12,SAVEJSCB                                        2145 06565000
         ST    @12,JSCBACT(,@15)                                   2145 06566000
*   R2=ADDR603;                                                    2146 06567000
         L     R2,ADDR603                                          2146 06568000
*   R2=R2+16;                       /* GET PAST HEADER FOR MSG MOD   */ 06569000
         AL    R2,@CF00052                                         2147 06570000
*   DO WHILE ID^=M10;               /* LOOP TILL CORRECT MSG FOUND   */ 06571000
         B     @DE02148                                            2148 06572000
@DL02148 DS    0H                                                  2149 06573000
*     R2=R2+ENTLEN;                 /* BUMP PAST THIS ENTRY          */ 06574000
         AL    R2,@CF03780                                         2149 06575000
*   END;                                                           2150 06576000
@DE02148 CLC   ID(4,R2),@CC04443                                   2150 06577000
         BNE   @DL02148                                            2150 06578000
*   MSGAREA(ONEHEX:MSGLEN)=MSGTEXT(ONEHEX:MSGLEN);/* MOVE MSG IN     */ 06579000
         SLR   @15,@15                                             2151 06580000
         IC    @15,MSGLEN(,R2)                                     2151 06581000
         BCTR  @15,0                                               2151 06582000
         L     @12,MSGADD-1(,R2)                                   2151 06583000
         EX    @15,@SM04583                                        2151 06584000
*   JINSERT=JCTJNAME;               /* PUT JOB NAME TO MESSAGE       */ 06585000
         L     @15,JCTPTR                                          2152 06586000
         MVC   JINSERT(8),JCTJNAME(@15)                            2152 06587000
*   R1=ADDR(MSGAREA);               /* INPUT TO WTO MACRO            */ 06588000
         LA    R1,MSGAREA                                          2153 06589000
*   GEN(WTO MF=(E,(R1)));           /* PERFORM THE WTO AND WTP       */ 06590000
         WTO MF=(E,(R1))                                                06591000
*/*************************************                              */ 06592000
*/* NOW TAKE A DUMP OF SQA,NUCLEUS,LSQA                              */ 06593000
*/*  REGION,LPA ACTIVE MODULES, TRACE                                */ 06594000
*/*  AREAS,AND SWA.                                                  */ 06595000
*/*************************************                              */ 06596000
*                                                                  2155 06597000
*   DUMPLIST(1:LENLIST1)=DLIST1(1:LENLIST1);/* INIT LIST     @YM08194*/ 06598000
         L     @15,LENLIST1                                        2155 06599000
         BCTR  @15,0                                               2155 06600000
         EX    @15,@SM04585                                        2155 06601000
*   ADDRDATA=ADDR(DUMPDATA);                                       2156 06602000
         LA    @15,DUMPDATA                                        2156 06603000
         ST    @15,ADDRDATA                                        2156 06604000
*   GEN(SDUMP MF=(E,DUMPLIST));                                    2157 06605000
         SDUMP MF=(E,DUMPLIST)                                          06606000
*   GENERATE DATA DEFS(DUMPLIST);                                  2158 06607000
*   GENERATE DATA DEFS(DLIST1,LENLIST1);                           2159 06608000
*   R14=SAVE14;                     /* RESTORE R14 FROM MACROS       */ 06609000
         L     R14,SAVE14                                          2160 06610000
*   IF NOSDWA=ON THEN               /* IF NO SDWA WAS GOTTEN,SETUP 2161 06611000
*                                      RETURN                @YM08607*/ 06612000
         TM    NOSDWA,B'10000000'                                  2161 06613000
         BNO   @RF02161                                            2161 06614000
*     DO;                                                          2162 06615000
*       R0=ADDR(CANPROC);           /* SETUP RETRY ADDRESS           */ 06616000
         LA    R0,CANPROC                                          2163 06617000
*       R15=4;                      /* SIGNAL RETRY                  */ 06618000
         LA    R15,4                                               2164 06619000
*       GEN( BR 14);                /* RETURN TO RTM                 */ 06620000
          BR 14                                                         06621000
*     END;                                                         2166 06622000
*   R1=SAVEONE;                     /* R1 DESTROYED BY WTO   @YM08127*/ 06623000
@RF02161 L     R1,SAVEONE                                          2167 06624000
*   DO;                             /* SETRP RETADDR(CANPROC)RC(4)FRE   06625000
*                                      SDWA(YES)DUMP(NO)RECORD(YES)RE   06626000
*                                      TREGS(YES)                    */ 06627000
*     RESPECIFY                                                    2169 06628000
*      (GPR00P,                                                    2169 06629000
*       GPR01P,                                                    2169 06630000
*       GPR14P,                                                    2169 06631000
*       GPR15P) RSTD;                                              2169 06632000
*     GPR01P->SDWARCDE=4;           /* STORE RC INTO SDWA            */ 06633000
         MVI   SDWARCDE(GPR01P),X'04'                              2170 06634000
*     GPR01P->SDWARTYA=ADDR(CANPROC);/* SAVE RETRY ADDRESS           */ 06635000
         LA    @12,CANPROC                                         2171 06636000
         ST    @12,SDWARTYA(,GPR01P)                               2171 06637000
*     GPR01P->SDWAFREE='1'B;        /* SET FLAG TO FREE SDWA         */ 06638000
*     GPR01P->SDWARCRD='1'B;        /* TURN ON RECORD INDICATOR      */ 06639000
         OI    SDWAFREE(GPR01P),B'10000100'                        2173 06640000
*     GPR01P->SDWAREQ='0'B;         /* TURN OFF DUMP INDICATOR       */ 06641000
         NI    SDWAREQ(GPR01P),B'01111111'                         2174 06642000
*     GPR01P->SDWAUPRG='1'B;        /* TURN ON RETREGS INDICATOR     */ 06643000
         OI    SDWAUPRG(GPR01P),B'00001000'                        2175 06644000
*     RESPECIFY                                                    2176 06645000
*      (GPR00P,                                                    2176 06646000
*       GPR01P,                                                    2176 06647000
*       GPR14P,                                                    2176 06648000
*       GPR15P) UNRSTD;                                            2176 06649000
*   END;                                                           2177 06650000
*   END STAEPROC;                                                  2178 06651000
@EL00034 DS    0H                                                  2178 06652000
@EF00034 DS    0H                                                  2178 06653000
@ER00034 BR    @14                                                 2178 06654000
*CANPROC:                                                          2179 06655000
*   PROC;                                                          2179 06656000
*                                                                  2179 06657000
CANPROC  STM   @14,@12,@SA00035                                    2179 06658000
*/***************************************************                */ 06659000
*/* CANPROC IS ENTERED TO ABNORMALLY EXIT FROM 609                   */ 06660000
*/*   IN THE FOLLOWING CASES:                                        */ 06661000
*/*   1) ERROR CONDITION DETECTED                                    */ 06662000
*/*   2) RESTARTING JOB WAS CANCELLED                                */ 06663000
*/*   3) RETRY EXIT FROM STAE                                        */ 06664000
*/***************************************************                */ 06665000
*                                                                  2180 06666000
*   DCL                                                            2180 06667000
*     CLOSPARM CHAR(4) DEFINED(ADOKECB);                           2180 06668000
*   DCL                                                            2181 06669000
*     CANP CHAR(4) CONSTANT('XXXX');                               2181 06670000
*   DCL                                                            2182 06671000
*     BADVOL CHAR(3) CONSTANT('238');                              2182 06672000
*   DCL                                                            2183 06673000
*     MSGSLOT CHAR(3) DEF(MSGAREA) POS(50);/*                @YM03484*/ 06674000
*   DCL                                                            2184 06675000
*     DYNMSG CHAR(3) CONSTANT('231');/*                      @YM03484*/ 06676000
*/* DO NOT DO NORMAL CANPROC PROCESSING IF THE ERROR WAS ON          */ 06677000
*/* DYNAMIC ALLOC OF THE CKPT DS, AS NO DCB WAS INITIALIZED          */ 06678000
*                                                                  2185 06679000
*   DO;                             /* MODESET SAVEKEY(SAVEKEYA)   2185 06680000
*                                      KEYADDR(ZEROPTR)              */ 06681000
*     RESPECIFY                                                    2186 06682000
*      (GPR02F) RESTRICTED;                                        2186 06683000
*     IPK;                          /* SAVE CURRENT PSW KEY          */ 06684000
         IPK                                                       2187 06685000
*     SAVEKEYA=GPR02F;                                             2188 06686000
         STC   GPR02F,SAVEKEYA                                     2188 06687000
*     SPKA(ZEROPTR);                /* SET PSW KEY                   */ 06688000
         SLR   @12,@12                                             2189 06689000
         SPKA  0(@12)                                              2189 06690000
*     RESPECIFY                                                    2190 06691000
*      (GPR02F) UNRESTRICTED;                                      2190 06692000
*   END;                            /* MODESET SAVEKEY(SAVEKEYA)   2191 06693000
*                                      KEYADDR(ZEROPTR) KEY = 0      */ 06694000
*   DCBREG=ADDR(DCBCKPT);           /* INIT DCB POINTER              */ 06695000
         LA    DCBREG,DCBCKPT                                      2192 06696000
*   IF(MSGSLOT^=DYNMSG&MSGSLOT^=BADVOL/*                     @YM06575*/ 06697000
*       &GOODOPEN=ON                /* DONT DETACH IF NOT OPEN       */ 06698000
*       &STAENTR^=ON) THEN          /*                       @YM08127*/ 06699000
         CLC   MSGSLOT(3),@CC04304                                 2193 06700000
         BE    @RF02193                                            2193 06701000
         CLC   MSGSLOT(3),@CC04320                                 2193 06702000
         BE    @RF02193                                            2193 06703000
         TM    GOODOPEN,B'00010000'                                2193 06704000
         BNO   @RF02193                                            2193 06705000
         TM    STAENTR,B'10000000'                                 2193 06706000
         BO    @RF02193                                            2193 06707000
*     DO;                           /*                       @YM03484*/ 06708000
*       CLOSPARM=CANP;              /* TELL 610 TO CLOSE WITHOUT   2195 06709000
*                                      REREAD                @YM08125*/ 06710000
         MVC   CLOSPARM(4),@CC04467                                2195 06711000
*       SAVEJSCB=JSCBACT;           /* PRESERVE PP JSCBACT           */ 06712000
         L     @12,TCBPTR                                          2196 06713000
         L     @12,TCBJSCB(,@12)                                   2196 06714000
         L     @12,JSCBACT(,@12)                                   2196 06715000
         ST    @12,SAVEJSCB                                        2196 06716000
*       JSCBACT=TCBJSCB;            /* CLOSE NEEDS INITS JSCB        */ 06717000
         L     @12,TCBPTR                                          2197 06718000
         L     @12,TCBJSCB(,@12)                                   2197 06719000
         ST    @12,JSCBACT(,@12)                                   2197 06720000
*       HIBITC1=ON;                 /* PREPARE TO WAIT FOR CLOSE     */ 06721000
         OI    HIBITC1,B'10000000'                                 2198 06722000
*       DO;                         /* POST (ECB610)                 */ 06723000
*         RESPECIFY                                                2200 06724000
*          (GPR00F,                                                2200 06725000
*           GPR01P) RESTRICTED;                                    2200 06726000
*         GPR00F=0;                 /* POST CODE IN R0               */ 06727000
         SLR   GPR00F,GPR00F                                       2201 06728000
*         GPR01P=ADDR(ECB610);      /* ECB ADDRESS                   */ 06729000
         LA    GPR01P,ECB610                                       2202 06730000
*         SVC(2);                   /* ISSUE POST SVC                */ 06731000
         SVC   2                                                   2203 06732000
*         RESPECIFY                                                2204 06733000
*          (GPR00F,                                                2204 06734000
*           GPR01P) UNRESTRICTED;                                  2204 06735000
*       END;                        /* POST (ECB610) LET 610 GO AWAY    06736000
*                                      GRACEFULLY                    */ 06737000
*       DO;                         /* WAIT ECBLIST(ADECBC1)         */ 06738000
*         RESPECIFY                                                2207 06739000
*          (GPR00P,                                                2207 06740000
*           GPR01P) RESTRICTED;                                    2207 06741000
*         GPR00P=1;                 /* LOAD WAIT COUNT               */ 06742000
         LA    GPR00P,1                                            2208 06743000
*         GPR01P=-ADDR(ADECBC1);    /* ADDRESS OF LIST OF ECB'S      */ 06744000
         LA    GPR01P,ADECBC1                                      2209 06745000
         LCR   GPR01P,GPR01P                                       2209 06746000
*         SVC(1);                   /* WAIT SVC                      */ 06747000
         SVC   1                                                   2210 06748000
*         RESPECIFY                                                2211 06749000
*          (GPR00P,                                                2211 06750000
*           GPR01P) UNRESTRICTED;                                  2211 06751000
*       END;                        /* WAIT ECBLIST(ADECBC1)         */ 06752000
*/* LINE DELETED FOR PTM                     @YM08183                */ 06753000
*                                                                  2213 06754000
*     END;                          /* DETACH DAUGHTER       @ZA06240*/ 06755000
*   IF TCBLTC^=ZEROPTR THEN         /* TASK IF ONE EXISTS    @ZA06240*/ 06756000
@RF02193 L     @12,TCBPTR                                          2214 06757000
         L     @12,TCBLTC(,@12)                                    2214 06758000
         LTR   @12,@12                                             2214 06759000
         BZ    @RF02214                                            2214 06760000
*     DO;                           /* DETACH (SAVETCB)              */ 06761000
*       RESPECIFY                                                  2216 06762000
*        (GPR01P) RESTRICTED;                                      2216 06763000
*       GPR01P=ADDR(SAVETCB);       /* TCB ADDRESS                   */ 06764000
         LA    GPR01P,SAVETCB                                      2217 06765000
*       SVC(62);                    /* DETACH SVC                    */ 06766000
         SVC   62                                                  2218 06767000
*       RESPECIFY                                                  2219 06768000
*        (GPR01P) UNRESTRICTED;                                    2219 06769000
*     END;                          /* DETACH (SAVETCB)              */ 06770000
*   JSCBACT=SAVEJSCB;               /* RESTORE P/P JSCB              */ 06771000
@RF02214 L     @12,TCBPTR                                          2221 06772000
         L     @12,TCBJSCB(,@12)                                   2221 06773000
         L     @11,SAVEJSCB                                        2221 06774000
         ST    @11,JSCBACT(,@12)                                   2221 06775000
*   IF ALOCPARM=ON THEN             /* DONT GO TO FREECHEK IF DYN  2222 06776000
*                                      LIST NEVER INITIALIZED      2222 06777000
*                                                            @YM30475*/ 06778000
         TM    ALOCPARM,B'10000000'                                2222 06779000
         BNO   @RF02222                                            2222 06780000
*     CALL FREECHEK;                /* GO DYNAMICALLY UNALLOCATE THE */ 06781000
*                                                                  2223 06782000
         BAL   @14,FREECHEK                                        2223 06783000
*   /*****************************************************************/ 06784000
*   /*                                                               */ 06785000
*   /* THE SYSCHK DD TO REMOVE IT FROM INITS TIOT            @YM03546*/ 06786000
*   /*                                                       @YM08157*/ 06787000
*   /*                                                               */ 06788000
*   /*****************************************************************/ 06789000
*                                                                  2224 06790000
*   ELSE                            /* ELSE                  @YM30475*/ 06791000
*     DO;                           /*                       @YM30475*/ 06792000
         B     @RC02222                                            2224 06793000
@RF02222 DS    0H                                                  2225 06794000
*       SAVEJSCB=JSCBACT;           /* SAVE ACTIVE JSCB      @YM30475*/ 06795000
         L     @12,TCBPTR                                          2225 06796000
         L     @12,TCBJSCB(,@12)                                   2225 06797000
         L     @12,JSCBACT(,@12)                                   2225 06798000
         ST    @12,SAVEJSCB                                        2225 06799000
*       JSCBACT=TCBJSCB;            /* USE INIT JSCB         @YM30475*/ 06800000
         L     @12,TCBPTR                                          2226 06801000
         L     @12,TCBJSCB(,@12)                                   2226 06802000
         ST    @12,JSCBACT(,@12)                                   2226 06803000
*       CALL UNALOCAT;              /* FREE CATALOGS         @YM30475*/ 06804000
         BAL   @14,UNALOCAT                                        2227 06805000
*       JSCBACT=SAVEJSCB;           /* RESTORE JSCB PTR      @YM30475*/ 06806000
         L     @12,TCBPTR                                          2228 06807000
         L     @12,TCBJSCB(,@12)                                   2228 06808000
         L     @11,SAVEJSCB                                        2228 06809000
         ST    @11,JSCBACT(,@12)                                   2228 06810000
*     END;                          /*                       @YM30475*/ 06811000
*   GEN REFS(STAELIST);                                            2230 06812000
@RC02222 DS    0H                                                  2230 06813000
   ESTAE 0,MF=(E,STAELIST)                                              06814000
*   DO;                             /* MODESET EXTKEY(SCHED)         */ 06815000
*     SPKA(16);                     /* SET PSW KEY                   */ 06816000
         LA    @12,16                                              2232 06817000
         SPKA  0(@12)                                              2232 06818000
*   END;                            /* MODESET EXTKEY(SCHED) KEY BACK   06819000
*                                      TO SCHED                      */ 06820000
*   GENERATE;                                                      2234 06821000
     IC @02,CALLKEY           PICK UP CALLERS KEY                       06822000
     L 13,@SA00001+4        PICK UP ORIGINAL REG 13                     06823000
     L @00,@SIZDATD             PICK UP SIZE TO FREE                    06824000
     LR @01,@03                 PICK UP AREA ADDR TO FREE               06825000
     FREEMAIN R,LV=(0),A=(1)                                            06826000
     MODESET KEYADDR=(2)      DONT BLOW IB605S MIND                     06827000
     LM 14,12,12(13)        RELOAD INITIATORS REGS                      06828000
     LA 15,36               RETURN CODE = 36                            06829000
     BR 14                  RETURN TO INIT                              06830000
*   END CANPROC;                                                   2235 06831000
@EL00035 DS    0H                                                  2235 06832000
@EF00035 DS    0H                                                  2235 06833000
@ER00035 LM    @14,@12,@SA00035                                    2235 06834000
         BR    @14                                                 2235 06835000
*BITSOFF:                                                          2236 06836000
*   PROC;                                                          2236 06837000
*                                                                  2236 06838000
BITSOFF  STM   @14,@12,12(@13)                                     2236 06839000
*/*************************************************************      */ 06840000
*/* THIS PROC MAKES DECISIONS CONCERNING WHAT BITS IN THE            */ 06841000
*/* RESTORED SIOT UNIT TYPE FIELD MUST BE TURNED OFF TO LET THE      */ 06842000
*/* SIOTUTYP AND THE EDTTAB MATCH FOR ALLOCATION PURPOSES            */ 06843000
*/*************************************************************      */ 06844000
*                                                                  2237 06845000
*   IF SIO3DACC=ON THEN                                            2237 06846000
         L     @12,SIOTPTR                                         2237 06847000
         TM    SIO3DACC(@12),B'00100000'                           2237 06848000
         BNO   @RF02237                                            2237 06849000
*     DO;                                                          2238 06850000
*       SIOUBYT2=SIOUBYT2&SHPOWOFF;                                2239 06851000
         NI    SIOUBYT2(@12),X'DC'                                 2239 06852000
*       IF SIOUBYT4=DA3340 THEN                                    2240 06853000
         CLI   SIOUBYT4(@12),X'0A'                                 2240 06854000
         BNE   @RF02240                                            2240 06855000
*         SIOUBYT2=SIOUBYT2&RPSOFF;                                2241 06856000
         NI    SIOUBYT2(@12),X'EF'                                 2241 06857000
*     END;                                                         2242 06858000
@RF02240 DS    0H                                                  2243 06859000
*   IF SIO3TAPE=ON THEN                                            2243 06860000
@RF02237 L     @12,SIOTPTR                                         2243 06861000
         TM    SIO3TAPE(@12),B'10000000'                           2243 06862000
         BNO   @RF02243                                            2243 06863000
*     SIOUBYT2=SIOUBYT2&OPTIONS;    /* OPTIONS BITS OFF      @ZA04104*/ 06864000
         NI    SIOUBYT2(@12),X'F4'                                 2244 06865000
*   IF SIO3UREC=ON THEN                                            2245 06866000
@RF02243 L     @12,SIOTPTR                                         2245 06867000
         TM    SIO3UREC(@12),B'00001000'                           2245 06868000
         BNO   @RF02245                                            2245 06869000
*     IF SIOUBYT4^=UR3211 THEN                                     2246 06870000
         CLI   SIOUBYT4(@12),X'09'                                 2246 06871000
         BE    @RF02246                                            2246 06872000
*       SIOUBYT2=OPTSOFF;                                          2247 06873000
         MVI   SIOUBYT2(@12),X'00'                                 2247 06874000
*     ELSE                                                         2248 06875000
*       SIOUBYT2=SIOUBYT2&UCSOPMSK;                                2248 06876000
         B     @RC02246                                            2248 06877000
@RF02246 L     @12,SIOTPTR                                         2248 06878000
         NI    SIOUBYT2(@12),X'80'                                 2248 06879000
*   IF SIO3DISP=ON THEN                                            2249 06880000
@RC02246 DS    0H                                                  2249 06881000
@RF02245 L     @12,SIOTPTR                                         2249 06882000
         TM    SIO3DISP(@12),B'00010000'                           2249 06883000
         BNO   @RF02249                                            2249 06884000
*     SIOUBYT2=OPTSOFF;                                            2250 06885000
         MVI   SIOUBYT2(@12),X'00'                                 2250 06886000
*   END BITSOFF;                                                   2251 06887000
@EL00036 DS    0H                                                  2251 06888000
@EF00036 DS    0H                                                  2251 06889000
@ER00036 LM    @14,@12,12(@13)                                     2251 06890000
         BR    @14                                                 2251 06891000
*FREEEPA:                                                          2252 06892000
*   PROC;                                                          2252 06893000
FREEEPA  STM   @14,@12,@SA00037                                    2252 06894000
*   DCL                                                            2253 06895000
*     HEX10 BIT(16) CONSTANT('0010'X);                             2253 06896000
*   DCL                                                            2254 06897000
*     FREELEN FIXED(15);                                           2254 06898000
*   DCL                                                            2255 06899000
*     FREEAREA BASED(SWCHNPTR);                                    2255 06900000
*   IF SWCHNPTR^=0 THEN             /* IF AREA EXIST, FREE IT      2256 06901000
*                                                            @YM08161*/ 06902000
         L     @12,SWEPAPTR                                        2256 06903000
         L     @12,SWCHNPTR(,@12)                                  2256 06904000
         LTR   @12,@12                                             2256 06905000
         BZ    @RF02256                                            2256 06906000
*     DO;                                                          2257 06907000
*       FREELEN=HEX10;                                             2258 06908000
         LA    @12,16                                              2258 06909000
         STH   @12,FREELEN                                         2258 06910000
*       DO;                         /* FREEMAIN(R)                 2259 06911000
*                                      LV(FREELEN)SP(230)A(FREEAREA) */ 06912000
*         RESPECIFY                                                2260 06913000
*          (GPR01F,                                                2260 06914000
*           GPR00F) RESTRICTED;                                    2260 06915000
*         GPR00F=FREELEN;           /* LENGTH REQUESTED              */ 06916000
         LR    GPR00F,@12                                          2261 06917000
*         GPR01F=230;               /* SP IN REG 1                   */ 06918000
         LA    GPR01F,230                                          2262 06919000
*         GEN(SLL   GPR01F,24)                                     2263 06920000
*         NODEFS NOREFS NOSETS NOEXIT NOFLOWS SEQFLOW;             2263 06921000
         SLL   GPR01F,24                                                06922000
*         GPR00F=GPR00F|GPR01F;     /* SP IN HI BYTE                 */ 06923000
         OR    GPR00F,GPR01F                                       2264 06924000
*         GPR01F=ADDR(FREEAREA);    /* SET REGISTER ONE              */ 06925000
         L     @12,SWEPAPTR                                        2265 06926000
         L     GPR01F,SWCHNPTR(,@12)                               2265 06927000
*         SVC(10);                  /* R-FORM OF GETMAIN             */ 06928000
         SVC   10                                                  2266 06929000
*         RESPECIFY                                                2267 06930000
*          (GPR01F,                                                2267 06931000
*           GPR00F) UNRESTRICTED;                                  2267 06932000
*       END;                        /* FREEMAIN(R)                 2268 06933000
*                                      LV(FREELEN)SP(230)A(FREEAREA) */ 06934000
*       SWCHNPTR=ZEROPTR;                                          2269 06935000
         L     @12,SWEPAPTR                                        2269 06936000
         SLR   @11,@11                                             2269 06937000
         ST    @11,SWCHNPTR(,@12)                                  2269 06938000
*     END;                                                         2270 06939000
*   END FREEEPA;                                                   2271 06940000
@EL00037 DS    0H                                                  2271 06941000
@EF00037 DS    0H                                                  2271 06942000
@ER00037 LM    @14,@12,@SA00037                                    2271 06943000
         BR    @14                                                 2271 06944000
*REMDSNQ:                                                          2272 06945000
*   PROC;                                                          2272 06946000
*                                                                  2272 06947000
REMDSNQ  STM   @14,@12,@SA00038                                    2272 06948000
*/****************************************************************   */ 06949000
*/* THIS PROCEDURE PERFORMS A DELETE FROM THE DSENQ TABLE FOR        */ 06950000
*/* WHATEVER DSNAME THE CALLER PLACES IN DSN                         */ 06951000
*/****************************************************************   */ 06952000
*                                                                  2273 06953000
*   BITMAP=''B;                     /* INIT FUNCTION MAP             */ 06954000
         XC    BITMAP(2),BITMAP                                    2273 06955000
*   DELEONLY=ON;                    /* FUNC. FLAG = DELETE NO DEQ    */ 06956000
         OI    DELEONLY,B'00010000'                                2274 06957000
*   DO;                             /* LINK EP('IEFAB4DC') PARAM(BITM   06958000
*                                      AP,PASSJCT,PASSDSNM,PASSEPA,PA   06959000
*                                      SSTCB,STEPNO,PAD1,PAD2,RETPARM   06960000
*                                      )                             */ 06961000
*     I00601='00'X;                 /* EP/DE FLAG                    */ 06962000
         MVI   I00601,X'00'                                        2276 06963000
*     I00602=ADDR('IEFAB4DC');      /* ADDR OF EP/DE                 */ 06964000
         LA    @12,@CC04253                                        2277 06965000
         STCM  @12,7,I00602                                        2277 06966000
*     I00604=0;                     /* DCB PTR                       */ 06967000
         SLR   @12,@12                                             2278 06968000
         STCM  @12,7,I00604                                        2278 06969000
*     I00603='00'X;                 /* ERRET FLAG                    */ 06970000
         MVI   I00603,X'00'                                        2279 06971000
*     IOPTLIST(1)=ADDR(BITMAP);     /* ADDR OF PROB PROG PARM        */ 06972000
         LA    @12,BITMAP                                          2280 06973000
         ST    @12,IOPTLIST                                        2280 06974000
*     IOPTLIST(2)=ADDR(PASSJCT);    /* ADDR OF PROB PROG PARM        */ 06975000
         LA    @12,PASSJCT                                         2281 06976000
         ST    @12,IOPTLIST+4                                      2281 06977000
*     IOPTLIST(3)=ADDR(PASSDSNM);   /* ADDR OF PROB PROG PARM        */ 06978000
         LA    @12,PASSDSNM                                        2282 06979000
         ST    @12,IOPTLIST+8                                      2282 06980000
*     IOPTLIST(4)=ADDR(PASSEPA);    /* ADDR OF PROB PROG PARM        */ 06981000
         LA    @12,PASSEPA                                         2283 06982000
         ST    @12,IOPTLIST+12                                     2283 06983000
*     IOPTLIST(5)=ADDR(PASSTCB);    /* ADDR OF PROB PROG PARM        */ 06984000
         LA    @12,PASSTCB                                         2284 06985000
         ST    @12,IOPTLIST+16                                     2284 06986000
*     IOPTLIST(6)=ADDR(STEPNO);     /* ADDR OF PROB PROG PARM        */ 06987000
         LA    @12,STEPNO                                          2285 06988000
         ST    @12,IOPTLIST+20                                     2285 06989000
*     IOPTLIST(7)=ADDR(PAD1);       /* ADDR OF PROB PROG PARM        */ 06990000
         LA    @12,PAD1                                            2286 06991000
         ST    @12,IOPTLIST+24                                     2286 06992000
*     IOPTLIST(8)=ADDR(PAD2);       /* ADDR OF PROB PROG PARM        */ 06993000
         LA    @12,PAD2                                            2287 06994000
         ST    @12,IOPTLIST+28                                     2287 06995000
*     IOPTLIST(9)=ADDR(RETPARM);    /* ADDR OF PROB PROG PARM        */ 06996000
         LA    @12,RETPARM                                         2288 06997000
         ST    @12,IOPTLIST+32                                     2288 06998000
*     IOPTLIST(9)=IOPTLIST(9)|'80000000'X;/* SET VL BIT              */ 06999000
         O     @12,@CF04255                                        2289 07000000
         ST    @12,IOPTLIST+32                                     2289 07001000
*     RESPECIFY                                                    2290 07002000
*      (GPR01P) RESTRICTED;                                        2290 07003000
*     GPR01P=ADDR(IOPTLIST);        /* ADDR OF OPTLIST               */ 07004000
         LA    GPR01P,IOPTLIST                                     2291 07005000
*     RESPECIFY                                                    2292 07006000
*      (GPR15P) RESTRICTED;                                        2292 07007000
*     GPR15P=ADDR(I006);            /* ADDR OF LINK LIST             */ 07008000
         LA    GPR15P,I006                                         2293 07009000
*     SVC(6);                       /* ISSUE LINK SVC                */ 07010000
         SVC   6                                                   2294 07011000
*     RESPECIFY                                                    2295 07012000
*      (GPR01P) UNRESTRICTED;                                      2295 07013000
*     RESPECIFY                                                    2296 07014000
*      (GPR15P) UNRESTRICTED;                                      2296 07015000
*   END;                            /* LINK EP('IEFAB4DC') PARAM(BITM   07016000
*                                      AP,PASSJCT,PASSDSNM,PASSEPA,PA   07017000
*                                      SSTCB,STEPNO,PAD1,PAD2,RETPARM   07018000
*                                      )                             */ 07019000
*   CALL FREEEPA;                   /* GET RID OF EXTRA EPA          */ 07020000
         BAL   @14,FREEEPA                                         2298 07021000
*   END REMDSNQ;                                                   2299 07022000
@EL00038 DS    0H                                                  2299 07023000
@EF00038 DS    0H                                                  2299 07024000
@ER00038 LM    @14,@12,@SA00038                                    2299 07025000
         BR    @14                                                 2299 07026000
*ADDDSNQ:                                                          2300 07027000
*   PROC;                                                          2300 07028000
*                                                                  2300 07029000
ADDDSNQ  STM   @14,@12,@SA00039                                    2300 07030000
*/***************************************************************    */ 07031000
*/* THIS PROC ADDS THE DSN PASSED IN 'DSN' TO THE DSENQ TABLE        */ 07032000
*/***************************************************************    */ 07033000
*                                                                  2301 07034000
*   BITMAP=''B;                     /* INIT FUNCTION MAP             */ 07035000
         XC    BITMAP(2),BITMAP                                    2301 07036000
*   ADCHONLY=ON;                    /* FUNC. FLAG = ADD - NO ENQ     */ 07037000
         OI    ADCHONLY,B'01000000'                                2302 07038000
*   IF SHAREBIT=ON THEN             /* USER SAVED JFCBIND2   @ZA07018*/ 07039000
         TM    SHAREBIT,B'00001000'                                2303 07040000
         BNO   @RF02303                                            2303 07041000
*     ENQSHR=ON;                    /* TELL DSENQ TO USE SHARE       */ 07042000
         OI    ENQSHR,B'00000010'                                  2304 07043000
*   ELSE                                                           2305 07044000
*     ENQEXCL=ON;                   /* OTHERS GET EXCLUSIVE USE      */ 07045000
         B     @RC02303                                            2305 07046000
@RF02303 OI    ENQEXCL,B'00000001'                                 2305 07047000
*   DO;                             /* LINK EP('IEFAB4DC') PARAM(BITM   07048000
*                                      AP,PASSJCT,PASSDSNM,PASSEPA,PA   07049000
*                                      SSTCB,STEPNO,PAD1,PAD2,RETPARM   07050000
*                                      )                             */ 07051000
@RC02303 DS    0H                                                  2307 07052000
*     I00601='00'X;                 /* EP/DE FLAG                    */ 07053000
         MVI   I00601,X'00'                                        2307 07054000
*     I00602=ADDR('IEFAB4DC');      /* ADDR OF EP/DE                 */ 07055000
         LA    @12,@CC04253                                        2308 07056000
         STCM  @12,7,I00602                                        2308 07057000
*     I00604=0;                     /* DCB PTR                       */ 07058000
         SLR   @12,@12                                             2309 07059000
         STCM  @12,7,I00604                                        2309 07060000
*     I00603='00'X;                 /* ERRET FLAG                    */ 07061000
         MVI   I00603,X'00'                                        2310 07062000
*     IOPTLIST(1)=ADDR(BITMAP);     /* ADDR OF PROB PROG PARM        */ 07063000
         LA    @12,BITMAP                                          2311 07064000
         ST    @12,IOPTLIST                                        2311 07065000
*     IOPTLIST(2)=ADDR(PASSJCT);    /* ADDR OF PROB PROG PARM        */ 07066000
         LA    @12,PASSJCT                                         2312 07067000
         ST    @12,IOPTLIST+4                                      2312 07068000
*     IOPTLIST(3)=ADDR(PASSDSNM);   /* ADDR OF PROB PROG PARM        */ 07069000
         LA    @12,PASSDSNM                                        2313 07070000
         ST    @12,IOPTLIST+8                                      2313 07071000
*     IOPTLIST(4)=ADDR(PASSEPA);    /* ADDR OF PROB PROG PARM        */ 07072000
         LA    @12,PASSEPA                                         2314 07073000
         ST    @12,IOPTLIST+12                                     2314 07074000
*     IOPTLIST(5)=ADDR(PASSTCB);    /* ADDR OF PROB PROG PARM        */ 07075000
         LA    @12,PASSTCB                                         2315 07076000
         ST    @12,IOPTLIST+16                                     2315 07077000
*     IOPTLIST(6)=ADDR(STEPNO);     /* ADDR OF PROB PROG PARM        */ 07078000
         LA    @12,STEPNO                                          2316 07079000
         ST    @12,IOPTLIST+20                                     2316 07080000
*     IOPTLIST(7)=ADDR(PAD1);       /* ADDR OF PROB PROG PARM        */ 07081000
         LA    @12,PAD1                                            2317 07082000
         ST    @12,IOPTLIST+24                                     2317 07083000
*     IOPTLIST(8)=ADDR(PAD2);       /* ADDR OF PROB PROG PARM        */ 07084000
         LA    @12,PAD2                                            2318 07085000
         ST    @12,IOPTLIST+28                                     2318 07086000
*     IOPTLIST(9)=ADDR(RETPARM);    /* ADDR OF PROB PROG PARM        */ 07087000
         LA    @12,RETPARM                                         2319 07088000
         ST    @12,IOPTLIST+32                                     2319 07089000
*     IOPTLIST(9)=IOPTLIST(9)|'80000000'X;/* SET VL BIT              */ 07090000
         O     @12,@CF04255                                        2320 07091000
         ST    @12,IOPTLIST+32                                     2320 07092000
*     RESPECIFY                                                    2321 07093000
*      (GPR01P) RESTRICTED;                                        2321 07094000
*     GPR01P=ADDR(IOPTLIST);        /* ADDR OF OPTLIST               */ 07095000
         LA    GPR01P,IOPTLIST                                     2322 07096000
*     RESPECIFY                                                    2323 07097000
*      (GPR15P) RESTRICTED;                                        2323 07098000
*     GPR15P=ADDR(I006);            /* ADDR OF LINK LIST             */ 07099000
         LA    GPR15P,I006                                         2324 07100000
*     SVC(6);                       /* ISSUE LINK SVC                */ 07101000
         SVC   6                                                   2325 07102000
*     RESPECIFY                                                    2326 07103000
*      (GPR01P) UNRESTRICTED;                                      2326 07104000
*     RESPECIFY                                                    2327 07105000
*      (GPR15P) UNRESTRICTED;                                      2327 07106000
*   END;                            /* LINK EP('IEFAB4DC') PARAM(BITM   07107000
*                                      AP,PASSJCT,PASSDSNM,PASSEPA,PA   07108000
*                                      SSTCB,STEPNO,PAD1,PAD2,RETPARM   07109000
*                                      )                             */ 07110000
*   CALL FREEEPA;                   /* FREE EXTRA EPA                */ 07111000
         BAL   @14,FREEEPA                                         2329 07112000
*   END ADDDSNQ;                                                   2330 07113000
@EL00039 DS    0H                                                  2330 07114000
@EF00039 DS    0H                                                  2330 07115000
@ER00039 LM    @14,@12,@SA00039                                    2330 07116000
         BR    @14                                                 2330 07117000
*ALOCAT:                                                           2331 07118000
*   PROC;                           /*                       @YA00081*/ 07119000
ALOCAT   STM   @14,@12,@SA00040                                    2331 07120000
*/* THIS PROC WILL SET UP FOR UNALOCAT & ALLOCATE                    */ 07121000
*/* ALL CATALOGS ON THE JOB/STEPCAT CHAIN.                           */ 07122000
*                                                                  2332 07123000
*   DCL                                                            2332 07124000
*     SAVEPCCB PTR(31) ABNL;        /* HOLDER FOR PCCB -> ON ENTRY   */ 07125000
*   DCL                                                            2333 07126000
*     TTRPCAT PTR(24) DEFINED(SCTPCAT) BDY(BYTE);/* GET NUMERIC VALUE*/ 07127000
*   DCL                                                            2334 07128000
*     SIOTCAT PTR(24) BDY(WORD);    /* SVA OF PVT CAT SIOT           */ 07129000
*   DCL                                                            2335 07130000
*     CATCT FIXED(15) DEFINED(SCTCATCT) BDY(BYTE);/* GET NUMERIC VALU*/ 07131000
*   DCL                                                            2336 07132000
*     COUNT FIXED(15);              /* NUMBER OF PVT CATS            */ 07133000
*   DCL                                                            2337 07134000
*     1 LIST4F5 CHAR(20),           /* PARM LIST FOR IEFAB4F5        */ 07135000
*      2 RTINFOP PTR(31),           /* PTR TO R.C. AREA              */ 07136000
*      2 JSCBPTRP PTR(31),          /* PTR TO JSCB (INIT)            */ 07137000
*      2 CTGDSNP PTR(31),           /* PTR TO CAT NAME               */ 07138000
*      2 CTGCONP PTR(31),           /* NOT USED                      */ 07139000
*      2 DDNAME PTR(31);            /* NOT USED                      */ 07140000
*   DCL                                                            2338 07141000
*     RCAREA FIXED(31);             /* WORD FOR RETURN CODE          */ 07142000
*   DCL                                                            2339 07143000
*     CTGDSN CHAR(44);              /* HOLDER FOR DSN                */ 07144000
*   DCL                                                            2340 07145000
*     SIOTCPTR PTR(31);             /* IN CORE SIOT CAT PTR          */ 07146000
*   DCL                                                            2341 07147000
*     JFCBCPTR PTR(31);             /* IN CORE JFCB CAT PTR          */ 07148000
*   DO;                             /* MODESET SAVEKEY(SAVEKEYA)   2342 07149000
*                                      KEYADDR(ZEROPTR)              */ 07150000
*     RESPECIFY                                                    2343 07151000
*      (GPR02F) RESTRICTED;                                        2343 07152000
*     IPK;                          /* SAVE CURRENT PSW KEY          */ 07153000
         IPK                                                       2344 07154000
*     SAVEKEYA=GPR02F;                                             2345 07155000
         STC   GPR02F,SAVEKEYA                                     2345 07156000
*     SPKA(ZEROPTR);                /* SET PSW KEY                   */ 07157000
         SLR   @12,@12                                             2346 07158000
         SPKA  0(@12)                                              2346 07159000
*     RESPECIFY                                                    2347 07160000
*      (GPR02F) UNRESTRICTED;                                      2347 07161000
*   END;                            /* MODESET SAVEKEY(SAVEKEYA)   2348 07162000
*                                      KEYADDR(ZEROPTR)              */ 07163000
*   SAVEJSCB=TCBJSCB->JSCBACT;      /* SAVE OLD ACTIVE               */ 07164000
         L     @12,TCBPTR                                          2349 07165000
         L     @12,TCBJSCB(,@12)                                   2349 07166000
         L     @12,JSCBACT(,@12)                                   2349 07167000
         ST    @12,SAVEJSCB                                        2349 07168000
*   TCBJSCB->JSCBACT=TCBJSCB;       /* USE INIT JSCB AS ACTIVE       */ 07169000
         L     @12,TCBPTR                                          2350 07170000
         L     @12,TCBJSCB(,@12)                                   2350 07171000
         ST    @12,JSCBACT(,@12)                                   2350 07172000
*   QDBPTR=JSCDSABQ;                /* ADDRESSABILITY QDB            */ 07173000
         L     @11,JSCDSABQ(,@12)                                  2351 07174000
         ST    @11,QDBPTR                                          2351 07175000
*   LASTDSAB=QDBLELMP;              /* SAVE CURRENT LAST DSAB PTR    */ 07176000
         L     @11,QDBLELMP(,@11)                                  2352 07177000
         ST    @11,LASTDSAB                                        2352 07178000
*   SAVEPCCB=JSCBPCC;               /* SAVE OLD PCCB CHAIN           */ 07179000
         L     @12,JSCBPCC(,@12)                                   2353 07180000
         ST    @12,SAVEPCCB                                        2353 07181000
*   JSCBPCC=ZEROPTR;                /* CUT OFF OTHER PCCBS           */ 07182000
         SLR   @12,@12                                             2354 07183000
         L     @11,TCBPTR                                          2354 07184000
         L     @11,TCBJSCB(,@11)                                   2354 07185000
         ST    @12,JSCBPCC(,@11)                                   2354 07186000
*   IF SCTPCAT^=0 THEN              /* IF JOB/STEP CATS EXIST...     */ 07187000
         L     @09,SCTPTR                                          2355 07188000
         CL    @12,SCTPCAT(,@09)                                   2355 07189000
         BE    @RF02355                                            2355 07190000
*     DO;                           /* GO GET THEM ALLOC'D (DO/A)    */ 07191000
*       SIOTCAT=TTRPCAT;            /* PICK UP 1ST PVT CAT SVA       */ 07192000
         MVC   SIOTCAT(3),TTRPCAT(@09)                             2357 07193000
*       COUNT=CATCT;                /* PICK UP NUMBER OF CATS        */ 07194000
         LH    @09,CATCT(,@09)                                     2358 07195000
         STH   @09,COUNT                                           2358 07196000
*/* INITIALIZE FUNCTION MAP AS REQUIRED                              */ 07197000
*                                                                  2359 07198000
*       ACNODD=ON;                  /* CREATE NO DD                  */ 07199000
*       ACDVWAIT=NOTON;             /* NO WAIT FOR DEVICE            */ 07200000
*       ACRECOVR=NOTON;             /* DONT WAIT FOR UNIT            */ 07201000
*       ACOSCVOL=NOTON;             /* NO OS CVOL PROCESS            */ 07202000
*       ACVLWAIT=NOTON;             /* NO WAIT FOR VOLUMES           */ 07203000
*       ACOFLINE=ON;                /* CONSIDER OFFLINE DEVICES      */ 07204000
*       ACNOENQ=NOTON;              /* DONT ENQ ON TIOT              */ 07205000
*       ACNUJSCB=NOTON;             /* DONT CHANGE JSCB TO ACTIVE    */ 07206000
         OI    ACNODD,B'10000100'                                  2366 07207000
         NI    ACDVWAIT,B'10000100'                                2366 07208000
*       ACOK2MNT=ON;                /* MOUNT THE CATALOG             */ 07209000
*       ACSTPCAT=ON;                /* THIS IS STEP/JOBCAT           */ 07210000
*       ACALCTLG=ON;                /* ALLOCATE CATALOG              */ 07211000
*       ACOPNACB=ON;                /* HAVE CATALOG OPENED           */ 07212000
*       ACCCPCCB=ON;                /* INSURE PCCB BUILT             */ 07213000
*       ACRECOVD=NOTON;             /* NO CAT RECOVERY PROCESSING    */ 07214000
         OI    ACOK2MNT,B'11111000'                                2372 07215000
         NI    ACRECOVD,B'11111011'                                2372 07216000
*/* INITIALIZE IEFAB4F5 PARAMETER LIST                               */ 07217000
*                                                                  2373 07218000
*       RCAREA=0;                   /* INITIALIZE R.C. AREA          */ 07219000
         ST    @12,RCAREA                                          2373 07220000
*       RTINFOP=ADDR(RCAREA);       /* POINT TO IT                   */ 07221000
         LA    @09,RCAREA                                          2374 07222000
         STCM  @09,15,RTINFOP                                      2374 07223000
*       JSCBPTRP=TCBJSCB;           /* POINT TO INIT JSCB            */ 07224000
         STCM  @11,15,JSCBPTRP                                     2375 07225000
*       CTGDSNP=ADDR(CTGDSN);       /* POINT TO NAME HOLDER          */ 07226000
         LA    @11,CTGDSN                                          2376 07227000
         STCM  @11,15,CTGDSNP                                      2376 07228000
*       CTGCONP=0;                  /* INITIALIZE UNUSED             */ 07229000
         STCM  @12,15,CTGCONP                                      2377 07230000
*       DDNAME=0;                   /* INITIALIZE UNUSED             */ 07231000
         STCM  @12,15,DDNAME                                       2378 07232000
*/* ALLOCATE THE CATALOGS                                            */ 07233000
*                                                                  2379 07234000
*       DO WHILE COUNT>0;           /* LOOP THRU ALL CATS (DO/B)     */ 07235000
         B     @DE02379                                            2379 07236000
@DL02379 DS    0H                                                  2380 07237000
*         SWVA=SIOTCAT;             /* INPUT TO SWA MGR              */ 07238000
         L     @12,SWEPAPTR                                        2380 07239000
         MVC   SWVA(3,@12),SIOTCAT                                 2380 07240000
*         CALL READSWA;             /* READ SIOT                     */ 07241000
         BAL   @14,READSWA                                         2381 07242000
*         SIOTCPTR=SWBLKPTR;        /* ADDRESSABILITY                */ 07243000
         L     @12,SWEPAPTR                                        2382 07244000
         L     @11,SWBLKPTR(,@12)                                  2382 07245000
         ST    @11,SIOTCPTR                                        2382 07246000
*         SWVA=SIOTCPTR->SCTPJFCB;  /* INPUT SWA MGR                 */ 07247000
         MVC   SWVA(3,@12),SCTPJFCB(@11)                           2383 07248000
*         CALL READSWA;             /* READ JFCB                     */ 07249000
         BAL   @14,READSWA                                         2384 07250000
*         JFCBCPTR=SWBLKPTR;        /* ADDRESSABILITY                */ 07251000
         L     @12,SWEPAPTR                                        2385 07252000
         L     @12,SWBLKPTR(,@12)                                  2385 07253000
         ST    @12,JFCBCPTR                                        2385 07254000
*         CTGDSN=JFCBCPTR->JFCBDSNM;/* DSN TO PARM LIST              */ 07255000
         MVC   CTGDSN(44),JFCBDSNM(@12)                            2386 07256000
*         DO;                       /* LINK EP('IEFAB4F5') PARAM(ACCN   07257000
*                                      TRLS,RTINFOP,JSCBPTRP,CTGDSNP,   07258000
*                                      CTGCONP,DDNAME)               */ 07259000
*           I00601='00'X;           /* EP/DE FLAG                    */ 07260000
         MVI   I00601,X'00'                                        2388 07261000
*           I00602=ADDR('IEFAB4F5');/* ADDR OF EP/DE                 */ 07262000
         LA    @12,@CC04505                                        2389 07263000
         STCM  @12,7,I00602                                        2389 07264000
*           I00604=0;               /* DCB PTR                       */ 07265000
         SLR   @12,@12                                             2390 07266000
         STCM  @12,7,I00604                                        2390 07267000
*           I00603='00'X;           /* ERRET FLAG                    */ 07268000
         MVI   I00603,X'00'                                        2391 07269000
*           IOPTLIST(1)=ADDR(ACCNTRLS);/* ADDR OF PROB PROG PARM     */ 07270000
         LA    @12,ACCNTRLS                                        2392 07271000
         ST    @12,IOPTLIST                                        2392 07272000
*           IOPTLIST(2)=ADDR(RTINFOP);/* ADDR OF PROB PROG PARM      */ 07273000
         LA    @12,RTINFOP                                         2393 07274000
         ST    @12,IOPTLIST+4                                      2393 07275000
*           IOPTLIST(3)=ADDR(JSCBPTRP);/* ADDR OF PROB PROG PARM     */ 07276000
         LA    @12,JSCBPTRP                                        2394 07277000
         ST    @12,IOPTLIST+8                                      2394 07278000
*           IOPTLIST(4)=ADDR(CTGDSNP);/* ADDR OF PROB PROG PARM      */ 07279000
         LA    @12,CTGDSNP                                         2395 07280000
         ST    @12,IOPTLIST+12                                     2395 07281000
*           IOPTLIST(5)=ADDR(CTGCONP);/* ADDR OF PROB PROG PARM      */ 07282000
         LA    @12,CTGCONP                                         2396 07283000
         ST    @12,IOPTLIST+16                                     2396 07284000
*           IOPTLIST(6)=ADDR(DDNAME);/* ADDR OF PROB PROG PARM       */ 07285000
         LA    @12,DDNAME                                          2397 07286000
         ST    @12,IOPTLIST+20                                     2397 07287000
*           IOPTLIST(6)=IOPTLIST(6)|'80000000'X;/* SET VL BIT        */ 07288000
         O     @12,@CF04255                                        2398 07289000
         ST    @12,IOPTLIST+20                                     2398 07290000
*           RESPECIFY                                              2399 07291000
*            (GPR01P) RESTRICTED;                                  2399 07292000
*           GPR01P=ADDR(IOPTLIST);  /* ADDR OF OPTLIST               */ 07293000
         LA    GPR01P,IOPTLIST                                     2400 07294000
*           RESPECIFY                                              2401 07295000
*            (GPR15P) RESTRICTED;                                  2401 07296000
*           GPR15P=ADDR(I006);      /* ADDR OF LINK LIST             */ 07297000
         LA    GPR15P,I006                                         2402 07298000
*           SVC(6);                 /* ISSUE LINK SVC                */ 07299000
         SVC   6                                                   2403 07300000
*           RESPECIFY                                              2404 07301000
*            (GPR01P) UNRESTRICTED;                                2404 07302000
*           RESPECIFY                                              2405 07303000
*            (GPR15P) UNRESTRICTED;                                2405 07304000
*         END;                      /* LINK EP('IEFAB4F5') PARAM(ACCN   07305000
*                                      TRLS,RTINFOP,JSCBPTRP,CTGDSNP,   07306000
*                                      CTGCONP,DDNAME)               */ 07307000
*         IF RCAREA^=0 THEN                                        2407 07308000
         L     @12,RCAREA                                          2407 07309000
         LTR   @12,@12                                             2407 07310000
         BZ    @RF02407                                            2407 07311000
*           DO;                                                    2408 07312000
*             CALL UNALOCAT;        /* FREE ANY PRIVATE CATALOG    2409 07313000
*                                      ALREADY ALLOCATED     @YM30475*/ 07314000
         BAL   @14,UNALOCAT                                        2409 07315000
*             TCBJSCB->JSCBACT=SAVEJSCB;                           2410 07316000
         L     @12,TCBPTR                                          2410 07317000
         L     @12,TCBJSCB(,@12)                                   2410 07318000
         L     @11,SAVEJSCB                                        2410 07319000
         ST    @11,JSCBACT(,@12)                                   2410 07320000
*             DO;                   /* MODESET KEYADDR(SAVEKEYA)     */ 07321000
*               SPKA(SAVEKEYA);     /* SET PSW KEY                   */ 07322000
         SLR   @12,@12                                             2412 07323000
         IC    @12,SAVEKEYA                                        2412 07324000
         SPKA  0(@12)                                              2412 07325000
*             END;                  /* MODESET KEYADDR(SAVEKEYA)     */ 07326000
*             CALL ERROR238;        /* FAIL JOB IF ALLOC N.G.        */ 07327000
         BAL   @14,ERROR238                                        2414 07328000
*           END;                                                   2415 07329000
*         SIOTCAT=SIOTCPTR->SCTPSIOT;/* PICK UP NEXT SIOT PTR        */ 07330000
@RF02407 L     @12,SIOTCPTR                                        2416 07331000
         MVC   SIOTCAT(3),SCTPSIOT(@12)                            2416 07332000
*         COUNT=COUNT-1;            /* DECREMENT # CATS              */ 07333000
         LH    @12,COUNT                                           2417 07334000
         BCTR  @12,0                                               2417 07335000
         STH   @12,COUNT                                           2417 07336000
*       END;                        /* DO/B                          */ 07337000
@DE02379 LH    @12,COUNT                                           2418 07338000
         LTR   @12,@12                                             2418 07339000
         BP    @DL02379                                            2418 07340000
*     END;                          /* DO/A                          */ 07341000
*   TCBJSCB->JSCBACT=SAVEJSCB;      /* RESTORE P/P JSCB              */ 07342000
@RF02355 L     @12,TCBPTR                                          2420 07343000
         L     @12,TCBJSCB(,@12)                                   2420 07344000
         L     @11,SAVEJSCB                                        2420 07345000
         ST    @11,JSCBACT(,@12)                                   2420 07346000
*   DO;                             /* MODESET KEYADDR(SAVEKEYA)     */ 07347000
*     SPKA(SAVEKEYA);               /* SET PSW KEY                   */ 07348000
         SLR   @12,@12                                             2422 07349000
         IC    @12,SAVEKEYA                                        2422 07350000
         SPKA  0(@12)                                              2422 07351000
*   END;                            /* MODESET KEYADDR(SAVEKEYA)     */ 07352000
*   END ALOCAT;                                                    2424 07353000
@EL00040 DS    0H                                                  2424 07354000
@EF00040 DS    0H                                                  2424 07355000
@ER00040 LM    @14,@12,@SA00040                                    2424 07356000
         BR    @14                                                 2424 07357000
*UNALOCAT:                                                         2425 07358000
*   PROC;                           /*                       @YA00081*/ 07359000
UNALOCAT STM   @14,@12,@SA00041                                    2425 07360000
*/* THIS PROC WILL CALL IEFAB4F4 TO CLOSE AND FREE ANY               */ 07361000
*/* CATALOGS ALLOCATED FOR USE DURING IEFXB609.                      */ 07362000
*                                                                  2426 07363000
*   DCL                                                            2426 07364000
*     UNCATSW BIT(1);               /* SW FOR NON RECURSION          */ 07365000
*   DCL                                                            2427 07366000
*     WORKTODO BIT(1);              /* INTERNAL SW                   */ 07367000
*   DCL                                                            2428 07368000
*     1 LIST4F4 CHAR(20) DEFINED(LIST4F5),                         2428 07369000
*      2 RTCDPTR PTR(31),                                          2428 07370000
*      2 PCCBPTR PTR(31),                                          2428 07371000
*      2 DDNAMPTR PTR(31),                                         2428 07372000
*      2 ACBPTR PTR(31),                                           2428 07373000
*      2 JSCBP PTR(31);                                            2428 07374000
*   IF UNCATSW=NOTON THEN           /* IF NOT ENTERED BEFORE...      */ 07375000
         TM    UNCATSW,B'10000000'                                 2429 07376000
         BNZ   @RF02429                                            2429 07377000
*     DO;                           /* DO/A PROCESS CATALOGS, IF ANY */ 07378000
*       UNCATSW=ON;                 /* PREVENT RECURSION             */ 07379000
         OI    UNCATSW,B'10000000'                                 2431 07380000
*       IF LASTDSAB^=ZEROPTR        /* IF DSABS EXISTED      @YM30475*/ 07381000
*         THEN                      /* THEN                  @YM30475*/ 07382000
         L     @12,LASTDSAB                                        2432 07383000
         LTR   @12,@12                                             2432 07384000
         BZ    @RF02432                                            2432 07385000
*         DSABPTR=LASTDSAB->DSABFCHN;/* OBTAIN ADDED DSAB    @YM30475*/ 07386000
         L     @12,DSABFCHN(,@12)                                  2433 07387000
         ST    @12,DSABPTR                                         2433 07388000
*       ELSE                        /* ELSE                  @YM30475*/ 07389000
*         DSABPTR=QDBFELMP;         /* OBTAIN FIRST DSAB PTR @YM30475*/ 07390000
         B     @RC02432                                            2434 07391000
@RF02432 L     @12,QDBPTR                                          2434 07392000
         L     @12,QDBFELMP(,@12)                                  2434 07393000
         ST    @12,DSABPTR                                         2434 07394000
*       WORKTODO=NOTON;             /* INITIALIZE SWITCH             */ 07395000
@RC02432 NI    WORKTODO,B'01111111'                                2435 07396000
*       DO WHILE DSABPTR^=0;        /* PROCESS DSABS UNTIL NONE LEFT    07397000
*                                      DO/B                          */ 07398000
         B     @DE02436                                            2436 07399000
@DL02436 DS    0H                                                  2437 07400000
*         DSABCATL=NOTON;           /* UNALLOC WONT FREE PVTCATS     */ 07401000
         L     @12,DSABPTR                                         2437 07402000
         NI    DSABCATL(@12),B'11110111'                           2437 07403000
*         DSABPTR=DSABFCHN;         /* GET NEXT PTR                  */ 07404000
         L     @12,DSABFCHN(,@12)                                  2438 07405000
         ST    @12,DSABPTR                                         2438 07406000
*         WORKTODO=ON;              /* SIGNAL UNALLOCS TO PERFORM    */ 07407000
         OI    WORKTODO,B'10000000'                                2439 07408000
*       END;                        /* DO/B                          */ 07409000
@DE02436 SLR   @12,@12                                             2440 07410000
         C     @12,DSABPTR                                         2440 07411000
         BNE   @DL02436                                            2440 07412000
*       IF WORKTODO=ON THEN         /* GO DO UNCATALOG IF NECESSARY  */ 07413000
         TM    WORKTODO,B'10000000'                                2441 07414000
         BNO   @RF02441                                            2441 07415000
*         DO;                       /* DO/C                          */ 07416000
*/* INITIALIZE FUNCTION MAP AS REQUIRED                              */ 07417000
*                                                                  2443 07418000
*           UCCAJSCB=NOTON;         /* DONT CHANGE JSCB TO ACTIVE    */ 07419000
*           UCNTIONQ=NOTON;         /* DO NOT ENQ ON TIOT            */ 07420000
*           UCONECAT=NOTON;         /* NOT REQUIRED                  */ 07421000
*           UCALLCAT=ON;            /* UNALLOC ALL CATALOGS          */ 07422000
*           UCONEACB=NOTON;         /* NOT REQUIRED                  */ 07423000
*           UCALLACB=ON;            /* CLOSE ALL CATALOGS            */ 07424000
*           UCONPCCB=NOTON;         /* NOT REQUIRED                  */ 07425000
*           UCALPCCB=ON;            /* FREE ALL PCCBS                */ 07426000
         OI    UCALLCAT,B'00010101'                                2450 07427000
         NI    UCCAJSCB,B'00010101'                                2450 07428000
*           UCTEMP=NOTON;           /* NOT REQUIRED                  */ 07429000
*           UCSWTIOT=NOTON;         /* NOT REQUIRED                  */ 07430000
         NI    UCTEMP,B'00111111'                                  2452 07431000
*/* INITIALIZE PARM LIST FOR IEFAB4F4                                */ 07432000
*                                                                  2453 07433000
*           RCAREA=0;               /* INIT RETURN CODE              */ 07434000
         ST    @12,RCAREA                                          2453 07435000
*           RTCDPTR=ADDR(RCAREA);   /* POINT TO R.C. AREA            */ 07436000
         LA    @11,RCAREA                                          2454 07437000
         STCM  @11,15,RTCDPTR                                      2454 07438000
*           PCCBPTR=0;              /* NOT REQUIRED                  */ 07439000
         STCM  @12,15,PCCBPTR                                      2455 07440000
*           DDNAMPTR=0;             /* NOT REQUIRED                  */ 07441000
         STCM  @12,15,DDNAMPTR                                     2456 07442000
*           ACBPTR=0;               /* NOT REQUIRED                  */ 07443000
         STCM  @12,15,ACBPTR                                       2457 07444000
*           JSCBP=TCBJSCB;          /* JSCB POINTER                  */ 07445000
         L     @11,TCBPTR                                          2458 07446000
         MVC   JSCBP(4),TCBJSCB(@11)                               2458 07447000
*           DO;                     /* LINK EP('IEFAB4F4') PARAM(UCCN   07448000
*                                      TRLS,RTCDPTR,PCCBPTR,DDNAMPTR,   07449000
*                                      ACBPTR,JSCBP)                 */ 07450000
*             I00601='00'X;         /* EP/DE FLAG                    */ 07451000
         MVI   I00601,X'00'                                        2460 07452000
*             I00602=ADDR('IEFAB4F4');/* ADDR OF EP/DE               */ 07453000
         LA    @11,@CC04516                                        2461 07454000
         STCM  @11,7,I00602                                        2461 07455000
*             I00604=0;             /* DCB PTR                       */ 07456000
         STCM  @12,7,I00604                                        2462 07457000
*             I00603='00'X;         /* ERRET FLAG                    */ 07458000
         MVI   I00603,X'00'                                        2463 07459000
*             IOPTLIST(1)=ADDR(UCCNTRLS);/* ADDR OF PROB PROG PARM   */ 07460000
         LA    @12,UCCNTRLS                                        2464 07461000
         ST    @12,IOPTLIST                                        2464 07462000
*             IOPTLIST(2)=ADDR(RTCDPTR);/* ADDR OF PROB PROG PARM    */ 07463000
         LA    @12,RTCDPTR                                         2465 07464000
         ST    @12,IOPTLIST+4                                      2465 07465000
*             IOPTLIST(3)=ADDR(PCCBPTR);/* ADDR OF PROB PROG PARM    */ 07466000
         LA    @12,PCCBPTR                                         2466 07467000
         ST    @12,IOPTLIST+8                                      2466 07468000
*             IOPTLIST(4)=ADDR(DDNAMPTR);/* ADDR OF PROB PROG PARM   */ 07469000
         LA    @12,DDNAMPTR                                        2467 07470000
         ST    @12,IOPTLIST+12                                     2467 07471000
*             IOPTLIST(5)=ADDR(ACBPTR);/* ADDR OF PROB PROG PARM     */ 07472000
         LA    @12,ACBPTR                                          2468 07473000
         ST    @12,IOPTLIST+16                                     2468 07474000
*             IOPTLIST(6)=ADDR(JSCBP);/* ADDR OF PROB PROG PARM      */ 07475000
         LA    @12,JSCBP                                           2469 07476000
         ST    @12,IOPTLIST+20                                     2469 07477000
*             IOPTLIST(6)=IOPTLIST(6)|'80000000'X;/* SET VL BIT      */ 07478000
         O     @12,@CF04255                                        2470 07479000
         ST    @12,IOPTLIST+20                                     2470 07480000
*             RESPECIFY                                            2471 07481000
*              (GPR01P) RESTRICTED;                                2471 07482000
*             GPR01P=ADDR(IOPTLIST);/* ADDR OF OPTLIST               */ 07483000
         LA    GPR01P,IOPTLIST                                     2472 07484000
*             RESPECIFY                                            2473 07485000
*              (GPR15P) RESTRICTED;                                2473 07486000
*             GPR15P=ADDR(I006);    /* ADDR OF LINK LIST             */ 07487000
         LA    GPR15P,I006                                         2474 07488000
*             SVC(6);               /* ISSUE LINK SVC                */ 07489000
         SVC   6                                                   2475 07490000
*             RESPECIFY                                            2476 07491000
*              (GPR01P) UNRESTRICTED;                              2476 07492000
*             RESPECIFY                                            2477 07493000
*              (GPR15P) UNRESTRICTED;                              2477 07494000
*           END;                    /* LINK EP('IEFAB4F4') PARAM(UCCN   07495000
*                                      TRLS,RTCDPTR,PCCBPTR,DDNAMPTR,   07496000
*                                      ACBPTR,JSCBP)                 */ 07497000
*           IF RCAREA^=0 THEN       /* UNSUCCESSFUL ?                */ 07498000
         L     @12,RCAREA                                          2479 07499000
         LTR   @12,@12                                             2479 07500000
         BZ    @RF02479                                            2479 07501000
*             DO;                   /* DO/D                          */ 07502000
*               TCBJSCB->JSCBACT=SAVEJSCB;/* RESTORE P/P JSCB        */ 07503000
         L     @12,TCBPTR                                          2481 07504000
         L     @12,TCBJSCB(,@12)                                   2481 07505000
         L     @11,SAVEJSCB                                        2481 07506000
         ST    @11,JSCBACT(,@12)                                   2481 07507000
*               JSCBPCC=SAVEPCCB;   /* RESTORE INIT PCCB CHAIN       */ 07508000
         L     @11,SAVEPCCB                                        2482 07509000
         ST    @11,JSCBPCC(,@12)                                   2482 07510000
*               DO;                 /* MODESET KEYADDR(SAVEKEYA)     */ 07511000
*                 SPKA(SAVEKEYA);   /* SET PSW KEY                   */ 07512000
         SLR   @12,@12                                             2484 07513000
         IC    @12,SAVEKEYA                                        2484 07514000
         SPKA  0(@12)                                              2484 07515000
*               END;                /* MODESET KEYADDR(SAVEKEYA)     */ 07516000
*               CALL ERROR238;      /* ERROR ROUTINE                 */ 07517000
         BAL   @14,ERROR238                                        2486 07518000
*             END;                  /* DO/D                          */ 07519000
*         END;                      /* DO/C                          */ 07520000
@RF02479 DS    0H                                                  2489 07521000
*     END;                          /* DO/A                          */ 07522000
@RF02441 DS    0H                                                  2490 07523000
*   JSCBPCC=SAVEPCCB;               /* RESTORE ORIGINAL PCCB CHAIN   */ 07524000
@RF02429 L     @12,TCBPTR                                          2490 07525000
         L     @12,TCBJSCB(,@12)                                   2490 07526000
         L     @11,SAVEPCCB                                        2490 07527000
         ST    @11,JSCBPCC(,@12)                                   2490 07528000
*   END UNALOCAT;                                                  2491 07529000
@EL00041 DS    0H                                                  2491 07530000
@EF00041 DS    0H                                                  2491 07531000
@ER00041 LM    @14,@12,@SA00041                                    2491 07532000
         BR    @14                                                 2491 07533000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 07534000
*     GPR00F FIXED(31) REG(0),                                     2492 07535000
*     GPR01F FIXED(31) REG(1),                                     2492 07536000
*     GPR02F FIXED(31) REG(2),                                     2492 07537000
*     GPR00P PTR(31) REG(0),                                       2492 07538000
*     GPR01P PTR(31) REG(1),                                       2492 07539000
*     GPR14P PTR(31) REG(14),                                      2492 07540000
*     GPR15P PTR(31) REG(15);                                      2492 07541000
*   DCL                                                            2493 07542000
*     1 I006 DEF(ILIST),            /* DEFINE LIST                   */ 07543000
*      2 I00601 CHAR(1),            /* EP/DE FLAG                    */ 07544000
*      2 I00602 PTR(24),            /* EP/DE PTR                     */ 07545000
*      2 I00603 CHAR(1),            /* ERRET FLAG                    */ 07546000
*      2 I00604 PTR(24),            /* DCB PTR                       */ 07547000
*      2 I00605 PTR(31);            /* ERRET PTR                     */ 07548000
*   DECLARE                                                        2494 07549000
*     ILIST CHAR(12) BDY(DWORD);    /* STANDARD LIST                 */ 07550000
*   DECLARE                         /* COMMON VARIABLES              */ 07551000
*     I256C CHAR(256) BASED,                                       2495 07552000
*     I031F FIXED(31) BASED,                                       2495 07553000
*     I031P PTR(31) BASED,                                         2495 07554000
*     I015F FIXED(15) BASED,                                       2495 07555000
*     I015P PTR(15) BASED,                                         2495 07556000
*     I008P PTR(8) BASED,                                          2495 07557000
*     I001C CHAR(1) BASED;                                         2495 07558000
*   DECLARE                                                        2496 07559000
*     IOPTLIST(9) PTR(31) BDY(WORD);/* OPTION LIST ARRAY             */ 07560000
*   END IEFXB609                                                   2497 07561000
*                                                                  2497 07562000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 07563000
*/*%INCLUDE SYSLIB  (IEFJFCBE)                                       */ 07564000
*/*%INCLUDE SYSLIB  (IEFJFCBN)                                       */ 07565000
*/*%INCLUDE SYSLIB  (IEFJFCBX)                                       */ 07566000
*/*%INCLUDE SYSLIB  (IEFASIOT)                                       */ 07567000
*/*%INCLUDE SYSLIB  (IEFASCTB)                                       */ 07568000
*/*%INCLUDE SYSLIB  (IEFAJCTB)                                       */ 07569000
*/*%INCLUDE SYSLIB  (IEFALLCT)                                       */ 07570000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 07571000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 07572000
*/*%INCLUDE SYSLIB  (IEFQMNGR)                                       */ 07573000
*/*%INCLUDE SYSLIB  (IEFZB442)                                       */ 07574000
*/*%INCLUDE SYSLIB  (IEFZB443)                                       */ 07575000
*/*%INCLUDE SYSLIB  (IEFTIOT1)                                       */ 07576000
*/*%INCLUDE SYSLIB  (IEECHAIN)                                       */ 07577000
*/*%INCLUDE SYSLIB  (IEZJSCB )                                       */ 07578000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 07579000
*/*%INCLUDE SYSLIB  (IEFZB505)                                       */ 07580000
*/*%INCLUDE SYSLIB  (IEFZB502)                                       */ 07581000
*/*%INCLUDE SYSLIB  (IHAGDA  )                                       */ 07582000
*/*%INCLUDE SYSLIB  (IEFZB4D0)                                       */ 07583000
*/*%INCLUDE SYSLIB  (IEFZB4D2)                                       */ 07584000
*/*%INCLUDE SYSLIB  (IEFZB421)                                       */ 07585000
*/*%INCLUDE SYSLIB  (IEFZB4D6)                                       */ 07586000
*/*%INCLUDE SYSLIB  (IHADSAB )                                       */ 07587000
*/*%INCLUDE SYSLIB  (IHAQDB  )                                       */ 07588000
*/*%INCLUDE SYSLIB  (IEFZB506)                                       */ 07589000
*/*%INCLUDE SYSLIB  (IEFJESCT)                                       */ 07590000
*/*%INCLUDE SYSLIB  (IEFZB429)                                       */ 07591000
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */ 07592000
*/*%INCLUDE SYSLIB  (IKJEFFDF)                                       */ 07593000
*/*%INCLUDE SYSLIB  (IEFQMREQ)                                       */ 07594000
*                                                                  2497 07595000
*       ;                                                          2497 07596000
@DATA    DS    0H                                                       07597000
@CH00035 DC    H'6'                                                     07598000
@CH03357 DC    H'39'                                                    07599000
@CH03812 DC    H'49'                                                    07600000
@CH04188 DC    H'62'                                                    07601000
@CH04345 DC    H'71'                                                    07602000
@CH04201 DC    H'400'                                                   07603000
@CH02947 DC    XL2'0002'                                                07604000
@CH02955 DC    XL2'0006'                                                07605000
@CH03031 DC    XL2'002C'                                                07606000
@CH03846 DC    XL2'0C'                                                  07607000
@SM04554 MVC   STAELIST(0),STALIST1                                     07608000
@SM04560 MVC   ATT610(0),ATT6101                                        07609000
@SM04568 MVC   JFCBE(0,@12),JFCBE(@11)                                  07610000
@SM04574 MVC   MSGAREA(0),MSGTEXT(@11)                                  07611000
@SM04577 MVC   REMOVE(0),REMOVE1                                        07612000
@SM04581 MVC   NEWVOLS(0),NEWVOLS1                                      07613000
@SM04583 MVC   MSGAREA(0),MSGTEXT(@12)                                  07614000
@SM04585 MVC   DUMPLIST(0),DLIST1                                       07615000
@DATD    DSECT                                                          07616000
         DS    0F                                                       07617000
@SA00001 DS    18F                                                      07618000
@PC00001 DS    1F                                                       07619000
@SA00002 DS    15F                                                      07620000
@SA00003 DS    15F                                                      07621000
@SA00004 DS    15F                                                      07622000
@SA00005 DS    15F                                                      07623000
@SA00006 DS    15F                                                      07624000
@SA00007 DS    14F                                                      07625000
@SA00008 DS    14F                                                      07626000
@SA00010 DS    14F                                                      07627000
@SA00027 DS    15F                                                      07628000
@SA00020 DS    15F                                                      07629000
@SA00028 DS    15F                                                      07630000
@SA00031 DS    15F                                                      07631000
@SA00023 DS    15F                                                      07632000
@SA00040 DS    15F                                                      07633000
@SA00035 DS    15F                                                      07634000
@SA00024 DS    14F                                                      07635000
@SA00038 DS    15F                                                      07636000
@SA00022 DS    15F                                                      07637000
@SA00012 DS    15F                                                      07638000
@SA00013 DS    15F                                                      07639000
@SA00015 DS    14F                                                      07640000
@SA00011 DS    15F                                                      07641000
@SA00019 DS    14F                                                      07642000
@SA00026 DS    15F                                                      07643000
@SA00014 DS    15F                                                      07644000
@SA00037 DS    15F                                                      07645000
@SA00016 DS    14F                                                      07646000
@SA00017 DS    14F                                                      07647000
@SA00039 DS    15F                                                      07648000
@SA00021 DS    15F                                                      07649000
@SA00018 DS    14F                                                      07650000
@SA00030 DS    15F                                                      07651000
@SA00029 DS    15F                                                      07652000
@PC00029 DS    1F                                                       07653000
@SA00033 DS    15F                                                      07654000
@PC00033 DS    1F                                                       07655000
@SA00041 DS    15F                                                      07656000
@AL00001 DS    2A                                                       07657000
@TF00001 DS    F                                                        07658000
IEFXB609 CSECT                                                          07659000
         DS    0F                                                       07660000
@CF00395 DC    F'0'                                                     07661000
@CF00069 DC    F'1'                                                     07662000
@CF00033 DC    F'4'                                                     07663000
@CF00034 DC    F'5'                                                     07664000
@CF00558 DC    F'12'                                                    07665000
@CH00558 EQU   @CF00558+2                                               07666000
@CF00052 DC    F'16'                                                    07667000
@CF00238 DC    F'24'                                                    07668000
@CF04526 DC    F'174'                                                   07669000
@CF00663 DC    F'176'                                                   07670000
@CF03978 DC    F'178'                                                   07671000
@CF03958 DC    F'195'                                                   07672000
@CF04570 DC    F'-31'                                                   07673000
@CF04579 DC    F'-10'                                                   07674000
@CF04580 DC    F'-6'                                                    07675000
@CF04255 DC    XL4'80000000'                                            07676000
@CF04576 DC    XL4'0000FFFF'                                            07677000
@CF02945 DC    XL4'0001'                                                07678000
@CH02945 EQU   @CF02945+2                                               07679000
@CF02951 DC    XL4'0004'                                                07680000
@CH02951 EQU   @CF02951+2                                               07681000
@CF02959 DC    XL4'0008'                                                07682000
@CH02959 EQU   @CF02959+2                                               07683000
@CF02967 DC    XL4'000C'                                                07684000
@CH02967 EQU   @CF02967+2                                               07685000
@CF02975 DC    XL4'0010'                                                07686000
@CH02975 EQU   @CF02975+2                                               07687000
@CF02983 DC    XL4'0014'                                                07688000
@CH02983 EQU   @CF02983+2                                               07689000
@CF04089 DC    XL4'0400'                                                07690000
@CF02918 DC    XL4'02'                                                  07691000
@CF02926 DC    XL4'06'                                                  07692000
@CF03780 DC    XL4'08'                                                  07693000
@CF03784 DC    XL4'10'                                                  07694000
@CF03876 DC    XL4'1C'                                                  07695000
@CF03927 DC    XL4'0F'                                                  07696000
@DATD    DSECT                                                          07697000
         DS    0D                                                       07698000
JFCBPTR  DS    A                                                        07699000
JFCBXPTR DS    A                                                        07700000
JFCBEPTR DS    A                                                        07701000
SIOTPTR  DS    A                                                        07702000
SCTPTR   DS    A                                                        07703000
JCTPTR   DS    A                                                        07704000
LCTPTR   DS    A                                                        07705000
TCBPTR   DS    A                                                        07706000
QMPAPTR  DS    A                                                        07707000
TIOTPTR  DS    A                                                        07708000
CSCBPTR  DS    A                                                        07709000
UCBPTR   DS    A                                                        07710000
EPAPTR   DS    A                                                        07711000
CHRPTR   DS    A                                                        07712000
TYPE1PTR DS    A                                                        07713000
TYPE2PTR DS    A                                                        07714000
TYPE3PTR DS    A                                                        07715000
DSABPTR  DS    A                                                        07716000
QDBPTR   DS    A                                                        07717000
SWEPAPTR DS    A                                                        07718000
SPFXPTR  DS    A                                                        07719000
GDAPTR   DS    A                                                        07720000
S99TUFP  DS    A                                                        07721000
EDTPTR   DS    A                                                        07722000
LUVPTR   DS    A                                                        07723000
GENPTR   DS    A                                                        07724000
GRPTABP  DS    A                                                        07725000
GRPPTR   DS    A                                                        07726000
GDGNTPTR DS    A                                                        07727000
PROCSIOT DS    A                                                        07728000
CURNSIOT DS    A                                                        07729000
NEXTSIOT DS    A                                                        07730000
SAVEJSCB DS    A                                                        07731000
ECB610   DS    A                                                        07732000
ECBC1    DS    A                                                        07733000
OPENECB  DS    A                                                        07734000
LASTDSAB DS    A                                                        07735000
SAVETCB  DS    A                                                        07736000
PASSJCT  DS    A                                                        07737000
PASSEPA  DS    F                                                        07738000
PASSTCB  DS    F                                                        07739000
PAD2     DS    F                                                        07740000
RETPARM  DS    F                                                        07741000
DJFCBPTR DS    A                                                        07742000
DSIOTPTR DS    A                                                        07743000
DDNTPTR  DS    A                                                        07744000
SCTXPTR  DS    A                                                        07745000
DJFCXPTR DS    A                                                        07746000
SIOT2ADD DS    A                                                        07747000
PREVLAST DS    A                                                        07748000
DGDGPTR  DS    A                                                        07749000
EDBRBPTR DS    A                                                        07750000
RETCODE  DS    A                                                        07751000
SAVELAST DS    A                                                        07752000
ADDR603  DS    A                                                        07753000
REGPTR   DS    A                                                        07754000
CKPTSIOT DS    A                                                        07755000
I        DS    F                                                        07756000
LISTPTR  DS    A                                                        07757000
LISTLEN  DS    F                                                        07758000
SAVEONE  DS    A                                                        07759000
SAVE14   DS    A                                                        07760000
SAVEPCCB DS    A                                                        07761000
RCAREA   DS    F                                                        07762000
SIOTCPTR DS    A                                                        07763000
JFCBCPTR DS    A                                                        07764000
ADDR610  DS    A                                                        07765000
SAVEDDNT DS    A                                                        07766000
UCBDCPTR DS    A                                                        07767000
ACCNTRLS DS    FL2                                                      07768000
         ORG   ACCNTRLS                                                 07769000
ACNODD   DS    BL1                                                      07770000
ACDVWAIT EQU   ACCNTRLS+0                                               07771000
ACRECOVR EQU   ACCNTRLS+0                                               07772000
ACOSCVOL EQU   ACCNTRLS+0                                               07773000
ACVLWAIT EQU   ACCNTRLS+0                                               07774000
ACOFLINE EQU   ACCNTRLS+0                                               07775000
ACNOENQ  EQU   ACCNTRLS+0                                               07776000
ACNUJSCB EQU   ACCNTRLS+0                                               07777000
ACOK2MNT DS    BL1                                                      07778000
ACSTPCAT EQU   ACCNTRLS+1                                               07779000
ACALCTLG EQU   ACCNTRLS+1                                               07780000
ACOPNACB EQU   ACCNTRLS+1                                               07781000
ACCCPCCB EQU   ACCNTRLS+1                                               07782000
ACRECOVD EQU   ACCNTRLS+1                                               07783000
@NM00147 EQU   ACCNTRLS+1                                               07784000
         ORG   ACCNTRLS+2                                               07785000
UCCNTRLS DS    FL2                                                      07786000
         ORG   UCCNTRLS                                                 07787000
UCCAJSCB DS    BL1                                                      07788000
UCNTIONQ EQU   UCCNTRLS+0                                               07789000
UCONECAT EQU   UCCNTRLS+0                                               07790000
UCALLCAT EQU   UCCNTRLS+0                                               07791000
UCONEACB EQU   UCCNTRLS+0                                               07792000
UCALLACB EQU   UCCNTRLS+0                                               07793000
UCONPCCB EQU   UCCNTRLS+0                                               07794000
UCALPCCB EQU   UCCNTRLS+0                                               07795000
UCTEMP   DS    BL1                                                      07796000
UCSWTIOT EQU   UCCNTRLS+1                                               07797000
@NM00148 EQU   UCCNTRLS+1                                               07798000
         ORG   UCCNTRLS+2                                               07799000
LALOCCTR DS    H                                                        07800000
SAVEVOL  DS    H                                                        07801000
CHRPPEK  DS    H                                                        07802000
HOLDDC   DS    H                                                        07803000
HOLDRC   DS    H                                                        07804000
HOLDSTRT DS    H                                                        07805000
VOLHOLD  DS    H                                                        07806000
FREELEN  DS    H                                                        07807000
COUNT    DS    H                                                        07808000
J        DS    H                                                        07809000
READLEN  DS    H                                                        07810000
UAFFNO   DS    H                                                        07811000
CALLKEY  DS    FL1                                                      07812000
SAVEKEYA DS    FL1                                                      07813000
INDEX    DS    AL1                                                      07814000
STEPNO   DS    AL1                                                      07815000
JFCBTVOL DS    FL1                                                      07816000
JFCBTENQ DS    FL1                                                      07817000
         ORG   JFCBTENQ                                                 07818000
@NM00225 DS    BL1                                                      07819000
SHAREBIT EQU   JFCBTENQ+0                                               07820000
@NM00226 EQU   JFCBTENQ+0                                               07821000
         ORG   JFCBTENQ+1                                               07822000
         DS    CL3                                                      07823000
REALADD  DS    AL3                                                      07824000
         DS    CL1                                                      07825000
SIOTSIOT DS    AL3                                                      07826000
         DS    CL1                                                      07827000
PREV     DS    AL3                                                      07828000
         DS    CL1                                                      07829000
NEWPTR   DS    AL3                                                      07830000
         DS    CL1                                                      07831000
NEWSIOT  DS    AL3                                                      07832000
         DS    CL1                                                      07833000
TEMPPTR  DS    AL3                                                      07834000
         DS    CL1                                                      07835000
NEWJFCB  DS    AL3                                                      07836000
         DS    CL1                                                      07837000
ASGNADD  DS    AL3                                                      07838000
         DS    CL1                                                      07839000
GDGSWA   DS    AL3                                                      07840000
         DS    CL1                                                      07841000
SAVELOC  DS    AL3                                                      07842000
         DS    CL1                                                      07843000
SWAXADD  DS    AL3                                                      07844000
         DS    CL1                                                      07845000
XADD     DS    AL3                                                      07846000
SAVEL    DS    AL3                                                      07847000
HOLDI    DS    FL1                                                      07848000
HOLDX    DS    FL1                                                      07849000
XVOLI    DS    FL1                                                      07850000
         DS    CL2                                                      07851000
SIOTCAT  DS    AL3                                                      07852000
VALUE    DS    FL1                                                      07853000
         DS    0D                                                       07854000
@TS00001 DS    CL8                                                      07855000
DSRRFMAP DS    CL2                                                      07856000
         ORG   DSRRFMAP                                                 07857000
ADDRPASS DS    BL1                                                      07858000
ADCHONLY EQU   DSRRFMAP+0                                               07859000
ADCHENQ  EQU   DSRRFMAP+0                                               07860000
DELEONLY EQU   DSRRFMAP+0                                               07861000
DELEDEQ  EQU   DSRRFMAP+0                                               07862000
NOSHRXCL EQU   DSRRFMAP+0                                               07863000
ENQSHR   EQU   DSRRFMAP+0                                               07864000
ENQEXCL  EQU   DSRRFMAP+0                                               07865000
ENQWAIT  DS    BL1                                                      07866000
RETADDR  EQU   DSRRFMAP+1                                               07867000
RETINDIC EQU   DSRRFMAP+1                                               07868000
READALL  EQU   DSRRFMAP+1                                               07869000
INCORREC EQU   DSRRFMAP+1                                               07870000
EPAJCTEX EQU   DSRRFMAP+1                                               07871000
SRCHDSNM EQU   DSRRFMAP+1                                               07872000
NEPAPROC EQU   DSRRFMAP+1                                               07873000
         ORG   DSRRFMAP+2                                               07874000
         DS    CL2                                                      07875000
EPABUF   DS    CL16                                                     07876000
READCHR  DS    BL1                                                      07877000
         DS    CL3                                                      07878000
IOBUF    DS    CL408                                                    07879000
RESTYPE  DS    BL1                                                      07880000
         DS    CL3                                                      07881000
PARM610  DS    CL20                                                     07882000
         ORG   PARM610                                                  07883000
DCBPARM  DS    AL4                                                      07884000
ADECB610 DS    AL4                                                      07885000
ECBLIST1 DS    CL12                                                     07886000
         ORG   ECBLIST1                                                 07887000
ADOKECB  DS    AL4                                                      07888000
ADECBC1  DS    AL4                                                      07889000
         ORG   ADECBC1                                                  07890000
HIBITC1  DS    BL1                                                      07891000
         ORG   ECBLIST1+8                                               07892000
ADCANECB DS    AL4                                                      07893000
         ORG   ADCANECB                                                 07894000
HIORD    DS    BL1                                                      07895000
         ORG   PARM610+20                                               07896000
DCBCKPT  DS    CL96                                                     07897000
SYNFLAG  DS    BL1                                                      07898000
ALOCPARM DS    BL1                                                      07899000
FOUNDSW  DS    BL1                                                      07900000
         DS    CL1                                                      07901000
SCTX     DS    CL53                                                     07902000
         ORG   SCTX                                                     07903000
SCTXSVA  DS    CL3                                                      07904000
SCTXID1  DS    CL1                                                      07905000
RSTRTLST DS    CL49                                                     07906000
         ORG   RSTRTLST                                                 07907000
NOTEPARM DS    AL4                                                      07908000
CHRSAVE  DS    CL45                                                     07909000
         ORG   SCTX+53                                                  07910000
PASSDSNM DS    CL46                                                     07911000
         ORG   PASSDSNM                                                 07912000
DSNLEN   DS    FL2                                                      07913000
DSN      DS    CL44                                                     07914000
         ORG   PASSDSNM+46                                              07915000
PAD1     DS    CL8                                                      07916000
         ORG   PAD1                                                     07917000
PAD12    DS    AL4                                                      07918000
PAD13    DS    AL4                                                      07919000
         ORG   PAD1+8                                                   07920000
LOOPCTR  DS    BL1                                                      07921000
STPXLOOP DS    BL1                                                      07922000
PHAZ2SW  DS    BL1                                                      07923000
BUILDSW  DS    BL1                                                      07924000
TEMPSW   DS    BL1                                                      07925000
GDGSWTCH DS    BL1                                                      07926000
SAVEDD   DS    CL8                                                      07927000
         DS    CL3                                                      07928000
TU1      DS    CL12                                                     07929000
         ORG   TU1                                                      07930000
TU1KEY   DS    CL2                                                      07931000
TU1NUM   DS    FL2                                                      07932000
TU1LEN   DS    FL2                                                      07933000
TU1PARM  DS    CL6                                                      07934000
         ORG   TU1+12                                                   07935000
TU2      DS    CL50                                                     07936000
         ORG   TU2                                                      07937000
TU2KEY   DS    CL2                                                      07938000
TU2NUM   DS    FL2                                                      07939000
TU2LEN   DS    FL2                                                      07940000
TU2PARM  DS    CL44                                                     07941000
         ORG   TU2+50                                                   07942000
         DS    CL2                                                      07943000
TU3      DS    CL14                                                     07944000
         ORG   TU3                                                      07945000
TU3KEY   DS    CL2                                                      07946000
TU3NUM   DS    FL2                                                      07947000
TU3LEN   DS    FL2                                                      07948000
TU3PARM  DS    CL8                                                      07949000
         ORG   TU3+14                                                   07950000
         DS    CL2                                                      07951000
TU4      DS    CL7                                                      07952000
         ORG   TU4                                                      07953000
TU4KEY   DS    CL2                                                      07954000
TU4NUM   DS    FL2                                                      07955000
TU4LEN   DS    FL2                                                      07956000
TU4PARM  DS    CL1                                                      07957000
         ORG   TU4+7                                                    07958000
         DS    CL1                                                      07959000
TU5      DS    CL7                                                      07960000
         ORG   TU5                                                      07961000
TU5KEY   DS    CL2                                                      07962000
TU5NUM   DS    FL2                                                      07963000
TU5LEN   DS    FL2                                                      07964000
TU5PARM  DS    CL1                                                      07965000
         ORG   TU5+7                                                    07966000
         DS    CL1                                                      07967000
TU6      DS    CL12                                                     07968000
         ORG   TU6                                                      07969000
TU6KEY   DS    CL2                                                      07970000
TU6NUM   DS    FL2                                                      07971000
TU6LEN   DS    FL2                                                      07972000
TU6PARM  DS    CL6                                                      07973000
         ORG   TU6+12                                                   07974000
TU61     DS    CL8                                                      07975000
         ORG   TU61                                                     07976000
TU61KEY  DS    CL2                                                      07977000
TU61NUM  DS    FL2                                                      07978000
TU61LEN  DS    FL2                                                      07979000
TU61PARM DS    CL2                                                      07980000
         ORG   TU61+8                                                   07981000
TU7      DS    CL14                                                     07982000
         ORG   TU7                                                      07983000
TU7KEY   DS    CL2                                                      07984000
TU7NUM   DS    FL2                                                      07985000
TU7LEN   DS    FL2                                                      07986000
TU71TO8  DS    CL8                                                      07987000
         ORG   TU7+14                                                   07988000
         DS    CL2                                                      07989000
EDB99RB  DS    CL20                                                     07990000
DFPARMS  DS    CL20                                                     07991000
         ORG   DFPARMS                                                  07992000
DFS99RBP DS    AL4                                                      07993000
         ORG   DFS99RBP                                                 07994000
DFDAPLP  DS    AL4                                                      07995000
         ORG   DFPARMS+4                                                07996000
DFRCP    DS    AL4                                                      07997000
DFJEFF02 DS    AL4                                                      07998000
DFIDP    DS    AL4                                                      07999000
DFCPPLP  DS    AL4                                                      08000000
         ORG   DFPARMS+20                                               08001000
MSGAREA  DS    CL100                                                    08002000
JBSTART  DS    CL4                                                      08003000
         DS    CL4                                                      08004000
JBEND    DS    CL4                                                      08005000
IGNORE   DS    BL1                                                      08006000
STAENTR  DS    BL1                                                      08007000
         DS    CL2                                                      08008000
STAEREGS DS    CL72                                                     08009000
UNCATSW  DS    BL1                                                      08010000
TTRSW    DS    BL1                                                      08011000
USEJCL   DS    BL1                                                      08012000
SAVEDEVT DS    CL4                                                      08013000
NULLSIOT DS    CL70                                                     08014000
         ORG   NULLSIOT                                                 08015000
@NM00241 DS    CL28                                                     08016000
NULPSIOT DS    AL3                                                      08017000
@NM00242 DS    CL39                                                     08018000
         ORG   NULLSIOT+70                                              08019000
         DS    CL3                                                      08020000
CKMEMNM  DS    CL8                                                      08021000
CHRMATCH DS    BL1                                                      08022000
PHAZ3SW  DS    BL1                                                      08023000
NEWCCAT  DS    BL1                                                      08024000
DOUBLDD  DS    BL1                                                      08025000
JFCBEFLG DS    CL1                                                      08026000
CCATEND  DS    BL1                                                      08027000
UNCATNAM DS    CL44                                                     08028000
TEMP1    DS    CL3                                                      08029000
SCRCHDSN DS    CL44                                                     08030000
NOSDWA   DS    BL1                                                      08031000
LIST4F5  DS    CL20                                                     08032000
         ORG   LIST4F5                                                  08033000
RTINFOP  DS    AL4                                                      08034000
JSCBPTRP DS    AL4                                                      08035000
CTGDSNP  DS    AL4                                                      08036000
CTGCONP  DS    AL4                                                      08037000
DDNAME   DS    AL4                                                      08038000
         ORG   LIST4F5+20                                               08039000
CTGDSN   DS    CL44                                                     08040000
WORKTODO DS    BL1                                                      08041000
         DS    CL5                                                      08042000
ILIST    DS    CL12                                                     08043000
ALIASDSN DS    CL44                                                     08044000
CKDECB   DS    CL20                                                     08045000
STAEPARM DS    CL6                                                      08046000
SVOLDSVA DS    CL3                                                      08047000
         DS    CL3                                                      08048000
TUPLEDB  DS    CL4                                                      08049000
         ORG   TUPLEDB+0                                                08050000
TUPTR    DS    AL4                                                      08051000
         ORG   TUPTR+0                                                  08052000
TUPLAST  DS    BL1                                                      08053000
         ORG   TUPLEDB+32                                               08054000
IOPTLIST DS    9A                                                       08055000
IEFXB609 CSECT                                                          08056000
         DS    0F                                                       08057000
@SIZDATD DC    AL1(230)                                                 08058000
         DC    AL3(@ENDDATD-@DATD)                                      08059000
@CV03915 DC    V(EDTTAB)                                                08060000
@CV04056 DC    V(IEFXB603)                                              08061000
         DS    0D                                                       08062000
ENDMRG   DC    AL2(176)                                                 08063000
STARTMRG DC    AL2(3+1)                                                 08064000
DYNFAIL  DC    H'50'                                                    08065000
@CC03776 DC    C'        '                                              08066000
@CC04053 DC    C'IKJEFF18'                                              08067000
@CC04253 DC    C'IEFAB4DC'                                              08068000
@CC04505 DC    C'IEFAB4F5'                                              08069000
@CC04516 DC    C'IEFAB4F4'                                              08070000
@CC03773 DC    C'SYSCHK'                                                08071000
@CC03909 DC    C'2400  '                                                08072000
@CC03911 DC    C'2400-3'                                                08073000
@CC03913 DC    C'3400-3'                                                08074000
@CC04059 DC    C'MG06'                                                  08075000
@CC04061 DC    C'MG07'                                                  08076000
@CC04063 DC    C'MG08'                                                  08077000
@CC04443 DC    C'MG10'                                                  08078000
@CC04467 DC    C'XXXX'                                                  08079000
@CC04065 DC    C' K '                                                   08080000
@CC04302 DC    C'230'                                                   08081000
@CC04304 DC    C'231'                                                   08082000
@CC04306 DC    C'232'                                                   08083000
@CC04308 DC    C'233'                                                   08084000
@CC04310 DC    C'034'                                                   08085000
@CC04312 DC    C'235'                                                   08086000
@CC04316 DC    C'237'                                                   08087000
@CC04318 DC    C'038'                                                   08088000
@CC04320 DC    C'238'                                                   08089000
@CC04322 DC    C'239'                                                   08090000
@CC04067 EQU   @CC04065                                                 08091000
@CC04213 DC    C'AL'                                                    08092000
@CC04290 DC    C'RL'                                                    08093000
@CC04369 DC    C'WL'                                                    08094000
@CB02945 DC    X'0001'                                                  08095000
@CB02947 DC    X'0002'                                                  08096000
@CB02949 DC    X'0003'                                                  08097000
@CB02951 DC    X'0004'                                                  08098000
@CB02953 DC    X'0005'                                                  08099000
@CB02975 DC    X'0010'                                                  08100000
@CB02985 DC    X'0015'                                                  08101000
@CB03005 DC    X'001F'                                                  08102000
         DS    CL3                                                      08103000
LCLDSN   DS    CL4                                                      08104000
LCLLST   DS    CL4                                                      08105000
LCSTATNM DS    CL4                                                      08106000
PATCH00  DS    CL200                                                    08107000
IEFXB609 CSECT                                                          08108000
DCBGEN DCB DDNAME=SYSCHK,DEVD=DA,DSORG=PS,EODAD=ERROR7,BUFNO=1,       XX08109000
               NCP=1,SYNAD=SYNEXIT,BFTEK=S,MACRF=RP,BLKSIZE=408         08110000
@DATD    DSECT                                                          08111000
        DCBD  DSORG=PS,DEVD=DA                                          08112000
@DATD    DSECT                                                          08113000
STAELIST ESTAE STAEPROC,PURGE=HALT,MF=L                                 08114000
IEFXB609 CSECT                                                          08115000
*                                /* EXPAND A LOCAL LIST @YM07326*/      08116000
STALIST1 ESTAE STAEPROC,PURGE=HALT,MF=L                                 08117000
LENSTAE DC A(*-STALIST1)                                                08118000
@DATD    DSECT                                                          08119000
ATT610  ATTACH EP=IEFXB610,KEY=0,SF=L                                   08120000
IEFXB609 CSECT                                                          08121000
ATT6101 ATTACH EP=IEFXB610,KEY=0,SF=L                                   08122000
LENALIST DC A(*-ATT6101)                                                08123000
@DATD    DSECT                                                          08124000
*                             /* EXPAND THE MACRO LIST        */        08125000
REMOVE CAMLST UNCAT,UNCATNAM                                            08126000
IEFXB609 CSECT                                                          08127000
*                             /* EXPAND LOCAL STORE MACLIST   */        08128000
REMOVE1 CAMLST UNCAT,LCSTATNM                                           08129000
LENX    DC     A(*-REMOVE1)                                             08130000
@DATD    DSECT                                                          08131000
*                             /* EXPAND NON-RE-ENT MACRO      */        08132000
NEWVOLS CAMLST SCRATCH,SCRCHDSN,,LISTPTR,,OVRD                          08133000
IEFXB609 CSECT                                                          08134000
*                             /* EXPAND LOCAL COPY OF MACRO   */        08135000
NEWVOLS1 CAMLST SCRATCH,LCLDSN,,LCLLST,,OVRD                            08136000
LENY     DC     A(*-NEWVOLS1)                                           08137000
@DATD    DSECT                                                          08138000
DUMPLIST SDUMP HDR='ERROR DURING RESTART PROCESSING - IEFXB609',      XX08139000
               SDATA=(SQA,NUC,LSQA,RGN,LPA,TRT,SWA),MF=L                08140000
IEFXB609 CSECT                                                          08141000
DLIST1  SDUMP HDR='ERROR DURING RESTART PROCESSING - IEFXB609',       XX08142000
               SDATA=(SQA,NUC,LSQA,RGN,LPA,TRT,SWA),MF=L                08143000
LENLIST1 DC A(*-DLIST1)                                                 08144000
@DATD    DSECT                                                          08145000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                08146000
@ENDDATD EQU   *                                                        08147000
IEFXB609 CSECT                                                          08148000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       08149000
@01      EQU   01                                                       08150000
@02      EQU   02                                                       08151000
@03      EQU   03                                                       08152000
@04      EQU   04                                                       08153000
@05      EQU   05                                                       08154000
@06      EQU   06                                                       08155000
@07      EQU   07                                                       08156000
@08      EQU   08                                                       08157000
@09      EQU   09                                                       08158000
@10      EQU   10                                                       08159000
@11      EQU   11                                                       08160000
@12      EQU   12                                                       08161000
@13      EQU   13                                                       08162000
@14      EQU   14                                                       08163000
@15      EQU   15                                                       08164000
SDWAPTR  EQU   @01                                                      08165000
IOBUFAD  EQU   @07                                                      08166000
RCODE    EQU   @15                                                      08167000
PARMPTR  EQU   @01                                                      08168000
DCBREG   EQU   @02                                                      08169000
R1       EQU   @01                                                      08170000
R2       EQU   @02                                                      08171000
R0       EQU   @00                                                      08172000
GPR02F   EQU   @02                                                      08173000
GPR01P   EQU   @01                                                      08174000
GPR15P   EQU   @15                                                      08175000
GPR00F   EQU   @00                                                      08176000
GPR00P   EQU   @00                                                      08177000
SWAMGPTR EQU   @15                                                      08178000
REG9X    EQU   @09                                                      08179000
R14      EQU   @14                                                      08180000
R15      EQU   @15                                                      08181000
GPR14P   EQU   @14                                                      08182000
GPR01F   EQU   @01                                                      08183000
CVTPTR   EQU   0                                                        08184000
JFCBE    EQU   0                                                        08185000
JFCBEXTR EQU   JFCBE                                                    08186000
JFCBFLAG EQU   JFCBE+4                                                  08187000
JFCBEOPN EQU   JFCBFLAG                                                 08188000
JFCGROUP EQU   JFCBE+36                                                 08189000
INFMJFCB EQU   0                                                        08190000
JFCBDSNM EQU   INFMJFCB                                                 08191000
JFCBELNM EQU   INFMJFCB+44                                              08192000
JFCBTSDM EQU   INFMJFCB+52                                              08193000
JFCCAT   EQU   JFCBTSDM                                                 08194000
JFCBDSCB EQU   INFMJFCB+53                                              08195000
JFCFCBID EQU   INFMJFCB+56                                              08196000
JFCBFRID EQU   JFCFCBID                                                 08197000
JFCBADBF EQU   INFMJFCB+60                                              08198000
JFCNLREC EQU   INFMJFCB+62                                              08199000
JFCBLTYP EQU   INFMJFCB+66                                              08200000
JFCBOTTR EQU   INFMJFCB+67                                              08201000
JFCBUFOF EQU   JFCBOTTR                                                 08202000
JFCBFLSQ EQU   JFCBOTTR+1                                               08203000
JFCFUNC  EQU   JFCBFLSQ                                                 08204000
JFCBVLSQ EQU   INFMJFCB+70                                              08205000
JFCBMASK EQU   INFMJFCB+72                                              08206000
JFCBFLG1 EQU   JFCBMASK+5                                               08207000
JFCOPEN  EQU   JFCBFLG1                                                 08208000
JFCBFLG2 EQU   JFCBMASK+6                                               08209000
JFCDEFER EQU   JFCBFLG2                                                 08210000
JFCBCRDT EQU   INFMJFCB+80                                              08211000
JFCBXPDT EQU   INFMJFCB+83                                              08212000
JFCBIND1 EQU   INFMJFCB+86                                              08213000
JFCGDG   EQU   JFCBIND1                                                 08214000
JFCBIND2 EQU   INFMJFCB+87                                              08215000
JFCSHARE EQU   JFCBIND2                                                 08216000
JFCENT   EQU   JFCBIND2                                                 08217000
JFCAMPTR EQU   INFMJFCB+88                                              08218000
JFCBUFRQ EQU   JFCAMPTR                                                 08219000
JFCBUFNO EQU   JFCBUFRQ                                                 08220000
JFCBGNCP EQU   JFCAMPTR+1                                               08221000
JFCBHIAR EQU   JFCBGNCP                                                 08222000
JFCBFALN EQU   JFCBHIAR                                                 08223000
JFCBFTEK EQU   JFCBFALN                                                 08224000
JFCBBFTA EQU   JFCBFTEK                                                 08225000
JFCEROPT EQU   INFMJFCB+92                                              08226000
JFCTRTCH EQU   INFMJFCB+93                                              08227000
JFCBX    EQU   0                                                        08228000
JFCBXTTR EQU   JFCBX                                                    08229000
JFCBXVOL EQU   JFCBX+4                                                  08230000
JFCBXNAM EQU   JFCBX+96                                                 08231000
JFCBXDEV EQU   JFCBX+140                                                08232000
INDMSIOT EQU   0                                                        08233000
SIOTDSKA EQU   INDMSIOT                                                 08234000
SIOTTYPE EQU   INDMSIOT+3                                               08235000
SCTDDNAM EQU   INDMSIOT+4                                               08236000
SIOTDEST EQU   INDMSIOT+12                                              08237000
SCTUSADD EQU   INDMSIOT+20                                              08238000
SIOTUNAF EQU   SCTUSADD                                                 08239000
SCTPSIOT EQU   INDMSIOT+28                                              08240000
SCTPJFCB EQU   INDMSIOT+32                                              08241000
SIOTBYT1 EQU   INDMSIOT+43                                              08242000
SIOTOCKP EQU   SIOTBYT1                                                 08243000
SIOTHOLD EQU   SIOTBYT1                                                 08244000
SIOVAMDS EQU   SIOTBYT1                                                 08245000
SCTDDINO EQU   INDMSIOT+44                                              08246000
SIOTBYT3 EQU   INDMSIOT+46                                              08247000
SIOALIAS EQU   SIOTBYT3                                                 08248000
S3400OFF EQU   SIOTBYT3                                                 08249000
SIOTTSTC EQU   INDMSIOT+47                                              08250000
SIOTTRKM EQU   SIOTTSTC                                                 08251000
SIOTDSNM EQU   SIOTTSTC                                                 08252000
SCTVOLCT EQU   INDMSIOT+49                                              08253000
SIOTBYT0 EQU   INDMSIOT+52                                              08254000
SIOTSSDS EQU   SIOTBYT0                                                 08255000
SIOTDYAL EQU   SIOTBYT0                                                 08256000
SCTNMBUT EQU   INDMSIOT+53                                              08257000
SIOTVLCT EQU   INDMSIOT+54                                              08258000
SCTSDISP EQU   INDMSIOT+55                                              08259000
S3400DSP EQU   SCTSDISP                                                 08260000
SIOTPRIV EQU   SCTSDISP                                                 08261000
SIOTPASS EQU   SCTSDISP                                                 08262000
SIOTKEEP EQU   SCTSDISP                                                 08263000
SIOTDLET EQU   SCTSDISP                                                 08264000
SIOTCTLG EQU   SCTSDISP                                                 08265000
SIOTUNCT EQU   SCTSDISP                                                 08266000
SCTSBYT1 EQU   INDMSIOT+56                                              08267000
SCTDUMMY EQU   SCTSBYT1                                                 08268000
SCTSYSIN EQU   SCTSBYT1                                                 08269000
SIOTCCAT EQU   SCTSBYT1                                                 08270000
SCTUNAFF EQU   SCTSBYT1                                                 08271000
SIOTJSCT EQU   SCTSBYT1                                                 08272000
SCTSBYT2 EQU   INDMSIOT+57                                              08273000
SCTVOLAF EQU   SCTSBYT2                                                 08274000
SCTDEFER EQU   SCTSBYT2                                                 08275000
SCTSBYT3 EQU   INDMSIOT+58                                              08276000
SCTDSNRF EQU   SCTSBYT3                                                 08277000
SCTVREF  EQU   SCTSBYT3                                                 08278000
SCTSYSOU EQU   SCTSBYT3                                                 08279000
SCTSNEW  EQU   SCTSBYT3                                                 08280000
SCTSOLD  EQU   SCTSBYT3                                                 08281000
SCTSBYT4 EQU   INDMSIOT+59                                              08282000
SCTSGDGS EQU   SCTSBYT4                                                 08283000
SCTUTYPE EQU   INDMSIOT+60                                              08284000
SIOTDEVT EQU   SCTUTYPE                                                 08285000
SIOUBYT2 EQU   SIOTDEVT+1                                               08286000
SIOUBYT3 EQU   SIOTDEVT+2                                               08287000
SIO3TAPE EQU   SIOUBYT3                                                 08288000
SIO3DACC EQU   SIOUBYT3                                                 08289000
SIO3DISP EQU   SIOUBYT3                                                 08290000
SIO3UREC EQU   SIOUBYT3                                                 08291000
SIOUBYT4 EQU   SIOTDEVT+3                                               08292000
SIOUCNVT EQU   SCTUTYPE+4                                               08293000
SIOUCBAD EQU   SCTUTYPE+5                                               08294000
SCTOUTNM EQU   INDMSIOT+68                                              08295000
SCTOUTNO EQU   INDMSIOT+76                                              08296000
SCTOUTPN EQU   INDMSIOT+80                                              08297000
SIOTBYT4 EQU   INDMSIOT+81                                              08298000
SIOTALTD EQU   INDMSIOT+92                                              08299000
SIOTNPRV EQU   SIOTALTD                                                 08300000
SIOTOUTC EQU   INDMSIOT+96                                              08301000
SIOTBYT2 EQU   INDMSIOT+103                                             08302000
SIOTCALC EQU   SIOTBYT2                                                 08303000
SIOTCNEW EQU   SIOTBYT2                                                 08304000
SIOTSSNM EQU   INDMSIOT+104                                             08305000
SCTANAME EQU   INDMSIOT+122                                             08306000
INSMSCT  EQU   0                                                        08307000
SCTSSTAT EQU   INSMSCT+4                                                08308000
EAADDRBT EQU   SCTSSTAT                                                 08309000
SCTSEXEC EQU   INSMSCT+8                                                08310000
SCTLALOC EQU   INSMSCT+10                                               08311000
SCTFSIOT EQU   INSMSCT+12                                               08312000
SCTANSCT EQU   INSMSCT+20                                               08313000
SCTLSIOT EQU   INSMSCT+24                                               08314000
SCTDDNT  EQU   INSMSCT+28                                               08315000
SCTSCLPC EQU   INSMSCT+44                                               08316000
SCTSNAME EQU   INSMSCT+52                                               08317000
SCTSNUMB EQU   INSMSCT+64                                               08318000
SCTSTYPE EQU   INSMSCT+67                                               08319000
SCTGOSTP EQU   SCTSTYPE                                                 08320000
SCTXBTTR EQU   INSMSCT+68                                               08321000
SCTMSADR EQU   INSMSCT+72                                               08322000
SCTPCAT  EQU   INSMSCT+84                                               08323000
SCTMSSZE EQU   INSMSCT+88                                               08324000
SCTSDPTY EQU   INSMSCT+94                                               08325000
SCTSTAT2 EQU   INSMSCT+104                                              08326000
SCTBCT   EQU   SCTSTAT2                                                 08327000
SCTCDENT EQU   INSMSCT+118                                              08328000
SCTCATCT EQU   INSMSCT+166                                              08329000
SCTSTEND EQU   INSMSCT+172                                              08330000
SCTSYSCK EQU   SCTSTEND                                                 08331000
@NM00042 EQU   0                                                        08332000
SCTABCND EQU   @NM00042                                                 08333000
INJMJCT  EQU   0                                                        08334000
JCTDSKAD EQU   INJMJCT                                                  08335000
JCTJSTAT EQU   INJMJCT+5                                                08336000
INDMCTLG EQU   JCTJSTAT                                                 08337000
JCTJBYTE EQU   INJMJCT+7                                                08338000
JCTJMGLV EQU   JCTJBYTE                                                 08339000
JCTJNAME EQU   INJMJCT+8                                                08340000
JCTGDGNT EQU   INJMJCT+28                                               08341000
JCTSDKAD EQU   INJMJCT+32                                               08342000
JCTCCODE EQU   INJMJCT+54                                               08343000
JCTRSW1  EQU   INJMJCT+86                                               08344000
JCTCKFT  EQU   JCTRSW1                                                  08345000
JCTRSW2  EQU   INJMJCT+87                                               08346000
JCTSYSCK EQU   JCTRSW2                                                  08347000
JCTDEVT  EQU   INJMJCT+100                                              08348000
JCTCKTTR EQU   INJMJCT+104                                              08349000
JCTNRCKP EQU   INJMJCT+108                                              08350000
JCTVOLSQ EQU   INJMJCT+110                                              08351000
JCTJSB   EQU   INJMJCT+111                                              08352000
JCTSSTR  EQU   INJMJCT+112                                              08353000
JCTSTAT2 EQU   INJMJCT+116                                              08354000
JCTCKIDT EQU   INJMJCT+118                                              08355000
IEFAACTB EQU   0                                                        08356000
LCT      EQU   0                                                        08357000
LCTQDRTY EQU   LCT                                                      08358000
LCTSRTAD EQU   LCT+4                                                    08359000
LCTTCBAD EQU   LCT+8                                                    08360000
LCTQENTY EQU   LCT+12                                                   08361000
@NM00069 EQU   LCTQENTY                                                 08362000
LCTJCTAD EQU   LCT+16                                                   08363000
LCTSCTAD EQU   LCT+20                                                   08364000
LCTSCTDA EQU   LCT+24                                                   08365000
LCTWORKA EQU   LCTSCTDA                                                 08366000
LCTSCTVA EQU   LCTWORKA                                                 08367000
LCTPSPAR EQU   LCT+28                                                   08368000
LCTERROR EQU   LCT+32                                                   08369000
LCTERR   EQU   LCTERROR                                                 08370000
LCTCMCBA EQU   LCT+52                                                   08371000
LCTNSPAD EQU   LCT+56                                                   08372000
LCTJFCBH EQU   LCT+57                                                   08373000
LCTSMBAD EQU   LCT+60                                                   08374000
LCTCOMCD EQU   LCT+68                                                   08375000
LCTRTRN  EQU   LCT+72                                                   08376000
LCTSREG  EQU   LCTRTRN                                                  08377000
@NM00096 EQU   LCT+76                                                   08378000
LCTINTSW EQU   @NM00096                                                 08379000
LCTTMWRK EQU   LCT+80                                                   08380000
LCTTJTU4 EQU   LCTTMWRK                                                 08381000
LCTTSTL4 EQU   LCTTMWRK+4                                               08382000
LCTTSTR4 EQU   LCTTMWRK+8                                               08383000
LCTSMF   EQU   LCTTSTR4                                                 08384000
LCTTMBYT EQU   LCTSMF                                                   08385000
LCTTSTU4 EQU   LCTTMWRK+12                                              08386000
LCTJOBLB EQU   LCT+96                                                   08387000
LCTATLST EQU   LCT+100                                                  08388000
QMGR1    EQU   LCT+248                                                  08389000
LCTECBAD EQU   LCT+328                                                  08390000
ECBLIST  EQU   LCTECBAD                                                 08391000
LCTIDENT EQU   LCT+332                                                  08392000
LCTSPIL  EQU   LCTIDENT+4                                               08393000
LCTALCFG EQU   LCTSPIL+2                                                08394000
LCTTSRB4 EQU   LCT+348                                                  08395000
LCTENTR  EQU   LCT+352                                                  08396000
LCTEXIT  EQU   LCTENTR                                                  08397000
LCTOPSW1 EQU   LCTEXIT                                                  08398000
@NM00122 EQU   LCT+356                                                  08399000
LCTOPSW2 EQU   @NM00122                                                 08400000
LCTCKRST EQU   LCTOPSW2                                                 08401000
LCTJSCB  EQU   LCT+360                                                  08402000
LCTOPSW3 EQU   LCTJSCB                                                  08403000
LCTJCTDA EQU   LCT+408                                                  08404000
LCTSTATA EQU   LCT+416                                                  08405000
LCTSTATB EQU   LCT+417                                                  08406000
LCTRFB   EQU   LCT+418                                                  08407000
LCTRFBDC EQU   LCTRFB                                                   08408000
@NM00135 EQU   LCT+420                                                  08409000
LCTINTS2 EQU   @NM00135+1                                               08410000
CVTMAP   EQU   0                                                        08411000
CVTTCBP  EQU   CVTMAP                                                   08412000
CVTDAR   EQU   CVTMAP+72                                                08413000
CVTFLGS1 EQU   CVTDAR                                                   08414000
CVTDCB   EQU   CVTMAP+116                                               08415000
CVTIOQET EQU   CVTMAP+120                                               08416000
CVTIERLC EQU   CVTMAP+144                                               08417000
CVTHEAD  EQU   CVTMAP+160                                               08418000
CVTSV76C EQU   CVTHEAD                                                  08419000
CVTOPTA  EQU   CVTMAP+182                                               08420000
CVTOPTB  EQU   CVTMAP+183                                               08421000
CVTGTF   EQU   CVTMAP+236                                               08422000
CVTGTFST EQU   CVTGTF                                                   08423000
CVTGTFS  EQU   CVTGTFST                                                 08424000
CVTSTATE EQU   CVTGTFST                                                 08425000
CVTTMODE EQU   CVTGTFST                                                 08426000
CVTFORM  EQU   CVTGTFST                                                 08427000
CVTAQAVT EQU   CVTMAP+240                                               08428000
CVTTCMFG EQU   CVTAQAVT                                                 08429000
CVTVOLM2 EQU   CVTMAP+244                                               08430000
CVTTATA  EQU   CVTVOLM2                                                 08431000
CVTTSKS  EQU   CVTTATA                                                  08432000
CVTVOLF2 EQU   CVTTSKS                                                  08433000
CVTTAT   EQU   CVTTATA+1                                                08434000
CVTATER  EQU   CVTMAP+248                                               08435000
CVTEXT1  EQU   CVTMAP+252                                               08436000
CVTPURG  EQU   CVTMAP+260                                               08437000
CVTQMSG  EQU   CVTMAP+268                                               08438000
CVTDMSR  EQU   CVTMAP+272                                               08439000
CVTRSV37 EQU   CVTDMSR                                                  08440000
CVTDMSRF EQU   CVTRSV37                                                 08441000
CVTJESCT EQU   CVTMAP+296                                               08442000
CVTERPV  EQU   CVTMAP+316                                               08443000
CVTINTLA EQU   CVTMAP+320                                               08444000
CVTAPF   EQU   CVTMAP+324                                               08445000
CVTEXT2  EQU   CVTMAP+328                                               08446000
CVTHJES  EQU   CVTMAP+332                                               08447000
CVTPGSIA EQU   CVTMAP+348                                               08448000
CVTA1F1  EQU   CVTMAP+356                                               08449000
CVTSYSK  EQU   CVTMAP+357                                               08450000
CVTVOLM1 EQU   CVTMAP+380                                               08451000
CVTVOLF1 EQU   CVTVOLM1                                                 08452000
CVTATMCT EQU   CVTMAP+388                                               08453000
CVTXTNT1 EQU   0                                                        08454000
CVTXTNT2 EQU   0                                                        08455000
CVTDSSV  EQU   CVTXTNT2                                                 08456000
CVTFLGBT EQU   CVTXTNT2+5                                               08457000
CVTQID   EQU   CVTXTNT2+24                                              08458000
CVTRV400 EQU   CVTXTNT2+52                                              08459000
CVTRV409 EQU   CVTXTNT2+53                                              08460000
CVTATCVT EQU   CVTXTNT2+64                                              08461000
CVTRV429 EQU   CVTXTNT2+84                                              08462000
CVTRV438 EQU   CVTXTNT2+85                                              08463000
CVTRV457 EQU   CVTXTNT2+112                                             08464000
CVTRV466 EQU   CVTXTNT2+113                                             08465000
CVTFIX   EQU   0                                                        08466000
CVTRELNO EQU   CVTFIX+252                                               08467000
TCBFIX   EQU   0                                                        08468000
TCBFRS   EQU   TCBFIX                                                   08469000
TCB      EQU   0                                                        08470000
TCBPIE   EQU   TCB+4                                                    08471000
TCBPMASK EQU   TCBPIE                                                   08472000
TCBCMP   EQU   TCB+16                                                   08473000
TCBCMPF  EQU   TCBCMP                                                   08474000
TCBCPP   EQU   TCBCMPF                                                  08475000
TCBSTCC  EQU   TCBCMPF                                                  08476000
TCBCDBL  EQU   TCBCMPF                                                  08477000
TCBCWTO  EQU   TCBCMPF                                                  08478000
TCBCIND  EQU   TCBCMPF                                                  08479000
TCBCMSG  EQU   TCBCMPF                                                  08480000
TCBTRN   EQU   TCB+20                                                   08481000
TCBABF   EQU   TCBTRN                                                   08482000
TCBMSS   EQU   TCB+24                                                   08483000
TCBPKF   EQU   TCB+28                                                   08484000
TCBFLGS  EQU   TCB+29                                                   08485000
TCBFLGS1 EQU   TCBFLGS                                                  08486000
TCBFLGS2 EQU   TCBFLGS+1                                                08487000
TCBFLGS3 EQU   TCBFLGS+2                                                08488000
TCBFLGS4 EQU   TCBFLGS+3                                                08489000
TCBFLGS5 EQU   TCBFLGS+4                                                08490000
TCBABWF  EQU   TCBFLGS5                                                 08491000
TCBJPQ   EQU   TCB+44                                                   08492000
TCBPURGE EQU   TCBJPQ                                                   08493000
TCBGRS   EQU   TCB+48                                                   08494000
TCBFSA   EQU   TCB+112                                                  08495000
TCBTME   EQU   TCB+120                                                  08496000
TCBJSTCB EQU   TCB+124                                                  08497000
TCBLTC   EQU   TCB+136                                                  08498000
TCBTSFLG EQU   TCB+148                                                  08499000
TCBTSTSK EQU   TCBTSFLG                                                 08500000
TCBSTAB  EQU   TCB+160                                                  08501000
TCBNSTAE EQU   TCBSTAB                                                  08502000
TCBTCT   EQU   TCB+164                                                  08503000
TCBTCTGF EQU   TCBTCT                                                   08504000
TCBSCNDY EQU   TCB+172                                                  08505000
TCBNDSP  EQU   TCBSCNDY                                                 08506000
TCBNDSP1 EQU   TCBNDSP+1                                                08507000
TCBNDSP2 EQU   TCBNDSP+2                                                08508000
TCBNDSP3 EQU   TCBNDSP+3                                                08509000
TCBJSCB  EQU   TCB+180                                                  08510000
TCBRECDE EQU   TCBJSCB                                                  08511000
TCBEXT1  EQU   TCB+196                                                  08512000
TCBBITS  EQU   TCB+200                                                  08513000
TCBNDSP4 EQU   TCBBITS                                                  08514000
TCBNDSP5 EQU   TCBBITS+1                                                08515000
TCBFLGS6 EQU   TCBBITS+2                                                08516000
TCBFLGS7 EQU   TCBBITS+3                                                08517000
TCBDAR   EQU   TCB+204                                                  08518000
TCBDARC  EQU   TCBDAR                                                   08519000
TCBEXT2  EQU   TCB+208                                                  08520000
TCBFOE   EQU   TCB+244                                                  08521000
TCBESTAE EQU   TCB+264                                                  08522000
TCBESTRM EQU   TCBESTAE+1                                               08523000
TCBFBYT1 EQU   TCB+276                                                  08524000
TCBFBYT2 EQU   TCB+277                                                  08525000
TCBRV124 EQU   TCB+278                                                  08526000
TCBRV133 EQU   TCB+279                                                  08527000
TCBXTNT2 EQU   0                                                        08528000
TCBGTF   EQU   TCBXTNT2                                                 08529000
TCBTFLG  EQU   TCBGTF                                                   08530000
TCBRV146 EQU   TCBXTNT2+28                                              08531000
TCBRV155 EQU   TCBXTNT2+29                                              08532000
TCBRV164 EQU   TCBXTNT2+30                                              08533000
TCBRV173 EQU   TCBXTNT2+31                                              08534000
QMPA     EQU   0                                                        08535000
QMNAM    EQU   QMPA                                                     08536000
QMPOP    EQU   QMPA+8                                                   08537000
QMSTA    EQU   QMPA+16                                                  08538000
QMPCL    EQU   QMPA+32                                                  08539000
QMPCMNC  EQU   QMPCL                                                    08540000
QMPCM    EQU   QMPCMNC                                                  08541000
QMPNC    EQU   QMPCMNC                                                  08542000
QMPACL   EQU   QMPCL+1                                                  08543000
SWAQMPA  EQU   0                                                        08544000
TIOT1    EQU   0                                                        08545000
TIOENTRY EQU   0                                                        08546000
TIOESTTA EQU   TIOENTRY+1                                               08547000
TIOERLOC EQU   TIOENTRY+2                                               08548000
TIOELINK EQU   TIOERLOC+1                                               08549000
TIOESYOT EQU   TIOELINK                                                 08550000
TIOEDDNM EQU   TIOENTRY+4                                               08551000
TIOEJFCB EQU   TIOENTRY+12                                              08552000
TIOESTTC EQU   TIOENTRY+15                                              08553000
TIOESTTB EQU   TIOENTRY+16                                              08554000
TIOEFSRT EQU   TIOENTRY+17                                              08555000
POOLSTAR EQU   TIOENTRY+20                                              08556000
CHAIN    EQU   0                                                        08557000
CHFLG    EQU   CHAIN+4                                                  08558000
CHSTS    EQU   CHFLG+2                                                  08559000
CHACT    EQU   CHFLG+3                                                  08560000
CHIFY    EQU   CHACT                                                    08561000
CHKEY    EQU   CHAIN+8                                                  08562000
CHPARM   EQU   CHKEY                                                    08563000
CHPKE    EQU   CHAIN+28                                                 08564000
CHTJID   EQU   CHAIN+30                                                 08565000
CHPROCSN EQU   CHAIN+32                                                 08566000
CHACT1   EQU   CHPROCSN+3                                               08567000
CHASM    EQU   CHAIN+40                                                 08568000
CHCIBP   EQU   CHASM+4                                                  08569000
CHRGNSZ  EQU   CHASM+8                                                  08570000
CHCECB   EQU   CHASM+20                                                 08571000
CHSTEP   EQU   CHASM+24                                                 08572000
CHSWT    EQU   CHSTEP                                                   08573000
CHSHORT  EQU   CHASM+32                                                 08574000
IEZJSCB  EQU   0                                                        08575000
JSCBSEC1 EQU   IEZJSCB+188                                              08576000
JSCHPCE  EQU   JSCBSEC1+4                                               08577000
JSCBPCC  EQU   JSCBSEC1+16                                              08578000
JSCBDCB  EQU   JSCBSEC1+36                                              08579000
JSCBOPTS EQU   JSCBSEC1+48                                              08580000
JSCBSWT1 EQU   JSCBSEC1+55                                              08581000
JSCBWTP  EQU   JSCBSEC1+64                                              08582000
JSCBWTFG EQU   JSCBWTP                                                  08583000
JSCBEND1 EQU   IEZJSCB+260                                              08584000
UCB      EQU   0                                                        08585000
UCBOB    EQU   0                                                        08586000
UCBJBNR  EQU   UCBOB                                                    08587000
UCBFL5   EQU   UCBOB+1                                                  08588000
UCBAF    EQU   UCBFL5                                                   08589000
UCBSTAT  EQU   UCBOB+3                                                  08590000
UCBCHAN  EQU   UCBOB+4                                                  08591000
UCBSFLS  EQU   UCBOB+6                                                  08592000
UCBFLA   EQU   UCBSFLS                                                  08593000
UCBFL1   EQU   UCBFLA                                                   08594000
UCBBSY   EQU   UCBFL1                                                   08595000
UCBNRY   EQU   UCBFL1                                                   08596000
UCBPST   EQU   UCBFL1                                                   08597000
UCBCUB   EQU   UCBFL1                                                   08598000
UCBFLB   EQU   UCBSFLS+1                                                08599000
UCBCHM   EQU   UCBOB+8                                                  08600000
UCBCHM1  EQU   UCBCHM                                                   08601000
UCBPTH0  EQU   UCBCHM1                                                  08602000
UCBPTH1  EQU   UCBCHM1                                                  08603000
UCBWGT   EQU   UCBOB+12                                                 08604000
UCBTYP   EQU   UCBOB+16                                                 08605000
UCBTBYT1 EQU   UCBTYP                                                   08606000
UCB1FEA5 EQU   UCBTBYT1                                                 08607000
UCB1FEA6 EQU   UCBTBYT1                                                 08608000
UCBTBYT2 EQU   UCBTYP+1                                                 08609000
UCB2OPT2 EQU   UCBTBYT2                                                 08610000
UCBDUDN1 EQU   UCB2OPT2                                                 08611000
UCB2OPT3 EQU   UCBTBYT2                                                 08612000
UCBDUDN2 EQU   UCB2OPT3                                                 08613000
UCB2OPT4 EQU   UCBTBYT2                                                 08614000
UCBRWTAU EQU   UCB2OPT4                                                 08615000
UCB2OPT6 EQU   UCBTBYT2                                                 08616000
UCB2OPT7 EQU   UCBTBYT2                                                 08617000
UCBTBYT3 EQU   UCBTYP+2                                                 08618000
UCBDVCLS EQU   UCBTBYT3                                                 08619000
UCB3DACC EQU   UCBDVCLS                                                 08620000
UCBTBYT4 EQU   UCBTYP+3                                                 08621000
UCBEXTPT EQU   UCBOB+20                                                 08622000
UCBFLC   EQU   UCBEXTPT                                                 08623000
UCBDEV   EQU   UCBOB+24                                                 08624000
UCBCMEXT EQU   0                                                        08625000
UCBATI   EQU   UCBCMEXT+3                                               08626000
@NM00162 EQU   UCBATI                                                   08627000
UCBFLP1  EQU   UCBCMEXT+5                                               08628000
UCBMT    EQU   0                                                        08629000
UCBOCR   EQU   0                                                        08630000
UCB3540X EQU   0                                                        08631000
UCBDKBYT EQU   UCB3540X+6                                               08632000
UCB3800X EQU   0                                                        08633000
UCBOPTNS EQU   UCB3800X                                                 08634000
UCBACTIV EQU   UCB3800X+3                                               08635000
UCBMDRBF EQU   UCB3800X+36                                              08636000
UCBUCS   EQU   0                                                        08637000
UCBUCSOP EQU   UCBUCS+4                                                 08638000
UCBFCBOP EQU   UCBUCS+5                                                 08639000
SWAEPA   EQU   0                                                        08640000
SWBLKPTR EQU   SWAEPA                                                   08641000
SWVAFW   EQU   SWAEPA+4                                                 08642000
SWVA     EQU   SWVAFW                                                   08643000
SWBLKID  EQU   SWVAFW+3                                                 08644000
SWLNGTH  EQU   SWAEPA+8                                                 08645000
SWCHNPTR EQU   SWAEPA+12                                                08646000
SWAPFX   EQU   0                                                        08647000
SWPSTA   EQU   SWAPFX+4                                                 08648000
GDA      EQU   0                                                        08649000
GVSMFLAG EQU   GDA                                                      08650000
GDAFLAGS EQU   GVSMFLAG                                                 08651000
PASTRT   EQU   GDA+16                                                   08652000
VRPOSTQ  EQU   GDA+32                                                   08653000
VRWAITQ  EQU   GDA+40                                                   08654000
S99RBPTR EQU   0                                                        08655000
S99RBPND EQU   S99RBPTR                                                 08656000
S99RB    EQU   0                                                        08657000
S99RBLN  EQU   S99RB                                                    08658000
S99VERB  EQU   S99RB+1                                                  08659000
S99FLAG1 EQU   S99RB+2                                                  08660000
S99FLG11 EQU   S99FLAG1                                                 08661000
S99RSC   EQU   S99RB+4                                                  08662000
S99TXTPP EQU   S99RB+8                                                  08663000
S99RSV01 EQU   S99RB+12                                                 08664000
S99FLAG2 EQU   S99RB+16                                                 08665000
S99FLG21 EQU   S99FLAG2                                                 08666000
S99WTDSN EQU   S99FLG21                                                 08667000
S99WTUNT EQU   S99FLG21                                                 08668000
S99FLG22 EQU   S99FLAG2+1                                               08669000
S99UDEVT EQU   S99FLG22                                                 08670000
S99TUPL  EQU   0                                                        08671000
S99TUPTR EQU   S99TUPL                                                  08672000
S99TUP   EQU   0                                                        08673000
S99TUNIT EQU   0                                                        08674000
S99TUENT EQU   S99TUNIT+4                                               08675000
S99TUFLD EQU   0                                                        08676000
EDTHDR   EQU   0                                                        08677000
EDTLUVSP EQU   EDTHDR                                                   08678000
EDTGENSP EQU   EDTHDR+4                                                 08679000
EDTGRPSP EQU   EDTHDR+8                                                 08680000
EDTUCBSP EQU   EDTHDR+12                                                08681000
EDTMSKTP EQU   EDTHDR+16                                                08682000
LUVSECT  EQU   0                                                        08683000
LUVHDR   EQU   LUVSECT                                                  08684000
LUVENTNO EQU   LUVHDR                                                   08685000
LUVENTLN EQU   LUVHDR+4                                                 08686000
LUVENTRY EQU   0                                                        08687000
UNITNAME EQU   LUVENTRY                                                 08688000
LUVGMTP  EQU   LUVENTRY+12                                              08689000
LUVGENNO EQU   LUVENTRY+16                                              08690000
LUVFLAGS EQU   LUVENTRY+24                                              08691000
LUVMGENS EQU   LUVFLAGS                                                 08692000
GENSECT  EQU   0                                                        08693000
GENHDR   EQU   GENSECT                                                  08694000
GENENTRY EQU   0                                                        08695000
GRPTRTAB EQU   0                                                        08696000
GRPSECT  EQU   0                                                        08697000
GRPHDR   EQU   GRPSECT                                                  08698000
GRPENTRY EQU   0                                                        08699000
GRPUCBP  EQU   GRPENTRY+8                                               08700000
EUCBSECT EQU   0                                                        08701000
EUCBHDR  EQU   EUCBSECT                                                 08702000
EUCBENTY EQU   0                                                        08703000
GRMSKTAB EQU   0                                                        08704000
GMTHDR   EQU   GRMSKTAB                                                 08705000
GMTENTRY EQU   0                                                        08706000
DSAB     EQU   0                                                        08707000
DSABFCHN EQU   DSAB+4                                                   08708000
DSABTIOT EQU   DSAB+16                                                  08709000
DSABGIDP EQU   DSAB+24                                                  08710000
DSABANMP EQU   DSAB+28                                                  08711000
DSABORG  EQU   DSAB+32                                                  08712000
DSABORG1 EQU   DSABORG                                                  08713000
DSABORG2 EQU   DSABORG+1                                                08714000
DSABFLG1 EQU   DSAB+34                                                  08715000
DSABFLG2 EQU   DSAB+35                                                  08716000
DSABFLG3 EQU   DSAB+36                                                  08717000
DSABCATL EQU   DSABFLG3                                                 08718000
DSABFLG4 EQU   DSAB+37                                                  08719000
DSABCKVL EQU   DSABFLG4                                                 08720000
DSABANMI EQU   0                                                        08721000
DSABGIDL EQU   0                                                        08722000
QDB      EQU   0                                                        08723000
QDBFELMP EQU   QDB+12                                                   08724000
QDBLELMP EQU   QDB+16                                                   08725000
SWAMMEPA EQU   0                                                        08726000
SWBUFPTR EQU   SWAMMEPA                                                 08727000
SWASNVA  EQU   SWBUFPTR                                                 08728000
SWROWVA  EQU   SWAMMEPA+4                                               08729000
SWWRTID  EQU   SWAMMEPA+7                                               08730000
JESCT    EQU   0                                                        08731000
JESWAA   EQU   JESCT+8                                                  08732000
JESQMGR  EQU   JESCT+12                                                 08733000
JESSSREQ EQU   JESCT+20                                                 08734000
JESALLOC EQU   JESCT+32                                                 08735000
JESUNALC EQU   JESCT+36                                                 08736000
JESCATL  EQU   JESCT+40                                                 08737000
SWAMGR   EQU   0                                                        08738000
GDGNT    EQU   0                                                        08739000
GNTNEXTP EQU   GDGNT                                                    08740000
GNTGRPEN EQU   GDGNT+8                                                  08741000
GNTENT   EQU   GDGNT+164                                                08742000
SDWA     EQU   0                                                        08743000
SDWAPARM EQU   SDWA                                                     08744000
SDWAFIOB EQU   SDWA+4                                                   08745000
SDWAABCC EQU   SDWAFIOB                                                 08746000
SDWACMPF EQU   SDWAABCC                                                 08747000
SDWAREQ  EQU   SDWACMPF                                                 08748000
SDWACTL1 EQU   SDWA+8                                                   08749000
SDWACMKA EQU   SDWACTL1                                                 08750000
SDWAMWPA EQU   SDWACTL1+1                                               08751000
SDWAPMKA EQU   SDWACTL1+4                                               08752000
SDWACTL2 EQU   SDWA+16                                                  08753000
SDWACMKP EQU   SDWACTL2                                                 08754000
SDWAMWPP EQU   SDWACTL2+1                                               08755000
SDWAPMKP EQU   SDWACTL2+4                                               08756000
SDWAGRSV EQU   SDWA+24                                                  08757000
SDWANAME EQU   SDWA+88                                                  08758000
SDWAEC1  EQU   SDWA+104                                                 08759000
SDWAEMK1 EQU   SDWAEC1                                                  08760000
SDWAMWP1 EQU   SDWAEC1+1                                                08761000
SDWAINT1 EQU   SDWAEC1+2                                                08762000
SDWANXT1 EQU   SDWAEC1+4                                                08763000
SDWAAEC1 EQU   SDWA+112                                                 08764000
SDWAILC1 EQU   SDWAAEC1+1                                               08765000
SDWAINC1 EQU   SDWAAEC1+2                                               08766000
SDWAICD1 EQU   SDWAINC1+1                                               08767000
SDWAEC2  EQU   SDWA+120                                                 08768000
SDWAEMK2 EQU   SDWAEC2                                                  08769000
SDWAMWP2 EQU   SDWAEC2+1                                                08770000
SDWAINT2 EQU   SDWAEC2+2                                                08771000
SDWANXT2 EQU   SDWAEC2+4                                                08772000
SDWAAEC2 EQU   SDWA+128                                                 08773000
SDWAILC2 EQU   SDWAAEC2+1                                               08774000
SDWAINC2 EQU   SDWAAEC2+2                                               08775000
SDWAICD2 EQU   SDWAINC2+1                                               08776000
SDWASRSV EQU   SDWA+136                                                 08777000
SDWAIDNT EQU   SDWA+200                                                 08778000
SDWAMCH  EQU   SDWA+204                                                 08779000
SDWASTCK EQU   SDWAMCH                                                  08780000
SDWAMCHI EQU   SDWAMCH+8                                                08781000
SDWAMCHS EQU   SDWAMCHI                                                 08782000
SDWAMCHD EQU   SDWAMCHI+1                                               08783000
SDWARSR1 EQU   SDWAMCH+12                                               08784000
SDWARSR2 EQU   SDWAMCH+13                                               08785000
SDWAFLGS EQU   SDWA+232                                                 08786000
SDWAERRA EQU   SDWAFLGS                                                 08787000
SDWAERRB EQU   SDWAFLGS+1                                               08788000
SDWAERRC EQU   SDWAFLGS+2                                               08789000
SDWAERRD EQU   SDWAFLGS+3                                               08790000
SDWAIOFS EQU   SDWA+238                                                 08791000
SDWARTYA EQU   SDWA+240                                                 08792000
SDWACPUA EQU   SDWA+248                                                 08793000
SDWAPARQ EQU   SDWA+252                                                 08794000
SDWARCDE EQU   SDWAPARQ                                                 08795000
SDWAACF2 EQU   SDWAPARQ+1                                               08796000
SDWARCRD EQU   SDWAACF2                                                 08797000
SDWAUPRG EQU   SDWAACF2                                                 08798000
SDWAFREE EQU   SDWAACF2                                                 08799000
SDWAACF3 EQU   SDWAPARQ+2                                               08800000
SDWAACF4 EQU   SDWAPARQ+3                                               08801000
SDWALKWA EQU   SDWA+256                                                 08802000
SDWALKWS EQU   SDWALKWA                                                 08803000
SDWARECP EQU   SDWA+292                                                 08804000
SDWASNPA EQU   SDWA+320                                                 08805000
SDWADUMP EQU   SDWASNPA                                                 08806000
SDWADPFS EQU   SDWADUMP+1                                               08807000
SDWADDAT EQU   SDWASNPA+4                                               08808000
SDWASDAT EQU   SDWADDAT                                                 08809000
SDWAPDAT EQU   SDWADDAT+2                                               08810000
SDWADPSA EQU   SDWA+328                                                 08811000
SDWADPSL EQU   SDWADPSA                                                 08812000
SDWARA   EQU   SDWA+400                                                 08813000
SDWADPVA EQU   SDWARA+2                                                 08814000
TCBNCPTR EQU   0                                                        08815000
TCBCURN  EQU   TCBNCPTR+4                                               08816000
DUMYSCTX EQU   0                                                        08817000
PARMX    EQU   DUMYSCTX+4                                               08818000
T2DSDR   EQU   0                                                        08819000
DSDJFCBX EQU   T2DSDR+2                                                 08820000
SLOT     EQU   0                                                        08821000
T3DSDR   EQU   0                                                        08822000
DSGDGNT  EQU   T3DSDR+2                                                 08823000
IHJCHR   EQU   0                                                        08824000
CHRCOUNT EQU   IHJCHR                                                   08825000
CHRCHKID EQU   IHJCHR+4                                                 08826000
CHRDDNM  EQU   IHJCHR+20                                                08827000
CHRPPM   EQU   IHJCHR+28                                                08828000
CHRPPE   EQU   IHJCHR+32                                                08829000
CHRFLAGS EQU   IHJCHR+40                                                08830000
AUTRSTRT EQU   CHRFLAGS                                                 08831000
VEQRUSER EQU   CHRFLAGS                                                 08832000
CHRFLAG2 EQU   IHJCHR+44                                                08833000
IEFADDNT EQU   0                                                        08834000
DDNTIDNT EQU   IEFADDNT                                                 08835000
DDNTUSCT EQU   IEFADDNT+2                                               08836000
DDNTLINK EQU   IEFADDNT+4                                               08837000
DDNTDDNM EQU   IEFADDNT+8                                               08838000
T1DSDR   EQU   0                                                        08839000
DSDRIDNT EQU   T1DSDR                                                   08840000
DSDRJFCB EQU   T1DSDR+2                                                 08841000
DSDRDNAM EQU   T1DSDR+178                                               08842000
DSDRUTYP EQU   T1DSDR+186                                               08843000
DRPUTYP3 EQU   DSDRUTYP+2                                               08844000
DSDRTAPE EQU   DRPUTYP3                                                 08845000
DSDRDISP EQU   T1DSDR+190                                               08846000
DSDRBYT3 EQU   T1DSDR+191                                               08847000
DSDRALTD EQU   T1DSDR+192                                               08848000
DSDRFLAG EQU   T1DSDR+193                                               08849000
DSDRDALC EQU   DSDRFLAG                                                 08850000
DSDRCCAT EQU   DSDRFLAG                                                 08851000
DSDROCKP EQU   DSDRFLAG                                                 08852000
T4DSDR   EQU   0                                                        08853000
DSDRSIOT EQU   T4DSDR+2                                                 08854000
DFID     EQU   0                                                        08855000
@NM00234 EQU   DFID                                                     08856000
DFWTP    EQU   @NM00234                                                 08857000
@NM00236 EQU   0                                                        08858000
ID       EQU   @NM00236                                                 08859000
MSGLEN   EQU   @NM00236+4                                               08860000
MSGADD   EQU   @NM00236+5                                               08861000
MSGTEXT  EQU   0                                                        08862000
VOLIST   EQU   0                                                        08863000
NUMVOLS  EQU   VOLIST                                                   08864000
VOLENTRY EQU   VOLIST+2                                                 08865000
UNIT     EQU   VOLENTRY                                                 08866000
SERIAL   EQU   VOLENTRY+4                                               08867000
SEQNO    EQU   VOLENTRY+10                                              08868000
FREEAREA EQU   0                                                        08869000
DFMSGWTP EQU   0                                                        08870000
DFRC     EQU   0                                                        08871000
IEFAB4F5 EQU   0                                                        08872000
IEFBB410 EQU   0                                                        08873000
IEFW21SD EQU   0                                                        08874000
INDMDSNT EQU   0                                                        08875000
I001C    EQU   0                                                        08876000
I008P    EQU   0                                                        08877000
I015F    EQU   0                                                        08878000
I015P    EQU   0                                                        08879000
I031F    EQU   0                                                        08880000
I031P    EQU   0                                                        08881000
I256C    EQU   0                                                        08882000
REGPICUP EQU   0                                                        08883000
SSREQ    EQU   0                                                        08884000
UCBBGN   EQU   0                                                        08885000
LCTPTR1  EQU   0                                                        08886000
PTRSIOT  EQU   0                                                        08887000
SIOTIN   EQU   0                                                        08888000
JFCKEYLE EQU   JFCTRTCH                                                 08889000
JFCCODE  EQU   JFCKEYLE                                                 08890000
JFCSTACK EQU   JFCTRTCH                                                 08891000
JFCMODE  EQU   JFCSTACK                                                 08892000
JFCSPPRT EQU   JFCTRTCH                                                 08893000
JFCPRTSP EQU   JFCSPPRT                                                 08894000
JFCDEN   EQU   JFCSPPRT+1                                               08895000
JFCBABFS EQU   JFCSPPRT+2                                               08896000
JFCLIMCT EQU   JFCBABFS                                                 08897000
JFCDSORG EQU   JFCSPPRT+5                                               08898000
JFCDSRG1 EQU   JFCDSORG                                                 08899000
JFCDSRG2 EQU   JFCDSORG+1                                               08900000
JFCORGAM EQU   JFCDSRG2                                                 08901000
JFCRECFM EQU   JFCSPPRT+7                                               08902000
JFCRCFM  EQU   JFCRECFM                                                 08903000
JFCOPTCD EQU   JFCSPPRT+8                                               08904000
JFCWVCSP EQU   JFCOPTCD                                                 08905000
JFCWVCIS EQU   JFCWVCSP                                                 08906000
JFCWVCBD EQU   JFCWVCIS                                                 08907000
JFCALLOW EQU   JFCOPTCD                                                 08908000
JFCRSV17 EQU   JFCALLOW                                                 08909000
JFCOVER  EQU   JFCRSV17                                                 08910000
JFCPCIBT EQU   JFCOPTCD                                                 08911000
JFCMAST  EQU   JFCPCIBT                                                 08912000
JFCEXT   EQU   JFCMAST                                                  08913000
JFCBCKPT EQU   JFCOPTCD                                                 08914000
JFCIND   EQU   JFCBCKPT                                                 08915000
JFCRSV18 EQU   JFCOPTCD                                                 08916000
JFCCYL   EQU   JFCRSV18                                                 08917000
JFCACT   EQU   JFCCYL                                                   08918000
JFCREDUC EQU   JFCOPTCD                                                 08919000
JFCRSV19 EQU   JFCREDUC                                                 08920000
JFCRSV20 EQU   JFCRSV19                                                 08921000
JFCRSV21 EQU   JFCOPTCD                                                 08922000
JFCDEL   EQU   JFCRSV21                                                 08923000
JFCOPTJ  EQU   JFCOPTCD                                                 08924000
JFCREORG EQU   JFCOPTJ                                                  08925000
JFCBLKSI EQU   JFCSPPRT+9                                               08926000
JFCBUFSI EQU   JFCBLKSI                                                 08927000
JFCAMSYN EQU   JFCSPPRT+11                                              08928000
JFCLRECL EQU   JFCAMSYN                                                 08929000
JFCNCP   EQU   JFCAMSYN+2                                               08930000
JFCNTM   EQU   JFCAMSYN+3                                               08931000
JFCBFSEQ EQU   JFCNTM                                                   08932000
JFCPCI   EQU   JFCBFSEQ                                                 08933000
JFCRESRV EQU   JFCAMSYN+4                                               08934000
JFCRKP   EQU   JFCRESRV                                                 08935000
JFCCYLOF EQU   JFCRESRV+2                                               08936000
JFCDBUFN EQU   JFCRESRV+3                                               08937000
JFCINTVL EQU   JFCSPPRT+19                                              08938000
JFCUCSEG EQU   JFCRESRV                                                 08939000
JFCUCSOP EQU   JFCUCSEG+4                                               08940000
JFCBEXTP EQU   JFCUCSOP                                                 08941000
JFCOUTLI EQU   JFCUCSEG+5                                               08942000
JFCTHRSH EQU   JFCOUTLI                                                 08943000
JFCCPRI  EQU   JFCTHRSH                                                 08944000
JFCSOWA  EQU   JFCOUTLI+1                                               08945000
JFCBNTCS EQU   JFCUCSEG+8                                               08946000
JFCBNVOL EQU   JFCUCSEG+9                                               08947000
JFCBVOLS EQU   JFCUCSEG+10                                              08948000
JFCAVOLS EQU   JFCBVOLS                                                 08949000
JFCBS001 EQU   JFCBVOLS                                                 08950000
JFCBEXTL EQU   JFCBS001+30                                              08951000
JFCBEXAD EQU   JFCBS001+31                                              08952000
JFCBPQTY EQU   JFCBS001+34                                              08953000
JFCBCTRI EQU   JFCBS001+37                                              08954000
JFCBSQTY EQU   JFCBS001+38                                              08955000
JFCFLGS1 EQU   JFCBS001+41                                              08956000
JFCVRDS  EQU   JFCFLGS1                                                 08957000
JFCBUAFF EQU   JFCFLGS1                                                 08958000
JFCBDQTY EQU   JFCBS001+42                                              08959000
JFCBSPNM EQU   JFCBS001+45                                              08960000
JFCBFLG3 EQU   JFCBSPNM                                                 08961000
JFCBABST EQU   JFCBS001+48                                              08962000
JFCBDRLH EQU   JFCBS001+53                                              08963000
JFCBVLCT EQU   JFCBS001+56                                              08964000
JFCBSPTN EQU   JFCBS001+57                                              08965000
CVTS01   EQU   CVTPGSIA                                                 08966000
CVTLPDIA EQU   CVTS01+12                                                08967000
CVTDIRST EQU   CVTLPDIA                                                 08968000
CVTSLIDA EQU   CVTS01+24                                                08969000
CVTCTLFG EQU   CVTS01+50                                                08970000
CVTGDA   EQU   CVTS01+212                                               08971000
CVTRV210 EQU   CVTS01+424                                               08972000
CVTRV219 EQU   CVTS01+425                                               08973000
CVTRV228 EQU   CVTS01+426                                               08974000
CVTRV237 EQU   CVTS01+427                                               08975000
CVTMFRTR EQU   CVTS01+452                                               08976000
CVTRV262 EQU   CVTS01+468                                               08977000
CVTRV271 EQU   CVTS01+469                                               08978000
CVTRV280 EQU   CVTS01+470                                               08979000
CVTRV289 EQU   CVTS01+471                                               08980000
CVTGSDA  EQU   CVTS01+600                                               08981000
TIOEDEVE EQU   TIOESTTB                                                 08982000
TIOSTTB  EQU   TIOEDEVE                                                 08983000
CHAINS01 EQU   CHASM                                                    08984000
CHTYPE   EQU   CHAINS01+124                                             08985000
CHTRSTAT EQU   CHAINS01+125                                             08986000
CHCSYSO  EQU   CHAINS01+134                                             08987000
JSCBSEC2 EQU   JSCBEND1                                                 08988000
JSCBSEC3 EQU   JSCBEND1                                                 08989000
JSCBJCT  EQU   JSCBSEC3                                                 08990000
JSCBJCTA EQU   JSCBJCT+1                                                08991000
JSCBASID EQU   JSCBSEC3+8                                               08992000
JSCBFBYT EQU   JSCBSEC3+10                                              08993000
JSCBJNL  EQU   JSCBSEC3+28                                              08994000
JSCBJJSB EQU   JSCBJNL                                                  08995000
JSCBSUB  EQU   JSCBSEC3+40                                              08996000
JSCDSABQ EQU   JSCBSEC3+60                                              08997000
JSCSCT   EQU   JSCBSEC3+68                                              08998000
JSCBACT  EQU   JSCBSEC3+88                                              08999000
JSCRSV45 EQU   JSCBSEC3+112                                             09000000
JSCRSV46 EQU   JSCRSV45                                                 09001000
JSCRSV47 EQU   JSCRSV45+2                                               09002000
UCBOBS01 EQU   UCBDEV                                                   09003000
UCBSTAB  EQU   UCBOBS01+10                                              09004000
UCBBSVL  EQU   UCBSTAB                                                  09005000
UCBPRSRS EQU   UCBSTAB                                                  09006000
UCBDMCT  EQU   UCBOBS01+11                                              09007000
UCBFL4   EQU   UCBOBS01+13                                              09008000
UCBOBS02 EQU   UCBDEV                                                   09009000
UCBTFL1  EQU   UCBOBS02+19                                              09010000
UCBXTN   EQU   UCBOBS02+20                                              09011000
UCBVOPT  EQU   UCBXTN                                                   09012000
UCBOBS03 EQU   UCBDEV                                                   09013000
UCBXTADR EQU   UCBOBS03                                                 09014000
UCBOBS04 EQU   UCBDEV                                                   09015000
UCBBTA   EQU   UCBOBS04+12                                              09016000
UCBOBS06 EQU   UCBDEV                                                   09017000
UCBAOF   EQU   UCBOBS06                                                 09018000
UCBAOF1  EQU   UCBAOF                                                   09019000
UCBAOF2  EQU   UCBAOF+1                                                 09020000
@NM00161 EQU   UCBOBS06+3                                               09021000
UCBIRB   EQU   UCBOBS06+4                                               09022000
UCBGRAF  EQU   UCBIRB                                                   09023000
UCBLDNCA EQU   UCBOBS06+8                                               09024000
UCBRDYQ  EQU   UCBLDNCA                                                 09025000
UCBIRLN  EQU   UCBRDYQ                                                  09026000
UCBLDNCB EQU   UCBRDYQ+1                                                09027000
UCBCTLNK EQU   UCBOBS06+12                                              09028000
UCBOBS07 EQU   UCBDEV                                                   09029000
UCBOBS08 EQU   UCBDEV                                                   09030000
UCBCTCAD EQU   UCBOBS08                                                 09031000
UCBCTCF1 EQU   UCBOBS08+4                                               09032000
UCBOBS09 EQU   UCBDEV                                                   09033000
WPBITS   EQU   CHCECB                                                   09034000
CANPOST  EQU   WPBITS                                                   09035000
BITS610  EQU   ECBC1                                                    09036000
POST610  EQU   BITS610                                                  09037000
BITMAP   EQU   DSRRFMAP                                                 09038000
DUMYVLSQ EQU   JFCBVLSQ                                                 09039000
TU71TO4  EQU   TU71TO8                                                  09040000
TU7PARM  EQU   TU71TO8                                                  09041000
TU75TO8  EQU   TU71TO8+4                                                09042000
TU76TO8  EQU   TU71TO8+5                                                09043000
JNAME    EQU   MSGAREA+12                                               09044000
JAREA    EQU   MSGAREA+35                                               09045000
JSTART   EQU   JAREA                                                    09046000
FILLER1  EQU   JAREA+4                                                  09047000
JEND     EQU   JAREA+7                                                  09048000
FILLER2  EQU   JAREA+11                                                 09049000
LISTREL  EQU   STAELIST+1                                               09050000
ARITFLAG EQU   S99FLAG2                                                 09051000
ARITFLG2 EQU   S99FLAG1                                                 09052000
I006     EQU   ILIST                                                    09053000
I00601   EQU   I006                                                     09054000
I00602   EQU   I006+1                                                   09055000
I00603   EQU   I006+4                                                   09056000
I00604   EQU   I006+5                                                   09057000
NAMPTR   EQU   ATT610                                                   09058000
ECBATT   EQU   ATT610+8                                                 09059000
DSOR$ITS EQU   DCBDSORG                                                 09060000
PARTBIT  EQU   DSOR$ITS                                                 09061000
OPENBITS EQU   DCBOFLGS                                                 09062000
GOODOPEN EQU   OPENBITS                                                 09063000
RECLEN   EQU   DCBLRECL                                                 09064000
ARITXNAM EQU   JFCBXNAM                                                 09065000
THIRTYX  EQU   MSGAREA+49                                               09066000
JOBERRN  EQU   MSGAREA+39                                               09067000
ORIGDC   EQU   MSGAREA+46                                               09068000
ORIGRC   EQU   MSGAREA+48                                               09069000
I209JOB  EQU   MSGAREA+45                                               09070000
I209STEP EQU   MSGAREA+54                                               09071000
I209PROC EQU   MSGAREA+63                                               09072000
DOT1     EQU   MSGAREA+53                                               09073000
DOT2     EQU   MSGAREA+62                                               09074000
SHORTDC  EQU   MSGAREA+62                                               09075000
SHORTRC  EQU   MSGAREA+64                                               09076000
LONGDC   EQU   MSGAREA+71                                               09077000
LONGRC   EQU   MSGAREA+73                                               09078000
WTOLEN   EQU   MSGAREA                                                  09079000
UNITS    EQU   SCTNMBUT                                                 09080000
ADDRDATA EQU   DUMPLIST+12                                              09081000
DUMPDATA EQU   DUMPLIST+24                                              09082000
JINSERT  EQU   MSGAREA+38                                               09083000
CLOSPARM EQU   ADOKECB                                                  09084000
MSGSLOT  EQU   MSGAREA+49                                               09085000
TTRPCAT  EQU   SCTPCAT                                                  09086000
CATCT    EQU   SCTCATCT                                                 09087000
LIST4F4  EQU   LIST4F5                                                  09088000
RTCDPTR  EQU   LIST4F4                                                  09089000
PCCBPTR  EQU   LIST4F4+4                                                09090000
DDNAMPTR EQU   LIST4F4+8                                                09091000
ACBPTR   EQU   LIST4F4+12                                               09092000
JSCBP    EQU   LIST4F4+16                                               09093000
*                                      START UNREFERENCED COMPONENTS    09094000
@NM00240 EQU   OPENBITS                                                 09095000
@NM00239 EQU   OPENBITS                                                 09096000
@NM00238 EQU   DSOR$ITS                                                 09097000
@NM00237 EQU   DSOR$ITS                                                 09098000
I00605   EQU   I006+8                                                   09099000
@NM00224 EQU   BITS610                                                  09100000
@NM00223 EQU   BITS610                                                  09101000
@NM00222 EQU   WPBITS                                                   09102000
@NM00221 EQU   WPBITS                                                   09103000
UCBRV066 EQU   UCBOBS09+4                                               09104000
UCBIOSBA EQU   UCBOBS09                                                 09105000
UCBRV042 EQU   UCBOBS08+5                                               09106000
UCBRV082 EQU   UCBCTCF1                                                 09107000
UCBRV081 EQU   UCBCTCF1                                                 09108000
UCBRV080 EQU   UCBCTCF1                                                 09109000
UCBRV079 EQU   UCBCTCF1                                                 09110000
UCBRV078 EQU   UCBCTCF1                                                 09111000
UCBRV077 EQU   UCBCTCF1                                                 09112000
UCBRV076 EQU   UCBCTCF1                                                 09113000
UCBCTC80 EQU   UCBCTCF1                                                 09114000
UCBCTCAL EQU   UCBCTCAD                                                 09115000
UCBICNCB EQU   UCBOBS07+4                                               09116000
UCBRV040 EQU   UCBOBS07                                                 09117000
UCBCTLNA EQU   UCBCTLNK+1                                               09118000
UCBRLN   EQU   UCBCTLNK                                                 09119000
UCBRDYQA EQU   UCBLDNCB                                                 09120000
UCBINRLN EQU   UCBIRLN                                                  09121000
UCBIRBA  EQU   UCBIRB+1                                                 09122000
UCBRV039 EQU   UCBGRAF                                                  09123000
UCBDWNR  EQU   UCBGRAF                                                  09124000
UCBRPND  EQU   UCBGRAF                                                  09125000
UCBUPM   EQU   UCBGRAF                                                  09126000
UCBBTAM  EQU   UCBGRAF                                                  09127000
UCBDRNO  EQU   UCBGRAF                                                  09128000
UCBDRO   EQU   UCBGRAF                                                  09129000
UCBOIP   EQU   UCBGRAF                                                  09130000
UCBATRCD EQU   @NM00161                                                 09131000
UCBSKPFG EQU   @NM00161                                                 09132000
UCBRIPND EQU   @NM00161                                                 09133000
UCBRTIAC EQU   @NM00161                                                 09134000
UCBRSV79 EQU   @NM00161                                                 09135000
UCBRSV78 EQU   @NM00161                                                 09136000
UCBRSV77 EQU   @NM00161                                                 09137000
UCBOLTEP EQU   @NM00161                                                 09138000
UCBATNCT EQU   UCBOBS06+2                                               09139000
UCBRSV76 EQU   UCBAOF2                                                  09140000
UCBRSV75 EQU   UCBAOF2                                                  09141000
UCBRSV74 EQU   UCBAOF2                                                  09142000
UCBRSV73 EQU   UCBAOF2                                                  09143000
UCBRSV72 EQU   UCBAOF2                                                  09144000
UCBRSV71 EQU   UCBAOF2                                                  09145000
UCBRSV70 EQU   UCBAOF2                                                  09146000
UCBRSV69 EQU   UCBAOF2                                                  09147000
UCBRSV68 EQU   UCBAOF1                                                  09148000
UCBRSV67 EQU   UCBAOF1                                                  09149000
UCBRSV66 EQU   UCBAOF1                                                  09150000
UCBRSV65 EQU   UCBAOF1                                                  09151000
UCBRSV64 EQU   UCBAOF1                                                  09152000
UCBOFNL  EQU   UCBAOF1                                                  09153000
UCBOFSP  EQU   UCBAOF1                                                  09154000
UCBOFMCR EQU   UCBAOF1                                                  09155000
UCBBTB   EQU   UCBBTA+1                                                 09156000
UCBDI    EQU   UCBBTA                                                   09157000
UCBSNS   EQU   UCBOBS04+8                                               09158000
UCBTEB   EQU   UCBOBS04+4                                               09159000
UCBGCB   EQU   UCBOBS04+3                                               09160000
UCBOPEN  EQU   UCBOBS04+2                                               09161000
UCBSTART EQU   UCBOBS04                                                 09162000
UCBXTNB  EQU   UCBXTN+1                                                 09163000
UCBRSV22 EQU   UCBVOPT                                                  09164000
UCBRSV21 EQU   UCBVOPT                                                  09165000
UCBRSV20 EQU   UCBVOPT                                                  09166000
UCBESVE  EQU   UCBVOPT                                                  09167000
UCBERPC  EQU   UCBVOPT                                                  09168000
UCBESVC  EQU   UCBVOPT                                                  09169000
UCBEVA   EQU   UCBVOPT                                                  09170000
UCBESV   EQU   UCBVOPT                                                  09171000
UCBRV009 EQU   UCBTFL1                                                  09172000
UCBRV008 EQU   UCBTFL1                                                  09173000
UCBRV007 EQU   UCBTFL1                                                  09174000
UCBRV006 EQU   UCBTFL1                                                  09175000
UCBRV005 EQU   UCBTFL1                                                  09176000
UCBDQDSP EQU   UCBTFL1                                                  09177000
UCBNSLTP EQU   UCBTFL1                                                  09178000
UCBNLTP  EQU   UCBTFL1                                                  09179000
UCBRES1B EQU   UCBOBS02+18                                              09180000
UCBFSER  EQU   UCBOBS02+12                                              09181000
@NM00160 EQU   UCBOBS02+4                                               09182000
UCBFSEQ  EQU   UCBOBS02+2                                               09183000
UCBFSCT  EQU   UCBOBS02                                                 09184000
UCBNEXP  EQU   UCBOBS01+20                                              09185000
UCBBASE  EQU   UCBOBS01+16                                              09186000
UCBRES1A EQU   UCBOBS01+15                                              09187000
UCBUSER  EQU   UCBOBS01+14                                              09188000
UCBFL47  EQU   UCBFL4                                                   09189000
UCBFL46  EQU   UCBFL4                                                   09190000
UCBFL45  EQU   UCBFL4                                                   09191000
UCBRV065 EQU   UCBFL4                                                   09192000
UCBDSS   EQU   UCBFL4                                                   09193000
UCBRESVP EQU   UCBFL4                                                   09194000
UCBWDAV  EQU   UCBFL4                                                   09195000
UCBDAVV  EQU   UCBFL4                                                   09196000
UCBSQC   EQU   UCBOBS01+12                                              09197000
UCBDATP  EQU   UCBOBS01+12                                              09198000
UCBDMC   EQU   UCBDMCT                                                  09199000
UCBMOUNT EQU   UCBDMCT                                                  09200000
UCBBNUL  EQU   UCBSTAB                                                  09201000
UCBSHAR  EQU   UCBSTAB                                                  09202000
UCBBSTR  EQU   UCBSTAB                                                  09203000
UCBBPUB  EQU   UCBSTAB                                                  09204000
UCBBPRV  EQU   UCBSTAB                                                  09205000
UCBBALB  EQU   UCBPRSRS                                                 09206000
UCBPGFL  EQU   UCBSTAB                                                  09207000
UCBDVSHR EQU   UCBBSVL                                                  09208000
UCBVOLI  EQU   UCBOBS01+4                                               09209000
UCBVTOC  EQU   UCBOBS01                                                 09210000
JSCBEND3 EQU   JSCBSEC3+120                                             09211000
JSCRSV52 EQU   JSCBSEC3+116                                             09212000
JSCRSV51 EQU   JSCRSV47+1                                               09213000
JSCRSV50 EQU   JSCRSV47                                                 09214000
JSCRSV49 EQU   JSCRSV46+1                                               09215000
JSCRSV48 EQU   JSCRSV46                                                 09216000
JSCRSV44 EQU   JSCBSEC3+108                                             09217000
JSCRSV43 EQU   JSCBSEC3+104                                             09218000
JSCRSV42 EQU   JSCBSEC3+100                                             09219000
JSCBASWA EQU   JSCBSEC3+96                                              09220000
JSCBUFPT EQU   JSCBSEC3+92                                              09221000
JSCBSWSP EQU   JSCBSEC3+87                                              09222000
JSCRSV33 EQU   JSCBSEC3+86                                              09223000
JSCDDNUM EQU   JSCBSEC3+84                                              09224000
JSCRSV53 EQU   JSCBSEC3+82                                              09225000
JSCDDNNO EQU   JSCBSEC3+80                                              09226000
JSCBVATA EQU   JSCBSEC3+76                                              09227000
JSCTMCOR EQU   JSCBSEC3+72                                              09228000
JSCSCTP  EQU   JSCSCT+1                                                 09229000
JSCRSV55 EQU   JSCSCT                                                   09230000
JSCRSV54 EQU   JSCBSEC3+64                                              09231000
JSCBSSIB EQU   JSCBSEC3+56                                              09232000
JSCBFRBA EQU   JSCBSEC3+48                                              09233000
JSCRSV28 EQU   JSCBSEC3+46                                              09234000
JSCBSONO EQU   JSCBSEC3+44                                              09235000
JSCBSUBA EQU   JSCBSUB+1                                                09236000
JSCRSV31 EQU   JSCBSUB                                                  09237000
JSCBSMLR EQU   JSCBSEC3+36                                              09238000
JSCBJNLR EQU   JSCBSEC3+32                                              09239000
JSCBJNLA EQU   JSCBJNL+1                                                09240000
JSCBJSBT EQU   JSCBJJSB                                                 09241000
JSCBJSBX EQU   JSCBJJSB                                                 09242000
JSCBJSBA EQU   JSCBJJSB                                                 09243000
JSCBJSBI EQU   JSCBJJSB                                                 09244000
@NM00158 EQU   JSCBJJSB                                                 09245000
JSCBJNLE EQU   JSCBJJSB                                                 09246000
JSCBJNLF EQU   JSCBJJSB                                                 09247000
JSCBJNLN EQU   JSCBJJSB                                                 09248000
@NM00157 EQU   JSCBSEC3+24                                              09249000
JSCBJRBA EQU   JSCBSEC3+16                                              09250000
JSCBIECB EQU   JSCBSEC3+12                                              09251000
JSCBRV08 EQU   JSCBSEC3+11                                              09252000
JSCBRV07 EQU   JSCBFBYT                                                 09253000
JSCBRV06 EQU   JSCBFBYT                                                 09254000
JSCBRV05 EQU   JSCBFBYT                                                 09255000
JSCBRV04 EQU   JSCBFBYT                                                 09256000
JSCBRV03 EQU   JSCBFBYT                                                 09257000
JSCBRV02 EQU   JSCBFBYT                                                 09258000
JSCBADSP EQU   JSCBFBYT                                                 09259000
JSCBRV01 EQU   JSCBFBYT                                                 09260000
JSCBTJID EQU   JSCBASID                                                 09261000
JSCBPSCB EQU   JSCBSEC3+4                                               09262000
JSCJCTP  EQU   JSCBJCTA                                                 09263000
JSCRSV24 EQU   JSCBJCT                                                  09264000
JSCBEND2 EQU   JSCBSEC2                                                 09265000
CHLAST   EQU   CHAINS01+136                                             09266000
CHSPA    EQU   CHAINS01+135                                             09267000
CHUSERID EQU   CHCSYSO                                                  09268000
CHJB     EQU   CHCSYSO                                                  09269000
CHDUMP   EQU   CHCSYSO                                                  09270000
CHQUE    EQU   CHCSYSO                                                  09271000
CHHOLD   EQU   CHCSYSO                                                  09272000
CHOUT    EQU   CHCSYSO                                                  09273000
CHINN    EQU   CHCSYSO                                                  09274000
CHALL    EQU   CHCSYSO                                                  09275000
CHINC    EQU   CHAINS01+132                                             09276000
CHPEND   EQU   CHAINS01+128                                             09277000
CHARID   EQU   CHAINS01+127                                             09278000
CHCNID   EQU   CHAINS01+126                                             09279000
@NM00154 EQU   CHTRSTAT                                                 09280000
CHTSL    EQU   CHTRSTAT                                                 09281000
CHTS     EQU   CHTRSTAT                                                 09282000
CHINITL  EQU   CHTRSTAT                                                 09283000
CHINIT   EQU   CHTRSTAT                                                 09284000
CHJOBSL  EQU   CHTRSTAT                                                 09285000
CHJOBS   EQU   CHTRSTAT                                                 09286000
CHDEF    EQU   CHTYPE                                                   09287000
CHHIAR   EQU   CHTYPE                                                   09288000
CHARSV29 EQU   CHTYPE                                                   09289000
CHARSV28 EQU   CHTYPE                                                   09290000
CHARSV27 EQU   CHTYPE                                                   09291000
CHARSV26 EQU   CHTYPE                                                   09292000
CHARSV25 EQU   CHTYPE                                                   09293000
CHDSTAT  EQU   CHTYPE                                                   09294000
CHBUF    EQU   CHAINS01                                                 09295000
TIOUCBP  EQU   TIOEDEVE+1                                               09296000
TIOVERF  EQU   TIOSTTB                                                  09297000
TIOUNLD  EQU   TIOSTTB                                                  09298000
TIOMNTD  EQU   TIOSTTB                                                  09299000
TIOSETU  EQU   TIOSTTB                                                  09300000
TIOVLSR  EQU   TIOSTTB                                                  09301000
TIOPVIO  EQU   TIOSTTB                                                  09302000
TIOREQD  EQU   TIOSTTB                                                  09303000
TIOUSED  EQU   TIOSTTB                                                  09304000
CVTRV628 EQU   CVTS01+728                                               09305000
CVTRV627 EQU   CVTS01+724                                               09306000
CVTRV626 EQU   CVTS01+720                                               09307000
CVTRV625 EQU   CVTS01+716                                               09308000
CVTRV624 EQU   CVTS01+712                                               09309000
CVTRV623 EQU   CVTS01+708                                               09310000
CVTRV622 EQU   CVTS01+704                                               09311000
CVTRV621 EQU   CVTS01+700                                               09312000
CVTIHASU EQU   CVTS01+696                                               09313000
CVTRV619 EQU   CVTS01+692                                               09314000
CVTRV618 EQU   CVTS01+688                                               09315000
CVTRV617 EQU   CVTS01+684                                               09316000
CVTRV616 EQU   CVTS01+680                                               09317000
CVTRV615 EQU   CVTS01+676                                               09318000
CVTRV614 EQU   CVTS01+672                                               09319000
CVTRV613 EQU   CVTS01+668                                               09320000
CVTTCASP EQU   CVTS01+664                                               09321000
CVT0PT03 EQU   CVTS01+660                                               09322000
CVT0PT0E EQU   CVTS01+656                                               09323000
CVTRV609 EQU   CVTS01+652                                               09324000
CVTCGK   EQU   CVTS01+648                                               09325000
CVTRAC   EQU   CVTS01+644                                               09326000
CVTHSM   EQU   CVTS01+640                                               09327000
CVTRV605 EQU   CVTS01+636                                               09328000
CVTRV604 EQU   CVTS01+632                                               09329000
CVTEFF02 EQU   CVTS01+628                                               09330000
CVTCBBR  EQU   CVTS01+624                                               09331000
CVTSSCR  EQU   CVTS01+620                                               09332000
CVTEVENT EQU   CVTS01+616                                               09333000
CVTCRCA  EQU   CVTS01+612                                               09334000
CVTTPIO  EQU   CVTS01+608                                               09335000
CVTADV   EQU   CVTS01+604                                               09336000
CVTGSDAB EQU   CVTGSDA                                                  09337000
CVTQV3   EQU   CVTS01+596                                               09338000
CVTQV2   EQU   CVTS01+592                                               09339000
CVTQV1   EQU   CVTS01+588                                               09340000
CVTRPT   EQU   CVTS01+584                                               09341000
CVTSSRB  EQU   CVTS01+580                                               09342000
CVTCSDRL EQU   CVTS01+576                                               09343000
CVTEXP1  EQU   CVTS01+572                                               09344000
CVTRMPMT EQU   CVTS01+568                                               09345000
CVTRMPTT EQU   CVTS01+564                                               09346000
CVTVPSA  EQU   CVTS01+560                                               09347000
CVTVSTOP EQU   CVTS01+556                                               09348000
CVTGTFR8 EQU   CVTS01+552                                               09349000
CVTQUIT  EQU   CVTS01+548                                               09350000
CVTVACR  EQU   CVTS01+544                                               09351000
CVTWTCB  EQU   CVTS01+540                                               09352000
CVTSTPRS EQU   CVTS01+536                                               09353000
CVT0PT02 EQU   CVTS01+532                                               09354000
CVTDARCM EQU   CVTS01+528                                               09355000
CVTIRECM EQU   CVTS01+524                                               09356000
CVTJRECM EQU   CVTS01+520                                               09357000
CVTVEMS0 EQU   CVTS01+516                                               09358000
CVTSPFRR EQU   CVTS01+512                                               09359000
CVTRLSTG EQU   CVTS01+508                                               09360000
CVT0TC0A EQU   CVTS01+504                                               09361000
CVTGMBR  EQU   CVTS01+500                                               09362000
CVTLFRM  EQU   CVTS01+496                                               09363000
CVTRMBR  EQU   CVTS01+492                                               09364000
CVTVIOP  EQU   CVTS01+488                                               09365000
CVTRV307 EQU   CVTS01+486                                               09366000
CVTRV306 EQU   CVTS01+484                                               09367000
CVTRV305 EQU   CVTS01+482                                               09368000
CVTRV304 EQU   CVTS01+480                                               09369000
CVTRV303 EQU   CVTS01+478                                               09370000
CVTRV302 EQU   CVTS01+476                                               09371000
CVTTRCA  EQU   CVTS01+472                                               09372000
CVTRV297 EQU   CVTRV289                                                 09373000
CVTRV296 EQU   CVTRV289                                                 09374000
CVTRV295 EQU   CVTRV289                                                 09375000
CVTRV294 EQU   CVTRV289                                                 09376000
CVTRV293 EQU   CVTRV289                                                 09377000
CVTRV292 EQU   CVTRV289                                                 09378000
CVTRV291 EQU   CVTRV289                                                 09379000
CVTRV290 EQU   CVTRV289                                                 09380000
CVTRV288 EQU   CVTRV280                                                 09381000
CVTRV287 EQU   CVTRV280                                                 09382000
CVTRV286 EQU   CVTRV280                                                 09383000
CVTRV285 EQU   CVTRV280                                                 09384000
CVTRV284 EQU   CVTRV280                                                 09385000
CVTRV283 EQU   CVTRV280                                                 09386000
CVTRV282 EQU   CVTRV280                                                 09387000
CVTRV281 EQU   CVTRV280                                                 09388000
CVTRV279 EQU   CVTRV271                                                 09389000
CVTRV278 EQU   CVTRV271                                                 09390000
CVTRV277 EQU   CVTRV271                                                 09391000
CVTRV276 EQU   CVTRV271                                                 09392000
CVTRV275 EQU   CVTRV271                                                 09393000
CVTRV274 EQU   CVTRV271                                                 09394000
CVTRV273 EQU   CVTRV271                                                 09395000
CVTRV272 EQU   CVTRV271                                                 09396000
CVTRV270 EQU   CVTRV262                                                 09397000
CVTRV269 EQU   CVTRV262                                                 09398000
CVTRV268 EQU   CVTRV262                                                 09399000
CVTRV267 EQU   CVTRV262                                                 09400000
CVTRV266 EQU   CVTRV262                                                 09401000
CVTRV265 EQU   CVTRV262                                                 09402000
CVTRV264 EQU   CVTRV262                                                 09403000
CVTRV263 EQU   CVTRV262                                                 09404000
CVTVFP   EQU   CVTS01+464                                               09405000
CVTVSI   EQU   CVTS01+460                                               09406000
CVTVPSIB EQU   CVTS01+456                                               09407000
CVTMFACT EQU   CVTMFRTR                                                 09408000
CVTMFCTL EQU   CVTS01+448                                               09409000
CVTPVBP  EQU   CVTS01+444                                               09410000
CVTPWI   EQU   CVTS01+440                                               09411000
CVTRV254 EQU   CVTS01+438                                               09412000
CVTRV253 EQU   CVTS01+436                                               09413000
CVTRV252 EQU   CVTS01+434                                               09414000
CVTRV251 EQU   CVTS01+433                                               09415000
CVTRV250 EQU   CVTS01+432                                               09416000
CVTRV249 EQU   CVTS01+431                                               09417000
CVTRV248 EQU   CVTS01+430                                               09418000
CVTRV247 EQU   CVTS01+429                                               09419000
CVTRV246 EQU   CVTS01+428                                               09420000
CVTRV245 EQU   CVTRV237                                                 09421000
CVTRV244 EQU   CVTRV237                                                 09422000
CVTRV243 EQU   CVTRV237                                                 09423000
CVTRV242 EQU   CVTRV237                                                 09424000
CVTRV241 EQU   CVTRV237                                                 09425000
CVTRV240 EQU   CVTRV237                                                 09426000
CVTRV239 EQU   CVTRV237                                                 09427000
CVTRV238 EQU   CVTRV237                                                 09428000
CVTRV236 EQU   CVTRV228                                                 09429000
CVTRV235 EQU   CVTRV228                                                 09430000
CVTRV234 EQU   CVTRV228                                                 09431000
CVTRV233 EQU   CVTRV228                                                 09432000
CVTRV232 EQU   CVTRV228                                                 09433000
CVTRV231 EQU   CVTRV228                                                 09434000
CVTRV230 EQU   CVTRV228                                                 09435000
CVTRV229 EQU   CVTRV228                                                 09436000
CVTRV227 EQU   CVTRV219                                                 09437000
CVTRV226 EQU   CVTRV219                                                 09438000
CVTRV225 EQU   CVTRV219                                                 09439000
CVTRV224 EQU   CVTRV219                                                 09440000
CVTRV223 EQU   CVTRV219                                                 09441000
CVTRV222 EQU   CVTRV219                                                 09442000
CVTRV221 EQU   CVTRV219                                                 09443000
CVTRV220 EQU   CVTRV219                                                 09444000
CVTRV218 EQU   CVTRV210                                                 09445000
CVTRV217 EQU   CVTRV210                                                 09446000
CVTRV216 EQU   CVTRV210                                                 09447000
CVTRV215 EQU   CVTRV210                                                 09448000
CVTRV214 EQU   CVTRV210                                                 09449000
CVTRV213 EQU   CVTRV210                                                 09450000
CVTRV212 EQU   CVTRV210                                                 09451000
CVTRV211 EQU   CVTRV210                                                 09452000
CVTLCCAT EQU   CVTS01+420                                               09453000
CVTPCCAT EQU   CVTS01+416                                               09454000
CVTIPCRP EQU   CVTS01+412                                               09455000
CVTIPCRI EQU   CVTS01+408                                               09456000
CVTIPCDS EQU   CVTS01+404                                               09457000
CVTAIDVT EQU   CVTS01+400                                               09458000
CVTSSAP  EQU   CVTS01+396                                               09459000
CVTEHCIR EQU   CVTS01+392                                               09460000
CVTEHDEF EQU   CVTS01+388                                               09461000
CVTDAIR  EQU   CVTS01+384                                               09462000
CVTPERFM EQU   CVTS01+380                                               09463000
CVT044R2 EQU   CVTS01+376                                               09464000
CVTFETCH EQU   CVTS01+372                                               09465000
CVTRSTWD EQU   CVTS01+368                                               09466000
CVTSPOST EQU   CVTS01+364                                               09467000
CVTIOBP  EQU   CVTS01+360                                               09468000
CVTASMVT EQU   CVTS01+356                                               09469000
CVTRECRQ EQU   CVTS01+352                                               09470000
CVTWSAC  EQU   CVTS01+348                                               09471000
CVTRV149 EQU   CVTS01+344                                               09472000
CVTWSAL  EQU   CVTS01+340                                               09473000
CVTSPSA  EQU   CVTS01+336                                               09474000
CVTGLMN  EQU   CVTS01+332                                               09475000
CVTVEAC0 EQU   CVTS01+328                                               09476000
CVT062R1 EQU   CVTS01+324                                               09477000
CVTRPOST EQU   CVTS01+320                                               09478000
CVTDQIQE EQU   CVTS01+316                                               09479000
CVTCSD   EQU   CVTS01+312                                               09480000
CVTLKRMA EQU   CVTS01+308                                               09481000
CVTRSPIE EQU   CVTS01+304                                               09482000
CVTRENQ  EQU   CVTS01+300                                               09483000
CVTLQCB  EQU   CVTS01+296                                               09484000
CVTFQCB  EQU   CVTS01+292                                               09485000
CVTQCS01 EQU   CVTS01+288                                               09486000
CVTAPFT  EQU   CVTS01+284                                               09487000
CVTPARRL EQU   CVTS01+280                                               09488000
CVTVWAIT EQU   CVTS01+276                                               09489000
CVTGSPL  EQU   CVTS01+272                                               09490000
CVTLSMQ  EQU   CVTS01+268                                               09491000
CVTGSMQ  EQU   CVTS01+264                                               09492000
CVTEXPRO EQU   CVTS01+260                                               09493000
CVTOPCTP EQU   CVTS01+256                                               09494000
CVTSIC   EQU   CVTS01+252                                               09495000
CVTTPIOS EQU   CVTS01+248                                               09496000
CVTRTMS  EQU   CVTS01+244                                               09497000
CVTSDBF  EQU   CVTS01+240                                               09498000
CVTSCBP  EQU   CVTS01+236                                               09499000
CVTSDMP  EQU   CVTS01+232                                               09500000
CVTSV60  EQU   CVTS01+228                                               09501000
CVTRTMCT EQU   CVTS01+224                                               09502000
CVTASCBL EQU   CVTS01+220                                               09503000
CVTASCBH EQU   CVTS01+216                                               09504000
CVTASVT  EQU   CVTS01+208                                               09505000
CVTVVMDI EQU   CVTS01+204                                               09506000
CVTAQTOP EQU   CVTS01+200                                               09507000
CVTIOSCS EQU   CVTS01+196                                               09508000
CVTSDRM  EQU   CVTS01+192                                               09509000
CVTOPTE  EQU   CVTS01+188                                               09510000
CVTSTXU  EQU   CVTS01+184                                               09511000
CVTQUIS  EQU   CVTS01+180                                               09512000
CVTPARS  EQU   CVTS01+176                                               09513000
CVTS1EE  EQU   CVTS01+172                                               09514000
CVTFRAS  EQU   CVTS01+168                                               09515000
CVTQSAS  EQU   CVTS01+164                                               09516000
CVTCRAS  EQU   CVTS01+160                                               09517000
CVTCRMN  EQU   CVTS01+156                                               09518000
CVTDELCP EQU   CVTS01+152                                               09519000
CVTFRECL EQU   CVTS01+148                                               09520000
CVTGETCL EQU   CVTS01+144                                               09521000
CVTBLDCP EQU   CVTS01+140                                               09522000
CVTAUTHL EQU   CVTS01+136                                               09523000
CVTSCAN  EQU   CVTS01+132                                               09524000
CVTRV144 EQU   CVTS01+130                                               09525000
CVTMAXMP EQU   CVTS01+128                                               09526000
CVTSTCK  EQU   CVTS01+124                                               09527000
CVTRV139 EQU   CVTS01+123                                               09528000
CVTDSSAC EQU   CVTS01+122                                               09529000
CVTRV513 EQU   CVTS01+121                                               09530000
CVTIOSPL EQU   CVTS01+120                                               09531000
CVTPTGT  EQU   CVTS01+116                                               09532000
CVTCSPIE EQU   CVTS01+112                                               09533000
CVTSMFEX EQU   CVTS01+108                                               09534000
CVTOLT0A EQU   CVTS01+104                                               09535000
CVTSRBRT EQU   CVTS01+100                                               09536000
CVTPUTL  EQU   CVTS01+96                                                09537000
CVTASCRL EQU   CVTS01+92                                                09538000
CVTASCRF EQU   CVTS01+88                                                09539000
CVTRV326 EQU   CVTS01+84                                                09540000
CVTRV325 EQU   CVTS01+80                                                09541000
CVTRV324 EQU   CVTS01+76                                                09542000
CVT0VL01 EQU   CVTS01+72                                                09543000
CVTSHRVM EQU   CVTS01+68                                                09544000
CVTRV332 EQU   CVTS01+64                                                09545000
CVTTAS   EQU   CVTS01+60                                                09546000
CVTRSCN  EQU   CVTS01+56                                                09547000
CVTTRAC2 EQU   CVTS01+54                                                09548000
CVTTRACE EQU   CVTS01+52                                                09549000
CVTAPG   EQU   CVTS01+51                                                09550000
CVTSDTRC EQU   CVTCTLFG                                                 09551000
CVTGTRCE EQU   CVTCTLFG                                                 09552000
CVTNOMP  EQU   CVTCTLFG                                                 09553000
CVTRSV79 EQU   CVTCTLFG                                                 09554000
CVTDSTAT EQU   CVTCTLFG                                                 09555000
CVTRSV78 EQU   CVTCTLFG                                                 09556000
CVTRV333 EQU   CVTCTLFG                                                 09557000
CVTRV323 EQU   CVTCTLFG                                                 09558000
CVTSPVLK EQU   CVTS01+49                                                09559000
CVTRSV77 EQU   CVTS01+48                                                09560000
CVTRV331 EQU   CVTS01+44                                                09561000
CVTRV330 EQU   CVTS01+40                                                09562000
CVTRV329 EQU   CVTS01+36                                                09563000
CVTRV328 EQU   CVTS01+32                                                09564000
CVTRV322 EQU   CVTS01+28                                                09565000
CVTSLID  EQU   CVTSLIDA+1                                               09566000
CVTSYLK  EQU   CVTSLIDA                                                 09567000
CVTRV321 EQU   CVTS01+20                                                09568000
CVTRV320 EQU   CVTS01+16                                                09569000
CVTLPDIR EQU   CVTLPDIA+1                                               09570000
CVTRSV69 EQU   CVTDIRST                                                 09571000
CVTRSV68 EQU   CVTDIRST                                                 09572000
CVTRSV67 EQU   CVTDIRST                                                 09573000
CVTRSV66 EQU   CVTDIRST                                                 09574000
CVTRSV65 EQU   CVTDIRST                                                 09575000
CVTRSV64 EQU   CVTDIRST                                                 09576000
CVTRSV63 EQU   CVTDIRST                                                 09577000
CVTDICOM EQU   CVTDIRST                                                 09578000
CVTPVTP  EQU   CVTS01+8                                                 09579000
CVTLPDSR EQU   CVTS01+4                                                 09580000
CVTGETL  EQU   CVTS01                                                   09581000
JFCBEND  EQU   JFCBS001+58                                              09582000
JFCBSBNM EQU   JFCBS001+50                                              09583000
JFCBRV08 EQU   JFCBSPNM+1                                               09584000
JFCBRV07 EQU   JFCBFLG3                                                 09585000
JFCBRV06 EQU   JFCBFLG3                                                 09586000
JFCBRV05 EQU   JFCBFLG3                                                 09587000
JFCBRV04 EQU   JFCBFLG3                                                 09588000
JFCBRV03 EQU   JFCBFLG3                                                 09589000
JFCBRV02 EQU   JFCBFLG3                                                 09590000
JFCBEXP  EQU   JFCBFLG3                                                 09591000
JFCDQDSP EQU   JFCBFLG3                                                 09592000
JFCRSV45 EQU   JFCFLGS1                                                 09593000
JFCBCEOV EQU   JFCFLGS1                                                 09594000
JFCRSV42 EQU   JFCFLGS1                                                 09595000
JFCBADSP EQU   JFCFLGS1                                                 09596000
JFCTOPEN EQU   JFCFLGS1                                                 09597000
JFCBDLET EQU   JFCFLGS1                                                 09598000
JFCRQID  EQU   JFCBSQTY                                                 09599000
JFCROUND EQU   JFCBCTRI                                                 09600000
JFCALX   EQU   JFCBCTRI                                                 09601000
JFCMIXG  EQU   JFCBCTRI                                                 09602000
JFCONTIG EQU   JFCBCTRI                                                 09603000
JFCRSV29 EQU   JFCBCTRI                                                 09604000
JFCBMSGP EQU   JFCBCTRI                                                 09605000
JFCBSPAC EQU   JFCBCTRI                                                 09606000
JFCRUNIT EQU   JFCBPQTY                                                 09607000
JFCMSVGP EQU   JFCBS001+22                                              09608000
@NM00004 EQU   JFCBS001                                                 09609000
JFCSEND  EQU   JFCCPRI                                                  09610000
JFCEQUAL EQU   JFCCPRI                                                  09611000
JFCRECV  EQU   JFCCPRI                                                  09612000
JFCRSV34 EQU   JFCCPRI                                                  09613000
JFCRSV33 EQU   JFCCPRI                                                  09614000
JFCRSV55 EQU   JFCCPRI                                                  09615000
JFCRSV54 EQU   JFCCPRI                                                  09616000
JFCRSV53 EQU   JFCCPRI                                                  09617000
JFCRSV27 EQU   JFCUCSOP                                                 09618000
JFCRSV26 EQU   JFCUCSOP                                                 09619000
JFCFCBVR EQU   JFCUCSOP                                                 09620000
JFCFCBAL EQU   JFCUCSOP                                                 09621000
JFCVER   EQU   JFCUCSOP                                                 09622000
JFCRSV25 EQU   JFCUCSOP                                                 09623000
JFCFOLD  EQU   JFCUCSOP                                                 09624000
JFCUCSID EQU   JFCUCSEG                                                 09625000
JFCPCIR2 EQU   JFCPCI                                                   09626000
JFCPCIR1 EQU   JFCPCI                                                   09627000
JFCPCIN2 EQU   JFCPCI                                                   09628000
JFCPCIN1 EQU   JFCPCI                                                   09629000
JFCPCIA2 EQU   JFCPCI                                                   09630000
JFCPCIA1 EQU   JFCPCI                                                   09631000
JFCPCIX2 EQU   JFCPCI                                                   09632000
JFCPCIX1 EQU   JFCPCI                                                   09633000
JFCBUFMX EQU   JFCNCP                                                   09634000
JFCBAXBF EQU   JFCBUFSI                                                 09635000
JFCREL   EQU   JFCREORG                                                 09636000
JFCRSV22 EQU   JFCDEL                                                   09637000
JFCSRCHD EQU   JFCRSV20                                                 09638000
JFCOPTQ  EQU   JFCACT                                                   09639000
JFCFEED  EQU   JFCIND                                                   09640000
JFCCBWU  EQU   JFCEXT                                                   09641000
JFCWUMSG EQU   JFCOVER                                                  09642000
JFCSDNAM EQU   JFCWVCBD                                                 09643000
@NM00003 EQU   JFCRECFM                                                 09644000
JFCCHAR  EQU   JFCRECFM                                                 09645000
JFCRFS   EQU   JFCRECFM                                                 09646000
JFCRFB   EQU   JFCRECFM                                                 09647000
JFCRFO   EQU   JFCRCFM                                                  09648000
JFCFMREC EQU   JFCRCFM                                                  09649000
JFCRSV16 EQU   JFCDSRG2                                                 09650000
JFCRSV15 EQU   JFCDSRG2                                                 09651000
JFCORGTR EQU   JFCDSRG2                                                 09652000
JFCRSV13 EQU   JFCDSRG2                                                 09653000
JFCORGTQ EQU   JFCDSRG2                                                 09654000
JFCORGTX EQU   JFCDSRG2                                                 09655000
JFCORGGS EQU   JFCDSRG2                                                 09656000
JFCORGU  EQU   JFCDSRG1                                                 09657000
JFCORGPO EQU   JFCDSRG1                                                 09658000
JFCORGMQ EQU   JFCDSRG1                                                 09659000
JFCORGCQ EQU   JFCDSRG1                                                 09660000
JFCORGCX EQU   JFCDSRG1                                                 09661000
JFCORGDA EQU   JFCDSRG1                                                 09662000
JFCORGPS EQU   JFCDSRG1                                                 09663000
JFCORGIS EQU   JFCDSRG1                                                 09664000
JFCTRKBL EQU   JFCLIMCT+1                                               09665000
@NM00002 EQU   JFCLIMCT                                                 09666000
JFCONE   EQU   JFCMODE                                                  09667000
JFCTWO   EQU   JFCMODE                                                  09668000
JFCRSV07 EQU   JFCMODE                                                  09669000
JFCRSV06 EQU   JFCMODE                                                  09670000
JFCMODER EQU   JFCMODE                                                  09671000
JFCMODEO EQU   JFCMODE                                                  09672000
JFCEBCD  EQU   JFCMODE                                                  09673000
JFCBIN   EQU   JFCMODE                                                  09674000
JFCRSV32 EQU   JFCCODE                                                  09675000
JFCTTY   EQU   JFCCODE                                                  09676000
JFCASCII EQU   JFCCODE                                                  09677000
JFCNCR   EQU   JFCCODE                                                  09678000
JFCBUR   EQU   JFCCODE                                                  09679000
JFCFRI   EQU   JFCCODE                                                  09680000
JFCBCD   EQU   JFCCODE                                                  09681000
JFCNOCON EQU   JFCCODE                                                  09682000
IDNUM    EQU   DFID+1                                                   09683000
@NM00235 EQU   @NM00234                                                 09684000
T4IDNT   EQU   T4DSDR                                                   09685000
@NM00233 EQU   DSDRFLAG                                                 09686000
DRPUTYP4 EQU   DSDRUTYP+3                                               09687000
@NM00232 EQU   DRPUTYP3                                                 09688000
DRPUBYT2 EQU   DSDRUTYP+1                                               09689000
DRPUBYT1 EQU   DSDRUTYP                                                 09690000
@NM00231 EQU   CHRFLAG2                                                 09691000
USERCKID EQU   CHRFLAG2                                                 09692000
@NM00230 EQU   CHRFLAG2                                                 09693000
CHRWACL  EQU   IHJCHR+41                                                09694000
CKDSOPEN EQU   CHRFLAGS                                                 09695000
CKPTOPEN EQU   CHRFLAGS                                                 09696000
@NM00229 EQU   CHRFLAGS                                                 09697000
@NM00228 EQU   CHRFLAGS                                                 09698000
TAPECKDS EQU   CHRFLAGS                                                 09699000
TRKOVFLO EQU   CHRFLAGS                                                 09700000
CHRTIOTL EQU   IHJCHR+38                                                09701000
CHRBLKSI EQU   IHJCHR+36                                                09702000
CHRCKIDL EQU   IHJCHR+2                                                 09703000
T3IDNT   EQU   T3DSDR                                                   09704000
T2IDNT   EQU   T2DSDR                                                   09705000
@NM00227 EQU   DUMYSCTX                                                 09706000
TCBNEXT  EQU   TCBNCPTR                                                 09707000
@NM00220 EQU   SDWA+512                                                 09708000
SDWAVRA  EQU   SDWARA+4                                                 09709000
SDWAURAL EQU   SDWARA+3                                                 09710000
@NM00219 EQU   SDWADPVA                                                 09711000
SDWAEBC  EQU   SDWADPVA                                                 09712000
SDWAHEX  EQU   SDWADPVA                                                 09713000
SDWAVRAL EQU   SDWARA                                                   09714000
@NM00218 EQU   SDWA+396                                                 09715000
SDWACOMP EQU   SDWA+392                                                 09716000
SDWARCPL EQU   SDWA+364                                                 09717000
@NM00217 EQU   SDWADPSA+32                                              09718000
SDWATO4  EQU   SDWADPSL+28                                              09719000
SDWAFRM4 EQU   SDWADPSL+24                                              09720000
SDWATO3  EQU   SDWADPSL+20                                              09721000
SDWAFRM3 EQU   SDWADPSL+16                                              09722000
SDWATO2  EQU   SDWADPSL+12                                              09723000
SDWAFRM2 EQU   SDWADPSL+8                                               09724000
SDWATO1  EQU   SDWADPSL+4                                               09725000
SDWAFRM1 EQU   SDWADPSL                                                 09726000
@NM00216 EQU   SDWADDAT+3                                               09727000
@NM00215 EQU   SDWAPDAT                                                 09728000
SDWAUSPL EQU   SDWAPDAT                                                 09729000
SDWADPSW EQU   SDWAPDAT                                                 09730000
SDWATJPA EQU   SDWAPDAT                                                 09731000
SDWATLPA EQU   SDWAPDAT                                                 09732000
SDWADREG EQU   SDWAPDAT                                                 09733000
SDWADSAH EQU   SDWAPDAT                                                 09734000
SDWADSAS EQU   SDWAPDAT                                                 09735000
@NM00214 EQU   SDWADDAT+1                                               09736000
@NM00213 EQU   SDWASDAT                                                 09737000
SDWAQQS  EQU   SDWASDAT                                                 09738000
SDWACBS  EQU   SDWASDAT                                                 09739000
SDWAGTF  EQU   SDWASDAT                                                 09740000
SDWASWA  EQU   SDWASDAT                                                 09741000
SDWALSQA EQU   SDWASDAT                                                 09742000
SDWASQA  EQU   SDWASDAT                                                 09743000
SDWANUC  EQU   SDWASDAT                                                 09744000
@NM00212 EQU   SDWADUMP+2                                               09745000
@NM00211 EQU   SDWADPFS                                                 09746000
SDWASLST EQU   SDWADPFS                                                 09747000
@NM00210 EQU   SDWADPFS                                                 09748000
SDWADLST EQU   SDWADPFS                                                 09749000
SDWADPT  EQU   SDWADPFS                                                 09750000
SDWADPID EQU   SDWADUMP                                                 09751000
SDWADPLA EQU   SDWA+316                                                 09752000
SDWAREXN EQU   SDWARECP+16                                              09753000
SDWACSCT EQU   SDWARECP+8                                               09754000
SDWAMODN EQU   SDWARECP                                                 09755000
@NM00209 EQU   SDWA+290                                                 09756000
SDWAASID EQU   SDWA+288                                                 09757000
SDWATALW EQU   SDWALKWS+28                                              09758000
SDWATDLW EQU   SDWALKWS+24                                              09759000
SDWATNLW EQU   SDWALKWS+20                                              09760000
SDWAAPLW EQU   SDWALKWS+16                                              09761000
SDWAIPLW EQU   SDWALKWS+12                                              09762000
SDWAILLW EQU   SDWALKWS+8                                               09763000
SDWAIULW EQU   SDWALKWS+4                                               09764000
SDWAICLW EQU   SDWALKWS                                                 09765000
SDWAFLLK EQU   SDWAACF4                                                 09766000
SDWACMS  EQU   SDWAACF4                                                 09767000
SDWAOPTM EQU   SDWAACF4                                                 09768000
SDWATADB EQU   SDWAACF4                                                 09769000
SDWATDNB EQU   SDWAACF4                                                 09770000
SDWATNCB EQU   SDWAACF4                                                 09771000
SDWAILCH EQU   SDWAACF4                                                 09772000
SDWAIUCB EQU   SDWAACF4                                                 09773000
SDWAICAT EQU   SDWAACF3                                                 09774000
SDWAIPRG EQU   SDWAACF3                                                 09775000
SDWASALL EQU   SDWAACF3                                                 09776000
SDWAASMP EQU   SDWAACF3                                                 09777000
SDWADISP EQU   SDWAACF3                                                 09778000
@NM00208 EQU   SDWAACF3                                                 09779000
@NM00207 EQU   SDWAACF2                                                 09780000
@NM00206 EQU   SDWAACF2                                                 09781000
SDWASPIN EQU   SDWAACF2                                                 09782000
@NM00205 EQU   SDWAACF2                                                 09783000
SDWALCPU EQU   SDWACPUA+2                                               09784000
@NM00204 EQU   SDWACPUA                                                 09785000
SDWARECA EQU   SDWA+244                                                 09786000
@NM00203 EQU   SDWA+239                                                 09787000
@NM00202 EQU   SDWAIOFS                                                 09788000
SDWANIOP EQU   SDWAIOFS                                                 09789000
SDWANOIO EQU   SDWAIOFS                                                 09790000
SDWAIOHT EQU   SDWAIOFS                                                 09791000
SDWAIOQR EQU   SDWAIOFS                                                 09792000
SDWAFMID EQU   SDWA+236                                                 09793000
@NM00201 EQU   SDWAERRD                                                 09794000
SDWAMCIV EQU   SDWAERRD                                                 09795000
SDWARPIV EQU   SDWAERRD                                                 09796000
SDWAMABD EQU   SDWAERRD                                                 09797000
SDWACTS  EQU   SDWAERRD                                                 09798000
SDWASTAE EQU   SDWAERRD                                                 09799000
SDWANRBE EQU   SDWAERRD                                                 09800000
SDWACLUP EQU   SDWAERRD                                                 09801000
@NM00200 EQU   SDWAERRC                                                 09802000
SDWAEAS  EQU   SDWAERRC                                                 09803000
SDWAPERC EQU   SDWAERRC                                                 09804000
SDWAIRB  EQU   SDWAERRC                                                 09805000
SDWASTAI EQU   SDWAERRC                                                 09806000
SDWASTAF EQU   SDWAERRC                                                 09807000
SDWASRBM EQU   SDWAERRB                                                 09808000
SDWALDIS EQU   SDWAERRB                                                 09809000
SDWAENRB EQU   SDWAERRB                                                 09810000
SDWATYP1 EQU   SDWAERRB                                                 09811000
@NM00199 EQU   SDWAERRB                                                 09812000
SDWAPGIO EQU   SDWAERRA                                                 09813000
SDWATEXC EQU   SDWAERRA                                                 09814000
SDWASVCE EQU   SDWAERRA                                                 09815000
SDWAABTM EQU   SDWAERRA                                                 09816000
SDWASVCD EQU   SDWAERRA                                                 09817000
SDWARKEY EQU   SDWAERRA                                                 09818000
SDWAPCHK EQU   SDWAERRA                                                 09819000
SDWAMCHK EQU   SDWAERRA                                                 09820000
SDWATIME EQU   SDWAMCH+20                                               09821000
SDWARFSA EQU   SDWAMCH+16                                               09822000
@NM00198 EQU   SDWAMCH+14                                               09823000
SDWAVEQR EQU   SDWARSR2                                                 09824000
SDWAPGFX EQU   SDWARSR2                                                 09825000
SDWAFLSQ EQU   SDWARSR2                                                 09826000
SDWAFSQA EQU   SDWARSR2                                                 09827000
SDWANUCL EQU   SDWARSR2                                                 09828000
SDWASPER EQU   SDWARSR2                                                 09829000
SDWAINTC EQU   SDWARSR2                                                 09830000
SDWAOFLN EQU   SDWARSR2                                                 09831000
SDWACHNG EQU   SDWARSR1                                                 09832000
SDWAMSER EQU   SDWARSR1                                                 09833000
@NM00197 EQU   SDWARSR1                                                 09834000
SDWACPID EQU   SDWAMCH+10                                               09835000
SDWATERR EQU   SDWAMCHD                                                 09836000
SDWAFPRX EQU   SDWAMCHD                                                 09837000
SDWAINSF EQU   SDWAMCHD                                                 09838000
SDWAACR  EQU   SDWAMCHD                                                 09839000
SDWASCK  EQU   SDWAMCHD                                                 09840000
SDWAPSWU EQU   SDWAMCHD                                                 09841000
SDWAREGU EQU   SDWAMCHD                                                 09842000
SDWASKYF EQU   SDWAMCHD                                                 09843000
@NM00196 EQU   SDWAMCHS                                                 09844000
SDWARSRF EQU   SDWAMCHS                                                 09845000
SDWARSRC EQU   SDWAMCHS                                                 09846000
SDWAINVP EQU   SDWAMCHS                                                 09847000
SDWATSVL EQU   SDWAMCHS                                                 09848000
SDWARCDF EQU   SDWAMCHS                                                 09849000
SDWASRVL EQU   SDWAMCHS                                                 09850000
SDWASCKE EQU   SDWASTCK+4                                               09851000
SDWASCKB EQU   SDWASTCK                                                 09852000
SDWALNTH EQU   SDWAIDNT+1                                               09853000
SDWASPID EQU   SDWAIDNT                                                 09854000
SDWASR15 EQU   SDWASRSV+60                                              09855000
SDWASR14 EQU   SDWASRSV+56                                              09856000
SDWASR13 EQU   SDWASRSV+52                                              09857000
SDWASR12 EQU   SDWASRSV+48                                              09858000
SDWASR11 EQU   SDWASRSV+44                                              09859000
SDWASR10 EQU   SDWASRSV+40                                              09860000
SDWASR09 EQU   SDWASRSV+36                                              09861000
SDWASR08 EQU   SDWASRSV+32                                              09862000
SDWASR07 EQU   SDWASRSV+28                                              09863000
SDWASR06 EQU   SDWASRSV+24                                              09864000
SDWASR05 EQU   SDWASRSV+20                                              09865000
SDWASR04 EQU   SDWASRSV+16                                              09866000
SDWASR03 EQU   SDWASRSV+12                                              09867000
SDWASR02 EQU   SDWASRSV+8                                               09868000
SDWASR01 EQU   SDWASRSV+4                                               09869000
SDWASR00 EQU   SDWASRSV                                                 09870000
SDWATRN2 EQU   SDWAAEC2+4                                               09871000
SDWAIPC2 EQU   SDWAICD2                                                 09872000
SDWAIMC2 EQU   SDWAICD2                                                 09873000
SDWAIPR2 EQU   SDWAICD2                                                 09874000
@NM00195 EQU   SDWAINC2                                                 09875000
@NM00194 EQU   SDWAILC2                                                 09876000
SDWAIL2  EQU   SDWAILC2                                                 09877000
@NM00193 EQU   SDWAILC2                                                 09878000
@NM00192 EQU   SDWAAEC2                                                 09879000
SDWAADD2 EQU   SDWANXT2+1                                               09880000
@NM00191 EQU   SDWANXT2                                                 09881000
@NM00190 EQU   SDWAEC2+3                                                09882000
SDWASGN2 EQU   SDWAINT2                                                 09883000
SDWAEXP2 EQU   SDWAINT2                                                 09884000
SDWADEC2 EQU   SDWAINT2                                                 09885000
SDWAFPO2 EQU   SDWAINT2                                                 09886000
SDWACC2  EQU   SDWAINT2                                                 09887000
@NM00189 EQU   SDWAINT2                                                 09888000
SDWAPGM2 EQU   SDWAMWP2                                                 09889000
SDWAWAT2 EQU   SDWAMWP2                                                 09890000
SDWAMCK2 EQU   SDWAMWP2                                                 09891000
SDWAECT2 EQU   SDWAMWP2                                                 09892000
SDWAKEY2 EQU   SDWAMWP2                                                 09893000
SDWAEXT2 EQU   SDWAEMK2                                                 09894000
SDWAIO2  EQU   SDWAEMK2                                                 09895000
SDWATRM2 EQU   SDWAEMK2                                                 09896000
@NM00188 EQU   SDWAEMK2                                                 09897000
SDWAPER2 EQU   SDWAEMK2                                                 09898000
@NM00187 EQU   SDWAEMK2                                                 09899000
SDWATRAN EQU   SDWAAEC1+4                                               09900000
SDWAIPC1 EQU   SDWAICD1                                                 09901000
SDWAIMC1 EQU   SDWAICD1                                                 09902000
SDWAIPR1 EQU   SDWAICD1                                                 09903000
@NM00186 EQU   SDWAINC1                                                 09904000
@NM00185 EQU   SDWAILC1                                                 09905000
SDWAIL1  EQU   SDWAILC1                                                 09906000
@NM00184 EQU   SDWAILC1                                                 09907000
@NM00183 EQU   SDWAAEC1                                                 09908000
SDWAADD1 EQU   SDWANXT1+1                                               09909000
@NM00182 EQU   SDWANXT1                                                 09910000
@NM00181 EQU   SDWAEC1+3                                                09911000
SDWASGN1 EQU   SDWAINT1                                                 09912000
SDWAEXP1 EQU   SDWAINT1                                                 09913000
SDWADEC1 EQU   SDWAINT1                                                 09914000
SDWAFPO1 EQU   SDWAINT1                                                 09915000
SDWACC1  EQU   SDWAINT1                                                 09916000
@NM00180 EQU   SDWAINT1                                                 09917000
SDWAPGM1 EQU   SDWAMWP1                                                 09918000
SDWAWAT1 EQU   SDWAMWP1                                                 09919000
SDWAMCK1 EQU   SDWAMWP1                                                 09920000
SDWAECT1 EQU   SDWAMWP1                                                 09921000
SDWAKEY1 EQU   SDWAMWP1                                                 09922000
SDWAEXT1 EQU   SDWAEMK1                                                 09923000
SDWAIO1  EQU   SDWAEMK1                                                 09924000
SDWATRM1 EQU   SDWAEMK1                                                 09925000
@NM00179 EQU   SDWAEMK1                                                 09926000
SDWAPER1 EQU   SDWAEMK1                                                 09927000
@NM00178 EQU   SDWAEMK1                                                 09928000
SDWAIOBR EQU   SDWA+100                                                 09929000
SDWAEPA  EQU   SDWA+96                                                  09930000
@NM00177 EQU   SDWANAME+4                                               09931000
SDWARBAD EQU   SDWANAME                                                 09932000
SDWAGR15 EQU   SDWAGRSV+60                                              09933000
SDWAGR14 EQU   SDWAGRSV+56                                              09934000
SDWAGR13 EQU   SDWAGRSV+52                                              09935000
SDWAGR12 EQU   SDWAGRSV+48                                              09936000
SDWAGR11 EQU   SDWAGRSV+44                                              09937000
SDWAGR10 EQU   SDWAGRSV+40                                              09938000
SDWAGR09 EQU   SDWAGRSV+36                                              09939000
SDWAGR08 EQU   SDWAGRSV+32                                              09940000
SDWAGR07 EQU   SDWAGRSV+28                                              09941000
SDWAGR06 EQU   SDWAGRSV+24                                              09942000
SDWAGR05 EQU   SDWAGRSV+20                                              09943000
SDWAGR04 EQU   SDWAGRSV+16                                              09944000
SDWAGR03 EQU   SDWAGRSV+12                                              09945000
SDWAGR02 EQU   SDWAGRSV+8                                               09946000
SDWAGR01 EQU   SDWAGRSV+4                                               09947000
SDWAGR00 EQU   SDWAGRSV                                                 09948000
SDWANXTP EQU   SDWACTL2+5                                               09949000
SDWASGP  EQU   SDWAPMKP                                                 09950000
SDWAEUP  EQU   SDWAPMKP                                                 09951000
SDWADOP  EQU   SDWAPMKP                                                 09952000
SDWAFPP  EQU   SDWAPMKP                                                 09953000
SDWACCP  EQU   SDWAPMKP                                                 09954000
SDWAILP  EQU   SDWAPMKP                                                 09955000
SDWAINTP EQU   SDWACTL2+2                                               09956000
SDWASPVP EQU   SDWAMWPP                                                 09957000
SDWAWATP EQU   SDWAMWPP                                                 09958000
SDWAMCKP EQU   SDWAMWPP                                                 09959000
@NM00176 EQU   SDWAMWPP                                                 09960000
SDWAKEYP EQU   SDWAMWPP                                                 09961000
SDWAEXTP EQU   SDWACMKP                                                 09962000
SDWAIOP  EQU   SDWACMKP                                                 09963000
SDWANXTA EQU   SDWACTL1+5                                               09964000
SDWASGA  EQU   SDWAPMKA                                                 09965000
SDWAEUA  EQU   SDWAPMKA                                                 09966000
SDWADOA  EQU   SDWAPMKA                                                 09967000
SDWAFPA  EQU   SDWAPMKA                                                 09968000
SDWACCA  EQU   SDWAPMKA                                                 09969000
SDWAILA  EQU   SDWAPMKA                                                 09970000
SDWAINTA EQU   SDWACTL1+2                                               09971000
SDWASPVA EQU   SDWAMWPA                                                 09972000
SDWAWATA EQU   SDWAMWPA                                                 09973000
SDWAMCKA EQU   SDWAMWPA                                                 09974000
@NM00175 EQU   SDWAMWPA                                                 09975000
SDWAKEYA EQU   SDWAMWPA                                                 09976000
SDWAEXTA EQU   SDWACMKA                                                 09977000
SDWAIOA  EQU   SDWACMKA                                                 09978000
SDWACMPC EQU   SDWAABCC+1                                               09979000
@NM00174 EQU   SDWACMPF                                                 09980000
SDWASTCC EQU   SDWACMPF                                                 09981000
@NM00173 EQU   SDWACMPF                                                 09982000
SDWASTEP EQU   SDWACMPF                                                 09983000
@NM00172 EQU   GDGNT+165                                                09984000
GNTBASE  EQU   GNTGRPEN+35                                              09985000
GNTNAME  EQU   GNTGRPEN                                                 09986000
GNTNEXTR EQU   GDGNT+4                                                  09987000
GNTID    EQU   GDGNT+3                                                  09988000
JESSASTA EQU   JESCT+48                                                 09989000
JESNUCBS EQU   JESCT+44                                                 09990000
JESPJESN EQU   JESCT+28                                                 09991000
JESSSCT  EQU   JESCT+24                                                 09992000
JESRESQM EQU   JESCT+16                                                 09993000
JESUNITS EQU   JESCT+4                                                  09994000
@NM00171 EQU   JESCT                                                    09995000
SWASNZO  EQU   SWBUFPTR+3                                               09996000
QDBRV002 EQU   QDB+28                                                   09997000
QDBPRDS  EQU   QDB+26                                                   09998000
QDBPRSZ  EQU   QDB+24                                                   09999000
QDBBPTDS EQU   QDB+22                                                   10000000
QDBFPTDS EQU   QDB+20                                                   10001000
QDBNELMS EQU   QDB+8                                                    10002000
QDBRV001 EQU   QDB+6                                                    10003000
QDBATTR  EQU   QDB+4                                                    10004000
QDBQDB   EQU   QDB                                                      10005000
DSABGRID EQU   DSABGIDL+4                                               10006000
DSABLLEN EQU   DSABGIDL                                                 10007000
DSABANAM EQU   DSABANMI+1                                               10008000
DSABANML EQU   DSABANMI                                                 10009000
DSABRS04 EQU   DSAB+68                                                  10010000
DSABSIOT EQU   DSAB+64                                                  10011000
DSABRS03 EQU   DSAB+62                                                  10012000
DSABDCBM EQU   DSAB+56                                                  10013000
DSABSSCM EQU   DSAB+52                                                  10014000
DSABSSNM EQU   DSAB+48                                                  10015000
DSABPTTR EQU   DSAB+44                                                  10016000
DSABTCBP EQU   DSAB+40                                                  10017000
DSABRS02 EQU   DSAB+38                                                  10018000
@NM00170 EQU   DSABFLG4                                                 10019000
DSABCKSI EQU   DSABFLG4                                                 10020000
DSABCKDS EQU   DSABFLG4                                                 10021000
@NM00169 EQU   DSABFLG3                                                 10022000
DSABJSCT EQU   DSABFLG3                                                 10023000
DSABVMSC EQU   DSABFLG3                                                 10024000
DSABVAM  EQU   DSABFLG3                                                 10025000
DSABPASS EQU   DSABFLG3                                                 10026000
DSABDEFR EQU   DSABFLG3                                                 10027000
@NM00168 EQU   DSABFLG2                                                 10028000
DSABUNAL EQU   DSABFLG2                                                 10029000
DSABIRM  EQU   DSABFLG2                                                 10030000
DSABOPEN EQU   DSABFLG2                                                 10031000
DSABNUSE EQU   DSABFLG1                                                 10032000
DSABCATM EQU   DSABFLG1                                                 10033000
DSABPCAT EQU   DSABFLG1                                                 10034000
DSABDCAT EQU   DSABFLG1                                                 10035000
DSABCONV EQU   DSABFLG1                                                 10036000
DSABDCNV EQU   DSABFLG1                                                 10037000
DSABPALC EQU   DSABFLG1                                                 10038000
DSABDALC EQU   DSABFLG1                                                 10039000
@NM00167 EQU   DSABORG2                                                 10040000
DSABTR   EQU   DSABORG2                                                 10041000
DSABAM   EQU   DSABORG2                                                 10042000
@NM00166 EQU   DSABORG2                                                 10043000
DSABTQ   EQU   DSABORG2                                                 10044000
DSABTX   EQU   DSABORG2                                                 10045000
DSABGS   EQU   DSABORG2                                                 10046000
DSABU    EQU   DSABORG1                                                 10047000
DSABPO   EQU   DSABORG1                                                 10048000
DSABMQ   EQU   DSABORG1                                                 10049000
DSABCQ   EQU   DSABORG1                                                 10050000
DSABCX   EQU   DSABORG1                                                 10051000
DSABDA   EQU   DSABORG1                                                 10052000
DSABPS   EQU   DSABORG1                                                 10053000
DSABIS   EQU   DSABORG1                                                 10054000
DSABSSVA EQU   DSAB+21                                                  10055000
DSABRS01 EQU   DSAB+20                                                  10056000
DSABOPCT EQU   DSAB+14                                                  10057000
DSABLNTH EQU   DSAB+12                                                  10058000
DSABBCHN EQU   DSAB+8                                                   10059000
DSABID   EQU   DSAB                                                     10060000
GRPMASK  EQU   GMTENTRY                                                 10061000
GMTENTLN EQU   GMTHDR+4                                                 10062000
GMTENTNO EQU   GMTHDR                                                   10063000
EUCBTPOS EQU   EUCBENTY                                                 10064000
EUCBENLN EQU   EUCBHDR+4                                                10065000
EUCBENNO EQU   EUCBHDR                                                  10066000
GRPUCBNO EQU   GRPENTRY+4                                               10067000
GRPID    EQU   GRPENTRY                                                 10068000
GRPENTLN EQU   GRPHDR+4                                                 10069000
GRPENTNO EQU   GRPHDR                                                   10070000
GRPTR    EQU   GRPTRTAB                                                 10071000
GENGRPTR EQU   GENENTRY+8                                               10072000
GENGRPNO EQU   GENENTRY+4                                               10073000
GENDEVT  EQU   GENENTRY                                                 10074000
GENENTLN EQU   GENHDR+4                                                 10075000
GENENTNO EQU   GENHDR                                                   10076000
LUVAGMTP EQU   LUVENTRY+28                                              10077000
@NM00165 EQU   LUVFLAGS                                                 10078000
LUVAGMSK EQU   LUVFLAGS                                                 10079000
LUVVAM   EQU   LUVFLAGS                                                 10080000
LUVGENP  EQU   LUVENTRY+20                                              10081000
LUVALUE  EQU   LUVENTRY+8                                               10082000
S99TUPRM EQU   S99TUFLD+2                                               10083000
S99TULEN EQU   S99TUFLD                                                 10084000
S99TUPAR EQU   S99TUENT+2                                               10085000
S99TULNG EQU   S99TUENT                                                 10086000
S99TUNUM EQU   S99TUNIT+2                                               10087000
S99TUKEY EQU   S99TUNIT                                                 10088000
S99TUPND EQU   S99TUP                                                   10089000
S99TUPLN EQU   S99TUPTR                                                 10090000
S99FLG24 EQU   S99FLAG2+3                                               10091000
S99FLG23 EQU   S99FLAG2+2                                               10092000
S99PCINT EQU   S99FLG22                                                 10093000
S99MOUNT EQU   S99FLG21                                                 10094000
S99CATLG EQU   S99FLG21                                                 10095000
S99TIONQ EQU   S99FLG21                                                 10096000
S99OFFLN EQU   S99FLG21                                                 10097000
S99NORES EQU   S99FLG21                                                 10098000
S99WTVOL EQU   S99FLG21                                                 10099000
S99INFO  EQU   S99RSC+2                                                 10100000
S99ERROR EQU   S99RSC                                                   10101000
S99FLG12 EQU   S99FLAG1+1                                               10102000
S99JBSYS EQU   S99FLG11                                                 10103000
S99NOMNT EQU   S99FLG11                                                 10104000
S99NOCNV EQU   S99FLG11                                                 10105000
S99ONCNV EQU   S99FLG11                                                 10106000
GBLCELCT EQU   GDA+60                                                   10107000
GLBLCELL EQU   GDA+56                                                   10108000
CSASPQEP EQU   GDA+52                                                   10109000
PFSTCPAB EQU   GDA+48                                                   10110000
VRWLEL   EQU   VRWAITQ+4                                                10111000
VRWFEL   EQU   VRWAITQ                                                  10112000
VRPLEL   EQU   VRPOSTQ+4                                                10113000
VRPFEL   EQU   VRPOSTQ                                                  10114000
SQASPLFT EQU   GDA+28                                                   10115000
SQASPQEP EQU   GDA+24                                                   10116000
PASIZE   EQU   GDA+20                                                   10117000
VRPQEP   EQU   GDA+12                                                   10118000
CSAPQEP  EQU   GDA+8                                                    10119000
VRDREG   EQU   GDA+4                                                    10120000
RESV     EQU   GVSMFLAG+1                                               10121000
@NM00164 EQU   GDAFLAGS                                                 10122000
WAITQUE  EQU   GDAFLAGS                                                 10123000
SQATHRS2 EQU   GDAFLAGS                                                 10124000
SQATHRS1 EQU   GDAFLAGS                                                 10125000
GDAFLAG2 EQU   GDAFLAGS                                                 10126000
NIPFOURK EQU   GDAFLAGS                                                 10127000
GDAFLAG1 EQU   GDAFLAGS                                                 10128000
SWPACRO  EQU   SWAPFX+12                                                10129000
SWPLNGTH EQU   SWAPFX+9                                                 10130000
SWPID    EQU   SWAPFX+8                                                 10131000
SWPVA    EQU   SWAPFX+5                                                 10132000
@NM00163 EQU   SWPSTA                                                   10133000
SWPWRT   EQU   SWPSTA                                                   10134000
SWPRBN   EQU   SWAPFX                                                   10135000
UCBERADR EQU   UCBUCS+12                                                10136000
UCBFCBID EQU   UCBUCS+8                                                 10137000
UCBERCNT EQU   UCBUCS+7                                                 10138000
UCBRSV51 EQU   UCBUCS+6                                                 10139000
UCBFCBPE EQU   UCBFCBOP                                                 10140000
UCBRSV49 EQU   UCBFCBOP                                                 10141000
UCBRSV48 EQU   UCBFCBOP                                                 10142000
UCBRSV47 EQU   UCBFCBOP                                                 10143000
UCBRSV46 EQU   UCBFCBOP                                                 10144000
UCBRSV45 EQU   UCBFCBOP                                                 10145000
UCBRSV44 EQU   UCBFCBOP                                                 10146000
UCBFCBO1 EQU   UCBFCBOP                                                 10147000
UCBUCSPE EQU   UCBUCSOP                                                 10148000
UCBRSV43 EQU   UCBUCSOP                                                 10149000
UCBRSV42 EQU   UCBUCSOP                                                 10150000
UCBRSV41 EQU   UCBUCSOP                                                 10151000
UCBRSV40 EQU   UCBUCSOP                                                 10152000
UCBRSV39 EQU   UCBUCSOP                                                 10153000
UCBUCSO2 EQU   UCBUCSOP                                                 10154000
UCBUCSO1 EQU   UCBUCSOP                                                 10155000
UCBUCSID EQU   UCBUCS                                                   10156000
UCBMDRBA EQU   UCBMDRBF+1                                               10157000
UCBRV075 EQU   UCBMDRBF                                                 10158000
UCBRV074 EQU   UCB3800X+32                                              10159000
UCBIMAGE EQU   UCB3800X+28                                              10160000
UCBFCBNM EQU   UCB3800X+24                                              10161000
UCBCHAR4 EQU   UCB3800X+20                                              10162000
UCBCHAR3 EQU   UCB3800X+16                                              10163000
UCBCHAR2 EQU   UCB3800X+12                                              10164000
UCBCHAR1 EQU   UCB3800X+8                                               10165000
UCBCGMID EQU   UCB3800X+4                                               10166000
UCBBRSTA EQU   UCBACTIV                                                 10167000
UCBRV063 EQU   UCBACTIV                                                 10168000
UCBRV062 EQU   UCBACTIV                                                 10169000
UCBRV061 EQU   UCBACTIV                                                 10170000
UCBRV060 EQU   UCBACTIV                                                 10171000
UCBRV059 EQU   UCBACTIV                                                 10172000
UCBRV058 EQU   UCBACTIV                                                 10173000
UCBRV057 EQU   UCBACTIV                                                 10174000
UCBRV050 EQU   UCB3800X+2                                               10175000
UCBCGMNO EQU   UCB3800X+1                                               10176000
UCBRV083 EQU   UCBOPTNS                                                 10177000
UCBBRSTR EQU   UCBOPTNS                                                 10178000
UCBRV056 EQU   UCBOPTNS                                                 10179000
UCBRV055 EQU   UCBOPTNS                                                 10180000
UCBRV054 EQU   UCBOPTNS                                                 10181000
UCBRV053 EQU   UCBOPTNS                                                 10182000
UCBRV052 EQU   UCBOPTNS                                                 10183000
UCBRV051 EQU   UCBOPTNS                                                 10184000
UCBRV073 EQU   UCB3540X+7                                               10185000
UCBRV072 EQU   UCBDKBYT                                                 10186000
UCBRV071 EQU   UCBDKBYT                                                 10187000
UCBRV070 EQU   UCBDKBYT                                                 10188000
UCBRV069 EQU   UCBDKBYT                                                 10189000
UCBRV068 EQU   UCBDKBYT                                                 10190000
UCBRV067 EQU   UCBDKBYT                                                 10191000
UCBVLVER EQU   UCBDKBYT                                                 10192000
UCBDKAMX EQU   UCBDKBYT                                                 10193000
UCBVLSER EQU   UCB3540X                                                 10194000
UCBRDATA EQU   UCBOCR+4                                                 10195000
UCBFRID  EQU   UCBOCR                                                   10196000
UCBCLN   EQU   UCBMT+14                                                 10197000
UCBERG   EQU   UCBMT+12                                                 10198000
UCBMS    EQU   UCBMT+11                                                 10199000
UCBNB    EQU   UCBMT+10                                                 10200000
UCBPW    EQU   UCBMT+9                                                  10201000
UCBPR    EQU   UCBMT+8                                                  10202000
UCBSIO   EQU   UCBMT+6                                                  10203000
UCBTW    EQU   UCBMT+5                                                  10204000
UCBTR    EQU   UCBMT+4                                                  10205000
UCBTWT   EQU   UCBMT+3                                                  10206000
UCBTRT   EQU   UCBMT+2                                                  10207000
UCBCTD   EQU   UCBMT                                                    10208000
UCBWTOID EQU   UCBCMEXT+17                                              10209000
UCBRV043 EQU   UCBCMEXT+16                                              10210000
UCBASID  EQU   UCBCMEXT+14                                              10211000
UCBMFCNT EQU   UCBCMEXT+12                                              10212000
UCBPMSK  EQU   UCBCMEXT+10                                              10213000
UCBCCWOF EQU   UCBCMEXT+8                                               10214000
UCBRV041 EQU   UCBCMEXT+6                                               10215000
UCBRV036 EQU   UCBFLP1                                                  10216000
UCBRV035 EQU   UCBFLP1                                                  10217000
UCBERLOG EQU   UCBFLP1                                                  10218000
UCBRV033 EQU   UCBFLP1                                                  10219000
UCBINHIO EQU   UCBFLP1                                                  10220000
UCBNSWAP EQU   UCBFLP1                                                  10221000
UCBSHRUP EQU   UCBFLP1                                                  10222000
UCBNSRCH EQU   UCBFLP1                                                  10223000
UCBSNSCT EQU   UCBCMEXT+4                                               10224000
UCBHPDV  EQU   @NM00162                                                 10225000
UCBHALI  EQU   @NM00162                                                 10226000
UCBRSV09 EQU   @NM00162                                                 10227000
UCBRSV08 EQU   @NM00162                                                 10228000
UCBRSV07 EQU   @NM00162                                                 10229000
UCBRSV06 EQU   @NM00162                                                 10230000
UCBRSV05 EQU   @NM00162                                                 10231000
UCBRSV04 EQU   @NM00162                                                 10232000
UCBDTI   EQU   UCBCMEXT+2                                               10233000
UCBSTI   EQU   UCBCMEXT+1                                               10234000
UCBETI   EQU   UCBCMEXT                                                 10235000
UCBEXTP  EQU   UCBEXTPT+1                                               10236000
UCBDDRSW EQU   UCBFLC                                                   10237000
UCBTICBT EQU   UCBFLC                                                   10238000
UCBIVRR  EQU   UCBFLC                                                   10239000
UCBIVRS  EQU   UCBFLC                                                   10240000
UCBITF   EQU   UCBFLC                                                   10241000
UCBUDE   EQU   UCBFLC                                                   10242000
UCBWAA   EQU   UCBFLC                                                   10243000
UCBATTP  EQU   UCBFLC                                                   10244000
UCBUNTYP EQU   UCBTBYT4                                                 10245000
UCBRSV11 EQU   UCBDVCLS                                                 10246000
UCBRSV10 EQU   UCBDVCLS                                                 10247000
UCB3CHAR EQU   UCBDVCLS                                                 10248000
UCB3UREC EQU   UCBDVCLS                                                 10249000
UCB3DISP EQU   UCBDVCLS                                                 10250000
UCB3COMM EQU   UCBDVCLS                                                 10251000
UCB3TAPE EQU   UCBDVCLS                                                 10252000
UCBDVPWR EQU   UCB2OPT7                                                 10253000
UCBVLPWR EQU   UCB2OPT6                                                 10254000
UCB2OPT5 EQU   UCBTBYT2                                                 10255000
UCBRVDEV EQU   UCBRWTAU                                                 10256000
UCBRPS   EQU   UCBDUDN2                                                 10257000
UCBRR    EQU   UCBDUDN1                                                 10258000
UCB2OPT1 EQU   UCBTBYT2                                                 10259000
UCB2OPT0 EQU   UCBTBYT2                                                 10260000
UCB1FEA7 EQU   UCBTBYT1                                                 10261000
UCBD6250 EQU   UCB1FEA6                                                 10262000
UCBD1600 EQU   UCB1FEA5                                                 10263000
UCB1FEA4 EQU   UCBTBYT1                                                 10264000
UCB1FEA3 EQU   UCBTBYT1                                                 10265000
UCB1FEA2 EQU   UCBTBYT1                                                 10266000
UCB1FEA1 EQU   UCBTBYT1                                                 10267000
UCB1FEA0 EQU   UCBTBYT1                                                 10268000
UCBNAME  EQU   UCBOB+13                                                 10269000
UCBRV029 EQU   UCBWGT                                                   10270000
UCBVHRSN EQU   UCBWGT                                                   10271000
UCBVORSN EQU   UCBWGT                                                   10272000
UCBMTPXP EQU   UCBWGT                                                   10273000
UCBREW   EQU   UCBWGT                                                   10274000
UCBPUB   EQU   UCBWGT                                                   10275000
UCBOUT   EQU   UCBWGT                                                   10276000
UCBIN    EQU   UCBWGT                                                   10277000
UCBCPU   EQU   UCBOB+11                                                 10278000
UCBLCI   EQU   UCBOB+10                                                 10279000
UCBCNT   EQU   UCBOB+9                                                  10280000
UCBRV017 EQU   UCBCHM1                                                  10281000
UCBRV016 EQU   UCBCHM1                                                  10282000
UCBRV015 EQU   UCBCHM1                                                  10283000
UCBRV014 EQU   UCBCHM1                                                  10284000
UCBSPB   EQU   UCBPTH1                                                  10285000
UCBPPB   EQU   UCBPTH1                                                  10286000
UCBSPA   EQU   UCBPTH0                                                  10287000
UCBPPA   EQU   UCBPTH0                                                  10288000
UCBSIGP  EQU   UCBFLB                                                   10289000
UCBVALPH EQU   UCBFLB                                                   10290000
UCBCRHSN EQU   UCBFLB                                                   10291000
UCBCRHRV EQU   UCBFLB                                                   10292000
UCBRESVH EQU   UCBFLB                                                   10293000
UCBSPST  EQU   UCBFLB                                                   10294000
UCBASNS  EQU   UCBFLB                                                   10295000
UCBIORST EQU   UCBFLB                                                   10296000
UCBQISCE EQU   UCBFL1                                                   10297000
UCBACTV  EQU   UCBFL1                                                   10298000
UCBSAP   EQU   UCBFL1                                                   10299000
UCBNOTRC EQU   UCBCUB                                                   10300000
UCBPSNS  EQU   UCBFL1                                                   10301000
UCBUSING EQU   UCBPST                                                   10302000
UCBNOTRD EQU   UCBNRY                                                   10303000
UCBBUSYD EQU   UCBBSY                                                   10304000
UCBUA    EQU   UCBCHAN+1                                                10305000
UCBCHA   EQU   UCBCHAN                                                  10306000
UCBDADI  EQU   UCBSTAT                                                  10307000
UCBSYSR  EQU   UCBSTAT                                                  10308000
UCBPRES  EQU   UCBSTAT                                                  10309000
UCBALOC  EQU   UCBSTAT                                                  10310000
UCBUNLD  EQU   UCBSTAT                                                  10311000
UCBRESV  EQU   UCBSTAT                                                  10312000
UCBCHGS  EQU   UCBSTAT                                                  10313000
UCBONLI  EQU   UCBSTAT                                                  10314000
UCBID    EQU   UCBOB+2                                                  10315000
UCBALTPH EQU   UCBFL5                                                   10316000
UCBALTCU EQU   UCBFL5                                                   10317000
UCBNALOC EQU   UCBFL5                                                   10318000
UCBENVRD EQU   UCBFL5                                                   10319000
UCBVSDR  EQU   UCBFL5                                                   10320000
UCBSASK  EQU   UCBFL5                                                   10321000
UCBAMV   EQU   UCBAF                                                    10322000
UCBDCC   EQU   UCBFL5                                                   10323000
UCBMONT  EQU   UCBJBNR                                                  10324000
UCBRV011 EQU   UCBJBNR                                                  10325000
UCBMMSGP EQU   UCBJBNR                                                  10326000
UCBOLDSM EQU   UCBJBNR                                                  10327000
UCBRV003 EQU   UCBJBNR                                                  10328000
UCBDUC   EQU   UCBJBNR                                                  10329000
UCBJES3  EQU   UCBJBNR                                                  10330000
UCBVRDEV EQU   UCBJBNR                                                  10331000
UCBCMSEG EQU   UCBOB                                                    10332000
UCBPFXND EQU   UCB+512                                                  10333000
UCBIOQ   EQU   UCB+508                                                  10334000
UCBLOCK  EQU   UCB+504                                                  10335000
UCBPXST  EQU   UCB+504                                                  10336000
@NM00159 EQU   UCB                                                      10337000
JSCBCSCB EQU   JSCBSEC1+68                                              10338000
JSCBPMG  EQU   JSCBWTP+2                                                10339000
JSCBWTSP EQU   JSCBWTP+1                                                10340000
JSCRSV23 EQU   JSCBWTFG                                                 10341000
JSCRSV22 EQU   JSCBWTFG                                                 10342000
JSCRSV21 EQU   JSCBWTFG                                                 10343000
JSCRSV20 EQU   JSCBWTFG                                                 10344000
JSCRSV19 EQU   JSCBWTFG                                                 10345000
JSCRSV18 EQU   JSCBWTFG                                                 10346000
JSCBRET  EQU   JSCBWTFG                                                 10347000
JSCBIOFG EQU   JSCBWTFG                                                 10348000
@NM00156 EQU   JSCBSEC1+60                                              10349000
JSCBQMPI EQU   JSCBSEC1+56                                              10350000
JSCBPMSG EQU   JSCBSWT1                                                 10351000
JSCRSV16 EQU   JSCBSWT1                                                 10352000
JSCRSV15 EQU   JSCBSWT1                                                 10353000
JSCRSV14 EQU   JSCBSWT1                                                 10354000
JSCRSV13 EQU   JSCBSWT1                                                 10355000
JSCRSV12 EQU   JSCBSWT1                                                 10356000
JSCRSV11 EQU   JSCBSWT1                                                 10357000
JSCBPASS EQU   JSCBSWT1                                                 10358000
JSCBTTTR EQU   JSCBSEC1+52                                              10359000
JSCRSV10 EQU   JSCBSEC1+49                                              10360000
JSCBAUTH EQU   JSCBOPTS                                                 10361000
JSCSIOTS EQU   JSCBOPTS                                                 10362000
JSCRSV08 EQU   JSCBOPTS                                                 10363000
JSCRSV07 EQU   JSCBOPTS                                                 10364000
JSCRSV06 EQU   JSCBOPTS                                                 10365000
JSCBLONG EQU   JSCBOPTS                                                 10366000
JSCRSV05 EQU   JSCBOPTS                                                 10367000
JSCRSV04 EQU   JSCBOPTS                                                 10368000
JSCBSECB EQU   JSCBSEC1+44                                              10369000
JSCRSV03 EQU   JSCBSEC1+41                                              10370000
JSCBSTEP EQU   JSCBSEC1+40                                              10371000
JSCBDCBA EQU   JSCBDCB+1                                                10372000
JSCRSV02 EQU   JSCBDCB                                                  10373000
JSCBID   EQU   JSCBSEC1+32                                              10374000
JSCBDBTB EQU   JSCBSEC1+28                                              10375000
JSCBIJSC EQU   JSCBSEC1+24                                              10376000
JSCBTCBP EQU   JSCBSEC1+20                                              10377000
JSCBTCP  EQU   JSCBSEC1+12                                              10378000
JSCBSHR  EQU   JSCBSEC1+8                                               10379000
JSCHPCEA EQU   JSCHPCE+1                                                10380000
JSCRSV32 EQU   JSCHPCE                                                  10381000
JSCRSV01 EQU   JSCBSEC1                                                 10382000
@NM00155 EQU   IEZJSCB                                                  10383000
CHSAVWD2 EQU   CHSHORT+100                                              10384000
CHSAVWD1 EQU   CHSHORT+96                                               10385000
CHJSCBVS EQU   CHSHORT+92                                               10386000
CHUSCVS  EQU   CHSHORT+88                                               10387000
@NM00153 EQU   CHSHORT+84                                               10388000
@NM00152 EQU   CHSHORT+80                                               10389000
CHSQA    EQU   CHSHORT+44                                               10390000
CHQPA    EQU   CHSHORT+8                                                10391000
CHJCL    EQU   CHSHORT+4                                                10392000
CHSPC    EQU   CHSHORT                                                  10393000
CHSPB    EQU   CHSTEP+4                                                 10394000
CHTCB    EQU   CHSTEP+1                                                 10395000
CHARSV23 EQU   CHSWT                                                    10396000
CHARSV22 EQU   CHSWT                                                    10397000
CHARSV21 EQU   CHSWT                                                    10398000
CHAC     EQU   CHSWT                                                    10399000
CHPSF    EQU   CHSWT                                                    10400000
CHPSD    EQU   CHSWT                                                    10401000
CHJCT    EQU   CHSWT                                                    10402000
CHARSV20 EQU   CHSWT                                                    10403000
CHECB    EQU   CHASM+16                                                 10404000
CHRGNAD  EQU   CHASM+12                                                 10405000
CHARSV18 EQU   CHRGNSZ+1                                                10406000
CHRPRTY  EQU   CHRGNSZ                                                  10407000
@NM00151 EQU   CHCIBP                                                   10408000
CHEND    EQU   CHCIBP                                                   10409000
CHECBP   EQU   CHASM                                                    10410000
CHDER    EQU   CHPROCSN+4                                               10411000
CHARSV10 EQU   CHACT1                                                   10412000
CHARSV09 EQU   CHACT1                                                   10413000
CHARSV08 EQU   CHACT1                                                   10414000
CHARSV07 EQU   CHACT1                                                   10415000
CHARSV06 EQU   CHACT1                                                   10416000
CHARSV05 EQU   CHACT1                                                   10417000
CHARSV04 EQU   CHACT1                                                   10418000
CHRDWTR  EQU   CHACT1                                                   10419000
CHARSV30 EQU   CHPROCSN+2                                               10420000
CHQID    EQU   CHPROCSN                                                 10421000
CHASID   EQU   CHTJID                                                   10422000
CHUCMP   EQU   CHAIN+29                                                 10423000
CHTRKID  EQU   CHPKE                                                    10424000
CHCIBCTR EQU   CHAIN+27                                                 10425000
CHUNIT   EQU   CHAIN+24                                                 10426000
CHCLS    EQU   CHAIN+16                                                 10427000
CHPCOI   EQU   CHPARM                                                   10428000
CHAFORCE EQU   CHIFY                                                    10429000
CHAIFX   EQU   CHACT                                                    10430000
CHCLD    EQU   CHACT                                                    10431000
CHCL     EQU   CHACT                                                    10432000
CHDSI    EQU   CHACT                                                    10433000
CHDISC   EQU   CHACT                                                    10434000
CHTERM   EQU   CHACT                                                    10435000
CHSWAP   EQU   CHACT                                                    10436000
CHABTERM EQU   CHSTS                                                    10437000
CHFC     EQU   CHSTS                                                    10438000
CHDL     EQU   CHSTS                                                    10439000
CHAD     EQU   CHSTS                                                    10440000
CHQSPC   EQU   CHSTS                                                    10441000
CHSOUT   EQU   CHSTS                                                    10442000
CHSYS    EQU   CHSTS                                                    10443000
CHAP     EQU   CHSTS                                                    10444000
CHSZE    EQU   CHFLG+1                                                  10445000
CHVCD    EQU   CHFLG                                                    10446000
CHPTR    EQU   CHAIN                                                    10447000
TIOTFEND EQU   POOLSTAR+16                                              10448000
TIOPSLOT EQU   POOLSTAR+13                                              10449000
TIOPSTTB EQU   POOLSTAR+12                                              10450000
TIOPPOOL EQU   POOLSTAR+4                                               10451000
TIOPNSRT EQU   POOLSTAR+3                                               10452000
@NM00150 EQU   POOLSTAR+2                                               10453000
TIOPNSLT EQU   POOLSTAR+1                                               10454000
@NM00149 EQU   POOLSTAR                                                 10455000
TIOSVERF EQU   TIOESTTB                                                 10456000
TIOSUNLD EQU   TIOESTTB                                                 10457000
TIOSMNTD EQU   TIOESTTB                                                 10458000
TIOSSETU EQU   TIOESTTB                                                 10459000
TIOSVLSR EQU   TIOESTTB                                                 10460000
TIOSPVIO EQU   TIOESTTB                                                 10461000
TIOSREQD EQU   TIOESTTB                                                 10462000
TIOSUSED EQU   TIOESTTB                                                 10463000
TIOSBALS EQU   TIOESTTC                                                 10464000
TIOSBALP EQU   TIOESTTC                                                 10465000
TIOSVOLS EQU   TIOESTTC                                                 10466000
TIOSVOLP EQU   TIOESTTC                                                 10467000
TIOSAFFS EQU   TIOESTTC                                                 10468000
TIOSAFFP EQU   TIOESTTC                                                 10469000
TIOSDEFR EQU   TIOESTTC                                                 10470000
TIOSDKCR EQU   TIOESTTC                                                 10471000
TIOTREM  EQU   TIOELINK                                                 10472000
TIOESSDS EQU   TIOESYOT                                                 10473000
TIOESYIN EQU   TIOELINK                                                 10474000
TIOEQNAM EQU   TIOELINK                                                 10475000
TIOEDYNM EQU   TIOELINK                                                 10476000
TIOTTERM EQU   TIOELINK                                                 10477000
TIOTRV01 EQU   TIOELINK                                                 10478000
TIOSYOUT EQU   TIOELINK                                                 10479000
TIOEWTCT EQU   TIOERLOC                                                 10480000
TIOSDSP2 EQU   TIOESTTA                                                 10481000
TIOSDSP1 EQU   TIOESTTA                                                 10482000
TIOSLABL EQU   TIOESTTA                                                 10483000
TIOSDADS EQU   TIOESTTA                                                 10484000
TIOSJBLB EQU   TIOESTTA                                                 10485000
TIOSPLTS EQU   TIOESTTA                                                 10486000
TIOSPLTP EQU   TIOESTTA                                                 10487000
TIOSLTYP EQU   TIOESTTA                                                 10488000
TIOELNGH EQU   TIOENTRY                                                 10489000
TIOCSTEP EQU   TIOT1+8                                                  10490000
TIOCNJOB EQU   TIOT1                                                    10491000
QMRBN    EQU   SWAQMPA+12                                               10492000
@NM00146 EQU   SWAQMPA+1                                                10493000
QMSWSP   EQU   SWAQMPA                                                  10494000
QMEIA    EQU   QMPA+28                                                  10495000
QMWTQ    EQU   QMPA+24                                                  10496000
QMRSD1   EQU   QMPA+22                                                  10497000
QMTID    EQU   QMPA+20                                                  10498000
QMLNK    EQU   QMPA+18                                                  10499000
QMPRI    EQU   QMPA+17                                                  10500000
@NM00145 EQU   QMSTA                                                    10501000
QMSJNL   EQU   QMSTA                                                    10502000
@NM00144 EQU   QMSTA                                                    10503000
QMTPY    EQU   QMPA+15                                                  10504000
QMNOT    EQU   QMPA+14                                                  10505000
QMTLN    EQU   QMPA+12                                                  10506000
QMTST    EQU   QMPA+11                                                  10507000
QMFLT    EQU   QMPA+9                                                   10508000
QMPEB    EQU   QMNAM+4                                                  10509000
QMCAN    EQU   QMNAM                                                    10510000
@NM00143 EQU   TCBXTNT2+32                                              10511000
TCBRV181 EQU   TCBRV173                                                 10512000
TCBRV180 EQU   TCBRV173                                                 10513000
TCBRV179 EQU   TCBRV173                                                 10514000
TCBRV178 EQU   TCBRV173                                                 10515000
TCBRV177 EQU   TCBRV173                                                 10516000
TCBRV176 EQU   TCBRV173                                                 10517000
TCBRV175 EQU   TCBRV173                                                 10518000
TCBRV174 EQU   TCBRV173                                                 10519000
TCBRV172 EQU   TCBRV164                                                 10520000
TCBRV171 EQU   TCBRV164                                                 10521000
TCBRV170 EQU   TCBRV164                                                 10522000
TCBRV169 EQU   TCBRV164                                                 10523000
TCBRV168 EQU   TCBRV164                                                 10524000
TCBRV167 EQU   TCBRV164                                                 10525000
TCBRV166 EQU   TCBRV164                                                 10526000
TCBRV165 EQU   TCBRV164                                                 10527000
TCBRV163 EQU   TCBRV155                                                 10528000
TCBRV162 EQU   TCBRV155                                                 10529000
TCBRV161 EQU   TCBRV155                                                 10530000
TCBRV160 EQU   TCBRV155                                                 10531000
TCBRV159 EQU   TCBRV155                                                 10532000
TCBRV158 EQU   TCBRV155                                                 10533000
TCBRV157 EQU   TCBRV155                                                 10534000
TCBRV156 EQU   TCBRV155                                                 10535000
TCBRV154 EQU   TCBRV146                                                 10536000
TCBRV153 EQU   TCBRV146                                                 10537000
TCBRV152 EQU   TCBRV146                                                 10538000
TCBRV151 EQU   TCBRV146                                                 10539000
TCBRV150 EQU   TCBRV146                                                 10540000
TCBRV149 EQU   TCBRV146                                                 10541000
TCBRV148 EQU   TCBRV146                                                 10542000
TCBRV147 EQU   TCBRV146                                                 10543000
TCBRV145 EQU   TCBXTNT2+26                                              10544000
TCBRV144 EQU   TCBXTNT2+24                                              10545000
TCBCAUF  EQU   TCBXTNT2+20                                              10546000
TCBRV142 EQU   TCBXTNT2+16                                              10547000
TCBRSV49 EQU   TCBXTNT2+12                                              10548000
TCBEVENT EQU   TCBXTNT2+8                                               10549000
TCBRCMP  EQU   TCBXTNT2+5                                               10550000
TCBRSVAB EQU   TCBXTNT2+4                                               10551000
TCBGTFA  EQU   TCBGTF+1                                                 10552000
TCBRSV47 EQU   TCBTFLG                                                  10553000
TCBRSV46 EQU   TCBTFLG                                                  10554000
TCBRSV45 EQU   TCBTFLG                                                  10555000
TCBRSV44 EQU   TCBTFLG                                                  10556000
TCBRSV43 EQU   TCBTFLG                                                  10557000
TCBDSPIT EQU   TCBTFLG                                                  10558000
TCBERRTN EQU   TCBTFLG                                                  10559000
TCBASYNC EQU   TCBTFLG                                                  10560000
@NM00142 EQU   TCB+296                                                  10561000
TCBSVCA2 EQU   TCB+292                                                  10562000
TCBSWASA EQU   TCB+288                                                  10563000
TCBDBTB  EQU   TCB+284                                                  10564000
TCBRPT   EQU   TCB+280                                                  10565000
TCBRV141 EQU   TCBRV133                                                 10566000
TCBRV140 EQU   TCBRV133                                                 10567000
TCBRV139 EQU   TCBRV133                                                 10568000
TCBRV138 EQU   TCBRV133                                                 10569000
TCBRV137 EQU   TCBRV133                                                 10570000
TCBRV136 EQU   TCBRV133                                                 10571000
TCBRV135 EQU   TCBRV133                                                 10572000
TCBRV134 EQU   TCBRV133                                                 10573000
TCBRV132 EQU   TCBRV124                                                 10574000
TCBRV131 EQU   TCBRV124                                                 10575000
TCBRV130 EQU   TCBRV124                                                 10576000
TCBRV129 EQU   TCBRV124                                                 10577000
TCBRV128 EQU   TCBRV124                                                 10578000
TCBRV127 EQU   TCBRV124                                                 10579000
TCBRV126 EQU   TCBRV124                                                 10580000
TCBRV125 EQU   TCBRV124                                                 10581000
TCBRV123 EQU   TCBFBYT2                                                 10582000
TCBRV122 EQU   TCBFBYT2                                                 10583000
TCBECBNV EQU   TCBFBYT2                                                 10584000
TCBSSSYN EQU   TCBFBYT2                                                 10585000
TCBFPRAP EQU   TCBFBYT2                                                 10586000
TCBFDW   EQU   TCBFBYT2                                                 10587000
TCBFMW   EQU   TCBFBYT2                                                 10588000
TCBCNCB  EQU   TCBFBYT2                                                 10589000
TCBLLH   EQU   TCBFBYT1                                                 10590000
TCBRV113 EQU   TCBFBYT1                                                 10591000
TCBEOT   EQU   TCBFBYT1                                                 10592000
TCBRTM2  EQU   TCBFBYT1                                                 10593000
TCBPGNLY EQU   TCBFBYT1                                                 10594000
TCBNDIOS EQU   TCBFBYT1                                                 10595000
TCBACTIV EQU   TCBFBYT1                                                 10596000
TCBEOTFM EQU   TCBFBYT1                                                 10597000
TCBAFFN  EQU   TCB+274                                                  10598000
TCBCCPVI EQU   TCB+272                                                  10599000
TCBUKYSP EQU   TCB+268                                                  10600000
TCBMODE  EQU   TCBESTAE+3                                               10601000
TCBERTYP EQU   TCBESTAE+2                                               10602000
TCBRV314 EQU   TCBESTRM                                                 10603000
TCBRV313 EQU   TCBESTRM                                                 10604000
TCBRV312 EQU   TCBESTRM                                                 10605000
TCBRV311 EQU   TCBESTRM                                                 10606000
TCBRV310 EQU   TCBESTRM                                                 10607000
TCBRV309 EQU   TCBESTRM                                                 10608000
TCBRV308 EQU   TCBESTRM                                                 10609000
TCBETERM EQU   TCBESTRM                                                 10610000
TCBSCBKY EQU   TCBESTAE                                                 10611000
TCBRTM12 EQU   TCB+260                                                  10612000
TCBTCBID EQU   TCB+256                                                  10613000
TCBRSV96 EQU   TCB+252                                                  10614000
TCBSWA   EQU   TCB+248                                                  10615000
TCBFOEA  EQU   TCBFOE+1                                                 10616000
TCBRSV42 EQU   TCBFOE                                                   10617000
TCBRV306 EQU   TCB+240                                                  10618000
TCBRSV41 EQU   TCB+239                                                  10619000
TCBTID   EQU   TCB+238                                                  10620000
TCBRSVAA EQU   TCB+237                                                  10621000
TCBABCUR EQU   TCB+236                                                  10622000
TCBTMSAV EQU   TCB+232                                                  10623000
TCBIOTIM EQU   TCB+228                                                  10624000
TCBRTWA  EQU   TCB+224                                                  10625000
TCBBACK  EQU   TCB+220                                                  10626000
TCBTIRB  EQU   TCB+216                                                  10627000
TCBAECB  EQU   TCB+212                                                  10628000
TCBEXT2A EQU   TCBEXT2+1                                                10629000
TCBRSV39 EQU   TCBEXT2                                                  10630000
TCBSTMCT EQU   TCB+207                                                  10631000
TCBSYSCT EQU   TCB+206                                                  10632000
TCBRSV37 EQU   TCB+205                                                  10633000
TCBEXSVC EQU   TCBDAR                                                   10634000
TCBDARMS EQU   TCBDAR                                                   10635000
TCBDARWT EQU   TCBDAR                                                   10636000
TCBDARO  EQU   TCBDAR                                                   10637000
TCBDARMC EQU   TCBDARC                                                  10638000
TCBDARD  EQU   TCBDAR                                                   10639000
TCBDARS  EQU   TCBDAR                                                   10640000
TCBDARP  EQU   TCBDAR                                                   10641000
TCBGTOFM EQU   TCBFLGS7                                                 10642000
TCBADMP  EQU   TCBFLGS7                                                 10643000
TCBRSTSK EQU   TCBFLGS7                                                 10644000
TCBSVCS  EQU   TCBFLGS7                                                 10645000
TCBSTACK EQU   TCBFLGS7                                                 10646000
TCBRSV34 EQU   TCBFLGS7                                                 10647000
TCBRSV33 EQU   TCBFLGS7                                                 10648000
TCBGPECB EQU   TCBFLGS7                                                 10649000
TCBNTJS  EQU   TCBFLGS6                                                 10650000
TCBAPG   EQU   TCBFLGS6                                                 10651000
TCBMIGR  EQU   TCBFLGS6                                                 10652000
TCBRV303 EQU   TCBFLGS6                                                 10653000
TCBSPVLK EQU   TCBFLGS6                                                 10654000
TCBCPU   EQU   TCBFLGS6                                                 10655000
TCBPIE17 EQU   TCBFLGS6                                                 10656000
TCBRV    EQU   TCBFLGS6                                                 10657000
TCBRSV79 EQU   TCBNDSP5                                                 10658000
TCBRSV78 EQU   TCBNDSP5                                                 10659000
TCBRSV77 EQU   TCBNDSP5                                                 10660000
TCBRSV76 EQU   TCBNDSP5                                                 10661000
TCBRSV75 EQU   TCBNDSP5                                                 10662000
TCBRSV74 EQU   TCBNDSP5                                                 10663000
TCBRSV95 EQU   TCBNDSP5                                                 10664000
TCBRSV94 EQU   TCBNDSP5                                                 10665000
TCBRSV93 EQU   TCBNDSP4                                                 10666000
TCBRSV92 EQU   TCBNDSP4                                                 10667000
TCBRSV91 EQU   TCBNDSP4                                                 10668000
TCBRSV90 EQU   TCBNDSP4                                                 10669000
TCBRSV89 EQU   TCBNDSP4                                                 10670000
TCBRSV88 EQU   TCBNDSP4                                                 10671000
TCBRSV87 EQU   TCBNDSP4                                                 10672000
TCBRSV86 EQU   TCBNDSP4                                                 10673000
TCBEXT1A EQU   TCBEXT1+1                                                10674000
TCBRSV32 EQU   TCBEXT1                                                  10675000
TCBEXCPD EQU   TCB+192                                                  10676000
TCBIOBRC EQU   TCB+188                                                  10677000
TCBDDWTC EQU   TCB+186                                                  10678000
TCBDDEXC EQU   TCB+184                                                  10679000
TCBJSCBB EQU   TCBJSCB+1                                                10680000
@NM00141 EQU   TCBRECDE                                                 10681000
TCBREC   EQU   TCBRECDE                                                 10682000
TCBMDIDS EQU   TCB+176                                                  10683000
TCBNDINT EQU   TCBNDSP3                                                 10684000
TCBRSV27 EQU   TCBNDSP3                                                 10685000
TCBRSV26 EQU   TCBNDSP3                                                 10686000
TCBRSV25 EQU   TCBNDSP3                                                 10687000
TCBRSV24 EQU   TCBNDSP3                                                 10688000
TCBSRBND EQU   TCBNDSP3                                                 10689000
TCBRV302 EQU   TCBNDSP3                                                 10690000
TCBLJSND EQU   TCBNDSP3                                                 10691000
TCBABE   EQU   TCBNDSP2                                                 10692000
TCBDSS   EQU   TCBNDSP2                                                 10693000
TCBOWAIT EQU   TCBNDSP2                                                 10694000
TCBIWAIT EQU   TCBNDSP2                                                 10695000
TCBNDTS  EQU   TCBNDSP2                                                 10696000
TCBNDSVC EQU   TCBNDSP2                                                 10697000
TCBSTPP  EQU   TCBNDSP2                                                 10698000
TCBABD   EQU   TCBNDSP2                                                 10699000
TCBRSV22 EQU   TCBNDSP1                                                 10700000
TCBPIEND EQU   TCBNDSP1                                                 10701000
TCBTPSP  EQU   TCBNDSP1                                                 10702000
TCBDDRND EQU   TCBNDSP1                                                 10703000
TCBRSPND EQU   TCBNDSP1                                                 10704000
TCBRSTND EQU   TCBNDSP1                                                 10705000
TCBDARPN EQU   TCBNDSP1                                                 10706000
TCBDARTN EQU   TCBNDSP1                                                 10707000
TCBNDSP0 EQU   TCBNDSP                                                  10708000
TCBUSER  EQU   TCB+168                                                  10709000
TCBTCTB  EQU   TCBTCT+1                                                 10710000
TCBRSV9C EQU   TCBTCTGF                                                 10711000
TCBRSV9B EQU   TCBTCTGF                                                 10712000
TCBRSV9A EQU   TCBTCTGF                                                 10713000
TCBRSV99 EQU   TCBTCTGF                                                 10714000
TCBRSV98 EQU   TCBTCTGF                                                 10715000
TCBRSV97 EQU   TCBTCTGF                                                 10716000
TCBRSV20 EQU   TCBTCTGF                                                 10717000
TCBSMFGF EQU   TCBTCTGF                                                 10718000
TCBSTABB EQU   TCBSTAB+1                                                10719000
TCBSTCUR EQU   TCBNSTAE                                                 10720000
TCBRV301 EQU   TCBNSTAE                                                 10721000
TCBSYNCH EQU   TCBNSTAE                                                 10722000
TCBHALT  EQU   TCBNSTAE                                                 10723000
TCBPPSUP EQU   TCBNSTAE                                                 10724000
TCB33E   EQU   TCBNSTAE                                                 10725000
TCBQUIES EQU   TCBNSTAE                                                 10726000
TCBSTABE EQU   TCBNSTAE                                                 10727000
TCBAQE   EQU   TCB+156                                                  10728000
TCBPQE   EQU   TCB+152                                                  10729000
TCBTSDP  EQU   TCB+151                                                  10730000
TCBTSLP  EQU   TCB+150                                                  10731000
TCBSTPCT EQU   TCB+149                                                  10732000
TCBCPUBN EQU   TCBTSFLG                                                 10733000
TCBDYDSP EQU   TCBTSFLG                                                 10734000
TCBRSV18 EQU   TCBTSFLG                                                 10735000
TCBRSV17 EQU   TCBTSFLG                                                 10736000
TCBTIOTG EQU   TCBTSFLG                                                 10737000
TCBATT   EQU   TCBTSFLG                                                 10738000
TCBSTPPR EQU   TCBTSFLG                                                 10739000
TCBRV300 EQU   TCBTSTSK                                                 10740000
TCBECB   EQU   TCB+144                                                  10741000
TCBIQE   EQU   TCB+140                                                  10742000
TCBOTC   EQU   TCB+132                                                  10743000
TCBNTC   EQU   TCB+128                                                  10744000
TCBJSTCA EQU   TCBJSTCB+1                                               10745000
TCBRSV16 EQU   TCBJSTCB                                                 10746000
TCBTQET  EQU   TCBTME                                                   10747000
TCBTCB   EQU   TCB+116                                                  10748000
TCBFSAB  EQU   TCBFSA+1                                                 10749000
TCBQEL   EQU   TCBFSA                                                   10750000
TCBGRS15 EQU   TCBGRS+60                                                10751000
TCBGRS14 EQU   TCBGRS+56                                                10752000
TCBGRS13 EQU   TCBGRS+52                                                10753000
TCBGRS12 EQU   TCBGRS+48                                                10754000
TCBGRS11 EQU   TCBGRS+44                                                10755000
TCBGRS10 EQU   TCBGRS+40                                                10756000
TCBGRS9  EQU   TCBGRS+36                                                10757000
TCBGRS8  EQU   TCBGRS+32                                                10758000
TCBGRS7  EQU   TCBGRS+28                                                10759000
TCBGRS6  EQU   TCBGRS+24                                                10760000
TCBGRS5  EQU   TCBGRS+20                                                10761000
TCBGRS4  EQU   TCBGRS+16                                                10762000
TCBGRS3  EQU   TCBGRS+12                                                10763000
TCBGRS2  EQU   TCBGRS+8                                                 10764000
TCBGRS1  EQU   TCBGRS+4                                                 10765000
TCBGRS0  EQU   TCBGRS                                                   10766000
TCBJPQB  EQU   TCBJPQ+1                                                 10767000
TCBRSV15 EQU   TCBPURGE                                                 10768000
TCBRSV14 EQU   TCBPURGE                                                 10769000
TCBRSV13 EQU   TCBPURGE                                                 10770000
TCBRSV12 EQU   TCBPURGE                                                 10771000
TCBRSV11 EQU   TCBPURGE                                                 10772000
TCBRSV10 EQU   TCBPURGE                                                 10773000
TCBRSV09 EQU   TCBPURGE                                                 10774000
TCBJPQF  EQU   TCBPURGE                                                 10775000
TCBJLB   EQU   TCB+40                                                   10776000
TCBLLS   EQU   TCB+36                                                   10777000
TCBDSP   EQU   TCB+35                                                   10778000
TCBLMP   EQU   TCB+34                                                   10779000
TCBPNDSP EQU   TCBFLGS5                                                 10780000
TCBFCD1  EQU   TCBFLGS5                                                 10781000
TCBSTP   EQU   TCBFLGS5                                                 10782000
TCBSYS   EQU   TCBFLGS5                                                 10783000
TCBANDSP EQU   TCBFLGS5                                                 10784000
TCBPAGE  EQU   TCBFLGS5                                                 10785000
TCBUXNDF EQU   TCBABWF                                                  10786000
TCBFC    EQU   TCBFLGS5                                                 10787000
TCBONDSP EQU   TCBFLGS4                                                 10788000
TCBMPCND EQU   TCBFLGS4                                                 10789000
TCBMPCVQ EQU   TCBFLGS4                                                 10790000
TCBUXNDV EQU   TCBFLGS4                                                 10791000
TCBHNDSP EQU   TCBFLGS4                                                 10792000
TCBRQENA EQU   TCBFLGS4                                                 10793000
TCBSER   EQU   TCBFLGS4                                                 10794000
TCBNDUMP EQU   TCBFLGS4                                                 10795000
TCBDWSTA EQU   TCBFLGS3                                                 10796000
TCBRSV08 EQU   TCBFLGS3                                                 10797000
TCBRSV07 EQU   TCBFLGS3                                                 10798000
TCBRSV06 EQU   TCBFLGS3                                                 10799000
TCBABGM  EQU   TCBFLGS3                                                 10800000
TCBABTRM EQU   TCBFLGS3                                                 10801000
TCBADINP EQU   TCBFLGS3                                                 10802000
TCBFSM   EQU   TCBFLGS3                                                 10803000
TCBFTS   EQU   TCBFLGS2                                                 10804000
TCBFETXR EQU   TCBFLGS2                                                 10805000
TCBFDSOP EQU   TCBFLGS2                                                 10806000
TCBFJMC  EQU   TCBFLGS2                                                 10807000
TCBFSMC  EQU   TCBFLGS2                                                 10808000
TCBFABOP EQU   TCBFLGS2                                                 10809000
TCBFSTI  EQU   TCBFLGS2                                                 10810000
TCBFOINP EQU   TCBFLGS2                                                 10811000
TCBFX    EQU   TCBFLGS1                                                 10812000
TCBFS    EQU   TCBFLGS1                                                 10813000
TCBFT    EQU   TCBFLGS1                                                 10814000
TCBPDUMP EQU   TCBFLGS1                                                 10815000
TCBNONPR EQU   TCBFLGS1                                                 10816000
TCBFERA  EQU   TCBFLGS1                                                 10817000
TCBFE    EQU   TCBFLGS1                                                 10818000
TCBFA    EQU   TCBFLGS1                                                 10819000
TCBZERO  EQU   TCBPKF                                                   10820000
TCBFLAG  EQU   TCBPKF                                                   10821000
TCBMSSB  EQU   TCBMSS+1                                                 10822000
TCBRSV03 EQU   TCBMSS                                                   10823000
TCBTRNB  EQU   TCBTRN+1                                                 10824000
TCBRSV02 EQU   TCBABF                                                   10825000
TCBOLTEP EQU   TCBABF                                                   10826000
TCBTCP   EQU   TCBABF                                                   10827000
TCBTCPP  EQU   TCBABF                                                   10828000
TCBRSV01 EQU   TCBABF                                                   10829000
TCBGRPH  EQU   TCBABF                                                   10830000
TCBNOCHK EQU   TCBABF                                                   10831000
TCBMOD91 EQU   TCBABF                                                   10832000
TCBCMPC  EQU   TCBCMP+1                                                 10833000
TCBRV318 EQU   TCBCMSG                                                  10834000
TCBRV317 EQU   TCBCIND                                                  10835000
TCBRV316 EQU   TCBCWTO                                                  10836000
TCBCASID EQU   TCBCDBL                                                  10837000
TCBNOCC  EQU   TCBSTCC                                                  10838000
TCBDMPO  EQU   TCBCPP                                                   10839000
TCBCSTEP EQU   TCBCMPF                                                  10840000
TCBCREQ  EQU   TCBCMPF                                                  10841000
TCBTIO   EQU   TCB+12                                                   10842000
TCBDEB   EQU   TCB+8                                                    10843000
TCBPIEA  EQU   TCBPIE+1                                                 10844000
TCBPM    EQU   TCBPMASK                                                 10845000
@NM00140 EQU   TCBPMASK                                                 10846000
TCBRBP   EQU   TCB                                                      10847000
TCBFRS6  EQU   TCBFRS+24                                                10848000
TCBFRS4  EQU   TCBFRS+16                                                10849000
TCBFRS2  EQU   TCBFRS+8                                                 10850000
TCBFRS0  EQU   TCBFRS                                                   10851000
CVTLEVL  EQU   CVTRELNO+2                                               10852000
CVTNUMB  EQU   CVTRELNO                                                 10853000
CVTMDL   EQU   CVTFIX+250                                               10854000
@NM00139 EQU   CVTFIX+248                                               10855000
@NM00138 EQU   CVTFIX                                                   10856000
CVTRV482 EQU   CVTXTNT2+128                                             10857000
CVTRV481 EQU   CVTXTNT2+124                                             10858000
CVTRV480 EQU   CVTXTNT2+120                                             10859000
CVTRV479 EQU   CVTXTNT2+118                                             10860000
CVTRV478 EQU   CVTXTNT2+117                                             10861000
CVTRV477 EQU   CVTXTNT2+116                                             10862000
CVTRV476 EQU   CVTXTNT2+115                                             10863000
CVTRV475 EQU   CVTXTNT2+114                                             10864000
CVTRV474 EQU   CVTRV466                                                 10865000
CVTRV473 EQU   CVTRV466                                                 10866000
CVTRV472 EQU   CVTRV466                                                 10867000
CVTRV471 EQU   CVTRV466                                                 10868000
CVTRV470 EQU   CVTRV466                                                 10869000
CVTRV469 EQU   CVTRV466                                                 10870000
CVTRV468 EQU   CVTRV466                                                 10871000
CVTRV467 EQU   CVTRV466                                                 10872000
CVTRV465 EQU   CVTRV457                                                 10873000
CVTRV464 EQU   CVTRV457                                                 10874000
CVTRV463 EQU   CVTRV457                                                 10875000
CVTRV462 EQU   CVTRV457                                                 10876000
CVTRV461 EQU   CVTRV457                                                 10877000
CVTRV460 EQU   CVTRV457                                                 10878000
CVTRV459 EQU   CVTRV457                                                 10879000
CVTRV458 EQU   CVTRV457                                                 10880000
CVTRV456 EQU   CVTXTNT2+108                                             10881000
CVTRV455 EQU   CVTXTNT2+104                                             10882000
CVTRV454 EQU   CVTXTNT2+100                                             10883000
CVTRV453 EQU   CVTXTNT2+96                                              10884000
CVTRV452 EQU   CVTXTNT2+94                                              10885000
CVTRV451 EQU   CVTXTNT2+92                                              10886000
CVTRV450 EQU   CVTXTNT2+90                                              10887000
CVTRV449 EQU   CVTXTNT2+88                                              10888000
CVTRV448 EQU   CVTXTNT2+87                                              10889000
CVTRV447 EQU   CVTXTNT2+86                                              10890000
CVTRV446 EQU   CVTRV438                                                 10891000
CVTRV445 EQU   CVTRV438                                                 10892000
CVTRV444 EQU   CVTRV438                                                 10893000
CVTRV443 EQU   CVTRV438                                                 10894000
CVTRV442 EQU   CVTRV438                                                 10895000
CVTRV441 EQU   CVTRV438                                                 10896000
CVTRV440 EQU   CVTRV438                                                 10897000
CVTRV439 EQU   CVTRV438                                                 10898000
CVTRV437 EQU   CVTRV429                                                 10899000
CVTRV436 EQU   CVTRV429                                                 10900000
CVTRV435 EQU   CVTRV429                                                 10901000
CVTRV434 EQU   CVTRV429                                                 10902000
CVTRV433 EQU   CVTRV429                                                 10903000
CVTRV432 EQU   CVTRV429                                                 10904000
CVTRV431 EQU   CVTRV429                                                 10905000
CVTRV430 EQU   CVTRV429                                                 10906000
CVTRV428 EQU   CVTXTNT2+80                                              10907000
CVTRV427 EQU   CVTXTNT2+76                                              10908000
CVTRV426 EQU   CVTXTNT2+72                                              10909000
CVTRV425 EQU   CVTXTNT2+68                                              10910000
CVTATACT EQU   CVTATCVT                                                 10911000
CVTRV423 EQU   CVTXTNT2+62                                              10912000
CVTRV422 EQU   CVTXTNT2+60                                              10913000
CVTRV421 EQU   CVTXTNT2+58                                              10914000
CVTRV420 EQU   CVTXTNT2+56                                              10915000
CVTRV419 EQU   CVTXTNT2+55                                              10916000
CVTRV418 EQU   CVTXTNT2+54                                              10917000
CVTRV417 EQU   CVTRV409                                                 10918000
CVTRV416 EQU   CVTRV409                                                 10919000
CVTRV415 EQU   CVTRV409                                                 10920000
CVTRV414 EQU   CVTRV409                                                 10921000
CVTRV413 EQU   CVTRV409                                                 10922000
CVTRV412 EQU   CVTRV409                                                 10923000
CVTRV411 EQU   CVTRV409                                                 10924000
CVTRV410 EQU   CVTRV409                                                 10925000
CVTRV408 EQU   CVTRV400                                                 10926000
CVTRV407 EQU   CVTRV400                                                 10927000
CVTRV406 EQU   CVTRV400                                                 10928000
CVTRV405 EQU   CVTRV400                                                 10929000
CVTRV404 EQU   CVTRV400                                                 10930000
CVTRV403 EQU   CVTRV400                                                 10931000
CVTRV402 EQU   CVTRV400                                                 10932000
CVTRV401 EQU   CVTRV400                                                 10933000
CVTICB   EQU   CVTXTNT2+48                                              10934000
CVTSKTA  EQU   CVTXTNT2+44                                              10935000
CVTCCVT  EQU   CVTXTNT2+40                                              10936000
CVTRSV98 EQU   CVTXTNT2+36                                              10937000
CVTRSV97 EQU   CVTXTNT2+34                                              10938000
CVTRSV96 EQU   CVTXTNT2+32                                              10939000
CVTOLTEP EQU   CVTXTNT2+28                                              10940000
CVTQIDA  EQU   CVTQID+1                                                 10941000
CVTRSV95 EQU   CVTQID                                                   10942000
CVTRSV94 EQU   CVTXTNT2+20                                              10943000
CVTRSV93 EQU   CVTXTNT2+16                                              10944000
CVTRSV92 EQU   CVTXTNT2+12                                              10945000
CVTDEBVR EQU   CVTXTNT2+8                                               10946000
CVTRSV91 EQU   CVTXTNT2+6                                               10947000
CVTRSV9H EQU   CVTFLGBT                                                 10948000
CVTRSV9G EQU   CVTFLGBT                                                 10949000
CVTRSV9F EQU   CVTFLGBT                                                 10950000
CVTRSV9E EQU   CVTFLGBT                                                 10951000
CVTRSV9D EQU   CVTFLGBT                                                 10952000
CVTRSV9C EQU   CVTFLGBT                                                 10953000
CVTVME   EQU   CVTFLGBT                                                 10954000
CVTNPE   EQU   CVTFLGBT                                                 10955000
CVTNUCLS EQU   CVTXTNT2+4                                               10956000
CVTDSSVA EQU   CVTDSSV+1                                                10957000
CVTRSV89 EQU   CVTDSSV                                                  10958000
CVTRSV88 EQU   CVTXTNT1+8                                               10959000
CVTRSV87 EQU   CVTXTNT1+4                                               10960000
CVTFACHN EQU   CVTXTNT1                                                 10961000
CVTRV488 EQU   CVTMAP+412                                               10962000
CVTRV487 EQU   CVTMAP+408                                               10963000
CVTRV486 EQU   CVTMAP+404                                               10964000
CVTRV485 EQU   CVTMAP+400                                               10965000
CVTACTAP EQU   CVTMAP+396                                               10966000
CVTAUTH  EQU   CVTMAP+392                                               10967000
CVTATMCA EQU   CVTATMCT+1                                               10968000
CVTATMST EQU   CVTATMCT                                                 10969000
CVTRSV61 EQU   CVTMAP+384                                               10970000
CVTVOLT1 EQU   CVTVOLM1+1                                               10971000
CVTVOLI1 EQU   CVTVOLF1                                                 10972000
CVTSTOA  EQU   CVTMAP+376                                               10973000
CVTRSV58 EQU   CVTMAP+374                                               10974000
CVTRSV57 EQU   CVTMAP+372                                               10975000
CVTDDCE  EQU   CVTMAP+368                                               10976000
CVTPNWFR EQU   CVTMAP+364                                               10977000
CVTSMF   EQU   CVTMAP+360                                               10978000
CVTSULK  EQU   CVTMAP+358                                               10979000
CVTSLKO  EQU   CVTSYSK                                                  10980000
CVTSLKP  EQU   CVTSYSK                                                  10981000
CVTSLKQ  EQU   CVTSYSK                                                  10982000
CVTSLKR  EQU   CVTSYSK                                                  10983000
CVTRSV56 EQU   CVTSYSK                                                  10984000
CVTRSV55 EQU   CVTSYSK                                                  10985000
CVTRSV54 EQU   CVTSYSK                                                  10986000
CVTRSV53 EQU   CVTSYSK                                                  10987000
CVTRSV52 EQU   CVTA1F1                                                  10988000
CVTRSV51 EQU   CVTA1F1                                                  10989000
CVTRSV50 EQU   CVTA1F1                                                  10990000
CVTRSV49 EQU   CVTA1F1                                                  10991000
CVTRSV48 EQU   CVTA1F1                                                  10992000
CVTRSV47 EQU   CVTA1F1                                                  10993000
CVTSRSW  EQU   CVTA1F1                                                  10994000
CVTPFSW  EQU   CVTA1F1                                                  10995000
CVTPCVT  EQU   CVTMAP+352                                               10996000
CVTRSV46 EQU   CVTMAP+344                                               10997000
CVTRSV45 EQU   CVTMAP+340                                               10998000
CVTRSV44 EQU   CVTMAP+338                                               10999000
CVTRSV43 EQU   CVTMAP+336                                               11000000
CVTHJESA EQU   CVTHJES+1                                                11001000
CVTRSV42 EQU   CVTHJES                                                  11002000
CVTEXT2A EQU   CVTEXT2+1                                                11003000
CVTRSV41 EQU   CVTEXT2                                                  11004000
CVTAPFA  EQU   CVTAPF+1                                                 11005000
CVTRSV40 EQU   CVTAPF                                                   11006000
CVTRV518 EQU   CVTINTLA                                                 11007000
CVTRV517 EQU   CVTERPV                                                  11008000
CVTEORM  EQU   CVTMAP+312                                               11009000
CVTMCHPR EQU   CVTMAP+308                                               11010000
CVTTZ    EQU   CVTMAP+304                                               11011000
CVTJEPS  EQU   CVTMAP+300                                               11012000
CVTMODE  EQU   CVTMAP+292                                               11013000
CVTPTRV  EQU   CVTMAP+288                                               11014000
CVTREAL  EQU   CVTMAP+284                                               11015000
CVTRSV39 EQU   CVTMAP+280                                               11016000
CVTRSV38 EQU   CVTMAP+276                                               11017000
CVTDMSRA EQU   CVTDMSR+1                                                11018000
CVTRV634 EQU   CVTDMSRF                                                 11019000
CVTRV633 EQU   CVTDMSRF                                                 11020000
CVTRV632 EQU   CVTDMSRF                                                 11021000
CVTRV631 EQU   CVTDMSRF                                                 11022000
CVTRV630 EQU   CVTDMSRF                                                 11023000
CVTRV629 EQU   CVTDMSRF                                                 11024000
CVTUDUMP EQU   CVTDMSRF                                                 11025000
CVTSDUMP EQU   CVTDMSRF                                                 11026000
CVTQMSGA EQU   CVTQMSG+1                                                11027000
CVTRSV36 EQU   CVTQMSG                                                  11028000
CVTAMFF  EQU   CVTMAP+264                                               11029000
CVTPURGA EQU   CVTPURG+1                                                11030000
CVTRSV35 EQU   CVTPURG                                                  11031000
CVTCBSP  EQU   CVTMAP+256                                               11032000
CVTATERA EQU   CVTATER+1                                                11033000
CVTSYST  EQU   CVTATER                                                  11034000
CVTVOLT2 EQU   CVTTAT                                                   11035000
CVTVOLI2 EQU   CVTVOLF2                                                 11036000
CVTAQAVB EQU   CVTAQAVT+1                                               11037000
CVTRSV34 EQU   CVTTCMFG                                                 11038000
CVTRSV33 EQU   CVTTCMFG                                                 11039000
CVTRSV32 EQU   CVTTCMFG                                                 11040000
CVTRSV31 EQU   CVTTCMFG                                                 11041000
CVTRSV30 EQU   CVTTCMFG                                                 11042000
CVTRSV29 EQU   CVTTCMFG                                                 11043000
CVTRSV28 EQU   CVTTCMFG                                                 11044000
CVTTCRDY EQU   CVTTCMFG                                                 11045000
CVTGTFA  EQU   CVTGTF+1                                                 11046000
CVTRSV27 EQU   CVTGTFST                                                 11047000
CVTRNIO  EQU   CVTGTFST                                                 11048000
CVTUSR   EQU   CVTGTFST                                                 11049000
CVTRV318 EQU   CVTFORM                                                  11050000
CVTRV317 EQU   CVTTMODE                                                 11051000
CVTRV316 EQU   CVTSTATE                                                 11052000
CVTRV315 EQU   CVTGTFS                                                  11053000
CVTGTFAV EQU   CVTGTFS                                                  11054000
CVT0SCR1 EQU   CVTMAP+232                                               11055000
CVTRV515 EQU   CVTMAP+228                                               11056000
CVTRMS   EQU   CVTMAP+224                                               11057000
CVTPATCH EQU   CVTMAP+220                                               11058000
CVTTSCE  EQU   CVTMAP+216                                               11059000
CVTLNKSC EQU   CVTMAP+214                                               11060000
CVTQABST EQU   CVTMAP+212                                               11061000
CVTMDLDS EQU   CVTMAP+208                                               11062000
CVTUSER  EQU   CVTMAP+204                                               11063000
CVTABEND EQU   CVTMAP+200                                               11064000
CVTSMCA  EQU   CVTMAP+196                                               11065000
CVTRSV18 EQU   CVTMAP+192                                               11066000
CVTQLPAQ EQU   CVTMAP+188                                               11067000
CVTQCDSR EQU   CVTMAP+184                                               11068000
CVTRSV17 EQU   CVTOPTB                                                  11069000
CVTRSV16 EQU   CVTOPTB                                                  11070000
CVTFP    EQU   CVTOPTB                                                  11071000
CVTAPTHR EQU   CVTOPTB                                                  11072000
CVTNLOG  EQU   CVTOPTB                                                  11073000
CVTTOD   EQU   CVTOPTB                                                  11074000
CVTCTIMS EQU   CVTOPTB                                                  11075000
CVTPROT  EQU   CVTOPTB                                                  11076000
CVTXPFP  EQU   CVTOPTA                                                  11077000
CVTASCII EQU   CVTOPTA                                                  11078000
CVTRSV13 EQU   CVTOPTA                                                  11079000
CVTRSV12 EQU   CVTOPTA                                                  11080000
CVTNIP   EQU   CVTOPTA                                                  11081000
CVTDDR   EQU   CVTOPTA                                                  11082000
CVTAPR   EQU   CVTOPTA                                                  11083000
CVTCCH   EQU   CVTOPTA                                                  11084000
CVTSNCTR EQU   CVTMAP+180                                               11085000
CVTQMWR  EQU   CVTMAP+176                                               11086000
CVTQOCR  EQU   CVTMAP+172                                               11087000
CVT1EF00 EQU   CVTMAP+168                                               11088000
CVTMZ00  EQU   CVTMAP+164                                               11089000
CVTSV76Q EQU   CVTSV76C                                                 11090000
CVTRSV11 EQU   CVTMAP+156                                               11091000
CVT0PT01 EQU   CVTMAP+152                                               11092000
CVTMSER  EQU   CVTMAP+148                                               11093000
CVTRV516 EQU   CVTIERLC                                                 11094000
CVTILCH  EQU   CVTMAP+140                                               11095000
CVT0DS   EQU   CVTMAP+136                                               11096000
CVTFBOSV EQU   CVTMAP+132                                               11097000
CVTNUCB  EQU   CVTMAP+128                                               11098000
CVTIXAVL EQU   CVTMAP+124                                               11099000
CVTSV76M EQU   CVTIOQET                                                 11100000
CVTDCBA  EQU   CVTMAP+117                                               11101000
CVTMVS2  EQU   CVTDCB                                                   11102000
CVT6DAT  EQU   CVTDCB                                                   11103000
CVT4MPS  EQU   CVTDCB                                                   11104000
CVTRSV09 EQU   CVTDCB                                                   11105000
CVT4MS1  EQU   CVTDCB                                                   11106000
CVT2SPS  EQU   CVTDCB                                                   11107000
CVT1SSS  EQU   CVTDCB                                                   11108000
CVTRSV08 EQU   CVTDCB                                                   11109000
CVTSTB   EQU   CVTMAP+112                                               11110000
CVTQTD00 EQU   CVTMAP+108                                               11111000
CVTQTE00 EQU   CVTMAP+104                                               11112000
CVTCUCB  EQU   CVTMAP+100                                               11113000
CVTSJQ   EQU   CVTMAP+96                                                11114000
CVTPBLDL EQU   CVTMAP+92                                                11115000
CVTTPC   EQU   CVTMAP+88                                                11116000
CVTSVDCB EQU   CVTMAP+84                                                11117000
CVTBRET  EQU   CVTMAP+82                                                11118000
CVTEXIT  EQU   CVTMAP+80                                                11119000
CVT0FN00 EQU   CVTMAP+76                                                11120000
CVTDARA  EQU   CVTDAR+1                                                 11121000
CVTRSV07 EQU   CVTFLGS1                                                 11122000
CVTRSV06 EQU   CVTFLGS1                                                 11123000
CVTRSV05 EQU   CVTFLGS1                                                 11124000
CVTRSV04 EQU   CVTFLGS1                                                 11125000
CVTRSV03 EQU   CVTFLGS1                                                 11126000
CVTRSV02 EQU   CVTFLGS1                                                 11127000
CVTRSV01 EQU   CVTFLGS1                                                 11128000
CVTDMPLK EQU   CVTFLGS1                                                 11129000
CVTXITP  EQU   CVTMAP+68                                                11130000
CVTZDTAB EQU   CVTMAP+64                                                11131000
CVTMSLT  EQU   CVTMAP+60                                                11132000
CVTDATE  EQU   CVTMAP+56                                                11133000
CVTBTERM EQU   CVTMAP+52                                                11134000
CVTSYSAD EQU   CVTMAP+48                                                11135000
CVTXTLER EQU   CVTMAP+44                                                11136000
CVTILK2  EQU   CVTMAP+40                                                11137000
CVTILK1  EQU   CVTMAP+36                                                11138000
CVTPRLTV EQU   CVTMAP+32                                                11139000
CVTPCNVT EQU   CVTMAP+28                                                11140000
CVT0VL00 EQU   CVTMAP+24                                                11141000
CVTXAPG  EQU   CVTMAP+20                                                11142000
CVTBUF   EQU   CVTMAP+16                                                11143000
CVTJOB   EQU   CVTMAP+12                                                11144000
CVTLINK  EQU   CVTMAP+8                                                 11145000
CVT0EF00 EQU   CVTMAP+4                                                 11146000
CVT      EQU   CVTMAP                                                   11147000
LCTLABEL EQU   LCT+504                                                  11148000
LCTIWORK EQU   LCT+440                                                  11149000
@NM00137 EQU   LCT+436                                                  11150000
LCTIMSG  EQU   LCT+432                                                  11151000
LCTLBWAP EQU   LCT+428                                                  11152000
@NM00136 EQU   LCT+424                                                  11153000
LCTBPPAS EQU   LCTINTS2                                                 11154000
LCTSYS   EQU   LCTINTS2                                                 11155000
LCTTSIZ  EQU   @NM00135                                                 11156000
LCTRFB1  EQU   LCT+419                                                  11157000
@NM00134 EQU   LCTRFB                                                   11158000
LCTRFBRP EQU   LCTRFB                                                   11159000
LCTRFBEF EQU   LCTRFB                                                   11160000
LCTRFBMS EQU   LCTRFB                                                   11161000
LCTRFBRV EQU   LCTRFB                                                   11162000
LCTRFBCR EQU   LCTRFB                                                   11163000
LCTRFBSM EQU   LCTRFB                                                   11164000
LCTMFTIO EQU   LCTSTATB                                                 11165000
LCTNPKEY EQU   LCTSTATB                                                 11166000
LCTSBPOL EQU   LCTSTATB                                                 11167000
LCTNREAD EQU   LCTSTATB                                                 11168000
LCTWRITE EQU   LCTSTATB                                                 11169000
LCTNOATC EQU   LCTSTATB                                                 11170000
LCTNOREG EQU   LCTSTATB                                                 11171000
LCTECBPB EQU   LCTSTATB                                                 11172000
LCTCPART EQU   LCTSTATA                                                 11173000
LCTNOGCB EQU   LCTSTATA                                                 11174000
LCTNOSDP EQU   LCTSTATA                                                 11175000
LCTJCPIB EQU   LCTSTATA                                                 11176000
LCTNECBL EQU   LCTSTATA                                                 11177000
LCTBTJOB EQU   LCTSTATA                                                 11178000
LCTSNOWK EQU   LCTSTATA                                                 11179000
LCTSUSPD EQU   LCTSTATA                                                 11180000
LCTTIOTI EQU   LCT+412                                                  11181000
@NM00133 EQU   LCTJCTDA+3                                               11182000
LCTJCTVA EQU   LCTJCTDA                                                 11183000
LCTSSOBA EQU   LCT+404                                                  11184000
LCTSTEPL EQU   LCT+400                                                  11185000
@NM00132 EQU   LCT+364                                                  11186000
@NM00131 EQU   LCTJSCB+1                                                11187000
@NM00130 EQU   LCTOPSW3                                                 11188000
@NM00129 EQU   LCTOPSW3                                                 11189000
LCTALERR EQU   LCTOPSW3                                                 11190000
LCTJNLF  EQU   LCTOPSW3                                                 11191000
@NM00128 EQU   LCTOPSW3                                                 11192000
LCTNSYS  EQU   LCTOPSW3                                                 11193000
LCTRDER  EQU   LCTOPSW3                                                 11194000
@NM00127 EQU   LCTOPSW3                                                 11195000
@NM00126 EQU   @NM00122+1                                               11196000
LCTENQU  EQU   LCTOPSW2                                                 11197000
LCTNORC  EQU   LCTOPSW2                                                 11198000
@NM00125 EQU   LCTOPSW2                                                 11199000
@NM00124 EQU   LCTOPSW2                                                 11200000
@NM00123 EQU   LCTOPSW2                                                 11201000
LCTCRF   EQU   LCTOPSW2                                                 11202000
LCTTIMEF EQU   LCTOPSW2                                                 11203000
@NM00121 EQU   LCTEXIT+1                                                11204000
@NM00120 EQU   LCTOPSW1                                                 11205000
@NM00119 EQU   LCTOPSW1                                                 11206000
LCTONEJF EQU   LCTOPSW1                                                 11207000
LCTCANF  EQU   LCTOPSW1                                                 11208000
@NM00118 EQU   LCTOPSW1                                                 11209000
@NM00117 EQU   LCTOPSW1                                                 11210000
LCTDWFF  EQU   LCTOPSW1                                                 11211000
LCTDPSWA EQU   LCTOPSW1                                                 11212000
LCTTSRB3 EQU   LCTTSRB4+1                                               11213000
@NM00116 EQU   LCTTSRB4                                                 11214000
@NM00115 EQU   LCT+340                                                  11215000
@NM00114 EQU   LCTSPIL+3                                                11216000
@NM00113 EQU   LCTALCFG                                                 11217000
@NM00112 EQU   LCTALCFG                                                 11218000
@NM00111 EQU   LCTALCFG                                                 11219000
@NM00110 EQU   LCTALCFG                                                 11220000
@NM00109 EQU   LCTALCFG                                                 11221000
@NM00108 EQU   LCTALCFG                                                 11222000
LCTMSGWT EQU   LCTALCFG                                                 11223000
LCTODSFL EQU   LCTALCFG                                                 11224000
LCTDSBCT EQU   LCTSPIL                                                  11225000
LCTPIB   EQU   LCTIDENT                                                 11226000
@NM00107 EQU   ECBLIST+1                                                11227000
@NM00106 EQU   ECBLIST                                                  11228000
LCTJMRAD EQU   LCT+324                                                  11229000
LCTASCBA EQU   LCT+320                                                  11230000
@NM00105 EQU   LCT+284                                                  11231000
REGSAVE  EQU   LCT+104                                                  11232000
@NM00104 EQU   LCTATLST+1                                               11233000
@NM00103 EQU   LCTATLST                                                 11234000
@NM00102 EQU   LCTJOBLB+1                                               11235000
@NM00101 EQU   LCTJOBLB                                                 11236000
LCTTSTU3 EQU   LCTTSTU4+1                                               11237000
@NM00100 EQU   LCTTSTU4                                                 11238000
LCTTSTR3 EQU   LCTSMF+1                                                 11239000
LCTTTIFJ EQU   LCTTMBYT                                                 11240000
LCTTSTL3 EQU   LCTTSTL4+1                                               11241000
@NM00099 EQU   LCTTSTL4                                                 11242000
LCTTJTU3 EQU   LCTTJTU4+1                                               11243000
@NM00098 EQU   LCTTJTU4                                                 11244000
@NM00097 EQU   @NM00096+1                                               11245000
LCTNDSI  EQU   LCTINTSW                                                 11246000
LCTABEND EQU   LCTINTSW                                                 11247000
LCTSTOP  EQU   LCTINTSW                                                 11248000
LCTSTART EQU   LCTINTSW                                                 11249000
LCTMINRG EQU   LCTINTSW                                                 11250000
LCTPPAA  EQU   LCTINTSW                                                 11251000
LCTPRIV  EQU   LCTINTSW                                                 11252000
LCTINPPT EQU   LCTINTSW                                                 11253000
@NM00095 EQU   LCTSREG+1                                                11254000
@NM00094 EQU   LCTSREG                                                  11255000
LCTCOMD2 EQU   LCTCOMCD+2                                               11256000
LCTCOMD1 EQU   LCTCOMCD                                                 11257000
LCTBATMN EQU   LCT+64                                                   11258000
@NM00093 EQU   LCTSMBAD+1                                               11259000
@NM00092 EQU   LCTSMBAD                                                 11260000
LCTACTON EQU   LCT+59                                                   11261000
LCTSNUMB EQU   LCT+58                                                   11262000
@NM00091 EQU   LCTJFCBH                                                 11263000
@NM00090 EQU   LCTJFCBH                                                 11264000
@NM00089 EQU   LCTJFCBH                                                 11265000
@NM00088 EQU   LCTJFCBH                                                 11266000
@NM00087 EQU   LCTJFCBH                                                 11267000
LCTS2FES EQU   LCTJFCBH                                                 11268000
LCTS2COP EQU   LCTJFCBH                                                 11269000
LCTS2PEM EQU   LCTJFCBH                                                 11270000
LCTSTIND EQU   LCTNSPAD                                                 11271000
@NM00086 EQU   LCTCMCBA+1                                               11272000
@NM00085 EQU   LCTCMCBA                                                 11273000
LCTPARM4 EQU   LCT+48                                                   11274000
LCTPARM3 EQU   LCT+44                                                   11275000
LCTPARM2 EQU   LCT+40                                                   11276000
LCTPARM1 EQU   LCT+36                                                   11277000
LCTJCFAL EQU   LCTERR                                                   11278000
LCTACOMP EQU   LCTERR                                                   11279000
LCTSFAIL EQU   LCTERR                                                   11280000
LCTPALCD EQU   LCTERR                                                   11281000
LCTSALCD EQU   LCTERR                                                   11282000
LCTJFAIL EQU   LCTERR                                                   11283000
@NM00084 EQU   LCTPSPAR+1                                               11284000
@NM00083 EQU   LCTPSPAR                                                 11285000
@NM00082 EQU   LCTWORKA+3                                               11286000
@NM00081 EQU   LCTSCTAD+1                                               11287000
@NM00080 EQU   LCTSCTAD                                                 11288000
@NM00079 EQU   LCTJCTAD+1                                               11289000
@NM00078 EQU   LCTJCTAD                                                 11290000
@NM00077 EQU   LCTQENTY+1                                               11291000
LCTERRM  EQU   @NM00069                                                 11292000
@NM00076 EQU   @NM00069                                                 11293000
@NM00075 EQU   @NM00069                                                 11294000
@NM00074 EQU   @NM00069                                                 11295000
@NM00073 EQU   @NM00069                                                 11296000
@NM00072 EQU   @NM00069                                                 11297000
@NM00071 EQU   @NM00069                                                 11298000
@NM00070 EQU   @NM00069                                                 11299000
@NM00068 EQU   LCTTCBAD+1                                               11300000
@NM00067 EQU   LCTTCBAD                                                 11301000
@NM00066 EQU   LCTSRTAD+1                                               11302000
@NM00065 EQU   LCTSRTAD                                                 11303000
@NM00064 EQU   LCTQDRTY+1                                               11304000
@NM00063 EQU   LCTQDRTY                                                 11305000
ACTACCNT EQU   IEFAACTB+32                                              11306000
ACTJNFLD EQU   IEFAACTB+31                                              11307000
ACTJTIME EQU   IEFAACTB+28                                              11308000
ACTPRGNM EQU   IEFAACTB+8                                               11309000
@NM00062 EQU   IEFAACTB+7                                               11310000
ACTNEXT  EQU   IEFAACTB+4                                               11311000
ACTIDENT EQU   IEFAACTB+3                                               11312000
ACTDSKAD EQU   IEFAACTB                                                 11313000
@NM00061 EQU   INJMJCT+175                                              11314000
JCTVULDP EQU   INJMJCT+172                                              11315000
JCTACODE EQU   INJMJCT+168                                              11316000
JCTPRFMF EQU   INJMJCT+167                                              11317000
JCTUSER  EQU   INJMJCT+160                                              11318000
JCTSSD   EQU   INJMJCT+157                                              11319000
@NM00060 EQU   INJMJCT+156                                              11320000
JCTSRBT  EQU   INJMJCT+152                                              11321000
JCTJMRJD EQU   INJMJCT+149                                              11322000
JCTJMRJT EQU   INJMJCT+146                                              11323000
JCTJMRSS EQU   INJMJCT+143                                              11324000
JCTJMRTL EQU   INJMJCT+140                                              11325000
JCTJMRCL EQU   INJMJCT+139                                              11326000
JCTJMROP EQU   INJMJCT+138                                              11327000
JCTJMRD  EQU   INJMJCT+137                                              11328000
JCTJMR   EQU   INJMJCT+134                                              11329000
JCTCKIDL EQU   INJMJCT+117                                              11330000
@NM00059 EQU   JCTSTAT2                                                 11331000
JCTBLP   EQU   JCTSTAT2                                                 11332000
JCTPERFM EQU   JCTSTAT2                                                 11333000
JCTSWSM  EQU   JCTSTAT2                                                 11334000
JCTENDIT EQU   JCTSTAT2                                                 11335000
JCTADSPC EQU   JCTSTAT2                                                 11336000
JCTSPSYS EQU   JCTSTAT2                                                 11337000
@NM00058 EQU   INJMJCT+115                                              11338000
JCTJSBTM EQU   JCTJSB                                                   11339000
JCTJSBEX EQU   JCTJSB                                                   11340000
JCTJSBAL EQU   JCTJSB                                                   11341000
JCTJSBIN EQU   JCTJSB                                                   11342000
@NM00057 EQU   JCTJSB                                                   11343000
JCTNTRK  EQU   INJMJCT+107                                              11344000
@NM00056 EQU   INJMJCT+99                                               11345000
JCTSTIOT EQU   INJMJCT+96                                               11346000
JCTSNUMB EQU   INJMJCT+95                                               11347000
JCTQIDNT EQU   INJMJCT+94                                               11348000
JCTEQREG EQU   INJMJCT+92                                               11349000
@NM00055 EQU   INJMJCT+91                                               11350000
JCTDETDA EQU   INJMJCT+88                                               11351000
JCTDSDRA EQU   JCTRSW2                                                  11352000
JCTDSOJB EQU   JCTRSW2                                                  11353000
JCTDSOCR EQU   JCTRSW2                                                  11354000
JCTRESTT EQU   JCTRSW2                                                  11355000
JCTNOCKP EQU   JCTRSW2                                                  11356000
JCTNORST EQU   JCTRSW2                                                  11357000
JCTNARST EQU   JCTRSW2                                                  11358000
@NM00054 EQU   JCTRSW1                                                  11359000
JCTSTEPR EQU   JCTRSW1                                                  11360000
JCTCKPTR EQU   JCTRSW1                                                  11361000
JCTCONTR EQU   JCTRSW1                                                  11362000
JCTSTERM EQU   JCTRSW1                                                  11363000
JCTWARMS EQU   JCTRSW1                                                  11364000
@NM00053 EQU   JCTCCODE+3                                               11365000
JCTJDPOP EQU   JCTCCODE+2                                               11366000
JCTJDPCD EQU   JCTCCODE                                                 11367000
@NM00052 EQU   INJMJCT+53                                               11368000
JCTSCT   EQU   INJMJCT+52                                               11369000
JCTSMRBA EQU   INJMJCT+44                                               11370000
@NM00051 EQU   INJMJCT+43                                               11371000
JCTACTAD EQU   INJMJCT+40                                               11372000
@NM00050 EQU   INJMJCT+39                                               11373000
JCTJCTX  EQU   INJMJCT+36                                               11374000
@NM00049 EQU   INJMJCT+35                                               11375000
JCTJCSMF EQU   INJMJCT+31                                               11376000
@NM00048 EQU   INJMJCT+27                                               11377000
JCTPDIP  EQU   INJMJCT+24                                               11378000
JCTJTPTN EQU   INJMJCT+16                                               11379000
JCTJPRTY EQU   JCTJBYTE                                                 11380000
INCMMGL1 EQU   JCTJMGLV                                                 11381000
INCMMGL2 EQU   JCTJMGLV                                                 11382000
@NM00047 EQU   JCTJMGLV                                                 11383000
INCMALL  EQU   JCTJMGLV                                                 11384000
JCTJMGPO EQU   INJMJCT+6                                                11385000
INCMNSET EQU   JCTJSTAT                                                 11386000
INCMCAT  EQU   INDMCTLG                                                 11387000
INCMSTS  EQU   JCTJSTAT                                                 11388000
JCTABEND EQU   JCTJSTAT                                                 11389000
@NM00046 EQU   JCTJSTAT                                                 11390000
JCTJSTPC EQU   JCTJSTAT                                                 11391000
@NM00045 EQU   JCTJSTAT                                                 11392000
JCTJBLBS EQU   JCTJSTAT                                                 11393000
JCTJSRNO EQU   INJMJCT+4                                                11394000
JCTIDENT EQU   INJMJCT+3                                                11395000
@NM00044 EQU   @NM00042+1                                               11396000
SCTONLY  EQU   SCTABCND                                                 11397000
SCTEVEN  EQU   SCTABCND                                                 11398000
SCTABEND EQU   SCTABCND                                                 11399000
SCTONLYC EQU   SCTABCND                                                 11400000
SCTABCAN EQU   SCTABCND                                                 11401000
@NM00043 EQU   SCTABCND                                                 11402000
@NM00041 EQU   INSMSCT+173                                              11403000
@NM00040 EQU   SCTSTEND                                                 11404000
SCTSTPND EQU   SCTSTEND                                                 11405000
SCTSTSRT EQU   SCTSTEND                                                 11406000
@NM00039 EQU   INSMSCT+168                                              11407000
SCTSDPSA EQU   SCTCDENT+3                                               11408000
SCTSDPOP EQU   SCTCDENT+2                                               11409000
SCTSDPCD EQU   SCTCDENT                                                 11410000
@NM00038 EQU   INSMSCT+117                                              11411000
SCTPRFMF EQU   INSMSCT+116                                              11412000
SCTPGMNM EQU   INSMSCT+108                                              11413000
SCTTIOT  EQU   INSMSCT+105                                              11414000
@NM00037 EQU   SCTBCT                                                   11415000
SCTJBEND EQU   SCTBCT                                                   11416000
SCTSPSYS EQU   SCTBCT                                                   11417000
SCTSTPLB EQU   SCTBCT                                                   11418000
@NM00036 EQU   SCTBCT                                                   11419000
SCTMCVOL EQU   SCTBCT                                                   11420000
@NM00035 EQU   SCTBCT                                                   11421000
SCTGOTTR EQU   INSMSCT+100                                              11422000
SCTSMF   EQU   INSMSCT+96                                               11423000
@NM00034 EQU   SCTSDPTY+1                                               11424000
SCTSDP   EQU   SCTSDPTY                                                 11425000
SCTFSTEP EQU   SCTSDPTY                                                 11426000
@NM00033 EQU   SCTSDPTY                                                 11427000
@NM00032 EQU   SCTSDPTY                                                 11428000
SCTNIUSL EQU   INSMSCT+92                                               11429000
@NM00031 EQU   INSMSCT+90                                               11430000
SCTLDSTB EQU   INSMSCT+80                                               11431000
SCTSRBT  EQU   INSMSCT+76                                               11432000
@NM00030 EQU   INSMSCT+71                                               11433000
SCTJSCAT EQU   SCTSTYPE                                                 11434000
SCTINITB EQU   SCTSTYPE                                                 11435000
SCTSJFHK EQU   SCTSTYPE                                                 11436000
SCTOUTMC EQU   SCTSTYPE                                                 11437000
SCTINPUT EQU   SCTSTYPE                                                 11438000
@NM00029 EQU   INSMSCT+66                                               11439000
SCTNSMSG EQU   INSMSCT+65                                               11440000
@NM00028 EQU   INSMSCT+62                                               11441000
SCTRPACT EQU   INSMSCT+60                                               11442000
@NM00027 EQU   INSMSCT+43                                               11443000
SCTADSTB EQU   INSMSCT+40                                               11444000
@NM00026 EQU   INSMSCT+36                                               11445000
@NM00025 EQU   INSMSCT+35                                               11446000
SCTAFACT EQU   INSMSCT+32                                               11447000
@NM00024 EQU   INSMSCT+27                                               11448000
@NM00023 EQU   INSMSCT+23                                               11449000
@NM00022 EQU   INSMSCT+19                                               11450000
SCTAALOC EQU   INSMSCT+16                                               11451000
@NM00021 EQU   INSMSCT+15                                               11452000
SCTSTIME EQU   INSMSCT+5                                                11453000
INCMSSTS EQU   SCTSSTAT                                                 11454000
SCTGRPH  EQU   SCTSSTAT                                                 11455000
SCTKEY0  EQU   SCTSSTAT                                                 11456000
SCTDORST EQU   SCTSSTAT                                                 11457000
SCTNOCKP EQU   SCTSSTAT                                                 11458000
SCTNORST EQU   SCTSSTAT                                                 11459000
EACAUSER EQU   SCTSSTAT                                                 11460000
SCTTBLID EQU   INSMSCT+3                                                11461000
SCTDISKA EQU   INSMSCT                                                  11462000
SIODDSNL EQU   INDMSIOT+173                                             11463000
SIOVDSNL EQU   INDMSIOT+172                                             11464000
SIOVDSNT EQU   INDMSIOT+170                                             11465000
SVOLUNNO EQU   INDMSIOT+168                                             11466000
SIOTVMVP EQU   INDMSIOT+164                                             11467000
SIOTJFX  EQU   INDMSIOT+160                                             11468000
SJFCBPTR EQU   INDMSIOT+156                                             11469000
SIOTNPTR EQU   INDMSIOT+152                                             11470000
SIOTETIO EQU   INDMSIOT+148                                             11471000
SIOTATE  EQU   INDMSIOT+144                                             11472000
SVOLUNAD EQU   INDMSIOT+140                                             11473000
SIOTEDLP EQU   INDMSIOT+136                                             11474000
SIOTEDLS EQU   INDMSIOT+132                                             11475000
SIOTRSNC EQU   INDMSIOT+130                                             11476000
SIOTSSIC EQU   INDMSIOT+120                                             11477000
@NM00020 EQU   INDMSIOT+108                                             11478000
@NM00019 EQU   SIOTBYT2                                                 11479000
SIOTCVOL EQU   SIOTBYT2                                                 11480000
SIOTGALL EQU   SIOTBYT2                                                 11481000
SIOTDSPD EQU   SIOTBYT2                                                 11482000
SIOTDMND EQU   SIOTBYT2                                                 11483000
SIOTOPUC EQU   INDMSIOT+99                                              11484000
SIOTOUTR EQU   INDMSIOT+97                                              11485000
SIOTSSWA EQU   INDMSIOT+93                                              11486000
SIOTAUNC EQU   SIOTALTD                                                 11487000
SIOTACAT EQU   SIOTALTD                                                 11488000
SIOTADEL EQU   SIOTALTD                                                 11489000
SIOTAKEP EQU   SIOTALTD                                                 11490000
SIOJCATS EQU   SIOTALTD                                                 11491000
@NM00018 EQU   SIOTALTD                                                 11492000
@NM00017 EQU   SIOTALTD                                                 11493000
@NM00016 EQU   INDMSIOT+91                                              11494000
SIOTNDSB EQU   INDMSIOT+88                                              11495000
@NM00015 EQU   INDMSIOT+84                                              11496000
SIOTDPCD EQU   INDMSIOT+82                                              11497000
@NM00014 EQU   SIOTBYT4                                                 11498000
SIOTRACT EQU   SIOTBYT4                                                 11499000
SIOTRACD EQU   SIOTBYT4                                                 11500000
SIOTPROT EQU   SIOTBYT4                                                 11501000
@NM00013 EQU   SIOUBYT3                                                 11502000
SIO3COMM EQU   SIOUBYT3                                                 11503000
SIOUBYT1 EQU   SIOTDEVT                                                 11504000
SIOTOMN  EQU   SCTSBYT4                                                 11505000
SIOTIPDI EQU   SCTSBYT4                                                 11506000
SIOTVAFF EQU   SCTSBYT4                                                 11507000
SIOTSTEP EQU   SCTSBYT4                                                 11508000
SIOTASCI EQU   SCTSBYT4                                                 11509000
@NM00012 EQU   SCTSBYT4                                                 11510000
SIOTGDGA EQU   SCTSBYT4                                                 11511000
SCTSMOD  EQU   SCTSBYT3                                                 11512000
SCTALCHK EQU   SCTSBYT3                                                 11513000
SCTSYSNE EQU   SCTSBYT3                                                 11514000
SCTRECVD EQU   SCTSBYT2                                                 11515000
SCTLABEL EQU   SCTSBYT2                                                 11516000
SCTUNLBD EQU   SCTSBYT2                                                 11517000
SCTJOBLB EQU   SCTSBYT2                                                 11518000
SIOTCATL EQU   SCTSBYT2                                                 11519000
SIOCLUNL EQU   SCTSBYT2                                                 11520000
SCTPARLM EQU   SCTSBYT1                                                 11521000
SIOTQDSN EQU   SCTSBYT1                                                 11522000
SIOTGDSN EQU   SCTSBYT1                                                 11523000
SIOTRETN EQU   SCTSDISP                                                 11524000
SIOTRTRY EQU   SIOTBYT0                                                 11525000
SIOTPUPV EQU   SIOTBYT0                                                 11526000
SIOTNOPV EQU   SIOTBYT0                                                 11527000
SIOTGIGN EQU   SIOTBYT0                                                 11528000
SPVTAMSG EQU   SIOTBYT0                                                 11529000
SIOTFUDA EQU   SIOTBYT0                                                 11530000
SIOTGIID EQU   INDMSIOT+50                                              11531000
SCTSPOOL EQU   INDMSIOT+48                                              11532000
SIOTQNAM EQU   SIOTTSTC                                                 11533000
SIOTSSMG EQU   SIOTTSTC                                                 11534000
SIOTSSGP EQU   SIOTTSTC                                                 11535000
@NM00011 EQU   SIOTTSTC                                                 11536000
SIOTTERM EQU   SIOTTSTC                                                 11537000
SIOTINFC EQU   SIOTTSTC                                                 11538000
@NM00010 EQU   SIOTBYT3                                                 11539000
SIOTDSID EQU   SIOTBYT3                                                 11540000
SIOTJES3 EQU   SIOTBYT3                                                 11541000
SIOCDEVT EQU   SIOTBYT3                                                 11542000
SIOTDDNT EQU   SIOTBYT1                                                 11543000
SIOTALCD EQU   SIOTBYT1                                                 11544000
SIODADSM EQU   SIOTBYT1                                                 11545000
SIOTDADR EQU   SIOTBYT1                                                 11546000
SIODUNAL EQU   SIOTBYT1                                                 11547000
SIOPSCNT EQU   INDMSIOT+42                                              11548000
SIOTREFN EQU   INDMSIOT+40                                              11549000
SIOTOTUN EQU   INDMSIOT+39                                              11550000
SIOTVRSB EQU   INDMSIOT+36                                              11551000
@NM00009 EQU   INDMSIOT+35                                              11552000
@NM00008 EQU   INDMSIOT+31                                              11553000
SIOTAFID EQU   INDMSIOT+26                                              11554000
SIOTVLSP EQU   INDMSIOT+24                                              11555000
SIODSNTE EQU   INDMSIOT+22                                              11556000
JFCBXNXT EQU   JFCBX+172                                                11557000
@NM00007 EQU   JFCBX+144                                                11558000
@NM00006 EQU   JFCBX+94                                                 11559000
@NM00005 EQU   JFCBX+3                                                  11560000
JFCRSV05 EQU   JFCEROPT                                                 11561000
JFCRSV04 EQU   JFCEROPT                                                 11562000
JFCRSV03 EQU   JFCEROPT                                                 11563000
JFCRSV02 EQU   JFCEROPT                                                 11564000
JFCTOPT  EQU   JFCEROPT                                                 11565000
JFCABN   EQU   JFCEROPT                                                 11566000
JFCSKP   EQU   JFCEROPT                                                 11567000
JFCACC   EQU   JFCEROPT                                                 11568000
JFCBUFL  EQU   JFCAMPTR+2                                               11569000
JFCFWORD EQU   JFCBFTEK                                                 11570000
JFCDWORD EQU   JFCBFTEK                                                 11571000
JFCHIER1 EQU   JFCBFTEK                                                 11572000
JFCDYN   EQU   JFCBFTEK                                                 11573000
JFCEXC   EQU   JFCBFTEK                                                 11574000
JFCBBFTR EQU   JFCBBFTA                                                 11575000
JFCSIM   EQU   JFCBBFTA                                                 11576000
JFCHIER  EQU   JFCBFTEK                                                 11577000
JFCBFOUT EQU   JFCBUFNO                                                 11578000
JFCBUFIN EQU   JFCBUFNO                                                 11579000
JFCTEMP  EQU   JFCBIND2                                                 11580000
JFCREQ   EQU   JFCBIND2                                                 11581000
JFCSECUR EQU   JFCBIND2                                                 11582000
JFCDISP  EQU   JFCBIND2                                                 11583000
JFCPDS   EQU   JFCBIND1                                                 11584000
JFCADDED EQU   JFCBIND1                                                 11585000
JFCLOC   EQU   JFCBIND1                                                 11586000
JFCRLSE  EQU   JFCBIND1                                                 11587000
JFCBOPS2 EQU   JFCBMASK+7                                               11588000
JFCRCTLG EQU   JFCBFLG2                                                 11589000
JFCBBUFF EQU   JFCBFLG2                                                 11590000
JFCTRACE EQU   JFCBFLG2                                                 11591000
JFCSDRPS EQU   JFCBFLG2                                                 11592000
JFCMODNW EQU   JFCBFLG2                                                 11593000
JFCNRPS  EQU   JFCDEFER                                                 11594000
JFCOUTOP EQU   JFCBFLG2                                                 11595000
JFCINOP  EQU   JFCBFLG2                                                 11596000
JFCBPWBP EQU   JFCOPEN                                                  11597000
@NM00001 EQU   JFCOPEN                                                  11598000
JFCDUAL  EQU   JFCBFLG1                                                 11599000
JFCSLDES EQU   JFCBFLG1                                                 11600000
JFCSLCRE EQU   JFCBFLG1                                                 11601000
JFCSTAND EQU   JFCBFLG1                                                 11602000
JFCBOPS1 EQU   JFCBMASK                                                 11603000
JFCRSV31 EQU   JFCFUNC                                                  11604000
JFCFNCBT EQU   JFCFUNC                                                  11605000
JFCFNCBX EQU   JFCFUNC                                                  11606000
JFCFNCBD EQU   JFCFUNC                                                  11607000
JFCFNCBW EQU   JFCFUNC                                                  11608000
JFCFNCBP EQU   JFCFUNC                                                  11609000
JFCFNCBR EQU   JFCFUNC                                                  11610000
JFCFNCBI EQU   JFCFUNC                                                  11611000
JFCBFOFL EQU   JFCBUFOF                                                 11612000
JFCNL    EQU   JFCBLTYP                                                 11613000
JFCSL    EQU   JFCBLTYP                                                 11614000
JFCNSL   EQU   JFCBLTYP                                                 11615000
JFCSUL   EQU   JFCBLTYP                                                 11616000
JFCBLP   EQU   JFCBLTYP                                                 11617000
JFCBLTM  EQU   JFCBLTYP                                                 11618000
JFCBAL   EQU   JFCBLTYP                                                 11619000
JFCRSV38 EQU   JFCBLTYP                                                 11620000
JFCVINDX EQU   INFMJFCB+64                                              11621000
JFCAMSTR EQU   JFCBFRID+2                                               11622000
JFCAMCRO EQU   JFCBFRID                                                 11623000
JFCPAT   EQU   JFCBTSDM                                                 11624000
JFCNDCB  EQU   JFCBTSDM                                                 11625000
JFCNDSCB EQU   JFCBTSDM                                                 11626000
JFCNWRIT EQU   JFCBTSDM                                                 11627000
JFCTTR   EQU   JFCBTSDM                                                 11628000
JFCSDS   EQU   JFCBTSDM                                                 11629000
JFCVSL   EQU   JFCBTSDM                                                 11630000
JFCIPLTX EQU   JFCBELNM                                                 11631000
JFCBQNAM EQU   JFCBDSNM                                                 11632000
JFCBE010 EQU   JFCBE+44                                                 11633000
JFCGRP8  EQU   JFCGROUP+7                                               11634000
JFCGRP7  EQU   JFCGROUP+6                                               11635000
JFCGRP6  EQU   JFCGROUP+5                                               11636000
JFCGRP5  EQU   JFCGROUP+4                                               11637000
JFCGRP4  EQU   JFCGROUP+3                                               11638000
JFCGRP3  EQU   JFCGROUP+2                                               11639000
JFCGRP2  EQU   JFCGROUP+1                                               11640000
JFCGRP1  EQU   JFCGROUP                                                 11641000
JFCBTRS4 EQU   JFCBE+32                                                 11642000
JFCBTRS3 EQU   JFCBE+28                                                 11643000
JFCBTRS2 EQU   JFCBE+24                                                 11644000
JFCBTRS1 EQU   JFCBE+20                                                 11645000
JFCBE009 EQU   JFCBE+16                                                 11646000
JFCMODIF EQU   JFCBE+12                                                 11647000
JFCBMAGT EQU   JFCBE+8                                                  11648000
JFCIMTOT EQU   JFCBE+7                                                  11649000
JFCBE008 EQU   JFCBE+6                                                  11650000
JFCIDTRC EQU   JFCBE+5                                                  11651000
JFCBE007 EQU   JFCBFLAG                                                 11652000
JFCBBST  EQU   JFCBFLAG                                                 11653000
JFCBCFS  EQU   JFCBFLAG                                                 11654000
JFCBE006 EQU   JFCBFLAG                                                 11655000
JFCBE005 EQU   JFCBFLAG                                                 11656000
JFCBE004 EQU   JFCBFLAG                                                 11657000
JFCBE003 EQU   JFCBFLAG                                                 11658000
JFCBE001 EQU   JFCBE+3                                                  11659000
*                                      END UNREFERENCED COMPONENTS      11660000
SETUPOUT EQU   @EL00002                                                 11661000
@RF00406 EQU   @RC00402                                                 11662000
@RF00578 EQU   @EL00004                                                 11663000
@RF00793 EQU   @RC00786                                                 11664000
@RF00832 EQU   @RC00827                                                 11665000
@RC00891 EQU   @RC00887                                                 11666000
@RF00918 EQU   @RC00915                                                 11667000
@RC00921 EQU   @RC00915                                                 11668000
@RC00955 EQU   @EL00011                                                 11669000
@RF01044 EQU   @EL00012                                                 11670000
@RC01095 EQU   @RC01094                                                 11671000
@RF01126 EQU   @RC01105                                                 11672000
@RC01117 EQU   @RC01105                                                 11673000
@RC01107 EQU   @RC01105                                                 11674000
@RF01145 EQU   @EL00013                                                 11675000
@RF01144 EQU   @EL00013                                                 11676000
@RC01156 EQU   @EL00014                                                 11677000
@RC01170 EQU   @EL00014                                                 11678000
@RF01195 EQU   @EL00014                                                 11679000
@RC01311 EQU   @RC01310                                                 11680000
@RF01212 EQU   @EL00015                                                 11681000
@RF01211 EQU   @EL00015                                                 11682000
@RF01335 EQU   @EL00015                                                 11683000
@RF01353 EQU   @RC01347                                                 11684000
@RF01340 EQU   @EL00016                                                 11685000
@RC01376 EQU   @EL00017                                                 11686000
@RF01389 EQU   @EL00017                                                 11687000
@RC01395 EQU   @EL00017                                                 11688000
@RF01424 EQU   @EL00017                                                 11689000
@RF01631 EQU   @RC01604                                                 11690000
@RF01820 EQU   @RC01816                                                 11691000
@RC01876 EQU   @EL00026                                                 11692000
@RC01809 EQU   @EL00026                                                 11693000
@RC01904 EQU   @EL00027                                                 11694000
@RF02249 EQU   @EL00036                                                 11695000
@RF02256 EQU   @EL00037                                                 11696000
@RF00957 EQU   @RC00955                                                 11697000
@RF00968 EQU   @RC00955                                                 11698000
@RF01181 EQU   @RC01170                                                 11699000
@RC01172 EQU   @RC01170                                                 11700000
@RF01381 EQU   @RC01376                                                 11701000
@RF01402 EQU   @RC01395                                                 11702000
@RC01880 EQU   @RC01876                                                 11703000
@RF01906 EQU   @RC01904                                                 11704000
@ENDDATA EQU   *                                                        11705000
         END   IEFXB609,(C'PLS1906',0701,78059)                         11706000
