         TITLE 'IRARMSTM - SYSTEM RESOURCES MANAGER STORAGE MANAGEMENT *00001000
                        '                                               00002000
IRARMSTM CSECT ,                                                   0001 00003000
@PROLOG  BALR  @12,0                                               0001 00004000
@PSTART  DS    0H                                                  0001 00005000
         USING @PSTART,@12                                         0001 00006000
*                                                                  0052 00007000
*                                  /*                                   00008000
         ENTRY IRARMPR1                                                 00009000
IRARMPR1 DS    0H                                                       00010000
         STM   @00,@14,000+000(@13)    SAVE INVOKING RTNE REGS          00011000
         ST    @01,RRPAEPA(,RRPAPTR)   INDICATE NEW CURRENT RMEP        00012000
         LA    @12,IRARMPR1-@PSTART    DISPLACEMENT TO MODULE BASE      00013000
         LCR   @12,@12                 NEGATIVE FOR SUBTRACT            00014000
         ALR   @12,@15                 SETUP MODULE ADDRESSABILITY      00015000
*/*                                                                  */ 00016000
*/*      INITIALIZE PAGE REPLACEMENT PROCESSING                      */ 00017000
*/*                                                                  */ 00018000
*                                                                  0053 00019000
*   IF UPPVTUIC='0'B&               /* WAS AN SRB SCHEDULED  @ZA33182*/ 00020000
*       UPCOMUIC='0'B THEN                                         0053 00021000
         TM    UPPVTUIC,B'01100000'                                0053 00022000
         BNZ   @RF00053                                            0053 00023000
*     DO;                           /* FOR PR1 - IF NO THEN SCHEDULE    00024000
*                                      ONE AND RETURN        @ZA33182*/ 00025000
*                                                                  0054 00026000
*       /*************************************************************/ 00027000
*       /*                                                           */ 00028000
*       /* ? IRACTLCL EPN(PR1)                                       */ 00029000
*       /*                                                           */ 00030000
*       /*************************************************************/ 00031000
*                                                                  0055 00032000
*       DO;                                                        0055 00033000
*         R1=ADDR(RMEPBPR1);        /* PR1 REQUEST IS PARAM          */ 00034000
         LA    R1,RMEPBPR1(,RMCTPTR)                               0056 00035000
*         CALL RMSBCRL->IRARMRTN;   /* ALGRTHM SCH FUNCT             */ 00036000
         L     @15,RMSBCRL(,RMCTPTR)                               0057 00037000
         BALR  @14,@15                                             0057 00038000
*       END;                                                       0058 00039000
*       UPPVTUIC='1'B;              /* INDICATE PVT UIC UPDT @ZA33182*/ 00040000
         OI    UPPVTUIC,B'01000000'                                0059 00041000
*     END;                          /*                       @ZA33182*/ 00042000
*   ELSE                                                           0061 00043000
*     DO;                           /* SRB WAS SCHEDULED     @ZA33182*/ 00044000
         B     @RC00053                                            0061 00045000
@RF00053 DS    0H                                                  0062 00046000
*       RESPECIFY                                                  0062 00047000
*        (RFRPTR,                                                  0062 00048000
*         PRX) RESTRICTED;                                         0062 00049000
*       RFRPTR=ADDR(RFRLST1);       /* INITIALIZE INTERFACE LIST PTR */ 00050000
         LA    RFRPTR,RFRLST1                                      0063 00051000
*       PRX=RFRPTR;                 /* RESET LIST INDEX      @Z30WIMG*/ 00052000
         LR    PRX,RFRPTR                                          0064 00053000
*       PRXEND=RFRLAST;             /* POINT TO LAST LIST ENTRY      */ 00054000
         L     @10,RFRLAST                                         0065 00055000
         ST    @10,PRXEND                                          0065 00056000
*       PRFLGS='';                  /* CLEAR STEAL FLAGS     @Z30WIPH*/ 00057000
         MVI   PRFLGS,X'00'                                        0066 00058000
*       PRUICU='1'B;                /* INCR UIC COUNTS       @Z40BPSS*/ 00059000
         OI    PRUICU,B'01000000'                                  0067 00060000
*       PRCRI=I254;                 /* USE MAX STEAL CRITERIA      0068 00061000
*                                                            @Z40BPSS*/ 00062000
         MVC   PRCRI(2),@CH02148                                   0068 00063000
*       PRSCT=I32767;               /* UPDATE ALL UICS       @Z30WIPH*/ 00064000
         MVC   PRSCT(2),@CH02154                                   0069 00065000
*       PRSTCNT=I0;                 /* INITIALIZE STOLEN CNT @Z40BPSS*/ 00066000
         SLR   PRSTCNT,PRSTCNT                                     0070 00067000
*       IF UPPVTUIC='1'B            /* SRB TO UPDATE PVT UICS      0071 00068000
*                                                            @ZA33182*/ 00069000
*         THEN                                                     0071 00070000
         TM    UPPVTUIC,B'01000000'                                0071 00071000
         BNO   @RF00071                                            0071 00072000
*         DO;                       /* IF YES UPDATE THE UICS      0072 00073000
*                                                            @ZA33182*/ 00074000
*/*   CALL REAL FRAME REPLACEMENT FOR EVERY IN CORE USR TO UPDT UICS */ 00075000
*                                                                  0073 00076000
*           OUCBPTR=RMCTINQE;       /* ESTABLISH ADDRESSABILITY TO 0073 00077000
*                                      INQ                   @Z40BPSS*/ 00078000
         L     OUCBPTR,RMCTINQE(,RMCTPTR)                          0073 00079000
*           OUCBPTR=OUCBFWD;        /* POINT TO FIRST USER   @Z40BPSS*/ 00080000
         L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0074 00081000
*           DO WHILE OUCBNAME='OUCB';/* EXAMINE EACH VALID USER    0075 00082000
*                                                            @Z40BPSS*/ 00083000
         B     @DE00075                                            0075 00084000
@DL00075 DS    0H                                                  0076 00085000
*             ASCBPTR=OUCBASCB;     /* POINT TO CORRESPONDING ASCB 0076 00086000
*                                                            @Z40BPSS*/ 00087000
         L     ASCBPTR,OUCBASCB(,OUCBPTR)                          0076 00088000
*             IF OUCBOUT='0'B&      /* IGNORE USERS OUT OF MAIN    0077 00089000
*                                                            @Z40BPSS*/ 00090000
*                 OUCBGOO='0'B&     /* STORAGE OR USERS IN   @Z40BPSS*/ 00091000
*                 OUCBGOI='0'B&     /* TRANSITION ALSO INSURE      0077 00092000
*                                                            @Z40BPSS*/ 00093000
*                 OUCBGOB='0'B&     /* REAL STORAGE MGMT CNTL      0077 00094000
*                                                            @Z40BPSS*/ 00095000
*                 ASCBRSM^=I0 THEN  /* BLOCKS EXISTS         @Z40BPSS*/ 00096000
         TM    OUCBOUT(OUCBPTR),B'11100100'                        0077 00097000
         BNZ   @RF00077                                            0077 00098000
         L     @10,ASCBRSM(,ASCBPTR)                               0077 00099000
         LTR   @10,@10                                             0077 00100000
         BZ    @RF00077                                            0077 00101000
*               CALL STEAL;         /* GO INIT RFR INTERFACE LIST  0078 00102000
*                                                            @Z40BPSS*/ 00103000
         BAL   @14,STEAL                                           0078 00104000
*             OUCBPTR=OUCBFWD;      /* LOOK AT NEXT USR ON QUEUE   0079 00105000
*                                                            @Z40BPSS*/ 00106000
@RF00077 L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0079 00107000
*           END;                    /* END OF DO WHILE       @Z40BPSS*/ 00108000
@DE00075 CLC   OUCBNAME(4,OUCBPTR),@CC02185                        0080 00109000
         BE    @DL00075                                            0080 00110000
*           IF PRX^=RFRPTR          /* TEST FOR PARTIAL LIST @ZA33182*/ 00111000
*             THEN                                                 0081 00112000
         CR    PRX,RFRPTR                                          0081 00113000
         BE    @RF00081                                            0081 00114000
*             DO;                   /* IF ONE EXISTS         @ZA33182*/ 00115000
*               PRXEND=PRX;         /* DUMMY THE LAST ENTRY  @ZA33182*/ 00116000
         ST    PRX,PRXEND                                          0083 00117000
*               CALL STEAL;         /* GO FLUSH THE LIST     @ZA33182*/ 00118000
         BAL   @14,STEAL                                           0084 00119000
*             END;                  /*                       @ZA33182*/ 00120000
*           UPPVTUIC='0'B;          /* INDICATE PVT UICS UPDATED   0086 00121000
*                                                            @ZA33182*/ 00122000
@RF00081 DS    0H                                                  0087 00123000
*           UPCOMUIC='1'B;          /* REQUEST COMMON UIC UPDATE   0087 00124000
*                                                            @ZA33182*/ 00125000
         OI    UPCOMUIC,B'00100000'                                0087 00126000
         NI    UPPVTUIC,B'10111111'                                0087 00127000
*/*   ? IRACTLCL EPN(PR1)                                            */ 00128000
*                                                                  0088 00129000
*           DO;                                                    0088 00130000
*             R1=ADDR(RMEPBPR1);    /* PR1 REQUEST IS PARAM          */ 00131000
         LA    R1,RMEPBPR1(,RMCTPTR)                               0089 00132000
*             CALL RMSBCRL->IRARMRTN;/* ALGRTHM SCH FUNCT            */ 00133000
         L     @15,RMSBCRL(,RMCTPTR)                               0090 00134000
         BALR  @14,@15                                             0090 00135000
*           END;                    /* RESCHEDULE PR1 FOR COMMON   0091 00136000
*                                                            @ZA33182*/ 00137000
*         END;                      /* END OF PVT UIC UPDATE @ZA33182*/ 00138000
*       ELSE                                                       0093 00139000
*         DO;                       /* UPDATE COMMON UICS    @ZA33182*/ 00140000
*                                                                  0093 00141000
         B     @RC00071                                            0093 00142000
@RF00071 DS    0H                                                  0094 00143000
*           /*********************************************************/ 00144000
*           /*                                                       */ 00145000
*           /* CALL REAL FRAME REPLACEMENT FOR SYSTEM PAGEABLE AREA  */ 00146000
*           /*                                                       */ 00147000
*           /*********************************************************/ 00148000
*                                                                  0094 00149000
*           PRXEND=PRX+LENGTH(RPRFRINT);/* FLUSH LIST        @Z40BPSS*/ 00150000
         LA    @10,8                                               0094 00151000
         ALR   @10,PRX                                             0094 00152000
         ST    @10,PRXEND                                          0094 00153000
*           ASCBPTR=I0;             /* INDICATE SPA          @Z40BPSS*/ 00154000
         SLR   ASCBPTR,ASCBPTR                                     0095 00155000
*           CALL STEAL;             /* GO INIT RFR INTERFACE LIST  0096 00156000
*                                                            @Z40BPSS*/ 00157000
         BAL   @14,STEAL                                           0096 00158000
*           UPCOMUIC='0'B;          /* INDICATE COMMON UICS UPDATED     00159000
*                                                            @ZA33182*/ 00160000
         NI    UPCOMUIC,B'11011111'                                0097 00161000
*         END;                      /* END OF COMMON UIC UPDATE    0098 00162000
*                                                            @ZA33182*/ 00163000
*       RESPECIFY                                                  0099 00164000
*        (RFRPTR,                                                  0099 00165000
*         PRX) UNRESTRICTED;        /*                       @Z30WIPH*/ 00166000
@RC00071 DS    0H                                                  0100 00167000
*       MCVSTCRI=I0;                /* INITIALIZE HIGHEST SYS UIC  0100 00168000
*                                                            @Z40BPSS*/ 00169000
         SLR   @07,@07                                             0100 00170000
         STH   @07,MCVSTCRI(,RMCTPTR)                              0100 00171000
*       OUCBPTR=RMCTINQE;           /* ADDRESSIBILITY TO IN QUEUE  0101 00172000
*                                                            @Z40BPSS*/ 00173000
         L     OUCBPTR,RMCTINQE(,RMCTPTR)                          0101 00174000
*       OUCBPTR=OUCBFWD;            /* POINT TO FIRST USER   @Z40BPSS*/ 00175000
         L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0102 00176000
*       DO WHILE OUCBNAME='OUCB';   /* EXAMINE EACH USER ON QUEUE  0103 00177000
*                                                            @Z40BPSS*/ 00178000
         B     @DE00103                                            0103 00179000
@DL00103 DS    0H                                                  0104 00180000
*         ASCBPTR=OUCBASCB;         /* POINT TO CORRESPONDING ASCB 0104 00181000
*                                                            @Z40BPSS*/ 00182000
         L     ASCBPTR,OUCBASCB(,OUCBPTR)                          0104 00183000
*         IF OUCBOUT='0'B&          /* IGNORE USERS OUT OF MAIN    0105 00184000
*                                                            @Z40BPSS*/ 00185000
*             OUCBGOO='0'B&         /* STORAGE OR USERS IN   @Z40BPSS*/ 00186000
*             OUCBGOI='0'B&         /* TRANSITION ALSO INSURE      0105 00187000
*                                                            @Z40BPSS*/ 00188000
*             OUCBGOB='0'B&         /* REAL STORAGE MGMT CNTL      0105 00189000
*                                                            @Z40BPSS*/ 00190000
*             ASCBRSM^=I0 THEN                                     0105 00191000
         TM    OUCBOUT(OUCBPTR),B'11100100'                        0105 00192000
         BNZ   @RF00105                                            0105 00193000
         L     @07,ASCBRSM(,ASCBPTR)                               0105 00194000
         LTR   @07,@07                                             0105 00195000
         BZ    @RF00105                                            0105 00196000
*           DO;                     /* BLOCKS EXISTS         @Z40BPSS*/ 00197000
*             OUXBPTR=ASCBOUXB;     /* CORRESPONDING OUXB    @Z40BPSS*/ 00198000
         L     OUXBPTR,ASCBOUXB(,ASCBPTR)                          0107 00199000
*             MCVSTCRI=MAX(MCVSTCRI,OUXBUIC);/* HIGHEST SO FAR     0108 00200000
*                                                            @Z40BPSS*/ 00201000
         LH    @07,MCVSTCRI(,RMCTPTR)                              0108 00202000
         LH    @15,OUXBUIC(,OUXBPTR)                               0108 00203000
         CR    @07,@15                                             0108 00204000
         BNL   *+6                                                      00205000
         LR    @07,@15                                             0108 00206000
         STH   @07,MCVSTCRI(,RMCTPTR)                              0108 00207000
*           END;                                                   0109 00208000
*         OUCBPTR=OUCBFWD;          /* LOOK AT NEXT OUCB     @Z40BPSS*/ 00209000
@RF00105 L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0110 00210000
*       END;                        /* END OF SEARCH         @Z40BPSS*/ 00211000
@DE00103 CLC   OUCBNAME(4,OUCBPTR),@CC02185                        0111 00212000
         BE    @DL00103                                            0111 00213000
*       MCVSTCRI=MAX(MCVSTCRI,PVTCHUIC);/* GET SYSTEM HIGHEST      0112 00214000
*                                                            @Z40BPSS*/ 00215000
         L     @07,CVTPTR                                          0112 00216000
         L     @07,PVTPTR(,@07)                                    0112 00217000
         LH    @15,MCVSTCRI(,RMCTPTR)                              0112 00218000
         LH    @07,PVTCHUIC(,@07)                                  0112 00219000
         CR    @15,@07                                             0112 00220000
         BNL   *+6                                                      00221000
         LR    @15,@07                                             0112 00222000
         STH   @15,MCVSTCRI(,RMCTPTR)                              0112 00223000
*       IF FIRSTIME='0'B THEN                                      0113 00224000
         TM    FIRSTIME,B'10000000'                                0113 00225000
         BNZ   @RF00113                                            0113 00226000
*         DO;                       /* FIRST TIME SAVE VALUE @ZM43064*/ 00227000
*           MCCPR1IN=RMEPINT;       /* SAVE INITIAL PR1 RMEPINT    0115 00228000
*                                                            @ZM43064*/ 00229000
         L     @07,RMEPPTR(,RRPAPTR)                               0115 00230000
         L     @07,RMEPINT(,@07)                                   0115 00231000
         ST    @07,MCCPR1IN(,RMCTPTR)                              0115 00232000
*           FIRSTIME='1'B;          /* INDICATE VALUE SAVED  @ZM43064*/ 00233000
         OI    FIRSTIME,B'10000000'                                0116 00234000
*         END;                      /*                       @ZM43064*/ 00235000
*       IF MCVSTCRI>MCCUICBD THEN   /* NEED PR1 INTERVAL CHANGED   0118 00236000
*                                                            @ZM43064*/ 00237000
@RF00113 LH    @07,MCVSTCRI(,RMCTPTR)                              0118 00238000
         C     @07,MCCUICBD(,RMCTPTR)                              0118 00239000
         BNH   @RF00118                                            0118 00240000
*         RMEPINT=MIN(RMEPINT+MCCUICIN,MCCINTMX);/* INCREMENT PR1  0119 00241000
*                                      INTERVAL              @ZM43097*/ 00242000
         L     @07,RMEPPTR(,RRPAPTR)                               0119 00243000
         L     @15,RMEPINT(,@07)                                   0119 00244000
         AL    @15,MCCUICIN(,RMCTPTR)                              0119 00245000
         L     @14,MCCINTMX(,RMCTPTR)                              0119 00246000
         CLR   @15,@14                                             0119 00247000
         BNH   *+6                                                      00248000
         LR    @15,@14                                             0119 00249000
         ST    @15,RMEPINT(,@07)                                   0119 00250000
*     END;                          /*                       @ZA33182*/ 00251000
@RF00118 DS    0H                                                  0121 00252000
*/*   ? IRACTLEP ENN(PR1)                                            */ 00253000
*                                                                  0121 00254000
*   GEN CODE EXIT NOSEQFLOW;                                       0121 00255000
@RC00053 DS    0H                                                  0121 00256000
*                                  /*                                   00257000
         LM    @00,@14,000+000(@13)    RELOAD INVOKING RTNE REGS        00258000
         BR    RTNREG                  RETURN TO INVOKER                00259000
*                                                                  0122 00260000
*/********************************************************************/ 00261000
*/*                                                                  */ 00262000
*/* ENTRY POINT NAME = IRARMPR5                                      */ 00263000
*/*                                                                  */ 00264000
*/* DESCRIPTIVE NAME = PAGE REPLACEMENT REAL PAGE SHORTAGE FORCE     */ 00265000
*/*                    STEAL ROUTINE                                 */ 00266000
*/*                                                                  */ 00267000
*/* FUNCTION = STEAL AS MANY PAGES AS REQUIRED TO RELIEVE PAGE       */ 00268000
*/*            SHORTAGES. THE STEAL DECISION IS MADE AT ENTRY        */ 00269000
*/*            MS2. THE OLDEST UNREFERENCED SYSTEM WIDE PAGES        */ 00270000
*/*            ARE STOLEN FIRST.                                     */ 00271000
*/*                                                                  */ 00272000
*/* CALLER = IRARMCTL - SRM CONTROL MODULE                           */ 00273000
*/*            ALGORITHM REQUEST PROCESSOR                           */ 00274000
*/*                                                                  */ 00275000
*/* INPUT = R2 = RMCT ADDRESS                                        */ 00276000
*/*         R3 = RRPA ADDRESS                                        */ 00277000
*/*         MCVFRCNT = NUMBER OF PAGES THAT MUST BE STOLEN TO        */ 00278000
*/*                    REACH MAIN STORAGE TARGET                     */ 00279000
*/*         MCVSTCRI = THE CRITERIA THAT PR5 WILL START TO           */ 00280000
*/*                    STEAL AT                                      */ 00281000
*/*                                                                  */ 00282000
*/* OUTPUT = NONE                                                    */ 00283000
*/*                                                                  */ 00284000
*/********************************************************************/ 00285000
*/*IRARMPR5: CHART (AMODE,SEQ,AREF)                                  */ 00286000
*/* HEADER                                                         0122 00287000
*/* AUG 8,1975                                         IRARMPR5-   0122 00288000
*/* REAL PAGE SHORTAGE FORCE STEAL RTN                               */ 00289000
*/*IRARMPR5: E INVOKED BY MS2                                        */ 00290000
*/* P INITIALIZE RFR INTERFACE LIST                                  */ 00291000
*/* N DO NOT INCR UICS, # FRAMES NEEDED FOUND IN MCVFRCNT            */ 00292000
*/* P SET STEAL CRITERIA EQUAL TO HIGHEST UIC (MCVSTCRI)             */ 00293000
*/* P SET MAXIMUM STEAL NUMBER OF PAGES TO STEAL (STLCT)             */ 00294000
*/*%A: P OBTAIN OUCB FROM INQUE                                      */ 00295000
*/* D (NO,%D,YES,) USER IN CORE ?                                    */ 00296000
*/* D (NO,%D,YES,) IS CRITERIA LE OUXBUIC ?                          */ 00297000
*/* S STEAL: GO INIT RFR INTERFACE LIST                              */ 00298000
*/* D (YES,%B,NO,) ENOUGH PAGES STOLEN ?                             */ 00299000
*/*%D: D (NO,%A,YES,) END OF INQUE ?                                 */ 00300000
*/* D (YES,%B,NO,) ENOUGH PAGES STOLEN ?                             */ 00301000
*/* D (NO,%B,YES,) IS CRITERIA LE PVTCHUIC ?                         */ 00302000
*/* S STEAL: STEAL FROM SPA - ASCB=0                                 */ 00303000
*/*%B: D (NO,%E,YES,) FRAMES STILL NEEDED ?                          */ 00304000
*/* D (YES,%A,NO,) PAGES AVAIL AT CURRENT STL CRITERIA ?             */ 00305000
*/* P DECREMENT HIGHEST UIC VALUE - MCVSTCRI                         */ 00306000
*/* P (,%A) DECREMENT RFR CRITERIA AND STEAL SOME MORE               */ 00307000
*/*%E: R RETURN TO CALLER                                            */ 00308000
*/*IRARMPR5: END                                                     */ 00309000
*/*   ? IRACTLEP EPN(PR5)                                            */ 00310000
*                                                                  0122 00311000
*   DCL                                                            0122 00312000
*     IRARMPR5 ENTRY INT;                                          0122 00313000
*   GEN CODE REFS(RRPAEPA) DEFS(IRARMPR5) NOEXIT SEQFLOW;          0123 00314000
*                                                                  0123 00315000
*                                  /*                                   00316000
         ENTRY IRARMPR5                                                 00317000
IRARMPR5 DS    0H                                                       00318000
         STM   @00,@14,000+000(@13)    SAVE INVOKING RTNE REGS          00319000
         ST    @01,RRPAEPA(,RRPAPTR)   INDICATE NEW CURRENT RMEP        00320000
         LA    @12,IRARMPR5-@PSTART    DISPLACEMENT TO MODULE BASE      00321000
         LCR   @12,@12                 NEGATIVE FOR SUBTRACT            00322000
         ALR   @12,@15                 SETUP MODULE ADDRESSABILITY      00323000
*/*  INITIALIZE FOR PAGE REPLACEMENT PROCESSING              @Z40BPSS*/ 00324000
*                                                                  0124 00325000
*   RESPECIFY                                                      0124 00326000
*    (RFRPTR,                                                      0124 00327000
*     PRX) RESTRICTED;                                             0124 00328000
*   RFRPTR=ADDR(RFRLST1);           /* SET UP ADDRESSING TO INTERFACE   00329000
*                                      LIST                          */ 00330000
         LA    RFRPTR,RFRLST1                                      0125 00331000
*   PRSTCNT=I0;                     /* ZERO STEAL COUNT      @Z30WIPH*/ 00332000
         SLR   PRSTCNT,PRSTCNT                                     0126 00333000
*   PRSCT=STLCNT;                   /* FRAMES TO STL PER CAL @ZA20361*/ 00334000
         L     @10,STLCNT                                          0127 00335000
         STH   @10,PRSCT                                           0127 00336000
*   PRX=RFRPTR;                     /* RESET LIST INDEX      @Z30WIMG*/ 00337000
         LR    PRX,RFRPTR                                          0128 00338000
*   PRXEND=PRX+                     /* STEAL FROM ONE USER           */ 00339000
*       LENGTH(RPRFRINT);           /* USER AT A TIME                */ 00340000
         LA    @10,8                                               0129 00341000
         ALR   @10,PRX                                             0129 00342000
         ST    @10,PRXEND                                          0129 00343000
*   PRFLGS='';                      /* CLEAR STEAL FLAGS     @Z30WIPH*/ 00344000
*                                                                  0130 00345000
         MVI   PRFLGS,X'00'                                        0130 00346000
*   /*****************************************************************/ 00347000
*   /*                                                               */ 00348000
*   /* PAGES ARE NEEDED, KEEP STEALING FROM ALL USERS AND THE SYSTEM */ 00349000
*   /* PAGEABLE AREAS UNTIL STORAGE SHORTAGE IS RELIEVED     @Z40BPSS*/ 00350000
*   /*                                                               */ 00351000
*   /*****************************************************************/ 00352000
*                                                                  0131 00353000
*   DO MSX=MCVSTCRI TO-I1           /* LOOP UNTIL ALL PAGES  @Z40BPSS*/ 00354000
*         BY-I1 WHILE               /* ARE STOLEN OR SHORTGE @Z40BPSS*/ 00355000
*         MCVFRCNT>PRSTCNT;         /* IS RELIEVED           @ZA20361*/ 00356000
         LH    MSX,MCVSTCRI(,RMCTPTR)                              0131 00357000
         B     @DE00131                                            0131 00358000
@DL00131 CH    PRSTCNT,MCVFRCNT(,RMCTPTR)                          0131 00359000
         BNL   @DC00131                                            0131 00360000
*     MSXBUMP=I0;                   /*                       @ZA20361*/ 00361000
         SLR   @09,@09                                             0132 00362000
         ST    @09,MSXBUMP                                         0132 00363000
*     PRCRI=MAX(I0,MSX);            /* USE MSX AS CRITERIA AND     0133 00364000
*                                      PROCESS TWICE AT CRITERIA ZERO   00365000
*                                                            @Z40BPSS*/ 00366000
*                                                                  0133 00367000
         CR    @09,MSX                                             0133 00368000
         BNL   *+6                                                      00369000
         LR    @09,MSX                                             0133 00370000
         STH   @09,PRCRI                                           0133 00371000
*     /***************************************************************/ 00372000
*     /*                                                             */ 00373000
*     /* STEAL FROM PRIVATE MEMORIES                         @Z40BPSS*/ 00374000
*     /*                                                             */ 00375000
*     /***************************************************************/ 00376000
*                                                                  0134 00377000
*     OUCBPTR=RMCTINQE;             /* ADDRESSIBILITY TO INQ @Z40BPSS*/ 00378000
         L     OUCBPTR,RMCTINQE(,RMCTPTR)                          0134 00379000
*     OUCBPTR=OUCBFWD;              /* POINT TO FIRST MEMORY @Z40BPSS*/ 00380000
         L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0135 00381000
*     DO WHILE OUCBNAME='OUCB'&     /* LOOP THRU INQ UNTIL   @Z40BPSS*/ 00382000
*           MCVFRCNT>PRSTCNT;       /* SHORTAGE IS RELIEVED  @ZA20361*/ 00383000
         B     @DE00136                                            0136 00384000
@DL00136 DS    0H                                                  0137 00385000
*       ASCBPTR=OUCBASCB;           /* ADDRESSIBILITY TO ASCB      0137 00386000
*                                                            @Z40BPSS*/ 00387000
         L     ASCBPTR,OUCBASCB(,OUCBPTR)                          0137 00388000
*       OUXBPTR=ASCBOUXB;           /* ADDRESSIBILITY TO OUXB      0138 00389000
*                                                            @Z40BPSS*/ 00390000
         L     OUXBPTR,ASCBOUXB(,ASCBPTR)                          0138 00391000
*       IF OUCBOUT='0'B&            /* STEAL ONLY FROM       @Z40BPSS*/ 00392000
*           OUCBGOI='0'B&           /*                       @Z40BPSS*/ 00393000
*           OUCBGOB='0'B&           /*                       @Z40BPSS*/ 00394000
*           OUCBQSC='0'B&           /* GOO TILL QUIESCE CMPT @ZM43063*/ 00395000
*           MSX=<OUXBUIC&           /* SOME ARE AVAILABLE    @Z40BPSS*/ 00396000
*           ASCBRSM^=I0 THEN                                       0139 00397000
         TM    OUCBOUT(OUCBPTR),B'01100100'                        0139 00398000
         BNZ   @RF00139                                            0139 00399000
         TM    OUCBQSC(OUCBPTR),B'00000010'                        0139 00400000
         BNZ   @RF00139                                            0139 00401000
         CH    MSX,OUXBUIC(,OUXBPTR)                               0139 00402000
         BH    @RF00139                                            0139 00403000
         L     @09,ASCBRSM(,ASCBPTR)                               0139 00404000
         LTR   @09,@09                                             0139 00405000
         BZ    @RF00139                                            0139 00406000
*         DO;                       /*                       @ZA20361*/ 00407000
*           CALL STEAL;             /* INIT RFR INTERFACE LST      0141 00408000
*                                                            @Z40BPSS*/ 00409000
         BAL   @14,STEAL                                           0141 00410000
*           IF RPRFRSCT^=I0&MSX=<OUXBUIC THEN/* PAGES WERE STOLEN AND   00411000
*                                      HI UIC DECREMENTED    @ZA20361*/ 00412000
         LH    @09,RPRFRSCT(,PRX)                                  0142 00413000
         LTR   @09,@09                                             0142 00414000
         BZ    @RF00142                                            0142 00415000
         CH    MSX,OUXBUIC(,OUXBPTR)                               0142 00416000
         BH    @RF00142                                            0142 00417000
*             MSXBUMP=I1;           /* NEXT PASS STL AT SAME CRITERIA   00418000
*                                                            @ZA20361*/ 00419000
         MVC   MSXBUMP(4),@CF00090                                 0143 00420000
*         END;                      /*                       @ZA20361*/ 00421000
@RF00142 DS    0H                                                  0145 00422000
*       OUCBPTR=OUCBFWD;            /* EXAMINE NEXT ADDR SPACE     0145 00423000
*                                                            @Z40BPSS*/ 00424000
@RF00139 L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0145 00425000
*     END;                                                         0146 00426000
*                                                                  0146 00427000
@DE00136 CLC   OUCBNAME(4,OUCBPTR),@CC02185                        0146 00428000
         BNE   @DC00136                                            0146 00429000
         CH    PRSTCNT,MCVFRCNT(,RMCTPTR)                          0146 00430000
         BL    @DL00136                                            0146 00431000
@DC00136 DS    0H                                                  0147 00432000
*     /***************************************************************/ 00433000
*     /*                                                             */ 00434000
*     /* STEAL FROM SYSTEM PAGEABLE AREA                     @Z40BPSS*/ 00435000
*     /*                                                             */ 00436000
*     /***************************************************************/ 00437000
*                                                                  0147 00438000
*     IF MCVFRCNT>PRSTCNT&          /* STILL NEED FRAMES     @ZA20361*/ 00439000
*         MSX=<PVTCHUIC THEN                                       0147 00440000
         CH    PRSTCNT,MCVFRCNT(,RMCTPTR)                          0147 00441000
         BNL   @RF00147                                            0147 00442000
         L     @09,CVTPTR                                          0147 00443000
         L     @09,PVTPTR(,@09)                                    0147 00444000
         CH    MSX,PVTCHUIC(,@09)                                  0147 00445000
         BH    @RF00147                                            0147 00446000
*       DO;                         /* CAN GET SOME          @Z40BPSS*/ 00447000
*         ASCBPTR=I0;               /* STEAL FROM COMMON     @Z40BPSS*/ 00448000
         SLR   ASCBPTR,ASCBPTR                                     0149 00449000
*         CALL STEAL;               /* INIT RFR INTERFACE LIST     0150 00450000
*                                                            @Z40BPSS*/ 00451000
         BAL   @14,STEAL                                           0150 00452000
*         IF RPRFRSCT^=I0&          /* IF PAGES STOLEN AND UIC     0151 00453000
*                                                            @ZA20361*/ 00454000
*             MSX=<PVTCHUIC         /* DECREMENTED USE THE SAME    0151 00455000
*                                                            @ZA20361*/ 00456000
*           THEN                                                   0151 00457000
         LH    @09,RPRFRSCT(,PRX)                                  0151 00458000
         LTR   @09,@09                                             0151 00459000
         BZ    @RF00151                                            0151 00460000
         L     @09,CVTPTR                                          0151 00461000
         L     @09,PVTPTR(,@09)                                    0151 00462000
         CH    MSX,PVTCHUIC(,@09)                                  0151 00463000
         BH    @RF00151                                            0151 00464000
*           MSXBUMP=I1;             /* STEAL CRITERIA        @ZA20361*/ 00465000
         MVC   MSXBUMP(4),@CF00090                                 0152 00466000
*       END;                                                       0153 00467000
@RF00151 DS    0H                                                  0154 00468000
*     IF MSXBUMP=I1                 /* UPDATE LOOP INDEX     @ZA20361*/ 00469000
*       THEN                                                       0154 00470000
@RF00147 L     @09,MSXBUMP                                         0154 00471000
         C     @09,@CF00090                                        0154 00472000
         BNE   @RF00154                                            0154 00473000
*       MSX=MSX+MSXBUMP;            /*                       @ZA20361*/ 00474000
         ALR   MSX,@09                                             0155 00475000
*     ELSE                                                         0156 00476000
*       MCVSTCRI=MAX(I0,MSX-I1);    /* UPDT SYSTEM HI UIC    @ZA20361*/ 00477000
         B     @RC00154                                            0156 00478000
@RF00154 LR    @09,MSX                                             0156 00479000
         BCTR  @09,0                                               0156 00480000
         SLR   @07,@07                                             0156 00481000
         CR    @09,@07                                             0156 00482000
         BNL   *+6                                                      00483000
         LR    @09,@07                                             0156 00484000
         STH   @09,MCVSTCRI(,RMCTPTR)                              0156 00485000
*   END;                            /* GO STEAL WITH NEW CRITERIA  0157 00486000
*                                                            @Z40BPSS*/ 00487000
@RC00154 BCTR  MSX,0                                               0157 00488000
@DE00131 C     MSX,@CF02209                                        0157 00489000
         BNL   @DL00131                                            0157 00490000
@DC00131 DS    0H                                                  0158 00491000
*   RESPECIFY                                                      0158 00492000
*    (RFRPTR,                                                      0158 00493000
*     PRX) UNRESTRICTED;                                           0158 00494000
*                                                                  0158 00495000
*/*   ? IRACTLEP ENN(PR5)                                            */ 00496000
*                                                                  0159 00497000
*   GEN CODE EXIT NOSEQFLOW;                                       0159 00498000
*                                  /*                                   00499000
         LM    @00,@14,000+000(@13)    RELOAD INVOKING RTNE REGS        00500000
         BR    RTNREG                  RETURN TO INVOKER                00501000
*                                                                  0160 00502000
*/********************************************************************/ 00503000
*/*                                                                  */ 00504000
*/* ENTRY POINT NAME = IRARMMS2                                      */ 00505000
*/*                                                                  */ 00506000
*/* DESCRIPTIVE NAME = REAL PAGE SHORTAGE PREVENTION                 */ 00507000
*/*                                                                  */ 00508000
*/* FUNCTION = IF A REAL PAGE SHORTAGE EXISTS (AVQLOW - LEVELS 1,    */ 00509000
*/*            2,OR 3) MS2 WILL REQUEST INVOCATION OF PAGE           */ 00510000
*/*            REPLACEMENT FORCE STEAL ROUTINE IE INVOKE PR5.        */ 00511000
*/*            WHEN A PAGEABLE FRAME SHORTAGE EXISTS (AVQLOW LEV 4)  */ 00512000
*/*            THE NUMBER OF  FIXED FRAMES IN THE SYSTEM EXCEEDS     */ 00513000
*/*            A THRESHOLD. MS2 WILL INFORM THE OPERATOR AND SWAP    */ 00514000
*/*            OUT THOSE USERS WHICH HAVE                            */ 00515000
*/*            THE GREATEST NUMBER OF FIXED PAGES .                  */ 00516000
*/*                                                                  */ 00517000
*/* CALLER = IRARMCTL - SRM CONTROL MODULE                           */ 00518000
*/*            ALGORITHM REQUEST PROCESSOR                           */ 00519000
*/*                                                                  */ 00520000
*/* INPUT = R2 = RMCT ADDRESS                                        */ 00521000
*/*         R3 = RRPA ADDRESS                                        */ 00522000
*/*                                                                  */ 00523000
*/* OUTPUT = NONE                                                    */ 00524000
*/*                                                                  */ 00525000
*/********************************************************************/ 00526000
*/*IRARMMS2: CHART (AMODE,SEQ,AREF)                                  */ 00527000
*/* HEADER                                                         0160 00528000
*/* AUG 8,1975                                   IRARMMS2-         0160 00529000
*/* AVQLOW PROCESSOR                                                 */ 00530000
*/*IRARMMS2: E INVOKED BY HAVING REACHED AVQLOW                      */ 00531000
*/* D (NO,%A,YES,) AVQLOW LEV 1,2,3 ?                                */ 00532000
*/* P CALC NUMBER OF FRAMES NEEDED AND SAVE IN MCVFRCNT              */ 00533000
*/* P INCREMENT COUNT OF ENTRIES TO MS2 - MCVAVQC                    */ 00534000
*/* S IRARMPR5: GO STEAL OLDEST PAGES                                */ 00535000
*/* P RESET PR1 INVOCATION INTERVAL TO 1 SEC                         */ 00536000
*/*%A: D (NO,%B,YES,) AVQLOW LEVEL 4 OR RECURSION ?                  */ 00537000
*/* N PAGEABLE STORAGE SHORTAGE CONDITION                            */ 00538000
*/* D (YES,%A1,NO,) SHORTAGE STILL EXISTS ?                          */ 00539000
*/* D (NO,%A2,YES,) NEED SHORTAGE RELIEVED MSG ?                     */ 00540000
*/* S IRARMI09: ISSUE SHORTAGE RELIEVED MESSAGE                      */ 00541000
*/* P RESET SHORTAGE FLAGS                                           */ 00542000
*/*%A2: P OBTAIN OUCB FROM QUEUES                                    */ 00543000
*/* N THE IN, OUT AND WAIT QUEUES ARE SEARCHED                       */ 00544000
*/* D (NO,%A3,YES,) THIS USR SWAPPED OR DELAYED  ?                   */ 00545000
*/* P RESET OUCB FLAGS                                               */ 00546000
*/* S IRARMRPS: PUT USER ON OUT QUEUE                                */ 00547000
*/* S IRARMWM3: CALCULATE NEW WM RECOMMENDATION                      */ 00548000
*/*%A3: D (NO,%A2,YES,) SEARCHED ALL QUEUES ?                        */ 00549000
*/* P (,%B) RESET MS2 INDICATORS                                     */ 00550000
*/*%A1: D (NO,%A5,YES,) LEVEL 1 MSG ISSUED ?                         */ 00551000
*/* D (NO,%A6,YES,) IS SHORTAGE CRITICAL ?                           */ 00552000
*/* D (YES,%A6,NO,) WAS CRITICAL SHORTAGE MSG ISSUED ?               */ 00553000
*/* S IRARMI09: ISSUE CRITICAL SHORTAGE MESSAGE                      */ 00554000
*/*%A7: D (NO,%A6,YES,) ANY SWAPPABLE USRS IN CORE ?                 */ 00555000
*/* P FIND USR WITH HIGHEST FIX RATE AND SET MIN MPL TARGETS         */ 00556000
*/* S IRARMCSO: INVOKE SWAP OUT FOR THAT USER                        */ 00557000
*/* P SET SWAP REASON CODE AND SWAP INDICATORS                       */ 00558000
*/* S IRARMI09: ISSUE HEAVY USER MESSAGE                             */ 00559000
*/*%A6: S IRARMMS2: REQUEST MS2 TO EXEC AGAIN                        */ 00560000
*/*%B: R RETURN TO CALLER                                            */ 00561000
*/*%A5: S (,%A7) IRARMI09: ISSUE SHORTAGE MESSAGE                    */ 00562000
*/*IRARMMS2: END                                                     */ 00563000
*/*   ? IRACTLEP EPN(MS2)                                            */ 00564000
*                                                                  0160 00565000
*   DCL                                                            0160 00566000
*     IRARMMS2 ENTRY INT;                                          0160 00567000
*   GEN CODE REFS(RRPAEPA) DEFS(IRARMMS2) NOEXIT SEQFLOW;          0161 00568000
*                                  /*                                   00569000
         ENTRY IRARMMS2                                                 00570000
IRARMMS2 DS    0H                                                       00571000
         STM   @00,@14,000+000(@13)    SAVE INVOKING RTNE REGS          00572000
         ST    @01,RRPAEPA(,RRPAPTR)   INDICATE NEW CURRENT RMEP        00573000
         LA    @12,IRARMMS2-@PSTART    DISPLACEMENT TO MODULE BASE      00574000
         LCR   @12,@12                 NEGATIVE FOR SUBTRACT            00575000
         ALR   @12,@15                 SETUP MODULE ADDRESSABILITY      00576000
*   IF MCTAVQ1='1'B THEN            /* RUN ALGORITHM ONLY IF REAL  0162 00577000
*                                      PAGE SHORTAGE EXISTS  @Z40BPSS*/ 00578000
         TM    MCTAVQ1(RMCTPTR),B'00100000'                        0162 00579000
         BNO   @RF00162                                            0162 00580000
*     DO;                           /* CALCULATE NUMBER OF FRAMES  0163 00581000
*                                      NEEDED                @Z40BPSS*/ 00582000
*       MCVFRCNT=MAX(PVTAFCOK-PVTAFC+MCCPLUS,I0);/* # PAGES  @Z40BPSS*/ 00583000
         L     @07,CVTPTR                                          0164 00584000
         L     @07,PVTPTR(,@07)                                    0164 00585000
         LH    @15,PVTAFCOK(,@07)                                  0164 00586000
         SH    @15,PVTAFC(,@07)                                    0164 00587000
         AH    @15,MCCPLUS(,RMCTPTR)                               0164 00588000
         SLR   @07,@07                                             0164 00589000
         CR    @15,@07                                             0164 00590000
         BNL   *+6                                                      00591000
         LR    @15,@07                                             0164 00592000
         STH   @15,MCVFRCNT(,RMCTPTR)                              0164 00593000
*       MCVAVQC=MCVAVQC+I1;         /* COUNT OF ENTRIES TO MS2     0165 00594000
*                                                            @Z40BPSS*/ 00595000
*                                                                  0165 00596000
         LA    @07,1                                               0165 00597000
         AL    @07,MCVAVQC(,RMCTPTR)                               0165 00598000
         ST    @07,MCVAVQC(,RMCTPTR)                               0165 00599000
*       /*************************************************************/ 00600000
*       /*                                                           */ 00601000
*       /* ? IRACTLCL EPN(PR5)                                       */ 00602000
*       /*                                                           */ 00603000
*       /*************************************************************/ 00604000
*                                                                  0166 00605000
*       DO;                                                        0166 00606000
*         R1=ADDR(RMEPBPR5);        /* PR5 REQUEST IS PARAM          */ 00607000
         LA    R1,RMEPBPR5(,RMCTPTR)                               0167 00608000
*         CALL RMSBCRL->IRARMRTN;   /* ALGRTHM SCH FUNCT             */ 00609000
         L     @15,RMSBCRL(,RMCTPTR)                               0168 00610000
         BALR  @14,@15                                             0168 00611000
*       END;                        /* GO STEAL NECESSARY FRAMES   0169 00612000
*                                                            @Z40BPSS*/ 00613000
*       IF FIRSTIME='1'B THEN                                      0170 00614000
         TM    FIRSTIME,B'10000000'                                0170 00615000
         BNO   @RF00170                                            0170 00616000
*         DO;                       /* NEED TO RESTORE RMEPINT     0171 00617000
*                                                            @ZM43064*/ 00618000
*           RESPECIFY                                              0172 00619000
*             RMEP BASED(ADDR(RMEPBPR1));/* PR1 RMEP         @ZM43064*/ 00620000
*           RMEPINT=MCCPR1IN;       /* RESET PR1 INVOCATION INTERVAL    00621000
*                                                            @ZM43064*/ 00622000
         L     @07,MCCPR1IN(,RMCTPTR)                              0173 00623000
         ST    @07,RMEPINT+1384(,RMCTPTR)                          0173 00624000
*           RESPECIFY                                              0174 00625000
*             RMEP BASED(RMEPPTR);  /*                       @ZM43064*/ 00626000
*         END;                      /* END OF PR1 RMEPINT RESTORE  0175 00627000
*                                                            @ZM43064*/ 00628000
*/*  REQUEST MS2 TO BE INVOKED AT NEXT ENTRY TO THE SYSTEM RESOURCES */ 00629000
*/*  MANAGER UNTIL THE REAL PAGE SHORTAGE IS RELIEVED.               */ 00630000
*                                                                  0176 00631000
*       /*************************************************************/ 00632000
*       /*                                                           */ 00633000
*       /* ? IRACTLCL EPN(MS2)                                       */ 00634000
*       /*                                                           */ 00635000
*       /*************************************************************/ 00636000
*                                                                  0176 00637000
*       DO;                                                        0176 00638000
@RF00170 DS    0H                                                  0177 00639000
*         R1=ADDR(RMEPBMS2);        /* MS2 REQUEST IS PARAM          */ 00640000
         LA    R1,RMEPBMS2(,RMCTPTR)                               0177 00641000
*         CALL RMSBCRL->IRARMRTN;   /* ALGRTHM SCH FUNCT             */ 00642000
         L     @15,RMSBCRL(,RMCTPTR)                               0178 00643000
         BALR  @14,@15                                             0178 00644000
*       END;                        /* REINVOKE MS2          @ZA13390*/ 00645000
*     END;                                                         0180 00646000
*                                                                  0180 00647000
*   /*****************************************************************/ 00648000
*   /*                                                               */ 00649000
*   /* FIX PAGE SHORTAGE PROCESSING                          @ZA01572*/ 00650000
*   /*                                                               */ 00651000
*   /*****************************************************************/ 00652000
*                                                                  0181 00653000
*   IF MCTFAVQ='1'B THEN                                           0181 00654000
@RF00162 TM    MCTFAVQ(RMCTPTR),B'00010000'                        0181 00655000
         BNO   @RF00181                                            0181 00656000
*     DO;                           /* LEVEL 4 AVQLOW OR REDRIVE   0182 00657000
*                                                            @ZA01572*/ 00658000
*       IF PVTCNTFX>=PVTMAXFX THEN                                 0183 00659000
         L     @07,CVTPTR                                          0183 00660000
         L     @07,PVTPTR(,@07)                                    0183 00661000
         LH    @15,PVTCNTFX(,@07)                                  0183 00662000
         CH    @15,PVTMAXFX(,@07)                                  0183 00663000
         BL    @RF00183                                            0183 00664000
*         DO;                       /* SHORTAGE EXISTS ?     @ZA01572*/ 00665000
*                                                                  0184 00666000
*           /*********************************************************/ 00667000
*           /*                                                       */ 00668000
*           /* ISSUE SHORTAGE MESSAGE IF REQUIRED            @ZA01572*/ 00669000
*           /*                                                       */ 00670000
*           /*********************************************************/ 00671000
*                                                                  0185 00672000
*           IF MCTFX1='0'B THEN                                    0185 00673000
         TM    MCTFX1(RMCTPTR),B'00000010'                         0185 00674000
         BNZ   @RF00185                                            0185 00675000
*             DO;                   /* SHORTAGE MSG BEEN ISSUED ?  0186 00676000
*                                                            @ZA01572*/ 00677000
*               MSGPTR=MCCMS400;    /* PTR TO SHORTAGE MSG   @ZA01572*/ 00678000
*                                                                  0187 00679000
         L     MSGPTR,MCCMS400(,RMCTPTR)                           0187 00680000
*               /*****************************************************/ 00681000
*               /*                                                   */ 00682000
*               /* ? IRACTLCL EPN(I09)                               */ 00683000
*               /*                                                   */ 00684000
*               /*****************************************************/ 00685000
*                                                                  0188 00686000
*               CALL RMSBI09->IRARMRTN;/* INVOKE I09 SUBRTN          */ 00687000
*                                                                  0188 00688000
         L     @15,RMSBI09(,RMCTPTR)                               0188 00689000
         BALR  @14,@15                                             0188 00690000
*               /*****************************************************/ 00691000
*               /*                                                   */ 00692000
*               /* ISSUE MSG                                 @ZA01572*/ 00693000
*               /*                                                   */ 00694000
*               /*****************************************************/ 00695000
*                                                                  0189 00696000
*               MCTFX1='1'B;        /* INDICATE MSG ISSUED   @ZA01572*/ 00697000
         OI    MCTFX1(RMCTPTR),B'00000010'                         0189 00698000
*             END;                  /*                       @ZA01572*/ 00699000
*           ELSE                                                   0191 00700000
*             DO;                   /* SHORTAGE MSG HAS BEEN ISSUED     00701000
*                                                            @ZA01572*/ 00702000
         B     @RC00185                                            0191 00703000
@RF00185 DS    0H                                                  0192 00704000
*               IF PVTCNTFX>=((PVTPOOL-PVTMAXFX)/I2)+PVTMAXFX THEN 0192 00705000
         L     @07,CVTPTR                                          0192 00706000
         L     @07,PVTPTR(,@07)                                    0192 00707000
         LH    @15,PVTMAXFX(,@07)                                  0192 00708000
         LH    @00,PVTPOOL(,@07)                                   0192 00709000
         SLR   @00,@15                                             0192 00710000
         SRDA  @00,32                                              0192 00711000
         D     @00,@CF00188                                        0192 00712000
         ALR   @01,@15                                             0192 00713000
         CH    @01,PVTCNTFX(,@07)                                  0192 00714000
         BH    @RF00192                                            0192 00715000
*                 DO;               /* IS SHORTAGE CRITICAL ?      0193 00716000
*                                                            @ZA01572*/ 00717000
*                                                                  0193 00718000
*                   /*************************************************/ 00719000
*                   /*                                               */ 00720000
*                   /* ISSUE CRITICAL SHORTAGE MESSAGE IF NECESSARY  */ 00721000
*                   /*                                       @ZA01572*/ 00722000
*                   /*                                               */ 00723000
*                   /*************************************************/ 00724000
*                                                                  0194 00725000
*                   IF MCTFX2='0'B THEN                            0194 00726000
         TM    MCTFX2(RMCTPTR),B'00000001'                         0194 00727000
         BNZ   @RF00194                                            0194 00728000
*                     DO;           /* CRITICAL MSG ISSUED   @ZA01572*/ 00729000
*                       MSGPTR=MCCMS401;/* PTR TO CRITICAL MSG     0196 00730000
*                                                            @ZA01572*/ 00731000
*                                                                  0196 00732000
         L     MSGPTR,MCCMS401(,RMCTPTR)                           0196 00733000
*                       /*********************************************/ 00734000
*                       /*                                           */ 00735000
*                       /* ? IRACTLCL EPN(I09)                       */ 00736000
*                       /*                                           */ 00737000
*                       /*********************************************/ 00738000
*                                                                  0197 00739000
*                       CALL RMSBI09->IRARMRTN;/* INVOKE I09 SUBRTN  */ 00740000
*                                                                  0197 00741000
         L     @15,RMSBI09(,RMCTPTR)                               0197 00742000
         BALR  @14,@15                                             0197 00743000
*                       /*********************************************/ 00744000
*                       /*                                           */ 00745000
*                       /* ISSUE MESSAGE                     @ZA01572*/ 00746000
*                       /*                                           */ 00747000
*                       /*********************************************/ 00748000
*                                                                  0198 00749000
*                       MCTFX2='1'B;/* INDICATE CRITICAL MSG ISSUED     00750000
*                                                            @ZA01572*/ 00751000
         OI    MCTFX2(RMCTPTR),B'00000001'                         0198 00752000
*                     END;          /*                       @ZA01572*/ 00753000
*                   ELSE                                           0200 00754000
*                     GOTO REINVOKE;/* GO REINVOKE MS2       @ZA01572*/ 00755000
*                 END;              /*                       @ZA01572*/ 00756000
*               ELSE                                               0202 00757000
*                 GOTO REINVOKE;    /* GO REINVOKE MS2       @ZA01572*/ 00758000
*             END;                  /*                       @ZA01572*/ 00759000
*                                                                  0203 00760000
*           /*********************************************************/ 00761000
*           /*                                                       */ 00762000
*           /* CALCULATE NUMBER OF SWAPPABLE IN USERS AND SET THE MPL*/ 00763000
*           /* TARGETS TO THEIR MINIMAL VALUE                @ZA01572*/ 00764000
*           /*                                                       */ 00765000
*           /*********************************************************/ 00766000
*                                                                  0204 00767000
*           INSWAPCT=I0;            /* INIT CNT OF SWAPPABLE USERS 0204 00768000
*                                                            @ZA01572*/ 00769000
@RC00185 SLR   INSWAPCT,INSWAPCT                                   0204 00770000
*           DO DMDTPTR=RMCTDMDT TO RMCTDMDE BY LENGTH(DMDT);/* LOOP     00771000
*                                      THRU DOMAIN TABLE     @ZA01572*/ 00772000
         L     DMDTPTR,RMCTDMDT(,RMCTPTR)                          0205 00773000
         B     @DE00205                                            0205 00774000
@DL00205 DS    0H                                                  0206 00775000
*             DMDTMPLT=DMDTLO;      /* SET MPL TARGETS TO MINIMUM  0206 00776000
*                                                            @ZA01572*/ 00777000
         SLR   @09,@09                                             0206 00778000
         IC    @09,DMDTLO(,DMDTPTR)                                0206 00779000
         STH   @09,DMDTMPLT(,DMDTPTR)                              0206 00780000
*             INSWAPCT=INSWAPCT+DMDTINCU;/* ADJUST COUNT OF IN CORE     00781000
*                                      SWAPPPABLE USERS      @ZA01572*/ 00782000
         AH    INSWAPCT,DMDTINCU(,DMDTPTR)                         0207 00783000
*           END;                    /*                       @ZA01572*/ 00784000
*                                                                  0208 00785000
         AL    DMDTPTR,@CF01137                                    0208 00786000
@DE00205 C     DMDTPTR,RMCTDMDE(,RMCTPTR)                          0208 00787000
         BNH   @DL00205                                            0208 00788000
*           /*********************************************************/ 00789000
*           /*                                                       */ 00790000
*           /* FIND THE HEAVIEST USER OF FIXED FRAMES        @ZA01572*/ 00791000
*           /*                                                       */ 00792000
*           /*********************************************************/ 00793000
*                                                                  0209 00794000
*           IF INSWAPCT^=I0 THEN                                   0209 00795000
         LTR   INSWAPCT,INSWAPCT                                   0209 00796000
         BZ    @RF00209                                            0209 00797000
*             DO;                   /* SWAPPABLES EXISTS     @ZA01572*/ 00798000
*               OUCBPTR=RMCTINQE;   /* EXAMINE IN QUEUE      @ZA01572*/ 00799000
         L     OUCBPTR,RMCTINQE(,RMCTPTR)                          0211 00800000
*               OUCBPTR=OUCBFWD;    /* LOOK AT 1ST OUCB ON QUE     0212 00801000
*                                                            @ZA01572*/ 00802000
         L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0212 00803000
*               HFIXCNT=I0;         /* INITIALIZE COMPARE VALUE    0213 00804000
*                                                            @ZA01572*/ 00805000
         SLR   HFIXCNT,HFIXCNT                                     0213 00806000
*               DO WHILE OUCBNAME='OUCB';/* LOOP THRU IN QUEUE     0214 00807000
*                                                            @ZA01572*/ 00808000
         B     @DE00214                                            0214 00809000
@DL00214 DS    0H                                                  0215 00810000
*                 IF OUCBOUT='0'B   /* IGNORE TRANSIENT USRS @ZA01572*/ 00811000
*                     &OUCBGOO='0'B /*                       @ZA01572*/ 00812000
*                     &OUCBGOI='0'B /*                       @ZA01572*/ 00813000
*                     &OUCBPVL='0'B /* AND PRIVILIGED USERS  @ZA01572*/ 00814000
*                     &OUCBBIB='0'B /* AND CANCELLED USERS   @ZA01572*/ 00815000
*                     &OUCBNSW='0'B /* AND NON SWAPPABLES    @ZA01572*/ 00816000
*                     &OUCBENQ='0'B /* AND ENQED USERS       @ZA01572*/ 00817000
*                     &OUCBGOB='0'B THEN                           0215 00818000
         TM    OUCBOUT(OUCBPTR),B'11000100'                        0215 00819000
         BNZ   @RF00215                                            0215 00820000
         TM    OUCBPVL(OUCBPTR),B'10100110'                        0215 00821000
         BNZ   @RF00215                                            0215 00822000
         TM    OUCBGOB(OUCBPTR),B'00100000'                        0215 00823000
         BNZ   @RF00215                                            0215 00824000
*                   DO;             /* EXAMINE FIX RATE      @ZA01572*/ 00825000
*                     ASCBPTR=OUCBASCB;/* ADDRESSABILITY TO ASCB   0217 00826000
*                                                            @ZA01572*/ 00827000
         L     ASCBPTR,OUCBASCB(,OUCBPTR)                          0217 00828000
*                     OUXBPTR=ASCBOUXB;/* ADDRESSABILITY TO OUXB   0218 00829000
*                                                            @ZA01572*/ 00830000
         L     OUXBPTR,ASCBOUXB(,ASCBPTR)                          0218 00831000
*                     IF RSMCNTFX-OUXBFIXC>HFIXCNT/* LARGER FIX DELTA   00832000
*                                                            @ZA01572*/ 00833000
*                       THEN                                       0219 00834000
         L     @01,RSMHDPTR(,ASCBPTR)                              0219 00835000
         LH    @15,RSMCNTFX(,@01)                                  0219 00836000
         SH    @15,OUXBFIXC(,OUXBPTR)                              0219 00837000
         CR    @15,HFIXCNT                                         0219 00838000
         BNH   @RF00219                                            0219 00839000
*                       DO;                                        0220 00840000
*                         HFIXCNT=RSMCNTFX-OUXBFIXC;/* SAVE HIGHEST     00841000
*                                      DELTA                 @ZA01572*/ 00842000
         LR    HFIXCNT,@15                                         0221 00843000
*                         HFIXOUCB=OUCBPTR;/* SAVE CORRESPONDING OUCB   00844000
*                                                            @ZA01572*/ 00845000
         ST    OUCBPTR,HFIXOUCB                                    0222 00846000
*                       END;        /*                       @ZA01572*/ 00847000
*                   END;            /*                       @ZA01572*/ 00848000
@RF00219 DS    0H                                                  0225 00849000
*                 OUCBPTR=OUCBFWD;  /* LOOK AT NEXT OUCB ON Q      0225 00850000
*                                                            @ZA01572*/ 00851000
@RF00215 L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0225 00852000
*               END;                /* END OF DO WHILE LOOP  @ZA01572*/ 00853000
*                                                                  0226 00854000
@DE00214 CLC   OUCBNAME(4,OUCBPTR),@CC02185                        0226 00855000
         BE    @DL00214                                            0226 00856000
*               /*****************************************************/ 00857000
*               /*                                                   */ 00858000
*               /* SWAP USER WITH HIGHEST FIX RATE DELTA OUT OF CORE */ 00859000
*               /*                                           @ZA01572*/ 00860000
*               /*                                                   */ 00861000
*               /*****************************************************/ 00862000
*                                                                  0227 00863000
*               IF HFIXCNT^=I0 THEN                                0227 00864000
         LTR   HFIXCNT,HFIXCNT                                     0227 00865000
         BZ    @RF00227                                            0227 00866000
*                 DO;               /* WE FOUND HIGHER DELTA @ZA01572*/ 00867000
*                   OUCBPTR=HFIXOUCB;/* THIS IS USR WITH HIGH DELTA     00868000
*                                                            @ZA01572*/ 00869000
         L     OUCBPTR,HFIXOUCB                                    0229 00870000
*                   ASCBPTR=OUCBASCB;/* ADDRESSIBILITY TO ASCB     0230 00871000
*                                                            @ZA01572*/ 00872000
*                                                                  0230 00873000
         L     ASCBPTR,OUCBASCB(,OUCBPTR)                          0230 00874000
*                   /*************************************************/ 00875000
*                   /*                                               */ 00876000
*                   /* ? IRACTLCL EPN(CSO)                           */ 00877000
*                   /*                                               */ 00878000
*                   /*************************************************/ 00879000
*                                                                  0231 00880000
*                   DO;                                            0231 00881000
*                     R1=ADDR(RMEPBCSO);/* CSO REQUEST IS PARAM      */ 00882000
         LA    R1,RMEPBCSO(,RMCTPTR)                               0232 00883000
*                     CALL RMSBCRY->IRARMRTN;/* ACTION INVK FUNCT    */ 00884000
         L     @15,RMSBCRY(,RMCTPTR)                               0233 00885000
         BALR  @14,@15                                             0233 00886000
*                   END;            /* SWAP THIS USER OUT    @ZA01572*/ 00887000
*                   IF RTNCOD=I0 THEN                              0235 00888000
         LTR   RTNCOD,RTNCOD                                       0235 00889000
         BNZ   @RF00235                                            0235 00890000
*                     DO;           /* SWAP WENT ALRIGHT     @ZA01572*/ 00891000
*                       OUCBSRC=SRCDRSSC;/* SET SWAP REASON CODE   0237 00892000
*                                                            @ZA01572*/ 00893000
         MVI   OUCBSRC(OUCBPTR),X'05'                              0237 00894000
*                       OUCBFXS='1'B;/* INDICATE FIX SHORTAGE SWAP 0238 00895000
*                                                            @ZA01572*/ 00896000
         OI    OUCBFXS(OUCBPTR),B'00000001'                        0238 00897000
*                     END;          /* END OF SUCCESSFUL SWAP LOOP 0239 00898000
*                                                            @ZA01572*/ 00899000
*                   MSGPTR=MCCMS403;/* POINT TO HEAVY USER MSG     0240 00900000
*                                                            @ZM43072*/ 00901000
@RF00235 L     MSGPTR,MCCMS403(,RMCTPTR)                           0240 00902000
*                   IF ASCBJBNI=I0 THEN                            0241 00903000
         L     @07,ASCBJBNI(,ASCBPTR)                              0241 00904000
         LTR   @07,@07                                             0241 00905000
         BNZ   @RF00241                                            0241 00906000
*                     RSMJOBN=JOBNS;/* PLACE JOBNAME IN MSG  @ZM43072*/ 00907000
         L     @07,ASCBJBNS(,ASCBPTR)                              0242 00908000
         MVC   RSMJOBN(8,MSGPTR),JOBNS(@07)                        0242 00909000
*                   ELSE                                           0243 00910000
*                     RSMJOBN=JOBNI;/* PLACE JOBNAME IN MSG  @ZM43072*/ 00911000
*                                                                  0243 00912000
         B     @RC00241                                            0243 00913000
@RF00241 L     @07,ASCBJBNI(,ASCBPTR)                              0243 00914000
         MVC   RSMJOBN(8,MSGPTR),JOBNI(@07)                        0243 00915000
*                   /*************************************************/ 00916000
*                   /*                                               */ 00917000
*                   /* ? IRACTLCL EPN(I09)                           */ 00918000
*                   /*                                               */ 00919000
*                   /*************************************************/ 00920000
*                                                                  0244 00921000
*                   CALL RMSBI09->IRARMRTN;/* INVOKE I09 SUBRTN      */ 00922000
@RC00241 L     @15,RMSBI09(,RMCTPTR)                               0244 00923000
         BALR  @14,@15                                             0244 00924000
*/*  INVOKE RECORD FUNCTION    @ZM43072                              */ 00925000
*                                                                  0245 00926000
*                 END;              /* END OF FOUND HIGHER DELTA LOOP   00927000
*                                                            @ZA01572*/ 00928000
*             END;                  /* END OF LOOP FOR SWAPPABLES  0246 00929000
*                                                            @ZA01572*/ 00930000
@RF00227 DS    0H                                                  0247 00931000
*REINVOKE:                                                         0247 00932000
*                                                                  0247 00933000
*           /*********************************************************/ 00934000
*           /*                                                       */ 00935000
*           /* ? IRACTLCL EPN(MS2)                                   */ 00936000
*           /*                                                       */ 00937000
*           /*********************************************************/ 00938000
*                                                                  0247 00939000
*           DO;                                                    0247 00940000
@RF00209 DS    0H                                                  0247 00941000
REINVOKE DS    0H                                                  0248 00942000
*             R1=ADDR(RMEPBMS2);    /* MS2 REQUEST IS PARAM          */ 00943000
         LA    R1,RMEPBMS2(,RMCTPTR)                               0248 00944000
*             CALL RMSBCRL->IRARMRTN;/* ALGRTHM SCH FUNCT            */ 00945000
         L     @15,RMSBCRL(,RMCTPTR)                               0249 00946000
         BALR  @14,@15                                             0249 00947000
*           END;                    /* REINVOKE MS2          @ZA01572*/ 00948000
*         END;                      /* END OF SHORTAGE STILL EXISTS     00949000
*                                                            @ZA01572*/ 00950000
*       ELSE                                                       0252 00951000
*         DO;                       /* SHORTAGE DOESNT EXIST @ZA01572*/ 00952000
*                                                                  0252 00953000
         B     @RC00183                                            0252 00954000
@RF00183 DS    0H                                                  0253 00955000
*           /*********************************************************/ 00956000
*           /*                                                       */ 00957000
*           /* ISSUE SHORTAGE RELIEVED MESSAGE IF NECESSARY  @ZA01572*/ 00958000
*           /*                                                       */ 00959000
*           /*********************************************************/ 00960000
*                                                                  0253 00961000
*           IF PVTCNTFX<=PVTFIXOK THEN                             0253 00962000
         L     @07,CVTPTR                                          0253 00963000
         L     @07,PVTPTR(,@07)                                    0253 00964000
         LH    @15,PVTCNTFX(,@07)                                  0253 00965000
         CH    @15,PVTFIXOK(,@07)                                  0253 00966000
         BH    @RF00253                                            0253 00967000
*             DO;                   /* BELOW OK THRESHOLD    @ZA01572*/ 00968000
*               IF MCTFX1='1'B|MCTFX2='1'B THEN                    0255 00969000
         TM    MCTFX1(RMCTPTR),B'00000011'                         0255 00970000
         BZ    @RF00255                                            0255 00971000
*                 DO;               /* NEED TO ISSUE SHORTAGE      0256 00972000
*                                      RELIEVED MSG          @ZA01572*/ 00973000
*                   MSGPTR=MCCMS402;/* PTR TO SHORTAGE REL MSG     0257 00974000
*                                                            @ZA01572*/ 00975000
*                                                                  0257 00976000
         L     MSGPTR,MCCMS402(,RMCTPTR)                           0257 00977000
*                   /*************************************************/ 00978000
*                   /*                                               */ 00979000
*                   /* ? IRACTLCL EPN(I09)                           */ 00980000
*                   /*                                               */ 00981000
*                   /*************************************************/ 00982000
*                                                                  0258 00983000
*                   CALL RMSBI09->IRARMRTN;/* INVOKE I09 SUBRTN      */ 00984000
         L     @15,RMSBI09(,RMCTPTR)                               0258 00985000
         BALR  @14,@15                                             0258 00986000
*/* ISSUE MSG                 @ZA01572                               */ 00987000
*                                                                  0259 00988000
*                   MCTFX1='0'B;    /* TURN OFF SHORTAGE FLAG      0259 00989000
*                                                            @ZA01572*/ 00990000
*                   MCTFX2='0'B;    /* TURN OFF SHORTAGE FLAG      0260 00991000
*                                                            @ZA01572*/ 00992000
         NI    MCTFX1(RMCTPTR),B'11111100'                         0260 00993000
*                 END;              /* END OF MSG NEEDED LOOP      0261 00994000
*                                                            @ZA01572*/ 00995000
*                                                                  0261 00996000
*               /*****************************************************/ 00997000
*               /*                                                   */ 00998000
*               /* FIND USRS SWAPPED DUE TO SHORTAGE         @ZA01572*/ 00999000
*               /*                                                   */ 01000000
*               /*****************************************************/ 01001000
*                                                                  0262 01002000
*               DO FIXINDEX=ADDR(RMCTWTQE) TO ADDR(RMCTINQE) BY LENGTH( 01003000
*                     RMCTWTQE);    /* LOOP THRU OUCB QUEUES @ZM43072*/ 01004000
@RF00255 LA    FIXINDEX,RMCTWTQE(,RMCTPTR)                         0262 01005000
         B     @DE00262                                            0262 01006000
@DL00262 DS    0H                                                  0263 01007000
*                 OUCBPTR=FIXQE;    /* OBTAIN QUEUE HEADER   @ZA01572*/ 01008000
         L     OUCBPTR,FIXQE(,FIXINDEX)                            0263 01009000
*                 OUCBPTR=OUCBFWD;  /* OBTAIN FIRST OUCB ON QUEUE  0264 01010000
*                                                            @ZA01572*/ 01011000
         L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0264 01012000
*                 DO WHILE OUCBPTR^=FIXQE;/* KEEP LOOPING    @ZM43072*/ 01013000
         B     @DE00265                                            0265 01014000
@DL00265 DS    0H                                                  0266 01015000
*                   DO WHILE OUCBNAME='OUCB'&OUCBFXS='0'B/*  @ZM43072*/ 01016000
*                         &OUCBJSFS='0'B;                          0266 01017000
         B     @DE00266                                            0266 01018000
@DL00266 DS    0H                                                  0267 01019000
*                     OUCBPTR=OUCBFWD;/* ON TO NEXT OUCB ON QUE    0267 01020000
*                                                            @ZA01572*/ 01021000
         L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0267 01022000
*                   END;                                           0268 01023000
@DE00266 CLC   OUCBNAME(4,OUCBPTR),@CC02185                        0268 01024000
         BNE   @DC00266                                            0268 01025000
         TM    OUCBFXS(OUCBPTR),B'00000001'                        0268 01026000
         BNZ   @DC00266                                            0268 01027000
         TM    OUCBJSFS(OUCBPTR),B'10000000'                       0268 01028000
         BZ    @DL00266                                            0268 01029000
@DC00266 DS    0H                                                  0269 01030000
*                   IF OUCBPTR^=FIXQE THEN                         0269 01031000
         C     OUCBPTR,FIXQE(,FIXINDEX)                            0269 01032000
         BE    @RF00269                                            0269 01033000
*                     DO;           /* DID WE FIND ONE       @ZA01572*/ 01034000
*                       OUCBFXS='0'B;/* RESET HEAVY USAGE FLAG     0271 01035000
*                                                            @ZA01572*/ 01036000
         NI    OUCBFXS(OUCBPTR),B'11111110'                        0271 01037000
*                       OUCBJSFS='0'B;/* RESET JOB SELECT DELAYED  0272 01038000
*                                                            @ZM43072*/ 01039000
         NI    OUCBJSFS(OUCBPTR),B'01111111'                       0272 01040000
*                       FIXOUCB=OUCBFWD;/* SAVE FORWARD POINTER    0273 01041000
*                                                            @ZM43072*/ 01042000
         L     FIXOUCB,OUCBFWD(,OUCBPTR)                           0273 01043000
*                       ASCBPTR=OUCBASCB;/* ADDRESSIBILITY TO ASCB 0274 01044000
*                                                            @ZA01572*/ 01045000
         L     ASCBPTR,OUCBASCB(,OUCBPTR)                          0274 01046000
*                       OUCBOFF='0'B;/* REMOVE FROM WAIT QUEUE     0275 01047000
*                                                            @ZA01572*/ 01048000
*                       OUCBGOB='1'B;/* SET Q TRANSITION FLAG      0276 01049000
*                                                            @ZA01572*/ 01050000
*                                                                  0276 01051000
         OI    OUCBGOB(OUCBPTR),B'00100000'                        0276 01052000
         NI    OUCBOFF(OUCBPTR),B'11110111'                        0276 01053000
*                       /*********************************************/ 01054000
*                       /*                                           */ 01055000
*                       /* ? IRACTLCL EPN(RPS)                       */ 01056000
*                       /*                                           */ 01057000
*                       /*********************************************/ 01058000
*                                                                  0277 01059000
*                       DO;                                        0277 01060000
*                         R1=ADDR(RMEPBRPS);/* RPS REQUEST IS PARAM  */ 01061000
         LA    R1,RMEPBRPS(,RMCTPTR)                               0278 01062000
*                         CALL RMSBCRN->IRARMRTN;/* ACTION INVK FUNCT*/ 01063000
         L     @15,RMSBCRN(,RMCTPTR)                               0279 01064000
         BALR  @14,@15                                             0279 01065000
*                       END;        /* INVOKE RPS            @ZA01572*/ 01066000
*                                                                  0280 01067000
*                       /*********************************************/ 01068000
*                       /*                                           */ 01069000
*                       /* ? IRACTLCL EPN(WM3)                       */ 01070000
*                       /*                                           */ 01071000
*                       /*********************************************/ 01072000
*                                                                  0281 01073000
*                       CALL EPSTWM3->IRARMRTN;/* INVOKE WM3 ACTION  */ 01074000
         L     @15,EPSTWM3(,RMCTPTR)                               0281 01075000
         BALR  @14,@15                                             0281 01076000
*/*  RECALCULATE WMR         @ZA01572                                */ 01077000
*                                                                  0282 01078000
*                       OUCBPTR=FIXOUCB;/* LOOK AT NEXT USER @ZM43072*/ 01079000
         LR    OUCBPTR,FIXOUCB                                     0282 01080000
*                     END;          /* END OF SUCCESSFUL FIND LOOP 0283 01081000
*                                                            @ZA01572*/ 01082000
*                 END;              /* END OF THIS QUEUE SEARCH    0284 01083000
*                                                            @ZM43072*/ 01084000
@RF00269 DS    0H                                                  0284 01085000
@DE00265 C     OUCBPTR,FIXQE(,FIXINDEX)                            0284 01086000
         BNE   @DL00265                                            0284 01087000
*               END;                /* END OF LOOPING THRU THE QUEUES   01088000
*                                                            @ZA01572*/ 01089000
         AL    FIXINDEX,@CF00050                                   0285 01090000
@DE00262 LA    @15,RMCTINQE(,RMCTPTR)                              0285 01091000
         CR    FIXINDEX,@15                                        0285 01092000
         BNH   @DL00262                                            0285 01093000
*               MCTFAVQ='0'B;       /* TURN OFF MS2 INDICATOR      0286 01094000
*                                                            @ZA01572*/ 01095000
         NI    MCTFAVQ(RMCTPTR),B'11101111'                        0286 01096000
*             END;                  /*                       @ZA01572*/ 01097000
*           ELSE                    /* ? IRACTLCL EPN(MS2)           */ 01098000
*             DO;                                                  0288 01099000
         B     @RC00253                                            0288 01100000
@RF00253 DS    0H                                                  0289 01101000
*               R1=ADDR(RMEPBMS2);  /* MS2 REQUEST IS PARAM          */ 01102000
         LA    R1,RMEPBMS2(,RMCTPTR)                               0289 01103000
*               CALL RMSBCRL->IRARMRTN;/* ALGRTHM SCH FUNCT          */ 01104000
         L     @15,RMSBCRL(,RMCTPTR)                               0290 01105000
         BALR  @14,@15                                             0290 01106000
*             END;                  /* REINVOKE MS2          @ZA01572*/ 01107000
*         END;                      /*                       @ZA01572*/ 01108000
@RC00253 DS    0H                                                  0293 01109000
*     END;                          /* END OF FIX PAGE SHORTAGE    0293 01110000
*                                      PROCESSING            @ZA01572*/ 01111000
@RC00183 DS    0H                                                  0294 01112000
*/*   ? IRACTLEP ENN(MS2)                                            */ 01113000
*                                                                  0294 01114000
*   GEN CODE EXIT NOSEQFLOW;                                       0294 01115000
@RF00181 DS    0H                                                  0294 01116000
*                                  /*                                   01117000
         LM    @00,@14,000+000(@13)    RELOAD INVOKING RTNE REGS        01118000
         BR    RTNREG                  RETURN TO INVOKER                01119000
*                                                                  0295 01120000
*/********************************************************************/ 01121000
*/*                                                                  */ 01122000
*/* ENTRY POINT NAME = IRARMMS6                                      */ 01123000
*/*                                                                  */ 01124000
*/* DESCRIPTIVE NAME = MAIN STORAGE OCCUPANCY LONG WAIT              */ 01125000
*/*                    DETECTION                                     */ 01126000
*/*                                                                  */ 01127000
*/* FUNCTION = DISCOVER USERS WHICH HAVE GONE INTO LONG WAIT         */ 01128000
*/*            WITHOUT NOTIFYING THE SYSTEM RESOURCES MANAGER.       */ 01129000
*/*            IF SUCH A USER IS SWAPPPABLE SWAP THE USER OUT.       */ 01130000
*/*                                                                  */ 01131000
*/* CALLER = IRARMCTL - SRM CONTROL MODULE                           */ 01132000
*/*            TIME QUEUE PROCESSOR                                  */ 01133000
*/*                                                                  */ 01134000
*/* INPUT = R2 = RMCT ADDRESS                                        */ 01135000
*/*         R3 = RRPA ADDRESS                                        */ 01136000
*/*                                                                  */ 01137000
*/* OUTPUT = NONE                                                    */ 01138000
*/*                                                                  */ 01139000
*/********************************************************************/ 01140000
*/*IRARMMS6: CHART (AMODE,AREF,SEQ)                                  */ 01141000
*/* HEADER                                                         0295 01142000
*/* AUG 8,1975                                    IRARMMS6-        0295 01143000
*/* MAIN STORAGE OCCUPANCY LONG WAIT DETECTION                       */ 01144000
*/*IRARMMS6: E TIME DRIVEN ROUTINE                                   */ 01145000
*/* D (YES,%A,NO,) CPU 100 PERCENT UTILIZED ?                        */ 01146000
*/*%B: P OBTAIN OUCB ADDR FROM INQUE                                 */ 01147000
*/* D (NO,%D,YES,) USER IN CORE AND SWAPPABLE ?                      */ 01148000
*/* P OBTAIN ADDRESSIBILITY TO ASCB AND OUXB                         */ 01149000
*/* D (YES,%E,NO,) DID USER EXEC SINCE LAST MS6?                     */ 01150000
*/* S IRARMCSO: REQUEST SWAP OUT                                     */ 01151000
*/* P SET SWAP REASON CODE IN OUCB                                   */ 01152000
*/* P INDICATED MSO DETECTED LONG WAIT -OUCBMWT                      */ 01153000
*/*%E: P SAVE MS6 INVOCATION TIME IN OUXBMET                         */ 01154000
*/*%D: D (NO,%B,YES,) AT END OF IN QUEUE ?                           */ 01155000
*/*%A: R RETURN TO CALLER                                            */ 01156000
*/*IRARMMS6: END                                                     */ 01157000
*                                                                  0295 01158000
*   /*****************************************************************/ 01159000
*   /*                                                               */ 01160000
*   /* ? IRACTLEP EPN(MS6)                                           */ 01161000
*   /*                                                               */ 01162000
*   /*****************************************************************/ 01163000
*                                                                  0295 01164000
*   DCL                                                            0295 01165000
*     IRARMMS6 ENTRY INT;                                          0295 01166000
*   GEN CODE REFS(RRPAEPA) DEFS(IRARMMS6) NOEXIT SEQFLOW;          0296 01167000
*                                                                  0296 01168000
*                                  /*                                   01169000
         ENTRY IRARMMS6                                                 01170000
IRARMMS6 DS    0H                                                       01171000
         STM   @00,@14,000+000(@13)    SAVE INVOKING RTNE REGS          01172000
         ST    @01,RRPAEPA(,RRPAPTR)   INDICATE NEW CURRENT RMEP        01173000
         LA    @12,IRARMMS6-@PSTART    DISPLACEMENT TO MODULE BASE      01174000
         LCR   @12,@12                 NEGATIVE FOR SUBTRACT            01175000
         ALR   @12,@15                 SETUP MODULE ADDRESSABILITY      01176000
*/*                                                                  */ 01177000
*/*      DETERMINE WHETHER EACH USER ON IN QUEUE HAS EXECUTED        */ 01178000
*/*      SINCE LAST MS6 INVOCATION.  IF A USER HAS NOT EXECUTED,     */ 01179000
*/*      AND THE USER IS SWAPPABLE SWAP HIM OUT.             @Z40BPSS*/ 01180000
*/*                                                                  */ 01181000
*                                                                  0297 01182000
*   IF CCVUTILP<=I100 THEN          /* DONT CHECK IF CPU > 100     0297 01183000
*                                                            @Z40BPSS*/ 01184000
         LH    @07,CCVUTILP(,RMCTPTR)                              0297 01185000
         C     @07,@CF02150                                        0297 01186000
         BH    @RF00297                                            0297 01187000
*     DO;                           /* PERCENT UTILIZED              */ 01188000
*       OUCBPTR=RMCTINQE;           /* SEARCH IN QUEUE               */ 01189000
         L     OUCBPTR,RMCTINQE(,RMCTPTR)                          0299 01190000
*       OUCBPTR=OUCBFWD;            /* START WITH FIRST USER         */ 01191000
         L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0300 01192000
*       DO WHILE OUCBNAME='OUCB';   /* GO TO END OF QUEUE            */ 01193000
         B     @DE00301                                            0301 01194000
@DL00301 DS    0H                                                  0302 01195000
*         IF OUCBOUT='0'B           /* IGNORE USERS IN TRANSITION    */ 01196000
*             &OUCBGOO='0'B         /*                               */ 01197000
*             &OUCBGOI='0'B         /*                               */ 01198000
*             &OUCBGOB='0'B         /*                               */ 01199000
*             &OUCBNSW='0'B THEN    /* AND USER IS SWAPPABLE @Z40BPSS*/ 01200000
         TM    OUCBOUT(OUCBPTR),B'11100100'                        0302 01201000
         BNZ   @RF00302                                            0302 01202000
         TM    OUCBNSW(OUCBPTR),B'10000000'                        0302 01203000
         BNZ   @RF00302                                            0302 01204000
*           DO;                     /*                               */ 01205000
*             ASCBPTR=OUCBASCB;     /* ESTABLISH ASCB ADDRESSIBILITY */ 01206000
         L     ASCBPTR,OUCBASCB(,OUCBPTR)                          0304 01207000
*             OUXBPTR=ASCBOUXB;     /* ESTABLISH OUXB ADDRESSIBILTIY */ 01208000
         L     OUXBPTR,ASCBOUXB(,ASCBPTR)                          0305 01209000
*             RESPECIFY                                            0306 01210000
*              (R1,                                                0306 01211000
*               RTNCOD) RESTRICTED;                                0306 01212000
*             IF OUXBMET=MSASCBET   /* IF USER HAS NOT EXECUTED      */ 01213000
*                 &ASCBTCBS=I0 THEN                                0307 01214000
         CLC   OUXBMET(4,OUXBPTR),MSASCBET(ASCBPTR)                0307 01215000
         BNE   @RF00307                                            0307 01216000
         L     @14,ASCBTCBS(,ASCBPTR)                              0307 01217000
         LTR   @14,@14                                             0307 01218000
         BNZ   @RF00307                                            0307 01219000
*               DO;                 /* SINCE LAST MS6 INVOCATION     */ 01220000
*                                                                  0308 01221000
*                 /***************************************************/ 01222000
*                 /*                                                 */ 01223000
*                 /* ? IRACTLCL EPN(CSO)                             */ 01224000
*                 /*                                                 */ 01225000
*                 /***************************************************/ 01226000
*                                                                  0309 01227000
*                 DO;                                              0309 01228000
*                   R1=ADDR(RMEPBCSO);/* CSO REQUEST IS PARAM        */ 01229000
         LA    R1,RMEPBCSO(,RMCTPTR)                               0310 01230000
*                   CALL RMSBCRY->IRARMRTN;/* ACTION INVK FUNCT      */ 01231000
         L     @15,RMSBCRY(,RMCTPTR)                               0311 01232000
         BALR  @14,@15                                             0311 01233000
*                 END;                                             0312 01234000
*                 IF RTNCOD=I0 THEN                                0313 01235000
         LTR   RTNCOD,RTNCOD                                       0313 01236000
         BNZ   @RF00313                                            0313 01237000
*                   DO;             /* INDICATE MSO DETECTED         */ 01238000
*                     OUCBMWT='1'B; /* LONG WAIT                     */ 01239000
         OI    OUCBMWT(OUCBPTR),B'00000001'                        0315 01240000
*                     OUCBSRC=SRCDDWSC;/* SET SWAP REASON CODE     0316 01241000
*                                                            @Z40BPSS*/ 01242000
         MVI   OUCBSRC(OUCBPTR),X'06'                              0316 01243000
*                   END;            /*                               */ 01244000
*               END;                /*                       @Z40BPSS*/ 01245000
@RF00313 DS    0H                                                  0319 01246000
*             RESPECIFY                                            0319 01247000
*              (R1,                                                0319 01248000
*               RTNCOD) UNRESTRICTED;                              0319 01249000
@RF00307 DS    0H                                                  0320 01250000
*             OUXBMET=MSASCBET;     /* SET NEW EXEC TIME BASE      0320 01251000
*                                                            @Z40BPSS*/ 01252000
         MVC   OUXBMET(4,OUXBPTR),MSASCBET(ASCBPTR)                0320 01253000
*           END;                                                   0321 01254000
*         OUCBPTR=OUCBFWD;          /* LOOK AT NEXT USER     @Z40BPSS*/ 01255000
@RF00302 L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0322 01256000
*       END;                                                       0323 01257000
@DE00301 CLC   OUCBNAME(4,OUCBPTR),@CC02185                        0323 01258000
         BE    @DL00301                                            0323 01259000
*     END;                                                         0324 01260000
*                                                                  0324 01261000
*   /*****************************************************************/ 01262000
*   /*                                                               */ 01263000
*   /* ? IRACTLEP ENN(MS6)                                           */ 01264000
*   /*                                                               */ 01265000
*   /*****************************************************************/ 01266000
*                                                                  0325 01267000
*   GEN CODE EXIT NOSEQFLOW;                                       0325 01268000
@RF00297 DS    0H                                                  0325 01269000
*                                  /*                                   01270000
         LM    @00,@14,000+000(@13)    RELOAD INVOKING RTNE REGS        01271000
         BR    RTNREG                  RETURN TO INVOKER                01272000
*                                                                  0326 01273000
*/********************************************************************/ 01274000
*/*                                                                  */ 01275000
*/* ENTRY POINT NAME = IRARMASM                                      */ 01276000
*/*                                                                  */ 01277000
*/* DESCRIPTIVE NAME = AUXILIARY STORAGE SHORTAGE MONITORING         */ 01278000
*/*                                                                  */ 01279000
*/* FUNCTION = MONITOR EXTENT OF AUXILIARY STORAGE ALLOCATION.  IF   */ 01280000
*/*            AUX PAGES ARE IN SHORT SUPPLY INFORM OPERATOR AND     */ 01281000
*/*            DIRECT SWAPS OF USERS WHO ARE MOST RAPIDLY            */ 01282000
*/*            ACQUIRING AUX PAGES                                   */ 01283000
*/*                                                                  */ 01284000
*/* CALLER = IRARMCTL - SRM CONTROL MODULE                           */ 01285000
*/*            TIME QUEUE PROCESSOR                                  */ 01286000
*/*            ALGORITHM REQUEST PROCESSOR                           */ 01287000
*/*                                                                  */ 01288000
*/* INPUT = R2 = RMCT ADDRESS                                        */ 01289000
*/*         R3 = RRPA ADDRESS                                        */ 01290000
*/*                                                                  */ 01291000
*/* OUTPUT = NONE                                                    */ 01292000
*/*                                                                  */ 01293000
*/********************************************************************/ 01294000
*/*IRARMASM: CHART (AMODE,SEQ,AREF)                                  */ 01295000
*/* HEADER                                                         0326 01296000
*/* AUG 8,1975                                        IRARMASM-    0326 01297000
*/* AUXILLARY STORAGE SHORTAGE MONITORING                            */ 01298000
*/* IRARMASM: E A TIMED ALGORITM                                     */ 01299000
*/* P CALC RATIO OF ALLOCATED SLOTS TO TOTAL                         */ 01300000
*/* D  (YES,%A,NO,) SLOT SHORTAGE EXISTS ?                           */ 01301000
*/* D (NO,%B,YES,) PREVIOUS SLOT SHORTAGE EXISTED ?                  */ 01302000
*/* S IRARMI09: ISSUE SHORTAGE RELIEVED MESSAGE                      */ 01303000
*/* P RESET SHORTAGE FLAGS                                           */ 01304000
*/*%T: P FIND USERS SWAPPED OR DELAYED                               */ 01305000
*/* N THE WAIT, IN AND OUT QUEUES ARE SEARCHED                       */ 01306000
*/* P RESET AUX USAGE FLAGS OUCBAXS & OUCBJSAS                       */ 01307000
*/* S IRARMRPS: REQUEUE USER TO OUT QUEUE                            */ 01308000
*/* S IRARMWM3: CALCULATE NEW WM RECOMMENDATION                      */ 01309000
*/* D (NO,%T,YES,%B) ALL USERS FOUND                                 */ 01310000
*/*%A: D (YES,%B,NO,) SHORTAGE MSG ISSUED ?                          */ 01311000
*/* S IRARMI09: ISSUE SHORTAGE MESSAGE                               */ 01312000
*/* P SET 1ST LEVEL SHORTAGE INDICATOR                               */ 01313000
*/* P SET DOMAINS TO MINIMUM                                         */ 01314000
*/*%B: D (NO,%E,YES,)  SLOT SHORTAGE?                                */ 01315000
*/* D (YES,%E,NO,) ANY SWAPPABLE INCORE USERS ?                      */ 01316000
*/* P (UNSU,%I,SUCC,) FIND 1ST VALID USR SWAPPED DUE TO AUX SHORTAGE */ 01317000
*/* N THE WAIT, IN AND OUT QUEUES ARE SEARCHED                       */ 01318000
*/* P RESET HEAVY AUX USAGE FLAG OUCBAXS                             */ 01319000
*/* S IRARMRPS: REQUEUE USER TO OUT QUEUE                            */ 01320000
*/* S IRARMWM3: CALCULATE NEW WM RECOMMENDATION                      */ 01321000
*/*%I: D (NO,%J,YES,) 2ND LEVEL SHORTAGE EXISTS ?                    */ 01322000
*/* P SET CRITICAL AUX SHORTAGE BIT MCTASM2                          */ 01323000
*/* D (NO,%J,YES,) NEED TO OUTPUT MSG ?                              */ 01324000
*/* S IRARMI09: INFORM OPERATOR                                      */ 01325000
*/*%J: R RETURN TO CALLER                                            */ 01326000
*/*%E: D (NO,%I,YES,) SHORTAGE EXISTS ?                              */ 01327000
*/* D (NO,%I,YES,) INSWAPCT > 1 ?                                    */ 01328000
*/* P FIND HEAVIEST SLOT USER                                        */ 01329000
*/* S IRARMCSO: INVOKE SWAP OUT                                      */ 01330000
*/* P SET SWAP REASON CODE IN OUCB                                   */ 01331000
*/* P INITIALIZE OUCBAXS WITH REASON FOR THE SWAP                    */ 01332000
*/* S (,%I) IRARMI09: ISSUE HEAVY USER MSG                           */ 01333000
*/*IRARMASM: END                                                     */ 01334000
*/*   ? IRACTLEP EPN(ASM)                                            */ 01335000
*                                                                  0326 01336000
*   DCL                                                            0326 01337000
*     IRARMASM ENTRY INT;                                          0326 01338000
*   GEN CODE REFS(RRPAEPA) DEFS(IRARMASM) NOEXIT SEQFLOW;          0327 01339000
*                                  /*                                   01340000
         ENTRY IRARMASM                                                 01341000
IRARMASM DS    0H                                                       01342000
         STM   @00,@14,000+000(@13)    SAVE INVOKING RTNE REGS          01343000
         ST    @01,RRPAEPA(,RRPAPTR)   INDICATE NEW CURRENT RMEP        01344000
         LA    @12,IRARMASM-@PSTART    DISPLACEMENT TO MODULE BASE      01345000
         LCR   @12,@12                 NEGATIVE FOR SUBTRACT            01346000
         ALR   @12,@15                 SETUP MODULE ADDRESSABILITY      01347000
*   RESPECIFY                                                      0328 01348000
*     MSGPTR RESTRICTED;                                           0328 01349000
*                                                                  0328 01350000
*   /*****************************************************************/ 01351000
*   /*                                                               */ 01352000
*   /* COMPUTE RATIO OF ALLOCATED SLOTS TO TOTAL SLOTS               */ 01353000
*   /*                                                               */ 01354000
*   /*****************************************************************/ 01355000
*                                                                  0329 01356000
*   ASMRATIO=                       /* RATIO EQUALS                  */ 01357000
*       (ASMVSC                     /* SUM OF ALLOCATED SLOTS        */ 01358000
*       +ASMNVSC                    /*                               */ 01359000
*       +ASMERRS)                   /* AND SLOTS IN ERROR            */ 01360000
*       *I100                       /* TIMES 100 FOR PERCENT         */ 01361000
*       /ASMSLOTS;                  /* DIVIDED BY TOTAL SLOTS        */ 01362000
*                                                                  0329 01363000
         L     @07,CVTPTR                                          0329 01364000
         L     @07,ASMVTPTR(,@07)                                  0329 01365000
         L     ASMRATIO,ASMVSC(,@07)                               0329 01366000
         AL    ASMRATIO,ASMNVSC(,@07)                              0329 01367000
         AL    ASMRATIO,ASMERRS(,@07)                              0329 01368000
         MH    ASMRATIO,@CH02150                                   0329 01369000
         SRDA  ASMRATIO,32                                         0329 01370000
         D     ASMRATIO,ASMSLOTS(,@07)                             0329 01371000
         LR    ASMRATIO,@11                                        0329 01372000
*   /*****************************************************************/ 01373000
*   /*                                                               */ 01374000
*   /* CLEAN UP IF NO SLOT SHORTAGE EXIST. ISSUE RELIEVED MESSAGE AND*/ 01375000
*   /* MAKE ELIGABLE FOR SWAPIN THE USERS SWAPPED FOR THE SHORTAGE   */ 01376000
*   /* AND THE USERS DELAYED BECAUSE OF THE SHORTAGE.        @ZM43072*/ 01377000
*   /*                                                               */ 01378000
*   /*****************************************************************/ 01379000
*                                                                  0330 01380000
*   IF ASMRATIO<MCCASMT1 THEN       /* IF NO SLOT SHORTAGE   @ZM43072*/ 01381000
         CH    ASMRATIO,MCCASMT1(,RMCTPTR)                         0330 01382000
         BNL   @RF00330                                            0330 01383000
*     DO;                                                          0331 01384000
*       IF MCTASM1='1'B THEN        /* AND THERE WAS A PREVIOUS SLOT */ 01385000
         TM    MCTASM1(RMCTPTR),B'10000000'                        0332 01386000
         BNO   @RF00332                                            0332 01387000
*         DO;                       /* SHORTAGE,                     */ 01388000
*           MSGPTR=MCCMS202;        /* POINT TO SHORTAGE RELIEVED MSG   01389000
*                                      INVOKE RECORD FUNCTION        */ 01390000
*                                                                  0334 01391000
         L     MSGPTR,MCCMS202(,RMCTPTR)                           0334 01392000
*           /*********************************************************/ 01393000
*           /*                                                       */ 01394000
*           /* ? IRACTLCL EPN(I09)                                   */ 01395000
*           /*                                                       */ 01396000
*           /*********************************************************/ 01397000
*                                                                  0335 01398000
*           CALL RMSBI09->IRARMRTN; /* INVOKE I09 SUBRTN             */ 01399000
         L     @15,RMSBI09(,RMCTPTR)                               0335 01400000
         BALR  @14,@15                                             0335 01401000
*           MCTASM1='0'B;           /* RESET FIRST LEVEL SHORTAGE  0336 01402000
*                                      FLAG                          */ 01403000
*           MCTAMS2='0'B;           /* RESET SECOND LEVEL MSG FLAG   */ 01404000
         NI    MCTASM1(RMCTPTR),B'01101111'                        0337 01405000
*           DO ASMX=ADDR(RMCTWTQE)  /* LOOP THRU OUCB QUEUES @ZM43072*/ 01406000
*                 TO ADDR(RMCTINQE) /* FOR USERS BEING KEPT  @ZM43072*/ 01407000
*                 BY LENGTH(RMCTWTQE);/* OUT FOR SLOT SHORTAGE     0338 01408000
*                                                            @ZM43072*/ 01409000
         LA    ASMX,RMCTWTQE(,RMCTPTR)                             0338 01410000
         B     @DE00338                                            0338 01411000
@DL00338 DS    0H                                                  0339 01412000
*             OUCBPTR=ASMQE;        /* POINT TO QUEUE HEADER @ZM43072*/ 01413000
         L     OUCBPTR,ASMQE(,ASMX)                                0339 01414000
*             OUCBPTR=OUCBFWD;      /* PT TO 1ST OUCB ON QUE @ZM43072*/ 01415000
         L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0340 01416000
*             DO WHILE OUCBPTR^=ASMQE;/* FIND ALL USERS ON QUE     0341 01417000
*                                                            @ZM43072*/ 01418000
         B     @DE00341                                            0341 01419000
@DL00341 DS    0H                                                  0342 01420000
*               DO WHILE OUCBNAME='OUCB'/* LOOK FOR FIRST USER     0342 01421000
*                                                            @ZM43072*/ 01422000
*                     &OUCBAXS='0'B /* SWAPPED OUT OR DELAYED      0342 01423000
*                                                            @ZM43072*/ 01424000
*                     &OUCBJSAS='0'B;/* BECAUSE OF           @ZM43072*/ 01425000
         B     @DE00342                                            0342 01426000
@DL00342 DS    0H                                                  0343 01427000
*                 OUCBPTR=OUCBFWD;  /* AUX SHORTAGES         @ZM43072*/ 01428000
         L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0343 01429000
*               END;                /*                       @ZM43072*/ 01430000
@DE00342 CLC   OUCBNAME(4,OUCBPTR),@CC02185                        0344 01431000
         BNE   @DC00342                                            0344 01432000
         TM    OUCBAXS(OUCBPTR),B'00000100'                        0344 01433000
         BNZ   @DC00342                                            0344 01434000
         TM    OUCBJSAS(OUCBPTR),B'01000000'                       0344 01435000
         BZ    @DL00342                                            0344 01436000
@DC00342 DS    0H                                                  0345 01437000
*               IF OUCBPTR^=ASMQE THEN/* IF SUCH A USER IS   @ZM43072*/ 01438000
         C     OUCBPTR,ASMQE(,ASMX)                                0345 01439000
         BE    @RF00345                                            0345 01440000
*                 DO;               /* FOUND                 @ZM43072*/ 01441000
*                   OUCBAXS='0'B;   /* RESET HEAVY USAGE FLAG      0347 01442000
*                                                            @ZM43072*/ 01443000
         NI    OUCBAXS(OUCBPTR),B'11111011'                        0347 01444000
*                   OUCBJSAS='0'B;  /* RESET JOB DELAYED FLAG      0348 01445000
*                                                            @ZM43072*/ 01446000
         NI    OUCBJSAS(OUCBPTR),B'10111111'                       0348 01447000
*                   ASMOUCB=OUCBFWD;/* SAVE FORWARD PTR      @ZM43072*/ 01448000
         L     ASMOUCB,OUCBFWD(,OUCBPTR)                           0349 01449000
*                   ASCBPTR=OUCBASCB;/* POINT TO ASCB        @ZM43072*/ 01450000
         L     ASCBPTR,OUCBASCB(,OUCBPTR)                          0350 01451000
*                   OUCBOFF='0'B;   /* REMOVE USER FROM WAIT @ZM43072*/ 01452000
*                   OUCBGOB='1'B;   /* SET QUEUE TRANSITION  @ZM43072*/ 01453000
*                                                                  0352 01454000
         OI    OUCBGOB(OUCBPTR),B'00100000'                        0352 01455000
         NI    OUCBOFF(OUCBPTR),B'11110111'                        0352 01456000
*                   /*************************************************/ 01457000
*                   /*                                               */ 01458000
*                   /* ? IRACTLCL EPN(RPS)                           */ 01459000
*                   /*                                               */ 01460000
*                   /*************************************************/ 01461000
*                                                                  0353 01462000
*                   DO;                                            0353 01463000
*                     R1=ADDR(RMEPBRPS);/* RPS REQUEST IS PARAM      */ 01464000
         LA    R1,RMEPBRPS(,RMCTPTR)                               0354 01465000
*                     CALL RMSBCRN->IRARMRTN;/* ACTION INVK FUNCT    */ 01466000
         L     @15,RMSBCRN(,RMCTPTR)                               0355 01467000
         BALR  @14,@15                                             0355 01468000
*                   END;                                           0356 01469000
*                                                                  0356 01470000
*                   /*************************************************/ 01471000
*                   /*                                               */ 01472000
*                   /* ? IRACTLCL EPN(WM3)                           */ 01473000
*                   /*                                               */ 01474000
*                   /*************************************************/ 01475000
*                                                                  0357 01476000
*                   CALL EPSTWM3->IRARMRTN;/* INVOKE WM3 ACTION      */ 01477000
         L     @15,EPSTWM3(,RMCTPTR)                               0357 01478000
         BALR  @14,@15                                             0357 01479000
*                   OUCBPTR=ASMOUCB;/* LOOK AT NEXT USER     @ZM43072*/ 01480000
         LR    OUCBPTR,ASMOUCB                                     0358 01481000
*                 END;              /* END OF USER FOUND LOOP      0359 01482000
*                                                            @ZM43072*/ 01483000
*             END;                  /* END OF THIS QUEUE LOOP      0360 01484000
*                                                            @ZM43072*/ 01485000
@RF00345 DS    0H                                                  0360 01486000
@DE00341 C     OUCBPTR,ASMQE(,ASMX)                                0360 01487000
         BNE   @DL00341                                            0360 01488000
*           END;                    /* END OF QUEUE SEARCH   @ZM43072*/ 01489000
         AL    ASMX,@CF00050                                       0361 01490000
@DE00338 LA    @11,RMCTINQE(,RMCTPTR)                              0361 01491000
         CR    ASMX,@11                                            0361 01492000
         BNH   @DL00338                                            0361 01493000
*         END;                      /* END OF CLEAN UP       @ZM43072*/ 01494000
*     END;                          /* NO CURRENT SHORTAGE   @ZM43072*/ 01495000
*                                                                  0363 01496000
*   /*****************************************************************/ 01497000
*   /*                                                               */ 01498000
*   /* IF FIRST LEVEL SLOT SHORTAGE EXISTS, INFORM OPERATOR PREVENT  */ 01499000
*   /* NEW MEMORY CREATES AND MPLS TO MIN                            */ 01500000
*   /*                                                               */ 01501000
*   /*****************************************************************/ 01502000
*                                                                  0364 01503000
*   ELSE                                                           0364 01504000
*     DO;                                                          0364 01505000
         B     @RC00330                                            0364 01506000
@RF00330 DS    0H                                                  0365 01507000
*       IF MCTASM1='0'B THEN        /* IF NO ACTION HAS PREVIOUSLY   */ 01508000
         TM    MCTASM1(RMCTPTR),B'10000000'                        0365 01509000
         BNZ   @RF00365                                            0365 01510000
*         DO;                       /* BEEN TAKEN,                   */ 01511000
*           MSGPTR=MCCMS200;        /* POINT TO FIRST LEVEL MESSAGE     01512000
*                                      INVOKE RECORD FUNCTION        */ 01513000
*                                                                  0367 01514000
         L     MSGPTR,MCCMS200(,RMCTPTR)                           0367 01515000
*           /*********************************************************/ 01516000
*           /*                                                       */ 01517000
*           /* ? IRACTLCL EPN(I09)                                   */ 01518000
*           /*                                                       */ 01519000
*           /*********************************************************/ 01520000
*                                                                  0368 01521000
*           CALL RMSBI09->IRARMRTN; /* INVOKE I09 SUBRTN             */ 01522000
         L     @15,RMSBI09(,RMCTPTR)                               0368 01523000
         BALR  @14,@15                                             0368 01524000
*           MCTASM1='1'B;           /* SET FIRST LEVEL MESSAGE FLAG  */ 01525000
         OI    MCTASM1(RMCTPTR),B'10000000'                        0369 01526000
*           DO DMDTPTR=RMCTDMDT TO RMCTDMDE BY LENGTH(DMDT);/* LOOP     01527000
*                                      THRU DOMAIN TABLE     @ZM43072*/ 01528000
         L     DMDTPTR,RMCTDMDT(,RMCTPTR)                          0370 01529000
         B     @DE00370                                            0370 01530000
@DL00370 DS    0H                                                  0371 01531000
*             DMDTMPLT=DMDTLO;      /* MPLS TO MINIMUM       @ZM43072*/ 01532000
         SLR   @11,@11                                             0371 01533000
         IC    @11,DMDTLO(,DMDTPTR)                                0371 01534000
         STH   @11,DMDTMPLT(,DMDTPTR)                              0371 01535000
*           END;                    /* END OF DOMAIN LOOP    @ZM43072*/ 01536000
         AL    DMDTPTR,@CF01137                                    0372 01537000
@DE00370 C     DMDTPTR,RMCTDMDE(,RMCTPTR)                          0372 01538000
         BNH   @DL00370                                            0372 01539000
*         END;                                                     0373 01540000
*     END;                          /*                       @ZM43072*/ 01541000
*                                                                  0374 01542000
@RF00365 DS    0H                                                  0375 01543000
*   /*****************************************************************/ 01544000
*   /*                                                               */ 01545000
*   /* MAKE SWAPPED OUT HEAVY SLOT USERS ELIGIBLE FOR SWAP IN IF NO  */ 01546000
*   /* SWAPPABLES REMAIN IN CORE                             @ZM43072*/ 01547000
*   /*                                                               */ 01548000
*   /*****************************************************************/ 01549000
*                                                                  0375 01550000
*   INSWAPCT=I0;                    /* INITIALIZE CNT OF INCORE    0375 01551000
*                                      SWAPPABLES            @Z40BPSS*/ 01552000
@RC00330 SLR   INSWAPCT,INSWAPCT                                   0375 01553000
*   DO DMDTPTR=RMCTDMDT TO RMCTDMDE BY LENGTH(DMDT);/* LOOP THRU   0376 01554000
*                                      DOMAIN TABLE          @Z40BPSS*/ 01555000
         L     DMDTPTR,RMCTDMDT(,RMCTPTR)                          0376 01556000
         B     @DE00376                                            0376 01557000
@DL00376 DS    0H                                                  0377 01558000
*     INSWAPCT=INSWAPCT+DMDTINCU;   /* INCR BY THIS DOMAINS  @Z40BPSS*/ 01559000
         AH    INSWAPCT,DMDTINCU(,DMDTPTR)                         0377 01560000
*   END;                            /*                       @Z40BPSS*/ 01561000
         AL    DMDTPTR,@CF01137                                    0378 01562000
@DE00376 C     DMDTPTR,RMCTDMDE(,RMCTPTR)                          0378 01563000
         BNH   @DL00376                                            0378 01564000
*   IF(ASMRATIO>=MCCASMT1           /* IF A SHORTAGE EXISTS  @ZM43072*/ 01565000
*       &INSWAPCT=I0) THEN                                         0379 01566000
         CH    ASMRATIO,MCCASMT1(,RMCTPTR)                         0379 01567000
         BL    @RF00379                                            0379 01568000
         LTR   INSWAPCT,INSWAPCT                                   0379 01569000
         BNZ   @RF00379                                            0379 01570000
*     DO;                           /* AND THERE ARE NO SWAPPABLES IN   01571000
*                                      STORAGE               @Z40BPSS*/ 01572000
*       ASMOUCB=I0;                 /* CLEAR USER POINTER            */ 01573000
         SLR   ASMOUCB,ASMOUCB                                     0381 01574000
*       DO ASMX=ADDR(RMCTWTQE)      /* LOOP THROUGH EACH OUCB QUEUE  */ 01575000
*             TO ADDR(RMCTINQE)     /* LOOKING FOR USERS BEING KEPT  */ 01576000
*             BY LENGTH(RMCTWTQE) WHILE/* OUT FOR HEAVY SLOT USAGE   */ 01577000
*             ASMOUCB=I0;           /* UNTIL FIND SUCH A USER        */ 01578000
         LA    ASMX,RMCTWTQE(,RMCTPTR)                             0382 01579000
         B     @DE00382                                            0382 01580000
@DL00382 LTR   ASMOUCB,ASMOUCB                                     0382 01581000
         BNZ   @DC00382                                            0382 01582000
*         OUCBPTR=ASMQE;            /* POINT TO QUEUE HEADER         */ 01583000
         L     OUCBPTR,ASMQE(,ASMX)                                0383 01584000
*         OUCBPTR=OUCBFWD;          /* POINT TO FIRST OUCB ON QUEUE  */ 01585000
         L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0384 01586000
*         DO WHILE OUCBNAME='OUCB'  /* LOOK FOR FIRST VALID USER     */ 01587000
*               &OUCBAXS='0'B;      /* SWAPPED OUT BECAUSE OF        */ 01588000
         B     @DE00385                                            0385 01589000
@DL00385 DS    0H                                                  0386 01590000
*           OUCBPTR=OUCBFWD;        /* AUX SHORTAGES                 */ 01591000
         L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0386 01592000
*         END;                      /*                               */ 01593000
@DE00385 CLC   OUCBNAME(4,OUCBPTR),@CC02185                        0387 01594000
         BNE   @DC00385                                            0387 01595000
         TM    OUCBAXS(OUCBPTR),B'00000100'                        0387 01596000
         BZ    @DL00385                                            0387 01597000
@DC00385 DS    0H                                                  0388 01598000
*         IF OUCBPTR^=ASMQE THEN    /* IF SUCH A USER IS             */ 01599000
         C     OUCBPTR,ASMQE(,ASMX)                                0388 01600000
         BE    @RF00388                                            0388 01601000
*           DO;                     /* FOUND                         */ 01602000
*             OUCBAXS='0'B;         /* RESET HEAVY AUX USAGE FLAG    */ 01603000
         NI    OUCBAXS(OUCBPTR),B'11111011'                        0390 01604000
*             ASMOUCB=OUCBPTR;      /* REMEMBER FOUND USR ON QUEUE   */ 01605000
         LR    ASMOUCB,OUCBPTR                                     0391 01606000
*             ASCBPTR=OUCBASCB;     /* POINT TO ASCB                 */ 01607000
         L     ASCBPTR,OUCBASCB(,OUCBPTR)                          0392 01608000
*             OUCBOFF='0'B;         /* REMOVE USER FROM WAIT QUEUE   */ 01609000
*             OUCBGOB='1'B;         /* SET QUEUE TRANSITION BIT      */ 01610000
*                                                                  0394 01611000
         OI    OUCBGOB(OUCBPTR),B'00100000'                        0394 01612000
         NI    OUCBOFF(OUCBPTR),B'11110111'                        0394 01613000
*             /*******************************************************/ 01614000
*             /*                                                     */ 01615000
*             /* ? IRACTLCL EPN(RPS)                                 */ 01616000
*             /*                                                     */ 01617000
*             /*******************************************************/ 01618000
*                                                                  0395 01619000
*             DO;                                                  0395 01620000
*               R1=ADDR(RMEPBRPS);  /* RPS REQUEST IS PARAM          */ 01621000
         LA    R1,RMEPBRPS(,RMCTPTR)                               0396 01622000
*               CALL RMSBCRN->IRARMRTN;/* ACTION INVK FUNCT          */ 01623000
         L     @15,RMSBCRN(,RMCTPTR)                               0397 01624000
         BALR  @14,@15                                             0397 01625000
*             END;                                                 0398 01626000
*                                                                  0398 01627000
*             /*******************************************************/ 01628000
*             /*                                                     */ 01629000
*             /* ? IRACTLCL EPN(WM3)                                 */ 01630000
*             /*                                                     */ 01631000
*             /*******************************************************/ 01632000
*                                                                  0399 01633000
*             CALL EPSTWM3->IRARMRTN;/* INVOKE WM3 ACTION            */ 01634000
         L     @15,EPSTWM3(,RMCTPTR)                               0399 01635000
         BALR  @14,@15                                             0399 01636000
*/* NEW WM RECOMMENDATION @Z40BPSS                                   */ 01637000
*                                                                  0400 01638000
*           END;                    /* END OF USER FOUND             */ 01639000
*       END;                        /* END OF QUEUE SEARCH           */ 01640000
@RF00388 AL    ASMX,@CF00050                                       0401 01641000
@DE00382 LA    @11,RMCTINQE(,RMCTPTR)                              0401 01642000
         CR    ASMX,@11                                            0401 01643000
         BNH   @DL00382                                            0401 01644000
@DC00382 DS    0H                                                  0402 01645000
*     END;                          /* END OF NO SWAPPABLES  @ZM43072*/ 01646000
*                                                                  0403 01647000
*   /*****************************************************************/ 01648000
*   /*                                                               */ 01649000
*   /* SWAP OUT HEAVIEST SLOT USER IF SLOT SHORTAGE EXISTS AND INFORM*/ 01650000
*   /* OPERATOR                                              @ZM43072*/ 01651000
*   /*                                                               */ 01652000
*   /*****************************************************************/ 01653000
*                                                                  0403 01654000
*   ELSE                                                           0403 01655000
*     DO;                                                          0403 01656000
         B     @RC00379                                            0403 01657000
@RF00379 DS    0H                                                  0404 01658000
*       IF ASMRATIO>=MCCASMT1       /* SHORTAGE EXISTS       @ZM43072*/ 01659000
*           &INSWAPCT>I1 THEN                                      0404 01660000
         CH    ASMRATIO,MCCASMT1(,RMCTPTR)                         0404 01661000
         BL    @RF00404                                            0404 01662000
         C     INSWAPCT,@CF00090                                   0404 01663000
         BNH   @RF00404                                            0404 01664000
*         DO;                       /* SWAPPABLES INCORE     @ZM43072*/ 01665000
*           ASMOUCB=I0;             /* CLEAR POINTERS TO USER WITH   */ 01666000
         SLR   ASMOUCB,ASMOUCB                                     0406 01667000
*           ASMHIRTE=I0;            /* HIGHEST SLOT ALLOCATION RATE  */ 01668000
         SLR   ASMHIRTE,ASMHIRTE                                   0407 01669000
*           ASMX=I0;                /* ZERO SWAPPABLE USER COUNT     */ 01670000
         SLR   ASMX,ASMX                                           0408 01671000
*           OUCBPTR=RMCTINQE;       /* SET UP ADDRESSING TO IN QUEUE */ 01672000
         L     OUCBPTR,RMCTINQE(,RMCTPTR)                          0409 01673000
*           OUCBPTR=OUCBFWD;        /* POINT TO FIRST USER ON QUEUE  */ 01674000
         L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0410 01675000
*           DO WHILE OUCBNAME=      /* EXAMINE EACH USER ON QUEUE    */ 01676000
*                 'OUCB';           /*                               */ 01677000
         B     @DE00411                                            0411 01678000
@DL00411 DS    0H                                                  0412 01679000
*             IF OUCBOUT='0'B       /* IGNORE OUT OF CORE USERS      */ 01680000
*                 &OUCBGOI='0'B     /* USERS IN TRANSITION           */ 01681000
*                 &OUCBGOO='0'B     /*                               */ 01682000
*                 &OUCBGOB='0'B     /*                               */ 01683000
*                 &OUCBENQ='0'B     /* ENQUEUED USERS,               */ 01684000
*                 &OUCBPVL='0'B     /* PRIVILIGED USERS,             */ 01685000
*                 &OUCBBIB='0'B     /* USRS BEING CANCELED   @Z40BPSS*/ 01686000
*                 &OUCBNSW='0'B THEN/* NON SWAPPABLE USERS           */ 01687000
         TM    OUCBOUT(OUCBPTR),B'11100100'                        0412 01688000
         BNZ   @RF00412                                            0412 01689000
         TM    OUCBENQ(OUCBPTR),B'10100110'                        0412 01690000
         BNZ   @RF00412                                            0412 01691000
*               DO;                                                0413 01692000
*                 ASCBPTR=OUCBASCB; /* SET UP ADDRESSIBLLITY TO ASCB */ 01693000
         L     ASCBPTR,OUCBASCB(,OUCBPTR)                          0414 01694000
*                 OUXBPTR=ASCBOUXB; /* SET UP ADDRESSIBILITY TO OUXB */ 01695000
         L     OUXBPTR,ASCBOUXB(,ASCBPTR)                          0415 01696000
*                 ASMTIME=RMCTTOD   /* COMPUTE TIME FOR SLOT ALLOCA- */ 01697000
*                     -OUXBSTD;     /* TION RATE COMPUTATION         */ 01698000
         L     @09,RMCTTOD(,RMCTPTR)                               0416 01699000
         SL    @09,OUXBSTD(,OUXBPTR)                               0416 01700000
         ST    @09,ASMTIME                                         0416 01701000
*                 IF ASMTIME=I0 THEN/* IF TIME DIVISOR IS ZERO IGNORE*/ 01702000
         LTR   @09,@09                                             0417 01703000
         BNZ   @RF00417                                            0417 01704000
*                   ASMRATE=I0;     /* RATE COMPUTATION              */ 01705000
         SLR   ASMRATE,ASMRATE                                     0418 01706000
*                 ELSE              /* OTHERWISE                     */ 01707000
*                   ASMRATE=        /* SLOT ALLOCATION RATE =        */ 01708000
*                       ((ASCBVSC   /* CURRENT VAM AND               */ 01709000
*                       +ASCBNVSC   /* NON-VAM SLOT COUNTS MINUS     */ 01710000
*                       -OUXBVSC    /* OLD VAM AND                   */ 01711000
*                       -OUXBNVC)   /* NON VAM SLOT COUNTS           */ 01712000
*                       *I1000)     /* TIMES I1000 TO GET SLOTS PER     01713000
*                                      SEC                           */ 01714000
*                       /ASMTIME;   /* DIVIDED BY ELAPSED TIME (MS)  */ 01715000
         B     @RC00417                                            0419 01716000
@RF00417 LH    @14,ASCBVSC(,ASCBPTR)                               0419 01717000
         AH    @14,ASCBNVSC(,ASCBPTR)                              0419 01718000
         SH    @14,OUXBVSC(,OUXBPTR)                               0419 01719000
         SH    @14,OUXBNVC(,OUXBPTR)                               0419 01720000
         LR    @15,@14                                             0419 01721000
         M     @14,@CF02152                                        0419 01722000
         D     @14,ASMTIME                                         0419 01723000
         LR    ASMRATE,@15                                         0419 01724000
*                 OUXBVSC=ASCBVSC;  /* SAVE VAM SLOT COUNT           */ 01725000
@RC00417 LH    @09,ASCBVSC(,ASCBPTR)                               0420 01726000
         STH   @09,OUXBVSC(,OUXBPTR)                               0420 01727000
*                 OUXBNVC=ASCBNVSC; /* AND NON VAM SLOT COUNT        */ 01728000
         LH    @09,ASCBNVSC(,ASCBPTR)                              0421 01729000
         STH   @09,OUXBNVC(,OUXBPTR)                               0421 01730000
*                 OUXBSTD=RMCTTOD;  /* AND TOD FOR NEXT COMPUTATION  */ 01731000
         L     @09,RMCTTOD(,RMCTPTR)                               0422 01732000
         ST    @09,OUXBSTD(,OUXBPTR)                               0422 01733000
*                 IF ASMRATE>ASMHIRTE THEN/* IF RATE FOR THIS USER IS*/ 01734000
         CR    ASMRATE,ASMHIRTE                                    0423 01735000
         BNH   @RF00423                                            0423 01736000
*                   DO;             /* HIGHEST SO FAR                */ 01737000
*                     ASMHIRTE=ASMRATE;/* SAVE HIGH RATE             */ 01738000
         LR    ASMHIRTE,ASMRATE                                    0425 01739000
*                     ASMOUCB=OUCBPTR;/* AND PTR TO USER             */ 01740000
         LR    ASMOUCB,OUCBPTR                                     0426 01741000
*                   END;                                           0427 01742000
*               END;                                               0428 01743000
@RF00423 DS    0H                                                  0429 01744000
*             OUCBPTR=OUCBFWD;      /* POINT TO NEXT OUCB ON QUEUE   */ 01745000
@RF00412 L     OUCBPTR,OUCBFWD(,OUCBPTR)                           0429 01746000
*           END;                                                   0430 01747000
@DE00411 CLC   OUCBNAME(4,OUCBPTR),@CC02185                        0430 01748000
         BE    @DL00411                                            0430 01749000
*           IF ASMOUCB^=I0 THEN                                    0431 01750000
         LTR   ASMOUCB,ASMOUCB                                     0431 01751000
         BZ    @RF00431                                            0431 01752000
*             DO;                   /* SWAP OUT USER WITH THE HIGHEST   01753000
*                                      SLOT ALLOCATION RATE  @ZM43072*/ 01754000
*               OUCBPTR=ASMOUCB;    /* SET UP SWAP OUT INTERFACE     */ 01755000
         LR    OUCBPTR,ASMOUCB                                     0433 01756000
*               ASCBPTR=OUCBASCB;   /*                               */ 01757000
*                                                                  0434 01758000
         L     ASCBPTR,OUCBASCB(,OUCBPTR)                          0434 01759000
*               /*****************************************************/ 01760000
*               /*                                                   */ 01761000
*               /* ? IRACTLCL EPN(CSO)                               */ 01762000
*               /*                                                   */ 01763000
*               /*****************************************************/ 01764000
*                                                                  0435 01765000
*               DO;                                                0435 01766000
*                 R1=ADDR(RMEPBCSO);/* CSO REQUEST IS PARAM          */ 01767000
         LA    R1,RMEPBCSO(,RMCTPTR)                               0436 01768000
*                 CALL RMSBCRY->IRARMRTN;/* ACTION INVK FUNCT        */ 01769000
         L     @15,RMSBCRY(,RMCTPTR)                               0437 01770000
         BALR  @14,@15                                             0437 01771000
*               END;                                               0438 01772000
*               IF RTNCOD=I0 THEN                                  0439 01773000
         LTR   RTNCOD,RTNCOD                                       0439 01774000
         BNZ   @RF00439                                            0439 01775000
*                 DO;               /* USER SWAPPED OUT ?    @Z40BPSS*/ 01776000
*                   OUCBSRC=SRCDXSSC;/* SET SWAP REASON CODE @Z40BPSS*/ 01777000
         MVI   OUCBSRC(OUCBPTR),X'04'                              0441 01778000
*                   OUCBAXS='1'B;   /* INDICATE WHY USER WAS SWAPPED */ 01779000
         OI    OUCBAXS(OUCBPTR),B'00000100'                        0442 01780000
*                 END;              /*                       @Z40BPSS*/ 01781000
*               MSGPTR=MCCMS203;    /* HEAVY USER MESSAGE    @ZM43072*/ 01782000
@RF00439 L     MSGPTR,MCCMS203(,RMCTPTR)                           0444 01783000
*               IF ASCBJBNI=I0 THEN                                0445 01784000
         L     @11,ASCBJBNI(,ASCBPTR)                              0445 01785000
         LTR   @11,@11                                             0445 01786000
         BNZ   @RF00445                                            0445 01787000
*                 ASMJOBN=JOBNS;    /* JOBNAME TO MESSAGE    @ZM43072*/ 01788000
         L     @11,ASCBJBNS(,ASCBPTR)                              0446 01789000
         MVC   ASMJOBN(8,MSGPTR),JOBNS(@11)                        0446 01790000
*               ELSE                                               0447 01791000
*                 ASMJOBN=JOBNI;    /* JOBNAME TO MESSAGE    @ZM43072*/ 01792000
         B     @RC00445                                            0447 01793000
@RF00445 L     @11,ASCBJBNI(,ASCBPTR)                              0447 01794000
         MVC   ASMJOBN(8,MSGPTR),JOBNI(@11)                        0447 01795000
*               ASMPER=((ASCBVSC+ASCBNVSC)*I100)/ASMSLOTS;/* PERCENT    01796000
*                                      ALLOCATED             @ZM43072*/ 01797000
@RC00445 LH    ASMPER,ASCBVSC(,ASCBPTR)                            0448 01798000
         AH    ASMPER,ASCBNVSC(,ASCBPTR)                           0448 01799000
         MH    ASMPER,@CH02150                                     0448 01800000
         L     @11,CVTPTR                                          0448 01801000
         L     @11,ASMVTPTR(,@11)                                  0448 01802000
         LR    @08,ASMPER                                          0448 01803000
         SRDA  @08,32                                              0448 01804000
         D     @08,ASMSLOTS(,@11)                                  0448 01805000
         LR    ASMPER,@09                                          0448 01806000
*               CVD(ASMPER,WRKAREA1);/* CONVERT TO DECIMAL   @ZM43072*/ 01807000
         CVD   ASMPER,@TS00001                                     0449 01808000
         MVC   WRKAREA1(2),@TS00001+6                              0449 01809000
*               UNPK(WRKAREA2,WRKAREA1);/* UNPACK THE PERCENTAGE   0450 01810000
*                                                            @ZM43072*/ 01811000
         UNPK  WRKAREA2(2),WRKAREA1(2)                             0450 01812000
*               ASMALLOC=WRKAREA2|MASK;/* TAKE CARE OF SIGN  @ZM43072*/ 01813000
*                                                                  0451 01814000
         MVC   ASMALLOC(2,MSGPTR),WRKAREA2                         0451 01815000
         OC    ASMALLOC(2,MSGPTR),MASK                             0451 01816000
*               /*****************************************************/ 01817000
*               /*                                                   */ 01818000
*               /* ? IRACTLCL EPN(I09)                               */ 01819000
*               /*                                                   */ 01820000
*               /*****************************************************/ 01821000
*                                                                  0452 01822000
*               CALL RMSBI09->IRARMRTN;/* INVOKE I09 SUBRTN          */ 01823000
*                                                                  0452 01824000
         L     @15,RMSBI09(,RMCTPTR)                               0452 01825000
         BALR  @14,@15                                             0452 01826000
*               /*****************************************************/ 01827000
*               /*                                                   */ 01828000
*               /* INVOKE RECORD FUNCTION                    @ZM43072*/ 01829000
*               /*                                                   */ 01830000
*               /*****************************************************/ 01831000
*                                                                  0453 01832000
*             END;                                                 0453 01833000
*         END;                                                     0454 01834000
@RF00431 DS    0H                                                  0455 01835000
*     END;                          /* SLOT SHORTAGE EXISTS  @ZM43072*/ 01836000
@RF00404 DS    0H                                                  0456 01837000
*   IF ASMRATIO>=MCCASMT2&          /* IF SECOND LEVEL SHORTAGE    0456 01838000
*                                                            @ZM43072*/ 01839000
*       MCTAMS2='0'B THEN           /* AND MSG NOT WRITTEN   @ZM43072*/ 01840000
@RC00379 CH    ASMRATIO,MCCASMT2(,RMCTPTR)                         0456 01841000
         BL    @RF00456                                            0456 01842000
         TM    MCTAMS2(RMCTPTR),B'00010000'                        0456 01843000
         BNZ   @RF00456                                            0456 01844000
*     DO;                                                          0457 01845000
*       MSGPTR=MCCMS201;            /* POINT TO CRITICAL SHORTAGE MSG   01846000
*                                      INVOKE RECORD FUNCTION        */ 01847000
*                                                                  0458 01848000
         L     MSGPTR,MCCMS201(,RMCTPTR)                           0458 01849000
*       /*************************************************************/ 01850000
*       /*                                                           */ 01851000
*       /* ? IRACTLCL EPN(I09)                                       */ 01852000
*       /*                                                           */ 01853000
*       /*************************************************************/ 01854000
*                                                                  0459 01855000
*       CALL RMSBI09->IRARMRTN;     /* INVOKE I09 SUBRTN             */ 01856000
         L     @15,RMSBI09(,RMCTPTR)                               0459 01857000
         BALR  @14,@15                                             0459 01858000
*       MCTAMS2='1'B;               /* INDICATE MESSAGE WRITTEN      */ 01859000
         OI    MCTAMS2(RMCTPTR),B'00010000'                        0460 01860000
*     END;                                                         0461 01861000
*   RESPECIFY                                                      0462 01862000
*     MSGPTR UNRESTRICTED;                                         0462 01863000
*                                                                  0462 01864000
@RF00456 DS    0H                                                  0463 01865000
*/*   ? IRACTLEP ENN(ASM)                                            */ 01866000
*                                                                  0463 01867000
*   GEN CODE EXIT NOSEQFLOW;                                       0463 01868000
*                                  /*                                   01869000
         LM    @00,@14,000+000(@13)    RELOAD INVOKING RTNE REGS        01870000
         BR    RTNREG                  RETURN TO INVOKER                01871000
*                                                                  0464 01872000
*/********************************************************************/ 01873000
*/*                                                                  */ 01874000
*/* ENTRY POINT NAME = IRARMSQA                                      */ 01875000
*/*                                                                  */ 01876000
*/* DESCRIPTIVE NAME = SQA SHORTAGE MESSAGE WRITER                   */ 01877000
*/*                                                                  */ 01878000
*/* FUNCTION = INFORM OPERATOR OF SYSTEM QUEUE SPACE SHORTAGES       */ 01879000
*/*                                                                  */ 01880000
*/* CALLER = IRARMCTL - SRM CONTROL MODULE                           */ 01881000
*/*            ALGORITHM REQUEST PROCESSOR                           */ 01882000
*/*                                                                  */ 01883000
*/* INPUT = R2 = RMCT ADDRESS                                        */ 01884000
*/*         R3 = RRPA ADDRESS                                        */ 01885000
*/*                                                                  */ 01886000
*/* OUTPUT = NONE                                                    */ 01887000
*/*                                                                  */ 01888000
*/********************************************************************/ 01889000
*/*IRARMSQA: CHART (AMODE,SEQ,AREF)                                  */ 01890000
*/* HEADER                                                         0464 01891000
*/* AUG 8,1975                                     IRARMSQA-       0464 01892000
*/* SQA SHORTAGE MESSAGE WRITER                                      */ 01893000
*/*IRARMSQA: E INVOKED BY CTL                                        */ 01894000
*/* D (NO,%A,YES,) PREVIOUS SHORTAGE RELIEVED ?                      */ 01895000
*/* S (,%S) IRARMI09: WRITE SHORTAGE RELIEVED MESSAGE                */ 01896000
*/*%A: D (NO,%B,YES,) CRITICAL SHORTAGE EXISTS ?                     */ 01897000
*/* S (,%S) IRARMI09: WRITE CRITICAL SHORTAGE MESSAGE                */ 01898000
*/*%B: D (NO,%S,YES,) 1ST LEVEL SHORTAGE EXISTS                      */ 01899000
*/* S IRARMI09: WRITE SHORTAGE MESSAGE                               */ 01900000
*/*%S:  R RETURN TO CALLER                                           */ 01901000
*/*IRARMSQA: END                                                     */ 01902000
*/*   ? IRACTLEP EPN(SQA)                                            */ 01903000
*                                                                  0464 01904000
*   DCL                                                            0464 01905000
*     IRARMSQA ENTRY INT;                                          0464 01906000
*   GEN CODE REFS(RRPAEPA) DEFS(IRARMSQA) NOEXIT SEQFLOW;          0465 01907000
*                                  /*                                   01908000
         ENTRY IRARMSQA                                                 01909000
IRARMSQA DS    0H                                                       01910000
         STM   @00,@14,000+000(@13)    SAVE INVOKING RTNE REGS          01911000
         ST    @01,RRPAEPA(,RRPAPTR)   INDICATE NEW CURRENT RMEP        01912000
         LA    @12,IRARMSQA-@PSTART    DISPLACEMENT TO MODULE BASE      01913000
         LCR   @12,@12                 NEGATIVE FOR SUBTRACT            01914000
         ALR   @12,@15                 SETUP MODULE ADDRESSABILITY      01915000
*   RESPECIFY                                                      0466 01916000
*     MSGPTR RESTRICTED;                                           0466 01917000
*                                                                  0466 01918000
*/*                                                                  */ 01919000
*/*      WRITE SHORTAGE RELIEVED MESSAGE IF SHORTAGE IS GONE         */ 01920000
*/*                                                                  */ 01921000
*                                                                  0467 01922000
*   IF MCTSQA1='0'B                 /* WRITE MESSAGE ONLY IF NO      */ 01923000
*       &MCTSMS1='1'B THEN          /* SHORTAGES ARE CURRENT AND IF     01924000
*                                      SHORTAGE MESSAGES HAVE      0467 01925000
*                                      PREVIOUSLY BEEN WRITTEN       */ 01926000
         TM    MCTSQA1(RMCTPTR),B'10000000'                        0467 01927000
         BNZ   @RF00467                                            0467 01928000
         TM    MCTSMS1(RMCTPTR),B'00001000'                        0467 01929000
         BNO   @RF00467                                            0467 01930000
*     DO;                           /*                               */ 01931000
*       MSGPTR=MCCMS102;            /* POINT TO APPROPRIATE MESSAGE     01932000
*                                      INVOKE RECORD FUNCTION        */ 01933000
*                                                                  0469 01934000
         L     MSGPTR,MCCMS102(,RMCTPTR)                           0469 01935000
*       /*************************************************************/ 01936000
*       /*                                                           */ 01937000
*       /* ? IRACTLCL EPN(I09)                                       */ 01938000
*       /*                                                           */ 01939000
*       /*************************************************************/ 01940000
*                                                                  0470 01941000
*       CALL RMSBI09->IRARMRTN;     /* INVOKE I09 SUBRTN             */ 01942000
         L     @15,RMSBI09(,RMCTPTR)                               0470 01943000
         BALR  @14,@15                                             0470 01944000
*       MCTSMS1='0'B;               /* RESET SHORTAGE                */ 01945000
*       MCTSMS2='0'B;               /* MESSAGE FLAGS                 */ 01946000
         NI    MCTSMS1(RMCTPTR),B'11110011'                        0472 01947000
*     END;                          /*                               */ 01948000
*/*                                                                  */ 01949000
*/*      WRITE CRITICAL SHORTAGE MESSAGE FOR SECOND LEVEL SHORTAGE   */ 01950000
*/*                                                                  */ 01951000
*                                                                  0474 01952000
*   ELSE                                                           0474 01953000
*     IF MCTSQA2='1'B               /* WRITE MESSAGE ONLY IF SHORTAGE*/ 01954000
*         &MCTSMS2='0'B THEN        /* IS CURRENT AND MESSAGE HAS NOT*/ 01955000
         B     @RC00467                                            0474 01956000
@RF00467 TM    MCTSQA2(RMCTPTR),B'01000000'                        0474 01957000
         BNO   @RF00474                                            0474 01958000
         TM    MCTSMS2(RMCTPTR),B'00000100'                        0474 01959000
         BNZ   @RF00474                                            0474 01960000
*       DO;                         /* ALREADY BEEN WRITEN           */ 01961000
*         MSGPTR=MCCMS101;          /* POINT TO MESSAGE INVOKE RECORD   01962000
*                                      FUNCTION                      */ 01963000
*                                                                  0476 01964000
         L     MSGPTR,MCCMS101(,RMCTPTR)                           0476 01965000
*         /***********************************************************/ 01966000
*         /*                                                         */ 01967000
*         /* ? IRACTLCL EPN(I09)                                     */ 01968000
*         /*                                                         */ 01969000
*         /***********************************************************/ 01970000
*                                                                  0477 01971000
*         CALL RMSBI09->IRARMRTN;   /* INVOKE I09 SUBRTN             */ 01972000
         L     @15,RMSBI09(,RMCTPTR)                               0477 01973000
         BALR  @14,@15                                             0477 01974000
*         MCTSMS2='1'B;             /* SET MESSAGE WRITTEN FLAG      */ 01975000
*         MCTSMS1='1'B;             /* INDICATE NO NEED FOR MSG 1    */ 01976000
         OI    MCTSMS2(RMCTPTR),B'00001100'                        0479 01977000
*       END;                                                       0480 01978000
*                                                                  0480 01979000
*/*                                                                  */ 01980000
*/*      WRITE SHORTAGE MESSAGE FOR FIRST LEVEL SHORTAGE             */ 01981000
*/*                                                                  */ 01982000
*                                                                  0481 01983000
*     ELSE                                                         0481 01984000
*       IF MCTSQA1='1'B             /* WRITE MESSAGE ONLY IF SHORTAGE*/ 01985000
*           &MCTSMS1='0'B THEN      /* IS CURRENT AND MESSAGE HAS NOT   01986000
*                                      ALREADY BEEN WRITTEN          */ 01987000
         B     @RC00474                                            0481 01988000
@RF00474 TM    MCTSQA1(RMCTPTR),B'10000000'                        0481 01989000
         BNO   @RF00481                                            0481 01990000
         TM    MCTSMS1(RMCTPTR),B'00001000'                        0481 01991000
         BNZ   @RF00481                                            0481 01992000
*         DO;                       /*                               */ 01993000
*           MSGPTR=MCCMS100;        /* POINT TO APPROPRIATE MESSAGE     01994000
*                                      INVOKE RECORD FUNCTION        */ 01995000
*                                                                  0483 01996000
         L     MSGPTR,MCCMS100(,RMCTPTR)                           0483 01997000
*           /*********************************************************/ 01998000
*           /*                                                       */ 01999000
*           /* ? IRACTLCL EPN(I09)                                   */ 02000000
*           /*                                                       */ 02001000
*           /*********************************************************/ 02002000
*                                                                  0484 02003000
*           CALL RMSBI09->IRARMRTN; /* INVOKE I09 SUBRTN             */ 02004000
         L     @15,RMSBI09(,RMCTPTR)                               0484 02005000
         BALR  @14,@15                                             0484 02006000
*           MCTSMS1='1'B;           /* SET MESSAGE WRITTEN FLAG      */ 02007000
         OI    MCTSMS1(RMCTPTR),B'00001000'                        0485 02008000
*         END;                                                     0486 02009000
*   RESPECIFY                                                      0487 02010000
*     MSGPTR UNRESTRICTED;                                         0487 02011000
*                                                                  0487 02012000
@RF00481 DS    0H                                                  0487 02013000
@RC00474 DS    0H                                                  0487 02014000
@RC00467 DS    0H                                                  0488 02015000
*/*   ? IRACTLEP ENN(SQA)                                            */ 02016000
*                                                                  0488 02017000
*   GEN CODE EXIT NOSEQFLOW;                                       0488 02018000
*                                  /*                                   02019000
         LM    @00,@14,000+000(@13)    RELOAD INVOKING RTNE REGS        02020000
         BR    RTNREG                  RETURN TO INVOKER                02021000
*                                                                  0489 02022000
*/********************************************************************/ 02023000
*/*                                                                  */ 02024000
*/*      STEAL - IRARMSTM INTERNAL SUBROUTINE                        */ 02025000
*/*                                                                  */ 02026000
*/*        FUNCTIONS -                                               */ 02027000
*/*          1) ADD USER TO RFR INTERFACE LIST                       */ 02028000
*/*          2) IF LIST IS FULL,CALL REAL FRAME REPLACEMENT          */ 02029000
*/*          3) ACCUMULATE NUMBER OF PAGES STOLEN                    */ 02030000
*/*                                                                  */ 02031000
*/*        INPUT -                                                   */ 02032000
*/*          REG1 = REAL FRAME REPLACEMENT INTERFACE BUFFER ADDRESS  */ 02033000
*/*          REG4 = ASCB ADDRESS                                     */ 02034000
*/*          PRX = INDEX INTO INTERFACE LIST                         */ 02035000
*/*          PRXEND = MAXIMUM INTERFACE LIST INDEX                   */ 02036000
*/*                                                                  */ 02037000
*/********************************************************************/ 02038000
*/*STEAL: CHART (AMODE,SEQ,AREF)                                     */ 02039000
*/* HEADER                                                         0489 02040000
*/* AUG 8,1975                                        STEAL-       0489 02041000
*/* RFR INTERFACE LIST BUILDER                                       */ 02042000
*/*STEAL: E INTERNAL SUBR                                            */ 02043000
*/* D (YES,%A,NO,) FLUSH INTERFACE LIST ?                            */ 02044000
*/* P ADD USER TO LIST                                               */ 02045000
*/* D (NO,%B,YES,) IS LIST FULL ?                                    */ 02046000
*/*%A: S IRARMI03: CALL REAL FRAME REPLACEMENT                       */ 02047000
*/* P SAVE COUNT OF STOLEN PAGES BY MEMORY IN OUXB                   */ 02048000
*/* P UPDATE COUNT OF TOTAL STOLEN PAGES                             */ 02049000
*/*%B: R RETURN TO CALLER                                            */ 02050000
*/*STEAL: END                                                        */ 02051000
*                                                                  0489 02052000
*STEAL:                                                            0489 02053000
*   PROC OPTIONS(NOSAVE);                                          0489 02054000
@EL00001 DS    0H                                                  0489 02055000
@EF00001 DS    0H                                                  0489 02056000
@ER00001 BR    @14                                                 0489 02057000
STEAL    DS    0H                                                  0490 02058000
*   RESPECIFY                                                      0490 02059000
*    (RFRPTR,                                                      0490 02060000
*     PRX) RESTRICTED;              /*                       @Z30WIMG*/ 02061000
*   IF PRX^=PRXEND THEN             /* TEST NOT FLUSH LIST   @Z30WIMG*/ 02062000
         C     PRX,PRXEND                                          0491 02063000
         BE    @RF00491                                            0491 02064000
*     DO;                           /*                       @Z30WIMG*/ 02065000
*/*                                                                  */ 02066000
*/*      ADD USER TO RFR INTERFACE LIST                              */ 02067000
*/*                                                                  */ 02068000
*                                                                  0493 02069000
*       RPRFRSCT=PRSCT;             /* SET MAXIMUM STEAL CNT @ZA20337*/ 02070000
         LH    @09,PRSCT                                           0493 02071000
         STH   @09,RPRFRSCT(,PRX)                                  0493 02072000
*       RPRFRINV=PRFLGS;            /* SET OPTION FLAGS      @Z30WIPH*/ 02073000
         MVC   RPRFRINV(1,PRX),PRFLGS                              0494 02074000
*       RPRFRCRI=PRCRI;             /* SET STEAL CRITERIA NUMBER     */ 02075000
         LH    @09,PRCRI                                           0495 02076000
         STC   @09,RPRFRCRI(,PRX)                                  0495 02077000
*       RPRFRUSR=ASCBPTR;           /* MOVE IN USER POINTER  @Z30WIMG*/ 02078000
         ST    ASCBPTR,RPRFRUSR(,PRX)                              0496 02079000
*       PRX=PRX+LENGTH(RPRFRINT);   /* POINT TO NEXT ENTRY   @Z30WIMG*/ 02080000
         AL    PRX,@CF00164                                        0497 02081000
*     END;                          /*                       @Z30WIMG*/ 02082000
*/*                                                          @Z30WIMG*/ 02083000
*/*      IF LIST IS FULL, CALL REAL FRAME REPLACEMENT        @Z30WIMG*/ 02084000
*/*                                                          @Z30WIMG*/ 02085000
*                                                                  0499 02086000
*   IF PRX=PRXEND THEN              /* TEST IF LIST IS FULL  @Z30WIPH*/ 02087000
@RF00491 C     PRX,PRXEND                                          0499 02088000
         BNE   @RF00499                                            0499 02089000
*     DO;                           /* IF SO,                @Z30WIMG*/ 02090000
*       PRX=PRX-LENGTH(RPRFRINT);   /* POINT TO LAST ENTRY   @Z30WIPH*/ 02091000
         SL    PRX,@CF00164                                        0501 02092000
*       RPRFREND='1'B;              /* INDICATE LAST ENTRY   @Z30WIMG*/ 02093000
         OI    RPRFREND(PRX),B'10000000'                           0502 02094000
*       PRX=RTNREG;                 /* SAVE RETURN ADDRESS   @Z30WIMG   02095000
*                                      CALL REAL FRAME       @Z30WIPH   02096000
*                                      REPLACEMENT           @Z30WIPH*/ 02097000
*                                                                  0503 02098000
         LR    PRX,RTNREG                                          0503 02099000
*       /*************************************************************/ 02100000
*       /*                                                           */ 02101000
*       /* ? IRACTLCL EPN(I03)                                       */ 02102000
*       /*                                                           */ 02103000
*       /*************************************************************/ 02104000
*                                                                  0504 02105000
*       CALL RMSBI03->IRARMRTN;     /* INVOKE I03 SUBRTN             */ 02106000
*                                                                  0504 02107000
         L     @15,RMSBI03(,RMCTPTR)                               0504 02108000
         BALR  @14,@15                                             0504 02109000
*       /*************************************************************/ 02110000
*       /*                                                           */ 02111000
*       /*                                                   @Z30WIMG*/ 02112000
*       /*                                                           */ 02113000
*       /*************************************************************/ 02114000
*                                                                  0505 02115000
*       RTNREG=PRX;                 /* RESTORE RETURN ADDRESS      0505 02116000
*                                                            @Z30WIMG*/ 02117000
         LR    RTNREG,PRX                                          0505 02118000
*       DO PRX=(PRXEND-             /* LOOP THROUGH          @Z30WIPH*/ 02119000
*             LENGTH(RPRFRINT))     /* EACH ENTRY            @Z30WIPH*/ 02120000
*             TO RFRPTR BY          /*                       @Z30WIPH*/ 02121000
*             -LENGTH(RPRFRINT);    /*                       @Z30WIPH*/ 02122000
         L     PRX,PRXEND                                          0506 02123000
         SL    PRX,@CF00164                                        0506 02124000
         B     @DE00506                                            0506 02125000
@DL00506 DS    0H                                                  0507 02126000
*         PRSTCNT=PRSTCNT+RPRFRSCT; /* ADD STOLEN PAGES CNT  @Z30WIPH*/ 02127000
*                                                                  0507 02128000
         LH    @09,RPRFRSCT(,PRX)                                  0507 02129000
         ALR   PRSTCNT,@09                                         0507 02130000
*         /***********************************************************/ 02131000
*         /*                                                         */ 02132000
*         /* ACCUMULATE NUMBER OF PAGES STOLEN FROM EACH USER        */ 02133000
*         /*                                                 @Z40BPSS*/ 02134000
*         /*                                                         */ 02135000
*         /***********************************************************/ 02136000
*                                                                  0508 02137000
*         IF RPRASCBA^=I0 THEN      /* NOT FOR SPA           @Z40BPSS*/ 02138000
         L     @07,RPRASCBA-1(,PRX)                                0508 02139000
         LA    @07,0(,@07)                                         0508 02140000
         LTR   @07,@07                                             0508 02141000
         BZ    @RF00508                                            0508 02142000
*           RPRASCBA->ASCBOUXB->OUXBSTCT=RPRASCBA->ASCBOUXB->OUXBSTCT+  02143000
*               RPRFRSCT;           /*                       @Z40BPSS*/ 02144000
         L     @07,ASCBOUXB(,@07)                                  0509 02145000
         AL    @09,OUXBSTCT(,@07)                                  0509 02146000
         ST    @09,OUXBSTCT(,@07)                                  0509 02147000
*       END;                        /*                       @Z30WIMG*/ 02148000
@RF00508 AL    PRX,@CF02211                                        0510 02149000
@DE00506 CR    PRX,RFRPTR                                          0510 02150000
         BNL   @DL00506                                            0510 02151000
*       PRX=ADDR(RFRLST1);          /* INITIALIZE LIST INDEX @Z30WIMG*/ 02152000
         LA    PRX,RFRLST1                                         0511 02153000
*     END;                          /*                       @Z30WIMG*/ 02154000
*   RESPECIFY                                                      0513 02155000
*    (RFRPTR,                                                      0513 02156000
*     PRX) UNRESTRICTED;            /*                       @Z30WIMG*/ 02157000
*   END;                                                           0514 02158000
@EL00002 DS    0H                                                  0514 02159000
@EF00002 DS    0H                                                  0514 02160000
@ER00002 BR    @14                                                 0514 02161000
*   END IRARMSTM                                                   0515 02162000
*                                                                  0515 02163000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 02164000
*/*%INCLUDE SYSUT5  (IRASTCOM)                                       */ 02165000
*/*%INCLUDE SYSLIB  (IRAREGS )                                       */ 02166000
*/*%INCLUDE SYSLIB  (IRACNSMP)                                       */ 02167000
*/*%INCLUDE SYSLIB  (IRARMCT )                                       */ 02168000
*/*%INCLUDE SYSLIB  (IRACCT  )                                       */ 02169000
*/*%INCLUDE SYSLIB  (IRAICT  )                                       */ 02170000
*/*%INCLUDE SYSLIB  (IRAMCT  )                                       */ 02171000
*/*%INCLUDE SYSLIB  (IRARCT  )                                       */ 02172000
*/*%INCLUDE SYSLIB  (IRARMPT )                                       */ 02173000
*/*%INCLUDE SYSLIB  (IRARMCA )                                       */ 02174000
*/*%INCLUDE SYSLIB  (IRARMEX )                                       */ 02175000
*/*%INCLUDE SYSLIB  (IRARMSB )                                       */ 02176000
*/*%INCLUDE SYSLIB  (IRAEPAT )                                       */ 02177000
*/*%INCLUDE SYSLIB  (IRAEPDT )                                       */ 02178000
*/*%INCLUDE SYSLIB  (IRAEPST )                                       */ 02179000
*/*%INCLUDE SYSLIB  (IRARRPA )                                       */ 02180000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 02181000
*/*%INCLUDE SYSLIB  (IRAOUCB )                                       */ 02182000
*/*%INCLUDE SYSLIB  (IHAOUXB )                                       */ 02183000
*/*%INCLUDE SYSLIB  (IHARSMHD)                                       */ 02184000
*/*%INCLUDE SYSLIB  (IRARMEP )                                       */ 02185000
*/*%INCLUDE SYSLIB  (IRASRCD )                                       */ 02186000
*/*%INCLUDE SYSLIB  (IRADMDT )                                       */ 02187000
*/*%INCLUDE SYSLIB  (IHAPVT  )                                       */ 02188000
*/*%INCLUDE SYSLIB  (ILRASMVT)                                       */ 02189000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 02190000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 02191000
*/*%INCLUDE SYSUT5  (IRARMSWA)                                       */ 02192000
*/*%INCLUDE SYSUT5  (IRARMPR1)                                       */ 02193000
*/*%INCLUDE SYSUT5  (IRARMPR5)                                       */ 02194000
*/*%INCLUDE SYSUT5  (IRARMMS2)                                       */ 02195000
*/*%INCLUDE SYSUT5  (IRARMMS6)                                       */ 02196000
*/*%INCLUDE SYSUT5  (IRARMASM)                                       */ 02197000
*/*%INCLUDE SYSUT5  (IRARMSQA)                                       */ 02198000
*/*%INCLUDE SYSUT5  (STEAL   )                                       */ 02199000
*                                                                  0515 02200000
*       ;                                                          0515 02201000
@DATA    DS    0H                                                       02202000
@CH02148 DC    H'254'                                                   02203000
@CH02154 DC    H'32767'                                                 02204000
         DS    0F                                                       02205000
         DS    0F                                                       02206000
@CF00090 DC    F'1'                                                     02207000
@CF00188 DC    F'2'                                                     02208000
@CF00050 DC    F'4'                                                     02209000
@CF00164 DC    F'8'                                                     02210000
@CF01137 DC    F'20'                                                    02211000
@CF02150 DC    F'100'                                                   02212000
@CH02150 EQU   @CF02150+2                                               02213000
@CF02152 DC    F'1000'                                                  02214000
@CF02211 DC    F'-8'                                                    02215000
@CF02209 DC    F'-1'                                                    02216000
         DS    0D                                                       02217000
RFRLAST  DC    AL4(RFRLST1+10*8)                                        02218000
PRXEND   DS    A                                                        02219000
ASMTIME  DS    F                                                        02220000
HFIXOUCB DS    A                                                        02221000
MSXBUMP  DS    F                                                        02222000
STLCNT   DC    F'2'                                                     02223000
PRCRI    DS    H                                                        02224000
PRSCT    DS    H                                                        02225000
         DS    0D                                                       02226000
@TS00001 DS    CL8                                                      02227000
@CC02185 DC    C'OUCB'                                                  02228000
PRFLGS   DS    BL1                                                      02229000
         ORG   PRFLGS                                                   02230000
PRNCH    DS    BL1                                                      02231000
PRUICU   EQU   PRFLGS+0                                                 02232000
@NM00037 EQU   PRFLGS+0                                                 02233000
         ORG   PRFLGS+1                                                 02234000
WRKAREA1 DS    CL2                                                      02235000
WRKAREA2 DS    CL2                                                      02236000
MASK     DC    X'00F0'                                                  02237000
FLAGS    DC    X'00'                                                    02238000
         ORG   FLAGS                                                    02239000
FIRSTIME DS    BL1                                                      02240000
UPPVTUIC EQU   FLAGS+0                                                  02241000
UPCOMUIC EQU   FLAGS+0                                                  02242000
@NM00038 EQU   FLAGS+0                                                  02243000
         ORG   FLAGS+1                                                  02244000
         DS    CL4                                                      02245000
RFRLST1  DC    10X'0000000000000000'                                    02246000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02247000
@01      EQU   01                                                       02248000
@02      EQU   02                                                       02249000
@03      EQU   03                                                       02250000
@04      EQU   04                                                       02251000
@05      EQU   05                                                       02252000
@06      EQU   06                                                       02253000
@07      EQU   07                                                       02254000
@08      EQU   08                                                       02255000
@09      EQU   09                                                       02256000
@10      EQU   10                                                       02257000
@11      EQU   11                                                       02258000
@12      EQU   12                                                       02259000
@13      EQU   13                                                       02260000
@14      EQU   14                                                       02261000
@15      EQU   15                                                       02262000
ASMPER   EQU   @07                                                      02263000
FIXOUCB  EQU   @08                                                      02264000
FIXINDEX EQU   @07                                                      02265000
HFIXCNT  EQU   @07                                                      02266000
INSWAPCT EQU   @08                                                      02267000
ASMHIRTE EQU   @11                                                      02268000
ASMRATE  EQU   @07                                                      02269000
ASMOUCB  EQU   @08                                                      02270000
ASMX     EQU   @07                                                      02271000
ASMRATIO EQU   @10                                                      02272000
MSX      EQU   @10                                                      02273000
PRSTCNT  EQU   @11                                                      02274000
DMDTPTR  EQU   @07                                                      02275000
R0       EQU   @00                                                      02276000
R1       EQU   @01                                                      02277000
RMCTPTR  EQU   @02                                                      02278000
RRPAPTR  EQU   @03                                                      02279000
OUCBPTR  EQU   @04                                                      02280000
ASCBPTR  EQU   @05                                                      02281000
OUXBPTR  EQU   @06                                                      02282000
SVEREG   EQU   @13                                                      02283000
RTNREG   EQU   @14                                                      02284000
NTRREG   EQU   @15                                                      02285000
RTNCOD   EQU   @15                                                      02286000
RFRPTR   EQU   @01                                                      02287000
PRX      EQU   @08                                                      02288000
MSGPTR   EQU   @01                                                      02289000
PSA      EQU   0                                                        02290000
FLCRNPSW EQU   PSA                                                      02291000
FLCROPSW EQU   PSA+8                                                    02292000
FLCICCW2 EQU   PSA+16                                                   02293000
FLCCVT   EQU   FLCICCW2                                                 02294000
PSAEEPSW EQU   PSA+132                                                  02295000
PSAESPSW EQU   PSA+136                                                  02296000
FLCSVILC EQU   PSAESPSW+1                                               02297000
PSAEPPSW EQU   PSA+140                                                  02298000
FLCPIILC EQU   PSAEPPSW+1                                               02299000
FLCPICOD EQU   PSAEPPSW+2                                               02300000
PSAPICOD EQU   FLCPICOD+1                                               02301000
FLCTEA   EQU   PSAEPPSW+4                                               02302000
FLCPER   EQU   PSA+152                                                  02303000
FLCMCLA  EQU   PSA+168                                                  02304000
FLCIOEL  EQU   FLCMCLA+4                                                02305000
FLCIOA   EQU   FLCMCLA+16                                               02306000
FLCFSA   EQU   FLCMCLA+80                                               02307000
PSASUPER EQU   PSA+552                                                  02308000
PSASUP1  EQU   PSASUPER                                                 02309000
PSASUP2  EQU   PSASUPER+1                                               02310000
PSASUP3  EQU   PSASUPER+2                                               02311000
PSASUP4  EQU   PSASUPER+3                                               02312000
PSACLHT  EQU   PSA+640                                                  02313000
PSALKSA  EQU   PSA+696                                                  02314000
PSAHLHI  EQU   PSA+760                                                  02315000
PSADSSFL EQU   PSA+836                                                  02316000
PSADSSF1 EQU   PSADSSFL                                                 02317000
PSADSSF3 EQU   PSADSSFL+2                                               02318000
PSADSSF4 EQU   PSADSSFL+3                                               02319000
PSARSVT  EQU   PSA+896                                                  02320000
IRARMRTN EQU   0                                                        02321000
RMCT     EQU   0                                                        02322000
RMCTWTQE EQU   RMCT+104                                                 02323000
RMCTINQE EQU   RMCT+112                                                 02324000
RMCTTOD  EQU   RMCT+124                                                 02325000
RMCTFLGS EQU   RMCT+148                                                 02326000
RMCTDMDT EQU   RMCT+180                                                 02327000
RMCTDMDE EQU   RMCT+184                                                 02328000
CCT      EQU   RMCT+192                                                 02329000
CCVUTILP EQU   CCT+110                                                  02330000
CCTFLG1  EQU   CCT+124                                                  02331000
ICT      EQU   RMCT+320                                                 02332000
ICTFLAGS EQU   ICT+84                                                   02333000
MCT      EQU   RMCT+408                                                 02334000
MCCMS100 EQU   MCT+4                                                    02335000
MCCMS101 EQU   MCT+8                                                    02336000
MCCMS102 EQU   MCT+12                                                   02337000
MCCMS200 EQU   MCT+16                                                   02338000
MCCMS201 EQU   MCT+20                                                   02339000
MCCMS202 EQU   MCT+24                                                   02340000
MCCMS203 EQU   MCT+28                                                   02341000
MCCMS400 EQU   MCT+32                                                   02342000
MCCMS401 EQU   MCT+36                                                   02343000
MCCMS402 EQU   MCT+40                                                   02344000
MCCMS403 EQU   MCT+44                                                   02345000
MCCPLUS  EQU   MCT+48                                                   02346000
MCCASMT1 EQU   MCT+52                                                   02347000
MCCASMT2 EQU   MCT+54                                                   02348000
MCVSTCRI EQU   MCT+56                                                   02349000
MCVFRCNT EQU   MCT+58                                                   02350000
MCVAVQC  EQU   MCT+60                                                   02351000
MCTSFLGS EQU   MCT+64                                                   02352000
MCTSQA1  EQU   MCTSFLGS                                                 02353000
MCTSQA2  EQU   MCTSFLGS                                                 02354000
MCTAVQ1  EQU   MCTSFLGS                                                 02355000
MCTFAVQ  EQU   MCTSFLGS                                                 02356000
MCTOFLGS EQU   MCT+65                                                   02357000
MCTASM1  EQU   MCTOFLGS                                                 02358000
MCTAMS2  EQU   MCTOFLGS                                                 02359000
MCTSMS1  EQU   MCTOFLGS                                                 02360000
MCTSMS2  EQU   MCTOFLGS                                                 02361000
MCTFX1   EQU   MCTOFLGS                                                 02362000
MCTFX2   EQU   MCTOFLGS                                                 02363000
MCCUICBD EQU   MCT+68                                                   02364000
MCCUICIN EQU   MCT+72                                                   02365000
MCCPR1IN EQU   MCT+76                                                   02366000
MCCINTMX EQU   MCT+80                                                   02367000
RCT      EQU   RMCT+504                                                 02368000
RMPT     EQU   RMCT+592                                                 02369000
RMCA     EQU   RMCT+664                                                 02370000
RMCAFLGS EQU   RMCA+36                                                  02371000
RMCASRC  EQU   RMCA+124                                                 02372000
RMEX     EQU   RMCT+832                                                 02373000
RMEPBEVT EQU   RMEX                                                     02374000
RMEPBCTL EQU   RMEX+16                                                  02375000
RMSB     EQU   RMCT+896                                                 02376000
RMSBI03  EQU   RMSB+4                                                   02377000
RMSBI09  EQU   RMSB+28                                                  02378000
RMSBCRL  EQU   RMSB+36                                                  02379000
RMSBCRN  EQU   RMSB+40                                                  02380000
RMSBCRY  EQU   RMSB+44                                                  02381000
EPAT     EQU   RMCT+1016                                                02382000
RMEPBPR5 EQU   EPAT+144                                                 02383000
RMEPBMS2 EQU   EPAT+160                                                 02384000
RMEPBPR1 EQU   EPAT+368                                                 02385000
EPDT     EQU   RMCT+1416                                                02386000
RMEPBRPS EQU   EPDT+80                                                  02387000
EPST     EQU   RMCT+1512                                                02388000
RMEPBWM3 EQU   EPST                                                     02389000
EPSTWM3  EQU   RMEPBWM3                                                 02390000
RMEPBIL3 EQU   EPST+16                                                  02391000
RMEPBCL3 EQU   EPST+32                                                  02392000
RMEPBCSO EQU   EPST+48                                                  02393000
RMEPBCSI EQU   EPST+64                                                  02394000
RRPA     EQU   0                                                        02395000
RRPAINC  EQU   RRPA                                                     02396000
RRPAVPGN EQU   RRPAINC+2                                                02397000
RRPAFLG0 EQU   RRPAVPGN                                                 02398000
RRPAINP  EQU   RRPA+4                                                   02399000
RRPAFLG  EQU   RRPA+8                                                   02400000
RRPAINS  EQU   RRPA+16                                                  02401000
RRPAEPA  EQU   RRPA+20                                                  02402000
ASCB     EQU   0                                                        02403000
ASCBSUPC EQU   ASCB+16                                                  02404000
ASCBRSM  EQU   ASCB+52                                                  02405000
ASCBRSMF EQU   ASCBRSM                                                  02406000
ASCBEJST EQU   ASCB+64                                                  02407000
ASCBFW1  EQU   ASCB+100                                                 02408000
ASCBRCTF EQU   ASCBFW1+2                                                02409000
ASCBFLG1 EQU   ASCBFW1+3                                                02410000
ASCBDSP1 EQU   ASCB+114                                                 02411000
ASCBFLG2 EQU   ASCB+115                                                 02412000
ASCBVSC  EQU   ASCB+120                                                 02413000
ASCBNVSC EQU   ASCB+122                                                 02414000
ASCBTCBS EQU   ASCB+124                                                 02415000
ASCBLKGP EQU   ASCB+128                                                 02416000
ASCBOUXB EQU   ASCB+148                                                 02417000
ASCBJBNI EQU   ASCB+172                                                 02418000
ASCBJBNS EQU   ASCB+176                                                 02419000
ASCBSRQ  EQU   ASCB+180                                                 02420000
ASCBSRQ1 EQU   ASCBSRQ                                                  02421000
ASCBSRQ2 EQU   ASCBSRQ+1                                                02422000
ASCBSRQ3 EQU   ASCBSRQ+2                                                02423000
ASCBSRQ4 EQU   ASCBSRQ+3                                                02424000
OUCB     EQU   0                                                        02425000
OUCBNAME EQU   OUCB                                                     02426000
OUCBFWD  EQU   OUCB+4                                                   02427000
OUCBQFL  EQU   OUCB+16                                                  02428000
OUCBGOO  EQU   OUCBQFL                                                  02429000
OUCBGOI  EQU   OUCBQFL                                                  02430000
OUCBGOB  EQU   OUCBQFL                                                  02431000
OUCBOFF  EQU   OUCBQFL                                                  02432000
OUCBOUT  EQU   OUCBQFL                                                  02433000
OUCBSFL  EQU   OUCB+17                                                  02434000
OUCBNSW  EQU   OUCBSFL                                                  02435000
OUCBBIB  EQU   OUCBSFL                                                  02436000
OUCBPVL  EQU   OUCBSFL                                                  02437000
OUCBENQ  EQU   OUCBSFL                                                  02438000
OUCBYFL  EQU   OUCB+18                                                  02439000
OUCBAXS  EQU   OUCBYFL                                                  02440000
OUCBFXS  EQU   OUCBYFL                                                  02441000
OUCBAFL  EQU   OUCB+19                                                  02442000
OUCBTFL  EQU   OUCB+20                                                  02443000
OUCBEFL  EQU   OUCB+21                                                  02444000
OUCBQSC  EQU   OUCBEFL                                                  02445000
OUCBMWT  EQU   OUCBEFL                                                  02446000
OUCBUFL  EQU   OUCB+23                                                  02447000
OUCBJSFS EQU   OUCBUFL                                                  02448000
OUCBJSAS EQU   OUCBUFL                                                  02449000
OUCBSRC  EQU   OUCB+37                                                  02450000
OUCBASCB EQU   OUCB+40                                                  02451000
OUCBCSW  EQU   OUCB+84                                                  02452000
OUCBCFL  EQU   OUCBCSW+2                                                02453000
OUCBPSS  EQU   OUCB+112                                                 02454000
OUXB     EQU   0                                                        02455000
OUXBMET  EQU   OUXB+8                                                   02456000
OUXBSTCT EQU   OUXB+48                                                  02457000
OUXBSTD  EQU   OUXB+116                                                 02458000
OUXBVSC  EQU   OUXB+132                                                 02459000
OUXBUIC  EQU   OUXB+134                                                 02460000
OUXBNVC  EQU   OUXB+136                                                 02461000
OUXBFIXC EQU   OUXB+138                                                 02462000
RSMHD    EQU   0                                                        02463000
RSMFLG1  EQU   RSMHD+12                                                 02464000
RSMCNTFX EQU   RSMHD+14                                                 02465000
RSMQS    EQU   RSMHD+20                                                 02466000
RSMLFQ   EQU   RSMQS                                                    02467000
RSMLSQA  EQU   RSMQS+4                                                  02468000
RSMLIOQ  EQU   RSMQS+8                                                  02469000
RMEP     EQU   0                                                        02470000
RMEPEPB  EQU   RMEP                                                     02471000
RMEPFLG  EQU   RMEPEPB+8                                                02472000
RMEPSCH  EQU   RMEP+16                                                  02473000
RMEPINT  EQU   RMEPSCH+12                                               02474000
DMDT     EQU   0                                                        02475000
DMDTLO   EQU   DMDT+1                                                   02476000
DMDTMPLT EQU   DMDT+4                                                   02477000
DMDTINCU EQU   DMDT+14                                                  02478000
PVT      EQU   0                                                        02479000
PVTFLAG1 EQU   PVT                                                      02480000
PVTFLAG2 EQU   PVT+1                                                    02481000
PVTAFC   EQU   PVT+2                                                    02482000
PVTAFCOK EQU   PVT+6                                                    02483000
PVTPOOL  EQU   PVT+8                                                    02484000
PVTQS    EQU   PVT+304                                                  02485000
PVTWSAX  EQU   PVT+344                                                  02486000
PVTMAXFX EQU   PVT+1822                                                 02487000
PVTFIXOK EQU   PVT+1826                                                 02488000
PVTCNTFX EQU   PVT+1830                                                 02489000
PVTCHUIC EQU   PVT+1836                                                 02490000
ASMVT    EQU   0                                                        02491000
ASMFLAG1 EQU   ASMVT                                                    02492000
ASMFLAG2 EQU   ASMVT+1                                                  02493000
ASMSTAGQ EQU   ASMVT+32                                                 02494000
ASMPCCWQ EQU   ASMVT+64                                                 02495000
ASMSLOTS EQU   ASMVT+112                                                02496000
ASMVSC   EQU   ASMVT+116                                                02497000
ASMNVSC  EQU   ASMVT+120                                                02498000
ASMERRS  EQU   ASMVT+124                                                02499000
ASMLSAI  EQU   ASMVT+144                                                02500000
ASMGOSQS EQU   ASMVT+152                                                02501000
ASMWKSA1 EQU   ASMVT+368                                                02502000
ASMWKSA2 EQU   ASMVT+448                                                02503000
ASMWKSA3 EQU   ASMVT+528                                                02504000
ASMWKSA4 EQU   ASMVT+608                                                02505000
ASMWKSA5 EQU   ASMVT+688                                                02506000
ASMPOOLS EQU   0                                                        02507000
ASMCPAVQ EQU   ASMPOOLS+8                                               02508000
ASMCPRSQ EQU   ASMPOOLS+16                                              02509000
CVTMAP   EQU   0                                                        02510000
CVTDAR   EQU   CVTMAP+72                                                02511000
CVTFLGS1 EQU   CVTDAR                                                   02512000
CVTDCB   EQU   CVTMAP+116                                               02513000
CVTIOQET EQU   CVTMAP+120                                               02514000
CVTIERLC EQU   CVTMAP+144                                               02515000
CVTHEAD  EQU   CVTMAP+160                                               02516000
CVTSV76C EQU   CVTHEAD                                                  02517000
CVTOPTA  EQU   CVTMAP+182                                               02518000
CVTOPTB  EQU   CVTMAP+183                                               02519000
CVTGTF   EQU   CVTMAP+236                                               02520000
CVTGTFST EQU   CVTGTF                                                   02521000
CVTGTFS  EQU   CVTGTFST                                                 02522000
CVTSTATE EQU   CVTGTFST                                                 02523000
CVTTMODE EQU   CVTGTFST                                                 02524000
CVTFORM  EQU   CVTGTFST                                                 02525000
CVTAQAVT EQU   CVTMAP+240                                               02526000
CVTTCMFG EQU   CVTAQAVT                                                 02527000
CVTVOLM2 EQU   CVTMAP+244                                               02528000
CVTTATA  EQU   CVTVOLM2                                                 02529000
CVTTSKS  EQU   CVTTATA                                                  02530000
CVTVOLF2 EQU   CVTTSKS                                                  02531000
CVTTAT   EQU   CVTTATA+1                                                02532000
CVTATER  EQU   CVTMAP+248                                               02533000
CVTEXT1  EQU   CVTMAP+252                                               02534000
CVTPURG  EQU   CVTMAP+260                                               02535000
CVTQMSG  EQU   CVTMAP+268                                               02536000
CVTDMSR  EQU   CVTMAP+272                                               02537000
CVTRSV37 EQU   CVTDMSR                                                  02538000
CVTDMSRF EQU   CVTRSV37                                                 02539000
CVTERPV  EQU   CVTMAP+316                                               02540000
CVTINTLA EQU   CVTMAP+320                                               02541000
CVTAPF   EQU   CVTMAP+324                                               02542000
CVTEXT2  EQU   CVTMAP+328                                               02543000
CVTHJES  EQU   CVTMAP+332                                               02544000
CVTPGSIA EQU   CVTMAP+348                                               02545000
CVTA1F1  EQU   CVTMAP+356                                               02546000
CVTSYSK  EQU   CVTMAP+357                                               02547000
CVTVOLM1 EQU   CVTMAP+380                                               02548000
CVTVOLF1 EQU   CVTVOLM1                                                 02549000
CVTATMCT EQU   CVTMAP+388                                               02550000
CVTXTNT1 EQU   0                                                        02551000
CVTXTNT2 EQU   0                                                        02552000
CVTDSSV  EQU   CVTXTNT2                                                 02553000
CVTFLGBT EQU   CVTXTNT2+5                                               02554000
CVTQID   EQU   CVTXTNT2+24                                              02555000
CVTRV400 EQU   CVTXTNT2+52                                              02556000
CVTRV409 EQU   CVTXTNT2+53                                              02557000
CVTATCVT EQU   CVTXTNT2+64                                              02558000
CVTRV429 EQU   CVTXTNT2+84                                              02559000
CVTRV438 EQU   CVTXTNT2+85                                              02560000
CVTRV457 EQU   CVTXTNT2+112                                             02561000
CVTRV466 EQU   CVTXTNT2+113                                             02562000
CVTFIX   EQU   0                                                        02563000
CVTRELNO EQU   CVTFIX+252                                               02564000
RPRFRINT EQU   0                                                        02565000
RPRFRSCT EQU   RPRFRINT                                                 02566000
RPRFRINV EQU   RPRFRINT+2                                               02567000
RPRFRCRI EQU   RPRFRINT+3                                               02568000
RPRFRUSR EQU   RPRFRINT+4                                               02569000
RPRFREND EQU   RPRFRUSR                                                 02570000
RPRASCBA EQU   RPRFRUSR+1                                               02571000
ASMQE    EQU   0                                                        02572000
FIXQE    EQU   0                                                        02573000
ASMJOBN  EQU   47                                                       02574000
ASMALLOC EQU   12                                                       02575000
JOBNI    EQU   0                                                        02576000
JOBNS    EQU   0                                                        02577000
RSMJOBN  EQU   12                                                       02578000
IRARMNTR EQU   0                                                        02579000
RMEPPTR  EQU   RRPAEPA                                                  02580000
RSMHDPTR EQU   ASCBRSM                                                  02581000
CVTS01   EQU   CVTPGSIA                                                 02582000
CVTPVTP  EQU   CVTS01+8                                                 02583000
CVTLPDIA EQU   CVTS01+12                                                02584000
CVTDIRST EQU   CVTLPDIA                                                 02585000
CVTSLIDA EQU   CVTS01+24                                                02586000
CVTCTLFG EQU   CVTS01+50                                                02587000
CVTASMVT EQU   CVTS01+356                                               02588000
CVTRV210 EQU   CVTS01+424                                               02589000
CVTRV219 EQU   CVTS01+425                                               02590000
CVTRV228 EQU   CVTS01+426                                               02591000
CVTRV237 EQU   CVTS01+427                                               02592000
CVTMFRTR EQU   CVTS01+452                                               02593000
CVTRV262 EQU   CVTS01+468                                               02594000
CVTRV271 EQU   CVTS01+469                                               02595000
CVTRV280 EQU   CVTS01+470                                               02596000
CVTRV289 EQU   CVTS01+471                                               02597000
CVTGSDA  EQU   CVTS01+600                                               02598000
PVTPTR   EQU   CVTPVTP                                                  02599000
ASMVTPTR EQU   CVTASMVT                                                 02600000
ASM1WKSV EQU   ASMWKSA1                                                 02601000
ASM1RGSV EQU   ASM1WKSV                                                 02602000
ASM1WRKA EQU   ASM1WKSV+60                                              02603000
ASM2WKSV EQU   ASMWKSA2                                                 02604000
ASM2WRKA EQU   ASM2WKSV+52                                              02605000
ASM2FLGS EQU   ASM2WRKA+12                                              02606000
ASM3WKSV EQU   ASMWKSA3                                                 02607000
ASM4WKSV EQU   ASMWKSA4                                                 02608000
ASM4RGSV EQU   ASM4WKSV                                                 02609000
ASM5WKSV EQU   ASMWKSA5                                                 02610000
ASM5RGSV EQU   ASM5WKSV                                                 02611000
PSARSVTE EQU   PSARSVT                                                  02612000
CVTPTR   EQU   FLCCVT                                                   02613000
MSASCBET EQU   ASCBEJST+2                                               02614000
FLC      EQU   PSA                                                      02615000
PCPTR    EQU   CVTASMVT                                                 02616000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02617000
PSARSAV  EQU   PSARSVTE+60                                              02618000
PSARSTK  EQU   PSARSVTE+56                                              02619000
PSAESAV3 EQU   PSARSVTE+52                                              02620000
PSAESTK3 EQU   PSARSVTE+48                                              02621000
PSAESAV2 EQU   PSARSVTE+44                                              02622000
PSAESTK2 EQU   PSARSVTE+40                                              02623000
PSAESAV1 EQU   PSARSVTE+36                                              02624000
PSAESTK1 EQU   PSARSVTE+32                                              02625000
PSAPSAV  EQU   PSARSVTE+28                                              02626000
PSAPSTK  EQU   PSARSVTE+24                                              02627000
PSAMSAV  EQU   PSARSVTE+20                                              02628000
PSAMSTK  EQU   PSARSVTE+16                                              02629000
PSASSAV  EQU   PSARSVTE+12                                              02630000
PSASSTK  EQU   PSARSVTE+8                                               02631000
PSANSTK  EQU   PSARSVTE+4                                               02632000
PSACSTK  EQU   PSARSVTE                                                 02633000
ASM5FLGS EQU   ASM5WKSV+64                                              02634000
ASM5AIA  EQU   ASM5WKSV+60                                              02635000
ASM5GCTR EQU   ASM5WKSV+56                                              02636000
ASM5SR14 EQU   ASM5WKSV+52                                              02637000
@NM00008 EQU   ASM5RGSV+4                                               02638000
ASM5RG2  EQU   ASM5RGSV                                                 02639000
@NM00007 EQU   ASM4RGSV+4                                               02640000
ASM4RG2  EQU   ASM4RGSV                                                 02641000
ASM3SR13 EQU   ASM3WKSV+28                                              02642000
ASM3R14B EQU   ASM3WKSV+24                                              02643000
ASM3R14A EQU   ASM3WKSV+20                                              02644000
ASM3GRPA EQU   ASM3WKSV+16                                              02645000
ASM3TMPA EQU   ASM3WKSV+12                                              02646000
ASM3PIOP EQU   ASM3WKSV+8                                               02647000
ASM3GENQ EQU   ASM3WKSV+4                                               02648000
ASM3SWPQ EQU   ASM3WKSV                                                 02649000
ASM2SR14 EQU   ASM2WRKA+16                                              02650000
@NM00006 EQU   ASM2WRKA+13                                              02651000
ASM2WFLG EQU   ASM2FLGS                                                 02652000
ASM2RFLG EQU   ASM2FLGS                                                 02653000
ASM2DUPQ EQU   ASM2WRKA+8                                               02654000
ASM2CAQ  EQU   ASM2WRKA+4                                               02655000
ASM2PAQ  EQU   ASM2WRKA                                                 02656000
ASM2RGSV EQU   ASM2WKSV                                                 02657000
ASM1NXTA EQU   ASM1WRKA+4                                               02658000
ASM1ASCB EQU   ASM1WRKA                                                 02659000
ASM1RG15 EQU   ASM1RGSV+56                                              02660000
@NM00005 EQU   ASM1RGSV+4                                               02661000
ASM1RG1  EQU   ASM1RGSV                                                 02662000
CVTRV628 EQU   CVTS01+728                                               02663000
CVTRV627 EQU   CVTS01+724                                               02664000
CVTRV626 EQU   CVTS01+720                                               02665000
CVTRV625 EQU   CVTS01+716                                               02666000
CVTRV624 EQU   CVTS01+712                                               02667000
CVTRV623 EQU   CVTS01+708                                               02668000
CVTRV622 EQU   CVTS01+704                                               02669000
CVTRV621 EQU   CVTS01+700                                               02670000
CVTIHASU EQU   CVTS01+696                                               02671000
CVTSUSP  EQU   CVTS01+692                                               02672000
CVTT6SVC EQU   CVTS01+688                                               02673000
CVTCDAL  EQU   CVTS01+684                                               02674000
CVTTCTL  EQU   CVTS01+680                                               02675000
CVTRSUME EQU   CVTS01+676                                               02676000
CVTJTERM EQU   CVTS01+672                                               02677000
CVTASMRM EQU   CVTS01+668                                               02678000
CVTTCASP EQU   CVTS01+664                                               02679000
CVT0PT03 EQU   CVTS01+660                                               02680000
CVT0PT0E EQU   CVTS01+656                                               02681000
CVTRV609 EQU   CVTS01+652                                               02682000
CVTCGK   EQU   CVTS01+648                                               02683000
CVTRAC   EQU   CVTS01+644                                               02684000
CVTHSM   EQU   CVTS01+640                                               02685000
CVTRV605 EQU   CVTS01+636                                               02686000
CVTRV604 EQU   CVTS01+632                                               02687000
CVTEFF02 EQU   CVTS01+628                                               02688000
CVTCBBR  EQU   CVTS01+624                                               02689000
CVTSSCR  EQU   CVTS01+620                                               02690000
CVTEVENT EQU   CVTS01+616                                               02691000
CVTCRCA  EQU   CVTS01+612                                               02692000
CVTTPIO  EQU   CVTS01+608                                               02693000
CVTADV   EQU   CVTS01+604                                               02694000
CVTGSDAB EQU   CVTGSDA                                                  02695000
CVTQV3   EQU   CVTS01+596                                               02696000
CVTQV2   EQU   CVTS01+592                                               02697000
CVTQV1   EQU   CVTS01+588                                               02698000
CVTRPT   EQU   CVTS01+584                                               02699000
CVTSSRB  EQU   CVTS01+580                                               02700000
CVTCSDRL EQU   CVTS01+576                                               02701000
CVTEXP1  EQU   CVTS01+572                                               02702000
CVTRMPMT EQU   CVTS01+568                                               02703000
CVTRMPTT EQU   CVTS01+564                                               02704000
CVTVPSA  EQU   CVTS01+560                                               02705000
CVTVSTOP EQU   CVTS01+556                                               02706000
CVTGTFR8 EQU   CVTS01+552                                               02707000
CVTQUIT  EQU   CVTS01+548                                               02708000
CVTVACR  EQU   CVTS01+544                                               02709000
CVTWTCB  EQU   CVTS01+540                                               02710000
CVTSTPRS EQU   CVTS01+536                                               02711000
CVT0PT02 EQU   CVTS01+532                                               02712000
CVTDARCM EQU   CVTS01+528                                               02713000
CVTIRECM EQU   CVTS01+524                                               02714000
CVTJRECM EQU   CVTS01+520                                               02715000
CVTVEMS0 EQU   CVTS01+516                                               02716000
CVTSPFRR EQU   CVTS01+512                                               02717000
CVTRLSTG EQU   CVTS01+508                                               02718000
CVT0TC0A EQU   CVTS01+504                                               02719000
CVTGMBR  EQU   CVTS01+500                                               02720000
CVTLFRM  EQU   CVTS01+496                                               02721000
CVTRMBR  EQU   CVTS01+492                                               02722000
CVTVIOP  EQU   CVTS01+488                                               02723000
CVTRV307 EQU   CVTS01+486                                               02724000
CVTRV306 EQU   CVTS01+484                                               02725000
CVTRV305 EQU   CVTS01+482                                               02726000
CVTRV304 EQU   CVTS01+480                                               02727000
CVTRV303 EQU   CVTS01+478                                               02728000
CVTRV302 EQU   CVTS01+476                                               02729000
CVTTRCA  EQU   CVTS01+472                                               02730000
CVTRV297 EQU   CVTRV289                                                 02731000
CVTRV296 EQU   CVTRV289                                                 02732000
CVTRV295 EQU   CVTRV289                                                 02733000
CVTRV294 EQU   CVTRV289                                                 02734000
CVTRV293 EQU   CVTRV289                                                 02735000
CVTRV292 EQU   CVTRV289                                                 02736000
CVTRV291 EQU   CVTRV289                                                 02737000
CVTRV290 EQU   CVTRV289                                                 02738000
CVTRV288 EQU   CVTRV280                                                 02739000
CVTRV287 EQU   CVTRV280                                                 02740000
CVTRV286 EQU   CVTRV280                                                 02741000
CVTRV285 EQU   CVTRV280                                                 02742000
CVTRV284 EQU   CVTRV280                                                 02743000
CVTRV283 EQU   CVTRV280                                                 02744000
CVTRV282 EQU   CVTRV280                                                 02745000
CVTRV281 EQU   CVTRV280                                                 02746000
CVTRV279 EQU   CVTRV271                                                 02747000
CVTRV278 EQU   CVTRV271                                                 02748000
CVTRV277 EQU   CVTRV271                                                 02749000
CVTRV276 EQU   CVTRV271                                                 02750000
CVTRV275 EQU   CVTRV271                                                 02751000
CVTRV274 EQU   CVTRV271                                                 02752000
CVTRV273 EQU   CVTRV271                                                 02753000
CVTRV272 EQU   CVTRV271                                                 02754000
CVTRV270 EQU   CVTRV262                                                 02755000
CVTRV269 EQU   CVTRV262                                                 02756000
CVTRV268 EQU   CVTRV262                                                 02757000
CVTRV267 EQU   CVTRV262                                                 02758000
CVTRV266 EQU   CVTRV262                                                 02759000
CVTRV265 EQU   CVTRV262                                                 02760000
CVTRV264 EQU   CVTRV262                                                 02761000
CVTRV263 EQU   CVTRV262                                                 02762000
CVTVFP   EQU   CVTS01+464                                               02763000
CVTVSI   EQU   CVTS01+460                                               02764000
CVTVPSIB EQU   CVTS01+456                                               02765000
CVTMFACT EQU   CVTMFRTR                                                 02766000
CVTMFCTL EQU   CVTS01+448                                               02767000
CVTPVBP  EQU   CVTS01+444                                               02768000
CVTPWI   EQU   CVTS01+440                                               02769000
CVTRV254 EQU   CVTS01+438                                               02770000
CVTRV253 EQU   CVTS01+436                                               02771000
CVTRV252 EQU   CVTS01+434                                               02772000
CVTRV251 EQU   CVTS01+433                                               02773000
CVTRV250 EQU   CVTS01+432                                               02774000
CVTRV249 EQU   CVTS01+431                                               02775000
CVTRV248 EQU   CVTS01+430                                               02776000
CVTRV247 EQU   CVTS01+429                                               02777000
CVTRV246 EQU   CVTS01+428                                               02778000
CVTRV245 EQU   CVTRV237                                                 02779000
CVTRV244 EQU   CVTRV237                                                 02780000
CVTRV243 EQU   CVTRV237                                                 02781000
CVTRV242 EQU   CVTRV237                                                 02782000
CVTRV241 EQU   CVTRV237                                                 02783000
CVTRV240 EQU   CVTRV237                                                 02784000
CVTRV239 EQU   CVTRV237                                                 02785000
CVTRV238 EQU   CVTRV237                                                 02786000
CVTRV236 EQU   CVTRV228                                                 02787000
CVTRV235 EQU   CVTRV228                                                 02788000
CVTRV234 EQU   CVTRV228                                                 02789000
CVTRV233 EQU   CVTRV228                                                 02790000
CVTRV232 EQU   CVTRV228                                                 02791000
CVTRV231 EQU   CVTRV228                                                 02792000
CVTRV230 EQU   CVTRV228                                                 02793000
CVTRV229 EQU   CVTRV228                                                 02794000
CVTRV227 EQU   CVTRV219                                                 02795000
CVTRV226 EQU   CVTRV219                                                 02796000
CVTRV225 EQU   CVTRV219                                                 02797000
CVTRV224 EQU   CVTRV219                                                 02798000
CVTRV223 EQU   CVTRV219                                                 02799000
CVTRV222 EQU   CVTRV219                                                 02800000
CVTRV221 EQU   CVTRV219                                                 02801000
CVTRV220 EQU   CVTRV219                                                 02802000
CVTRV218 EQU   CVTRV210                                                 02803000
CVTRV217 EQU   CVTRV210                                                 02804000
CVTRV216 EQU   CVTRV210                                                 02805000
CVTRV215 EQU   CVTRV210                                                 02806000
CVTRV214 EQU   CVTRV210                                                 02807000
CVTRV213 EQU   CVTRV210                                                 02808000
CVTRV212 EQU   CVTRV210                                                 02809000
CVTRV211 EQU   CVTRV210                                                 02810000
CVTLCCAT EQU   CVTS01+420                                               02811000
CVTPCCAT EQU   CVTS01+416                                               02812000
CVTIPCRP EQU   CVTS01+412                                               02813000
CVTIPCRI EQU   CVTS01+408                                               02814000
CVTIPCDS EQU   CVTS01+404                                               02815000
CVTAIDVT EQU   CVTS01+400                                               02816000
CVTSSAP  EQU   CVTS01+396                                               02817000
CVTEHCIR EQU   CVTS01+392                                               02818000
CVTEHDEF EQU   CVTS01+388                                               02819000
CVTDAIR  EQU   CVTS01+384                                               02820000
CVTPERFM EQU   CVTS01+380                                               02821000
CVT044R2 EQU   CVTS01+376                                               02822000
CVTFETCH EQU   CVTS01+372                                               02823000
CVTRSTWD EQU   CVTS01+368                                               02824000
CVTSPOST EQU   CVTS01+364                                               02825000
CVTIOBP  EQU   CVTS01+360                                               02826000
CVTRECRQ EQU   CVTS01+352                                               02827000
CVTWSAC  EQU   CVTS01+348                                               02828000
CVTRV149 EQU   CVTS01+344                                               02829000
CVTWSAL  EQU   CVTS01+340                                               02830000
CVTSPSA  EQU   CVTS01+336                                               02831000
CVTGLMN  EQU   CVTS01+332                                               02832000
CVTVEAC0 EQU   CVTS01+328                                               02833000
CVT062R1 EQU   CVTS01+324                                               02834000
CVTRPOST EQU   CVTS01+320                                               02835000
CVTDQIQE EQU   CVTS01+316                                               02836000
CVTCSD   EQU   CVTS01+312                                               02837000
CVTLKRMA EQU   CVTS01+308                                               02838000
CVTRSPIE EQU   CVTS01+304                                               02839000
CVTRENQ  EQU   CVTS01+300                                               02840000
CVTLQCB  EQU   CVTS01+296                                               02841000
CVTFQCB  EQU   CVTS01+292                                               02842000
CVTQCS01 EQU   CVTS01+288                                               02843000
CVTAPFT  EQU   CVTS01+284                                               02844000
CVTPARRL EQU   CVTS01+280                                               02845000
CVTVWAIT EQU   CVTS01+276                                               02846000
CVTGSPL  EQU   CVTS01+272                                               02847000
CVTLSMQ  EQU   CVTS01+268                                               02848000
CVTGSMQ  EQU   CVTS01+264                                               02849000
CVTEXPRO EQU   CVTS01+260                                               02850000
CVTOPCTP EQU   CVTS01+256                                               02851000
CVTSIC   EQU   CVTS01+252                                               02852000
CVTTPIOS EQU   CVTS01+248                                               02853000
CVTRTMS  EQU   CVTS01+244                                               02854000
CVTSDBF  EQU   CVTS01+240                                               02855000
CVTSCBP  EQU   CVTS01+236                                               02856000
CVTSDMP  EQU   CVTS01+232                                               02857000
CVTSV60  EQU   CVTS01+228                                               02858000
CVTRTMCT EQU   CVTS01+224                                               02859000
CVTASCBL EQU   CVTS01+220                                               02860000
CVTASCBH EQU   CVTS01+216                                               02861000
CVTGDA   EQU   CVTS01+212                                               02862000
CVTASVT  EQU   CVTS01+208                                               02863000
CVTVVMDI EQU   CVTS01+204                                               02864000
CVTAQTOP EQU   CVTS01+200                                               02865000
CVTIOSCS EQU   CVTS01+196                                               02866000
CVTSDRM  EQU   CVTS01+192                                               02867000
CVTOPTE  EQU   CVTS01+188                                               02868000
CVTSTXU  EQU   CVTS01+184                                               02869000
CVTQUIS  EQU   CVTS01+180                                               02870000
CVTPARS  EQU   CVTS01+176                                               02871000
CVTS1EE  EQU   CVTS01+172                                               02872000
CVTFRAS  EQU   CVTS01+168                                               02873000
CVTQSAS  EQU   CVTS01+164                                               02874000
CVTCRAS  EQU   CVTS01+160                                               02875000
CVTCRMN  EQU   CVTS01+156                                               02876000
CVTDELCP EQU   CVTS01+152                                               02877000
CVTFRECL EQU   CVTS01+148                                               02878000
CVTGETCL EQU   CVTS01+144                                               02879000
CVTBLDCP EQU   CVTS01+140                                               02880000
CVTAUTHL EQU   CVTS01+136                                               02881000
CVTSCAN  EQU   CVTS01+132                                               02882000
CVTRV144 EQU   CVTS01+130                                               02883000
CVTMAXMP EQU   CVTS01+128                                               02884000
CVTSTCK  EQU   CVTS01+124                                               02885000
CVTRV139 EQU   CVTS01+123                                               02886000
CVTDSSAC EQU   CVTS01+122                                               02887000
CVTRV513 EQU   CVTS01+121                                               02888000
CVTIOSPL EQU   CVTS01+120                                               02889000
CVTPTGT  EQU   CVTS01+116                                               02890000
CVTCSPIE EQU   CVTS01+112                                               02891000
CVTSMFEX EQU   CVTS01+108                                               02892000
CVTOLT0A EQU   CVTS01+104                                               02893000
CVTSRBRT EQU   CVTS01+100                                               02894000
CVTPUTL  EQU   CVTS01+96                                                02895000
CVTASCRL EQU   CVTS01+92                                                02896000
CVTASCRF EQU   CVTS01+88                                                02897000
CVTRV326 EQU   CVTS01+84                                                02898000
CVTRV325 EQU   CVTS01+80                                                02899000
CVTRV324 EQU   CVTS01+76                                                02900000
CVT0VL01 EQU   CVTS01+72                                                02901000
CVTSHRVM EQU   CVTS01+68                                                02902000
CVTRV332 EQU   CVTS01+64                                                02903000
CVTTAS   EQU   CVTS01+60                                                02904000
CVTRSCN  EQU   CVTS01+56                                                02905000
CVTTRAC2 EQU   CVTS01+54                                                02906000
CVTTRACE EQU   CVTS01+52                                                02907000
CVTAPG   EQU   CVTS01+51                                                02908000
CVTSDTRC EQU   CVTCTLFG                                                 02909000
CVTGTRCE EQU   CVTCTLFG                                                 02910000
CVTNOMP  EQU   CVTCTLFG                                                 02911000
CVTRSV79 EQU   CVTCTLFG                                                 02912000
CVTDSTAT EQU   CVTCTLFG                                                 02913000
CVTRSV78 EQU   CVTCTLFG                                                 02914000
CVTRV333 EQU   CVTCTLFG                                                 02915000
CVTRV323 EQU   CVTCTLFG                                                 02916000
CVTSPVLK EQU   CVTS01+49                                                02917000
CVTRSV77 EQU   CVTS01+48                                                02918000
CVTRV331 EQU   CVTS01+44                                                02919000
CVTRV330 EQU   CVTS01+40                                                02920000
CVTRV329 EQU   CVTS01+36                                                02921000
CVTRV328 EQU   CVTS01+32                                                02922000
CVTRV322 EQU   CVTS01+28                                                02923000
CVTSLID  EQU   CVTSLIDA+1                                               02924000
CVTSYLK  EQU   CVTSLIDA                                                 02925000
CVTRV321 EQU   CVTS01+20                                                02926000
CVTRV320 EQU   CVTS01+16                                                02927000
CVTLPDIR EQU   CVTLPDIA+1                                               02928000
CVTRSV69 EQU   CVTDIRST                                                 02929000
CVTRSV68 EQU   CVTDIRST                                                 02930000
CVTRSV67 EQU   CVTDIRST                                                 02931000
CVTRSV66 EQU   CVTDIRST                                                 02932000
CVTRSV65 EQU   CVTDIRST                                                 02933000
CVTRSV64 EQU   CVTDIRST                                                 02934000
CVTRSV63 EQU   CVTDIRST                                                 02935000
CVTDICOM EQU   CVTDIRST                                                 02936000
CVTLPDSR EQU   CVTS01+4                                                 02937000
CVTGETL  EQU   CVTS01                                                   02938000
RPREND   EQU   RPRFRINT+8                                               02939000
@NM00036 EQU   RPRFRUSR                                                 02940000
@NM00035 EQU   RPRFRINV                                                 02941000
RPRFRUBI EQU   RPRFRINV                                                 02942000
RPRFRNCH EQU   RPRFRINV                                                 02943000
CVTLEVL  EQU   CVTRELNO+2                                               02944000
CVTNUMB  EQU   CVTRELNO                                                 02945000
CVTMDL   EQU   CVTFIX+250                                               02946000
@NM00034 EQU   CVTFIX+248                                               02947000
@NM00033 EQU   CVTFIX                                                   02948000
CVTRV482 EQU   CVTXTNT2+128                                             02949000
CVTRV481 EQU   CVTXTNT2+124                                             02950000
CVTRV480 EQU   CVTXTNT2+120                                             02951000
CVTRV479 EQU   CVTXTNT2+118                                             02952000
CVTRV478 EQU   CVTXTNT2+117                                             02953000
CVTRV477 EQU   CVTXTNT2+116                                             02954000
CVTRV476 EQU   CVTXTNT2+115                                             02955000
CVTRV475 EQU   CVTXTNT2+114                                             02956000
CVTRV474 EQU   CVTRV466                                                 02957000
CVTRV473 EQU   CVTRV466                                                 02958000
CVTRV472 EQU   CVTRV466                                                 02959000
CVTRV471 EQU   CVTRV466                                                 02960000
CVTRV470 EQU   CVTRV466                                                 02961000
CVTRV469 EQU   CVTRV466                                                 02962000
CVTRV468 EQU   CVTRV466                                                 02963000
CVTRV467 EQU   CVTRV466                                                 02964000
CVTRV465 EQU   CVTRV457                                                 02965000
CVTRV464 EQU   CVTRV457                                                 02966000
CVTRV463 EQU   CVTRV457                                                 02967000
CVTRV462 EQU   CVTRV457                                                 02968000
CVTRV461 EQU   CVTRV457                                                 02969000
CVTRV460 EQU   CVTRV457                                                 02970000
CVTRV459 EQU   CVTRV457                                                 02971000
CVTRV458 EQU   CVTRV457                                                 02972000
CVTRV456 EQU   CVTXTNT2+108                                             02973000
CVTRV455 EQU   CVTXTNT2+104                                             02974000
CVTRV454 EQU   CVTXTNT2+100                                             02975000
CVTRV453 EQU   CVTXTNT2+96                                              02976000
CVTRV452 EQU   CVTXTNT2+94                                              02977000
CVTRV451 EQU   CVTXTNT2+92                                              02978000
CVTRV450 EQU   CVTXTNT2+90                                              02979000
CVTRV449 EQU   CVTXTNT2+88                                              02980000
CVTRV448 EQU   CVTXTNT2+87                                              02981000
CVTRV447 EQU   CVTXTNT2+86                                              02982000
CVTRV446 EQU   CVTRV438                                                 02983000
CVTRV445 EQU   CVTRV438                                                 02984000
CVTRV444 EQU   CVTRV438                                                 02985000
CVTRV443 EQU   CVTRV438                                                 02986000
CVTRV442 EQU   CVTRV438                                                 02987000
CVTRV441 EQU   CVTRV438                                                 02988000
CVTRV440 EQU   CVTRV438                                                 02989000
CVTRV439 EQU   CVTRV438                                                 02990000
CVTRV437 EQU   CVTRV429                                                 02991000
CVTRV436 EQU   CVTRV429                                                 02992000
CVTRV435 EQU   CVTRV429                                                 02993000
CVTRV434 EQU   CVTRV429                                                 02994000
CVTRV433 EQU   CVTRV429                                                 02995000
CVTRV432 EQU   CVTRV429                                                 02996000
CVTRV431 EQU   CVTRV429                                                 02997000
CVTRV430 EQU   CVTRV429                                                 02998000
CVTRV428 EQU   CVTXTNT2+80                                              02999000
CVTRV427 EQU   CVTXTNT2+76                                              03000000
CVTRV426 EQU   CVTXTNT2+72                                              03001000
CVTRV425 EQU   CVTXTNT2+68                                              03002000
CVTATACT EQU   CVTATCVT                                                 03003000
CVTRV423 EQU   CVTXTNT2+62                                              03004000
CVTRV422 EQU   CVTXTNT2+60                                              03005000
CVTRV421 EQU   CVTXTNT2+58                                              03006000
CVTRV420 EQU   CVTXTNT2+56                                              03007000
CVTRV419 EQU   CVTXTNT2+55                                              03008000
CVTRV418 EQU   CVTXTNT2+54                                              03009000
CVTRV417 EQU   CVTRV409                                                 03010000
CVTRV416 EQU   CVTRV409                                                 03011000
CVTRV415 EQU   CVTRV409                                                 03012000
CVTRV414 EQU   CVTRV409                                                 03013000
CVTRV413 EQU   CVTRV409                                                 03014000
CVTRV412 EQU   CVTRV409                                                 03015000
CVTRV411 EQU   CVTRV409                                                 03016000
CVTRV410 EQU   CVTRV409                                                 03017000
CVTRV408 EQU   CVTRV400                                                 03018000
CVTRV407 EQU   CVTRV400                                                 03019000
CVTRV406 EQU   CVTRV400                                                 03020000
CVTRV405 EQU   CVTRV400                                                 03021000
CVTRV404 EQU   CVTRV400                                                 03022000
CVTRV403 EQU   CVTRV400                                                 03023000
CVTRV402 EQU   CVTRV400                                                 03024000
CVTRV401 EQU   CVTRV400                                                 03025000
CVTICB   EQU   CVTXTNT2+48                                              03026000
CVTSKTA  EQU   CVTXTNT2+44                                              03027000
CVTCCVT  EQU   CVTXTNT2+40                                              03028000
CVTRSV98 EQU   CVTXTNT2+36                                              03029000
CVTRSV97 EQU   CVTXTNT2+34                                              03030000
CVTRSV96 EQU   CVTXTNT2+32                                              03031000
CVTOLTEP EQU   CVTXTNT2+28                                              03032000
CVTQIDA  EQU   CVTQID+1                                                 03033000
CVTRSV95 EQU   CVTQID                                                   03034000
CVTRSV94 EQU   CVTXTNT2+20                                              03035000
CVTRSV93 EQU   CVTXTNT2+16                                              03036000
CVTRSV92 EQU   CVTXTNT2+12                                              03037000
CVTDEBVR EQU   CVTXTNT2+8                                               03038000
CVTRSV91 EQU   CVTXTNT2+6                                               03039000
CVTRSV9H EQU   CVTFLGBT                                                 03040000
CVTRSV9G EQU   CVTFLGBT                                                 03041000
CVTRSV9F EQU   CVTFLGBT                                                 03042000
CVTRSV9E EQU   CVTFLGBT                                                 03043000
CVTRSV9D EQU   CVTFLGBT                                                 03044000
CVTRSV9C EQU   CVTFLGBT                                                 03045000
CVTVME   EQU   CVTFLGBT                                                 03046000
CVTNPE   EQU   CVTFLGBT                                                 03047000
CVTNUCLS EQU   CVTXTNT2+4                                               03048000
CVTDSSVA EQU   CVTDSSV+1                                                03049000
CVTRSV89 EQU   CVTDSSV                                                  03050000
CVTRSV88 EQU   CVTXTNT1+8                                               03051000
CVTRSV87 EQU   CVTXTNT1+4                                               03052000
CVTFACHN EQU   CVTXTNT1                                                 03053000
CVTRV488 EQU   CVTMAP+412                                               03054000
CVTRV487 EQU   CVTMAP+408                                               03055000
CVTRV486 EQU   CVTMAP+404                                               03056000
CVTRV485 EQU   CVTMAP+400                                               03057000
CVTACTAP EQU   CVTMAP+396                                               03058000
CVTAUTH  EQU   CVTMAP+392                                               03059000
CVTATMCA EQU   CVTATMCT+1                                               03060000
CVTATMST EQU   CVTATMCT                                                 03061000
CVTRSV61 EQU   CVTMAP+384                                               03062000
CVTVOLT1 EQU   CVTVOLM1+1                                               03063000
CVTVOLI1 EQU   CVTVOLF1                                                 03064000
CVTSTOA  EQU   CVTMAP+376                                               03065000
CVTRSV58 EQU   CVTMAP+374                                               03066000
CVTRSV57 EQU   CVTMAP+372                                               03067000
CVTDDCE  EQU   CVTMAP+368                                               03068000
CVTPNWFR EQU   CVTMAP+364                                               03069000
CVTSMF   EQU   CVTMAP+360                                               03070000
CVTSULK  EQU   CVTMAP+358                                               03071000
CVTSLKO  EQU   CVTSYSK                                                  03072000
CVTSLKP  EQU   CVTSYSK                                                  03073000
CVTSLKQ  EQU   CVTSYSK                                                  03074000
CVTSLKR  EQU   CVTSYSK                                                  03075000
CVTRSV56 EQU   CVTSYSK                                                  03076000
CVTRSV55 EQU   CVTSYSK                                                  03077000
CVTRSV54 EQU   CVTSYSK                                                  03078000
CVTRSV53 EQU   CVTSYSK                                                  03079000
CVTRSV52 EQU   CVTA1F1                                                  03080000
CVTRSV51 EQU   CVTA1F1                                                  03081000
CVTRSV50 EQU   CVTA1F1                                                  03082000
CVTRSV49 EQU   CVTA1F1                                                  03083000
CVTRSV48 EQU   CVTA1F1                                                  03084000
CVTRSV47 EQU   CVTA1F1                                                  03085000
CVTSRSW  EQU   CVTA1F1                                                  03086000
CVTPFSW  EQU   CVTA1F1                                                  03087000
CVTPCVT  EQU   CVTMAP+352                                               03088000
CVTRSV46 EQU   CVTMAP+344                                               03089000
CVTRSV45 EQU   CVTMAP+340                                               03090000
CVTRSV44 EQU   CVTMAP+338                                               03091000
CVTRSV43 EQU   CVTMAP+336                                               03092000
CVTHJESA EQU   CVTHJES+1                                                03093000
CVTRSV42 EQU   CVTHJES                                                  03094000
CVTEXT2A EQU   CVTEXT2+1                                                03095000
CVTRSV41 EQU   CVTEXT2                                                  03096000
CVTAPFA  EQU   CVTAPF+1                                                 03097000
CVTRSV40 EQU   CVTAPF                                                   03098000
CVTRV518 EQU   CVTINTLA                                                 03099000
CVTRV517 EQU   CVTERPV                                                  03100000
CVTEORM  EQU   CVTMAP+312                                               03101000
CVTMCHPR EQU   CVTMAP+308                                               03102000
CVTTZ    EQU   CVTMAP+304                                               03103000
CVTJEPS  EQU   CVTMAP+300                                               03104000
CVTJESCT EQU   CVTMAP+296                                               03105000
CVTMODE  EQU   CVTMAP+292                                               03106000
CVTPTRV  EQU   CVTMAP+288                                               03107000
CVTREAL  EQU   CVTMAP+284                                               03108000
CVTRSV39 EQU   CVTMAP+280                                               03109000
CVTRSV38 EQU   CVTMAP+276                                               03110000
CVTDMSRA EQU   CVTDMSR+1                                                03111000
CVTRV634 EQU   CVTDMSRF                                                 03112000
CVTRV633 EQU   CVTDMSRF                                                 03113000
CVTRV632 EQU   CVTDMSRF                                                 03114000
CVTRV631 EQU   CVTDMSRF                                                 03115000
CVTRV630 EQU   CVTDMSRF                                                 03116000
CVTRV629 EQU   CVTDMSRF                                                 03117000
CVTUDUMP EQU   CVTDMSRF                                                 03118000
CVTSDUMP EQU   CVTDMSRF                                                 03119000
CVTQMSGA EQU   CVTQMSG+1                                                03120000
CVTRSV36 EQU   CVTQMSG                                                  03121000
CVTAMFF  EQU   CVTMAP+264                                               03122000
CVTPURGA EQU   CVTPURG+1                                                03123000
CVTRSV35 EQU   CVTPURG                                                  03124000
CVTCBSP  EQU   CVTMAP+256                                               03125000
CVTATERA EQU   CVTATER+1                                                03126000
CVTSYST  EQU   CVTATER                                                  03127000
CVTVOLT2 EQU   CVTTAT                                                   03128000
CVTVOLI2 EQU   CVTVOLF2                                                 03129000
CVTAQAVB EQU   CVTAQAVT+1                                               03130000
CVTRSV34 EQU   CVTTCMFG                                                 03131000
CVTRSV33 EQU   CVTTCMFG                                                 03132000
CVTRSV32 EQU   CVTTCMFG                                                 03133000
CVTRSV31 EQU   CVTTCMFG                                                 03134000
CVTRSV30 EQU   CVTTCMFG                                                 03135000
CVTRSV29 EQU   CVTTCMFG                                                 03136000
CVTLDEV  EQU   CVTTCMFG                                                 03137000
CVTTCRDY EQU   CVTTCMFG                                                 03138000
CVTGTFA  EQU   CVTGTF+1                                                 03139000
CVTRSV27 EQU   CVTGTFST                                                 03140000
CVTRNIO  EQU   CVTGTFST                                                 03141000
CVTUSR   EQU   CVTGTFST                                                 03142000
CVTRV318 EQU   CVTFORM                                                  03143000
CVTRV317 EQU   CVTTMODE                                                 03144000
CVTRV316 EQU   CVTSTATE                                                 03145000
CVTRV315 EQU   CVTGTFS                                                  03146000
CVTGTFAV EQU   CVTGTFS                                                  03147000
CVT0SCR1 EQU   CVTMAP+232                                               03148000
CVTRV515 EQU   CVTMAP+228                                               03149000
CVTRMS   EQU   CVTMAP+224                                               03150000
CVTPATCH EQU   CVTMAP+220                                               03151000
CVTTSCE  EQU   CVTMAP+216                                               03152000
CVTLNKSC EQU   CVTMAP+214                                               03153000
CVTQABST EQU   CVTMAP+212                                               03154000
CVTMDLDS EQU   CVTMAP+208                                               03155000
CVTUSER  EQU   CVTMAP+204                                               03156000
CVTABEND EQU   CVTMAP+200                                               03157000
CVTSMCA  EQU   CVTMAP+196                                               03158000
CVTRSV18 EQU   CVTMAP+192                                               03159000
CVTQLPAQ EQU   CVTMAP+188                                               03160000
CVTQCDSR EQU   CVTMAP+184                                               03161000
CVTRSV17 EQU   CVTOPTB                                                  03162000
CVTRSV16 EQU   CVTOPTB                                                  03163000
CVTFP    EQU   CVTOPTB                                                  03164000
CVTAPTHR EQU   CVTOPTB                                                  03165000
CVTNLOG  EQU   CVTOPTB                                                  03166000
CVTTOD   EQU   CVTOPTB                                                  03167000
CVTCTIMS EQU   CVTOPTB                                                  03168000
CVTPROT  EQU   CVTOPTB                                                  03169000
CVTXPFP  EQU   CVTOPTA                                                  03170000
CVTASCII EQU   CVTOPTA                                                  03171000
CVTRSV13 EQU   CVTOPTA                                                  03172000
CVTRSV12 EQU   CVTOPTA                                                  03173000
CVTNIP   EQU   CVTOPTA                                                  03174000
CVTDDR   EQU   CVTOPTA                                                  03175000
CVTAPR   EQU   CVTOPTA                                                  03176000
CVTCCH   EQU   CVTOPTA                                                  03177000
CVTSNCTR EQU   CVTMAP+180                                               03178000
CVTQMWR  EQU   CVTMAP+176                                               03179000
CVTQOCR  EQU   CVTMAP+172                                               03180000
CVT1EF00 EQU   CVTMAP+168                                               03181000
CVTMZ00  EQU   CVTMAP+164                                               03182000
CVTSV76Q EQU   CVTSV76C                                                 03183000
CVTRSV11 EQU   CVTMAP+156                                               03184000
CVT0PT01 EQU   CVTMAP+152                                               03185000
CVTMSER  EQU   CVTMAP+148                                               03186000
CVTRV516 EQU   CVTIERLC                                                 03187000
CVTILCH  EQU   CVTMAP+140                                               03188000
CVT0DS   EQU   CVTMAP+136                                               03189000
CVTFBOSV EQU   CVTMAP+132                                               03190000
CVTNUCB  EQU   CVTMAP+128                                               03191000
CVTIXAVL EQU   CVTMAP+124                                               03192000
CVTSV76M EQU   CVTIOQET                                                 03193000
CVTDCBA  EQU   CVTMAP+117                                               03194000
CVTMVS2  EQU   CVTDCB                                                   03195000
CVT6DAT  EQU   CVTDCB                                                   03196000
CVT4MPS  EQU   CVTDCB                                                   03197000
CVTRSV09 EQU   CVTDCB                                                   03198000
CVT4MS1  EQU   CVTDCB                                                   03199000
CVT2SPS  EQU   CVTDCB                                                   03200000
CVT1SSS  EQU   CVTDCB                                                   03201000
CVTRSV08 EQU   CVTDCB                                                   03202000
CVTSTB   EQU   CVTMAP+112                                               03203000
CVTQTD00 EQU   CVTMAP+108                                               03204000
CVTQTE00 EQU   CVTMAP+104                                               03205000
CVTCUCB  EQU   CVTMAP+100                                               03206000
CVTSJQ   EQU   CVTMAP+96                                                03207000
CVTPBLDL EQU   CVTMAP+92                                                03208000
CVTTPC   EQU   CVTMAP+88                                                03209000
CVTSVDCB EQU   CVTMAP+84                                                03210000
CVTBRET  EQU   CVTMAP+82                                                03211000
CVTEXIT  EQU   CVTMAP+80                                                03212000
CVT0FN00 EQU   CVTMAP+76                                                03213000
CVTDARA  EQU   CVTDAR+1                                                 03214000
CVTRSV07 EQU   CVTFLGS1                                                 03215000
CVTRSV06 EQU   CVTFLGS1                                                 03216000
CVTRSV05 EQU   CVTFLGS1                                                 03217000
CVTRSV04 EQU   CVTFLGS1                                                 03218000
CVTRSV03 EQU   CVTFLGS1                                                 03219000
CVTRSV02 EQU   CVTFLGS1                                                 03220000
CVTRSV01 EQU   CVTFLGS1                                                 03221000
CVTDMPLK EQU   CVTFLGS1                                                 03222000
CVTXITP  EQU   CVTMAP+68                                                03223000
CVTZDTAB EQU   CVTMAP+64                                                03224000
CVTMSLT  EQU   CVTMAP+60                                                03225000
CVTDATE  EQU   CVTMAP+56                                                03226000
CVTBTERM EQU   CVTMAP+52                                                03227000
CVTSYSAD EQU   CVTMAP+48                                                03228000
CVTXTLER EQU   CVTMAP+44                                                03229000
CVTILK2  EQU   CVTMAP+40                                                03230000
CVTILK1  EQU   CVTMAP+36                                                03231000
CVTPRLTV EQU   CVTMAP+32                                                03232000
CVTPCNVT EQU   CVTMAP+28                                                03233000
CVT0VL00 EQU   CVTMAP+24                                                03234000
CVTXAPG  EQU   CVTMAP+20                                                03235000
CVTBUF   EQU   CVTMAP+16                                                03236000
CVTJOB   EQU   CVTMAP+12                                                03237000
CVTLINK  EQU   CVTMAP+8                                                 03238000
CVT0EF00 EQU   CVTMAP+4                                                 03239000
CVTTCBP  EQU   CVTMAP                                                   03240000
CVT      EQU   CVTMAP                                                   03241000
ASMCPRES EQU   ASMCPRSQ+4                                               03242000
ASMCPTAK EQU   ASMCPRSQ                                                 03243000
ASMCPCNT EQU   ASMCPAVQ+4                                               03244000
ASMCPAVL EQU   ASMCPAVQ                                                 03245000
ASMCPEXT EQU   ASMPOOLS+6                                               03246000
ASMCPSIZ EQU   ASMPOOLS+4                                               03247000
ASMCPID  EQU   ASMPOOLS                                                 03248000
ASMRSV12 EQU   ASMVT+1000                                               03249000
ASMSAVE  EQU   ASMVT+928                                                03250000
ASMWKSA7 EQU   ASMVT+848                                                03251000
ASMWKSA6 EQU   ASMVT+768                                                03252000
ASMACEPC EQU   ASMVT+344                                                03253000
ASMSWKPC EQU   ASMVT+328                                                03254000
ASMBWKPC EQU   ASMVT+312                                                03255000
ASMIOEPC EQU   ASMVT+296                                                03256000
ASMRSV10 EQU   ASMVT+280                                                03257000
ASMPVACE EQU   ASMVT+276                                                03258000
ASMPIOFR EQU   ASMVT+272                                                03259000
ASMPVACQ EQU   ASMVT+268                                                03260000
ASMPMSGS EQU   ASMVT+264                                                03261000
ASMPMSG0 EQU   ASMVT+260                                                03262000
ASMPFRLG EQU   ASMVT+256                                                03263000
ASMPRLG  EQU   ASMVT+252                                                03264000
ASMPACT  EQU   ASMVT+248                                                03265000
ASMPSAV  EQU   ASMVT+244                                                03266000
ASMPCMP  EQU   ASMVT+240                                                03267000
ASMPCMPA EQU   ASMVT+236                                                03268000
ASMPCMPN EQU   ASMVT+232                                                03269000
ASMPCMPD EQU   ASMVT+228                                                03270000
ASMPEX   EQU   ASMVT+224                                                03271000
ASMVRMTR EQU   ASMVT+220                                                03272000
ASMPSRBC EQU   ASMVT+216                                                03273000
ASMPSRMT EQU   ASMVT+212                                                03274000
ASMPSWPD EQU   ASMVT+208                                                03275000
ASMPTM   EQU   ASMVT+204                                                03276000
ASMPFRSW EQU   ASMVT+200                                                03277000
ASMPFRSL EQU   ASMVT+196                                                03278000
ASMPQIOE EQU   ASMVT+192                                                03279000
ASMRSV8  EQU   ASMVT+188                                                03280000
ASMVSAMW EQU   ASMVT+184                                                03281000
ASMTASCB EQU   ASMVT+180                                                03282000
ASMRLGWQ EQU   ASMVT+176                                                03283000
ASMRLGRQ EQU   ASMVT+172                                                03284000
ASMTMECB EQU   ASMVT+168                                                03285000
ASMTCBPT EQU   ASMVT+164                                                03286000
ASMREQCT EQU   ASMVT+160                                                03287000
ASMGOSWK EQU   ASMGOSQS+4                                               03288000
ASMGOSWT EQU   ASMGOSQS                                                 03289000
ASMLSAIH EQU   ASMLSAI+4                                                03290000
ASMLSAIL EQU   ASMLSAI                                                  03291000
ASMCINV  EQU   ASMVT+140                                                03292000
ASMSTGXA EQU   ASMVT+136                                                03293000
ASMLGVT  EQU   ASMVT+132                                                03294000
ASMSLOTV EQU   ASMVT+128                                                03295000
ASMBKSLT EQU   ASMVT+108                                                03296000
ASMRSV7  EQU   ASMVT+92                                                 03297000
ASMPSRB  EQU   ASMVT+88                                                 03298000
ASMSRBCT EQU   ASMVT+84                                                 03299000
ASMIOCNT EQU   ASMVT+80                                                 03300000
ASMBURST EQU   ASMVT+76                                                 03301000
ASMPCCWN EQU   ASMVT+72                                                 03302000
ASMPCCWC EQU   ASMPCCWQ+4                                               03303000
ASMPCCWA EQU   ASMPCCWQ                                                 03304000
ASMRSV6  EQU   ASMVT+48                                                 03305000
ASMIORQC EQU   ASMVT+44                                                 03306000
ASMIORQR EQU   ASMVT+40                                                 03307000
ASMSTAGL EQU   ASMSTAGQ+4                                               03308000
ASMSTAGF EQU   ASMSTAGQ                                                 03309000
ASMRSV5  EQU   ASMVT+28                                                 03310000
ASMMSGBF EQU   ASMVT+24                                                 03311000
ASMEREC  EQU   ASMVT+20                                                 03312000
ASMTRPAG EQU   ASMVT+16                                                 03313000
ASMGOS   EQU   ASMVT+12                                                 03314000
ASMPART  EQU   ASMVT+8                                                  03315000
ASMSART  EQU   ASMVT+4                                                  03316000
ASMDSSFS EQU   ASMVT+2                                                  03317000
ASMWARM  EQU   ASMFLAG2                                                 03318000
ASMQUICK EQU   ASMFLAG2                                                 03319000
ASMNOTPT EQU   ASMFLAG2                                                 03320000
ASMNOTMR EQU   ASMFLAG2                                                 03321000
ASMNOSAV EQU   ASMFLAG2                                                 03322000
ASMCALLQ EQU   ASMFLAG2                                                 03323000
ASMPLPAS EQU   ASMFLAG1                                                 03324000
ASMCOMMF EQU   ASMFLAG1                                                 03325000
ASMPLPAF EQU   ASMFLAG1                                                 03326000
ASMNODPX EQU   ASMFLAG1                                                 03327000
ASMRSV1  EQU   ASMFLAG1                                                 03328000
ASMNOLCL EQU   ASMFLAG1                                                 03329000
ASMNOCWQ EQU   ASMFLAG1                                                 03330000
ASMDUPLX EQU   ASMFLAG1                                                 03331000
PVTEND   EQU   PVT+1848                                                 03332000
PVTTASID EQU   PVT+1846                                                 03333000
PVTXXXXX EQU   PVT+1844                                                 03334000
PVTMVCLC EQU   PVT+1840                                                 03335000
PVTSPARE EQU   PVT+1838                                                 03336000
PVTCOMFX EQU   PVT+1834                                                 03337000
PVTSQAFX EQU   PVT+1832                                                 03338000
PVTDEFFX EQU   PVT+1828                                                 03339000
PVTPEROK EQU   PVT+1824                                                 03340000
PVTPERFX EQU   PVT+1820                                                 03341000
PVTRSRB  EQU   PVT+1776                                                 03342000
PVTRESV5 EQU   PVT+1773                                                 03343000
PVTSRBS  EQU   PVT+1772                                                 03344000
PVTSSRB  EQU   PVT+1768                                                 03345000
PVTACA   EQU   PVTWSAX+1400                                             03346000
PVTSAVE  EQU   PVTWSAX+1328                                             03347000
PVTWSA18 EQU   PVTWSAX+1256                                             03348000
PVTWSA17 EQU   PVTWSAX+1184                                             03349000
PVTWSA16 EQU   PVTWSAX+1112                                             03350000
PVTWSA15 EQU   PVTWSAX+1040                                             03351000
PVTWSA14 EQU   PVTWSAX+968                                              03352000
PVTWSA13 EQU   PVTWSAX+896                                              03353000
PVTWSA12 EQU   PVTWSAX+824                                              03354000
PVTWSA11 EQU   PVTWSAX+752                                              03355000
PVTWSA10 EQU   PVTWSAX+672                                              03356000
PVTWSA9  EQU   PVTWSAX+592                                              03357000
PVTWSA8  EQU   PVTWSAX+504                                              03358000
PVTWSA7  EQU   PVTWSAX+432                                              03359000
PVTWSA6  EQU   PVTWSAX+360                                              03360000
PVTWSA5  EQU   PVTWSAX+288                                              03361000
PVTWSA4  EQU   PVTWSAX+216                                              03362000
PVTWSA3  EQU   PVTWSAX+144                                              03363000
PVTWSA2  EQU   PVTWSAX+72                                               03364000
PVTWSA1  EQU   PVTWSAX                                                  03365000
PVTCIOQL EQU   PVTQS+36                                                 03366000
PVTCIOQF EQU   PVTQS+32                                                 03367000
PVTGFADL EQU   PVTQS+28                                                 03368000
PVTGFADF EQU   PVTQS+24                                                 03369000
PVTFPCBL EQU   PVTQS+20                                                 03370000
PVTFPCBF EQU   PVTQS+16                                                 03371000
PVTSQAQL EQU   PVTQS+14                                                 03372000
PVTSQAQF EQU   PVTQS+12                                                 03373000
PVTCFQL  EQU   PVTQS+10                                                 03374000
PVTCFQF  EQU   PVTQS+8                                                  03375000
PVTRSRVL EQU   PVTQS+6                                                  03376000
PVTRSRVF EQU   PVTQS+4                                                  03377000
PVTAFQL  EQU   PVTQS+2                                                  03378000
PVTAFQF  EQU   PVTQS                                                    03379000
PVTSPFR  EQU   PVT+302                                                  03380000
PVTCFMCT EQU   PVT+300                                                  03381000
PVTSPREC EQU   PVT+296                                                  03382000
PVTCAREC EQU   PVT+292                                                  03383000
PVTCAOUT EQU   PVT+288                                                  03384000
PVTCAIN  EQU   PVT+284                                                  03385000
PVTNSWPS EQU   PVT+280                                                  03386000
PVTNPREC EQU   PVT+276                                                  03387000
PVTSPOUT EQU   PVT+272                                                  03388000
PVTSPIN  EQU   PVT+268                                                  03389000
PVTVAMR  EQU   PVT+264                                                  03390000
PVTVAMO  EQU   PVT+260                                                  03391000
PVTVAMI  EQU   PVT+256                                                  03392000
PVTNPOUT EQU   PVT+252                                                  03393000
PVTNPIN  EQU   PVT+248                                                  03394000
PVTPRSET EQU   PVT+244                                                  03395000
PVTFRSLT EQU   PVT+240                                                  03396000
PVTPAGIO EQU   PVT+236                                                  03397000
PVTSWPIO EQU   PVT+232                                                  03398000
PVTPSWPP EQU   PVT+228                                                  03399000
PVTPPREF EQU   PVT+224                                                  03400000
PVTPOPBR EQU   PVT+220                                                  03401000
PVTPRELF EQU   PVT+216                                                  03402000
PVTPRELV EQU   PVT+212                                                  03403000
PVTPFREE EQU   PVT+208                                                  03404000
PVTPRELS EQU   PVT+204                                                  03405000
PVTPOUT  EQU   PVT+200                                                  03406000
PVTPFXLD EQU   PVT+196                                                  03407000
PVTPITAS EQU   PVT+192                                                  03408000
PVTPSRBP EQU   PVT+188                                                  03409000
PVTPDSEG EQU   PVT+184                                                  03410000
PVTPCSGB EQU   PVT+180                                                  03411000
PVTPCSEG EQU   PVT+176                                                  03412000
PVTPINV  EQU   PVT+172                                                  03413000
PVTPSWPC EQU   PVT+168                                                  03414000
PVTPSOUT EQU   PVT+164                                                  03415000
PVTPSWIN EQU   PVT+160                                                  03416000
PVTPRCV  EQU   PVT+156                                                  03417000
PVTPRCFI EQU   PVT+152                                                  03418000
PVTPRCF  EQU   PVT+148                                                  03419000
PVTPVRC  EQU   PVT+144                                                  03420000
PVTPVRIN EQU   PVT+140                                                  03421000
PVTPVRLS EQU   PVT+136                                                  03422000
PVTPVEQR EQU   PVT+132                                                  03423000
PVTPPIOI EQU   PVT+128                                                  03424000
PVTPVRPO EQU   PVT+124                                                  03425000
PVTPRFR  EQU   PVT+120                                                  03426000
PVTPFP2  EQU   PVT+116                                                  03427000
PVTPFP   EQU   PVT+112                                                  03428000
PVTPFTE  EQU   PVT+108                                                  03429000
PVTPCB   EQU   PVT+104                                                  03430000
PVTREP2  EQU   PVT+100                                                  03431000
PVTPIOCP EQU   PVT+96                                                   03432000
PVTPIOP  EQU   PVT+92                                                   03433000
PVTPGFAD EQU   PVT+88                                                   03434000
PVTPGFA  EQU   PVT+84                                                   03435000
PVTPSQA  EQU   PVT+80                                                   03436000
PVTPSINT EQU   PVT+76                                                   03437000
PVTPSIB  EQU   PVT+72                                                   03438000
PVTSRBID EQU   PVT+68                                                   03439000
PVTPCIWA EQU   PVT+64                                                   03440000
PVTHQSA  EQU   PVT+62                                                   03441000
PVTLQSA  EQU   PVT+60                                                   03442000
PVTOROOT EQU   PVT+56                                                   03443000
PVTPRCA  EQU   PVT+52                                                   03444000
PVTREUS  EQU   PVT+48                                                   03445000
PVTSQNPC EQU   PVT+47                                                   03446000
PVTSQVRC EQU   PVT+46                                                   03447000
PVTRSUS  EQU   PVT+44                                                   03448000
PVTVROOT EQU   PVT+40                                                   03449000
PVTPCBLO EQU   PVT+38                                                   03450000
PVTPCBCT EQU   PVT+36                                                   03451000
PVTDFRS  EQU   PVT+34                                                   03452000
PVTRSQA  EQU   PVT+32                                                   03453000
PVTPTLB  EQU   PVT+31                                                   03454000
PVTPCBNO EQU   PVT+30                                                   03455000
PVTSRBNO EQU   PVT+29                                                   03456000
PVTSQDC  EQU   PVT+28                                                   03457000
PVTLCSA  EQU   PVT+26                                                   03458000
PVTLPRIV EQU   PVT+24                                                   03459000
PVTLVR   EQU   PVT+22                                                   03460000
PVTFVR   EQU   PVT+20                                                   03461000
PVTLPFN  EQU   PVT+18                                                   03462000
PVTFPFN  EQU   PVT+16                                                   03463000
PVTPFTP  EQU   PVT+12                                                   03464000
PVTSSPIN EQU   PVT+11                                                   03465000
PVTPCBS  EQU   PVT+10                                                   03466000
PVTAFCLO EQU   PVT+4                                                    03467000
@NM00004 EQU   PVTFLAG2                                                 03468000
PVTRSMGM EQU   PVTFLAG2                                                 03469000
PVTDUMP  EQU   PVTFLAG1                                                 03470000
PVTSIT   EQU   PVTFLAG1                                                 03471000
PVTLSI   EQU   PVTFLAG1                                                 03472000
PVTAPREF EQU   PVTFLAG1                                                 03473000
PVTPCBLT EQU   PVTFLAG1                                                 03474000
PVTSRBIU EQU   PVTFLAG1                                                 03475000
PVTBGMS  EQU   PVTFLAG1                                                 03476000
PVTPMSG  EQU   PVTFLAG1                                                 03477000
DMDTEND  EQU   DMDT+20                                                  03478000
DMDTRUC  EQU   DMDT+16                                                  03479000
DMDTOUTU EQU   DMDT+12                                                  03480000
DMDTCMPL EQU   DMDT+10                                                  03481000
DMDTGOOU EQU   DMDT+8                                                   03482000
DMDTRUA  EQU   DMDT+6                                                   03483000
DMDTWT   EQU   DMDT+3                                                   03484000
DMDTHI   EQU   DMDT+2                                                   03485000
DMDTNO   EQU   DMDT                                                     03486000
RMEPSND  EQU   RMEP+32                                                  03487000
RMEPTME  EQU   RMEPSCH+8                                                03488000
RMEPBCK  EQU   RMEPSCH+4                                                03489000
RMEPFWD  EQU   RMEPSCH                                                  03490000
RMEPEND  EQU   RMEP+16                                                  03491000
RMEPPRV  EQU   RMEPEPB+12                                               03492000
RMEPACN  EQU   RMEPFLG+3                                                03493000
RMEPTMD  EQU   RMEPFLG+3                                                03494000
RMEPRCR  EQU   RMEPFLG+3                                                03495000
RMEPVFL  EQU   RMEPFLG                                                  03496000
RMEPERA  EQU   RMEPEPB+4                                                03497000
RMEPEPA  EQU   RMEPEPB                                                  03498000
RSMASMHD EQU   RSMHD+40                                                 03499000
RSMFOEQ  EQU   RSMHD+36                                                 03500000
RSMLIOQL EQU   RSMLIOQ+4                                                03501000
RSMLIOQF EQU   RSMLIOQ                                                  03502000
RSMLSQAL EQU   RSMLSQA+2                                                03503000
RSMLSQAF EQU   RSMLSQA                                                  03504000
RSMLFQL  EQU   RSMLFQ+2                                                 03505000
RSMLFQF  EQU   RSMLFQ                                                   03506000
RSMRSV2  EQU   RSMHD+16                                                 03507000
RSMRSV1  EQU   RSMHD+13                                                 03508000
@NM00003 EQU   RSMFLG1                                                  03509000
RSMFAIL  EQU   RSMFLG1                                                  03510000
RSMGFADD EQU   RSMFLG1                                                  03511000
RSMCPNC  EQU   RSMFLG1                                                  03512000
RSMCPNU  EQU   RSMFLG1                                                  03513000
RSMGFAD  EQU   RSMFLG1                                                  03514000
RSMIOCPC EQU   RSMFLG1                                                  03515000
RSMIOCPU EQU   RSMFLG1                                                  03516000
RSMASCB  EQU   RSMHD+8                                                  03517000
RSMSPCT  EQU   RSMHD+4                                                  03518000
RSMVSTO  EQU   RSMHD                                                    03519000
OUXBEND  EQU   OUXB+144                                                 03520000
OUXBTSW  EQU   OUXB+140                                                 03521000
OUXBILS  EQU   OUXB+128                                                 03522000
OUXBRSV1 EQU   OUXB+126                                                 03523000
OUXBWCT  EQU   OUXB+124                                                 03524000
OUXBPRS  EQU   OUXB+120                                                 03525000
OUXBITD  EQU   OUXB+112                                                 03526000
OUXBMSS  EQU   OUXB+104                                                 03527000
OUXBCPS  EQU   OUXB+96                                                  03528000
OUXBAET  EQU   OUXB+92                                                  03529000
OUXBTRR  EQU   OUXB+88                                                  03530000
OUXBJBR  EQU   OUXB+84                                                  03531000
OUXBTRT  EQU   OUXB+80                                                  03532000
OUXBTRS  EQU   OUXB+76                                                  03533000
OUXBJBT  EQU   OUXB+72                                                  03534000
OUXBJBS  EQU   OUXB+68                                                  03535000
OUXBTRC  EQU   OUXB+64                                                  03536000
OUXBNQT  EQU   OUXB+60                                                  03537000
OUXBIOSM EQU   OUXB+56                                                  03538000
OUXBSTC  EQU   OUXB+54                                                  03539000
OUXBIOS  EQU   OUXB+52                                                  03540000
OUXBCAPR EQU   OUXB+44                                                  03541000
OUXBCAPI EQU   OUXB+40                                                  03542000
OUXBVAMR EQU   OUXB+36                                                  03543000
OUXBVAMO EQU   OUXB+32                                                  03544000
OUXBVAMI EQU   OUXB+28                                                  03545000
OUXBPREC EQU   OUXB+24                                                  03546000
OUXBPOUT EQU   OUXB+20                                                  03547000
OUXBPIN  EQU   OUXB+16                                                  03548000
OUXBRSW  EQU   OUXB+12                                                  03549000
OUXBPET  EQU   OUXB+4                                                   03550000
OUXBNAME EQU   OUXB                                                     03551000
OUCBEND  EQU   OUCB+136                                                 03552000
OUCBNTSP EQU   OUCB+134                                                 03553000
OUCBNDS  EQU   OUCB+132                                                 03554000
OUCBTIO  EQU   OUCB+128                                                 03555000
OUCBTCP  EQU   OUCB+124                                                 03556000
OUCBPST  EQU   OUCB+120                                                 03557000
OUCBPS2  EQU   OUCBPSS+4                                                03558000
OUCBPS1  EQU   OUCBPSS                                                  03559000
OUCBIOSM EQU   OUCB+108                                                 03560000
OUCBTMP  EQU   OUCB+104                                                 03561000
OUCBR03  EQU   OUCB+102                                                 03562000
OUCBIOR  EQU   OUCB+100                                                 03563000
OUCBCRV  EQU   OUCB+98                                                  03564000
OUCBIRV  EQU   OUCB+96                                                  03565000
OUCBWMR  EQU   OUCB+92                                                  03566000
OUCBCMRV EQU   OUCB+88                                                  03567000
OUCBCF2  EQU   OUCBCFL                                                  03568000
OUCBRSM  EQU   OUCBCFL                                                  03569000
OUCBRDY  EQU   OUCBCFL                                                  03570000
OUCBACN  EQU   OUCBCSW                                                  03571000
OUCBACT  EQU   OUCB+80                                                  03572000
OUCBWSS  EQU   OUCB+78                                                  03573000
OUCBPSO  EQU   OUCB+76                                                  03574000
OUCBTMO  EQU   OUCB+72                                                  03575000
OUCBTMS  EQU   OUCB+68                                                  03576000
OUCBMSO  EQU   OUCB+64                                                  03577000
OUCBIOC  EQU   OUCB+60                                                  03578000
OUCBCPU  EQU   OUCB+56                                                  03579000
OUCBWMS  EQU   OUCB+52                                                  03580000
OUCBTMW  EQU   OUCB+48                                                  03581000
OUCBIMCB EQU   OUCB+44                                                  03582000
OUCBSWC  EQU   OUCB+38                                                  03583000
OUCBDMN  EQU   OUCB+36                                                  03584000
OUCBDMO  EQU   OUCB+34                                                  03585000
OUCBWMG  EQU   OUCB+32                                                  03586000
OUCBPGP  EQU   OUCB+31                                                  03587000
OUCBR40  EQU   OUCB+30                                                  03588000
OUCBR30  EQU   OUCB+29                                                  03589000
OUCBSPG  EQU   OUCB+28                                                  03590000
OUCBRDP  EQU   OUCB+27                                                  03591000
OUCBNDP  EQU   OUCB+26                                                  03592000
OUCBRPG  EQU   OUCB+25                                                  03593000
OUCBNPG  EQU   OUCB+24                                                  03594000
OUCBUF7  EQU   OUCBUFL                                                  03595000
OUCBUF6  EQU   OUCBUFL                                                  03596000
OUCBUF5  EQU   OUCBUFL                                                  03597000
OUCBTSWC EQU   OUCBUFL                                                  03598000
OUCBTSWP EQU   OUCBUFL                                                  03599000
OUCBRSWP EQU   OUCBUFL                                                  03600000
OUCBNQC  EQU   OUCB+22                                                  03601000
OUCBQSS  EQU   OUCBEFL                                                  03602000
OUCBNQF  EQU   OUCBEFL                                                  03603000
OUCBCIM  EQU   OUCBEFL                                                  03604000
OUCBOWT  EQU   OUCBEFL                                                  03605000
OUCBTRM  EQU   OUCBEFL                                                  03606000
OUCBLWT  EQU   OUCBEFL                                                  03607000
OUCBINC  EQU   OUCBTFL                                                  03608000
OUCBINP  EQU   OUCBTFL                                                  03609000
OUCBMAR  EQU   OUCBTFL                                                  03610000
OUCBPCH  EQU   OUCBTFL                                                  03611000
OUCBRTR  EQU   OUCBTFL                                                  03612000
OUCBNTR  EQU   OUCBTFL                                                  03613000
OUCBSTR  EQU   OUCBTFL                                                  03614000
OUCBATR  EQU   OUCBTFL                                                  03615000
OUCBASW  EQU   OUCBAFL                                                  03616000
OUCBNWT  EQU   OUCBAFL                                                  03617000
OUCBR02  EQU   OUCBAFL                                                  03618000
OUCBJSR  EQU   OUCBAFL                                                  03619000
OUCBCPL  EQU   OUCBAFL                                                  03620000
OUCBRMA  EQU   OUCBAFL                                                  03621000
OUCBAPG  EQU   OUCBAFL                                                  03622000
OUCBAF0  EQU   OUCBAFL                                                  03623000
OUCBDTA  EQU   OUCBYFL                                                  03624000
OUCBPSTR EQU   OUCBYFL                                                  03625000
OUCBMNT  EQU   OUCBYFL                                                  03626000
OUCBLOG  EQU   OUCBYFL                                                  03627000
OUCBSTT  EQU   OUCBYFL                                                  03628000
OUCBPSTE EQU   OUCBYFL                                                  03629000
OUCBSCN  EQU   OUCBSFL                                                  03630000
OUCBNSWI EQU   OUCBSFL                                                  03631000
OUCBINV  EQU   OUCBSFL                                                  03632000
OUCBCTI  EQU   OUCBSFL                                                  03633000
OUCBQF7  EQU   OUCBQFL                                                  03634000
OUCBQF6  EQU   OUCBQFL                                                  03635000
OUCBQSFL EQU   OUCBQFL                                                  03636000
OUCBTMA  EQU   OUCB+12                                                  03637000
OUCBBCK  EQU   OUCB+8                                                   03638000
ASCBEND  EQU   ASCB+208                                                 03639000
ASCBSRBT EQU   ASCB+200                                                 03640000
ASCBSWTL EQU   ASCB+196                                                 03641000
ASCBRS14 EQU   ASCB+195                                                 03642000
ASCBSMCT EQU   ASCB+194                                                 03643000
ASCBRS12 EQU   ASCB+192                                                 03644000
ASCBPCTT EQU   ASCB+188                                                 03645000
ASCBVGTT EQU   ASCB+184                                                 03646000
ASCBRV43 EQU   ASCBSRQ4                                                 03647000
ASCBRV42 EQU   ASCBSRQ4                                                 03648000
ASCBRV41 EQU   ASCBSRQ4                                                 03649000
ASCBRV40 EQU   ASCBSRQ4                                                 03650000
ASCBRV39 EQU   ASCBSRQ4                                                 03651000
ASCBRV38 EQU   ASCBSRQ4                                                 03652000
ASCBRV37 EQU   ASCBSRQ4                                                 03653000
ASCBRV36 EQU   ASCBSRQ4                                                 03654000
ASCBRV35 EQU   ASCBSRQ3                                                 03655000
ASCBRV34 EQU   ASCBSRQ3                                                 03656000
ASCBRV33 EQU   ASCBSRQ3                                                 03657000
ASCBRV32 EQU   ASCBSRQ3                                                 03658000
ASCBRV31 EQU   ASCBSRQ3                                                 03659000
ASCBRV30 EQU   ASCBSRQ3                                                 03660000
ASCBRV29 EQU   ASCBSRQ3                                                 03661000
ASCBRV28 EQU   ASCBSRQ3                                                 03662000
ASCBRV27 EQU   ASCBSRQ2                                                 03663000
ASCBRV26 EQU   ASCBSRQ2                                                 03664000
ASCBRV25 EQU   ASCBSRQ2                                                 03665000
ASCBRV24 EQU   ASCBSRQ2                                                 03666000
ASCBRV23 EQU   ASCBSRQ2                                                 03667000
ASCBRV22 EQU   ASCBSRQ2                                                 03668000
ASCBRV21 EQU   ASCBSRQ2                                                 03669000
ASCBRV20 EQU   ASCBSRQ2                                                 03670000
ASCBRV19 EQU   ASCBSRQ1                                                 03671000
ASCBRV18 EQU   ASCBSRQ1                                                 03672000
ASCBRV17 EQU   ASCBSRQ1                                                 03673000
ASCBRV16 EQU   ASCBSRQ1                                                 03674000
ASCBRV15 EQU   ASCBSRQ1                                                 03675000
ASCBRV14 EQU   ASCBSRQ1                                                 03676000
ASCBRV13 EQU   ASCBSRQ1                                                 03677000
ASCBSTA  EQU   ASCBSRQ1                                                 03678000
ASCBMCC  EQU   ASCB+168                                                 03679000
ASCBRTWA EQU   ASCB+164                                                 03680000
ASCBIQEA EQU   ASCB+160                                                 03681000
ASCBXMPQ EQU   ASCB+156                                                 03682000
ASCBRS01 EQU   ASCB+154                                                 03683000
ASCBFMCT EQU   ASCB+152                                                 03684000
ASCBOUCB EQU   ASCB+144                                                 03685000
ASCBMECB EQU   ASCB+140                                                 03686000
ASCBQECB EQU   ASCB+136                                                 03687000
ASCBLSQH EQU   ASCBLKGP+4                                               03688000
ASCBLOCK EQU   ASCBLKGP                                                 03689000
ASCBSRBS EQU   ASCB+118                                                 03690000
ASCBSSRB EQU   ASCB+116                                                 03691000
ASCBRV06 EQU   ASCBFLG2                                                 03692000
ASCBRV05 EQU   ASCBFLG2                                                 03693000
ASCBRV04 EQU   ASCBFLG2                                                 03694000
ASCBSNQS EQU   ASCBFLG2                                                 03695000
ASCBS2S  EQU   ASCBFLG2                                                 03696000
ASCBCEXT EQU   ASCBFLG2                                                 03697000
ASCBPXMT EQU   ASCBFLG2                                                 03698000
ASCBXMPT EQU   ASCBFLG2                                                 03699000
ASCBRF07 EQU   ASCBDSP1                                                 03700000
ASCBRF06 EQU   ASCBDSP1                                                 03701000
ASCBRF05 EQU   ASCBDSP1                                                 03702000
ASCBRF04 EQU   ASCBDSP1                                                 03703000
ASCBRF03 EQU   ASCBDSP1                                                 03704000
ASCBRF02 EQU   ASCBDSP1                                                 03705000
ASCBFAIL EQU   ASCBDSP1                                                 03706000
ASCBNOQ  EQU   ASCBDSP1                                                 03707000
ASCBSWCT EQU   ASCB+112                                                 03708000
ASCBASXB EQU   ASCB+108                                                 03709000
ASCBTMCH EQU   ASCB+104                                                 03710000
ASCBNSWP EQU   ASCBFLG1                                                 03711000
ASCBTYP1 EQU   ASCBFLG1                                                 03712000
ASCBSTND EQU   ASCBFLG1                                                 03713000
ASCBABNT EQU   ASCBFLG1                                                 03714000
ASCBTERM EQU   ASCBFLG1                                                 03715000
ASCBS3S  EQU   ASCBFLG1                                                 03716000
ASCBCMSH EQU   ASCBFLG1                                                 03717000
ASCBTOFF EQU   ASCBFLG1                                                 03718000
ASCBRF01 EQU   ASCBRCTF                                                 03719000
ASCBTMLW EQU   ASCBRCTF                                                 03720000
ASCBOUT  EQU   ASCBRCTF                                                 03721000
ASCBWAIT EQU   ASCBRCTF                                                 03722000
ASCBRV08 EQU   ASCBRCTF                                                 03723000
ASCBFQU  EQU   ASCBRCTF                                                 03724000
ASCBFRS  EQU   ASCBRCTF                                                 03725000
ASCBTMNO EQU   ASCBRCTF                                                 03726000
ASCBAFFN EQU   ASCBFW1                                                  03727000
ASCBDUMP EQU   ASCB+96                                                  03728000
ASCBRV44 EQU   ASCB+92                                                  03729000
ASCBUBET EQU   ASCB+88                                                  03730000
ASCBECB  EQU   ASCB+84                                                  03731000
ASCBJSTL EQU   ASCB+80                                                  03732000
ASCBEWST EQU   ASCB+72                                                  03733000
ASCBTSB  EQU   ASCB+60                                                  03734000
ASCBCSCB EQU   ASCB+56                                                  03735000
ASCBRSMA EQU   ASCBRSM+1                                                03736000
ASCBRV54 EQU   ASCBRSMF                                                 03737000
ASCBRV53 EQU   ASCBRSMF                                                 03738000
ASCBRV52 EQU   ASCBRSMF                                                 03739000
ASCBRV51 EQU   ASCBRSMF                                                 03740000
ASCBVEQR EQU   ASCBRSMF                                                 03741000
ASCBN2LP EQU   ASCBRSMF                                                 03742000
ASCB1LPU EQU   ASCBRSMF                                                 03743000
ASCB2LPU EQU   ASCBRSMF                                                 03744000
ASCBLDA  EQU   ASCB+48                                                  03745000
ASCBSTOR EQU   ASCB+44                                                  03746000
ASCBDP   EQU   ASCB+43                                                  03747000
ASCBRV07 EQU   ASCB+42                                                  03748000
ASCBIOSM EQU   ASCB+40                                                  03749000
ASCBSEQN EQU   ASCB+38                                                  03750000
ASCBASID EQU   ASCB+36                                                  03751000
ASCBCPUS EQU   ASCB+32                                                  03752000
ASCBSPL  EQU   ASCB+28                                                  03753000
ASCBIOSP EQU   ASCB+24                                                  03754000
ASCBSYNC EQU   ASCBSUPC+4                                               03755000
ASCBSVRB EQU   ASCBSUPC                                                 03756000
ASCBCMSF EQU   ASCB+12                                                  03757000
ASCBBWDP EQU   ASCB+8                                                   03758000
ASCBFWDP EQU   ASCB+4                                                   03759000
ASCBASCB EQU   ASCB                                                     03760000
ASCBEGIN EQU   ASCB                                                     03761000
RRPAEND  EQU   RRPA+24                                                  03762000
RRPARTN  EQU   RRPAINS                                                  03763000
RRPATOD  EQU   RRPA+12                                                  03764000
RRPARTC  EQU   RRPA+11                                                  03765000
RRPAKEY  EQU   RRPA+10                                                  03766000
RRPARCI  EQU   RRPAFLG+1                                                03767000
RRPARFI  EQU   RRPAFLG+1                                                03768000
RRPARTI  EQU   RRPAFLG+1                                                03769000
RRPACTL  EQU   RRPAFLG+1                                                03770000
RRPAF11  EQU   RRPAFLG+1                                                03771000
RRPAIPS  EQU   RRPAFLG+1                                                03772000
RRPAWAR  EQU   RRPAFLG+1                                                03773000
RRPAF07  EQU   RRPAFLG                                                  03774000
RRPAOPT  EQU   RRPAFLG                                                  03775000
RRPAF05  EQU   RRPAFLG                                                  03776000
RRPAF04  EQU   RRPAFLG                                                  03777000
RRPADSP  EQU   RRPAFLG                                                  03778000
RRPASVC  EQU   RRPAFLG                                                  03779000
RRPAENB  EQU   RRPAFLG                                                  03780000
RRPADSB  EQU   RRPAFLG                                                  03781000
RRPAVLU  EQU   RRPAINP                                                  03782000
RRPACOD  EQU   RRPAINC+3                                                03783000
@NM00002 EQU   RRPAFLG0                                                 03784000
RRPANSWI EQU   RRPAFLG0                                                 03785000
RRPAASD  EQU   RRPAINC                                                  03786000
EPSTEND  EQU   EPST+80                                                  03787000
EPSTCSI  EQU   RMEPBCSI                                                 03788000
EPSTCSO  EQU   RMEPBCSO                                                 03789000
EPSTCL3  EQU   RMEPBCL3                                                 03790000
EPSTIL3  EQU   RMEPBIL3                                                 03791000
EPDTEND  EQU   EPDT+96                                                  03792000
RMEPBHIT EQU   EPDT+64                                                  03793000
RMEPBUXB EQU   EPDT+48                                                  03794000
RMEPBIL4 EQU   EPDT+32                                                  03795000
RMEPBDEL EQU   EPDT+16                                                  03796000
RMEPBIPS EQU   EPDT                                                     03797000
EPATEND  EQU   EPAT+400                                                 03798000
RMEPBEQ1 EQU   EPAT+336                                                 03799000
RMEPBAP1 EQU   EPAT+304                                                 03800000
RMEPBCL1 EQU   EPAT+272                                                 03801000
RMEPBWM2 EQU   EPAT+240                                                 03802000
RMEPBIL1 EQU   EPAT+208                                                 03803000
RMEPBASM EQU   EPAT+176                                                 03804000
RMEPBMS6 EQU   EPAT+112                                                 03805000
RMEPBSQA EQU   EPAT+96                                                  03806000
RMEPBRM2 EQU   EPAT+64                                                  03807000
RMEPBRM1 EQU   EPAT+32                                                  03808000
RMEPBCAP EQU   EPAT                                                     03809000
RMSBEND  EQU   RMSB+120                                                 03810000
RMSBRA9  EQU   RMSB+116                                                 03811000
RMSBIL0  EQU   RMSB+112                                                 03812000
RMSBCL0  EQU   RMSB+108                                                 03813000
RMSBRA6  EQU   RMSB+104                                                 03814000
RMSBNOP  EQU   RMSB+100                                                 03815000
RMSBSET  EQU   RMSB+96                                                  03816000
RMSBWR6  EQU   RMSB+92                                                  03817000
RMSBWR4  EQU   RMSB+88                                                  03818000
RMSBTRC  EQU   RMSB+84                                                  03819000
RMSBWMY  EQU   RMSB+80                                                  03820000
RMSBWMR  EQU   RMSB+76                                                  03821000
RMSBWMQ  EQU   RMSB+72                                                  03822000
RMSBWMO  EQU   RMSB+68                                                  03823000
RMSBWMN  EQU   RMSB+64                                                  03824000
RMSBWMK  EQU   RMSB+60                                                  03825000
RMSBWM4  EQU   RMSB+56                                                  03826000
RMSBWM1  EQU   RMSB+52                                                  03827000
RMSBWM5  EQU   RMSB+48                                                  03828000
RMSBI10  EQU   RMSB+32                                                  03829000
RMSBR24  EQU   RMSB+24                                                  03830000
RMSBI07  EQU   RMSB+20                                                  03831000
RMSBI06  EQU   RMSB+16                                                  03832000
RMSBI05  EQU   RMSB+12                                                  03833000
RMSBI04  EQU   RMSB+8                                                   03834000
RMSBI02  EQU   RMSB                                                     03835000
RMEXEND  EQU   RMEX+64                                                  03836000
RMEXSRE  EQU   RMEX+60                                                  03837000
RMEXXPE  EQU   RMEX+56                                                  03838000
RMEXRR2  EQU   RMEX+52                                                  03839000
RMEXRR1  EQU   RMEX+48                                                  03840000
RMEXI48  EQU   RMEX+44                                                  03841000
RMEXCET  EQU   RMEX+40                                                  03842000
RMEXCXX  EQU   RMEX+36                                                  03843000
RMEXI01  EQU   RMEX+32                                                  03844000
RMEXCTL  EQU   RMEPBCTL                                                 03845000
RMEXEVT  EQU   RMEPBEVT                                                 03846000
RMCAEND  EQU   RMCA+168                                                 03847000
RMCAR90  EQU   RMCA+164                                                 03848000
RMCAUSSC EQU   RMCASRC+36                                               03849000
RMCAEXSC EQU   RMCASRC+32                                               03850000
RMCANQSC EQU   RMCASRC+28                                               03851000
RMCARQSC EQU   RMCASRC+24                                               03852000
RMCADWSC EQU   RMCASRC+20                                               03853000
RMCARSSC EQU   RMCASRC+16                                               03854000
RMCAXSSC EQU   RMCASRC+12                                               03855000
RMCALWSC EQU   RMCASRC+8                                                03856000
RMCATISC EQU   RMCASRC+4                                                03857000
RMCATOSC EQU   RMCASRC                                                  03858000
RMCACPW1 EQU   RMCA+120                                                 03859000
RMCACIUS EQU   RMCA+118                                                 03860000
RMCAR14  EQU   RMCA+116                                                 03861000
RMCAR13  EQU   RMCA+112                                                 03862000
RMCAWKA  EQU   RMCA+80                                                  03863000
RMCAMAS  EQU   RMCA+76                                                  03864000
RMCAR20  EQU   RMCA+74                                                  03865000
RMCABCPG EQU   RMCA+73                                                  03866000
RMCALGPG EQU   RMCA+72                                                  03867000
RMCAISV  EQU   RMCA+70                                                  03868000
RMCAR11  EQU   RMCA+68                                                  03869000
RMCAINV  EQU   RMCA+64                                                  03870000
RMCAR10  EQU   RMCA+60                                                  03871000
RMCARSV9 EQU   RMCA+56                                                  03872000
RMCACHU  EQU   RMCA+52                                                  03873000
RMCACHP  EQU   RMCA+48                                                  03874000
RMCARSV8 EQU   RMCA+44                                                  03875000
RMCARSV7 EQU   RMCA+40                                                  03876000
RMCARSVF EQU   RMCAFLGS                                                 03877000
RMCASAAF EQU   RMCAFLGS                                                 03878000
RMCARSV5 EQU   RMCA+32                                                  03879000
RMCARSV4 EQU   RMCA+28                                                  03880000
RMCARSV3 EQU   RMCA+24                                                  03881000
RMCATOI  EQU   RMCA+20                                                  03882000
RMCATRS  EQU   RMCA+16                                                  03883000
RMCATQS  EQU   RMCA+12                                                  03884000
RMCARSV2 EQU   RMCA+10                                                  03885000
RMCARSV1 EQU   RMCA+8                                                   03886000
RMCAINUS EQU   RMCA+6                                                   03887000
RMCAR04  EQU   RMCA+4                                                   03888000
RMCANAME EQU   RMCA                                                     03889000
RMPTEND  EQU   RMPT+72                                                  03890000
RMPTOPE  EQU   RMPT+66                                                  03891000
RMPTOPI  EQU   RMPT+63                                                  03892000
RMPTOPC  EQU   RMPT+60                                                  03893000
RMPTIOET EQU   RMPT+56                                                  03894000
RMPTCPET EQU   RMPT+52                                                  03895000
RMPTWMET EQU   RMPT+48                                                  03896000
RMPTSAET EQU   RMPT+44                                                  03897000
RMPTXCHT EQU   RMPT+40                                                  03898000
RMPTRSV3 EQU   RMPT+38                                                  03899000
RMPTRSV2 EQU   RMPT+36                                                  03900000
RMPTRSV1 EQU   RMPT+32                                                  03901000
RMPTTOL  EQU   RMPT+28                                                  03902000
RMPTTOM  EQU   RMPT+24                                                  03903000
RMPTTCS  EQU   RMPT+20                                                  03904000
RMPTIMN  EQU   RMPT+16                                                  03905000
RMPTERV  EQU   RMPT+12                                                  03906000
RMPTIOC  EQU   RMPT+8                                                   03907000
RMPTCPU  EQU   RMPT+4                                                   03908000
RMPTNAME EQU   RMPT                                                     03909000
RCTEND   EQU   RCT+88                                                   03910000
RCVRSVF3 EQU   RCT+84                                                   03911000
RCVRSVF2 EQU   RCT+80                                                   03912000
RCVTAPAD EQU   RCT+76                                                   03913000
RCVRSVF1 EQU   RCT+74                                                   03914000
RCVTOTDF EQU   RCT+72                                                   03915000
RCVBPTTM EQU   RCT+68                                                   03916000
RCVBPTCT EQU   RCT+64                                                   03917000
RCVASMQ  EQU   RCT+60                                                   03918000
RCVAVQP  EQU   RCT+56                                                   03919000
RCVCPUC  EQU   RCT+52                                                   03920000
RCVUICC  EQU   RCT+48                                                   03921000
RCVPTR   EQU   RCT+46                                                   03922000
RCVASMQA EQU   RCT+44                                                   03923000
RCVAVQC  EQU   RCT+42                                                   03924000
RCVCPUA  EQU   RCT+40                                                   03925000
RCVUICA  EQU   RCT+38                                                   03926000
RCVCTMC  EQU   RCT+36                                                   03927000
RCCRSVF3 EQU   RCT+32                                                   03928000
RCCRSVF2 EQU   RCT+28                                                   03929000
RCCRSVF1 EQU   RCT+26                                                   03930000
RCCLCHRR EQU   RCT+24                                                   03931000
RCCLCHUT EQU   RCT+22                                                   03932000
RCCTOTUT EQU   RCT+20                                                   03933000
RCCASMTH EQU   RCT+18                                                   03934000
RCCASMTL EQU   RCT+16                                                   03935000
RCCPTRTH EQU   RCT+14                                                   03936000
RCCPTRTL EQU   RCT+12                                                   03937000
RCCCPUTH EQU   RCT+10                                                   03938000
RCCCPUTL EQU   RCT+8                                                    03939000
RCCUICTH EQU   RCT+6                                                    03940000
RCCUICTL EQU   RCT+4                                                    03941000
RCTRCT   EQU   RCT                                                      03942000
MCTEND   EQU   MCT+96                                                   03943000
MCVRSVF3 EQU   MCT+92                                                   03944000
MCVRSVF2 EQU   MCT+88                                                   03945000
MCVRSVF1 EQU   MCT+84                                                   03946000
MCTRSVB1 EQU   MCT+67                                                   03947000
MCTXRSVD EQU   MCT+66                                                   03948000
@NM00001 EQU   MCTOFLGS                                                 03949000
MCTASM2  EQU   MCTOFLGS                                                 03950000
MCTSF04  EQU   MCTSFLGS                                                 03951000
MCCEND   EQU   MCT+56                                                   03952000
MCCRSVH1 EQU   MCT+50                                                   03953000
MCTMCT   EQU   MCT                                                      03954000
ICTEND   EQU   ICT+88                                                   03955000
ICTRSVB3 EQU   ICT+87                                                   03956000
ICTRSVB2 EQU   ICT+86                                                   03957000
ICTRSVB1 EQU   ICT+85                                                   03958000
ICT003   EQU   ICTFLAGS                                                 03959000
ICTIOOT  EQU   ICTFLAGS                                                 03960000
ICTIOL   EQU   ICTFLAGS                                                 03961000
ICTDRSV4 EQU   ICTFLAGS                                                 03962000
ICVIRSV3 EQU   ICT+80                                                   03963000
ICVULCBT EQU   ICT+76                                                   03964000
ICVOLCBT EQU   ICT+72                                                   03965000
ICVLCBPT EQU   ICT+68                                                   03966000
ICVLUTBT EQU   ICT+64                                                   03967000
ICCEND   EQU   ICT+64                                                   03968000
ICCRSV01 EQU   ICT+62                                                   03969000
ICCEDSUT EQU   ICT+60                                                   03970000
ICCSRSV2 EQU   ICT+58                                                   03971000
ICCSIGUP EQU   ICT+56                                                   03972000
ICCINDAT EQU   ICT+52                                                   03973000
ICCINLOT EQU   ICT+48                                                   03974000
ICCINHIT EQU   ICT+44                                                   03975000
ICCDAUTH EQU   ICT+42                                                   03976000
ICCLOUTH EQU   ICT+40                                                   03977000
ICCHIUTH EQU   ICT+38                                                   03978000
ICCDASF2 EQU   ICT+36                                                   03979000
ICCDASF1 EQU   ICT+34                                                   03980000
ICCMINRV EQU   ICT+32                                                   03981000
ICCMAXRV EQU   ICT+30                                                   03982000
ICCRVSCF EQU   ICT+28                                                   03983000
ICCMNIOR EQU   ICT+26                                                   03984000
ICCLCHN  EQU   ICT+24                                                   03985000
ICCLCLST EQU   ICT+20                                                   03986000
ICCMNSWP EQU   ICT+16                                                   03987000
ICCMNUIN EQU   ICT+12                                                   03988000
ICCMXICT EQU   ICT+8                                                    03989000
ICCMRSV1 EQU   ICT+4                                                    03990000
ICTICT   EQU   ICT                                                      03991000
CCVEND   EQU   CCT+128                                                  03992000
CCTFLG2  EQU   CCT+125                                                  03993000
CCTCPUOT EQU   CCTFLG1                                                  03994000
CCTALL   EQU   CCTFLG1                                                  03995000
CCVCPUCT EQU   CCT+122                                                  03996000
CCVENQCT EQU   CCT+120                                                  03997000
CCVLGFMC EQU   CCT+118                                                  03998000
CCVLGUTL EQU   CCT+116                                                  03999000
CCVR07   EQU   CCT+114                                                  04000000
CCVR06   EQU   CCT+112                                                  04001000
CCVR05   EQU   CCT+108                                                  04002000
CCVIMBBT EQU   CCT+104                                                  04003000
CCVEJST  EQU   CCT+100                                                  04004000
CCVPGCPF EQU   CCT+96                                                   04005000
CCVRVSWF EQU   CCT+92                                                   04006000
CCVRBSTD EQU   CCT+88                                                   04007000
CCVR04   EQU   CCT+84                                                   04008000
CCVRBSWT EQU   CCT+80                                                   04009000
CCVR03   EQU   CCT+76                                                   04010000
CCCEND   EQU   CCT+76                                                   04011000
CCCRSVH1 EQU   CCT+74                                                   04012000
CCCSCFC2 EQU   CCT+72                                                   04013000
CCCSCFC1 EQU   CCT+70                                                   04014000
CCCR02   EQU   CCT+68                                                   04015000
CCCSIGUR EQU   CCT+66                                                   04016000
CCCSIGDP EQU   CCT+64                                                   04017000
CCCSCFAC EQU   CCT+62                                                   04018000
CCCMINRV EQU   CCT+60                                                   04019000
CCCMAXRV EQU   CCT+58                                                   04020000
CCCLOSCF EQU   CCT+56                                                   04021000
CCCHISCF EQU   CCT+54                                                   04022000
CCCUTLOT EQU   CCT+52                                                   04023000
CCCUTHIT EQU   CCT+50                                                   04024000
CCCAPRHT EQU   CCT+48                                                   04025000
CCCAPRLT EQU   CCT+46                                                   04026000
CCCR01   EQU   CCT+44                                                   04027000
CCCAPGDP EQU   CCT+42                                                   04028000
CCCAPMDP EQU   CCT+40                                                   04029000
CCCAPLDP EQU   CCT+38                                                   04030000
CCCAPBDP EQU   CCT+36                                                   04031000
CCCAPROT EQU   CCT+34                                                   04032000
CCCAPDIV EQU   CCT+32                                                   04033000
CCCRSVF1 EQU   CCT+28                                                   04034000
CCCMNSIN EQU   CCT+24                                                   04035000
CCCMNUIN EQU   CCT+20                                                   04036000
CCCAPDEL EQU   CCT+16                                                   04037000
CCCAPMAX EQU   CCT+12                                                   04038000
CCCAPMIN EQU   CCT+8                                                    04039000
CCCAPMET EQU   CCT+4                                                    04040000
CCTCCT   EQU   CCT                                                      04041000
RMCTEND  EQU   RMCT+192                                                 04042000
RMCTR50  EQU   RMCT+190                                                 04043000
RMCTDMNC EQU   RMCT+188                                                 04044000
RMCTSRBT EQU   RMCT+176                                                 04045000
RMCTOUXB EQU   RMCT+172                                                 04046000
RMCTOUCB EQU   RMCT+168                                                 04047000
RMCTTOCI EQU   RMCT+160                                                 04048000
RMCTCPID EQU   RMCT+156                                                 04049000
RMCTTELM EQU   RMCT+152                                                 04050000
RMCTF09  EQU   RMCTFLGS+1                                               04051000
RMCTMFS  EQU   RMCTFLGS+1                                               04052000
RMCTF07  EQU   RMCTFLGS+1                                               04053000
RMCTF06  EQU   RMCTFLGS                                                 04054000
RMCTRSV2 EQU   RMCTFLGS                                                 04055000
RMCTSTW  EQU   RMCTFLGS                                                 04056000
RMCTRSV1 EQU   RMCTFLGS                                                 04057000
RMCTINIT EQU   RMCTFLGS                                                 04058000
RMCTF03  EQU   RMCTFLGS                                                 04059000
RMCTCPS1 EQU   RMCTFLGS                                                 04060000
RMCTMFA  EQU   RMCTFLGS                                                 04061000
RMCTRQSV EQU   RMCT+144                                                 04062000
RMCTALR  EQU   RMCT+140                                                 04063000
RMCTALA  EQU   RMCT+136                                                 04064000
RMCTTOC  EQU   RMCT+128                                                 04065000
RMCTTBS  EQU   RMCT+120                                                 04066000
RMCTR10  EQU   RMCT+116                                                 04067000
RMCTOTQE EQU   RMCT+108                                                 04068000
RMCTAQHD EQU   RMCT+100                                                 04069000
RMCTAQCT EQU   RMCT+96                                                  04070000
RMCTTMQE EQU   RMCT+92                                                  04071000
RMCTWAMT EQU   RMCT+88                                                  04072000
RMCTWAST EQU   RMCT+84                                                  04073000
RMCTEPPR EQU   RMCT+80                                                  04074000
RMCTFLTM EQU   RMCT+76                                                  04075000
RMCTEPET EQU   RMCT+72                                                  04076000
RMCTITT  EQU   RMCT+68                                                  04077000
RMCTADJC EQU   RMCT+64                                                  04078000
RMCTEPBG EQU   RMCT+60                                                  04079000
RMCTEPAT EQU   RMCT+56                                                  04080000
RMCTEPDT EQU   RMCT+52                                                  04081000
RMCTEPPA EQU   RMCT+48                                                  04082000
RMCTRMSB EQU   RMCT+44                                                  04083000
RMCTRMEX EQU   RMCT+40                                                  04084000
RMCTRMPD EQU   RMCT+36                                                  04085000
RMCTRMSA EQU   RMCT+32                                                  04086000
RMCTRLCT EQU   RMCT+28                                                  04087000
RMCTWMST EQU   RMCT+24                                                  04088000
RMCTRMCA EQU   RMCT+20                                                  04089000
RMCTRMPT EQU   RMCT+16                                                  04090000
RMCTMCT  EQU   RMCT+12                                                  04091000
RMCTICT  EQU   RMCT+8                                                   04092000
RMCTCCT  EQU   RMCT+4                                                   04093000
RMCTNAME EQU   RMCT                                                     04094000
@NM00032 EQU   PSA+3668                                                 04095000
PSASTAK  EQU   PSA+3072                                                 04096000
@NM00031 EQU   PSA+1048                                                 04097000
PSAUSEND EQU   PSA+1048                                                 04098000
PSARV062 EQU   PSA+1044                                                 04099000
PSACDAL  EQU   PSA+1040                                                 04100000
PSAWTCOD EQU   PSA+1036                                                 04101000
PSAATCVT EQU   PSA+1032                                                 04102000
PSAPCPSW EQU   PSA+1024                                                 04103000
PSAPIR2  EQU   PSA+1020                                                 04104000
PSARV059 EQU   PSA+1018                                                 04105000
PSASVC13 EQU   PSA+1016                                                 04106000
PSALSFCC EQU   PSA+1012                                                 04107000
PSASFACC EQU   PSA+1008                                                 04108000
PSASTOP  EQU   PSA+992                                                  04109000
PSASTART EQU   PSA+976                                                  04110000
PSARSPSW EQU   PSA+968                                                  04111000
PSASRPSW EQU   PSA+960                                                  04112000
PSARV045 EQU   PSA+892                                                  04113000
PSARV044 EQU   PSA+888                                                  04114000
PSARV043 EQU   PSA+884                                                  04115000
PSARV042 EQU   PSA+880                                                  04116000
PSARV041 EQU   PSA+876                                                  04117000
PSARV040 EQU   PSA+872                                                  04118000
PSARV025 EQU   PSA+868                                                  04119000
PSADSSED EQU   PSA+868                                                  04120000
PSADSSPR EQU   PSA+864                                                  04121000
PSADSSFW EQU   PSA+860                                                  04122000
PSADSS14 EQU   PSA+856                                                  04123000
PSADSSPP EQU   PSA+848                                                  04124000
PSADSSRP EQU   PSA+840                                                  04125000
PSADSS05 EQU   PSADSSF4                                                 04126000
PSADSS10 EQU   PSADSSF4                                                 04127000
PSADSSVE EQU   PSADSSF4                                                 04128000
PSADSSDE EQU   PSADSSF4                                                 04129000
PSADSSC0 EQU   PSADSSF4                                                 04130000
PSADSSIE EQU   PSADSSF4                                                 04131000
PSADSS12 EQU   PSADSSF4                                                 04132000
PSADSSRC EQU   PSADSSF4                                                 04133000
PSARV057 EQU   PSADSSF3                                                 04134000
PSARV056 EQU   PSADSSF3                                                 04135000
PSARV055 EQU   PSADSSF3                                                 04136000
PSADSSMC EQU   PSADSSF3                                                 04137000
PSADSSRW EQU   PSADSSF3                                                 04138000
PSADSSNM EQU   PSADSSF3                                                 04139000
PSADSSES EQU   PSADSSF3                                                 04140000
PSADSSGP EQU   PSADSSF3                                                 04141000
PSADSSF2 EQU   PSADSSFL+1                                               04142000
PSADSSPI EQU   PSADSSF1                                                 04143000
PSADSSOI EQU   PSADSSF1                                                 04144000
PSADSSSP EQU   PSADSSF1                                                 04145000
PSADSSTP EQU   PSADSSF1                                                 04146000
PSADSSDW EQU   PSADSSF1                                                 04147000
PSADSSDD EQU   PSADSSF1                                                 04148000
PSADSSDM EQU   PSADSSF1                                                 04149000
PSADSSMV EQU   PSADSSF1                                                 04150000
PSADSSTS EQU   PSA+816                                                  04151000
PSADSSWK EQU   PSA+812                                                  04152000
PSADSSR3 EQU   PSA+808                                                  04153000
PSADSSR2 EQU   PSA+804                                                  04154000
PSADSSRS EQU   PSA+800                                                  04155000
PSASTOR  EQU   PSA+796                                                  04156000
PSACPUSA EQU   PSA+794                                                  04157000
PSAVSTAP EQU   PSA+792                                                  04158000
PSAWKVAP EQU   PSA+788                                                  04159000
PSAWKRAP EQU   PSA+784                                                  04160000
PSAMCHIC EQU   PSA+783                                                  04161000
PSARV061 EQU   PSA+782                                                  04162000
PSASYMSK EQU   PSA+781                                                  04163000
PSAMCHFL EQU   PSA+780                                                  04164000
PSACR0   EQU   PSA+776                                                  04165000
PSAPSWSV EQU   PSA+768                                                  04166000
PSALITA  EQU   PSA+764                                                  04167000
PSACLHS  EQU   PSAHLHI                                                  04168000
PSALKR15 EQU   PSALKSA+60                                               04169000
PSALKR14 EQU   PSALKSA+56                                               04170000
PSALKR13 EQU   PSALKSA+52                                               04171000
PSALKR12 EQU   PSALKSA+48                                               04172000
PSALKR11 EQU   PSALKSA+44                                               04173000
PSALKR10 EQU   PSALKSA+40                                               04174000
PSALKR9  EQU   PSALKSA+36                                               04175000
PSALKR8  EQU   PSALKSA+32                                               04176000
PSALKR7  EQU   PSALKSA+28                                               04177000
PSALKR6  EQU   PSALKSA+24                                               04178000
PSALKR5  EQU   PSALKSA+20                                               04179000
PSALKR4  EQU   PSALKSA+16                                               04180000
PSALKR3  EQU   PSALKSA+12                                               04181000
PSALKR2  EQU   PSALKSA+8                                                04182000
PSALKR1  EQU   PSALKSA+4                                                04183000
PSALKR0  EQU   PSALKSA                                                  04184000
PSARV023 EQU   PSACLHT+52                                               04185000
PSALOCAL EQU   PSACLHT+48                                               04186000
PSACMSL  EQU   PSACLHT+44                                               04187000
PSAOPTL  EQU   PSACLHT+40                                               04188000
PSATPACL EQU   PSACLHT+36                                               04189000
PSATPDNL EQU   PSACLHT+32                                               04190000
PSATPNCL EQU   PSACLHT+28                                               04191000
PSAIOSLL EQU   PSACLHT+24                                               04192000
PSAIOSUL EQU   PSACLHT+20                                               04193000
PSAIOSCL EQU   PSACLHT+16                                               04194000
PSAIOSSL EQU   PSACLHT+12                                               04195000
PSASALCL EQU   PSACLHT+8                                                04196000
PSAASML  EQU   PSACLHT+4                                                04197000
PSADISPL EQU   PSACLHT                                                  04198000
PSASRSA  EQU   PSA+636                                                  04199000
PSARV050 EQU   PSA+634                                                  04200000
PSADSSGO EQU   PSA+633                                                  04201000
PSARECUR EQU   PSA+632                                                  04202000
PSAHLHIS EQU   PSA+628                                                  04203000
PSAIPCSA EQU   PSA+624                                                  04204000
@NM00030 EQU   PSA+621                                                  04205000
PSAIPCDM EQU   PSA+620                                                  04206000
PSAIPCD  EQU   PSA+616                                                  04207000
@NM00029 EQU   PSA+613                                                  04208000
PSAIPCRM EQU   PSA+612                                                  04209000
PSAIPCR  EQU   PSA+608                                                  04210000
PSAMCHEX EQU   PSA+600                                                  04211000
PSAMPSW  EQU   PSA+592                                                  04212000
PSAEXPS2 EQU   PSA+584                                                  04213000
PSAEXPS1 EQU   PSA+576                                                  04214000
PSAPIREG EQU   PSA+572                                                  04215000
PSARSREG EQU   PSA+568                                                  04216000
PSAGPREG EQU   PSA+556                                                  04217000
PSARV022 EQU   PSASUP4                                                  04218000
PSARV021 EQU   PSASUP4                                                  04219000
PSARV020 EQU   PSASUP4                                                  04220000
PSARV019 EQU   PSASUP4                                                  04221000
PSARV018 EQU   PSASUP4                                                  04222000
PSARV017 EQU   PSASUP4                                                  04223000
PSARV016 EQU   PSASUP4                                                  04224000
PSARV015 EQU   PSASUP4                                                  04225000
PSARV014 EQU   PSASUP3                                                  04226000
PSAULCMS EQU   PSASUP3                                                  04227000
PSARV012 EQU   PSASUP3                                                  04228000
PSAESTA  EQU   PSASUP3                                                  04229000
PSASPR   EQU   PSASUP3                                                  04230000
PSAPSREG EQU   PSASUP3                                                  04231000
PSAPI2   EQU   PSASUP3                                                  04232000
PSAIOSUP EQU   PSASUP3                                                  04233000
PSALCR   EQU   PSASUP2                                                  04234000
PSARTM   EQU   PSASUP2                                                  04235000
PSAACR   EQU   PSASUP2                                                  04236000
PSAIPCE2 EQU   PSASUP2                                                  04237000
PSAIPCES EQU   PSASUP2                                                  04238000
PSAIPCEC EQU   PSASUP2                                                  04239000
PSAGTF   EQU   PSASUP2                                                  04240000
PSAIPCRI EQU   PSASUP2                                                  04241000
PSATYPE6 EQU   PSASUP1                                                  04242000
PSATCTL  EQU   PSASUP1                                                  04243000
PSADISP  EQU   PSASUP1                                                  04244000
PSALOCK  EQU   PSASUP1                                                  04245000
PSAPI    EQU   PSASUP1                                                  04246000
PSAEXT   EQU   PSASUP1                                                  04247000
PSASVC   EQU   PSASUP1                                                  04248000
PSAIO    EQU   PSASUP1                                                  04249000
PSAAOLD  EQU   PSA+548                                                  04250000
PSAANEW  EQU   PSA+544                                                  04251000
PSATOLD  EQU   PSA+540                                                  04252000
PSATNEW  EQU   PSA+536                                                  04253000
PSALCCAR EQU   PSA+532                                                  04254000
PSALCCAV EQU   PSA+528                                                  04255000
PSAPCCAR EQU   PSA+524                                                  04256000
PSAPCCAV EQU   PSA+520                                                  04257000
PSACPULA EQU   PSA+518                                                  04258000
PSACPUPA EQU   PSA+516                                                  04259000
PSAPSA   EQU   PSA+512                                                  04260000
FLCHDEND EQU   PSA+512                                                  04261000
FLCCRSAV EQU   FLCMCLA+280                                              04262000
FLCGRSAV EQU   FLCMCLA+216                                              04263000
FLCFPSAV EQU   FLCMCLA+184                                              04264000
FLCFLA   EQU   FLCMCLA+88                                               04265000
FLCRGNCD EQU   FLCMCLA+84                                               04266000
FLCFSAA  EQU   FLCFSA+1                                                 04267000
@NM00028 EQU   FLCFSA                                                   04268000
@NM00027 EQU   FLCMCLA+72                                               04269000
FLCMCIC  EQU   FLCMCLA+64                                               04270000
@NM00026 EQU   FLCMCLA+20                                               04271000
FLCIOAA  EQU   FLCIOA+1                                                 04272000
@NM00025 EQU   FLCIOA                                                   04273000
@NM00024 EQU   FLCMCLA+15                                               04274000
@NM00023 EQU   FLCMCLA+14                                               04275000
@NM00022 EQU   FLCMCLA+12                                               04276000
FLCLCL   EQU   FLCMCLA+8                                                04277000
FLCIOELA EQU   FLCIOEL+1                                                04278000
@NM00021 EQU   FLCIOEL                                                  04279000
FLCCHNID EQU   FLCMCLA                                                  04280000
@NM00020 EQU   PSA+160                                                  04281000
FLCMTRCD EQU   PSA+157                                                  04282000
@NM00019 EQU   PSA+156                                                  04283000
FLCPERA  EQU   FLCPER+1                                                 04284000
@NM00018 EQU   FLCPER                                                   04285000
@NM00017 EQU   PSA+151                                                  04286000
FLCPERCD EQU   PSA+150                                                  04287000
FLCMCNUM EQU   PSA+149                                                  04288000
@NM00016 EQU   PSA+148                                                  04289000
FLCTEAA  EQU   FLCTEA+1                                                 04290000
@NM00015 EQU   FLCTEA                                                   04291000
PSAPIPC  EQU   PSAPICOD                                                 04292000
PSAPIMC  EQU   PSAPICOD                                                 04293000
PSAPIPER EQU   PSAPICOD                                                 04294000
PSARV049 EQU   FLCPICOD                                                 04295000
FLCPILCB EQU   FLCPIILC                                                 04296000
@NM00014 EQU   FLCPIILC                                                 04297000
@NM00013 EQU   PSAEPPSW                                                 04298000
FLCSVCN  EQU   PSAESPSW+2                                               04299000
FLCSILCB EQU   FLCSVILC                                                 04300000
@NM00012 EQU   FLCSVILC                                                 04301000
@NM00011 EQU   PSAESPSW                                                 04302000
FLCEICOD EQU   PSAEEPSW+2                                               04303000
PSASPAD  EQU   PSAEEPSW                                                 04304000
@NM00010 EQU   PSA+128                                                  04305000
FLCINPSW EQU   PSA+120                                                  04306000
FLCMNPSW EQU   PSA+112                                                  04307000
FLCPNPSW EQU   PSA+104                                                  04308000
FLCSNPSW EQU   PSA+96                                                   04309000
FLCENPSW EQU   PSA+88                                                   04310000
FLCTRACE EQU   PSA+84                                                   04311000
FLCTIMER EQU   PSA+80                                                   04312000
FLCCVT2  EQU   PSA+76                                                   04313000
FLCCAW   EQU   PSA+72                                                   04314000
FLCCSW   EQU   PSA+64                                                   04315000
FLCIOPSW EQU   PSA+56                                                   04316000
FLCMOPSW EQU   PSA+48                                                   04317000
FLCPOPSW EQU   PSA+40                                                   04318000
FLCSOPSW EQU   PSA+32                                                   04319000
FLCEOPSW EQU   PSA+24                                                   04320000
@NM00009 EQU   FLCICCW2+4                                               04321000
FLCICCW1 EQU   FLCROPSW                                                 04322000
FLCIPPSW EQU   FLCRNPSW                                                 04323000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      04324000
@RF00194 EQU   REINVOKE                                                 04325000
@RF00192 EQU   REINVOKE                                                 04326000
@RF00332 EQU   @RC00330                                                 04327000
@RF00499 EQU   @EL00002                                                 04328000
@ENDDATA EQU   *                                                        04329000
         END   IRARMSTM,(C'PLS2021',0701,78177)                         04330000
