         TITLE 'IRARMWLM -- SYSTEM RESOURCES MANAGER WORKLOAD MANAGER  *00001000
                        '                                               00002000
IRARMWLM CSECT ,                                                01S0001 00003000
@PROLOG  BALR  @12,0                                            01S0001 00004000
@PSTART  DS    0H                                               01S0001 00005000
         USING @PSTART,@12                                      01S0001 00006000
*;                                                              01S0028 00007000
*/* SERVICE CALCULATOR ROUTINE                                       */ 00008000
*/* **************************************************************** */ 00009000
*/*                                                                  */ 00010000
*/*    ROUTINE NAME - IRARMWM1                                       */ 00011000
*/*                                                                  */ 00012000
*/*    DESCRIPTIVE NAME - WORKLOAD MANAGER SERVICE CALCULATOR        */ 00013000
*/*                       ROUTINE                                    */ 00014000
*/*                                                                  */ 00015000
*/*    FUNCTION - THE IRARMWM1 ROUTINE CALCULATES THE AMOUNT OF      */ 00016000
*/*          SERVICE PROVIDED TO AN USER SINCE THE BEGINNING OF      */ 00017000
*/*          THE CURRENT WORKLOAD MANAGER MEASUREMENT INTERVAL       */ 00018000
*/*          FOR THAT USER. SERVICE IS CALCULATED USING THE          */ 00019000
*/*          FOLLOWING EQUATION:                                     */ 00020000
*/*                                                                  */ 00021000
*/*          SERVICE = ((MP)/K)+((CT)/K)+EI  WHERE :                 */ 00022000
*/*                                                                  */ 00023000
*/*          T = THE JOB STEP TIME ELAPSED IN THE CURRENT INTERVAL.  */ 00024000
*/*          K = THE TIME REQUIRED TO EXECUTE 10,000 INSTRUCTIONS.   */ 00025000
*/*              ( DEPENDENT ON THE CPU MODEL)                       */ 00026000
*/*          M = THE MSO SERVICE COEFFICIENT SCALED BY 1/50.         */ 00027000
*/*          P = THE NUMBER OF PAGE-SECONDS USED BY THE USER         */ 00028000
*/*          C = THE CPU SERVICE COEFFICIENT.                        */ 00029000
*/*          E = THE EXCP COUNT FOR THIS INTERVAL.                   */ 00030000
*/*          I = THE I/O SERVICE COEFFICIENT.                        */ 00031000
*/*                                                                  */ 00032000
*/*          THIS ROUTINE CALCULATES EACH OF THE THREE SERVICE       */ 00033000
*/*          FACTORS AND THE TOTAL SERVICE FOR THE USER FOR THE      */ 00034000
*/*          INTERVAL.                                               */ 00035000
*/*                                                                  */ 00036000
*/*    CALLED BY - IRARME38 - USER SERVICE REQST SYSEVENT RTNE       */ 00037000
*/*                IRARMWM3 - USER WORKLOAD EVALUATION SBRTINE       */ 00038000
*/*                IRARMWMI - USER MEASUREMENT INTERVL SBRTINE       */ 00039000
*/*                IRARMWMK - USER APPLICABL ALGORITHM SBRTNE        */ 00040000
*/*                IRARMWM2 - ANALYSIS USER REORDERING ROUTINE       */ 00041000
*/*                IRARMWAR - WORKLOAD ACTIVITY REPORT ROUTINE       */ 00042000
*/*                                                                  */ 00043000
*/*    NOTE  - THE IRARMWM1 ROUTINE DOES NOT REQUIRE SERIALIZATN     */ 00044000
*/*            AGAINST OTHER SYSTEM RESOURCES MANAGER PROCESSES,     */ 00045000
*/*            WHICH COULD BE EXAMINING THE SAME OUCB FOR WHICH      */ 00046000
*/*            SERVICE IS BEING CALCULATED BY IRARMWM1.  SINCE       */ 00047000
*/*            THE RESULT OF IRARMWM1 IS A MORE CORRECT VALUE OF     */ 00048000
*/*            THE SERVICE ACCUMULATED BY A USER, IT IS ACCEPT-      */ 00049000
*/*            ABLE FOR SUCH UPDATING TO BE PERFORMED ON THE FLY.    */ 00050000
*/*                                                                  */ 00051000
*/*    INPUT - REG 4 CONTAINS THE ADDRESS OF THE OUCB FOR THE USER   */ 00052000
*/*            WHOSE INTERVAL SERVICE AMOUNTS ARE TO BE CALCULATED.  */ 00053000
*/*          - REG 14 CONTAINS THE RETURN ADDRESS.                   */ 00054000
*/*          - RMCTADJC CONTAINS THE TIME IN MICROSECONDS TO EXE-    */ 00055000
*/*            CUTE 10,000 INSTRUCTIONS.  A HEXADECIMAL POINT IS     */ 00056000
*/*            ASSUMED ONE PLACE TO THE LEFT IN ITS BINARY VALUE.    */ 00057000
*/*          - WMSTCPU CONTAINS THE CPU SERVICE COEFFICIENT.         */ 00058000
*/*          - WMSTIOC CONTAINS THE I/O SERVICE COEFFICIENT.         */ 00059000
*/*          - WMSTMSO CONTAINS THE MSO SERVICE COEFFICIENT. THIS    */ 00060000
*/*            VALUE IS SCALED BY 1/50.                              */ 00061000
*/*            (NOTE: THE SERVICE COEFFICIENTS HAVE HEXADECIMAL      */ 00062000
*/*            POINTS THREE PLACES TO THE LEFT                       */ 00063000
*/*            OF THE BINARY VALUES IN THESE FIELDS.)                */ 00064000
*/*          - ASCBEJST CONTAINS THE CUMULATIVE USER JOB STEP TIME.  */ 00065000
*/*            A HEXADECIMAL POINT IS ASSUMED 3 PLACES TO THE LEFT.  */ 00066000
*/*          - OUCBIOSM CONTAINS THE CUMULATIVE USER I/O REQST CNT.     00067000
*                                                          @ZA10808*/   00068000
*/*          - OUCBPSS CONTAINS THE CURRENT USER PAGE-SECONDS. A     */ 00069000
*/*            HEXADECIMAL POINT IS ASSUMED 0 PLACES TO THE LEFT.    */ 00070000
*/*          - OUXBCPS CONTAINS THE JOB STEP TIME VALUE FROM THE     */ 00071000
*/*            BEGINNING OF THE INTERVAL. A HEXADECIMAL POINT IS     */ 00072000
*/*            ASSUMED 3 PLACES TO THE LEFT.                         */ 00073000
*/*          - OUXBIOS CONTAINS THE I/O REQUEST COUNT FROM THE       */ 00074000
*/*            BEGINNING OF THE INTERVAL.                            */ 00075000
*/*          - OUXBMSS CONTAINS THE PAGE-SECONDS COUNT FROM THE      */ 00076000
*/*            BEFINNING OF THE INTERVAL.                            */ 00077000
*/*                                                                  */ 00078000
*/*    OUTPT - OUCBWMS CONTAINS THE ACCUMULATED INTERVAL SERVICE.    */ 00079000
*/*          - OUCBMSO CONTAINS THE REAL PAGE FRAMES OCCUPIED TIMES  */ 00080000
*/*            THE CPU SERVICE UNITS FOR THE INTERVAL.               */ 00081000
*/*          - OUCBCPU CONTAINS THE CPU SERVICE UNITS FOR THE        */ 00082000
*/*            INTERVAL.                                             */ 00083000
*/*          - OUCBIOC CONTAINS THE I/O SERVICE UNITS FOR THE        */ 00084000
*/*            INTERVAL.                                             */ 00085000
*/*                                                                  */ 00086000
*/*    EXIT  - BRANCH ON REGISTER 14.                                */ 00087000
*/*          - THERE IS NO ERROR EXIT OR INDICATION.                 */ 00088000
*/*                                                                  */ 00089000
*/* **************************************************************** */ 00090000
*  /* ? IRACTLEP EPN(WM1) */                                    02S0029 00091000
*  DCL IRARMWM1 ENTRY INT;                                      02S0029 00092000
*  GEN CODE REFS(LCCACPUS,PSALCCAV,WSACOPTM)                    02S0030 00093000
*        DEFS(IRARMWM1) NOEXIT SEQFLOW;                         02S0030 00094000
*                                  /*                                   00095000
         ENTRY IRARMWM1                                                 00096000
IRARMWM1 DS    0H                                                       00097000
         L     @15,PSALCCAV            LCCA ADDRESS                     00098000
         L     @15,LCCACPUS-LCCA(,@15) CPU SAVE AREA VECTOR TABLE       00099000
         L     @15,WSACOPTM-WSAC(,@15) SRM SAVE AREA START ADDRESS      00100000
         STM   @00,@14,128+000(@15)    SAVE INVOKING RTNE REGS          00101000
         LR    @13,@15                 ROUTINE SAVE AREA ADDRESS        00102000
         BALR  @15,0                   SETUP ENTRY ADDRESSABILITY       00103000
         LA    @12,*-@PSTART           DISPLACEMENT TO MODULE BASE      00104000
         LCR   @12,@12                 NEGATIVE FOR SUBTRACT            00105000
         ALR   @12,@15                 SETUP MODULE ADDRESSABILITY      00106000
*    WMSTPTR = RMCTWMST;            /* PICK WLM SPECIFICATION TABLE  */ 00107000
         L     WMSTPTR,RMCTWMST(,RMCTPTR)                       02S0031 00108000
*    ASCBPTR = OUCBASCB;            /* PICK ADDRS SPAC CONTROL BLOCK */ 00109000
         L     ASCBPTR,OUCBASCB(,OUCBPTR)                       02S0032 00110000
*    OUXBPTR = ASCBOUXB;            /* PICK USER CTRL BLCK EXTENSION */ 00111000
         L     OUXBPTR,ASCBOUXB(,ASCBPTR)                       02S0033 00112000
*    GEN CODE REFS(ASCBEJST,OUCBIOSM,RMCTADJC,OUXBMSS,          02S0034 00113000
*          OUXBCPS,OUXBIOS,WMSTMSO,WMSTCPU,WMSTIOC,OUCBWMS,     02S0034 00114000
*  OUCBMSO,OUCBCPU,OUCBIOC,OUXBIOSM,ASCBIOSM);     /*@ZA10808*/ 02S0034 00115000
*                                  /*                                   00116000
         LM    WKRE,WKRO,ASCBEJST(ASCBPTR) CURR JOB STEP TIME, IN       00117000
*                                      TIMER  UNITS . PICTURE IS        00118000
*                                      XXXXXXXXXXXXX.XXX                00119000
         SL    WKRO,OUXBCPS+4(,OUXBPTR)  SUB THE LOW ORDER WORD OF      00120000
*                                      THE PREVIOUS JOB STEP TIME.      00121000
         BC    @03,RMWM1B1             BRANCH ON CARRY                  00122000
         BCTR  WKRE,@00                PROPOGATE A BORROW.              00123000
RMWM1B1  SL    WKRE,OUXBCPS(,OUXBPTR)  SUBTRACT HI ORDER WORD           00124000
*                                      WRKE/WRKO NOW CONTAIN T.         00125000
         SLDL  WKRE,@01                INCLUDE HI ORDER BIT OF          00126000
*                                      DIVIDEND IN COMPARE  @ZA16890    00127000
         CL    WKRE,RMCTADJC(,RMCTPTR) WOULD A DIVIDE EXCEPTION OCCUR?  00128000
         SRDL  WKRE,@01                RESTORE DIVIDEND    @ZA16890     00129000
         BL    RMWM1B2                 BRANCH IF NOT                    00130000
         SLR   WKRE,WKRE               PREVENT DIVIDE EXCEPTION         00131000
RMWM1B2  D     WKRE,RMCTADJC(,RMCTPTR) DIVIDE ELAPSED TIME THIS         00132000
*                                      INTERVAL BY TIME REQUIRED        00133000
*                                      TO EXECUTE 10K INSTRUCTIONS      00134000
*                                      RMCTADJC HAS ONE HEX PLACE.      00135000
*        THIS RESULT IN WRKO IS T/K TO 2 HEX PLACES.                    00136000
*                                                                       00137000
         M     WKRE,WMSTCPU(,WMSTPTR)  THIS RESULT, IN WKRE AND WKRO,   00138000
*                                      IS (CT)/K TO 5 HEX PLACES.       00139000
         SRDA  WKRE,20                 ELIMINATE MISLEADING HEX PLACES  00140000
         ST    WKRO,OUCBCPU(,OUCBPTR)  STORE (CT)/K                     00141000
*                                                                       00142000
         LM    R14,R15,OUCBPSS(OUCBPTR) MSO PAGE-SECONDS                00143000
*                                      0 HEX PLACES                     00144000
         SL    R15,OUXBMSS+4(,OUXBPTR) SUBTRACT THE LOW ORDER WORD OF   00145000
*                                      THE PREVIOUS PAGE-SECOND COUNT   00146000
         BC    @03,RMWM1B3             BRANCH ON CARRY                  00147000
         BCTR  R14,0                   PROPOGATE A BORROW               00148000
RMWM1B3  SL    R14,OUXBMSS(,OUXBPTR)   SUBTRACT HI ORDER WORD           00149000
*                                      R14/R15 NOW CONTAIN P.           00150000
         SLDL  R14,10                  SCALE FOR DIVIDE                 00151000
*        THIS RESULT IS P TO 0 HEX PLACES IN MICRO-SECONDS              00152000
*                                                                       00153000
         D     R14,RMCTADJC(,RMCTPTR)  DIVIDE BY TIME REQUIRED TO       00154000
*                                      EXECUTE 10,000 INSTRUCTIONS.     00155000
*                                      RMCTADJC HAS ONE HEX PLACE       00156000
*        THIS RESULT IS P/K TO -1 HEX PLACES.                           00157000
*                                                                       00158000
         M     R14,WMSTMSO(,WMSTPTR)   MULTIPLY BY MSO SERVICE COEF.    00159000
*        THIS RESULT IS MP/K TO 2 HEX PLACES.                           00160000
*                                                                       00161000
         SRDA  R14,8                   ELIMINATED MISLEADING HEX        00162000
*                                      WORD ARITHMETIC.                 00163000
*                                                                       00164000
         ST    R15,OUCBMSO(,OUCBPTR)   STORE (MP)/K                     00165000
*                                                                       00166000
         ALR   WKRO,R15                (MP/K)+(CT/K) IS THIS RESULT.    00167000
*                                                                       00168000
         LH    R15,ASCBIOSM(,ASCBPTR) CURR JES EXCP COUNT @ZA10808      00169000
         N     R15,HWORDMSK            CLEAR EXTRANEOUS HWD @ZA08717    00170000
         LH    R14,OUXBIOS(,OUXBPTR) PREV JES I/O REQ COUNT @ZA10808    00171000
         N     R14,HWORDMSK            CLEAR EXTRANEOUS HWD @ZA08717    00172000
         SLR   R15,R14         JES SERV I/O REQUEST  COUNT @ZA10808     00173000
         BNM   RMWM1B4                 NO WRAPPING          @ZA10808    00174000
         SR    R15,R15                 CLEAR IF WRAP        @ZA10808    00175000
RMWM1B4  AL    R15,OUCBIOSM(,OUCBPTR) ADD SMF EXCP COUNT   @ZA10808     00176000
         SL    R15,OUXBIOSM(,OUXBPTR)  SUB. PREV SMF COUNT  @ZA10808    00177000
* R15 CONTAINS TOTAL SERVICE I/O REQUEST COUNT              @ZA10808    00178000
         M     R14,WMSTIOC(,WMSTPTR)   RESULT, IN R14 AND R15, IS EI.   00179000
         SRDA  R14,12                  ELIMINATE EXTRANEOUS HEX PLACES  00180000
*                                                                       00181000
         ST    R15,OUCBIOC(,OUCBPTR)   STORE (EI)                       00182000
*                                                                       00183000
         ALR   WKRO,R15                FINAL RESULT, IN WKRO, IS        00184000
*                                      (MP/K)+(CT/K)+(EI)               00185000
*                                                                       00186000
         ST    WKRO,OUCBWMS(,OUCBPTR)  SAVE CALCULATED SERVICE          00187000
*  /* ? IRACTLEP ENN(WM1) */                                    02S0035 00188000
*  GEN CODE EXIT NOSEQFLOW;                                     02S0035 00189000
*                                  /*                                   00190000
         LM    @00,@14,128+000(@13)    RELOAD INVOKING RTNE REGS        00191000
         BR    RTNREG                  RETURN TO INVOKER                00192000
*                                                               01S0036 00193000
*/* SWAPPABLE USER EVALUATION ROUTINE                                */ 00194000
*/* **************************************************************** */ 00195000
*/*                                                                  */ 00196000
*/*    ROUTINE NAME - IRARMWM2                                       */ 00197000
*/*                                                                  */ 00198000
*/*    DESCRIPTIVE NAME - SWAPPABLE USER EVALUATION ROUTINE          */ 00199000
*/*                                                                  */ 00200000
*/*    FUNCTION - THE IRARMWM2 ROUTINE SCANS THE IN-CORE QUEUE AND   */ 00201000
*/*          THE OUT-OF-CORE-BUT-READY QUEUE, AND EVALUATES EACH     */ 00202000
*/*          SWAPPABLE USER ASSIGNING  EACH HIS CURRENT WORKLOAD LVL */ 00203000
*/*                                                                  */ 00204000
*/*    CALLED BY - IRARMCEL - TIMED ALOGORITHM SCHEDULING ROUTINE    */ 00205000
*/*                                                                  */ 00206000
*/*    NOTE  - THE IRARMWM2 ROUTINE IS RUN UNDER THE CONTROL OF      */ 00207000
*/*            THE SYSTEM RESOURCES MANAGER ANALYSIS LOCK.           */ 00208000
*/*                                                                  */ 00209000
*/*    INPUT - THE OUCB QUEUES LOCATED BY RMCTINQE AND RMCTOTQE      */ 00210000
*/*            CONTAIN THE USERS TO WHOM SWAP ANALYSIS APPLIES.      */ 00211000
*/*                                                                  */ 00212000
*/*    OUTPT - THE OUCBS ON THE SWAP ANALYSIS QUEUES HAVE BEEN       */ 00213000
*/*            ASSIGNED A WORKLOAD MANAGER RECOMMENDATION VALUE.     */ 00214000
*/*                                                                  */ 00215000
*/*    EXIT  - BRANCH ON REGISTER 14.                                */ 00216000
*/*          - THERE IS NO ERROR EXIT OR INDICATION.                 */ 00217000
*/*                                                                  */ 00218000
*/* **************************************************************** */ 00219000
*  /* ? IRACTLEP EPN(WM2) */                                    02S0036 00220000
*  DCL IRARMWM2 ENTRY INT;                                      02S0036 00221000
*  GEN CODE REFS(RRPAEPA)                                       02S0037 00222000
*        DEFS(IRARMWM2) NOEXIT SEQFLOW;                         02S0037 00223000
*                                  /*                                   00224000
         ENTRY IRARMWM2                                                 00225000
IRARMWM2 DS    0H                                                       00226000
         STM   @00,@14,000+000(@13)    SAVE INVOKING RTNE REGS          00227000
         ST    @01,RRPAEPA(,RRPAPTR)   INDICATE NEW CURRENT RMEP        00228000
         LA    @12,IRARMWM2-@PSTART    DISPLACEMENT TO MODULE BASE      00229000
         LCR   @12,@12                 NEGATIVE FOR SUBTRACT            00230000
         ALR   @12,@15                 SETUP MODULE ADDRESSABILITY      00231000
*    STPR = SVEREG;                 /* SAVE INPUT SAVEAREA ADDRESS   */ 00232000
         LR    STPR,SVEREG                                      02S0038 00233000
*    /* THE FOLLOWING CODE STEPS THROUGH THE IN-QUEUE AND THE OUT-   */ 00234000
*    /* QUEUE.  THE WAIT-QUE IS NOT SCANNED                          */ 00235000
*    /* BECAUSE ANALYSIS IS NOT APPLICABLE TO USERS ON THAT QUEUE.   */ 00236000
*    DO PMRE = ADDR(RMCTOTQE) TO ADDR(RMCTINQE) BY LENGTH(RMCTOTQE);    00237000
         LA    PMRE,RMCTOTQE(,RMCTPTR)                          02S0039 00238000
         B     @DE00039                                         02S0039 00239000
@DL00039 DS    0H                                               02S0040 00240000
*    OUCBPTR = PMRE -> IRARMPTR -> OUCBFWD; /* PICK 1ST USER ON QUE */  00241000
         L     @09,IRARMPTR(,PMRE)                              02S0040 00242000
         L     OUCBPTR,OUCBFWD(,@09)                            02S0040 00243000
*    WKRE = OUCBFWD;            /* SAVE PTR FOR QUEUE ORDER  @ZA11855*/ 00244000
         L     WKRE,OUCBFWD(,OUCBPTR)                           02S0041 00245000
*      /* SCAN CONTENTS OF THE INDIVIDUAL SWAP ANALYSIS QUEUE.  THE  */ 00246000
*      /* USERS CAN BE IN VARIOUS STATES, SO END IS GIVN BY BLK NAME */ 00247000
*      DO WHILE (OUCBNAME = 'OUCB');                            02S0042 00248000
         B     @DE00042                                         02S0042 00249000
@DL00042 DS    0H                                               02S0043 00250000
*      IF OUCBGOO = '0'B & OUCBGOI = '0'B & /* USER NOT BEING SWAPPD */ 00251000
*            OUCBGOB = '0'B & OUCBINV = '0'B & /* USER IS QUEUED OK  */ 00252000
*            OUCBNSW = '0'B & OUCBPVL = '0'B THEN /* USER SWAPPABLE  */ 00253000
         TM    OUCBGOO(OUCBPTR),B'11100000'                     02S0043 00254000
         BNZ   @RF00043                                         02S0043 00255000
         TM    OUCBINV(OUCBPTR),B'10010100'                     02S0043 00256000
         BNZ   @RF00043                                         02S0043 00257000
*        /* BYPASS RE-ANALYSIS OF USER RECENTLY EVALUATED ON QUEUE   */ 00258000
*           IF RRPATOD-OUCBTMA>RMPTWMET/* USER NOT RECENTLY ANALYZED */ 00259000
*             &OUCBTMW ^= ZERO THEN /* TRANSACTION INTERVAL EXISTS   */ 00260000
         L     @09,RRPATOD(,RRPAPTR)                            02S0044 00261000
         SL    @09,OUCBTMA(,OUCBPTR)                            02S0044 00262000
         CL    @09,RMPTWMET(,RMCTPTR)                           02S0044 00263000
         BNH   @RF00044                                         02S0044 00264000
         L     @09,OUCBTMW(,OUCBPTR)                            02S0044 00265000
         LTR   @09,@09                                          02S0044 00266000
         BZ    @RF00044                                         02S0044 00267000
*             DO;                                               02S0045 00268000
*             WMSTPTR = RMCTWMST; /* ADDRESS OF WMST        @ZM43084*/  00269000
         L     WMSTPTR,RMCTWMST(,RMCTPTR)                       02S0046 00270000
*             WPGDPTR = WMSTPGDT+OUCBWMG; /* ADDR OF PERFORMANCE        00271000
*                                          GROUP DESCRIPTOR @ZM43084*/  00272000
         LH    WPGDPTR,OUCBWMG(,OUCBPTR)                        02S0047 00273000
         AL    WPGDPTR,WMSTPGDT(,WMSTPTR)                       02S0047 00274000
*             WPGPPTR = WPGDPTR+OUCBPGP;  /* ADDRESS OF CURRENT 02S0048 00275000
*                                         PERIOD DESCRIPTOR @ZM43084*/  00276000
         LR    WPGPPTR,WPGDPTR                                  02S0048 00277000
         SLR   @09,@09                                          02S0048 00278000
         IC    @09,OUCBPGP(,OUCBPTR)                            02S0048 00279000
         ALR   WPGPPTR,@09                                      02S0048 00280000
*             IF WPGPUNT = '1'B  |  /* DUR IS REAL TIME     @ZM43084*/  00281000
*                  OUCBOUT='0'B THEN /* OR USER IN (UNT=S)  @ZA11855*/  00282000
         TM    WPGPUNT(WPGPPTR),B'01000000'                     02S0049 00283000
         BO    @RT00049                                         02S0049 00284000
         TM    OUCBOUT(OUCBPTR),B'00000100'                     02S0049 00285000
         BNZ   @RF00049                                         02S0049 00286000
@RT00049 DS    0H                                               02S0050 00287000
*          /* DETERMINE USER NORMALIZED WORKLOAD LEVEL               */ 00288000
*          DO;                                                  02S0050 00289000
*          IF OUCBOUT = '0'B THEN   /* USER IS NOW RECEIVING SERVICE */ 00290000
         TM    OUCBOUT(OUCBPTR),B'00000100'                     02S0051 00291000
         BNZ   @RF00051                                         02S0051 00292000
*            /* ? IRACTLCL EPN(WM1) */                          02S0052 00293000
*            CALL RMSBWM1 -> IRARMRTN ;         /* INVOKE WM1 SUBRTN */ 00294000
         L     @15,RMSBWM1(,RMCTPTR)                            02S0052 00295000
         BALR  @14,@15                                          02S0052 00296000
*          CALL IRARMWM5;           /* CHECK PERFORMANCE GRP PERIOD  */ 00297000
@RF00051 LA    @15,IRARMWM5                                     02S0053 00298000
         BALR  @14,@15                                          02S0053 00299000
*          CALL IRARMWM7;           /* OBTAIN USER NORMALIZED LEVEL  */ 00300000
         BAL   @14,IRARMWM7                                     02S0054 00301000
*          END;                                                 02S0055 00302000
*         END;                      /*                      @ZM43084*/  00303000
@RF00049 DS    0H                                               02S0057 00304000
*      OUCBPTR = WKRE;              /* OUCB AS SAVED ...WM5 MAY      */ 00305000
@RF00044 DS    0H                                               02S0057 00306000
@RF00043 LR    OUCBPTR,WKRE                                     02S0057 00307000
*                                   /* CHANGE QUEUE POSITION.@ZA11855*/ 00308000
*      WKRE=OUCBFWD;                /* SAVE NEXT FWD PTR.    @ZA11855*/ 00309000
         L     WKRE,OUCBFWD(,OUCBPTR)                           02S0058 00310000
*      END;                                                     02S0059 00311000
@DE00042 CLC   OUCBNAME(4,OUCBPTR),@CC02243                     02S0059 00312000
         BE    @DL00042                                         02S0059 00313000
*    END;                                                       02S0060 00314000
         AL    PMRE,@CF00036                                    02S0060 00315000
@DE00039 LA    @09,RMCTINQE(,RMCTPTR)                           02S0060 00316000
         CLR   PMRE,@09                                         02S0060 00317000
         BNH   @DL00039                                         02S0060 00318000
*    SVEREG = STPR;                 /* RESTORE INPUT SAVEAR ADDRESS  */ 00319000
         LR    SVEREG,STPR                                      02S0061 00320000
*  /* ? IRACTLEP ENN(WM2) */                                    02S0062 00321000
*  GEN CODE EXIT NOSEQFLOW;                                     02S0062 00322000
*                                  /*                                   00323000
         LM    @00,@14,000+000(@13)    RELOAD INVOKING RTNE REGS        00324000
         BR    RTNREG                  RETURN TO INVOKER                00325000
*                                                               01S0063 00326000
*/* WORKLOAD MANAGER USER EVALUATION ROUTINE                         */ 00327000
*/* **************************************************************** */ 00328000
*/*                                                                  */ 00329000
*/*    ROUTINE NAME - IRARMWM3                                       */ 00330000
*/*                                                                  */ 00331000
*/*    DESCRIPTIVE NAME - INDIVIDUAL USER EVALUATION ROUTINE         */ 00332000
*/*                                                                  */ 00333000
*/*    FUNCTION - THE IRARMWM3 ROUTINE EVALUATES SWAPPBLE USERS      */ 00334000
*/*               ON THE IN AND OUT QUEUE, ASSIGNING EACH A          */ 00335000
*/*               CURRENT RECOMMENDATION VALUE.                      */ 00336000
*/*                                                                  */ 00337000
*/*    CALLED BY - IRARMEQ1 - ENQ STATUS CHANGE ROUTINE              */ 00338000
*/*              - IRARMASM - AUX STORAGE MANAGEMENT ROUTINE         */ 00339000
*/*              - IRARMMS2 - MAIN STORAGE OCCUPANCY ROUTINE         */ 00340000
*/*                                                                  */ 00341000
*/*    INPUT - REG 4 CONTAINS THE ADDRESS OF THE OUCB FOR THE USER   */ 00342000
*/*            WHOSE WORKLOAD LEVEL IS TO BE EVALUATED.              */ 00343000
*/*          - REG 14 CONTAINS THE RETURN ADDRESS.                   */ 00344000
*/*          - REG 15 CONTAINS THE IRARMWM3 RTNE ADDRESS.            */ 00345000
*/*                                                                  */ 00346000
*/*    OUTPT - OUCBWMR CONTAINS THE USER'S RECOMMENDATION VALUE.     */ 00347000
*/*                                                                  */ 00348000
*/*    EXIT  - BRANCH ON REGISTER 14.                                */ 00349000
*/*          - THERE IS NO ERROR EXIT OR INDICATION.                 */ 00350000
*/*                                                                  */ 00351000
*/* **************************************************************** */ 00352000
*  /* ? IRACTLEP EPN(WM3) */                                    02S0063 00353000
*  DCL IRARMWM3 ENTRY INT;                                      02S0063 00354000
*  GEN CODE DEFS(IRARMWM3) NOEXIT SEQFLOW;                      02S0064 00355000
*                                  /*                                   00356000
         ENTRY IRARMWM3                                                 00357000
IRARMWM3 DS    0H                                                       00358000
         STM   @00,@14,128+000(@13)    SAVE INVOKING RTNE REGS          00359000
         LA    @12,IRARMWM3-@PSTART    DISPLACEMENT TO MODULE BASE      00360000
         LCR   @12,@12                 NEGATIVE FOR SUBTRACT            00361000
         ALR   @12,@15                 SETUP MODULE ADDRESSABILITY      00362000
*IF OUCBGOO = '0'B & OUCBGOI = '0'B & /* USER NOT TRANSITIONING      */ 00363000
*   OUCBGOB = '0'B & OUCBINV = '0'B & /* USER IS QUEUED OK           */ 00364000
*   OUCBNSW = '0'B &             /* USER IS SWAPPABLE                */ 00365000
*   OUCBPVL = '0'B THEN          /* USER IS NOT PRIVILEDGED          */ 00366000
         TM    OUCBGOO(OUCBPTR),B'11100000'                     02S0065 00367000
         BNZ   @RF00065                                         02S0065 00368000
         TM    OUCBINV(OUCBPTR),B'10010100'                     02S0065 00369000
         BNZ   @RF00065                                         02S0065 00370000
* DO ;                                                          02S0066 00371000
* IF OUCBTMW ^= ZERO THEN        /* TRANSACTION INTERVAL EXISTS      */ 00372000
         L     @09,OUCBTMW(,OUCBPTR)                            02S0067 00373000
         LTR   @09,@09                                          02S0067 00374000
         BZ    @RF00067                                         02S0067 00375000
*   DO ;                                                        02S0068 00376000
*   IF OUCBOUT = '0'B THEN       /* USER RECIEVING SERVICE           */ 00377000
         TM    OUCBOUT(OUCBPTR),B'00000100'                     02S0069 00378000
         BNZ   @RF00069                                         02S0069 00379000
*       /* ? IRACTLCL EPN(WM1) */                               02S0070 00380000
*       CALL RMSBWM1 -> IRARMRTN ;              /* INVOKE WM1 SUBRTN */ 00381000
         L     @15,RMSBWM1(,RMCTPTR)                            02S0070 00382000
         BALR  @14,@15                                          02S0070 00383000
*   CALL IRARMWM5 ;              /* VERIFY CURRENT PERF GROUP PERIOD */ 00384000
@RF00069 LA    @15,IRARMWM5                                     02S0071 00385000
         BALR  @14,@15                                          02S0071 00386000
*   CALL IRARMWM7 ;              /* OBTAIN USER RECOMMENDATION VALUE */ 00387000
         BAL   @14,IRARMWM7                                     02S0072 00388000
*   END ;                                                       02S0073 00389000
* END ;                                                         02S0074 00390000
@RF00067 DS    0H                                               02S0075 00391000
*  /* ? IRACTLEP ENN(WM3) */                                    02S0075 00392000
*  GEN CODE EXIT NOSEQFLOW;                                     02S0075 00393000
@RF00065 DS    0H                                               02S0075 00394000
*                                  /*                                   00395000
         LM    @00,@14,128+000(@13)    RELOAD INVOKING RTNE REGS        00396000
         BR    RTNREG                  RETURN TO INVOKER                00397000
*                                                               01S0076 00398000
*/* USER NORMALIZED LEVEL CALCULATION SUBROUTINE                     */ 00399000
*/* **************************************************************** */ 00400000
*/*                                                                  */ 00401000
*/*    ROUTINE NAME - IRARMWM4                                       */ 00402000
*/*                                                                  */ 00403000
*/*    DESCRIPTIVE NAME - WORKLOAD MANAGER NORMALIZED LEVEL          */ 00404000
*/*                       CALCULATOR SUBROUTINE                      */ 00405000
*/*                                                                  */ 00406000
*/*    FUNCTION - THE IRARMWM4 ROUTINE ACCEPTS A SERVICE RATE        */ 00407000
*/*          AND A PERFORMANCE OBJECTIVE, AND CALCULATES THE         */ 00408000
*/*          CORRESPONDING NORMALIZED WORKLOAD LEVEL.                */ 00409000
*/*                                                                  */ 00410000
*/*    CALLED BY - IRARMWM7 - USER WORKLOAD EVALUATION SBRTINE       */ 00411000
*/*                IRARMHIT - USER READY SYSEVENT SWAP-IN RTNE       */ 00412000
*/*                IRARMWAR - WORKLOAD ACTIVITY REPORT ROUTINE       */ 00413000
*/*                IRARMWMO - WORKLOAD MANAGER TRANS STOP ROUTINE    */ 00414000
*/*                                                                  */ 00415000
*/*    INPUT - REG 0 CONTAINS THE SERVICE RATE FOR WHICH THE         */ 00416000
*/*            EQUIVALENT WORKLOAD IS TO BE CALCULATED.              */ 00417000
*/*          - REG 1 CONTAINS THE ADDRESS OF THE PERFORMANCE         */ 00418000
*/*            OBJECTIVE TO BE USED TO TRANSFORM THE SERVICE         */ 00419000
*/*            RATE INTO THE WORKLOAD LEVEL.                         */ 00420000
*/*          - REG 4 CONTAINS THE ADDRESS OF THE OUCB FOR THE        */ 00421000
*/*            USER WHOSE WORKLOAD IS BEING EVALUATED.               */ 00422000
*/*          - REG 14 CONTAINS THE RETURN ADDRESS.                   */ 00423000
*/*                                                                  */ 00424000
*/*    OUTPT - REG 0 CONTAINS THE WORKLOAD LEVEL CALCULATED          */ 00425000
*/*            FOR THE GIVEN SERVICE RATE.  A HEXADECIMAL            */ 00426000
*/*            POINT IS ASSUMED TWO HEX PLACES TO THE LEFT           */ 00427000
*/*            OF THE REG 0 BINARY OUTPUT VALUE.  TO OBTAIN          */ 00428000
*/*            THE EXTERNALLY SPECIFIED WORKLOAD LEVEL, THE          */ 00429000
*/*            VALUE IN REG 0 SHOULD BE MULTIPLIED BY THE            */ 00430000
*/*            CONTENTS OF -WMSTWLLO-.                               */ 00431000
*/*          - REG 1 CONTAINS THE PERFORMANCE OBJECTIVE POINT        */ 00432000
*/*            DESCRIPTION USED TO CALCULATE THE WRKLD LEVEL.        */ 00433000
*/*            IF -WPOSSRV- AT THIS POINT IS NOT NEGATIVE, AND       */ 00434000
*/*            IF -WPOPSRV- MINUS -WPOSSRV- IS MORE THAN 0, THEN     */ 00435000
*/*            THE CALCULATED WORKLOAD LEVEL IS UNIQUE TO THE        */ 00436000
*/*            SERVICE RATE SPECIFIED.  OTHERWISE, THE SERVICE       */ 00437000
*/*            RATE FALLS ON A 'PLATEAU', ON WHICH MULTIPLE          */ 00438000
*/*            WORKLOAD LEVELS HAVE BEEN SPEC'D FOR THIS RATE.       */ 00439000
*/*                                                                  */ 00440000
*/*    EXIT  - BRANCH ON REGISTER 14.                                */ 00441000
*/*          - THERE IS NO ERROR EXIT OR INDICATION.                 */ 00442000
*/*                                                                  */ 00443000
*/* **************************************************************** */ 00444000
*  /* ? IRACTLEP EPN(WM4)SAVE(2,14) */                          02S0076 00445000
*  DCL IRARMWM4 ENTRY INT;                                      02S0076 00446000
*  GEN CODE REFS(LCCACPUS,PSALCCAV,WSACOPTM)                    02S0077 00447000
*        DEFS(IRARMWM4) NOEXIT SEQFLOW;                         02S0077 00448000
*                                  /*                                   00449000
         ENTRY IRARMWM4                                                 00450000
IRARMWM4 DS    0H                                                       00451000
         L     @15,PSALCCAV            LCCA ADDRESS                     00452000
         L     @15,LCCACPUS-LCCA(,@15) CPU SAVE AREA VECTOR TABLE       00453000
         L     @15,WSACOPTM-WSAC(,@15) SRM SAVE AREA START ADDRESS      00454000
         STM   @02,@14,128+008(@15)    SAVE INVOKING RTNE REGS          00455000
         LR    @13,@15                 ROUTINE SAVE AREA ADDRESS        00456000
         BALR  @15,0                   SETUP ENTRY ADDRESSABILITY       00457000
         LA    @12,*-@PSTART           DISPLACEMENT TO MODULE BASE      00458000
         LCR   @12,@12                 NEGATIVE FOR SUBTRACT            00459000
         ALR   @12,@15                 SETUP MODULE ADDRESSABILITY      00460000
*    RFY (ASCBPTR,OUXBPTR,WPGDPTR,STPR,PMRE,PMRO,SVRE,SVRO) UNRSTD;     00461000
*    R0 = R0 & HWORDMSK;            /* ASSURE SERVICE RATE BOUNDED   */ 00462000
         N     R0,HWORDMSK                                      02S0079 00463000
*    /* THE FOLLOWING CODE SERIALLY SCANS THE PERFORMANCE OBJECTIVE  */ 00464000
*    /* DESCRIPTION UNTIL IT LOCATES A POINT HAVING A SMALLER SERVIC */ 00465000
*    /* RATE THAN THE INPUT.  TO INSURE THAT THIS SEARCH WILL ALWAYS */ 00466000
*    /* BE SUCCESSFUL, EACH OBJECTIVE IS TERMINATED BY A DUMMY POINT */ 00467000
*    /* CONTAINING A NEGATIVE SERVICE RATE.                          */ 00468000
*    DO WHILE (R0 < WPOSSRV | R0 = WPOXSRV);        /*       @Z30WIWP*/ 00469000
         B     @DE00080                                         02S0080 00470000
@DL00080 DS    0H                                               02S0081 00471000
*    WPODPTR = WPODPTR + LENGTH(WPOS); /* STEP TO NEXT WPOD ENTRY    */ 00472000
         AL    WPODPTR,@CF00036                                 02S0081 00473000
*    END;                                                       02S0082 00474000
@DE00080 LH    @05,WPOSSRV(,WPODPTR)                            02S0082 00475000
         CR    R0,@05                                           02S0082 00476000
         BL    @DL00080                                         02S0082 00477000
         CH    R0,WPOXSRV(,WPODPTR)                             02S0082 00478000
         BE    @DL00080                                         02S0082 00479000
*    WKRE = (WPOPSRV - WPOSSRV);    /* SRV RATE CHNG FRM PREV POINT  */ 00480000
         LH    WKRE,WPOPSRV(,WPODPTR)                           02S0083 00481000
         SLR   WKRE,@05                                         02S0083 00482000
*    IF R0 > ZERO & WKRE > ZERO THEN /* WKLD LVL NUMB UNIQUE @Z30WIWP*/ 00483000
         SLR   @09,@09                                          02S0084 00484000
         CR    R0,@09                                           02S0084 00485000
         BNH   @RF00084                                         02S0084 00486000
         CLR   WKRE,@09                                         02S0084 00487000
         BNH   @RF00084                                         02S0084 00488000
*      /* CALC NORMALIZED LEVEL CORRESPONDING TO SERVICE OBTAINED    */ 00489000
*      DO;                                                      02S0085 00490000
*      WKRO = WPOSWKL - WPOPWKL;    /* WORKLOAD CHANG FM PREV POINT  */ 00491000
         LH    @09,WPOSWKL(,WPODPTR)                            02S0086 00492000
         N     @09,@CF02217                                     02S0086 00493000
         LR    WKRO,@09                                         02S0086 00494000
         LH    @08,WPOPWKL(,WPODPTR)                            02S0086 00495000
         N     @08,@CF02217                                     02S0086 00496000
         SLR   WKRO,@08                                         02S0086 00497000
*      WKRO = WKRO * (R0 - WPOSSRV) / WKRE; /* SRV CHANG FROM POINT  */ 00498000
         LR    @07,@05                                          02S0087 00499000
         LCR   @07,@07                                          02S0087 00500000
         ALR   @07,R0                                           02S0087 00501000
         MR    @06,WKRO                                         02S0087 00502000
         DR    @06,WKRE                                         02S0087 00503000
         LR    WKRO,@07                                         02S0087 00504000
*      R0 = WPOSWKL - WKRO;         /* WORKLOAD LEVEL AT CALC POINT  */ 00505000
         SLR   @09,WKRO                                         02S0088 00506000
         LR    R0,@09                                           02S0088 00507000
*      END;                                                     02S0089 00508000
*    ELSE                           /* MULTIPLE LEVELS AT THIS SRVC  */ 00509000
*      /* PICK LO LEVEL FOR SWAPIN,HIGH FOR SWAPOUT          @Z30WIWP*/ 00510000
*      DO;                                                 /*@Z30WIWP*/ 00511000
         B     @RC00084                                         02S0090 00512000
@RF00084 DS    0H                                               02S0091 00513000
*      IF R0 = ZERO THEN            /* ZERO RATE SPECIFIED   @Z30WIWP*/ 00514000
         LTR   R0,R0                                            02S0091 00515000
         BNZ   @RF00091                                         02S0091 00516000
*       R0 = WPOSWKL ; /* GIVE WLL LEVEL WHERE OBJ = 0 */       02S0092 00517000
         LH    R0,WPOSWKL(,WPODPTR)                             02S0092 00518000
         N     R0,@CF02217                                      02S0092 00519000
*     ELSE                                                      02S0093 00520000
*      IF RRPAWAR = '1'B |          /* EVALUATE WORKLOAD ACTIVITY    */ 00521000
*            OUCBGOO = '1'B |       /* EVALUATE USR BEING QUIESCD    */ 00522000
*            OUCBOUT = '1'B THEN    /* EVALUATE USER FOR SWAP-IN     */ 00523000
         B     @RC00091                                         02S0093 00524000
@RF00091 TM    RRPAWAR(RRPAPTR),B'01000000'                     02S0093 00525000
         BO    @RT00093                                         02S0093 00526000
         TM    OUCBGOO(OUCBPTR),B'10000100'                     02S0093 00527000
         BZ    @RF00093                                         02S0093 00528000
@RT00093 DS    0H                                               02S0094 00529000
*        R0 = WPOPWKL;              /* WKLD FROM AHEAD POINT @Z30WIWP*/ 00530000
         LH    R0,WPOPWKL(,WPODPTR)                             02S0094 00531000
         N     R0,@CF02217                                      02S0094 00532000
*      ELSE                         /* EVALUATE USER FOR SWAP-OUT    */ 00533000
*        R0 = WPOSWKL;              /* WKLD FROM BEHIND PT   @Z30WIWP*/ 00534000
         B     @RC00093                                         02S0095 00535000
@RF00093 LH    R0,WPOSWKL(,WPODPTR)                             02S0095 00536000
         N     R0,@CF02217                                      02S0095 00537000
*      END;                                                     02S0096 00538000
@RC00093 DS    0H                                               02S0096 00539000
@RC00091 DS    0H                                               02S0097 00540000
*    RFY (ASCBPTR,OUXBPTR,WPGDPTR,STPR,PMRE,PMRO,SVRE,SVRO) RSTD;       00541000
@RC00084 DS    0H                                               02S0098 00542000
*  /* ? IRACTLEP ENN(WM4) */                                    02S0098 00543000
*  GEN CODE EXIT NOSEQFLOW;                                     02S0098 00544000
*                                  /*                                   00545000
         LM    @02,@14,128+008(@13)    RELOAD INVOKING RTNE REGS        00546000
         BR    RTNREG                  RETURN TO INVOKER                00547000
*                                                               01S0099 00548000
*/* PERFORMANCE GROUP PERIOD CHANGE SUBROUTINE                       */ 00549000
*/* **************************************************************** */ 00550000
*/*                                                                  */ 00551000
*/*    ROUTINE NAME - IRARMWM5                                       */ 00552000
*/*                                                                  */ 00553000
*/*    DESCRIPTIVE NAME - WORKLOAD MANAGER UPDATE PERFORMANCE        */ 00554000
*/*                       GROUP PERIOD SUBROUTINE                    */ 00555000
*/*                                                                  */ 00556000
*/*    FUNCTION - THE IRARMWM5 SUBROUTINE TESTS WHETHER AN USER      */ 00557000
*/*          HAS ACCUMULATED ENOUGH SERVICE/TIME TO BE ASSIGNED      */ 00558000
*/*          TO A NEW PERFORMANCE GROUP PERIOD.  IF SO, IRARMWM5     */ 00559000
*/*          ADJUSTS THE POINTERS WHICH INDICATE THE PERFORMANCE     */ 00560000
*/*          GROUP PERIOD , PERF OBJECTIVE AND DOMAIN APPLICABLE TO  */ 00561000
*/*          THE TRANSACTION CURRENT FOR THE USER.  NOTE THAT THE    */ 00562000
*/*          FREQUENCY (RESOLUTION) AT WHICH THE TEST FOR PERIOD     */ 00563000
*/*          END IS MADE DEPENDS ON HOW OFTEN IRARMWM5 IS CALLED     */ 00564000
*/*          FOR ANY GIVEN USER.                                     */ 00565000
*/*                                                                  */ 00566000
*/*    CALLED BY - IRARMWMO - USER TRANSACTION SUSPEND ROUTINE       */ 00567000
*/*                IRARMWMQ - USER TRANSACTION QUIESCE ROUTINE       */ 00568000
*/*                IRARMWMR - USER TRANSACTION RESUMPT ROUTINE       */ 00569000
*/*                IRARMWMK - USER APPLICABL ALGORITHM SBRTINE       */ 00570000
*/*                IRARMWM2 - ANALYSIS USER REORDERING ROUTINE       */ 00571000
*/*                IRARMCVL - SWAP ANALYSIS USER EVALUATION ROUTINE  */ 00572000
*/*                                                                  */ 00573000
*/*    INPUT - REG 4 CONTAINS THE ADDRESS OF THE OUCB FOR THE USER   */ 00574000
*/*            WHO IS TO BE TESTED FOR PERIOD END.                   */ 00575000
*/*          - REG 14 CONTAINS THE RETURN ADDRESS.                   */ 00576000
*/*          - OUCBWMG CONTAINS THE OFFSET TO THE CURRENT            */ 00577000
*/*            PERFORMANCE GROUP DESCRIPTOR FOR THE USER.            */ 00578000
*/*                                                                  */ 00579000
*/*    OUTPT - OUCBPGP CONTAINS THE OFFSET TO THE CURRENT PERIOD     */ 00580000
*/*            WITHIN THE PERFORMANCE GROUP DESCRIPTION.             */ 00581000
*/*          - OUCBDMN CONTAINS THE DOMAIN NUMBER FOR THE USER       */ 00582000
*/*          - OUCBDMO CONTAINS THE OFFSET INTO THE DOMAIN TABLE     */ 00583000
*/*            BASED ON THE USERS DOMAIN SPECIFICATION               */ 00584000
*/*                                                                  */ 00585000
*/*    EXIT  - BRANCH ON REGISTER 14.                                */ 00586000
*/*          - THERE IS NO ERROR EXIT OR INDICATION.                 */ 00587000
*/*                                                                  */ 00588000
*/* **************************************************************** */ 00589000
*  /* ? IRACTLEP EPN(WM5) */                                    02S0099 00590000
*  DCL IRARMWM5 ENTRY INT;                                      02S0099 00591000
*  GEN CODE REFS(LCCACPUS,PSALCCAV,WSACOPTM)                    02S0100 00592000
*        DEFS(IRARMWM5) NOEXIT SEQFLOW;                         02S0100 00593000
*                                  /*                                   00594000
         ENTRY IRARMWM5                                                 00595000
IRARMWM5 DS    0H                                                       00596000
         L     @15,PSALCCAV            LCCA ADDRESS                     00597000
         L     @15,LCCACPUS-LCCA(,@15) CPU SAVE AREA VECTOR TABLE       00598000
         L     @15,WSACOPTM-WSAC(,@15) SRM SAVE AREA START ADDRESS      00599000
         STM   @00,@14,128+000(@15)    SAVE INVOKING RTNE REGS          00600000
         LR    @13,@15                 ROUTINE SAVE AREA ADDRESS        00601000
         BALR  @15,0                   SETUP ENTRY ADDRESSABILITY       00602000
         LA    @12,*-@PSTART           DISPLACEMENT TO MODULE BASE      00603000
         LCR   @12,@12                 NEGATIVE FOR SUBTRACT            00604000
         ALR   @12,@15                 SETUP MODULE ADDRESSABILITY      00605000
*  /* DETERMINE IF PERFORMANCE GROUP PERIOD DURATION AVAILABLE       */ 00606000
*  NTRREG = WM5RTRN;                /* RETURN TO REQUESTOR OF WM5    */ 00607000
         L     NTRREG,WM5RTRN(,SVEREG)                          02S0101 00608000
*  IF OUCBTMW ^= ZERO THEN          /* HAVE CURRENT WLM INTERVAL     */ 00609000
         L     @09,OUCBTMW(,OUCBPTR)                            02S0102 00610000
         LTR   @09,@09                                          02S0102 00611000
         BZ    @RF00102                                         02S0102 00612000
*    /* DETERMINE IF ANOTHER PERFORMANCE GROUP PERIOD FOLLOWS        */ 00613000
*    DO;                                                        02S0103 00614000
*    WMSTPTR = RMCTWMST;            /* PICK WLM SPECIFICATION TABLE  */ 00615000
         L     WMSTPTR,RMCTWMST(,RMCTPTR)                       02S0104 00616000
*    ASCBPTR = OUCBASCB;            /* PICK ADDRS SPAC CONTROL BLOCK */ 00617000
         L     ASCBPTR,OUCBASCB(,OUCBPTR)                       02S0105 00618000
*    OUXBPTR = ASCBOUXB;            /* PICK USER CTRL BLCK EXTENSION */ 00619000
         L     OUXBPTR,ASCBOUXB(,ASCBPTR)                       02S0106 00620000
*    WPGDPTR = WMSTPGDT + OUCBWMG;  /* PICK CURR PERF GRP DESCRIPTOR */ 00621000
         LH    WPGDPTR,OUCBWMG(,OUCBPTR)                        02S0107 00622000
         AL    WPGDPTR,WMSTPGDT(,WMSTPTR)                       02S0107 00623000
*    WKRE = OUXBTRS;                /* CURRENT TRANSACTION SERVICE   */ 00624000
         L     WKRE,OUXBTRS(,OUXBPTR)                           02S0108 00625000
*    IF OUCBRTR ^= '1'B &           /* TRANSACTION NOT SUSPENDED     */ 00626000
*          OUCBTMS ^= RRPATOD THEN  /* TRANSACTION NOT JUST UPDATED  */ 00627000
         TM    OUCBRTR(OUCBPTR),B'00010000'                     02S0109 00628000
         BO    @RF00109                                         02S0109 00629000
         CLC   OUCBTMS(4,OUCBPTR),RRPATOD(RRPAPTR)              02S0109 00630000
         BE    @RF00109                                         02S0109 00631000
*      WKRE = WKRE + OUCBWMS;       /* ADD CURRENT INTERVL SERVICE   */ 00632000
         AL    WKRE,OUCBWMS(,OUCBPTR)                           02S0110 00633000
*    WPGPPTR = WPGDPTR + OUCBPGP;   /* PICK CURR PERF GROUP PERIOD   */ 00634000
@RF00109 LR    WPGPPTR,WPGDPTR                                  02S0111 00635000
         SLR   @09,@09                                          02S0111 00636000
         IC    @09,OUCBPGP(,OUCBPTR)                            02S0111 00637000
         ALR   WPGPPTR,@09                                      02S0111 00638000
*    IF WPGPFIN ^= '1'B & OUCBNSW = '0'B & /* CAN GO TO NEXT PERIOD  */ 00639000
*          OUCBINC = '1'B &         /* SESSION NOT BETWEEN STEPS     */ 00640000
*          (OUCBOUT = '0'B |        /* ALWAYS CHCK PERIOD IF INCORE  */ 00641000
*          WPGPUNT = '1'B) THEN     /* CHK ONLY REAL TME OUT PERIOD  */ 00642000
         TM    WPGPFIN(WPGPPTR),B'10000000'                     02S0112 00643000
         BO    @RF00112                                         02S0112 00644000
         TM    OUCBNSW(OUCBPTR),B'10000000'                     02S0112 00645000
         BNZ   @RF00112                                         02S0112 00646000
         TM    OUCBINC(OUCBPTR),B'00000001'                     02S0112 00647000
         BNO   @RF00112                                         02S0112 00648000
         TM    OUCBOUT(OUCBPTR),B'00000100'                     02S0112 00649000
         BZ    @RT00112                                         02S0112 00650000
         TM    WPGPUNT(WPGPPTR),B'01000000'                     02S0112 00651000
         BNO   @RF00112                                         02S0112 00652000
@RT00112 DS    0H                                               02S0113 00653000
*      /* CALCULATE HOW MUCH OF CURRENT PERIOD HAS BEEN USED UP      */ 00654000
*      DO;                                                      02S0113 00655000
*      WPGLPTR = WPGDPTR + WPGPDURP; /* ADDR PERF GRP PERIOD DURATN  */ 00656000
         LR    WPGLPTR,WPGDPTR                                  02S0114 00657000
         SLR   @09,@09                                          02S0114 00658000
         IC    @09,WPGPDURP(,WPGPPTR)                           02S0114 00659000
         ALR   WPGLPTR,@09                                      02S0114 00660000
*      IF WPGPUNT = '1'B THEN       /* PERIOD DURATION IN REAL TIME  */ 00661000
         TM    WPGPUNT(WPGPPTR),B'01000000'                     02S0115 00662000
         BNO   @RF00115                                         02S0115 00663000
*        /* WILL COMPARE CURR TIME TO PERIOD START PLUS DURATION     */ 00664000
*        DO;                                                    02S0116 00665000
*        WKRE = RRPATOD;            /* CURRENT TIME OF DAY           */ 00666000
         L     WKRE,RRPATOD(,RRPAPTR)                           02S0117 00667000
*        RTNREG = OUCBTMP + WPGLDUR; /* PERIOD ENDING TIME           */ 00668000
         L     RTNREG,OUCBTMP(,OUCBPTR)                         02S0118 00669000
         AL    RTNREG,WPGLDUR(,WPGLPTR)                         02S0118 00670000
*        END;                                                   02S0119 00671000
*      ELSE                         /* PERIOD DUR IN SERVICE UNITS   */ 00672000
*        /* WILL COMPARE CURR SERVICE TO PERIOD START PLUS DURATION  */ 00673000
*        DO;                                                    02S0120 00674000
         B     @RC00115                                         02S0120 00675000
@RF00115 DS    0H                                               02S0121 00676000
*                                   /* CURRENT SERVICE CALC ABOVE    */ 00677000
*        RTNREG = OUXBPRS + WPGLDUR; /* PERIOD ENDING SERVICE        */ 00678000
         L     RTNREG,OUXBPRS(,OUXBPTR)                         02S0121 00679000
         AL    RTNREG,WPGLDUR(,WPGLPTR)                         02S0121 00680000
*        END;                                                   02S0122 00681000
*      NTRREG = WM5RTRN;            /* RETURN TO REQUESTOR OF WM5    */ 00682000
@RC00115 L     NTRREG,WM5RTRN(,SVEREG)                          02S0123 00683000
*      /* DETERMINE IF CURRENT PERIOD DURATION HAS BEEN EXCEEDED     */ 00684000
*      IF WKRE ^< RTNREG THEN       /* PERIOD END HAS BEEN REACHED   */ 00685000
         CLR   WKRE,RTNREG                                      02S0124 00686000
         BL    @RF00124                                         02S0124 00687000
*        DO;                                                    02S0125 00688000
*          IF WPGPUNT = '1'B THEN   /* PERIOD DURATION IN REAL TIME  */ 00689000
         TM    WPGPUNT(WPGPPTR),B'01000000'                     02S0126 00690000
         BNO   @RF00126                                         02S0126 00691000
*            OUCBTMP = RTNREG;      /* STEP NXT PERIOD STARTING TIME */ 00692000
         ST    RTNREG,OUCBTMP(,OUCBPTR)                         02S0127 00693000
*          ELSE                     /* PERIOD DURATN IN SERVIC UNITS */ 00694000
*            OUCBTMP = RRPATOD;     /* SAVE NEW PERIOD STARTING TIME */ 00695000
         B     @RC00126                                         02S0128 00696000
@RF00126 L     @09,RRPATOD(,RRPAPTR)                            02S0128 00697000
         ST    @09,OUCBTMP(,OUCBPTR)                            02S0128 00698000
*          IF OUCBOUT = '0'B THEN   /* USER FIELDS ARE AVAILABLE NOW */ 00699000
@RC00126 TM    OUCBOUT(OUCBPTR),B'00000100'                     02S0129 00700000
         BNZ   @RF00129                                         02S0129 00701000
*            /* UPDATE BEGINNING SERVICE VALUE FOR NEW PERIOD        */ 00702000
*            DO;                                                02S0130 00703000
*            OUCBPCH = '0'B;        /* RESET PERIOD CHNG OUTSTND FLG */ 00704000
         NI    OUCBPCH(OUCBPTR),B'11110111'                     02S0131 00705000
*            OUXBPRS = OUXBTRS;     /* SAVE NEW PERIOD START SERVICE */ 00706000
         L     @09,OUXBTRS(,OUXBPTR)                            02S0132 00707000
         ST    @09,OUXBPRS(,OUXBPTR)                            02S0132 00708000
*            IF OUCBRTR ^= '1'B &   /* TRANSACT NOT IN SUSPEND STATE */ 00709000
*                  OUCBTMS ^= RRPATOD THEN /* XACTION NOT YET UPDATD */ 00710000
         TM    OUCBRTR(OUCBPTR),B'00010000'                     02S0133 00711000
         BO    @RF00133                                         02S0133 00712000
         CLC   OUCBTMS(4,OUCBPTR),RRPATOD(RRPAPTR)              02S0133 00713000
         BE    @RF00133                                         02S0133 00714000
*              OUXBPRS = OUXBPRS + OUCBWMS; /* ADD CURR NTRVL SERVIC */ 00715000
         AL    @09,OUCBWMS(,OUCBPTR)                            02S0134 00716000
         ST    @09,OUXBPRS(,OUXBPTR)                            02S0134 00717000
*            END;                                               02S0135 00718000
*          ELSE                     /* UPDATE WHEN USER SWAPPED IN   */ 00719000
*            OUCBPCH = '1'B;        /* INDICAT PERIOD CHNG INCOMPLET */ 00720000
         B     @RC00129                                         02S0136 00721000
@RF00129 OI    OUCBPCH(OUCBPTR),B'00001000'                     02S0136 00722000
*          IF RMCTMFA = '1'B &      /* WRKLD ACTIVITY BEING MEASURED */ 00723000
*                OUCBATR = '1'B &   /* HAVE TRANSACTION FOR THIS USR */ 00724000
*                (OUCBRDY = '1'B | OUCBOUT = '0'B) & /* XACTN ACTIVE */ 00725000
*                OUCBTMS ^= RRPATOD THEN /* SERVICE ALREADY RECORDED */ 00726000
@RC00129 TM    RMCTMFA(RMCTPTR),B'10000000'                     02S0137 00727000
         BNO   @RF00137                                         02S0137 00728000
         TM    OUCBATR(OUCBPTR),B'10000000'                     02S0137 00729000
         BNO   @RF00137                                         02S0137 00730000
         TM    OUCBRDY(OUCBPTR),B'10000000'                     02S0137 00731000
         BO    @GL00014                                         02S0137 00732000
         TM    OUCBOUT(OUCBPTR),B'00000100'                     02S0137 00733000
         BNZ   @RF00137                                         02S0137 00734000
@GL00014 CLC   OUCBTMS(4,OUCBPTR),RRPATOD(RRPAPTR)              02S0137 00735000
         BE    @RF00137                                         02S0137 00736000
*            /* INVOKE MEASUREMENT ROUTINE TO COLLECT PERIOD SERVICE */ 00737000
*            DO;                                                02S0138 00738000
*            RRPAWAR = '1'B;        /* INSERT WKLD ACTIVTY RTNE FLAG */ 00739000
         OI    RRPAWAR(RRPAPTR),B'01000000'                     02S0139 00740000
*            /* ? IRACTLCL EPN(WR4) */                          02S0140 00741000
*            CALL RMSBWR4 -> IRARMRTN ;         /* INVOKE WR4 SUBRTN */ 00742000
         L     @15,RMSBWR4(,RMCTPTR)                            02S0140 00743000
         BALR  @14,@15                                          02S0140 00744000
*            OUCBPGP = OUCBPGP + LENGTH(WPGP); /* STEPP PERFM PERIOD */ 00745000
         LA    @09,8                                            02S0141 00746000
         SLR   @08,@08                                          02S0141 00747000
         IC    @08,OUCBPGP(,OUCBPTR)                            02S0141 00748000
         ALR   @09,@08                                          02S0141 00749000
         STC   @09,OUCBPGP(,OUCBPTR)                            02S0141 00750000
*            OUCBMAR = '1'B;        /* SPECFY NEGATIV PERIOD ACCUMUL */ 00751000
         OI    OUCBMAR(OUCBPTR),B'00000100'                     02S0142 00752000
*            /* ? IRACTLCL EPN(WR4) */                          02S0143 00753000
*            CALL RMSBWR4 -> IRARMRTN ;         /* INVOKE WR4 SUBRTN */ 00754000
         L     @15,RMSBWR4(,RMCTPTR)                            02S0143 00755000
         BALR  @14,@15                                          02S0143 00756000
*            OUCBMAR = '0'B;        /* RESET NEGATIVE PERIOD ACCUMUL */ 00757000
         NI    OUCBMAR(OUCBPTR),B'11111011'                     02S0144 00758000
*            RRPAWAR = '0'B;        /* DELETE WKLD ACTIVTY RTNE FLAG */ 00759000
         NI    RRPAWAR(RRPAPTR),B'10111111'                     02S0145 00760000
*            END;                                               02S0146 00761000
*          ELSE                     /* NO NEED TO REPORT PERIOD CHNG */ 00762000
*            OUCBPGP = OUCBPGP + LENGTH(WPGP); /* STEPP PERFM PERIOD */ 00763000
         B     @RC00137                                         02S0147 00764000
@RF00137 LA    @09,8                                            02S0147 00765000
         SLR   @08,@08                                          02S0147 00766000
         IC    @08,OUCBPGP(,OUCBPTR)                            02S0147 00767000
         ALR   @09,@08                                          02S0147 00768000
         STC   @09,OUCBPGP(,OUCBPTR)                            02S0147 00769000
*          WPGPPTR = WPGDPTR + OUCBPGP; /* PICK CURR PERF GRP PERIOD */ 00770000
@RC00137 LR    WPGPPTR,WPGDPTR                                  02S0148 00771000
         SLR   @09,@09                                          02S0148 00772000
         IC    @09,OUCBPGP(,OUCBPTR)                            02S0148 00773000
         ALR   WPGPPTR,@09                                      02S0148 00774000
*          IF OUCBDMN ^= WPGPDMN THEN   /* SWITCHING DOMAINS ??      */ 00775000
         CLC   OUCBDMN(1,OUCBPTR),WPGPDMN(WPGPPTR)              02S0149 00776000
         BE    @RF00149                                         02S0149 00777000
*            DO;                        /* YES                       */ 00778000
*            OUCBDMN = WPGPDMN ;    /* SAVE THE NEW DOMAIN NUMBER    */ 00779000
         SLR   @09,@09                                          02S0151 00780000
         IC    @09,WPGPDMN(,WPGPPTR)                            02S0151 00781000
         STC   @09,OUCBDMN(,OUCBPTR)                            02S0151 00782000
*            OUCBDMO = WDMVTENT;    /* OFFSET INTO THE DOMAIN TABLE  */ 00783000
         ALR   @09,@09                                          02S0152 00784000
         AL    @09,WMSTDMVT(,WMSTPTR)                           02S0152 00785000
         LH    @09,WDMVTENT(,@09)                               02S0152 00786000
         STH   @09,OUCBDMO(,OUCBPTR)                            02S0152 00787000
*            /* RE-POSITION USER AT END OF QUEUE                     */ 00788000
*            OUCBGOB = '1'B;        /* QUEUE POSITION BEING CHANGED  */ 00789000
         OI    OUCBGOB(OUCBPTR),B'00100000'                     02S0153 00790000
*              /* ? IRACTLCL EPN(RPS) */                        02S0154 00791000
*              DO;                                              02S0154 00792000
*              R1 = ADDR(RMEPBRPS);          /* RPS REQUEST IS PARAM */ 00793000
         LA    R1,RMEPBRPS(,RMCTPTR)                            02S0155 00794000
*              CALL RMSBCRN -> IRARMRTN ;       /* ACTION INVK FUNCT */ 00795000
         L     @15,RMSBCRN(,RMCTPTR)                            02S0156 00796000
         BALR  @14,@15                                          02S0156 00797000
*              END;                                             02S0157 00798000
*            END;                                               02S0158 00799000
*          RFY (NTRREG,WPGLPTR,R15) UNRSTD;   /*             @Z40BPEB*/ 00800000
@RF00149 DS    0H                                               02S0160 00801000
*          IF OUCBAPG='1'B          /* IF USER IN APG        @Z40BPEB*/ 00802000
*           THEN IF WPGPAPG = '1'B &   /* PERIOD APG         @Z40BPEB*/ 00803000
         TM    OUCBAPG(OUCBPTR),B'01000000'                     02S0160 00804000
         BNO   @RF00160                                         02S0160 00805000
*             (WPGPAPGV > CCCAPGDP-CCCAPMDP)  /*SPECIFIES DP @Z40BPEB*/ 00806000
*            THEN                  /* ABOVE MEAN TIME WAIT   @Z40BPEB*/ 00807000
         TM    WPGPAPG(WPGPPTR),B'00100000'                     02S0161 00808000
         BNO   @RF00161                                         02S0161 00809000
         SLR   @15,@15                                          02S0161 00810000
         IC    @15,WPGPAPGV(,WPGPPTR)                           02S0161 00811000
         LH    @09,CCCAPMDP(,RMCTPTR)                           02S0161 00812000
         LH    @08,CCCAPGDP(,RMCTPTR)                           02S0161 00813000
         SLR   @08,@09                                          02S0161 00814000
         CR    @15,@08                                          02S0161 00815000
         BNH   @RF00161                                         02S0161 00816000
*              OUCBNDP=CCCAPMDP+WPGPAPGV; /*REQUESTED DP     @Z40BPEB*/ 00817000
         ALR   @09,@15                                          02S0162 00818000
         STC   @09,OUCBNDP(,OUCBPTR)                            02S0162 00819000
*            ELSE                   /* IN MEAN TIME TO WAIT  @Z40BPEB*/ 00820000
*              IF OUCBNDP > CCCAPGDP  /* LAST PERIOD WAS     @Z40BPEB*/ 00821000
*                THEN                 /* ABOVE MTW           @Z40BPEB*/ 00822000
         B     @RC00161                                         02S0163 00823000
@RF00161 LH    @15,CCCAPGDP(,RMCTPTR)                           02S0163 00824000
         SLR   @09,@09                                          02S0163 00825000
         IC    @09,OUCBNDP(,OUCBPTR)                            02S0163 00826000
         CR    @15,@09                                          02S0163 00827000
         BNL   @RF00163                                         02S0163 00828000
*                  OUCBNDP=CCCAPGDP;  /*BEGIN MTW DP.        @Z40BPEB*/ 00829000
         STC   @15,OUCBNDP(,OUCBPTR)                            02S0164 00830000
*          RFY (NTRREG,WPGLPTR,R15) RSTD;     /*HOLD R15    @Z40BPEB*/  00831000
@RF00163 DS    0H                                               02S0165 00832000
@RC00161 DS    0H                                               02S0165 00833000
@RF00160 DS    0H                                               02S0166 00834000
*          IF WPGPUNT = '1'B &      /* PERIOD DURATION IN REAL TIME  */ 00835000
*                OUCBOFF = '1'B THEN /* MULTI-CHECK ONLY WAIT USERS  */ 00836000
         TM    WPGPUNT(WPGPPTR),B'01000000'                     02S0166 00837000
         BNO   @RF00166                                         02S0166 00838000
         TM    OUCBOFF(OUCBPTR),B'00001000'                     02S0166 00839000
         BNO   @RF00166                                         02S0166 00840000
*            SVRE = RMSBWM5;        /* WILL RECURSE THROUGH WM5 RTN  */ 00841000
         L     SVRE,RMSBWM5(,RMCTPTR)                           02S0167 00842000
*          ELSE                     /* PERIOD DURATN IN SERVC UNITS  */ 00843000
*            SVRE = WM5RTRN;        /* WILL RETURN TO REQSTR OF WM5  */ 00844000
         B     @RC00166                                         02S0168 00845000
@RF00166 L     SVRE,WM5RTRN(,SVEREG)                            02S0168 00846000
*          CALL IRARMWMJ;           /* SET APPLICABLE ALGORITHM INDS */ 00847000
@RC00166 BAL   @14,IRARMWMJ                                     02S0169 00848000
*          NTRREG = SVRE;           /* RESTORE WM5 EXIT REGISTER     */ 00849000
         LR    NTRREG,SVRE                                      02S0170 00850000
*          END;                                                 02S0171 00851000
*      END;                                                     02S0172 00852000
@RF00124 DS    0H                                               02S0173 00853000
*    END;                                                       02S0173 00854000
@RF00112 DS    0H                                               02S0174 00855000
*  /* ? IRACTLEP ENN(WM5) */                                    02S0174 00856000
*  GEN CODE EXIT NOSEQFLOW;                                     02S0174 00857000
@RF00102 DS    0H                                               02S0174 00858000
*                                  /*                                   00859000
         LM    @00,@14,128+000(@13)    RELOAD INVOKING RTNE REGS        00860000
         BR    NTRREG                  EXIT TO REQUESTOR/RECURSE        00861000
*                                                               01S0175 00862000
*/* USER RECOMMENDATION VALUE CALCULATION ROUTINE                    */ 00863000
*/* ******************************************************************/ 00864000
*/*                                                                  */ 00865000
*/*    ROUTINE NAME - IRARMWM7                                       */ 00866000
*/*                                                                  */ 00867000
*/*    DESCRIPTIVE NAME - WLM RECOMMENDATION CALCULATION ROUTINE     */ 00868000
*/*                                                                  */ 00869000
*/*    FUNCTION - THE IRARMWM7 ROUTINE CALCULATES A WORKLOAD         */ 00870000
*/*               MANAGER RECOMMENDATION VALUE FOR A USER BASED ON   */ 00871000
*/*               THE SERVICE WHICH WAS RECEIVED AND ON THE          */ 00872000
*/*               PERFORMANCE OBJECTIVE CURRENTLY ASSOCIATED WITH    */ 00873000
*/*               THE USER. USERS WHICH HAVE NOT YET RECEIVIED AN    */ 00874000
*/*               AMOUNT OF SERVICE EQUAL TO THEIR INTERVAL SERVICE  */ 00875000
*/*               VALUE (ISV) SPECIFICATION WHILE IN CORE ARE GIVEN  */ 00876000
*/*               A RECOMMENDATION VALUE BOOST. THE BOOST GIVES      */ 00877000
*/*               PREFERENTIAL TREATMENT TO USERS IN THEIR ISV AS    */ 00878000
*/*               COMPARED TO USERS NOT IN THEIR ISV AND USERS       */ 00879000
*/*               BETWEEN JOB STEPS.                                 */ 00880000
*/*                                                                  */ 00881000
*/*    CALLED BY - IRARMWM3 - INDIVIDUAL USER EVALUATION SUBROUTINE  */ 00882000
*/*              - IRARMWM2 - WLM SWAPPABLE USER EVALUATION ROUTINE  */ 00883000
*/*              - IRARMWMO - WLM TRANSACTION STOP ROUTINE           */ 00884000
*/*              - IRARMWMQ - WLM QUIESCE COMPLETE PROCESSING ROUTIN */ 00885000
*/*                                                                  */ 00886000
*/*    INPUT - REG 4 CONTAINS THE ADDRESS OF THE OUCB FOR THE USER   */ 00887000
*/*            WHOSE RECOMMENDATION VALUE IS TO BE DETERMINED.       */ 00888000
*/*          - REG 14 CONTAINS THE RETURN ADDRESS.                   */ 00889000
*/*          - REG 15 CONTAINS THE IRARMWM7 ROUTINE ADDRESS.         */ 00890000
*/*                                                                  */ 00891000
*/*    OUTPT - OUCBWMR CONTAINS THE USER RECOMMENDATION VALUE.       */ 00892000
*/*                                                                  */ 00893000
*/*    EXIT - BRANCH ON REGISTER 14.                                 */ 00894000
*/*         - THERE IS NO ERROR EXIT OR INDICATION.                  */ 00895000
*/*                                                                  */ 00896000
*/* ******************************************************************/ 00897000
*IRARMWM7: PROC OPTIONS(NOSAVE,NOSAVEAREA,NOENTREG,RETREG,NOPARMREG);   00898000
IRARMWM7 DS    0H                                               02S0176 00899000
*    IF OUCBNSW = '0'B &           /* USER IS SWAPPABLE     */  02S0176 00900000
*       OUCBGOO = '0'B & OUCBGOI = '0'B & /* NOT TRANSITIONING       */ 00901000
*       OUCBGOB = '0'B THEN                                     02S0176 00902000
         TM    OUCBNSW(OUCBPTR),B'10000000'                     02S0176 00903000
         BNZ   @RF00176                                         02S0176 00904000
         TM    OUCBGOO(OUCBPTR),B'11100000'                     02S0176 00905000
         BNZ   @RF00176                                         02S0176 00906000
*      DO;                                                      02S0177 00907000
*      /* PICK UP PERFORMANCE GROUP PERIOD                           */ 00908000
*      WMSTPTR = RMCTWMST ;         /* PICK WLM SPECIFICATION TABLE  */ 00909000
         L     WMSTPTR,RMCTWMST(,RMCTPTR)                       02S0178 00910000
*      WPGDPTR = WMSTPGDT + OUCBWMG ;  /* PICK PERF GROUP DESCRIPTOR */ 00911000
         LH    WPGDPTR,OUCBWMG(,OUCBPTR)                        02S0179 00912000
         AL    WPGDPTR,WMSTPGDT(,WMSTPTR)                       02S0179 00913000
*      WPGPPTR = WPGDPTR + OUCBPGP; /* PICK PERF GROUP PERIOD        */ 00914000
         LR    WPGPPTR,WPGDPTR                                  02S0180 00915000
         SLR   @09,@09                                          02S0180 00916000
         IC    @09,OUCBPGP(,OUCBPTR)                            02S0180 00917000
         ALR   WPGPPTR,@09                                      02S0180 00918000
*      /* SET PERFORMANCE OBJECTIVE APPLICABLE TO USER               */ 00919000
*      R1 = WMSTPODT + WPOVTENT;    /* PTR TO PERF PERIOD OBJECTIVE  */ 00920000
         SLR   @09,@09                                          02S0181 00921000
         IC    @09,WPGPOBJN(,WPGPPTR)                           02S0181 00922000
         ALR   @09,@09                                          02S0181 00923000
         AL    @09,WMSTPOVT(,WMSTPTR)                           02S0181 00924000
         LH    @09,WPOVTENT(,@09)                               02S0181 00925000
         AL    @09,WMSTPODT(,WMSTPTR)                           02S0181 00926000
         LR    R1,@09                                           02S0181 00927000
*      WPGLPTR = WPGDPTR + WPGPISVP; /* PTR TO ISV VALUE             */ 00928000
         LR    WPGLPTR,WPGDPTR                                  02S0182 00929000
         SLR   @09,@09                                          02S0182 00930000
         IC    @09,WPGPISVP(,WPGPPTR)                           02S0182 00931000
         ALR   WPGLPTR,@09                                      02S0182 00932000
*      SVRO = ZERO;                 /* INITIALIZE ISV BOOST          */ 00933000
         SLR   SVRO,SVRO                                        02S0183 00934000
*      /* TEST IF SERVICE RECIEVED LESS THAN ISV AMOUNT OR IF USER   */ 00935000
*      /* IS BETWEEN JOB STEPS. IF SO, ASSIGN RECOMMENDATION VALUE   */ 00936000
*      /* WHERE OBJECTIVE GOES TO ZERO POINT.                        */ 00937000
*      IF OUCBWMS < WPGLISV |       /* SERVICE LESS THAN ISV AMOUNT  */ 00938000
*        OUCBINC = '0'B THEN        /* OR JOB IS BETWEEN STEPS       */ 00939000
         L     @09,OUCBWMS(,OUCBPTR)                            02S0184 00940000
         C     @09,WPGLISV(,WPGLPTR)                            02S0184 00941000
         BL    @RT00184                                         02S0184 00942000
         TM    OUCBINC(OUCBPTR),B'00000001'                     02S0184 00943000
         BNZ   @RF00184                                         02S0184 00944000
@RT00184 DS    0H                                               02S0185 00945000
*        DO;                                                    02S0185 00946000
*        R0 = ZERO;                 /* PEG NORMLZ LEVEL AT ZERO RATE */ 00947000
         SLR   R0,R0                                            02S0186 00948000
*        IF OUCBPVL = '0'B &        /* USER NOT PRIVILEDGED          */ 00949000
*           OUCBOUT = '0'B &        /* AND IN CORE                   */ 00950000
*           OUCBTMW ^= ZERO THEN    /* AND HAS TRANSACTION INTERVAL  */ 00951000
         TM    OUCBPVL(OUCBPTR),B'00000100'                     02S0187 00952000
         BNZ   @RF00187                                         02S0187 00953000
         TM    OUCBOUT(OUCBPTR),B'00000100'                     02S0187 00954000
         BNZ   @RF00187                                         02S0187 00955000
         L     @09,OUCBTMW(,OUCBPTR)                            02S0187 00956000
         LTR   @09,@09                                          02S0187 00957000
         BZ    @RF00187                                         02S0187 00958000
*          SVRO = RMCAISV;          /* GIVE USER ISV BOOST           */ 00959000
         LH    SVRO,RMCAISV(,RMCTPTR)                           02S0188 00960000
         N     SVRO,@CF02217                                    02S0188 00961000
*        END;                                                   02S0189 00962000
*      ELSE                                                     02S0190 00963000
*        /* CALCULATE RATE - DIVIDE AMOUNT OF SERVICE BY TIME NTRVL  */ 00964000
*        DO;                                                    02S0190 00965000
         B     @RC00184                                         02S0190 00966000
@RF00184 DS    0H                                               02S0191 00967000
*        WKRO = RRPATOD - OUCBTMW;  /* SET WORKLOAD INTERVAL DURATN  */ 00968000
         L     WKRO,RRPATOD(,RRPAPTR)                           02S0191 00969000
         SL    WKRO,OUCBTMW(,OUCBPTR)                           02S0191 00970000
*        VLRO = MAX(VLRO,ONE);      /* PROTECT FRM DIVIDE EXCEPTION  */ 00971000
         L     @09,ONE                                          02S0192 00972000
         CR    VLRO,@09                                         02S0192 00973000
         BNL   *+6                                                      00974000
         LR    VLRO,@09                                         02S0192 00975000
*        R0 = OUCBWMS * RMTMFCT / WKRO; /* SERVICE RATE FOR INTERVL  */ 00976000
         LH    @09,RMTMFCT                                      02S0193 00977000
         M     @08,OUCBWMS(,OUCBPTR)                            02S0193 00978000
         DR    @08,WKRO                                         02S0193 00979000
         LR    R0,@09                                           02S0193 00980000
*        END;                                                   02S0194 00981000
*      WKRO = RTNREG;               /* SAVE RETURN REG CONTENTS      */ 00982000
@RC00184 LR    WKRO,RTNREG                                      02S0195 00983000
*       /* ? IRACTLCL EPN(WM4) */                               02S0196 00984000
*       CALL RMSBWM4 -> IRARMRTN ;              /* INVOKE WM4 SUBRTN */ 00985000
         L     @15,RMSBWM4(,RMCTPTR)                            02S0196 00986000
         BALR  @14,@15                                          02S0196 00987000
*        /* CALC USER NORM WKL LEVEL      */                    02S0197 00988000
*      OUCBWMR = R0+SVRO ;          /* GIVE USER NORMALIZED LEVEL    */ 00989000
         LR    @09,R0                                           02S0197 00990000
         ALR   @09,SVRO                                         02S0197 00991000
         ST    @09,OUCBWMR(,OUCBPTR)                            02S0197 00992000
*      OUCBTMA=RRPATOD ;            /* INDICATE USER RECENTLY ANALZD */ 00993000
         L     @09,RRPATOD(,RRPAPTR)                            02S0198 00994000
         ST    @09,OUCBTMA(,OUCBPTR)                            02S0198 00995000
*      RTNREG = WKRO;               /* RESTORE RETURN REG CONTENTS   */ 00996000
         LR    RTNREG,WKRO                                      02S0199 00997000
*      END;                                                     02S0200 00998000
*    END IRARMWM7;                                              02S0201 00999000
@EL00002 DS    0H                                               02S0201 01000000
@EF00002 DS    0H                                               02S0201 01001000
@ER00002 BR    @14                                              02S0201 01002000
*                                                               01S0202 01003000
*/* USERRDY SYSEVENT PROCESSOR                                       */ 01004000
*/* **************************************************************** */ 01005000
*/*                                                                  */ 01006000
*/*    ROUTINE NAME - IRARMHIT                                       */ 01007000
*/*                                                                  */ 01008000
*/*    DESCRIPTIVE NAME - WORKLOAD MANAGER USER READY SYSEVENT       */ 01009000
*/*                       SWAP-IN SCHEDULING ROUTINE                 */ 01010000
*/*                                                                  */ 01011000
*/*    FUNCTION - THE IRARMHIT ROUTINE RECEIVES CONTROL AS THE       */ 01012000
*/*          RESULT OF A DECISION TO APPLY SWAPIN PROCESSING         */ 01013000
*/*          TO A NEWLY AWAKENED USER.                               */ 01014000
*/*                                                                  */ 01015000
*/*    CALLED BY - IRARME04 - USER READY SYSEVENT PROCESS RTNE       */ 01016000
*/*                IRARME15 - SWAP OUT COMPLETE SYSEVENT RTNE        */ 01017000
*/*                IRARME44 - BRINGIN SYSEVENT RTNE                  */ 01018000
*/*                                                                  */ 01019000
*/*    INPUT - REG4 CONTAINS THE ADDRESS OF THE OUCB FOR THE USER    */ 01020000
*/*                                                                  */ 01021000
*/*    OUTPT - SEE FUNCTION.                                         */ 01022000
*/*                                                                  */ 01023000
*/*    EXIT  - BRANCH ON REGISTER 14.                                */ 01024000
*/*          - THERE IS NO ERROR EXIT OR INDICATION.                 */ 01025000
*/*                                                                  */ 01026000
*/*    CHANGE ACTIVITY - XXXXXXX                                    */  01027000
*/*                                                                  */ 01028000
*/* **************************************************************** */ 01029000
*  /* ? IRACTLEP EPN(HIT) */                                    02S0202 01030000
*  DCL IRARMHIT ENTRY INT;                                      02S0202 01031000
*  GEN CODE REFS(RMCTRMSA,RRPAEPA)                              02S0203 01032000
*        DEFS(IRARMHIT) NOEXIT SEQFLOW;                         02S0203 01033000
*                                  /*                                   01034000
         ENTRY IRARMHIT                                                 01035000
IRARMHIT DS    0H                                                       01036000
         L     @15,RMCTRMSA(,RMCTPTR)  SRM SAVE AREA START ADDRESS      01037000
         STM   @00,@14,064+000(@15)    SAVE INVOKING RTNE REGS          01038000
         MVC   064+060(4,@15),RRPAEPA(RRPAPTR) SAVE PREV RMEP           01039000
         ST    @01,RRPAEPA(,RRPAPTR)   INDICATE NEW CURRENT RMEP        01040000
         LR    @13,@15                 ROUTINE SAVE AREA ADDRESS        01041000
         BALR  @15,0                   SETUP ENTRY ADDRESSABILITY       01042000
         LA    @12,*-@PSTART           DISPLACEMENT TO MODULE BASE      01043000
         LCR   @12,@12                 NEGATIVE FOR SUBTRACT            01044000
         ALR   @12,@15                 SETUP MODULE ADDRESSABILITY      01045000
*  IF OUCBOUT = '1'B & OUCBGOB = '0'B & /* USR AVAILABLE FOR SWAP-IN */ 01046000
*        OUCBGOO = '0'B & OUCBGOI = '0'B THEN /* USER NOT TRANSITION */ 01047000
         TM    OUCBOUT(OUCBPTR),B'00000100'                     02S0204 01048000
         BNO   @RF00204                                         02S0204 01049000
         TM    OUCBGOB(OUCBPTR),B'11100000'                     02S0204 01050000
         BNZ   @RF00204                                         02S0204 01051000
*    /* PREPARE SWAP-IN CANDIDACY OF READIED USER                    */ 01052000
*    DO;                                                        02S0205 01053000
*    RFY (ASCBPTR,OUXBPTR,STPR,PMRE,SVRE) UNRSTD;               02S0206 01054000
*  IF OUCBOFF = '1'B & OUCBATR = '1'B & /* TRNSACTION SUSPENDED */      01055000
*     OUCBINC = '1'B THEN /* SESSION IS NOT  BETWEEN STEPS */   02S0207 01056000
         TM    OUCBOFF(OUCBPTR),B'00001000'                     02S0207 01057000
         BNO   @RF00207                                         02S0207 01058000
         TM    OUCBATR(OUCBPTR),B'10000001'                     02S0207 01059000
         BNO   @RF00207                                         02S0207 01060000
*  /* TEST FOR PERFORMANCE GROUP PERIOD CHANGE */               02S0208 01061000
*    /* ? IRACTLCL EPN(WM5) */                                  02S0208 01062000
*    CALL RMSBWM5 -> IRARMRTN ;                 /* INVOKE WM5 SUBRTN */ 01063000
         L     @15,RMSBWM5(,RMCTPTR)                            02S0208 01064000
         BALR  @14,@15                                          02S0208 01065000
*    WMSTPTR = RMCTWMST;            /* PICK WLM SPECIFICATION TABLE  */ 01066000
@RF00207 L     WMSTPTR,RMCTWMST(,RMCTPTR)                       02S0209 01067000
*    WPGDPTR = WMSTPGDT + WPGVTENT; /* PICK PERFORM GROUP DESCRIPTR  */ 01068000
         SLR   @05,@05                                          02S0210 01069000
         IC    @05,OUCBNPG(,OUCBPTR)                            02S0210 01070000
         ALR   @05,@05                                          02S0210 01071000
         AL    @05,WMSTPGVT(,WMSTPTR)                           02S0210 01072000
         LH    WPGDPTR,WPGVTENT(,@05)                           02S0210 01073000
         AL    WPGDPTR,WMSTPGDT(,WMSTPTR)                       02S0210 01074000
* /* TEST IF EXISTING TRANSACTION IS TO BE RESUMED */           02S0211 01075000
*   IF OUCBPVL = '1'B |   /* PRIVILEDGE USER - NO TRANS */      02S0211 01076000
*      OUCBENQ = '1'B |   /*  USER HOLDING WANTED RESOURCE           */ 01077000
*      (OUCBOFF ='1'B &   /* USER AWAKENED FORM LONG WAIT            */ 01078000
*      (OUCBSTR = '1'B |  /* STARTING NEW TRANS */              02S0211 01079000
*      OUCBATR = '0'B)) THEN /* NO TRANSACTION EXISTS/               */ 01080000
         TM    OUCBPVL(OUCBPTR),B'00000110'                     02S0211 01081000
         BNZ   @RT00211                                         02S0211 01082000
         TM    OUCBOFF(OUCBPTR),B'00001000'                     02S0211 01083000
         BNO   @RF00211                                         02S0211 01084000
         TM    OUCBSTR(OUCBPTR),B'01000000'                     02S0211 01085000
         BNZ   @RT00211                                         02S0211 01086000
         TM    OUCBATR(OUCBPTR),B'10000000'                     02S0211 01087000
         BO    @RF00211                                         02S0211 01088000
@RT00211 DS    0H                                               02S0212 01089000
*    DO ;                                                       02S0212 01090000
*    OUCBTMS = RRPATOD ;            /* INIT INTERVAL BEGIN TIME      */ 01091000
         L     @06,RRPATOD(,RRPAPTR)                            02S0213 01092000
         ST    @06,OUCBTMS(,OUCBPTR)                            02S0213 01093000
*    OUCBOFF = '0'B ;               /* INDICATE USER STATUS NOT WAIT */ 01094000
         NI    OUCBOFF(OUCBPTR),B'11110111'                     02S0214 01095000
*      IF OUCBTRM = '1'B & OUCBCIM = '0'B &    /* TERMINL WAIT USER  */ 01096000
*         OUCBINC = '1'B THEN       /* AND NOT BETWEEN JOB STEPS     */ 01097000
         TM    OUCBTRM(OUCBPTR),B'01000000'                     02S0215 01098000
         BNO   @RF00215                                         02S0215 01099000
         TM    OUCBCIM(OUCBPTR),B'00010000'                     02S0215 01100000
         BNZ   @RF00215                                         02S0215 01101000
         TM    OUCBINC(OUCBPTR),B'00000001'                     02S0215 01102000
         BNO   @RF00215                                         02S0215 01103000
*        /* USER READY AFTER TERMINAL WAIT STARTS NEW TRANSACTION    */ 01104000
*        DO;                                                    02S0216 01105000
*        OUCBNTR = '1'B;            /* FLAG XACTN PERFM GROUP RESET  */ 01106000
*        OUCBSTR = '1'B;            /* FLAG XACTN START REQST PENDNG */ 01107000
         OI    OUCBNTR(OUCBPTR),B'01100000'                     02S0218 01108000
*        OUCBWMG = WPGDPTR - WMSTPGDT; /* PERF GROUP DESCRIPT OFFSET */ 01109000
         LR    @05,WPGDPTR                                      02S0219 01110000
         SL    @05,WMSTPGDT(,WMSTPTR)                           02S0219 01111000
         STH   @05,OUCBWMG(,OUCBPTR)                            02S0219 01112000
*        OUCBPGP = WPGPOFST;        /* PERF GRP OFFSET TO 1ST PERIOD */ 01113000
         LA    @05,12                                           02S0220 01114000
         STC   @05,OUCBPGP(,OUCBPTR)                            02S0220 01115000
*        WPGPPTR = WPGDPTR + OUCBPGP; /* PICK PERF GROUP PERIOD      */ 01116000
         ALR   @05,WPGDPTR                                      02S0221 01117000
         LR    WPGPPTR,@05                                      02S0221 01118000
*        OUCBDMN = WPGPDMN;         /* PERF GROUP PERIOD DOMAIN NO.  */ 01119000
         SLR   @05,@05                                          02S0222 01120000
         IC    @05,WPGPDMN(,WPGPPTR)                            02S0222 01121000
         STC   @05,OUCBDMN(,OUCBPTR)                            02S0222 01122000
*        OUCBDMO = WDMVTENT ;       /* OFFSET INTO THE DOMAIN TABLE  */ 01123000
         ALR   @05,@05                                          02S0223 01124000
         AL    @05,WMSTDMVT(,WMSTPTR)                           02S0223 01125000
         LH    @05,WDMVTENT(,@05)                               02S0223 01126000
         STH   @05,OUCBDMO(,OUCBPTR)                            02S0223 01127000
*        IF OUCBPVL = '0'B THEN     /* USER SUBJECT TO WKLD ANALYSIS */ 01128000
         TM    OUCBPVL(OUCBPTR),B'00000100'                     02S0224 01129000
         BNZ   @RF00224                                         02S0224 01130000
*          OUCBTMW = RRPATOD;       /* INDICAT INTERVAL WAS ANALYZED */ 01131000
         ST    @06,OUCBTMW(,OUCBPTR)                            02S0225 01132000
*        OUCBTMP = RRPATOD;         /* INITL PERFM PERIOD START TIME */ 01133000
@RF00224 L     @06,RRPATOD(,RRPAPTR)                            02S0226 01134000
         ST    @06,OUCBTMP(,OUCBPTR)                            02S0226 01135000
*        END;                                                   02S0227 01136000
*        WPGPPTR = WPGDPTR + OUCBPGP; /* PICK CURR PERF GROUP PERIOD */ 01137000
@RF00215 LR    WPGPPTR,WPGDPTR                                  02S0228 01138000
         SLR   @06,@06                                          02S0228 01139000
         IC    @06,OUCBPGP(,OUCBPTR)                            02S0228 01140000
         ALR   WPGPPTR,@06                                      02S0228 01141000
*          /* CALCULATE WKLD LEVL APPROPRIATE TO NEWLY STARTED XACTN */ 01142000
*          R0 = ZERO;               /* GOTTN XACTN SRVC RATE IS ZERO */ 01143000
         SLR   R0,R0                                            02S0229 01144000
*          R1 = WMSTPODT + WPOVTENT; /* PERF OBJECTIVE APPLIC TO USR */ 01145000
         SLR   @06,@06                                          02S0230 01146000
         IC    @06,WPGPOBJN(,WPGPPTR)                           02S0230 01147000
         ALR   @06,@06                                          02S0230 01148000
         AL    @06,WMSTPOVT(,WMSTPTR)                           02S0230 01149000
         LH    @06,WPOVTENT(,@06)                               02S0230 01150000
         AL    @06,WMSTPODT(,WMSTPTR)                           02S0230 01151000
         LR    R1,@06                                           02S0230 01152000
*          /* ? IRACTLCL EPN(WM4) */                            02S0231 01153000
*          CALL RMSBWM4 -> IRARMRTN ;           /* INVOKE WM4 SUBRTN */ 01154000
         L     @15,RMSBWM4(,RMCTPTR)                            02S0231 01155000
         BALR  @14,@15                                          02S0231 01156000
*          OUCBWMR = R0;            /* SAVE CURRENT NORMALIZED LEVEL */ 01157000
         ST    R0,OUCBWMR(,OUCBPTR)                             02S0232 01158000
*          OUCBTMA = RRPATOD ;  /* INDICATE USER RECENTLY ANALYZED */   01159000
         L     @06,RRPATOD(,RRPAPTR)                            02S0233 01160000
         ST    @06,OUCBTMA(,OUCBPTR)                            02S0233 01161000
*     END ;                                                     02S0234 01162000
* ELSE                                                          02S0235 01163000
* /* PUT AWAKENED USER BACK INTO NORMAL SWAPPING CATEGORY */    02S0235 01164000
*  DO ;                                                         02S0235 01165000
         B     @RC00211                                         02S0235 01166000
@RF00211 DS    0H                                               02S0236 01167000
*    IF OUCBINC = '1'B & OUCBRTR = '1'B THEN /* RESUME TRANS */ 02S0236 01168000
         TM    OUCBINC(OUCBPTR),B'00010001'                     02S0236 01169000
         BNO   @RF00236                                         02S0236 01170000
*     /* SETUP WLM INTERVAL AS IF SWAP-OUT HAD JUST ENDED */    02S0237 01171000
*      DO ;                                                     02S0237 01172000
*       OUCBTMW = OUCBTMW + RRPATOD-OUCBTMS ; /* ADJUST WLM TIME */     01173000
         L     @06,OUCBTMW(,OUCBPTR)                            02S0238 01174000
         AL    @06,RRPATOD(,RRPAPTR)                            02S0238 01175000
         SL    @06,OUCBTMS(,OUCBPTR)                            02S0238 01176000
         ST    @06,OUCBTMW(,OUCBPTR)                            02S0238 01177000
*      IF OUCBTMW = ZERO THEN  /* DISALLOW  0 FOR INTERVAL TIME */      01178000
         LTR   @06,@06                                          02S0239 01179000
         BNZ   @RF00239                                         02S0239 01180000
*         OUCBTMW = ONE ; /* INSERT NONZERO STARTING TIME */    02S0240 01181000
         L     @06,ONE                                          02S0240 01182000
         ST    @06,OUCBTMW(,OUCBPTR)                            02S0240 01183000
*      OUCBTMS = RRPATOD ; /* LAST SWAP ACTION TIME OF READY */ 02S0241 01184000
@RF00239 L     @06,RRPATOD(,RRPAPTR)                            02S0241 01185000
         ST    @06,OUCBTMS(,OUCBPTR)                            02S0241 01186000
*    END ;                                                      02S0242 01187000
*  END ;                                                        02S0243 01188000
@RF00236 DS    0H                                               02S0244 01189000
*/* POSITION USER ON OUT QUEUE   */                             02S0244 01190000
*  OUCBGOB = '1'B ;                 /* QUEUE POSITION BEING CHANGED  */ 01191000
@RC00211 OI    OUCBGOB(OUCBPTR),B'00100000'                     02S0244 01192000
*  /* ? IRACTLCL EPN(RPS) */                                    02S0245 01193000
*  DO;                                                          02S0245 01194000
*  R1 = ADDR(RMEPBRPS);                      /* RPS REQUEST IS PARAM */ 01195000
         LA    R1,RMEPBRPS(,RMCTPTR)                            02S0246 01196000
*  CALL RMSBCRN -> IRARMRTN ;                   /* ACTION INVK FUNCT */ 01197000
         L     @15,RMSBCRN(,RMCTPTR)                            02S0247 01198000
         BALR  @14,@15                                          02S0247 01199000
*  END;                                                         02S0248 01200000
*/* REQUEST ANALYSYS IN ORDER TO EXPEDITITE THE SWAP-IN              */ 01201000
*  /* ? IRACTLCL EPN(CAP) */                                    02S0249 01202000
*  DO;                                                          02S0249 01203000
*  R1 = ADDR(RMEPBCAP);                      /* CAP REQUEST IS PARAM */ 01204000
         LA    R1,RMEPBCAP(,RMCTPTR)                            02S0250 01205000
*  CALL RMSBCRL -> IRARMRTN ;                   /* ALGRTHM SCH FUNCT */ 01206000
         L     @15,RMSBCRL(,RMCTPTR)                            02S0251 01207000
         BALR  @14,@15                                          02S0251 01208000
*  END;                                                         02S0252 01209000
*  RFY   (ASCBPTR,OUXBPTR,STPR,PMRE,SVRE) RSTD;                 02S0253 01210000
*END ;                                                          02S0254 01211000
*  /* ? IRACTLEP ENN(HIT) */                                    02S0255 01212000
*  GEN CODE EXIT NOSEQFLOW;                                     02S0255 01213000
@RF00204 DS    0H                                               02S0255 01214000
*                                  /*                                   01215000
         MVC   RRPAEPA(4,RRPAPTR),064+060(@13) RESTORE PREV RMEP        01216000
         LM    @00,@14,064+000(@13)    RELOAD INVOKING RTNE REGS        01217000
         BR    RTNREG                  RETURN TO INVOKER                01218000
*                                                               01S0256 01219000
*/* TRANSACTION START ROUTINE                                        */ 01220000
*/* **************************************************************** */ 01221000
*/*                                                                  */ 01222000
*/*    ROUTINE NAME - IRARMWMN                                       */ 01223000
*/*                                                                  */ 01224000
*/*    DESCRIPTIVE NAME - WORKLOAD MANAGER TRANSACTION START RTNE    */ 01225000
*/*                                                                  */ 01226000
*/*    FUNCTION - THE IRARMWMN ROUTINE RECEIVES CONTROL AS THE       */ 01227000
*/*          RESULT OF A SYSEVENT THAT HAS BEEN DEFINED BY THE       */ 01228000
*/*          WORKLOAD MANAGER TO SIGNIFY THAT A NEW TRANSACTION      */ 01229000
*/*          SHOULD BE STARTED FOR THAT USER.  IF THE USER IS        */ 01230000
*/*          NOT IN CORE, A FLAG IS SET TO CAUSE THE IRARMWMN        */ 01231000
*/*          ROUTINE TO BE RE-ENTERED DURING THE SWAP-IN OF THE      */ 01232000
*/*          USER.  OTHERWISE, ANY EXISTING XACTN IS STOPPED BY      */ 01233000
*/*          CALLING IRARMWMO, AND THE USER TRANSACTION FIELDS       */ 01234000
*/*          ARE RESET TO REFLECT THE NEW XACTN BEING STARTED.       */ 01235000
*/*                                                                  */ 01236000
*/*    CALLED BY - IRARME10 - INITIATOR ATTCH SYSEVENT ROUTINE       */ 01237000
*/*                IRARME31 - PERFM GRP RESET SYSEVENT ROUTINE       */ 01238000
*/*                IRARME32 - NEW PERFM SPECF SYSEVENT ROUTINE       */ 01239000
*/*                IRARME34 - TERMINAL GET/PT SYSEVENT ROUTINE       */ 01240000
*/*                IRARMWMR - USER TRANSACTION RESUMPT ROUTINE       */ 01241000
*/*                IRARMSET - SYS IPS CHANGE PROCESSNG ROUTINE       */ 01242000
*/*                                                                  */ 01243000
*/*    INPUT - REG 4 CONTAINS THE ADDRESS OF THE OUCB FOR THE USER   */ 01244000
*/*            FOR WHOM A TRANSACTION IS TO BE STARTED.              */ 01245000
*/*          - REG 5 CONTAINS THE USER ASCB ADDRESS.                 */ 01246000
*/*          - REG 14 CONTAINS THE RETURN ADDRESS.                   */ 01247000
*/*          - REG 15 CONTAINS THE IRARMWMN RTNE ADDRESS.            */ 01248000
*/*          - OUCBNPG IS SET TO THE APPLICABLE PERF GRP NUMBER.     */ 01249000
*/*          - OUCBATR IS SET IF HAVE A XACTN CURR FOR THE USER.     */ 01250000
*/*          - RMCTMFA IS SET IF WKLD ACTIVITY IS BEING MEASURD.     */ 01251000
*/*          - OUCBOUT INDICATES WHETHER THE USER IS NOT IN CORE.    */ 01252000
*/*          - OUCBTMW INDICATES WHETHER USER ANALYZED AT SWAPIN.    */ 01253000
*/*                                                                  */ 01254000
*/*    OUTPT - OUCBWMG IS SET TO THE PERF GRP DESCRIPT TO BE USED.   */ 01255000
*/*          - OUCBPGP IS SET TO THE 1ST PERIOD IN THE PERF GROUP.   */ 01256000
*/*          - OUXBTRS,TRT,TMO,PRS,TMP VALUES ARE RESET.             */ 01257000
*/*          - OUCBSTR,NTR,RTR ARE SET OFF AT BEGIN OF TRANSACTN.    */ 01258000
*/*          - OUCBATR IS SET ON TO INDICATE HAV ACTIVE TRANSACTN.   */ 01259000
*/*          - OUCBSTR IS SET ON IF USER CURRENTLY SWAPPED OUT.      */ 01260000
*/*          - OUCBSWC IS SET TO ZERO .                              */ 01261000
*/*          - OUCBTMO IS SET TO THE TRANSACTION STARTING TIME.      */ 01262000
*/*          - OUXBTRC IS AUGUMENTED TO SHOW ONE MORE TRANSACTION.   */ 01263000
*/*                                                                  */ 01264000
*/*    EXIT  - BRANCH ON REGISTER 14.                                */ 01265000
*/*          - THERE IS NO ERROR EXIT OR INDICATION.                 */ 01266000
*/*                                                                  */ 01267000
*/* **************************************************************** */ 01268000
*  /* ? IRACTLEP EPN(WMN) */                                    02S0256 01269000
*  DCL IRARMWMN ENTRY INT;                                      02S0256 01270000
*  GEN CODE DEFS(IRARMWMN) NOEXIT SEQFLOW;                      02S0257 01271000
*                                  /*                                   01272000
         ENTRY IRARMWMN                                                 01273000
IRARMWMN DS    0H                                                       01274000
         STM   @00,@14,000+000(@13)    SAVE INVOKING RTNE REGS          01275000
         LA    @12,IRARMWMN-@PSTART    DISPLACEMENT TO MODULE BASE      01276000
         LCR   @12,@12                 NEGATIVE FOR SUBTRACT            01277000
         ALR   @12,@15                 SETUP MODULE ADDRESSABILITY      01278000
*    RFY (WKRE) UNRSTD;                                         02S0258 01279000
*IRARMWMB: /* POINT AT WHICH PERFORM TRANSACTION START PROCESSING    */ 01280000
*    OUXBPTR = ASCBOUXB;            /* PICK USER CTRL BLCK EXTENSION */ 01281000
IRARMWMB L     OUXBPTR,ASCBOUXB(,ASCBPTR)                       02S0259 01282000
*    WMSTPTR = RMCTWMST;            /* PICK WLM SPECIFICATION TABLE  */ 01283000
         L     WMSTPTR,RMCTWMST(,RMCTPTR)                       02S0260 01284000
*    WPGDPTR = WMSTPGDT + WPGVTENT; /* PICK USER PERF GRP DESCRIPTOR */ 01285000
         SLR   @10,@10                                          02S0261 01286000
         IC    @10,OUCBNPG(,OUCBPTR)                            02S0261 01287000
         ALR   @10,@10                                          02S0261 01288000
         AL    @10,WMSTPGVT(,WMSTPTR)                           02S0261 01289000
         LH    WPGDPTR,WPGVTENT(,@10)                           02S0261 01290000
         AL    WPGDPTR,WMSTPGDT(,WMSTPTR)                       02S0261 01291000
*    IF OUCBINP = '1'B THEN         /* JOB SELECT SYSEVENT RECEIVED  */ 01292000
         TM    OUCBINP(OUCBPTR),B'00000010'                     02S0262 01293000
         BNO   @RF00262                                         02S0262 01294000
*      /* WORKLOAD MANAGER TRANSACTION PROCESSING APPLICABLE TO USER */ 01295000
*      DO;                                                      02S0263 01296000
*      OUCBSTR = '1'B;              /* FLAG XACTN START REQST PENDNG */ 01297000
         OI    OUCBSTR(OUCBPTR),B'01000000'                     02S0264 01298000
*      IF OUCBINC = '1'B &          /* USER IS SUBJECT TO WLM CONTRL */ 01299000
*            OUCBOUT = '0'B THEN    /* USER FIELDS ARE AVAILABLE NOW */ 01300000
         TM    OUCBINC(OUCBPTR),B'00000001'                     02S0265 01301000
         BNO   @RF00265                                         02S0265 01302000
         TM    OUCBOUT(OUCBPTR),B'00000100'                     02S0265 01303000
         BNZ   @RF00265                                         02S0265 01304000
*        /* INITIALIZE PROPR USER FIELDS TO REFLECT NEW STARTD XACTN */ 01305000
*        DO;                                                    02S0266 01306000
*        IF OUCBATR = '1'B THEN     /* PREVIOUS XACTN IN EXISTENCE   */ 01307000
         TM    OUCBATR(OUCBPTR),B'10000000'                     02S0267 01308000
         BNO   @RF00267                                         02S0267 01309000
*          /* INVOKE ROUTINE TO CLEAN UP THE PREVIOUS TRANSACTION    */ 01310000
*          /* ? IRACTLCL EPN(WMO) */                            02S0268 01311000
*          CALL RMSBWMO -> IRARMRTN ;           /* INVOKE WMO SUBRTN */ 01312000
         L     @15,RMSBWMO(,RMCTPTR)                            02S0268 01313000
         BALR  @14,@15                                          02S0268 01314000
*        OUCBWMG = WPGDPTR - WMSTPGDT; /* PERF GRP DESCRIPTOR OFFSET */ 01315000
@RF00267 LR    @10,WPGDPTR                                      02S0269 01316000
         SL    @10,WMSTPGDT(,WMSTPTR)                           02S0269 01317000
         STH   @10,OUCBWMG(,OUCBPTR)                            02S0269 01318000
*        WPGPPTR = WPGDPTR + OUCBPGP ; /* ADDR OF PERF GROUP PERIOD  */ 01319000
         LR    WPGPPTR,WPGDPTR                                  02S0270 01320000
         SLR   @10,@10                                          02S0270 01321000
         IC    @10,OUCBPGP(,OUCBPTR)                            02S0270 01322000
         ALR   WPGPPTR,@10                                      02S0270 01323000
*        OUCBATR = '1'B;            /* INDICATE HAVE ACTIVE TRANSACN */ 01324000
*        OUCBSTR = '0'B;            /* RESET XACTN START REQUEST FLG */ 01325000
*        OUCBNTR = '0'B;            /* RESET XACTN TERMINATE REQ FLG */ 01326000
*        OUCBRTR = '0'B;            /* RESET XACTN RESUM REQUEST FLG */ 01327000
*        OUCBPCH = '0'B;            /* RESET PERIOD CHNG OUTSTND FLG */ 01328000
         OI    OUCBATR(OUCBPTR),B'10000000'                     02S0275 01329000
         NI    OUCBSTR(OUCBPTR),B'10000111'                     02S0275 01330000
*        OUXBTRC = OUXBTRC + ONE;   /* INDICATE HAV ONE MOR TRANSACN */ 01331000
         L     @10,OUXBTRC(,OUXBPTR)                            02S0276 01332000
         AL    @10,ONE                                          02S0276 01333000
         ST    @10,OUXBTRC(,OUXBPTR)                            02S0276 01334000
*        OUCBSWC = ZERO;            /* RESET USER SWAP COUNT        */  01335000
         SLR   @10,@10                                          02S0277 01336000
         STH   @10,OUCBSWC(,OUCBPTR)                            02S0277 01337000
*        OUXBTRS = ZERO;            /* RESET XACTN SERVIC UNIT ACCUM */ 01338000
         ST    @10,OUXBTRS(,OUXBPTR)                            02S0278 01339000
*        OUXBTRT = ZERO;            /* RESET XACTN ACTIVE TIME ACCUM */ 01340000
         ST    @10,OUXBTRT(,OUXBPTR)                            02S0279 01341000
*        OUXBTRR = ZERO;            /* RESET XACTN RESDNT TIME ACCUM */ 01342000
         ST    @10,OUXBTRR(,OUXBPTR)                            02S0280 01343000
*        OUXBPRS = ZERO;            /* RESET PERIOD SERVC UNIT FIELD */ 01344000
         ST    @10,OUXBPRS(,OUXBPTR)                            02S0281 01345000
*        OUCBWMS = ZERO;            /* RESET WLM INTERVAL CURR SERVC */ 01346000
         ST    @10,OUCBWMS(,OUCBPTR)                            02S0282 01347000
*        OUCBCPU = ZERO ;           /* RESET CPU SERVICE             */ 01348000
         ST    @10,OUCBCPU(,OUCBPTR)                            02S0283 01349000
*        OUCBIOC = ZERO ;           /* RESET IO  SERVICE             */ 01350000
         ST    @10,OUCBIOC(,OUCBPTR)                            02S0284 01351000
*        OUCBMSO = ZERO ;           /* RESET MSO SERVICE             */ 01352000
         ST    @10,OUCBMSO(,OUCBPTR)                            02S0285 01353000
*        IF RRPACOD ^= RSTORCMP THEN /* XACTN NOT STARTD BY USER RDY */ 01354000
         CLI   RRPACOD(RRPAPTR),19                              02S0286 01355000
         BE    @RF00286                                         02S0286 01356000
*          /* IMPROVE RESPONSE OF INITIAL TSO PROGRAM INVOCATION     */ 01357000
*          OUCBTMS = RRPATOD;       /* INSERT DUMMY LAST ACTION TIME */ 01358000
         L     @10,RRPATOD(,RRPAPTR)                            02S0287 01359000
         ST    @10,OUCBTMS(,OUCBPTR)                            02S0287 01360000
*        ELSE                       /* XACTN WAS STARTED BY USER RDY */ 01361000
*          /* RECORD THE AMOUNT OF TIME SPENT OUT OF CORE BY XACTN   */ 01362000
*          DO;                                                  02S0288 01363000
         B     @RC00286                                         02S0288 01364000
@RF00286 DS    0H                                               02S0289 01365000
*          OUXBTRT = RRPATOD - OUCBTMS; /* KEEP TRANSACTION OUT TIME */ 01366000
         L     @10,RRPATOD(,RRPAPTR)                            02S0289 01367000
         SL    @10,OUCBTMS(,OUCBPTR)                            02S0289 01368000
         ST    @10,OUXBTRT(,OUXBPTR)                            02S0289 01369000
*          IF RMCTMFA = '1'B THEN   /* WKLOD ACTIVITY BEING MEASURED */ 01370000
         TM    RMCTMFA(RMCTPTR),B'10000000'                     02S0290 01371000
         BNO   @RF00290                                         02S0290 01372000
*            /* INVOKE MEASUREMENT ROUTINE TO COLLECT XACTN OUT TIME */ 01373000
*            DO;                                                02S0291 01374000
*            RRPAWAR = '1'B;        /* INSERT WKLD ACTIVTY RTNE FLAG */ 01375000
         OI    RRPAWAR(RRPAPTR),B'01000000'                     02S0292 01376000
*            /* ? IRACTLCL EPN(WR4) */                          02S0293 01377000
*            CALL RMSBWR4 -> IRARMRTN ;         /* INVOKE WR4 SUBRTN */ 01378000
         L     @15,RMSBWR4(,RMCTPTR)                            02S0293 01379000
         BALR  @14,@15                                          02S0293 01380000
*            RRPAWAR = '0'B;        /* DELETE WKLD ACTIVTY RTNE FLAG */ 01381000
         NI    RRPAWAR(RRPAPTR),B'10111111'                     02S0294 01382000
*            END;                                               02S0295 01383000
*          END;                                                 02S0296 01384000
@RF00290 DS    0H                                               02S0297 01385000
*        OUCBTMP = OUCBTMS;         /* RESET PERIOD START TIME FIELD */ 01386000
@RC00286 L     @10,OUCBTMS(,OUCBPTR)                            02S0297 01387000
         ST    @10,OUCBTMP(,OUCBPTR)                            02S0297 01388000
*        OUCBTMO = OUCBTMS;         /* RESET TRANSACN BEGINNING TIME */ 01389000
         ST    @10,OUCBTMO(,OUCBPTR)                            02S0298 01390000
*        CALL IRARMWMH;             /* RESET INTERVAL BEG MEASURMNTS */ 01391000
         BAL   @14,IRARMWMH                                     02S0299 01392000
*        CALL IRARMWMJ;             /* SET APPLICABLE ALGORITHM INDS */ 01393000
         BAL   @14,IRARMWMJ                                     02S0300 01394000
*        END;                                                   02S0301 01395000
*      ELSE                         /* USER IS CURRENTLY SWAPPED OUT */ 01396000
*        /* IRARMWMN ROUTINE WILL BE REINVOKED WHEN USER IS SWAPD IN */ 01397000
*        DO;                                                    02S0302 01398000
         B     @RC00265                                         02S0302 01399000
@RF00265 DS    0H                                               02S0303 01400000
*        IF OUCBATR = '1'B THEN     /* PREVIOUS XACTN IN EXISTENCE   */ 01401000
         TM    OUCBATR(OUCBPTR),B'10000000'                     02S0303 01402000
         BNO   @RF00303                                         02S0303 01403000
*          /* INVOKE MEASUREMENT ROUTINE TO COLLECT XACTN END TIME   */ 01404000
*          DO;                                                  02S0304 01405000
*          IF RMCTMFA = '1'B &      /* WKLD ACTIVITY BEING MEASURD   */ 01406000
*                OUCBNTR = '0'B THEN /* TRANSACN STOP NOT COLLECTD   */ 01407000
         TM    RMCTMFA(RMCTPTR),B'10000000'                     02S0305 01408000
         BNO   @RF00305                                         02S0305 01409000
         TM    OUCBNTR(OUCBPTR),B'00100000'                     02S0305 01410000
         BNZ   @RF00305                                         02S0305 01411000
*            /* UPDATE WORKLOAD ACTIVITY TRANSACTION MEASUREMENTS    */ 01412000
*            DO;                                                02S0306 01413000
*            RRPAWAR = '1'B;        /* INSERT WKLD ACTIVTY RTNE FLAG */ 01414000
         OI    RRPAWAR(RRPAPTR),B'01000000'                     02S0307 01415000
*            /* ? IRACTLCL EPN(WR6) */                          02S0308 01416000
*            CALL RMSBWR6 -> IRARMRTN ;         /* INVOKE WR6 SUBRTN */ 01417000
         L     @15,RMSBWR6(,RMCTPTR)                            02S0308 01418000
         BALR  @14,@15                                          02S0308 01419000
*            IF OUCBINC = '1'B & OUCBRDY = '1'B THEN /* NOT SUSPEND     01420000
*                                                            @YM05631*/ 01421000
         TM    OUCBINC(OUCBPTR),B'00000001'                     02S0309 01422000
         BNO   @RF00309                                         02S0309 01423000
         TM    OUCBRDY(OUCBPTR),B'10000000'                     02S0309 01424000
         BNO   @RF00309                                         02S0309 01425000
*              /* UPDATE WORKLOAD ACTIVITY PERIOD MEASUREMENTS       */ 01426000
*              DO;                                              02S0310 01427000
*              /* ? IRACTLCL EPN(WR4) */                        02S0311 01428000
*              CALL RMSBWR4 -> IRARMRTN ;       /* INVOKE WR4 SUBRTN */ 01429000
         L     @15,RMSBWR4(,RMCTPTR)                            02S0311 01430000
         BALR  @14,@15                                          02S0311 01431000
*              OUCBWMG = WPGDPTR-WMSTPGDT;/* OFFSET TO NEW PERF 02S0312 01432000
*                                       GRP DESCRIPTOR       @ZA20350*/ 01433000
         LR    @10,WPGDPTR                                      02S0312 01434000
         SL    @10,WMSTPGDT(,WMSTPTR)                           02S0312 01435000
         STH   @10,OUCBWMG(,OUCBPTR)                            02S0312 01436000
*              OUCBPGP = WPGPOFST;  /* PERF GRP OFFSET TO 1ST PERIOD */ 01437000
         MVI   OUCBPGP(OUCBPTR),X'0C'                           02S0313 01438000
*              OUCBMAR = '1'B;      /* SPECFY NEGATIV PERIOD ACCUMUL */ 01439000
         OI    OUCBMAR(OUCBPTR),B'00000100'                     02S0314 01440000
*              /* ? IRACTLCL EPN(WR4) */                        02S0315 01441000
*              CALL RMSBWR4 -> IRARMRTN ;       /* INVOKE WR4 SUBRTN */ 01442000
         L     @15,RMSBWR4(,RMCTPTR)                            02S0315 01443000
         BALR  @14,@15                                          02S0315 01444000
*              OUCBMAR = '0'B;      /* RESET NEGATIVE PERIOD ACCUMUL */ 01445000
         NI    OUCBMAR(OUCBPTR),B'11111011'                     02S0316 01446000
*              END;                                             02S0317 01447000
*            RRPAWAR = '0'B;        /* DELETE WKLD ACTIVTY RTNE FLAG */ 01448000
@RF00309 NI    RRPAWAR(RRPAPTR),B'10111111'                     02S0318 01449000
*            END;                                               02S0319 01450000
*          OUCBNTR = '1'B;          /* INDICATE XACTN STOP COLLECTED */ 01451000
@RF00305 OI    OUCBNTR(OUCBPTR),B'00100000'                     02S0320 01452000
*          END;                     /* END COLLECTING XACN      02S0321 01453000
*                                      MEASUREMENTS          @ZA20350*/ 01454000
*          OUCBWMG = WPGDPTR-WMSTPGDT;/* OFFST TO NEW PERF GRP  02S0322 01455000
*                                         DESCRIPTOR         @ZA20350*/ 01456000
@RF00303 LR    @10,WPGDPTR                                      02S0322 01457000
         SL    @10,WMSTPGDT(,WMSTPTR)                           02S0322 01458000
         STH   @10,OUCBWMG(,OUCBPTR)                            02S0322 01459000
*          OUCBPGP = WPGPOFST;      /* PERF GRP OFFSET TO 1ST PERIOD */ 01460000
         LA    @10,12                                           02S0323 01461000
         STC   @10,OUCBPGP(,OUCBPTR)                            02S0323 01462000
*          WPGPPTR = WPGDPTR + OUCBPGP ; /* PICK USER PERF GROUP PERI*/ 01463000
         ALR   @10,WPGDPTR                                      02S0324 01464000
         LR    WPGPPTR,@10                                      02S0324 01465000
*          OUCBDMN = WPGPDMN ;    /* PERF GROUP PERIOD DOMAIN        */ 01466000
         SLR   @10,@10                                          02S0325 01467000
         IC    @10,WPGPDMN(,WPGPPTR)                            02S0325 01468000
         STC   @10,OUCBDMN(,OUCBPTR)                            02S0325 01469000
*          OUCBDMO = WDMVTENT ;     /* OFFSET INTO THE DOMAIN TABLE  */ 01470000
         ALR   @10,@10                                          02S0326 01471000
         AL    @10,WMSTDMVT(,WMSTPTR)                           02S0326 01472000
         LH    @10,WDMVTENT(,@10)                               02S0326 01473000
         STH   @10,OUCBDMO(,OUCBPTR)                            02S0326 01474000
*        END;                                                   02S0327 01475000
*      END;                                                     02S0328 01476000
@RC00265 DS    0H                                               02S0329 01477000
*    RFY (WKRE) RSTD;                                           02S0329 01478000
@RF00262 DS    0H                                               02S0330 01479000
*  /* ? IRACTLEP ENN(WMN) */                                    02S0330 01480000
*  GEN CODE EXIT NOSEQFLOW;                                     02S0330 01481000
*                                  /*                                   01482000
         LM    @00,@14,000+000(@13)    RELOAD INVOKING RTNE REGS        01483000
         BR    RTNREG                  RETURN TO INVOKER                01484000
*                                                               01S0331 01485000
*/* TRANSACTION STOP ROUTINE                                         */ 01486000
*/* **************************************************************** */ 01487000
*/*                                                                  */ 01488000
*/*    ROUTINE NAME - IRARMWMO                                       */ 01489000
*/*                                                                  */ 01490000
*/*    DESCRIPTIVE NAME - WORKLOAD MANAGER TRANSACTION STOP RTNE     */ 01491000
*/*                                                                  */ 01492000
*/*    FUNCTION - THE IRARMWMO ROUTINE RECEIVES CONTROL AS THE       */ 01493000
*/*          RESULT OF A SYSEVENT THAT HAS BEEN SPECIFIED BY THE     */ 01494000
*/*          WORKLOAD MANAGER AS DEFINING THE END OF ANY CURRENT     */ 01495000
*/*          USER TRANSACTION.  IF A NEW TRANSACTION WILL NEXT       */ 01496000
*/*          BE CREATED FOR THE USER, IRARMWMO INDICATES THE END     */ 01497000
*/*          OF THE CURRENT TRANSACTION.  IF THE NEXT USER EVENT     */ 01498000
*/*          IS NOT KNOWN, IRARMWMO LEAVES THE TRANSACTION ACCUM     */ 01499000
*/*          VALUES FOR LATER POSSIBLE RESUMPTION OF THE XACTN.      */ 01500000
*/*          IN ANY CASE, IRARMWMO CAUSES THE PRECEDING TIME AND     */ 01501000
*/*          SERVICE TO BE PROPERLY RECORDED TO THE CURR XACTN.      */ 01502000
*/*                                                                  */ 01503000
*/*    CALLED BY - IRARME08 - USER JOB SELECT SYSEVENT ROUTINE       */ 01504000
*/*                IRARME09 - USER JOB DELETE SYSEVENT ROUTINE       */ 01505000
*/*                IRARME11 - INITIATOR DETCH SYSEVENT ROUTINE       */ 01506000
*/*                IRARMWMN - USER TRANSACTION STARTUP ROUTINE       */ 01507000
*/*                IRARMWMQ - USER TRANSACTION SUSPEND ROUTINE       */ 01508000
*/*                                                                  */ 01509000
*/*    INPUT - REG 4 CONTAINS THE ADDRESS OF THE OUCB FOR THE USER   */ 01510000
*/*            WHOSE TRANSACTION IS TO BE STOPPED.                   */ 01511000
*/*          - REG 5 CONTAINS THE USER ASCB ADDRESS.                 */ 01512000
*/*          - REG 14 CONTAINS THE RETURN ADDRESS.                   */ 01513000
*/*          - REG 15 CONTAINS THE IRARMWMO RTNE ADDRESS.            */ 01514000
*/*          - OUCBATR IS SET IF HAVE A XACTN CURR FOR THE USER.     */ 01515000
*/*          - OUCBSTR IS SET IF A NEW XACTN WILL NEXT BE STARTED.   */ 01516000
*/*          - OUCBNTR IS SET IF THE OLD XACTN IS TO BE STOPPED.     */ 01517000
*/*          - OUCBTMS IS SET TO THE BEG TIME OF THE CURR NTRVL.     */ 01518000
*/*          - OUCBSWC INDICATES IF XACTN HAD ONLY ONE SWAP-IN.      */ 01519000
*/*                                                                  */ 01520000
*/*    OUTPT - IRARMWMO INVOKES IRARMWMI, WHICH UPDATES THE USER     */ 01521000
*/*            TRANSACTION ACCUMULATOR FIELDS.                       */ 01522000
*/*          - OUCBATR IS SET OFF IF CURR XACTN WAS ENDED.           */ 01523000
*/*          - OUCBRTR SET ON IF CURR XACTN WAS SUSPENDED.           */ 01524000
*/*          - OUCBSWC IS UPDATED IF CURR XACTN SUSPENDED.           */ 01525000
*/*          - OUCBTMW IS ZEROED  IF CURR XACTN WAS ENDED.           */ 01526000
*/*          - OUXBTRC IS UPDATED IF CURR XACTN WAS ENDED.           */ 01527000
*/*          - OUXBJBS IS UPDATED IF CURR XACTN WAS ENDED.           */ 01528000
*/*          - OUXBJBT IS UPDATED IF CURR XACTN WAS ENDED.           */ 01529000
*/*                                                                  */ 01530000
*/*    EXIT  - BRANCH ON REGISTER 14.                                */ 01531000
*/*          - THERE IS NO ERROR EXIT OR INDICATION.                 */ 01532000
*/*                                                                  */ 01533000
*/* **************************************************************** */ 01534000
*  /* ? IRACTLEP EPN(WMO) */                                    02S0331 01535000
*  DCL IRARMWMO ENTRY INT;                                      02S0331 01536000
*  GEN CODE DEFS(IRARMWMO) NOEXIT SEQFLOW;                      02S0332 01537000
*                                  /*                                   01538000
         ENTRY IRARMWMO                                                 01539000
IRARMWMO DS    0H                                                       01540000
         STM   @00,@14,128+000(@13)    SAVE INVOKING RTNE REGS          01541000
         LA    @12,IRARMWMO-@PSTART    DISPLACEMENT TO MODULE BASE      01542000
         LCR   @12,@12                 NEGATIVE FOR SUBTRACT            01543000
         ALR   @12,@15                 SETUP MODULE ADDRESSABILITY      01544000
*IRARMWME: /* POINT AT WHICH TERMINATE OR SUSPEND CURRENT TRANSACTN  */ 01545000
*    WMSTPTR = RMCTWMST;            /* PICK WLM SPECIFICATION TABLE  */ 01546000
IRARMWME L     WMSTPTR,RMCTWMST(,RMCTPTR)                       02S0333 01547000
*    IF OUCBATR = '1'B THEN         /* TRANSACTION CURRENTLY ACTIVE  */ 01548000
         TM    OUCBATR(OUCBPTR),B'10000000'                     02S0334 01549000
         BNO   @RF00334                                         02S0334 01550000
*      /* DETERMINE WHETHER TRANSACTION HAS BEEN ENDED OR SUSPENDED  */ 01551000
*      DO;                                                      02S0335 01552000
*      OUXBPTR = ASCBOUXB;          /* PICK USER CTRL BLOCK EXTENSN  */ 01553000
         L     OUXBPTR,ASCBOUXB(,ASCBPTR)                       02S0336 01554000
*      IF OUCBSTR = '1'B |          /* NEW XACTN TO BE STARTED  02S0337 01555000
*                                                            @YM05631*/ 01556000
*            OUCBNTR = '1'B |       /* OLD XACTN TO BE STOPPED       */ 01557000
*            (OUCBLOG = '1'B &      /* TSO USER TRANSACTION          */ 01558000
*            (RRPACOD = INITDET |   /* STEP DETACH SYSEVENT          */ 01559000
*            (OUCBTRM = '1'B & OUCBCIM = '0'B))) THEN /* TERMNL WAIT */ 01560000
         TM    OUCBSTR(OUCBPTR),B'01100000'                     02S0337 01561000
         BNZ   @RT00337                                         02S0337 01562000
         TM    OUCBLOG(OUCBPTR),B'00100000'                     02S0337 01563000
         BNO   @RF00337                                         02S0337 01564000
         CLI   RRPACOD(RRPAPTR),11                              02S0337 01565000
         BE    @RT00337                                         02S0337 01566000
         TM    OUCBTRM(OUCBPTR),B'01000000'                     02S0337 01567000
         BNO   @RF00337                                         02S0337 01568000
         TM    OUCBCIM(OUCBPTR),B'00010000'                     02S0337 01569000
         BNZ   @RF00337                                         02S0337 01570000
@RT00337 DS    0H                                               02S0338 01571000
*        /* ACCUMULATE TRANSACTION STATISTICS TO USER SESSION/JOB    */ 01572000
*        DO;                                                    02S0338 01573000
*        IF OUCBRTR = '0'B &        /* TRANSACTION WAS NOT SUSPENDED */ 01574000
*              OUCBNTR = '0'B THEN  /* XACTN PERFORM GROUP NOT RESET */ 01575000
         TM    OUCBRTR(OUCBPTR),B'00110000'                     02S0339 01576000
         BNZ   @RF00339                                         02S0339 01577000
*          CALL IRARMWMI;           /* UPDATE TRANSACTION STATISTICS */ 01578000
         BAL   @14,IRARMWMI                                     02S0340 01579000
*        ELSE                       /* XACTN ENDED WHILE SWAPPED OUT */ 01580000
*          IF OUCBSTR = '0'B THEN   /* NEW TRANSACTION NOT YET START */ 01581000
         B     @RC00339                                         02S0341 01582000
@RF00339 TM    OUCBSTR(OUCBPTR),B'01000000'                     02S0341 01583000
         BNZ   @RF00341                                         02S0341 01584000
*            CALL IRARMWMH;         /* RESET TRANSACTN NTRVL MEASURM */ 01585000
         BAL   @14,IRARMWMH                                     02S0342 01586000
*        IF OUCBNTR = '0'B &        /* TRANSACTN STOP NOT COLLECTED  */ 01587000
*              RMCTMFA = '1'B THEN  /* WKLD ACTIVITY BEING MEASURED  */ 01588000
@RF00341 DS    0H                                               02S0343 01589000
@RC00339 TM    OUCBNTR(OUCBPTR),B'00100000'                     02S0343 01590000
         BNZ   @RF00343                                         02S0343 01591000
         TM    RMCTMFA(RMCTPTR),B'10000000'                     02S0343 01592000
         BNO   @RF00343                                         02S0343 01593000
*          /* UPDATE WORKLOAD ACTIVITY TRANSACTION MEASUREMENTS      */ 01594000
*          DO;                                                  02S0344 01595000
*          RRPAWAR = '1'B;          /* INSERT WKLD ACTIVTY RTNE FLAG */ 01596000
         OI    RRPAWAR(RRPAPTR),B'01000000'                     02S0345 01597000
*          /* ? IRACTLCL EPN(WR6) */                            02S0346 01598000
*          CALL RMSBWR6 -> IRARMRTN ;           /* INVOKE WR6 SUBRTN */ 01599000
         L     @15,RMSBWR6(,RMCTPTR)                            02S0346 01600000
         BALR  @14,@15                                          02S0346 01601000
*          RRPAWAR = '0'B;          /* DELETE WKLD ACTIVTY RTNE FLAG */ 01602000
         NI    RRPAWAR(RRPAPTR),B'10111111'                     02S0347 01603000
*          END;                                                 02S0348 01604000
*        OUXBJBS = OUXBJBS + OUXBTRS; /* ADD TO SESSION XACTN SERV   */ 01605000
@RF00343 L     @09,OUXBJBS(,OUXBPTR)                            02S0349 01606000
         AL    @09,OUXBTRS(,OUXBPTR)                            02S0349 01607000
         ST    @09,OUXBJBS(,OUXBPTR)                            02S0349 01608000
*        OUXBJBT = OUXBJBT + OUXBTRT; /* ADD TO SESSION XACTN TIME   */ 01609000
         L     @09,OUXBJBT(,OUXBPTR)                            02S0350 01610000
         AL    @09,OUXBTRT(,OUXBPTR)                            02S0350 01611000
         ST    @09,OUXBJBT(,OUXBPTR)                            02S0350 01612000
*        OUXBJBR = OUXBJBR + OUXBTRR; /* ADD TO SESSION RESID TIME   */ 01613000
         L     @09,OUXBJBR(,OUXBPTR)                            02S0351 01614000
         AL    @09,OUXBTRR(,OUXBPTR)                            02S0351 01615000
         ST    @09,OUXBJBR(,OUXBPTR)                            02S0351 01616000
*        OUCBATR = '0'B;            /* NO LONGER HAVE ACTIVE XACTN   */ 01617000
*        OUCBSTR = '0'B;            /* SET OFF XACTN START REQUEST   */ 01618000
*        OUCBNTR = '0'B;            /* SET OFF XACTN END INDICATOR   */ 01619000
*        OUCBRTR = '0'B;            /* SET OFF XACTN SUSPENSE FLAG   */ 01620000
*        OUCBPCH = '0'B;            /* SET OFF PER CHG OUTSTD FLAG   */ 01621000
         NI    OUCBATR(OUCBPTR),B'00000111'                     02S0356 01622000
*        OUCBTMW = ZERO;            /* RESET WLM INTERVAL BEG TIME   */ 01623000
         SLR   @09,@09                                          02S0357 01624000
         ST    @09,OUCBTMW(,OUCBPTR)                            02S0357 01625000
*        OUCBWMS = ZERO;            /* RESET WLM INTERVL CURR SRVC   */ 01626000
         ST    @09,OUCBWMS(,OUCBPTR)                            02S0358 01627000
*        OUCBCPU = ZERO ;           /* RESET CPU SERVICE             */ 01628000
         ST    @09,OUCBCPU(,OUCBPTR)                            02S0359 01629000
*        OUCBIOC = ZERO ;           /* RESET IO SERVICE              */ 01630000
         ST    @09,OUCBIOC(,OUCBPTR)                            02S0360 01631000
*        OUCBMSO = ZERO ;           /* RESET MSO SERVICE             */ 01632000
         ST    @09,OUCBMSO(,OUCBPTR)                            02S0361 01633000
*        OUCBWMR = ZERO;            /* RESET WLM CURR NORMLZD LEVL   */ 01634000
         ST    @09,OUCBWMR(,OUCBPTR)                            02S0362 01635000
*        OUCBSWC = ZERO;            /* RESET TRANSACTN SWAPOUT CNT   */ 01636000
         STH   @09,OUCBSWC(,OUCBPTR)                            02S0363 01637000
*        OUXBTRS = ZERO;            /* RESET XACTN SERV ACCUMULATR   */ 01638000
         ST    @09,OUXBTRS(,OUXBPTR)                            02S0364 01639000
*        OUXBTRT = ZERO;            /* RESET XACTN TIME ACCUMULATR   */ 01640000
         ST    @09,OUXBTRT(,OUXBPTR)                            02S0365 01641000
*        OUXBTRR = ZERO;            /* RESET RESID TIME ACCUMULATR   */ 01642000
         ST    @09,OUXBTRR(,OUXBPTR)                            02S0366 01643000
*        OUCBPGP = WPGPOFST;        /* PERF GRP OFST TO 1ST PERIOD   */ 01644000
         LA    @09,12                                           02S0367 01645000
         STC   @09,OUCBPGP(,OUCBPTR)                            02S0367 01646000
*        WPGPPTR = WMSTPGDT + OUCBWMG+OUCBPGP ;/*PERF GROUP DESC */     01647000
         LH    WPGPPTR,OUCBWMG(,OUCBPTR)                        02S0368 01648000
         AL    WPGPPTR,WMSTPGDT(,WMSTPTR)                       02S0368 01649000
         ALR   WPGPPTR,@09                                      02S0368 01650000
*        R1=WMSTPODT+WPOVTENT; /* USER PERF OBJ */              02S0369 01651000
         SLR   @09,@09                                          02S0369 01652000
         IC    @09,WPGPOBJN(,WPGPPTR)                           02S0369 01653000
         ALR   @09,@09                                          02S0369 01654000
         AL    @09,WMSTPOVT(,WMSTPTR)                           02S0369 01655000
         LH    @09,WPOVTENT(,@09)                               02S0369 01656000
         AL    @09,WMSTPODT(,WMSTPTR)                           02S0369 01657000
         LR    R1,@09                                           02S0369 01658000
*        R0 = ZERO ; /* INDICATED ZERO SERVICE */               02S0370 01659000
         SLR   R0,R0                                            02S0370 01660000
*        WKRO = RTNREG ; /* SAVE RETURN REG */                  02S0371 01661000
         LR    WKRO,RTNREG                                      02S0371 01662000
*        /* CALC USER NORMALIZED WORK LEVEL */                  02S0372 01663000
*        /* ? IRACTLCL EPN(WM4) */                              02S0372 01664000
*        CALL RMSBWM4 -> IRARMRTN ;             /* INVOKE WM4 SUBRTN */ 01665000
         L     @15,RMSBWM4(,RMCTPTR)                            02S0372 01666000
         BALR  @14,@15                                          02S0372 01667000
*        OUCBWMR = R0 ; /* SAVE WORK LOAD LEVEL */              02S0373 01668000
         ST    R0,OUCBWMR(,OUCBPTR)                             02S0373 01669000
*        OUCBTMA = RRPATOD ; /* INDICATED USER ANALYZED */      02S0374 01670000
         L     @09,RRPATOD(,RRPAPTR)                            02S0374 01671000
         ST    @09,OUCBTMA(,OUCBPTR)                            02S0374 01672000
*        RTNREG = WKRO ; /* RESTORE RETURN REG CONTENTS */      02S0375 01673000
         LR    RTNREG,WKRO                                      02S0375 01674000
*        END;                                                   02S0376 01675000
*      ELSE                         /* SAME XACN COULD RESUME LATER  */ 01676000
*        /* INSURE TRANSACTION STATISTICS ARE UP TO DATE             */ 01677000
*        DO;                                                    02S0377 01678000
         B     @RC00337                                         02S0377 01679000
@RF00337 DS    0H                                               02S0378 01680000
*        IF RRPACOD = QSCECMP THEN  /* QUIESCE COMPLETE FOR SWAPOUT  */ 01681000
         CLI   RRPACOD(RRPAPTR),13                              02S0378 01682000
         BNE   @RF00378                                         02S0378 01683000
*          OUCBSWC = OUCBSWC + ONE; /* INCREMENT XACTN SWAP-OUT CNT  */ 01684000
         LH    @09,OUCBSWC(,OUCBPTR)                            02S0379 01685000
         AL    @09,ONE                                          02S0379 01686000
         STH   @09,OUCBSWC(,OUCBPTR)                            02S0379 01687000
*        CALL IRARMWMI;             /* UPDAT TRANSACTION STATISTICS  */ 01688000
@RF00378 BAL   @14,IRARMWMI                                     02S0380 01689000
*        CALL IRARMWM5;             /* CHECK TRANSACTION PERIOD END  */ 01690000
         LA    @15,IRARMWM5                                     02S0381 01691000
         BALR  @14,@15                                          02S0381 01692000
*        CALL IRARMWM7;             /* OBTAIN USER NORMALIZED LEVEL  */ 01693000
         BAL   @14,IRARMWM7                                     02S0382 01694000
*        OUCBRTR = '1'B;            /* INDICAT CURR XACTN SUSPENDED  */ 01695000
         OI    OUCBRTR(OUCBPTR),B'00010000'                     02S0383 01696000
*        IF RRPACOD = INITDET THEN  /* INITIATOR DETACH OF JOB STEP     01697000
*                                                            @YM05631*/ 01698000
         CLI   RRPACOD(RRPAPTR),11                              02S0384 01699000
         BNE   @RF00384                                         02S0384 01700000
*          OUCBTMW = ZERO;          /* RESET WLM INTERVAL INDICATOR     01701000
*                                                            @YM05631*/ 01702000
         SLR   @09,@09                                          02S0385 01703000
         ST    @09,OUCBTMW(,OUCBPTR)                            02S0385 01704000
*        END;                                                   02S0386 01705000
@RF00384 DS    0H                                               02S0387 01706000
*      CALL IRARMWMJ;               /* SET APPLICABLE ALGORITHM INDS */ 01707000
@RC00337 BAL   @14,IRARMWMJ                                     02S0387 01708000
*      END;                                                     02S0388 01709000
*  /* ? IRACTLEP ENN(WMO) */                                    02S0389 01710000
*  GEN CODE EXIT NOSEQFLOW;                                     02S0389 01711000
@RF00334 DS    0H                                               02S0389 01712000
*                                  /*                                   01713000
         LM    @00,@14,128+000(@13)    RELOAD INVOKING RTNE REGS        01714000
         BR    RTNREG                  RETURN TO INVOKER                01715000
*                                                               01S0390 01716000
*/* QSCECMP SYSEVENT WORKLOAD ROUTINE                                */ 01717000
*/* **************************************************************** */ 01718000
*/*                                                                  */ 01719000
*/*    ROUTINE NAME - IRARMWMQ                                       */ 01720000
*/*                                                                  */ 01721000
*/*    DESCRIPTIVE NAME - WORKLOAD MANAGER QUIESCE COMPLETED         */ 01722000
*/*                       SYSEVENT PROCESSING ROUTINE                */ 01723000
*/*                                                                  */ 01724000
*/*    FUNCTION - THE IRARMWMQ ROUTINE RECEIVES CONTROL AT THE       */ 01725000
*/*          TIME THAT AN USER HAS STOPPED EXECUTING, AND IS         */ 01726000
*/*          BEING SWAPPED OUT, SO THAT THE WORKLOAD MANAGER         */ 01727000
*/*          MAY RECORD THE SERVICE GIVEN THAT USER WHILE HE         */ 01728000
*/*          WAS IN CORE.  THE WORKLOAD MANAGER DETERMINES IF        */ 01729000
*/*          AN USER EVENT CAUSED THE SWAP-OUT, AND FLAGS THE        */ 01730000
*/*          USER TO INDICATE WHETHER SUCH PREVIOUS SERVICE IS       */ 01731000
*/*          TO BE CONSIDERED WHEN THE USER IS NEXT SWAPPED-IN.      */ 01732000
*/*                                                                  */ 01733000
*/*    CALLED BY - IRARME13 - QUIESCE COMPLET SYSEVENT ROUTINE       */ 01734000
*/*                                                                  */ 01735000
*/*    INPUT - REG 4 CONTAINS THE ADDRESS OF THE OUCB FOR THE USER   */ 01736000
*/*            WHO IS BEING SWAPPED OUT.                             */ 01737000
*/*          - REG 5 CONTAINS THE USER ASCB ADDRESS.                 */ 01738000
*/*          - REG 14 CONTAINS THE RETURN ADDRESS.                   */ 01739000
*/*          - REG 15 CONTAINS THE IRARMWMQ RTNE ADDRESS.            */ 01740000
*/*          - OUCBRDY IS ZERO IF THE USER ENTERED WAIT STATUS.      */ 01741000
*/*                                                                  */ 01742000
*/*    OUTPT - DEPENDING ON USER STATUS, IRARMWMQ ROUTES CONTROL     */ 01743000
*/*            TO THE IRARMWMO, IRARMWMI, IRARMWM5 ROUTINES, WHICH   */ 01744000
*/*            PERFORM THE ACTUAL UPDATING FOR THAT USER.            */ 01745000
*/*          - OUCBSWC IS UPDATED TO SHOW XACTN WAS SWAPPED.         */ 01746000
*/*                                                                  */ 01747000
*/*    EXIT  - BRANCH ON REGISTER 14.                                */ 01748000
*/*          - THERE IS NO ERROR EXIT OR INDICATION.                 */ 01749000
*/*                                                                  */ 01750000
*/* **************************************************************** */ 01751000
*  /* ? IRACTLEP EPN(WMQ) */                                    02S0390 01752000
*  DCL IRARMWMQ ENTRY INT;                                      02S0390 01753000
*  GEN CODE DEFS(IRARMWMQ) NOEXIT SEQFLOW;                      02S0391 01754000
*                                  /*                                   01755000
         ENTRY IRARMWMQ                                                 01756000
IRARMWMQ DS    0H                                                       01757000
         STM   @00,@14,128+000(@13)    SAVE INVOKING RTNE REGS          01758000
         LA    @12,IRARMWMQ-@PSTART    DISPLACEMENT TO MODULE BASE      01759000
         LCR   @12,@12                 NEGATIVE FOR SUBTRACT            01760000
         ALR   @12,@15                 SETUP MODULE ADDRESSABILITY      01761000
*    IF OUCBRDY = '0'B | OUCBATR = '0'B THEN /* LONG- OR TERM- WAIT  */ 01762000
         TM    OUCBRDY(OUCBPTR),B'10000000'                     02S0392 01763000
         BZ    @RT00392                                         02S0392 01764000
         TM    OUCBATR(OUCBPTR),B'10000000'                     02S0392 01765000
         BZ    @RT00392                                         02S0392 01766000
*      /* 'XCTL' TO WMO SBRTNE WHICH USES SAME REG SAVE AREA AS WMQ  */ 01767000
*      GOTO IRARMWME;               /* DISPOSE OF XACN USER GAVE UP  */ 01768000
*    ELSE                           /* SWAPOUT CAUSED BY SYSTM ACTN  */ 01769000
*      /* RECORD SERVICE PROVIDED USER WHILE IN-CORE                 */ 01770000
*      DO;                                                      02S0394 01771000
*      OUXBPTR = ASCBOUXB;          /* PICK USER CTRL BLOCK EXTENSN  */ 01772000
         L     OUXBPTR,ASCBOUXB(,ASCBPTR)                       02S0395 01773000
*      OUCBSWC = OUCBSWC + ONE;     /* INCREMENT XACTN SWAP-OUT CNT  */ 01774000
         LH    @09,OUCBSWC(,OUCBPTR)                            02S0396 01775000
         AL    @09,ONE                                          02S0396 01776000
         STH   @09,OUCBSWC(,OUCBPTR)                            02S0396 01777000
*      CALL IRARMWMI;               /* UPDAT TRANSACTION STATISTICS  */ 01778000
         BAL   @14,IRARMWMI                                     02S0397 01779000
*      CALL IRARMWM5;               /* CHECK TRANSACTION PERIOD END  */ 01780000
         LA    @15,IRARMWM5                                     02S0398 01781000
         BALR  @14,@15                                          02S0398 01782000
*      CALL IRARMWM7;               /* OBTAIN USER NORMALIZED LEVEL  */ 01783000
         BAL   @14,IRARMWM7                                     02S0399 01784000
*      END;                                                     02S0400 01785000
*  /* ? IRACTLEP ENN(WMQ) */                                    02S0401 01786000
*  GEN CODE EXIT NOSEQFLOW;                                     02S0401 01787000
*                                  /*                                   01788000
         LM    @00,@14,128+000(@13)    RELOAD INVOKING RTNE REGS        01789000
         BR    RTNREG                  RETURN TO INVOKER                01790000
*                                                               01S0402 01791000
*/* RSTORCMP SYSEVENT WORKLOAD ROUTINE                               */ 01792000
*/* **************************************************************** */ 01793000
*/*                                                                  */ 01794000
*/*    ROUTINE NAME - IRARMWMR                                       */ 01795000
*/*                                                                  */ 01796000
*/*    DESCRIPTIVE NAME - WORKLOAD MANAGER RESTORE COMPLETED         */ 01797000
*/*                       SYSEVENT PROCESSING ROUTINE                */ 01798000
*/*                                                                  */ 01799000
*/*    FUNCTION - THE IRARMWMR ROUTINE RECEIVES CONTROL AT THE       */ 01800000
*/*          TIME THAT AN USER HAS BEEN SWAPPED IN, AND IS READY     */ 01801000
*/*          TO BEGIN EXECUTING, SO THAT THE WORKLOAD MANAGER        */ 01802000
*/*          CAN SET UP THE FIELDS USED TO CALCULATE THE SERVICE     */ 01803000
*/*          RATE RECEIVED BY THE USER DURING THE FORTHCOMING        */ 01804000
*/*          IN-CORE RESIDENCY PERIOD.                               */ 01805000
*/*                                                                  */ 01806000
*/*    CALLED BY - IRARME10 - INITIATOR ATTCH SYSEVENT ROUTINE       */ 01807000
*/*                IRARME19 - RESTORE COMPLET SYSEVENT ROUTINE       */ 01808000
*/*                                                                  */ 01809000
*/*    NOTE  - IRARMWMR MAY BE CALLED MULTIPLE TIMES DUE TO THE      */ 01810000
*/*            RESTORE COMPLETE SYSEVENT BEING ISSUED MORE THAN      */ 01811000
*/*            ONCE DURING RECOVERY FROM A FAILURE IN QUIESCE.       */ 01812000
*/*                                                                  */ 01813000
*/*    INPUT - REG 4 CONTAINS THE ADDRESS OF THE OUCB FOR THE USER   */ 01814000
*/*            WHOSE SWAP-IN IS NOW COMPLETE.                        */ 01815000
*/*          - REG 5 CONTAINS THE USER ASCB ADDRESS.                 */ 01816000
*/*          - REG 14 CONTAINS THE RETURN ADDRESS.                   */ 01817000
*/*          - REG 15 CONTAINS THE IRARMWMR RTNE ADDRESS.            */ 01818000
*/*          - OUCBSTR IS SET IF A NEW TRANSACTION IS TO BE STARTED  */ 01819000
*/*            FOR THIS USER.                                        */ 01820000
*/*          - OUCBRTR IS SET IF THE OUT-OF-CORE PERIOD IS NOT TO    */ 01821000
*/*            BE COUNTED TOWARDS THE CURRENT TRANSACTION.           */ 01822000
*/*          - OUCBTMS IS SET TO THE BEG TIME WHEN XACTN AWAKE.      */ 01823000
*/*                                                                  */ 01824000
*/*    OUTPT - DEPENDING ON USER STATUS, IRARMWMR ROUTES CONTROL     */ 01825000
*/*            TO THE IRARMWMN, IRARMWM5, IRARMWMH ROUTINES, WHICH   */ 01826000
*/*            PERFORM THE UPDATING OF THE USER.                     */ 01827000
*/*          - OUCBWMS IS RESET TO SHOW NO SERVICE THIS INTERVAL.    */ 01828000
*/*          - OUCBTMS IS RESET TO SHOW THE INTERVAL START TIME.     */ 01829000
*/*          - OUXBTRT IS UPDATED WITH THE XACTN OUT-OF-CORE TIME.   */ 01830000
*/*                                                                  */ 01831000
*/*    EXIT  - BRANCH ON REGISTER 14.                                */ 01832000
*/*          - THERE IS NO ERROR EXIT OR INDICATION.                 */ 01833000
*/*                                                                  */ 01834000
*/* **************************************************************** */ 01835000
*  /* ? IRACTLEP EPN(WMR) */                                    02S0402 01836000
*  DCL IRARMWMR ENTRY INT;                                      02S0402 01837000
*  GEN CODE DEFS(IRARMWMR) NOEXIT SEQFLOW;                      02S0403 01838000
*                                  /*                                   01839000
         ENTRY IRARMWMR                                                 01840000
IRARMWMR DS    0H                                                       01841000
         STM   @00,@14,000+000(@13)    SAVE INVOKING RTNE REGS          01842000
         LA    @12,IRARMWMR-@PSTART    DISPLACEMENT TO MODULE BASE      01843000
         LCR   @12,@12                 NEGATIVE FOR SUBTRACT            01844000
         ALR   @12,@15                 SETUP MODULE ADDRESSABILITY      01845000
*    OUCBWMS = ZERO;                /* RESET INTERVAL SERVICE ACCUM  */ 01846000
         SLR   @09,@09                                          02S0404 01847000
         ST    @09,OUCBWMS(,OUCBPTR)                            02S0404 01848000
*    OUCBCPU = ZERO ;                /* RESET CPU SERVICE VALUE      */ 01849000
         ST    @09,OUCBCPU(,OUCBPTR)                            02S0405 01850000
*    OUCBIOC = ZERO ;                /* RESET IO SERVICE VALUE       */ 01851000
         ST    @09,OUCBIOC(,OUCBPTR)                            02S0406 01852000
*    OUCBMSO = ZERO ;                /* RESET MSO SERVICE VALUE      */ 01853000
         ST    @09,OUCBMSO(,OUCBPTR)                            02S0407 01854000
*    IF OUCBSTR = '1'B | OUCBATR = '0'B THEN /* XACTN START PENDING  */ 01855000
         TM    OUCBSTR(OUCBPTR),B'01000000'                     02S0408 01856000
         BNZ   @RT00408                                         02S0408 01857000
         TM    OUCBATR(OUCBPTR),B'10000000'                     02S0408 01858000
         BNO   @RT00408                                         02S0408 01859000
*      /* 'XCTL' TO WMN SBRTNE WHICH USES SAME REG SAVE AREA AS WMR  */ 01860000
*      GOTO IRARMWMB;               /* INITIATE A NEW XACTN FOR USR  */ 01861000
*    ELSE                           /* CURR TRANSACTN WILL CONTINUE  */ 01862000
*      /* SETUP USER'S WORKLOAD MNGR FIELDS FOR NEW IN-CORE INTERVAL */ 01863000
*      DO;                                                      02S0410 01864000
*      OUXBPTR = ASCBOUXB;          /* OBTAIN OUXB ADDRESS   @ZA09481*/ 01865000
         L     OUXBPTR,ASCBOUXB(,ASCBPTR)                       02S0411 01866000
*      OUCBRTR = '0'B;              /* RESET XACTN RESUME REQST FLAG */ 01867000
         NI    OUCBRTR(OUCBPTR),B'11101111'                     02S0412 01868000
*      IF OUCBPCH = '1'B THEN       /* PERF PERIOD CHANGED WHILE OUT */ 01869000
         TM    OUCBPCH(OUCBPTR),B'00001000'                     02S0413 01870000
         BNO   @RF00413                                         02S0413 01871000
*        /* UPDATE BEGINNING SERVICE VALUE FOR NEW PERF GROUP PERIOD */ 01872000
*        DO;                                                    02S0414 01873000
*        OUCBPCH = '0'B;            /* RESET PERIOD CHNG OUTSTND FLG */ 01874000
         NI    OUCBPCH(OUCBPTR),B'11110111'                     02S0415 01875000
*        OUXBPRS = OUXBTRS;         /* SAVE NEW PERIOD START SERVICE */ 01876000
         L     @09,OUXBTRS(,OUXBPTR)                            02S0416 01877000
         ST    @09,OUXBPRS(,OUXBPTR)                            02S0416 01878000
*        END;                                                   02S0417 01879000
*      IF RRPACOD ^= INITATT THEN   /* IGNORE TIME PRIOR TO ATTACH   */ 01880000
@RF00413 CLI   RRPACOD(RRPAPTR),10                              02S0418 01881000
         BE    @RF00418                                         02S0418 01882000
*        /* RECORD THE AMOUNT OF TIME SPENT OUT OF CORE BY TRANSACTN */ 01883000
*        DO;                                                    02S0419 01884000
*        OUXBTRT = OUXBTRT + RRPATOD - OUCBTMS; /* ADD OUTCORE TIME  */ 01885000
         L     @09,OUXBTRT(,OUXBPTR)                            02S0420 01886000
         AL    @09,RRPATOD(,RRPAPTR)                            02S0420 01887000
         SL    @09,OUCBTMS(,OUCBPTR)                            02S0420 01888000
         ST    @09,OUXBTRT(,OUXBPTR)                            02S0420 01889000
*        IF RMCTMFA = '1'B THEN     /* WKLD ACTIVITY BEING MEASURED  */ 01890000
         TM    RMCTMFA(RMCTPTR),B'10000000'                     02S0421 01891000
         BNO   @RF00421                                         02S0421 01892000
*          /* INVOKE MEASUREMENT RTNE TO COLLECT XACTN OUTCORE TIME  */ 01893000
*          DO;                                                  02S0422 01894000
*          RRPAWAR = '1'B;          /* INSERT WKLD ACTIVTY RTNE FLAG */ 01895000
         OI    RRPAWAR(RRPAPTR),B'01000000'                     02S0423 01896000
*          /* ? IRACTLCL EPN(WR4) */                            02S0424 01897000
*          CALL RMSBWR4 -> IRARMRTN ;           /* INVOKE WR4 SUBRTN */ 01898000
         L     @15,RMSBWR4(,RMCTPTR)                            02S0424 01899000
         BALR  @14,@15                                          02S0424 01900000
*          RRPAWAR = '0'B;          /* DELETE WKLD ACTIVTY RTNE FLAG */ 01901000
         NI    RRPAWAR(RRPAPTR),B'10111111'                     02S0425 01902000
*          END;                                                 02S0426 01903000
*        END;                                                   02S0427 01904000
@RF00421 DS    0H                                               02S0428 01905000
*      CALL IRARMWMH;               /* RESET INTERVL STRT MEASURMNTS */ 01906000
@RF00418 BAL   @14,IRARMWMH                                     02S0428 01907000
*      CALL IRARMWM5;               /* CHECK FOR PERF PERIOD CHANGE  */ 01908000
         LA    @15,IRARMWM5                                     02S0429 01909000
         BALR  @14,@15                                          02S0429 01910000
*      CALL IRARMWMJ;               /* SET APPLICABLE ALGORITHM INDS */ 01911000
         BAL   @14,IRARMWMJ                                     02S0430 01912000
*      END;                                                     02S0431 01913000
*  /* ? IRACTLEP ENN(WMR) */                                    02S0432 01914000
*  GEN CODE EXIT NOSEQFLOW;                                     02S0432 01915000
*                                  /*                                   01916000
         LM    @00,@14,000+000(@13)    RELOAD INVOKING RTNE REGS        01917000
         BR    RTNREG                  RETURN TO INVOKER                01918000
*                                                               01S0433 01919000
*/* IN-CORE INTERVAL CHANGE SUBROUTINE                               */ 01920000
*/* **************************************************************** */ 01921000
*/*                                                                  */ 01922000
*/*    ROUTINE NAME - IRARMWMI                                       */ 01923000
*/*                                                                  */ 01924000
*/*    DESCRIPTIVE NAME - WORKLOAD MANAGER IN-CORE INTERVAL          */ 01925000
*/*                       CHANGE SUBROUTINE                          */ 01926000
*/*                                                                  */ 01927000
*/*    FUNCTION - THE IRARMWMI SUBROUTINE UPDATES THE TRANSACTION    */ 01928000
*/*          ACCUMULATORS WITH THE SERVICE AND THE TIME RECEIVED     */ 01929000
*/*          BY THE USER DURING THE PRECEDING IN-CORE INTERVAL.      */ 01930000
*/*                                                                  */ 01931000
*/*    CALLED BY - IRARMWMO - USER TRANSACTION COMPLET ROUTINE       */ 01932000
*/*                IRARMWMQ - USER TRANSACTION QUIESCE ROUTINE       */ 01933000
*/*                                                                  */ 01934000
*/*                                                                  */ 01935000
*/*    ROUTINE NAME - IRARMWMH                                       */ 01936000
*/*                                                                  */ 01937000
*/*    DESCRIPTIVE NAME - WORKLOAD MANAGER MEASUREMENT INTERVAL      */ 01938000
*/*                       RESET SUBROUTINE                           */ 01939000
*/*                                                                  */ 01940000
*/*    FUNCTION - THE IRARMWMH SUBROUTINE RESETS THE WORKLOAD        */ 01941000
*/*          MANAGER MEASUREMENT INTERVAL START VALUE FIELDS TO      */ 01942000
*/*          BEGIN A NEW WORKLOAD MANAGER MEASUREMENT INTERVAL.      */ 01943000
*/*                                                                  */ 01944000
*/*    CALLED BY - IRARMWMN - USER TRANSACTION STARTUP ROUTINE       */ 01945000
*/*                IRARMWMR - USER TRANSACTION RESUMPT ROUTINE       */ 01946000
*/*                                                                  */ 01947000
*/*                                                                  */ 01948000
*/*    INPUT - REG 4 CONTAINS THE ADDRESS OF THE OUCB FOR THE USER   */ 01949000
*/*            WHOSE MEASUREMENT INTERVAL IS TO BE CHANGED/RESET.    */ 01950000
*/*          - REG 5 CONTAINS THE USER ASCB BLOCK ADDRESS.           */ 01951000
*/*          - REG 6 CONTAINS THE USER OUXB BLOCK ADDRESS.           */ 01952000
*/*          - REG 14 CONTAINS THE RETURN ADDRESS.                   */ 01953000
*/*          - OUCBTMS CONTAINS THE BEG TIME OF THE CURR NTRVL.      */ 01954000
*/*                                                                  */ 01955000
*/*    OUTPT - SEE FUNCTION.                                         */ 01956000
*/*                                                                  */ 01957000
*/*    EXIT  - BRANCH ON REGISTER 14.                                */ 01958000
*/*          - THERE IS NO ERROR EXIT OR INDICATION.                 */ 01959000
*/*                                                                  */ 01960000
*/* **************************************************************** */ 01961000
*IRARMWMI: PROC OPTIONS(NOSAVE,NOSAVEAREA,NOENTREG,RETREG,NOPARMREG);   01962000
IRARMWMI DS    0H                                               02S0434 01963000
*    PMRO = RTNREG;                 /* SAVE RETURN REG CONTENTS      */ 01964000
         LR    PMRO,RTNREG                                      02S0434 01965000
*    /* ? IRACTLCL EPN(WM1) */                                  02S0435 01966000
*    CALL RMSBWM1 -> IRARMRTN ;                 /* INVOKE WM1 SUBRTN */ 01967000
         L     @15,RMSBWM1(,RMCTPTR)                            02S0435 01968000
         BALR  @14,@15                                          02S0435 01969000
*    OUXBTRS = OUXBTRS + OUCBWMS;   /* ADD SERVICE TO TRANSACTION    */ 01970000
         L     @09,OUXBTRS(,OUXBPTR)                            02S0436 01971000
         AL    @09,OUCBWMS(,OUCBPTR)                            02S0436 01972000
         ST    @09,OUXBTRS(,OUXBPTR)                            02S0436 01973000
*    OUXBTRT = OUXBTRT + (RRPATOD - OUCBTMS); /* ADD TIME TO XACN    */ 01974000
         L     @09,RRPATOD(,RRPAPTR)                            02S0437 01975000
         SL    @09,OUCBTMS(,OUCBPTR)                            02S0437 01976000
         L     @08,OUXBTRT(,OUXBPTR)                            02S0437 01977000
         ALR   @08,@09                                          02S0437 01978000
         ST    @08,OUXBTRT(,OUXBPTR)                            02S0437 01979000
*    OUXBTRR = OUXBTRR + (RRPATOD - OUCBTMS); /* ADD RESIDNT TIME    */ 01980000
         AL    @09,OUXBTRR(,OUXBPTR)                            02S0438 01981000
         ST    @09,OUXBTRR(,OUXBPTR)                            02S0438 01982000
*    IF RMCTMFA = '1'B THEN         /* WORKLOAD ACTIVITY MEASURED    */ 01983000
         TM    RMCTMFA(RMCTPTR),B'10000000'                     02S0439 01984000
         BNO   @RF00439                                         02S0439 01985000
*      /* UPDATE WORKLOAD ACTIVITY MEASUREMENT REPORT STATISTICS     */ 01986000
*      DO;                                                      02S0440 01987000
*      RRPAWAR = '1'B;              /* INSERT WKLD ACTIVTY RTNE FLAG */ 01988000
         OI    RRPAWAR(RRPAPTR),B'01000000'                     02S0441 01989000
*      /* ? IRACTLCL EPN(WR4) */                                02S0442 01990000
*      CALL RMSBWR4 -> IRARMRTN ;               /* INVOKE WR4 SUBRTN */ 01991000
         L     @15,RMSBWR4(,RMCTPTR)                            02S0442 01992000
         BALR  @14,@15                                          02S0442 01993000
*      RRPAWAR = '0'B;              /* DELETE WKLD ACTIVTY RTNE FLAG */ 01994000
         NI    RRPAWAR(RRPAPTR),B'10111111'                     02S0443 01995000
*      END;                                                     02S0444 01996000
*    RTNREG = PMRO;                 /* RESTORE RETURN REG CONTENTS   */ 01997000
@RF00439 LR    RTNREG,PMRO                                      02S0445 01998000
*/*    ENTRY WHEN DONT NEED TO ACCUM DATA, JUST START INTERVAL ANEW  */ 01999000
*IRARMWMH: /* SUBROUTINE TO RESET WORKLOAD MANAGER INTERVAL          */ 02000000
*      /* SAVE EXTRA CALL BY CODING AS ENTRY INSTEAD OF SEPARAT PROC */ 02001000
*      ENTRY;                                                   02S0446 02002000
         B     @EC00446                                         02S0446 02003000
IRARMWMH DS    0H                                               02S0446 02004000
@EC00446 DS    0H                                               02S0447 02005000
*    WMSTPTR = RMCTWMST;            /* PICK WLM SPECIFICATION TABLE  */ 02006000
         L     WMSTPTR,RMCTWMST(,RMCTPTR)                       02S0447 02007000
*    WPGDPTR = WMSTPGDT + OUCBWMG;  /* PICK CURR PERF GRP DESCRIPTOR */ 02008000
         LH    WPGDPTR,OUCBWMG(,OUCBPTR)                        02S0448 02009000
         AL    WPGDPTR,WMSTPGDT(,WMSTPTR)                       02S0448 02010000
*    IF OUCBPVL = '0'B THEN         /* USER SUBJECT TO WLM ANALYSIS  */ 02011000
         TM    OUCBPVL(OUCBPTR),B'00000100'                     02S0449 02012000
         BNZ   @RF00449                                         02S0449 02013000
*      OUCBTMW = MAX(ONE,OUCBTMS);  /* INSERT NONZERO STARTING TIME  */ 02014000
         L     @09,ONE                                          02S0450 02015000
         L     @08,OUCBTMS(,OUCBPTR)                            02S0450 02016000
         CLR   @09,@08                                          02S0450 02017000
         BNL   *+6                                                      02018000
         LR    @09,@08                                          02S0450 02019000
         ST    @09,OUCBTMW(,OUCBPTR)                            02S0450 02020000
*    OUCBTMS = RRPATOD;             /* SAVE ACTUAL LAST ACTION TIME  */ 02021000
@RF00449 L     @09,RRPATOD(,RRPAPTR)                            02S0451 02022000
         ST    @09,OUCBTMS(,OUCBPTR)                            02S0451 02023000
*    OUXBCPS = ASCBEJST;            /* RESET CPU SERVICE BASE VALUE  */ 02024000
         MVC   OUXBCPS(8,OUXBPTR),ASCBEJST(ASCBPTR)             02S0452 02025000
*    OUXBIOS = ASCBIOSM;            /* RESET IOM SERVICE BASE VALUE  */ 02026000
         LH    @09,ASCBIOSM(,ASCBPTR)                           02S0453 02027000
         STH   @09,OUXBIOS(,OUXBPTR)                            02S0453 02028000
*    OUXBIOSM = OUCBIOSM;  /*RESET SMF BASE EXCP COUNT       @ZA10808*/ 02029000
         L     @09,OUCBIOSM(,OUCBPTR)                           02S0454 02030000
         ST    @09,OUXBIOSM(,OUXBPTR)                           02S0454 02031000
*    OUXBMSS = OUCBPSS;             /* RESET MSO BASE SERVICE VALUE  */ 02032000
         MVC   OUXBMSS(8,OUXBPTR),OUCBPSS(OUCBPTR)              02S0455 02033000
*    END IRARMWMI;                                              02S0456 02034000
@EL00003 DS    0H                                               02S0456 02035000
@EF00003 DS    0H                                               02S0456 02036000
@ER00003 BR    @14                                              02S0456 02037000
*                                                               01S0457 02038000
*/* ALGORITHM APPLICABILITY DETERMINATION SUBROUTINE                 */ 02039000
*/* **************************************************************** */ 02040000
*/*                                                                  */ 02041000
*/*    ROUTINE NAME - IRARMWMJ                                       */ 02042000
*/*                                                                  */ 02043000
*/*    DESCRIPTIVE NAME - ROUTINE TO DETERMINE THE SCOPE OF          */ 02044000
*/*          APPLICABILITY OF ANALYSIS PROCESSING TO A USER          */ 02045000
*/*                                                                  */ 02046000
*/*    FUNCTION - THE IRARMWMJ ROUTINE EXAMINES THE CURRENT          */ 02047000
*/*          SWAPPABILITY STATUS AND THE PERFORMANCE SPECI-          */ 02048000
*/*          FICATION FOR AN USER.  IT INDICATES IF THE RESOURCE     */ 02049000
*/*          MANAGER ALGORITHMS ARE APPLICABLE TO THIS USER.         */ 02050000
*/*                                                                  */ 02051000
*/*    CALLED BY - IRARMWMK - WLM DONTSWAP/OKSWAP SERVICE UPDT RTNE  */ 02052000
*/*                IRARMWMN - USER TRANSACTION STARTUP ROUTINE       */ 02053000
*/*                IRARMWMO - USER TRANSACTION SUSPEND ROUTINE       */ 02054000
*/*                IRARMWMR - USER TRANSACTION RESUMPT ROUTINE       */ 02055000
*/*                IRARMWM5 - PERFORMANCE PERIOD CHECK SBRTINE       */ 02056000
*/*                                                                  */ 02057000
*/*    INPUT - REG 4 CONTAINS THE ADDRESS OF THE OUCB FOR THE        */ 02058000
*/*            USER WHOSE ANALYSIS APPLIC IS BEING DETERMINED.       */ 02059000
*/*          - REG 14 CONTAINS THE RETURN ADDRESS.                   */ 02060000
*/*          - REG 15 CONTAINS THE IRARMWMK RTNE ADDRESS.            */ 02061000
*/*          - OUCBNSW INDICATES IF THE USER IS NON-SWAPPABLE.       */ 02062000
*/*          - OUCBNPG INDICATES THE PERF GROUP FOR THE USER.        */ 02063000
*/*          - OUCBPGP INDICATES THE PERF PERIOD FOR THE USER.       */ 02064000
*/*          - WPGDRTB INDICATES THE RESPONSE/THROUGHPUT BIAS.       */ 02065000
*/*                                                                  */ 02066000
*/*    OUTPT - OUCBRMA IS SET ON IF RESOURCE ALGORITHM RECOM-        */ 02067000
*/*            MENDATIONS ARE TO BE SOLICITED FOR THIS USER.         */ 02068000
*/*                                                                  */ 02069000
*/*    EXIT  - BRANCH ON REGISTER 14.                                */ 02070000
*/*          - THERE IS NO ERROR EXIT OR INDICATION.                 */ 02071000
*/*                                                                  */ 02072000
*/* **************************************************************** */ 02073000
*IRARMWMJ: PROC OPTIONS(NOSAVE,NOSAVEAREA,NOENTREG,RETREG,NOPARMREG);   02074000
IRARMWMJ DS    0H                                               02S0458 02075000
*    RFY (WKRE) UNRSTD;                                         02S0458 02076000
*    STPR = RTNREG;                 /* SAVE RETURN REG CONTENTS      */ 02077000
         LR    STPR,RTNREG                                      02S0459 02078000
*    /* NON-SWAPPABLE USERS ARE EXCLUDED FROM SWAP ANALYSIS          */ 02079000
*    OUCBRMA = '0'B;                /* RESET RESOURCE ANALYSIS FLG   */ 02080000
         NI    OUCBRMA(OUCBPTR),B'11011111'                     02S0460 02081000
*    IF OUCBNSW = '0'B THEN /* USER  WKLD CONTROLLED */         02S0461 02082000
         TM    OUCBNSW(OUCBPTR),B'10000000'                     02S0461 02083000
         BNZ   @RF00461                                         02S0461 02084000
*      DO;                                                      02S0462 02085000
*      WMSTPTR = RMCTWMST;          /* PICK WLM SPECIFICATION TABLE  */ 02086000
         L     WMSTPTR,RMCTWMST(,RMCTPTR)                       02S0463 02087000
*      WPGDPTR = WMSTPGDT + WPGVTENT; /* PICK PERF GROUP DESCRIPTOR  */ 02088000
         SLR   @10,@10                                          02S0464 02089000
         IC    @10,OUCBNPG(,OUCBPTR)                            02S0464 02090000
         ALR   @10,@10                                          02S0464 02091000
         AL    @10,WMSTPGVT(,WMSTPTR)                           02S0464 02092000
         LH    WPGDPTR,WPGVTENT(,@10)                           02S0464 02093000
         AL    WPGDPTR,WMSTPGDT(,WMSTPTR)                       02S0464 02094000
*      WPGPPTR = WPGDPTR + OUCBPGP; /* PICK CURR PERF GRP PERIOD   */   02095000
         LR    WPGPPTR,WPGDPTR                                  02S0465 02096000
         SLR   @10,@10                                          02S0465 02097000
         IC    @10,OUCBPGP(,OUCBPTR)                            02S0465 02098000
         ALR   WPGPPTR,@10                                      02S0465 02099000
*      IF WPGPRTB = '1'B THEN     /* THROUGHPUT BIAS INDICATED     */   02100000
         TM    WPGPRTB(WPGPPTR),B'00000001'                     02S0466 02101000
         BNO   @RF00466                                         02S0466 02102000
*        OUCBRMA = '1'B;          /* RESOURCE ALGORITHMS APPLIC    */   02103000
         OI    OUCBRMA(OUCBPTR),B'00100000'                     02S0467 02104000
*      ELSE                       /* IF RTB=0 BE SURE THAT  @ZA26908*/  02105000
*        DO;                      /* LOAD BALANCER RECOMMEN @ZA26908*/  02106000
         B     @RC00466                                         02S0468 02107000
@RF00466 DS    0H                                               02S0469 02108000
*        OUCBCRV=ZERO;            /* DATION VALUES ARE      @ZA26908*/  02109000
         SLR   @10,@10                                          02S0469 02110000
         STH   @10,OUCBCRV(,OUCBPTR)                            02S0469 02111000
*        OUCBIRV=ZERO;            /* ZERO                   @ZA26908*/  02112000
         STH   @10,OUCBIRV(,OUCBPTR)                            02S0470 02113000
*        END;                     /*                        @ZA26908*/  02114000
*      END;                                                     02S0472 02115000
*    ELSE                         /* IF NONSWAPPABLE MEMORY @ZA26908*/  02116000
*      DO;                        /* LOAD BALANCER RECOMEN  @ZA26908*/  02117000
         B     @RC00461                                         02S0473 02118000
@RF00461 DS    0H                                               02S0474 02119000
*      OUCBCRV=ZERO;              /* DATION VALUES SHOULD   @ZA26908*/  02120000
         SLR   @10,@10                                          02S0474 02121000
         STH   @10,OUCBCRV(,OUCBPTR)                            02S0474 02122000
*      OUCBIRV=ZERO;              /* BE ZERO                @ZA26908*/  02123000
         STH   @10,OUCBIRV(,OUCBPTR)                            02S0475 02124000
*      END;                       /*                        @ZA26908*/  02125000
*    RTNREG = STPR;                 /* RESTORE RETURN REG CONTENTS   */ 02126000
@RC00461 LR    RTNREG,STPR                                      02S0477 02127000
*    RFY (WKRE) RSTD;                                           02S0478 02128000
*    END IRARMWMJ;                                              02S0479 02129000
@EL00004 DS    0H                                               02S0479 02130000
@EF00004 DS    0H                                               02S0479 02131000
@ER00004 BR    @14                                              02S0479 02132000
*                                                               01S0480 02133000
*/* WLM DONTSWAP/OKSWAP USER ANALYSIS ROUTINE                        */ 02134000
*/* ******************************************************************/ 02135000
*/*                                                                  */ 02136000
*/*    ROUTINE NAME - IRARMWMK                                       */ 02137000
*/*                                                                  */ 02138000
*/*    DESCRIPTIVE NAME - WLM DONTSWAP/OKSWAP USER ANALYSY ROUTINE   */ 02139000
*/*                                                                  */ 02140000
*/*    FUNCTION - THE IRARMWMK  ROUTINE CALCULATES THE CURRENT       */ 02141000
*/*               SERVICE AND INSURES THAT THE USER IS IN THE        */ 02142000
*/*               CORRECT PERFORMANCE GROUP PERIOD. APPLICABLE       */ 02143000
*/*               ALGORITHM INDICATORS ARE SET BASED ON THE NEW      */ 02144000
*/*               SWAPPABILITY STATUS OF THE USER.                   */ 02145000
*/*    CALLED BY - IRARME41 - USER DON'T SWAP SYSEVENT ROUTINE       */ 02146000
*/*                IRARME42 - USER OK TO SWAP SYSEVENT ROUTINE       */ 02147000
*/*                                                                  */ 02148000
*/*    INPUT - REG 4 CONTAINS THA ADDRESS OF THE OUCB FOR THE USER   */ 02149000
*/*            TO BE EVALUATED.                                      */ 02150000
*/*          - REG 14 CONTAINS THE RETURN ADDRESS.                   */ 02151000
*/*          - REG 15 CONTAINS THE IRARMWMK ROUTINE ADDRESS          */ 02152000
*/*                                                                  */ 02153000
*/*    OUTPUT - SEE FUNCTION                                         */ 02154000
*/*                                                                  */ 02155000
*/*    EXIT - BRANCH ON REGISTER 14.                                 */ 02156000
*/*         - THERE IS NO ERROR EXIT OR INDICATION.                  */ 02157000
*/*                                                                  */ 02158000
*/* ******************************************************************/ 02159000
*  /* ? IRACTLEP EPN(WMK) */                                    02S0480 02160000
*  DCL IRARMWMK ENTRY INT;                                      02S0480 02161000
*  GEN CODE DEFS(IRARMWMK) NOEXIT SEQFLOW;                      02S0481 02162000
*                                  /*                                   02163000
         ENTRY IRARMWMK                                                 02164000
IRARMWMK DS    0H                                                       02165000
         STM   @00,@14,128+000(@13)    SAVE INVOKING RTNE REGS          02166000
         LA    @12,IRARMWMK-@PSTART    DISPLACEMENT TO MODULE BASE      02167000
         LCR   @12,@12                 NEGATIVE FOR SUBTRACT            02168000
         ALR   @12,@15                 SETUP MODULE ADDRESSABILITY      02169000
*IF OUCBTMW ^= ZERO THEN            /* TRANSACTION INTERVAL EXISTS   */ 02170000
         L     @09,OUCBTMW(,OUCBPTR)                            02S0482 02171000
         LTR   @09,@09                                          02S0482 02172000
         BZ    @RF00482                                         02S0482 02173000
*  DO ;                                                         02S0483 02174000
*  IF OUCBOUT = '0'B & OUCBGOB = '0'B & /* USER RECIEVING SERVICE    */ 02175000
*     OUCBGOO = '0'B & OUCBGOI = '0'B THEN /* USER NOT TRANSITIONING */ 02176000
         TM    OUCBOUT(OUCBPTR),B'11100100'                     02S0484 02177000
         BNZ   @RF00484                                         02S0484 02178000
*    /* OBTAIN USER SERVICE                                          */ 02179000
*      /* ? IRACTLCL EPN(WM1) */                                02S0485 02180000
*      CALL RMSBWM1 -> IRARMRTN ;               /* INVOKE WM1 SUBRTN */ 02181000
         L     @15,RMSBWM1(,RMCTPTR)                            02S0485 02182000
         BALR  @14,@15                                          02S0485 02183000
*  /* VERIFY CURRENT PERFORMANCE GROUP PERIOD                        */ 02184000
*  CALL IRARMWM5 ;                                              02S0486 02185000
@RF00484 LA    @15,IRARMWM5                                     02S0486 02186000
         BALR  @14,@15                                          02S0486 02187000
*  END ;                                                        02S0487 02188000
*/* SET APPLICABLE ALGORITHM INDICATORS                              */ 02189000
*CALL IRARMWMJ ;                                                02S0488 02190000
@RF00482 BAL   @14,IRARMWMJ                                     02S0488 02191000
*  /* ? IRACTLEP ENN(WMK) */                                    02S0489 02192000
*  GEN CODE EXIT NOSEQFLOW;                                     02S0489 02193000
*                                  /*                                   02194000
         LM    @00,@14,128+000(@13)    RELOAD INVOKING RTNE REGS        02195000
         BR    RTNREG                  RETURN TO INVOKER                02196000
*                                                               01S0490 02197000
*        END IRARMWLM                                           01S0490 02198000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 02199000
*/*%INCLUDE SYSUT5  (IRAWLMDT)                                        * 02200000
*/*%INCLUDE SYSLIB  (IRACNSMP)                                        * 02201000
*/*%INCLUDE SYSLIB  (IRARMCT )                                        * 02202000
*/*%INCLUDE SYSLIB  (IRACCT  )                                        * 02203000
*/*%INCLUDE SYSLIB  (IRAICT  )                                        * 02204000
*/*%INCLUDE SYSLIB  (IRAMCT  )                                        * 02205000
*/*%INCLUDE SYSLIB  (IRARCT  )                                        * 02206000
*/*%INCLUDE SYSLIB  (IRARMPT )                                        * 02207000
*/*%INCLUDE SYSLIB  (IRARMCA )                                        * 02208000
*/*%INCLUDE SYSLIB  (IRARMEX )                                        * 02209000
*/*%INCLUDE SYSLIB  (IRARMSB )                                        * 02210000
*/*%INCLUDE SYSLIB  (IRAEPAT )                                        * 02211000
*/*%INCLUDE SYSLIB  (IRAEPDT )                                        * 02212000
*/*%INCLUDE SYSLIB  (IRAEPST )                                        * 02213000
*/*%INCLUDE SYSLIB  (IRARRPA )                                        * 02214000
*/*%INCLUDE SYSLIB  (IHAASCB )                                        * 02215000
*/*%INCLUDE SYSLIB  (IRAOUCB )                                        * 02216000
*/*%INCLUDE SYSLIB  (IHAOUXB )                                        * 02217000
*/*%INCLUDE SYSLIB  (IRADMDT )                                        * 02218000
*/*%INCLUDE SYSLIB  (IRAWMST )                                        * 02219000
*/*%INCLUDE SYSLIB  (IRAWPGDT)                                        * 02220000
*/*%INCLUDE SYSLIB  (IRAWPODT)                                        * 02221000
*/*%INCLUDE SYSLIB  (IHAWSAVT)                                        * 02222000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        * 02223000
*/*%INCLUDE SYSLIB  (IHALCCA )                                        * 02224000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 02225000
*/*%INCLUDE SYSLIB  (IHAPVT  )                                        * 02226000
*/*%INCLUDE SYSLIB  (IRAREGS )                                        * 02227000
*/*%INCLUDE SYSUT5  (IRARMWM1)                                        * 02228000
*/*%INCLUDE SYSUT5  (IRARMWM2)                                        * 02229000
*/*%INCLUDE SYSUT5  (IRARMWM3)                                        * 02230000
*/*%INCLUDE SYSUT5  (IRARMWM4)                                        * 02231000
*/*%INCLUDE SYSUT5  (IRARMWM5)                                        * 02232000
*/*%INCLUDE SYSUT5  (IRARMWM7)                                        * 02233000
*/*%INCLUDE SYSUT5  (IRARMHIT)                                        * 02234000
*/*%INCLUDE SYSUT5  (IRARMWMN)                                        * 02235000
*/*%INCLUDE SYSUT5  (IRARMWMO)                                        * 02236000
*/*%INCLUDE SYSUT5  (IRARMWMQ)                                        * 02237000
*/*%INCLUDE SYSUT5  (IRARMWMR)                                        * 02238000
*/*%INCLUDE SYSUT5  (IRARMWMI)                                        * 02239000
*/*%INCLUDE SYSUT5  (IRARMWMJ)                                        * 02240000
*/*%INCLUDE SYSUT5  (IRARMWMK)                                        * 02241000
*;                                                              01S0490 02242000
@DATA    DS    0H                                                       02243000
@DATD    DSECT                                                          02244000
         DS    0F                                                       02245000
IRARMWLM CSECT                                                          02246000
         DS    0F                                                       02247000
@CF00036 DC    F'4'                                                     02248000
@CF02217 DC    XL4'0000FFFF'                                            02249000
@DATD    DSECT                                                          02250000
         DS    0D                                                       02251000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                02252000
@ENDDATD EQU   *                                                        02253000
IRARMWLM CSECT                                                          02254000
         DS    0F                                                       02255000
@SIZDATD DC    AL1(0)                                                   02256000
         DC    AL3(@ENDDATD-@DATD)                                      02257000
         DS    0D                                                       02258000
HWORDMSK DC    XL4'0000FFFF'                                            02259000
ONE      DC    F'1'                                                     02260000
RMTMFCT  DC    H'976'                                                   02261000
@CC02243 DC    C'OUCB'                                                  02262000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02263000
@01      EQU   01                                                       02264000
@02      EQU   02                                                       02265000
@03      EQU   03                                                       02266000
@04      EQU   04                                                       02267000
@05      EQU   05                                                       02268000
@06      EQU   06                                                       02269000
@07      EQU   07                                                       02270000
@08      EQU   08                                                       02271000
@09      EQU   09                                                       02272000
@10      EQU   10                                                       02273000
@11      EQU   11                                                       02274000
@12      EQU   12                                                       02275000
@13      EQU   13                                                       02276000
@14      EQU   14                                                       02277000
@15      EQU   15                                                       02278000
RMCTPTR  EQU   @02                                                      02279000
RRPAPTR  EQU   @03                                                      02280000
ASCBPTR  EQU   @05                                                      02281000
OUCBPTR  EQU   @04                                                      02282000
OUXBPTR  EQU   @06                                                      02283000
WMSTPTR  EQU   @01                                                      02284000
WPGDPTR  EQU   @07                                                      02285000
WPGPPTR  EQU   @11                                                      02286000
WPGLPTR  EQU   @15                                                      02287000
WPODPTR  EQU   @01                                                      02288000
R0       EQU   @00                                                      02289000
R1       EQU   @01                                                      02290000
SVEREG   EQU   @13                                                      02291000
RTNREG   EQU   @14                                                      02292000
NTRREG   EQU   @15                                                      02293000
RTNCOD   EQU   @15                                                      02294000
STPR     EQU   @05                                                      02295000
PMRE     EQU   @06                                                      02296000
PMRO     EQU   @07                                                      02297000
SVRE     EQU   @06                                                      02298000
SVRO     EQU   @07                                                      02299000
WKRE     EQU   @10                                                      02300000
WKRO     EQU   @11                                                      02301000
VLRO     EQU   @11                                                      02302000
R14      EQU   @14                                                      02303000
R15      EQU   @15                                                      02304000
VLRE     EQU   @10                                                      02305000
PSA      EQU   0                                                        02306000
FLCRNPSW EQU   PSA                                                      02307000
FLCROPSW EQU   PSA+8                                                    02308000
FLCICCW2 EQU   PSA+16                                                   02309000
FLCCVT   EQU   FLCICCW2                                                 02310000
PSAEEPSW EQU   PSA+132                                                  02311000
PSAESPSW EQU   PSA+136                                                  02312000
FLCSVILC EQU   PSAESPSW+1                                               02313000
PSAEPPSW EQU   PSA+140                                                  02314000
FLCPIILC EQU   PSAEPPSW+1                                               02315000
FLCPICOD EQU   PSAEPPSW+2                                               02316000
PSAPICOD EQU   FLCPICOD+1                                               02317000
FLCTEA   EQU   PSAEPPSW+4                                               02318000
FLCPER   EQU   PSA+152                                                  02319000
FLCMCLA  EQU   PSA+168                                                  02320000
FLCIOEL  EQU   FLCMCLA+4                                                02321000
FLCIOA   EQU   FLCMCLA+16                                               02322000
FLCFSA   EQU   FLCMCLA+80                                               02323000
PSALCCAV EQU   PSA+528                                                  02324000
PSASUPER EQU   PSA+552                                                  02325000
PSASUP1  EQU   PSASUPER                                                 02326000
PSASUP2  EQU   PSASUPER+1                                               02327000
PSASUP3  EQU   PSASUPER+2                                               02328000
PSASUP4  EQU   PSASUPER+3                                               02329000
PSACLHT  EQU   PSA+640                                                  02330000
PSALKSA  EQU   PSA+696                                                  02331000
PSAHLHI  EQU   PSA+760                                                  02332000
PSADSSFL EQU   PSA+836                                                  02333000
PSADSSF1 EQU   PSADSSFL                                                 02334000
PSADSSF3 EQU   PSADSSFL+2                                               02335000
PSADSSF4 EQU   PSADSSFL+3                                               02336000
PSARSVT  EQU   PSA+896                                                  02337000
RMCT     EQU   0                                                        02338000
RMCTWMST EQU   RMCT+24                                                  02339000
RMCTRMSA EQU   RMCT+32                                                  02340000
RMCTADJC EQU   RMCT+64                                                  02341000
RMCTOTQE EQU   RMCT+108                                                 02342000
RMCTINQE EQU   RMCT+112                                                 02343000
RMCTFLGS EQU   RMCT+148                                                 02344000
RMCTMFA  EQU   RMCTFLGS                                                 02345000
RMCTDMDT EQU   RMCT+180                                                 02346000
CCT      EQU   RMCT+192                                                 02347000
CCCAPMDP EQU   CCT+40                                                   02348000
CCCAPGDP EQU   CCT+42                                                   02349000
CCTFLG1  EQU   CCT+124                                                  02350000
ICT      EQU   RMCT+320                                                 02351000
ICTFLAGS EQU   ICT+84                                                   02352000
MCT      EQU   RMCT+408                                                 02353000
MCTSFLGS EQU   MCT+64                                                   02354000
MCTOFLGS EQU   MCT+65                                                   02355000
RCT      EQU   RMCT+504                                                 02356000
RMPT     EQU   RMCT+592                                                 02357000
RMPTWMET EQU   RMPT+48                                                  02358000
RMCA     EQU   RMCT+664                                                 02359000
RMCAFLGS EQU   RMCA+36                                                  02360000
RMCAISV  EQU   RMCA+70                                                  02361000
RMCASRC  EQU   RMCA+124                                                 02362000
RMEX     EQU   RMCT+832                                                 02363000
RMEPBEVT EQU   RMEX                                                     02364000
RMEPBCTL EQU   RMEX+16                                                  02365000
RMSB     EQU   RMCT+896                                                 02366000
RMSBCRL  EQU   RMSB+36                                                  02367000
RMSBCRN  EQU   RMSB+40                                                  02368000
RMSBWM5  EQU   RMSB+48                                                  02369000
RMSBWM1  EQU   RMSB+52                                                  02370000
RMSBWM4  EQU   RMSB+56                                                  02371000
RMSBWMO  EQU   RMSB+68                                                  02372000
RMSBWR4  EQU   RMSB+88                                                  02373000
RMSBWR6  EQU   RMSB+92                                                  02374000
EPAT     EQU   RMCT+1016                                                02375000
RMEPBCAP EQU   EPAT                                                     02376000
EPDT     EQU   RMCT+1416                                                02377000
RMEPBRPS EQU   EPDT+80                                                  02378000
EPST     EQU   RMCT+1512                                                02379000
RMEPBWM3 EQU   EPST                                                     02380000
RMEPBIL3 EQU   EPST+16                                                  02381000
RMEPBCL3 EQU   EPST+32                                                  02382000
RMEPBCSO EQU   EPST+48                                                  02383000
RMEPBCSI EQU   EPST+64                                                  02384000
RRPA     EQU   0                                                        02385000
RRPAINC  EQU   RRPA                                                     02386000
RRPAVPGN EQU   RRPAINC+2                                                02387000
RRPAFLG0 EQU   RRPAVPGN                                                 02388000
RRPACOD  EQU   RRPAINC+3                                                02389000
RRPAINP  EQU   RRPA+4                                                   02390000
RRPAFLG  EQU   RRPA+8                                                   02391000
RRPAWAR  EQU   RRPAFLG+1                                                02392000
RRPATOD  EQU   RRPA+12                                                  02393000
RRPAINS  EQU   RRPA+16                                                  02394000
RRPAEPA  EQU   RRPA+20                                                  02395000
ASCB     EQU   0                                                        02396000
ASCBSUPC EQU   ASCB+16                                                  02397000
ASCBIOSM EQU   ASCB+40                                                  02398000
ASCBRSM  EQU   ASCB+52                                                  02399000
ASCBRSMF EQU   ASCBRSM                                                  02400000
ASCBEJST EQU   ASCB+64                                                  02401000
ASCBFW1  EQU   ASCB+100                                                 02402000
ASCBRCTF EQU   ASCBFW1+2                                                02403000
ASCBFLG1 EQU   ASCBFW1+3                                                02404000
ASCBDSP1 EQU   ASCB+114                                                 02405000
ASCBFLG2 EQU   ASCB+115                                                 02406000
ASCBLKGP EQU   ASCB+128                                                 02407000
ASCBOUXB EQU   ASCB+148                                                 02408000
ASCBSRQ  EQU   ASCB+180                                                 02409000
ASCBSRQ1 EQU   ASCBSRQ                                                  02410000
ASCBSRQ2 EQU   ASCBSRQ+1                                                02411000
ASCBSRQ3 EQU   ASCBSRQ+2                                                02412000
ASCBSRQ4 EQU   ASCBSRQ+3                                                02413000
OUCB     EQU   0                                                        02414000
OUCBNAME EQU   OUCB                                                     02415000
OUCBFWD  EQU   OUCB+4                                                   02416000
OUCBTMA  EQU   OUCB+12                                                  02417000
OUCBQFL  EQU   OUCB+16                                                  02418000
OUCBGOO  EQU   OUCBQFL                                                  02419000
OUCBGOI  EQU   OUCBQFL                                                  02420000
OUCBGOB  EQU   OUCBQFL                                                  02421000
OUCBOFF  EQU   OUCBQFL                                                  02422000
OUCBOUT  EQU   OUCBQFL                                                  02423000
OUCBSFL  EQU   OUCB+17                                                  02424000
OUCBNSW  EQU   OUCBSFL                                                  02425000
OUCBINV  EQU   OUCBSFL                                                  02426000
OUCBPVL  EQU   OUCBSFL                                                  02427000
OUCBENQ  EQU   OUCBSFL                                                  02428000
OUCBYFL  EQU   OUCB+18                                                  02429000
OUCBLOG  EQU   OUCBYFL                                                  02430000
OUCBAFL  EQU   OUCB+19                                                  02431000
OUCBAPG  EQU   OUCBAFL                                                  02432000
OUCBRMA  EQU   OUCBAFL                                                  02433000
OUCBTFL  EQU   OUCB+20                                                  02434000
OUCBATR  EQU   OUCBTFL                                                  02435000
OUCBSTR  EQU   OUCBTFL                                                  02436000
OUCBNTR  EQU   OUCBTFL                                                  02437000
OUCBRTR  EQU   OUCBTFL                                                  02438000
OUCBPCH  EQU   OUCBTFL                                                  02439000
OUCBMAR  EQU   OUCBTFL                                                  02440000
OUCBINP  EQU   OUCBTFL                                                  02441000
OUCBINC  EQU   OUCBTFL                                                  02442000
OUCBEFL  EQU   OUCB+21                                                  02443000
OUCBTRM  EQU   OUCBEFL                                                  02444000
OUCBCIM  EQU   OUCBEFL                                                  02445000
OUCBUFL  EQU   OUCB+23                                                  02446000
OUCBNPG  EQU   OUCB+24                                                  02447000
OUCBNDP  EQU   OUCB+26                                                  02448000
OUCBPGP  EQU   OUCB+31                                                  02449000
OUCBWMG  EQU   OUCB+32                                                  02450000
OUCBDMO  EQU   OUCB+34                                                  02451000
OUCBDMN  EQU   OUCB+36                                                  02452000
OUCBSWC  EQU   OUCB+38                                                  02453000
OUCBASCB EQU   OUCB+40                                                  02454000
OUCBTMW  EQU   OUCB+48                                                  02455000
OUCBWMS  EQU   OUCB+52                                                  02456000
OUCBCPU  EQU   OUCB+56                                                  02457000
OUCBIOC  EQU   OUCB+60                                                  02458000
OUCBMSO  EQU   OUCB+64                                                  02459000
OUCBTMS  EQU   OUCB+68                                                  02460000
OUCBTMO  EQU   OUCB+72                                                  02461000
OUCBCSW  EQU   OUCB+84                                                  02462000
OUCBCFL  EQU   OUCBCSW+2                                                02463000
OUCBRDY  EQU   OUCBCFL                                                  02464000
OUCBWMR  EQU   OUCB+92                                                  02465000
OUCBIRV  EQU   OUCB+96                                                  02466000
OUCBCRV  EQU   OUCB+98                                                  02467000
OUCBTMP  EQU   OUCB+104                                                 02468000
OUCBIOSM EQU   OUCB+108                                                 02469000
OUCBPSS  EQU   OUCB+112                                                 02470000
OUXB     EQU   0                                                        02471000
OUXBIOS  EQU   OUXB+52                                                  02472000
OUXBIOSM EQU   OUXB+56                                                  02473000
OUXBTRC  EQU   OUXB+64                                                  02474000
OUXBJBS  EQU   OUXB+68                                                  02475000
OUXBJBT  EQU   OUXB+72                                                  02476000
OUXBTRS  EQU   OUXB+76                                                  02477000
OUXBTRT  EQU   OUXB+80                                                  02478000
OUXBJBR  EQU   OUXB+84                                                  02479000
OUXBTRR  EQU   OUXB+88                                                  02480000
OUXBCPS  EQU   OUXB+96                                                  02481000
OUXBMSS  EQU   OUXB+104                                                 02482000
OUXBPRS  EQU   OUXB+120                                                 02483000
DMDT     EQU   0                                                        02484000
WMST     EQU   0                                                        02485000
WMSTPGVT EQU   WMST+8                                                   02486000
WMSTPGDT EQU   WMST+16                                                  02487000
WMSTPOVT EQU   WMST+24                                                  02488000
WMSTPODT EQU   WMST+32                                                  02489000
WMSTDMVT EQU   WMST+48                                                  02490000
WMSTCPU  EQU   WMST+68                                                  02491000
WMSTIOC  EQU   WMST+72                                                  02492000
WMSTMSO  EQU   WMST+76                                                  02493000
WPGD     EQU   0                                                        02494000
WPGDDFL  EQU   WPGD+3                                                   02495000
WPGDPGP  EQU   WPGD+12                                                  02496000
WPGDINDS EQU   WPGDPGP+5                                                02497000
WPGP     EQU   0                                                        02498000
WPGPOBJN EQU   WPGP                                                     02499000
WPGPDMN  EQU   WPGP+1                                                   02500000
WPGPAPGV EQU   WPGP+4                                                   02501000
WPGPINDS EQU   WPGP+5                                                   02502000
WPGPFIN  EQU   WPGPINDS                                                 02503000
WPGPUNT  EQU   WPGPINDS                                                 02504000
WPGPAPG  EQU   WPGPINDS                                                 02505000
WPGPRTB  EQU   WPGPINDS                                                 02506000
WPGPISVP EQU   WPGP+6                                                   02507000
WPGPDURP EQU   WPGP+7                                                   02508000
WPGL     EQU   0                                                        02509000
WPGLISV  EQU   WPGL                                                     02510000
WPGLDUR  EQU   WPGLISV                                                  02511000
WPOD     EQU   0                                                        02512000
WPOP     EQU   WPOD                                                     02513000
WPOPSRV  EQU   WPOP                                                     02514000
WPOPWKL  EQU   WPOP+2                                                   02515000
WPOS     EQU   WPOD+4                                                   02516000
WPOSSRV  EQU   WPOS                                                     02517000
WPOSWKL  EQU   WPOS+2                                                   02518000
WSAC     EQU   0                                                        02519000
WSACOPTM EQU   WSAC+8                                                   02520000
LCCA     EQU   0                                                        02521000
LCCAIHRC EQU   LCCA+520                                                 02522000
LCCAIHR1 EQU   LCCAIHRC                                                 02523000
LCCAIHR2 EQU   LCCAIHRC+1                                               02524000
LCCAIHR3 EQU   LCCAIHRC+2                                               02525000
LCCAIHR4 EQU   LCCAIHRC+3                                               02526000
LCCASPIN EQU   LCCA+524                                                 02527000
LCCASPN1 EQU   LCCASPIN                                                 02528000
LCCASPN2 EQU   LCCASPIN+1                                               02529000
LCCASPN3 EQU   LCCASPIN+2                                               02530000
LCCASPN4 EQU   LCCASPIN+3                                               02531000
LCCACPUS EQU   LCCA+536                                                 02532000
LCCADSF1 EQU   LCCA+540                                                 02533000
LCCADSF2 EQU   LCCA+541                                                 02534000
LCCASPSA EQU   LCCA+544                                                 02535000
LCCACRFL EQU   LCCA+692                                                 02536000
LCCACREX EQU   LCCA+693                                                 02537000
LCCALKFG EQU   LCCA+694                                                 02538000
LCCASRBF EQU   LCCA+720                                                 02539000
CVTMAP   EQU   0                                                        02540000
CVTDAR   EQU   CVTMAP+72                                                02541000
CVTFLGS1 EQU   CVTDAR                                                   02542000
CVTDCB   EQU   CVTMAP+116                                               02543000
CVTIOQET EQU   CVTMAP+120                                               02544000
CVTIERLC EQU   CVTMAP+144                                               02545000
CVTHEAD  EQU   CVTMAP+160                                               02546000
CVTSV76C EQU   CVTHEAD                                                  02547000
CVTOPTA  EQU   CVTMAP+182                                               02548000
CVTOPTB  EQU   CVTMAP+183                                               02549000
CVTGTF   EQU   CVTMAP+236                                               02550000
CVTGTFST EQU   CVTGTF                                                   02551000
CVTGTFS  EQU   CVTGTFST                                                 02552000
CVTSTATE EQU   CVTGTFST                                                 02553000
CVTTMODE EQU   CVTGTFST                                                 02554000
CVTFORM  EQU   CVTGTFST                                                 02555000
CVTAQAVT EQU   CVTMAP+240                                               02556000
CVTTCMFG EQU   CVTAQAVT                                                 02557000
CVTVOLM2 EQU   CVTMAP+244                                               02558000
CVTTATA  EQU   CVTVOLM2                                                 02559000
CVTTSKS  EQU   CVTTATA                                                  02560000
CVTVOLF2 EQU   CVTTSKS                                                  02561000
CVTTAT   EQU   CVTTATA+1                                                02562000
CVTATER  EQU   CVTMAP+248                                               02563000
CVTEXT1  EQU   CVTMAP+252                                               02564000
CVTPURG  EQU   CVTMAP+260                                               02565000
CVTQMSG  EQU   CVTMAP+268                                               02566000
CVTDMSR  EQU   CVTMAP+272                                               02567000
CVTRSV37 EQU   CVTDMSR                                                  02568000
CVTDMSRF EQU   CVTRSV37                                                 02569000
CVTERPV  EQU   CVTMAP+316                                               02570000
CVTINTLA EQU   CVTMAP+320                                               02571000
CVTAPF   EQU   CVTMAP+324                                               02572000
CVTEXT2  EQU   CVTMAP+328                                               02573000
CVTHJES  EQU   CVTMAP+332                                               02574000
CVTPGSIA EQU   CVTMAP+348                                               02575000
CVTA1F1  EQU   CVTMAP+356                                               02576000
CVTSYSK  EQU   CVTMAP+357                                               02577000
CVTVOLM1 EQU   CVTMAP+380                                               02578000
CVTVOLF1 EQU   CVTVOLM1                                                 02579000
CVTATMCT EQU   CVTMAP+388                                               02580000
CVTXTNT1 EQU   0                                                        02581000
CVTXTNT2 EQU   0                                                        02582000
CVTDSSV  EQU   CVTXTNT2                                                 02583000
CVTFLGBT EQU   CVTXTNT2+5                                               02584000
CVTQID   EQU   CVTXTNT2+24                                              02585000
CVTRV400 EQU   CVTXTNT2+52                                              02586000
CVTRV409 EQU   CVTXTNT2+53                                              02587000
CVTATCVT EQU   CVTXTNT2+64                                              02588000
CVTRV429 EQU   CVTXTNT2+84                                              02589000
CVTRV438 EQU   CVTXTNT2+85                                              02590000
CVTRV457 EQU   CVTXTNT2+112                                             02591000
CVTRV466 EQU   CVTXTNT2+113                                             02592000
CVTFIX   EQU   0                                                        02593000
CVTRELNO EQU   CVTFIX+252                                               02594000
PVT      EQU   0                                                        02595000
PVTFLAG1 EQU   PVT                                                      02596000
PVTFLAG2 EQU   PVT+1                                                    02597000
PVTQS    EQU   PVT+304                                                  02598000
PVTWSAX  EQU   PVT+344                                                  02599000
IRARMRTN EQU   0                                                        02600000
IRARMPTR EQU   0                                                        02601000
WM5RTRN  EQU   184                                                      02602000
WPGVTENT EQU   0                                                        02603000
WPOVTENT EQU   0                                                        02604000
WDMVTENT EQU   0                                                        02605000
IRARMNTR EQU   0                                                        02606000
IRASERPS EQU   4                                                        02607000
DMDTPTR  EQU   RMCTDMDT                                                 02608000
PSARSVTE EQU   PSARSVT                                                  02609000
LCCAPTR  EQU   PSALCCAV                                                 02610000
CVTPTR   EQU   FLCCVT                                                   02611000
CVTS01   EQU   CVTPGSIA                                                 02612000
CVTPVTP  EQU   CVTS01+8                                                 02613000
CVTLPDIA EQU   CVTS01+12                                                02614000
CVTDIRST EQU   CVTLPDIA                                                 02615000
CVTSLIDA EQU   CVTS01+24                                                02616000
CVTCTLFG EQU   CVTS01+50                                                02617000
CVTRV210 EQU   CVTS01+424                                               02618000
CVTRV219 EQU   CVTS01+425                                               02619000
CVTRV228 EQU   CVTS01+426                                               02620000
CVTRV237 EQU   CVTS01+427                                               02621000
CVTMFRTR EQU   CVTS01+452                                               02622000
CVTRV262 EQU   CVTS01+468                                               02623000
CVTRV271 EQU   CVTS01+469                                               02624000
CVTRV280 EQU   CVTS01+470                                               02625000
CVTRV289 EQU   CVTS01+471                                               02626000
CVTGSDA  EQU   CVTS01+600                                               02627000
PVTPTR   EQU   CVTPVTP                                                  02628000
EPATRPS  EQU   RMEPBRPS                                                 02629000
WPOXSRV  EQU   WPOD+8                                                   02630000
FLC      EQU   PSA                                                      02631000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02632000
CVTRV628 EQU   CVTS01+728                                               02633000
CVTRV627 EQU   CVTS01+724                                               02634000
CVTRV626 EQU   CVTS01+720                                               02635000
CVTRV625 EQU   CVTS01+716                                               02636000
CVTRV624 EQU   CVTS01+712                                               02637000
CVTRV623 EQU   CVTS01+708                                               02638000
CVTRV622 EQU   CVTS01+704                                               02639000
CVTRV621 EQU   CVTS01+700                                               02640000
CVTIHASU EQU   CVTS01+696                                               02641000
CVTSUSP  EQU   CVTS01+692                                               02642000
CVTT6SVC EQU   CVTS01+688                                               02643000
CVTCDAL  EQU   CVTS01+684                                               02644000
CVTTCTL  EQU   CVTS01+680                                               02645000
CVTRSUME EQU   CVTS01+676                                               02646000
CVTJTERM EQU   CVTS01+672                                               02647000
CVTASMRM EQU   CVTS01+668                                               02648000
CVTTCASP EQU   CVTS01+664                                               02649000
CVT0PT03 EQU   CVTS01+660                                               02650000
CVT0PT0E EQU   CVTS01+656                                               02651000
CVTRV609 EQU   CVTS01+652                                               02652000
CVTCGK   EQU   CVTS01+648                                               02653000
CVTRAC   EQU   CVTS01+644                                               02654000
CVTHSM   EQU   CVTS01+640                                               02655000
CVTRV605 EQU   CVTS01+636                                               02656000
CVTRV604 EQU   CVTS01+632                                               02657000
CVTEFF02 EQU   CVTS01+628                                               02658000
CVTCBBR  EQU   CVTS01+624                                               02659000
CVTSSCR  EQU   CVTS01+620                                               02660000
CVTEVENT EQU   CVTS01+616                                               02661000
CVTCRCA  EQU   CVTS01+612                                               02662000
CVTTPIO  EQU   CVTS01+608                                               02663000
CVTADV   EQU   CVTS01+604                                               02664000
CVTGSDAB EQU   CVTGSDA                                                  02665000
CVTQV3   EQU   CVTS01+596                                               02666000
CVTQV2   EQU   CVTS01+592                                               02667000
CVTQV1   EQU   CVTS01+588                                               02668000
CVTRPT   EQU   CVTS01+584                                               02669000
CVTSSRB  EQU   CVTS01+580                                               02670000
CVTCSDRL EQU   CVTS01+576                                               02671000
CVTEXP1  EQU   CVTS01+572                                               02672000
CVTRMPMT EQU   CVTS01+568                                               02673000
CVTRMPTT EQU   CVTS01+564                                               02674000
CVTVPSA  EQU   CVTS01+560                                               02675000
CVTVSTOP EQU   CVTS01+556                                               02676000
CVTGTFR8 EQU   CVTS01+552                                               02677000
CVTQUIT  EQU   CVTS01+548                                               02678000
CVTVACR  EQU   CVTS01+544                                               02679000
CVTWTCB  EQU   CVTS01+540                                               02680000
CVTSTPRS EQU   CVTS01+536                                               02681000
CVT0PT02 EQU   CVTS01+532                                               02682000
CVTDARCM EQU   CVTS01+528                                               02683000
CVTIRECM EQU   CVTS01+524                                               02684000
CVTJRECM EQU   CVTS01+520                                               02685000
CVTVEMS0 EQU   CVTS01+516                                               02686000
CVTSPFRR EQU   CVTS01+512                                               02687000
CVTRLSTG EQU   CVTS01+508                                               02688000
CVT0TC0A EQU   CVTS01+504                                               02689000
CVTGMBR  EQU   CVTS01+500                                               02690000
CVTLFRM  EQU   CVTS01+496                                               02691000
CVTRMBR  EQU   CVTS01+492                                               02692000
CVTVIOP  EQU   CVTS01+488                                               02693000
CVTRV307 EQU   CVTS01+486                                               02694000
CVTRV306 EQU   CVTS01+484                                               02695000
CVTRV305 EQU   CVTS01+482                                               02696000
CVTRV304 EQU   CVTS01+480                                               02697000
CVTRV303 EQU   CVTS01+478                                               02698000
CVTRV302 EQU   CVTS01+476                                               02699000
CVTTRCA  EQU   CVTS01+472                                               02700000
CVTRV297 EQU   CVTRV289                                                 02701000
CVTRV296 EQU   CVTRV289                                                 02702000
CVTRV295 EQU   CVTRV289                                                 02703000
CVTRV294 EQU   CVTRV289                                                 02704000
CVTRV293 EQU   CVTRV289                                                 02705000
CVTRV292 EQU   CVTRV289                                                 02706000
CVTRV291 EQU   CVTRV289                                                 02707000
CVTRV290 EQU   CVTRV289                                                 02708000
CVTRV288 EQU   CVTRV280                                                 02709000
CVTRV287 EQU   CVTRV280                                                 02710000
CVTRV286 EQU   CVTRV280                                                 02711000
CVTRV285 EQU   CVTRV280                                                 02712000
CVTRV284 EQU   CVTRV280                                                 02713000
CVTRV283 EQU   CVTRV280                                                 02714000
CVTRV282 EQU   CVTRV280                                                 02715000
CVTRV281 EQU   CVTRV280                                                 02716000
CVTRV279 EQU   CVTRV271                                                 02717000
CVTRV278 EQU   CVTRV271                                                 02718000
CVTRV277 EQU   CVTRV271                                                 02719000
CVTRV276 EQU   CVTRV271                                                 02720000
CVTRV275 EQU   CVTRV271                                                 02721000
CVTRV274 EQU   CVTRV271                                                 02722000
CVTRV273 EQU   CVTRV271                                                 02723000
CVTRV272 EQU   CVTRV271                                                 02724000
CVTRV270 EQU   CVTRV262                                                 02725000
CVTRV269 EQU   CVTRV262                                                 02726000
CVTRV268 EQU   CVTRV262                                                 02727000
CVTRV267 EQU   CVTRV262                                                 02728000
CVTRV266 EQU   CVTRV262                                                 02729000
CVTRV265 EQU   CVTRV262                                                 02730000
CVTRV264 EQU   CVTRV262                                                 02731000
CVTRV263 EQU   CVTRV262                                                 02732000
CVTVFP   EQU   CVTS01+464                                               02733000
CVTVSI   EQU   CVTS01+460                                               02734000
CVTVPSIB EQU   CVTS01+456                                               02735000
CVTMFACT EQU   CVTMFRTR                                                 02736000
CVTMFCTL EQU   CVTS01+448                                               02737000
CVTPVBP  EQU   CVTS01+444                                               02738000
CVTPWI   EQU   CVTS01+440                                               02739000
CVTRV254 EQU   CVTS01+438                                               02740000
CVTRV253 EQU   CVTS01+436                                               02741000
CVTRV252 EQU   CVTS01+434                                               02742000
CVTRV251 EQU   CVTS01+433                                               02743000
CVTRV250 EQU   CVTS01+432                                               02744000
CVTRV249 EQU   CVTS01+431                                               02745000
CVTRV248 EQU   CVTS01+430                                               02746000
CVTRV247 EQU   CVTS01+429                                               02747000
CVTRV246 EQU   CVTS01+428                                               02748000
CVTRV245 EQU   CVTRV237                                                 02749000
CVTRV244 EQU   CVTRV237                                                 02750000
CVTRV243 EQU   CVTRV237                                                 02751000
CVTRV242 EQU   CVTRV237                                                 02752000
CVTRV241 EQU   CVTRV237                                                 02753000
CVTRV240 EQU   CVTRV237                                                 02754000
CVTRV239 EQU   CVTRV237                                                 02755000
CVTRV238 EQU   CVTRV237                                                 02756000
CVTRV236 EQU   CVTRV228                                                 02757000
CVTRV235 EQU   CVTRV228                                                 02758000
CVTRV234 EQU   CVTRV228                                                 02759000
CVTRV233 EQU   CVTRV228                                                 02760000
CVTRV232 EQU   CVTRV228                                                 02761000
CVTRV231 EQU   CVTRV228                                                 02762000
CVTRV230 EQU   CVTRV228                                                 02763000
CVTRV229 EQU   CVTRV228                                                 02764000
CVTRV227 EQU   CVTRV219                                                 02765000
CVTRV226 EQU   CVTRV219                                                 02766000
CVTRV225 EQU   CVTRV219                                                 02767000
CVTRV224 EQU   CVTRV219                                                 02768000
CVTRV223 EQU   CVTRV219                                                 02769000
CVTRV222 EQU   CVTRV219                                                 02770000
CVTRV221 EQU   CVTRV219                                                 02771000
CVTRV220 EQU   CVTRV219                                                 02772000
CVTRV218 EQU   CVTRV210                                                 02773000
CVTRV217 EQU   CVTRV210                                                 02774000
CVTRV216 EQU   CVTRV210                                                 02775000
CVTRV215 EQU   CVTRV210                                                 02776000
CVTRV214 EQU   CVTRV210                                                 02777000
CVTRV213 EQU   CVTRV210                                                 02778000
CVTRV212 EQU   CVTRV210                                                 02779000
CVTRV211 EQU   CVTRV210                                                 02780000
CVTLCCAT EQU   CVTS01+420                                               02781000
CVTPCCAT EQU   CVTS01+416                                               02782000
CVTIPCRP EQU   CVTS01+412                                               02783000
CVTIPCRI EQU   CVTS01+408                                               02784000
CVTIPCDS EQU   CVTS01+404                                               02785000
CVTAIDVT EQU   CVTS01+400                                               02786000
CVTSSAP  EQU   CVTS01+396                                               02787000
CVTEHCIR EQU   CVTS01+392                                               02788000
CVTEHDEF EQU   CVTS01+388                                               02789000
CVTDAIR  EQU   CVTS01+384                                               02790000
CVTPERFM EQU   CVTS01+380                                               02791000
CVT044R2 EQU   CVTS01+376                                               02792000
CVTFETCH EQU   CVTS01+372                                               02793000
CVTRSTWD EQU   CVTS01+368                                               02794000
CVTSPOST EQU   CVTS01+364                                               02795000
CVTIOBP  EQU   CVTS01+360                                               02796000
CVTASMVT EQU   CVTS01+356                                               02797000
CVTRECRQ EQU   CVTS01+352                                               02798000
CVTWSAC  EQU   CVTS01+348                                               02799000
CVTRV149 EQU   CVTS01+344                                               02800000
CVTWSAL  EQU   CVTS01+340                                               02801000
CVTSPSA  EQU   CVTS01+336                                               02802000
CVTGLMN  EQU   CVTS01+332                                               02803000
CVTVEAC0 EQU   CVTS01+328                                               02804000
CVT062R1 EQU   CVTS01+324                                               02805000
CVTRPOST EQU   CVTS01+320                                               02806000
CVTDQIQE EQU   CVTS01+316                                               02807000
CVTCSD   EQU   CVTS01+312                                               02808000
CVTLKRMA EQU   CVTS01+308                                               02809000
CVTRSPIE EQU   CVTS01+304                                               02810000
CVTRENQ  EQU   CVTS01+300                                               02811000
CVTLQCB  EQU   CVTS01+296                                               02812000
CVTFQCB  EQU   CVTS01+292                                               02813000
CVTQCS01 EQU   CVTS01+288                                               02814000
CVTAPFT  EQU   CVTS01+284                                               02815000
CVTPARRL EQU   CVTS01+280                                               02816000
CVTVWAIT EQU   CVTS01+276                                               02817000
CVTGSPL  EQU   CVTS01+272                                               02818000
CVTLSMQ  EQU   CVTS01+268                                               02819000
CVTGSMQ  EQU   CVTS01+264                                               02820000
CVTEXPRO EQU   CVTS01+260                                               02821000
CVTOPCTP EQU   CVTS01+256                                               02822000
CVTSIC   EQU   CVTS01+252                                               02823000
CVTTPIOS EQU   CVTS01+248                                               02824000
CVTRTMS  EQU   CVTS01+244                                               02825000
CVTSDBF  EQU   CVTS01+240                                               02826000
CVTSCBP  EQU   CVTS01+236                                               02827000
CVTSDMP  EQU   CVTS01+232                                               02828000
CVTSV60  EQU   CVTS01+228                                               02829000
CVTRTMCT EQU   CVTS01+224                                               02830000
CVTASCBL EQU   CVTS01+220                                               02831000
CVTASCBH EQU   CVTS01+216                                               02832000
CVTGDA   EQU   CVTS01+212                                               02833000
CVTASVT  EQU   CVTS01+208                                               02834000
CVTVVMDI EQU   CVTS01+204                                               02835000
CVTAQTOP EQU   CVTS01+200                                               02836000
CVTIOSCS EQU   CVTS01+196                                               02837000
CVTSDRM  EQU   CVTS01+192                                               02838000
CVTOPTE  EQU   CVTS01+188                                               02839000
CVTSTXU  EQU   CVTS01+184                                               02840000
CVTQUIS  EQU   CVTS01+180                                               02841000
CVTPARS  EQU   CVTS01+176                                               02842000
CVTS1EE  EQU   CVTS01+172                                               02843000
CVTFRAS  EQU   CVTS01+168                                               02844000
CVTQSAS  EQU   CVTS01+164                                               02845000
CVTCRAS  EQU   CVTS01+160                                               02846000
CVTCRMN  EQU   CVTS01+156                                               02847000
CVTDELCP EQU   CVTS01+152                                               02848000
CVTFRECL EQU   CVTS01+148                                               02849000
CVTGETCL EQU   CVTS01+144                                               02850000
CVTBLDCP EQU   CVTS01+140                                               02851000
CVTAUTHL EQU   CVTS01+136                                               02852000
CVTSCAN  EQU   CVTS01+132                                               02853000
CVTRV144 EQU   CVTS01+130                                               02854000
CVTMAXMP EQU   CVTS01+128                                               02855000
CVTSTCK  EQU   CVTS01+124                                               02856000
CVTRV139 EQU   CVTS01+123                                               02857000
CVTDSSAC EQU   CVTS01+122                                               02858000
CVTRV513 EQU   CVTS01+121                                               02859000
CVTIOSPL EQU   CVTS01+120                                               02860000
CVTPTGT  EQU   CVTS01+116                                               02861000
CVTCSPIE EQU   CVTS01+112                                               02862000
CVTSMFEX EQU   CVTS01+108                                               02863000
CVTOLT0A EQU   CVTS01+104                                               02864000
CVTSRBRT EQU   CVTS01+100                                               02865000
CVTPUTL  EQU   CVTS01+96                                                02866000
CVTASCRL EQU   CVTS01+92                                                02867000
CVTASCRF EQU   CVTS01+88                                                02868000
CVTRV326 EQU   CVTS01+84                                                02869000
CVTRV325 EQU   CVTS01+80                                                02870000
CVTRV324 EQU   CVTS01+76                                                02871000
CVT0VL01 EQU   CVTS01+72                                                02872000
CVTSHRVM EQU   CVTS01+68                                                02873000
CVTRV332 EQU   CVTS01+64                                                02874000
CVTTAS   EQU   CVTS01+60                                                02875000
CVTRSCN  EQU   CVTS01+56                                                02876000
CVTTRAC2 EQU   CVTS01+54                                                02877000
CVTTRACE EQU   CVTS01+52                                                02878000
CVTAPG   EQU   CVTS01+51                                                02879000
CVTSDTRC EQU   CVTCTLFG                                                 02880000
CVTGTRCE EQU   CVTCTLFG                                                 02881000
CVTNOMP  EQU   CVTCTLFG                                                 02882000
CVTRSV79 EQU   CVTCTLFG                                                 02883000
CVTDSTAT EQU   CVTCTLFG                                                 02884000
CVTRSV78 EQU   CVTCTLFG                                                 02885000
CVTRV333 EQU   CVTCTLFG                                                 02886000
CVTRV323 EQU   CVTCTLFG                                                 02887000
CVTSPVLK EQU   CVTS01+49                                                02888000
CVTRSV77 EQU   CVTS01+48                                                02889000
CVTRV331 EQU   CVTS01+44                                                02890000
CVTRV330 EQU   CVTS01+40                                                02891000
CVTRV329 EQU   CVTS01+36                                                02892000
CVTRV328 EQU   CVTS01+32                                                02893000
CVTRV322 EQU   CVTS01+28                                                02894000
CVTSLID  EQU   CVTSLIDA+1                                               02895000
CVTSYLK  EQU   CVTSLIDA                                                 02896000
CVTRV321 EQU   CVTS01+20                                                02897000
CVTRV320 EQU   CVTS01+16                                                02898000
CVTLPDIR EQU   CVTLPDIA+1                                               02899000
CVTRSV69 EQU   CVTDIRST                                                 02900000
CVTRSV68 EQU   CVTDIRST                                                 02901000
CVTRSV67 EQU   CVTDIRST                                                 02902000
CVTRSV66 EQU   CVTDIRST                                                 02903000
CVTRSV65 EQU   CVTDIRST                                                 02904000
CVTRSV64 EQU   CVTDIRST                                                 02905000
CVTRSV63 EQU   CVTDIRST                                                 02906000
CVTDICOM EQU   CVTDIRST                                                 02907000
CVTLPDSR EQU   CVTS01+4                                                 02908000
CVTGETL  EQU   CVTS01                                                   02909000
PSARSAV  EQU   PSARSVTE+60                                              02910000
PSARSTK  EQU   PSARSVTE+56                                              02911000
PSAESAV3 EQU   PSARSVTE+52                                              02912000
PSAESTK3 EQU   PSARSVTE+48                                              02913000
PSAESAV2 EQU   PSARSVTE+44                                              02914000
PSAESTK2 EQU   PSARSVTE+40                                              02915000
PSAESAV1 EQU   PSARSVTE+36                                              02916000
PSAESTK1 EQU   PSARSVTE+32                                              02917000
PSAPSAV  EQU   PSARSVTE+28                                              02918000
PSAPSTK  EQU   PSARSVTE+24                                              02919000
PSAMSAV  EQU   PSARSVTE+20                                              02920000
PSAMSTK  EQU   PSARSVTE+16                                              02921000
PSASSAV  EQU   PSARSVTE+12                                              02922000
PSASSTK  EQU   PSARSVTE+8                                               02923000
PSANSTK  EQU   PSARSVTE+4                                               02924000
PSACSTK  EQU   PSARSVTE                                                 02925000
PVTEND   EQU   PVT+1848                                                 02926000
PVTTASID EQU   PVT+1846                                                 02927000
PVTXXXXX EQU   PVT+1844                                                 02928000
PVTMVCLC EQU   PVT+1840                                                 02929000
PVTSPARE EQU   PVT+1838                                                 02930000
PVTCHUIC EQU   PVT+1836                                                 02931000
PVTCOMFX EQU   PVT+1834                                                 02932000
PVTSQAFX EQU   PVT+1832                                                 02933000
PVTCNTFX EQU   PVT+1830                                                 02934000
PVTDEFFX EQU   PVT+1828                                                 02935000
PVTFIXOK EQU   PVT+1826                                                 02936000
PVTPEROK EQU   PVT+1824                                                 02937000
PVTMAXFX EQU   PVT+1822                                                 02938000
PVTPERFX EQU   PVT+1820                                                 02939000
PVTRSRB  EQU   PVT+1776                                                 02940000
PVTRESV5 EQU   PVT+1773                                                 02941000
PVTSRBS  EQU   PVT+1772                                                 02942000
PVTSSRB  EQU   PVT+1768                                                 02943000
PVTACA   EQU   PVTWSAX+1400                                             02944000
PVTSAVE  EQU   PVTWSAX+1328                                             02945000
PVTWSA18 EQU   PVTWSAX+1256                                             02946000
PVTWSA17 EQU   PVTWSAX+1184                                             02947000
PVTWSA16 EQU   PVTWSAX+1112                                             02948000
PVTWSA15 EQU   PVTWSAX+1040                                             02949000
PVTWSA14 EQU   PVTWSAX+968                                              02950000
PVTWSA13 EQU   PVTWSAX+896                                              02951000
PVTWSA12 EQU   PVTWSAX+824                                              02952000
PVTWSA11 EQU   PVTWSAX+752                                              02953000
PVTWSA10 EQU   PVTWSAX+672                                              02954000
PVTWSA9  EQU   PVTWSAX+592                                              02955000
PVTWSA8  EQU   PVTWSAX+504                                              02956000
PVTWSA7  EQU   PVTWSAX+432                                              02957000
PVTWSA6  EQU   PVTWSAX+360                                              02958000
PVTWSA5  EQU   PVTWSAX+288                                              02959000
PVTWSA4  EQU   PVTWSAX+216                                              02960000
PVTWSA3  EQU   PVTWSAX+144                                              02961000
PVTWSA2  EQU   PVTWSAX+72                                               02962000
PVTWSA1  EQU   PVTWSAX                                                  02963000
PVTCIOQL EQU   PVTQS+36                                                 02964000
PVTCIOQF EQU   PVTQS+32                                                 02965000
PVTGFADL EQU   PVTQS+28                                                 02966000
PVTGFADF EQU   PVTQS+24                                                 02967000
PVTFPCBL EQU   PVTQS+20                                                 02968000
PVTFPCBF EQU   PVTQS+16                                                 02969000
PVTSQAQL EQU   PVTQS+14                                                 02970000
PVTSQAQF EQU   PVTQS+12                                                 02971000
PVTCFQL  EQU   PVTQS+10                                                 02972000
PVTCFQF  EQU   PVTQS+8                                                  02973000
PVTRSRVL EQU   PVTQS+6                                                  02974000
PVTRSRVF EQU   PVTQS+4                                                  02975000
PVTAFQL  EQU   PVTQS+2                                                  02976000
PVTAFQF  EQU   PVTQS                                                    02977000
PVTSPFR  EQU   PVT+302                                                  02978000
PVTCFMCT EQU   PVT+300                                                  02979000
PVTSPREC EQU   PVT+296                                                  02980000
PVTCAREC EQU   PVT+292                                                  02981000
PVTCAOUT EQU   PVT+288                                                  02982000
PVTCAIN  EQU   PVT+284                                                  02983000
PVTNSWPS EQU   PVT+280                                                  02984000
PVTNPREC EQU   PVT+276                                                  02985000
PVTSPOUT EQU   PVT+272                                                  02986000
PVTSPIN  EQU   PVT+268                                                  02987000
PVTVAMR  EQU   PVT+264                                                  02988000
PVTVAMO  EQU   PVT+260                                                  02989000
PVTVAMI  EQU   PVT+256                                                  02990000
PVTNPOUT EQU   PVT+252                                                  02991000
PVTNPIN  EQU   PVT+248                                                  02992000
PVTPRSET EQU   PVT+244                                                  02993000
PVTFRSLT EQU   PVT+240                                                  02994000
PVTPAGIO EQU   PVT+236                                                  02995000
PVTSWPIO EQU   PVT+232                                                  02996000
PVTPSWPP EQU   PVT+228                                                  02997000
PVTPPREF EQU   PVT+224                                                  02998000
PVTPOPBR EQU   PVT+220                                                  02999000
PVTPRELF EQU   PVT+216                                                  03000000
PVTPRELV EQU   PVT+212                                                  03001000
PVTPFREE EQU   PVT+208                                                  03002000
PVTPRELS EQU   PVT+204                                                  03003000
PVTPOUT  EQU   PVT+200                                                  03004000
PVTPFXLD EQU   PVT+196                                                  03005000
PVTPITAS EQU   PVT+192                                                  03006000
PVTPSRBP EQU   PVT+188                                                  03007000
PVTPDSEG EQU   PVT+184                                                  03008000
PVTPCSGB EQU   PVT+180                                                  03009000
PVTPCSEG EQU   PVT+176                                                  03010000
PVTPINV  EQU   PVT+172                                                  03011000
PVTPSWPC EQU   PVT+168                                                  03012000
PVTPSOUT EQU   PVT+164                                                  03013000
PVTPSWIN EQU   PVT+160                                                  03014000
PVTPRCV  EQU   PVT+156                                                  03015000
PVTPRCFI EQU   PVT+152                                                  03016000
PVTPRCF  EQU   PVT+148                                                  03017000
PVTPVRC  EQU   PVT+144                                                  03018000
PVTPVRIN EQU   PVT+140                                                  03019000
PVTPVRLS EQU   PVT+136                                                  03020000
PVTPVEQR EQU   PVT+132                                                  03021000
PVTPPIOI EQU   PVT+128                                                  03022000
PVTPVRPO EQU   PVT+124                                                  03023000
PVTPRFR  EQU   PVT+120                                                  03024000
PVTPFP2  EQU   PVT+116                                                  03025000
PVTPFP   EQU   PVT+112                                                  03026000
PVTPFTE  EQU   PVT+108                                                  03027000
PVTPCB   EQU   PVT+104                                                  03028000
PVTREP2  EQU   PVT+100                                                  03029000
PVTPIOCP EQU   PVT+96                                                   03030000
PVTPIOP  EQU   PVT+92                                                   03031000
PVTPGFAD EQU   PVT+88                                                   03032000
PVTPGFA  EQU   PVT+84                                                   03033000
PVTPSQA  EQU   PVT+80                                                   03034000
PVTPSINT EQU   PVT+76                                                   03035000
PVTPSIB  EQU   PVT+72                                                   03036000
PVTSRBID EQU   PVT+68                                                   03037000
PVTPCIWA EQU   PVT+64                                                   03038000
PVTHQSA  EQU   PVT+62                                                   03039000
PVTLQSA  EQU   PVT+60                                                   03040000
PVTOROOT EQU   PVT+56                                                   03041000
PVTPRCA  EQU   PVT+52                                                   03042000
PVTREUS  EQU   PVT+48                                                   03043000
PVTSQNPC EQU   PVT+47                                                   03044000
PVTSQVRC EQU   PVT+46                                                   03045000
PVTRSUS  EQU   PVT+44                                                   03046000
PVTVROOT EQU   PVT+40                                                   03047000
PVTPCBLO EQU   PVT+38                                                   03048000
PVTPCBCT EQU   PVT+36                                                   03049000
PVTDFRS  EQU   PVT+34                                                   03050000
PVTRSQA  EQU   PVT+32                                                   03051000
PVTPTLB  EQU   PVT+31                                                   03052000
PVTPCBNO EQU   PVT+30                                                   03053000
PVTSRBNO EQU   PVT+29                                                   03054000
PVTSQDC  EQU   PVT+28                                                   03055000
PVTLCSA  EQU   PVT+26                                                   03056000
PVTLPRIV EQU   PVT+24                                                   03057000
PVTLVR   EQU   PVT+22                                                   03058000
PVTFVR   EQU   PVT+20                                                   03059000
PVTLPFN  EQU   PVT+18                                                   03060000
PVTFPFN  EQU   PVT+16                                                   03061000
PVTPFTP  EQU   PVT+12                                                   03062000
PVTSSPIN EQU   PVT+11                                                   03063000
PVTPCBS  EQU   PVT+10                                                   03064000
PVTPOOL  EQU   PVT+8                                                    03065000
PVTAFCOK EQU   PVT+6                                                    03066000
PVTAFCLO EQU   PVT+4                                                    03067000
PVTAFC   EQU   PVT+2                                                    03068000
@NM00031 EQU   PVTFLAG2                                                 03069000
PVTRSMGM EQU   PVTFLAG2                                                 03070000
PVTDUMP  EQU   PVTFLAG1                                                 03071000
PVTSIT   EQU   PVTFLAG1                                                 03072000
PVTLSI   EQU   PVTFLAG1                                                 03073000
PVTAPREF EQU   PVTFLAG1                                                 03074000
PVTPCBLT EQU   PVTFLAG1                                                 03075000
PVTSRBIU EQU   PVTFLAG1                                                 03076000
PVTBGMS  EQU   PVTFLAG1                                                 03077000
PVTPMSG  EQU   PVTFLAG1                                                 03078000
CVTLEVL  EQU   CVTRELNO+2                                               03079000
CVTNUMB  EQU   CVTRELNO                                                 03080000
CVTMDL   EQU   CVTFIX+250                                               03081000
@NM00030 EQU   CVTFIX+248                                               03082000
@NM00029 EQU   CVTFIX                                                   03083000
CVTRV482 EQU   CVTXTNT2+128                                             03084000
CVTRV481 EQU   CVTXTNT2+124                                             03085000
CVTRV480 EQU   CVTXTNT2+120                                             03086000
CVTRV479 EQU   CVTXTNT2+118                                             03087000
CVTRV478 EQU   CVTXTNT2+117                                             03088000
CVTRV477 EQU   CVTXTNT2+116                                             03089000
CVTRV476 EQU   CVTXTNT2+115                                             03090000
CVTRV475 EQU   CVTXTNT2+114                                             03091000
CVTRV474 EQU   CVTRV466                                                 03092000
CVTRV473 EQU   CVTRV466                                                 03093000
CVTRV472 EQU   CVTRV466                                                 03094000
CVTRV471 EQU   CVTRV466                                                 03095000
CVTRV470 EQU   CVTRV466                                                 03096000
CVTRV469 EQU   CVTRV466                                                 03097000
CVTRV468 EQU   CVTRV466                                                 03098000
CVTRV467 EQU   CVTRV466                                                 03099000
CVTRV465 EQU   CVTRV457                                                 03100000
CVTRV464 EQU   CVTRV457                                                 03101000
CVTRV463 EQU   CVTRV457                                                 03102000
CVTRV462 EQU   CVTRV457                                                 03103000
CVTRV461 EQU   CVTRV457                                                 03104000
CVTRV460 EQU   CVTRV457                                                 03105000
CVTRV459 EQU   CVTRV457                                                 03106000
CVTRV458 EQU   CVTRV457                                                 03107000
CVTRV456 EQU   CVTXTNT2+108                                             03108000
CVTRV455 EQU   CVTXTNT2+104                                             03109000
CVTRV454 EQU   CVTXTNT2+100                                             03110000
CVTRV453 EQU   CVTXTNT2+96                                              03111000
CVTRV452 EQU   CVTXTNT2+94                                              03112000
CVTRV451 EQU   CVTXTNT2+92                                              03113000
CVTRV450 EQU   CVTXTNT2+90                                              03114000
CVTRV449 EQU   CVTXTNT2+88                                              03115000
CVTRV448 EQU   CVTXTNT2+87                                              03116000
CVTRV447 EQU   CVTXTNT2+86                                              03117000
CVTRV446 EQU   CVTRV438                                                 03118000
CVTRV445 EQU   CVTRV438                                                 03119000
CVTRV444 EQU   CVTRV438                                                 03120000
CVTRV443 EQU   CVTRV438                                                 03121000
CVTRV442 EQU   CVTRV438                                                 03122000
CVTRV441 EQU   CVTRV438                                                 03123000
CVTRV440 EQU   CVTRV438                                                 03124000
CVTRV439 EQU   CVTRV438                                                 03125000
CVTRV437 EQU   CVTRV429                                                 03126000
CVTRV436 EQU   CVTRV429                                                 03127000
CVTRV435 EQU   CVTRV429                                                 03128000
CVTRV434 EQU   CVTRV429                                                 03129000
CVTRV433 EQU   CVTRV429                                                 03130000
CVTRV432 EQU   CVTRV429                                                 03131000
CVTRV431 EQU   CVTRV429                                                 03132000
CVTRV430 EQU   CVTRV429                                                 03133000
CVTRV428 EQU   CVTXTNT2+80                                              03134000
CVTRV427 EQU   CVTXTNT2+76                                              03135000
CVTRV426 EQU   CVTXTNT2+72                                              03136000
CVTRV425 EQU   CVTXTNT2+68                                              03137000
CVTATACT EQU   CVTATCVT                                                 03138000
CVTRV423 EQU   CVTXTNT2+62                                              03139000
CVTRV422 EQU   CVTXTNT2+60                                              03140000
CVTRV421 EQU   CVTXTNT2+58                                              03141000
CVTRV420 EQU   CVTXTNT2+56                                              03142000
CVTRV419 EQU   CVTXTNT2+55                                              03143000
CVTRV418 EQU   CVTXTNT2+54                                              03144000
CVTRV417 EQU   CVTRV409                                                 03145000
CVTRV416 EQU   CVTRV409                                                 03146000
CVTRV415 EQU   CVTRV409                                                 03147000
CVTRV414 EQU   CVTRV409                                                 03148000
CVTRV413 EQU   CVTRV409                                                 03149000
CVTRV412 EQU   CVTRV409                                                 03150000
CVTRV411 EQU   CVTRV409                                                 03151000
CVTRV410 EQU   CVTRV409                                                 03152000
CVTRV408 EQU   CVTRV400                                                 03153000
CVTRV407 EQU   CVTRV400                                                 03154000
CVTRV406 EQU   CVTRV400                                                 03155000
CVTRV405 EQU   CVTRV400                                                 03156000
CVTRV404 EQU   CVTRV400                                                 03157000
CVTRV403 EQU   CVTRV400                                                 03158000
CVTRV402 EQU   CVTRV400                                                 03159000
CVTRV401 EQU   CVTRV400                                                 03160000
CVTICB   EQU   CVTXTNT2+48                                              03161000
CVTSKTA  EQU   CVTXTNT2+44                                              03162000
CVTCCVT  EQU   CVTXTNT2+40                                              03163000
CVTRSV98 EQU   CVTXTNT2+36                                              03164000
CVTRSV97 EQU   CVTXTNT2+34                                              03165000
CVTRSV96 EQU   CVTXTNT2+32                                              03166000
CVTOLTEP EQU   CVTXTNT2+28                                              03167000
CVTQIDA  EQU   CVTQID+1                                                 03168000
CVTRSV95 EQU   CVTQID                                                   03169000
CVTRSV94 EQU   CVTXTNT2+20                                              03170000
CVTRSV93 EQU   CVTXTNT2+16                                              03171000
CVTRSV92 EQU   CVTXTNT2+12                                              03172000
CVTDEBVR EQU   CVTXTNT2+8                                               03173000
CVTRSV91 EQU   CVTXTNT2+6                                               03174000
CVTRSV9H EQU   CVTFLGBT                                                 03175000
CVTRSV9G EQU   CVTFLGBT                                                 03176000
CVTRSV9F EQU   CVTFLGBT                                                 03177000
CVTRSV9E EQU   CVTFLGBT                                                 03178000
CVTRSV9D EQU   CVTFLGBT                                                 03179000
CVTRSV9C EQU   CVTFLGBT                                                 03180000
CVTVME   EQU   CVTFLGBT                                                 03181000
CVTNPE   EQU   CVTFLGBT                                                 03182000
CVTNUCLS EQU   CVTXTNT2+4                                               03183000
CVTDSSVA EQU   CVTDSSV+1                                                03184000
CVTRSV89 EQU   CVTDSSV                                                  03185000
CVTRSV88 EQU   CVTXTNT1+8                                               03186000
CVTRSV87 EQU   CVTXTNT1+4                                               03187000
CVTFACHN EQU   CVTXTNT1                                                 03188000
CVTRV488 EQU   CVTMAP+412                                               03189000
CVTRV487 EQU   CVTMAP+408                                               03190000
CVTRV486 EQU   CVTMAP+404                                               03191000
CVTRV485 EQU   CVTMAP+400                                               03192000
CVTACTAP EQU   CVTMAP+396                                               03193000
CVTAUTH  EQU   CVTMAP+392                                               03194000
CVTATMCA EQU   CVTATMCT+1                                               03195000
CVTATMST EQU   CVTATMCT                                                 03196000
CVTRSV61 EQU   CVTMAP+384                                               03197000
CVTVOLT1 EQU   CVTVOLM1+1                                               03198000
CVTVOLI1 EQU   CVTVOLF1                                                 03199000
CVTSTOA  EQU   CVTMAP+376                                               03200000
CVTRSV58 EQU   CVTMAP+374                                               03201000
CVTRSV57 EQU   CVTMAP+372                                               03202000
CVTDDCE  EQU   CVTMAP+368                                               03203000
CVTPNWFR EQU   CVTMAP+364                                               03204000
CVTSMF   EQU   CVTMAP+360                                               03205000
CVTSULK  EQU   CVTMAP+358                                               03206000
CVTSLKO  EQU   CVTSYSK                                                  03207000
CVTSLKP  EQU   CVTSYSK                                                  03208000
CVTSLKQ  EQU   CVTSYSK                                                  03209000
CVTSLKR  EQU   CVTSYSK                                                  03210000
CVTRSV56 EQU   CVTSYSK                                                  03211000
CVTRSV55 EQU   CVTSYSK                                                  03212000
CVTRSV54 EQU   CVTSYSK                                                  03213000
CVTRSV53 EQU   CVTSYSK                                                  03214000
CVTRSV52 EQU   CVTA1F1                                                  03215000
CVTRSV51 EQU   CVTA1F1                                                  03216000
CVTRSV50 EQU   CVTA1F1                                                  03217000
CVTRSV49 EQU   CVTA1F1                                                  03218000
CVTRSV48 EQU   CVTA1F1                                                  03219000
CVTRSV47 EQU   CVTA1F1                                                  03220000
CVTSRSW  EQU   CVTA1F1                                                  03221000
CVTPFSW  EQU   CVTA1F1                                                  03222000
CVTPCVT  EQU   CVTMAP+352                                               03223000
CVTRSV46 EQU   CVTMAP+344                                               03224000
CVTRSV45 EQU   CVTMAP+340                                               03225000
CVTRSV44 EQU   CVTMAP+338                                               03226000
CVTRSV43 EQU   CVTMAP+336                                               03227000
CVTHJESA EQU   CVTHJES+1                                                03228000
CVTRSV42 EQU   CVTHJES                                                  03229000
CVTEXT2A EQU   CVTEXT2+1                                                03230000
CVTRSV41 EQU   CVTEXT2                                                  03231000
CVTAPFA  EQU   CVTAPF+1                                                 03232000
CVTRSV40 EQU   CVTAPF                                                   03233000
CVTRV518 EQU   CVTINTLA                                                 03234000
CVTRV517 EQU   CVTERPV                                                  03235000
CVTEORM  EQU   CVTMAP+312                                               03236000
CVTMCHPR EQU   CVTMAP+308                                               03237000
CVTTZ    EQU   CVTMAP+304                                               03238000
CVTJEPS  EQU   CVTMAP+300                                               03239000
CVTJESCT EQU   CVTMAP+296                                               03240000
CVTMODE  EQU   CVTMAP+292                                               03241000
CVTPTRV  EQU   CVTMAP+288                                               03242000
CVTREAL  EQU   CVTMAP+284                                               03243000
CVTRSV39 EQU   CVTMAP+280                                               03244000
CVTRSV38 EQU   CVTMAP+276                                               03245000
CVTDMSRA EQU   CVTDMSR+1                                                03246000
CVTRV634 EQU   CVTDMSRF                                                 03247000
CVTRV633 EQU   CVTDMSRF                                                 03248000
CVTRV632 EQU   CVTDMSRF                                                 03249000
CVTRV631 EQU   CVTDMSRF                                                 03250000
CVTRV630 EQU   CVTDMSRF                                                 03251000
CVTRV629 EQU   CVTDMSRF                                                 03252000
CVTUDUMP EQU   CVTDMSRF                                                 03253000
CVTSDUMP EQU   CVTDMSRF                                                 03254000
CVTQMSGA EQU   CVTQMSG+1                                                03255000
CVTRSV36 EQU   CVTQMSG                                                  03256000
CVTAMFF  EQU   CVTMAP+264                                               03257000
CVTPURGA EQU   CVTPURG+1                                                03258000
CVTRSV35 EQU   CVTPURG                                                  03259000
CVTCBSP  EQU   CVTMAP+256                                               03260000
CVTATERA EQU   CVTATER+1                                                03261000
CVTSYST  EQU   CVTATER                                                  03262000
CVTVOLT2 EQU   CVTTAT                                                   03263000
CVTVOLI2 EQU   CVTVOLF2                                                 03264000
CVTAQAVB EQU   CVTAQAVT+1                                               03265000
CVTRSV34 EQU   CVTTCMFG                                                 03266000
CVTRSV33 EQU   CVTTCMFG                                                 03267000
CVTRSV32 EQU   CVTTCMFG                                                 03268000
CVTRSV31 EQU   CVTTCMFG                                                 03269000
CVTRSV30 EQU   CVTTCMFG                                                 03270000
CVTRSV29 EQU   CVTTCMFG                                                 03271000
CVTLDEV  EQU   CVTTCMFG                                                 03272000
CVTTCRDY EQU   CVTTCMFG                                                 03273000
CVTGTFA  EQU   CVTGTF+1                                                 03274000
CVTRSV27 EQU   CVTGTFST                                                 03275000
CVTRNIO  EQU   CVTGTFST                                                 03276000
CVTUSR   EQU   CVTGTFST                                                 03277000
CVTRV318 EQU   CVTFORM                                                  03278000
CVTRV317 EQU   CVTTMODE                                                 03279000
CVTRV316 EQU   CVTSTATE                                                 03280000
CVTRV315 EQU   CVTGTFS                                                  03281000
CVTGTFAV EQU   CVTGTFS                                                  03282000
CVT0SCR1 EQU   CVTMAP+232                                               03283000
CVTRV515 EQU   CVTMAP+228                                               03284000
CVTRMS   EQU   CVTMAP+224                                               03285000
CVTPATCH EQU   CVTMAP+220                                               03286000
CVTTSCE  EQU   CVTMAP+216                                               03287000
CVTLNKSC EQU   CVTMAP+214                                               03288000
CVTQABST EQU   CVTMAP+212                                               03289000
CVTMDLDS EQU   CVTMAP+208                                               03290000
CVTUSER  EQU   CVTMAP+204                                               03291000
CVTABEND EQU   CVTMAP+200                                               03292000
CVTSMCA  EQU   CVTMAP+196                                               03293000
CVTRSV18 EQU   CVTMAP+192                                               03294000
CVTQLPAQ EQU   CVTMAP+188                                               03295000
CVTQCDSR EQU   CVTMAP+184                                               03296000
CVTRSV17 EQU   CVTOPTB                                                  03297000
CVTRSV16 EQU   CVTOPTB                                                  03298000
CVTFP    EQU   CVTOPTB                                                  03299000
CVTAPTHR EQU   CVTOPTB                                                  03300000
CVTNLOG  EQU   CVTOPTB                                                  03301000
CVTTOD   EQU   CVTOPTB                                                  03302000
CVTCTIMS EQU   CVTOPTB                                                  03303000
CVTPROT  EQU   CVTOPTB                                                  03304000
CVTXPFP  EQU   CVTOPTA                                                  03305000
CVTASCII EQU   CVTOPTA                                                  03306000
CVTRSV13 EQU   CVTOPTA                                                  03307000
CVTRSV12 EQU   CVTOPTA                                                  03308000
CVTNIP   EQU   CVTOPTA                                                  03309000
CVTDDR   EQU   CVTOPTA                                                  03310000
CVTAPR   EQU   CVTOPTA                                                  03311000
CVTCCH   EQU   CVTOPTA                                                  03312000
CVTSNCTR EQU   CVTMAP+180                                               03313000
CVTQMWR  EQU   CVTMAP+176                                               03314000
CVTQOCR  EQU   CVTMAP+172                                               03315000
CVT1EF00 EQU   CVTMAP+168                                               03316000
CVTMZ00  EQU   CVTMAP+164                                               03317000
CVTSV76Q EQU   CVTSV76C                                                 03318000
CVTRSV11 EQU   CVTMAP+156                                               03319000
CVT0PT01 EQU   CVTMAP+152                                               03320000
CVTMSER  EQU   CVTMAP+148                                               03321000
CVTRV516 EQU   CVTIERLC                                                 03322000
CVTILCH  EQU   CVTMAP+140                                               03323000
CVT0DS   EQU   CVTMAP+136                                               03324000
CVTFBOSV EQU   CVTMAP+132                                               03325000
CVTNUCB  EQU   CVTMAP+128                                               03326000
CVTIXAVL EQU   CVTMAP+124                                               03327000
CVTSV76M EQU   CVTIOQET                                                 03328000
CVTDCBA  EQU   CVTMAP+117                                               03329000
CVTMVS2  EQU   CVTDCB                                                   03330000
CVT6DAT  EQU   CVTDCB                                                   03331000
CVT4MPS  EQU   CVTDCB                                                   03332000
CVTRSV09 EQU   CVTDCB                                                   03333000
CVT4MS1  EQU   CVTDCB                                                   03334000
CVT2SPS  EQU   CVTDCB                                                   03335000
CVT1SSS  EQU   CVTDCB                                                   03336000
CVTRSV08 EQU   CVTDCB                                                   03337000
CVTSTB   EQU   CVTMAP+112                                               03338000
CVTQTD00 EQU   CVTMAP+108                                               03339000
CVTQTE00 EQU   CVTMAP+104                                               03340000
CVTCUCB  EQU   CVTMAP+100                                               03341000
CVTSJQ   EQU   CVTMAP+96                                                03342000
CVTPBLDL EQU   CVTMAP+92                                                03343000
CVTTPC   EQU   CVTMAP+88                                                03344000
CVTSVDCB EQU   CVTMAP+84                                                03345000
CVTBRET  EQU   CVTMAP+82                                                03346000
CVTEXIT  EQU   CVTMAP+80                                                03347000
CVT0FN00 EQU   CVTMAP+76                                                03348000
CVTDARA  EQU   CVTDAR+1                                                 03349000
CVTRSV07 EQU   CVTFLGS1                                                 03350000
CVTRSV06 EQU   CVTFLGS1                                                 03351000
CVTRSV05 EQU   CVTFLGS1                                                 03352000
CVTRSV04 EQU   CVTFLGS1                                                 03353000
CVTRSV03 EQU   CVTFLGS1                                                 03354000
CVTRSV02 EQU   CVTFLGS1                                                 03355000
CVTRSV01 EQU   CVTFLGS1                                                 03356000
CVTDMPLK EQU   CVTFLGS1                                                 03357000
CVTXITP  EQU   CVTMAP+68                                                03358000
CVTZDTAB EQU   CVTMAP+64                                                03359000
CVTMSLT  EQU   CVTMAP+60                                                03360000
CVTDATE  EQU   CVTMAP+56                                                03361000
CVTBTERM EQU   CVTMAP+52                                                03362000
CVTSYSAD EQU   CVTMAP+48                                                03363000
CVTXTLER EQU   CVTMAP+44                                                03364000
CVTILK2  EQU   CVTMAP+40                                                03365000
CVTILK1  EQU   CVTMAP+36                                                03366000
CVTPRLTV EQU   CVTMAP+32                                                03367000
CVTPCNVT EQU   CVTMAP+28                                                03368000
CVT0VL00 EQU   CVTMAP+24                                                03369000
CVTXAPG  EQU   CVTMAP+20                                                03370000
CVTBUF   EQU   CVTMAP+16                                                03371000
CVTJOB   EQU   CVTMAP+12                                                03372000
CVTLINK  EQU   CVTMAP+8                                                 03373000
CVT0EF00 EQU   CVTMAP+4                                                 03374000
CVTTCBP  EQU   CVTMAP                                                   03375000
CVT      EQU   CVTMAP                                                   03376000
LCCAR125 EQU   LCCA+964                                                 03377000
LCCAR124 EQU   LCCA+960                                                 03378000
LCCASGPR EQU   LCCA+896                                                 03379000
LCCADRT2 EQU   LCCA+888                                                 03380000
LCCADRT1 EQU   LCCA+880                                                 03381000
LCCAR103 EQU   LCCA+876                                                 03382000
LCCAESS2 EQU   LCCA+872                                                 03383000
LCCASPLJ EQU   LCCA+868                                                 03384000
LCCASMQJ EQU   LCCA+864                                                 03385000
LCCAIRT  EQU   LCCA+736                                                 03386000
LCCAASID EQU   LCCA+732                                                 03387000
LCCARV89 EQU   LCCA+728                                                 03388000
LCCAPGTA EQU   LCCASRBF+2                                               03389000
LCCASAFN EQU   LCCASRBF                                                 03390000
LCCAECSA EQU   LCCA+716                                                 03391000
LCCAICR0 EQU   LCCA+712                                                 03392000
LCCALWTM EQU   LCCA+704                                                 03393000
LCCARV78 EQU   LCCA+700                                                 03394000
LCCAPINV EQU   LCCA+696                                                 03395000
LCCARV88 EQU   LCCA+695                                                 03396000
LCCARV87 EQU   LCCALKFG                                                 03397000
LCCARV86 EQU   LCCALKFG                                                 03398000
LCCARV85 EQU   LCCALKFG                                                 03399000
LCCARV84 EQU   LCCALKFG                                                 03400000
LCCALKRD EQU   LCCALKFG                                                 03401000
LCCALKAQ EQU   LCCALKFG                                                 03402000
LCCALKSA EQU   LCCALKFG                                                 03403000
LCCALKDP EQU   LCCALKFG                                                 03404000
LCCACRST EQU   LCCACREX                                                 03405000
LCCACRDP EQU   LCCACREX                                                 03406000
LCCACRLM EQU   LCCACREX                                                 03407000
LCCACRIN EQU   LCCACREX                                                 03408000
LCCACRRT EQU   LCCACREX                                                 03409000
LCCACRLE EQU   LCCACREX                                                 03410000
LCCACRRM EQU   LCCACREX                                                 03411000
LCCACREF EQU   LCCACREX                                                 03412000
LCCAVARY EQU   LCCACRFL                                                 03413000
LCCARV73 EQU   LCCACRFL                                                 03414000
LCCARV72 EQU   LCCACRFL                                                 03415000
LCCARV71 EQU   LCCACRFL                                                 03416000
LCCARV70 EQU   LCCACRFL                                                 03417000
LCCARV69 EQU   LCCACRFL                                                 03418000
LCCACLMS EQU   LCCACRFL                                                 03419000
LCCACRTM EQU   LCCACRFL                                                 03420000
LCCALCR0 EQU   LCCA+688                                                 03421000
LCCACRLC EQU   LCCA+684                                                 03422000
LCCARCPU EQU   LCCA+680                                                 03423000
LCCADCPU EQU   LCCA+676                                                 03424000
LCCASRBJ EQU   LCCA+672                                                 03425000
LCCADSSR EQU   LCCA+668                                                 03426000
LCCADSSC EQU   LCCA+660                                                 03427000
LCCADSS3 EQU   LCCA+648                                                 03428000
LCCADSS2 EQU   LCCA+636                                                 03429000
LCCADSS1 EQU   LCCA+624                                                 03430000
LCCAWTIM EQU   LCCA+616                                                 03431000
LCCAITOD EQU   LCCA+608                                                 03432000
LCCADTOD EQU   LCCA+600                                                 03433000
LCCASTOD EQU   LCCA+592                                                 03434000
LCCARIR5 EQU   LCCASPSA+44                                              03435000
LCCARIR4 EQU   LCCASPSA+40                                              03436000
LCCARIR3 EQU   LCCASPSA+36                                              03437000
LCCARIR2 EQU   LCCASPSA+32                                              03438000
LCCARPR5 EQU   LCCASPSA+28                                              03439000
LCCARPR4 EQU   LCCASPSA+24                                              03440000
LCCARPR3 EQU   LCCASPSA+20                                              03441000
LCCARPR2 EQU   LCCASPSA+16                                              03442000
LCCADSR5 EQU   LCCASPSA+12                                              03443000
LCCADSR4 EQU   LCCASPSA+8                                               03444000
LCCADSR3 EQU   LCCASPSA+4                                               03445000
LCCADSR2 EQU   LCCASPSA                                                 03446000
LCCARV68 EQU   LCCA+543                                                 03447000
LCCAPSMK EQU   LCCA+542                                                 03448000
LCCARV67 EQU   LCCADSF2                                                 03449000
LCCARV66 EQU   LCCADSF2                                                 03450000
LCCARV65 EQU   LCCADSF2                                                 03451000
LCCARV64 EQU   LCCADSF2                                                 03452000
LCCADSRW EQU   LCCADSF2                                                 03453000
LCCADSPL EQU   LCCADSF2                                                 03454000
LCCAGSRB EQU   LCCADSF2                                                 03455000
LCCASRBM EQU   LCCADSF2                                                 03456000
LCCARV61 EQU   LCCADSF1                                                 03457000
LCCARV60 EQU   LCCADSF1                                                 03458000
LCCARV59 EQU   LCCADSF1                                                 03459000
LCCARV58 EQU   LCCADSF1                                                 03460000
LCCATIMR EQU   LCCADSF1                                                 03461000
LCCADSS  EQU   LCCADSF1                                                 03462000
LCCAVCPU EQU   LCCADSF1                                                 03463000
LCCAACR  EQU   LCCADSF1                                                 03464000
LCCAASCP EQU   LCCA+532                                                 03465000
LCCAESSA EQU   LCCA+528                                                 03466000
LCCARV55 EQU   LCCASPN4                                                 03467000
LCCARV54 EQU   LCCASPN4                                                 03468000
LCCARV53 EQU   LCCASPN4                                                 03469000
LCCARV52 EQU   LCCASPN4                                                 03470000
LCCARV51 EQU   LCCASPN4                                                 03471000
LCCARV50 EQU   LCCASPN4                                                 03472000
LCCARV49 EQU   LCCASPN4                                                 03473000
LCCARV48 EQU   LCCASPN4                                                 03474000
LCCARV47 EQU   LCCASPN3                                                 03475000
LCCARV46 EQU   LCCASPN3                                                 03476000
LCCARV45 EQU   LCCASPN3                                                 03477000
LCCARV44 EQU   LCCASPN3                                                 03478000
LCCARV43 EQU   LCCASPN3                                                 03479000
LCCARV42 EQU   LCCASPN3                                                 03480000
LCCARV41 EQU   LCCASPN3                                                 03481000
LCCARV40 EQU   LCCASPN3                                                 03482000
LCCARV39 EQU   LCCASPN2                                                 03483000
LCCARV38 EQU   LCCASPN2                                                 03484000
LCCARV37 EQU   LCCASPN2                                                 03485000
LCCARV36 EQU   LCCASPN2                                                 03486000
LCCARV35 EQU   LCCASPN2                                                 03487000
LCCARV34 EQU   LCCASPN2                                                 03488000
LCCARV33 EQU   LCCASPN2                                                 03489000
LCCARV32 EQU   LCCASPN2                                                 03490000
LCCARV31 EQU   LCCASPN1                                                 03491000
LCCARV30 EQU   LCCASPN1                                                 03492000
LCCAMFIO EQU   LCCASPN1                                                 03493000
LCCARSTR EQU   LCCASPN1                                                 03494000
LCCATSPN EQU   LCCASPN1                                                 03495000
LCCALOCK EQU   LCCASPN1                                                 03496000
LCCASIGP EQU   LCCASPN1                                                 03497000
LCCAPTLB EQU   LCCASPN1                                                 03498000
LCCARV27 EQU   LCCAIHR4                                                 03499000
LCCARV26 EQU   LCCAIHR4                                                 03500000
LCCARV25 EQU   LCCAIHR4                                                 03501000
LCCARV24 EQU   LCCAIHR4                                                 03502000
LCCARV23 EQU   LCCAIHR4                                                 03503000
LCCARV22 EQU   LCCAIHR4                                                 03504000
LCCARV21 EQU   LCCAIHR4                                                 03505000
LCCARV20 EQU   LCCAIHR4                                                 03506000
LCCARV19 EQU   LCCAIHR3                                                 03507000
LCCARV18 EQU   LCCAIHR3                                                 03508000
LCCARV17 EQU   LCCAIHR3                                                 03509000
LCCARV16 EQU   LCCAIHR3                                                 03510000
LCCARV15 EQU   LCCAIHR3                                                 03511000
LCCARV14 EQU   LCCAIHR3                                                 03512000
LCCARV13 EQU   LCCAIHR3                                                 03513000
LCCARV12 EQU   LCCAIHR3                                                 03514000
LCCARV11 EQU   LCCAIHR2                                                 03515000
LCCARV10 EQU   LCCAIHR2                                                 03516000
LCCARV09 EQU   LCCAIHR2                                                 03517000
LCCARV08 EQU   LCCAIHR2                                                 03518000
LCCARV07 EQU   LCCAIHR2                                                 03519000
LCCARV06 EQU   LCCAIHR2                                                 03520000
LCCARV05 EQU   LCCAIHR2                                                 03521000
LCCARV04 EQU   LCCAIHR2                                                 03522000
LCCARV03 EQU   LCCAIHR1                                                 03523000
LCCARV02 EQU   LCCAIHR1                                                 03524000
LCCARV01 EQU   LCCAIHR1                                                 03525000
LCCAPPIE EQU   LCCAIHR1                                                 03526000
LCCAPSG1 EQU   LCCAIHR1                                                 03527000
LCCAPDAT EQU   LCCAIHR1                                                 03528000
LCCAXRC2 EQU   LCCAIHR1                                                 03529000
LCCAXRC1 EQU   LCCAIHR1                                                 03530000
LCCAIOPS EQU   LCCA+512                                                 03531000
LCCAGPGR EQU   LCCA+448                                                 03532000
LCCAR133 EQU   LCCA+444                                                 03533000
LCCAR132 EQU   LCCA+440                                                 03534000
LCCAR131 EQU   LCCA+436                                                 03535000
LCCAR130 EQU   LCCA+432                                                 03536000
LCCAR129 EQU   LCCA+428                                                 03537000
LCCAR128 EQU   LCCA+424                                                 03538000
LCCAR127 EQU   LCCA+420                                                 03539000
LCCAR126 EQU   LCCA+416                                                 03540000
LCCARSGR EQU   LCCA+352                                                 03541000
LCCAXGR3 EQU   LCCA+288                                                 03542000
LCCAXGR2 EQU   LCCA+224                                                 03543000
LCCAXGR1 EQU   LCCA+160                                                 03544000
LCCACR0  EQU   LCCA+156                                                 03545000
LCCAMCR1 EQU   LCCA+152                                                 03546000
LCCAPVAD EQU   LCCA+148                                                 03547000
LCCAPINT EQU   LCCA+144                                                 03548000
LCCAPPSW EQU   LCCA+136                                                 03549000
LCCAPGR2 EQU   LCCA+72                                                  03550000
LCCAPGR1 EQU   LCCA+8                                                   03551000
LCCARV77 EQU   LCCA+6                                                   03552000
LCCACPUA EQU   LCCA+4                                                   03553000
LCCALCCA EQU   LCCA                                                     03554000
WSACASMS EQU   WSAC+60                                                  03555000
WSACASMD EQU   WSAC+56                                                  03556000
WSACCCH  EQU   WSAC+52                                                  03557000
WSACRRSA EQU   WSAC+48                                                  03558000
WSACREST EQU   WSAC+44                                                  03559000
WSACRSTI EQU   WSAC+40                                                  03560000
WSACABTM EQU   WSAC+36                                                  03561000
WSACMF1  EQU   WSAC+32                                                  03562000
WSACEDS0 EQU   WSAC+28                                                  03563000
WSACIOS  EQU   WSAC+24                                                  03564000
WSACRTMK EQU   WSAC+20                                                  03565000
WSACACR  EQU   WSAC+16                                                  03566000
WSACTIME EQU   WSAC+12                                                  03567000
WSACGTF  EQU   WSAC+4                                                   03568000
WSACCWSA EQU   WSAC                                                     03569000
WPOSEND  EQU   WPOD+8                                                   03570000
WPODEND  EQU   WPOD+4                                                   03571000
WPGLEND  EQU   WPGL+4                                                   03572000
WPGPEND  EQU   WPGP+8                                                   03573000
WPGPRB2  EQU   WPGPINDS                                                 03574000
@NM00004 EQU   WPGP+2                                                   03575000
WPGDEND  EQU   WPGD+20                                                  03576000
WPGDPGL  EQU   WPGD+20                                                  03577000
WPGDDURP EQU   WPGDPGP+7                                                03578000
WPGDISVP EQU   WPGDPGP+6                                                03579000
WPGDRTB  EQU   WPGDINDS                                                 03580000
WPGDRB2  EQU   WPGDINDS                                                 03581000
WPGDAPG  EQU   WPGDINDS                                                 03582000
WPGDUNT  EQU   WPGDINDS                                                 03583000
WPGDFIN  EQU   WPGDINDS                                                 03584000
WPGDAPGV EQU   WPGDPGP+4                                                03585000
@NM00003 EQU   WPGDPGP+2                                                03586000
WPGDDMN  EQU   WPGDPGP+1                                                03587000
WPGDOBJN EQU   WPGDPGP                                                  03588000
WPGDISV  EQU   WPGD+8                                                   03589000
WPGDATM  EQU   WPGD+4                                                   03590000
WPGDRD1  EQU   WPGDDFL                                                  03591000
WPGDVLD  EQU   WPGDDFL                                                  03592000
WPGDR02  EQU   WPGD+2                                                   03593000
WPGDSIZ  EQU   WPGD+1                                                   03594000
WPGDPGN  EQU   WPGD                                                     03595000
WMSTEND  EQU   WMST+112                                                 03596000
WMSTIPM  EQU   WMST+108                                                 03597000
WMSTIPI  EQU   WMST+104                                                 03598000
WMSTIPC  EQU   WMST+100                                                 03599000
WMSTSECB EQU   WMST+96                                                  03600000
WMSTNWST EQU   WMST+92                                                  03601000
WMSTSTCB EQU   WMST+88                                                  03602000
WMSTSET  EQU   WMST+84                                                  03603000
WMSTRSVD EQU   WMST+81                                                  03604000
WMSTREAL EQU   WMST+80                                                  03605000
WMSTDMNC EQU   WMST+66                                                  03606000
WMSTPGPC EQU   WMST+64                                                  03607000
WMSTPGHI EQU   WMST+62                                                  03608000
WMSTWLHI EQU   WMST+60                                                  03609000
WMSTDMDE EQU   WMST+56                                                  03610000
WMSTDMVS EQU   WMST+52                                                  03611000
WMSTDMDS EQU   WMST+44                                                  03612000
WMSTDMDT EQU   WMST+40                                                  03613000
WMSTPODS EQU   WMST+36                                                  03614000
WMSTPOVS EQU   WMST+28                                                  03615000
WMSTPGDS EQU   WMST+20                                                  03616000
WMSTPGVS EQU   WMST+12                                                  03617000
WMSTWLLO EQU   WMST+6                                                   03618000
WMSTID   EQU   WMST+4                                                   03619000
WMSTNAME EQU   WMST                                                     03620000
DMDTEND  EQU   DMDT+20                                                  03621000
DMDTRUC  EQU   DMDT+16                                                  03622000
DMDTINCU EQU   DMDT+14                                                  03623000
DMDTOUTU EQU   DMDT+12                                                  03624000
DMDTCMPL EQU   DMDT+10                                                  03625000
DMDTGOOU EQU   DMDT+8                                                   03626000
DMDTRUA  EQU   DMDT+6                                                   03627000
DMDTMPLT EQU   DMDT+4                                                   03628000
DMDTWT   EQU   DMDT+3                                                   03629000
DMDTHI   EQU   DMDT+2                                                   03630000
DMDTLO   EQU   DMDT+1                                                   03631000
DMDTNO   EQU   DMDT                                                     03632000
OUXBEND  EQU   OUXB+144                                                 03633000
OUXBTSW  EQU   OUXB+140                                                 03634000
OUXBFIXC EQU   OUXB+138                                                 03635000
OUXBNVC  EQU   OUXB+136                                                 03636000
OUXBUIC  EQU   OUXB+134                                                 03637000
OUXBVSC  EQU   OUXB+132                                                 03638000
OUXBILS  EQU   OUXB+128                                                 03639000
OUXBRSV1 EQU   OUXB+126                                                 03640000
OUXBWCT  EQU   OUXB+124                                                 03641000
OUXBSTD  EQU   OUXB+116                                                 03642000
OUXBITD  EQU   OUXB+112                                                 03643000
OUXBAET  EQU   OUXB+92                                                  03644000
OUXBNQT  EQU   OUXB+60                                                  03645000
OUXBSTC  EQU   OUXB+54                                                  03646000
OUXBSTCT EQU   OUXB+48                                                  03647000
OUXBCAPR EQU   OUXB+44                                                  03648000
OUXBCAPI EQU   OUXB+40                                                  03649000
OUXBVAMR EQU   OUXB+36                                                  03650000
OUXBVAMO EQU   OUXB+32                                                  03651000
OUXBVAMI EQU   OUXB+28                                                  03652000
OUXBPREC EQU   OUXB+24                                                  03653000
OUXBPOUT EQU   OUXB+20                                                  03654000
OUXBPIN  EQU   OUXB+16                                                  03655000
OUXBRSW  EQU   OUXB+12                                                  03656000
OUXBMET  EQU   OUXB+8                                                   03657000
OUXBPET  EQU   OUXB+4                                                   03658000
OUXBNAME EQU   OUXB                                                     03659000
OUCBEND  EQU   OUCB+136                                                 03660000
OUCBNTSP EQU   OUCB+134                                                 03661000
OUCBNDS  EQU   OUCB+132                                                 03662000
OUCBTIO  EQU   OUCB+128                                                 03663000
OUCBTCP  EQU   OUCB+124                                                 03664000
OUCBPST  EQU   OUCB+120                                                 03665000
OUCBPS2  EQU   OUCBPSS+4                                                03666000
OUCBPS1  EQU   OUCBPSS                                                  03667000
OUCBR03  EQU   OUCB+102                                                 03668000
OUCBIOR  EQU   OUCB+100                                                 03669000
OUCBCMRV EQU   OUCB+88                                                  03670000
OUCBCF2  EQU   OUCBCFL                                                  03671000
OUCBRSM  EQU   OUCBCFL                                                  03672000
OUCBACN  EQU   OUCBCSW                                                  03673000
OUCBACT  EQU   OUCB+80                                                  03674000
OUCBWSS  EQU   OUCB+78                                                  03675000
OUCBPSO  EQU   OUCB+76                                                  03676000
OUCBIMCB EQU   OUCB+44                                                  03677000
OUCBSRC  EQU   OUCB+37                                                  03678000
OUCBR40  EQU   OUCB+30                                                  03679000
OUCBR30  EQU   OUCB+29                                                  03680000
OUCBSPG  EQU   OUCB+28                                                  03681000
OUCBRDP  EQU   OUCB+27                                                  03682000
OUCBRPG  EQU   OUCB+25                                                  03683000
OUCBUF7  EQU   OUCBUFL                                                  03684000
OUCBUF6  EQU   OUCBUFL                                                  03685000
OUCBUF5  EQU   OUCBUFL                                                  03686000
OUCBTSWC EQU   OUCBUFL                                                  03687000
OUCBTSWP EQU   OUCBUFL                                                  03688000
OUCBRSWP EQU   OUCBUFL                                                  03689000
OUCBJSAS EQU   OUCBUFL                                                  03690000
OUCBJSFS EQU   OUCBUFL                                                  03691000
OUCBNQC  EQU   OUCB+22                                                  03692000
OUCBMWT  EQU   OUCBEFL                                                  03693000
OUCBQSC  EQU   OUCBEFL                                                  03694000
OUCBQSS  EQU   OUCBEFL                                                  03695000
OUCBNQF  EQU   OUCBEFL                                                  03696000
OUCBOWT  EQU   OUCBEFL                                                  03697000
OUCBLWT  EQU   OUCBEFL                                                  03698000
OUCBASW  EQU   OUCBAFL                                                  03699000
OUCBNWT  EQU   OUCBAFL                                                  03700000
OUCBR02  EQU   OUCBAFL                                                  03701000
OUCBJSR  EQU   OUCBAFL                                                  03702000
OUCBCPL  EQU   OUCBAFL                                                  03703000
OUCBAF0  EQU   OUCBAFL                                                  03704000
OUCBFXS  EQU   OUCBYFL                                                  03705000
OUCBDTA  EQU   OUCBYFL                                                  03706000
OUCBAXS  EQU   OUCBYFL                                                  03707000
OUCBPSTR EQU   OUCBYFL                                                  03708000
OUCBMNT  EQU   OUCBYFL                                                  03709000
OUCBSTT  EQU   OUCBYFL                                                  03710000
OUCBPSTE EQU   OUCBYFL                                                  03711000
OUCBSCN  EQU   OUCBSFL                                                  03712000
OUCBNSWI EQU   OUCBSFL                                                  03713000
OUCBBIB  EQU   OUCBSFL                                                  03714000
OUCBCTI  EQU   OUCBSFL                                                  03715000
OUCBQF7  EQU   OUCBQFL                                                  03716000
OUCBQF6  EQU   OUCBQFL                                                  03717000
OUCBQF3  EQU   OUCBQFL                                                  03718000
OUCBBCK  EQU   OUCB+8                                                   03719000
ASCBEND  EQU   ASCB+208                                                 03720000
ASCBSRBT EQU   ASCB+200                                                 03721000
ASCBSWTL EQU   ASCB+196                                                 03722000
ASCBRS14 EQU   ASCB+195                                                 03723000
ASCBSMCT EQU   ASCB+194                                                 03724000
ASCBRS12 EQU   ASCB+192                                                 03725000
ASCBPCTT EQU   ASCB+188                                                 03726000
ASCBVGTT EQU   ASCB+184                                                 03727000
ASCBRV43 EQU   ASCBSRQ4                                                 03728000
ASCBRV42 EQU   ASCBSRQ4                                                 03729000
ASCBRV41 EQU   ASCBSRQ4                                                 03730000
ASCBRV40 EQU   ASCBSRQ4                                                 03731000
ASCBRV39 EQU   ASCBSRQ4                                                 03732000
ASCBRV38 EQU   ASCBSRQ4                                                 03733000
ASCBRV37 EQU   ASCBSRQ4                                                 03734000
ASCBRV36 EQU   ASCBSRQ4                                                 03735000
ASCBRV35 EQU   ASCBSRQ3                                                 03736000
ASCBRV34 EQU   ASCBSRQ3                                                 03737000
ASCBRV33 EQU   ASCBSRQ3                                                 03738000
ASCBRV32 EQU   ASCBSRQ3                                                 03739000
ASCBRV31 EQU   ASCBSRQ3                                                 03740000
ASCBRV30 EQU   ASCBSRQ3                                                 03741000
ASCBRV29 EQU   ASCBSRQ3                                                 03742000
ASCBRV28 EQU   ASCBSRQ3                                                 03743000
ASCBRV27 EQU   ASCBSRQ2                                                 03744000
ASCBRV26 EQU   ASCBSRQ2                                                 03745000
ASCBRV25 EQU   ASCBSRQ2                                                 03746000
ASCBRV24 EQU   ASCBSRQ2                                                 03747000
ASCBRV23 EQU   ASCBSRQ2                                                 03748000
ASCBRV22 EQU   ASCBSRQ2                                                 03749000
ASCBRV21 EQU   ASCBSRQ2                                                 03750000
ASCBRV20 EQU   ASCBSRQ2                                                 03751000
ASCBRV19 EQU   ASCBSRQ1                                                 03752000
ASCBRV18 EQU   ASCBSRQ1                                                 03753000
ASCBRV17 EQU   ASCBSRQ1                                                 03754000
ASCBRV16 EQU   ASCBSRQ1                                                 03755000
ASCBRV15 EQU   ASCBSRQ1                                                 03756000
ASCBRV14 EQU   ASCBSRQ1                                                 03757000
ASCBRV13 EQU   ASCBSRQ1                                                 03758000
ASCBSTA  EQU   ASCBSRQ1                                                 03759000
ASCBJBNS EQU   ASCB+176                                                 03760000
ASCBJBNI EQU   ASCB+172                                                 03761000
ASCBMCC  EQU   ASCB+168                                                 03762000
ASCBRTWA EQU   ASCB+164                                                 03763000
ASCBIQEA EQU   ASCB+160                                                 03764000
ASCBXMPQ EQU   ASCB+156                                                 03765000
ASCBRS01 EQU   ASCB+154                                                 03766000
ASCBFMCT EQU   ASCB+152                                                 03767000
ASCBOUCB EQU   ASCB+144                                                 03768000
ASCBMECB EQU   ASCB+140                                                 03769000
ASCBQECB EQU   ASCB+136                                                 03770000
ASCBLSQH EQU   ASCBLKGP+4                                               03771000
ASCBLOCK EQU   ASCBLKGP                                                 03772000
ASCBTCBS EQU   ASCB+124                                                 03773000
ASCBNVSC EQU   ASCB+122                                                 03774000
ASCBVSC  EQU   ASCB+120                                                 03775000
ASCBSRBS EQU   ASCB+118                                                 03776000
ASCBSSRB EQU   ASCB+116                                                 03777000
ASCBRV06 EQU   ASCBFLG2                                                 03778000
ASCBRV05 EQU   ASCBFLG2                                                 03779000
ASCBRV04 EQU   ASCBFLG2                                                 03780000
ASCBSNQS EQU   ASCBFLG2                                                 03781000
ASCBS2S  EQU   ASCBFLG2                                                 03782000
ASCBCEXT EQU   ASCBFLG2                                                 03783000
ASCBPXMT EQU   ASCBFLG2                                                 03784000
ASCBXMPT EQU   ASCBFLG2                                                 03785000
ASCBRF07 EQU   ASCBDSP1                                                 03786000
ASCBRF06 EQU   ASCBDSP1                                                 03787000
ASCBRF05 EQU   ASCBDSP1                                                 03788000
ASCBRF04 EQU   ASCBDSP1                                                 03789000
ASCBRF03 EQU   ASCBDSP1                                                 03790000
ASCBRF02 EQU   ASCBDSP1                                                 03791000
ASCBFAIL EQU   ASCBDSP1                                                 03792000
ASCBNOQ  EQU   ASCBDSP1                                                 03793000
ASCBSWCT EQU   ASCB+112                                                 03794000
ASCBASXB EQU   ASCB+108                                                 03795000
ASCBTMCH EQU   ASCB+104                                                 03796000
ASCBNSWP EQU   ASCBFLG1                                                 03797000
ASCBTYP1 EQU   ASCBFLG1                                                 03798000
ASCBSTND EQU   ASCBFLG1                                                 03799000
ASCBABNT EQU   ASCBFLG1                                                 03800000
ASCBTERM EQU   ASCBFLG1                                                 03801000
ASCBS3S  EQU   ASCBFLG1                                                 03802000
ASCBCMSH EQU   ASCBFLG1                                                 03803000
ASCBTOFF EQU   ASCBFLG1                                                 03804000
ASCBRF01 EQU   ASCBRCTF                                                 03805000
ASCBTMLW EQU   ASCBRCTF                                                 03806000
ASCBOUT  EQU   ASCBRCTF                                                 03807000
ASCBWAIT EQU   ASCBRCTF                                                 03808000
ASCBRV08 EQU   ASCBRCTF                                                 03809000
ASCBFQU  EQU   ASCBRCTF                                                 03810000
ASCBFRS  EQU   ASCBRCTF                                                 03811000
ASCBTMNO EQU   ASCBRCTF                                                 03812000
ASCBAFFN EQU   ASCBFW1                                                  03813000
ASCBDUMP EQU   ASCB+96                                                  03814000
ASCBRV44 EQU   ASCB+92                                                  03815000
ASCBUBET EQU   ASCB+88                                                  03816000
ASCBECB  EQU   ASCB+84                                                  03817000
ASCBJSTL EQU   ASCB+80                                                  03818000
ASCBEWST EQU   ASCB+72                                                  03819000
ASCBTSB  EQU   ASCB+60                                                  03820000
ASCBCSCB EQU   ASCB+56                                                  03821000
ASCBRSMA EQU   ASCBRSM+1                                                03822000
ASCBRV54 EQU   ASCBRSMF                                                 03823000
ASCBRV53 EQU   ASCBRSMF                                                 03824000
ASCBRV52 EQU   ASCBRSMF                                                 03825000
ASCBRV51 EQU   ASCBRSMF                                                 03826000
ASCBVEQR EQU   ASCBRSMF                                                 03827000
ASCBN2LP EQU   ASCBRSMF                                                 03828000
ASCB1LPU EQU   ASCBRSMF                                                 03829000
ASCB2LPU EQU   ASCBRSMF                                                 03830000
ASCBLDA  EQU   ASCB+48                                                  03831000
ASCBSTOR EQU   ASCB+44                                                  03832000
ASCBDP   EQU   ASCB+43                                                  03833000
ASCBRV07 EQU   ASCB+42                                                  03834000
ASCBSEQN EQU   ASCB+38                                                  03835000
ASCBASID EQU   ASCB+36                                                  03836000
ASCBCPUS EQU   ASCB+32                                                  03837000
ASCBSPL  EQU   ASCB+28                                                  03838000
ASCBIOSP EQU   ASCB+24                                                  03839000
ASCBSYNC EQU   ASCBSUPC+4                                               03840000
ASCBSVRB EQU   ASCBSUPC                                                 03841000
ASCBCMSF EQU   ASCB+12                                                  03842000
ASCBBWDP EQU   ASCB+8                                                   03843000
ASCBFWDP EQU   ASCB+4                                                   03844000
ASCBASCB EQU   ASCB                                                     03845000
ASCBEGIN EQU   ASCB                                                     03846000
RRPAEND  EQU   RRPA+24                                                  03847000
RRPARTN  EQU   RRPAINS                                                  03848000
RRPARTC  EQU   RRPA+11                                                  03849000
RRPAKEY  EQU   RRPA+10                                                  03850000
RRPARCI  EQU   RRPAFLG+1                                                03851000
RRPARFI  EQU   RRPAFLG+1                                                03852000
RRPARTI  EQU   RRPAFLG+1                                                03853000
RRPACTL  EQU   RRPAFLG+1                                                03854000
RRPAF11  EQU   RRPAFLG+1                                                03855000
RRPAIPS  EQU   RRPAFLG+1                                                03856000
RRPAF07  EQU   RRPAFLG                                                  03857000
RRPAOPT  EQU   RRPAFLG                                                  03858000
RRPAF05  EQU   RRPAFLG                                                  03859000
RRPAF04  EQU   RRPAFLG                                                  03860000
RRPADSP  EQU   RRPAFLG                                                  03861000
RRPASVC  EQU   RRPAFLG                                                  03862000
RRPAENB  EQU   RRPAFLG                                                  03863000
RRPADSB  EQU   RRPAFLG                                                  03864000
RRPAVLU  EQU   RRPAINP                                                  03865000
@NM00002 EQU   RRPAFLG0                                                 03866000
RRPANSWI EQU   RRPAFLG0                                                 03867000
RRPAASD  EQU   RRPAINC                                                  03868000
EPSTEND  EQU   EPST+80                                                  03869000
EPSTCSI  EQU   RMEPBCSI                                                 03870000
EPSTCSO  EQU   RMEPBCSO                                                 03871000
EPSTCL3  EQU   RMEPBCL3                                                 03872000
EPSTIL3  EQU   RMEPBIL3                                                 03873000
EPSTWM3  EQU   RMEPBWM3                                                 03874000
EPDTEND  EQU   EPDT+96                                                  03875000
RMEPBHIT EQU   EPDT+64                                                  03876000
RMEPBUXB EQU   EPDT+48                                                  03877000
RMEPBIL4 EQU   EPDT+32                                                  03878000
RMEPBDEL EQU   EPDT+16                                                  03879000
RMEPBIPS EQU   EPDT                                                     03880000
EPATEND  EQU   EPAT+400                                                 03881000
RMEPBPR1 EQU   EPAT+368                                                 03882000
RMEPBEQ1 EQU   EPAT+336                                                 03883000
RMEPBAP1 EQU   EPAT+304                                                 03884000
RMEPBCL1 EQU   EPAT+272                                                 03885000
RMEPBWM2 EQU   EPAT+240                                                 03886000
RMEPBIL1 EQU   EPAT+208                                                 03887000
RMEPBASM EQU   EPAT+176                                                 03888000
RMEPBMS2 EQU   EPAT+160                                                 03889000
RMEPBPR5 EQU   EPAT+144                                                 03890000
RMEPBMS6 EQU   EPAT+112                                                 03891000
RMEPBSQA EQU   EPAT+96                                                  03892000
RMEPBRM2 EQU   EPAT+64                                                  03893000
RMEPBRM1 EQU   EPAT+32                                                  03894000
RMSBEND  EQU   RMSB+120                                                 03895000
RMSBRA9  EQU   RMSB+116                                                 03896000
RMSBIL0  EQU   RMSB+112                                                 03897000
RMSBCL0  EQU   RMSB+108                                                 03898000
RMSBRA6  EQU   RMSB+104                                                 03899000
RMSBNOP  EQU   RMSB+100                                                 03900000
RMSBSET  EQU   RMSB+96                                                  03901000
RMSBTRC  EQU   RMSB+84                                                  03902000
RMSBWMY  EQU   RMSB+80                                                  03903000
RMSBWMR  EQU   RMSB+76                                                  03904000
RMSBWMQ  EQU   RMSB+72                                                  03905000
RMSBWMN  EQU   RMSB+64                                                  03906000
RMSBWMK  EQU   RMSB+60                                                  03907000
RMSBCRY  EQU   RMSB+44                                                  03908000
RMSBI10  EQU   RMSB+32                                                  03909000
RMSBI09  EQU   RMSB+28                                                  03910000
RMSBR24  EQU   RMSB+24                                                  03911000
RMSBI07  EQU   RMSB+20                                                  03912000
RMSBI06  EQU   RMSB+16                                                  03913000
RMSBI05  EQU   RMSB+12                                                  03914000
RMSBI04  EQU   RMSB+8                                                   03915000
RMSBI03  EQU   RMSB+4                                                   03916000
RMSBI02  EQU   RMSB                                                     03917000
RMEXEND  EQU   RMEX+64                                                  03918000
RMEXSRE  EQU   RMEX+60                                                  03919000
RMEXXPE  EQU   RMEX+56                                                  03920000
RMEXRR2  EQU   RMEX+52                                                  03921000
RMEXRR1  EQU   RMEX+48                                                  03922000
RMEXI48  EQU   RMEX+44                                                  03923000
RMEXCET  EQU   RMEX+40                                                  03924000
RMEXCXX  EQU   RMEX+36                                                  03925000
RMEXI01  EQU   RMEX+32                                                  03926000
RMEXCTL  EQU   RMEPBCTL                                                 03927000
RMEXEVT  EQU   RMEPBEVT                                                 03928000
RMCAEND  EQU   RMCA+168                                                 03929000
RMCAR90  EQU   RMCA+164                                                 03930000
RMCAUSSC EQU   RMCASRC+36                                               03931000
RMCAEXSC EQU   RMCASRC+32                                               03932000
RMCANQSC EQU   RMCASRC+28                                               03933000
RMCARQSC EQU   RMCASRC+24                                               03934000
RMCADWSC EQU   RMCASRC+20                                               03935000
RMCARSSC EQU   RMCASRC+16                                               03936000
RMCAXSSC EQU   RMCASRC+12                                               03937000
RMCALWSC EQU   RMCASRC+8                                                03938000
RMCATISC EQU   RMCASRC+4                                                03939000
RMCATOSC EQU   RMCASRC                                                  03940000
RMCACPW1 EQU   RMCA+120                                                 03941000
RMCACIUS EQU   RMCA+118                                                 03942000
RMCAR14  EQU   RMCA+116                                                 03943000
RMCAR13  EQU   RMCA+112                                                 03944000
RMCAWKA  EQU   RMCA+80                                                  03945000
RMCAMAS  EQU   RMCA+76                                                  03946000
RMCAR20  EQU   RMCA+74                                                  03947000
RMCABCPG EQU   RMCA+73                                                  03948000
RMCALGPG EQU   RMCA+72                                                  03949000
RMCAR11  EQU   RMCA+68                                                  03950000
RMCAINV  EQU   RMCA+64                                                  03951000
RMCAR10  EQU   RMCA+60                                                  03952000
RMCARSV9 EQU   RMCA+56                                                  03953000
RMCACHU  EQU   RMCA+52                                                  03954000
RMCACHP  EQU   RMCA+48                                                  03955000
RMCARSV8 EQU   RMCA+44                                                  03956000
RMCARSV7 EQU   RMCA+40                                                  03957000
RMCARSVF EQU   RMCAFLGS                                                 03958000
RMCASAAF EQU   RMCAFLGS                                                 03959000
RMCARSV5 EQU   RMCA+32                                                  03960000
RMCARSV4 EQU   RMCA+28                                                  03961000
RMCARSV3 EQU   RMCA+24                                                  03962000
RMCATOI  EQU   RMCA+20                                                  03963000
RMCATRS  EQU   RMCA+16                                                  03964000
RMCATQS  EQU   RMCA+12                                                  03965000
RMCARSV2 EQU   RMCA+10                                                  03966000
RMCARSV1 EQU   RMCA+8                                                   03967000
RMCAINUS EQU   RMCA+6                                                   03968000
RMCAR04  EQU   RMCA+4                                                   03969000
RMCANAME EQU   RMCA                                                     03970000
RMPTEND  EQU   RMPT+72                                                  03971000
RMPTOPE  EQU   RMPT+66                                                  03972000
RMPTOPI  EQU   RMPT+63                                                  03973000
RMPTOPC  EQU   RMPT+60                                                  03974000
RMPTIOET EQU   RMPT+56                                                  03975000
RMPTCPET EQU   RMPT+52                                                  03976000
RMPTSAET EQU   RMPT+44                                                  03977000
RMPTXCHT EQU   RMPT+40                                                  03978000
RMPTRSV3 EQU   RMPT+38                                                  03979000
RMPTRSV2 EQU   RMPT+36                                                  03980000
RMPTRSV1 EQU   RMPT+32                                                  03981000
RMPTTOL  EQU   RMPT+28                                                  03982000
RMPTTOM  EQU   RMPT+24                                                  03983000
RMPTTCS  EQU   RMPT+20                                                  03984000
RMPTIMN  EQU   RMPT+16                                                  03985000
RMPTERV  EQU   RMPT+12                                                  03986000
RMPTIOC  EQU   RMPT+8                                                   03987000
RMPTCPU  EQU   RMPT+4                                                   03988000
RMPTNAME EQU   RMPT                                                     03989000
RCTEND   EQU   RCT+88                                                   03990000
RCVRSVF3 EQU   RCT+84                                                   03991000
RCVRSVF2 EQU   RCT+80                                                   03992000
RCVTAPAD EQU   RCT+76                                                   03993000
RCVRSVF1 EQU   RCT+74                                                   03994000
RCVTOTDF EQU   RCT+72                                                   03995000
RCVBPTTM EQU   RCT+68                                                   03996000
RCVBPTCT EQU   RCT+64                                                   03997000
RCVASMQ  EQU   RCT+60                                                   03998000
RCVAVQP  EQU   RCT+56                                                   03999000
RCVCPUC  EQU   RCT+52                                                   04000000
RCVUICC  EQU   RCT+48                                                   04001000
RCVPTR   EQU   RCT+46                                                   04002000
RCVASMQA EQU   RCT+44                                                   04003000
RCVAVQC  EQU   RCT+42                                                   04004000
RCVCPUA  EQU   RCT+40                                                   04005000
RCVUICA  EQU   RCT+38                                                   04006000
RCVCTMC  EQU   RCT+36                                                   04007000
RCCRSVF3 EQU   RCT+32                                                   04008000
RCCRSVF2 EQU   RCT+28                                                   04009000
RCCRSVF1 EQU   RCT+26                                                   04010000
RCCLCHRR EQU   RCT+24                                                   04011000
RCCLCHUT EQU   RCT+22                                                   04012000
RCCTOTUT EQU   RCT+20                                                   04013000
RCCASMTH EQU   RCT+18                                                   04014000
RCCASMTL EQU   RCT+16                                                   04015000
RCCPTRTH EQU   RCT+14                                                   04016000
RCCPTRTL EQU   RCT+12                                                   04017000
RCCCPUTH EQU   RCT+10                                                   04018000
RCCCPUTL EQU   RCT+8                                                    04019000
RCCUICTH EQU   RCT+6                                                    04020000
RCCUICTL EQU   RCT+4                                                    04021000
RCTRCT   EQU   RCT                                                      04022000
MCTEND   EQU   MCT+96                                                   04023000
MCVRSVF3 EQU   MCT+92                                                   04024000
MCVRSVF2 EQU   MCT+88                                                   04025000
MCVRSVF1 EQU   MCT+84                                                   04026000
MCCINTMX EQU   MCT+80                                                   04027000
MCCPR1IN EQU   MCT+76                                                   04028000
MCCUICIN EQU   MCT+72                                                   04029000
MCCUICBD EQU   MCT+68                                                   04030000
MCTRSVB1 EQU   MCT+67                                                   04031000
MCTXRSVD EQU   MCT+66                                                   04032000
MCTFX2   EQU   MCTOFLGS                                                 04033000
MCTFX1   EQU   MCTOFLGS                                                 04034000
MCTSMS2  EQU   MCTOFLGS                                                 04035000
MCTSMS1  EQU   MCTOFLGS                                                 04036000
MCTAMS2  EQU   MCTOFLGS                                                 04037000
@NM00001 EQU   MCTOFLGS                                                 04038000
MCTASM2  EQU   MCTOFLGS                                                 04039000
MCTASM1  EQU   MCTOFLGS                                                 04040000
MCTSF04  EQU   MCTSFLGS                                                 04041000
MCTFAVQ  EQU   MCTSFLGS                                                 04042000
MCTAVQ1  EQU   MCTSFLGS                                                 04043000
MCTSQA2  EQU   MCTSFLGS                                                 04044000
MCTSQA1  EQU   MCTSFLGS                                                 04045000
MCVAVQC  EQU   MCT+60                                                   04046000
MCVFRCNT EQU   MCT+58                                                   04047000
MCVSTCRI EQU   MCT+56                                                   04048000
MCCEND   EQU   MCT+56                                                   04049000
MCCASMT2 EQU   MCT+54                                                   04050000
MCCASMT1 EQU   MCT+52                                                   04051000
MCCRSVH1 EQU   MCT+50                                                   04052000
MCCPLUS  EQU   MCT+48                                                   04053000
MCCMS403 EQU   MCT+44                                                   04054000
MCCMS402 EQU   MCT+40                                                   04055000
MCCMS401 EQU   MCT+36                                                   04056000
MCCMS400 EQU   MCT+32                                                   04057000
MCCMS203 EQU   MCT+28                                                   04058000
MCCMS202 EQU   MCT+24                                                   04059000
MCCMS201 EQU   MCT+20                                                   04060000
MCCMS200 EQU   MCT+16                                                   04061000
MCCMS102 EQU   MCT+12                                                   04062000
MCCMS101 EQU   MCT+8                                                    04063000
MCCMS100 EQU   MCT+4                                                    04064000
MCTMCT   EQU   MCT                                                      04065000
ICTEND   EQU   ICT+88                                                   04066000
ICTRSVB3 EQU   ICT+87                                                   04067000
ICTRSVB2 EQU   ICT+86                                                   04068000
ICTRSVB1 EQU   ICT+85                                                   04069000
ICT003   EQU   ICTFLAGS                                                 04070000
ICTIOOT  EQU   ICTFLAGS                                                 04071000
ICTIOL   EQU   ICTFLAGS                                                 04072000
ICTDRSV4 EQU   ICTFLAGS                                                 04073000
ICVIRSV3 EQU   ICT+80                                                   04074000
ICVULCBT EQU   ICT+76                                                   04075000
ICVOLCBT EQU   ICT+72                                                   04076000
ICVLCBPT EQU   ICT+68                                                   04077000
ICVLUTBT EQU   ICT+64                                                   04078000
ICCEND   EQU   ICT+64                                                   04079000
ICCRSV01 EQU   ICT+62                                                   04080000
ICCEDSUT EQU   ICT+60                                                   04081000
ICCSRSV2 EQU   ICT+58                                                   04082000
ICCSIGUP EQU   ICT+56                                                   04083000
ICCINDAT EQU   ICT+52                                                   04084000
ICCINLOT EQU   ICT+48                                                   04085000
ICCINHIT EQU   ICT+44                                                   04086000
ICCDAUTH EQU   ICT+42                                                   04087000
ICCLOUTH EQU   ICT+40                                                   04088000
ICCHIUTH EQU   ICT+38                                                   04089000
ICCDASF2 EQU   ICT+36                                                   04090000
ICCDASF1 EQU   ICT+34                                                   04091000
ICCMINRV EQU   ICT+32                                                   04092000
ICCMAXRV EQU   ICT+30                                                   04093000
ICCRVSCF EQU   ICT+28                                                   04094000
ICCMNIOR EQU   ICT+26                                                   04095000
ICCLCHN  EQU   ICT+24                                                   04096000
ICCLCLST EQU   ICT+20                                                   04097000
ICCMNSWP EQU   ICT+16                                                   04098000
ICCMNUIN EQU   ICT+12                                                   04099000
ICCMXICT EQU   ICT+8                                                    04100000
ICCMRSV1 EQU   ICT+4                                                    04101000
ICTICT   EQU   ICT                                                      04102000
CCVEND   EQU   CCT+128                                                  04103000
CCTFLG2  EQU   CCT+125                                                  04104000
CCTCPUOT EQU   CCTFLG1                                                  04105000
CCTALL   EQU   CCTFLG1                                                  04106000
CCVCPUCT EQU   CCT+122                                                  04107000
CCVENQCT EQU   CCT+120                                                  04108000
CCVLGFMC EQU   CCT+118                                                  04109000
CCVLGUTL EQU   CCT+116                                                  04110000
CCVR07   EQU   CCT+114                                                  04111000
CCVR06   EQU   CCT+112                                                  04112000
CCVUTILP EQU   CCT+110                                                  04113000
CCVR05   EQU   CCT+108                                                  04114000
CCVIMBBT EQU   CCT+104                                                  04115000
CCVEJST  EQU   CCT+100                                                  04116000
CCVPGCPF EQU   CCT+96                                                   04117000
CCVRVSWF EQU   CCT+92                                                   04118000
CCVRBSTD EQU   CCT+88                                                   04119000
CCVR04   EQU   CCT+84                                                   04120000
CCVRBSWT EQU   CCT+80                                                   04121000
CCVR03   EQU   CCT+76                                                   04122000
CCCEND   EQU   CCT+76                                                   04123000
CCCRSVH1 EQU   CCT+74                                                   04124000
CCCSCFC2 EQU   CCT+72                                                   04125000
CCCSCFC1 EQU   CCT+70                                                   04126000
CCCR02   EQU   CCT+68                                                   04127000
CCCSIGUR EQU   CCT+66                                                   04128000
CCCSIGDP EQU   CCT+64                                                   04129000
CCCSCFAC EQU   CCT+62                                                   04130000
CCCMINRV EQU   CCT+60                                                   04131000
CCCMAXRV EQU   CCT+58                                                   04132000
CCCLOSCF EQU   CCT+56                                                   04133000
CCCHISCF EQU   CCT+54                                                   04134000
CCCUTLOT EQU   CCT+52                                                   04135000
CCCUTHIT EQU   CCT+50                                                   04136000
CCCAPRHT EQU   CCT+48                                                   04137000
CCCAPRLT EQU   CCT+46                                                   04138000
CCCR01   EQU   CCT+44                                                   04139000
CCCAPLDP EQU   CCT+38                                                   04140000
CCCAPBDP EQU   CCT+36                                                   04141000
CCCAPROT EQU   CCT+34                                                   04142000
CCCAPDIV EQU   CCT+32                                                   04143000
CCCRSVF1 EQU   CCT+28                                                   04144000
CCCMNSIN EQU   CCT+24                                                   04145000
CCCMNUIN EQU   CCT+20                                                   04146000
CCCAPDEL EQU   CCT+16                                                   04147000
CCCAPMAX EQU   CCT+12                                                   04148000
CCCAPMIN EQU   CCT+8                                                    04149000
CCCAPMET EQU   CCT+4                                                    04150000
CCTCCT   EQU   CCT                                                      04151000
RMCTEND  EQU   RMCT+192                                                 04152000
RMCTR50  EQU   RMCT+190                                                 04153000
RMCTDMNC EQU   RMCT+188                                                 04154000
RMCTDMDE EQU   RMCT+184                                                 04155000
RMCTSRBT EQU   RMCT+176                                                 04156000
RMCTOUXB EQU   RMCT+172                                                 04157000
RMCTOUCB EQU   RMCT+168                                                 04158000
RMCTTOCI EQU   RMCT+160                                                 04159000
RMCTCPID EQU   RMCT+156                                                 04160000
RMCTTELM EQU   RMCT+152                                                 04161000
RMCTF09  EQU   RMCTFLGS+1                                               04162000
RMCTMFS  EQU   RMCTFLGS+1                                               04163000
RMCTF07  EQU   RMCTFLGS+1                                               04164000
RMCTF06  EQU   RMCTFLGS                                                 04165000
RMCTRSV2 EQU   RMCTFLGS                                                 04166000
RMCTSTW  EQU   RMCTFLGS                                                 04167000
RMCTRSV1 EQU   RMCTFLGS                                                 04168000
RMCTINIT EQU   RMCTFLGS                                                 04169000
RMCTF03  EQU   RMCTFLGS                                                 04170000
RMCTCPS1 EQU   RMCTFLGS                                                 04171000
RMCTRQSV EQU   RMCT+144                                                 04172000
RMCTALR  EQU   RMCT+140                                                 04173000
RMCTALA  EQU   RMCT+136                                                 04174000
RMCTTOC  EQU   RMCT+128                                                 04175000
RMCTTOD  EQU   RMCT+124                                                 04176000
RMCTTBS  EQU   RMCT+120                                                 04177000
RMCTR10  EQU   RMCT+116                                                 04178000
RMCTWTQE EQU   RMCT+104                                                 04179000
RMCTAQHD EQU   RMCT+100                                                 04180000
RMCTAQCT EQU   RMCT+96                                                  04181000
RMCTTMQE EQU   RMCT+92                                                  04182000
RMCTWAMT EQU   RMCT+88                                                  04183000
RMCTWAST EQU   RMCT+84                                                  04184000
RMCTEPPR EQU   RMCT+80                                                  04185000
RMCTFLTM EQU   RMCT+76                                                  04186000
RMCTEPET EQU   RMCT+72                                                  04187000
RMCTITT  EQU   RMCT+68                                                  04188000
RMCTEPBG EQU   RMCT+60                                                  04189000
RMCTEPAT EQU   RMCT+56                                                  04190000
RMCTEPDT EQU   RMCT+52                                                  04191000
RMCTEPPA EQU   RMCT+48                                                  04192000
RMCTRMSB EQU   RMCT+44                                                  04193000
RMCTRMEX EQU   RMCT+40                                                  04194000
RMCTRMPD EQU   RMCT+36                                                  04195000
RMCTRLCT EQU   RMCT+28                                                  04196000
RMCTRMCA EQU   RMCT+20                                                  04197000
RMCTRMPT EQU   RMCT+16                                                  04198000
RMCTMCT  EQU   RMCT+12                                                  04199000
RMCTICT  EQU   RMCT+8                                                   04200000
RMCTCCT  EQU   RMCT+4                                                   04201000
RMCTNAME EQU   RMCT                                                     04202000
@NM00028 EQU   PSA+3668                                                 04203000
PSASTAK  EQU   PSA+3072                                                 04204000
@NM00027 EQU   PSA+1048                                                 04205000
PSAUSEND EQU   PSA+1048                                                 04206000
PSARV062 EQU   PSA+1044                                                 04207000
PSACDAL  EQU   PSA+1040                                                 04208000
PSAWTCOD EQU   PSA+1036                                                 04209000
PSAATCVT EQU   PSA+1032                                                 04210000
PSAPCPSW EQU   PSA+1024                                                 04211000
PSAPIR2  EQU   PSA+1020                                                 04212000
PSARV059 EQU   PSA+1018                                                 04213000
PSASVC13 EQU   PSA+1016                                                 04214000
PSALSFCC EQU   PSA+1012                                                 04215000
PSASFACC EQU   PSA+1008                                                 04216000
PSASTOP  EQU   PSA+992                                                  04217000
PSASTART EQU   PSA+976                                                  04218000
PSARSPSW EQU   PSA+968                                                  04219000
PSASRPSW EQU   PSA+960                                                  04220000
PSARV045 EQU   PSA+892                                                  04221000
PSARV044 EQU   PSA+888                                                  04222000
PSARV043 EQU   PSA+884                                                  04223000
PSARV042 EQU   PSA+880                                                  04224000
PSARV041 EQU   PSA+876                                                  04225000
PSARV040 EQU   PSA+872                                                  04226000
PSARV025 EQU   PSA+868                                                  04227000
PSADSSED EQU   PSA+868                                                  04228000
PSADSSPR EQU   PSA+864                                                  04229000
PSADSSFW EQU   PSA+860                                                  04230000
PSADSS14 EQU   PSA+856                                                  04231000
PSADSSPP EQU   PSA+848                                                  04232000
PSADSSRP EQU   PSA+840                                                  04233000
PSADSS05 EQU   PSADSSF4                                                 04234000
PSADSS10 EQU   PSADSSF4                                                 04235000
PSADSSVE EQU   PSADSSF4                                                 04236000
PSADSSDE EQU   PSADSSF4                                                 04237000
PSADSSC0 EQU   PSADSSF4                                                 04238000
PSADSSIE EQU   PSADSSF4                                                 04239000
PSADSS12 EQU   PSADSSF4                                                 04240000
PSADSSRC EQU   PSADSSF4                                                 04241000
PSARV057 EQU   PSADSSF3                                                 04242000
PSARV056 EQU   PSADSSF3                                                 04243000
PSARV055 EQU   PSADSSF3                                                 04244000
PSADSSMC EQU   PSADSSF3                                                 04245000
PSADSSRW EQU   PSADSSF3                                                 04246000
PSADSSNM EQU   PSADSSF3                                                 04247000
PSADSSES EQU   PSADSSF3                                                 04248000
PSADSSGP EQU   PSADSSF3                                                 04249000
PSADSSF2 EQU   PSADSSFL+1                                               04250000
PSADSSPI EQU   PSADSSF1                                                 04251000
PSADSSOI EQU   PSADSSF1                                                 04252000
PSADSSSP EQU   PSADSSF1                                                 04253000
PSADSSTP EQU   PSADSSF1                                                 04254000
PSADSSDW EQU   PSADSSF1                                                 04255000
PSADSSDD EQU   PSADSSF1                                                 04256000
PSADSSDM EQU   PSADSSF1                                                 04257000
PSADSSMV EQU   PSADSSF1                                                 04258000
PSADSSTS EQU   PSA+816                                                  04259000
PSADSSWK EQU   PSA+812                                                  04260000
PSADSSR3 EQU   PSA+808                                                  04261000
PSADSSR2 EQU   PSA+804                                                  04262000
PSADSSRS EQU   PSA+800                                                  04263000
PSASTOR  EQU   PSA+796                                                  04264000
PSACPUSA EQU   PSA+794                                                  04265000
PSAVSTAP EQU   PSA+792                                                  04266000
PSAWKVAP EQU   PSA+788                                                  04267000
PSAWKRAP EQU   PSA+784                                                  04268000
PSAMCHIC EQU   PSA+783                                                  04269000
PSARV061 EQU   PSA+782                                                  04270000
PSASYMSK EQU   PSA+781                                                  04271000
PSAMCHFL EQU   PSA+780                                                  04272000
PSACR0   EQU   PSA+776                                                  04273000
PSAPSWSV EQU   PSA+768                                                  04274000
PSALITA  EQU   PSA+764                                                  04275000
PSACLHS  EQU   PSAHLHI                                                  04276000
PSALKR15 EQU   PSALKSA+60                                               04277000
PSALKR14 EQU   PSALKSA+56                                               04278000
PSALKR13 EQU   PSALKSA+52                                               04279000
PSALKR12 EQU   PSALKSA+48                                               04280000
PSALKR11 EQU   PSALKSA+44                                               04281000
PSALKR10 EQU   PSALKSA+40                                               04282000
PSALKR9  EQU   PSALKSA+36                                               04283000
PSALKR8  EQU   PSALKSA+32                                               04284000
PSALKR7  EQU   PSALKSA+28                                               04285000
PSALKR6  EQU   PSALKSA+24                                               04286000
PSALKR5  EQU   PSALKSA+20                                               04287000
PSALKR4  EQU   PSALKSA+16                                               04288000
PSALKR3  EQU   PSALKSA+12                                               04289000
PSALKR2  EQU   PSALKSA+8                                                04290000
PSALKR1  EQU   PSALKSA+4                                                04291000
PSALKR0  EQU   PSALKSA                                                  04292000
PSARV023 EQU   PSACLHT+52                                               04293000
PSALOCAL EQU   PSACLHT+48                                               04294000
PSACMSL  EQU   PSACLHT+44                                               04295000
PSAOPTL  EQU   PSACLHT+40                                               04296000
PSATPACL EQU   PSACLHT+36                                               04297000
PSATPDNL EQU   PSACLHT+32                                               04298000
PSATPNCL EQU   PSACLHT+28                                               04299000
PSAIOSLL EQU   PSACLHT+24                                               04300000
PSAIOSUL EQU   PSACLHT+20                                               04301000
PSAIOSCL EQU   PSACLHT+16                                               04302000
PSAIOSSL EQU   PSACLHT+12                                               04303000
PSASALCL EQU   PSACLHT+8                                                04304000
PSAASML  EQU   PSACLHT+4                                                04305000
PSADISPL EQU   PSACLHT                                                  04306000
PSASRSA  EQU   PSA+636                                                  04307000
PSARV050 EQU   PSA+634                                                  04308000
PSADSSGO EQU   PSA+633                                                  04309000
PSARECUR EQU   PSA+632                                                  04310000
PSAHLHIS EQU   PSA+628                                                  04311000
PSAIPCSA EQU   PSA+624                                                  04312000
@NM00026 EQU   PSA+621                                                  04313000
PSAIPCDM EQU   PSA+620                                                  04314000
PSAIPCD  EQU   PSA+616                                                  04315000
@NM00025 EQU   PSA+613                                                  04316000
PSAIPCRM EQU   PSA+612                                                  04317000
PSAIPCR  EQU   PSA+608                                                  04318000
PSAMCHEX EQU   PSA+600                                                  04319000
PSAMPSW  EQU   PSA+592                                                  04320000
PSAEXPS2 EQU   PSA+584                                                  04321000
PSAEXPS1 EQU   PSA+576                                                  04322000
PSAPIREG EQU   PSA+572                                                  04323000
PSARSREG EQU   PSA+568                                                  04324000
PSAGPREG EQU   PSA+556                                                  04325000
PSARV022 EQU   PSASUP4                                                  04326000
PSARV021 EQU   PSASUP4                                                  04327000
PSARV020 EQU   PSASUP4                                                  04328000
PSARV019 EQU   PSASUP4                                                  04329000
PSARV018 EQU   PSASUP4                                                  04330000
PSARV017 EQU   PSASUP4                                                  04331000
PSARV016 EQU   PSASUP4                                                  04332000
PSARV015 EQU   PSASUP4                                                  04333000
PSARV014 EQU   PSASUP3                                                  04334000
PSAULCMS EQU   PSASUP3                                                  04335000
PSARV012 EQU   PSASUP3                                                  04336000
PSAESTA  EQU   PSASUP3                                                  04337000
PSASPR   EQU   PSASUP3                                                  04338000
PSAPSREG EQU   PSASUP3                                                  04339000
PSAPI2   EQU   PSASUP3                                                  04340000
PSAIOSUP EQU   PSASUP3                                                  04341000
PSALCR   EQU   PSASUP2                                                  04342000
PSARTM   EQU   PSASUP2                                                  04343000
PSAACR   EQU   PSASUP2                                                  04344000
PSAIPCE2 EQU   PSASUP2                                                  04345000
PSAIPCES EQU   PSASUP2                                                  04346000
PSAIPCEC EQU   PSASUP2                                                  04347000
PSAGTF   EQU   PSASUP2                                                  04348000
PSAIPCRI EQU   PSASUP2                                                  04349000
PSATYPE6 EQU   PSASUP1                                                  04350000
PSATCTL  EQU   PSASUP1                                                  04351000
PSADISP  EQU   PSASUP1                                                  04352000
PSALOCK  EQU   PSASUP1                                                  04353000
PSAPI    EQU   PSASUP1                                                  04354000
PSAEXT   EQU   PSASUP1                                                  04355000
PSASVC   EQU   PSASUP1                                                  04356000
PSAIO    EQU   PSASUP1                                                  04357000
PSAAOLD  EQU   PSA+548                                                  04358000
PSAANEW  EQU   PSA+544                                                  04359000
PSATOLD  EQU   PSA+540                                                  04360000
PSATNEW  EQU   PSA+536                                                  04361000
PSALCCAR EQU   PSA+532                                                  04362000
PSAPCCAR EQU   PSA+524                                                  04363000
PSAPCCAV EQU   PSA+520                                                  04364000
PSACPULA EQU   PSA+518                                                  04365000
PSACPUPA EQU   PSA+516                                                  04366000
PSAPSA   EQU   PSA+512                                                  04367000
FLCHDEND EQU   PSA+512                                                  04368000
FLCCRSAV EQU   FLCMCLA+280                                              04369000
FLCGRSAV EQU   FLCMCLA+216                                              04370000
FLCFPSAV EQU   FLCMCLA+184                                              04371000
FLCFLA   EQU   FLCMCLA+88                                               04372000
FLCRGNCD EQU   FLCMCLA+84                                               04373000
FLCFSAA  EQU   FLCFSA+1                                                 04374000
@NM00024 EQU   FLCFSA                                                   04375000
@NM00023 EQU   FLCMCLA+72                                               04376000
FLCMCIC  EQU   FLCMCLA+64                                               04377000
@NM00022 EQU   FLCMCLA+20                                               04378000
FLCIOAA  EQU   FLCIOA+1                                                 04379000
@NM00021 EQU   FLCIOA                                                   04380000
@NM00020 EQU   FLCMCLA+15                                               04381000
@NM00019 EQU   FLCMCLA+14                                               04382000
@NM00018 EQU   FLCMCLA+12                                               04383000
FLCLCL   EQU   FLCMCLA+8                                                04384000
FLCIOELA EQU   FLCIOEL+1                                                04385000
@NM00017 EQU   FLCIOEL                                                  04386000
FLCCHNID EQU   FLCMCLA                                                  04387000
@NM00016 EQU   PSA+160                                                  04388000
FLCMTRCD EQU   PSA+157                                                  04389000
@NM00015 EQU   PSA+156                                                  04390000
FLCPERA  EQU   FLCPER+1                                                 04391000
@NM00014 EQU   FLCPER                                                   04392000
@NM00013 EQU   PSA+151                                                  04393000
FLCPERCD EQU   PSA+150                                                  04394000
FLCMCNUM EQU   PSA+149                                                  04395000
@NM00012 EQU   PSA+148                                                  04396000
FLCTEAA  EQU   FLCTEA+1                                                 04397000
@NM00011 EQU   FLCTEA                                                   04398000
PSAPIPC  EQU   PSAPICOD                                                 04399000
PSAPIMC  EQU   PSAPICOD                                                 04400000
PSAPIPER EQU   PSAPICOD                                                 04401000
PSARV049 EQU   FLCPICOD                                                 04402000
FLCPILCB EQU   FLCPIILC                                                 04403000
@NM00010 EQU   FLCPIILC                                                 04404000
@NM00009 EQU   PSAEPPSW                                                 04405000
FLCSVCN  EQU   PSAESPSW+2                                               04406000
FLCSILCB EQU   FLCSVILC                                                 04407000
@NM00008 EQU   FLCSVILC                                                 04408000
@NM00007 EQU   PSAESPSW                                                 04409000
FLCEICOD EQU   PSAEEPSW+2                                               04410000
PSASPAD  EQU   PSAEEPSW                                                 04411000
@NM00006 EQU   PSA+128                                                  04412000
FLCINPSW EQU   PSA+120                                                  04413000
FLCMNPSW EQU   PSA+112                                                  04414000
FLCPNPSW EQU   PSA+104                                                  04415000
FLCSNPSW EQU   PSA+96                                                   04416000
FLCENPSW EQU   PSA+88                                                   04417000
FLCTRACE EQU   PSA+84                                                   04418000
FLCTIMER EQU   PSA+80                                                   04419000
FLCCVT2  EQU   PSA+76                                                   04420000
FLCCAW   EQU   PSA+72                                                   04421000
FLCCSW   EQU   PSA+64                                                   04422000
FLCIOPSW EQU   PSA+56                                                   04423000
FLCMOPSW EQU   PSA+48                                                   04424000
FLCPOPSW EQU   PSA+40                                                   04425000
FLCSOPSW EQU   PSA+32                                                   04426000
FLCEOPSW EQU   PSA+24                                                   04427000
@NM00005 EQU   FLCICCW2+4                                               04428000
FLCICCW1 EQU   FLCROPSW                                                 04429000
FLCIPPSW EQU   FLCRNPSW                                                 04430000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      04431000
@RF00133 EQU   @RC00129                                                 04432000
@RF00187 EQU   @RC00184                                                 04433000
@RF00176 EQU   @EL00002                                                 04434000
@RT00392 EQU   IRARMWME                                                 04435000
@RT00408 EQU   IRARMWMB                                                 04436000
@RC00466 EQU   @RC00461                                                 04437000
@ENDDATA EQU   *                                                        04438000
         END   IRARMWLM,(C'PLS2213',0701,78024)                         04439000
