         TITLE 'ILRCMP01, I/O COMPLETION RECOVERY                      *00001000
                        '                                               00002000
ILRCMP01 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ILRCMP01  76.091'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  BALR  @10,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@10                                         0001 00012000
*                                      WORKAREA & RETURN ADDRESS     */ 00013000
*   DATARG=R0;                      /* SET UP DATA REGISTER          */ 00014000
         LR    DATARG,R0                                           0110 00015000
*   RFY                                                            0111 00016000
*     R0 UNRSTD;                    /* RELEASE REG 0                 */ 00017000
*   GEN( USING @DATD,DATARG);       /* SET UP ADDRESSABILITY TO DATA    00018000
*                                      AREA                          */ 00019000
          USING @DATD,DATARG                                            00020000
*   ADATA=''B;                      /* ZERO DATA AREA                */ 00021000
         XC    ADATA(200,DATARG),ADATA(DATARG)                     0113 00022000
*   SAVERTN=R14;                    /* SAVE RETURN ADDRESS           */ 00023000
         ST    R14,SAVERTN                                         0114 00024000
*   RFY                                                            0115 00025000
*     R14 UNRSTD;                   /* RELEASE REG14                 */ 00026000
*   RFY                                                            0116 00027000
*     ATAPTR RSTD;                  /* RESTRICT ATA POINTER          */ 00028000
*   ATAPTR=SDWAPARM;                /* SET UP ADDRESS OF ATA         */ 00029000
         L     ATAPTR,SDWAPARM(,SDWAPTR)                           0117 00030000
*   SDWAVRA(1:LENGTH(ATA))=ATA;     /* MOVE ATA TO SDWA              */ 00031000
         MVC   SDWAVRA(24,SDWAPTR),ATA(ATAPTR)                     0118 00032000
*   URAL=LENGTH(ATA);               /* SET LENGTH OF AREA USED       */ 00033000
         MVI   URAL(SDWAPTR),X'18'                                 0119 00034000
*   DO;                             /* SETRP RC(0)RECPARM(MODID)RECOR   00035000
*                                      D(YES)FRELOCK(SALLOC)         */ 00036000
*     RESPECIFY                                                    0121 00037000
*      (GPR00P,                                                    0121 00038000
*       GPR01P,                                                    0121 00039000
*       GPR14P,                                                    0121 00040000
*       GPR15P) RSTD;                                              0121 00041000
*     GPR01P->SDWARCDE=0;           /* SAVE RC VALUE                 */ 00042000
         MVI   SDWARCDE(GPR01P),X'00'                              0122 00043000
*     GPR01P->SDWARCRD='1'B;        /* TURN ON RECORD INDICATOR      */ 00044000
         OI    SDWARCRD(GPR01P),B'10000000'                        0123 00045000
*     GPR15P=ADDR(MODID);           /* ACCESS RECORD PARAMETER LIST  */ 00046000
         LA    GPR15P,MODID                                        0124 00047000
*     GPR01P->SDWARECP=GPR15P->I256C(1:24);/* COPY RECORD PARAMETERS */ 00048000
         MVC   SDWARECP(24,GPR01P),I256C(GPR15P)                   0125 00049000
*     GPR01P->SDWAACF3=GPR01P->SDWAACF3|'00000100'B;/* INITIALIZE  0126 00050000
*                                      LOCK FLAGS                    */ 00051000
         OI    SDWAACF3(GPR01P),B'00000100'                        0126 00052000
*     RESPECIFY                                                    0127 00053000
*      (GPR00P,                                                    0127 00054000
*       GPR01P,                                                    0127 00055000
*       GPR14P,                                                    0127 00056000
*       GPR15P) UNRSTD;                                            0127 00057000
*   END;                            /* INDICATE CONTINUE           0128 00058000
*                                      WITHTTERMINATION, RECORD    0128 00059000
*                                      MODULE NAMES, INDICATE RECORD    00060000
*                                      ERROR, AND FREE SALLOC LOCK,     00061000
*                                      IF HELD                       */ 00062000
*                                                                  0129 00063000
*   /*****************************************************************/ 00064000
*   /*                                                               */ 00065000
*   /* VALIDITY CHECK IOSB                                           */ 00066000
*   /*                                                               */ 00067000
*   /*****************************************************************/ 00068000
*                                                                  0129 00069000
*   IF ATAIOSB=ZERO                 /* IOSB CHECKPOINTED?            */ 00070000
*     THEN                                                         0129 00071000
         L     @12,ATAIOSB(,ATAPTR)                                0129 00072000
         LTR   @12,@12                                             0129 00073000
         BZ    @RT00129                                            0129 00074000
*     GOTO EXIT;                    /* NO, RETURN TO RTM             */ 00075000
*   RFY                                                            0131 00076000
*    (R2,                                                          0131 00077000
*     R3,                                                          0131 00078000
*     R4,                                                          0131 00079000
*     R5,                                                          0131 00080000
*     R6,                                                          0131 00081000
*     R7) RSTD;                     /* REGS 2-7 DESTROYED ACROSS CALL*/ 00082000
*   RFY                                                            0132 00083000
*    (ELEMENT,                                                     0132 00084000
*     R14,                                                         0132 00085000
*     RETCODE) RSTD;                /* RESTRICT INTERFACE REGS       */ 00086000
*   ELEMENT=ATAIOSB->IOSUSE;        /* SET UP ADDRESS OF IORB        */ 00087000
         L     ELEMENT,IOSUSE(,@12)                                0133 00088000
*   CALL ILRVIORB;                  /* VALIDITY CHECK IORB-IOSB-SRB  */ 00089000
         L     @15,@CV02109                                        0134 00090000
         BALR  @14,@15                                             0134 00091000
*   RFY                                                            0135 00092000
*    (ELEMENT,                                                     0135 00093000
*     R2,                                                          0135 00094000
*     R3,                                                          0135 00095000
*     R4,                                                          0135 00096000
*     R5,                                                          0135 00097000
*     R6,                                                          0135 00098000
*     R7) UNRSTD;                   /* RELEASE REGS                  */ 00099000
*   IF RETCODE^=ZERO                /* VALIDITY CHECK SUCCESSFULLY?  */ 00100000
*     THEN                                                         0136 00101000
         SLR   @12,@12                                             0136 00102000
         CR    RETCODE,@12                                         0136 00103000
         BE    @RF00136                                            0136 00104000
*     DO;                           /* NO, RETURN TO RTM             */ 00105000
*       ATAIOSB=ZERO;               /* SET UP SO PART MONITOR AND/OR    00106000
*                                      SWAP DRIVER WILL BE SCHEDULED */ 00107000
         ST    @12,ATAIOSB(,ATAPTR)                                0138 00108000
*       GOTO EXIT;                  /* GO TO EXIT LOGIC              */ 00109000
         B     EXIT                                                0139 00110000
*     END;                          /* END OF INVALID IOSB           */ 00111000
*   RFY                                                            0141 00112000
*    (R14,                                                         0141 00113000
*     RETCODE) UNRSTD;              /* RELEASE REGS                  */ 00114000
@RF00136 DS    0H                                                  0142 00115000
*                                                                  0142 00116000
*   /*****************************************************************/ 00117000
*   /*                                                               */ 00118000
*   /* IORB-IOSB-SRB VALID - CHECK FOR RECORD ONLY ABEND             */ 00119000
*   /*                                                               */ 00120000
*   /*****************************************************************/ 00121000
*                                                                  0142 00122000
*   RFY                                                            0142 00123000
*     IOSBPTR RSTD;                 /* RESTRICT REG                  */ 00124000
*   IOSBPTR=ATAIOSB;                /* SET UP ADDRESS OF IOSB        */ 00125000
         L     IOSBPTR,ATAIOSB(,ATAPTR)                            0143 00126000
*   IF SYSCODE=RECONLY              /* X'084'- RECORD ONLY ABEND ?   */ 00127000
*     THEN                                                         0144 00128000
         MVC   @TS00001(2),SYSCODE(SDWAPTR)                        0144 00129000
         NC    @TS00001(2),@CB02173                                0144 00130000
         CLC   @TS00001(2),@CB02175                                0144 00131000
         BNE   @RF00144                                            0144 00132000
*     DO;                           /* YES, RECORD INFO FROM IOSB IN    00133000
*                                      VARIABLE RECORDING AREA       */ 00134000
*       IF(URAL+LENGTH(RECAREA))<=VRAL/* ENOUGH ROOM IN SDWA TO    0146 00135000
*                                      RECORD IOSB FIELDS ?          */ 00136000
*         THEN                                                     0146 00137000
         SLR   @08,@08                                             0146 00138000
         IC    @08,URAL(,SDWAPTR)                                  0146 00139000
         LA    @15,32                                              0146 00140000
         ALR   @15,@08                                             0146 00141000
         SLR   @00,@00                                             0146 00142000
         ICM   @00,3,VRAL(SDWAPTR)                                 0146 00143000
         CR    @15,@00                                             0146 00144000
         BH    @RF00146                                            0146 00145000
*         DO;                       /* YES, RECORD                   */ 00146000
*           RFY                                                    0148 00147000
*             RECPTR RSTD;          /* RESTRICT REG WHILE RECORDING  */ 00148000
*           RECPTR=ADDR(SDWAVRA)+URAL;/* POINT TO AVAILABLE AREA IN     00149000
*                                      RECORDING AREA                */ 00150000
         LA    RECPTR,SDWAVRA(,SDWAPTR)                            0149 00151000
         ALR   RECPTR,@08                                          0149 00152000
*           RECCOD=IOSCOD;          /* RECORD IOS COMPLETION CODE    */ 00153000
         MVC   RECCOD(1,RECPTR),IOSCOD(IOSBPTR)                    0150 00154000
*           RECUCB=RUCBCSW;         /* RECORD UCB ADDRESS AND CSW    */ 00155000
         MVC   RECUCB(19,RECPTR),RUCBCSW(IOSBPTR)                  0151 00156000
*           RECSEEK=IOSEEK;         /* RECORD FULL SEEK ADDRESS      */ 00157000
         MVC   RECSEEK(8,RECPTR),IOSEEK(IOSBPTR)                   0152 00158000
*           RECVST=IOSVST;          /* RECORD STARTING ADDRESS OF  0153 00159000
*                                      CHANNEL PROGRAM               */ 00160000
         MVC   RECVST(4,RECPTR),IOSVST(IOSBPTR)                    0153 00161000
*           RFY                                                    0154 00162000
*             RECPTR UNRSTD;        /* RELEASE REGISTER              */ 00163000
*           URAL=URAL+LENGTH(RECAREA);/* UPDATE LENGTH OF USER     0155 00164000
*                                      SUPPLIED INFORMATION          */ 00165000
         STC   @15,URAL(,SDWAPTR)                                  0155 00166000
*         END;                      /* END OF RECORDING              */ 00167000
*       ELSE                                                       0157 00168000
*         ;                         /* NO RECORDING IF NOT ENOUGH  0157 00169000
*                                      ROOM                          */ 00170000
@RF00146 DS    0H                                                  0158 00171000
*     END;                          /* END FOR RECORD ONLY ABEND     */ 00172000
*   ELSE                                                           0159 00173000
*     ;                             /* FALL INTO COMMON PROCESSING   */ 00174000
@RF00144 DS    0H                                                  0160 00175000
*                                                                  0160 00176000
*   /*****************************************************************/ 00177000
*   /*                                                               */ 00178000
*   /* VERIFY CHECKPOINTED QUEUES BEFORE STARTING RECOVERY PROCESSING*/ 00179000
*   /*                                                               */ 00180000
*   /*****************************************************************/ 00181000
*                                                                  0160 00182000
*   RFY                                                            0160 00183000
*     ASMVTPTR RSTD;                /* RESTRICT REG                  */ 00184000
*   ASMVTPTR=CVTASMVT;              /* SET UP ASMVT ADDRESS          */ 00185000
         L     @08,CVTPTR                                          0161 00186000
         L     ASMVTPTR,CVTASMVT(,@08)                             0161 00187000
*   RFY                                                            0162 00188000
*     QWKAREA RSTD;                 /* RESTRICT REG FOR VERIFICATION    00189000
*                                      CALLS                         */ 00190000
*   QWKAREA=ADDR(QVWKAREA);         /* SET UP ADDRESS OF WORKAREA    */ 00191000
         LA    QWKAREA,QVWKAREA                                    0163 00192000
*   RFY                                                            0164 00193000
*     SAVEPTR RSTD;                 /* RESTRICT REG FOR CALLS        */ 00194000
*   SAVEPTR=ADDR(SAVEREGS);         /* SET UP SAVE AREA ADDRESS      */ 00195000
         LA    SAVEPTR,SAVEREGS                                    0165 00196000
*   RFY                                                            0166 00197000
*    (QANCHOR,                                                     0166 00198000
*     R14,                                                         0166 00199000
*     RETCODE) RSTD;                /* RESTRICT INTERFACE REGS       */ 00200000
*   QANCHOR=ADDR(ATACOMPQ);         /* QUEUE OF AIAS FOR ILRPAGCM    */ 00201000
         LA    QANCHOR,ATACOMPQ(,ATAPTR)                           0167 00202000
*   RFY                                                            0168 00203000
*    (R5,                                                          0168 00204000
*     R6,                                                          0168 00205000
*     R7) RSTD;                     /* REGS 5-7 DESTROYED ACROSS CALL*/ 00206000
*   CALL ILRVAIAQ;                  /* VALIDITY CHECK QUEUE OF AIAS     00207000
*                                      TO BE RETURNED TO ILRPAGCM    */ 00208000
         L     @15,@CV02111                                        0169 00209000
         BALR  @14,@15                                             0169 00210000
*   RFY                                                            0170 00211000
*    (R5,                                                          0170 00212000
*     R6,                                                          0170 00213000
*     R7) UNRSTD;                   /* RELEASE REGS                  */ 00214000
*   RFY                                                            0171 00215000
*    (QANCHOR,                                                     0171 00216000
*     R14,                                                         0171 00217000
*     RETCODE) UNRSTD;              /* RELEASE INTERFACE REGS        */ 00218000
*   RFY                                                            0172 00219000
*    (QVERRTNP) RSTD;               /* RESTRICT REGS                 */ 00220000
*   IF IORSWAP=ON                   /* SWAP OR PAGE DATA SET ?       */ 00221000
*     THEN                                                         0173 00222000
         L     @05,IORBPTR(,IOSBPTR)                               0173 00223000
         TM    IORSWAP(@05),B'00001000'                            0173 00224000
         BNO   @RF00173                                            0173 00225000
*     DO;                           /* SWAP DATA SET                 */ 00226000
*       QVERRTNP=ADDR(ILRVSCWQ);    /* SET UP VERIFICATION RTN     0175 00227000
*                                      ADDRESS TO SCCW QUEUE       0175 00228000
*                                      VERIFICATION RTN              */ 00229000
         L     QVERRTNP,@CV02112                                   0175 00230000
*       AVAILQP=ADDR(SARSCCWQ);     /* SCCWS GO ON SART QUEUE WHEN 0176 00231000
*                                      FREE                          */ 00232000
         L     @05,SARTPTR(,ASMVTPTR)                              0176 00233000
         LA    @05,SARSCCWQ(,@05)                                  0176 00234000
         ST    @05,AVAILQP                                         0176 00235000
*     END;                          /* END OF SPECIAL SWAP CODE      */ 00236000
*   ELSE                                                           0178 00237000
*     DO;                           /* PAGE DATA SET                 */ 00238000
         B     @RC00173                                            0178 00239000
@RF00173 DS    0H                                                  0179 00240000
*       QVERRTNP=ADDR(ILRVPCWQ);    /* SET UP VERIFICATION ROUTINE 0179 00241000
*                                      ADDRESS TO ADDRESS OF PCCW  0179 00242000
*                                      QUEUE VERIFICATION ROUTINE    */ 00243000
         L     QVERRTNP,@CV02113                                   0179 00244000
*       AVAILQP=ADDR(ASMPCCWA);     /* PCCWS GO ON ASMVT QUEUE WHEN     00245000
*                                      FREE                          */ 00246000
         LA    @05,ASMPCCWA(,ASMVTPTR)                             0180 00247000
         ST    @05,AVAILQP                                         0180 00248000
*     END;                          /* END OF SPECIAL PAGE CODE      */ 00249000
*   RFY                                                            0182 00250000
*     ASMVTPTR UNRSTD;              /* RELEASE REG                   */ 00251000
@RC00173 DS    0H                                                  0183 00252000
*                                                                  0183 00253000
*   /*****************************************************************/ 00254000
*   /*                                                               */ 00255000
*   /* VERIFY CHECKPOINTED PCCW/SCCW QUEUES                          */ 00256000
*   /*                                                               */ 00257000
*   /*****************************************************************/ 00258000
*                                                                  0183 00259000
*   RFY                                                            0183 00260000
*    (QANCHOR,                                                     0183 00261000
*     R14,                                                         0183 00262000
*     RETCODE) RSTD;                /* RESTRICT INTERFACE REGS       */ 00263000
*   QANCHOR=ADDR(ATAPCCWQ);         /* QUEUE OF FREE PCCWS OR SCCWS  */ 00264000
         LA    QANCHOR,ATAPCCWQ(,ATAPTR)                           0184 00265000
*   RFY                                                            0185 00266000
*    (R5,                                                          0185 00267000
*     R6,                                                          0185 00268000
*     R7) RSTD;                     /* REGS 5-7 DESTROYED ACROSS CALL*/ 00269000
*   CALL QVERRTN;                   /* VALIDITY CHECK QUEUE OF FREE     00270000
*                                      PCCWS OR SCCWS                */ 00271000
         LR    @15,QVERRTNP                                        0186 00272000
         BALR  @14,@15                                             0186 00273000
*   QANCHOR=ADDR(ATACPCCW);         /* QUEUE OF CURRENT PCCWS OR   0187 00274000
*                                      SCCWS                         */ 00275000
         LA    QANCHOR,ATACPCCW(,ATAPTR)                           0187 00276000
*   CALL QVERRTN;                   /* VALIDITY CHECK QUEUE OF     0188 00277000
*                                      CURRENT PCCWS OR SCCWS        */ 00278000
         LR    @15,QVERRTNP                                        0188 00279000
         BALR  @14,@15                                             0188 00280000
*   QANCHOR=ADDR(IORPCCW);          /* QUEUE REMAINING ON IORB       */ 00281000
         L     @03,IORBPTR(,IOSBPTR)                               0189 00282000
         LA    QANCHOR,IORPCCW(,@03)                               0189 00283000
*   CALL QVERRTN;                   /* VALIDITY CHECK QUEUE OF PCCWS    00284000
*                                      OR SCCWS ON IORB              */ 00285000
         LR    @15,QVERRTNP                                        0190 00286000
         BALR  @14,@15                                             0190 00287000
*   RFY                                                            0191 00288000
*    (R5,                                                          0191 00289000
*     R6,                                                          0191 00290000
*     R7) UNRSTD;                   /* RELEASE REGISTERS             */ 00291000
*   RFY                                                            0192 00292000
*    (QANCHOR,                                                     0192 00293000
*     R14,                                                         0192 00294000
*     RETCODE) UNRSTD;              /* RELEASE INTERFACE REGISTERS   */ 00295000
*   RFY                                                            0193 00296000
*     SAVEPTR UNRSTD;               /* RELEASE REG                   */ 00297000
*   RFY                                                            0194 00298000
*    (QVERRTNP,                                                    0194 00299000
*     QWKAREA) UNRSTD;              /* RELEASE REGS ONLY USED DURING    00300000
*                                      QUEUE VERIFICATION            */ 00301000
*                                                                  0194 00302000
*   /*****************************************************************/ 00303000
*   /*                                                               */ 00304000
*   /* END OF QUEUE VERIFICATIONS                                    */ 00305000
*   /*                                                               */ 00306000
*   /*****************************************************************/ 00307000
*                                                                  0195 00308000
*                                                                  0195 00309000
*   /*****************************************************************/ 00310000
*   /*                                                               */ 00311000
*   /* COMPLETE PROCESSING FOR CURRENT SCCW(S) OR PCCW(S)            */ 00312000
*   /*                                                               */ 00313000
*   /*****************************************************************/ 00314000
*                                                                  0195 00315000
*   IF ATACPCCW^=ZERO               /* CURRENT PCCW/SCCW CHECKPOINTED   00316000
*                                      ?                             */ 00317000
*     THEN                                                         0195 00318000
         L     @08,ATACPCCW(,ATAPTR)                               0195 00319000
         LTR   @08,@08                                             0195 00320000
         BZ    @RF00195                                            0195 00321000
*     IF(ATACPCCW=ATAPCCWQ)|        /* CURRENT PCCW/SCCW SAME AS   0196 00322000
*                                      PCCW/SCCW ON AVAILABLE QUEUE ?*/ 00323000
*         (ATACPCCW=IORPCCW)        /* OR CURRENT PCCW/SCCW SAME AS     00324000
*                                      PCCW/SCCW ON IORB?            */ 00325000
*       THEN                                                       0196 00326000
         C     @08,ATAPCCWQ(,ATAPTR)                               0196 00327000
         BE    @RT00196                                            0196 00328000
         L     @15,IORBPTR(,IOSBPTR)                               0196 00329000
         C     @08,IORPCCW(,@15)                                   0196 00330000
         BNE   @RF00196                                            0196 00331000
@RT00196 DS    0H                                                  0197 00332000
*       ATACPCCW=ZERO;              /* DO NOT PROCESS CURRENT      0197 00333000
*                                      PCCW/SCCW, CANNOT CHANCE    0197 00334000
*                                      PROCESSING A PCCW OR SCCW   0197 00335000
*                                      TWICE                         */ 00336000
         SLR   @08,@08                                             0197 00337000
         ST    @08,ATACPCCW(,ATAPTR)                               0197 00338000
*     ELSE                                                         0198 00339000
*       DO;                         /* CURRENT PCCW/SCCW NOT ON TWO     00340000
*                                      QUEUES                        */ 00341000
         B     @RC00196                                            0198 00342000
@RF00196 DS    0H                                                  0199 00343000
*         IF(IORPCCW^=ZERO)         /* SHOULD CHAIN FIELD IN CURRENT    00344000
*                                      SCCW/PCCW BE ZEROED - CHECK TO   00345000
*                                      SEE IF MAINLINE WAS IN THE  0199 00346000
*                                      PROCESS OF TAKING THE       0199 00347000
*                                      PCCW/SCCW OFF THE IORB        */ 00348000
*           THEN                                                   0199 00349000
         SLR   @08,@08                                             0199 00350000
         L     @15,IORBPTR(,IOSBPTR)                               0199 00351000
         C     @08,IORPCCW(,@15)                                   0199 00352000
         BE    @RF00199                                            0199 00353000
*           ATACPCCW->PCCWPCCW=ZERO;/* YES, ZERO CHAIN FIELD OF    0200 00354000
*                                      PCCW/SCCW                     */ 00355000
         L     @15,ATACPCCW(,ATAPTR)                               0200 00356000
         ST    @08,PCCWPCCW(,@15)                                  0200 00357000
*         IF(ATACPCCW->PCCWAIA)=ATACOMPQ/* CHECK IF AIA IS ON TWO  0201 00358000
*                                      QUEUES ?                      */ 00359000
*           THEN                                                   0201 00360000
@RF00199 L     @08,ATACPCCW(,ATAPTR)                               0201 00361000
         CLC   PCCWAIA(4,@08),ATACOMPQ(ATAPTR)                     0201 00362000
         BNE   @RF00201                                            0201 00363000
*           ATACPCCW->PCCWAIA=ZERO; /* YES, ZERO CURRENT AIA ADDRESS */ 00364000
         SLR   @00,@00                                             0202 00365000
         ST    @00,PCCWAIA(,@08)                                   0202 00366000
*         DO WHILE ATACPCCW^=ZERO;  /* LOOP THROUGH POSSIBLE CHAIN OF   00367000
*                                      PCCW/SCCWS TO PUT AIAS ON   0203 00368000
*                                      COMPLETION QUEUE AND        0203 00369000
*                                      PCCWS/SCCWS ON AVAILABLE QUEUE*/ 00370000
@RF00201 B     @DE00203                                            0203 00371000
@DL00203 DS    0H                                                  0204 00372000
*           IF ATACPCCW->PCCWAIA^=ZERO/* AIA POINTER STILL IN      0204 00373000
*                                      PCCW/SCCW ?                   */ 00374000
*             THEN                                                 0204 00375000
         L     @08,ATACPCCW(,ATAPTR)                               0204 00376000
         L     @08,PCCWAIA(,@08)                                   0204 00377000
         LTR   @08,@08                                             0204 00378000
         BZ    @RF00204                                            0204 00379000
*             DO;                   /* YES, PROCESS AIA              */ 00380000
*               RFY                                                0206 00381000
*                (ELEMENT,                                         0206 00382000
*                 R14,                                             0206 00383000
*                 RETCODE) RSTD;    /* RESTRICT INTERFACE REGS       */ 00384000
*               ELEMENT=ATACPCCW->PCCWAIA;/* SET UP ADDRESS OF AIA   */ 00385000
         LR    ELEMENT,@08                                         0207 00386000
*               RFY                                                0208 00387000
*                (R2,                                              0208 00388000
*                 R3,                                              0208 00389000
*                 R4,                                              0208 00390000
*                 R5,                                              0208 00391000
*                 R6,                                              0208 00392000
*                 R7) RSTD;         /* REGS 2-7 DESTROYED ACROSS CALL*/ 00393000
*               CALL ILRVAIA;       /* VALIDITY CHECK AIA            */ 00394000
         L     @15,@CV02110                                        0209 00395000
         BALR  @14,@15                                             0209 00396000
*               RFY                                                0210 00397000
*                (R2,                                              0210 00398000
*                 R3,                                              0210 00399000
*                 R4,                                              0210 00400000
*                 R5,                                              0210 00401000
*                 R6,                                              0210 00402000
*                 R7) UNRSTD;       /* RELEASE REGS                  */ 00403000
*               IF RETCODE=ZERO     /* AIA VALID?                    */ 00404000
*                 THEN                                             0211 00405000
         LTR   RETCODE,RETCODE                                     0211 00406000
         BNZ   @RF00211                                            0211 00407000
*                 DO;               /* YES, MARK AIA RETRY           */ 00408000
*                                                                  0212 00409000
*                   /*************************************************/ 00410000
*                   /*                                               */ 00411000
*                   /* AIA SHOULD NOT HAVE ANY OTHER ERROR FLAGS ON, */ 00412000
*                   /* AIAIORTY WILL CAUSE AIA TO BE REPROCESSED     */ 00413000
*                   /* THROUGH ASM                                   */ 00414000
*                   /*                                               */ 00415000
*                   /*************************************************/ 00416000
*                                                                  0213 00417000
*                   AIAPTR=ELEMENT; /* SET UP AIA POINTER            */ 00418000
         LR    AIAPTR,ELEMENT                                      0213 00419000
*                   AIAIORTY=ON;    /* MARK AIA FOR RETRY            */ 00420000
         OI    AIAIORTY(AIAPTR),B'00100000'                        0214 00421000
*                   AIANXAIA=ATACOMPQ;/* CHAIN AIA TO COMPLETION   0215 00422000
*                                      QUEUE                         */ 00423000
         MVC   AIANXAIA(4,AIAPTR),ATACOMPQ(ATAPTR)                 0215 00424000
*                   ATACOMPQ=AIAPTR;/* PUT AIA ON TOP OF COMPLETION     00425000
*                                      QUEUE                         */ 00426000
         ST    AIAPTR,ATACOMPQ(,ATAPTR)                            0216 00427000
*                 END;              /* END OF PROCESSING AIA         */ 00428000
*               RFY                                                0218 00429000
*                (ELEMENT,                                         0218 00430000
*                 R14,                                             0218 00431000
*                 RETCODE) UNRSTD;  /* RELEASE REGS                  */ 00432000
@RF00211 DS    0H                                                  0219 00433000
*             END;                  /* END OF AIA POINTER IN       0219 00434000
*                                      PCCW/SCCW                     */ 00435000
*           ATACPCCW->PCCWAIA=ZERO; /* ZERO AIA POINTER IN SCCW/PCCW    00436000
*                                      BEFORE PUTTING SCCW/PCCW ON 0220 00437000
*                                      AVAILABLE QUEUE               */ 00438000
@RF00204 L     @08,ATACPCCW(,ATAPTR)                               0220 00439000
         SLR   @03,@03                                             0220 00440000
         ST    @03,PCCWAIA(,@08)                                   0220 00441000
*           PCCWPTR=ATACPCCW->PCCWPCCW;/* SAVE POINTER TO NEXT     0221 00442000
*                                      PCCW/SCCW                     */ 00443000
         L     PCCWPTR,PCCWPCCW(,@08)                              0221 00444000
*           ATACPCCW->PCCWPCCW=ATAPCCWQ;/* CHAIN PCCW/SCCW TO      0222 00445000
*                                      AVAILABLE QUEUE               */ 00446000
         MVC   PCCWPCCW(4,@08),ATAPCCWQ(ATAPTR)                    0222 00447000
*           ATAPCCWQ=ATACPCCW;      /* MAKE PCCW/SCCW FIRST ON     0223 00448000
*                                      AVAILABLE QUEUE               */ 00449000
         ST    @08,ATAPCCWQ(,ATAPTR)                               0223 00450000
*           ATACPCCW=PCCWPTR;       /* SET UP TO PROCESS THE NEXT  0224 00451000
*                                      PCCW OR SCCW                  */ 00452000
         ST    PCCWPTR,ATACPCCW(,ATAPTR)                           0224 00453000
*         END;                      /* END OF LOOP TO PROCESS CURRENT   00454000
*                                      QUEUE OF SCCWS/PCCWS          */ 00455000
@DE00203 ICM   @08,15,ATACPCCW(ATAPTR)                             0225 00456000
         BNZ   @DL00203                                            0225 00457000
*       END;                        /* END OF PROCESSING CURRENT   0226 00458000
*                                      SCCW(S) OR PCCW(S)            */ 00459000
*                                                                  0227 00460000
*   /*****************************************************************/ 00461000
*   /*                                                               */ 00462000
*   /* REMOVE QUEUED AIAS FROM ATA AND PUT ON PART ERROR QUEUE       */ 00463000
*   /*                                                               */ 00464000
*   /*****************************************************************/ 00465000
*                                                                  0227 00466000
*   RFY                                                            0227 00467000
*     ASMVTPTR RSTD;                /* RESTRICT REG                  */ 00468000
@RC00196 DS    0H                                                  0227 00469000
@RF00195 DS    0H                                                  0228 00470000
*   ASMVTPTR=CVTASMVT;              /* SET UP ADDRESS OF ASMVT       */ 00471000
         L     @08,CVTPTR                                          0228 00472000
         L     ASMVTPTR,CVTASMVT(,@08)                             0228 00473000
*   RFY                                                            0229 00474000
*    (COMPV,                                                       0229 00475000
*     REPLV) RSTD;                  /* RESTRICT REGS FOR C & S       */ 00476000
*   IF ATACOMPQ^=ZERO               /* ANY AIAS FOR ILRPAGCM ?       */ 00477000
*     THEN                                                         0230 00478000
         L     @08,ATACOMPQ(,ATAPTR)                               0230 00479000
         LTR   @08,@08                                             0230 00480000
         BZ    @RF00230                                            0230 00481000
*     DO;                           /* YES, PUT AIAS ON PART ERROR 0231 00482000
*                                      QUEUE                         */ 00483000
*       REPLV=ATACOMPQ;             /* MAKE INTERNAL ATA QUEUE OF  0232 00484000
*                                      AIAS FIRST ON PART ERROR QUEUE*/ 00485000
         LR    REPLV,@08                                           0232 00486000
*       LASTPTR=ATACOMPQ;           /* SET UP TO FIND LAST AIA       */ 00487000
         LR    LASTPTR,@08                                         0233 00488000
*       DO WHILE(LASTPTR->AIANXAIA)^=ZERO;                         0234 00489000
         B     @DE00234                                            0234 00490000
@DL00234 DS    0H                                                  0235 00491000
*         LASTPTR=LASTPTR->AIANXAIA;/* CHECK NEXT AIA FOR LAST       */ 00492000
         L     LASTPTR,AIANXAIA(,LASTPTR)                          0235 00493000
*       END;                        /* LASTPTR WILL POINT TO LAST AIA   00494000
*                                      ON QUEUE                      */ 00495000
@DE00234 ICM   @08,15,AIANXAIA(LASTPTR)                            0236 00496000
         BNZ   @DL00234                                            0236 00497000
*       COMPV=PARTAIAE;             /* PICK UP FIRST AIA ON PARTAIAE */ 00498000
         L     @08,PARTPTR(,ASMVTPTR)                              0237 00499000
         L     COMPV,PARTAIAE(,@08)                                0237 00500000
*ERRORQ:                                                           0238 00501000
*       ;                           /* RETRY POINT FOR C & S         */ 00502000
ERRORQ   DS    0H                                                  0239 00503000
*       LASTPTR->AIANXAIA=COMPV;    /* CHAIN THIS QUEUE TO QUEUE   0239 00504000
*                                      ALREADY ON PART ERROR QUEUE   */ 00505000
         ST    COMPV,AIANXAIA(,LASTPTR)                            0239 00506000
*       CS(COMPV,REPLV,PARTAIAE);   /* PUT AIAS ON ERROR QUEUE       */ 00507000
         L     @04,PARTPTR(,ASMVTPTR)                              0240 00508000
         CS    COMPV,@05,PARTAIAE(@04)                             0240 00509000
*       BC(NE,ERRORQ);              /* IF C & S FAILS, RETRY AGAIN   */ 00510000
         BC    7,ERRORQ                                            0241 00511000
*       SCHFLG=ON;                  /* INDICATE SCHEDULE PART MONITOR*/ 00512000
         OI    SCHFLG,B'10000000'                                  0242 00513000
*     END;                          /* END OF PROCESSING FOR ATACOMPQ*/ 00514000
*                                                                  0244 00515000
*   /*****************************************************************/ 00516000
*   /*                                                               */ 00517000
*   /* REMOVE AVAILABLE PCCWS/SCCWS AND PUT ON APPROPRIATE QUEUE     */ 00518000
*   /*                                                               */ 00519000
*   /*****************************************************************/ 00520000
*                                                                  0244 00521000
*   IF ATAPCCWQ^=ZERO               /* ANY AVAILABLE PCCWS/SCCWS ?   */ 00522000
*     THEN                                                         0244 00523000
@RF00230 L     @08,ATAPCCWQ(,ATAPTR)                               0244 00524000
         LTR   @08,@08                                             0244 00525000
         BZ    @RF00244                                            0244 00526000
*     DO;                           /* YES, PUT ON APPROPRIATE QUEUE */ 00527000
*       REPLV=ATAPCCWQ;             /* MAKE QUEUE OF PCCWS/SCCWS IN     00528000
*                                      ATA FIRST ON APPROPRIATE QUEUE*/ 00529000
         LR    REPLV,@08                                           0246 00530000
*       LASTPTR=ATAPCCWQ;           /* SET UP TO FIND LAST SCCW/PCCW */ 00531000
         LR    LASTPTR,@08                                         0247 00532000
*       DO WHILE(LASTPTR->PCCWPCCW)^=ZERO;/* FIND LAST               */ 00533000
         B     @DE00248                                            0248 00534000
@DL00248 DS    0H                                                  0249 00535000
*         LASTPTR=LASTPTR->PCCWPCCW;/* CHECK NEXT FOR LAST           */ 00536000
         L     LASTPTR,PCCWPCCW(,LASTPTR)                          0249 00537000
*       END;                        /* LASTPTR WILL POINT TO LAST  0250 00538000
*                                      PCCW/SCCW                     */ 00539000
@DE00248 ICM   @08,15,PCCWPCCW(LASTPTR)                            0250 00540000
         BNZ   @DL00248                                            0250 00541000
*       COMPV=AVAILQ;               /* GET FIRST SCCW/PCCW ON      0251 00542000
*                                      AVAILABLE Q                   */ 00543000
         L     @08,AVAILQP                                         0251 00544000
         L     COMPV,AVAILQ(,@08)                                  0251 00545000
*AVAIL:                                                            0252 00546000
*       ;                           /* RETRY POINT FOR C & S         */ 00547000
AVAIL    DS    0H                                                  0253 00548000
*       LASTPTR->PCCWPCCW=COMPV;    /* CHAIN AVAILABLE QUEUE TO QUEUE   00549000
*                                      OF SCCWS/PCCWS IN ATA         */ 00550000
         ST    COMPV,PCCWPCCW(,LASTPTR)                            0253 00551000
*       CS(COMPV,REPLV,AVAILQ);     /* PUT ELEMENTS ON QUEUE         */ 00552000
         L     @04,AVAILQP                                         0254 00553000
         CS    COMPV,@05,AVAILQ(@04)                               0254 00554000
*       BC(NE,AVAIL);               /* RETRY IF C & S UNSUCCESSFUL   */ 00555000
         BC    7,AVAIL                                             0255 00556000
*     END;                          /* END OF PROCESSING ATAPCCWQ    */ 00557000
*   RFY                                                            0257 00558000
*    (COMPV,                                                       0257 00559000
*     REPLV) UNRSTD;                /* RELEASE REGS                  */ 00560000
*                                                                  0257 00561000
@RF00244 DS    0H                                                  0258 00562000
*   /*****************************************************************/ 00563000
*   /*                                                               */ 00564000
*   /* END OF QUEUE PROCESSING                                       */ 00565000
*   /*                                                               */ 00566000
*   /*****************************************************************/ 00567000
*                                                                  0258 00568000
*                                                                  0258 00569000
*   /*****************************************************************/ 00570000
*   /*                                                               */ 00571000
*   /* DETERMINE IF SECOND ENTRY TO DIE- MUST FREE IORB              */ 00572000
*   /*                                                               */ 00573000
*   /*****************************************************************/ 00574000
*                                                                  0258 00575000
*   IF ATAMODID=ATAMCMPD            /* DIE ENTRY POINT?              */ 00576000
*       &IOSDIESE=ON                /* AND SECOND ENTRY?             */ 00577000
*     THEN                                                         0258 00578000
         CLI   ATAMODID(ATAPTR),9                                  0258 00579000
         BNE   @RF00258                                            0258 00580000
         TM    IOSDIESE(IOSBPTR),B'10000000'                       0258 00581000
         BNO   @RF00258                                            0258 00582000
*     DO;                           /* YES, MUST DO SPECIAL        0259 00583000
*                                      PROCESSING                    */ 00584000
*       IORFUSE=OFF;                /* MAKE IORB AVAILABLE           */ 00585000
         L     @08,IORBPTR(,IOSBPTR)                               0260 00586000
         NI    IORFUSE(@08),B'01111111'                            0260 00587000
*       ATAIOSB=ZERO;               /* MAKE IOSB ADDRESS ZERO SO THAT   00588000
*                                      CHKSCH WILL SCHEDULE PART   0261 00589000
*                                      MONITOR AND SWAP DRIVER       */ 00590000
         SLR   @08,@08                                             0261 00591000
         ST    @08,ATAIOSB(,ATAPTR)                                0261 00592000
*     END;                          /* END OF SPECIAL PROCESSING FOR    00593000
*                                      SECOND ENTRY TO THE DIE       */ 00594000
*                                                                  0263 00595000
*   /*****************************************************************/ 00596000
*   /*                                                               */ 00597000
*   /* SCHEDULE ILRCMP IF TERMINATION ROUTINE WAS IN CONTROL AT TIME */ 00598000
*   /* OF ERROR                                                      */ 00599000
*   /*                                                               */ 00600000
*   /*****************************************************************/ 00601000
*                                                                  0263 00602000
*   ELSE                                                           0263 00603000
*     IF ATAMODID=ATAMCMP           /* ILRCMP IN CONTROL AT ERROR    */ 00604000
*       THEN                                                       0263 00605000
         B     @RC00258                                            0263 00606000
@RF00258 CLI   ATAMODID(ATAPTR),12                                 0263 00607000
         BNE   @RF00263                                            0263 00608000
*       DO;                         /* YES, SCHEDULE CMP WITH 45 CODE*/ 00609000
*         RFY                                                      0265 00610000
*          (PARMPTR,                                               0265 00611000
*           R14,                                                   0265 00612000
*           R15) RSTD;              /* RESTRICT INTERFACE REGS       */ 00613000
*         IOSCOD=IOSABNC;           /* SET X'45' CODE IN IOSB        */ 00614000
         MVI   IOSCOD(IOSBPTR),X'45'                               0266 00615000
*         PARMPTR=IOSSRB;           /* SET UP SRB FOR SCHEDULE       */ 00616000
         L     PARMPTR,IOSSRB(,IOSBPTR)                            0267 00617000
*         PARMPTR->SRBEP=ASMPCMP;   /* SET UP ADDRESS OF CMP         */ 00618000
         MVC   SRBEP(4,PARMPTR),ASMPCMP(ASMVTPTR)                  0268 00619000
*         GEN(SCHEDULE SRB=(1),SCOPE=GLOBAL)                       0269 00620000
*         REFS(CVTGSMQ,SRBFLNK,SRBSECT);/* SCHEDULE ILRCMP           */ 00621000
         SCHEDULE SRB=(1),SCOPE=GLOBAL                                  00622000
*         RFY                                                      0270 00623000
*          (PARMPTR,                                               0270 00624000
*           R14,                                                   0270 00625000
*           R15) UNRSTD;            /* RELEASE REGS                  */ 00626000
*       END;                        /* END OF PROCESSING IF IN ILRCMP*/ 00627000
*                                                                  0272 00628000
*   /*****************************************************************/ 00629000
*   /*                                                               */ 00630000
*   /* MAKE ONE LAST ATTEMPT TO ISSUE ERROR MESSAGE IF ABEND OCCURRED*/ 00631000
*   /* DURING BAD PACK PROCESSING                                    */ 00632000
*   /*                                                               */ 00633000
*   /*****************************************************************/ 00634000
*                                                                  0272 00635000
*     ELSE                                                         0272 00636000
*       IF ATABADPK=ON              /* IN BADPACK PROCESSING IN    0272 00637000
*                                      ILRCMPAE                      */ 00638000
*         THEN                                                     0272 00639000
         B     @RC00263                                            0272 00640000
@RF00263 TM    ATABADPK(ATAPTR),B'00100000'                        0272 00641000
         BNO   @RF00272                                            0272 00642000
*         DO;                       /* YES, TRY TO COMPLETE ISSUING     00643000
*                                      OF MSG                        */ 00644000
*           PSARTE=IORPARTE;        /* SET UP ADDRESS OF PART ENTRY     00645000
*                                      OR SART ENTRY                 */ 00646000
         L     @08,IORBPTR(,IOSBPTR)                               0274 00647000
         MVC   PSARTE(4),IORPARTE(@08)                             0274 00648000
*           IF IORSWAP=ON           /* SWAP REQUEST?                 */ 00649000
*             THEN                                                 0275 00650000
         TM    IORSWAP(@08),B'00001000'                            0275 00651000
         BNO   @RF00275                                            0275 00652000
*             MSGTYPE=SWAP;         /* SET SWAP INDICATOR            */ 00653000
         MVC   MSGTYPE(2),@CH00043                                 0276 00654000
*           RFY                                                    0277 00655000
*            (R11,                                                 0277 00656000
*             R12,                                                 0277 00657000
*             R13,                                                 0277 00658000
*             R14) RSTD;            /* REGS 11-14 DESTROYED ACROSS 0277 00659000
*                                      SETLOCK OBTAIN SALLOC LOCK -     00660000
*                                      LOCK WILL BE FREED BY RTM WHEN   00661000
*                                      CONTROL IS RETURNED. LOCK MAY    00662000
*                                      ALREADY BE HELD               */ 00663000
@RF00275 DS    0H                                                  0278 00664000
*           GENERATE DEFS(OBTSALC) REFS(PSALITA);                  0278 00665000
OBTSALC SETLOCK OBTAIN,TYPE=SALLOC,MODE=UNCOND,                       **00666000
               RELATED=(PAGE/SWAP,ILRCMP01(RELSALC))                    00667000
*           RFY                                                    0279 00668000
*            (R11,                                                 0279 00669000
*             R12,                                                 0279 00670000
*             R13,                                                 0279 00671000
*             R14) UNRSTD;          /* RELEASE REGS                  */ 00672000
*           ATAPTR=SDWAPARM;        /* RESTORE ATA ADDRESS           */ 00673000
         L     ATAPTR,SDWAPARM(,SDWAPTR)                           0280 00674000
*           IOSBPTR=ATAIOSB;        /* RESTORE IOSB ADDRESS          */ 00675000
         L     IOSBPTR,ATAIOSB(,ATAPTR)                            0281 00676000
*           PAREDSBD=ON;            /* UNCONDITIONALLY TURN ON DATA     00677000
*                                      SET BAD FLAG- WILL PREVENT  0282 00678000
*                                      ERROR MSG FROM BEING ISSUED 0282 00679000
*                                      AGAIN                         */ 00680000
         L     @08,IORBPTR(,IOSBPTR)                               0282 00681000
         L     @08,PAREPTR(,@08)                                   0282 00682000
         OI    PAREDSBD(@08),B'01000000'                           0282 00683000
*           RFY                                                    0283 00684000
*            (SAVEPTR,                                             0283 00685000
*             PARMPTR) RSTD;        /* RESTRICT PARM REGS            */ 00686000
*           SAVEPTR=ADDR(SAVEREGS); /* SET UP SAVE AREA PTR          */ 00687000
         LA    SAVEPTR,SAVEREGS                                    0284 00688000
*           PARMPTR=ADDR(MSGLIST);  /* PARAMETER LIST                */ 00689000
         LA    PARMPTR,MSGLIST                                     0285 00690000
*           CALL ILRMSG00;          /* CALL ASM MESSAGE ROUTINE      */ 00691000
         L     @15,@CV02108                                        0286 00692000
         BALR  @14,@15                                             0286 00693000
*           RFY                                                    0287 00694000
*            (SAVEPTR,                                             0287 00695000
*             PARMPTR) UNRSTD;      /* RELEASE REGS                  */ 00696000
*         END;                      /* END OF BAD PACK PROCESSING    */ 00697000
*EXIT:                                                             0289 00698000
*   ;                               /* EXIT PROCESSING FOR ILRCMP01  */ 00699000
*                                                                  0289 00700000
@RF00272 DS    0H                                                  0289 00701000
@RC00263 DS    0H                                                  0289 00702000
@RC00258 DS    0H                                                  0289 00703000
EXIT     DS    0H                                                  0290 00704000
*   /*****************************************************************/ 00705000
*   /*                                                               */ 00706000
*   /* SCHEDULE PART MONITOR IF SCHEDULE FLAG SET, OR IOSB NOT       */ 00707000
*   /* CHECKPOINTED, OR IOSB NOT VALID. THIS SPECIAL SCHEDULE IS     */ 00708000
*   /* NECESSARY IN ORDER TO INSURE THAT THE I/O SUBSYSTEM AND SWAP  */ 00709000
*   /* DRIVER CONTINUE TO PROCESS EVEN IF WE LOSE THE IOSB BEING     */ 00710000
*   /* PROCESSED. THE IOS FRR WILL NOT SCHEDULE POST STATUS IF AN    */ 00711000
*   /* ERROR OCCURS DURING THE SECOND ENTRY TO THE DIE OR THE        */ 00712000
*   /* TERMINATION ROUTINE.                                          */ 00713000
*   /*                                                               */ 00714000
*   /*****************************************************************/ 00715000
*                                                                  0290 00716000
*   RFY                                                            0290 00717000
*     ASMVTPTR RSTD;                /* RESTRICT REG                  */ 00718000
*   ASMVTPTR=CVTASMVT;              /* SET UP ADDRESS OF ASMVT       */ 00719000
         L     @08,CVTPTR                                          0291 00720000
         L     ASMVTPTR,CVTASMVT(,@08)                             0291 00721000
*   IF ATAIOSB=ZERO                 /* IOSB NOT CHECKPOINTED OR    0292 00722000
*                                      INVALID,                      */ 00723000
*     THEN                                                         0292 00724000
         SLR   @08,@08                                             0292 00725000
         C     @08,ATAIOSB(,ATAPTR)                                0292 00726000
         BNE   @RF00292                                            0292 00727000
*     DO;                           /* YES, SPECIAL-CASE TRY TO    0293 00728000
*                                      SCHEDULE PART MONITOR AND SWAP   00729000
*                                      DRIVER TO KEEP THEM GOING     */ 00730000
*       SCHFLG=ON;                  /* INDICATE SCHEDULE PART MONITOR*/ 00731000
         OI    SCHFLG,B'10000000'                                  0294 00732000
*       IF SARUSE^=ZERO             /* SWAP DATA SETS BEING USED?    */ 00733000
*         THEN                                                     0295 00734000
         L     @02,SARTPTR(,ASMVTPTR)                              0295 00735000
         C     @08,SARUSE(,@02)                                    0295 00736000
         BE    @RF00295                                            0295 00737000
*         DO;                       /* YES, TRY TO SCHEDULE SWAP DRV */ 00738000
*           RFY                                                    0297 00739000
*            (COMPV,                                               0297 00740000
*             REPLV) RSTD;          /* RESTRICT REGS                 */ 00741000
*           IF SARSRBCT=NOSCHED     /* SWAP DRIVER ALREADY SCHEDULED?*/ 00742000
*             THEN                                                 0298 00743000
         C     @08,SARSRBCT(,@02)                                  0298 00744000
         BNE   @RF00298                                            0298 00745000
*             DO;                   /* NO, TRY TO SCHEDULE           */ 00746000
*               COMPV=NOSCHED;      /* SRB COUNT SHOULD BE ZERO      */ 00747000
         SLR   COMPV,COMPV                                         0300 00748000
*               REPLV=SCHED;        /* IF NOT SCHEDULED, SET COUNT TO   00749000
*                                      ONE TO INDICATE IT IS       0301 00750000
*                                      SCHEDULED                     */ 00751000
         LA    REPLV,1                                             0301 00752000
*               CS(COMPV,REPLV,SARSRBCT);/* TRY TO SET SRB SCHEDULED    00753000
*                                      COUNT                         */ 00754000
         CS    COMPV,@05,SARSRBCT(@02)                             0302 00755000
*               BC(NE,SWPSCHED);    /* DO NOT SCHEDULE IF ALREADY  0303 00756000
*                                      SCHEDULED                     */ 00757000
         BC    7,SWPSCHED                                          0303 00758000
*               RFY                                                0304 00759000
*                (PARMPTR,                                         0304 00760000
*                 R14,                                             0304 00761000
*                 R15) RSTD;        /* RESTRICT INTERFACE REGS       */ 00762000
*               PARMPTR=SARSRBP;    /* GET ADDRESS OF SWAP DRIVER SRB*/ 00763000
         L     @08,SARTPTR(,ASMVTPTR)                              0305 00764000
         L     PARMPTR,SARSRBP(,@08)                               0305 00765000
*               GEN(SCHEDULE SRB=(1),SCOPE=GLOBAL)                 0306 00766000
*               REFS(CVTGSMQ,SRBFLNK,SRBSECT,CVTMAP,CVTPTR);/*     0306 00767000
*                                      SCHEDULE SWAP DRIVER          */ 00768000
         SCHEDULE SRB=(1),SCOPE=GLOBAL                                  00769000
*               RFY                                                0307 00770000
*                (PARMPTR,                                         0307 00771000
*                 R14,                                             0307 00772000
*                 R15) UNRSTD;      /* RELEASE REGS                  */ 00773000
*             END;                  /* END OF SWAP DRIVER SCHEDULE   */ 00774000
*SWPSCHED:                                                         0309 00775000
*           ;                       /* LABEL FOR UNSUCCESSFUL ATTEMPT   00776000
*                                      TO SCHEDULE SWAP DRIVER       */ 00777000
@RF00298 DS    0H                                                  0309 00778000
SWPSCHED DS    0H                                                  0310 00779000
*           RFY                                                    0310 00780000
*            (COMPV,                                               0310 00781000
*             REPLV) UNRSTD;        /* RELEASE REGS                  */ 00782000
*         END;                      /* END OF PROCESSING FOR SWAP  0311 00783000
*                                      DATA SETS                     */ 00784000
*     END;                          /* END FOR PROCESSING FOR IOSB 0312 00785000
*                                      NOT CHECKPOINTED              */ 00786000
@RF00295 DS    0H                                                  0313 00787000
*                                                                  0313 00788000
*   /*****************************************************************/ 00789000
*   /*                                                               */ 00790000
*   /* SCHEDULE PART MONITOR IF INDICATED- SCHFLG WILL BE ON IF AIAS */ 00791000
*   /* HAVE BEEN ADDED TO THE PARTAIAE QUEUE OR IF THE IOSB PTR WAS  */ 00792000
*   /* ZERO                                                          */ 00793000
*   /*                                                               */ 00794000
*   /*****************************************************************/ 00795000
*                                                                  0313 00796000
*   IF SCHFLG=ON                    /* PART MONITOR TO BE SCHEDULED? */ 00797000
*     THEN                                                         0313 00798000
@RF00292 TM    SCHFLG,B'10000000'                                  0313 00799000
         BNO   @RF00313                                            0313 00800000
*     DO;                           /* YES, SCHEDULE PART MONITOR    */ 00801000
*       RFY                                                        0315 00802000
*        (COMPV,                                                   0315 00803000
*         REPLV) RSTD;              /* RESTRICT REGS                 */ 00804000
*       IF ASMSRBCT=NOSCHED         /* PART MONITOR ALREADY        0316 00805000
*                                      SCHEDULED?                    */ 00806000
*         THEN                                                     0316 00807000
         ICM   @08,15,ASMSRBCT(ASMVTPTR)                           0316 00808000
         BNZ   @RF00316                                            0316 00809000
*         DO;                       /* NO, TRY TO SCHEDULE           */ 00810000
*           COMPV=NOSCHED;          /* SRB COUNT SHOULD BE ZERO      */ 00811000
         SLR   COMPV,COMPV                                         0318 00812000
*           REPLV=SCHED;            /* IF NOT SCHEDULED, SET COUNT TO   00813000
*                                      ONE TO INDICATE IT IS       0319 00814000
*                                      SCHEDULED                     */ 00815000
         LA    REPLV,1                                             0319 00816000
*           CS(COMPV,REPLV,ASMSRBCT);/* TRY TO SET SRB SCHEDULED   0320 00817000
*                                      COUNT                         */ 00818000
         CS    COMPV,@05,ASMSRBCT(ASMVTPTR)                        0320 00819000
*           BC(NE,NOTSCHED);        /* DO NOT SCHEDULE IF ALREADY  0321 00820000
*                                      SCHEDULED                     */ 00821000
         BC    7,NOTSCHED                                          0321 00822000
*           RFY                                                    0322 00823000
*            (PARMPTR,                                             0322 00824000
*             R14,                                                 0322 00825000
*             R15) RSTD;            /* RESTRICT INTERFACE REGS       */ 00826000
*           PARMPTR=ASMPSRB;        /* GET ADDRESS OF PART MONITOR 0323 00827000
*                                      SRB                           */ 00828000
         L     PARMPTR,ASMPSRB(,ASMVTPTR)                          0323 00829000
*           GEN(SCHEDULE SRB=(1),SCOPE=GLOBAL)                     0324 00830000
*           REFS(CVTGSMQ,SRBFLNK,SRBSECT,CVTMAP,CVTPTR);/* SCHEDULE     00831000
*                                      PART MONITOR                  */ 00832000
         SCHEDULE SRB=(1),SCOPE=GLOBAL                                  00833000
*           RFY                                                    0325 00834000
*            (PARMPTR,                                             0325 00835000
*             R14,                                                 0325 00836000
*             R15) UNRSTD;          /* RELEASE REGS                  */ 00837000
*         END;                      /* END FOR SCHEDULING PART     0326 00838000
*                                      MONITOR                       */ 00839000
*NOTSCHED:                                                         0327 00840000
*       ;                           /* LABEL FOR UNSUCCESSFUL ATTEMPT   00841000
*                                      TO SCHEDULE PART MONITOR      */ 00842000
@RF00316 DS    0H                                                  0327 00843000
NOTSCHED DS    0H                                                  0328 00844000
*       RFY                                                        0328 00845000
*        (COMPV,                                                   0328 00846000
*         REPLV) UNRSTD;            /* RELEASE REGS                  */ 00847000
*     END;                          /* END FOR PART MONITOR TO BE  0329 00848000
*                                      SCHEDULED                     */ 00849000
*   RFY                                                            0330 00850000
*     ASMVTPTR UNRSTD;              /* RELEASE REG                   */ 00851000
@RF00313 DS    0H                                                  0331 00852000
*   RFY                                                            0331 00853000
*     R14 RSTD;                                                    0331 00854000
*   R14=SAVERTN;                    /* RESTORE RETURN ADDRESS        */ 00855000
         L     R14,SAVERTN                                         0332 00856000
*   RETURN;                         /* RETURN TO RTM                 */ 00857000
@EL00001 DS    0H                                                  0333 00858000
@EF00001 DS    0H                                                  0333 00859000
@ER00001 BR    @14                                                 0333 00860000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 00861000
*     GPR00P PTR(31) REG(0),                                       0334 00862000
*     GPR01P PTR(31) REG(1),                                       0334 00863000
*     GPR14P PTR(31) REG(14),                                      0334 00864000
*     GPR15P PTR(31) REG(15);                                      0334 00865000
*   DECLARE                         /* COMMON VARIABLES              */ 00866000
*     I256C CHAR(256) BASED,                                       0335 00867000
*     I031F FIXED(31) BASED,                                       0335 00868000
*     I031P PTR(31) BASED,                                         0335 00869000
*     I015F FIXED(15) BASED,                                       0335 00870000
*     I015P PTR(15) BASED,                                         0335 00871000
*     I008P PTR(8) BASED,                                          0335 00872000
*     I001C CHAR(1) BASED;          /* USED FOR PLS MACROS           */ 00873000
*   END ILRCMP01                    /* END OF MODULE - RETURN TO RTM */ 00874000
*                                                                  0336 00875000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00876000
*/*%INCLUDE SYSLIB  (ILRAIA  )                                       */ 00877000
*/*%INCLUDE SYSLIB  (ILRASMVT)                                       */ 00878000
*/*%INCLUDE SYSLIB  (ILRATA  )                                       */ 00879000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00880000
*/*%INCLUDE SYSLIB  (ILRIORB )                                       */ 00881000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 00882000
*/*%INCLUDE SYSLIB  (ILRPART )                                       */ 00883000
*/*%INCLUDE SYSLIB  (ILRPCCW )                                       */ 00884000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00885000
*/*%INCLUDE SYSLIB  (ILRSART )                                       */ 00886000
*/*%INCLUDE SYSLIB  (ILRSCCW )                                       */ 00887000
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */ 00888000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00889000
*                                                                  0336 00890000
*       ;                                                          0336 00891000
@DATA    DS    0H                                                       00892000
@CH00043 DC    H'1'                                                     00893000
@DATD    DSECT                                                          00894000
         DS    0F                                                       00895000
ILRCMP01 CSECT                                                          00896000
         DS    0F                                                       00897000
@DATD    DSECT                                                          00898000
         DS    0D                                                       00899000
AVAILQP  DS    A                                                        00900000
SAVERTN  DS    A                                                        00901000
@TS00001 DS    CL2                                                      00902000
         DS    CL2                                                      00903000
SAVEREGS DS    CL72                                                     00904000
QVWKAREA DS    CL92                                                     00905000
SCHFLG   DS    BL1                                                      00906000
         DS    CL3                                                      00907000
MSGLIST  DS    CL8                                                      00908000
         ORG   MSGLIST                                                  00909000
MSGID    DS    FL2                                                      00910000
MSGTYPE  DS    FL2                                                      00911000
PSARTE   DS    AL4                                                      00912000
         ORG   MSGLIST+8                                                00913000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00914000
@ENDDATD EQU   *                                                        00915000
ILRCMP01 CSECT                                                          00916000
         NOPR  ((@ENDDATD-@DATD)/201*16)                                00917000
         DS    0F                                                       00918000
@SIZDATD DC    AL1(0)                                                   00919000
         DC    AL3(@ENDDATD-@DATD)                                      00920000
@CV02108 DC    V(ILRMSG00)                                              00921000
@CV02109 DC    V(ILRVIORB)                                              00922000
@CV02110 DC    V(ILRVAIA)                                               00923000
@CV02111 DC    V(ILRVAIAQ)                                              00924000
@CV02112 DC    V(ILRVSCWQ)                                              00925000
@CV02113 DC    V(ILRVPCWQ)                                              00926000
         DS    0D                                                       00927000
@CB02173 DC    B'1111111111110000'                                      00928000
@CB02175 DC    B'0000100001000000'                                      00929000
MODID    DS    CL24                                                     00930000
         ORG   MODID                                                    00931000
MODNAME  DC    CL8'ILRCMP  '                                            00932000
CSCTNAME DC    CL8'ILRCMP  '                                            00933000
RECVNAME DC    CL8'ILRCMP01'                                            00934000
         ORG   MODID+24                                                 00935000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00936000
@01      EQU   01                                                       00937000
@02      EQU   02                                                       00938000
@03      EQU   03                                                       00939000
@04      EQU   04                                                       00940000
@05      EQU   05                                                       00941000
@06      EQU   06                                                       00942000
@07      EQU   07                                                       00943000
@08      EQU   08                                                       00944000
@09      EQU   09                                                       00945000
@10      EQU   10                                                       00946000
@11      EQU   11                                                       00947000
@12      EQU   12                                                       00948000
@13      EQU   13                                                       00949000
@14      EQU   14                                                       00950000
@15      EQU   15                                                       00951000
LASTPTR  EQU   @02                                                      00952000
PCCWPTR  EQU   @02                                                      00953000
AIAPTR   EQU   @02                                                      00954000
ASMVTPTR EQU   @03                                                      00955000
ATAPTR   EQU   @11                                                      00956000
IOSBPTR  EQU   @12                                                      00957000
SDWAPTR  EQU   @01                                                      00958000
R0       EQU   @00                                                      00959000
ELEMENT  EQU   @00                                                      00960000
QANCHOR  EQU   @00                                                      00961000
PARMPTR  EQU   @01                                                      00962000
R2       EQU   @02                                                      00963000
R3       EQU   @03                                                      00964000
R4       EQU   @04                                                      00965000
QVERRTNP EQU   @04                                                      00966000
R5       EQU   @05                                                      00967000
REPLV    EQU   @05                                                      00968000
R6       EQU   @06                                                      00969000
COMPV    EQU   @06                                                      00970000
RECPTR   EQU   @06                                                      00971000
R7       EQU   @07                                                      00972000
QWKAREA  EQU   @08                                                      00973000
DATARG   EQU   @09                                                      00974000
R10      EQU   @10                                                      00975000
R11      EQU   @11                                                      00976000
R12      EQU   @12                                                      00977000
R13      EQU   @13                                                      00978000
SAVEPTR  EQU   @13                                                      00979000
R14      EQU   @14                                                      00980000
R15      EQU   @15                                                      00981000
RETCODE  EQU   @15                                                      00982000
GPR00P   EQU   @00                                                      00983000
GPR01P   EQU   @01                                                      00984000
GPR14P   EQU   @14                                                      00985000
GPR15P   EQU   @15                                                      00986000
R1       EQU   @01                                                      00987000
R8       EQU   @08                                                      00988000
R9       EQU   @09                                                      00989000
PSA      EQU   0                                                        00990000
FLCRNPSW EQU   PSA                                                      00991000
FLCROPSW EQU   PSA+8                                                    00992000
FLCICCW2 EQU   PSA+16                                                   00993000
FLCCVT   EQU   FLCICCW2                                                 00994000
PSAEEPSW EQU   PSA+132                                                  00995000
PSAESPSW EQU   PSA+136                                                  00996000
FLCSVILC EQU   PSAESPSW+1                                               00997000
PSAEPPSW EQU   PSA+140                                                  00998000
FLCPIILC EQU   PSAEPPSW+1                                               00999000
FLCPICOD EQU   PSAEPPSW+2                                               01000000
PSAPICOD EQU   FLCPICOD+1                                               01001000
FLCTEA   EQU   PSAEPPSW+4                                               01002000
FLCPER   EQU   PSA+152                                                  01003000
FLCMCLA  EQU   PSA+168                                                  01004000
FLCIOEL  EQU   FLCMCLA+4                                                01005000
FLCIOA   EQU   FLCMCLA+16                                               01006000
FLCFSA   EQU   FLCMCLA+80                                               01007000
PSASUPER EQU   PSA+552                                                  01008000
PSASUP1  EQU   PSASUPER                                                 01009000
PSASUP2  EQU   PSASUPER+1                                               01010000
PSASUP3  EQU   PSASUPER+2                                               01011000
PSASUP4  EQU   PSASUPER+3                                               01012000
PSACLHT  EQU   PSA+640                                                  01013000
PSALKSA  EQU   PSA+696                                                  01014000
PSAHLHI  EQU   PSA+760                                                  01015000
PSALITA  EQU   PSA+764                                                  01016000
PSADSSFL EQU   PSA+836                                                  01017000
PSADSSF1 EQU   PSADSSFL                                                 01018000
PSADSSF3 EQU   PSADSSFL+2                                               01019000
PSADSSF4 EQU   PSADSSFL+3                                               01020000
PSARSVT  EQU   PSA+896                                                  01021000
AIA      EQU   0                                                        01022000
AIAFLG1  EQU   AIA+9                                                    01023000
AIAFLG2  EQU   AIA+10                                                   01024000
AIAIORTY EQU   AIAFLG2                                                  01025000
AIAFLG3  EQU   AIA+11                                                   01026000
AIANXAIA EQU   AIA+12                                                   01027000
AIAID    EQU   AIA+16                                                   01028000
AIALPID  EQU   AIAID                                                    01029000
AIALGID  EQU   AIALPID                                                  01030000
AIALSID  EQU   AIALGID                                                  01031000
AIASSID  EQU   AIALSID+1                                                01032000
AIARPN   EQU   AIALPID+4                                                01033000
AIALSID2 EQU   AIARPN                                                   01034000
AIALPMEP EQU   AIALSID2                                                 01035000
AIAGRPSZ EQU   AIA+24                                                   01036000
AIALGE   EQU   AIAGRPSZ                                                 01037000
ASMVT    EQU   0                                                        01038000
ASMFLAG1 EQU   ASMVT                                                    01039000
ASMFLAG2 EQU   ASMVT+1                                                  01040000
ASMSART  EQU   ASMVT+4                                                  01041000
ASMPART  EQU   ASMVT+8                                                  01042000
ASMSTAGQ EQU   ASMVT+32                                                 01043000
ASMPCCWQ EQU   ASMVT+64                                                 01044000
ASMPCCWA EQU   ASMPCCWQ                                                 01045000
ASMSRBCT EQU   ASMVT+84                                                 01046000
ASMPSRB  EQU   ASMVT+88                                                 01047000
ASMLSAI  EQU   ASMVT+144                                                01048000
ASMGOSQS EQU   ASMVT+152                                                01049000
ASMPCMP  EQU   ASMVT+240                                                01050000
ASMWKSA1 EQU   ASMVT+368                                                01051000
ASMWKSA2 EQU   ASMVT+448                                                01052000
ASMWKSA3 EQU   ASMVT+528                                                01053000
ASMWKSA4 EQU   ASMVT+608                                                01054000
ASMWKSA5 EQU   ASMVT+688                                                01055000
ASMPOOLS EQU   0                                                        01056000
ASMCPAVQ EQU   ASMPOOLS+8                                               01057000
ASMCPRSQ EQU   ASMPOOLS+16                                              01058000
ATA      EQU   0                                                        01059000
ATAMODID EQU   ATA                                                      01060000
ATASFLGS EQU   ATA+1                                                    01061000
ATARFLGS EQU   ATA+4                                                    01062000
ATABADPK EQU   ATARFLGS                                                 01063000
ATARCRSN EQU   ATA+6                                                    01064000
ATACLEAR EQU   ATA+8                                                    01065000
ATAIOSB  EQU   ATACLEAR                                                 01066000
ATAPCCWQ EQU   ATACLEAR+4                                               01067000
ATACOMPQ EQU   ATACLEAR+8                                               01068000
ATACPCCW EQU   ATACLEAR+12                                              01069000
CVTMAP   EQU   0                                                        01070000
CVTDAR   EQU   CVTMAP+72                                                01071000
CVTFLGS1 EQU   CVTDAR                                                   01072000
CVTDCB   EQU   CVTMAP+116                                               01073000
CVTIERLC EQU   CVTMAP+144                                               01074000
CVTOPTA  EQU   CVTMAP+182                                               01075000
CVTOPTB  EQU   CVTMAP+183                                               01076000
CVTGTF   EQU   CVTMAP+236                                               01077000
CVTGTFST EQU   CVTGTF                                                   01078000
CVTGTFS  EQU   CVTGTFST                                                 01079000
CVTSTATE EQU   CVTGTFST                                                 01080000
CVTTMODE EQU   CVTGTFST                                                 01081000
CVTFORM  EQU   CVTGTFST                                                 01082000
CVTAQAVT EQU   CVTMAP+240                                               01083000
CVTTCMFG EQU   CVTAQAVT                                                 01084000
CVTVOLM2 EQU   CVTMAP+244                                               01085000
CVTTATA  EQU   CVTVOLM2                                                 01086000
CVTTSKS  EQU   CVTTATA                                                  01087000
CVTVOLF2 EQU   CVTTSKS                                                  01088000
CVTTAT   EQU   CVTTATA+1                                                01089000
CVTATER  EQU   CVTMAP+248                                               01090000
CVTEXT1  EQU   CVTMAP+252                                               01091000
CVTPURG  EQU   CVTMAP+260                                               01092000
CVTQMSG  EQU   CVTMAP+268                                               01093000
CVTDMSR  EQU   CVTMAP+272                                               01094000
CVTRSV37 EQU   CVTDMSR                                                  01095000
CVTDMSRF EQU   CVTRSV37                                                 01096000
CVTERPV  EQU   CVTMAP+316                                               01097000
CVTINTLA EQU   CVTMAP+320                                               01098000
CVTAPF   EQU   CVTMAP+324                                               01099000
CVTEXT2  EQU   CVTMAP+328                                               01100000
CVTHJES  EQU   CVTMAP+332                                               01101000
CVTPGSIA EQU   CVTMAP+348                                               01102000
CVTA1F1  EQU   CVTMAP+356                                               01103000
CVTSYSK  EQU   CVTMAP+357                                               01104000
CVTVOLM1 EQU   CVTMAP+380                                               01105000
CVTVOLF1 EQU   CVTVOLM1                                                 01106000
CVTATMCT EQU   CVTMAP+388                                               01107000
CVTXTNT1 EQU   0                                                        01108000
CVTXTNT2 EQU   0                                                        01109000
CVTDSSV  EQU   CVTXTNT2                                                 01110000
CVTFLGBT EQU   CVTXTNT2+5                                               01111000
CVTQID   EQU   CVTXTNT2+24                                              01112000
CVTRV400 EQU   CVTXTNT2+52                                              01113000
CVTRV409 EQU   CVTXTNT2+53                                              01114000
CVTATCVT EQU   CVTXTNT2+64                                              01115000
CVTRV429 EQU   CVTXTNT2+84                                              01116000
CVTRV438 EQU   CVTXTNT2+85                                              01117000
CVTRV457 EQU   CVTXTNT2+112                                             01118000
CVTRV466 EQU   CVTXTNT2+113                                             01119000
CVTFIX   EQU   0                                                        01120000
CVTRELNO EQU   CVTFIX+252                                               01121000
IORB     EQU   0                                                        01122000
IORFLGS  EQU   IORB+3                                                   01123000
IORFUSE  EQU   IORFLGS                                                  01124000
IORSWAP  EQU   IORFLGS                                                  01125000
IORAPND  EQU   IORFLGS                                                  01126000
IORPCCW  EQU   IORB+8                                                   01127000
IORPARTE EQU   IORB+32                                                  01128000
IOSB     EQU   0                                                        01129000
IOSFLA   EQU   IOSB                                                     01130000
IOSACHN  EQU   IOSFLA                                                   01131000
IOSFLB   EQU   IOSB+1                                                   01132000
IOSDIESE EQU   IOSFLB                                                   01133000
IOSFLC   EQU   IOSB+2                                                   01134000
IOSDVALT EQU   IOSFLC                                                   01135000
IOSPKEY  EQU   IOSB+12                                                  01136000
IOSCOD   EQU   IOSB+13                                                  01137000
IOSOPT   EQU   IOSB+14                                                  01138000
IOSOPT2  EQU   IOSB+15                                                  01139000
IOSUCB   EQU   IOSB+16                                                  01140000
@NM00012 EQU   IOSB+20                                                  01141000
IOSCC    EQU   @NM00012                                                 01142000
IOSCSW   EQU   @NM00012+1                                               01143000
IOSTATUS EQU   IOSCSW+3                                                 01144000
IOSSRB   EQU   IOSB+28                                                  01145000
IOSUSE   EQU   IOSB+32                                                  01146000
IOSIPIB  EQU   IOSB+44                                                  01147000
IOSDIE   EQU   IOSB+68                                                  01148000
IOSDIEFG EQU   IOSDIE                                                   01149000
IOSVST   EQU   IOSB+76                                                  01150000
IOSPATH  EQU   IOSB+86                                                  01151000
IOSCHN   EQU   IOSPATH                                                  01152000
IOSCKEY  EQU   IOSB+89                                                  01153000
IOSEEK   EQU   IOSB+92                                                  01154000
IOSEEKA  EQU   IOSB+100                                                 01155000
IOSCCHH  EQU   IOSEEKA+3                                                01156000
IOSSKHH  EQU   IOSCCHH+2                                                01157000
PART     EQU   0                                                        01158000
PARTHDR  EQU   PART                                                     01159000
PARTAIAE EQU   PARTHDR+12                                               01160000
PARTTPAR EQU   PARTHDR+24                                               01161000
PARTCOMQ EQU   PARTHDR+48                                               01162000
PARTSPLQ EQU   PARTHDR+56                                               01163000
PARTDUPQ EQU   PARTHDR+64                                               01164000
PARTLOCQ EQU   PARTHDR+72                                               01165000
PARTENT  EQU   0                                                        01166000
PARELKUP EQU   PARTENT+4                                                01167000
PARELKFL EQU   PARELKUP                                                 01168000
PARETYPE EQU   PARTENT+8                                                01169000
PAREFLG1 EQU   PARTENT+9                                                01170000
PAREDSBD EQU   PAREFLG1                                                 01171000
PCCW     EQU   0                                                        01172000
PCCWFLGS EQU   PCCW+2                                                   01173000
PCCWPCCW EQU   PCCW+4                                                   01174000
PCCWAIA  EQU   PCCW+8                                                   01175000
PCCWCHHR EQU   PCCW+16                                                  01176000
PCCWSEEK EQU   PCCW+24                                                  01177000
PCCWSSEC EQU   PCCW+32                                                  01178000
PCCWSRCH EQU   PCCW+40                                                  01179000
PCCWTIC  EQU   PCCW+48                                                  01180000
PCCWRW   EQU   PCCW+56                                                  01181000
PCCWNOP  EQU   PCCW+64                                                  01182000
SART     EQU   0                                                        01183000
SARTHDR  EQU   SART                                                     01184000
SARUSE   EQU   SARTHDR+8                                                01185000
SARSCCWQ EQU   SARTHDR+32                                               01186000
SARWAITQ EQU   SARTHDR+40                                               01187000
SARSRBP  EQU   SARTHDR+48                                               01188000
SARSRBCT EQU   SARTHDR+52                                               01189000
SARTE    EQU   0                                                        01190000
SREFLG   EQU   SARTE+9                                                  01191000
SAREPTR  EQU   0                                                        01192000
SCCW     EQU   0                                                        01193000
SCCWHDR  EQU   SCCW                                                     01194000
SCCWFLAG EQU   SCCWHDR+2                                                01195000
SCCWSARG EQU   SCCWHDR+16                                               01196000
SCCWSRH  EQU   SCCWSARG+3                                               01197000
SCCWCCHH EQU   SCCWSRH                                                  01198000
SCCWCCW  EQU   SCCW+88                                                  01199000
SCCWSEEK EQU   SCCWCCW                                                  01200000
SCCWSSEC EQU   SCCWCCW+8                                                01201000
SCCWSLOT EQU   SCCWCCW+16                                               01202000
SCCWSRCH EQU   SCCWSLOT                                                 01203000
SCCWTIC  EQU   SCCWSLOT+8                                               01204000
SCCWRW   EQU   SCCWSLOT+16                                              01205000
SCCWLTIC EQU   SCCWCCW+304                                              01206000
SCCWPTR  EQU   0                                                        01207000
SDWA     EQU   0                                                        01208000
SDWAPARM EQU   SDWA                                                     01209000
SDWAFIOB EQU   SDWA+4                                                   01210000
SDWAABCC EQU   SDWAFIOB                                                 01211000
SDWACMPF EQU   SDWAABCC                                                 01212000
SDWACMPC EQU   SDWAABCC+1                                               01213000
SDWACTL1 EQU   SDWA+8                                                   01214000
SDWACMKA EQU   SDWACTL1                                                 01215000
SDWAMWPA EQU   SDWACTL1+1                                               01216000
SDWAPMKA EQU   SDWACTL1+4                                               01217000
SDWACTL2 EQU   SDWA+16                                                  01218000
SDWACMKP EQU   SDWACTL2                                                 01219000
SDWAMWPP EQU   SDWACTL2+1                                               01220000
SDWAPMKP EQU   SDWACTL2+4                                               01221000
SDWAGRSV EQU   SDWA+24                                                  01222000
SDWANAME EQU   SDWA+88                                                  01223000
SDWAEC1  EQU   SDWA+104                                                 01224000
SDWAEMK1 EQU   SDWAEC1                                                  01225000
SDWAMWP1 EQU   SDWAEC1+1                                                01226000
SDWAINT1 EQU   SDWAEC1+2                                                01227000
SDWANXT1 EQU   SDWAEC1+4                                                01228000
SDWAAEC1 EQU   SDWA+112                                                 01229000
SDWAILC1 EQU   SDWAAEC1+1                                               01230000
SDWAINC1 EQU   SDWAAEC1+2                                               01231000
SDWAICD1 EQU   SDWAINC1+1                                               01232000
SDWAEC2  EQU   SDWA+120                                                 01233000
SDWAEMK2 EQU   SDWAEC2                                                  01234000
SDWAMWP2 EQU   SDWAEC2+1                                                01235000
SDWAINT2 EQU   SDWAEC2+2                                                01236000
SDWANXT2 EQU   SDWAEC2+4                                                01237000
SDWAAEC2 EQU   SDWA+128                                                 01238000
SDWAILC2 EQU   SDWAAEC2+1                                               01239000
SDWAINC2 EQU   SDWAAEC2+2                                               01240000
SDWAICD2 EQU   SDWAINC2+1                                               01241000
SDWASRSV EQU   SDWA+136                                                 01242000
SDWAIDNT EQU   SDWA+200                                                 01243000
SDWAMCH  EQU   SDWA+204                                                 01244000
SDWASTCK EQU   SDWAMCH                                                  01245000
SDWAMCHI EQU   SDWAMCH+8                                                01246000
SDWAMCHS EQU   SDWAMCHI                                                 01247000
SDWAMCHD EQU   SDWAMCHI+1                                               01248000
SDWARSR1 EQU   SDWAMCH+12                                               01249000
SDWARSR2 EQU   SDWAMCH+13                                               01250000
SDWAFLGS EQU   SDWA+232                                                 01251000
SDWAERRA EQU   SDWAFLGS                                                 01252000
SDWAERRB EQU   SDWAFLGS+1                                               01253000
SDWAERRC EQU   SDWAFLGS+2                                               01254000
SDWAERRD EQU   SDWAFLGS+3                                               01255000
SDWAIOFS EQU   SDWA+238                                                 01256000
SDWACPUA EQU   SDWA+248                                                 01257000
SDWAPARQ EQU   SDWA+252                                                 01258000
SDWARCDE EQU   SDWAPARQ                                                 01259000
SDWAACF2 EQU   SDWAPARQ+1                                               01260000
SDWARCRD EQU   SDWAACF2                                                 01261000
SDWAACF3 EQU   SDWAPARQ+2                                               01262000
SDWAACF4 EQU   SDWAPARQ+3                                               01263000
SDWALKWA EQU   SDWA+256                                                 01264000
SDWALKWS EQU   SDWALKWA                                                 01265000
SDWARECP EQU   SDWA+292                                                 01266000
SDWASNPA EQU   SDWA+320                                                 01267000
SDWADUMP EQU   SDWASNPA                                                 01268000
SDWADPFS EQU   SDWADUMP+1                                               01269000
SDWADDAT EQU   SDWASNPA+4                                               01270000
SDWASDAT EQU   SDWADDAT                                                 01271000
SDWAPDAT EQU   SDWADDAT+2                                               01272000
SDWADPSA EQU   SDWA+328                                                 01273000
SDWADPSL EQU   SDWADPSA                                                 01274000
SDWARA   EQU   SDWA+400                                                 01275000
SDWAVRAL EQU   SDWARA                                                   01276000
SDWADPVA EQU   SDWARA+2                                                 01277000
SDWAURAL EQU   SDWARA+3                                                 01278000
SDWAVRA  EQU   SDWARA+4                                                 01279000
SRBSECT  EQU   0                                                        01280000
SRB      EQU   SRBSECT                                                  01281000
SRBFLNK  EQU   SRB+4                                                    01282000
SRBFLC   EQU   SRB+12                                                   01283000
SRBEP    EQU   SRB+20                                                   01284000
SRBPTR   EQU   0                                                        01285000
QVERRTN  EQU   0                                                        01286000
AVAILQ   EQU   0                                                        01287000
RECAREA  EQU   0                                                        01288000
RECCOD   EQU   RECAREA                                                  01289000
RECUCB   EQU   RECAREA+1                                                01290000
RECSEEK  EQU   RECAREA+20                                               01291000
RECVST   EQU   RECAREA+28                                               01292000
ADATA    EQU   0                                                        01293000
I256C    EQU   0                                                        01294000
I001C    EQU   0                                                        01295000
I008P    EQU   0                                                        01296000
I015F    EQU   0                                                        01297000
I015P    EQU   0                                                        01298000
I031F    EQU   0                                                        01299000
I031P    EQU   0                                                        01300000
ASM1WKSV EQU   ASMWKSA1                                                 01301000
ASM1RGSV EQU   ASM1WKSV                                                 01302000
ASM1WRKA EQU   ASM1WKSV+60                                              01303000
ASM2WKSV EQU   ASMWKSA2                                                 01304000
ASM2WRKA EQU   ASM2WKSV+52                                              01305000
ASM2FLGS EQU   ASM2WRKA+12                                              01306000
ASM3WKSV EQU   ASMWKSA3                                                 01307000
ASM4WKSV EQU   ASMWKSA4                                                 01308000
ASM4RGSV EQU   ASM4WKSV                                                 01309000
ASM5WKSV EQU   ASMWKSA5                                                 01310000
ASM5RGSV EQU   ASM5WKSV                                                 01311000
CVTPTR   EQU   FLCCVT                                                   01312000
CVTS01   EQU   CVTPGSIA                                                 01313000
CVTLPDIA EQU   CVTS01+12                                                01314000
CVTDIRST EQU   CVTLPDIA                                                 01315000
CVTSLIDA EQU   CVTS01+24                                                01316000
CVTCTLFG EQU   CVTS01+50                                                01317000
CVTGSMQ  EQU   CVTS01+264                                               01318000
CVTASMVT EQU   CVTS01+356                                               01319000
CVTRV210 EQU   CVTS01+424                                               01320000
CVTRV219 EQU   CVTS01+425                                               01321000
CVTRV228 EQU   CVTS01+426                                               01322000
CVTRV237 EQU   CVTS01+427                                               01323000
CVTMFRTR EQU   CVTS01+452                                               01324000
CVTRV262 EQU   CVTS01+468                                               01325000
CVTRV271 EQU   CVTS01+469                                               01326000
CVTRV280 EQU   CVTS01+470                                               01327000
CVTRV289 EQU   CVTS01+471                                               01328000
CVTGSDA  EQU   CVTS01+600                                               01329000
IORBPTR  EQU   IOSUSE                                                   01330000
IOSATTSC EQU   IOSIPIB                                                  01331000
IOSWTOWA EQU   IOSIPIB                                                  01332000
IOSPCISC EQU   IOSIPIB                                                  01333000
PARTPTR  EQU   ASMPART                                                  01334000
PAREPTR  EQU   IORPARTE                                                 01335000
PSARSVTE EQU   PSARSVT                                                  01336000
SARTPTR  EQU   ASMSART                                                  01337000
SYSCODE  EQU   SDWACMPC                                                 01338000
URAL     EQU   SDWAURAL                                                 01339000
VRAL     EQU   SDWAVRAL                                                 01340000
RUCBCSW  EQU   IOSUCB                                                   01341000
FLC      EQU   PSA                                                      01342000
SCCWSK   EQU   SCCWSARG                                                 01343000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01344000
PSARSAV  EQU   PSARSVTE+60                                              01345000
PSARSTK  EQU   PSARSVTE+56                                              01346000
PSAESAV3 EQU   PSARSVTE+52                                              01347000
PSAESTK3 EQU   PSARSVTE+48                                              01348000
PSAESAV2 EQU   PSARSVTE+44                                              01349000
PSAESTK2 EQU   PSARSVTE+40                                              01350000
PSAESAV1 EQU   PSARSVTE+36                                              01351000
PSAESTK1 EQU   PSARSVTE+32                                              01352000
PSAPSAV  EQU   PSARSVTE+28                                              01353000
PSAPSTK  EQU   PSARSVTE+24                                              01354000
PSAMSAV  EQU   PSARSVTE+20                                              01355000
PSAMSTK  EQU   PSARSVTE+16                                              01356000
PSASSAV  EQU   PSARSVTE+12                                              01357000
PSASSTK  EQU   PSARSVTE+8                                               01358000
PSANSTK  EQU   PSARSVTE+4                                               01359000
PSACSTK  EQU   PSARSVTE                                                 01360000
IOSPCIWA EQU   IOSPCISC+44                                              01361000
IOSPCIRS EQU   IOSPCISC+8                                               01362000
@NM00017 EQU   IOSPCISC+4                                               01363000
@NM00016 EQU   IOSPCISC                                                 01364000
IOSWRNDR EQU   IOSWTOWA+4                                               01365000
IOSWTOPT EQU   IOSWTOWA+3                                               01366000
IOSWTOCP EQU   IOSWTOWA+2                                               01367000
IOSWTOCH EQU   IOSWTOWA                                                 01368000
IOSATTWA EQU   IOSATTSC+40                                              01369000
@NM00015 EQU   IOSATTSC+24                                              01370000
IOSATTSN EQU   IOSATTSC                                                 01371000
CVTRV628 EQU   CVTS01+728                                               01372000
CVTRV627 EQU   CVTS01+724                                               01373000
CVTRV626 EQU   CVTS01+720                                               01374000
CVTRV625 EQU   CVTS01+716                                               01375000
CVTRV624 EQU   CVTS01+712                                               01376000
CVTRV623 EQU   CVTS01+708                                               01377000
CVTRV622 EQU   CVTS01+704                                               01378000
CVTRV621 EQU   CVTS01+700                                               01379000
CVTIHASU EQU   CVTS01+696                                               01380000
CVTSUSP  EQU   CVTS01+692                                               01381000
CVTT6SVC EQU   CVTS01+688                                               01382000
CVTCDAL  EQU   CVTS01+684                                               01383000
CVTTCTL  EQU   CVTS01+680                                               01384000
CVTRSUME EQU   CVTS01+676                                               01385000
CVTJTERM EQU   CVTS01+672                                               01386000
CVTASMRM EQU   CVTS01+668                                               01387000
CVTTCASP EQU   CVTS01+664                                               01388000
CVT0PT03 EQU   CVTS01+660                                               01389000
CVT0PT0E EQU   CVTS01+656                                               01390000
CVTRV609 EQU   CVTS01+652                                               01391000
CVTCGK   EQU   CVTS01+648                                               01392000
CVTRAC   EQU   CVTS01+644                                               01393000
CVTRV606 EQU   CVTS01+640                                               01394000
CVTRV605 EQU   CVTS01+636                                               01395000
CVTRV604 EQU   CVTS01+632                                               01396000
CVTEFF02 EQU   CVTS01+628                                               01397000
CVTCBBR  EQU   CVTS01+624                                               01398000
CVTSSCR  EQU   CVTS01+620                                               01399000
CVTEVENT EQU   CVTS01+616                                               01400000
CVTCRCA  EQU   CVTS01+612                                               01401000
CVTTPIO  EQU   CVTS01+608                                               01402000
CVTADV   EQU   CVTS01+604                                               01403000
CVTGSDAB EQU   CVTGSDA                                                  01404000
CVTQV3   EQU   CVTS01+596                                               01405000
CVTQV2   EQU   CVTS01+592                                               01406000
CVTQV1   EQU   CVTS01+588                                               01407000
CVTRPT   EQU   CVTS01+584                                               01408000
CVTSSRB  EQU   CVTS01+580                                               01409000
CVTCSDRL EQU   CVTS01+576                                               01410000
CVTEXP1  EQU   CVTS01+572                                               01411000
CVTRMPMT EQU   CVTS01+568                                               01412000
CVTRMPTT EQU   CVTS01+564                                               01413000
CVTVPSA  EQU   CVTS01+560                                               01414000
CVTVSTOP EQU   CVTS01+556                                               01415000
CVTGTFR8 EQU   CVTS01+552                                               01416000
CVTQUIT  EQU   CVTS01+548                                               01417000
CVTVACR  EQU   CVTS01+544                                               01418000
CVTWTCB  EQU   CVTS01+540                                               01419000
CVTSTPRS EQU   CVTS01+536                                               01420000
CVT0PT02 EQU   CVTS01+532                                               01421000
CVTDARCM EQU   CVTS01+528                                               01422000
CVTIRECM EQU   CVTS01+524                                               01423000
CVTJRECM EQU   CVTS01+520                                               01424000
CVTVEMS0 EQU   CVTS01+516                                               01425000
CVTSPFRR EQU   CVTS01+512                                               01426000
CVTRLSTG EQU   CVTS01+508                                               01427000
CVT0TC0A EQU   CVTS01+504                                               01428000
CVTGMBR  EQU   CVTS01+500                                               01429000
CVTLFRM  EQU   CVTS01+496                                               01430000
CVTRMBR  EQU   CVTS01+492                                               01431000
CVTVIOP  EQU   CVTS01+488                                               01432000
CVTRV307 EQU   CVTS01+486                                               01433000
CVTRV306 EQU   CVTS01+484                                               01434000
CVTRV305 EQU   CVTS01+482                                               01435000
CVTRV304 EQU   CVTS01+480                                               01436000
CVTRV303 EQU   CVTS01+478                                               01437000
CVTRV302 EQU   CVTS01+476                                               01438000
CVTTRCA  EQU   CVTS01+472                                               01439000
CVTRV297 EQU   CVTRV289                                                 01440000
CVTRV296 EQU   CVTRV289                                                 01441000
CVTRV295 EQU   CVTRV289                                                 01442000
CVTRV294 EQU   CVTRV289                                                 01443000
CVTRV293 EQU   CVTRV289                                                 01444000
CVTRV292 EQU   CVTRV289                                                 01445000
CVTRV291 EQU   CVTRV289                                                 01446000
CVTRV290 EQU   CVTRV289                                                 01447000
CVTRV288 EQU   CVTRV280                                                 01448000
CVTRV287 EQU   CVTRV280                                                 01449000
CVTRV286 EQU   CVTRV280                                                 01450000
CVTRV285 EQU   CVTRV280                                                 01451000
CVTRV284 EQU   CVTRV280                                                 01452000
CVTRV283 EQU   CVTRV280                                                 01453000
CVTRV282 EQU   CVTRV280                                                 01454000
CVTRV281 EQU   CVTRV280                                                 01455000
CVTRV279 EQU   CVTRV271                                                 01456000
CVTRV278 EQU   CVTRV271                                                 01457000
CVTRV277 EQU   CVTRV271                                                 01458000
CVTRV276 EQU   CVTRV271                                                 01459000
CVTRV275 EQU   CVTRV271                                                 01460000
CVTRV274 EQU   CVTRV271                                                 01461000
CVTRV273 EQU   CVTRV271                                                 01462000
CVTRV272 EQU   CVTRV271                                                 01463000
CVTRV270 EQU   CVTRV262                                                 01464000
CVTRV269 EQU   CVTRV262                                                 01465000
CVTRV268 EQU   CVTRV262                                                 01466000
CVTRV267 EQU   CVTRV262                                                 01467000
CVTRV266 EQU   CVTRV262                                                 01468000
CVTRV265 EQU   CVTRV262                                                 01469000
CVTRV264 EQU   CVTRV262                                                 01470000
CVTRV263 EQU   CVTRV262                                                 01471000
CVTVFP   EQU   CVTS01+464                                               01472000
CVTVSI   EQU   CVTS01+460                                               01473000
CVTVPSIB EQU   CVTS01+456                                               01474000
CVTMFACT EQU   CVTMFRTR                                                 01475000
CVTMFCTL EQU   CVTS01+448                                               01476000
CVTPVBP  EQU   CVTS01+444                                               01477000
CVTPWI   EQU   CVTS01+440                                               01478000
CVTRV254 EQU   CVTS01+438                                               01479000
CVTRV253 EQU   CVTS01+436                                               01480000
CVTRV252 EQU   CVTS01+434                                               01481000
CVTRV251 EQU   CVTS01+433                                               01482000
CVTRV250 EQU   CVTS01+432                                               01483000
CVTRV249 EQU   CVTS01+431                                               01484000
CVTRV248 EQU   CVTS01+430                                               01485000
CVTRV247 EQU   CVTS01+429                                               01486000
CVTRV246 EQU   CVTS01+428                                               01487000
CVTRV245 EQU   CVTRV237                                                 01488000
CVTRV244 EQU   CVTRV237                                                 01489000
CVTRV243 EQU   CVTRV237                                                 01490000
CVTRV242 EQU   CVTRV237                                                 01491000
CVTRV241 EQU   CVTRV237                                                 01492000
CVTRV240 EQU   CVTRV237                                                 01493000
CVTRV239 EQU   CVTRV237                                                 01494000
CVTRV238 EQU   CVTRV237                                                 01495000
CVTRV236 EQU   CVTRV228                                                 01496000
CVTRV235 EQU   CVTRV228                                                 01497000
CVTRV234 EQU   CVTRV228                                                 01498000
CVTRV233 EQU   CVTRV228                                                 01499000
CVTRV232 EQU   CVTRV228                                                 01500000
CVTRV231 EQU   CVTRV228                                                 01501000
CVTRV230 EQU   CVTRV228                                                 01502000
CVTRV229 EQU   CVTRV228                                                 01503000
CVTRV227 EQU   CVTRV219                                                 01504000
CVTRV226 EQU   CVTRV219                                                 01505000
CVTRV225 EQU   CVTRV219                                                 01506000
CVTRV224 EQU   CVTRV219                                                 01507000
CVTRV223 EQU   CVTRV219                                                 01508000
CVTRV222 EQU   CVTRV219                                                 01509000
CVTRV221 EQU   CVTRV219                                                 01510000
CVTRV220 EQU   CVTRV219                                                 01511000
CVTRV218 EQU   CVTRV210                                                 01512000
CVTRV217 EQU   CVTRV210                                                 01513000
CVTRV216 EQU   CVTRV210                                                 01514000
CVTRV215 EQU   CVTRV210                                                 01515000
CVTRV214 EQU   CVTRV210                                                 01516000
CVTRV213 EQU   CVTRV210                                                 01517000
CVTRV212 EQU   CVTRV210                                                 01518000
CVTRV211 EQU   CVTRV210                                                 01519000
CVTLCCAT EQU   CVTS01+420                                               01520000
CVTPCCAT EQU   CVTS01+416                                               01521000
CVTIPCRP EQU   CVTS01+412                                               01522000
CVTIPCRI EQU   CVTS01+408                                               01523000
CVTIPCDS EQU   CVTS01+404                                               01524000
CVTAIDVT EQU   CVTS01+400                                               01525000
CVTSSAP  EQU   CVTS01+396                                               01526000
CVTEHCIR EQU   CVTS01+392                                               01527000
CVTEHDEF EQU   CVTS01+388                                               01528000
CVTDAIR  EQU   CVTS01+384                                               01529000
CVTPERFM EQU   CVTS01+380                                               01530000
CVT044R2 EQU   CVTS01+376                                               01531000
CVTFETCH EQU   CVTS01+372                                               01532000
CVTRSTWD EQU   CVTS01+368                                               01533000
CVTSPOST EQU   CVTS01+364                                               01534000
CVTIOBP  EQU   CVTS01+360                                               01535000
CVTRECRQ EQU   CVTS01+352                                               01536000
CVTWSAC  EQU   CVTS01+348                                               01537000
CVTRV149 EQU   CVTS01+344                                               01538000
CVTWSAL  EQU   CVTS01+340                                               01539000
CVTSPSA  EQU   CVTS01+336                                               01540000
CVTGLMN  EQU   CVTS01+332                                               01541000
CVTVEAC0 EQU   CVTS01+328                                               01542000
CVT062R1 EQU   CVTS01+324                                               01543000
CVTRPOST EQU   CVTS01+320                                               01544000
CVTDQIQE EQU   CVTS01+316                                               01545000
CVTCSD   EQU   CVTS01+312                                               01546000
CVTLKRMA EQU   CVTS01+308                                               01547000
CVTRSPIE EQU   CVTS01+304                                               01548000
CVTRENQ  EQU   CVTS01+300                                               01549000
CVTLQCB  EQU   CVTS01+296                                               01550000
CVTFQCB  EQU   CVTS01+292                                               01551000
CVTQCS01 EQU   CVTS01+288                                               01552000
CVTAPFT  EQU   CVTS01+284                                               01553000
CVTPARRL EQU   CVTS01+280                                               01554000
CVTVWAIT EQU   CVTS01+276                                               01555000
CVTGSPL  EQU   CVTS01+272                                               01556000
CVTLSMQ  EQU   CVTS01+268                                               01557000
CVTEXPRO EQU   CVTS01+260                                               01558000
CVTOPCTP EQU   CVTS01+256                                               01559000
CVTSIC   EQU   CVTS01+252                                               01560000
CVTTPIOS EQU   CVTS01+248                                               01561000
CVTRTMS  EQU   CVTS01+244                                               01562000
CVTSDBF  EQU   CVTS01+240                                               01563000
CVTSCBP  EQU   CVTS01+236                                               01564000
CVTSDMP  EQU   CVTS01+232                                               01565000
CVTSV60  EQU   CVTS01+228                                               01566000
CVTRTMCT EQU   CVTS01+224                                               01567000
CVTASCBL EQU   CVTS01+220                                               01568000
CVTASCBH EQU   CVTS01+216                                               01569000
CVTGDA   EQU   CVTS01+212                                               01570000
CVTASVT  EQU   CVTS01+208                                               01571000
CVTVVMDI EQU   CVTS01+204                                               01572000
CVTAQTOP EQU   CVTS01+200                                               01573000
CVTIOSCS EQU   CVTS01+196                                               01574000
CVTSDRM  EQU   CVTS01+192                                               01575000
CVTOPTE  EQU   CVTS01+188                                               01576000
CVTSTXU  EQU   CVTS01+184                                               01577000
CVTQUIS  EQU   CVTS01+180                                               01578000
CVTPARS  EQU   CVTS01+176                                               01579000
CVTS1EE  EQU   CVTS01+172                                               01580000
CVTFRAS  EQU   CVTS01+168                                               01581000
CVTQSAS  EQU   CVTS01+164                                               01582000
CVTCRAS  EQU   CVTS01+160                                               01583000
CVTCRMN  EQU   CVTS01+156                                               01584000
CVTDELCP EQU   CVTS01+152                                               01585000
CVTFRECL EQU   CVTS01+148                                               01586000
CVTGETCL EQU   CVTS01+144                                               01587000
CVTBLDCP EQU   CVTS01+140                                               01588000
CVTAUTHL EQU   CVTS01+136                                               01589000
CVTSCAN  EQU   CVTS01+132                                               01590000
CVTRV144 EQU   CVTS01+130                                               01591000
CVTMAXMP EQU   CVTS01+128                                               01592000
CVTSTCK  EQU   CVTS01+124                                               01593000
CVTRV139 EQU   CVTS01+123                                               01594000
CVTDSSAC EQU   CVTS01+122                                               01595000
CVTRV513 EQU   CVTS01+121                                               01596000
CVTIOSPL EQU   CVTS01+120                                               01597000
CVTPTGT  EQU   CVTS01+116                                               01598000
CVTCSPIE EQU   CVTS01+112                                               01599000
CVTSMFEX EQU   CVTS01+108                                               01600000
CVTOLT0A EQU   CVTS01+104                                               01601000
CVTSRBRT EQU   CVTS01+100                                               01602000
CVTPUTL  EQU   CVTS01+96                                                01603000
CVTASCRL EQU   CVTS01+92                                                01604000
CVTASCRF EQU   CVTS01+88                                                01605000
CVTRV326 EQU   CVTS01+84                                                01606000
CVTRV325 EQU   CVTS01+80                                                01607000
CVTRV324 EQU   CVTS01+76                                                01608000
CVT0VL01 EQU   CVTS01+72                                                01609000
CVTSHRVM EQU   CVTS01+68                                                01610000
CVTRV332 EQU   CVTS01+64                                                01611000
CVTTAS   EQU   CVTS01+60                                                01612000
CVTRSCN  EQU   CVTS01+56                                                01613000
CVTTRAC2 EQU   CVTS01+54                                                01614000
CVTTRACE EQU   CVTS01+52                                                01615000
CVTAPG   EQU   CVTS01+51                                                01616000
CVTSDTRC EQU   CVTCTLFG                                                 01617000
CVTGTRCE EQU   CVTCTLFG                                                 01618000
CVTNOMP  EQU   CVTCTLFG                                                 01619000
CVTRSV79 EQU   CVTCTLFG                                                 01620000
CVTDSTAT EQU   CVTCTLFG                                                 01621000
CVTRSV78 EQU   CVTCTLFG                                                 01622000
CVTRV333 EQU   CVTCTLFG                                                 01623000
CVTRV323 EQU   CVTCTLFG                                                 01624000
CVTSPVLK EQU   CVTS01+49                                                01625000
CVTRSV77 EQU   CVTS01+48                                                01626000
CVTRV331 EQU   CVTS01+44                                                01627000
CVTRV330 EQU   CVTS01+40                                                01628000
CVTRV329 EQU   CVTS01+36                                                01629000
CVTRV328 EQU   CVTS01+32                                                01630000
CVTRV322 EQU   CVTS01+28                                                01631000
CVTSLID  EQU   CVTSLIDA+1                                               01632000
CVTSYLK  EQU   CVTSLIDA                                                 01633000
CVTRV321 EQU   CVTS01+20                                                01634000
CVTRV320 EQU   CVTS01+16                                                01635000
CVTLPDIR EQU   CVTLPDIA+1                                               01636000
CVTRSV69 EQU   CVTDIRST                                                 01637000
CVTRSV68 EQU   CVTDIRST                                                 01638000
CVTRSV67 EQU   CVTDIRST                                                 01639000
CVTRSV66 EQU   CVTDIRST                                                 01640000
CVTRSV65 EQU   CVTDIRST                                                 01641000
CVTRSV64 EQU   CVTDIRST                                                 01642000
CVTRSV63 EQU   CVTDIRST                                                 01643000
CVTDICOM EQU   CVTDIRST                                                 01644000
CVTPVTP  EQU   CVTS01+8                                                 01645000
CVTLPDSR EQU   CVTS01+4                                                 01646000
CVTGETL  EQU   CVTS01                                                   01647000
ASM5FLGS EQU   ASM5WKSV+64                                              01648000
ASM5AIA  EQU   ASM5WKSV+60                                              01649000
ASM5GCTR EQU   ASM5WKSV+56                                              01650000
ASM5SR14 EQU   ASM5WKSV+52                                              01651000
@NM00006 EQU   ASM5RGSV+4                                               01652000
ASM5RG2  EQU   ASM5RGSV                                                 01653000
@NM00005 EQU   ASM4RGSV+4                                               01654000
ASM4RG2  EQU   ASM4RGSV                                                 01655000
ASM3SR13 EQU   ASM3WKSV+28                                              01656000
ASM3R14B EQU   ASM3WKSV+24                                              01657000
ASM3R14A EQU   ASM3WKSV+20                                              01658000
ASM3GRPA EQU   ASM3WKSV+16                                              01659000
ASM3TMPA EQU   ASM3WKSV+12                                              01660000
ASM3PIOP EQU   ASM3WKSV+8                                               01661000
ASM3GENQ EQU   ASM3WKSV+4                                               01662000
ASM3SWPQ EQU   ASM3WKSV                                                 01663000
ASM2SR14 EQU   ASM2WRKA+16                                              01664000
@NM00004 EQU   ASM2WRKA+13                                              01665000
ASM2WFLG EQU   ASM2FLGS                                                 01666000
ASM2RFLG EQU   ASM2FLGS                                                 01667000
ASM2DUPQ EQU   ASM2WRKA+8                                               01668000
ASM2CAQ  EQU   ASM2WRKA+4                                               01669000
ASM2PAQ  EQU   ASM2WRKA                                                 01670000
ASM2RGSV EQU   ASM2WKSV                                                 01671000
ASM1NXTA EQU   ASM1WRKA+4                                               01672000
ASM1ASCB EQU   ASM1WRKA                                                 01673000
ASM1RG15 EQU   ASM1RGSV+56                                              01674000
@NM00003 EQU   ASM1RGSV+4                                               01675000
ASM1RG1  EQU   ASM1RGSV                                                 01676000
@NM00109 EQU   SRB+40                                                   01677000
@NM00108 EQU   SRB+38                                                   01678000
SRBPRIOR EQU   SRB+37                                                   01679000
SRBPKF   EQU   SRB+36                                                   01680000
SRBSAVE  EQU   SRB+32                                                   01681000
SRBPARM  EQU   SRB+28                                                   01682000
SRBRMTR  EQU   SRB+24                                                   01683000
SRBPTCB  EQU   SRBFLC+4                                                 01684000
SRBPASID EQU   SRBFLC+2                                                 01685000
SRBCPAFF EQU   SRBFLC                                                   01686000
SRBASCB  EQU   SRB+8                                                    01687000
SRBID    EQU   SRB                                                      01688000
@NM00107 EQU   SDWA+512                                                 01689000
@NM00106 EQU   SDWADPVA                                                 01690000
SDWAEBC  EQU   SDWADPVA                                                 01691000
SDWAHEX  EQU   SDWADPVA                                                 01692000
@NM00105 EQU   SDWA+396                                                 01693000
SDWACOMP EQU   SDWA+392                                                 01694000
SDWARCPL EQU   SDWA+364                                                 01695000
@NM00104 EQU   SDWADPSA+32                                              01696000
SDWATO4  EQU   SDWADPSL+28                                              01697000
SDWAFRM4 EQU   SDWADPSL+24                                              01698000
SDWATO3  EQU   SDWADPSL+20                                              01699000
SDWAFRM3 EQU   SDWADPSL+16                                              01700000
SDWATO2  EQU   SDWADPSL+12                                              01701000
SDWAFRM2 EQU   SDWADPSL+8                                               01702000
SDWATO1  EQU   SDWADPSL+4                                               01703000
SDWAFRM1 EQU   SDWADPSL                                                 01704000
@NM00103 EQU   SDWADDAT+3                                               01705000
@NM00102 EQU   SDWAPDAT                                                 01706000
SDWAUSPL EQU   SDWAPDAT                                                 01707000
SDWADPSW EQU   SDWAPDAT                                                 01708000
SDWATJPA EQU   SDWAPDAT                                                 01709000
SDWATLPA EQU   SDWAPDAT                                                 01710000
SDWADREG EQU   SDWAPDAT                                                 01711000
SDWADSAH EQU   SDWAPDAT                                                 01712000
SDWADSAS EQU   SDWAPDAT                                                 01713000
@NM00101 EQU   SDWADDAT+1                                               01714000
@NM00100 EQU   SDWASDAT                                                 01715000
SDWAQQS  EQU   SDWASDAT                                                 01716000
SDWACBS  EQU   SDWASDAT                                                 01717000
SDWAGTF  EQU   SDWASDAT                                                 01718000
SDWASWA  EQU   SDWASDAT                                                 01719000
SDWALSQA EQU   SDWASDAT                                                 01720000
SDWASQA  EQU   SDWASDAT                                                 01721000
SDWANUC  EQU   SDWASDAT                                                 01722000
@NM00099 EQU   SDWADUMP+2                                               01723000
@NM00098 EQU   SDWADPFS                                                 01724000
SDWASLST EQU   SDWADPFS                                                 01725000
@NM00097 EQU   SDWADPFS                                                 01726000
SDWADLST EQU   SDWADPFS                                                 01727000
SDWADPT  EQU   SDWADPFS                                                 01728000
SDWADPID EQU   SDWADUMP                                                 01729000
SDWADPLA EQU   SDWA+316                                                 01730000
SDWAREXN EQU   SDWARECP+16                                              01731000
SDWACSCT EQU   SDWARECP+8                                               01732000
SDWAMODN EQU   SDWARECP                                                 01733000
@NM00096 EQU   SDWA+290                                                 01734000
SDWAASID EQU   SDWA+288                                                 01735000
SDWATALW EQU   SDWALKWS+28                                              01736000
SDWATDLW EQU   SDWALKWS+24                                              01737000
SDWATNLW EQU   SDWALKWS+20                                              01738000
SDWAAPLW EQU   SDWALKWS+16                                              01739000
SDWAIPLW EQU   SDWALKWS+12                                              01740000
SDWAILLW EQU   SDWALKWS+8                                               01741000
SDWAIULW EQU   SDWALKWS+4                                               01742000
SDWAICLW EQU   SDWALKWS                                                 01743000
SDWAFLLK EQU   SDWAACF4                                                 01744000
SDWACMS  EQU   SDWAACF4                                                 01745000
SDWAOPTM EQU   SDWAACF4                                                 01746000
SDWATADB EQU   SDWAACF4                                                 01747000
SDWATDNB EQU   SDWAACF4                                                 01748000
SDWATNCB EQU   SDWAACF4                                                 01749000
SDWAILCH EQU   SDWAACF4                                                 01750000
SDWAIUCB EQU   SDWAACF4                                                 01751000
SDWAICAT EQU   SDWAACF3                                                 01752000
SDWAIPRG EQU   SDWAACF3                                                 01753000
SDWASALL EQU   SDWAACF3                                                 01754000
SDWAASMP EQU   SDWAACF3                                                 01755000
SDWADISP EQU   SDWAACF3                                                 01756000
@NM00095 EQU   SDWAACF3                                                 01757000
@NM00094 EQU   SDWAACF2                                                 01758000
SDWAFREE EQU   SDWAACF2                                                 01759000
SDWAUPRG EQU   SDWAACF2                                                 01760000
@NM00093 EQU   SDWAACF2                                                 01761000
SDWASPIN EQU   SDWAACF2                                                 01762000
@NM00092 EQU   SDWAACF2                                                 01763000
SDWALCPU EQU   SDWACPUA+2                                               01764000
@NM00091 EQU   SDWACPUA                                                 01765000
SDWARECA EQU   SDWA+244                                                 01766000
SDWARTYA EQU   SDWA+240                                                 01767000
@NM00090 EQU   SDWA+239                                                 01768000
@NM00089 EQU   SDWAIOFS                                                 01769000
SDWANIOP EQU   SDWAIOFS                                                 01770000
SDWANOIO EQU   SDWAIOFS                                                 01771000
SDWAIOHT EQU   SDWAIOFS                                                 01772000
SDWAIOQR EQU   SDWAIOFS                                                 01773000
SDWAFMID EQU   SDWA+236                                                 01774000
@NM00088 EQU   SDWAERRD                                                 01775000
SDWAMCIV EQU   SDWAERRD                                                 01776000
SDWARPIV EQU   SDWAERRD                                                 01777000
SDWAMABD EQU   SDWAERRD                                                 01778000
SDWACTS  EQU   SDWAERRD                                                 01779000
SDWASTAE EQU   SDWAERRD                                                 01780000
SDWANRBE EQU   SDWAERRD                                                 01781000
SDWACLUP EQU   SDWAERRD                                                 01782000
@NM00087 EQU   SDWAERRC                                                 01783000
SDWAEAS  EQU   SDWAERRC                                                 01784000
SDWAPERC EQU   SDWAERRC                                                 01785000
SDWAIRB  EQU   SDWAERRC                                                 01786000
SDWASTAI EQU   SDWAERRC                                                 01787000
SDWASTAF EQU   SDWAERRC                                                 01788000
SDWASRBM EQU   SDWAERRB                                                 01789000
SDWALDIS EQU   SDWAERRB                                                 01790000
SDWAENRB EQU   SDWAERRB                                                 01791000
SDWATYP1 EQU   SDWAERRB                                                 01792000
@NM00086 EQU   SDWAERRB                                                 01793000
SDWAPGIO EQU   SDWAERRA                                                 01794000
SDWATEXC EQU   SDWAERRA                                                 01795000
SDWASVCE EQU   SDWAERRA                                                 01796000
SDWAABTM EQU   SDWAERRA                                                 01797000
SDWASVCD EQU   SDWAERRA                                                 01798000
SDWARKEY EQU   SDWAERRA                                                 01799000
SDWAPCHK EQU   SDWAERRA                                                 01800000
SDWAMCHK EQU   SDWAERRA                                                 01801000
SDWATIME EQU   SDWAMCH+20                                               01802000
SDWARFSA EQU   SDWAMCH+16                                               01803000
@NM00085 EQU   SDWAMCH+14                                               01804000
SDWAVEQR EQU   SDWARSR2                                                 01805000
SDWAPGFX EQU   SDWARSR2                                                 01806000
SDWAFLSQ EQU   SDWARSR2                                                 01807000
SDWAFSQA EQU   SDWARSR2                                                 01808000
SDWANUCL EQU   SDWARSR2                                                 01809000
SDWASPER EQU   SDWARSR2                                                 01810000
SDWAINTC EQU   SDWARSR2                                                 01811000
SDWAOFLN EQU   SDWARSR2                                                 01812000
SDWACHNG EQU   SDWARSR1                                                 01813000
SDWAMSER EQU   SDWARSR1                                                 01814000
@NM00084 EQU   SDWARSR1                                                 01815000
SDWACPID EQU   SDWAMCH+10                                               01816000
SDWATERR EQU   SDWAMCHD                                                 01817000
SDWAFPRX EQU   SDWAMCHD                                                 01818000
SDWAINSF EQU   SDWAMCHD                                                 01819000
SDWAACR  EQU   SDWAMCHD                                                 01820000
SDWASCK  EQU   SDWAMCHD                                                 01821000
SDWAPSWU EQU   SDWAMCHD                                                 01822000
SDWAREGU EQU   SDWAMCHD                                                 01823000
SDWASKYF EQU   SDWAMCHD                                                 01824000
@NM00083 EQU   SDWAMCHS                                                 01825000
SDWARSRF EQU   SDWAMCHS                                                 01826000
SDWARSRC EQU   SDWAMCHS                                                 01827000
SDWAINVP EQU   SDWAMCHS                                                 01828000
SDWATSVL EQU   SDWAMCHS                                                 01829000
SDWARCDF EQU   SDWAMCHS                                                 01830000
SDWASRVL EQU   SDWAMCHS                                                 01831000
SDWASCKE EQU   SDWASTCK+4                                               01832000
SDWASCKB EQU   SDWASTCK                                                 01833000
SDWALNTH EQU   SDWAIDNT+1                                               01834000
SDWASPID EQU   SDWAIDNT                                                 01835000
SDWASR15 EQU   SDWASRSV+60                                              01836000
SDWASR14 EQU   SDWASRSV+56                                              01837000
SDWASR13 EQU   SDWASRSV+52                                              01838000
SDWASR12 EQU   SDWASRSV+48                                              01839000
SDWASR11 EQU   SDWASRSV+44                                              01840000
SDWASR10 EQU   SDWASRSV+40                                              01841000
SDWASR09 EQU   SDWASRSV+36                                              01842000
SDWASR08 EQU   SDWASRSV+32                                              01843000
SDWASR07 EQU   SDWASRSV+28                                              01844000
SDWASR06 EQU   SDWASRSV+24                                              01845000
SDWASR05 EQU   SDWASRSV+20                                              01846000
SDWASR04 EQU   SDWASRSV+16                                              01847000
SDWASR03 EQU   SDWASRSV+12                                              01848000
SDWASR02 EQU   SDWASRSV+8                                               01849000
SDWASR01 EQU   SDWASRSV+4                                               01850000
SDWASR00 EQU   SDWASRSV                                                 01851000
SDWATRN2 EQU   SDWAAEC2+4                                               01852000
SDWAIPC2 EQU   SDWAICD2                                                 01853000
SDWAIMC2 EQU   SDWAICD2                                                 01854000
SDWAIPR2 EQU   SDWAICD2                                                 01855000
@NM00082 EQU   SDWAINC2                                                 01856000
@NM00081 EQU   SDWAILC2                                                 01857000
SDWAIL2  EQU   SDWAILC2                                                 01858000
@NM00080 EQU   SDWAILC2                                                 01859000
@NM00079 EQU   SDWAAEC2                                                 01860000
SDWAADD2 EQU   SDWANXT2+1                                               01861000
@NM00078 EQU   SDWANXT2                                                 01862000
@NM00077 EQU   SDWAEC2+3                                                01863000
SDWASGN2 EQU   SDWAINT2                                                 01864000
SDWAEXP2 EQU   SDWAINT2                                                 01865000
SDWADEC2 EQU   SDWAINT2                                                 01866000
SDWAFPO2 EQU   SDWAINT2                                                 01867000
SDWACC2  EQU   SDWAINT2                                                 01868000
@NM00076 EQU   SDWAINT2                                                 01869000
SDWAPGM2 EQU   SDWAMWP2                                                 01870000
SDWAWAT2 EQU   SDWAMWP2                                                 01871000
SDWAMCK2 EQU   SDWAMWP2                                                 01872000
SDWAECT2 EQU   SDWAMWP2                                                 01873000
SDWAKEY2 EQU   SDWAMWP2                                                 01874000
SDWAEXT2 EQU   SDWAEMK2                                                 01875000
SDWAIO2  EQU   SDWAEMK2                                                 01876000
SDWATRM2 EQU   SDWAEMK2                                                 01877000
@NM00075 EQU   SDWAEMK2                                                 01878000
SDWAPER2 EQU   SDWAEMK2                                                 01879000
@NM00074 EQU   SDWAEMK2                                                 01880000
SDWATRAN EQU   SDWAAEC1+4                                               01881000
SDWAIPC1 EQU   SDWAICD1                                                 01882000
SDWAIMC1 EQU   SDWAICD1                                                 01883000
SDWAIPR1 EQU   SDWAICD1                                                 01884000
@NM00073 EQU   SDWAINC1                                                 01885000
@NM00072 EQU   SDWAILC1                                                 01886000
SDWAIL1  EQU   SDWAILC1                                                 01887000
@NM00071 EQU   SDWAILC1                                                 01888000
@NM00070 EQU   SDWAAEC1                                                 01889000
SDWAADD1 EQU   SDWANXT1+1                                               01890000
@NM00069 EQU   SDWANXT1                                                 01891000
@NM00068 EQU   SDWAEC1+3                                                01892000
SDWASGN1 EQU   SDWAINT1                                                 01893000
SDWAEXP1 EQU   SDWAINT1                                                 01894000
SDWADEC1 EQU   SDWAINT1                                                 01895000
SDWAFPO1 EQU   SDWAINT1                                                 01896000
SDWACC1  EQU   SDWAINT1                                                 01897000
@NM00067 EQU   SDWAINT1                                                 01898000
SDWAPGM1 EQU   SDWAMWP1                                                 01899000
SDWAWAT1 EQU   SDWAMWP1                                                 01900000
SDWAMCK1 EQU   SDWAMWP1                                                 01901000
SDWAECT1 EQU   SDWAMWP1                                                 01902000
SDWAKEY1 EQU   SDWAMWP1                                                 01903000
SDWAEXT1 EQU   SDWAEMK1                                                 01904000
SDWAIO1  EQU   SDWAEMK1                                                 01905000
SDWATRM1 EQU   SDWAEMK1                                                 01906000
@NM00066 EQU   SDWAEMK1                                                 01907000
SDWAPER1 EQU   SDWAEMK1                                                 01908000
@NM00065 EQU   SDWAEMK1                                                 01909000
SDWAIOBR EQU   SDWA+100                                                 01910000
SDWAEPA  EQU   SDWA+96                                                  01911000
@NM00064 EQU   SDWANAME+4                                               01912000
SDWARBAD EQU   SDWANAME                                                 01913000
SDWAGR15 EQU   SDWAGRSV+60                                              01914000
SDWAGR14 EQU   SDWAGRSV+56                                              01915000
SDWAGR13 EQU   SDWAGRSV+52                                              01916000
SDWAGR12 EQU   SDWAGRSV+48                                              01917000
SDWAGR11 EQU   SDWAGRSV+44                                              01918000
SDWAGR10 EQU   SDWAGRSV+40                                              01919000
SDWAGR09 EQU   SDWAGRSV+36                                              01920000
SDWAGR08 EQU   SDWAGRSV+32                                              01921000
SDWAGR07 EQU   SDWAGRSV+28                                              01922000
SDWAGR06 EQU   SDWAGRSV+24                                              01923000
SDWAGR05 EQU   SDWAGRSV+20                                              01924000
SDWAGR04 EQU   SDWAGRSV+16                                              01925000
SDWAGR03 EQU   SDWAGRSV+12                                              01926000
SDWAGR02 EQU   SDWAGRSV+8                                               01927000
SDWAGR01 EQU   SDWAGRSV+4                                               01928000
SDWAGR00 EQU   SDWAGRSV                                                 01929000
SDWANXTP EQU   SDWACTL2+5                                               01930000
SDWASGP  EQU   SDWAPMKP                                                 01931000
SDWAEUP  EQU   SDWAPMKP                                                 01932000
SDWADOP  EQU   SDWAPMKP                                                 01933000
SDWAFPP  EQU   SDWAPMKP                                                 01934000
SDWACCP  EQU   SDWAPMKP                                                 01935000
SDWAILP  EQU   SDWAPMKP                                                 01936000
SDWAINTP EQU   SDWACTL2+2                                               01937000
SDWASPVP EQU   SDWAMWPP                                                 01938000
SDWAWATP EQU   SDWAMWPP                                                 01939000
SDWAMCKP EQU   SDWAMWPP                                                 01940000
@NM00063 EQU   SDWAMWPP                                                 01941000
SDWAKEYP EQU   SDWAMWPP                                                 01942000
SDWAEXTP EQU   SDWACMKP                                                 01943000
SDWAIOP  EQU   SDWACMKP                                                 01944000
SDWANXTA EQU   SDWACTL1+5                                               01945000
SDWASGA  EQU   SDWAPMKA                                                 01946000
SDWAEUA  EQU   SDWAPMKA                                                 01947000
SDWADOA  EQU   SDWAPMKA                                                 01948000
SDWAFPA  EQU   SDWAPMKA                                                 01949000
SDWACCA  EQU   SDWAPMKA                                                 01950000
SDWAILA  EQU   SDWAPMKA                                                 01951000
SDWAINTA EQU   SDWACTL1+2                                               01952000
SDWASPVA EQU   SDWAMWPA                                                 01953000
SDWAWATA EQU   SDWAMWPA                                                 01954000
SDWAMCKA EQU   SDWAMWPA                                                 01955000
@NM00062 EQU   SDWAMWPA                                                 01956000
SDWAKEYA EQU   SDWAMWPA                                                 01957000
SDWAEXTA EQU   SDWACMKA                                                 01958000
SDWAIOA  EQU   SDWACMKA                                                 01959000
@NM00061 EQU   SDWACMPF                                                 01960000
SDWASTCC EQU   SDWACMPF                                                 01961000
@NM00060 EQU   SDWACMPF                                                 01962000
SDWASTEP EQU   SDWACMPF                                                 01963000
SDWAREQ  EQU   SDWACMPF                                                 01964000
@NM00059 EQU   SCCWLTIC+4                                               01965000
SCCWLTAD EQU   SCCWLTIC+1                                               01966000
SCCWLTOP EQU   SCCWLTIC                                                 01967000
SCCWRWCT EQU   SCCWRW+6                                                 01968000
@NM00058 EQU   SCCWRW+5                                                 01969000
SCCWRWFL EQU   SCCWRW+4                                                 01970000
SCCWRWAD EQU   SCCWRW+1                                                 01971000
SCCWRWOP EQU   SCCWRW                                                   01972000
@NM00057 EQU   SCCWTIC+4                                                01973000
SCCWTIAD EQU   SCCWTIC+1                                                01974000
SCCWTIOP EQU   SCCWTIC                                                  01975000
SCCWSRCT EQU   SCCWSRCH+6                                               01976000
@NM00056 EQU   SCCWSRCH+5                                               01977000
SCCWSRFL EQU   SCCWSRCH+4                                               01978000
SCCWSRAD EQU   SCCWSRCH+1                                               01979000
SCCWSROP EQU   SCCWSRCH                                                 01980000
SCCWFLCT EQU   SCCWSSEC+4                                               01981000
SCCWSSAD EQU   SCCWSSEC+1                                               01982000
SCCWSSOP EQU   SCCWSSEC                                                 01983000
SCCWFGCT EQU   SCCWSEEK+4                                               01984000
SCCWSKAD EQU   SCCWSEEK+1                                               01985000
SCCWSKOP EQU   SCCWSEEK                                                 01986000
SCCWSVOA EQU   SCCWHDR+84                                               01987000
SCCWLCCW EQU   SCCWHDR+80                                               01988000
SCCWRSV1 EQU   SCCWSARG+63                                              01989000
SCCWR    EQU   SCCWSRH+4                                                01990000
SCCWHH   EQU   SCCWCCHH+2                                               01991000
SCCWCC   EQU   SCCWCCHH                                                 01992000
SCCWBB   EQU   SCCWSARG+1                                               01993000
SCCWM    EQU   SCCWSARG                                                 01994000
SCCWIORB EQU   SCCWHDR+12                                               01995000
SCCWAIA  EQU   SCCWHDR+8                                                01996000
SCCWSCCW EQU   SCCWHDR+4                                                01997000
@NM00055 EQU   SCCWHDR+3                                                01998000
@NM00054 EQU   SCCWFLAG                                                 01999000
SCCWERR  EQU   SCCWFLAG                                                 02000000
SCCWSECT EQU   SCCWHDR+1                                                02001000
SCCWID   EQU   SCCWHDR                                                  02002000
SREUCB   EQU   SARTE+44                                                 02003000
SREEDB   EQU   SARTE+40                                                 02004000
SRESDCTE EQU   SARTE+36                                                 02005000
SRESAT   EQU   SARTE+32                                                 02006000
SREIORB  EQU   SARTE+28                                                 02007000
SRERRCNT EQU   SARTE+24                                                 02008000
SREAVLSL EQU   SARTE+20                                                 02009000
SRETOTSL EQU   SARTE+16                                                 02010000
SRESCCW  EQU   SARTE+12                                                 02011000
SRENN    EQU   SARTE+10                                                 02012000
@NM00053 EQU   SREFLG                                                   02013000
SREFIXED EQU   SREFLG                                                   02014000
SREDRIVE EQU   SREFLG                                                   02015000
SREDSBD  EQU   SREFLG                                                   02016000
SRENUSE  EQU   SREFLG                                                   02017000
@NM00052 EQU   SARTE+8                                                  02018000
SRELOCK  EQU   SARTE+4                                                  02019000
SRENEXT  EQU   SARTE                                                    02020000
SARENTS  EQU   SART+80                                                  02021000
@NM00051 EQU   SARTHDR+60                                               02022000
SARSETSZ EQU   SARTHDR+56                                               02023000
SARWAITL EQU   SARWAITQ+4                                               02024000
SARWAITF EQU   SARWAITQ                                                 02025000
SARSETCT EQU   SARTHDR+36                                               02026000
SARSDCT  EQU   SARTHDR+28                                               02027000
SARDSNL  EQU   SARTHDR+24                                               02028000
SARMOVNX EQU   SARTHDR+20                                               02029000
SARFXDNX EQU   SARTHDR+16                                               02030000
@NM00050 EQU   SARTHDR+12                                               02031000
SARSIZE  EQU   SARTHDR+4                                                02032000
SARID    EQU   SARTHDR                                                  02033000
@NM00025 EQU   PCCW+72                                                  02034000
PCCWNCT  EQU   PCCWNOP+6                                                02035000
PCCWNFG  EQU   PCCWNOP+4                                                02036000
PCCWNAD  EQU   PCCWNOP+1                                                02037000
PCCWN    EQU   PCCWNOP                                                  02038000
PCCWCNT  EQU   PCCWRW+6                                                 02039000
PCCWRWFG EQU   PCCWRW+4                                                 02040000
PCCWADDR EQU   PCCWRW+1                                                 02041000
PCCWRDWT EQU   PCCWRW                                                   02042000
PCCWTCT  EQU   PCCWTIC+6                                                02043000
PCCWTFG  EQU   PCCWTIC+4                                                02044000
PCCWTAD  EQU   PCCWTIC+1                                                02045000
PCCWT    EQU   PCCWTIC                                                  02046000
PCCWSICT EQU   PCCWSRCH+6                                               02047000
PCCWSIFG EQU   PCCWSRCH+4                                               02048000
PCCWSIAD EQU   PCCWSRCH+1                                               02049000
PCCWSIDE EQU   PCCWSRCH                                                 02050000
PCCWSSCT EQU   PCCWSSEC+6                                               02051000
PCCWSSFG EQU   PCCWSSEC+4                                               02052000
PCCWSSAD EQU   PCCWSSEC+1                                               02053000
PCCWSS   EQU   PCCWSSEC                                                 02054000
PCCWSKCT EQU   PCCWSEEK+6                                               02055000
PCCWSKFG EQU   PCCWSEEK+4                                               02056000
PCCWSKAD EQU   PCCWSEEK+1                                               02057000
PCCWSK   EQU   PCCWSEEK                                                 02058000
PCCWR    EQU   PCCWCHHR+7                                               02059000
PCCWHH   EQU   PCCWCHHR+5                                               02060000
PCCWCC   EQU   PCCWCHHR+3                                               02061000
PCCWBB   EQU   PCCWCHHR+1                                               02062000
PCCWM    EQU   PCCWCHHR                                                 02063000
PCCWIORB EQU   PCCW+12                                                  02064000
@NM00024 EQU   PCCW+3                                                   02065000
@NM00023 EQU   PCCWFLGS                                                 02066000
PCCWFERR EQU   PCCWFLGS                                                 02067000
PCCWSECT EQU   PCCW+1                                                   02068000
PCCWID   EQU   PCCW                                                     02069000
@NM00022 EQU   PARTENT+62                                               02070000
PARELCYL EQU   PARTENT+60                                               02071000
PARERQTM EQU   PARTENT+56                                               02072000
PAREWTQE EQU   PARTENT+52                                               02073000
PARENODE EQU   PARTENT+48                                               02074000
PAREUCBP EQU   PARTENT+44                                               02075000
PAREEDBP EQU   PARTENT+40                                               02076000
PAREPCTP EQU   PARTENT+36                                               02077000
PAREPATP EQU   PARTENT+32                                               02078000
PAREIORB EQU   PARTENT+28                                               02079000
PARERRCT EQU   PARTENT+24                                               02080000
PARESLTA EQU   PARTENT+20                                               02081000
PARESZSL EQU   PARTENT+16                                               02082000
PAREIOEQ EQU   PARTENT+12                                               02083000
PARENN   EQU   PARTENT+10                                               02084000
@NM00021 EQU   PAREFLG1                                                 02085000
PAREINCP EQU   PAREFLG1                                                 02086000
PARENUSE EQU   PAREFLG1                                                 02087000
@NM00020 EQU   PARETYPE                                                 02088000
PARELOCL EQU   PARETYPE                                                 02089000
PAREDPLX EQU   PARETYPE                                                 02090000
PARECOMM EQU   PARETYPE                                                 02091000
PAREPLPA EQU   PARETYPE                                                 02092000
PARECPCT EQU   PARELKUP+2                                               02093000
PAREIORN EQU   PARELKUP+1                                               02094000
@NM00019 EQU   PARELKFL                                                 02095000
PAREFSIP EQU   PARELKFL                                                 02096000
PAREPARE EQU   PARTENT                                                  02097000
PARTENTS EQU   PART+80                                                  02098000
PARTLOCL EQU   PARTLOCQ+4                                               02099000
PARTLOCF EQU   PARTLOCQ                                                 02100000
PARTDUPL EQU   PARTDUPQ+4                                               02101000
PARTDUPF EQU   PARTDUPQ                                                 02102000
PARTSPLL EQU   PARTSPLQ+4                                               02103000
PARTSPLF EQU   PARTSPLQ                                                 02104000
PARTCOML EQU   PARTCOMQ+4                                               02105000
PARTCOMF EQU   PARTCOMQ                                                 02106000
PARTLOCK EQU   PARTHDR+44                                               02107000
PARTLKUP EQU   PARTHDR+40                                               02108000
@NM00018 EQU   PARTHDR+34                                               02109000
PARTLCNT EQU   PARTHDR+32                                               02110000
PARTPCTQ EQU   PARTHDR+28                                               02111000
PARTDSNL EQU   PARTTPAR                                                 02112000
PARTCIR2 EQU   PARTHDR+20                                               02113000
PARTCIR1 EQU   PARTHDR+16                                               02114000
PARTEUSE EQU   PARTHDR+8                                                02115000
PARTSIZE EQU   PARTHDR+4                                                02116000
PARTIDEN EQU   PARTHDR                                                  02117000
IOSEND   EQU   IOSB+108                                                 02118000
IOSSKR   EQU   IOSEEKA+7                                                02119000
IOSSKH2  EQU   IOSSKHH+1                                                02120000
IOSSKH1  EQU   IOSSKHH                                                  02121000
IOSSKCC  EQU   IOSCCHH                                                  02122000
IOSSKBB  EQU   IOSEEKA+1                                                02123000
IOSSKM   EQU   IOSEEKA                                                  02124000
IOSMDM   EQU   IOSB+91                                                  02125000
IOSMDB   EQU   IOSB+90                                                  02126000
IOSCKEY7 EQU   IOSCKEY                                                  02127000
IOSCKEY6 EQU   IOSCKEY                                                  02128000
IOSCKEY5 EQU   IOSCKEY                                                  02129000
IOSCKEY4 EQU   IOSCKEY                                                  02130000
@NM00014 EQU   IOSCKEY                                                  02131000
IOSFMSK  EQU   IOSB+88                                                  02132000
IOSCUDEV EQU   IOSPATH+1                                                02133000
@NM00013 EQU   IOSCHN                                                   02134000
IOSPATH3 EQU   IOSCHN                                                   02135000
IOSPATH2 EQU   IOSCHN                                                   02136000
IOSEXP   EQU   IOSCHN                                                   02137000
IOSGDP   EQU   IOSCHN                                                   02138000
IOSAFF   EQU   IOSB+85                                                  02139000
IOSRSS1B EQU   IOSB+84                                                  02140000
IOSDSID  EQU   IOSB+80                                                  02141000
IOSRST   EQU   IOSB+72                                                  02142000
IOSNOTRS EQU   IOSDIEFG                                                 02143000
IOSABN   EQU   IOSB+64                                                  02144000
IOSNRM   EQU   IOSB+60                                                  02145000
IOSPCI   EQU   IOSB+56                                                  02146000
IOSERP   EQU   IOSB+52                                                  02147000
IOSPCHN  EQU   IOSB+48                                                  02148000
IOSSNS   EQU   IOSB+42                                                  02149000
IOSAPMSK EQU   IOSB+40                                                  02150000
IOSRES4A EQU   IOSB+36                                                  02151000
IOSCSWRC EQU   IOSCSW+5                                                 02152000
IOSTSB   EQU   IOSTATUS+1                                               02153000
IOSTSA   EQU   IOSTATUS                                                 02154000
IOSCSWCA EQU   IOSCSW                                                   02155000
IOSOPT2X EQU   IOSOPT2                                                  02156000
IOSHTP   EQU   IOSOPT2                                                  02157000
IOSRELSE EQU   IOSOPT                                                   02158000
IOSAPR   EQU   IOSOPT                                                   02159000
IOSTSLL  EQU   IOSOPT                                                   02160000
IOSNERP  EQU   IOSOPT                                                   02161000
IOSPSLL  EQU   IOSOPT                                                   02162000
IOSQISCE EQU   IOSOPT                                                   02163000
IOSDEP   EQU   IOSOPT                                                   02164000
IOSBYP   EQU   IOSOPT                                                   02165000
IOSPKY7  EQU   IOSPKEY                                                  02166000
IOSPGDPX EQU   IOSPKEY                                                  02167000
IOSIDR   EQU   IOSPKEY                                                  02168000
IOSLCL   EQU   IOSPKEY                                                  02169000
@NM00011 EQU   IOSPKEY                                                  02170000
IOSPGAD  EQU   IOSB+8                                                   02171000
IOSASID  EQU   IOSB+6                                                   02172000
IOSPRLVL EQU   IOSB+5                                                   02173000
IOSDVRID EQU   IOSB+4                                                   02174000
IOSPROC  EQU   IOSB+3                                                   02175000
IOSFLC7  EQU   IOSFLC                                                   02176000
IOSFLC6  EQU   IOSFLC                                                   02177000
IOSRWAIT EQU   IOSFLC                                                   02178000
IOSTP    EQU   IOSFLC                                                   02179000
IOSCC3WE EQU   IOSFLC                                                   02180000
IOSVERIF EQU   IOSDVALT                                                 02181000
IOSDVMNT EQU   IOSFLC                                                   02182000
IOSLOG   EQU   IOSFLB                                                   02183000
IOSBDCST EQU   IOSFLB                                                   02184000
IOSMSG   EQU   IOSFLB                                                   02185000
IOSFLB4  EQU   IOSFLB                                                   02186000
IOSFLB3  EQU   IOSFLB                                                   02187000
IOSFLB2  EQU   IOSFLB                                                   02188000
IOSSDR   EQU   IOSFLB                                                   02189000
IOSIOSB  EQU   IOSFLA                                                   02190000
IOSDOM   EQU   IOSFLA                                                   02191000
IOSEX    EQU   IOSFLA                                                   02192000
IOSSMDB  EQU   IOSFLA                                                   02193000
IOSSMDA  EQU   IOSFLA                                                   02194000
IOSERR   EQU   IOSFLA                                                   02195000
IOSCCHN  EQU   IOSACHN                                                  02196000
IOSDCHN  EQU   IOSACHN                                                  02197000
@NM00010 EQU   IORB+40                                                  02198000
IORRSV   EQU   IORB+36                                                  02199000
IORTSMP  EQU   IORB+24                                                  02200000
IORERR   EQU   IORB+20                                                  02201000
IORSAVE  EQU   IORB+16                                                  02202000
IORIOSB  EQU   IORB+12                                                  02203000
IORSCCW  EQU   IORPCCW                                                  02204000
IORIORB  EQU   IORB+4                                                   02205000
IORFAE   EQU   IORAPND                                                  02206000
IORFNE   EQU   IORAPND                                                  02207000
IORFDI   EQU   IORAPND                                                  02208000
@NM00009 EQU   IORFLGS                                                  02209000
IORFRPS  EQU   IORFLGS                                                  02210000
IORRQSZ  EQU   IORB+2                                                   02211000
IORNUM   EQU   IORB+1                                                   02212000
IORID    EQU   IORB                                                     02213000
CVTLEVL  EQU   CVTRELNO+2                                               02214000
CVTNUMB  EQU   CVTRELNO                                                 02215000
CVTMDL   EQU   CVTFIX+250                                               02216000
@NM00008 EQU   CVTFIX+248                                               02217000
@NM00007 EQU   CVTFIX                                                   02218000
CVTRV482 EQU   CVTXTNT2+128                                             02219000
CVTRV481 EQU   CVTXTNT2+124                                             02220000
CVTRV480 EQU   CVTXTNT2+120                                             02221000
CVTRV479 EQU   CVTXTNT2+118                                             02222000
CVTRV478 EQU   CVTXTNT2+117                                             02223000
CVTRV477 EQU   CVTXTNT2+116                                             02224000
CVTRV476 EQU   CVTXTNT2+115                                             02225000
CVTRV475 EQU   CVTXTNT2+114                                             02226000
CVTRV474 EQU   CVTRV466                                                 02227000
CVTRV473 EQU   CVTRV466                                                 02228000
CVTRV472 EQU   CVTRV466                                                 02229000
CVTRV471 EQU   CVTRV466                                                 02230000
CVTRV470 EQU   CVTRV466                                                 02231000
CVTRV469 EQU   CVTRV466                                                 02232000
CVTRV468 EQU   CVTRV466                                                 02233000
CVTRV467 EQU   CVTRV466                                                 02234000
CVTRV465 EQU   CVTRV457                                                 02235000
CVTRV464 EQU   CVTRV457                                                 02236000
CVTRV463 EQU   CVTRV457                                                 02237000
CVTRV462 EQU   CVTRV457                                                 02238000
CVTRV461 EQU   CVTRV457                                                 02239000
CVTRV460 EQU   CVTRV457                                                 02240000
CVTRV459 EQU   CVTRV457                                                 02241000
CVTRV458 EQU   CVTRV457                                                 02242000
CVTRV456 EQU   CVTXTNT2+108                                             02243000
CVTRV455 EQU   CVTXTNT2+104                                             02244000
CVTRV454 EQU   CVTXTNT2+100                                             02245000
CVTRV453 EQU   CVTXTNT2+96                                              02246000
CVTRV452 EQU   CVTXTNT2+94                                              02247000
CVTRV451 EQU   CVTXTNT2+92                                              02248000
CVTRV450 EQU   CVTXTNT2+90                                              02249000
CVTRV449 EQU   CVTXTNT2+88                                              02250000
CVTRV448 EQU   CVTXTNT2+87                                              02251000
CVTRV447 EQU   CVTXTNT2+86                                              02252000
CVTRV446 EQU   CVTRV438                                                 02253000
CVTRV445 EQU   CVTRV438                                                 02254000
CVTRV444 EQU   CVTRV438                                                 02255000
CVTRV443 EQU   CVTRV438                                                 02256000
CVTRV442 EQU   CVTRV438                                                 02257000
CVTRV441 EQU   CVTRV438                                                 02258000
CVTRV440 EQU   CVTRV438                                                 02259000
CVTRV439 EQU   CVTRV438                                                 02260000
CVTRV437 EQU   CVTRV429                                                 02261000
CVTRV436 EQU   CVTRV429                                                 02262000
CVTRV435 EQU   CVTRV429                                                 02263000
CVTRV434 EQU   CVTRV429                                                 02264000
CVTRV433 EQU   CVTRV429                                                 02265000
CVTRV432 EQU   CVTRV429                                                 02266000
CVTRV431 EQU   CVTRV429                                                 02267000
CVTRV430 EQU   CVTRV429                                                 02268000
CVTRV428 EQU   CVTXTNT2+80                                              02269000
CVTRV427 EQU   CVTXTNT2+76                                              02270000
CVTRV426 EQU   CVTXTNT2+72                                              02271000
CVTRV425 EQU   CVTXTNT2+68                                              02272000
CVTATACT EQU   CVTATCVT                                                 02273000
CVTRV423 EQU   CVTXTNT2+62                                              02274000
CVTRV422 EQU   CVTXTNT2+60                                              02275000
CVTRV421 EQU   CVTXTNT2+58                                              02276000
CVTRV420 EQU   CVTXTNT2+56                                              02277000
CVTRV419 EQU   CVTXTNT2+55                                              02278000
CVTRV418 EQU   CVTXTNT2+54                                              02279000
CVTRV417 EQU   CVTRV409                                                 02280000
CVTRV416 EQU   CVTRV409                                                 02281000
CVTRV415 EQU   CVTRV409                                                 02282000
CVTRV414 EQU   CVTRV409                                                 02283000
CVTRV413 EQU   CVTRV409                                                 02284000
CVTRV412 EQU   CVTRV409                                                 02285000
CVTRV411 EQU   CVTRV409                                                 02286000
CVTRV410 EQU   CVTRV409                                                 02287000
CVTRV408 EQU   CVTRV400                                                 02288000
CVTRV407 EQU   CVTRV400                                                 02289000
CVTRV406 EQU   CVTRV400                                                 02290000
CVTRV405 EQU   CVTRV400                                                 02291000
CVTRV404 EQU   CVTRV400                                                 02292000
CVTRV403 EQU   CVTRV400                                                 02293000
CVTRV402 EQU   CVTRV400                                                 02294000
CVTRV401 EQU   CVTRV400                                                 02295000
CVTICB   EQU   CVTXTNT2+48                                              02296000
CVTSKTA  EQU   CVTXTNT2+44                                              02297000
CVTRSV99 EQU   CVTXTNT2+40                                              02298000
CVTRSV98 EQU   CVTXTNT2+36                                              02299000
CVTRSV97 EQU   CVTXTNT2+34                                              02300000
CVTRSV96 EQU   CVTXTNT2+32                                              02301000
CVTOLTEP EQU   CVTXTNT2+28                                              02302000
CVTQIDA  EQU   CVTQID+1                                                 02303000
CVTRSV95 EQU   CVTQID                                                   02304000
CVTRSV94 EQU   CVTXTNT2+20                                              02305000
CVTRSV93 EQU   CVTXTNT2+16                                              02306000
CVTRSV92 EQU   CVTXTNT2+12                                              02307000
CVTDEBVR EQU   CVTXTNT2+8                                               02308000
CVTRSV91 EQU   CVTXTNT2+6                                               02309000
CVTRSV9H EQU   CVTFLGBT                                                 02310000
CVTRSV9G EQU   CVTFLGBT                                                 02311000
CVTRSV9F EQU   CVTFLGBT                                                 02312000
CVTRSV9E EQU   CVTFLGBT                                                 02313000
CVTRSV9D EQU   CVTFLGBT                                                 02314000
CVTRSV9C EQU   CVTFLGBT                                                 02315000
CVTVME   EQU   CVTFLGBT                                                 02316000
CVTNPE   EQU   CVTFLGBT                                                 02317000
CVTNUCLS EQU   CVTXTNT2+4                                               02318000
CVTDSSVA EQU   CVTDSSV+1                                                02319000
CVTRSV89 EQU   CVTDSSV                                                  02320000
CVTRSV88 EQU   CVTXTNT1+8                                               02321000
CVTRSV87 EQU   CVTXTNT1+4                                               02322000
CVTFACHN EQU   CVTXTNT1                                                 02323000
CVTRV488 EQU   CVTMAP+412                                               02324000
CVTRV487 EQU   CVTMAP+408                                               02325000
CVTRV486 EQU   CVTMAP+404                                               02326000
CVTRV485 EQU   CVTMAP+400                                               02327000
CVTACTAP EQU   CVTMAP+396                                               02328000
CVTAUTH  EQU   CVTMAP+392                                               02329000
CVTATMCA EQU   CVTATMCT+1                                               02330000
CVTATMST EQU   CVTATMCT                                                 02331000
CVTRSV61 EQU   CVTMAP+384                                               02332000
CVTVOLT1 EQU   CVTVOLM1+1                                               02333000
CVTVOLI1 EQU   CVTVOLF1                                                 02334000
CVTSTOA  EQU   CVTMAP+376                                               02335000
CVTRSV58 EQU   CVTMAP+374                                               02336000
CVTRSV57 EQU   CVTMAP+372                                               02337000
CVTDDCE  EQU   CVTMAP+368                                               02338000
CVTPNWFR EQU   CVTMAP+364                                               02339000
CVTSMF   EQU   CVTMAP+360                                               02340000
CVTSULK  EQU   CVTMAP+358                                               02341000
CVTSLKO  EQU   CVTSYSK                                                  02342000
CVTSLKP  EQU   CVTSYSK                                                  02343000
CVTSLKQ  EQU   CVTSYSK                                                  02344000
CVTSLKR  EQU   CVTSYSK                                                  02345000
CVTRSV56 EQU   CVTSYSK                                                  02346000
CVTRSV55 EQU   CVTSYSK                                                  02347000
CVTRSV54 EQU   CVTSYSK                                                  02348000
CVTRSV53 EQU   CVTSYSK                                                  02349000
CVTRSV52 EQU   CVTA1F1                                                  02350000
CVTRSV51 EQU   CVTA1F1                                                  02351000
CVTRSV50 EQU   CVTA1F1                                                  02352000
CVTRSV49 EQU   CVTA1F1                                                  02353000
CVTRSV48 EQU   CVTA1F1                                                  02354000
CVTRSV47 EQU   CVTA1F1                                                  02355000
CVTSRSW  EQU   CVTA1F1                                                  02356000
CVTPFSW  EQU   CVTA1F1                                                  02357000
CVTPCVT  EQU   CVTMAP+352                                               02358000
CVTRSV46 EQU   CVTMAP+344                                               02359000
CVTRSV45 EQU   CVTMAP+340                                               02360000
CVTRSV44 EQU   CVTMAP+338                                               02361000
CVTRSV43 EQU   CVTMAP+336                                               02362000
CVTHJESA EQU   CVTHJES+1                                                02363000
CVTRSV42 EQU   CVTHJES                                                  02364000
CVTEXT2A EQU   CVTEXT2+1                                                02365000
CVTRSV41 EQU   CVTEXT2                                                  02366000
CVTAPFA  EQU   CVTAPF+1                                                 02367000
CVTRSV40 EQU   CVTAPF                                                   02368000
CVTRV518 EQU   CVTINTLA                                                 02369000
CVTRV517 EQU   CVTERPV                                                  02370000
CVTEORM  EQU   CVTMAP+312                                               02371000
CVTMCHPR EQU   CVTMAP+308                                               02372000
CVTTZ    EQU   CVTMAP+304                                               02373000
CVTJEPS  EQU   CVTMAP+300                                               02374000
CVTJESCT EQU   CVTMAP+296                                               02375000
CVTMODE  EQU   CVTMAP+292                                               02376000
CVTPTRV  EQU   CVTMAP+288                                               02377000
CVTREAL  EQU   CVTMAP+284                                               02378000
CVTRSV39 EQU   CVTMAP+280                                               02379000
CVTRSV38 EQU   CVTMAP+276                                               02380000
CVTDMSRA EQU   CVTDMSR+1                                                02381000
CVTRV634 EQU   CVTDMSRF                                                 02382000
CVTRV633 EQU   CVTDMSRF                                                 02383000
CVTRV632 EQU   CVTDMSRF                                                 02384000
CVTRV631 EQU   CVTDMSRF                                                 02385000
CVTRV630 EQU   CVTDMSRF                                                 02386000
CVTRV629 EQU   CVTDMSRF                                                 02387000
CVTUDUMP EQU   CVTDMSRF                                                 02388000
CVTSDUMP EQU   CVTDMSRF                                                 02389000
CVTQMSGA EQU   CVTQMSG+1                                                02390000
CVTRSV36 EQU   CVTQMSG                                                  02391000
CVTAMFF  EQU   CVTMAP+264                                               02392000
CVTPURGA EQU   CVTPURG+1                                                02393000
CVTRSV35 EQU   CVTPURG                                                  02394000
CVTCBSP  EQU   CVTMAP+256                                               02395000
CVTATERA EQU   CVTATER+1                                                02396000
CVTSYST  EQU   CVTATER                                                  02397000
CVTVOLT2 EQU   CVTTAT                                                   02398000
CVTVOLI2 EQU   CVTVOLF2                                                 02399000
CVTAQAVB EQU   CVTAQAVT+1                                               02400000
CVTRSV34 EQU   CVTTCMFG                                                 02401000
CVTRSV33 EQU   CVTTCMFG                                                 02402000
CVTRSV32 EQU   CVTTCMFG                                                 02403000
CVTRSV31 EQU   CVTTCMFG                                                 02404000
CVTRSV30 EQU   CVTTCMFG                                                 02405000
CVTRSV29 EQU   CVTTCMFG                                                 02406000
CVTRSV28 EQU   CVTTCMFG                                                 02407000
CVTTCRDY EQU   CVTTCMFG                                                 02408000
CVTGTFA  EQU   CVTGTF+1                                                 02409000
CVTRSV27 EQU   CVTGTFST                                                 02410000
CVTRNIO  EQU   CVTGTFST                                                 02411000
CVTUSR   EQU   CVTGTFST                                                 02412000
CVTRV318 EQU   CVTFORM                                                  02413000
CVTRV317 EQU   CVTTMODE                                                 02414000
CVTRV316 EQU   CVTSTATE                                                 02415000
CVTRV315 EQU   CVTGTFS                                                  02416000
CVTGTFAV EQU   CVTGTFS                                                  02417000
CVT0SCR1 EQU   CVTMAP+232                                               02418000
CVTRV515 EQU   CVTMAP+228                                               02419000
CVTRMS   EQU   CVTMAP+224                                               02420000
CVTPATCH EQU   CVTMAP+220                                               02421000
CVTTSCE  EQU   CVTMAP+216                                               02422000
CVTLNKSC EQU   CVTMAP+214                                               02423000
CVTQABST EQU   CVTMAP+212                                               02424000
CVTMDLDS EQU   CVTMAP+208                                               02425000
CVTUSER  EQU   CVTMAP+204                                               02426000
CVTABEND EQU   CVTMAP+200                                               02427000
CVTSMCA  EQU   CVTMAP+196                                               02428000
CVTRSV18 EQU   CVTMAP+192                                               02429000
CVTQLPAQ EQU   CVTMAP+188                                               02430000
CVTQCDSR EQU   CVTMAP+184                                               02431000
CVTRSV17 EQU   CVTOPTB                                                  02432000
CVTRSV16 EQU   CVTOPTB                                                  02433000
CVTFP    EQU   CVTOPTB                                                  02434000
CVTAPTHR EQU   CVTOPTB                                                  02435000
CVTNLOG  EQU   CVTOPTB                                                  02436000
CVTTOD   EQU   CVTOPTB                                                  02437000
CVTCTIMS EQU   CVTOPTB                                                  02438000
CVTPROT  EQU   CVTOPTB                                                  02439000
CVTXPFP  EQU   CVTOPTA                                                  02440000
CVTASCII EQU   CVTOPTA                                                  02441000
CVTRSV13 EQU   CVTOPTA                                                  02442000
CVTRSV12 EQU   CVTOPTA                                                  02443000
CVTNIP   EQU   CVTOPTA                                                  02444000
CVTDDR   EQU   CVTOPTA                                                  02445000
CVTAPR   EQU   CVTOPTA                                                  02446000
CVTCCH   EQU   CVTOPTA                                                  02447000
CVTSNCTR EQU   CVTMAP+180                                               02448000
CVTQMWR  EQU   CVTMAP+176                                               02449000
CVTQOCR  EQU   CVTMAP+172                                               02450000
CVT1EF00 EQU   CVTMAP+168                                               02451000
CVTMZ00  EQU   CVTMAP+164                                               02452000
CVTHEAD  EQU   CVTMAP+160                                               02453000
CVTRSV11 EQU   CVTMAP+156                                               02454000
CVT0PT01 EQU   CVTMAP+152                                               02455000
CVTMSER  EQU   CVTMAP+148                                               02456000
CVTRV516 EQU   CVTIERLC                                                 02457000
CVTILCH  EQU   CVTMAP+140                                               02458000
CVT0DS   EQU   CVTMAP+136                                               02459000
CVTFBOSV EQU   CVTMAP+132                                               02460000
CVTNUCB  EQU   CVTMAP+128                                               02461000
CVTIXAVL EQU   CVTMAP+124                                               02462000
CVTIOQET EQU   CVTMAP+120                                               02463000
CVTDCBA  EQU   CVTMAP+117                                               02464000
CVTMVS2  EQU   CVTDCB                                                   02465000
CVT6DAT  EQU   CVTDCB                                                   02466000
CVT4MPS  EQU   CVTDCB                                                   02467000
CVTRSV09 EQU   CVTDCB                                                   02468000
CVT4MS1  EQU   CVTDCB                                                   02469000
CVT2SPS  EQU   CVTDCB                                                   02470000
CVT1SSS  EQU   CVTDCB                                                   02471000
CVTRSV08 EQU   CVTDCB                                                   02472000
CVTSTB   EQU   CVTMAP+112                                               02473000
CVTQTD00 EQU   CVTMAP+108                                               02474000
CVTQTE00 EQU   CVTMAP+104                                               02475000
CVTCUCB  EQU   CVTMAP+100                                               02476000
CVTSJQ   EQU   CVTMAP+96                                                02477000
CVTPBLDL EQU   CVTMAP+92                                                02478000
CVTTPC   EQU   CVTMAP+88                                                02479000
CVTSVDCB EQU   CVTMAP+84                                                02480000
CVTBRET  EQU   CVTMAP+82                                                02481000
CVTEXIT  EQU   CVTMAP+80                                                02482000
CVT0FN00 EQU   CVTMAP+76                                                02483000
CVTDARA  EQU   CVTDAR+1                                                 02484000
CVTRSV07 EQU   CVTFLGS1                                                 02485000
CVTRSV06 EQU   CVTFLGS1                                                 02486000
CVTRSV05 EQU   CVTFLGS1                                                 02487000
CVTRSV04 EQU   CVTFLGS1                                                 02488000
CVTRSV03 EQU   CVTFLGS1                                                 02489000
CVTRSV02 EQU   CVTFLGS1                                                 02490000
CVTRSV01 EQU   CVTFLGS1                                                 02491000
CVTDMPLK EQU   CVTFLGS1                                                 02492000
CVTXITP  EQU   CVTMAP+68                                                02493000
CVTZDTAB EQU   CVTMAP+64                                                02494000
CVTMSLT  EQU   CVTMAP+60                                                02495000
CVTDATE  EQU   CVTMAP+56                                                02496000
CVTBTERM EQU   CVTMAP+52                                                02497000
CVTSYSAD EQU   CVTMAP+48                                                02498000
CVTXTLER EQU   CVTMAP+44                                                02499000
CVTILK2  EQU   CVTMAP+40                                                02500000
CVTILK1  EQU   CVTMAP+36                                                02501000
CVTPRLTV EQU   CVTMAP+32                                                02502000
CVTPCNVT EQU   CVTMAP+28                                                02503000
CVT0VL00 EQU   CVTMAP+24                                                02504000
CVTXAPG  EQU   CVTMAP+20                                                02505000
CVTBUF   EQU   CVTMAP+16                                                02506000
CVTJOB   EQU   CVTMAP+12                                                02507000
CVTLINK  EQU   CVTMAP+8                                                 02508000
CVT0EF00 EQU   CVTMAP+4                                                 02509000
CVTTCBP  EQU   CVTMAP                                                   02510000
CVT      EQU   CVTMAP                                                   02511000
ATARCODE EQU   ATA+7                                                    02512000
ATARCRF8 EQU   ATARCRSN                                                 02513000
ATARCRF7 EQU   ATARCRSN                                                 02514000
ATARCRF6 EQU   ATARCRSN                                                 02515000
ATARCRF5 EQU   ATARCRSN                                                 02516000
ATARCRF4 EQU   ATARCRSN                                                 02517000
ATARCRF3 EQU   ATARCRSN                                                 02518000
ATARCRF2 EQU   ATARCRSN                                                 02519000
ATARCRF1 EQU   ATARCRSN                                                 02520000
ATARSV2  EQU   ATARFLGS                                                 02521000
ATASCCWP EQU   ATARFLGS                                                 02522000
ATASGNST EQU   ATARFLGS                                                 02523000
ATARSV1  EQU   ATASFLGS+1                                               02524000
ATASRT   EQU   ATASFLGS+1                                               02525000
ATASWPDR EQU   ATASFLGS+1                                               02526000
ATATRPAG EQU   ATASFLGS+1                                               02527000
ATASWAP  EQU   ATASFLGS+1                                               02528000
ATAPAGCM EQU   ATASFLGS                                                 02529000
ATAPAGIO EQU   ATASFLGS                                                 02530000
ATAPOS   EQU   ATASFLGS                                                 02531000
ATAPCOMP EQU   ATASFLGS                                                 02532000
ATAVIOCM EQU   ATASFLGS                                                 02533000
ATASCOMP EQU   ATASFLGS                                                 02534000
ATASLSQA EQU   ATASFLGS                                                 02535000
ATAQIOE  EQU   ATASFLGS                                                 02536000
ASMCPRES EQU   ASMCPRSQ+4                                               02537000
ASMCPTAK EQU   ASMCPRSQ                                                 02538000
ASMCPCNT EQU   ASMCPAVQ+4                                               02539000
ASMCPAVL EQU   ASMCPAVQ                                                 02540000
ASMCPEXT EQU   ASMPOOLS+6                                               02541000
ASMCPSIZ EQU   ASMPOOLS+4                                               02542000
ASMCPID  EQU   ASMPOOLS                                                 02543000
ASMRSV12 EQU   ASMVT+1000                                               02544000
ASMSAVE  EQU   ASMVT+928                                                02545000
ASMWKSA7 EQU   ASMVT+848                                                02546000
ASMWKSA6 EQU   ASMVT+768                                                02547000
ASMACEPC EQU   ASMVT+344                                                02548000
ASMSWKPC EQU   ASMVT+328                                                02549000
ASMBWKPC EQU   ASMVT+312                                                02550000
ASMIOEPC EQU   ASMVT+296                                                02551000
ASMRSV10 EQU   ASMVT+280                                                02552000
ASMPVACE EQU   ASMVT+276                                                02553000
ASMPIOFR EQU   ASMVT+272                                                02554000
ASMPVACQ EQU   ASMVT+268                                                02555000
ASMPMSGS EQU   ASMVT+264                                                02556000
ASMPMSG0 EQU   ASMVT+260                                                02557000
ASMPFRLG EQU   ASMVT+256                                                02558000
ASMPRLG  EQU   ASMVT+252                                                02559000
ASMPACT  EQU   ASMVT+248                                                02560000
ASMPSAV  EQU   ASMVT+244                                                02561000
ASMPCMPA EQU   ASMVT+236                                                02562000
ASMPCMPN EQU   ASMVT+232                                                02563000
ASMPCMPD EQU   ASMVT+228                                                02564000
ASMPEX   EQU   ASMVT+224                                                02565000
ASMVRMTR EQU   ASMVT+220                                                02566000
ASMPSRBC EQU   ASMVT+216                                                02567000
ASMPSRMT EQU   ASMVT+212                                                02568000
ASMPSWPD EQU   ASMVT+208                                                02569000
ASMPTM   EQU   ASMVT+204                                                02570000
ASMPFRSW EQU   ASMVT+200                                                02571000
ASMPFRSL EQU   ASMVT+196                                                02572000
ASMPQIOE EQU   ASMVT+192                                                02573000
ASMRSV8  EQU   ASMVT+184                                                02574000
ASMTASCB EQU   ASMVT+180                                                02575000
ASMRLGWQ EQU   ASMVT+176                                                02576000
ASMRLGRQ EQU   ASMVT+172                                                02577000
ASMTMECB EQU   ASMVT+168                                                02578000
ASMTCBPT EQU   ASMVT+164                                                02579000
ASMREQCT EQU   ASMVT+160                                                02580000
ASMGOSWK EQU   ASMGOSQS+4                                               02581000
ASMGOSWT EQU   ASMGOSQS                                                 02582000
ASMLSAIH EQU   ASMLSAI+4                                                02583000
ASMLSAIL EQU   ASMLSAI                                                  02584000
ASMCINV  EQU   ASMVT+140                                                02585000
ASMSTGXA EQU   ASMVT+136                                                02586000
ASMLGVT  EQU   ASMVT+132                                                02587000
ASMSLOTV EQU   ASMVT+128                                                02588000
ASMERRS  EQU   ASMVT+124                                                02589000
ASMNVSC  EQU   ASMVT+120                                                02590000
ASMVSC   EQU   ASMVT+116                                                02591000
ASMSLOTS EQU   ASMVT+112                                                02592000
ASMBKSLT EQU   ASMVT+108                                                02593000
ASMRSV7  EQU   ASMVT+92                                                 02594000
ASMIOCNT EQU   ASMVT+80                                                 02595000
ASMBURST EQU   ASMVT+76                                                 02596000
ASMPCCWN EQU   ASMVT+72                                                 02597000
ASMPCCWC EQU   ASMPCCWQ+4                                               02598000
ASMRSV6  EQU   ASMVT+48                                                 02599000
ASMIORQC EQU   ASMVT+44                                                 02600000
ASMIORQR EQU   ASMVT+40                                                 02601000
ASMSTAGL EQU   ASMSTAGQ+4                                               02602000
ASMSTAGF EQU   ASMSTAGQ                                                 02603000
ASMRSV5  EQU   ASMVT+28                                                 02604000
ASMMSGBF EQU   ASMVT+24                                                 02605000
ASMEREC  EQU   ASMVT+20                                                 02606000
ASMTRPAG EQU   ASMVT+16                                                 02607000
ASMGOS   EQU   ASMVT+12                                                 02608000
ASMRSV4  EQU   ASMVT+2                                                  02609000
ASMWARM  EQU   ASMFLAG2                                                 02610000
ASMQUICK EQU   ASMFLAG2                                                 02611000
ASMNOTPT EQU   ASMFLAG2                                                 02612000
ASMNOTMR EQU   ASMFLAG2                                                 02613000
ASMNOSAV EQU   ASMFLAG2                                                 02614000
ASMCALLQ EQU   ASMFLAG2                                                 02615000
ASMPLPAS EQU   ASMFLAG1                                                 02616000
ASMCOMMF EQU   ASMFLAG1                                                 02617000
ASMPLPAF EQU   ASMFLAG1                                                 02618000
ASMNODPX EQU   ASMFLAG1                                                 02619000
ASMRSV1  EQU   ASMFLAG1                                                 02620000
ASMNOLCL EQU   ASMFLAG1                                                 02621000
ASMNOCWQ EQU   ASMFLAG1                                                 02622000
ASMDUPLX EQU   ASMFLAG1                                                 02623000
AIADPXCT EQU   AIALGE                                                   02624000
AIACEPTR EQU   AIALPMEP                                                 02625000
AIASLOT  EQU   AIASSID+1                                                02626000
@NM00002 EQU   AIASSID                                                  02627000
@NM00001 EQU   AIALSID                                                  02628000
AIARCSN  EQU   AIANXAIA+2                                               02629000
AIACYL   EQU   AIANXAIA                                                 02630000
AIARSV9  EQU   AIAFLG3                                                  02631000
AIARSV8  EQU   AIAFLG3                                                  02632000
AIARSV7  EQU   AIAFLG3                                                  02633000
AIALPMEC EQU   AIAFLG3                                                  02634000
AIARSV6  EQU   AIAFLG3                                                  02635000
AIATRPSP EQU   AIAFLG3                                                  02636000
AIAPRINO EQU   AIAFLG3                                                  02637000
AIARSV5  EQU   AIAFLG3                                                  02638000
AIABADID EQU   AIAFLG2                                                  02639000
AIAERROR EQU   AIAFLG2                                                  02640000
AIASECER EQU   AIAFLG2                                                  02641000
AIAPRIER EQU   AIAFLG2                                                  02642000
AIARSV4  EQU   AIAFLG2                                                  02643000
AIATERMR EQU   AIAFLG2                                                  02644000
AIAFRAUX EQU   AIAFLG2                                                  02645000
AIARSV1  EQU   AIAFLG1                                                  02646000
AIASWPFX EQU   AIAFLG1                                                  02647000
AIAPAGDS EQU   AIAFLG1                                                  02648000
AIALSQA  EQU   AIAFLG1                                                  02649000
AIADUPLX EQU   AIAFLG1                                                  02650000
AIAVIO   EQU   AIAFLG1                                                  02651000
AIAPRIV  EQU   AIAFLG1                                                  02652000
AIAWRITE EQU   AIAFLG1                                                  02653000
AIAOP    EQU   AIA+8                                                    02654000
AIABQPA  EQU   AIA+4                                                    02655000
AIAFQPA  EQU   AIA                                                      02656000
@NM00049 EQU   PSA+3668                                                 02657000
PSASTAK  EQU   PSA+3072                                                 02658000
@NM00048 EQU   PSA+1048                                                 02659000
PSAUSEND EQU   PSA+1048                                                 02660000
PSARV062 EQU   PSA+1044                                                 02661000
PSACDAL  EQU   PSA+1040                                                 02662000
PSAWTCOD EQU   PSA+1036                                                 02663000
PSAATCVT EQU   PSA+1032                                                 02664000
PSAPCPSW EQU   PSA+1024                                                 02665000
PSAPIR2  EQU   PSA+1020                                                 02666000
PSARV059 EQU   PSA+1018                                                 02667000
PSASVC13 EQU   PSA+1016                                                 02668000
PSALSFCC EQU   PSA+1012                                                 02669000
PSASFACC EQU   PSA+1008                                                 02670000
PSASTOP  EQU   PSA+992                                                  02671000
PSASTART EQU   PSA+976                                                  02672000
PSARSPSW EQU   PSA+968                                                  02673000
PSASRPSW EQU   PSA+960                                                  02674000
PSARV045 EQU   PSA+892                                                  02675000
PSARV044 EQU   PSA+888                                                  02676000
PSARV043 EQU   PSA+884                                                  02677000
PSARV042 EQU   PSA+880                                                  02678000
PSARV041 EQU   PSA+876                                                  02679000
PSARV040 EQU   PSA+872                                                  02680000
PSARV025 EQU   PSA+868                                                  02681000
PSADSSED EQU   PSA+868                                                  02682000
PSADSSPR EQU   PSA+864                                                  02683000
PSADSSFW EQU   PSA+860                                                  02684000
PSADSS14 EQU   PSA+856                                                  02685000
PSADSSPP EQU   PSA+848                                                  02686000
PSADSSRP EQU   PSA+840                                                  02687000
PSADSS05 EQU   PSADSSF4                                                 02688000
PSADSS10 EQU   PSADSSF4                                                 02689000
PSADSSVE EQU   PSADSSF4                                                 02690000
PSADSSDE EQU   PSADSSF4                                                 02691000
PSADSSC0 EQU   PSADSSF4                                                 02692000
PSADSSIE EQU   PSADSSF4                                                 02693000
PSADSS12 EQU   PSADSSF4                                                 02694000
PSADSSRC EQU   PSADSSF4                                                 02695000
PSARV057 EQU   PSADSSF3                                                 02696000
PSARV056 EQU   PSADSSF3                                                 02697000
PSARV055 EQU   PSADSSF3                                                 02698000
PSADSSMC EQU   PSADSSF3                                                 02699000
PSADSSRW EQU   PSADSSF3                                                 02700000
PSADSSNM EQU   PSADSSF3                                                 02701000
PSADSSES EQU   PSADSSF3                                                 02702000
PSADSSGP EQU   PSADSSF3                                                 02703000
PSADSSF2 EQU   PSADSSFL+1                                               02704000
PSADSSPI EQU   PSADSSF1                                                 02705000
PSADSSOI EQU   PSADSSF1                                                 02706000
PSADSSSP EQU   PSADSSF1                                                 02707000
PSADSSTP EQU   PSADSSF1                                                 02708000
PSADSSDW EQU   PSADSSF1                                                 02709000
PSADSSDD EQU   PSADSSF1                                                 02710000
PSADSSDM EQU   PSADSSF1                                                 02711000
PSADSSMV EQU   PSADSSF1                                                 02712000
PSADSSTS EQU   PSA+816                                                  02713000
PSADSSWK EQU   PSA+812                                                  02714000
PSADSSR3 EQU   PSA+808                                                  02715000
PSADSSR2 EQU   PSA+804                                                  02716000
PSADSSRS EQU   PSA+800                                                  02717000
PSASTOR  EQU   PSA+796                                                  02718000
PSACPUSA EQU   PSA+794                                                  02719000
PSAVSTAP EQU   PSA+792                                                  02720000
PSAWKVAP EQU   PSA+788                                                  02721000
PSAWKRAP EQU   PSA+784                                                  02722000
PSAMCHIC EQU   PSA+783                                                  02723000
PSARV061 EQU   PSA+782                                                  02724000
PSASYMSK EQU   PSA+781                                                  02725000
PSAMCHFL EQU   PSA+780                                                  02726000
PSACR0   EQU   PSA+776                                                  02727000
PSAPSWSV EQU   PSA+768                                                  02728000
PSACLHS  EQU   PSAHLHI                                                  02729000
PSALKR15 EQU   PSALKSA+60                                               02730000
PSALKR14 EQU   PSALKSA+56                                               02731000
PSALKR13 EQU   PSALKSA+52                                               02732000
PSALKR12 EQU   PSALKSA+48                                               02733000
PSALKR11 EQU   PSALKSA+44                                               02734000
PSALKR10 EQU   PSALKSA+40                                               02735000
PSALKR9  EQU   PSALKSA+36                                               02736000
PSALKR8  EQU   PSALKSA+32                                               02737000
PSALKR7  EQU   PSALKSA+28                                               02738000
PSALKR6  EQU   PSALKSA+24                                               02739000
PSALKR5  EQU   PSALKSA+20                                               02740000
PSALKR4  EQU   PSALKSA+16                                               02741000
PSALKR3  EQU   PSALKSA+12                                               02742000
PSALKR2  EQU   PSALKSA+8                                                02743000
PSALKR1  EQU   PSALKSA+4                                                02744000
PSALKR0  EQU   PSALKSA                                                  02745000
PSARV023 EQU   PSACLHT+52                                               02746000
PSALOCAL EQU   PSACLHT+48                                               02747000
PSACMSL  EQU   PSACLHT+44                                               02748000
PSAOPTL  EQU   PSACLHT+40                                               02749000
PSATPACL EQU   PSACLHT+36                                               02750000
PSATPDNL EQU   PSACLHT+32                                               02751000
PSATPNCL EQU   PSACLHT+28                                               02752000
PSAIOSLL EQU   PSACLHT+24                                               02753000
PSAIOSUL EQU   PSACLHT+20                                               02754000
PSAIOSCL EQU   PSACLHT+16                                               02755000
PSAIOSSL EQU   PSACLHT+12                                               02756000
PSASALCL EQU   PSACLHT+8                                                02757000
PSAASML  EQU   PSACLHT+4                                                02758000
PSADISPL EQU   PSACLHT                                                  02759000
PSASRSA  EQU   PSA+636                                                  02760000
PSARV050 EQU   PSA+634                                                  02761000
PSADSSGO EQU   PSA+633                                                  02762000
PSARECUR EQU   PSA+632                                                  02763000
PSAHLHIS EQU   PSA+628                                                  02764000
PSAIPCSA EQU   PSA+624                                                  02765000
@NM00047 EQU   PSA+621                                                  02766000
PSAIPCDM EQU   PSA+620                                                  02767000
PSAIPCD  EQU   PSA+616                                                  02768000
@NM00046 EQU   PSA+613                                                  02769000
PSAIPCRM EQU   PSA+612                                                  02770000
PSAIPCR  EQU   PSA+608                                                  02771000
PSAMCHEX EQU   PSA+600                                                  02772000
PSAMPSW  EQU   PSA+592                                                  02773000
PSAEXPS2 EQU   PSA+584                                                  02774000
PSAEXPS1 EQU   PSA+576                                                  02775000
PSAPIREG EQU   PSA+572                                                  02776000
PSARSREG EQU   PSA+568                                                  02777000
PSAGPREG EQU   PSA+556                                                  02778000
PSARV022 EQU   PSASUP4                                                  02779000
PSARV021 EQU   PSASUP4                                                  02780000
PSARV020 EQU   PSASUP4                                                  02781000
PSARV019 EQU   PSASUP4                                                  02782000
PSARV018 EQU   PSASUP4                                                  02783000
PSARV017 EQU   PSASUP4                                                  02784000
PSARV016 EQU   PSASUP4                                                  02785000
PSARV015 EQU   PSASUP4                                                  02786000
PSARV014 EQU   PSASUP3                                                  02787000
PSARV013 EQU   PSASUP3                                                  02788000
PSARV012 EQU   PSASUP3                                                  02789000
PSAESTA  EQU   PSASUP3                                                  02790000
PSASPR   EQU   PSASUP3                                                  02791000
PSAPSREG EQU   PSASUP3                                                  02792000
PSAPI2   EQU   PSASUP3                                                  02793000
PSAIOSUP EQU   PSASUP3                                                  02794000
PSALCR   EQU   PSASUP2                                                  02795000
PSARTM   EQU   PSASUP2                                                  02796000
PSAACR   EQU   PSASUP2                                                  02797000
PSAIPCE2 EQU   PSASUP2                                                  02798000
PSAIPCES EQU   PSASUP2                                                  02799000
PSAIPCEC EQU   PSASUP2                                                  02800000
PSAGTF   EQU   PSASUP2                                                  02801000
PSAIPCRI EQU   PSASUP2                                                  02802000
PSATYPE6 EQU   PSASUP1                                                  02803000
PSATCTL  EQU   PSASUP1                                                  02804000
PSADISP  EQU   PSASUP1                                                  02805000
PSALOCK  EQU   PSASUP1                                                  02806000
PSAPI    EQU   PSASUP1                                                  02807000
PSAEXT   EQU   PSASUP1                                                  02808000
PSASVC   EQU   PSASUP1                                                  02809000
PSAIO    EQU   PSASUP1                                                  02810000
PSAAOLD  EQU   PSA+548                                                  02811000
PSAANEW  EQU   PSA+544                                                  02812000
PSATOLD  EQU   PSA+540                                                  02813000
PSATNEW  EQU   PSA+536                                                  02814000
PSALCCAR EQU   PSA+532                                                  02815000
PSALCCAV EQU   PSA+528                                                  02816000
PSAPCCAR EQU   PSA+524                                                  02817000
PSAPCCAV EQU   PSA+520                                                  02818000
PSACPULA EQU   PSA+518                                                  02819000
PSACPUPA EQU   PSA+516                                                  02820000
PSAPSA   EQU   PSA+512                                                  02821000
FLCHDEND EQU   PSA+512                                                  02822000
FLCCRSAV EQU   FLCMCLA+280                                              02823000
FLCGRSAV EQU   FLCMCLA+216                                              02824000
FLCFPSAV EQU   FLCMCLA+184                                              02825000
FLCFLA   EQU   FLCMCLA+88                                               02826000
FLCRGNCD EQU   FLCMCLA+84                                               02827000
FLCFSAA  EQU   FLCFSA+1                                                 02828000
@NM00045 EQU   FLCFSA                                                   02829000
@NM00044 EQU   FLCMCLA+72                                               02830000
FLCMCIC  EQU   FLCMCLA+64                                               02831000
@NM00043 EQU   FLCMCLA+20                                               02832000
FLCIOAA  EQU   FLCIOA+1                                                 02833000
@NM00042 EQU   FLCIOA                                                   02834000
@NM00041 EQU   FLCMCLA+15                                               02835000
@NM00040 EQU   FLCMCLA+14                                               02836000
@NM00039 EQU   FLCMCLA+12                                               02837000
FLCLCL   EQU   FLCMCLA+8                                                02838000
FLCIOELA EQU   FLCIOEL+1                                                02839000
@NM00038 EQU   FLCIOEL                                                  02840000
FLCCHNID EQU   FLCMCLA                                                  02841000
@NM00037 EQU   PSA+160                                                  02842000
FLCMTRCD EQU   PSA+157                                                  02843000
@NM00036 EQU   PSA+156                                                  02844000
FLCPERA  EQU   FLCPER+1                                                 02845000
@NM00035 EQU   FLCPER                                                   02846000
@NM00034 EQU   PSA+151                                                  02847000
FLCPERCD EQU   PSA+150                                                  02848000
FLCMCNUM EQU   PSA+149                                                  02849000
@NM00033 EQU   PSA+148                                                  02850000
FLCTEAA  EQU   FLCTEA+1                                                 02851000
@NM00032 EQU   FLCTEA                                                   02852000
PSAPIPC  EQU   PSAPICOD                                                 02853000
PSAPIMC  EQU   PSAPICOD                                                 02854000
PSAPIPER EQU   PSAPICOD                                                 02855000
PSARV049 EQU   FLCPICOD                                                 02856000
FLCPILCB EQU   FLCPIILC                                                 02857000
@NM00031 EQU   FLCPIILC                                                 02858000
@NM00030 EQU   PSAEPPSW                                                 02859000
FLCSVCN  EQU   PSAESPSW+2                                               02860000
FLCSILCB EQU   FLCSVILC                                                 02861000
@NM00029 EQU   FLCSVILC                                                 02862000
@NM00028 EQU   PSAESPSW                                                 02863000
FLCEICOD EQU   PSAEEPSW+2                                               02864000
PSASPAD  EQU   PSAEEPSW                                                 02865000
@NM00027 EQU   PSA+128                                                  02866000
FLCINPSW EQU   PSA+120                                                  02867000
FLCMNPSW EQU   PSA+112                                                  02868000
FLCPNPSW EQU   PSA+104                                                  02869000
FLCSNPSW EQU   PSA+96                                                   02870000
FLCENPSW EQU   PSA+88                                                   02871000
FLCTRACE EQU   PSA+84                                                   02872000
FLCTIMER EQU   PSA+80                                                   02873000
FLCCVT2  EQU   PSA+76                                                   02874000
FLCCAW   EQU   PSA+72                                                   02875000
FLCCSW   EQU   PSA+64                                                   02876000
FLCIOPSW EQU   PSA+56                                                   02877000
FLCMOPSW EQU   PSA+48                                                   02878000
FLCPOPSW EQU   PSA+40                                                   02879000
FLCSOPSW EQU   PSA+32                                                   02880000
FLCEOPSW EQU   PSA+24                                                   02881000
@NM00026 EQU   FLCICCW2+4                                               02882000
FLCICCW1 EQU   FLCROPSW                                                 02883000
FLCIPPSW EQU   FLCRNPSW                                                 02884000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02885000
@RT00129 EQU   EXIT                                                     02886000
@ENDDATA EQU   *                                                        02887000
         END   ILRCMP01,(C'PLS0910',0701,76091)                         02888000
