         TITLE 'IEAFTIHS-IHSA-FRRS CONTROL BLOCK FORMAT MODULE         *00001000
                        '                                               00002000
IEAFTIHS CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL2(@EP00001-@MAINENT)                                   00007000
         DC    AL1(16)                                             0001 00008000
         DC    C'IEAFTIHS  78.033'                                 0001 00009000
IEAFTFRR DS    0H                                                  0001 00010000
         USING *,@15                                               0001 00011000
         B     @PROLOG                                             0001 00012000
         DC    AL2(@EP00203-IEAFTFRR)                                   00013000
         ENTRY IEAFTFRR                                                 00014000
         DROP  @15                                                      00015000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00016000
         BALR  @11,0                                               0001 00017000
@PSTART  LA    @12,4095(,@11)                                      0001 00018000
         USING @PSTART,@11                                         0001 00019000
         USING @PSTART+4095,@12                                    0001 00020000
         L     @00,@SIZDATD                                        0001 00021000
         GETMAIN  R,LV=(0)                                              00022000
         LR    @10,@01                                             0001 00023000
         USING @DATD,@10                                           0001 00024000
         ST    @13,@SA00001+4                                      0001 00025000
         LM    @15,@01,16(@13)                                     0001 00026000
         ST    @10,8(,@13)                                         0001 00027000
         LR    @13,@10                                             0001 00028000
         AH    @15,4(,@15)                                         0001 00029000
         BR    @15                                                 0001 00030000
@EP00001 DS    0H                                                  0002 00031000
*                                                                  0120 00032000
*/********************************************************************/ 00033000
*/* FUNCTION -                                                     0120 00034000
*      ROUTINE WHICH FORMATS THE INTERRUPT HANDLER SAVE AREA.      0120 00035000
*      IT SETS UP THE NEEDED POINTERS TO BE PASSED TO THE FORMAT   0120 00036000
*      ROUTINE SENT IN THE PARAMETER LIST.  FOR ANY ERROR ACCESSING     00037000
*      A NEEDED FIELD IN THE IHSA OR RT1W OR FOR NON-ZERO RETURN CODE   00038000
*      FROM THE FORMATTING SERVICE, THE FOLLOWING MESSAGE WILL BE  0120 00039000
*      PRINTED:                                                    0120 00040000
*               *** FORMATTING SERVICE ROUTINE ERROR DURING        0120 00041000
*               IHSA FORMATTING(POSSIBLE CAUSE:  DATA NOT IN       0120 00042000
*               DUMP) ***                                          0120 00043000
*      AT THIS POINT PROCESSING WOULD TERMINATE. IF THE IHSA IS    0120 00044000
*      FORMATTED WITHOUT ERROR, A BIT SUMMARY OF THE RT1W IS PRINTED    00045000
*      USING THE ANALYZE INTERNAL PROCEDURE.                       0120 00046000
*                                                                  0120 00047000
*   INPUT -                                                        0120 00048000
*      REGISTER 1 POINTS TO THE PARMLIST WHICH CONTAINS THE        0120 00049000
*      ADDRESS OF THE CONTROL BLOCK TO BE FORMATTED IN ADPLFMT2.   0120 00050000
*      ADPLFMT1, ALSO DEFINED AS START, CONTAINS THE OFFSET TO BE  0120 00051000
*      PLACED ALONG THE FIRST FIELD IN THE CONTROL BLOCK AND ADPLCOM1   00052000
*      CONTAINS THE ADDRESS OF THE ESTAE PARAMETER LIST.           0120 00053000
*                                                                  0120 00054000
*   CALLS -                                                        0120 00055000
*      CALLS CONVERT, FMTRTN, PRINT, AND RT1RTN                    0120 00056000
*                                                                  0120 00057000
*   CALLED BY -                                                    0120 00058000
*       IEAVTFMT TO FORMAT IHSA                                    0120 00059000
*                                                                  0120 00060000
*   RETURNS TO -                                                   0120 00061000
*       IEAVTFMT WITH RETURN CODE SET BY THE ACCESS OR FORMAT SERVICE   00062000
*       ROUTINES OR BY RT1RTN.                                       */ 00063000
*/********************************************************************/ 00064000
*                                                                  0120 00065000
*   ESTAPTR=ADPLCOM1;               /* PTR TO ESTAE PARM LIST        */ 00066000
         L     ESTAPTR,ADPLCOM1(,ABDPLPTR)                         0120 00067000
*   STM(VADR,RCREG,LCALREGS);       /* SAVE REGS FOR RETRY           */ 00068000
         STM   VADR,RCREG,LCALREGS(ESTAPTR)                        0121 00069000
*   ADPLCOM1=ADDR(IHSAFMT);         /* FORMAT ROUTINE ERROR MSG      */ 00070000
         LA    @14,IHSAFMT                                         0122 00071000
         ST    @14,ADPLCOM1(,ABDPLPTR)                             0122 00072000
*   IHSAPTR=ADPLFMT2;               /* PTR TO IHSA                   */ 00073000
         L     IHSAPTR,ADPLFMT2(,ABDPLPTR)                         0123 00074000
*   BITS=BITS&&BITS;                /* ZERO ALL INTERNAL BITS        */ 00075000
*                                                                  0124 00076000
         XC    BITS(1),BITS                                        0124 00077000
*   /*****************************************************************/ 00078000
*   /*                                                               */ 00079000
*   /* IN RELEASE 2 THE POINTER TO THE SUBITS WAS NOT DEFINED.       */ 00080000
*   /* THEREFORE BEFORE ACCESSING THE SUBIT POINTER, CHECK FOR       */ 00081000
*   /* RELEASE 2                                                     */ 00082000
*   /*                                                               */ 00083000
*   /*****************************************************************/ 00084000
*                                                                  0125 00085000
*   VADR=ADDR(CVTNUMB);             /* RELEASE NUMBER                */ 00086000
         L     @14,CVTPTR(,ABDPLPTR)                               0125 00087000
         AL    @14,@CF02109                                        0125 00088000
         LR    VADR,@14                                            0125 00089000
*   CALL ACCESRTN;                  /* ACCESS IT                     */ 00090000
         BAL   @14,ACCESRTN                                        0126 00091000
*   IF RCREG^=ZERO THEN             /* ACCESS ERROR                  */ 00092000
         LTR   RCREG,RCREG                                         0127 00093000
         BZ    @RF00127                                            0127 00094000
*     BUFFER(1:LENGTH(IHSAFMT))=IHSAFMT;/* ERROR MESSAGE             */ 00095000
         L     @14,ADPLBUF(,ABDPLPTR)                              0128 00096000
         MVC   BUFFER(120,@14),IHSAFMT                             0128 00097000
*   ELSE                            /* FOUND RELEASE NUMBER          */ 00098000
*     DO;                                                          0129 00099000
         B     @RC00127                                            0129 00100000
@RF00127 DS    0H                                                  0130 00101000
*       IF DATAHALF^=REL2 THEN      /* NOT A RELEASE 2 MVS SYSTEM    */ 00102000
         CLC   DATAHALF(2,DATAPTR),REL2                            0130 00103000
         BE    @RF00130                                            0130 00104000
*         DO;                                                      0131 00105000
*                                                                  0131 00106000
*           /*********************************************************/ 00107000
*           /*                                                       */ 00108000
*           /* FIND WHICH SUS ARE ON SYSTEM                          */ 00109000
*           /*                                                       */ 00110000
*           /*********************************************************/ 00111000
*                                                                  0132 00112000
*           VADR=ADDR(CVTIHASU);    /* SUBIT PTR                     */ 00113000
         L     @14,CVTPTR(,ABDPLPTR)                               0132 00114000
         LA    VADR,CVTIHASU(,@14)                                 0132 00115000
*           CALL ACCESRTN;          /* ACCESS IT                     */ 00116000
         BAL   @14,ACCESRTN                                        0133 00117000
*           IF RCREG^=ZERO THEN     /* ACCESS ERROR                  */ 00118000
         LTR   RCREG,RCREG                                         0134 00119000
         BZ    @RF00134                                            0134 00120000
*             DO;                                                  0135 00121000
*               BUFFER(1:LENGTH(IHSAFMT))=IHSAFMT;                 0136 00122000
         L     @14,ADPLBUF(,ABDPLPTR)                              0136 00123000
         MVC   BUFFER(120,@14),IHSAFMT                             0136 00124000
*               ERRSW=ON;           /* INDICATE ACCESS ERROR         */ 00125000
         OI    ERRSW,B'01000000'                                   0137 00126000
*             END;                  /* END ACCESS ERROR              */ 00127000
*           ELSE                    /* FOUND SUBIT PTR               */ 00128000
*             DO;                                                  0139 00129000
         B     @RC00134                                            0139 00130000
@RF00134 DS    0H                                                  0140 00131000
*               IF DATAWORD^=ZERO THEN/* THIS IS AN SU SYSTEM        */ 00132000
         L     @14,DATAWORD(,DATAPTR)                              0140 00133000
         LTR   @14,@14                                             0140 00134000
         BZ    @RF00140                                            0140 00135000
*                 DO;                                              0141 00136000
*                   VADR=DATAWORD;  /* ADDRESS OF SUBIT STRING       */ 00137000
         LR    VADR,@14                                            0142 00138000
*                   CALL ACCESRTN;  /* ACCESS IT                     */ 00139000
         BAL   @14,ACCESRTN                                        0143 00140000
*                   IF RCREG^=ZERO THEN/* ACCESS ERROR               */ 00141000
         LTR   RCREG,RCREG                                         0144 00142000
         BZ    @RF00144                                            0144 00143000
*                     DO;                                          0145 00144000
*                       BUFFER(1:LENGTH(IHSAFMT))=IHSAFMT;         0146 00145000
         L     @14,ADPLBUF(,ABDPLPTR)                              0146 00146000
         MVC   BUFFER(120,@14),IHSAFMT                             0146 00147000
*                       ERRSW=ON;   /* INDICATE ERROR HAS OCCURED    */ 00148000
         OI    ERRSW,B'01000000'                                   0147 00149000
*                     END;          /* END ACCESS ERROR              */ 00150000
*                   ELSE            /* FOUND SUBITS                  */ 00151000
*                     DO;                                          0149 00152000
         B     @RC00144                                            0149 00153000
@RF00144 DS    0H                                                  0150 00154000
*                       IF SU50BIT=ON THEN                         0150 00155000
         TM    SU50BIT(DATAPTR),B'00100000'                        0150 00156000
         BNO   @RF00150                                            0150 00157000
*                         SU50SAVE=ON;/* INDICATE SU50 ON SYSTEM     */ 00158000
         OI    SU50SAVE,B'10000000'                                0151 00159000
*                       ELSE                                       0152 00160000
*                         ;         /* SU50 NOT ON SYSTEM            */ 00161000
@RF00150 DS    0H                                                  0153 00162000
*                     END;          /* END FOUND SUBITS              */ 00163000
*                 END;              /* END THIS IS AN SU SYSTEM      */ 00164000
*               ELSE                                               0155 00165000
*                 ;                 /* PRE SU SYSTEM -NO BIT NEEDED  */ 00166000
@RF00140 DS    0H                                                  0156 00167000
*             END;                  /* END COULD ACCESS SUBIT POINTER*/ 00168000
*         END;                      /* END NOT A RELEASE 2 MVS SYSTEM*/ 00169000
*       ELSE                                                       0158 00170000
*         ;                         /* IS A RELEASE 2 MVS SYSTEM, NO    00171000
*                                      SU                            */ 00172000
@RF00130 DS    0H                                                  0159 00173000
*       IF ERRSW=OFF THEN           /* FOUND SYSTEM OK               */ 00174000
@RC00130 TM    ERRSW,B'01000000'                                   0159 00175000
         BNZ   @RF00159                                            0159 00176000
*         DO;                                                      0160 00177000
*                                                                  0160 00178000
*           /*********************************************************/ 00179000
*           /*                                                       */ 00180000
*           /* PUT OUT IHSA HEADER                                   */ 00181000
*           /*                                                       */ 00182000
*           /*********************************************************/ 00183000
*                                                                  0161 00184000
*           SAVEPTR=ADPLFMT2-START; /* VALUE FOR OFFSET GENERATION   */ 00185000
         L     @14,ADPLFMT2(,ABDPLPTR)                             0161 00186000
         SL    @14,START(,ABDPLPTR)                                0161 00187000
         ST    @14,SAVEPTR                                         0161 00188000
*           BUFFER(1:LENGTH(IHSAHDR))=IHSAHDR;/* TITLE LINE          */ 00189000
         L     @14,ADPLBUF(,ABDPLPTR)                              0162 00190000
         MVC   BUFFER(54,@14),IHSAHDR                              0162 00191000
*           PACKAREA=IHSAPTR;       /* PLACE ADDR IN CHAR AREA       */ 00192000
         ST    IHSAPTR,PACKAREA                                    0163 00193000
*           GARBAGE='04'X;          /* GARBAGE BYTE FOR UNPACK       */ 00194000
         MVI   GARBAGE,X'04'                                       0164 00195000
*           UNPK(ADDRESS,UNPACK);   /* PLACE INTO BUFFER             */ 00196000
         UNPK  ADDRESS(9,@14),UNPACK(5)                            0165 00197000
*           TR(ADDRESS,TRANS);      /* TRANSLATE TO PRINTABLE HEX    */ 00198000
         TR    ADDRESS(9,@14),TRANS                                0166 00199000
*           CALL PRINT;             /* PRINT TITLE LINE              */ 00200000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0167 00201000
         BALR  @14,@15                                             0167 00202000
*           BUFFER(1:LENGTH(IHSAUS))=IHSAUS;/* UNDERSCORE            */ 00203000
         L     @14,ADPLBUF(,ABDPLPTR)                              0168 00204000
         MVC   BUFFER(28,@14),IHSAUS                               0168 00205000
*           CALL PRINT;             /* PRINT IT                      */ 00206000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0169 00207000
         BALR  @14,@15                                             0169 00208000
*           CALL PRINT;             /* BLANK                         */ 00209000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0170 00210000
         BALR  @14,@15                                             0170 00211000
*           CALL PRINT;             /* BLANK                         */ 00212000
*                                                                  0171 00213000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0171 00214000
         BALR  @14,@15                                             0171 00215000
*           /*********************************************************/ 00216000
*           /*                                                       */ 00217000
*           /* SECTION UNIQUE TO IHSA                                */ 00218000
*           /*                                                       */ 00219000
*           /*********************************************************/ 00220000
*                                                                  0172 00221000
*           DO ARRAYCNT=1 TO DIM(IHSANAME) WHILE(ERRSW=OFF);/* FORMAT   00222000
*                                      IHSA UP TO FRRS               */ 00223000
         LA    ARRAYCNT,1                                          0172 00224000
@DL00172 TM    ERRSW,B'01000000'                                   0172 00225000
         BNZ   @DC00172                                            0172 00226000
*             LINEPTR=IHSANAME(ARRAYCNT);/* FORMAT PATTERN           */ 00227000
         LR    @14,ARRAYCNT                                        0173 00228000
         SLA   @14,2                                               0173 00229000
         L     LINEPTR,IHSANAME-4(@14)                             0173 00230000
*             CALL CONVERT;         /* OFFSET GENERATOR              */ 00231000
         BAL   @14,CONVERT                                         0174 00232000
*             CALL FMTRTN;          /* FORMAT                        */ 00233000
         BAL   @14,FMTRTN                                          0175 00234000
*           END;                    /* END FORMAT LOOP               */ 00235000
         AH    ARRAYCNT,@CH00041                                   0176 00236000
         CH    ARRAYCNT,@CH00080                                   0176 00237000
         BNH   @DL00172                                            0176 00238000
@DC00172 DS    0H                                                  0177 00239000
*           IF ERRSW=OFF THEN       /* NO ERRORS SO FAR              */ 00240000
         TM    ERRSW,B'01000000'                                   0177 00241000
         BNZ   @RF00177                                            0177 00242000
*             DO;                                                  0178 00243000
*               CALL PRINT;         /* BLANK                         */ 00244000
*                                                                  0179 00245000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0179 00246000
         BALR  @14,@15                                             0179 00247000
*               /*****************************************************/ 00248000
*               /*                                                   */ 00249000
*               /* IHSA SECTION WHICH CHANGES WITH SU50              */ 00250000
*               /*                                                   */ 00251000
*               /*****************************************************/ 00252000
*                                                                  0180 00253000
*               BUFFER(31:(LENGTH(IHSAFMSG)+30))=IHSAFMSG;/* FRRS  0180 00254000
*                                      STACK HDR                     */ 00255000
         L     @14,ADPLBUF(,ABDPLPTR)                              0180 00256000
         MVC   BUFFER+30(9,@14),IHSAFMSG                           0180 00257000
*               CALL PRINT;         /* PRINT IT                      */ 00258000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0181 00259000
         BALR  @14,@15                                             0181 00260000
*               BUFFER(31:(LENGTH(IHSAFRUS)+30))=IHSAFRUS;/*       0182 00261000
*                                      UNDERSCORE                    */ 00262000
         L     @14,ADPLBUF(,ABDPLPTR)                              0182 00263000
         MVC   BUFFER+30(9,@14),IHSAFRUS                           0182 00264000
*               CALL PRINT;         /* PRINT IT                      */ 00265000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0183 00266000
         BALR  @14,@15                                             0183 00267000
*               CALL PRINT;         /* BLANK                         */ 00268000
*                                                                  0184 00269000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0184 00270000
         BALR  @14,@15                                             0184 00271000
*               /*****************************************************/ 00272000
*               /*                                                   */ 00273000
*               /* THIS LINE OF THE FRRS IS FORMATTED HERE BECAUSE   */ 00274000
*               /* SU50 CHANGED THE CONTENTS OF THIS AREA            */ 00275000
*               /*                                                   */ 00276000
*               /*****************************************************/ 00277000
*                                                                  0185 00278000
*               FRRSPTR=ADPLFMT2;   /* SET PTR FOR FIGURING NUM    0185 00279000
*                                      ENTRIES                       */ 00280000
         MVC   FRRSPTR(4),ADPLFMT2(ABDPLPTR)                       0185 00281000
*               ARRAYCNT=1;                                        0186 00282000
         LA    ARRAYCNT,1                                          0186 00283000
*               IF SU50SAVE=ON THEN /* SU50 ON SYSTEM                */ 00284000
         TM    SU50SAVE,B'10000000'                                0187 00285000
         BNO   @RF00187                                            0187 00286000
*                 LINEPTR=IHSASU50(ARRAYCNT);/* SU50 VERSION         */ 00287000
         LR    @14,ARRAYCNT                                        0188 00288000
         SLA   @14,2                                               0188 00289000
         L     LINEPTR,IHSASU50-4(@14)                             0188 00290000
*               ELSE                /* NON SU50 VERSION              */ 00291000
*                 LINEPTR=FRRNAMES(ARRAYCNT);/* COMMON FRRS LINE     */ 00292000
         B     @RC00187                                            0189 00293000
@RF00187 LR    @14,ARRAYCNT                                        0189 00294000
         SLA   @14,2                                               0189 00295000
         L     LINEPTR,FRRNAMES-4(@14)                             0189 00296000
*               CALL CONVERT;       /* OFFSET                        */ 00297000
@RC00187 BAL   @14,CONVERT                                         0190 00298000
*               CALL FMTRTN;        /* FORMAT                        */ 00299000
         BAL   @14,FMTRTN                                          0191 00300000
*               IF ERRSW=OFF THEN                                  0192 00301000
         TM    ERRSW,B'01000000'                                   0192 00302000
         BNZ   @RF00192                                            0192 00303000
*                 CALL RT1RTN;      /* IF STILL NO ERRORS FINISH   0193 00304000
*                                      PROCESSING                    */ 00305000
         BAL   @14,RT1RTN                                          0193 00306000
*               ELSE                                               0194 00307000
*                 ;                 /* FRRS ERROR                    */ 00308000
@RF00192 DS    0H                                                  0195 00309000
*             END;                  /* END NO IHSA ERROR             */ 00310000
*           ELSE                                                   0196 00311000
*             ;                     /* IHSA ERROR                    */ 00312000
@RF00177 DS    0H                                                  0197 00313000
*         END;                      /* END FOUND SYSTEM              */ 00314000
*       ELSE                                                       0198 00315000
*         ;                         /* ERROR FINDING SYSTEM          */ 00316000
@RF00159 DS    0H                                                  0199 00317000
*     END;                          /* END COULD ACCESS REL NUMBER   */ 00318000
*   CALL PRINT;                     /* ERROR MSG OR BLANK            */ 00319000
@RC00127 L     @15,ADPLPRNT(,ABDPLPTR)                             0200 00320000
         BALR  @14,@15                                             0200 00321000
*   LCALREGS=RTYREGS;               /* RESTORE RETRY REGS OF CALLER  */ 00322000
         MVC   LCALREGS(64,ESTAPTR),RTYREGS(ESTAPTR)               0201 00323000
*   RETURN CODE(RCCODE);            /* DO NOT ENTER FRR CODE         */ 00324000
         L     @09,RCCODE                                          0202 00325000
         L     @13,4(,@13)                                         0202 00326000
         L     @00,@SIZDATD                                        0202 00327000
         LR    @01,@10                                             0202 00328000
         FREEMAIN R,LV=(0),A=(1)                                        00329000
         LR    @15,@09                                             0202 00330000
         L     @14,12(,@13)                                        0202 00331000
         LM    @00,@12,20(@13)                                     0202 00332000
         BR    @14                                                 0202 00333000
*IEAFTFRR:                                                         0203 00334000
*   ENTRY;                                                         0203 00335000
*                                                                  0203 00336000
@EP00203 DS    0H                                                  0204 00337000
*/********************************************************************/ 00338000
*/* FUNCTION-                                                      0204 00339000
*       ROUTINE WHICH FORMATS THE FRR STACK TITLE AND LINES WHICH ARE   00340000
*     DIFFERENT THAN THOSE IN THE INTERRUPT HANDLER SAVE AREA.     0204 00341000
*     IT SETS UP THE NEEDED POINTERS TO BE PASSED TO THE FORMAT ROUTINE 00342000
*     SENT IN THE PARAMETER LIST.  FOR ANY ERROR ACCESSING A NEEDED     00343000
*     FIELD IN THE FRRS OR FOR NON-ZERO RETURN CODE FROM THE       0204 00344000
*     FORMATTING SERVICE, THE FOLLOWING MESSAGES WILL BE PRINTED:  0204 00345000
*                       *** FORMATTING SERVICE ROUTINE ERROR DURING FRR 00346000
*                           FORMATTING (POSSIBLE CAUSE: DATA NOT IN     00347000
*                           DUMP ) ***.                            0204 00348000
*     AT THIS POINT, FOR EITHER REASON, THE FRR PROCESSING WOULD   0204 00349000
*     TERMINATE. IF THE FRR LINES ARE FORMATTED WITHOUT AN ACCESS  0204 00350000
*     ERROR, THE ROUTINE TO FORMAT THE FRRS-IHSA COMMON AREAS IS   0204 00351000
*     CALLED.                                                      0204 00352000
*                                                                  0204 00353000
*   INPUT-                                                         0204 00354000
*       REGISTER 1 POINTS TO THE PARMLIST WHICH CONTAINS THE ADDRESS    00355000
*     OF THE CONTROL BLOCK TO BE FORMATTED IN ADPLFMT2. ADPLFMT1 ALSO   00356000
*     DEFINED AS START, CONTAINS THE OFFSET TO BE PLACED ALONG SIDE     00357000
*     THE FIRST FIELD IN THE CONTROL BLOCK AND ADPLCOM1 CONTAINS THE    00358000
*     ADDRESS OF THE ESTAE PARAMETER LIST.                         0204 00359000
*                                                                  0204 00360000
*   CALLS-                                                         0204 00361000
*       CALLS ACCESRTN,CONVERT,FMTRTN,RT1RTN,AND PRINT             0204 00362000
*                                                                  0204 00363000
*   CALLED BY -                                                    0204 00364000
*       IEAVTFMT TO FORMAT FRRS AND RT1W.                          0204 00365000
*                                                                  0204 00366000
*   RETURNS TO -                                                   0204 00367000
*       CALLER WITH A RETURN CODE SET BY THE ACCESS OR FORMAT      0204 00368000
*       SERVICE ROUTINES OR BY RT1RTN.                               */ 00369000
*/********************************************************************/ 00370000
*                                                                  0204 00371000
*   ESTAPTR=ADPLCOM1;               /* PTR TO ESTAE PARM LIST        */ 00372000
         L     ESTAPTR,ADPLCOM1(,ABDPLPTR)                         0204 00373000
*   STM(VADR,RCREG,LCALREGS);       /* SAVE REGS FOR RETRY           */ 00374000
         STM   VADR,RCREG,LCALREGS(ESTAPTR)                        0205 00375000
*   ADPLCOM1=ADDR(FRRSFMT);         /* FORMAT ROUTINE ERROR MESSAGE  */ 00376000
         LA    @14,FRRSFMT                                         0206 00377000
         ST    @14,ADPLCOM1(,ABDPLPTR)                             0206 00378000
*   FRRSPTR=ADPLFMT2;               /* PTR TO FRRS CONTROL BLOCK     */ 00379000
         L     @14,ADPLFMT2(,ABDPLPTR)                             0207 00380000
         ST    @14,FRRSPTR                                         0207 00381000
*   BITS=BITS&&BITS;                /* ZERO THE INTERNAL BITS        */ 00382000
         XC    BITS(1),BITS                                        0208 00383000
*   SAVEPTR=ADPLFMT2-START;         /* VALUE FOR DYNAMIC OFFSET    0209 00384000
*                                      GENERATOR                     */ 00385000
         LR    @08,@14                                             0209 00386000
         SL    @08,START(,ABDPLPTR)                                0209 00387000
         ST    @08,SAVEPTR                                         0209 00388000
*   BUFFER(1:LENGTH(FRRHDR))=FRRHDR;/* TITLE LINE                    */ 00389000
         L     @08,ADPLBUF(,ABDPLPTR)                              0210 00390000
         MVC   BUFFER(54,@08),FRRHDR                               0210 00391000
*   PACKAREA=FRRSPTR;               /* PLACE ADDR INTO CHAR AREA     */ 00392000
         ST    @14,PACKAREA                                        0211 00393000
*   GARBAGE='04'X;                  /* GARBAGE BYTE FOR THE UNPACK   */ 00394000
         MVI   GARBAGE,X'04'                                       0212 00395000
*   UNPK(ADDRESS,UNPACK);           /* PLACE ADDRESS INTO BUFFER LINE*/ 00396000
         UNPK  ADDRESS(9,@08),UNPACK(5)                            0213 00397000
*   TR(ADDRESS,TRANS);              /* TRANSLATE TO PRINTABLE HEX    */ 00398000
         TR    ADDRESS(9,@08),TRANS                                0214 00399000
*   CALL PRINT;                     /* PRINT TITLE                   */ 00400000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0215 00401000
         BALR  @14,@15                                             0215 00402000
*   BUFFER(1:LENGTH(FRRSUS))=FRRSUS;/* UNDERSCORE                    */ 00403000
         L     @14,ADPLBUF(,ABDPLPTR)                              0216 00404000
         MVC   BUFFER(18,@14),FRRSUS                               0216 00405000
*   CALL PRINT;                     /* PRINT IT                      */ 00406000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0217 00407000
         BALR  @14,@15                                             0217 00408000
*   CALL PRINT;                     /* BLANK                         */ 00409000
*                                                                  0218 00410000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0218 00411000
         BALR  @14,@15                                             0218 00412000
*   /*****************************************************************/ 00413000
*   /*                                                               */ 00414000
*   /* SECTION OF THE FRR STACK PRECEDING THE FRR ENTRIES            */ 00415000
*   /*                                                               */ 00416000
*   /*****************************************************************/ 00417000
*                                                                  0219 00418000
*   ARRAYCNT=1;                     /* FIRST FORMAT PATTERN          */ 00419000
         LA    ARRAYCNT,1                                          0219 00420000
*   LINEPTR=FRRNAMES(ARRAYCNT);     /* ADDRESS OF FIRST FORMAT     0220 00421000
*                                      PATTERN                       */ 00422000
         LR    @14,ARRAYCNT                                        0220 00423000
         SLA   @14,2                                               0220 00424000
         L     LINEPTR,FRRNAMES-4(@14)                             0220 00425000
*   CALL CONVERT;                   /* GENERATE OFFSET               */ 00426000
         BAL   @14,CONVERT                                         0221 00427000
*   CALL FMTRTN;                    /* FORMAT                        */ 00428000
         BAL   @14,FMTRTN                                          0222 00429000
*   IF ERRSW=OFF THEN               /* CONTINUE ONLY IF FORMATTED OK */ 00430000
         TM    ERRSW,B'01000000'                                   0223 00431000
         BNZ   @RF00223                                            0223 00432000
*     CALL RT1RTN;                  /* ROUTINE TO FORMAT FRR IHSA  0224 00433000
*                                      COMMON AREAS                  */ 00434000
         BAL   @14,RT1RTN                                          0224 00435000
*   ELSE                                                           0225 00436000
*     ;                             /* DID NOT FORMAT OK             */ 00437000
@RF00223 DS    0H                                                  0226 00438000
*   LCALREGS=RTYREGS;               /* RESTORE RETRY REGS OF CALLER  */ 00439000
         MVC   LCALREGS(64,ESTAPTR),RTYREGS(ESTAPTR)               0226 00440000
*   RETURN CODE(RCCODE);            /* END ENTRY POINT IEAFTFRR      */ 00441000
         L     @09,RCCODE                                          0227 00442000
         L     @13,4(,@13)                                         0227 00443000
         L     @00,@SIZDATD                                        0227 00444000
         LR    @01,@10                                             0227 00445000
         FREEMAIN R,LV=(0),A=(1)                                        00446000
         LR    @15,@09                                             0227 00447000
         L     @14,12(,@13)                                        0227 00448000
         LM    @00,@12,20(@13)                                     0227 00449000
         BR    @14                                                 0227 00450000
*RT1RTN:                                                           0228 00451000
*   PROC OPTIONS(SAVE(14));                                        0228 00452000
*                                                                  0228 00453000
@EL00001 L     @13,4(,@13)                                         0228 00454000
@EF00001 L     @00,@SIZDATD                                        0228 00455000
         LR    @01,@10                                             0228 00456000
         FREEMAIN R,LV=(0),A=(1)                                        00457000
@ER00001 LM    @14,@12,12(@13)                                     0228 00458000
         BR    @14                                                 0228 00459000
RT1RTN   ST    @14,@SA00002                                        0228 00460000
*/********************************************************************/ 00461000
*/* FUNCTION-                                                      0229 00462000
*       ROUTINE WHICH FORMATS THE FRR STACK FROM THE RT1W ON.      0229 00463000
*     THIS SECTION OF THE CONTROL BLOCK IS COMMON BETWEEN THE IHSA 0229 00464000
*     AND FRR STACK.                                               0229 00465000
*     IT SETS UP THE NEEDED POINTERS TO BE PASSED TO THE FORMAT ROUTINE 00466000
*     SENT IN THE PARAMETER LIST.  FOR ANY ERROR ACCESSING A NEEDED     00467000
*     FIELD IN THE RT1W OR FRRS OR FOR NON-ZERO RETURN CODE FROM THE    00468000
*     FORMATTING SERVICE, THE FOLLOWING MESSAGES WILL BE PRINTED:  0229 00469000
*                       *** FORMATTING SERVICE ROUTINE ERROR DURING FRR 00470000
*                           FORMATTING (POSSIBLE CAUSE: DATA NOT IN     00471000
*                           DUMP ) ***.                            0229 00472000
*     IF THE NEEDED FIELDS FOR DETERMINING THE NUMBER OF ENTRIES COULD  00473000
*     BE ACCESSED BUT THE NUMBER OF ENTRIES IS NOT BETWEEN 0 AND 16-THE 00474000
*     VALUES MUST BE IN ERROR AND THE FOLLOWING MESSAGE WILL BE    0229 00475000
*     PRINTED:                                                     0229 00476000
*                       *** ERROR IN THE FIELDS USED TO DETERMINE  0229 00477000
*                           THE NUMBER OF FRR ENTRIES ***          0229 00478000
*     AT THIS POINT, FOR EITHER REASON, THE FRR PROCESSING WOULD   0229 00479000
*     TERMINATE. IF THE FRR STACK IS FORMATTED WITHOUT AN ACCESS   0229 00480000
*     ERROR, A BIT SUMMARY OF THE RT1W IS PRINTED USING THE ANALYZE     00481000
*     PROC.                                                        0229 00482000
*                                                                  0229 00483000
*                                                                  0229 00484000
*   CALLS-                                                         0229 00485000
*       CALLS ACCESRTN,CONVERT,FMTRTN,RT1BITS,AND PRINT            0229 00486000
*                                                                  0229 00487000
*   CALLED BY -                                                    0229 00488000
*             IEAFTFRR AND IEAFTIHS TO FORMAT THE IHSA FRRS COMMON 0229 00489000
*             AREAS.                                               0229 00490000
*                                                                  0229 00491000
*   RETURNS TO -                                                   0229 00492000
*              CALLER WITH A RETURN CODE SET BY THE ACCESS OR FORMAT    00493000
*             SERVICE ROUTINES.                                      */ 00494000
*/********************************************************************/ 00495000
*                                                                  0229 00496000
*   ERRSW=OFF;                                                     0229 00497000
         NI    ERRSW,B'10111111'                                   0229 00498000
*   CALL PRINT;                     /* BLANK LINE                    */ 00499000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0230 00500000
         BALR  @14,@15                                             0230 00501000
*   RT1PTR=ADPLFMT2;                /* RT1W ADDRESS                  */ 00502000
         MVC   RT1PTR(4),ADPLFMT2(ABDPLPTR)                        0231 00503000
*                                                                  0232 00504000
*   /*****************************************************************/ 00505000
*   /*                                                               */ 00506000
*   /* FIGURE OUT THE NUMBER OF POSSIBLE ENTRIES IN THE FRR STACK.   */ 00507000
*   /* FOR RELEASE 2 OF MVS THE NUMBER OF ENTRIES WAS 8. FOR RELEASE */ 00508000
*   /* 3 THIS NUMBER CHANGED TO 16. THE NUMBER CAN BE DETERMINED BY  */ 00509000
*   /* TAKING THE LAST POSSIBLE ENTRY ADDRESS AND SUBTRACTING FROM IT*/ 00510000
*   /* THE FIRST POSSIBLE ADDRESS AND THEN DIVIDING BY THE LENGTH OF */ 00511000
*   /* OF THE ENTRY.                                                 */ 00512000
*   /*                                                               */ 00513000
*   /*****************************************************************/ 00514000
*                                                                  0232 00515000
*   IF SU50SAVE=ON THEN             /* SET NUMBER OF FRR ENTRIES -16 */ 00516000
         TM    SU50SAVE,B'10000000'                                0232 00517000
         BNO   @RF00232                                            0232 00518000
*     ENTRYMAX=SU50MAX;                                            0233 00519000
         LA    ENTRYMAX,16                                         0233 00520000
*   ELSE                            /* DYNAMICALLY FIGURE NUM ENTRIES*/ 00521000
*     DO;                                                          0234 00522000
         B     @RC00232                                            0234 00523000
@RF00232 DS    0H                                                  0235 00524000
*       VADR=ADDR(FRRSLAST);        /* LAST POSSIBLE ENTRY ADDRESS   */ 00525000
         L     @14,FRRSPTR                                         0235 00526000
         LA    VADR,FRRSLAST(,@14)                                 0235 00527000
*       CALL ACCESRTN;              /* ACCESS IT                     */ 00528000
         BAL   @14,ACCESRTN                                        0236 00529000
*       IF RCREG^=ZERO THEN         /* ERROR ACCESSING THE FRR SATCK */ 00530000
         LTR   RCREG,RCREG                                         0237 00531000
         BZ    @RF00237                                            0237 00532000
*         DO;                                                      0238 00533000
*           BUFFER(1:LENGTH(FRRSFMT))=FRRSFMT;/* ERROR MESSAGE       */ 00534000
         L     @14,ADPLBUF(,ABDPLPTR)                              0239 00535000
         MVC   BUFFER(120,@14),FRRSFMT                             0239 00536000
*           CALL PRINT;             /* PRINT IT                      */ 00537000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0240 00538000
         BALR  @14,@15                                             0240 00539000
*           ERRSW=ON;               /* ERROR INDICATOR               */ 00540000
         OI    ERRSW,B'01000000'                                   0241 00541000
*         END;                      /* END ERROR ACCESSING           */ 00542000
*       ELSE                        /* FOUND LAST ENTRY ADDRESS      */ 00543000
*         DO;                                                      0243 00544000
         B     @RC00237                                            0243 00545000
@RF00237 DS    0H                                                  0244 00546000
*           ENTRYMAX=DATAWORD;      /* SAVE LAST ADDRESS             */ 00547000
         L     ENTRYMAX,DATAWORD(,DATAPTR)                         0244 00548000
*           VADR=ADDR(FRRSEMP);     /* FIRST POSSIBLE ADDRESS        */ 00549000
         L     VADR,FRRSPTR                                        0245 00550000
*           CALL ACCESRTN;          /* ACCESS IT                     */ 00551000
         BAL   @14,ACCESRTN                                        0246 00552000
*           IF RCREG^=ZERO THEN     /* ERROR ACCESSING FIRST POSSIBLE   00553000
*                                      ADR                           */ 00554000
         LTR   RCREG,RCREG                                         0247 00555000
         BZ    @RF00247                                            0247 00556000
*             DO;                                                  0248 00557000
*               BUFFER(1:LENGTH(FRRSFMT))=FRRSFMT;/* ERROR MSG       */ 00558000
         L     @14,ADPLBUF(,ABDPLPTR)                              0249 00559000
         MVC   BUFFER(120,@14),FRRSFMT                             0249 00560000
*               CALL PRINT;         /* PRINT IT                      */ 00561000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0250 00562000
         BALR  @14,@15                                             0250 00563000
*               ERRSW=ON;           /* ERROR INDICATOR               */ 00564000
         OI    ERRSW,B'01000000'                                   0251 00565000
*             END;                  /* ERROR ACCESSING               */ 00566000
*           ELSE                    /* FOUND FIRST POSSIBLE ADDRESS  */ 00567000
*             DO;                                                  0253 00568000
         B     @RC00247                                            0253 00569000
@RF00247 DS    0H                                                  0254 00570000
*               ENTRYMAX=ENTRYMAX-DATAWORD;/* LENGTH OF SPACE FOR  0254 00571000
*                                      ENTRIES                       */ 00572000
         SL    ENTRYMAX,DATAWORD(,DATAPTR)                         0254 00573000
*               VADR=ADDR(FRRSELEN);/* LENGTH OF EACH ENTRY          */ 00574000
         L     @14,FRRSPTR                                         0255 00575000
         LA    VADR,FRRSELEN(,@14)                                 0255 00576000
*               CALL ACCESRTN;      /* ACCESS IT                     */ 00577000
         BAL   @14,ACCESRTN                                        0256 00578000
*               IF RCREG^=ZERO THEN /* ERROR ACCESSING LENGTH        */ 00579000
         LTR   RCREG,RCREG                                         0257 00580000
         BZ    @RF00257                                            0257 00581000
*                 DO;                                              0258 00582000
*                   BUFFER(1:LENGTH(FRRSFMT))=FRRSFMT;/* ERROR MSG   */ 00583000
         L     @14,ADPLBUF(,ABDPLPTR)                              0259 00584000
         MVC   BUFFER(120,@14),FRRSFMT                             0259 00585000
*                   CALL PRINT;     /* PRINT IT                      */ 00586000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0260 00587000
         BALR  @14,@15                                             0260 00588000
*                   ERRSW=ON;       /* ERROR INDICATOR               */ 00589000
         OI    ERRSW,B'01000000'                                   0261 00590000
*                 END;              /* END ACCESS ERROR              */ 00591000
*               ELSE                /* FOUND ENTRY LENGTH            */ 00592000
*                 IF DATAWORD=ZERO THEN/* TEST FOR ZERO STACK      0263 00593000
*                                                            @ZA27290*/ 00594000
         B     @RC00257                                            0263 00595000
@RF00257 ICM   @14,15,DATAWORD(DATAPTR)                            0263 00596000
         BNZ   @RF00263                                            0263 00597000
*                   DO;                                            0264 00598000
*                     BUFFER(1:LENGTH(FRRLZERO))=FRRLZERO;/* ERROR 0265 00599000
*                                      MSG                   @ZA27290*/ 00600000
         L     @14,ADPLBUF(,ABDPLPTR)                              0265 00601000
         MVC   BUFFER(64,@14),FRRLZERO                             0265 00602000
*                     CALL PRINT;   /* PRINT IT              @ZA27290*/ 00603000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0266 00604000
         BALR  @14,@15                                             0266 00605000
*                     ERRSW=ON;     /* SET UP FOR ERROR EXIT @ZA27290*/ 00606000
         OI    ERRSW,B'01000000'                                   0267 00607000
*                   END;            /* END.... ERROR RTN     @ZA27290*/ 00608000
*                 ELSE              /* STACK NOT ZERO        @ZA27290*/ 00609000
*                   DO;             /*                       @ZA27290*/ 00610000
         B     @RC00263                                            0269 00611000
@RF00263 DS    0H                                                  0270 00612000
*                     ENTRYMAX=ENTRYMAX/DATAWORD;/* NUMBER OF ENTRIES*/ 00613000
         LR    @02,ENTRYMAX                                        0270 00614000
         SRDA  @02,32                                              0270 00615000
         D     @02,DATAWORD(,DATAPTR)                              0270 00616000
         LR    ENTRYMAX,@03                                        0270 00617000
*                     IF(ENTRYMAX>16)|(ENTRYMAX<1) THEN/* SOMETHING     00618000
*                                      WRONG WITH VALUES FOUND       */ 00619000
         CH    ENTRYMAX,@CH00718                                   0271 00620000
         BH    @RT00271                                            0271 00621000
         LTR   ENTRYMAX,ENTRYMAX                                   0271 00622000
         BP    @RF00271                                            0271 00623000
@RT00271 DS    0H                                                  0272 00624000
*                       DO;                                        0272 00625000
*                         BUFFER(1:LENGTH(BADMAX))=BADMAX;/* ERROR 0273 00626000
*                                      MSG                           */ 00627000
         L     @14,ADPLBUF(,ABDPLPTR)                              0273 00628000
         MVC   BUFFER(72,@14),BADMAX                               0273 00629000
*                         CALL PRINT;/* PRINT IT                     */ 00630000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0274 00631000
         BALR  @14,@15                                             0274 00632000
*                         ERRSW=ON; /* ERROR INDICATOR               */ 00633000
         OI    ERRSW,B'01000000'                                   0275 00634000
*                         RCCODE=4; /* INHIBIT EED SEARCHING IN MAIN    00635000
*                                      RTN                           */ 00636000
         MVC   RCCODE(4),@CF00080                                  0276 00637000
*                       END;        /* END WRONG VALUES              */ 00638000
*                   END;            /* FOUND ENTRY LENGTH            */ 00639000
@RF00271 DS    0H                                                  0279 00640000
*             END;                  /* END FOUND FIRST ADR           */ 00641000
@RC00263 DS    0H                                                  0279 00642000
@RC00257 DS    0H                                                  0280 00643000
*         END;                      /* END FOUND LAST ADR            */ 00644000
@RC00247 DS    0H                                                  0281 00645000
*     END;                          /* END DYNAMICALLY FIGURE ENTRIES*/ 00646000
@RC00237 DS    0H                                                  0282 00647000
*   IF ERRSW=OFF THEN               /* FIGURED NUM ENTRIES OK        */ 00648000
@RC00232 TM    ERRSW,B'01000000'                                   0282 00649000
         BNZ   @RF00282                                            0282 00650000
*     DO;                                                          0283 00651000
*                                                                  0284 00652000
*       /*************************************************************/ 00653000
*       /*                                                           */ 00654000
*       /* CONTINUE PROCESSING AT RT1W                               */ 00655000
*       /*                                                           */ 00656000
*       /*************************************************************/ 00657000
*                                                                  0284 00658000
*       BUFFER(16:(LENGTH(RT1MSG)+15))=RT1MSG;/* RT1W TO FOLLOW    0284 00659000
*                                      MESSAGE                       */ 00660000
         L     @14,ADPLBUF(,ABDPLPTR)                              0284 00661000
         MVC   BUFFER+15(38,@14),RT1MSG                            0284 00662000
*       CALL CONVERT;               /* GENERATE OFFSET               */ 00663000
         BAL   @14,CONVERT                                         0285 00664000
*       OFFSET=CONVERTD;            /* FILL IN OFFSET                */ 00665000
         L     @14,ADPLBUF(,ABDPLPTR)                              0286 00666000
         MVC   OFFSET(6,@14),CONVERTD                              0286 00667000
*       CALL PRINT;                 /* PRINT TITLE                   */ 00668000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0287 00669000
         BALR  @14,@15                                             0287 00670000
*       CALL PRINT;                 /* BLANK                         */ 00671000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0288 00672000
         BALR  @14,@15                                             0288 00673000
*       BUFFER(31:(LENGTH(FRREHDR)+30))=FRREHDR;/* FRR ENTRY TITLE   */ 00674000
         L     @14,ADPLBUF(,ABDPLPTR)                              0289 00675000
         MVC   BUFFER+30(11,@14),FRREHDR                           0289 00676000
*       CALL PRINT;                 /* PRINT IT                      */ 00677000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0290 00678000
         BALR  @14,@15                                             0290 00679000
*       BUFFER(31:(LENGTH(FRREUS)+30))=FRREUS;/* UNDERSCORE          */ 00680000
         L     @14,ADPLBUF(,ABDPLPTR)                              0291 00681000
         MVC   BUFFER+30(11,@14),FRREUS                            0291 00682000
*       CALL PRINT;                 /* PRINT IT                      */ 00683000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0292 00684000
         BALR  @14,@15                                             0292 00685000
*       CALL PRINT;                 /* BLANK                         */ 00686000
*                                                                  0293 00687000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0293 00688000
         BALR  @14,@15                                             0293 00689000
*       /*************************************************************/ 00690000
*       /*                                                           */ 00691000
*       /* SINCE THE RT1W IS TO BE FORMATTED AFTER THE FRR ENTRIES,  */ 00692000
*       /* INCREMENT THE CONTROL BLOCK ADDRESS TO FRR ENTRIES.       */ 00693000
*       /*                                                           */ 00694000
*       /*************************************************************/ 00695000
*                                                                  0294 00696000
*       ADPLFMT2=ADPLFMT2+LENGTH(RT1W);/* INCREMENT AROUND RT1W      */ 00697000
         LA    @14,68                                              0294 00698000
         AL    @14,ADPLFMT2(,ABDPLPTR)                             0294 00699000
         ST    @14,ADPLFMT2(,ABDPLPTR)                             0294 00700000
*       ARRAYCNT=ARRAYCNT+1;        /* NEXT FORMAT PATTERN           */ 00701000
         LA    @14,1                                               0295 00702000
         ALR   ARRAYCNT,@14                                        0295 00703000
*       DO LOOPCNTR=1 TO ENTRYMAX WHILE(ERRSW=OFF);/* FORMAT LOOP    */ 00704000
         B     @DE00296                                            0296 00705000
@DL00296 TM    ERRSW,B'01000000'                                   0296 00706000
         BNZ   @DC00296                                            0296 00707000
*         LINEPTR=FRRNAMES(ARRAYCNT);/* FORMAT PATTERN               */ 00708000
         LR    @14,ARRAYCNT                                        0297 00709000
         SLA   @14,2                                               0297 00710000
         L     LINEPTR,FRRNAMES-4(@14)                             0297 00711000
*         CALL CONVERT;             /* OFFSET GENERATOR              */ 00712000
         BAL   @14,CONVERT                                         0298 00713000
*         CALL FMTRTN;              /* FORMAT                        */ 00714000
         BAL   @14,FMTRTN                                          0299 00715000
*       END;                        /* END LOOP                      */ 00716000
         LA    @14,1                                               0300 00717000
         AL    @14,LOOPCNTR                                        0300 00718000
@DE00296 ST    @14,LOOPCNTR                                        0300 00719000
         CR    @14,ENTRYMAX                                        0300 00720000
         BNH   @DL00296                                            0300 00721000
@DC00296 DS    0H                                                  0301 00722000
*       CALL PRINT;                 /* 2 BLANKS                      */ 00723000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0301 00724000
         BALR  @14,@15                                             0301 00725000
*       CALL PRINT;                 /* BLANK                         */ 00726000
*                                                                  0302 00727000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0302 00728000
         BALR  @14,@15                                             0302 00729000
*       /*************************************************************/ 00730000
*       /*                                                           */ 00731000
*       /* FRR ENTRIES FORMATTED OK NOW FORMAT THE RT1 WORK AREA     */ 00732000
*       /*                                                           */ 00733000
*       /*************************************************************/ 00734000
*                                                                  0303 00735000
*       IF ERRSW=OFF THEN           /* OK SO FAR                     */ 00736000
         TM    ERRSW,B'01000000'                                   0303 00737000
         BNZ   @RF00303                                            0303 00738000
*         DO;                                                      0304 00739000
*           BUFFER(31:(LENGTH(RT1HDR)+30))=RT1HDR;/* RT1W TITLE      */ 00740000
         L     @14,ADPLBUF(,ABDPLPTR)                              0305 00741000
         MVC   BUFFER+30(14,@14),RT1HDR                            0305 00742000
*           CALL PRINT;             /* PRINT IT                      */ 00743000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0306 00744000
         BALR  @14,@15                                             0306 00745000
*           BUFFER(31:(LENGTH(RT1US)+30))=RT1US;/* UNDERSCORE        */ 00746000
         L     @14,ADPLBUF(,ABDPLPTR)                              0307 00747000
         MVC   BUFFER+30(14,@14),RT1US                             0307 00748000
*           CALL PRINT;             /* PRINT IT                      */ 00749000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0308 00750000
         BALR  @14,@15                                             0308 00751000
*           CALL PRINT;             /* BLANK                         */ 00752000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0309 00753000
         BALR  @14,@15                                             0309 00754000
*           VADR=ADDR(RT1TLPN);     /* LOGICAL PHASE #               */ 00755000
         L     VADR,RT1PTR                                         0310 00756000
*           CALL ACCESRTN;          /* ACCESS                        */ 00757000
         BAL   @14,ACCESRTN                                        0311 00758000
*           IF RCREG=ZERO THEN      /* COULD ACCESS LPN              */ 00759000
         LTR   RCREG,RCREG                                         0312 00760000
         BNZ   @RF00312                                            0312 00761000
*             DO;                                                  0313 00762000
*               SAVEPTR=RT1PTR;     /* START OFFSETS AT 0            */ 00763000
         L     @14,RT1PTR                                          0314 00764000
         ST    @14,SAVEPTR                                         0314 00765000
*               ADPLFMT2=RT1PTR;    /* BEGINNING OF RT1W             */ 00766000
         ST    @14,ADPLFMT2(,ABDPLPTR)                             0315 00767000
*               IF DATABYTE=ZEROBYTE THEN/* UNPREDICTABLE RT1W       */ 00768000
         CLC   DATABYTE(1,DATAPTR),ZEROBYTE                        0316 00769000
         BNE   @RF00316                                            0316 00770000
*                 DO;                                              0317 00771000
*                   BUFFER(8:(LENGTH(RT1WARN)+7))=RT1WARN;/* WARNING    00772000
*                                      MSG                           */ 00773000
         L     @14,ADPLBUF(,ABDPLPTR)                              0318 00774000
         MVC   BUFFER+7(49,@14),RT1WARN                            0318 00775000
*                   CALL PRINT;     /* PRINT IT                      */ 00776000
*                                                                  0319 00777000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0319 00778000
         BALR  @14,@15                                             0319 00779000
*                   /*************************************************/ 00780000
*                   /*                                               */ 00781000
*                   /* FORMAT RT1W WITH ONLY THE OFFSETS             */ 00782000
*                   /*                                               */ 00783000
*                   /*************************************************/ 00784000
*                                                                  0320 00785000
*                   DO ARRAYCNT=1 TO DIM(RT1ENAME) WHILE(ERRSW=OFF);    00786000
         LA    ARRAYCNT,1                                          0320 00787000
@DL00320 TM    ERRSW,B'01000000'                                   0320 00788000
         BNZ   @DC00320                                            0320 00789000
*                                   /* FORMAT LOOP                   */ 00790000
*                     LINEPTR=RT1ENAME(ARRAYCNT);/* FORMAT PATTERN   */ 00791000
         LR    @14,ARRAYCNT                                        0321 00792000
         SLA   @14,2                                               0321 00793000
         L     LINEPTR,RT1ENAME-4(@14)                             0321 00794000
*                     CALL CONVERT; /* OFFSET GENERATOR              */ 00795000
         BAL   @14,CONVERT                                         0322 00796000
*                     CALL FMTRTN;  /* FORMAT                        */ 00797000
         BAL   @14,FMTRTN                                          0323 00798000
*                   END;            /* END FORMAT LOOP               */ 00799000
         AH    ARRAYCNT,@CH00041                                   0324 00800000
         CH    ARRAYCNT,@CH00080                                   0324 00801000
         BNH   @DL00320                                            0324 00802000
@DC00320 DS    0H                                                  0325 00803000
*                   RCCODE=4;       /* INHIBIT EED SEARCH IN MAIN RTN*/ 00804000
         MVC   RCCODE(4),@CF00080                                  0325 00805000
*                 END;              /* END UNPREDICTABLE RT1W        */ 00806000
*               ELSE                /* NORMAL RT1W                   */ 00807000
*                 DO;                                              0327 00808000
         B     @RC00316                                            0327 00809000
@RF00316 DS    0H                                                  0328 00810000
*                   LPN=DATABYTE;   /* SAVE LOGICAL PHASE NUM        */ 00811000
*                                                                  0328 00812000
         SLR   LPN,LPN                                             0328 00813000
         IC    LPN,DATABYTE(,DATAPTR)                              0328 00814000
*                   /*************************************************/ 00815000
*                   /*                                               */ 00816000
*                   /* FORMAT THE RT1W WITH ALL THE HEADINGS         */ 00817000
*                   /*                                               */ 00818000
*                   /*************************************************/ 00819000
*                                                                  0329 00820000
*                   DO ARRAYCNT=1 TO DIM(RT1WNAME) WHILE(ERRSW=OFF);    00821000
         LA    ARRAYCNT,1                                          0329 00822000
@DL00329 TM    ERRSW,B'01000000'                                   0329 00823000
         BNZ   @DC00329                                            0329 00824000
*                                   /* FORMAT LOOP                   */ 00825000
*                     LINEPTR=RT1WNAME(ARRAYCNT);                  0330 00826000
         LR    @14,ARRAYCNT                                        0330 00827000
         SLA   @14,2                                               0330 00828000
         L     LINEPTR,RT1WNAME-4(@14)                             0330 00829000
*                     CALL CONVERT;                                0331 00830000
         BAL   @14,CONVERT                                         0331 00831000
*                     CALL FMTRTN;                                 0332 00832000
         BAL   @14,FMTRTN                                          0332 00833000
*                   END;            /* END FORMAT LOOP               */ 00834000
         AH    ARRAYCNT,@CH00041                                   0333 00835000
         CH    ARRAYCNT,@CH00080                                   0333 00836000
         BNH   @DL00329                                            0333 00837000
@DC00329 DS    0H                                                  0334 00838000
*                   IF ERRSW=OFF THEN/* RT1W FORMATTED FINE          */ 00839000
         TM    ERRSW,B'01000000'                                   0334 00840000
         BNZ   @RF00334                                            0334 00841000
*                     DO;                                          0335 00842000
*                       CALL RT1BITS;/* CALL BIT SUMMARY             */ 00843000
*                                                                  0336 00844000
         BAL   @14,RT1BITS                                         0336 00845000
*                       /*********************************************/ 00846000
*                       /*                                           */ 00847000
*                       /* IF ALL PARTS FORMATTED WITHOUT PROBLEM,   */ 00848000
*                       /* SEND THE ADDRESS OF THE EED CHAIN HEADER  */ 00849000
*                       /* TO THE MAINLINE CODE                      */ 00850000
*                       /*                                           */ 00851000
*                       /*********************************************/ 00852000
*                                                                  0337 00853000
*                       VADR=ADDR(RT1WEED);/* GET ADDR OF EED QUEUE  */ 00854000
         L     @14,RT1PTR                                          0337 00855000
         LA    VADR,RT1WEED(,@14)                                  0337 00856000
*                       CALL ACCESRTN;/* ACCESS IT                   */ 00857000
         BAL   @14,ACCESRTN                                        0338 00858000
*                       IF RCREG=ZERO THEN/* FOUND EED QUEUE OK      */ 00859000
         SLR   @14,@14                                             0339 00860000
         CR    RCREG,@14                                           0339 00861000
         BNE   @RF00339                                            0339 00862000
*                         DO;                                      0340 00863000
*                           ADPLFMT2=DATAWORD;/* FILL IN PARMLIST    */ 00864000
         MVC   ADPLFMT2(4,ABDPLPTR),DATAWORD(DATAPTR)              0341 00865000
*                           START=ZERO;                            0342 00866000
         ST    @14,START(,ABDPLPTR)                                0342 00867000
*                         END;      /* END FOUND EED QUEUE OK        */ 00868000
*                       ELSE                                       0344 00869000
*                         ;         /* DID NOT FIND EED QUEUE        */ 00870000
@RF00339 DS    0H                                                  0345 00871000
*                     END;          /* END RT1W FORMATTED OK         */ 00872000
*                   ELSE                                           0346 00873000
*                     ;             /* ERROR ABOVE IN RT1W           */ 00874000
@RF00334 DS    0H                                                  0347 00875000
*                 END;              /* END NORMAL RT1W               */ 00876000
*             END;                  /* END COULD ACCESS LPN          */ 00877000
*           ELSE                                                   0349 00878000
*             ;                     /* COULD NOT ACCESS LPN          */ 00879000
@RF00312 DS    0H                                                  0350 00880000
*         END;                      /* END FORMATTED FRR ENTRIES OK  */ 00881000
*       ELSE                                                       0351 00882000
*         ;                         /* FRR ENTRIES NOT FORMATTED OK  */ 00883000
@RF00303 DS    0H                                                  0352 00884000
*     END;                          /* END FIGURED ENTRIES OK        */ 00885000
*   ELSE                                                           0353 00886000
*     ;                             /* ERROR FIGURING FRR ENTRIES    */ 00887000
@RF00282 DS    0H                                                  0354 00888000
*   RETURN CODE(RCCODE);                                           0354 00889000
@RC00282 L     @15,RCCODE                                          0354 00890000
@EL00002 DS    0H                                                  0354 00891000
@EF00002 DS    0H                                                  0354 00892000
@ER00002 L     @14,@SA00002                                        0354 00893000
         BR    @14                                                 0354 00894000
*   END RT1RTN;                                                    0355 00895000
*RT1BITS:                                                          0356 00896000
*   PROC OPTIONS(SAVE(14));                                        0356 00897000
*                                                                  0356 00898000
RT1BITS  ST    @14,@SA00003                                        0356 00899000
*/****************************************************************** */ 00900000
*/* FUNCTION -                                                     0357 00901000
*      ROUTINE TO SUMMARIZE THE BITS FOR THE RT1W WORK AREA.  IT   0357 00902000
*      LOOKS FOR ANY OF THE BIT FLAGS BEING ON AND OUTPUTS THE     0357 00903000
*      SUMMARY HEADER AND THE BIT SUMMARY.  IF NO FLAGS ARE ON,    0357 00904000
*      NO TITLE NOR ANY MESSAGES WILL BE PRINTED.                  0357 00905000
*                                                                  0357 00906000
*   INPUT -                                                        0357 00907000
*      THE RT1W POINTER MUST HAVE THE ADDRESS OF THE RT1W CONTROL  0357 00908000
*      BLOCK IN IT AND REGISTER 1 MUST POINT TO THE PARAMETER LIST 0357 00909000
*      PASSED BY THE CALLER.                                       0357 00910000
*                                                                  0357 00911000
*   CALLS -                                                        0357 00912000
*      ACCESRTN, BYTEMODE, CONVERT, ENTRYRT1, AND PRINT            0357 00913000
*                                                                  0357 00914000
*   CALLED BY -                                                    0357 00915000
*      IEAFTFRR TO PUT OUT THE BIT FLAG SUMMARY FOR RT1W           0357 00916000
*                                                                  0357 00917000
*    RETURNS TO -                                                  0357 00918000
*      IEAFTFRR WITH RETURN CODE SET BY ACCESS SERVICE             0357 00919000
*      ROUTINES.                                                     */ 00920000
*/********************************************************************/ 00921000
*                                                                  0357 00922000
*   CALL PRINT;                     /* PRINT BLANK LINE              */ 00923000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0357 00924000
         BALR  @14,@15                                             0357 00925000
*   CALL PRINT;                     /* PRINT BLANK LINE              */ 00926000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0358 00927000
         BALR  @14,@15                                             0358 00928000
*   BUFFER(31:(LENGTH(RT1SUM)+30))=RT1SUM;/* SUMMARY TITLE           */ 00929000
         L     @14,ADPLBUF(,ABDPLPTR)                              0359 00930000
         MVC   BUFFER+30(21,@14),RT1SUM                            0359 00931000
*   CALL PRINT;                     /* PRINT IT                      */ 00932000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0360 00933000
         BALR  @14,@15                                             0360 00934000
*   BUFFER(31:(LENGTH(RT1SUS)+30))=RT1SUS;/* UNDERSCORE              */ 00935000
         L     @14,ADPLBUF(,ABDPLPTR)                              0361 00936000
         MVC   BUFFER+30(21,@14),RT1SUS                            0361 00937000
*   CALL PRINT;                     /* PRINT IT                      */ 00938000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0362 00939000
         BALR  @14,@15                                             0362 00940000
*   CALL PRINT;                     /* BLANK                         */ 00941000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0363 00942000
         BALR  @14,@15                                             0363 00943000
*   CALL PRINT;                     /* BLANK                         */ 00944000
*                                                                  0364 00945000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0364 00946000
         BALR  @14,@15                                             0364 00947000
*   /*****************************************************************/ 00948000
*   /*                                                               */ 00949000
*   /* ANALYZE LOGICAL PHASE NUMBER                                  */ 00950000
*   /*                                                               */ 00951000
*   /*****************************************************************/ 00952000
*                                                                  0365 00953000
*   ADPLFMT2=ADDR(RT1TLPN);                                        0365 00954000
         MVC   ADPLFMT2(4,ABDPLPTR),RT1PTR                         0365 00955000
*   CALL CONVERT;                   /* GENERATE OFFSET               */ 00956000
         BAL   @14,CONVERT                                         0366 00957000
*   OFFSET=CONVERTD;                /* FILL IN GENERATED OFFSET      */ 00958000
         L     @14,ADPLBUF(,ABDPLPTR)                              0367 00959000
         MVC   OFFSET(6,@14),CONVERTD                              0367 00960000
*   BUFFER(8:(LENGTH(LPNSTART)+7))=LPNSTART;/* BEGINNING OF MSG      */ 00961000
         MVC   BUFFER+7(24,@14),LPNSTART                           0368 00962000
*   PACKAREA(4:4)=LPN;              /* PLACE LOGICAL PHASE NUM IN  0369 00963000
*                                      CHAR AREA                     */ 00964000
         STC   LPN,PACKAREA+3                                      0369 00965000
*   GARBAGE='04'X;                  /* GARBAGE BYTE FOR THE UNPK     */ 00966000
         MVI   GARBAGE,X'04'                                       0370 00967000
*   UNPK(BUFFER(LENGTH(LPNSTART)+8:LENGTH(LPNSTART)+10),UNPACK(4:5));   00968000
         UNPK  BUFFER+31(3,@14),UNPACK+3(2)                        0371 00969000
*                                   /* UNPACK LPN INTO BUFFER        */ 00970000
*   TR(BUFFER(LENGTH(LPNSTART)+8:LENGTH(LPNSTART)+10),TRANS);/* MAKE    00971000
*                                      MAKE PRINTABLE                */ 00972000
         TR    BUFFER+31(3,@14),TRANS                              0372 00973000
*   RFY                                                            0373 00974000
*     ENDMSG BASED(ADDR(BUFFER)+LENGTH(LPNSTART)+10);              0373 00975000
*   IF LPN<MCHCK THEN               /* MGMT FUNCTION                 */ 00976000
         SLR   @09,@09                                             0374 00977000
         IC    @09,MCHCK                                           0374 00978000
         CR    LPN,@09                                             0374 00979000
         BNL   @RF00374                                            0374 00980000
*     ENDMSG=LPNARRAY(1);                                          0375 00981000
         MVI   ENDMSG+74(@14),C' '                                 0375 00982000
         MVC   ENDMSG+75(29,@14),ENDMSG+74(@14)                    0375 00983000
         MVC   ENDMSG+34(40,@14),LPNARRAY                          0375 00984000
*   ELSE                                                           0376 00985000
*     IF LPN<SRMCK THEN             /* MACHINE CHECK FUNCTION        */ 00986000
         B     @RC00374                                            0376 00987000
@RF00374 SLR   @14,@14                                             0376 00988000
         IC    @14,SRMCK                                           0376 00989000
         CR    LPN,@14                                             0376 00990000
         BNL   @RF00376                                            0376 00991000
*       ENDMSG=LPNARRAY(2);                                        0377 00992000
         L     @14,ADPLBUF(,ABDPLPTR)                              0377 00993000
         MVI   ENDMSG+74(@14),C' '                                 0377 00994000
         MVC   ENDMSG+75(29,@14),ENDMSG+74(@14)                    0377 00995000
         MVC   ENDMSG+34(40,@14),LPNARRAY+40                       0377 00996000
*     ELSE                                                         0378 00997000
*       IF LPN<RTRYCK THEN          /* SRM FUNCTION                  */ 00998000
         B     @RC00376                                            0378 00999000
@RF00376 SLR   @14,@14                                             0378 01000000
         IC    @14,RTRYCK                                          0378 01001000
         CR    LPN,@14                                             0378 01002000
         BNL   @RF00378                                            0378 01003000
*         ENDMSG=LPNARRAY(3);                                      0379 01004000
         L     @14,ADPLBUF(,ABDPLPTR)                              0379 01005000
         MVI   ENDMSG+74(@14),C' '                                 0379 01006000
         MVC   ENDMSG+75(29,@14),ENDMSG+74(@14)                    0379 01007000
         MVC   ENDMSG+34(40,@14),LPNARRAY+80                       0379 01008000
*       ELSE                                                       0380 01009000
*         IF LPN<RESCHDCK THEN      /* RESCHEDULE WITH RETRY         */ 01010000
         B     @RC00378                                            0380 01011000
@RF00378 SLR   @14,@14                                             0380 01012000
         IC    @14,RESCHDCK                                        0380 01013000
         CR    LPN,@14                                             0380 01014000
         BNL   @RF00380                                            0380 01015000
*           ENDMSG=LPNARRAY(4);                                    0381 01016000
         L     @14,ADPLBUF(,ABDPLPTR)                              0381 01017000
         MVI   ENDMSG+74(@14),C' '                                 0381 01018000
         MVC   ENDMSG+75(29,@14),ENDMSG+74(@14)                    0381 01019000
         MVC   ENDMSG+34(40,@14),LPNARRAY+120                      0381 01020000
*         ELSE                                                     0382 01021000
*           IF LPN<EXITCK THEN      /* RESCHEDULE                    */ 01022000
         B     @RC00380                                            0382 01023000
@RF00380 SLR   @14,@14                                             0382 01024000
         IC    @14,EXITCK                                          0382 01025000
         CR    LPN,@14                                             0382 01026000
         BNL   @RF00382                                            0382 01027000
*             ENDMSG=LPNARRAY(5);                                  0383 01028000
         L     @14,ADPLBUF(,ABDPLPTR)                              0383 01029000
         MVI   ENDMSG+74(@14),C' '                                 0383 01030000
         MVC   ENDMSG+75(29,@14),ENDMSG+74(@14)                    0383 01031000
         MVC   ENDMSG+34(40,@14),LPNARRAY+160                      0383 01032000
*           ELSE                                                   0384 01033000
*             IF LPN<RECURCK THEN   /* EXIT FUNCTION                 */ 01034000
         B     @RC00382                                            0384 01035000
@RF00382 SLR   @14,@14                                             0384 01036000
         IC    @14,RECURCK                                         0384 01037000
         CR    LPN,@14                                             0384 01038000
         BNL   @RF00384                                            0384 01039000
*               ENDMSG=LPNARRAY(6);                                0385 01040000
         L     @14,ADPLBUF(,ABDPLPTR)                              0385 01041000
         MVI   ENDMSG+74(@14),C' '                                 0385 01042000
         MVC   ENDMSG+75(29,@14),ENDMSG+74(@14)                    0385 01043000
         MVC   ENDMSG+34(40,@14),LPNARRAY+200                      0385 01044000
*             ELSE                                                 0386 01045000
*               ENDMSG=LPNARRAY(7); /* RECURSION                     */ 01046000
         B     @RC00384                                            0386 01047000
@RF00384 L     @14,ADPLBUF(,ABDPLPTR)                              0386 01048000
         MVI   ENDMSG+74(@14),C' '                                 0386 01049000
         MVC   ENDMSG+75(29,@14),ENDMSG+74(@14)                    0386 01050000
         MVC   ENDMSG+34(40,@14),LPNARRAY+240                      0386 01051000
*   CALL PRINT;                     /* PRINT THE LPN MESSAGE         */ 01052000
*                                                                  0387 01053000
@RC00384 DS    0H                                                  0387 01054000
@RC00382 DS    0H                                                  0387 01055000
@RC00380 DS    0H                                                  0387 01056000
@RC00378 DS    0H                                                  0387 01057000
@RC00376 DS    0H                                                  0387 01058000
@RC00374 L     @15,ADPLPRNT(,ABDPLPTR)                             0387 01059000
         BALR  @14,@15                                             0387 01060000
*   /*****************************************************************/ 01061000
*   /*                                                               */ 01062000
*   /* RESOLVE THE RTM1 ENTRY REASON                                 */ 01063000
*   /*                                                               */ 01064000
*   /*****************************************************************/ 01065000
*                                                                  0388 01066000
*   VADR=ADDR(RT1TENPT);            /* RTM1 ENTRY REASON             */ 01067000
         L     @14,RT1PTR                                          0388 01068000
         LA    VADR,RT1TENPT(,@14)                                 0388 01069000
*   CALL ACCESRTN;                  /* ACCESS IT                     */ 01070000
         BAL   @14,ACCESRTN                                        0389 01071000
*   IF RCREG=ZERO&DATABYTE^=ZEROBYTE THEN/* IT NEEDS TO BE RESOLVED  */ 01072000
         LTR   RCREG,RCREG                                         0390 01073000
         BNZ   @RF00390                                            0390 01074000
         CLC   DATABYTE(1,DATAPTR),ZEROBYTE                        0390 01075000
         BE    @RF00390                                            0390 01076000
*     DO;                                                          0391 01077000
*       ADPLFMT2=ADDR(RT1TENPT);    /* ADDRESS TO GEN OFFSET         */ 01078000
         L     @14,RT1PTR                                          0392 01079000
         LA    @14,RT1TENPT(,@14)                                  0392 01080000
         ST    @14,ADPLFMT2(,ABDPLPTR)                             0392 01081000
*       CALL ENTRYRT1;              /* ROUTINE TO ANALYZE            */ 01082000
         BAL   @14,ENTRYRT1                                        0393 01083000
*       CALL PRINT;                                                0394 01084000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0394 01085000
         BALR  @14,@15                                             0394 01086000
*     END;                          /* END NEEDS TO BE RESOLVED      */ 01087000
*   ELSE                                                           0396 01088000
*     ;                             /* DID NOT NEED TO BE RESOLVED   */ 01089000
*                                                                  0396 01090000
@RF00390 DS    0H                                                  0397 01091000
*   /*****************************************************************/ 01092000
*   /*                                                               */ 01093000
*   /* RESOLVE MODE BYTE                                             */ 01094000
*   /*                                                               */ 01095000
*   /*****************************************************************/ 01096000
*                                                                  0397 01097000
*   VADR=ADDR(RT1WMODE);            /* MODE BYTE                     */ 01098000
         L     @14,RT1PTR                                          0397 01099000
         LA    VADR,RT1WMODE(,@14)                                 0397 01100000
*   CALL ACCESRTN;                  /* ACCESS IT                     */ 01101000
         BAL   @14,ACCESRTN                                        0398 01102000
*   IF RCREG=ZERO&DATABYTE^=ZEROBYTE THEN/* NEEDS TO BE ANALYZED     */ 01103000
         LTR   RCREG,RCREG                                         0399 01104000
         BNZ   @RF00399                                            0399 01105000
         CLC   DATABYTE(1,DATAPTR),ZEROBYTE                        0399 01106000
         BE    @RF00399                                            0399 01107000
*     DO;                                                          0400 01108000
*       ADPLFMT2=ADDR(RT1WMODE);    /* ADDRESS NEEDED TO GEN OFFSET  */ 01109000
         L     @14,RT1PTR                                          0401 01110000
         LA    @14,RT1WMODE(,@14)                                  0401 01111000
         ST    @14,ADPLFMT2(,ABDPLPTR)                             0401 01112000
*       CALL BYTEMODE;              /* ROUTINE TO ANALYZE            */ 01113000
         BAL   @14,BYTEMODE                                        0402 01114000
*     END;                          /* END NEEDED TO BE ANALYZED     */ 01115000
*   ELSE                                                           0404 01116000
*     ;                             /* DID NOT NEED TO BE ANALYZED   */ 01117000
@RF00399 DS    0H                                                  0405 01118000
*   RETURN CODE(RCCODE);                                           0405 01119000
         L     @15,RCCODE                                          0405 01120000
@EL00003 DS    0H                                                  0405 01121000
@EF00003 DS    0H                                                  0405 01122000
@ER00003 L     @14,@SA00003                                        0405 01123000
         BR    @14                                                 0405 01124000
*   END RT1BITS;                                                   0406 01125000
*                                                                  0407 01126000
*/********************************************************************/ 01127000
*/*                                                                  */ 01128000
*/*         THE FOLLOWING CODE HAS BEEN INCLUDED FROM SYSLIB MEMBER  */ 01129000
*/*     IHAFTCD1 INTO THE MODULE. THE CODE IS INCLUDED ONLY FROM     */ 01130000
*/*     THE EED FORMATTER AND THE IHSA-FRRS FORMATTER. THE INCLUDED  */ 01131000
*/*     CODE CONSISTS OF THE BYTEMODE AND ENTRYRT1 ROUTINES.         */ 01132000
*/*         THE CODE HAS BEEN INCLUDED IN ORDER TO SIMPLIFY          */ 01133000
*/*     MAINTENANCE BY HAVING THE CODE IN ONLY ONE PLACE INSTEAD     */ 01134000
*/*     OF DUPLICATING IT IN EACH MODULE.                            */ 01135000
*/********************************************************************/ 01136000
*                                                                  0407 01137000
*                                                                  0407 01138000
*   /*****************************************************************/ 01139000
*   /*                                                               */ 01140000
*   /* WORK AREAS UNIQUE TO THE INCLUDED CODE FROM IHAFTCD1          */ 01141000
*   /*                                                               */ 01142000
*   /*****************************************************************/ 01143000
*                                                                  0407 01144000
*   DCL                                                            0407 01145000
*     ENDMSG CHAR(70) BASED;        /* AREA TO FINISH MSG IN         */ 01146000
*                                                                  0407 01147000
*   /*****************************************************************/ 01148000
*   /*                                                               */ 01149000
*   /* MESSAGES UNIQUE TO THE INCLUDED CODE                          */ 01150000
*   /*                                                               */ 01151000
*   /*****************************************************************/ 01152000
*                                                                  0408 01153000
*   DCL                                                            0408 01154000
*     EXITMSG CHAR(34) INIT('FIELD CONTAINS INTERNAL EXIT FLAGS'); 0408 01155000
*   DCL                                                            0409 01156000
*     MODEMSG(8) CHAR(25) INIT('SUPERVISOR CONTROL MODE',          0409 01157000
*         'PHYSICALLY DISABLED STATE','GLOBAL SPIN LOCK HELD',     0409 01158000
*         'GLOBAL SUSPEND LOCK HELD','LOCALLY LOCKED MODE',        0409 01159000
*         'TYPE 1 SVC MODE','SRB MODE','TASK MODE');               0409 01160000
*   DCL                                                            0410 01161000
*     RTARRAY(14) CHAR(50) INIT('PROGRAM CHECK','RESTART','SVC ERROR',  01162000
*         'DAT ERROR','MACHINE CHECK REENTRY',                     0410 01163000
*         'RESCHEDULE OF PAGE I/O ERROR',                          0410 01164000
*         'RESCHEDULE OF ABNORMAL TERMINATION',                    0410 01165000
*         'RESCHEDULE OF ABNORMAL TERMINATION THROUGH CVTBTRM',    0410 01166000
*         'RESCHEDULE OF CROSS MEMORY ABNORMAL TERMINATION',       0410 01167000
*         'RESCHEDULE OF ABNORMAL TERMINATION OF CURRENT TCB',     0410 01168000
*         'MEMORY TERMINATION','CROSS MEMORY ABNORMAL TERMINATION',     01169000
*         'RESCHEDULE OF RTM1 ON OTHER CPU','MACHINE CHECK');      0410 01170000
*   DCL                                                            0411 01171000
*     RTSTART CHAR(17) INIT('RTM1 ENTERED FOR ');                  0411 01172000
*   DCL                                                            0412 01173000
*     SYSTATE CHAR(13) INIT('SYSTEM STATE:');                      0412 01174000
*BYTEMODE:                                                         0413 01175000
*   PROC OPTIONS(SAVE(14));                                        0413 01176000
*                                                                  0413 01177000
BYTEMODE ST    @14,@SA00004                                        0413 01178000
*/********************************************************************/ 01179000
*/* FUNCTION-                                                      0414 01180000
*       ROUTINE TO ANALYZE THE SYSTEM MODE BYTE AND PLACE THE      0414 01181000
*     CORRESPONDING MESSAGE IN THE BUFFER AND PRINT OUT THE DATA.  0414 01182000
*                                                                  0414 01183000
*                                                                  0414 01184000
*   INPUT -                                                        0414 01185000
*       DATAPTR MUST CONTAIN THE ADDRESS OF THE BYTE TO BE ANALYZED     01186000
*     AND REGISTER 1 POINTS TO THE PARMLIST.                       0414 01187000
*                                                                  0414 01188000
*    CALLS-                                                        0414 01189000
*       ANALYZE AND CONVERT                                        0414 01190000
*                                                                  0414 01191000
*    CALLED BY -                                                   0414 01192000
*        EEDBITS, IEAFTESA, RT1BITS TO ANALYZE THE MODE BYTE       0414 01193000
*                                                                  0414 01194000
*    RETURNS TO -                                                  0414 01195000
*        CALLER WITHOUT SETTING A RETURN CODE                      0414 01196000
*                                                                  0414 01197000
*   THIS PROCEDURE HAS BEEN INCLUDED FROM SYSLIB(IHAFTCD1) ------  0414 01198000
*                                                                    */ 01199000
*/********************************************************************/ 01200000
*                                                                  0414 01201000
*   BUFFER(8:(LENGTH(SYSTATE)+7))=SYSTATE;/* BEGINNING OF MESSAGE    */ 01202000
         L     @14,ADPLBUF(,ABDPLPTR)                              0414 01203000
         MVC   BUFFER+7(13,@14),SYSTATE                            0414 01204000
*   ADPLCOM2=ADDR(SUMMARY);         /* SUMMARY PTR IN PARMLIST       */ 01205000
         LA    @14,SUMMARY                                         0415 01206000
         ST    @14,ADPLCOM2(,ABDPLPTR)                             0415 01207000
*   BYTEADDR=ADDR(DATABYTE);        /* ADDR OF BYTE TO BE RESOLVED   */ 01208000
         ST    DATAPTR,BYTEADDR                                    0416 01209000
*   MSGADDR=ADDR(MODEMSG);          /* MESSAGE ARRAY                 */ 01210000
         LA    @14,MODEMSG                                         0417 01211000
         ST    @14,MSGADDR                                         0417 01212000
*   MSGLNGTH=LENGTH(MODEMSG);       /* MSG ARRAY LENGTH              */ 01213000
         MVC   MSGLNGTH(4),@CF01445                                0418 01214000
*   CALL CONVERT;                   /* GENERATE OFFSET               */ 01215000
         BAL   @14,CONVERT                                         0419 01216000
*   OFFSET=CONVERTD;                /* PUT OFFSET IN BUFFER          */ 01217000
         L     @14,ADPLBUF(,ABDPLPTR)                              0420 01218000
         MVC   OFFSET(6,@14),CONVERTD                              0420 01219000
*   COLNUM=22;                      /* WHERE IN BUFFER TO START      */ 01220000
         MVC   COLNUM(4),@CF01486                                  0421 01221000
*   CALL ANALYZE;                   /* ANALYZE THE BYTE ANALYZE BYTE */ 01222000
         BAL   @14,ANALYZE                                         0422 01223000
*   END BYTEMODE;                                                  0423 01224000
@EL00004 DS    0H                                                  0423 01225000
@EF00004 DS    0H                                                  0423 01226000
@ER00004 L     @14,@SA00004                                        0423 01227000
         BR    @14                                                 0423 01228000
*ENTRYRT1:                                                         0424 01229000
*   PROC OPTIONS(SAVE(14));                                        0424 01230000
*                                                                  0424 01231000
ENTRYRT1 ST    @14,@SA00005                                        0424 01232000
*/********************************************************************/ 01233000
*/* FUNCTION-                                                      0425 01234000
*       ROUTINE TO ANALYZE THE RTM1 ENTRY POINT CODE AND FILL IN   0425 01235000
*     THE BUFFER WITH THE APPROPRIATE MESSAGE. IT ALSO FILLS IN    0425 01236000
*     THE OFFSET TO BE PLACED ALONG SIDE THE MESSAGE.              0425 01237000
*                                                                  0425 01238000
*                                                                  0425 01239000
*   INPUT -                                                        0425 01240000
*       DATAPTR MUST CONTAIN THE ADDRESS OF THE BYTE TO BE ANALYZED     01241000
*     AND REGISTER 1 POINTS TO THE PARMLIST PASSED BY THE CALLER.  0425 01242000
*                                                                  0425 01243000
*    CALLS-                                                        0425 01244000
*       CONVERT                                                    0425 01245000
*                                                                  0425 01246000
*    CALLED BY -                                                   0425 01247000
*        EEDBITS, RT1BITS TO ANALYZE ENTRY TO RT1 REASON BYTE      0425 01248000
*                                                                  0425 01249000
*    RETURNS TO -                                                  0425 01250000
*        CALLER WITHOUT SETTING A RETURN CODE                      0425 01251000
*                                                                  0425 01252000
*   THIS PROCEDURE HAS BEEN INCLUDED FROM SYSLIB(IHAFTCD1) ------  0425 01253000
*                                                                    */ 01254000
*/********************************************************************/ 01255000
*                                                                  0425 01256000
*   CALL CONVERT;                   /* GENERATE OFFSET               */ 01257000
         BAL   @14,CONVERT                                         0425 01258000
*   OFFSET=CONVERTD;                /* PLACE IN BUFFER               */ 01259000
         L     @14,ADPLBUF(,ABDPLPTR)                              0426 01260000
         MVC   OFFSET(6,@14),CONVERTD                              0426 01261000
*   IF DATABYTE>RT1WMACH THEN       /* FIELD CONTAINS EXIT FLAGS     */ 01262000
         CLI   DATABYTE(DATAPTR),20                                0427 01263000
         BNH   @RF00427                                            0427 01264000
*     BUFFER(8:(LENGTH(EXITMSG)+7))=EXITMSG;                       0428 01265000
         MVC   BUFFER+7(34,@14),EXITMSG                            0428 01266000
*   ELSE                                                           0429 01267000
*     DO;                           /* WAS NOT EXIT FLAGS            */ 01268000
         B     @RC00427                                            0429 01269000
@RF00427 DS    0H                                                  0430 01270000
*       BUFFER(8:(LENGTH(RTSTART)+7))=RTSTART;/* FILL IN BEGINNING OF   01271000
*                                      BUFFER                        */ 01272000
         L     @14,ADPLBUF(,ABDPLPTR)                              0430 01273000
         MVC   BUFFER+7(17,@14),RTSTART                            0430 01274000
*       RFY                                                        0431 01275000
*         ENDMSG BASED(ADDR(BUFFER)+LENGTH(RTSTART)+8);            0431 01276000
*       IF DATABYTE<=RT1WMCHR THEN  /* FIRST 5 CORRESPOND TO ARRAY   */ 01277000
         CLI   DATABYTE(DATAPTR),5                                 0432 01278000
         BH    @RF00432                                            0432 01279000
*         ENDMSG=RTARRAY(DATABYTE); /* END OF MESSAGE                */ 01280000
         MVI   ENDMSG+75(@14),C' '                                 0433 01281000
         MVC   ENDMSG+76(19,@14),ENDMSG+75(@14)                    0433 01282000
         SLR   @06,@06                                             0433 01283000
         IC    @06,DATABYTE(,DATAPTR)                              0433 01284000
         MH    @06,@CH02004                                        0433 01285000
         LA    @04,RTARRAY-50(@06)                                 0433 01286000
         MVC   ENDMSG+25(50,@14),0(@04)                            0433 01287000
*       ELSE                        /* NOT OF FIRST 5                */ 01288000
*         IF DATABYTE<=RSCHDCPU THEN/* NEXT BATCH OF VALUES          */ 01289000
         B     @RC00432                                            0434 01290000
@RF00432 CLI   DATABYTE(DATAPTR),17                                0434 01291000
         BH    @RF00434                                            0434 01292000
*           ENDMSG=RTARRAY(DATABYTE-'04'X);/* CORRESPONDING ARRAY  0435 01293000
*                                      VALUE                         */ 01294000
         L     @14,ADPLBUF(,ABDPLPTR)                              0435 01295000
         MVI   ENDMSG+75(@14),C' '                                 0435 01296000
         MVC   ENDMSG+76(19,@14),ENDMSG+75(@14)                    0435 01297000
         SLR   @06,@06                                             0435 01298000
         IC    @06,DATABYTE(,DATAPTR)                              0435 01299000
         MH    @06,@CH02004                                        0435 01300000
         LA    @04,RTARRAY-250(@06)                                0435 01301000
         MVC   ENDMSG+25(50,@14),0(@04)                            0435 01302000
*         ELSE                                                     0436 01303000
*           ENDMSG=RTARRAY(DIM(RTARRAY));/* LAST MESSAGE             */ 01304000
         B     @RC00434                                            0436 01305000
@RF00434 L     @14,ADPLBUF(,ABDPLPTR)                              0436 01306000
         MVI   ENDMSG+75(@14),C' '                                 0436 01307000
         MVC   ENDMSG+76(19,@14),ENDMSG+75(@14)                    0436 01308000
         MVC   ENDMSG+25(50,@14),RTARRAY+650                       0436 01309000
*     END;                          /* END DID NOT CONTAIN EXIT FLAGS*/ 01310000
*   END ENTRYRT1;                                                  0438 01311000
@EL00005 DS    0H                                                  0438 01312000
@EF00005 DS    0H                                                  0438 01313000
@ER00005 L     @14,@SA00005                                        0438 01314000
         BR    @14                                                 0438 01315000
*                                                                  0439 01316000
*/********************************************************************/ 01317000
*/*                                                                  */ 01318000
*/*         THE FOLLOWING CODE HAS BEEN INCLUDED FROM SYSLIB MEMBER  */ 01319000
*/*     IHAFTCDE INTO THE MODULE. THE CODE IS COMMON AMONG ALL THE   */ 01320000
*/*     CONTROL BLOCK FORMAT MODULES FOR THE RTM FORMATTER. THE      */ 01321000
*/*     INCLUDED CODE CONSISTS OF THE ACCESS, FORMAT, CONVERT,       */ 01322000
*/*     AND ANALYZE ROUTINES USED BY ALL THE MODULES.                */ 01323000
*/*         THE CODE HAS BEEN INCLUDED IN ORDER TO SIMPLIFY          */ 01324000
*/*     MAINTENANCE BY HAVING THE CODE IN ONLY ONE PLACE INSTEAD     */ 01325000
*/*     OF DUPLICATING IT IN EACH MODULE.                            */ 01326000
*/********************************************************************/ 01327000
*                                                                  0439 01328000
*                                                                  0439 01329000
*   /*****************************************************************/ 01330000
*   /*                                                               */ 01331000
*   /* WORK AREAS UNIQUE TO THE INCLUDED CODE FROM IHAFTCDE          */ 01332000
*   /*                                                               */ 01333000
*   /*****************************************************************/ 01334000
*                                                                  0439 01335000
*   DCL                                                            0439 01336000
*     BITSTR BIT(8) BASED(BYTEADDR);/* BYTE TO BE ANALYZED           */ 01337000
*   DCL                                                            0440 01338000
*     BLANKS CHAR(120) INIT(' ');   /* USED TO BLANK OUT DIGIT FIELD    01339000
*                                      OR TO COMPARE WITH THE MESSAGE   01340000
*                                      ARRAYS FOR BLANK LINES        */ 01341000
*   DCL                                                            0441 01342000
*     BYTELNTH FIXED(31) CONSTANT(8);/* NUM BITS IN A BYTE           */ 01343000
*   DCL                                                            0442 01344000
*     CONVRT FIXED(31);             /* VALUE OF OFFSET               */ 01345000
*   DCL                                                            0443 01346000
*     INDEX FIXED(31);              /* LOOP COUNTER FOR ANALYZE    0443 01347000
*                                      ROUTINE                       */ 01348000
*   DCL                                                            0444 01349000
*     LNGTHEQU FIXED(31);           /* CALCULATE SUBSTRING ADR FOR 0444 01350000
*                                      PROPER MSG                    */ 01351000
*   DCL                                                            0445 01352000
*     MSG CHAR(120) BASED(ADPLCOM1);/* ERROR MSG TO BE PUT OUT BY  0445 01353000
*                                      FORMAT ROUTINE ERROR          */ 01354000
*   DCL                                                            0446 01355000
*     MSGARY CHAR(*) BASED(MSGADDR);/* MESSAGES PASSED TO BE OUTPUT  */ 01356000
*   DCL                                                            0447 01357000
*     NEGBIT BIT(1);                /* FLAG TO INDICATE NEG OFFSET   */ 01358000
*   DCL                                                            0448 01359000
*     NEGCHAR CHAR(1) CONSTANT('-');/* CONSTANT '-' TO BE PUT IN   0448 01360000
*                                      OFFSET                        */ 01361000
*   DCL                                                            0449 01362000
*     PLUSCHAR CHAR(1) CONSTANT('+');/* CONSTANT '+' TO BE PUT IN  0449 01363000
*                                      OFFSET                        */ 01364000
*   DCL                                                            0450 01365000
*     TESTBITS(8) BIT(8) INIT('80'X,'40'X,'20'X,'10'X,'08'X,'04'X,'02'X 01366000
*         ,'01'X);                  /* TO TELL WHICH BIT IS ON       */ 01367000
*   DCL                                                            0451 01368000
*     TWODGT FIXED(31) CONSTANT(16);/* FIRST OF 2 HEX DIGITS         */ 01369000
*   DCL                                                            0452 01370000
*     THREDGT FIXED(31) CONSTANT(256);/* FIRST OF 3 HEX DIGITS       */ 01371000
*   DCL                                                            0453 01372000
*     FOURDGT FIXED(31) CONSTANT(4096);/* FIRST OF 4 HEX DIGITS      */ 01373000
*CONVERT:                                                          0454 01374000
*   PROC OPTIONS(SAVE(14));                                        0454 01375000
*                                                                  0454 01376000
CONVERT  ST    @14,12(,@13)                                        0454 01377000
*/********************************************************************/ 01378000
*/* FUNCTION -                                                     0455 01379000
*      ROUTINE TO DYNAMICALLY GENERATE THE OFFSETS TO BE PUT ALONGSIDE  01380000
*      THE CONTROL BLOCK LINE.  IT FIGURES THE OFFSET FROM THE     0455 01381000
*      BEGINNING OF THE CONTROL BLOCK, CONVERTS IT TO PRINTABLE HEX,    01382000
*      PLACES IT INTO A BUFFER AREA AND PUTS THE ADDRESS OF THIS   0455 01383000
*      BUFFER AREA INTO THE PARAMETER LIST TO BE PICKED UP IN THE  0455 01384000
*      FORMAT PATTERNS BY THE FORMAT SERVICE ROUTINE.              0455 01385000
*                                                                  0455 01386000
*   INPUT -                                                        0455 01387000
*      SAVEPTR MUST HAVE THE ADDRESS OF THE BEGINNING OF THE CONTROL    01388000
*      BLOCK, REGISTER 1 POINTS TO THE PARMLIST WHICH CONTAINS THE 0455 01389000
*      CURRENT CONTROL BLOCK ADDRESS IN ADPLFMT2.                  0455 01390000
*                                                                  0455 01391000
*   CALLS -                                                        0455 01392000
*      MAKES NO OUTSIDE CALLS                                      0455 01393000
*                                                                  0455 01394000
*   CALLED BY -                                                    0455 01395000
*      BYTEMODE, EEDBITS, ENTRYRT1, IEAFTEED, IEAFTESA, IEAFTFRR,  0455 01396000
*      IEAFTIHS, IEAFTRTC, IEAFTRT2, IEAFTSCB, IEAFTSDW, RT1BITS,  0455 01397000
*      RT2BITS, RT2SUM, AND SPECIAL                                0455 01398000
*                                                                  0455 01399000
*   RETURNS TO -                                                   0455 01400000
*      CALLER.                                                     0455 01401000
*                                                                  0455 01402000
*   THIS PROCEDURE HAS BEEN INCLUDED FROM SYSLIB(IHAFTCDE) ------  0455 01403000
*                                                                    */ 01404000
*/********************************************************************/ 01405000
*                                                                  0455 01406000
*   IF SAVEPTR>ADPLFMT2 THEN        /* THIS WILL OCCUR FOR A PREFIX     01407000
*                                      WITH A NEGATIVE OFFSET        */ 01408000
         L     @14,SAVEPTR                                         0455 01409000
         L     @04,ADPLFMT2(,ABDPLPTR)                             0455 01410000
         CR    @14,@04                                             0455 01411000
         BNH   @RF00455                                            0455 01412000
*     DO;                                                          0456 01413000
*       NEGBIT=ON;                  /* INDICATE NEGATIVE OFFSET      */ 01414000
         OI    NEGBIT,B'10000000'                                  0457 01415000
*       CONVRT=SAVEPTR-ADPLFMT2;    /* NEGATIVE OFFSET VALUE         */ 01416000
         SLR   @14,@04                                             0458 01417000
         ST    @14,CONVRT                                          0458 01418000
*     END;                          /* END NEGATIVE OFFSET           */ 01419000
*   ELSE                            /* POSITIVE OR ZERO OFFSET       */ 01420000
*     DO;                                                          0460 01421000
         B     @RC00455                                            0460 01422000
@RF00455 DS    0H                                                  0461 01423000
*       NEGBIT=OFF;                 /* INDICATE POS VALUE            */ 01424000
         NI    NEGBIT,B'01111111'                                  0461 01425000
*       CONVRT=ADPLFMT2-SAVEPTR;    /* RELATIVE OFFSET IN CONTROL  0462 01426000
*                                      BLOCK                         */ 01427000
         L     @14,ADPLFMT2(,ABDPLPTR)                             0462 01428000
         SL    @14,SAVEPTR                                         0462 01429000
         ST    @14,CONVRT                                          0462 01430000
*     END;                          /* END POS VALUE                 */ 01431000
*   DIGIT=BLANKS(1:5);              /* BLANK OUT DIGITS              */ 01432000
@RC00455 MVC   DIGIT(5),BLANKS                                     0464 01433000
*   PACKAREA=CONVRT;                /* PLACE OFFSET INTO CHAR AREA 0465 01434000
*                                      FOR THE UNPACK                */ 01435000
         L     @14,CONVRT                                          0465 01436000
         ST    @14,PACKAREA                                        0465 01437000
*   GARBAGE='04'X;                  /* GARBAGE BYTE SO OFFSET WILL 0466 01438000
*                                      UNPACK OK                     */ 01439000
*                                                                  0466 01440000
         MVI   GARBAGE,X'04'                                       0466 01441000
*   /*****************************************************************/ 01442000
*   /*                                                               */ 01443000
*   /* FOR AN ODD NUMBER OF DIGITS THE OUTPUT SHOULD LOOK LIKE +C OR */ 01444000
*   /* +13C. IF THE VALUE WAS UNPACKED DIRECTLY INTO DIGITS THE      */ 01445000
*   /* OUTPUT WOULD HAVE UNWANTED LEADING ZEROS SUCH AS +0C. TO      */ 01446000
*   /* ELIMINATE THIS(ONLY FOR AN ODD NUMBER OF DIGITS) UNPACK ODD   */ 01447000
*   /* NUMBER OF DIGITS INTO CONVERTD WHERE THE LEADING ZERO WILL BE */ 01448000
*   /* OVERWRITTEN BY THE '+' OR '-' SIGN                            */ 01449000
*   /*                                                               */ 01450000
*   /*****************************************************************/ 01451000
*                                                                  0467 01452000
*   IF CONVRT<TWODGT THEN           /* ONLY 1 DIGIT TO OFFSET        */ 01453000
         CH    @14,@CH00718                                        0467 01454000
         BNL   @RF00467                                            0467 01455000
*     UNPK(CONVERTD(1:3),UNPACK(4:5));/* UNPACK ONLY 1 DIGIT AND   0468 01456000
*                                      DUMMY                         */ 01457000
         UNPK  CONVERTD(3),UNPACK+3(2)                             0468 01458000
*   ELSE                                                           0469 01459000
*     IF CONVRT<THREDGT THEN        /* 2 DIGITS TO OFFSET            */ 01460000
         B     @RC00467                                            0469 01461000
@RF00467 L     @14,CONVRT                                          0469 01462000
         CH    @14,@CH00707                                        0469 01463000
         BNL   @RF00469                                            0469 01464000
*       UNPK(DIGIT(1:3),UNPACK(4:5));/* UNPACK LAST 2 DIGITS & DUMMY */ 01465000
         UNPK  DIGIT(3),UNPACK+3(2)                                0470 01466000
*     ELSE                                                         0471 01467000
*       IF CONVRT<FOURDGT THEN      /* 3 DIGITS TO OFFSET            */ 01468000
         B     @RC00469                                            0471 01469000
@RF00469 L     @14,CONVRT                                          0471 01470000
         CH    @14,@CH02080                                        0471 01471000
         BNL   @RF00471                                            0471 01472000
*         UNPK(CONVERTD(1:5),UNPACK(3:5));/* UNPACK LAST 3 DIGITS &     01473000
*                                      DUMMY                         */ 01474000
         UNPK  CONVERTD(5),UNPACK+2(3)                             0472 01475000
*       ELSE                        /* 4 DIGITS (MAX)                */ 01476000
*         UNPK(DIGIT(1:5),UNPACK(3:5));/* LAST 4 DIGITS & DUMMY BYTE */ 01477000
         B     @RC00471                                            0473 01478000
@RF00471 UNPK  DIGIT(5),UNPACK+2(3)                                0473 01479000
*   TR(DIGIT,TRANS);                /* MAKE PRINTABLE                */ 01480000
@RC00471 DS    0H                                                  0474 01481000
@RC00469 DS    0H                                                  0474 01482000
@RC00467 TR    DIGIT(5),TRANS                                      0474 01483000
*   IF NEGBIT=ON THEN               /* WAS A NEGATIVE OFFSET         */ 01484000
         TM    NEGBIT,B'10000000'                                  0475 01485000
         BNO   @RF00475                                            0475 01486000
*     PLUS=NEGCHAR;                 /* MINUS SIGN                    */ 01487000
         MVI   PLUS,C'-'                                           0476 01488000
*   ELSE                            /* POSITIVE OFFSET               */ 01489000
*     PLUS=PLUSCHAR;                /* MOVE IN PLUS SIGN             */ 01490000
         B     @RC00475                                            0477 01491000
@RF00475 MVI   PLUS,C'+'                                           0477 01492000
*   ADPLFMT1=ADDR(CONVERTD);        /* SET UP FOR FORMAT             */ 01493000
@RC00475 LA    @14,CONVERTD                                        0478 01494000
         ST    @14,ADPLFMT1(,ABDPLPTR)                             0478 01495000
*   END CONVERT;                                                   0479 01496000
@EL00006 DS    0H                                                  0479 01497000
@EF00006 DS    0H                                                  0479 01498000
@ER00006 L     @14,12(,@13)                                        0479 01499000
         BR    @14                                                 0479 01500000
*FMTRTN:                                                           0480 01501000
*   PROC OPTIONS(SAVE(14));                                        0480 01502000
*                                                                  0480 01503000
FMTRTN   ST    @14,@SA00007                                        0480 01504000
*/****************************************************************** */ 01505000
*/* FUNCTION                                                       0481 01506000
*       ROUTINE TO SET UP CALLING OF THE FORMAT SERVICE ROUTINE PASSED  01507000
*     IN THE PARMLIST AND CHECKS RETURN CODE.  IF A RETURN CODE IS BAD  01508000
*     IT TAKES THE MESSAGE WHOSE ADDRESS IS IN ADPLCOM1. AND PUTS IT    01509000
*     IN THE BUFFER AND PRINTS IT. IT SETS THE ERRSW TO INDICATE BAD    01510000
*     RETURN CODE AND RETURNS. IF THE RETURN CODE WAS GOOD, IT PRINTS   01511000
*     THE FORMATTED LINE.                                          0481 01512000
*                                                                  0481 01513000
*   CALLS-                                                         0481 01514000
*       CALLS FORMAT AND PRINT                                     0481 01515000
*                                                                  0481 01516000
*   INPUT -                                                        0481 01517000
*     LINEPTR(REGISTER 0) HAS THE ADDRESS OF THE FORMAT PATTERN TO BE   01518000
*    PASSED TO THE FORMAT SERVICE ROUTINE. ADPLFMT2 CONTAINS THE CURREN 01519000
*    ADDRESS OF THE CONTROL BLOCK TO BE FORMATTED AND ,IN MOST CASES,   01520000
*    ADPLFMT1 CONTAINS THE ADDRESS OF THE FIELD 'CONVERTD' WHICH IS     01521000
*    THE EBCDIC REPRESENTATION OF THE OFFSET TO BE PLACED ALONG SIDE    01522000
*    THE OUTPUT LINE.                                              0481 01523000
*                                                                  0481 01524000
*   CALLED BY -                                                    0481 01525000
*     IEAFTEED,IEAFTFRR,IEAFTIHS,IEAFTRTC,IEAFTRT2,IEAFTSCB,       0481 01526000
*     IEAFTSDW, RT2SUM,AND SPECIAL                                 0481 01527000
*                                                                  0481 01528000
*   RETURNS CONTROL TO -                                           0481 01529000
*     CALLER WITH RETURN CODE RECIEVED FROM FORMAT                 0481 01530000
*     SERVICE ROUTINE                                              0481 01531000
*                                                                  0481 01532000
*   THIS PROCEDURE HAS BEEN INCLUDED FROM SYSLIB(IHAFTCDE) ------  0481 01533000
*                                                                    */ 01534000
*/****************************************************************** */ 01535000
*                                                                  0481 01536000
*   IF ADPLSNPR=OFF THEN            /* IF SNAP IS THE CALLER, AN   0481 01537000
*                                      ACCESS ERROR CAN BE EXPECTED  */ 01538000
         TM    ADPLSNPR(ABDPLPTR),B'10000000'                      0481 01539000
         BNZ   @RF00481                                            0481 01540000
*     DO;                                                          0482 01541000
*       RTYADR=ADDR(FMTRTY);        /* WHERE TO RETRY                */ 01542000
         LA    @14,FMTRTY                                          0483 01543000
         ST    @14,RTYADR(,ESTAPTR)                                0483 01544000
*       ERREXP=ON;                  /* INDICATE AN ERROR IS EXPECTED */ 01545000
         OI    ERREXP(ESTAPTR),B'10000000'                         0484 01546000
*     END;                          /* END SNAP IS THE CALLER        */ 01547000
*   ELSE                                                           0486 01548000
*     ;                             /* SNAP WAS NOT INVOKER          */ 01549000
@RF00481 DS    0H                                                  0487 01550000
*   CALL FORMAT;                    /* FORMAT ROUTINE PASSED BY    0487 01551000
*                                      CALLER                        */ 01552000
         L     @15,ADPLFRMT(,ABDPLPTR)                             0487 01553000
         BALR  @14,@15                                             0487 01554000
*   ERREXP=OFF;                     /* ERROR IS NO LONGER EXPECTED   */ 01555000
         NI    ERREXP(ESTAPTR),B'01111111'                         0488 01556000
*   IF RCREG^=ZERO THEN                                            0489 01557000
         LTR   RCREG,RCREG                                         0489 01558000
         BZ    @RF00489                                            0489 01559000
*     DO;                           /* FORMAT ROUTINE ERROR          */ 01560000
*FMTRTY:                            /* RETRY POINT FROM ERROR        */ 01561000
*       ERRSW=ON;                   /* SET ERROR INDICATOR           */ 01562000
FMTRTY   OI    ERRSW,B'01000000'                                   0491 01563000
*       CALL PRINT;                 /* SPACE A LINE                  */ 01564000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0492 01565000
         BALR  @14,@15                                             0492 01566000
*       BUFFER=MSG;                 /* ERROR MSG PASSED BY CALLER  0493 01567000
*                                      WHOSE ADDR IS PLACED IN     0493 01568000
*                                      ADPLCOM1                      */ 01569000
         L     @14,ADPLBUF(,ABDPLPTR)                              0493 01570000
         L     @04,ADPLCOM1(,ABDPLPTR)                             0493 01571000
         MVC   BUFFER(120,@14),MSG(@04)                            0493 01572000
*       RCREG=4;                    /* INDICATE BAD RETURN CODE FROM    01573000
*                                      FORMATTER                     */ 01574000
         LA    RCREG,4                                             0494 01575000
*     END;                          /* END FORMAT ROUTINE ERROR      */ 01576000
*   ELSE                                                           0496 01577000
*     ;                             /* FORMATTED LINE IS IN BUFFER   */ 01578000
@RF00489 DS    0H                                                  0497 01579000
*   RCCODE=RCREG;                   /* SAVE RETURN CODE FROM FORMAT     01580000
*                                      SERVICE ROUTINE               */ 01581000
         ST    RCREG,RCCODE                                        0497 01582000
*   CALL PRINT;                     /* PRINT THE ERROR MSG OR      0498 01583000
*                                      FORMATTED LINE                */ 01584000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0498 01585000
         BALR  @14,@15                                             0498 01586000
*   RETURN CODE(RCCODE);                                           0499 01587000
         L     @15,RCCODE                                          0499 01588000
@EL00007 DS    0H                                                  0499 01589000
@EF00007 DS    0H                                                  0499 01590000
@ER00007 L     @14,@SA00007                                        0499 01591000
         BR    @14                                                 0499 01592000
*   END FMTRTN;                                                    0500 01593000
*ANALYZE:                                                          0501 01594000
*   PROC OPTIONS(SAVE(14));                                        0501 01595000
*                                                                  0501 01596000
ANALYZE  ST    @14,@SA00008                                        0501 01597000
*/****************************************************************** */ 01598000
*/* FUNCTION                                                       0502 01599000
*     ROUTINE TO ANALYZE THE BITS IN THE BYTE PASSED AND PRINT OUT 0502 01600000
*     THE MESSAGE THAT CORRESPONDS TO THE BITS THAT ARE ON. IF A BLANK  01601000
*     LINE IS PASSED IN THE MESSAGE ARRAY (INDICATING A RESERVED BIT)   01602000
*     NO OUTPUT WILL CORRESPOND TO THAT BIT.                       0502 01603000
*                                                                  0502 01604000
*   INPUT-                                                         0502 01605000
*     AN ARRAY (SUMMARY) POINTED TO BY THE PARMLIST FIELD          0502 01606000
*     ADPLCOM2 WHICH CONTAINS THE ADDRESS OF THE BYTE TO BE        0502 01607000
*     ANALYZED, THE ADDRESS OF THE ARRAY OF CORRESPONDING          0502 01608000
*     MESSAGES, THE COLUMN NUMBER THE MESSAGE IS TO BEGIN IN,      0502 01609000
*     AND THE LENGTH OF THE MESSAGE ARRAY PASSED.                  0502 01610000
*                                                                  0502 01611000
*   NOTE- COLNUM + MSGLNGTH MUST BE LESS THAN OR EQUAL TO 120 BYTES     01612000
*         WHICH IS THE OUTPUT BUFFER LENGTH.                       0502 01613000
*                                                                  0502 01614000
*                                                                  0502 01615000
*   CALLS-                                                         0502 01616000
*       CALLS PRINT                                                0502 01617000
*                                                                  0502 01618000
*   CALLED BY -                                                    0502 01619000
*       BYTEMODE,EEDBITS,IEAFTESA,IEAFTSCB,RT2BITS                 0502 01620000
*                                                                  0502 01621000
*   RETURNS CONTROL TO -                                           0502 01622000
*       CALLER WITHOUT SETTING A RETURN CODE                       0502 01623000
*                                                                  0502 01624000
*   THIS PROCEDURE HAS BEEN INCLUDED FROM SYSLIB(IHAFTCDE)-------  0502 01625000
*                                                                    */ 01626000
*/****************************************************************** */ 01627000
*                                                                  0502 01628000
*   DO INDEX=1 TO BYTELNTH;         /* LOOP TO FIND WHICH BITS ARE ON*/ 01629000
         LA    INDEX,1                                             0502 01630000
@DL00502 DS    0H                                                  0503 01631000
*     LNGTHEQU=((INDEX-1)*(MSGLNGTH)+1);/* OFFSET INTO MSGARY OF   0503 01632000
*                                      CORRESPONDING MESSAGE         */ 01633000
         L     @14,MSGLNGTH                                        0503 01634000
         LR    @03,INDEX                                           0503 01635000
         BCTR  @03,0                                               0503 01636000
         MR    @02,@14                                             0503 01637000
         AH    @03,@CH00041                                        0503 01638000
         LR    LNGTHEQU,@03                                        0503 01639000
*     IF(BITSTR&TESTBITS(INDEX))^=ZEROBYTE&/* FOUND A BIT ON         */ 01640000
*         MSGARY(LNGTHEQU:MSGLNGTH+LNGTHEQU-1)^=BLANKS(1:MSGLNGTH) THEN 01641000
         L     @09,BYTEADDR                                        0504 01642000
         SLR   @04,@04                                             0504 01643000
         IC    @04,BITSTR(,@09)                                    0504 01644000
         SLR   @09,@09                                             0504 01645000
         IC    @09,TESTBITS-1(INDEX)                               0504 01646000
         NR    @04,@09                                             0504 01647000
         SLR   @09,@09                                             0504 01648000
         IC    @09,ZEROBYTE                                        0504 01649000
         CR    @04,@09                                             0504 01650000
         BE    @RF00504                                            0504 01651000
         L     @09,MSGADDR                                         0504 01652000
         LR    @04,@14                                             0504 01653000
         BCTR  @04,0                                               0504 01654000
         LR    @03,@09                                             0504 01655000
         ALR   @03,LNGTHEQU                                        0504 01656000
         BCTR  @03,0                                               0504 01657000
         EX    @04,@SC02114                                        0504 01658000
         BE    @RF00504                                            0504 01659000
*       DO;                         /* CORRESPONDING MESSAGE WAS NOT    01660000
*                                      BLANK(RESERVED)               */ 01661000
*         BUFFER(COLNUM:(MSGLNGTH+COLNUM-1))=MSGARY(LNGTHEQU:LNGTHEQU+  01662000
*             MSGLNGTH-1);          /* PLACE MSG IN BUFFER           */ 01663000
         L     @04,COLNUM                                          0506 01664000
         L     @03,ADPLBUF(,ABDPLPTR)                              0506 01665000
         ALR   @03,@04                                             0506 01666000
         BCTR  @03,0                                               0506 01667000
         ALR   @14,@04                                             0506 01668000
         SLR   @14,@04                                             0506 01669000
         BCTR  @14,0                                               0506 01670000
         ALR   @09,LNGTHEQU                                        0506 01671000
         BCTR  @09,0                                               0506 01672000
         EX    @14,@SM02116                                        0506 01673000
*         CALL PRINT;               /* PRINT IT                      */ 01674000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0507 01675000
         BALR  @14,@15                                             0507 01676000
*       END;                        /* END FOUND THE MESSAGE         */ 01677000
*     ELSE                                                         0509 01678000
*       ;                           /* EITHER BIT NOT ON OR RESERVED    01679000
*                                      BIT-NO MESSAGE                */ 01680000
@RF00504 DS    0H                                                  0510 01681000
*   END;                            /* END SEARCH LOOP               */ 01682000
         AH    INDEX,@CH00041                                      0510 01683000
         CH    INDEX,@CH00086                                      0510 01684000
         BNH   @DL00502                                            0510 01685000
*   END ANALYZE;                                                   0511 01686000
@EL00008 DS    0H                                                  0511 01687000
@EF00008 DS    0H                                                  0511 01688000
@ER00008 L     @14,@SA00008                                        0511 01689000
         BR    @14                                                 0511 01690000
*ACCESRTN:                                                         0512 01691000
*   PROC OPTIONS(SAVE(14));                                        0512 01692000
*                                                                  0512 01693000
ACCESRTN ST    @14,@SA00009                                        0512 01694000
*/********************************************************************/ 01695000
*/* FUNCTION-                                                      0513 01696000
*       ROUTINE WHICH CALLS THE ACCESS SERVICE ROUTINE AND MOVES THE    01697000
*     VALUE RETURNED IN R0 INTO DATAPTR.                           0513 01698000
*                                                                  0513 01699000
*                                                                  0513 01700000
*   INPUT -                                                        0513 01701000
*         VADR(REGISTER 0) CONTAINS THE VIRTUAL ADDRESS OF THE FIELD    01702000
*         TO BE ACCESSED.                                          0513 01703000
*                                                                  0513 01704000
*    CALLS-                                                        0513 01705000
*         ACCESS SERVICE ROUTINE PASSED IN PARMLIST                0513 01706000
*                                                                  0513 01707000
*    CALLED BY -                                                   0513 01708000
*         EEDBITS, IEAFTEED, IEAFTFRR, IEAFTRTC, IEAFTRT2,         0513 01709000
*         IEAFTSCB, RT1BITS, AND RT2BITS                           0513 01710000
*                                                                  0513 01711000
*    RETURNS TO -                                                  0513 01712000
*         CALLER WITH THE RETURN CODE SET BY THE ACCESS            0513 01713000
*         SERVICE ROUTINE.                                         0513 01714000
*                                                                  0513 01715000
*   THIS PROCEDURE HAS BEEN INCLUDED FROM SYSLIB(IHAFTCDE) ------  0513 01716000
*                                                                    */ 01717000
*/********************************************************************/ 01718000
*                                                                  0513 01719000
*   IF ADPLSNPR=OFF THEN            /* SNAP WAS INVOKER              */ 01720000
         TM    ADPLSNPR(ABDPLPTR),B'10000000'                      0513 01721000
         BNZ   @RF00513                                            0513 01722000
*     DO;                                                          0514 01723000
*       RTYADR=ADDR(RETRY);         /* RETRY ADDR FOR ESTAE IN THE 0515 01724000
*                                      CASE OF EXPECTED ERRORS       */ 01725000
         LA    @14,RETRY                                           0515 01726000
         ST    @14,RTYADR(,ESTAPTR)                                0515 01727000
*       DATAPTR=VADR;               /* USED TO BASE THE STORAGE ON   */ 01728000
         LR    DATAPTR,VADR                                        0516 01729000
*       RCREG=ZERO;                 /* SUCCESS UNLESS AN ABEND OCCURS   01730000
*                                      DURING THE MOVE INTO A BUFFER */ 01731000
         SLR   RCREG,RCREG                                         0517 01732000
*       ERREXP=ON;                  /* AN ERROR IS EXPECTED          */ 01733000
         OI    ERREXP(ESTAPTR),B'10000000'                         0518 01734000
*       VERIFY=DATADWRD;            /* MOVE A DOUBLE WORD INTO     0519 01735000
*                                      INTERNAL BUFFER               */ 01736000
*                                                                  0519 01737000
         MVC   VERIFY(8),DATADWRD(DATAPTR)                         0519 01738000
*       /*************************************************************/ 01739000
*       /*                                                           */ 01740000
*       /* THIS MOVE WILL CAUSE AN ABEND IF THE DUMP DOES NOT CONTAIN*/ 01741000
*       /* THE AREA REFERENCED OR IF THE AREA IS PROTECTED. IF AN    */ 01742000
*       /* ABEND OCCURS, THE ESTAE WILL GET CONTROL AND RETRY AT THE */ 01743000
*       /* POINT WHICH SETS A BAD RETURN CODE AND RETURNS TO THE     */ 01744000
*       /* CALLER. THIS THEN SIMULATES THE PRINT DUMP ACCESS ROUTINE.*/ 01745000
*       /* IF THE AREA ASKED FOR IS IN THE DUMP, A DOUBLE WORD IS    */ 01746000
*       /* MOVED INTO AN INTERNAL BUFFER TO PREVENT AN UNEXPECTED    */ 01747000
*       /* ERROR WHEN REFERENCING THE AREA AGAIN                     */ 01748000
*       /*                                                           */ 01749000
*       /*************************************************************/ 01750000
*                                                                  0520 01751000
*       ERREXP=OFF;                 /* AN ERROR IS NO LONGER EXPECTED*/ 01752000
         NI    ERREXP(ESTAPTR),B'01111111'                         0520 01753000
*       DATAPTR=ADDR(VERIFY);       /* REBASE DATA OFF INTERNAL    0521 01754000
*                                      BUFFER                        */ 01755000
         LA    DATAPTR,VERIFY                                      0521 01756000
*     END;                          /* END SNAP WAS THE INVOKER      */ 01757000
*   ELSE                            /* CALLER HAS OWN ACCESS ROUTINE    01758000
*                                      LIKE PRINT DUMP               */ 01759000
*     DO;                                                          0523 01760000
         B     @RC00513                                            0523 01761000
@RF00513 DS    0H                                                  0524 01762000
*       CALL ACCESS;                /* ACCESS SERVICE ROUTINE PASSED    01763000
*                                      BY CALLER                     */ 01764000
         L     @15,ADPLMEMA(,ABDPLPTR)                             0524 01765000
         BALR  @14,@15                                             0524 01766000
*       IF RCREG=ZERO THEN                                         0525 01767000
         LTR   RCREG,RCREG                                         0525 01768000
         BNZ   @RF00525                                            0525 01769000
*         DATAPTR=VADR;             /* SAVE PTR RETURNED BY ACCESS 0526 01770000
*                                      SERVICE ROUTINE               */ 01771000
         LR    DATAPTR,VADR                                        0526 01772000
*       ELSE                        /* BAD RETURN CODE               */ 01773000
*RETRY:                             /* RETRY ADDR FOR THE ESTAE      */ 01774000
*         RCREG=4;                  /* SET A BAD RETURN CODE         */ 01775000
         B     @RC00525                                            0527 01776000
@RF00525 DS    0H                                                  0527 01777000
RETRY    LA    RCREG,4                                             0527 01778000
*     END;                          /* END CALLER WAS NOT SNAP       */ 01779000
@RC00525 DS    0H                                                  0529 01780000
*   RCCODE=RCREG;                   /* SAVE RETURN CODE FROM ACCESS     01781000
*                                      SERVICE RTN                   */ 01782000
@RC00513 ST    RCREG,RCCODE                                        0529 01783000
*   RETURN CODE(RCCODE);                                           0530 01784000
         L     @04,RCCODE                                          0530 01785000
         LR    @15,@04                                             0530 01786000
@EL00009 DS    0H                                                  0530 01787000
@EF00009 DS    0H                                                  0530 01788000
@ER00009 L     @14,@SA00009                                        0530 01789000
         BR    @14                                                 0530 01790000
*   END ACCESRTN;                                                  0531 01791000
*   DCL                                                            0532 01792000
*     IHSPATCH CHAR(200) INIT(                                     0532 01793000
*         'PATCH AREA FOR IEAFTIHS - IT IS 200 BYTES LONG');       0532 01794000
*   END IEAFTIHS                                                   0533 01795000
*                                                                  0533 01796000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01797000
*/*%INCLUDE SYSLIB  (IHAABDPL)                                       */ 01798000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 01799000
*/*%INCLUDE SYSLIB  (IHAFRRS )                                       */ 01800000
*/*%INCLUDE SYSLIB  (IHAIHSA )                                       */ 01801000
*/*%INCLUDE SYSLIB  (IHART1W )                                       */ 01802000
*/*%INCLUDE SYSLIB  (IHASUBIT)                                       */ 01803000
*/*%INCLUDE SYSLIB  (IHAFTCD1)                                       */ 01804000
*/*%INCLUDE SYSLIB  (IHAFTCDE)                                       */ 01805000
*                                                                  0533 01806000
*       ;                                                          0533 01807000
@DATA    DS    0H                                                       01808000
@CH00041 DC    H'1'                                                     01809000
@CH00086 DC    H'8'                                                     01810000
@CH00718 DC    H'16'                                                    01811000
@CH02004 DC    H'50'                                                    01812000
@CH00707 DC    H'256'                                                   01813000
@CH02080 DC    H'4096'                                                  01814000
@SC02114 CLC   MSGARY(0,@03),BLANKS                                     01815000
@SM02116 MVC   BUFFER(0,@03),MSGARY(@09)                                01816000
@DATD    DSECT                                                          01817000
         DS    0F                                                       01818000
@SA00001 DS    18F                                                      01819000
@SA00009 DS    1F                                                       01820000
@SA00007 DS    1F                                                       01821000
@SA00002 DS    1F                                                       01822000
@SA00003 DS    1F                                                       01823000
@SA00005 DS    1F                                                       01824000
@SA00004 DS    1F                                                       01825000
@SA00008 DS    1F                                                       01826000
IEAFTIHS CSECT                                                          01827000
         DS    0F                                                       01828000
@CF00080 DC    F'4'                                                     01829000
@CH00080 EQU   @CF00080+2                                               01830000
@CF01486 DC    F'22'                                                    01831000
@CF01445 DC    F'25'                                                    01832000
@CF02109 DC    F'-4'                                                    01833000
@DATD    DSECT                                                          01834000
         DS    0D                                                       01835000
FRRSPTR  DS    A                                                        01836000
FRREPTR  DS    A                                                        01837000
LOOPCNTR DS    F                                                        01838000
RCCODE   DS    F                                                        01839000
RT1PTR   DS    A                                                        01840000
SAVEPTR  DS    A                                                        01841000
CONVRT   DS    F                                                        01842000
BITS     DS    BL1                                                      01843000
         ORG   BITS                                                     01844000
SU50SAVE DS    BL1                                                      01845000
ERRSW    EQU   BITS+0                                                   01846000
@NM00536 EQU   BITS+0                                                   01847000
         ORG   BITS+1                                                   01848000
CONVERTD DS    CL6                                                      01849000
         ORG   CONVERTD                                                 01850000
PLUS     DS    CL1                                                      01851000
DIGIT    DS    CL5                                                      01852000
         ORG   CONVERTD+6                                               01853000
         DS    CL1                                                      01854000
SUMMARY  DS    CL16                                                     01855000
         ORG   SUMMARY                                                  01856000
BYTEADDR DS    AL4                                                      01857000
MSGADDR  DS    AL4                                                      01858000
COLNUM   DS    FL4                                                      01859000
MSGLNGTH DS    FL4                                                      01860000
         ORG   SUMMARY+16                                               01861000
         DS    CL4                                                      01862000
UNPACK   DS    CL5                                                      01863000
         ORG   UNPACK                                                   01864000
PACKAREA DS    CL4                                                      01865000
GARBAGE  DS    CL1                                                      01866000
         ORG   UNPACK+5                                                 01867000
         DS    CL3                                                      01868000
VERIFY   DS    CL8                                                      01869000
NEGBIT   DS    BL1                                                      01870000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01871000
@ENDDATD EQU   *                                                        01872000
IEAFTIHS CSECT                                                          01873000
         DS    0F                                                       01874000
@SIZDATD DC    AL1(0)                                                   01875000
         DC    AL3(@ENDDATD-@DATD)                                      01876000
         DS    0D                                                       01877000
EXITCK   DC    XL1'78'                                                  01878000
MCHCK    DC    XL1'1E'                                                  01879000
RECURCK  DC    XL1'FF'                                                  01880000
RESCHDCK DC    XL1'5E'                                                  01881000
RTRYCK   DC    XL1'5A'                                                  01882000
SRMCK    DC    XL1'3C'                                                  01883000
ZEROBYTE DC    XL1'00'                                                  01884000
IHSAL1   DS    CL18                                                     01885000
         ORG   IHSAL1                                                   01886000
@NM00017 DC    CL4'CPUT'                                                01887000
@NM00018 DC    CL5'NTCBP'                                               01888000
@NM00019 DC    CL5'OTCBP'                                               01889000
@NM00020 DC    CL4'CPSW'                                                01890000
         ORG   IHSAL1+18                                                01891000
         DS    CL3                                                      01892000
IHSAFMT1 DS    CL36                                                     01893000
         ORG   IHSAFMT1                                                 01894000
@NM00021 DS    CL4                                                      01895000
         ORG   @NM00021                                                 01896000
@NM00022 DC    X'01'                                                    01897000
@NM00023 DC    X'40'                                                    01898000
@NM00024 DC    AL1(0)                                                   01899000
@NM00025 DC    AL1(0)                                                   01900000
         ORG   IHSAFMT1+4                                               01901000
@NM00026 DS    CL8                                                      01902000
         ORG   @NM00026                                                 01903000
@NM00027 DC    X'07'                                                    01904000
@NM00028 DC    X'33'                                                    01905000
@NM00029 DC    AL1(8)                                                   01906000
@NM00030 DC    AL1(14)                                                  01907000
@NM00031 DC    AL4(IHSAL1)                                              01908000
         ORG   IHSAFMT1+12                                              01909000
@NM00032 DS    CL4                                                      01910000
         ORG   @NM00032                                                 01911000
@NM00033 DC    X'04'                                                    01912000
@NM00034 DC    X'03'                                                    01913000
@NM00035 DC    AL1(0)                                                   01914000
@NM00036 DC    AL1(23)                                                  01915000
         ORG   IHSAFMT1+16                                              01916000
@NM00037 DS    CL4                                                      01917000
         ORG   @NM00037                                                 01918000
@NM00038 DC    X'05'                                                    01919000
@NM00039 DC    X'43'                                                    01920000
@NM00040 DC    AL1(32)                                                  01921000
@NM00041 DC    AL1(38)                                                  01922000
         ORG   IHSAFMT1+20                                              01923000
@NM00042 DS    CL4                                                      01924000
         ORG   @NM00042                                                 01925000
@NM00043 DC    X'05'                                                    01926000
@NM00044 DC    X'43'                                                    01927000
@NM00045 DC    AL1(47)                                                  01928000
@NM00046 DC    AL1(56)                                                  01929000
         ORG   IHSAFMT1+24                                              01930000
@NM00047 DS    CL4                                                      01931000
         ORG   @NM00047                                                 01932000
@NM00048 DC    X'05'                                                    01933000
@NM00049 DC    X'33'                                                    01934000
@NM00050 DC    AL1(65)                                                  01935000
@NM00051 DC    AL1(74)                                                  01936000
         ORG   IHSAFMT1+28                                              01937000
@NM00052 DS    CL4                                                      01938000
         ORG   @NM00052                                                 01939000
@NM00053 DC    X'04'                                                    01940000
@NM00054 DC    X'03'                                                    01941000
@NM00055 DC    AL1(0)                                                   01942000
@NM00056 DC    AL1(83)                                                  01943000
         ORG   IHSAFMT1+32                                              01944000
@NM00057 DS    CL4                                                      01945000
         ORG   @NM00057                                                 01946000
@NM00058 DC    F'0'                                                     01947000
         ORG   IHSAFMT1+36                                              01948000
IHSAL2   DS    CL26                                                     01949000
         ORG   IHSAL2                                                   01950000
@NM00059 DC    CL8'FLOATING'                                            01951000
@NM00060 DC    CL5'POINT'                                               01952000
@NM00061 DC    CL13'REGS(0,2,4,6)'                                      01953000
         ORG   IHSAL2+26                                                01954000
         DS    CL2                                                      01955000
IHSAFMT2 DS    CL44                                                     01956000
         ORG   IHSAFMT2                                                 01957000
@NM00062 DS    CL4                                                      01958000
         ORG   @NM00062                                                 01959000
@NM00063 DC    X'01'                                                    01960000
@NM00064 DC    X'40'                                                    01961000
@NM00065 DC    AL1(0)                                                   01962000
@NM00066 DC    AL1(0)                                                   01963000
         ORG   IHSAFMT2+4                                               01964000
@NM00067 DS    CL8                                                      01965000
         ORG   @NM00067                                                 01966000
@NM00068 DC    X'07'                                                    01967000
@NM00069 DC    X'73'                                                    01968000
@NM00070 DC    AL1(8)                                                   01969000
@NM00071 DC    AL1(38)                                                  01970000
@NM00072 DC    AL4(IHSAL2)                                              01971000
         ORG   IHSAFMT2+12                                              01972000
@NM00073 DS    CL4                                                      01973000
         ORG   @NM00073                                                 01974000
@NM00074 DC    X'05'                                                    01975000
@NM00075 DC    X'43'                                                    01976000
@NM00076 DC    AL1(17)                                                  01977000
@NM00077 DC    AL1(47)                                                  01978000
         ORG   IHSAFMT2+16                                              01979000
@NM00078 DS    CL4                                                      01980000
         ORG   @NM00078                                                 01981000
@NM00079 DC    X'05'                                                    01982000
@NM00080 DC    X'C3'                                                    01983000
@NM00081 DC    AL1(23)                                                  01984000
@NM00082 DC    AL1(56)                                                  01985000
         ORG   IHSAFMT2+20                                              01986000
@NM00083 DS    CL4                                                      01987000
         ORG   @NM00083                                                 01988000
@NM00084 DC    X'04'                                                    01989000
@NM00085 DC    X'03'                                                    01990000
@NM00086 DC    AL1(0)                                                   01991000
@NM00087 DC    AL1(65)                                                  01992000
         ORG   IHSAFMT2+24                                              01993000
@NM00088 DS    CL4                                                      01994000
         ORG   @NM00088                                                 01995000
@NM00089 DC    X'04'                                                    01996000
@NM00090 DC    X'03'                                                    01997000
@NM00091 DC    AL1(0)                                                   01998000
@NM00092 DC    AL1(74)                                                  01999000
         ORG   IHSAFMT2+28                                              02000000
@NM00093 DS    CL4                                                      02001000
         ORG   @NM00093                                                 02002000
@NM00094 DC    X'04'                                                    02003000
@NM00095 DC    X'03'                                                    02004000
@NM00096 DC    AL1(0)                                                   02005000
@NM00097 DC    AL1(83)                                                  02006000
         ORG   IHSAFMT2+32                                              02007000
@NM00098 DS    CL4                                                      02008000
         ORG   @NM00098                                                 02009000
@NM00099 DC    X'04'                                                    02010000
@NM00100 DC    X'03'                                                    02011000
@NM00101 DC    AL1(0)                                                   02012000
@NM00102 DC    AL1(92)                                                  02013000
         ORG   IHSAFMT2+36                                              02014000
@NM00103 DS    CL4                                                      02015000
         ORG   @NM00103                                                 02016000
@NM00104 DC    X'04'                                                    02017000
@NM00105 DC    X'03'                                                    02018000
@NM00106 DC    AL1(0)                                                   02019000
@NM00107 DC    AL1(101)                                                 02020000
         ORG   IHSAFMT2+40                                              02021000
@NM00108 DS    CL4                                                      02022000
         ORG   @NM00108                                                 02023000
@NM00109 DC    F'0'                                                     02024000
         ORG   IHSAFMT2+44                                              02025000
IHSAL3   DS    CL16                                                     02026000
         ORG   IHSAL3                                                   02027000
@NM00110 DC    CL7'GENERAL'                                             02028000
@NM00111 DC    CL9'REGS(0-F)'                                           02029000
         ORG   IHSAL3+16                                                02030000
IHSAFMT3 DS    CL44                                                     02031000
         ORG   IHSAFMT3                                                 02032000
@NM00112 DS    CL4                                                      02033000
         ORG   @NM00112                                                 02034000
@NM00113 DC    X'01'                                                    02035000
@NM00114 DC    X'40'                                                    02036000
@NM00115 DC    AL1(0)                                                   02037000
@NM00116 DC    AL1(0)                                                   02038000
         ORG   IHSAFMT3+4                                               02039000
@NM00117 DS    CL8                                                      02040000
         ORG   @NM00117                                                 02041000
@NM00118 DC    X'07'                                                    02042000
@NM00119 DC    X'63'                                                    02043000
@NM00120 DC    AL1(8)                                                   02044000
@NM00121 DC    AL1(38)                                                  02045000
@NM00122 DC    AL4(IHSAL3)                                              02046000
         ORG   IHSAFMT3+12                                              02047000
@NM00123 DS    CL4                                                      02048000
         ORG   @NM00123                                                 02049000
@NM00124 DC    X'05'                                                    02050000
@NM00125 DC    X'83'                                                    02051000
@NM00126 DC    AL1(16)                                                  02052000
@NM00127 DC    AL1(47)                                                  02053000
         ORG   IHSAFMT3+16                                              02054000
@NM00128 DS    CL4                                                      02055000
         ORG   @NM00128                                                 02056000
@NM00129 DC    X'04'                                                    02057000
@NM00130 DC    X'03'                                                    02058000
@NM00131 DC    AL1(0)                                                   02059000
@NM00132 DC    AL1(56)                                                  02060000
         ORG   IHSAFMT3+20                                              02061000
@NM00133 DS    CL4                                                      02062000
         ORG   @NM00133                                                 02063000
@NM00134 DC    X'04'                                                    02064000
@NM00135 DC    X'03'                                                    02065000
@NM00136 DC    AL1(0)                                                   02066000
@NM00137 DC    AL1(65)                                                  02067000
         ORG   IHSAFMT3+24                                              02068000
@NM00138 DS    CL4                                                      02069000
         ORG   @NM00138                                                 02070000
@NM00139 DC    X'04'                                                    02071000
@NM00140 DC    X'03'                                                    02072000
@NM00141 DC    AL1(0)                                                   02073000
@NM00142 DC    AL1(74)                                                  02074000
         ORG   IHSAFMT3+28                                              02075000
@NM00143 DS    CL4                                                      02076000
         ORG   @NM00143                                                 02077000
@NM00144 DC    X'04'                                                    02078000
@NM00145 DC    X'03'                                                    02079000
@NM00146 DC    AL1(0)                                                   02080000
@NM00147 DC    AL1(83)                                                  02081000
         ORG   IHSAFMT3+32                                              02082000
@NM00148 DS    CL4                                                      02083000
         ORG   @NM00148                                                 02084000
@NM00149 DC    X'04'                                                    02085000
@NM00150 DC    X'03'                                                    02086000
@NM00151 DC    AL1(0)                                                   02087000
@NM00152 DC    AL1(92)                                                  02088000
         ORG   IHSAFMT3+36                                              02089000
@NM00153 DS    CL4                                                      02090000
         ORG   @NM00153                                                 02091000
@NM00154 DC    X'04'                                                    02092000
@NM00155 DC    X'03'                                                    02093000
@NM00156 DC    AL1(0)                                                   02094000
@NM00157 DC    AL1(101)                                                 02095000
         ORG   IHSAFMT3+40                                              02096000
@NM00158 DS    CL4                                                      02097000
         ORG   @NM00158                                                 02098000
@NM00159 DC    F'0'                                                     02099000
         ORG   IHSAFMT3+44                                              02100000
IHSAFMT4 DS    CL40                                                     02101000
         ORG   IHSAFMT4                                                 02102000
@NM00160 DS    CL4                                                      02103000
         ORG   @NM00160                                                 02104000
@NM00161 DC    X'01'                                                    02105000
@NM00162 DC    X'40'                                                    02106000
@NM00163 DC    AL1(0)                                                   02107000
@NM00164 DC    AL1(0)                                                   02108000
         ORG   IHSAFMT4+4                                               02109000
@NM00165 DS    CL4                                                      02110000
         ORG   @NM00165                                                 02111000
@NM00166 DC    X'04'                                                    02112000
@NM00167 DC    X'03'                                                    02113000
@NM00168 DC    AL1(0)                                                   02114000
@NM00169 DC    AL1(38)                                                  02115000
         ORG   IHSAFMT4+8                                               02116000
@NM00170 DS    CL4                                                      02117000
         ORG   @NM00170                                                 02118000
@NM00171 DC    X'04'                                                    02119000
@NM00172 DC    X'03'                                                    02120000
@NM00173 DC    AL1(0)                                                   02121000
@NM00174 DC    AL1(47)                                                  02122000
         ORG   IHSAFMT4+12                                              02123000
@NM00175 DS    CL4                                                      02124000
         ORG   @NM00175                                                 02125000
@NM00176 DC    X'04'                                                    02126000
@NM00177 DC    X'03'                                                    02127000
@NM00178 DC    AL1(0)                                                   02128000
@NM00179 DC    AL1(56)                                                  02129000
         ORG   IHSAFMT4+16                                              02130000
@NM00180 DS    CL4                                                      02131000
         ORG   @NM00180                                                 02132000
@NM00181 DC    X'04'                                                    02133000
@NM00182 DC    X'03'                                                    02134000
@NM00183 DC    AL1(0)                                                   02135000
@NM00184 DC    AL1(65)                                                  02136000
         ORG   IHSAFMT4+20                                              02137000
@NM00185 DS    CL4                                                      02138000
         ORG   @NM00185                                                 02139000
@NM00186 DC    X'04'                                                    02140000
@NM00187 DC    X'03'                                                    02141000
@NM00188 DC    AL1(0)                                                   02142000
@NM00189 DC    AL1(74)                                                  02143000
         ORG   IHSAFMT4+24                                              02144000
@NM00190 DS    CL4                                                      02145000
         ORG   @NM00190                                                 02146000
@NM00191 DC    X'04'                                                    02147000
@NM00192 DC    X'03'                                                    02148000
@NM00193 DC    AL1(0)                                                   02149000
@NM00194 DC    AL1(83)                                                  02150000
         ORG   IHSAFMT4+28                                              02151000
@NM00195 DS    CL4                                                      02152000
         ORG   @NM00195                                                 02153000
@NM00196 DC    X'04'                                                    02154000
@NM00197 DC    X'03'                                                    02155000
@NM00198 DC    AL1(0)                                                   02156000
@NM00199 DC    AL1(92)                                                  02157000
         ORG   IHSAFMT4+32                                              02158000
@NM00200 DS    CL4                                                      02159000
         ORG   @NM00200                                                 02160000
@NM00201 DC    X'04'                                                    02161000
@NM00202 DC    X'03'                                                    02162000
@NM00203 DC    AL1(0)                                                   02163000
@NM00204 DC    AL1(101)                                                 02164000
         ORG   IHSAFMT4+36                                              02165000
@NM00205 DS    CL4                                                      02166000
         ORG   @NM00205                                                 02167000
@NM00206 DC    F'0'                                                     02168000
         ORG   IHSAFMT4+40                                              02169000
SU50L1   DS    CL19                                                     02170000
         ORG   SU50L1                                                   02171000
@NM00207 DC    CL8'RESERVED'                                            02172000
@NM00208 DC    CL4'FRRL'                                                02173000
@NM00209 DC    CL7'CURRENT'                                             02174000
         ORG   SU50L1+19                                                02175000
         DS    CL1                                                      02176000
SU50FMT1 DS    CL28                                                     02177000
         ORG   SU50FMT1                                                 02178000
@NM00210 DS    CL4                                                      02179000
         ORG   @NM00210                                                 02180000
@NM00211 DC    X'01'                                                    02181000
@NM00212 DC    X'40'                                                    02182000
@NM00213 DC    AL1(0)                                                   02183000
@NM00214 DC    AL1(0)                                                   02184000
         ORG   SU50FMT1+4                                               02185000
@NM00215 DS    CL8                                                      02186000
         ORG   @NM00215                                                 02187000
@NM00216 DC    X'07'                                                    02188000
@NM00217 DC    X'73'                                                    02189000
@NM00218 DC    AL1(8)                                                   02190000
@NM00219 DC    AL1(17)                                                  02191000
@NM00220 DC    AL4(SU50L1)                                              02192000
         ORG   SU50FMT1+12                                              02193000
@NM00221 DS    CL4                                                      02194000
         ORG   @NM00221                                                 02195000
@NM00222 DC    X'04'                                                    02196000
@NM00223 DC    X'03'                                                    02197000
@NM00224 DC    AL1(0)                                                   02198000
@NM00225 DC    AL1(26)                                                  02199000
         ORG   SU50FMT1+16                                              02200000
@NM00226 DS    CL4                                                      02201000
         ORG   @NM00226                                                 02202000
@NM00227 DC    X'05'                                                    02203000
@NM00228 DC    X'33'                                                    02204000
@NM00229 DC    AL1(35)                                                  02205000
@NM00230 DC    AL1(44)                                                  02206000
         ORG   SU50FMT1+20                                              02207000
@NM00231 DS    CL4                                                      02208000
         ORG   @NM00231                                                 02209000
@NM00232 DC    X'05'                                                    02210000
@NM00233 DC    X'63'                                                    02211000
@NM00234 DC    AL1(53)                                                  02212000
@NM00235 DC    AL1(62)                                                  02213000
         ORG   SU50FMT1+24                                              02214000
@NM00236 DS    CL4                                                      02215000
         ORG   @NM00236                                                 02216000
@NM00237 DC    F'0'                                                     02217000
         ORG   SU50FMT1+28                                              02218000
FRRSL1   DS    CL24                                                     02219000
         ORG   FRRSL1                                                   02220000
@NM00238 DC    CL7'FRRSEMP'                                             02221000
@NM00239 DC    CL4'LAST'                                                02222000
@NM00240 DC    CL6'LENGTH'                                              02223000
@NM00241 DC    CL7'CURRENT'                                             02224000
         ORG   FRRSL1+24                                                02225000
FRRFMT1  DS    CL28                                                     02226000
         ORG   FRRFMT1                                                  02227000
@NM00242 DS    CL4                                                      02228000
         ORG   @NM00242                                                 02229000
@NM00243 DC    X'01'                                                    02230000
@NM00244 DC    X'40'                                                    02231000
@NM00245 DC    AL1(0)                                                   02232000
@NM00246 DC    AL1(0)                                                   02233000
         ORG   FRRFMT1+4                                                02234000
@NM00247 DS    CL8                                                      02235000
         ORG   @NM00247                                                 02236000
@NM00248 DC    X'07'                                                    02237000
@NM00249 DC    X'63'                                                    02238000
@NM00250 DC    AL1(8)                                                   02239000
@NM00251 DC    AL1(16)                                                  02240000
@NM00252 DC    AL4(FRRSL1)                                              02241000
         ORG   FRRFMT1+12                                               02242000
@NM00253 DS    CL4                                                      02243000
         ORG   @NM00253                                                 02244000
@NM00254 DC    X'05'                                                    02245000
@NM00255 DC    X'33'                                                    02246000
@NM00256 DC    AL1(25)                                                  02247000
@NM00257 DC    AL1(30)                                                  02248000
         ORG   FRRFMT1+16                                               02249000
@NM00258 DS    CL4                                                      02250000
         ORG   @NM00258                                                 02251000
@NM00259 DC    X'05'                                                    02252000
@NM00260 DC    X'53'                                                    02253000
@NM00261 DC    AL1(39)                                                  02254000
@NM00262 DC    AL1(46)                                                  02255000
         ORG   FRRFMT1+20                                               02256000
@NM00263 DS    CL4                                                      02257000
         ORG   @NM00263                                                 02258000
@NM00264 DC    X'05'                                                    02259000
@NM00265 DC    X'63'                                                    02260000
@NM00266 DC    AL1(55)                                                  02261000
@NM00267 DC    AL1(63)                                                  02262000
         ORG   FRRFMT1+24                                               02263000
@NM00268 DS    CL4                                                      02264000
         ORG   @NM00268                                                 02265000
@NM00269 DC    F'0'                                                     02266000
         ORG   FRRFMT1+28                                               02267000
FRRSL2   DS    CL17                                                     02268000
         ORG   FRRSL2                                                   02269000
@NM00270 DC    CL4'FRRP'                                                02270000
@NM00271 DC    CL5'FLAGS'                                               02271000
@NM00272 DC    CL8'PARMAREA'                                            02272000
         ORG   FRRSL2+17                                                02273000
         DS    CL3                                                      02274000
FRRFMT2  DS    CL44                                                     02275000
         ORG   FRRFMT2                                                  02276000
@NM00273 DS    CL4                                                      02277000
         ORG   @NM00273                                                 02278000
@NM00274 DC    X'01'                                                    02279000
@NM00275 DC    X'40'                                                    02280000
@NM00276 DC    AL1(0)                                                   02281000
@NM00277 DC    AL1(0)                                                   02282000
         ORG   FRRFMT2+4                                                02283000
@NM00278 DS    CL8                                                      02284000
         ORG   @NM00278                                                 02285000
@NM00279 DC    X'07'                                                    02286000
@NM00280 DC    X'33'                                                    02287000
@NM00281 DC    AL1(8)                                                   02288000
@NM00282 DC    AL1(13)                                                  02289000
@NM00283 DC    AL4(FRRSL2)                                              02290000
         ORG   FRRFMT2+12                                               02291000
@NM00284 DS    CL4                                                      02292000
         ORG   @NM00284                                                 02293000
@NM00285 DC    X'05'                                                    02294000
@NM00286 DC    X'43'                                                    02295000
@NM00287 DC    AL1(22)                                                  02296000
@NM00288 DC    AL1(28)                                                  02297000
         ORG   FRRFMT2+16                                               02298000
@NM00289 DS    CL4                                                      02299000
         ORG   @NM00289                                                 02300000
@NM00290 DC    X'05'                                                    02301000
@NM00291 DC    X'73'                                                    02302000
@NM00292 DC    AL1(37)                                                  02303000
@NM00293 DC    AL1(46)                                                  02304000
         ORG   FRRFMT2+20                                               02305000
@NM00294 DS    CL4                                                      02306000
         ORG   @NM00294                                                 02307000
@NM00295 DC    X'04'                                                    02308000
@NM00296 DC    X'03'                                                    02309000
@NM00297 DC    AL1(0)                                                   02310000
@NM00298 DC    AL1(55)                                                  02311000
         ORG   FRRFMT2+24                                               02312000
@NM00299 DS    CL4                                                      02313000
         ORG   @NM00299                                                 02314000
@NM00300 DC    X'04'                                                    02315000
@NM00301 DC    X'03'                                                    02316000
@NM00302 DC    AL1(0)                                                   02317000
@NM00303 DC    AL1(64)                                                  02318000
         ORG   FRRFMT2+28                                               02319000
@NM00304 DS    CL4                                                      02320000
         ORG   @NM00304                                                 02321000
@NM00305 DC    X'04'                                                    02322000
@NM00306 DC    X'03'                                                    02323000
@NM00307 DC    AL1(0)                                                   02324000
@NM00308 DC    AL1(73)                                                  02325000
         ORG   FRRFMT2+32                                               02326000
@NM00309 DS    CL4                                                      02327000
         ORG   @NM00309                                                 02328000
@NM00310 DC    X'04'                                                    02329000
@NM00311 DC    X'03'                                                    02330000
@NM00312 DC    AL1(0)                                                   02331000
@NM00313 DC    AL1(82)                                                  02332000
         ORG   FRRFMT2+36                                               02333000
@NM00314 DS    CL4                                                      02334000
         ORG   @NM00314                                                 02335000
@NM00315 DC    X'04'                                                    02336000
@NM00316 DC    X'03'                                                    02337000
@NM00317 DC    AL1(0)                                                   02338000
@NM00318 DC    AL1(91)                                                  02339000
         ORG   FRRFMT2+40                                               02340000
@NM00319 DS    CL4                                                      02341000
         ORG   @NM00319                                                 02342000
@NM00320 DC    F'0'                                                     02343000
         ORG   FRRFMT2+44                                               02344000
RT1WL1   DS    CL33                                                     02345000
         ORG   RT1WL1                                                   02346000
@NM00321 DC    CL7'LPHASEN'                                             02347000
@NM00322 DC    CL10'REC RTN ID'                                         02348000
@NM00323 DC    CL8'ORIGENPT'                                            02349000
@NM00324 DC    CL8'RESOURCE'                                            02350000
         ORG   RT1WL1+33                                                02351000
         DS    CL3                                                      02352000
RT1WFMT1 DS    CL28                                                     02353000
         ORG   RT1WFMT1                                                 02354000
@NM00325 DS    CL4                                                      02355000
         ORG   @NM00325                                                 02356000
@NM00326 DC    X'01'                                                    02357000
@NM00327 DC    X'40'                                                    02358000
@NM00328 DC    AL1(0)                                                   02359000
@NM00329 DC    AL1(0)                                                   02360000
         ORG   RT1WFMT1+4                                               02361000
@NM00330 DS    CL8                                                      02362000
         ORG   @NM00330                                                 02363000
@NM00331 DC    X'07'                                                    02364000
@NM00332 DC    X'60'                                                    02365000
@NM00333 DC    AL1(8)                                                   02366000
@NM00334 DC    AL1(16)                                                  02367000
@NM00335 DC    AL4(RT1WL1)                                              02368000
         ORG   RT1WFMT1+12                                              02369000
@NM00336 DS    CL4                                                      02370000
         ORG   @NM00336                                                 02371000
@NM00337 DC    X'05'                                                    02372000
@NM00338 DC    X'90'                                                    02373000
@NM00339 DC    AL1(23)                                                  02374000
@NM00340 DC    AL1(39)                                                  02375000
         ORG   RT1WFMT1+16                                              02376000
@NM00341 DS    CL4                                                      02377000
         ORG   @NM00341                                                 02378000
@NM00342 DC    X'05'                                                    02379000
@NM00343 DC    X'70'                                                    02380000
@NM00344 DC    AL1(48)                                                  02381000
@NM00345 DC    AL1(57)                                                  02382000
         ORG   RT1WFMT1+20                                              02383000
@NM00346 DS    CL4                                                      02384000
         ORG   @NM00346                                                 02385000
@NM00347 DC    X'05'                                                    02386000
@NM00348 DC    X'70'                                                    02387000
@NM00349 DC    AL1(66)                                                  02388000
@NM00350 DC    AL1(75)                                                  02389000
         ORG   RT1WFMT1+24                                              02390000
@NM00351 DS    CL4                                                      02391000
         ORG   @NM00351                                                 02392000
@NM00352 DC    F'0'                                                     02393000
         ORG   RT1WFMT1+28                                              02394000
RT1WL2   DS    CL16                                                     02395000
         ORG   RT1WL2                                                   02396000
@NM00353 DC    CL5'CHECK'                                               02397000
@NM00354 DC    CL7'POINTED'                                             02398000
@NM00355 DC    CL4'REGS'                                                02399000
         ORG   RT1WL2+16                                                02400000
RT1WFMT2 DS    CL40                                                     02401000
         ORG   RT1WFMT2                                                 02402000
@NM00356 DS    CL4                                                      02403000
         ORG   @NM00356                                                 02404000
@NM00357 DC    X'01'                                                    02405000
@NM00358 DC    X'40'                                                    02406000
@NM00359 DC    AL1(0)                                                   02407000
@NM00360 DC    AL1(0)                                                   02408000
         ORG   RT1WFMT2+4                                               02409000
@NM00361 DS    CL8                                                      02410000
         ORG   @NM00361                                                 02411000
@NM00362 DC    X'07'                                                    02412000
@NM00363 DC    X'43'                                                    02413000
@NM00364 DC    AL1(8)                                                   02414000
@NM00365 DC    AL1(30)                                                  02415000
@NM00366 DC    AL4(RT1WL2)                                              02416000
         ORG   RT1WFMT2+12                                              02417000
@NM00367 DS    CL4                                                      02418000
         ORG   @NM00367                                                 02419000
@NM00368 DC    X'01'                                                    02420000
@NM00369 DC    X'60'                                                    02421000
@NM00370 DC    AL1(14)                                                  02422000
@NM00371 DC    AL1(0)                                                   02423000
         ORG   RT1WFMT2+16                                              02424000
@NM00372 DS    CL4                                                      02425000
         ORG   @NM00372                                                 02426000
@NM00373 DC    X'01'                                                    02427000
@NM00374 DC    X'30'                                                    02428000
@NM00375 DC    AL1(23)                                                  02429000
@NM00376 DC    AL1(0)                                                   02430000
         ORG   RT1WFMT2+20                                              02431000
@NM00377 DS    CL4                                                      02432000
         ORG   @NM00377                                                 02433000
@NM00378 DC    X'04'                                                    02434000
@NM00379 DC    X'03'                                                    02435000
@NM00380 DC    AL1(0)                                                   02436000
@NM00381 DC    AL1(39)                                                  02437000
         ORG   RT1WFMT2+24                                              02438000
@NM00382 DS    CL4                                                      02439000
         ORG   @NM00382                                                 02440000
@NM00383 DC    X'04'                                                    02441000
@NM00384 DC    X'03'                                                    02442000
@NM00385 DC    AL1(0)                                                   02443000
@NM00386 DC    AL1(48)                                                  02444000
         ORG   RT1WFMT2+28                                              02445000
@NM00387 DS    CL4                                                      02446000
         ORG   @NM00387                                                 02447000
@NM00388 DC    X'04'                                                    02448000
@NM00389 DC    X'03'                                                    02449000
@NM00390 DC    AL1(0)                                                   02450000
@NM00391 DC    AL1(57)                                                  02451000
         ORG   RT1WFMT2+32                                              02452000
@NM00392 DS    CL4                                                      02453000
         ORG   @NM00392                                                 02454000
@NM00393 DC    X'04'                                                    02455000
@NM00394 DC    X'03'                                                    02456000
@NM00395 DC    AL1(0)                                                   02457000
@NM00396 DC    AL1(66)                                                  02458000
         ORG   RT1WFMT2+36                                              02459000
@NM00397 DS    CL4                                                      02460000
         ORG   @NM00397                                                 02461000
@NM00398 DC    F'0'                                                     02462000
         ORG   RT1WFMT2+40                                              02463000
RT1WL3   DS    CL18                                                     02464000
         ORG   RT1WL3                                                   02465000
@NM00399 DC    CL5'PSW1P'                                               02466000
@NM00400 DC    CL5'PSW2P'                                               02467000
@NM00401 DC    CL8'VARIABLE'                                            02468000
         ORG   RT1WL3+18                                                02469000
         DS    CL2                                                      02470000
RT1WFMT3 DS    CL40                                                     02471000
         ORG   RT1WFMT3                                                 02472000
@NM00402 DS    CL4                                                      02473000
         ORG   @NM00402                                                 02474000
@NM00403 DC    X'01'                                                    02475000
@NM00404 DC    X'40'                                                    02476000
@NM00405 DC    AL1(0)                                                   02477000
@NM00406 DC    AL1(0)                                                   02478000
         ORG   RT1WFMT3+4                                               02479000
@NM00407 DS    CL8                                                      02480000
         ORG   @NM00407                                                 02481000
@NM00408 DC    X'07'                                                    02482000
@NM00409 DC    X'43'                                                    02483000
@NM00410 DC    AL1(8)                                                   02484000
@NM00411 DC    AL1(14)                                                  02485000
@NM00412 DC    AL4(RT1WL3)                                              02486000
         ORG   RT1WFMT3+12                                              02487000
@NM00413 DS    CL4                                                      02488000
         ORG   @NM00413                                                 02489000
@NM00414 DC    X'05'                                                    02490000
@NM00415 DC    X'43'                                                    02491000
@NM00416 DC    AL1(23)                                                  02492000
@NM00417 DC    AL1(30)                                                  02493000
         ORG   RT1WFMT3+16                                              02494000
@NM00418 DS    CL4                                                      02495000
         ORG   @NM00418                                                 02496000
@NM00419 DC    X'05'                                                    02497000
@NM00420 DC    X'73'                                                    02498000
@NM00421 DC    AL1(39)                                                  02499000
@NM00422 DC    AL1(48)                                                  02500000
         ORG   RT1WFMT3+20                                              02501000
@NM00423 DS    CL4                                                      02502000
         ORG   @NM00423                                                 02503000
@NM00424 DC    X'04'                                                    02504000
@NM00425 DC    X'03'                                                    02505000
@NM00426 DC    AL1(0)                                                   02506000
@NM00427 DC    AL1(57)                                                  02507000
         ORG   RT1WFMT3+24                                              02508000
@NM00428 DS    CL4                                                      02509000
         ORG   @NM00428                                                 02510000
@NM00429 DC    X'04'                                                    02511000
@NM00430 DC    X'03'                                                    02512000
@NM00431 DC    AL1(0)                                                   02513000
@NM00432 DC    AL1(66)                                                  02514000
         ORG   RT1WFMT3+28                                              02515000
@NM00433 DS    CL4                                                      02516000
         ORG   @NM00433                                                 02517000
@NM00434 DC    X'04'                                                    02518000
@NM00435 DC    X'03'                                                    02519000
@NM00436 DC    AL1(0)                                                   02520000
@NM00437 DC    AL1(75)                                                  02521000
         ORG   RT1WFMT3+32                                              02522000
@NM00438 DS    CL4                                                      02523000
         ORG   @NM00438                                                 02524000
@NM00439 DC    X'04'                                                    02525000
@NM00440 DC    X'03'                                                    02526000
@NM00441 DC    AL1(0)                                                   02527000
@NM00442 DC    AL1(84)                                                  02528000
         ORG   RT1WFMT3+36                                              02529000
@NM00443 DS    CL4                                                      02530000
         ORG   @NM00443                                                 02531000
@NM00444 DC    F'0'                                                     02532000
         ORG   RT1WFMT3+40                                              02533000
RT1WL4   DS    CL22                                                     02534000
         ORG   RT1WL4                                                   02535000
@NM00445 DC    CL5'SDWAP'                                               02536000
@NM00446 DC    CL6'PSDWAP'                                              02537000
@NM00447 DC    CL4'EEDQ'                                                02538000
@NM00448 DC    CL7'EP DATA'                                             02539000
         ORG   RT1WL4+22                                                02540000
         DS    CL2                                                      02541000
RT1WFMT4 DS    CL28                                                     02542000
         ORG   RT1WFMT4                                                 02543000
@NM00449 DS    CL4                                                      02544000
         ORG   @NM00449                                                 02545000
@NM00450 DC    X'01'                                                    02546000
@NM00451 DC    X'40'                                                    02547000
@NM00452 DC    AL1(0)                                                   02548000
@NM00453 DC    AL1(0)                                                   02549000
         ORG   RT1WFMT4+4                                               02550000
@NM00454 DS    CL8                                                      02551000
         ORG   @NM00454                                                 02552000
@NM00455 DC    X'07'                                                    02553000
@NM00456 DC    X'43'                                                    02554000
@NM00457 DC    AL1(8)                                                   02555000
@NM00458 DC    AL1(14)                                                  02556000
@NM00459 DC    AL4(RT1WL4)                                              02557000
         ORG   RT1WFMT4+12                                              02558000
@NM00460 DS    CL4                                                      02559000
         ORG   @NM00460                                                 02560000
@NM00461 DC    X'05'                                                    02561000
@NM00462 DC    X'53'                                                    02562000
@NM00463 DC    AL1(23)                                                  02563000
@NM00464 DC    AL1(30)                                                  02564000
         ORG   RT1WFMT4+16                                              02565000
@NM00465 DS    CL4                                                      02566000
         ORG   @NM00465                                                 02567000
@NM00466 DC    X'05'                                                    02568000
@NM00467 DC    X'33'                                                    02569000
@NM00468 DC    AL1(39)                                                  02570000
@NM00469 DC    AL1(48)                                                  02571000
         ORG   RT1WFMT4+20                                              02572000
@NM00470 DS    CL4                                                      02573000
         ORG   @NM00470                                                 02574000
@NM00471 DC    X'05'                                                    02575000
@NM00472 DC    X'63'                                                    02576000
@NM00473 DC    AL1(57)                                                  02577000
@NM00474 DC    AL1(66)                                                  02578000
         ORG   RT1WFMT4+24                                              02579000
@NM00475 DS    CL4                                                      02580000
         ORG   @NM00475                                                 02581000
@NM00476 DC    F'0'                                                     02582000
         ORG   RT1WFMT4+28                                              02583000
RT1EFMT1 DS    CL24                                                     02584000
         ORG   RT1EFMT1                                                 02585000
@NM00477 DS    CL4                                                      02586000
         ORG   @NM00477                                                 02587000
@NM00478 DC    X'01'                                                    02588000
@NM00479 DC    X'40'                                                    02589000
@NM00480 DC    AL1(0)                                                   02590000
@NM00481 DC    AL1(0)                                                   02591000
         ORG   RT1EFMT1+4                                               02592000
@NM00482 DS    CL4                                                      02593000
         ORG   @NM00482                                                 02594000
@NM00483 DC    X'04'                                                    02595000
@NM00484 DC    X'03'                                                    02596000
@NM00485 DC    AL1(0)                                                   02597000
@NM00486 DC    AL1(8)                                                   02598000
         ORG   RT1EFMT1+8                                               02599000
@NM00487 DS    CL4                                                      02600000
         ORG   @NM00487                                                 02601000
@NM00488 DC    X'04'                                                    02602000
@NM00489 DC    X'03'                                                    02603000
@NM00490 DC    AL1(0)                                                   02604000
@NM00491 DC    AL1(17)                                                  02605000
         ORG   RT1EFMT1+12                                              02606000
@NM00492 DS    CL4                                                      02607000
         ORG   @NM00492                                                 02608000
@NM00493 DC    X'04'                                                    02609000
@NM00494 DC    X'03'                                                    02610000
@NM00495 DC    AL1(0)                                                   02611000
@NM00496 DC    AL1(26)                                                  02612000
         ORG   RT1EFMT1+16                                              02613000
@NM00497 DS    CL4                                                      02614000
         ORG   @NM00497                                                 02615000
@NM00498 DC    X'04'                                                    02616000
@NM00499 DC    X'03'                                                    02617000
@NM00500 DC    AL1(0)                                                   02618000
@NM00501 DC    AL1(35)                                                  02619000
         ORG   RT1EFMT1+20                                              02620000
@NM00502 DS    CL4                                                      02621000
         ORG   @NM00502                                                 02622000
@NM00503 DC    F'0'                                                     02623000
         ORG   RT1EFMT1+24                                              02624000
RT1EFMT2 DS    CL28                                                     02625000
         ORG   RT1EFMT2                                                 02626000
@NM00504 DS    CL4                                                      02627000
         ORG   @NM00504                                                 02628000
@NM00505 DC    X'01'                                                    02629000
@NM00506 DC    X'40'                                                    02630000
@NM00507 DC    AL1(0)                                                   02631000
@NM00508 DC    AL1(0)                                                   02632000
         ORG   RT1EFMT2+4                                               02633000
@NM00509 DS    CL4                                                      02634000
         ORG   @NM00509                                                 02635000
@NM00510 DC    X'04'                                                    02636000
@NM00511 DC    X'03'                                                    02637000
@NM00512 DC    AL1(0)                                                   02638000
@NM00513 DC    AL1(8)                                                   02639000
         ORG   RT1EFMT2+8                                               02640000
@NM00514 DS    CL4                                                      02641000
         ORG   @NM00514                                                 02642000
@NM00515 DC    X'04'                                                    02643000
@NM00516 DC    X'03'                                                    02644000
@NM00517 DC    AL1(0)                                                   02645000
@NM00518 DC    AL1(17)                                                  02646000
         ORG   RT1EFMT2+12                                              02647000
@NM00519 DS    CL4                                                      02648000
         ORG   @NM00519                                                 02649000
@NM00520 DC    X'04'                                                    02650000
@NM00521 DC    X'03'                                                    02651000
@NM00522 DC    AL1(0)                                                   02652000
@NM00523 DC    AL1(26)                                                  02653000
         ORG   RT1EFMT2+16                                              02654000
@NM00524 DS    CL4                                                      02655000
         ORG   @NM00524                                                 02656000
@NM00525 DC    X'04'                                                    02657000
@NM00526 DC    X'03'                                                    02658000
@NM00527 DC    AL1(0)                                                   02659000
@NM00528 DC    AL1(35)                                                  02660000
         ORG   RT1EFMT2+20                                              02661000
@NM00529 DS    CL4                                                      02662000
         ORG   @NM00529                                                 02663000
@NM00530 DC    X'04'                                                    02664000
@NM00531 DC    X'03'                                                    02665000
@NM00532 DC    AL1(0)                                                   02666000
@NM00533 DC    AL1(44)                                                  02667000
         ORG   RT1EFMT2+24                                              02668000
@NM00534 DS    CL4                                                      02669000
         ORG   @NM00534                                                 02670000
@NM00535 DC    F'0'                                                     02671000
         ORG   RT1EFMT2+28                                              02672000
REL2     DC    CL2'02'                                                  02673000
TRANS    DS    CL256                                                    02674000
         ORG   TRANS                                                    02675000
@NM00540 DS    CL64                                                     02676000
BL       DC    CL1' '                                                   02677000
@NM00541 DS    CL175                                                    02678000
NUMS     DC    CL16'0123456789ABCDEF'                                   02679000
         ORG   TRANS+256                                                02680000
BADMAX   DC    CL72'*** ERROR IN THE FIELDS USED TO DETERMINE THE NUMBEC02681000
               R OF FRR ENTRIES ***'                                    02682000
FRRSFMT  DC    CL120'*** FORMATTING ROUTINE ERROR DURING FRRS FORMATTINC02683000
               G (POSSIBLE CAUSE: DATA NOT IN DUMP) ***'                02684000
FRRHDR   DC    CL54'-CURRENT FRR STACK------------------------AT LOCATIC02685000
               ON '                                                     02686000
IHSAUS   DC    CL28' ---------------------------'                       02687000
         ORG   IHSAUS                                                   02688000
@NM00542 DS    CL1                                                      02689000
UNDRSC   DS    CL27                                                     02690000
         ORG   IHSAUS+28                                                02691000
FRREHDR  DC    CL11'FRR ENTRIES'                                        02692000
IHSAFMT  DC    CL120'*** FORMATTING ROUTINE ERROR DURING IHSA FORMATTINC02693000
               G (POSSIBLE CAUSE: DATA NOT IN DUMP) ***'                02694000
IHSAFMSG DC    CL9'FRR STACK'                                           02695000
IHSAHDR  DC    CL54'-INTERRUPT HANDLER SAVE AREA--------------AT LOCATIC02696000
               ON '                                                     02697000
FRRLZERO DC    CL64'*** WARNING, ZERO LENGTH STACK FOUND - FORMATTING TC02698000
               ERMINATED ***'                                           02699000
LPNSTART DC    CL24'LOGICAL PHASE NUMBER IS '                           02700000
RT1MSG   DC    CL38'( RT1W WORK AREA FOLLOWS FRR ENTRIES )'             02701000
RT1HDR   DC    CL14'RT1W WORK AREA'                                     02702000
RT1SUM   DC    CL21'RT1W BIT FLAG SUMMARY'                              02703000
RT1WARN  DC    CL49'*** WARNING, RT1W MAY NOT BE CURRENT OR VALID ***'  02704000
EXITMSG  DC    CL34'FIELD CONTAINS INTERNAL EXIT FLAGS'                 02705000
RTSTART  DC    CL17'RTM1 ENTERED FOR '                                  02706000
SYSTATE  DC    CL13'SYSTEM STATE:'                                      02707000
BLANKS   DC    CL120' '                                                 02708000
IHSPATCH DC    CL200'PATCH AREA FOR IEAFTIHS - IT IS 200 BYTES LONG'    02709000
IHSANAME DC    AL4(IHSAFMT1)                                            02710000
         DC    AL4(IHSAFMT2)                                            02711000
         DC    AL4(IHSAFMT3)                                            02712000
         DC    AL4(IHSAFMT4)                                            02713000
IHSASU50 DC    AL4(SU50FMT1)                                            02714000
FRRNAMES DC    AL4(FRRFMT1)                                             02715000
         DC    AL4(FRRFMT2)                                             02716000
RT1WNAME DC    AL4(RT1WFMT1)                                            02717000
         DC    AL4(RT1WFMT2)                                            02718000
         DC    AL4(RT1WFMT3)                                            02719000
         DC    AL4(RT1WFMT4)                                            02720000
RT1ENAME DC    AL4(RT1EFMT1)                                            02721000
         DC    AL4(RT1EFMT1)                                            02722000
         DC    AL4(RT1EFMT1)                                            02723000
         DC    AL4(RT1EFMT2)                                            02724000
LPNARRAY DC    CL40',MANAGEMENT FUNCTION'                               02725000
         DC    CL40',MACHINE CHECK FUNCTION'                            02726000
         DC    CL40',SRM FUNCTION'                                      02727000
         DC    CL40',RESCHEDULE FUNCTION WITH POSSIBLE RETRY'           02728000
         DC    CL40',RESCHEDULE FUNCTION'                               02729000
         DC    CL40',EXIT FUNCTION'                                     02730000
         DC    CL40',ANTICIPATED RECURSION'                             02731000
MODEMSG  DC    CL25'SUPERVISOR CONTROL MODE'                            02732000
         DC    CL25'PHYSICALLY DISABLED STATE'                          02733000
         DC    CL25'GLOBAL SPIN LOCK HELD'                              02734000
         DC    CL25'GLOBAL SUSPEND LOCK HELD'                           02735000
         DC    CL25'LOCALLY LOCKED MODE'                                02736000
         DC    CL25'TYPE 1 SVC MODE'                                    02737000
         DC    CL25'SRB MODE'                                           02738000
         DC    CL25'TASK MODE'                                          02739000
RTARRAY  DC    CL50'PROGRAM CHECK'                                      02740000
         DC    CL50'RESTART'                                            02741000
         DC    CL50'SVC ERROR'                                          02742000
         DC    CL50'DAT ERROR'                                          02743000
         DC    CL50'MACHINE CHECK REENTRY'                              02744000
         DC    CL50'RESCHEDULE OF PAGE I/O ERROR'                       02745000
         DC    CL50'RESCHEDULE OF ABNORMAL TERMINATION'                 02746000
         DC    CL50'RESCHEDULE OF ABNORMAL TERMINATION THROUGH CVTBTRM' 02747000
         DC    CL50'RESCHEDULE OF CROSS MEMORY ABNORMAL TERMINATION'    02748000
         DC    CL50'RESCHEDULE OF ABNORMAL TERMINATION OF CURRENT TCB'  02749000
         DC    CL50'MEMORY TERMINATION'                                 02750000
         DC    CL50'CROSS MEMORY ABNORMAL TERMINATION'                  02751000
         DC    CL50'RESCHEDULE OF RTM1 ON OTHER CPU'                    02752000
         DC    CL50'MACHINE CHECK'                                      02753000
TESTBITS DC    X'80'                                                    02754000
         DC    X'40'                                                    02755000
         DC    X'20'                                                    02756000
         DC    X'10'                                                    02757000
         DC    X'08'                                                    02758000
         DC    X'04'                                                    02759000
         DC    X'02'                                                    02760000
         DC    X'01'                                                    02761000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02762000
@01      EQU   01                                                       02763000
@02      EQU   02                                                       02764000
@03      EQU   03                                                       02765000
@04      EQU   04                                                       02766000
@05      EQU   05                                                       02767000
@06      EQU   06                                                       02768000
@07      EQU   07                                                       02769000
@08      EQU   08                                                       02770000
@09      EQU   09                                                       02771000
@10      EQU   10                                                       02772000
@11      EQU   11                                                       02773000
@12      EQU   12                                                       02774000
@13      EQU   13                                                       02775000
@14      EQU   14                                                       02776000
@15      EQU   15                                                       02777000
LNGTHEQU EQU   @06                                                      02778000
INDEX    EQU   @08                                                      02779000
IHSAPTR  EQU   @08                                                      02780000
LPN      EQU   @08                                                      02781000
ESTAPTR  EQU   @07                                                      02782000
ENTRYMAX EQU   @09                                                      02783000
DATAPTR  EQU   @05                                                      02784000
ARRAYCNT EQU   @06                                                      02785000
ABDPLPTR EQU   @01                                                      02786000
LINEPTR  EQU   @00                                                      02787000
VADR     EQU   @00                                                      02788000
RCREG    EQU   @15                                                      02789000
ABDPL    EQU   0                                                        02790000
ADPLFLAG EQU   ABDPL+7                                                  02791000
ADPLSNPR EQU   ADPLFLAG                                                 02792000
ADPLBUF  EQU   ABDPL+8                                                  02793000
ADPLPRNT EQU   ABDPL+12                                                 02794000
ADPLCVT  EQU   ABDPL+16                                                 02795000
ADPLMEMA EQU   ABDPL+20                                                 02796000
ADPLFRMT EQU   ABDPL+24                                                 02797000
ADPLCOM1 EQU   ABDPL+28                                                 02798000
ADPLCOM2 EQU   ABDPL+32                                                 02799000
ADPLFMT1 EQU   ABDPL+44                                                 02800000
ADPLFMT2 EQU   ABDPL+48                                                 02801000
CVTMAP   EQU   0                                                        02802000
CVTBTERM EQU   CVTMAP+52                                                02803000
CVTDAR   EQU   CVTMAP+72                                                02804000
CVTFLGS1 EQU   CVTDAR                                                   02805000
CVTDCB   EQU   CVTMAP+116                                               02806000
CVTIOQET EQU   CVTMAP+120                                               02807000
CVTIERLC EQU   CVTMAP+144                                               02808000
CVTHEAD  EQU   CVTMAP+160                                               02809000
CVTSV76C EQU   CVTHEAD                                                  02810000
CVTOPTA  EQU   CVTMAP+182                                               02811000
CVTOPTB  EQU   CVTMAP+183                                               02812000
CVTGTF   EQU   CVTMAP+236                                               02813000
CVTGTFST EQU   CVTGTF                                                   02814000
CVTGTFS  EQU   CVTGTFST                                                 02815000
CVTSTATE EQU   CVTGTFST                                                 02816000
CVTTMODE EQU   CVTGTFST                                                 02817000
CVTFORM  EQU   CVTGTFST                                                 02818000
CVTAQAVT EQU   CVTMAP+240                                               02819000
CVTTCMFG EQU   CVTAQAVT                                                 02820000
CVTVOLM2 EQU   CVTMAP+244                                               02821000
CVTTATA  EQU   CVTVOLM2                                                 02822000
CVTTSKS  EQU   CVTTATA                                                  02823000
CVTVOLF2 EQU   CVTTSKS                                                  02824000
CVTTAT   EQU   CVTTATA+1                                                02825000
CVTATER  EQU   CVTMAP+248                                               02826000
CVTEXT1  EQU   CVTMAP+252                                               02827000
CVTPURG  EQU   CVTMAP+260                                               02828000
CVTQMSG  EQU   CVTMAP+268                                               02829000
CVTDMSR  EQU   CVTMAP+272                                               02830000
CVTRSV37 EQU   CVTDMSR                                                  02831000
CVTDMSRF EQU   CVTRSV37                                                 02832000
CVTERPV  EQU   CVTMAP+316                                               02833000
CVTINTLA EQU   CVTMAP+320                                               02834000
CVTAPF   EQU   CVTMAP+324                                               02835000
CVTEXT2  EQU   CVTMAP+328                                               02836000
CVTHJES  EQU   CVTMAP+332                                               02837000
CVTPGSIA EQU   CVTMAP+348                                               02838000
CVTA1F1  EQU   CVTMAP+356                                               02839000
CVTSYSK  EQU   CVTMAP+357                                               02840000
CVTVOLM1 EQU   CVTMAP+380                                               02841000
CVTVOLF1 EQU   CVTVOLM1                                                 02842000
CVTXTNT1 EQU   0                                                        02843000
CVTXTNT2 EQU   0                                                        02844000
CVTDSSV  EQU   CVTXTNT2                                                 02845000
CVTFLGBT EQU   CVTXTNT2+5                                               02846000
CVTQID   EQU   CVTXTNT2+24                                              02847000
CVTRV400 EQU   CVTXTNT2+52                                              02848000
CVTRV409 EQU   CVTXTNT2+53                                              02849000
CVTATCVT EQU   CVTXTNT2+64                                              02850000
CVTRV429 EQU   CVTXTNT2+84                                              02851000
CVTRV438 EQU   CVTXTNT2+85                                              02852000
CVTRV457 EQU   CVTXTNT2+112                                             02853000
CVTRV466 EQU   CVTXTNT2+113                                             02854000
CVTFIX   EQU   0                                                        02855000
CVTRELNO EQU   CVTFIX+252                                               02856000
CVTNUMB  EQU   CVTRELNO                                                 02857000
FRRS     EQU   0                                                        02858000
FRRSHEAD EQU   FRRS                                                     02859000
FRRSEMP  EQU   FRRSHEAD                                                 02860000
FRRSLAST EQU   FRRSHEAD+4                                               02861000
FRRSELEN EQU   FRRSHEAD+8                                               02862000
FRRSRTMW EQU   FRRS+16                                                  02863000
FRRSENTR EQU   0                                                        02864000
FRRSFLGS EQU   FRRSENTR+4                                               02865000
FRRSFLG1 EQU   FRRSFLGS                                                 02866000
IHSA     EQU   0                                                        02867000
IHSAFPRS EQU   IHSA+24                                                  02868000
RT1W     EQU   0                                                        02869000
RT1WNPRS EQU   RT1W                                                     02870000
RT1WPRSV EQU   RT1W+52                                                  02871000
RT1WEED  EQU   RT1WPRSV+8                                               02872000
RT1WENTR EQU   RT1WPRSV+12                                              02873000
RT1WMODE EQU   RT1WENTR                                                 02874000
RT1WCOVR EQU   RT1WENTR+2                                               02875000
RT1RTRN  EQU   0                                                        02876000
RT1RTRRG EQU   RT1RTRN+4                                                02877000
RT1TRACK EQU   0                                                        02878000
RT1TRECC EQU   RT1TRACK                                                 02879000
RT1TLPN  EQU   RT1TRECC                                                 02880000
RT1TENPT EQU   RT1TRECC+2                                               02881000
RT1TACQR EQU   RT1TRECC+3                                               02882000
RTMBRTAB EQU   0                                                        02883000
RTMBTERM EQU   RTMBRTAB                                                 02884000
MODEBYTE EQU   0                                                        02885000
EED      EQU   0                                                        02886000
EEDDES   EQU   EED+4                                                    02887000
EEDFLAGS EQU   EEDDES+1                                                 02888000
EEDERROR EQU   EED+8                                                    02889000
EEDVARBL EQU   EED+12                                                   02890000
EEDERMAP EQU   0                                                        02891000
EEDERRID EQU   EEDERMAP+70                                              02892000
SUBITS   EQU   0                                                        02893000
SUBYTE1  EQU   SUBITS                                                   02894000
SUBYTE2  EQU   SUBITS+1                                                 02895000
SUBYTE3  EQU   SUBITS+2                                                 02896000
SUBYTE4  EQU   SUBITS+3                                                 02897000
SUBYTE5  EQU   SUBITS+4                                                 02898000
SUBYTE6  EQU   SUBITS+5                                                 02899000
SUBYTE7  EQU   SUBITS+6                                                 02900000
SU50BIT  EQU   SUBYTE7                                                  02901000
SUBYTE8  EQU   SUBITS+7                                                 02902000
SUBYTE9  EQU   SUBITS+8                                                 02903000
SUBYTE10 EQU   SUBITS+9                                                 02904000
SUBYTE11 EQU   SUBITS+10                                                02905000
SUBYTE12 EQU   SUBITS+11                                                02906000
SUBYTE13 EQU   SUBITS+12                                                02907000
ACCESS   EQU   0                                                        02908000
FORMAT   EQU   0                                                        02909000
PRINT    EQU   0                                                        02910000
BUFFER   EQU   0                                                        02911000
OFFSET   EQU   BUFFER                                                   02912000
ADDRESS  EQU   BUFFER+55                                                02913000
DATABYTE EQU   0                                                        02914000
DATADWRD EQU   0                                                        02915000
DATAHALF EQU   0                                                        02916000
DATAWORD EQU   0                                                        02917000
ESTAPARM EQU   0                                                        02918000
ESTAERR  EQU   ESTAPARM                                                 02919000
ERREXP   EQU   ESTAERR                                                  02920000
RTYADR   EQU   ESTAPARM+4                                               02921000
RTYREGS  EQU   ESTAPARM+8                                               02922000
LCALREGS EQU   ESTAPARM+72                                              02923000
ENDMSG   EQU   0                                                        02924000
BITSTR   EQU   0                                                        02925000
MSG      EQU   0                                                        02926000
MSGARY   EQU   0                                                        02927000
CVTPTR   EQU   ADPLCVT                                                  02928000
CVTS01   EQU   CVTPGSIA                                                 02929000
CVTLPDIA EQU   CVTS01+12                                                02930000
CVTDIRST EQU   CVTLPDIA                                                 02931000
CVTSLIDA EQU   CVTS01+24                                                02932000
CVTCTLFG EQU   CVTS01+50                                                02933000
CVTRV210 EQU   CVTS01+424                                               02934000
CVTRV219 EQU   CVTS01+425                                               02935000
CVTRV228 EQU   CVTS01+426                                               02936000
CVTRV237 EQU   CVTS01+427                                               02937000
CVTMFRTR EQU   CVTS01+452                                               02938000
CVTRV262 EQU   CVTS01+468                                               02939000
CVTRV271 EQU   CVTS01+469                                               02940000
CVTRV280 EQU   CVTS01+470                                               02941000
CVTRV289 EQU   CVTS01+471                                               02942000
CVTGSDA  EQU   CVTS01+600                                               02943000
CVTIHASU EQU   CVTS01+696                                               02944000
EEDREGSP EQU   EEDVARBL                                                 02945000
EEDREGS  EQU   EEDREGSP                                                 02946000
EEDPSW   EQU   EEDREGSP+64                                              02947000
EEDPSW1  EQU   EEDPSW                                                   02948000
EEDPSW2  EQU   EEDPSW+8                                                 02949000
EEDINILC EQU   EEDPSW2                                                  02950000
EEDDUMPO EQU   EEDVARBL                                                 02951000
EEDSCDMP EQU   EEDDUMPO                                                 02952000
EEDSDDAT EQU   EEDSCDMP+4                                               02953000
EEDHWREP EQU   EEDVARBL                                                 02954000
EEDHMCHS EQU   EEDHWREP+8                                               02955000
EEDHMCHD EQU   EEDHWREP+9                                               02956000
EEDHRSRS EQU   EEDHWREP+12                                              02957000
EEDHRSR1 EQU   EEDHRSRS                                                 02958000
EEDHRSR2 EQU   EEDHRSRS+1                                               02959000
START    EQU   ADPLFMT1                                                 02960000
FRRSUS   EQU   IHSAUS                                                   02961000
FRREUS   EQU   UNDRSC                                                   02962000
IHSAFRUS EQU   UNDRSC                                                   02963000
RT1SUS   EQU   UNDRSC                                                   02964000
RT1US    EQU   UNDRSC                                                   02965000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02966000
EEDHTIME EQU   EEDHWREP+20                                              02967000
EEDHRFSA EQU   EEDHWREP+16                                              02968000
@NM00015 EQU   EEDHWREP+14                                              02969000
EEDHVERQ EQU   EEDHRSR2                                                 02970000
EEDHPGFX EQU   EEDHRSR2                                                 02971000
EEDHFLSQ EQU   EEDHRSR2                                                 02972000
EEDHFSQA EQU   EEDHRSR2                                                 02973000
EEDHNUCL EQU   EEDHRSR2                                                 02974000
EEDHSPER EQU   EEDHRSR2                                                 02975000
EEDHINTC EQU   EEDHRSR2                                                 02976000
EEDHOFLN EQU   EEDHRSR2                                                 02977000
EEDHCHNG EQU   EEDHRSR1                                                 02978000
EEDHMSER EQU   EEDHRSR1                                                 02979000
@NM00014 EQU   EEDHRSR1                                                 02980000
EEDHCPID EQU   EEDHWREP+10                                              02981000
EEDHTERR EQU   EEDHMCHD                                                 02982000
EEDHSOFT EQU   EEDHMCHD                                                 02983000
EEDHINSF EQU   EEDHMCHD                                                 02984000
EEDHACR  EQU   EEDHMCHD                                                 02985000
EEDHSCK  EQU   EEDHMCHD                                                 02986000
EEDHPSWU EQU   EEDHMCHD                                                 02987000
EEDHREGU EQU   EEDHMCHD                                                 02988000
EEDHSKYF EQU   EEDHMCHD                                                 02989000
@NM00013 EQU   EEDHMCHS                                                 02990000
@NM00012 EQU   EEDHMCHS                                                 02991000
EEDHRSRF EQU   EEDHMCHS                                                 02992000
EEDRSRC  EQU   EEDHMCHS                                                 02993000
EEDINVP  EQU   EEDHMCHS                                                 02994000
EEDHTSVL EQU   EEDHMCHS                                                 02995000
EEDHRCDF EQU   EEDHMCHS                                                 02996000
EEDHSRVL EQU   EEDHMCHS                                                 02997000
EEDHSCKE EQU   EEDHWREP+4                                               02998000
EEDHSCKB EQU   EEDHWREP                                                 02999000
EEDSDPSL EQU   EEDDUMPO+8                                               03000000
EEDSPDAT EQU   EEDSDDAT+2                                               03001000
EEDSSDAT EQU   EEDSDDAT                                                 03002000
EEDSDUMP EQU   EEDSCDMP                                                 03003000
EEDTRANS EQU   EEDPSW2+4                                                03004000
EEDINTCD EQU   EEDINILC+2                                               03005000
EEDILC   EQU   EEDINILC+1                                               03006000
@NM00011 EQU   EEDINILC                                                 03007000
EEDPSWIC EQU   EEDPSW1+4                                                03008000
EEDPSWMK EQU   EEDPSW1                                                  03009000
EEDREG15 EQU   EEDREGS+60                                               03010000
EEDREG14 EQU   EEDREGS+56                                               03011000
EEDREG13 EQU   EEDREGS+52                                               03012000
EEDREG12 EQU   EEDREGS+48                                               03013000
EEDREG11 EQU   EEDREGS+44                                               03014000
EEDREG10 EQU   EEDREGS+40                                               03015000
EEDREG9  EQU   EEDREGS+36                                               03016000
EEDREG8  EQU   EEDREGS+32                                               03017000
EEDREG7  EQU   EEDREGS+28                                               03018000
EEDREG6  EQU   EEDREGS+24                                               03019000
EEDREG5  EQU   EEDREGS+20                                               03020000
EEDREG4  EQU   EEDREGS+16                                               03021000
EEDREG3  EQU   EEDREGS+12                                               03022000
EEDREG2  EQU   EEDREGS+8                                                03023000
EEDREG1  EQU   EEDREGS+4                                                03024000
EEDREG0  EQU   EEDREGS                                                  03025000
CVTRV628 EQU   CVTS01+728                                               03026000
CVTRV627 EQU   CVTS01+724                                               03027000
CVTRV626 EQU   CVTS01+720                                               03028000
CVTRV625 EQU   CVTS01+716                                               03029000
CVTRV624 EQU   CVTS01+712                                               03030000
CVTRV623 EQU   CVTS01+708                                               03031000
CVTRV622 EQU   CVTS01+704                                               03032000
CVTRV621 EQU   CVTS01+700                                               03033000
CVTSUSP  EQU   CVTS01+692                                               03034000
CVTT6SVC EQU   CVTS01+688                                               03035000
CVTCDAL  EQU   CVTS01+684                                               03036000
CVTTCTL  EQU   CVTS01+680                                               03037000
CVTRSUME EQU   CVTS01+676                                               03038000
CVTJTERM EQU   CVTS01+672                                               03039000
CVTASMRM EQU   CVTS01+668                                               03040000
CVTTCASP EQU   CVTS01+664                                               03041000
CVT0PT03 EQU   CVTS01+660                                               03042000
CVT0PT0E EQU   CVTS01+656                                               03043000
CVTRV609 EQU   CVTS01+652                                               03044000
CVTCGK   EQU   CVTS01+648                                               03045000
CVTRAC   EQU   CVTS01+644                                               03046000
CVTHSM   EQU   CVTS01+640                                               03047000
CVTRV605 EQU   CVTS01+636                                               03048000
CVTRV604 EQU   CVTS01+632                                               03049000
CVTEFF02 EQU   CVTS01+628                                               03050000
CVTCBBR  EQU   CVTS01+624                                               03051000
CVTSSCR  EQU   CVTS01+620                                               03052000
CVTEVENT EQU   CVTS01+616                                               03053000
CVTCRCA  EQU   CVTS01+612                                               03054000
CVTTPIO  EQU   CVTS01+608                                               03055000
CVTADV   EQU   CVTS01+604                                               03056000
CVTGSDAB EQU   CVTGSDA                                                  03057000
CVTQV3   EQU   CVTS01+596                                               03058000
CVTQV2   EQU   CVTS01+592                                               03059000
CVTQV1   EQU   CVTS01+588                                               03060000
CVTRPT   EQU   CVTS01+584                                               03061000
CVTSSRB  EQU   CVTS01+580                                               03062000
CVTCSDRL EQU   CVTS01+576                                               03063000
CVTEXP1  EQU   CVTS01+572                                               03064000
CVTRMPMT EQU   CVTS01+568                                               03065000
CVTRMPTT EQU   CVTS01+564                                               03066000
CVTVPSA  EQU   CVTS01+560                                               03067000
CVTVSTOP EQU   CVTS01+556                                               03068000
CVTGTFR8 EQU   CVTS01+552                                               03069000
CVTQUIT  EQU   CVTS01+548                                               03070000
CVTVACR  EQU   CVTS01+544                                               03071000
CVTWTCB  EQU   CVTS01+540                                               03072000
CVTSTPRS EQU   CVTS01+536                                               03073000
CVT0PT02 EQU   CVTS01+532                                               03074000
CVTDARCM EQU   CVTS01+528                                               03075000
CVTIRECM EQU   CVTS01+524                                               03076000
CVTJRECM EQU   CVTS01+520                                               03077000
CVTVEMS0 EQU   CVTS01+516                                               03078000
CVTSPFRR EQU   CVTS01+512                                               03079000
CVTRLSTG EQU   CVTS01+508                                               03080000
CVT0TC0A EQU   CVTS01+504                                               03081000
CVTGMBR  EQU   CVTS01+500                                               03082000
CVTLFRM  EQU   CVTS01+496                                               03083000
CVTRMBR  EQU   CVTS01+492                                               03084000
CVTVIOP  EQU   CVTS01+488                                               03085000
CVTRV307 EQU   CVTS01+486                                               03086000
CVTRV306 EQU   CVTS01+484                                               03087000
CVTRV305 EQU   CVTS01+482                                               03088000
CVTRV304 EQU   CVTS01+480                                               03089000
CVTRV303 EQU   CVTS01+478                                               03090000
CVTRV302 EQU   CVTS01+476                                               03091000
CVTTRCA  EQU   CVTS01+472                                               03092000
CVTRV297 EQU   CVTRV289                                                 03093000
CVTRV296 EQU   CVTRV289                                                 03094000
CVTRV295 EQU   CVTRV289                                                 03095000
CVTRV294 EQU   CVTRV289                                                 03096000
CVTRV293 EQU   CVTRV289                                                 03097000
CVTRV292 EQU   CVTRV289                                                 03098000
CVTRV291 EQU   CVTRV289                                                 03099000
CVTRV290 EQU   CVTRV289                                                 03100000
CVTRV288 EQU   CVTRV280                                                 03101000
CVTRV287 EQU   CVTRV280                                                 03102000
CVTRV286 EQU   CVTRV280                                                 03103000
CVTRV285 EQU   CVTRV280                                                 03104000
CVTRV284 EQU   CVTRV280                                                 03105000
CVTRV283 EQU   CVTRV280                                                 03106000
CVTRV282 EQU   CVTRV280                                                 03107000
CVTRV281 EQU   CVTRV280                                                 03108000
CVTRV279 EQU   CVTRV271                                                 03109000
CVTRV278 EQU   CVTRV271                                                 03110000
CVTRV277 EQU   CVTRV271                                                 03111000
CVTRV276 EQU   CVTRV271                                                 03112000
CVTRV275 EQU   CVTRV271                                                 03113000
CVTRV274 EQU   CVTRV271                                                 03114000
CVTRV273 EQU   CVTRV271                                                 03115000
CVTRV272 EQU   CVTRV271                                                 03116000
CVTRV270 EQU   CVTRV262                                                 03117000
CVTRV269 EQU   CVTRV262                                                 03118000
CVTRV268 EQU   CVTRV262                                                 03119000
CVTRV267 EQU   CVTRV262                                                 03120000
CVTRV266 EQU   CVTRV262                                                 03121000
CVTRV265 EQU   CVTRV262                                                 03122000
CVTRV264 EQU   CVTRV262                                                 03123000
CVTRV263 EQU   CVTRV262                                                 03124000
CVTVFP   EQU   CVTS01+464                                               03125000
CVTVSI   EQU   CVTS01+460                                               03126000
CVTVPSIB EQU   CVTS01+456                                               03127000
CVTMFACT EQU   CVTMFRTR                                                 03128000
CVTMFCTL EQU   CVTS01+448                                               03129000
CVTPVBP  EQU   CVTS01+444                                               03130000
CVTPWI   EQU   CVTS01+440                                               03131000
CVTRV254 EQU   CVTS01+438                                               03132000
CVTRV253 EQU   CVTS01+436                                               03133000
CVTRV252 EQU   CVTS01+434                                               03134000
CVTRV251 EQU   CVTS01+433                                               03135000
CVTRV250 EQU   CVTS01+432                                               03136000
CVTRV249 EQU   CVTS01+431                                               03137000
CVTRV248 EQU   CVTS01+430                                               03138000
CVTRV247 EQU   CVTS01+429                                               03139000
CVTRV246 EQU   CVTS01+428                                               03140000
CVTRV245 EQU   CVTRV237                                                 03141000
CVTRV244 EQU   CVTRV237                                                 03142000
CVTRV243 EQU   CVTRV237                                                 03143000
CVTRV242 EQU   CVTRV237                                                 03144000
CVTRV241 EQU   CVTRV237                                                 03145000
CVTRV240 EQU   CVTRV237                                                 03146000
CVTRV239 EQU   CVTRV237                                                 03147000
CVTRV238 EQU   CVTRV237                                                 03148000
CVTRV236 EQU   CVTRV228                                                 03149000
CVTRV235 EQU   CVTRV228                                                 03150000
CVTRV234 EQU   CVTRV228                                                 03151000
CVTRV233 EQU   CVTRV228                                                 03152000
CVTRV232 EQU   CVTRV228                                                 03153000
CVTRV231 EQU   CVTRV228                                                 03154000
CVTRV230 EQU   CVTRV228                                                 03155000
CVTRV229 EQU   CVTRV228                                                 03156000
CVTRV227 EQU   CVTRV219                                                 03157000
CVTRV226 EQU   CVTRV219                                                 03158000
CVTRV225 EQU   CVTRV219                                                 03159000
CVTRV224 EQU   CVTRV219                                                 03160000
CVTRV223 EQU   CVTRV219                                                 03161000
CVTRV222 EQU   CVTRV219                                                 03162000
CVTRV221 EQU   CVTRV219                                                 03163000
CVTRV220 EQU   CVTRV219                                                 03164000
CVTRV218 EQU   CVTRV210                                                 03165000
CVTRV217 EQU   CVTRV210                                                 03166000
CVTRV216 EQU   CVTRV210                                                 03167000
CVTRV215 EQU   CVTRV210                                                 03168000
CVTRV214 EQU   CVTRV210                                                 03169000
CVTRV213 EQU   CVTRV210                                                 03170000
CVTRV212 EQU   CVTRV210                                                 03171000
CVTRV211 EQU   CVTRV210                                                 03172000
CVTLCCAT EQU   CVTS01+420                                               03173000
CVTPCCAT EQU   CVTS01+416                                               03174000
CVTIPCRP EQU   CVTS01+412                                               03175000
CVTIPCRI EQU   CVTS01+408                                               03176000
CVTIPCDS EQU   CVTS01+404                                               03177000
CVTAIDVT EQU   CVTS01+400                                               03178000
CVTSSAP  EQU   CVTS01+396                                               03179000
CVTEHCIR EQU   CVTS01+392                                               03180000
CVTEHDEF EQU   CVTS01+388                                               03181000
CVTDAIR  EQU   CVTS01+384                                               03182000
CVTPERFM EQU   CVTS01+380                                               03183000
CVT044R2 EQU   CVTS01+376                                               03184000
CVTFETCH EQU   CVTS01+372                                               03185000
CVTRSTWD EQU   CVTS01+368                                               03186000
CVTSPOST EQU   CVTS01+364                                               03187000
CVTIOBP  EQU   CVTS01+360                                               03188000
CVTASMVT EQU   CVTS01+356                                               03189000
CVTRECRQ EQU   CVTS01+352                                               03190000
CVTWSAC  EQU   CVTS01+348                                               03191000
CVTRV149 EQU   CVTS01+344                                               03192000
CVTWSAL  EQU   CVTS01+340                                               03193000
CVTSPSA  EQU   CVTS01+336                                               03194000
CVTGLMN  EQU   CVTS01+332                                               03195000
CVTVEAC0 EQU   CVTS01+328                                               03196000
CVT062R1 EQU   CVTS01+324                                               03197000
CVTRPOST EQU   CVTS01+320                                               03198000
CVTDQIQE EQU   CVTS01+316                                               03199000
CVTCSD   EQU   CVTS01+312                                               03200000
CVTLKRMA EQU   CVTS01+308                                               03201000
CVTRSPIE EQU   CVTS01+304                                               03202000
CVTRENQ  EQU   CVTS01+300                                               03203000
CVTLQCB  EQU   CVTS01+296                                               03204000
CVTFQCB  EQU   CVTS01+292                                               03205000
CVTQCS01 EQU   CVTS01+288                                               03206000
CVTAPFT  EQU   CVTS01+284                                               03207000
CVTPARRL EQU   CVTS01+280                                               03208000
CVTVWAIT EQU   CVTS01+276                                               03209000
CVTGSPL  EQU   CVTS01+272                                               03210000
CVTLSMQ  EQU   CVTS01+268                                               03211000
CVTGSMQ  EQU   CVTS01+264                                               03212000
CVTEXPRO EQU   CVTS01+260                                               03213000
CVTOPCTP EQU   CVTS01+256                                               03214000
CVTSIC   EQU   CVTS01+252                                               03215000
CVTTPIOS EQU   CVTS01+248                                               03216000
CVTRTMS  EQU   CVTS01+244                                               03217000
CVTSDBF  EQU   CVTS01+240                                               03218000
CVTSCBP  EQU   CVTS01+236                                               03219000
CVTSDMP  EQU   CVTS01+232                                               03220000
CVTSV60  EQU   CVTS01+228                                               03221000
CVTRTMCT EQU   CVTS01+224                                               03222000
CVTASCBL EQU   CVTS01+220                                               03223000
CVTASCBH EQU   CVTS01+216                                               03224000
CVTGDA   EQU   CVTS01+212                                               03225000
CVTASVT  EQU   CVTS01+208                                               03226000
CVTVVMDI EQU   CVTS01+204                                               03227000
CVTAQTOP EQU   CVTS01+200                                               03228000
CVTIOSCS EQU   CVTS01+196                                               03229000
CVTSDRM  EQU   CVTS01+192                                               03230000
CVTOPTE  EQU   CVTS01+188                                               03231000
CVTSTXU  EQU   CVTS01+184                                               03232000
CVTQUIS  EQU   CVTS01+180                                               03233000
CVTPARS  EQU   CVTS01+176                                               03234000
CVTS1EE  EQU   CVTS01+172                                               03235000
CVTFRAS  EQU   CVTS01+168                                               03236000
CVTQSAS  EQU   CVTS01+164                                               03237000
CVTCRAS  EQU   CVTS01+160                                               03238000
CVTCRMN  EQU   CVTS01+156                                               03239000
CVTDELCP EQU   CVTS01+152                                               03240000
CVTFRECL EQU   CVTS01+148                                               03241000
CVTGETCL EQU   CVTS01+144                                               03242000
CVTBLDCP EQU   CVTS01+140                                               03243000
CVTAUTHL EQU   CVTS01+136                                               03244000
CVTSCAN  EQU   CVTS01+132                                               03245000
CVTRV144 EQU   CVTS01+130                                               03246000
CVTMAXMP EQU   CVTS01+128                                               03247000
CVTSTCK  EQU   CVTS01+124                                               03248000
CVTRV139 EQU   CVTS01+123                                               03249000
CVTDSSAC EQU   CVTS01+122                                               03250000
CVTRV513 EQU   CVTS01+121                                               03251000
CVTIOSPL EQU   CVTS01+120                                               03252000
CVTPTGT  EQU   CVTS01+116                                               03253000
CVTCSPIE EQU   CVTS01+112                                               03254000
CVTSMFEX EQU   CVTS01+108                                               03255000
CVTOLT0A EQU   CVTS01+104                                               03256000
CVTSRBRT EQU   CVTS01+100                                               03257000
CVTPUTL  EQU   CVTS01+96                                                03258000
CVTASCRL EQU   CVTS01+92                                                03259000
CVTASCRF EQU   CVTS01+88                                                03260000
CVTRV326 EQU   CVTS01+84                                                03261000
CVTRV325 EQU   CVTS01+80                                                03262000
CVTRV324 EQU   CVTS01+76                                                03263000
CVT0VL01 EQU   CVTS01+72                                                03264000
CVTSHRVM EQU   CVTS01+68                                                03265000
CVTRV332 EQU   CVTS01+64                                                03266000
CVTTAS   EQU   CVTS01+60                                                03267000
CVTRSCN  EQU   CVTS01+56                                                03268000
CVTTRAC2 EQU   CVTS01+54                                                03269000
CVTTRACE EQU   CVTS01+52                                                03270000
CVTAPG   EQU   CVTS01+51                                                03271000
CVTSDTRC EQU   CVTCTLFG                                                 03272000
CVTGTRCE EQU   CVTCTLFG                                                 03273000
CVTNOMP  EQU   CVTCTLFG                                                 03274000
CVTRSV79 EQU   CVTCTLFG                                                 03275000
CVTDSTAT EQU   CVTCTLFG                                                 03276000
CVTRSV78 EQU   CVTCTLFG                                                 03277000
CVTRV333 EQU   CVTCTLFG                                                 03278000
CVTRV323 EQU   CVTCTLFG                                                 03279000
CVTSPVLK EQU   CVTS01+49                                                03280000
CVTRSV77 EQU   CVTS01+48                                                03281000
CVTRV331 EQU   CVTS01+44                                                03282000
CVTRV330 EQU   CVTS01+40                                                03283000
CVTRV329 EQU   CVTS01+36                                                03284000
CVTRV328 EQU   CVTS01+32                                                03285000
CVTRV322 EQU   CVTS01+28                                                03286000
CVTSLID  EQU   CVTSLIDA+1                                               03287000
CVTSYLK  EQU   CVTSLIDA                                                 03288000
CVTRV321 EQU   CVTS01+20                                                03289000
CVTRV320 EQU   CVTS01+16                                                03290000
CVTLPDIR EQU   CVTLPDIA+1                                               03291000
CVTRSV69 EQU   CVTDIRST                                                 03292000
CVTRSV68 EQU   CVTDIRST                                                 03293000
CVTRSV67 EQU   CVTDIRST                                                 03294000
CVTRSV66 EQU   CVTDIRST                                                 03295000
CVTRSV65 EQU   CVTDIRST                                                 03296000
CVTRSV64 EQU   CVTDIRST                                                 03297000
CVTRSV63 EQU   CVTDIRST                                                 03298000
CVTDICOM EQU   CVTDIRST                                                 03299000
CVTPVTP  EQU   CVTS01+8                                                 03300000
CVTLPDSR EQU   CVTS01+4                                                 03301000
CVTGETL  EQU   CVTS01                                                   03302000
@NM00539 EQU   ESTAERR                                                  03303000
UNEXP2   EQU   ESTAERR                                                  03304000
LOCKHELD EQU   ESTAERR                                                  03305000
@NM00538 EQU   BUFFER+64                                                03306000
@NM00537 EQU   BUFFER+6                                                 03307000
SURV104  EQU   SUBITS+13                                                03308000
SURV103  EQU   SUBYTE13                                                 03309000
SURV102  EQU   SUBYTE13                                                 03310000
SURV101  EQU   SUBYTE13                                                 03311000
SU100BT  EQU   SUBYTE13                                                 03312000
SU99BIT  EQU   SUBYTE13                                                 03313000
SU98BIT  EQU   SUBYTE13                                                 03314000
SU97BIT  EQU   SUBYTE13                                                 03315000
SU96BIT  EQU   SUBYTE13                                                 03316000
SU95BIT  EQU   SUBYTE12                                                 03317000
SU94BIT  EQU   SUBYTE12                                                 03318000
SU93BIT  EQU   SUBYTE12                                                 03319000
SU92BIT  EQU   SUBYTE12                                                 03320000
SU91BIT  EQU   SUBYTE12                                                 03321000
SU90BIT  EQU   SUBYTE12                                                 03322000
SU89BIT  EQU   SUBYTE12                                                 03323000
SU88BIT  EQU   SUBYTE12                                                 03324000
SU87BIT  EQU   SUBYTE11                                                 03325000
SU86BIT  EQU   SUBYTE11                                                 03326000
SU85BIT  EQU   SUBYTE11                                                 03327000
SU84BIT  EQU   SUBYTE11                                                 03328000
SU83BIT  EQU   SUBYTE11                                                 03329000
SU82BIT  EQU   SUBYTE11                                                 03330000
SU81BIT  EQU   SUBYTE11                                                 03331000
SU80BIT  EQU   SUBYTE11                                                 03332000
SU79BIT  EQU   SUBYTE10                                                 03333000
SU78BIT  EQU   SUBYTE10                                                 03334000
SU77BIT  EQU   SUBYTE10                                                 03335000
SU76BIT  EQU   SUBYTE10                                                 03336000
SU75BIT  EQU   SUBYTE10                                                 03337000
SU74BIT  EQU   SUBYTE10                                                 03338000
SU73BIT  EQU   SUBYTE10                                                 03339000
SU72BIT  EQU   SUBYTE10                                                 03340000
SU71BIT  EQU   SUBYTE9                                                  03341000
SU70BIT  EQU   SUBYTE9                                                  03342000
SU69BIT  EQU   SUBYTE9                                                  03343000
SU68BIT  EQU   SUBYTE9                                                  03344000
SU67BIT  EQU   SUBYTE9                                                  03345000
SU66BIT  EQU   SUBYTE9                                                  03346000
SU65BIT  EQU   SUBYTE9                                                  03347000
SU64BIT  EQU   SUBYTE9                                                  03348000
SU63BIT  EQU   SUBYTE8                                                  03349000
SU62BIT  EQU   SUBYTE8                                                  03350000
SU61BIT  EQU   SUBYTE8                                                  03351000
SU60BIT  EQU   SUBYTE8                                                  03352000
SU59BIT  EQU   SUBYTE8                                                  03353000
SU58BIT  EQU   SUBYTE8                                                  03354000
SU57BIT  EQU   SUBYTE8                                                  03355000
SU56BIT  EQU   SUBYTE8                                                  03356000
SU55BIT  EQU   SUBYTE7                                                  03357000
SU54BIT  EQU   SUBYTE7                                                  03358000
SU53BIT  EQU   SUBYTE7                                                  03359000
SU52BIT  EQU   SUBYTE7                                                  03360000
SU51BIT  EQU   SUBYTE7                                                  03361000
SU49BIT  EQU   SUBYTE7                                                  03362000
SU48BIT  EQU   SUBYTE7                                                  03363000
SU47BIT  EQU   SUBYTE6                                                  03364000
SU46BIT  EQU   SUBYTE6                                                  03365000
SU45BIT  EQU   SUBYTE6                                                  03366000
SU44BIT  EQU   SUBYTE6                                                  03367000
SU43BIT  EQU   SUBYTE6                                                  03368000
SU42BIT  EQU   SUBYTE6                                                  03369000
SU41BIT  EQU   SUBYTE6                                                  03370000
SU40BIT  EQU   SUBYTE6                                                  03371000
SU39BIT  EQU   SUBYTE5                                                  03372000
SU38BIT  EQU   SUBYTE5                                                  03373000
SU37BIT  EQU   SUBYTE5                                                  03374000
SU36BIT  EQU   SUBYTE5                                                  03375000
SU35BIT  EQU   SUBYTE5                                                  03376000
SU34BIT  EQU   SUBYTE5                                                  03377000
SU33BIT  EQU   SUBYTE5                                                  03378000
SU32BIT  EQU   SUBYTE5                                                  03379000
SU31BIT  EQU   SUBYTE4                                                  03380000
SU30BIT  EQU   SUBYTE4                                                  03381000
SU29BIT  EQU   SUBYTE4                                                  03382000
SU28BIT  EQU   SUBYTE4                                                  03383000
SU27BIT  EQU   SUBYTE4                                                  03384000
SU26BIT  EQU   SUBYTE4                                                  03385000
SU25BIT  EQU   SUBYTE4                                                  03386000
SU24BIT  EQU   SUBYTE4                                                  03387000
SU23BIT  EQU   SUBYTE3                                                  03388000
SU22BIT  EQU   SUBYTE3                                                  03389000
SU21BIT  EQU   SUBYTE3                                                  03390000
SU20BIT  EQU   SUBYTE3                                                  03391000
SU19BIT  EQU   SUBYTE3                                                  03392000
SU18BIT  EQU   SUBYTE3                                                  03393000
SU17BIT  EQU   SUBYTE3                                                  03394000
SU16BIT  EQU   SUBYTE3                                                  03395000
SU15BIT  EQU   SUBYTE2                                                  03396000
SU14BIT  EQU   SUBYTE2                                                  03397000
SU13BIT  EQU   SUBYTE2                                                  03398000
SU12BIT  EQU   SUBYTE2                                                  03399000
SU11BIT  EQU   SUBYTE2                                                  03400000
SU10BIT  EQU   SUBYTE2                                                  03401000
SU9BIT   EQU   SUBYTE2                                                  03402000
SU8BIT   EQU   SUBYTE2                                                  03403000
SU7BIT   EQU   SUBYTE1                                                  03404000
SU6BIT   EQU   SUBYTE1                                                  03405000
SU5BIT   EQU   SUBYTE1                                                  03406000
SU4BIT   EQU   SUBYTE1                                                  03407000
SU3BIT   EQU   SUBYTE1                                                  03408000
SU2BIT   EQU   SUBYTE1                                                  03409000
SU1BIT   EQU   SUBYTE1                                                  03410000
SU0BIT   EQU   SUBYTE1                                                  03411000
EEDETIME EQU   EEDERRID+6                                               03412000
EEDEASID EQU   EEDERRID+4                                               03413000
EEDECPUI EQU   EEDERRID+2                                               03414000
EEDESEQ# EQU   EEDERRID                                                 03415000
@NM00016 EQU   EEDERMAP                                                 03416000
EEDASID  EQU   EEDERROR+2                                               03417000
EEDERTYP EQU   EEDERROR+1                                               03418000
EEDMODE  EQU   EEDERROR                                                 03419000
@NM00010 EQU   EEDDES+2                                                 03420000
@NM00009 EQU   EEDFLAGS                                                 03421000
EEDNODMP EQU   EEDFLAGS                                                 03422000
EEDERFL  EQU   EEDFLAGS                                                 03423000
EEDID    EQU   EEDDES                                                   03424000
EEDFWRDP EQU   EED                                                      03425000
MODETCB  EQU   MODEBYTE                                                 03426000
MODESRB  EQU   MODEBYTE                                                 03427000
MODETYP1 EQU   MODEBYTE                                                 03428000
MODELOC  EQU   MODEBYTE                                                 03429000
MODEGSUS EQU   MODEBYTE                                                 03430000
MODEGSPN EQU   MODEBYTE                                                 03431000
MODEDIS  EQU   MODEBYTE                                                 03432000
MODESUPR EQU   MODEBYTE                                                 03433000
RTMBXABT EQU   RTMBRTAB+44                                              03434000
RTMBACR  EQU   RTMBRTAB+40                                              03435000
RTMBPROG EQU   RTMBRTAB+36                                              03436000
RTMBMEMT EQU   RTMBRTAB+32                                              03437000
RTMBCABT EQU   RTMBRTAB+28                                              03438000
RTMBPGIO EQU   RTMBRTAB+24                                              03439000
RTMBSVC  EQU   RTMBRTAB+20                                              03440000
RTMBMACH EQU   RTMBRTAB+16                                              03441000
RTMBREST EQU   RTMBRTAB+12                                              03442000
RTMBDAT  EQU   RTMBRTAB+8                                               03443000
RTMBPAD2 EQU   RTMBTERM+6                                               03444000
RTMBBRAN EQU   RTMBTERM+2                                               03445000
RTMBBALR EQU   RTMBTERM                                                 03446000
RT1TREGS EQU   RT1TRACK+4                                               03447000
RT1TRETY EQU   RT1TACQR                                                 03448000
RT1TLLCK EQU   RT1TACQR                                                 03449000
RT1TDISP EQU   RT1TACQR                                                 03450000
RT1TLPID EQU   RT1TRECC+1                                               03451000
RT1RTYAD EQU   RT1RTRRG+60                                              03452000
RT1R0R14 EQU   RT1RTRRG                                                 03453000
@NM00008 EQU   RT1RTRN                                                  03454000
RT1WLPN  EQU   RT1WENTR+3                                               03455000
@NM00007 EQU   RT1WCOVR                                                 03456000
RT1NODMP EQU   RT1WCOVR                                                 03457000
RT1WEREX EQU   RT1WCOVR                                                 03458000
RT1TRTCA EQU   RT1WCOVR                                                 03459000
RT1TLOCL EQU   RT1WCOVR                                                 03460000
RT1WRTM  EQU   RT1WCOVR                                                 03461000
RT1WCLUP EQU   RT1WCOVR                                                 03462000
RT1WSRMD EQU   RT1WENTR+1                                               03463000
RT1WSRBR EQU   RT1WPRSV+4                                               03464000
RT1WRTCA EQU   RT1WPRSV                                                 03465000
RT1WVARI EQU   RT1WNPRS+32                                              03466000
RT1WPSW2 EQU   RT1WNPRS+28                                              03467000
RT1WPSW1 EQU   RT1WNPRS+24                                              03468000
RT1WLPTA EQU   RT1WNPRS                                                 03469000
@NM00006 EQU   IHSA+720                                                 03470000
IHSAFRRS EQU   IHSA+120                                                 03471000
IHSAGPRS EQU   IHSA+56                                                  03472000
IHSAFPR6 EQU   IHSAFPRS+24                                              03473000
IHSAFPR4 EQU   IHSAFPRS+16                                              03474000
IHSAFPR2 EQU   IHSAFPRS+8                                               03475000
IHSAFPR0 EQU   IHSAFPRS                                                 03476000
IHSACPSW EQU   IHSA+16                                                  03477000
IHSAOTCB EQU   IHSA+12                                                  03478000
IHSANTCB EQU   IHSA+8                                                   03479000
IHSACPUT EQU   IHSA                                                     03480000
FRRSPARM EQU   FRRSENTR+8                                               03481000
@NM00005 EQU   FRRSFLGS+1                                               03482000
@NM00004 EQU   FRRSFLG1                                                 03483000
FRRSNEST EQU   FRRSFLG1                                                 03484000
FRRSRCUR EQU   FRRSFLG1                                                 03485000
FRRSFRRA EQU   FRRSENTR                                                 03486000
FRRSENTS EQU   FRRS+84                                                  03487000
FRRSCURR EQU   FRRSHEAD+12                                              03488000
CVTLEVL  EQU   CVTRELNO+2                                               03489000
CVTMDL   EQU   CVTFIX+250                                               03490000
@NM00003 EQU   CVTFIX+248                                               03491000
@NM00002 EQU   CVTFIX                                                   03492000
CVTRV482 EQU   CVTXTNT2+128                                             03493000
CVTRV481 EQU   CVTXTNT2+124                                             03494000
CVTRV480 EQU   CVTXTNT2+120                                             03495000
CVTRV479 EQU   CVTXTNT2+118                                             03496000
CVTRV478 EQU   CVTXTNT2+117                                             03497000
CVTRV477 EQU   CVTXTNT2+116                                             03498000
CVTRV476 EQU   CVTXTNT2+115                                             03499000
CVTRV475 EQU   CVTXTNT2+114                                             03500000
CVTRV474 EQU   CVTRV466                                                 03501000
CVTRV473 EQU   CVTRV466                                                 03502000
CVTRV472 EQU   CVTRV466                                                 03503000
CVTRV471 EQU   CVTRV466                                                 03504000
CVTRV470 EQU   CVTRV466                                                 03505000
CVTRV469 EQU   CVTRV466                                                 03506000
CVTRV468 EQU   CVTRV466                                                 03507000
CVTRV467 EQU   CVTRV466                                                 03508000
CVTRV465 EQU   CVTRV457                                                 03509000
CVTRV464 EQU   CVTRV457                                                 03510000
CVTRV463 EQU   CVTRV457                                                 03511000
CVTRV462 EQU   CVTRV457                                                 03512000
CVTRV461 EQU   CVTRV457                                                 03513000
CVTRV460 EQU   CVTRV457                                                 03514000
CVTRV459 EQU   CVTRV457                                                 03515000
CVTRV458 EQU   CVTRV457                                                 03516000
CVTRV456 EQU   CVTXTNT2+108                                             03517000
CVTRV455 EQU   CVTXTNT2+104                                             03518000
CVTRV454 EQU   CVTXTNT2+100                                             03519000
CVTRV453 EQU   CVTXTNT2+96                                              03520000
CVTRV452 EQU   CVTXTNT2+94                                              03521000
CVTRV451 EQU   CVTXTNT2+92                                              03522000
CVTRV450 EQU   CVTXTNT2+90                                              03523000
CVTRV449 EQU   CVTXTNT2+88                                              03524000
CVTRV448 EQU   CVTXTNT2+87                                              03525000
CVTRV447 EQU   CVTXTNT2+86                                              03526000
CVTRV446 EQU   CVTRV438                                                 03527000
CVTRV445 EQU   CVTRV438                                                 03528000
CVTRV444 EQU   CVTRV438                                                 03529000
CVTRV443 EQU   CVTRV438                                                 03530000
CVTRV442 EQU   CVTRV438                                                 03531000
CVTRV441 EQU   CVTRV438                                                 03532000
CVTRV440 EQU   CVTRV438                                                 03533000
CVTRV439 EQU   CVTRV438                                                 03534000
CVTRV437 EQU   CVTRV429                                                 03535000
CVTRV436 EQU   CVTRV429                                                 03536000
CVTRV435 EQU   CVTRV429                                                 03537000
CVTRV434 EQU   CVTRV429                                                 03538000
CVTRV433 EQU   CVTRV429                                                 03539000
CVTRV432 EQU   CVTRV429                                                 03540000
CVTRV431 EQU   CVTRV429                                                 03541000
CVTRV430 EQU   CVTRV429                                                 03542000
CVTRV428 EQU   CVTXTNT2+80                                              03543000
CVTRV427 EQU   CVTXTNT2+76                                              03544000
CVTRV426 EQU   CVTXTNT2+72                                              03545000
CVTRV425 EQU   CVTXTNT2+68                                              03546000
CVTATACT EQU   CVTATCVT                                                 03547000
CVTRV423 EQU   CVTXTNT2+62                                              03548000
CVTRV422 EQU   CVTXTNT2+60                                              03549000
CVTRV421 EQU   CVTXTNT2+58                                              03550000
CVTRV420 EQU   CVTXTNT2+56                                              03551000
CVTRV419 EQU   CVTXTNT2+55                                              03552000
CVTRV418 EQU   CVTXTNT2+54                                              03553000
CVTRV417 EQU   CVTRV409                                                 03554000
CVTRV416 EQU   CVTRV409                                                 03555000
CVTRV415 EQU   CVTRV409                                                 03556000
CVTRV414 EQU   CVTRV409                                                 03557000
CVTRV413 EQU   CVTRV409                                                 03558000
CVTRV412 EQU   CVTRV409                                                 03559000
CVTRV411 EQU   CVTRV409                                                 03560000
CVTRV410 EQU   CVTRV409                                                 03561000
CVTRV408 EQU   CVTRV400                                                 03562000
CVTRV407 EQU   CVTRV400                                                 03563000
CVTRV406 EQU   CVTRV400                                                 03564000
CVTRV405 EQU   CVTRV400                                                 03565000
CVTRV404 EQU   CVTRV400                                                 03566000
CVTRV403 EQU   CVTRV400                                                 03567000
CVTRV402 EQU   CVTRV400                                                 03568000
CVTRV401 EQU   CVTRV400                                                 03569000
CVTICB   EQU   CVTXTNT2+48                                              03570000
CVTSKTA  EQU   CVTXTNT2+44                                              03571000
CVTCCVT  EQU   CVTXTNT2+40                                              03572000
CVTRSV98 EQU   CVTXTNT2+36                                              03573000
CVTRSV97 EQU   CVTXTNT2+34                                              03574000
CVTRSV96 EQU   CVTXTNT2+32                                              03575000
CVTOLTEP EQU   CVTXTNT2+28                                              03576000
CVTQIDA  EQU   CVTQID+1                                                 03577000
CVTRSV95 EQU   CVTQID                                                   03578000
CVTRSV94 EQU   CVTXTNT2+20                                              03579000
CVTRSV93 EQU   CVTXTNT2+16                                              03580000
CVTRSV92 EQU   CVTXTNT2+12                                              03581000
CVTDEBVR EQU   CVTXTNT2+8                                               03582000
CVTRSV91 EQU   CVTXTNT2+6                                               03583000
CVTRSV9H EQU   CVTFLGBT                                                 03584000
CVTRSV9G EQU   CVTFLGBT                                                 03585000
CVTRSV9F EQU   CVTFLGBT                                                 03586000
CVTRSV9E EQU   CVTFLGBT                                                 03587000
CVTRSV9D EQU   CVTFLGBT                                                 03588000
CVTBAH   EQU   CVTFLGBT                                                 03589000
CVTVME   EQU   CVTFLGBT                                                 03590000
CVTNPE   EQU   CVTFLGBT                                                 03591000
CVTNUCLS EQU   CVTXTNT2+4                                               03592000
CVTDSSVA EQU   CVTDSSV+1                                                03593000
CVTRSV89 EQU   CVTDSSV                                                  03594000
CVTRSV88 EQU   CVTXTNT1+8                                               03595000
CVTRSV87 EQU   CVTXTNT1+4                                               03596000
CVTFACHN EQU   CVTXTNT1                                                 03597000
CVTRV488 EQU   CVTMAP+412                                               03598000
CVTRV487 EQU   CVTMAP+408                                               03599000
CVTRV486 EQU   CVTMAP+404                                               03600000
CVTRV485 EQU   CVTMAP+400                                               03601000
CVTACTAP EQU   CVTMAP+396                                               03602000
CVTAUTH  EQU   CVTMAP+392                                               03603000
CVTRV490 EQU   CVTMAP+388                                               03604000
CVTSU    EQU   CVTMAP+384                                               03605000
CVTVOLT1 EQU   CVTVOLM1+1                                               03606000
CVTVOLI1 EQU   CVTVOLF1                                                 03607000
CVTSTOA  EQU   CVTMAP+376                                               03608000
CVTRSV58 EQU   CVTMAP+374                                               03609000
CVTRSV57 EQU   CVTMAP+372                                               03610000
CVTDDCE  EQU   CVTMAP+368                                               03611000
CVTPNWFR EQU   CVTMAP+364                                               03612000
CVTSMF   EQU   CVTMAP+360                                               03613000
CVTSULK  EQU   CVTMAP+358                                               03614000
CVTSLKO  EQU   CVTSYSK                                                  03615000
CVTSLKP  EQU   CVTSYSK                                                  03616000
CVTSLKQ  EQU   CVTSYSK                                                  03617000
CVTSLKR  EQU   CVTSYSK                                                  03618000
CVTRSV56 EQU   CVTSYSK                                                  03619000
CVTRSV55 EQU   CVTSYSK                                                  03620000
CVTRSV54 EQU   CVTSYSK                                                  03621000
CVTRSV53 EQU   CVTSYSK                                                  03622000
CVTRSV52 EQU   CVTA1F1                                                  03623000
CVTRSV51 EQU   CVTA1F1                                                  03624000
CVTRSV50 EQU   CVTA1F1                                                  03625000
CVTRSV49 EQU   CVTA1F1                                                  03626000
CVTRSV48 EQU   CVTA1F1                                                  03627000
CVTRSV47 EQU   CVTA1F1                                                  03628000
CVTSRSW  EQU   CVTA1F1                                                  03629000
CVTPFSW  EQU   CVTA1F1                                                  03630000
CVTPCVT  EQU   CVTMAP+352                                               03631000
CVTRSV46 EQU   CVTMAP+344                                               03632000
CVTRSV45 EQU   CVTMAP+340                                               03633000
CVTRSV44 EQU   CVTMAP+338                                               03634000
CVTRSV43 EQU   CVTMAP+336                                               03635000
CVTHJESA EQU   CVTHJES+1                                                03636000
CVTRSV42 EQU   CVTHJES                                                  03637000
CVTEXT2A EQU   CVTEXT2+1                                                03638000
CVTRSV41 EQU   CVTEXT2                                                  03639000
CVTAPFA  EQU   CVTAPF+1                                                 03640000
CVTRSV40 EQU   CVTAPF                                                   03641000
CVTRV518 EQU   CVTINTLA                                                 03642000
CVTRV517 EQU   CVTERPV                                                  03643000
CVTEORM  EQU   CVTMAP+312                                               03644000
CVTMCHPR EQU   CVTMAP+308                                               03645000
CVTTZ    EQU   CVTMAP+304                                               03646000
CVTJEPS  EQU   CVTMAP+300                                               03647000
CVTJESCT EQU   CVTMAP+296                                               03648000
CVTMODE  EQU   CVTMAP+292                                               03649000
CVTPTRV  EQU   CVTMAP+288                                               03650000
CVTREAL  EQU   CVTMAP+284                                               03651000
CVTRSV39 EQU   CVTMAP+280                                               03652000
CVTRSV38 EQU   CVTMAP+276                                               03653000
CVTDMSRA EQU   CVTDMSR+1                                                03654000
CVTRV634 EQU   CVTDMSRF                                                 03655000
CVTRV633 EQU   CVTDMSRF                                                 03656000
CVTRV632 EQU   CVTDMSRF                                                 03657000
CVTRV631 EQU   CVTDMSRF                                                 03658000
CVTRV630 EQU   CVTDMSRF                                                 03659000
CVTRV629 EQU   CVTDMSRF                                                 03660000
CVTUDUMP EQU   CVTDMSRF                                                 03661000
CVTSDUMP EQU   CVTDMSRF                                                 03662000
CVTQMSGA EQU   CVTQMSG+1                                                03663000
CVTRSV36 EQU   CVTQMSG                                                  03664000
CVTAMFF  EQU   CVTMAP+264                                               03665000
CVTPURGA EQU   CVTPURG+1                                                03666000
CVTRSV35 EQU   CVTPURG                                                  03667000
CVTCBSP  EQU   CVTMAP+256                                               03668000
CVTATERA EQU   CVTATER+1                                                03669000
CVTSYST  EQU   CVTATER                                                  03670000
CVTVOLT2 EQU   CVTTAT                                                   03671000
CVTVOLI2 EQU   CVTVOLF2                                                 03672000
CVTAQAVB EQU   CVTAQAVT+1                                               03673000
CVTRSV34 EQU   CVTTCMFG                                                 03674000
CVTRSV33 EQU   CVTTCMFG                                                 03675000
CVTRSV32 EQU   CVTTCMFG                                                 03676000
CVTRSV31 EQU   CVTTCMFG                                                 03677000
CVTRSV30 EQU   CVTTCMFG                                                 03678000
CVTRSV29 EQU   CVTTCMFG                                                 03679000
CVTLDEV  EQU   CVTTCMFG                                                 03680000
CVTTCRDY EQU   CVTTCMFG                                                 03681000
CVTGTFA  EQU   CVTGTF+1                                                 03682000
CVTRSV27 EQU   CVTGTFST                                                 03683000
CVTRNIO  EQU   CVTGTFST                                                 03684000
CVTUSR   EQU   CVTGTFST                                                 03685000
CVTRV318 EQU   CVTFORM                                                  03686000
CVTRV317 EQU   CVTTMODE                                                 03687000
CVTRV316 EQU   CVTSTATE                                                 03688000
CVTRV315 EQU   CVTGTFS                                                  03689000
CVTGTFAV EQU   CVTGTFS                                                  03690000
CVT0SCR1 EQU   CVTMAP+232                                               03691000
CVTRV515 EQU   CVTMAP+228                                               03692000
CVTRMS   EQU   CVTMAP+224                                               03693000
CVTPATCH EQU   CVTMAP+220                                               03694000
CVTTSCE  EQU   CVTMAP+216                                               03695000
CVTLNKSC EQU   CVTMAP+214                                               03696000
CVTQABST EQU   CVTMAP+212                                               03697000
CVTMDLDS EQU   CVTMAP+208                                               03698000
CVTUSER  EQU   CVTMAP+204                                               03699000
CVTABEND EQU   CVTMAP+200                                               03700000
CVTSMCA  EQU   CVTMAP+196                                               03701000
CVTRSV18 EQU   CVTMAP+192                                               03702000
CVTQLPAQ EQU   CVTMAP+188                                               03703000
CVTQCDSR EQU   CVTMAP+184                                               03704000
CVTVS1B  EQU   CVTOPTB                                                  03705000
CVTVS1A  EQU   CVTOPTB                                                  03706000
CVTFP    EQU   CVTOPTB                                                  03707000
CVTAPTHR EQU   CVTOPTB                                                  03708000
CVTNLOG  EQU   CVTOPTB                                                  03709000
CVTTOD   EQU   CVTOPTB                                                  03710000
CVTCTIMS EQU   CVTOPTB                                                  03711000
CVTPROT  EQU   CVTOPTB                                                  03712000
CVTXPFP  EQU   CVTOPTA                                                  03713000
CVTASCII EQU   CVTOPTA                                                  03714000
CVTRSV13 EQU   CVTOPTA                                                  03715000
CVTRSV12 EQU   CVTOPTA                                                  03716000
CVTNIP   EQU   CVTOPTA                                                  03717000
CVTDDR   EQU   CVTOPTA                                                  03718000
CVTAPR   EQU   CVTOPTA                                                  03719000
CVTCCH   EQU   CVTOPTA                                                  03720000
CVTSNCTR EQU   CVTMAP+180                                               03721000
CVTQMWR  EQU   CVTMAP+176                                               03722000
CVTQOCR  EQU   CVTMAP+172                                               03723000
CVT1EF00 EQU   CVTMAP+168                                               03724000
CVTMZ00  EQU   CVTMAP+164                                               03725000
CVTSV76Q EQU   CVTSV76C                                                 03726000
CVTRSV11 EQU   CVTMAP+156                                               03727000
CVT0PT01 EQU   CVTMAP+152                                               03728000
CVTMSER  EQU   CVTMAP+148                                               03729000
CVTRV516 EQU   CVTIERLC                                                 03730000
CVTILCH  EQU   CVTMAP+140                                               03731000
CVT0DS   EQU   CVTMAP+136                                               03732000
CVTFBOSV EQU   CVTMAP+132                                               03733000
CVTNUCB  EQU   CVTMAP+128                                               03734000
CVTIXAVL EQU   CVTMAP+124                                               03735000
CVTSV76M EQU   CVTIOQET                                                 03736000
CVTDCBA  EQU   CVTMAP+117                                               03737000
CVTMVS2  EQU   CVTDCB                                                   03738000
CVT6DAT  EQU   CVTDCB                                                   03739000
CVT4MPS  EQU   CVTDCB                                                   03740000
CVTRSV09 EQU   CVTDCB                                                   03741000
CVT4MS1  EQU   CVTDCB                                                   03742000
CVT2SPS  EQU   CVTDCB                                                   03743000
CVT1SSS  EQU   CVTDCB                                                   03744000
CVTRSV08 EQU   CVTDCB                                                   03745000
CVTSTB   EQU   CVTMAP+112                                               03746000
CVTQTD00 EQU   CVTMAP+108                                               03747000
CVTQTE00 EQU   CVTMAP+104                                               03748000
CVTCUCB  EQU   CVTMAP+100                                               03749000
CVTSJQ   EQU   CVTMAP+96                                                03750000
CVTPBLDL EQU   CVTMAP+92                                                03751000
CVTTPC   EQU   CVTMAP+88                                                03752000
CVTSVDCB EQU   CVTMAP+84                                                03753000
CVTBRET  EQU   CVTMAP+82                                                03754000
CVTEXIT  EQU   CVTMAP+80                                                03755000
CVT0FN00 EQU   CVTMAP+76                                                03756000
CVTDARA  EQU   CVTDAR+1                                                 03757000
CVTRSV07 EQU   CVTFLGS1                                                 03758000
CVTRSV06 EQU   CVTFLGS1                                                 03759000
CVTRSV05 EQU   CVTFLGS1                                                 03760000
CVTRSV04 EQU   CVTFLGS1                                                 03761000
CVTRSV03 EQU   CVTFLGS1                                                 03762000
CVTRSV02 EQU   CVTFLGS1                                                 03763000
CVTRSV01 EQU   CVTFLGS1                                                 03764000
CVTDMPLK EQU   CVTFLGS1                                                 03765000
CVTXITP  EQU   CVTMAP+68                                                03766000
CVTZDTAB EQU   CVTMAP+64                                                03767000
CVTMSLT  EQU   CVTMAP+60                                                03768000
CVTDATE  EQU   CVTMAP+56                                                03769000
CVTSYSAD EQU   CVTMAP+48                                                03770000
CVTXTLER EQU   CVTMAP+44                                                03771000
CVTILK2  EQU   CVTMAP+40                                                03772000
CVTILK1  EQU   CVTMAP+36                                                03773000
CVTPRLTV EQU   CVTMAP+32                                                03774000
CVTPCNVT EQU   CVTMAP+28                                                03775000
CVT0VL00 EQU   CVTMAP+24                                                03776000
CVTXAPG  EQU   CVTMAP+20                                                03777000
CVTBUF   EQU   CVTMAP+16                                                03778000
CVTJOB   EQU   CVTMAP+12                                                03779000
CVTLINK  EQU   CVTMAP+8                                                 03780000
CVT0EF00 EQU   CVTMAP+4                                                 03781000
CVTTCBP  EQU   CVTMAP                                                   03782000
CVT      EQU   CVTMAP                                                   03783000
ADPLABDA EQU   ABDPL+56                                                 03784000
ADPLEXT  EQU   ABDPL+52                                                 03785000
ADPLCOM4 EQU   ABDPL+40                                                 03786000
ADPLCOM3 EQU   ABDPL+36                                                 03787000
@NM00001 EQU   ADPLFLAG                                                 03788000
ADPLDMGT EQU   ADPLFLAG                                                 03789000
ADPLSYTM EQU   ADPLFLAG                                                 03790000
ADPLSBPL EQU   ABDPL+6                                                  03791000
ADPLASID EQU   ABDPL+4                                                  03792000
ADPLTCB  EQU   ABDPL                                                    03793000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03794000
@RC00134 EQU   @RC00130                                                 03795000
@RC00140 EQU   @RC00130                                                 03796000
@RC00303 EQU   @RC00282                                                 03797000
@RC00427 EQU   @EL00005                                                 03798000
@RC00434 EQU   @EL00005                                                 03799000
@RC00432 EQU   @EL00005                                                 03800000
@RC00144 EQU   @RC00140                                                 03801000
@RC00312 EQU   @RC00303                                                 03802000
@RC00316 EQU   @RC00312                                                 03803000
@ENDDATA EQU   *                                                        03804000
         END   IEAFTIHS,(C'PLS1846',0701,78033)                         03805000
