         TITLE 'IEAFTRT2-RTM2WA-ESA-SDWA FORMAT MODULE                 *00001000
                        '                                               00002000
IEAFTRT2 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL2(@EP00001-@MAINENT)                                   00007000
         DC    AL1(16)                                             0001 00008000
         DC    C'IEAFTRT2  77.091'                                 0001 00009000
IEAFTESA DS    0H                                                  0001 00010000
         USING *,@15                                               0001 00011000
         B     @PROLOG                                             0001 00012000
         DC    AL2(@EP00536-IEAFTESA)                                   00013000
         ENTRY IEAFTESA                                                 00014000
IEAFTSDW DS    0H                                                  0001 00015000
         USING *,@15                                               0001 00016000
         B     @PROLOG                                             0001 00017000
         DC    AL2(@EP00636-IEAFTSDW)                                   00018000
         ENTRY IEAFTSDW                                                 00019000
         DROP  @15                                                      00020000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00021000
         BALR  @10,0                                               0001 00022000
@PSTART  LA    @11,4095(,@10)                                      0001 00023000
         LA    @12,4095(,@11)                                      0001 00024000
         USING @PSTART,@10                                         0001 00025000
         USING @PSTART+4095,@11                                    0001 00026000
         USING @PSTART+8190,@12                                    0001 00027000
         L     @00,@SIZDATD                                        0001 00028000
         GETMAIN  R,LV=(0)                                              00029000
         LR    @09,@01                                             0001 00030000
         USING @DATD,@09                                           0001 00031000
         ST    @13,@SA00001+4                                      0001 00032000
         LM    @15,@01,16(@13)                                     0001 00033000
         ST    @09,8(,@13)                                         0001 00034000
         LR    @13,@09                                             0001 00035000
         AH    @15,4(,@15)                                         0001 00036000
         BR    @15                                                 0001 00037000
@EP00001 DS    0H                                                  0002 00038000
RBPRFXLN EQU 64                                                         00039000
RBPRFLNA EQU 32                                                         00040000
PRBLEN   EQU 136                                                        00041000
SIRBLEN  EQU 200                                                        00042000
TIRBLEN  EQU 136                                                        00043000
IRBLEN   EQU 128                                                        00044000
SVRBLEN  EQU 224                                                        00045000
*                                                                  0189 00046000
*/********************************************************************/ 00047000
*/* FUNCTION -                                                     0189 00048000
*      ROUTINE WHICH FORMATS THE RTM2 WORK AREA.                   0189 00049000
*      IT SETS UP THE NEEDED POINTERS TO BE PASSED TO THE FORMAT   0189 00050000
*      ROUTINE SENT IN THE PARAMETER LIST.  FOR ANY ERROR ACCESSING     00051000
*      A NEEDED FIELD IN THE RTM2WA OR FOR NON-ZERO RETURN CODE    0189 00052000
*      FROM THE FORMATTING SERVICE, THE FOLLOWING MESSAGE WILL BE  0189 00053000
*      PRINTED:                                                    0189 00054000
*               *** FORMATTING SERVICE ROUTINE ERROR DURING        0189 00055000
*               RTM2WA FORMATTING(POSSIBLE CAUSE:  DATA NOT IN     0189 00056000
*               DUMP) ***                                          0189 00057000
*      AT THIS POINT PROCESSING WOULD TERMINATE. IF THE RTM2WA IS  0189 00058000
*      FORMATTED WITHOUT ERROR, A SUMMARY OF THE RTM2WA IMPORTANT  0189 00059000
*      AREA IS PRINTED. IF THIS COMPLETES SUCCESSFULLY, A BIT SUMMARY   00060000
*      IS PRINTED USING THE ANALYZE PROC.                          0189 00061000
*                                                                  0189 00062000
*   INPUT -                                                        0189 00063000
*      REGISTER 1 POINTS TO THE PARMLIST WHICH CONTAINS THE        0189 00064000
*      ADDRESS OF THE CONTROL BLOCK TO BE FORMATTED IN ADPLFMT2.   0189 00065000
*      ADPLFMT1 ALSO DEFINES AS START, CONTAINS THE OFFSET TO BE   0189 00066000
*      PLACED ALONG SIDE THE FIRST FIELD IN THE CONTROL BLOCK, AND 0189 00067000
*      ADPLCOM1 CONTAINS THE ADDRESS OF THE ESTAE PARAMETER LIST.  0189 00068000
*                                                                  0189 00069000
*   CALLS -                                                        0189 00070000
*      CALLS ACCESRTN, CONVERT, FMTRTN, PRINT, RT2SUM, AND SPECIAL 0189 00071000
*                                                                  0189 00072000
*   CALLED BY -                                                    0189 00073000
*      IEAVTFMT TO FORMAT RTM2WA                                   0189 00074000
*                                                                  0189 00075000
*   RETURNS TO -                                                   0189 00076000
*      IEAVTFMT WITH RETURN CODE SET BY ACCESS OR FORMAT           0189 00077000
*      SERVICE ROUTINES                                              */ 00078000
*/********************************************************************/ 00079000
*                                                                  0189 00080000
*   ESTAPTR=ADPLCOM1;               /* SAVE PTR TO ESTAE PARM LIST   */ 00081000
         L     @14,ADPLCOM1(,ABDPLPTR)                             0189 00082000
         ST    @14,ESTAPTR                                         0189 00083000
*   STM(VADR,RCREG,LCALREGS);       /* SAVE REGS FOR RETRY           */ 00084000
         STM   VADR,RCREG,LCALREGS(@14)                            0190 00085000
*   ADPLCOM1=ADDR(RT2FMT);          /* FORMAT ERROR MSG              */ 00086000
         LA    @14,RT2FMT                                          0191 00087000
         ST    @14,ADPLCOM1(,ABDPLPTR)                             0191 00088000
*   RTM2PTR=ADPLFMT2;               /* PTR TO RTM2 WORK AREA         */ 00089000
         L     @14,ADPLFMT2(,ABDPLPTR)                             0192 00090000
         LR    RTM2PTR,@14                                         0192 00091000
*   SAVEPTR=ADPLFMT2-START;         /* VALUE FOR OFFSET              */ 00092000
         SL    @14,START(,ABDPLPTR)                                0193 00093000
         ST    @14,SAVEPTR                                         0193 00094000
*   BITS=BITS&&BITS;                /* TURN OFF THE SUBIT FLAGS AND     00095000
*                                      ERROR                   SWITCH*/ 00096000
*                                                                  0194 00097000
         XC    BITS(1),BITS                                        0194 00098000
*   /*****************************************************************/ 00099000
*   /*                                                               */ 00100000
*   /* IN RELEASE 2, THE POINTER TO THE SUBITS WAS NOT DEFINED.      */ 00101000
*   /* THEREFORE, BEFORE ACCESSING THE SUBIT POINTER, CHECK FOR      */ 00102000
*   /* RELEASE 2                                                     */ 00103000
*   /*                                                               */ 00104000
*   /*****************************************************************/ 00105000
*                                                                  0195 00106000
*   VADR=ADDR(CVTNUMB);             /* RELEASE NUMBER                */ 00107000
         L     @14,CVTPTR(,ABDPLPTR)                               0195 00108000
         AL    @14,@CF03887                                        0195 00109000
         LR    VADR,@14                                            0195 00110000
*   CALL ACCESRTN;                  /* ACCESS IT                     */ 00111000
         BAL   @14,ACCESRTN                                        0196 00112000
*   IF RCREG^=ZERO THEN             /* ACCESS ERROR                  */ 00113000
         LTR   RCREG,RCREG                                         0197 00114000
         BZ    @RF00197                                            0197 00115000
*     BUFFER(1:LENGTH(RT2FMT))=RT2FMT;                             0198 00116000
         L     @14,ADPLBUF(,ABDPLPTR)                              0198 00117000
         MVC   BUFFER(120,@14),RT2FMT                              0198 00118000
*   ELSE                            /* FOUND RELEASE NUMBER          */ 00119000
*     DO;                                                          0199 00120000
         B     @RC00197                                            0199 00121000
@RF00197 DS    0H                                                  0200 00122000
*       IF DATAHALF^=REL2 THEN      /* NOT A RELEASE 2 SYSTEM        */ 00123000
         CLC   DATAHALF(2,DATAPTR),REL2                            0200 00124000
         BE    @RF00200                                            0200 00125000
*         DO;                                                      0201 00126000
*                                                                  0201 00127000
*           /*********************************************************/ 00128000
*           /*                                                       */ 00129000
*           /* FIND WHICH SUS ARE ON THE SYSTEM                      */ 00130000
*           /*                                                       */ 00131000
*           /*********************************************************/ 00132000
*                                                                  0202 00133000
*           VADR=ADDR(CVTIHASU);    /* SU BIT PTR                    */ 00134000
         L     @14,CVTPTR(,ABDPLPTR)                               0202 00135000
         LA    VADR,CVTIHASU(,@14)                                 0202 00136000
*           CALL ACCESRTN;          /* ACCESS IT                     */ 00137000
         BAL   @14,ACCESRTN                                        0203 00138000
*           IF RCREG^=ZERO THEN     /* ACCESS ERROR                  */ 00139000
         LTR   RCREG,RCREG                                         0204 00140000
         BZ    @RF00204                                            0204 00141000
*             DO;                                                  0205 00142000
*               BUFFER(1:LENGTH(RT2FMT))=RT2FMT;/* ERROR MSG         */ 00143000
         L     @14,ADPLBUF(,ABDPLPTR)                              0206 00144000
         MVC   BUFFER(120,@14),RT2FMT                              0206 00145000
*               ERRSW=ON;           /* INDICATE ACCESS ERROR         */ 00146000
         OI    ERRSW,B'00100000'                                   0207 00147000
*             END;                  /* END ACCESS ERROR              */ 00148000
*           ELSE                                                   0209 00149000
*             DO;                   /* FOUND SU BIT PTR              */ 00150000
         B     @RC00204                                            0209 00151000
@RF00204 DS    0H                                                  0210 00152000
*               IF DATAWORD^=ZERO THEN/* IF PTR TO SUBITS NOT ZERO-SU   00153000
*                                                              SYSTEM*/ 00154000
         L     @14,DATAWORD(,DATAPTR)                              0210 00155000
         LTR   @14,@14                                             0210 00156000
         BZ    @RF00210                                            0210 00157000
*                 DO;                                              0211 00158000
*                   VADR=DATAWORD;  /* SU BITS                       */ 00159000
         LR    VADR,@14                                            0212 00160000
*                   CALL ACCESRTN;  /* ACCESS BITS-THEY ARE ON A   0213 00161000
*                                      DWORD BDY SO 2 WORDS CAN BE 0213 00162000
*                                      GUARENTEED                    */ 00163000
         BAL   @14,ACCESRTN                                        0213 00164000
*                   IF RCREG^=ZERO THEN/* ACCESS ERROR               */ 00165000
         LTR   RCREG,RCREG                                         0214 00166000
         BZ    @RF00214                                            0214 00167000
*                     DO;                                          0215 00168000
*                       BUFFER(1:LENGTH(RT2FMT))=RT2FMT;           0216 00169000
         L     @14,ADPLBUF(,ABDPLPTR)                              0216 00170000
         MVC   BUFFER(120,@14),RT2FMT                              0216 00171000
*                       ERRSW=ON;   /* ERROR INDICATOR TO STOP     0217 00172000
*                                      PROCESSING                    */ 00173000
         OI    ERRSW,B'00100000'                                   0217 00174000
*                     END;          /* END ACCESS ERROR              */ 00175000
*                   ELSE                                           0219 00176000
*                     DO;           /* FOUND SU BIT STRING           */ 00177000
         B     @RC00214                                            0219 00178000
@RF00214 DS    0H                                                  0220 00179000
*                       IF SU17BIT=ON THEN                         0220 00180000
         TM    SU17BIT(DATAPTR),B'01000000'                        0220 00181000
         BNO   @RF00220                                            0220 00182000
*                         SU17SAVE=ON;/* SU 17 ON SYSTEM             */ 00183000
         OI    SU17SAVE,B'10000000'                                0221 00184000
*                       ELSE                                       0222 00185000
*                         ;         /* SU17 NOT ON SYSTEM            */ 00186000
@RF00220 DS    0H                                                  0223 00187000
*                       IF SU33BIT=ON THEN                         0223 00188000
         TM    SU33BIT(DATAPTR),B'01000000'                        0223 00189000
         BNO   @RF00223                                            0223 00190000
*                         SU33SAVE=ON;/* SU 33 ON SYSTEM             */ 00191000
         OI    SU33SAVE,B'01000000'                                0224 00192000
*                       ELSE                                       0225 00193000
*                         ;         /* SU33 NOT ON SYSTEM            */ 00194000
@RF00223 DS    0H                                                  0226 00195000
*                     END;          /* END SU BIT STRING FOUND       */ 00196000
*                 END;              /* END SU SYSTEM                 */ 00197000
*               ELSE                                               0228 00198000
*                 ;                 /* PRE SU SYSTEM-NO SU BITS TO 0228 00199000
*                                      SET                           */ 00200000
@RF00210 DS    0H                                                  0229 00201000
*             END;                  /* END FOUND SUBIT POINTER       */ 00202000
*         END;                      /* END NOT A RELEASE 2 SYSTEM    */ 00203000
*       ELSE                                                       0231 00204000
*         ;                         /* IS A RELEASE 2 SYSTEM, NO SUS */ 00205000
@RF00200 DS    0H                                                  0232 00206000
*       IF ERRSW=OFF THEN           /* CONTINUE IF FOUND SYSTEM OK   */ 00207000
@RC00200 TM    ERRSW,B'00100000'                                   0232 00208000
         BNZ   @RF00232                                            0232 00209000
*         DO;                                                      0233 00210000
*           BUFFER(1:LENGTH(RT2HDR))=RT2HDR;/* TITLE                 */ 00211000
         L     @14,ADPLBUF(,ABDPLPTR)                              0234 00212000
         MVC   BUFFER(54,@14),RT2HDR                               0234 00213000
*           PACKAREA=RTM2PTR;       /* PLACE PTR INTO CHAR AREA      */ 00214000
         ST    RTM2PTR,PACKAREA                                    0235 00215000
*           GARBAGE='04'X;          /* GARBAGE BYTE FOR THE UNPK     */ 00216000
         MVI   GARBAGE,X'04'                                       0236 00217000
*           UNPK(ADDRESS,UNPACK);   /* PLACE IN BUFFER               */ 00218000
         UNPK  ADDRESS(9,@14),UNPACK(5)                            0237 00219000
*           TR(ADDRESS,TRANS);      /* TRANSLATE TO PRINTABLE HEX    */ 00220000
         TR    ADDRESS(9,@14),TRANS                                0238 00221000
*           CALL PRINT;             /* PRINT IT                      */ 00222000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0239 00223000
         BALR  @14,@15                                             0239 00224000
*           BUFFER(1:LENGTH(RT2US))=RT2US;/* UNDERSCORE              */ 00225000
         L     @14,ADPLBUF(,ABDPLPTR)                              0240 00226000
         MVC   BUFFER(7,@14),RT2US                                 0240 00227000
*           CALL PRINT;             /* PRINT IT                      */ 00228000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0241 00229000
         BALR  @14,@15                                             0241 00230000
*           CALL PRINT;             /* BLANK                         */ 00231000
*                                                                  0242 00232000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0242 00233000
         BALR  @14,@15                                             0242 00234000
*           /*********************************************************/ 00235000
*           /*                                                       */ 00236000
*           /* FORMAT RTM2WA                                         */ 00237000
*           /*                                                       */ 00238000
*           /*********************************************************/ 00239000
*                                                                  0243 00240000
*           DO ARRAYCNT=1 TO ARRAYMAX WHILE(ERRSW=OFF);/* FORMAT LOOP*/ 00241000
         LA    ARRAYCNT,1                                          0243 00242000
@DL00243 TM    ERRSW,B'00100000'                                   0243 00243000
         BNZ   @DC00243                                            0243 00244000
*             IF RT2ARRAY(ARRAYCNT)>=SPEC THEN                     0244 00245000
         LR    @14,ARRAYCNT                                        0244 00246000
         SLA   @14,2                                               0244 00247000
         L     @14,RT2ARRAY-4(@14)                                 0244 00248000
         CH    @14,@CH01675                                        0244 00249000
         BL    @RF00244                                            0244 00250000
*               CALL SPECIAL;       /* ROUTINE TO DIFFERENCIATE SU'S */ 00251000
         BAL   @14,SPECIAL                                         0245 00252000
*             ELSE                                                 0246 00253000
*               IF RT2ARRAY(ARRAYCNT)=BLANK THEN                   0246 00254000
         B     @RC00244                                            0246 00255000
@RF00244 LR    @14,ARRAYCNT                                        0246 00256000
         SLA   @14,2                                               0246 00257000
         L     @14,RT2ARRAY-4(@14)                                 0246 00258000
         CH    @14,@CH02753                                        0246 00259000
         BNE   @RF00246                                            0246 00260000
*                 CALL PRINT;       /* PRINT A BLANK LINE            */ 00261000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0247 00262000
         BALR  @14,@15                                             0247 00263000
*               ELSE                                               0248 00264000
*                 DO;               /* LINE TO BE OUTPUT             */ 00265000
         B     @RC00246                                            0248 00266000
@RF00246 DS    0H                                                  0249 00267000
*                   LINEPTR=RTM2NAME(RT2ARRAY(ARRAYCNT));/* FORMAT 0249 00268000
*                                      PATTERN PTR                   */ 00269000
         LR    @14,ARRAYCNT                                        0249 00270000
         SLA   @14,2                                               0249 00271000
         L     @14,RT2ARRAY-4(@14)                                 0249 00272000
         LR    @07,@14                                             0249 00273000
         SLA   @07,2                                               0249 00274000
         L     LINEPTR,RTM2NAME-4(@07)                             0249 00275000
*                   IF RT2ARRAY(ARRAYCNT)>=9 THEN/* TITLE LINE OR  0250 00276000
*                                      HEADER TEXT                   */ 00277000
         CH    @14,@CH01564                                        0250 00278000
         BL    @RF00250                                            0250 00279000
*                     DO;                                          0251 00280000
*                       BUFFER=TITLE;/* PUT IN BUFFER                */ 00281000
         L     @14,ADPLBUF(,ABDPLPTR)                              0252 00282000
         MVI   BUFFER+31(@14),C' '                                 0252 00283000
         MVC   BUFFER+32(88,@14),BUFFER+31(@14)                    0252 00284000
         LR    @07,LINEPTR                                         0252 00285000
         MVC   BUFFER(31,@14),TITLE(@07)                           0252 00286000
*                       CALL PRINT; /* PRINT IT                      */ 00287000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0253 00288000
         BALR  @14,@15                                             0253 00289000
*                     END;          /* END A TITLE LINE              */ 00290000
*                   ELSE                                           0255 00291000
*                     DO;           /* FORMATTED LINE                */ 00292000
         B     @RC00250                                            0255 00293000
@RF00250 DS    0H                                                  0256 00294000
*                       CALL CONVERT;/* GEN OFFSET                   */ 00295000
         BAL   @14,CONVERT                                         0256 00296000
*                       CALL FMTRTN;/* FORMAT                        */ 00297000
         BAL   @14,FMTRTN                                          0257 00298000
*                     END;          /* END FORMAT LINE               */ 00299000
*                 END;              /* END LINE TO BE OUTPUT         */ 00300000
@RC00250 DS    0H                                                  0260 00301000
*           END;                    /* END FORMAT LOOP               */ 00302000
@RC00246 DS    0H                                                  0260 00303000
@RC00244 AH    ARRAYCNT,@CH00042                                   0260 00304000
         CH    ARRAYCNT,@CH03443                                   0260 00305000
         BNH   @DL00243                                            0260 00306000
@DC00243 DS    0H                                                  0261 00307000
*           IF ERRSW=OFF THEN       /* FORMATTED WITHOUT PROBLEM     */ 00308000
         TM    ERRSW,B'00100000'                                   0261 00309000
         BNZ   @RF00261                                            0261 00310000
*             DO;                                                  0262 00311000
*               CALL RT2SUM;        /* FORMAT RTM2WA SUMMARY         */ 00312000
*                                                                  0263 00313000
         BAL   @14,RT2SUM                                          0263 00314000
*               /*****************************************************/ 00315000
*               /*                                                   */ 00316000
*               /* IF RTM2WA FORMATTED ALL PARTS WITHOUT ANY         */ 00317000
*               /* PROBLEMS, SEND THE SVRB ADDRESS TO THE MAIN       */ 00318000
*               /* ROUTINE FOR THE ESA BIT SUMMARY                   */ 00319000
*               /*                                                   */ 00320000
*               /*****************************************************/ 00321000
*                                                                  0264 00322000
*               IF RCREG=ZERO THEN  /* SUMMARIES OK                  */ 00323000
         LTR   RCREG,RCREG                                         0264 00324000
         BNZ   @RF00264                                            0264 00325000
*                 DO;                                              0265 00326000
*                   VADR=ADDR(RTM2VRBC);/* GET ADDR OF RELATED SVRB  */ 00327000
         LA    VADR,RTM2VRBC(,RTM2PTR)                             0266 00328000
*                   CALL ACCESRTN;  /* ACCESS IT                     */ 00329000
         BAL   @14,ACCESRTN                                        0267 00330000
*                   IF RCREG=ZERO THEN/* PASS BACK SVRB ADR TO MAIN     00331000
*                                      PROCEDURE                     */ 00332000
         SLR   @14,@14                                             0268 00333000
         CR    RCREG,@14                                           0268 00334000
         BNE   @RF00268                                            0268 00335000
*                     DO;                                          0269 00336000
*                       ADPLFMT2=DATAWORD;/* PUT SVRB ADDR IN      0270 00337000
*                                      PARMLIST                      */ 00338000
         MVC   ADPLFMT2(4,ABDPLPTR),DATAWORD(DATAPTR)              0270 00339000
*                       START=ZERO; /* OFFSET FOR CONTROL BLOCK      */ 00340000
         ST    @14,START(,ABDPLPTR)                                0271 00341000
*                     END;          /* FOUND SVRB                    */ 00342000
*                   ELSE                                           0273 00343000
*                     ;             /* ACCESS ERROR -BAD RC WILL BE     00344000
*                                      PASSED TO MAIN PROC INHIBITING   00345000
*                                      ESA PROCESSING                */ 00346000
@RF00268 DS    0H                                                  0274 00347000
*                 END;              /* END SUMMARIES OK              */ 00348000
*               ELSE                                               0275 00349000
*                 ;                 /* SUMMARIES HAD ERROR           */ 00350000
@RF00264 DS    0H                                                  0276 00351000
*             END;                  /* END FORMATTED WITHOUT PROBLEM */ 00352000
*           ELSE                                                   0277 00353000
*             ;                     /* ERROR FORMATTING              */ 00354000
@RF00261 DS    0H                                                  0278 00355000
*         END;                      /* END FOUND SYSTEM              */ 00356000
*       ELSE                                                       0279 00357000
*         ;                         /* COULD NOT FIND SYSTEM         */ 00358000
@RF00232 DS    0H                                                  0280 00359000
*     END;                          /* END FOUND RELEASE NUMBER      */ 00360000
*   CALL PRINT;                     /* ERROR MSG OR BLANK            */ 00361000
@RC00197 L     @15,ADPLPRNT(,ABDPLPTR)                             0281 00362000
         BALR  @14,@15                                             0281 00363000
*   LCALREGS=RTYREGS;               /* RESTORE CALLERS EXPECTED RETRY   00364000
*                                      REGS                          */ 00365000
         L     @14,ESTAPTR                                         0282 00366000
         MVC   LCALREGS(64,@14),RTYREGS(@14)                       0282 00367000
*   RETURN CODE(RCCODE);            /* TO PREVENT ENTERING ESA CODE  */ 00368000
         L     @08,RCCODE                                          0283 00369000
         L     @13,4(,@13)                                         0283 00370000
         L     @00,@SIZDATD                                        0283 00371000
         LR    @01,@09                                             0283 00372000
         FREEMAIN R,LV=(0),A=(1)                                        00373000
         LR    @15,@08                                             0283 00374000
         L     @14,12(,@13)                                        0283 00375000
         LM    @00,@12,20(@13)                                     0283 00376000
         BR    @14                                                 0283 00377000
*RT2SUM:                                                           0284 00378000
*   PROC OPTIONS(SAVE(14));                                        0284 00379000
*                                                                  0284 00380000
RT2SUM   ST    @14,@SA00002                                        0284 00381000
*/********************************************************************/ 00382000
*/* FUNCTION -                                                     0285 00383000
*      ROUTINE WHICH FORMATS THE RTM2 WORK AREA SUMMARY.           0285 00384000
*      IT SETS UP THE NEEDED POINTERS TO BE PASSED TO THE FORMAT   0285 00385000
*      ROUTINE SENT IN THE PARAMETER LIST.  FOR ANY ERROR ACCESSING     00386000
*      A NEEDED FIELD IN THE RTM2WA OR FOR NON-ZERO RETURN CODE    0285 00387000
*      FROM THE FORMATTING SERVICE, THE FOLLOWING MESSAGE WILL BE  0285 00388000
*      PRINTED:                                                    0285 00389000
*               *** FORMATTING SERVICE ROUTINE ERROR DURING        0285 00390000
*               RTM2WA FORMATTING(POSSIBLE CAUSE:  DATA NOT IN     0285 00391000
*               DUMP) ***                                          0285 00392000
*      AT THIS POINT PROCESSING WOULD TERMINATE. IF THE RTM2WA IS  0285 00393000
*      FORMATTED WITHOUT ERROR, A BIT SUMMARY OF THE RTM2WA IMPORTANT   00394000
*      AREA IS PRINTED.                                            0285 00395000
*                                                                  0285 00396000
*   INPUT -                                                        0285 00397000
*      THIS ROUTINE EXPECTS THE PARAMETER LIST ADDRESS IN REGISTER 1,   00398000
*      THE ADDRESS OF THE RTM2WA IN RTM2PTR, AND THE SUSAVE BITS FILLED 00399000
*      IN.                                                         0285 00400000
*                                                                  0285 00401000
*   CALLS -                                                        0285 00402000
*      CALLS CONVERT, FMTRTN, PRINT,AND RT2BITS                    0285 00403000
*                                                                  0285 00404000
*   CALLED BY -                                                    0285 00405000
*      IEAFTRT2 TO FORMAT THE RTM2WA SUMMARY                       0285 00406000
*                                                                  0285 00407000
*   RETURNS TO -                                                   0285 00408000
*      IEAFTRT2 WITH RETURN CODE SET BY FORMAT                     0285 00409000
*      SERVICE ROUTINES                                              */ 00410000
*/********************************************************************/ 00411000
*                                                                  0285 00412000
*   CALL PRINT;                     /* BLANK                         */ 00413000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0285 00414000
         BALR  @14,@15                                             0285 00415000
*   BUFFER(31:(LENGTH(RT2SMHDR)+30))=RT2SMHDR;/* SUMMARY HEADER      */ 00416000
         L     @14,ADPLBUF(,ABDPLPTR)                              0286 00417000
         MVC   BUFFER+30(14,@14),RT2SMHDR                          0286 00418000
*   CALL PRINT;                     /* PRINT HDR                     */ 00419000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0287 00420000
         BALR  @14,@15                                             0287 00421000
*   BUFFER(31:(LENGTH(RT2SMUS)+30))=RT2SMUS;/* UNDERSCORE            */ 00422000
         L     @14,ADPLBUF(,ABDPLPTR)                              0288 00423000
         MVC   BUFFER+30(14,@14),RT2SMUS                           0288 00424000
*   CALL PRINT;                     /* PRINT IT                      */ 00425000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0289 00426000
         BALR  @14,@15                                             0289 00427000
*   CALL PRINT;                     /* BLANK                         */ 00428000
*                                                                  0290 00429000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0290 00430000
         BALR  @14,@15                                             0290 00431000
*   /*****************************************************************/ 00432000
*   /*                                                               */ 00433000
*   /* FIRST GROUP OF SUMMARY OUTPUT - ABEND INFORMATION             */ 00434000
*   /*                                                               */ 00435000
*   /*****************************************************************/ 00436000
*                                                                  0291 00437000
*   DO ARRAYCNT=1 TO GROUP1 WHILE(ERRSW=OFF);/* FORMAT GROUP 1       */ 00438000
         LA    ARRAYCNT,1                                          0291 00439000
@DL00291 TM    ERRSW,B'00100000'                                   0291 00440000
         BNZ   @DC00291                                            0291 00441000
*     FIELDADR=FIELDARY(ARRAYCNT);  /* ADDRESS OF FIELD IS INAN ARRAY*/ 00442000
         LR    @14,ARRAYCNT                                        0292 00443000
         SLA   @14,2                                               0292 00444000
         L     FIELDADR,FIELDARY-4(@14)                            0292 00445000
*     ADPLFMT2=FIELDADR+RTM2PTR;    /* ADR OF FIELD TO BE FORMATTED  */ 00446000
         LR    @04,FIELDADR                                        0293 00447000
         ALR   @04,RTM2PTR                                         0293 00448000
         ST    @04,ADPLFMT2(,ABDPLPTR)                             0293 00449000
*     LINEPTR=SUMNAMES(ARRAYCNT);   /* FORMAT PATTERN WHICH MATCHES     00450000
*                                      FIELD                         */ 00451000
         L     LINEPTR,SUMNAMES-4(@14)                             0294 00452000
*     CALL CONVERT;                 /* GENERATE OFFSET               */ 00453000
         BAL   @14,CONVERT                                         0295 00454000
*     CALL FMTRTN;                  /* FORMAT THE LINE MACRO TO SET     00455000
*                                      UP FOR SUMMARY                */ 00456000
         BAL   @14,FMTRTN                                          0296 00457000
*   END;                                                           0297 00458000
*                                                                  0297 00459000
         AH    ARRAYCNT,@CH00042                                   0297 00460000
         CH    ARRAYCNT,@CH00312                                   0297 00461000
         BNH   @DL00291                                            0297 00462000
@DC00291 DS    0H                                                  0298 00463000
*   /*****************************************************************/ 00464000
*   /*                                                               */ 00465000
*   /* SECOND GROUP OF OUTPUT - REGS, PSW, AND SDWA COMPLETION CODE  */ 00466000
*   /*                                                               */ 00467000
*   /*****************************************************************/ 00468000
*                                                                  0298 00469000
*   IF ERRSW=OFF THEN               /* FORMATTED FIRST SECTION OK    */ 00470000
         TM    ERRSW,B'00100000'                                   0298 00471000
         BNZ   @RF00298                                            0298 00472000
*     DO;                                                          0299 00473000
*       CALL PRINT;                 /* BLANK TO SEPARATE SECTIONS    */ 00474000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0300 00475000
         BALR  @14,@15                                             0300 00476000
*       DO ARRAYCNT=ARRAYCNT TO GROUP2 WHILE(ERRSW=OFF);/* FORMAT  0301 00477000
*                                      NEXT SECTION(2)               */ 00478000
         B     @DE00301                                            0301 00479000
@DL00301 TM    ERRSW,B'00100000'                                   0301 00480000
         BNZ   @DC00301                                            0301 00481000
*         FIELDADR=FIELDARY(ARRAYCNT);/* ADDRESS OF FIELD IS INAN  0302 00482000
*                                      ARRAY                         */ 00483000
         LR    @14,ARRAYCNT                                        0302 00484000
         SLA   @14,2                                               0302 00485000
         L     FIELDADR,FIELDARY-4(@14)                            0302 00486000
*         ADPLFMT2=FIELDADR+RTM2PTR;/* ADR OF FIELD TO BE FORMATTED  */ 00487000
         LR    @04,FIELDADR                                        0303 00488000
         ALR   @04,RTM2PTR                                         0303 00489000
         ST    @04,ADPLFMT2(,ABDPLPTR)                             0303 00490000
*         LINEPTR=SUMNAMES(ARRAYCNT);/* FORMAT PATTERN WHICH MATCHES    00491000
*                                      FIELD                         */ 00492000
         L     LINEPTR,SUMNAMES-4(@14)                             0304 00493000
*         CALL CONVERT;             /* GENERATE OFFSET               */ 00494000
         BAL   @14,CONVERT                                         0305 00495000
*         CALL FMTRTN;              /* FORMAT THE LINE MACRO TO    0306 00496000
*                                      FORMAT                        */ 00497000
         BAL   @14,FMTRTN                                          0306 00498000
*       END;                        /* END FORMAT SECTION 2          */ 00499000
*                                                                  0307 00500000
         AH    ARRAYCNT,@CH00042                                   0307 00501000
@DE00301 CH    ARRAYCNT,@CH00778                                   0307 00502000
         BNH   @DL00301                                            0307 00503000
@DC00301 DS    0H                                                  0308 00504000
*       /*************************************************************/ 00505000
*       /*                                                           */ 00506000
*       /* THIRD GROUP - RETRY INFORMATION                           */ 00507000
*       /*                                                           */ 00508000
*       /*************************************************************/ 00509000
*                                                                  0308 00510000
*       IF ERRSW=OFF THEN           /* FORMATTED SECTION 2 WITHOUT 0308 00511000
*                                      PROBLEM                       */ 00512000
         TM    ERRSW,B'00100000'                                   0308 00513000
         BNZ   @RF00308                                            0308 00514000
*         DO;                                                      0309 00515000
*           CALL PRINT;             /* SEPARATE GROUPS WITH A BLANK  */ 00516000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0310 00517000
         BALR  @14,@15                                             0310 00518000
*           VADR=ADDR(RTM2RCDE);    /* RETURN CODE FROM RETRY        */ 00519000
         LA    VADR,RTM2RCDE(,RTM2PTR)                             0311 00520000
*           CALL ACCESRTN;          /* ACCESS IT                     */ 00521000
         BAL   @14,ACCESRTN                                        0312 00522000
*           IF RCREG^=ZERO THEN                                    0313 00523000
         LTR   RCREG,RCREG                                         0313 00524000
         BZ    @RF00313                                            0313 00525000
*             BUFFER(1:LENGTH(RT2FMT))=RT2FMT;                     0314 00526000
         L     @14,ADPLBUF(,ABDPLPTR)                              0314 00527000
         MVC   BUFFER(120,@14),RT2FMT                              0314 00528000
*           ELSE                                                   0315 00529000
*             DO;                   /* FOUND RETURN CODE             */ 00530000
         B     @RC00313                                            0315 00531000
@RF00313 DS    0H                                                  0316 00532000
*               ADPLFMT2=ADDR(RTM2RCDE);/* RETURN CODE FROM RETRY    */ 00533000
         LA    @14,RTM2RCDE(,RTM2PTR)                              0316 00534000
         ST    @14,ADPLFMT2(,ABDPLPTR)                             0316 00535000
*               CALL CONVERT;       /* GENERATE OFFSET               */ 00536000
         BAL   @14,CONVERT                                         0317 00537000
*               OFFSET=CONVERTD;    /* PLACE IN BUFFER               */ 00538000
         L     @14,ADPLBUF(,ABDPLPTR)                              0318 00539000
         MVC   OFFSET(6,@14),CONVERTD                              0318 00540000
*               BUFFER(9:(LENGTH(RCMSG)+8))=RCMSG;/* PLACE MESSAGE IN   00541000
*                                      BUFFER                        */ 00542000
         MVC   BUFFER+8(34,@14),RCMSG                              0319 00543000
*               PACKAREA(4:4)=DATABYTE;/* RETURN CODE FROM RETRY     */ 00544000
         MVC   PACKAREA+3(1),DATABYTE(DATAPTR)                     0320 00545000
*               GARBAGE='04'X;      /* GARBAGE BYTE FOR THE UNPK     */ 00546000
         MVI   GARBAGE,X'04'                                       0321 00547000
*               UNPK(BUFFER(LENGTH(RCMSG)+9:LENGTH(RCMSG)+11),UNPACK(4: 00548000
*                   5));            /* PLACE IN BUFFER               */ 00549000
         UNPK  BUFFER+42(3,@14),UNPACK+3(2)                        0322 00550000
*               TR(BUFFER(LENGTH(RCMSG)+9:LENGTH(RCMSG)+11),TRANS);/*   00551000
*                                      TRANSLATE TO PRINTABLE HEX    */ 00552000
         TR    BUFFER+42(3,@14),TRANS                              0323 00553000
*               RFY                                                0324 00554000
*                 ENDMSG BASED(ADDR(BUFFER)+(LENGTH(RCMSG)+10));/* 0324 00555000
*                                      REBASE END OF MESSAGE         */ 00556000
*               IF DATABYTE=ZEROBYTE THEN                          0325 00557000
         CLC   DATABYTE(1,DATAPTR),ZEROBYTE                        0325 00558000
         BNE   @RF00325                                            0325 00559000
*                 ENDMSG(1:LENGTH(RCEND1))=RCEND1;/* PROPER ENDING   */ 00560000
         MVC   ENDMSG+44(46,@14),RCEND1                            0326 00561000
*               ELSE                                               0327 00562000
*                 IF DATABYTE='04'X|DATABYTE='08'X|DATABYTE='0C'X THEN  00563000
         B     @RC00325                                            0327 00564000
@RF00325 CLI   DATABYTE(DATAPTR),4                                 0327 00565000
         BE    @RT00327                                            0327 00566000
         CLI   DATABYTE(DATAPTR),8                                 0327 00567000
         BE    @RT00327                                            0327 00568000
         CLI   DATABYTE(DATAPTR),12                                0327 00569000
         BNE   @RF00327                                            0327 00570000
@RT00327 DS    0H                                                  0328 00571000
*                   ENDMSG(1:LENGTH(RCEND2))=RCEND2;/* RETRY ENDING  */ 00572000
         L     @14,ADPLBUF(,ABDPLPTR)                              0328 00573000
         MVC   ENDMSG+44(6,@14),RCEND2                             0328 00574000
*                 ELSE                                             0329 00575000
*                   IF DATABYTE='10'X THEN                         0329 00576000
         B     @RC00327                                            0329 00577000
@RF00327 CLI   DATABYTE(DATAPTR),16                                0329 00578000
         BNE   @RF00329                                            0329 00579000
*                     ENDMSG(1:LENGTH(RCEND3))=RCEND3;/* PROPER    0330 00580000
*                                      ENDING-PREVENT FURTHER      0330 00581000
*                                      PROCESSING                    */ 00582000
         L     @14,ADPLBUF(,ABDPLPTR)                              0330 00583000
         MVC   ENDMSG+44(64,@14),RCEND3                            0330 00584000
*                   ELSE                                           0331 00585000
*                     ENDMSG(1:LENGTH(RCEND4))=RCEND4;/* UNKNOWN     */ 00586000
         B     @RC00329                                            0331 00587000
@RF00329 L     @14,ADPLBUF(,ABDPLPTR)                              0331 00588000
         MVC   ENDMSG+44(14,@14),RCEND4                            0331 00589000
*               CALL PRINT;         /* PRINT LINE                    */ 00590000
@RC00329 DS    0H                                                  0332 00591000
@RC00327 DS    0H                                                  0332 00592000
@RC00325 L     @15,ADPLPRNT(,ABDPLPTR)                             0332 00593000
         BALR  @14,@15                                             0332 00594000
*               DO ARRAYCNT=ARRAYCNT TO GROUP3 WHILE(ERRSW=OFF);/* 0333 00595000
*                                      NEXT GROUP                    */ 00596000
         B     @DE00333                                            0333 00597000
@DL00333 TM    ERRSW,B'00100000'                                   0333 00598000
         BNZ   @DC00333                                            0333 00599000
*                 FIELDADR=FIELDARY(ARRAYCNT);/* ADDRESS OF FIELD IS    00600000
*                                      INAN ARRAY                    */ 00601000
         LR    @14,ARRAYCNT                                        0334 00602000
         SLA   @14,2                                               0334 00603000
         L     FIELDADR,FIELDARY-4(@14)                            0334 00604000
*                 ADPLFMT2=FIELDADR+RTM2PTR;/* ADR OF FIELD TO BE  0335 00605000
*                                      FORMATTED                     */ 00606000
         LR    @04,FIELDADR                                        0335 00607000
         ALR   @04,RTM2PTR                                         0335 00608000
         ST    @04,ADPLFMT2(,ABDPLPTR)                             0335 00609000
*                 LINEPTR=SUMNAMES(ARRAYCNT);/* FORMAT PATTERN WHICH    00610000
*                                      MATCHES FIELD                 */ 00611000
         L     LINEPTR,SUMNAMES-4(@14)                             0336 00612000
*                 CALL CONVERT;     /* GENERATE OFFSET               */ 00613000
         BAL   @14,CONVERT                                         0337 00614000
*                 CALL FMTRTN;      /* FORMAT THE LINE MACRO TO    0338 00615000
*                                      FORMAT                        */ 00616000
         BAL   @14,FMTRTN                                          0338 00617000
*               END;                /* END GROUP3                    */ 00618000
*                                                                  0339 00619000
         AH    ARRAYCNT,@CH00042                                   0339 00620000
@DE00333 CH    ARRAYCNT,@CH01564                                   0339 00621000
         BNH   @DL00333                                            0339 00622000
@DC00333 DS    0H                                                  0340 00623000
*               /*****************************************************/ 00624000
*               /*                                                   */ 00625000
*               /* FOURTH GROUP - CONTROL BLOCK POINTERS             */ 00626000
*               /*                                                   */ 00627000
*               /*****************************************************/ 00628000
*                                                                  0340 00629000
*               IF ERRSW=OFF THEN   /* FORMATTED GROUP 3 OK          */ 00630000
         TM    ERRSW,B'00100000'                                   0340 00631000
         BNZ   @RF00340                                            0340 00632000
*                 DO;                                              0341 00633000
*                   CALL PRINT;     /* BLANK LINE                    */ 00634000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0342 00635000
         BALR  @14,@15                                             0342 00636000
*                   DO ARRAYCNT=ARRAYCNT TO GROUP4 WHILE(ERRSW=OFF);    00637000
         B     @DE00343                                            0343 00638000
@DL00343 TM    ERRSW,B'00100000'                                   0343 00639000
         BNZ   @DC00343                                            0343 00640000
*                                   /* FORMAT FOURTH GROUP           */ 00641000
*                     FIELDADR=FIELDARY(ARRAYCNT);/* ADDRESS OF FIELD   00642000
*                                      IS INAN ARRAY                 */ 00643000
         LR    @14,ARRAYCNT                                        0344 00644000
         SLA   @14,2                                               0344 00645000
         L     FIELDADR,FIELDARY-4(@14)                            0344 00646000
*                     ADPLFMT2=FIELDADR+RTM2PTR;/* ADR OF FIELD TO BE   00647000
*                                      FORMATTED                     */ 00648000
         LR    @04,FIELDADR                                        0345 00649000
         ALR   @04,RTM2PTR                                         0345 00650000
         ST    @04,ADPLFMT2(,ABDPLPTR)                             0345 00651000
*                     LINEPTR=SUMNAMES(ARRAYCNT);/* FORMAT PATTERN 0346 00652000
*                                      WHICH MATCHES FIELD           */ 00653000
         L     LINEPTR,SUMNAMES-4(@14)                             0346 00654000
*                     CALL CONVERT; /* GENERATE OFFSET               */ 00655000
         BAL   @14,CONVERT                                         0347 00656000
*                     CALL FMTRTN;  /* FORMAT THE LINE MACRO TO    0348 00657000
*                                      FORMAT                        */ 00658000
         BAL   @14,FMTRTN                                          0348 00659000
*                   END;            /* END GROUP 4                   */ 00660000
*                                                                  0349 00661000
         AH    ARRAYCNT,@CH00042                                   0349 00662000
@DE00343 CH    ARRAYCNT,@CH00781                                   0349 00663000
         BNH   @DL00343                                            0349 00664000
@DC00343 DS    0H                                                  0350 00665000
*                   /*************************************************/ 00666000
*                   /*                                               */ 00667000
*                   /* FIFTH GROUP - ASID INFORMATION                */ 00668000
*                   /*                                               */ 00669000
*                   /*************************************************/ 00670000
*                                                                  0350 00671000
*                   IF ERRSW=OFF THEN/* FORMATTED GROUP 4 OK         */ 00672000
         TM    ERRSW,B'00100000'                                   0350 00673000
         BNZ   @RF00350                                            0350 00674000
*                     DO;                                          0351 00675000
*                       CALL PRINT; /* SEPERATE SECTIONS WITH A BLANK   00676000
*                                      LINE                          */ 00677000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0352 00678000
         BALR  @14,@15                                             0352 00679000
*                       DO ARRAYCNT=ARRAYCNT TO GROUP5 WHILE(ERRSW=OFF) 00680000
*                             ;                                    0353 00681000
         B     @DE00353                                            0353 00682000
@DL00353 TM    ERRSW,B'00100000'                                   0353 00683000
         BNZ   @DC00353                                            0353 00684000
*                         FIELDADR=FIELDARY(ARRAYCNT);/* ADDRESS OF     00685000
*                                      FIELD IS INAN ARRAY           */ 00686000
         LR    @14,ARRAYCNT                                        0354 00687000
         SLA   @14,2                                               0354 00688000
         L     FIELDADR,FIELDARY-4(@14)                            0354 00689000
*                         ADPLFMT2=FIELDADR+RTM2PTR;/* ADR OF FIELD     00690000
*                                      TO BE FORMATTED               */ 00691000
         LR    @04,FIELDADR                                        0355 00692000
         ALR   @04,RTM2PTR                                         0355 00693000
         ST    @04,ADPLFMT2(,ABDPLPTR)                             0355 00694000
*                         LINEPTR=SUMNAMES(ARRAYCNT);/* FORMAT     0356 00695000
*                                      PATTERN WHICH MATCHES FIELD   */ 00696000
         L     LINEPTR,SUMNAMES-4(@14)                             0356 00697000
*                         CALL CONVERT;/* GENERATE OFFSET            */ 00698000
         BAL   @14,CONVERT                                         0357 00699000
*                         CALL FMTRTN;/* FORMAT THE LINE FORMAT ERROR   00700000
*                                      ID                            */ 00701000
         BAL   @14,FMTRTN                                          0358 00702000
*                       END;        /* END GROUP 5                   */ 00703000
         AH    ARRAYCNT,@CH00042                                   0359 00704000
@DE00353 CH    ARRAYCNT,@CH01707                                   0359 00705000
         BNH   @DL00353                                            0359 00706000
@DC00353 DS    0H                                                  0360 00707000
*                       IF SU17SAVE=ON THEN/* ERROR ID TO BE       0360 00708000
*                                      FORMATTED                     */ 00709000
         TM    SU17SAVE,B'10000000'                                0360 00710000
         BNO   @RF00360                                            0360 00711000
*                         DO;                                      0361 00712000
*                           FIELDADR=FIELDARY(ARRAYCNT);/* ADDRESS OF   00713000
*                                      FIELD IS INAN ARRAY           */ 00714000
         LR    @14,ARRAYCNT                                        0362 00715000
         SLA   @14,2                                               0362 00716000
         L     FIELDADR,FIELDARY-4(@14)                            0362 00717000
*                           ADPLFMT2=FIELDADR+RTM2PTR;/* ADR OF FIELD   00718000
*                                      TO BE FORMATTED               */ 00719000
         LR    @04,FIELDADR                                        0363 00720000
         ALR   @04,RTM2PTR                                         0363 00721000
         ST    @04,ADPLFMT2(,ABDPLPTR)                             0363 00722000
*                           LINEPTR=SUMNAMES(ARRAYCNT);/* FORMAT   0364 00723000
*                                      PATTERN WHICH MATCHES FIELD   */ 00724000
         L     LINEPTR,SUMNAMES-4(@14)                             0364 00725000
*                           CALL CONVERT;/* GENERATE OFFSET          */ 00726000
         BAL   @14,CONVERT                                         0365 00727000
*                           CALL FMTRTN;/* FORMAT THE LINE FORMAT  0366 00728000
*                                      ERROR ID                      */ 00729000
         BAL   @14,FMTRTN                                          0366 00730000
*                         END;      /* END FORMAT ERROR ID           */ 00731000
*                       ELSE                                       0368 00732000
*                         ;         /* ERRID NOT TO BE FORMATTED     */ 00733000
*                                                                  0368 00734000
@RF00360 DS    0H                                                  0369 00735000
*                       /*********************************************/ 00736000
*                       /*                                           */ 00737000
*                       /* SIXTH GROUP - TRACE TABLE ENTRY PTRS FOR  */ 00738000
*                       /* SU33                                      */ 00739000
*                       /*                                           */ 00740000
*                       /*********************************************/ 00741000
*                                                                  0369 00742000
*                       IF ERRSW=OFF&SU33SAVE=ON THEN/* GROUP 5    0369 00743000
*                                      FORMATTED OK AND SU33 TRACE 0369 00744000
*                                      ENTRIES ARE TO BE FORMATTED   */ 00745000
         TM    SU33SAVE,B'01000000'                                0369 00746000
         BNO   @RF00369                                            0369 00747000
         TM    ERRSW,B'00100000'                                   0369 00748000
         BNZ   @RF00369                                            0369 00749000
*                         DO;                                      0370 00750000
*                           CALL PRINT;/* SEPERATE SECTIONS WITH A 0371 00751000
*                                      BLANK LINE                    */ 00752000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0371 00753000
         BALR  @14,@15                                             0371 00754000
*                           DO ARRAYCNT=ARRAYCNT+1 TO GROUP6 WHILE(     00755000
*                                 ERRSW=OFF);                      0372 00756000
         LA    @14,1                                               0372 00757000
         ALR   @14,ARRAYCNT                                        0372 00758000
         LR    ARRAYCNT,@14                                        0372 00759000
         B     @DE00372                                            0372 00760000
@DL00372 TM    ERRSW,B'00100000'                                   0372 00761000
         BNZ   @DC00372                                            0372 00762000
*                             FIELDADR=FIELDARY(ARRAYCNT);/* ADDRESS    00763000
*                                      OF FIELD IS INAN ARRAY        */ 00764000
         LR    @14,ARRAYCNT                                        0373 00765000
         SLA   @14,2                                               0373 00766000
         L     FIELDADR,FIELDARY-4(@14)                            0373 00767000
*                             ADPLFMT2=FIELDADR+RTM2PTR;/* ADR OF  0374 00768000
*                                      FIELD TO BE FORMATTED         */ 00769000
         LR    @04,FIELDADR                                        0374 00770000
         ALR   @04,RTM2PTR                                         0374 00771000
         ST    @04,ADPLFMT2(,ABDPLPTR)                             0374 00772000
*                             LINEPTR=SUMNAMES(ARRAYCNT);/* FORMAT 0375 00773000
*                                      PATTERN WHICH MATCHES FIELD   */ 00774000
         L     LINEPTR,SUMNAMES-4(@14)                             0375 00775000
*                             CALL CONVERT;/* GENERATE OFFSET        */ 00776000
         BAL   @14,CONVERT                                         0376 00777000
*                             CALL FMTRTN;/* FORMAT THE LINE FORMAT     00778000
*                                      ERROR ID                      */ 00779000
         BAL   @14,FMTRTN                                          0377 00780000
*                           END;    /* END FORMAT ERROR ID           */ 00781000
         AH    ARRAYCNT,@CH00042                                   0378 00782000
@DE00372 CH    ARRAYCNT,@CH02753                                   0378 00783000
         BNH   @DL00372                                            0378 00784000
@DC00372 DS    0H                                                  0379 00785000
*                           IF ERRSW=OFF THEN                      0379 00786000
         TM    ERRSW,B'00100000'                                   0379 00787000
         BNZ   @RF00379                                            0379 00788000
*                             CALL RT2BITS;/* DO BIT SUMMARY IF    0380 00789000
*                                      FORMATTED FULL SUMMARY WITHOUT   00790000
*                                      ERROR                         */ 00791000
         BAL   @14,RT2BITS                                         0380 00792000
*                           ELSE                                   0381 00793000
*                             ;     /* ERROR DURING SUMMARY        0381 00794000
*                                      FORMATTING                    */ 00795000
@RF00379 DS    0H                                                  0382 00796000
*                         END;      /* END NO ERROR FORMATTING GROUP    00797000
*                                      5                             */ 00798000
*                       ELSE                                       0383 00799000
*                         ;         /* ERROR IN FORMATTING GROUP 5   */ 00800000
@RF00369 DS    0H                                                  0384 00801000
*                     END;          /* END NO ERROR FORMATTING GROUP    00802000
*                                      4                             */ 00803000
*                   ELSE                                           0385 00804000
*                     ;             /* ERROR IN FORMATTING GROUP 4   */ 00805000
@RF00350 DS    0H                                                  0386 00806000
*                 END;              /* END NO ERROR FORMATTING GROUP    00807000
*                                      3                             */ 00808000
*               ELSE                                               0387 00809000
*                 ;                 /* ERROR IN FORMATTING GROUP 3   */ 00810000
@RF00340 DS    0H                                                  0388 00811000
*             END;                  /* END FOUND RETURN CODE FROM  0388 00812000
*                                      RETRY                         */ 00813000
*         END;                      /* END NO ERROR FORMATTING     0389 00814000
*                                      SECTION 2                     */ 00815000
*       ELSE                                                       0390 00816000
*         ;                         /* ERROR IN FORMATTING GROUP 2   */ 00817000
@RF00308 DS    0H                                                  0391 00818000
*     END;                          /* END NO ERROR FORMATTING     0391 00819000
*                                      SECTION 1                     */ 00820000
*   ELSE                                                           0392 00821000
*     ;                             /* ERROR IN FORMATTING GROUP 1   */ 00822000
@RF00298 DS    0H                                                  0393 00823000
*   RETURN CODE(RCCODE);                                           0393 00824000
@RC00298 L     @15,RCCODE                                          0393 00825000
@EL00002 DS    0H                                                  0393 00826000
@EF00002 DS    0H                                                  0393 00827000
@ER00002 L     @14,@SA00002                                        0393 00828000
         BR    @14                                                 0393 00829000
*   END RT2SUM;                                                    0394 00830000
*RT2BITS:                                                          0395 00831000
*   PROC OPTIONS(SAVE(14));                                        0395 00832000
*                                                                  0395 00833000
RT2BITS  ST    @14,@SA00003                                        0395 00834000
*/********************************************************************/ 00835000
*/* FUNCTION -                                                     0396 00836000
*      ROUTINE WHICH FORMATS THE RTM2 WORK AREA BIT SUMMARY.       0396 00837000
*      IT SETS UP THE NEEDED POINTERS TO BE PASSED TO THE ANALYZE  0396 00838000
*      ROUTINE.  IF THERE IS AN ACCESS ERROR LOCATING A NEEDED FIELD    00839000
*      IN THE RTM2WA THE BIT ANALYZING FOR THAT BYTE IS BYPASSED.  0396 00840000
*                                                                  0396 00841000
*   CALLS -                                                        0396 00842000
*      CALLS ANALYZE, ACCESRTN, CONVERT, HDROUT, AND PRINT         0396 00843000
*                                                                  0396 00844000
*   INPUT -                                                        0396 00845000
*      THIS ROUTINE EXPECTS THE PARAMETER LIST ADDRESS IN REGISTER 1,   00846000
*      THE ADDRESS OF THE RTM2WA IN RTM2PTR, AND THE SUSAVE BITS FILLED 00847000
*      IN.                                                         0396 00848000
*                                                                  0396 00849000
*   CALLED BY -                                                    0396 00850000
*      RT2SUM TO FORMAT THE RTM2WA BIT FLAG SUMMARY                0396 00851000
*                                                                  0396 00852000
*   RETURNS TO -                                                   0396 00853000
*      RT2SUM WITH RETURN CODE SET BY ACCESS SERVICE               0396 00854000
*      ROUTINE                                                       */ 00855000
*/********************************************************************/ 00856000
*                                                                  0396 00857000
*   HDRBIT=OFF;                     /* HEADER INDICATOR              */ 00858000
         NI    HDRBIT,B'11101111'                                  0396 00859000
*   CALL PRINT;                     /* BLANK TO SEPARATE SECTION     */ 00860000
*                                                                  0397 00861000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0397 00862000
         BALR  @14,@15                                             0397 00863000
*   /*****************************************************************/ 00864000
*   /*                                                               */ 00865000
*   /* ANALYZE COMMUNICATIONS FLAG BYTE                              */ 00866000
*   /*                                                               */ 00867000
*   /*****************************************************************/ 00868000
*                                                                  0398 00869000
*   VADR=ADDR(RTM2CTLR);            /* COMMUNICATIONS FLAG           */ 00870000
         LA    VADR,RTM2CTLR(,RTM2PTR)                             0398 00871000
*   CALL ACCESRTN;                  /* ACCESS IT                     */ 00872000
         BAL   @14,ACCESRTN                                        0399 00873000
*   IF DATABYTE^=ZEROBYTE&RCREG=ZERO THEN/* IT NEEDS TO BE ANALYZED  */ 00874000
         CLC   DATABYTE(1,DATAPTR),ZEROBYTE                        0400 00875000
         BE    @RF00400                                            0400 00876000
         LTR   RCREG,RCREG                                         0400 00877000
         BNZ   @RF00400                                            0400 00878000
*     DO;                                                          0401 00879000
*       CALL HDROUT;                /* PUT OUT SUMMARY HEADER        */ 00880000
         BAL   @14,HDROUT                                          0402 00881000
*       ADPLFMT2=ADDR(RTM2CTLR);    /* NEEDED TO GENERAT OFFSET      */ 00882000
         LA    @14,RTM2CTLR(,RTM2PTR)                              0403 00883000
         ST    @14,ADPLFMT2(,ABDPLPTR)                             0403 00884000
*       ADPLCOM2=ADDR(SUMMARY);     /* SUMMARY PTR IN PARMLIST       */ 00885000
         LA    @14,SUMMARY                                         0404 00886000
         ST    @14,ADPLCOM2(,ABDPLPTR)                             0404 00887000
*       BYTEADDR=ADDR(DATABYTE);    /* ADDR OF BYTE TO BE RESOLVED   */ 00888000
         ST    DATAPTR,BYTEADDR                                    0405 00889000
*       MSGADDR=ADDR(CTLRMSG);      /* MESSAGE ARRAY                 */ 00890000
         LA    @14,CTLRMSG                                         0406 00891000
         ST    @14,MSGADDR                                         0406 00892000
*       MSGLNGTH=LENGTH(CTLRMSG);   /* MSG ARRAY LENGTH              */ 00893000
         MVC   MSGLNGTH(4),@CF01628                                0407 00894000
*       CALL CONVERT;               /* GENERATE OFFSET               */ 00895000
         BAL   @14,CONVERT                                         0408 00896000
*       OFFSET=CONVERTD;            /* PUT OFFSET IN BUFFER          */ 00897000
         L     @14,ADPLBUF(,ABDPLPTR)                              0409 00898000
         MVC   OFFSET(6,@14),CONVERTD                              0409 00899000
*       COLNUM=DEFAULT;             /* WHERE IN BUFFER TO START      */ 00900000
         MVC   COLNUM(4),@CF00087                                  0410 00901000
*       CALL ANALYZE;               /* ANALYZE THE BYTE ANALYZE BYTE */ 00902000
         BAL   @14,ANALYZE                                         0411 00903000
*     END;                          /* END BYTE NEEDS TO BE ANALYZED */ 00904000
*   ELSE                                                           0413 00905000
*     ;                             /* BYTE DOES NOT NEED ANALYZED   */ 00906000
*                                                                  0413 00907000
@RF00400 DS    0H                                                  0414 00908000
*   /*****************************************************************/ 00909000
*   /*                                                               */ 00910000
*   /* ANALYZE TYPE OF TERMINATION BYTE                              */ 00911000
*   /*                                                               */ 00912000
*   /*****************************************************************/ 00913000
*                                                                  0414 00914000
*   VADR=ADDR(RTM2RMPL);            /* TERMINATION BYTE              */ 00915000
         LA    VADR,RTM2RMPL(,RTM2PTR)                             0414 00916000
*   CALL ACCESRTN;                  /* ACCESS IT                     */ 00917000
         BAL   @14,ACCESRTN                                        0415 00918000
*   IF RCREG=ZERO THEN              /* BYTE NEEDS ANALYZED           */ 00919000
         LTR   RCREG,RCREG                                         0416 00920000
         BNZ   @RF00416                                            0416 00921000
*     DO;                                                          0417 00922000
*       CALL HDROUT;                /* PUT OUT SUMMARY HEADER IF   0418 00923000
*                                      NEEDED                        */ 00924000
         BAL   @14,HDROUT                                          0418 00925000
*       ADPLFMT2=ADDR(RTM2RMPL);                                   0419 00926000
         LA    @14,RTM2RMPL(,RTM2PTR)                              0419 00927000
         ST    @14,ADPLFMT2(,ABDPLPTR)                             0419 00928000
*       ADPLCOM2=ADDR(SUMMARY);     /* SUMMARY PTR IN PARMLIST       */ 00929000
         LA    @14,SUMMARY                                         0420 00930000
         ST    @14,ADPLCOM2(,ABDPLPTR)                             0420 00931000
*       BYTEADDR=ADDR(DATABYTE);    /* ADDR OF BYTE TO BE RESOLVED   */ 00932000
         ST    DATAPTR,BYTEADDR                                    0421 00933000
*       MSGADDR=ADDR(RMPLMSG);      /* MESSAGE ARRAY                 */ 00934000
         LA    @14,RMPLMSG                                         0422 00935000
         ST    @14,MSGADDR                                         0422 00936000
*       MSGLNGTH=LENGTH(RMPLMSG);   /* MSG ARRAY LENGTH              */ 00937000
         MVC   MSGLNGTH(4),@CF03634                                0423 00938000
*       CALL CONVERT;               /* GENERATE OFFSET               */ 00939000
         BAL   @14,CONVERT                                         0424 00940000
*       OFFSET=CONVERTD;            /* PUT OFFSET IN BUFFER          */ 00941000
         L     @14,ADPLBUF(,ABDPLPTR)                              0425 00942000
         MVC   OFFSET(6,@14),CONVERTD                              0425 00943000
*       COLNUM=DEFAULT;             /* WHERE IN BUFFER TO START      */ 00944000
         MVC   COLNUM(4),@CF00087                                  0426 00945000
*       IF(DATABYTE&TASKBIT)=ZEROBYTE THEN/* TASK TERMINATION BIT    */ 00946000
         LA    @07,64                                              0427 00947000
         SLR   @05,@05                                             0427 00948000
         IC    @05,DATABYTE(,DATAPTR)                              0427 00949000
         NR    @07,@05                                             0427 00950000
         SLR   @05,@05                                             0427 00951000
         IC    @05,ZEROBYTE                                        0427 00952000
         CR    @07,@05                                             0427 00953000
         BNE   @RF00427                                            0427 00954000
*         DO;                                                      0428 00955000
*           BUFFER(8:LENGTH(RMPLMSG1)+7)=RMPLMSG1;                 0429 00956000
         MVC   BUFFER+7(16,@14),RMPLMSG1                           0429 00957000
*           CALL PRINT;             /* PRINT BIT INDICATOR           */ 00958000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0430 00959000
         BALR  @14,@15                                             0430 00960000
*         END;                      /* END TASK TERMINATION BIT      */ 00961000
*       ELSE                                                       0432 00962000
*         ;                                                        0432 00963000
@RF00427 DS    0H                                                  0433 00964000
*       CALL ANALYZE;               /* ANALYZE THE BYTE              */ 00965000
         BAL   @14,ANALYZE                                         0433 00966000
*     END;                          /* END ANALYZE BYTE              */ 00967000
*   ELSE                                                           0435 00968000
*     ;                             /* BYTE DOES NOT NEED ANALYZE    */ 00969000
*                                                                  0435 00970000
@RF00416 DS    0H                                                  0436 00971000
*   /*****************************************************************/ 00972000
*   /*                                                               */ 00973000
*   /* ANALYZE ERROR BYTE A                                          */ 00974000
*   /*                                                               */ 00975000
*   /*****************************************************************/ 00976000
*                                                                  0436 00977000
*   VADR=ADDR(RTM2ERRA);            /* ERROR BYTE A                  */ 00978000
         LA    VADR,RTM2ERRA(,RTM2PTR)                             0436 00979000
*   CALL ACCESRTN;                  /* ACCESS IT                     */ 00980000
         BAL   @14,ACCESRTN                                        0437 00981000
*   IF RCREG=ZERO&DATABYTE^=ZEROBYTE THEN/* NEEDS RESOLVING          */ 00982000
         LTR   RCREG,RCREG                                         0438 00983000
         BNZ   @RF00438                                            0438 00984000
         CLC   DATABYTE(1,DATAPTR),ZEROBYTE                        0438 00985000
         BE    @RF00438                                            0438 00986000
*     DO;                                                          0439 00987000
*       CALL HDROUT;                /* PUT OUT SUMMARY HEADER IF   0440 00988000
*                                      NEEDED                        */ 00989000
         BAL   @14,HDROUT                                          0440 00990000
*       ADPLFMT2=ADDR(RTM2ERRA);                                   0441 00991000
         LA    @14,RTM2ERRA(,RTM2PTR)                              0441 00992000
         ST    @14,ADPLFMT2(,ABDPLPTR)                             0441 00993000
*       ADPLCOM2=ADDR(SUMMARY);     /* SUMMARY PTR IN PARMLIST       */ 00994000
         LA    @14,SUMMARY                                         0442 00995000
         ST    @14,ADPLCOM2(,ABDPLPTR)                             0442 00996000
*       BYTEADDR=ADDR(DATABYTE);    /* ADDR OF BYTE TO BE RESOLVED   */ 00997000
         ST    DATAPTR,BYTEADDR                                    0443 00998000
*       MSGADDR=ADDR(ERRAMSG);      /* MESSAGE ARRAY                 */ 00999000
         LA    @14,ERRAMSG                                         0444 01000000
         ST    @14,MSGADDR                                         0444 01001000
*       MSGLNGTH=LENGTH(ERRAMSG);   /* MSG ARRAY LENGTH              */ 01002000
         MVC   MSGLNGTH(4),@CF01641                                0445 01003000
*       CALL CONVERT;               /* GENERATE OFFSET               */ 01004000
         BAL   @14,CONVERT                                         0446 01005000
*       OFFSET=CONVERTD;            /* PUT OFFSET IN BUFFER          */ 01006000
         L     @14,ADPLBUF(,ABDPLPTR)                              0447 01007000
         MVC   OFFSET(6,@14),CONVERTD                              0447 01008000
*       COLNUM=DEFAULT;             /* WHERE IN BUFFER TO START      */ 01009000
         MVC   COLNUM(4),@CF00087                                  0448 01010000
*       CALL ANALYZE;               /* ANALYZE THE BYTE ANALYZE BYTE */ 01011000
         BAL   @14,ANALYZE                                         0449 01012000
*     END;                          /* END ANALYZE BYTE              */ 01013000
*   ELSE                                                           0451 01014000
*     ;                             /* BYTE DOES NOT NEED ANALYZED   */ 01015000
*                                                                  0451 01016000
@RF00438 DS    0H                                                  0452 01017000
*   /*****************************************************************/ 01018000
*   /*                                                               */ 01019000
*   /* ANALYZE ERROR BYTE B                                          */ 01020000
*   /*                                                               */ 01021000
*   /*****************************************************************/ 01022000
*                                                                  0452 01023000
*   VADR=ADDR(RTM2ERRB);            /* ERROR BYTE B                  */ 01024000
         LA    VADR,RTM2ERRB(,RTM2PTR)                             0452 01025000
*   CALL ACCESRTN;                  /* ACCESS IT                     */ 01026000
         BAL   @14,ACCESRTN                                        0453 01027000
*   IF RCREG=ZERO&DATABYTE^=ZEROBYTE THEN/* NEEDS RESOLVING          */ 01028000
         LTR   RCREG,RCREG                                         0454 01029000
         BNZ   @RF00454                                            0454 01030000
         CLC   DATABYTE(1,DATAPTR),ZEROBYTE                        0454 01031000
         BE    @RF00454                                            0454 01032000
*     DO;                                                          0455 01033000
*       CALL HDROUT;                /* PUT OUT SUMMARY HEADER IF   0456 01034000
*                                      NEEDED                        */ 01035000
         BAL   @14,HDROUT                                          0456 01036000
*       ADPLFMT2=ADDR(RTM2ERRB);                                   0457 01037000
         LA    @14,RTM2ERRB(,RTM2PTR)                              0457 01038000
         ST    @14,ADPLFMT2(,ABDPLPTR)                             0457 01039000
*       ADPLCOM2=ADDR(SUMMARY);     /* SUMMARY PTR IN PARMLIST       */ 01040000
         LA    @14,SUMMARY                                         0458 01041000
         ST    @14,ADPLCOM2(,ABDPLPTR)                             0458 01042000
*       BYTEADDR=ADDR(DATABYTE);    /* ADDR OF BYTE TO BE RESOLVED   */ 01043000
         ST    DATAPTR,BYTEADDR                                    0459 01044000
*       MSGADDR=ADDR(ERRBMSG);      /* MESSAGE ARRAY                 */ 01045000
         LA    @14,ERRBMSG                                         0460 01046000
         ST    @14,MSGADDR                                         0460 01047000
*       MSGLNGTH=LENGTH(ERRBMSG);   /* MSG ARRAY LENGTH              */ 01048000
         MVC   MSGLNGTH(4),@CF03558                                0461 01049000
*       CALL CONVERT;               /* GENERATE OFFSET               */ 01050000
         BAL   @14,CONVERT                                         0462 01051000
*       OFFSET=CONVERTD;            /* PUT OFFSET IN BUFFER          */ 01052000
         L     @14,ADPLBUF(,ABDPLPTR)                              0463 01053000
         MVC   OFFSET(6,@14),CONVERTD                              0463 01054000
*       COLNUM=DEFAULT;             /* WHERE IN BUFFER TO START      */ 01055000
         MVC   COLNUM(4),@CF00087                                  0464 01056000
*       CALL ANALYZE;               /* ANALYZE THE BYTE ANALYZE BYTE */ 01057000
         BAL   @14,ANALYZE                                         0465 01058000
*     END;                          /* END ANALYZE BYTE              */ 01059000
*   ELSE                                                           0467 01060000
*     ;                             /* BYTE DOES NOT NEED ANALYZED   */ 01061000
*                                                                  0467 01062000
@RF00454 DS    0H                                                  0468 01063000
*   /*****************************************************************/ 01064000
*   /*                                                               */ 01065000
*   /* ANALYZE ERROR BYTE D                                          */ 01066000
*   /*                                                               */ 01067000
*   /*****************************************************************/ 01068000
*                                                                  0468 01069000
*   VADR=ADDR(RTM2ERRD);            /* ERROR BYTE A                  */ 01070000
         LA    VADR,RTM2ERRD(,RTM2PTR)                             0468 01071000
*   CALL ACCESRTN;                  /* ACCESS IT                     */ 01072000
         BAL   @14,ACCESRTN                                        0469 01073000
*   IF RCREG=ZERO&DATABYTE^=ZEROBYTE THEN/* NEEDS RESOLVING          */ 01074000
         LTR   RCREG,RCREG                                         0470 01075000
         BNZ   @RF00470                                            0470 01076000
         CLC   DATABYTE(1,DATAPTR),ZEROBYTE                        0470 01077000
         BE    @RF00470                                            0470 01078000
*     DO;                                                          0471 01079000
*       ADPLFMT2=ADDR(RTM2ERRD);                                   0472 01080000
         LA    @14,RTM2ERRD(,RTM2PTR)                              0472 01081000
         ST    @14,ADPLFMT2(,ABDPLPTR)                             0472 01082000
*       ADPLCOM2=ADDR(SUMMARY);     /* SUMMARY PTR IN PARMLIST       */ 01083000
         LA    @14,SUMMARY                                         0473 01084000
         ST    @14,ADPLCOM2(,ABDPLPTR)                             0473 01085000
*       BYTEADDR=ADDR(DATABYTE);    /* ADDR OF BYTE TO BE RESOLVED   */ 01086000
         ST    DATAPTR,BYTEADDR                                    0474 01087000
*       MSGADDR=ADDR(ERRDMSG);      /* MESSAGE ARRAY                 */ 01088000
         LA    @14,ERRDMSG                                         0475 01089000
         ST    @14,MSGADDR                                         0475 01090000
*       MSGLNGTH=LENGTH(ERRDMSG);   /* MSG ARRAY LENGTH              */ 01091000
         MVC   MSGLNGTH(4),@CF03574                                0476 01092000
*       CALL CONVERT;               /* GENERATE OFFSET               */ 01093000
         BAL   @14,CONVERT                                         0477 01094000
*       OFFSET=CONVERTD;            /* PUT OFFSET IN BUFFER          */ 01095000
         L     @14,ADPLBUF(,ABDPLPTR)                              0478 01096000
         MVC   OFFSET(6,@14),CONVERTD                              0478 01097000
*       COLNUM=DEFAULT;             /* WHERE IN BUFFER TO START      */ 01098000
         MVC   COLNUM(4),@CF00087                                  0479 01099000
*       CALL ANALYZE;               /* ANALYZE THE BYTE ANALYZE BYTE */ 01100000
         BAL   @14,ANALYZE                                         0480 01101000
*     END;                          /* END ANALYZE BYTE              */ 01102000
*   ELSE                                                           0482 01103000
*     ;                             /* BYTE DOES NOT NEED ANALYZED   */ 01104000
@RF00470 DS    0H                                                  0483 01105000
*   RETURN CODE(RCCODE);                                           0483 01106000
         L     @15,RCCODE                                          0483 01107000
@EL00003 DS    0H                                                  0483 01108000
@EF00003 DS    0H                                                  0483 01109000
@ER00003 L     @14,@SA00003                                        0483 01110000
         BR    @14                                                 0483 01111000
*   END RT2BITS;                                                   0484 01112000
*HDROUT:                                                           0485 01113000
*   PROC OPTIONS(SAVE(14));                                        0485 01114000
*                                                                  0485 01115000
HDROUT   ST    @14,@SA00004                                        0485 01116000
*/********************************************************************/ 01117000
*/* FUNCTION -                                                     0486 01118000
*      ROUTINE WHICH PRINTS THE BIT SUMMARY HEADER AND UNDERSCORE  0486 01119000
*      FOR THE RTM2WA BIT FLAG SUMMARY.                            0486 01120000
*                                                                  0486 01121000
*   CALLS -                                                        0486 01122000
*      PRINT                                                       0486 01123000
*                                                                  0486 01124000
*   INPUT -                                                        0486 01125000
*      EXPECTS REGISTER 1 TO POINT TO THE PARMLIST PASSED BY THE CALLER 01126000
*                                                                  0486 01127000
*   CALLED BY -                                                    0486 01128000
*      RT2BITS TO PRINT THE BIT SUMMARY HEADER IF NEEDED           0486 01129000
*                                                                  0486 01130000
*   RETURNS TO -                                                   0486 01131000
*      RT2BITS WITHOUT SETTING A RETURN CODE                         */ 01132000
*/********************************************************************/ 01133000
*                                                                  0486 01134000
*   IF HDRBIT=OFF THEN              /* NEEDS HEADER                  */ 01135000
         TM    HDRBIT,B'00010000'                                  0486 01136000
         BNZ   @RF00486                                            0486 01137000
*     DO;                                                          0487 01138000
*       HDRBIT=ON;                  /* HEADER PUT OUT                */ 01139000
         OI    HDRBIT,B'00010000'                                  0488 01140000
*       BUFFER(31:(LENGTH(RT2BSUM)+30))=RT2BSUM;/* SECTION HEADER    */ 01141000
         L     @14,ADPLBUF(,ABDPLPTR)                              0489 01142000
         MVC   BUFFER+30(23,@14),RT2BSUM                           0489 01143000
*       CALL PRINT;                 /* PRINT IT                      */ 01144000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0490 01145000
         BALR  @14,@15                                             0490 01146000
*       BUFFER(31:(LENGTH(RT2BSUS)+30))=RT2BSUS;/* UNDERSCORE        */ 01147000
         L     @14,ADPLBUF(,ABDPLPTR)                              0491 01148000
         MVC   BUFFER+30(23,@14),RT2BSUS                           0491 01149000
*       CALL PRINT;                 /* PRINT IT                      */ 01150000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0492 01151000
         BALR  @14,@15                                             0492 01152000
*       CALL PRINT;                 /* BLANK                         */ 01153000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0493 01154000
         BALR  @14,@15                                             0493 01155000
*     END;                          /* END NEEDS HEADER              */ 01156000
*   ELSE                                                           0495 01157000
*     ;                             /* DOES NOT NEED HEADER          */ 01158000
@RF00486 DS    0H                                                  0496 01159000
*   END HDROUT;                                                    0496 01160000
@EL00004 DS    0H                                                  0496 01161000
@EF00004 DS    0H                                                  0496 01162000
@ER00004 L     @14,@SA00004                                        0496 01163000
         BR    @14                                                 0496 01164000
*SPECIAL:                                                          0497 01165000
*   PROC OPTIONS(SAVE(14));                                        0497 01166000
*                                                                  0497 01167000
SPECIAL  ST    @14,@SA00005                                        0497 01168000
*/********************************************************************/ 01169000
*/* FUNCTION -                                                     0498 01170000
*      ROUTINE WHICH FORMATS THE PART OF THE RTM2 WORK AREA THAT   0498 01171000
*      CHANGES FOR DIFFERENT SU CHANGES. IT CHECKS THE ARRAY NUMBER     01172000
*      TO DETERMINE WHAT DECISION HAS TO BE MADE AND FORMATS THE OUTPUT 01173000
*      LINE ACCORDINGLY.                                           0498 01174000
*                                                                  0498 01175000
*   CALLS -                                                        0498 01176000
*      CALLS CONVERT AND FMTRTN                                    0498 01177000
*                                                                  0498 01178000
*   INPUT -                                                        0498 01179000
*      EXPECTS SUSAVE BITS AND THE ARRAYCNT FILLED IN.             0498 01180000
*                                                                  0498 01181000
*   CALLED BY -                                                    0498 01182000
*      IEAFTRT2 TO FORMAT THE RTM2WA FIELDS CHANGED BY AN SU       0498 01183000
*                                                                  0498 01184000
*   RETURNS TO -                                                   0498 01185000
*      IEAFTRT2 WITH RETURN CODE SET BY FORMAT SERVICE             0498 01186000
*      ROUTINE                                                       */ 01187000
*/********************************************************************/ 01188000
*                                                                  0498 01189000
*   IF RT2ARRAY(ARRAYCNT)=102 THEN  /* FIELDS ADDED AT END FOR BOTH     01190000
*                                      SU17 & SU33                   */ 01191000
         LR    @14,ARRAYCNT                                        0498 01192000
         SLA   @14,2                                               0498 01193000
         L     @14,RT2ARRAY-4(@14)                                 0498 01194000
         CH    @14,@CH01679                                        0498 01195000
         BNE   @RF00498                                            0498 01196000
*     DO;                                                          0499 01197000
*       IF SU33SAVE=ON THEN         /* SU33 ADDED 25 WORDS OVER SU0     01198000
*                                      BASE(3 OF WHICH WERE ADDED BY    01199000
*                                      SU17                          */ 01200000
         TM    SU33SAVE,B'01000000'                                0500 01201000
         BNO   @RF00500                                            0500 01202000
*         DO;                                                      0501 01203000
*           LINEPTR=RTM2NAME(8);    /* SINCE 25 WORDS OF OUTPUT ARE     01204000
*                                      NEEDED AND 8 IS MAXIMUM LIMIT    01205000
*                                      FOR A LINE-NEED FOUR LINES OF    01206000
*                                      OUTPUT                @ZM45190*/ 01207000
         L     LINEPTR,RTM2NAME+28                                 0502 01208000
*           CALL CONVERT;           /* GENERATE OFFSET               */ 01209000
         BAL   @14,CONVERT                                         0503 01210000
*           CALL FMTRTN;            /* FORMAT THE LINE               */ 01211000
         BAL   @14,FMTRTN                                          0504 01212000
*           IF ERRSW=OFF THEN       /* NO PROBLEM PUTTING OUT LINE 1 */ 01213000
         TM    ERRSW,B'00100000'                                   0505 01214000
         BNZ   @RF00505                                            0505 01215000
*             DO;                                                  0506 01216000
*               CALL CONVERT;       /* GENERATE OFFSET               */ 01217000
         BAL   @14,CONVERT                                         0507 01218000
*               CALL FMTRTN;        /* FORMAT THE LINE               */ 01219000
         BAL   @14,FMTRTN                                          0508 01220000
*               IF ERRSW=OFF THEN   /* NO PROBLEM PUTTING OUT LINE 2 */ 01221000
         TM    ERRSW,B'00100000'                                   0509 01222000
         BNZ   @RF00509                                            0509 01223000
*                 DO;                                              0510 01224000
*                   CALL CONVERT;   /* OFFSET                        */ 01225000
         BAL   @14,CONVERT                                         0511 01226000
*                   CALL FMTRTN;    /* FORMAT                        */ 01227000
         BAL   @14,FMTRTN                                          0512 01228000
*                   IF ERRSW=OFF THEN/* NO PROBLEM PUTTING OUT LINE 3   01229000
*                                                            @ZM45190*/ 01230000
         TM    ERRSW,B'00100000'                                   0513 01231000
         BNZ   @RF00513                                            0513 01232000
*                     DO;           /*                       @ZM45190*/ 01233000
*                       LINEPTR=RTM2NAME(1);/* ONE WORD OF DATA    0515 01234000
*                                                            @ZM45190*/ 01235000
         L     LINEPTR,RTM2NAME                                    0515 01236000
*                       CALL CONVERT;/* OFFSET               @ZM95190*/ 01237000
         BAL   @14,CONVERT                                         0516 01238000
*                       CALL FMTRTN;/* FORMAT                @ZM45190*/ 01239000
         BAL   @14,FMTRTN                                          0517 01240000
*                     END;          /* END NO PROBLEM WITH LINE 3  0518 01241000
*                                                            @ZM45190*/ 01242000
*                   ELSE                                           0519 01243000
*                     ;             /* PROBLEM FORMATTING THIRD LINE    01244000
*                                                            @ZM45190*/ 01245000
@RF00513 DS    0H                                                  0520 01246000
*                 END;              /* END NO PROBLEM WITH LINE 2    */ 01247000
*               ELSE                                               0521 01248000
*                 ;                 /* PROBLEM FORMATTING SECOND LINE*/ 01249000
@RF00509 DS    0H                                                  0522 01250000
*             END;                  /* FORMATTED LINE 1 OK           */ 01251000
*           ELSE                                                   0523 01252000
*             ;                     /* PROBLEM FORMATTING FIRST LINE */ 01253000
@RF00505 DS    0H                                                  0524 01254000
*         END;                      /* END SU33 ENDING               */ 01255000
*       ELSE                                                       0525 01256000
*         IF SU17SAVE=ON THEN       /* SU17 ADDED ONLY 3 WORDS TO THE   01257000
*                                      END                           */ 01258000
         B     @RC00500                                            0525 01259000
@RF00500 TM    SU17SAVE,B'10000000'                                0525 01260000
         BNO   @RF00525                                            0525 01261000
*           DO;                                                    0526 01262000
*             LINEPTR=RTM2NAME(3);                                 0527 01263000
         L     LINEPTR,RTM2NAME+8                                  0527 01264000
*             CALL CONVERT;         /* GENERATE OFFSET               */ 01265000
         BAL   @14,CONVERT                                         0528 01266000
*             CALL FMTRTN;          /* FORMAT                        */ 01267000
         BAL   @14,FMTRTN                                          0529 01268000
*           END;                    /* END SU17 ENDING               */ 01269000
*         ELSE                                                     0531 01270000
*           ;                       /* NO NEED TO ADD ANY MORE-BASE     01271000
*                                      TYPE CONTROL BLOCK            */ 01272000
@RF00525 DS    0H                                                  0532 01273000
*     END;                          /* END FIELDS AT END CHECK       */ 01274000
*   ELSE                                                           0533 01275000
*     ;                             /* UNKNOWN CHECK VALUE           */ 01276000
@RF00498 DS    0H                                                  0534 01277000
*   RETURN CODE(RCCODE);                                           0534 01278000
@RC00498 L     @15,RCCODE                                          0534 01279000
@EL00005 DS    0H                                                  0534 01280000
@EF00005 DS    0H                                                  0534 01281000
@ER00005 L     @14,@SA00005                                        0534 01282000
         BR    @14                                                 0534 01283000
*   END SPECIAL;                                                   0535 01284000
*IEAFTESA:                                                         0536 01285000
*   ENTRY;                                                         0536 01286000
*                                                                  0536 01287000
@EP00536 DS    0H                                                  0537 01288000
*/********************************************************************/ 01289000
*/* FUNCTION -                                                     0537 01290000
*      ROUTINE WHICH FORMATS THE BIT FLAGS FROM THE ESA RELATED TO 0537 01291000
*      THE RTM2WA JUST FORMATTED.                                  0537 01292000
*                                                                  0537 01293000
*   INPUT -                                                        0537 01294000
*      REGISTER 1 POINTS TO THE PARMLIST WHICH CONTAINS THE        0537 01295000
*      ADDRESS OF THE CONTROL BLOCK TO BE FORMATTED IN ADPLFMT2    0537 01296000
*      AND THE ADDRESS OF THE ESTAE PARAMETER LIST IN ADPLCOM1.    0537 01297000
*                                                                  0537 01298000
*   CALLS -                                                        0537 01299000
*      CALLS ACCESRTN, ANALYZE, BYTEMODE, CONVERT, AND PRINT       0537 01300000
*                                                                  0537 01301000
*   CALLED BY -                                                    0537 01302000
*      IEAVTFMT TO FORMAT ESA BIT SUMMARY                          0537 01303000
*                                                                  0537 01304000
*   RETURNS TO -                                                   0537 01305000
*      IEAVTFMT WITH RETURN CODE SET BY ACCESS SERVICE             0537 01306000
*      ROUTINES                                                      */ 01307000
*/********************************************************************/ 01308000
*                                                                  0537 01309000
*   ESTAPTR=ADPLCOM1;               /* SAVE PTR TO ESTAE PARM LIST   */ 01310000
         L     @14,ADPLCOM1(,ABDPLPTR)                             0537 01311000
         ST    @14,ESTAPTR                                         0537 01312000
*   STM(VADR,RCREG,LCALREGS);       /* SAVE REGS FOR RETRY           */ 01313000
         STM   VADR,RCREG,LCALREGS(@14)                            0538 01314000
*   SAVEPTR=ADPLFMT2-START;         /* USED IN GENERATING OFFSETS    */ 01315000
         L     @14,ADPLFMT2(,ABDPLPTR)                             0539 01316000
         LR    @08,@14                                             0539 01317000
         SL    @08,START(,ABDPLPTR)                                0539 01318000
         ST    @08,SAVEPTR                                         0539 01319000
*   RBSECPTR=ADPLFMT2;              /* PTR TO SVRB RELATED TO RTM2WA */ 01320000
         LR    RBSECPTR,@14                                        0540 01321000
*   HDRBIT=OFF;                     /* HEADER INDICATOR              */ 01322000
         NI    HDRBIT,B'11101111'                                  0541 01323000
*   HDR(1:LENGTH(ESAHDR))=ESAHDR;   /* PLACE STATIC HDR IN HDR       */ 01324000
         MVC   HDR(61),ESAHDR                                      0542 01325000
*   PACKAREA=RBSECPTR;              /* CHAR AREA FOR ADDRESS TO UNPK */ 01326000
         ST    RBSECPTR,PACKAREA                                   0543 01327000
*   GARBAGE='04'X;                  /* GARBAGE BYTE FOR THE UNPK     */ 01328000
         MVI   GARBAGE,X'04'                                       0544 01329000
*   UNPK(SVRBADR,UNPACK);           /* PLACE IN HEADER               */ 01330000
         UNPK  SVRBADR(9),UNPACK(5)                                0545 01331000
*   TR(SVRBADR,TRANS);              /* TRANSLATE TO PRINTABLE HEX    */ 01332000
         TR    SVRBADR(9),TRANS                                    0546 01333000
*   ESAPTR=ADDR(RBEXSAVE);          /* ESA EMBEDDED IN SVRB          */ 01334000
*                                                                  0547 01335000
         LA    @14,RBEXSAVE(,RBSECPTR)                             0547 01336000
         ST    @14,ESAPTR                                          0547 01337000
*   /*****************************************************************/ 01338000
*   /*                                                               */ 01339000
*   /* ENTRY RTM2 REASON                                             */ 01340000
*   /*                                                               */ 01341000
*   /*****************************************************************/ 01342000
*                                                                  0548 01343000
*   VADR=ADDR(ESAFLAGS);            /* FIRST BYTE OF FLAGS           */ 01344000
         LA    VADR,ESAFLAGS(,@14)                                 0548 01345000
*   CALL ACCESRTN;                  /* ACCESS IT                     */ 01346000
         BAL   @14,ACCESRTN                                        0549 01347000
*   IF(RCREG=ZERO)&(DATABYTE^=ZEROBYTE) THEN/* BYTE NEEDS TO BE    0550 01348000
*                                      ANALYZED                      */ 01349000
         LTR   RCREG,RCREG                                         0550 01350000
         BNZ   @RF00550                                            0550 01351000
         CLC   DATABYTE(1,DATAPTR),ZEROBYTE                        0550 01352000
         BE    @RF00550                                            0550 01353000
*     DO;                                                          0551 01354000
*       HDRBIT=ON;                  /* HEADR BEING PUT OUT           */ 01355000
         OI    HDRBIT,B'00010000'                                  0552 01356000
*       BUFFER(31:(LENGTH(DUMMYHDR)+30))=DUMMYHDR;/* PLACE HDR INTO     01357000
*                                      BUFFER                        */ 01358000
         L     @14,ADPLBUF(,ABDPLPTR)                              0553 01359000
         MVC   BUFFER+30(70,@14),DUMMYHDR                          0553 01360000
*       CALL PRINT;                 /* PRINT TITLE                   */ 01361000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0554 01362000
         BALR  @14,@15                                             0554 01363000
*       BUFFER(31:(LENGTH(ESAUS)+30))=ESAUS;/* UNDER SCORE           */ 01364000
         L     @14,ADPLBUF(,ABDPLPTR)                              0555 01365000
         MVC   BUFFER+30(60,@14),ESAUS                             0555 01366000
*       CALL PRINT;                 /* PRINT IT                      */ 01367000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0556 01368000
         BALR  @14,@15                                             0556 01369000
*       CALL PRINT;                 /* BLANK                         */ 01370000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0557 01371000
         BALR  @14,@15                                             0557 01372000
*       BUFFER(8:(LENGTH(ESASTART)+7))=ESASTART;/* BEGINNING OF    0558 01373000
*                                      MESSAGE                       */ 01374000
         L     @14,ADPLBUF(,ABDPLPTR)                              0558 01375000
         MVC   BUFFER+7(13,@14),ESASTART                           0558 01376000
*       ADPLFMT2=ADDR(ESAFLAGS);    /* ADDRESS FOR GENING OFFSET     */ 01377000
         L     @14,ESAPTR                                          0559 01378000
         LA    @14,ESAFLAGS(,@14)                                  0559 01379000
         ST    @14,ADPLFMT2(,ABDPLPTR)                             0559 01380000
*       ADPLCOM2=ADDR(SUMMARY);     /* SUMMARY PTR IN PARMLIST       */ 01381000
         LA    @14,SUMMARY                                         0560 01382000
         ST    @14,ADPLCOM2(,ABDPLPTR)                             0560 01383000
*       BYTEADDR=ADDR(DATABYTE);    /* ADDR OF BYTE TO BE RESOLVED   */ 01384000
         ST    DATAPTR,BYTEADDR                                    0561 01385000
*       MSGADDR=ADDR(FLAGSMSG);     /* MESSAGE ARRAY                 */ 01386000
         LA    @14,FLAGSMSG                                        0562 01387000
         ST    @14,MSGADDR                                         0562 01388000
*       MSGLNGTH=LENGTH(FLAGSMSG);  /* MSG ARRAY LENGTH              */ 01389000
         MVC   MSGLNGTH(4),@CF03617                                0563 01390000
*       CALL CONVERT;               /* GENERATE OFFSET               */ 01391000
         BAL   @14,CONVERT                                         0564 01392000
*       OFFSET=CONVERTD;            /* PUT OFFSET IN BUFFER          */ 01393000
         L     @14,ADPLBUF(,ABDPLPTR)                              0565 01394000
         MVC   OFFSET(6,@14),CONVERTD                              0565 01395000
*       COLNUM=21;                  /* WHERE IN BUFFER TO START      */ 01396000
         MVC   COLNUM(4),@CF02753                                  0566 01397000
*       CALL ANALYZE;               /* ANALYZE THE BYTE ANALYZE BYTE */ 01398000
         BAL   @14,ANALYZE                                         0567 01399000
*     END;                          /* END ANALYZE BYTE              */ 01400000
*   ELSE                                                           0569 01401000
*     ;                             /* BYTE DID NOT NEED TO BE     0569 01402000
*                                      ANALYZED                      */ 01403000
*                                                                  0569 01404000
@RF00550 DS    0H                                                  0570 01405000
*   /*****************************************************************/ 01406000
*   /*                                                               */ 01407000
*   /* ANALYZE RECURSION FLAGS                                       */ 01408000
*   /*                                                               */ 01409000
*   /*****************************************************************/ 01410000
*                                                                  0570 01411000
*   VADR=ADDR(ESARFLAG);            /* RECURSION FLAGS               */ 01412000
         L     @14,ESAPTR                                          0570 01413000
         LA    VADR,ESARFLAG(,@14)                                 0570 01414000
*   CALL ACCESRTN;                  /* ACCESS IT                     */ 01415000
         BAL   @14,ACCESRTN                                        0571 01416000
*   IF(RCREG=ZERO)&(DATABYTE^=ZEROBYTE) THEN/* ANALYZE BYTE          */ 01417000
         LTR   RCREG,RCREG                                         0572 01418000
         BNZ   @RF00572                                            0572 01419000
         CLC   DATABYTE(1,DATAPTR),ZEROBYTE                        0572 01420000
         BE    @RF00572                                            0572 01421000
*     DO;                                                          0573 01422000
*       IF HDRBIT=OFF THEN          /* NEEDS A HDR                   */ 01423000
         TM    HDRBIT,B'00010000'                                  0574 01424000
         BNZ   @RF00574                                            0574 01425000
*         DO;                                                      0575 01426000
*           HDRBIT=ON;              /* HEADR BEING PUT OUT           */ 01427000
         OI    HDRBIT,B'00010000'                                  0576 01428000
*           BUFFER(31:(LENGTH(DUMMYHDR)+30))=DUMMYHDR;/* PLACE HDR 0577 01429000
*                                      INTO BUFFER                   */ 01430000
         L     @14,ADPLBUF(,ABDPLPTR)                              0577 01431000
         MVC   BUFFER+30(70,@14),DUMMYHDR                          0577 01432000
*           CALL PRINT;             /* PRINT TITLE                   */ 01433000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0578 01434000
         BALR  @14,@15                                             0578 01435000
*           BUFFER(31:(LENGTH(ESAUS)+30))=ESAUS;/* UNDER SCORE       */ 01436000
         L     @14,ADPLBUF(,ABDPLPTR)                              0579 01437000
         MVC   BUFFER+30(60,@14),ESAUS                             0579 01438000
*           CALL PRINT;             /* PRINT IT                      */ 01439000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0580 01440000
         BALR  @14,@15                                             0580 01441000
*           CALL PRINT;             /* BLANK                         */ 01442000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0581 01443000
         BALR  @14,@15                                             0581 01444000
*         END;                      /* END PUT OUT HDR               */ 01445000
*       ELSE                                                       0583 01446000
*         ;                         /* NO NEED FOR ANOTHER HDR       */ 01447000
@RF00574 DS    0H                                                  0584 01448000
*       BUFFER(8:(LENGTH(RECUR)+7))=RECUR;/* MESSAGE START           */ 01449000
         L     @14,ADPLBUF(,ABDPLPTR)                              0584 01450000
         MVC   BUFFER+7(17,@14),RECUR                              0584 01451000
*       ADPLFMT2=ADDR(ESARFLAG);    /* ADDRESS FOR GETTING OFFSET    */ 01452000
         L     @14,ESAPTR                                          0585 01453000
         LA    @14,ESARFLAG(,@14)                                  0585 01454000
         ST    @14,ADPLFMT2(,ABDPLPTR)                             0585 01455000
*       ADPLCOM2=ADDR(SUMMARY);     /* SUMMARY PTR IN PARMLIST       */ 01456000
         LA    @14,SUMMARY                                         0586 01457000
         ST    @14,ADPLCOM2(,ABDPLPTR)                             0586 01458000
*       BYTEADDR=ADDR(DATABYTE);    /* ADDR OF BYTE TO BE RESOLVED   */ 01459000
         ST    DATAPTR,BYTEADDR                                    0587 01460000
*       MSGADDR=ADDR(RECURMSG);     /* MESSAGE ARRAY                 */ 01461000
         LA    @14,RECURMSG                                        0588 01462000
         ST    @14,MSGADDR                                         0588 01463000
*       MSGLNGTH=LENGTH(RECURMSG);  /* MSG ARRAY LENGTH              */ 01464000
         MVC   MSGLNGTH(4),@CF00038                                0589 01465000
*       CALL CONVERT;               /* GENERATE OFFSET               */ 01466000
         BAL   @14,CONVERT                                         0590 01467000
*       OFFSET=CONVERTD;            /* PUT OFFSET IN BUFFER          */ 01468000
         L     @14,ADPLBUF(,ABDPLPTR)                              0591 01469000
         MVC   OFFSET(6,@14),CONVERTD                              0591 01470000
*       COLNUM=25;                  /* WHERE IN BUFFER TO START      */ 01471000
         MVC   COLNUM(4),@CF02675                                  0592 01472000
*       CALL ANALYZE;               /* ANALYZE THE BYTE ANALYZE BYTE */ 01473000
         BAL   @14,ANALYZE                                         0593 01474000
*     END;                          /* END ANALYZE BYTE              */ 01475000
*   ELSE                                                           0595 01476000
*     ;                             /* BYTE DID NOT NEED ANALYZED    */ 01477000
*                                                                  0595 01478000
@RF00572 DS    0H                                                  0596 01479000
*   /*****************************************************************/ 01480000
*   /*                                                               */ 01481000
*   /* ANALYZE RTM1 ENTRY REASON                                     */ 01482000
*   /*                                                               */ 01483000
*   /*****************************************************************/ 01484000
*                                                                  0596 01485000
*   VADR=ADDR(ESAERTYP);            /* ENTRY REASON                  */ 01486000
         L     @14,ESAPTR                                          0596 01487000
         LA    VADR,ESAERTYP(,@14)                                 0596 01488000
*   CALL ACCESRTN;                  /* ACCESS IT                     */ 01489000
         BAL   @14,ACCESRTN                                        0597 01490000
*   IF(RCREG=ZERO)&(DATABYTE^=ZEROBYTE) THEN/* ANALYZE BYTE          */ 01491000
         LTR   RCREG,RCREG                                         0598 01492000
         BNZ   @RF00598                                            0598 01493000
         CLC   DATABYTE(1,DATAPTR),ZEROBYTE                        0598 01494000
         BE    @RF00598                                            0598 01495000
*     DO;                                                          0599 01496000
*       IF HDRBIT=OFF THEN          /* NEEDS A HDR                   */ 01497000
         TM    HDRBIT,B'00010000'                                  0600 01498000
         BNZ   @RF00600                                            0600 01499000
*         DO;                                                      0601 01500000
*           HDRBIT=ON;              /* HEADR BEING PUT OUT           */ 01501000
         OI    HDRBIT,B'00010000'                                  0602 01502000
*           BUFFER(31:(LENGTH(DUMMYHDR)+30))=DUMMYHDR;/* PLACE HDR 0603 01503000
*                                      INTO BUFFER                   */ 01504000
         L     @14,ADPLBUF(,ABDPLPTR)                              0603 01505000
         MVC   BUFFER+30(70,@14),DUMMYHDR                          0603 01506000
*           CALL PRINT;             /* PRINT TITLE                   */ 01507000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0604 01508000
         BALR  @14,@15                                             0604 01509000
*           BUFFER(31:(LENGTH(ESAUS)+30))=ESAUS;/* UNDER SCORE       */ 01510000
         L     @14,ADPLBUF(,ABDPLPTR)                              0605 01511000
         MVC   BUFFER+30(60,@14),ESAUS                             0605 01512000
*           CALL PRINT;             /* PRINT IT                      */ 01513000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0606 01514000
         BALR  @14,@15                                             0606 01515000
*           CALL PRINT;             /* BLANK                         */ 01516000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0607 01517000
         BALR  @14,@15                                             0607 01518000
*         END;                      /* END PUT OUT HDR               */ 01519000
*       ELSE                                                       0609 01520000
*         ;                         /* NO NEED FOR ANOTHER HDR       */ 01521000
@RF00600 DS    0H                                                  0610 01522000
*       ADPLFMT2=ADDR(ESAERTYP);    /* FOR FINDING OFFSET            */ 01523000
         L     @14,ESAPTR                                          0610 01524000
         LA    @14,ESAERTYP(,@14)                                  0610 01525000
         ST    @14,ADPLFMT2(,ABDPLPTR)                             0610 01526000
*       CALL ENTRYRT1;              /* ROUTINE TO ANALYZE BYTE       */ 01527000
         BAL   @14,ENTRYRT1                                        0611 01528000
*       CALL PRINT;                 /* PRINT OUTPUT LINE             */ 01529000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0612 01530000
         BALR  @14,@15                                             0612 01531000
*     END;                          /* END ANALYZE BYTE              */ 01532000
*   ELSE                                                           0614 01533000
*     ;                             /* BYTE DID NOT NEED TO BE     0614 01534000
*                                      ANALYZED                      */ 01535000
*                                                                  0614 01536000
@RF00598 DS    0H                                                  0615 01537000
*   /*****************************************************************/ 01538000
*   /*                                                               */ 01539000
*   /* ANALYZE MODE BYTE                                             */ 01540000
*   /*                                                               */ 01541000
*   /*****************************************************************/ 01542000
*                                                                  0615 01543000
*   VADR=ADDR(ESAMODE);             /* MODE BYTE                     */ 01544000
         L     @14,ESAPTR                                          0615 01545000
         LA    VADR,ESAMODE(,@14)                                  0615 01546000
*   CALL ACCESRTN;                  /* ACCESS IT                     */ 01547000
         BAL   @14,ACCESRTN                                        0616 01548000
*   IF(RCREG=ZERO)&(DATABYTE^=ZEROBYTE) THEN/* ANALYZE BYTE          */ 01549000
         LTR   RCREG,RCREG                                         0617 01550000
         BNZ   @RF00617                                            0617 01551000
         CLC   DATABYTE(1,DATAPTR),ZEROBYTE                        0617 01552000
         BE    @RF00617                                            0617 01553000
*     DO;                                                          0618 01554000
*       IF HDRBIT=OFF THEN          /* NEEDS A HDR                   */ 01555000
         TM    HDRBIT,B'00010000'                                  0619 01556000
         BNZ   @RF00619                                            0619 01557000
*         DO;                                                      0620 01558000
*           HDRBIT=ON;              /* HEADR BEING PUT OUT           */ 01559000
         OI    HDRBIT,B'00010000'                                  0621 01560000
*           BUFFER(31:(LENGTH(DUMMYHDR)+30))=DUMMYHDR;/* PLACE HDR 0622 01561000
*                                      INTO BUFFER                   */ 01562000
         L     @14,ADPLBUF(,ABDPLPTR)                              0622 01563000
         MVC   BUFFER+30(70,@14),DUMMYHDR                          0622 01564000
*           CALL PRINT;             /* PRINT TITLE                   */ 01565000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0623 01566000
         BALR  @14,@15                                             0623 01567000
*           BUFFER(31:(LENGTH(ESAUS)+30))=ESAUS;/* UNDER SCORE       */ 01568000
         L     @14,ADPLBUF(,ABDPLPTR)                              0624 01569000
         MVC   BUFFER+30(60,@14),ESAUS                             0624 01570000
*           CALL PRINT;             /* PRINT IT                      */ 01571000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0625 01572000
         BALR  @14,@15                                             0625 01573000
*           CALL PRINT;             /* BLANK                         */ 01574000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0626 01575000
         BALR  @14,@15                                             0626 01576000
*         END;                      /* END PUT OUT HDR               */ 01577000
*       ELSE                                                       0628 01578000
*         ;                         /* NO NEED FOR ANOTHER HDR       */ 01579000
@RF00619 DS    0H                                                  0629 01580000
*       ADPLFMT2=ADDR(ESAMODE);     /* FOR GETTING OFFSET            */ 01581000
         L     @14,ESAPTR                                          0629 01582000
         LA    @14,ESAMODE(,@14)                                   0629 01583000
         ST    @14,ADPLFMT2(,ABDPLPTR)                             0629 01584000
*       CALL BYTEMODE;              /* ROUTINE TO ANALYZE MODE BYTE  */ 01585000
         BAL   @14,BYTEMODE                                        0630 01586000
*     END;                          /* END ANALYZE BYTE              */ 01587000
*   ELSE                                                           0632 01588000
*     ;                             /* NO NEED TO ANALYZE BYTE       */ 01589000
@RF00617 DS    0H                                                  0633 01590000
*   DUMMYHDR=BLANKS(1:LENGTH(DUMMYHDR));/* CLEAR DUMMY HDR FOR NEXT     01591000
*                                      USER                          */ 01592000
         MVC   DUMMYHDR(70),BLANKS                                 0633 01593000
*   LCALREGS=RTYREGS;               /* RESTORE CALLERS EXPECTED RETRY   01594000
*                                      REGS                          */ 01595000
         L     @14,ESTAPTR                                         0634 01596000
         MVC   LCALREGS(64,@14),RTYREGS(@14)                       0634 01597000
*   RETURN CODE(RCCODE);            /* END OF IEAFTESA               */ 01598000
         L     @08,RCCODE                                          0635 01599000
         L     @13,4(,@13)                                         0635 01600000
         L     @00,@SIZDATD                                        0635 01601000
         LR    @01,@09                                             0635 01602000
         FREEMAIN R,LV=(0),A=(1)                                        01603000
         LR    @15,@08                                             0635 01604000
         L     @14,12(,@13)                                        0635 01605000
         LM    @00,@12,20(@13)                                     0635 01606000
         BR    @14                                                 0635 01607000
*IEAFTSDW:                                                         0636 01608000
*   ENTRY;                                                         0636 01609000
*                                                                  0636 01610000
@EP00636 DS    0H                                                  0637 01611000
*/********************************************************************/ 01612000
*/* FUNCTION -                                                     0637 01613000
*      ROUTINE WHICH FORMATS THE REGISTERS AT TIME OF ERROR TAKEN  0637 01614000
*      FROM THE SDWA ASSOCIATED WITH THE RTM2WA JUST FORMATTED.    0637 01615000
*                                                                  0637 01616000
*   INPUT -                                                        0637 01617000
*      REGISTER 1 POINTS TO THE PARMLIST WHICH CONTAINS THE        0637 01618000
*      ADDRESS OF THE CONTROL BLOCK TO BE FORMATTED IN ADPLFMT2,   0637 01619000
*      THE OFFSET TO BE PLACED ALONG SIDE THE FIRST FIELD IN ADPLFMT1   01620000
*      ALSO DEFINED AS START,AND THE ADDRESS OF THE ESTAE PARAMETER LIS 01621000
*      IN ADPLCOM1.                                                0637 01622000
*                                                                  0637 01623000
*   CALLS -                                                        0637 01624000
*      CALLS CONVERT, FMTRTN, AND PRINT                            0637 01625000
*                                                                  0637 01626000
*   CALLED BY -                                                    0637 01627000
*      IEAVTFMT TO FORMAT REGS FROM SDWA                           0637 01628000
*                                                                  0637 01629000
*   RETURNS TO -                                                   0637 01630000
*      IEAVTFMT WITH RETURN CODE SET BY FORMAT SERVICE             0637 01631000
*      ROUTINES                                                      */ 01632000
*/********************************************************************/ 01633000
*                                                                  0637 01634000
*   ESTAPTR=ADPLCOM1;               /* SAVE PTR TO ESTAE PARM LIST   */ 01635000
         L     @14,ADPLCOM1(,ABDPLPTR)                             0637 01636000
         ST    @14,ESTAPTR                                         0637 01637000
*   STM(VADR,RCREG,LCALREGS);       /* SAVE REGS FOR RETRY           */ 01638000
         STM   VADR,RCREG,LCALREGS(@14)                            0638 01639000
*   ADPLCOM1=ADDR(SDWAFMT);         /* ERROR MESSAGE                 */ 01640000
         LA    @14,SDWAFMT                                         0639 01641000
         ST    @14,ADPLCOM1(,ABDPLPTR)                             0639 01642000
*   SAVEPTR=ADPLFMT2-START;         /* BEGINNING OF SDWA             */ 01643000
         L     @14,ADPLFMT2(,ABDPLPTR)                             0640 01644000
         LR    @08,@14                                             0640 01645000
         SL    @08,START(,ABDPLPTR)                                0640 01646000
         ST    @08,SAVEPTR                                         0640 01647000
*   SDWAPTR=ADPLFMT2;               /* PTR TO THE SDWA               */ 01648000
         LR    SDWAPTR,@14                                         0641 01649000
*   ERRSW=OFF;                      /* INITIALIZE ERROR INDICATOR    */ 01650000
*                                                                  0642 01651000
         NI    ERRSW,B'11011111'                                   0642 01652000
*   /*****************************************************************/ 01653000
*   /*                                                               */ 01654000
*   /* SET UP HEADER                                                 */ 01655000
*   /*                                                               */ 01656000
*   /*****************************************************************/ 01657000
*                                                                  0643 01658000
*   PACKAREA=SDWAPTR;               /* CHAR AREA FOR ADDRESS TO UNPK */ 01659000
         ST    SDWAPTR,PACKAREA                                    0643 01660000
*   GARBAGE='04'X;                  /* GARBAGE BYTE FOR THE UNPK     */ 01661000
         MVI   GARBAGE,X'04'                                       0644 01662000
*   UNPK(SVRBADR,UNPACK);           /* PLACE IN HEADER               */ 01663000
         UNPK  SVRBADR(9),UNPACK(5)                                0645 01664000
*   TR(SVRBADR,TRANS);              /* TRANSLATE TO PRINTABLE HEX    */ 01665000
         TR    SVRBADR(9),TRANS                                    0646 01666000
*   HDR(1:LENGTH(SDWAHDR))=SDWAHDR; /* HEADER LINE                   */ 01667000
         MVC   HDR(42),SDWAHDR                                     0647 01668000
*   BUFFER(31:(LENGTH(DUMMYHDR)+30))=DUMMYHDR;/* FILL IN HDR         */ 01669000
         L     @14,ADPLBUF(,ABDPLPTR)                              0648 01670000
         MVC   BUFFER+30(70,@14),DUMMYHDR                          0648 01671000
*   CALL PRINT;                     /* PRINT HEADER                  */ 01672000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0649 01673000
         BALR  @14,@15                                             0649 01674000
*   BUFFER(31:(LENGTH(SDWAUS)+30))=SDWAUS;/* UNDER SCORE             */ 01675000
         L     @14,ADPLBUF(,ABDPLPTR)                              0650 01676000
         MVC   BUFFER+30(42,@14),SDWAUS                            0650 01677000
*   CALL PRINT;                     /* PRINT IT                      */ 01678000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0651 01679000
         BALR  @14,@15                                             0651 01680000
*   CALL PRINT;                     /* BLANK                         */ 01681000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0652 01682000
         BALR  @14,@15                                             0652 01683000
*   CALL PRINT;                     /* BLANK                         */ 01684000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0653 01685000
         BALR  @14,@15                                             0653 01686000
*   ADPLFMT2=ADDR(SDWAGRSV);        /* REGISTERS AT ERROR            */ 01687000
         LA    @14,SDWAGRSV(,SDWAPTR)                              0654 01688000
         ST    @14,ADPLFMT2(,ABDPLPTR)                             0654 01689000
*   LINEPTR=SUMNAMES(4);            /* FORMAT PATTERN FOR REGS PART 1*/ 01690000
         L     LINEPTR,SUMNAMES+12                                 0655 01691000
*   CALL CONVERT;                   /* GENERATE OFFSET               */ 01692000
         BAL   @14,CONVERT                                         0656 01693000
*   CALL FMTRTN;                    /* FORMAT                        */ 01694000
         BAL   @14,FMTRTN                                          0657 01695000
*   IF ERRSW=OFF THEN               /* FORMATTED PART1 OK            */ 01696000
         TM    ERRSW,B'00100000'                                   0658 01697000
         BNZ   @RF00658                                            0658 01698000
*     DO;                                                          0659 01699000
*       LINEPTR=SUMNAMES(5);        /* FORMAT PATTERN FOR REGS PART2 */ 01700000
         L     LINEPTR,SUMNAMES+16                                 0660 01701000
*       CALL CONVERT;               /* GEN OFFSET                    */ 01702000
         BAL   @14,CONVERT                                         0661 01703000
*       CALL FMTRTN;                /* FORMAT                        */ 01704000
         BAL   @14,FMTRTN                                          0662 01705000
*     END;                          /* END FORMATTED PART1 OK        */ 01706000
*   ELSE                                                           0664 01707000
*     ;                             /* ERROR FORMATTING PART1        */ 01708000
@RF00658 DS    0H                                                  0665 01709000
*   DUMMYHDR=BLANKS(1:LENGTH(DUMMYHDR));/* CLEAR DUMMY HDR FOR NEXT     01710000
*                                      USER                          */ 01711000
         MVC   DUMMYHDR(70),BLANKS                                 0665 01712000
*   LCALREGS=RTYREGS;               /* RESTORE CALLERS EXPECTED RETRY   01713000
*                                      REGS                          */ 01714000
         L     @14,ESTAPTR                                         0666 01715000
         MVC   LCALREGS(64,@14),RTYREGS(@14)                       0666 01716000
*   RETURN CODE(RCCODE);            /* END IEAFTSDW                  */ 01717000
         L     @08,RCCODE                                          0667 01718000
         L     @13,4(,@13)                                         0667 01719000
         L     @00,@SIZDATD                                        0667 01720000
         LR    @01,@09                                             0667 01721000
         FREEMAIN R,LV=(0),A=(1)                                        01722000
         LR    @15,@08                                             0667 01723000
         L     @14,12(,@13)                                        0667 01724000
         LM    @00,@12,20(@13)                                     0667 01725000
         BR    @14                                                 0667 01726000
*                                                                  0668 01727000
*/********************************************************************/ 01728000
*/*                                                                  */ 01729000
*/*         THE FOLLOWING CODE HAS BEEN INCLUDED FROM SYSLIB MEMBER  */ 01730000
*/*     IHAFTCD1 INTO THE MODULE. THE CODE IS INCLUDED ONLY FROM     */ 01731000
*/*     THE EED FORMATTER AND THE IHSA-FRRS FORMATTER. THE INCLUDED  */ 01732000
*/*     CODE CONSISTS OF THE BYTEMODE AND ENTRYRT1 ROUTINES.         */ 01733000
*/*         THE CODE HAS BEEN INCLUDED IN ORDER TO SIMPLIFY          */ 01734000
*/*     MAINTENANCE BY HAVING THE CODE IN ONLY ONE PLACE INSTEAD     */ 01735000
*/*     OF DUPLICATING IT IN EACH MODULE.                            */ 01736000
*/********************************************************************/ 01737000
*                                                                  0668 01738000
*                                                                  0668 01739000
*   /*****************************************************************/ 01740000
*   /*                                                               */ 01741000
*   /* WORK AREAS UNIQUE TO THE INCLUDED CODE FROM IHAFTCD1          */ 01742000
*   /*                                                               */ 01743000
*   /*****************************************************************/ 01744000
*                                                                  0668 01745000
*   DCL                                                            0668 01746000
*     ENDMSG CHAR(70) BASED;        /* AREA TO FINISH MSG IN         */ 01747000
*                                                                  0668 01748000
*   /*****************************************************************/ 01749000
*   /*                                                               */ 01750000
*   /* MESSAGES UNIQUE TO THE INCLUDED CODE                          */ 01751000
*   /*                                                               */ 01752000
*   /*****************************************************************/ 01753000
*                                                                  0669 01754000
*   DCL                                                            0669 01755000
*     EXITMSG CHAR(34) INIT('FIELD CONTAINS INTERNAL EXIT FLAGS'); 0669 01756000
*   DCL                                                            0670 01757000
*     MODEMSG(8) CHAR(25) INIT('SUPERVISOR CONTROL MODE',          0670 01758000
*         'PHYSICALLY DISABLED STATE','GLOBAL SPIN LOCK HELD',     0670 01759000
*         'GLOBAL SUSPEND LOCK HELD','LOCALLY LOCKED MODE',        0670 01760000
*         'TYPE 1 SVC MODE','SRB MODE','TASK MODE');               0670 01761000
*   DCL                                                            0671 01762000
*     RTARRAY(14) CHAR(50) INIT('PROGRAM CHECK','RESTART','SVC ERROR',  01763000
*         'DAT ERROR','MACHINE CHECK REENTRY',                     0671 01764000
*         'RESCHEDULE OF PAGE I/O ERROR',                          0671 01765000
*         'RESCHEDULE OF ABNORMAL TERMINATION',                    0671 01766000
*         'RESCHEDULE OF ABNORMAL TERMINATION THROUGH CVTBTRM',    0671 01767000
*         'RESCHEDULE OF CROSS MEMORY ABNORMAL TERMINATION',       0671 01768000
*         'RESCHEDULE OF ABNORMAL TERMINATION OF CURRENT TCB',     0671 01769000
*         'MEMORY TERMINATION','CROSS MEMORY ABNORMAL TERMINATION',     01770000
*         'RESCHEDULE OF RTM1 ON OTHER CPU','MACHINE CHECK');      0671 01771000
*   DCL                                                            0672 01772000
*     RTSTART CHAR(17) INIT('RTM1 ENTERED FOR ');                  0672 01773000
*   DCL                                                            0673 01774000
*     SYSTATE CHAR(13) INIT('SYSTEM STATE:');                      0673 01775000
*BYTEMODE:                                                         0674 01776000
*   PROC OPTIONS(SAVE(14));                                        0674 01777000
*                                                                  0674 01778000
BYTEMODE ST    @14,@SA00006                                        0674 01779000
*/********************************************************************/ 01780000
*/* FUNCTION-                                                      0675 01781000
*       ROUTINE TO ANALYZE THE SYSTEM MODE BYTE AND PLACE THE      0675 01782000
*     CORRESPONDING MESSAGE IN THE BUFFER AND PRINT OUT THE DATA.  0675 01783000
*                                                                  0675 01784000
*                                                                  0675 01785000
*   INPUT -                                                        0675 01786000
*       DATAPTR MUST CONTAIN THE ADDRESS OF THE BYTE TO BE ANALYZED     01787000
*     AND REGISTER 1 POINTS TO THE PARMLIST.                       0675 01788000
*                                                                  0675 01789000
*    CALLS-                                                        0675 01790000
*       ANALYZE AND CONVERT                                        0675 01791000
*                                                                  0675 01792000
*    CALLED BY -                                                   0675 01793000
*        EEDBITS, IEAFTESA, RT1BITS TO ANALYZE THE MODE BYTE       0675 01794000
*                                                                  0675 01795000
*    RETURNS TO -                                                  0675 01796000
*        CALLER WITHOUT SETTING A RETURN CODE                      0675 01797000
*                                                                  0675 01798000
*   THIS PROCEDURE HAS BEEN INCLUDED FROM SYSLIB(IHAFTCD1) ------  0675 01799000
*                                                                    */ 01800000
*/********************************************************************/ 01801000
*                                                                  0675 01802000
*   BUFFER(8:(LENGTH(SYSTATE)+7))=SYSTATE;/* BEGINNING OF MESSAGE    */ 01803000
         L     @14,ADPLBUF(,ABDPLPTR)                              0675 01804000
         MVC   BUFFER+7(13,@14),SYSTATE                            0675 01805000
*   ADPLCOM2=ADDR(SUMMARY);         /* SUMMARY PTR IN PARMLIST       */ 01806000
         LA    @14,SUMMARY                                         0676 01807000
         ST    @14,ADPLCOM2(,ABDPLPTR)                             0676 01808000
*   BYTEADDR=ADDR(DATABYTE);        /* ADDR OF BYTE TO BE RESOLVED   */ 01809000
         ST    DATAPTR,BYTEADDR                                    0677 01810000
*   MSGADDR=ADDR(MODEMSG);          /* MESSAGE ARRAY                 */ 01811000
         LA    @14,MODEMSG                                         0678 01812000
         ST    @14,MSGADDR                                         0678 01813000
*   MSGLNGTH=LENGTH(MODEMSG);       /* MSG ARRAY LENGTH              */ 01814000
         MVC   MSGLNGTH(4),@CF02675                                0679 01815000
*   CALL CONVERT;                   /* GENERATE OFFSET               */ 01816000
         BAL   @14,CONVERT                                         0680 01817000
*   OFFSET=CONVERTD;                /* PUT OFFSET IN BUFFER          */ 01818000
         L     @14,ADPLBUF(,ABDPLPTR)                              0681 01819000
         MVC   OFFSET(6,@14),CONVERTD                              0681 01820000
*   COLNUM=22;                      /* WHERE IN BUFFER TO START      */ 01821000
         MVC   COLNUM(4),@CF03228                                  0682 01822000
*   CALL ANALYZE;                   /* ANALYZE THE BYTE ANALYZE BYTE */ 01823000
         BAL   @14,ANALYZE                                         0683 01824000
*   END BYTEMODE;                                                  0684 01825000
@EL00006 DS    0H                                                  0684 01826000
@EF00006 DS    0H                                                  0684 01827000
@ER00006 L     @14,@SA00006                                        0684 01828000
         BR    @14                                                 0684 01829000
*ENTRYRT1:                                                         0685 01830000
*   PROC OPTIONS(SAVE(14));                                        0685 01831000
*                                                                  0685 01832000
ENTRYRT1 ST    @14,@SA00007                                        0685 01833000
*/********************************************************************/ 01834000
*/* FUNCTION-                                                      0686 01835000
*       ROUTINE TO ANALYZE THE RTM1 ENTRY POINT CODE AND FILL IN   0686 01836000
*     THE BUFFER WITH THE APPROPRIATE MESSAGE. IT ALSO FILLS IN    0686 01837000
*     THE OFFSET TO BE PLACED ALONG SIDE THE MESSAGE.              0686 01838000
*                                                                  0686 01839000
*                                                                  0686 01840000
*   INPUT -                                                        0686 01841000
*       DATAPTR MUST CONTAIN THE ADDRESS OF THE BYTE TO BE ANALYZED     01842000
*     AND REGISTER 1 POINTS TO THE PARMLIST PASSED BY THE CALLER.  0686 01843000
*                                                                  0686 01844000
*    CALLS-                                                        0686 01845000
*       CONVERT                                                    0686 01846000
*                                                                  0686 01847000
*    CALLED BY -                                                   0686 01848000
*        EEDBITS, RT1BITS TO ANALYZE ENTRY TO RT1 REASON BYTE      0686 01849000
*                                                                  0686 01850000
*    RETURNS TO -                                                  0686 01851000
*        CALLER WITHOUT SETTING A RETURN CODE                      0686 01852000
*                                                                  0686 01853000
*   THIS PROCEDURE HAS BEEN INCLUDED FROM SYSLIB(IHAFTCD1) ------  0686 01854000
*                                                                    */ 01855000
*/********************************************************************/ 01856000
*                                                                  0686 01857000
*   CALL CONVERT;                   /* GENERATE OFFSET               */ 01858000
         BAL   @14,CONVERT                                         0686 01859000
*   OFFSET=CONVERTD;                /* PLACE IN BUFFER               */ 01860000
         L     @14,ADPLBUF(,ABDPLPTR)                              0687 01861000
         MVC   OFFSET(6,@14),CONVERTD                              0687 01862000
*   IF DATABYTE>RT1WMACH THEN       /* FIELD CONTAINS EXIT FLAGS     */ 01863000
         CLI   DATABYTE(DATAPTR),20                                0688 01864000
         BNH   @RF00688                                            0688 01865000
*     BUFFER(8:(LENGTH(EXITMSG)+7))=EXITMSG;                       0689 01866000
         MVC   BUFFER+7(34,@14),EXITMSG                            0689 01867000
*   ELSE                                                           0690 01868000
*     DO;                           /* WAS NOT EXIT FLAGS            */ 01869000
         B     @RC00688                                            0690 01870000
@RF00688 DS    0H                                                  0691 01871000
*       BUFFER(8:(LENGTH(RTSTART)+7))=RTSTART;/* FILL IN BEGINNING OF   01872000
*                                      BUFFER                        */ 01873000
         L     @14,ADPLBUF(,ABDPLPTR)                              0691 01874000
         MVC   BUFFER+7(17,@14),RTSTART                            0691 01875000
*       RFY                                                        0692 01876000
*         ENDMSG BASED(ADDR(BUFFER)+LENGTH(RTSTART)+8);            0692 01877000
*       IF DATABYTE<=RT1WMCHR THEN  /* FIRST 5 CORRESPOND TO ARRAY   */ 01878000
         CLI   DATABYTE(DATAPTR),5                                 0693 01879000
         BH    @RF00693                                            0693 01880000
*         ENDMSG=RTARRAY(DATABYTE); /* END OF MESSAGE                */ 01881000
         MVI   ENDMSG+75(@14),C' '                                 0694 01882000
         MVC   ENDMSG+76(19,@14),ENDMSG+75(@14)                    0694 01883000
         SLR   @08,@08                                             0694 01884000
         IC    @08,DATABYTE(,DATAPTR)                              0694 01885000
         MH    @08,@CH03793                                        0694 01886000
         LA    @07,RTARRAY-50(@08)                                 0694 01887000
         MVC   ENDMSG+25(50,@14),0(@07)                            0694 01888000
*       ELSE                        /* NOT OF FIRST 5                */ 01889000
*         IF DATABYTE<=RSCHDCPU THEN/* NEXT BATCH OF VALUES          */ 01890000
         B     @RC00693                                            0695 01891000
@RF00693 CLI   DATABYTE(DATAPTR),17                                0695 01892000
         BH    @RF00695                                            0695 01893000
*           ENDMSG=RTARRAY(DATABYTE-'04'X);/* CORRESPONDING ARRAY  0696 01894000
*                                      VALUE                         */ 01895000
         L     @14,ADPLBUF(,ABDPLPTR)                              0696 01896000
         MVI   ENDMSG+75(@14),C' '                                 0696 01897000
         MVC   ENDMSG+76(19,@14),ENDMSG+75(@14)                    0696 01898000
         SLR   @08,@08                                             0696 01899000
         IC    @08,DATABYTE(,DATAPTR)                              0696 01900000
         MH    @08,@CH03793                                        0696 01901000
         LA    @07,RTARRAY-250(@08)                                0696 01902000
         MVC   ENDMSG+25(50,@14),0(@07)                            0696 01903000
*         ELSE                                                     0697 01904000
*           ENDMSG=RTARRAY(DIM(RTARRAY));/* LAST MESSAGE             */ 01905000
         B     @RC00695                                            0697 01906000
@RF00695 L     @14,ADPLBUF(,ABDPLPTR)                              0697 01907000
         MVI   ENDMSG+75(@14),C' '                                 0697 01908000
         MVC   ENDMSG+76(19,@14),ENDMSG+75(@14)                    0697 01909000
         MVC   ENDMSG+25(50,@14),RTARRAY+650                       0697 01910000
*     END;                          /* END DID NOT CONTAIN EXIT FLAGS*/ 01911000
*   END ENTRYRT1;                                                  0699 01912000
@EL00007 DS    0H                                                  0699 01913000
@EF00007 DS    0H                                                  0699 01914000
@ER00007 L     @14,@SA00007                                        0699 01915000
         BR    @14                                                 0699 01916000
*                                                                  0700 01917000
*/********************************************************************/ 01918000
*/*                                                                  */ 01919000
*/*         THE FOLLOWING CODE HAS BEEN INCLUDED FROM SYSLIB MEMBER  */ 01920000
*/*     IHAFTCDE INTO THE MODULE. THE CODE IS COMMON AMONG ALL THE   */ 01921000
*/*     CONTROL BLOCK FORMAT MODULES FOR THE RTM FORMATTER. THE      */ 01922000
*/*     INCLUDED CODE CONSISTS OF THE ACCESS, FORMAT, CONVERT,       */ 01923000
*/*     AND ANALYZE ROUTINES USED BY ALL THE MODULES.                */ 01924000
*/*         THE CODE HAS BEEN INCLUDED IN ORDER TO SIMPLIFY          */ 01925000
*/*     MAINTENANCE BY HAVING THE CODE IN ONLY ONE PLACE INSTEAD     */ 01926000
*/*     OF DUPLICATING IT IN EACH MODULE.                            */ 01927000
*/********************************************************************/ 01928000
*                                                                  0700 01929000
*                                                                  0700 01930000
*   /*****************************************************************/ 01931000
*   /*                                                               */ 01932000
*   /* WORK AREAS UNIQUE TO THE INCLUDED CODE FROM IHAFTCDE          */ 01933000
*   /*                                                               */ 01934000
*   /*****************************************************************/ 01935000
*                                                                  0700 01936000
*   DCL                                                            0700 01937000
*     BITSTR BIT(8) BASED(BYTEADDR);/* BYTE TO BE ANALYZED           */ 01938000
*   DCL                                                            0701 01939000
*     BLANKS CHAR(120) INIT(' ');   /* USED TO BLANK OUT DIGIT FIELD    01940000
*                                      OR TO COMPARE WITH THE MESSAGE   01941000
*                                      ARRAYS FOR BLANK LINES        */ 01942000
*   DCL                                                            0702 01943000
*     BYTELNTH FIXED(31) CONSTANT(8);/* NUM BITS IN A BYTE           */ 01944000
*   DCL                                                            0703 01945000
*     CONVRT FIXED(31);             /* VALUE OF OFFSET               */ 01946000
*   DCL                                                            0704 01947000
*     INDEX FIXED(31);              /* LOOP COUNTER FOR ANALYZE    0704 01948000
*                                      ROUTINE                       */ 01949000
*   DCL                                                            0705 01950000
*     LNGTHEQU FIXED(31);           /* CALCULATE SUBSTRING ADR FOR 0705 01951000
*                                      PROPER MSG                    */ 01952000
*   DCL                                                            0706 01953000
*     MSG CHAR(120) BASED(ADPLCOM1);/* ERROR MSG TO BE PUT OUT BY  0706 01954000
*                                      FORMAT ROUTINE ERROR          */ 01955000
*   DCL                                                            0707 01956000
*     MSGARY CHAR(*) BASED(MSGADDR);/* MESSAGES PASSED TO BE OUTPUT  */ 01957000
*   DCL                                                            0708 01958000
*     NEGBIT BIT(1);                /* FLAG TO INDICATE NEG OFFSET   */ 01959000
*   DCL                                                            0709 01960000
*     NEGCHAR CHAR(1) CONSTANT('-');/* CONSTANT '-' TO BE PUT IN   0709 01961000
*                                      OFFSET                        */ 01962000
*   DCL                                                            0710 01963000
*     PLUSCHAR CHAR(1) CONSTANT('+');/* CONSTANT '+' TO BE PUT IN  0710 01964000
*                                      OFFSET                        */ 01965000
*   DCL                                                            0711 01966000
*     TESTBITS(8) BIT(8) INIT('80'X,'40'X,'20'X,'10'X,'08'X,'04'X,'02'X 01967000
*         ,'01'X);                  /* TO TELL WHICH BIT IS ON       */ 01968000
*   DCL                                                            0712 01969000
*     TWODGT FIXED(31) CONSTANT(16);/* FIRST OF 2 HEX DIGITS         */ 01970000
*   DCL                                                            0713 01971000
*     THREDGT FIXED(31) CONSTANT(256);/* FIRST OF 3 HEX DIGITS       */ 01972000
*   DCL                                                            0714 01973000
*     FOURDGT FIXED(31) CONSTANT(4096);/* FIRST OF 4 HEX DIGITS      */ 01974000
*CONVERT:                                                          0715 01975000
*   PROC OPTIONS(SAVE(14));                                        0715 01976000
*                                                                  0715 01977000
CONVERT  ST    @14,12(,@13)                                        0715 01978000
*/********************************************************************/ 01979000
*/* FUNCTION -                                                     0716 01980000
*      ROUTINE TO DYNAMICALLY GENERATE THE OFFSETS TO BE PUT ALONGSIDE  01981000
*      THE CONTROL BLOCK LINE.  IT FIGURES THE OFFSET FROM THE     0716 01982000
*      BEGINNING OF THE CONTROL BLOCK, CONVERTS IT TO PRINTABLE HEX,    01983000
*      PLACES IT INTO A BUFFER AREA AND PUTS THE ADDRESS OF THIS   0716 01984000
*      BUFFER AREA INTO THE PARAMETER LIST TO BE PICKED UP IN THE  0716 01985000
*      FORMAT PATTERNS BY THE FORMAT SERVICE ROUTINE.              0716 01986000
*                                                                  0716 01987000
*   INPUT -                                                        0716 01988000
*      SAVEPTR MUST HAVE THE ADDRESS OF THE BEGINNING OF THE CONTROL    01989000
*      BLOCK, REGISTER 1 POINTS TO THE PARMLIST WHICH CONTAINS THE 0716 01990000
*      CURRENT CONTROL BLOCK ADDRESS IN ADPLFMT2.                  0716 01991000
*                                                                  0716 01992000
*   CALLS -                                                        0716 01993000
*      MAKES NO OUTSIDE CALLS                                      0716 01994000
*                                                                  0716 01995000
*   CALLED BY -                                                    0716 01996000
*      BYTEMODE, EEDBITS, ENTRYRT1, IEAFTEED, IEAFTESA, IEAFTFRR,  0716 01997000
*      IEAFTIHS, IEAFTRTC, IEAFTRT2, IEAFTSCB, IEAFTSDW, RT1BITS,  0716 01998000
*      RT2BITS, RT2SUM, AND SPECIAL                                0716 01999000
*                                                                  0716 02000000
*   RETURNS TO -                                                   0716 02001000
*      CALLER.                                                     0716 02002000
*                                                                  0716 02003000
*   THIS PROCEDURE HAS BEEN INCLUDED FROM SYSLIB(IHAFTCDE) ------  0716 02004000
*                                                                    */ 02005000
*/********************************************************************/ 02006000
*                                                                  0716 02007000
*   IF SAVEPTR>ADPLFMT2 THEN        /* THIS WILL OCCUR FOR A PREFIX     02008000
*                                      WITH A NEGATIVE OFFSET        */ 02009000
         L     @14,SAVEPTR                                         0716 02010000
         L     @07,ADPLFMT2(,ABDPLPTR)                             0716 02011000
         CR    @14,@07                                             0716 02012000
         BNH   @RF00716                                            0716 02013000
*     DO;                                                          0717 02014000
*       NEGBIT=ON;                  /* INDICATE NEGATIVE OFFSET      */ 02015000
         OI    NEGBIT,B'10000000'                                  0718 02016000
*       CONVRT=SAVEPTR-ADPLFMT2;    /* NEGATIVE OFFSET VALUE         */ 02017000
         L     @04,ADPLFMT2(,ABDPLPTR)                             0719 02018000
         SLR   @14,@04                                             0719 02019000
         LR    CONVRT,@14                                          0719 02020000
*     END;                          /* END NEGATIVE OFFSET           */ 02021000
*   ELSE                            /* POSITIVE OR ZERO OFFSET       */ 02022000
*     DO;                                                          0721 02023000
         B     @RC00716                                            0721 02024000
@RF00716 DS    0H                                                  0722 02025000
*       NEGBIT=OFF;                 /* INDICATE POS VALUE            */ 02026000
         NI    NEGBIT,B'01111111'                                  0722 02027000
*       CONVRT=ADPLFMT2-SAVEPTR;    /* RELATIVE OFFSET IN CONTROL  0723 02028000
*                                      BLOCK                         */ 02029000
         L     CONVRT,ADPLFMT2(,ABDPLPTR)                          0723 02030000
         SL    CONVRT,SAVEPTR                                      0723 02031000
*     END;                          /* END POS VALUE                 */ 02032000
*   DIGIT=BLANKS(1:5);              /* BLANK OUT DIGITS              */ 02033000
@RC00716 MVC   DIGIT(5),BLANKS                                     0725 02034000
*   PACKAREA=CONVRT;                /* PLACE OFFSET INTO CHAR AREA 0726 02035000
*                                      FOR THE UNPACK                */ 02036000
         ST    CONVRT,PACKAREA                                     0726 02037000
*   GARBAGE='04'X;                  /* GARBAGE BYTE SO OFFSET WILL 0727 02038000
*                                      UNPACK OK                     */ 02039000
*                                                                  0727 02040000
         MVI   GARBAGE,X'04'                                       0727 02041000
*   /*****************************************************************/ 02042000
*   /*                                                               */ 02043000
*   /* FOR AN ODD NUMBER OF DIGITS THE OUTPUT SHOULD LOOK LIKE +C OR */ 02044000
*   /* +13C. IF THE VALUE WAS UNPACKED DIRECTLY INTO DIGITS THE      */ 02045000
*   /* OUTPUT WOULD HAVE UNWANTED LEADING ZEROS SUCH AS +0C. TO      */ 02046000
*   /* ELIMINATE THIS(ONLY FOR AN ODD NUMBER OF DIGITS) UNPACK ODD   */ 02047000
*   /* NUMBER OF DIGITS INTO CONVERTD WHERE THE LEADING ZERO WILL BE */ 02048000
*   /* OVERWRITTEN BY THE '+' OR '-' SIGN                            */ 02049000
*   /*                                                               */ 02050000
*   /*****************************************************************/ 02051000
*                                                                  0728 02052000
*   IF CONVRT<TWODGT THEN           /* ONLY 1 DIGIT TO OFFSET        */ 02053000
         CH    CONVRT,@CH00781                                     0728 02054000
         BNL   @RF00728                                            0728 02055000
*     UNPK(CONVERTD(1:3),UNPACK(4:5));/* UNPACK ONLY 1 DIGIT AND   0729 02056000
*                                      DUMMY                         */ 02057000
         UNPK  CONVERTD(3),UNPACK+3(2)                             0729 02058000
*   ELSE                                                           0730 02059000
*     IF CONVRT<THREDGT THEN        /* 2 DIGITS TO OFFSET            */ 02060000
         B     @RC00728                                            0730 02061000
@RF00728 CH    CONVRT,@CH00704                                     0730 02062000
         BNL   @RF00730                                            0730 02063000
*       UNPK(DIGIT(1:3),UNPACK(4:5));/* UNPACK LAST 2 DIGITS & DUMMY */ 02064000
         UNPK  DIGIT(3),UNPACK+3(2)                                0731 02065000
*     ELSE                                                         0732 02066000
*       IF CONVRT<FOURDGT THEN      /* 3 DIGITS TO OFFSET            */ 02067000
         B     @RC00730                                            0732 02068000
@RF00730 CH    CONVRT,@CH03858                                     0732 02069000
         BNL   @RF00732                                            0732 02070000
*         UNPK(CONVERTD(1:5),UNPACK(3:5));/* UNPACK LAST 3 DIGITS &     02071000
*                                      DUMMY                         */ 02072000
         UNPK  CONVERTD(5),UNPACK+2(3)                             0733 02073000
*       ELSE                        /* 4 DIGITS (MAX)                */ 02074000
*         UNPK(DIGIT(1:5),UNPACK(3:5));/* LAST 4 DIGITS & DUMMY BYTE */ 02075000
         B     @RC00732                                            0734 02076000
@RF00732 UNPK  DIGIT(5),UNPACK+2(3)                                0734 02077000
*   TR(DIGIT,TRANS);                /* MAKE PRINTABLE                */ 02078000
@RC00732 DS    0H                                                  0735 02079000
@RC00730 DS    0H                                                  0735 02080000
@RC00728 TR    DIGIT(5),TRANS                                      0735 02081000
*   IF NEGBIT=ON THEN               /* WAS A NEGATIVE OFFSET         */ 02082000
         TM    NEGBIT,B'10000000'                                  0736 02083000
         BNO   @RF00736                                            0736 02084000
*     PLUS=NEGCHAR;                 /* MINUS SIGN                    */ 02085000
         MVI   PLUS,C'-'                                           0737 02086000
*   ELSE                            /* POSITIVE OFFSET               */ 02087000
*     PLUS=PLUSCHAR;                /* MOVE IN PLUS SIGN             */ 02088000
         B     @RC00736                                            0738 02089000
@RF00736 MVI   PLUS,C'+'                                           0738 02090000
*   ADPLFMT1=ADDR(CONVERTD);        /* SET UP FOR FORMAT             */ 02091000
@RC00736 LA    @14,CONVERTD                                        0739 02092000
         ST    @14,ADPLFMT1(,ABDPLPTR)                             0739 02093000
*   END CONVERT;                                                   0740 02094000
@EL00008 DS    0H                                                  0740 02095000
@EF00008 DS    0H                                                  0740 02096000
@ER00008 L     @14,12(,@13)                                        0740 02097000
         BR    @14                                                 0740 02098000
*FMTRTN:                                                           0741 02099000
*   PROC OPTIONS(SAVE(14));                                        0741 02100000
*                                                                  0741 02101000
FMTRTN   ST    @14,@SA00009                                        0741 02102000
*/****************************************************************** */ 02103000
*/* FUNCTION                                                       0742 02104000
*       ROUTINE TO SET UP CALLING OF THE FORMAT SERVICE ROUTINE PASSED  02105000
*     IN THE PARMLIST AND CHECKS RETURN CODE.  IF A RETURN CODE IS BAD  02106000
*     IT TAKES THE MESSAGE WHOSE ADDRESS IS IN ADPLCOM1. AND PUTS IT    02107000
*     IN THE BUFFER AND PRINTS IT. IT SETS THE ERRSW TO INDICATE BAD    02108000
*     RETURN CODE AND RETURNS. IF THE RETURN CODE WAS GOOD, IT PRINTS   02109000
*     THE FORMATTED LINE.                                          0742 02110000
*                                                                  0742 02111000
*   CALLS-                                                         0742 02112000
*       CALLS FORMAT AND PRINT                                     0742 02113000
*                                                                  0742 02114000
*   INPUT -                                                        0742 02115000
*     LINEPTR(REGISTER 0) HAS THE ADDRESS OF THE FORMAT PATTERN TO BE   02116000
*    PASSED TO THE FORMAT SERVICE ROUTINE. ADPLFMT2 CONTAINS THE CURREN 02117000
*    ADDRESS OF THE CONTROL BLOCK TO BE FORMATTED AND ,IN MOST CASES,   02118000
*    ADPLFMT1 CONTAINS THE ADDRESS OF THE FIELD 'CONVERTD' WHICH IS     02119000
*    THE EBCDIC REPRESENTATION OF THE OFFSET TO BE PLACED ALONG SIDE    02120000
*    THE OUTPUT LINE.                                              0742 02121000
*                                                                  0742 02122000
*   CALLED BY -                                                    0742 02123000
*     IEAFTEED,IEAFTFRR,IEAFTIHS,IEAFTRTC,IEAFTRT2,IEAFTSCB,       0742 02124000
*     IEAFTSDW, RT2SUM,AND SPECIAL                                 0742 02125000
*                                                                  0742 02126000
*   RETURNS CONTROL TO -                                           0742 02127000
*     CALLER WITH RETURN CODE RECIEVED FROM FORMAT                 0742 02128000
*     SERVICE ROUTINE                                              0742 02129000
*                                                                  0742 02130000
*   THIS PROCEDURE HAS BEEN INCLUDED FROM SYSLIB(IHAFTCDE) ------  0742 02131000
*                                                                    */ 02132000
*/****************************************************************** */ 02133000
*                                                                  0742 02134000
*   IF ADPLSNPR=OFF THEN            /* IF SNAP IS THE CALLER, AN   0742 02135000
*                                      ACCESS ERROR CAN BE EXPECTED  */ 02136000
         TM    ADPLSNPR(ABDPLPTR),B'10000000'                      0742 02137000
         BNZ   @RF00742                                            0742 02138000
*     DO;                                                          0743 02139000
*       RTYADR=ADDR(FMTRTY);        /* WHERE TO RETRY                */ 02140000
         L     @14,ESTAPTR                                         0744 02141000
         LA    @07,FMTRTY                                          0744 02142000
         ST    @07,RTYADR(,@14)                                    0744 02143000
*       ERREXP=ON;                  /* INDICATE AN ERROR IS EXPECTED */ 02144000
         OI    ERREXP(@14),B'10000000'                             0745 02145000
*     END;                          /* END SNAP IS THE CALLER        */ 02146000
*   ELSE                                                           0747 02147000
*     ;                             /* SNAP WAS NOT INVOKER          */ 02148000
@RF00742 DS    0H                                                  0748 02149000
*   CALL FORMAT;                    /* FORMAT ROUTINE PASSED BY    0748 02150000
*                                      CALLER                        */ 02151000
         L     @15,ADPLFRMT(,ABDPLPTR)                             0748 02152000
         BALR  @14,@15                                             0748 02153000
*   ERREXP=OFF;                     /* ERROR IS NO LONGER EXPECTED   */ 02154000
         L     @14,ESTAPTR                                         0749 02155000
         NI    ERREXP(@14),B'01111111'                             0749 02156000
*   IF RCREG^=ZERO THEN                                            0750 02157000
         LTR   RCREG,RCREG                                         0750 02158000
         BZ    @RF00750                                            0750 02159000
*     DO;                           /* FORMAT ROUTINE ERROR          */ 02160000
*FMTRTY:                            /* RETRY POINT FROM ERROR        */ 02161000
*       ERRSW=ON;                   /* SET ERROR INDICATOR           */ 02162000
FMTRTY   OI    ERRSW,B'00100000'                                   0752 02163000
*       CALL PRINT;                 /* SPACE A LINE                  */ 02164000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0753 02165000
         BALR  @14,@15                                             0753 02166000
*       BUFFER=MSG;                 /* ERROR MSG PASSED BY CALLER  0754 02167000
*                                      WHOSE ADDR IS PLACED IN     0754 02168000
*                                      ADPLCOM1                      */ 02169000
         L     @14,ADPLBUF(,ABDPLPTR)                              0754 02170000
         L     @07,ADPLCOM1(,ABDPLPTR)                             0754 02171000
         MVC   BUFFER(120,@14),MSG(@07)                            0754 02172000
*       RCREG=4;                    /* INDICATE BAD RETURN CODE FROM    02173000
*                                      FORMATTER                     */ 02174000
         LA    RCREG,4                                             0755 02175000
*     END;                          /* END FORMAT ROUTINE ERROR      */ 02176000
*   ELSE                                                           0757 02177000
*     ;                             /* FORMATTED LINE IS IN BUFFER   */ 02178000
@RF00750 DS    0H                                                  0758 02179000
*   RCCODE=RCREG;                   /* SAVE RETURN CODE FROM FORMAT     02180000
*                                      SERVICE ROUTINE               */ 02181000
         ST    RCREG,RCCODE                                        0758 02182000
*   CALL PRINT;                     /* PRINT THE ERROR MSG OR      0759 02183000
*                                      FORMATTED LINE                */ 02184000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0759 02185000
         BALR  @14,@15                                             0759 02186000
*   RETURN CODE(RCCODE);                                           0760 02187000
         L     @15,RCCODE                                          0760 02188000
@EL00009 DS    0H                                                  0760 02189000
@EF00009 DS    0H                                                  0760 02190000
@ER00009 L     @14,@SA00009                                        0760 02191000
         BR    @14                                                 0760 02192000
*   END FMTRTN;                                                    0761 02193000
*ANALYZE:                                                          0762 02194000
*   PROC OPTIONS(SAVE(14));                                        0762 02195000
*                                                                  0762 02196000
ANALYZE  ST    @14,@SA00010                                        0762 02197000
*/****************************************************************** */ 02198000
*/* FUNCTION                                                       0763 02199000
*     ROUTINE TO ANALYZE THE BITS IN THE BYTE PASSED AND PRINT OUT 0763 02200000
*     THE MESSAGE THAT CORRESPONDS TO THE BITS THAT ARE ON. IF A BLANK  02201000
*     LINE IS PASSED IN THE MESSAGE ARRAY (INDICATING A RESERVED BIT)   02202000
*     NO OUTPUT WILL CORRESPOND TO THAT BIT.                       0763 02203000
*                                                                  0763 02204000
*   INPUT-                                                         0763 02205000
*     AN ARRAY (SUMMARY) POINTED TO BY THE PARMLIST FIELD          0763 02206000
*     ADPLCOM2 WHICH CONTAINS THE ADDRESS OF THE BYTE TO BE        0763 02207000
*     ANALYZED, THE ADDRESS OF THE ARRAY OF CORRESPONDING          0763 02208000
*     MESSAGES, THE COLUMN NUMBER THE MESSAGE IS TO BEGIN IN,      0763 02209000
*     AND THE LENGTH OF THE MESSAGE ARRAY PASSED.                  0763 02210000
*                                                                  0763 02211000
*   NOTE- COLNUM + MSGLNGTH MUST BE LESS THAN OR EQUAL TO 120 BYTES     02212000
*         WHICH IS THE OUTPUT BUFFER LENGTH.                       0763 02213000
*                                                                  0763 02214000
*                                                                  0763 02215000
*   CALLS-                                                         0763 02216000
*       CALLS PRINT                                                0763 02217000
*                                                                  0763 02218000
*   CALLED BY -                                                    0763 02219000
*       BYTEMODE,EEDBITS,IEAFTESA,IEAFTSCB,RT2BITS                 0763 02220000
*                                                                  0763 02221000
*   RETURNS CONTROL TO -                                           0763 02222000
*       CALLER WITHOUT SETTING A RETURN CODE                       0763 02223000
*                                                                  0763 02224000
*   THIS PROCEDURE HAS BEEN INCLUDED FROM SYSLIB(IHAFTCDE)-------  0763 02225000
*                                                                    */ 02226000
*/****************************************************************** */ 02227000
*                                                                  0763 02228000
*   DO INDEX=1 TO BYTELNTH;         /* LOOP TO FIND WHICH BITS ARE ON*/ 02229000
         LA    INDEX,1                                             0763 02230000
@DL00763 DS    0H                                                  0764 02231000
*     LNGTHEQU=((INDEX-1)*(MSGLNGTH)+1);/* OFFSET INTO MSGARY OF   0764 02232000
*                                      CORRESPONDING MESSAGE         */ 02233000
         L     @14,MSGLNGTH                                        0764 02234000
         LR    @03,INDEX                                           0764 02235000
         BCTR  @03,0                                               0764 02236000
         MR    @02,@14                                             0764 02237000
         AH    @03,@CH00042                                        0764 02238000
         LR    LNGTHEQU,@03                                        0764 02239000
*     IF(BITSTR&TESTBITS(INDEX))^=ZEROBYTE&/* FOUND A BIT ON         */ 02240000
*         MSGARY(LNGTHEQU:MSGLNGTH+LNGTHEQU-1)^=BLANKS(1:MSGLNGTH) THEN 02241000
         L     @04,BYTEADDR                                        0765 02242000
         SLR   @03,@03                                             0765 02243000
         IC    @03,BITSTR(,@04)                                    0765 02244000
         SLR   @04,@04                                             0765 02245000
         IC    @04,TESTBITS-1(INDEX)                               0765 02246000
         NR    @03,@04                                             0765 02247000
         SLR   @04,@04                                             0765 02248000
         IC    @04,ZEROBYTE                                        0765 02249000
         CR    @03,@04                                             0765 02250000
         BE    @RF00765                                            0765 02251000
         L     @04,MSGADDR                                         0765 02252000
         LR    @03,@14                                             0765 02253000
         BCTR  @03,0                                               0765 02254000
         LR    @02,@04                                             0765 02255000
         ALR   @02,LNGTHEQU                                        0765 02256000
         BCTR  @02,0                                               0765 02257000
         EX    @03,@SC03895                                        0765 02258000
         BE    @RF00765                                            0765 02259000
*       DO;                         /* CORRESPONDING MESSAGE WAS NOT    02260000
*                                      BLANK(RESERVED)               */ 02261000
*         BUFFER(COLNUM:(MSGLNGTH+COLNUM-1))=MSGARY(LNGTHEQU:LNGTHEQU+  02262000
*             MSGLNGTH-1);          /* PLACE MSG IN BUFFER           */ 02263000
         L     @03,COLNUM                                          0767 02264000
         L     @02,ADPLBUF(,ABDPLPTR)                              0767 02265000
         ALR   @02,@03                                             0767 02266000
         BCTR  @02,0                                               0767 02267000
         ALR   @14,@03                                             0767 02268000
         SLR   @14,@03                                             0767 02269000
         BCTR  @14,0                                               0767 02270000
         ALR   @04,LNGTHEQU                                        0767 02271000
         BCTR  @04,0                                               0767 02272000
         EX    @14,@SM03897                                        0767 02273000
*         CALL PRINT;               /* PRINT IT                      */ 02274000
         L     @15,ADPLPRNT(,ABDPLPTR)                             0768 02275000
         BALR  @14,@15                                             0768 02276000
*       END;                        /* END FOUND THE MESSAGE         */ 02277000
*     ELSE                                                         0770 02278000
*       ;                           /* EITHER BIT NOT ON OR RESERVED    02279000
*                                      BIT-NO MESSAGE                */ 02280000
@RF00765 DS    0H                                                  0771 02281000
*   END;                            /* END SEARCH LOOP               */ 02282000
         AH    INDEX,@CH00042                                      0771 02283000
         CH    INDEX,@CH00087                                      0771 02284000
         BNH   @DL00763                                            0771 02285000
*   END ANALYZE;                                                   0772 02286000
@EL00010 DS    0H                                                  0772 02287000
@EF00010 DS    0H                                                  0772 02288000
@ER00010 L     @14,@SA00010                                        0772 02289000
         BR    @14                                                 0772 02290000
*ACCESRTN:                                                         0773 02291000
*   PROC OPTIONS(SAVE(14));                                        0773 02292000
*                                                                  0773 02293000
ACCESRTN ST    @14,@SA00011                                        0773 02294000
*/********************************************************************/ 02295000
*/* FUNCTION-                                                      0774 02296000
*       ROUTINE WHICH CALLS THE ACCESS SERVICE ROUTINE AND MOVES THE    02297000
*     VALUE RETURNED IN R0 INTO DATAPTR.                           0774 02298000
*                                                                  0774 02299000
*                                                                  0774 02300000
*   INPUT -                                                        0774 02301000
*         VADR(REGISTER 0) CONTAINS THE VIRTUAL ADDRESS OF THE FIELD    02302000
*         TO BE ACCESSED.                                          0774 02303000
*                                                                  0774 02304000
*    CALLS-                                                        0774 02305000
*         ACCESS SERVICE ROUTINE PASSED IN PARMLIST                0774 02306000
*                                                                  0774 02307000
*    CALLED BY -                                                   0774 02308000
*         EEDBITS, IEAFTEED, IEAFTFRR, IEAFTRTC, IEAFTRT2,         0774 02309000
*         IEAFTSCB, RT1BITS, AND RT2BITS                           0774 02310000
*                                                                  0774 02311000
*    RETURNS TO -                                                  0774 02312000
*         CALLER WITH THE RETURN CODE SET BY THE ACCESS            0774 02313000
*         SERVICE ROUTINE.                                         0774 02314000
*                                                                  0774 02315000
*   THIS PROCEDURE HAS BEEN INCLUDED FROM SYSLIB(IHAFTCDE) ------  0774 02316000
*                                                                    */ 02317000
*/********************************************************************/ 02318000
*                                                                  0774 02319000
*   IF ADPLSNPR=OFF THEN            /* SNAP WAS INVOKER              */ 02320000
         TM    ADPLSNPR(ABDPLPTR),B'10000000'                      0774 02321000
         BNZ   @RF00774                                            0774 02322000
*     DO;                                                          0775 02323000
*       RTYADR=ADDR(RETRY);         /* RETRY ADDR FOR ESTAE IN THE 0776 02324000
*                                      CASE OF EXPECTED ERRORS       */ 02325000
         L     @14,ESTAPTR                                         0776 02326000
         LA    @07,RETRY                                           0776 02327000
         ST    @07,RTYADR(,@14)                                    0776 02328000
*       DATAPTR=VADR;               /* USED TO BASE THE STORAGE ON   */ 02329000
         LR    DATAPTR,VADR                                        0777 02330000
*       RCREG=ZERO;                 /* SUCCESS UNLESS AN ABEND OCCURS   02331000
*                                      DURING THE MOVE INTO A BUFFER */ 02332000
         SLR   RCREG,RCREG                                         0778 02333000
*       ERREXP=ON;                  /* AN ERROR IS EXPECTED          */ 02334000
         OI    ERREXP(@14),B'10000000'                             0779 02335000
*       VERIFY=DATADWRD;            /* MOVE A DOUBLE WORD INTO     0780 02336000
*                                      INTERNAL BUFFER               */ 02337000
*                                                                  0780 02338000
         MVC   VERIFY(8),DATADWRD(DATAPTR)                         0780 02339000
*       /*************************************************************/ 02340000
*       /*                                                           */ 02341000
*       /* THIS MOVE WILL CAUSE AN ABEND IF THE DUMP DOES NOT CONTAIN*/ 02342000
*       /* THE AREA REFERENCED OR IF THE AREA IS PROTECTED. IF AN    */ 02343000
*       /* ABEND OCCURS, THE ESTAE WILL GET CONTROL AND RETRY AT THE */ 02344000
*       /* POINT WHICH SETS A BAD RETURN CODE AND RETURNS TO THE     */ 02345000
*       /* CALLER. THIS THEN SIMULATES THE PRINT DUMP ACCESS ROUTINE.*/ 02346000
*       /* IF THE AREA ASKED FOR IS IN THE DUMP, A DOUBLE WORD IS    */ 02347000
*       /* MOVED INTO AN INTERNAL BUFFER TO PREVENT AN UNEXPECTED    */ 02348000
*       /* ERROR WHEN REFERENCING THE AREA AGAIN                     */ 02349000
*       /*                                                           */ 02350000
*       /*************************************************************/ 02351000
*                                                                  0781 02352000
*       ERREXP=OFF;                 /* AN ERROR IS NO LONGER EXPECTED*/ 02353000
         NI    ERREXP(@14),B'01111111'                             0781 02354000
*       DATAPTR=ADDR(VERIFY);       /* REBASE DATA OFF INTERNAL    0782 02355000
*                                      BUFFER                        */ 02356000
         LA    DATAPTR,VERIFY                                      0782 02357000
*     END;                          /* END SNAP WAS THE INVOKER      */ 02358000
*   ELSE                            /* CALLER HAS OWN ACCESS ROUTINE    02359000
*                                      LIKE PRINT DUMP               */ 02360000
*     DO;                                                          0784 02361000
         B     @RC00774                                            0784 02362000
@RF00774 DS    0H                                                  0785 02363000
*       CALL ACCESS;                /* ACCESS SERVICE ROUTINE PASSED    02364000
*                                      BY CALLER                     */ 02365000
         L     @15,ADPLMEMA(,ABDPLPTR)                             0785 02366000
         BALR  @14,@15                                             0785 02367000
*       IF RCREG=ZERO THEN                                         0786 02368000
         LTR   RCREG,RCREG                                         0786 02369000
         BNZ   @RF00786                                            0786 02370000
*         DATAPTR=VADR;             /* SAVE PTR RETURNED BY ACCESS 0787 02371000
*                                      SERVICE ROUTINE               */ 02372000
         LR    DATAPTR,VADR                                        0787 02373000
*       ELSE                        /* BAD RETURN CODE               */ 02374000
*RETRY:                             /* RETRY ADDR FOR THE ESTAE      */ 02375000
*         RCREG=4;                  /* SET A BAD RETURN CODE         */ 02376000
         B     @RC00786                                            0788 02377000
@RF00786 DS    0H                                                  0788 02378000
RETRY    LA    RCREG,4                                             0788 02379000
*     END;                          /* END CALLER WAS NOT SNAP       */ 02380000
@RC00786 DS    0H                                                  0790 02381000
*   RCCODE=RCREG;                   /* SAVE RETURN CODE FROM ACCESS     02382000
*                                      SERVICE RTN                   */ 02383000
@RC00774 ST    RCREG,RCCODE                                        0790 02384000
*   RETURN CODE(RCCODE);                                           0791 02385000
         L     @07,RCCODE                                          0791 02386000
         LR    @15,@07                                             0791 02387000
@EL00011 DS    0H                                                  0791 02388000
@EF00011 DS    0H                                                  0791 02389000
@ER00011 L     @14,@SA00011                                        0791 02390000
         BR    @14                                                 0791 02391000
*   END ACCESRTN;                                                  0792 02392000
*   DCL                                                            0793 02393000
*     RT2PATCH CHAR(200) INIT(                                     0793 02394000
*         'PATCH AREA FOR IEAFTRT2 - IT IS 200 BYTES LONG');       0793 02395000
*   END IEAFTRT2                                                   0794 02396000
*                                                                  0794 02397000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 02398000
*/*%INCLUDE SYSLIB  (IHAABDPL)                                       */ 02399000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 02400000
*/*%INCLUDE SYSLIB  (RTM2ESA )                                       */ 02401000
*/*%INCLUDE SYSLIB  (IHARB   )                                       */ 02402000
*/*%INCLUDE SYSLIB  (IKJRB   )                                       */ 02403000
*/*%INCLUDE SYSLIB  (IHARTM2A)                                       */ 02404000
*/*%INCLUDE SYSLIB  (IHASNP  )                                       */ 02405000
*/*%INCLUDE SYSLIB  (IHARMPL )                                       */ 02406000
*/*%INCLUDE SYSLIB  (IHART1W )                                       */ 02407000
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */ 02408000
*/*%INCLUDE SYSLIB  (IHASUBIT)                                       */ 02409000
*/*%INCLUDE SYSLIB  (IHAFTCD1)                                       */ 02410000
*/*%INCLUDE SYSLIB  (IHAFTCDE)                                       */ 02411000
*                                                                  0794 02412000
*       ;                                                          0794 02413000
@DATA    DS    0H                                                       02414000
@CH00042 DC    H'1'                                                     02415000
@CH00312 DC    H'3'                                                     02416000
@CH00778 DC    H'7'                                                     02417000
@CH01564 DC    H'9'                                                     02418000
@CH00781 DC    H'16'                                                    02419000
@CH01707 DC    H'17'                                                    02420000
@CH03793 DC    H'50'                                                    02421000
@CH03443 DC    H'68'                                                    02422000
@CH01675 DC    H'100'                                                   02423000
@CH01679 DC    H'102'                                                   02424000
@CH00704 DC    H'256'                                                   02425000
@CH03858 DC    H'4096'                                                  02426000
@SC03895 CLC   MSGARY(0,@02),BLANKS                                     02427000
@SM03897 MVC   BUFFER(0,@02),MSGARY(@04)                                02428000
@DATD    DSECT                                                          02429000
         DS    0F                                                       02430000
@SA00001 DS    18F                                                      02431000
@SA00011 DS    1F                                                       02432000
@SA00005 DS    1F                                                       02433000
@SA00009 DS    1F                                                       02434000
@SA00002 DS    1F                                                       02435000
@SA00003 DS    1F                                                       02436000
@SA00004 DS    1F                                                       02437000
@SA00010 DS    1F                                                       02438000
@SA00007 DS    1F                                                       02439000
@SA00006 DS    1F                                                       02440000
IEAFTRT2 CSECT                                                          02441000
         DS    0F                                                       02442000
@CF00087 DC    F'8'                                                     02443000
@CH00087 EQU   @CF00087+2                                               02444000
@CF02753 DC    F'21'                                                    02445000
@CH02753 EQU   @CF02753+2                                               02446000
@CF03228 DC    F'22'                                                    02447000
@CF02675 DC    F'25'                                                    02448000
@CF01628 DC    F'29'                                                    02449000
@CF00038 DC    F'31'                                                    02450000
@CF01641 DC    F'37'                                                    02451000
@CF03617 DC    F'40'                                                    02452000
@CF03634 DC    F'46'                                                    02453000
@CF03574 DC    F'47'                                                    02454000
@CF03558 DC    F'57'                                                    02455000
@CF03887 DC    F'-4'                                                    02456000
@DATD    DSECT                                                          02457000
         DS    0D                                                       02458000
FRRSRTMW DS    A                                                        02459000
ESTAPTR  DS    A                                                        02460000
RCCODE   DS    F                                                        02461000
ESAPTR   DS    A                                                        02462000
SAVEPTR  DS    A                                                        02463000
BITS     DS    BL1                                                      02464000
         ORG   BITS                                                     02465000
SU17SAVE DS    BL1                                                      02466000
SU33SAVE EQU   BITS+0                                                   02467000
ERRSW    EQU   BITS+0                                                   02468000
HDRBIT   EQU   BITS+0                                                   02469000
@NM01064 EQU   BITS+0                                                   02470000
         ORG   BITS+1                                                   02471000
CONVERTD DS    CL6                                                      02472000
         ORG   CONVERTD                                                 02473000
PLUS     DS    CL1                                                      02474000
DIGIT    DS    CL5                                                      02475000
         ORG   CONVERTD+6                                               02476000
DUMMYHDR DS    CL70                                                     02477000
         ORG   DUMMYHDR                                                 02478000
HDR      DS    CL61                                                     02479000
SVRBADR  DS    CL9                                                      02480000
         ORG   DUMMYHDR+70                                              02481000
         DS    CL3                                                      02482000
SUMMARY  DS    CL16                                                     02483000
         ORG   SUMMARY                                                  02484000
BYTEADDR DS    AL4                                                      02485000
MSGADDR  DS    AL4                                                      02486000
COLNUM   DS    FL4                                                      02487000
MSGLNGTH DS    FL4                                                      02488000
         ORG   SUMMARY+16                                               02489000
UNPACK   DS    CL5                                                      02490000
         ORG   UNPACK                                                   02491000
PACKAREA DS    CL4                                                      02492000
GARBAGE  DS    CL1                                                      02493000
         ORG   UNPACK+5                                                 02494000
         DS    CL7                                                      02495000
VERIFY   DS    CL8                                                      02496000
NEGBIT   DS    BL1                                                      02497000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                02498000
@ENDDATD EQU   *                                                        02499000
IEAFTRT2 CSECT                                                          02500000
         DS    0F                                                       02501000
@SIZDATD DC    AL1(0)                                                   02502000
         DC    AL3(@ENDDATD-@DATD)                                      02503000
         DS    0D                                                       02504000
ZEROBYTE DC    XL1'00'                                                  02505000
         DS    CL3                                                      02506000
RTM2FMT1 DS    CL12                                                     02507000
         ORG   RTM2FMT1                                                 02508000
@NM00129 DS    CL4                                                      02509000
         ORG   @NM00129                                                 02510000
@NM00130 DC    X'01'                                                    02511000
@NM00131 DC    X'40'                                                    02512000
@NM00132 DC    AL1(0)                                                   02513000
@NM00133 DC    AL1(0)                                                   02514000
         ORG   RTM2FMT1+4                                               02515000
@NM00134 DS    CL4                                                      02516000
         ORG   @NM00134                                                 02517000
@NM00135 DC    X'04'                                                    02518000
@NM00136 DC    X'03'                                                    02519000
@NM00137 DC    AL1(0)                                                   02520000
@NM00138 DC    AL1(8)                                                   02521000
         ORG   RTM2FMT1+8                                               02522000
@NM00139 DS    CL4                                                      02523000
         ORG   @NM00139                                                 02524000
@NM00140 DC    F'0'                                                     02525000
         ORG   RTM2FMT1+12                                              02526000
RTM2FMT2 DS    CL16                                                     02527000
         ORG   RTM2FMT2                                                 02528000
@NM00141 DS    CL4                                                      02529000
         ORG   @NM00141                                                 02530000
@NM00142 DC    X'01'                                                    02531000
@NM00143 DC    X'40'                                                    02532000
@NM00144 DC    AL1(0)                                                   02533000
@NM00145 DC    AL1(0)                                                   02534000
         ORG   RTM2FMT2+4                                               02535000
@NM00146 DS    CL4                                                      02536000
         ORG   @NM00146                                                 02537000
@NM00147 DC    X'04'                                                    02538000
@NM00148 DC    X'03'                                                    02539000
@NM00149 DC    AL1(0)                                                   02540000
@NM00150 DC    AL1(8)                                                   02541000
         ORG   RTM2FMT2+8                                               02542000
@NM00151 DS    CL4                                                      02543000
         ORG   @NM00151                                                 02544000
@NM00152 DC    X'04'                                                    02545000
@NM00153 DC    X'03'                                                    02546000
@NM00154 DC    AL1(0)                                                   02547000
@NM00155 DC    AL1(17)                                                  02548000
         ORG   RTM2FMT2+12                                              02549000
@NM00156 DS    CL4                                                      02550000
         ORG   @NM00156                                                 02551000
@NM00157 DC    F'0'                                                     02552000
         ORG   RTM2FMT2+16                                              02553000
RTM2FMT3 DS    CL20                                                     02554000
         ORG   RTM2FMT3                                                 02555000
@NM00158 DS    CL4                                                      02556000
         ORG   @NM00158                                                 02557000
@NM00159 DC    X'01'                                                    02558000
@NM00160 DC    X'40'                                                    02559000
@NM00161 DC    AL1(0)                                                   02560000
@NM00162 DC    AL1(0)                                                   02561000
         ORG   RTM2FMT3+4                                               02562000
@NM00163 DS    CL4                                                      02563000
         ORG   @NM00163                                                 02564000
@NM00164 DC    X'04'                                                    02565000
@NM00165 DC    X'03'                                                    02566000
@NM00166 DC    AL1(0)                                                   02567000
@NM00167 DC    AL1(8)                                                   02568000
         ORG   RTM2FMT3+8                                               02569000
@NM00168 DS    CL4                                                      02570000
         ORG   @NM00168                                                 02571000
@NM00169 DC    X'04'                                                    02572000
@NM00170 DC    X'03'                                                    02573000
@NM00171 DC    AL1(0)                                                   02574000
@NM00172 DC    AL1(17)                                                  02575000
         ORG   RTM2FMT3+12                                              02576000
@NM00173 DS    CL4                                                      02577000
         ORG   @NM00173                                                 02578000
@NM00174 DC    X'04'                                                    02579000
@NM00175 DC    X'03'                                                    02580000
@NM00176 DC    AL1(0)                                                   02581000
@NM00177 DC    AL1(26)                                                  02582000
         ORG   RTM2FMT3+16                                              02583000
@NM00178 DS    CL4                                                      02584000
         ORG   @NM00178                                                 02585000
@NM00179 DC    F'0'                                                     02586000
         ORG   RTM2FMT3+20                                              02587000
RTM2FMT4 DS    CL24                                                     02588000
         ORG   RTM2FMT4                                                 02589000
@NM00180 DS    CL4                                                      02590000
         ORG   @NM00180                                                 02591000
@NM00181 DC    X'01'                                                    02592000
@NM00182 DC    X'40'                                                    02593000
@NM00183 DC    AL1(0)                                                   02594000
@NM00184 DC    AL1(0)                                                   02595000
         ORG   RTM2FMT4+4                                               02596000
@NM00185 DS    CL4                                                      02597000
         ORG   @NM00185                                                 02598000
@NM00186 DC    X'04'                                                    02599000
@NM00187 DC    X'03'                                                    02600000
@NM00188 DC    AL1(0)                                                   02601000
@NM00189 DC    AL1(8)                                                   02602000
         ORG   RTM2FMT4+8                                               02603000
@NM00190 DS    CL4                                                      02604000
         ORG   @NM00190                                                 02605000
@NM00191 DC    X'04'                                                    02606000
@NM00192 DC    X'03'                                                    02607000
@NM00193 DC    AL1(0)                                                   02608000
@NM00194 DC    AL1(17)                                                  02609000
         ORG   RTM2FMT4+12                                              02610000
@NM00195 DS    CL4                                                      02611000
         ORG   @NM00195                                                 02612000
@NM00196 DC    X'04'                                                    02613000
@NM00197 DC    X'03'                                                    02614000
@NM00198 DC    AL1(0)                                                   02615000
@NM00199 DC    AL1(26)                                                  02616000
         ORG   RTM2FMT4+16                                              02617000
@NM00200 DS    CL4                                                      02618000
         ORG   @NM00200                                                 02619000
@NM00201 DC    X'04'                                                    02620000
@NM00202 DC    X'03'                                                    02621000
@NM00203 DC    AL1(0)                                                   02622000
@NM00204 DC    AL1(35)                                                  02623000
         ORG   RTM2FMT4+20                                              02624000
@NM00205 DS    CL4                                                      02625000
         ORG   @NM00205                                                 02626000
@NM00206 DC    F'0'                                                     02627000
         ORG   RTM2FMT4+24                                              02628000
RTM2FMT5 DS    CL28                                                     02629000
         ORG   RTM2FMT5                                                 02630000
@NM00207 DS    CL4                                                      02631000
         ORG   @NM00207                                                 02632000
@NM00208 DC    X'01'                                                    02633000
@NM00209 DC    X'40'                                                    02634000
@NM00210 DC    AL1(0)                                                   02635000
@NM00211 DC    AL1(0)                                                   02636000
         ORG   RTM2FMT5+4                                               02637000
@NM00212 DS    CL4                                                      02638000
         ORG   @NM00212                                                 02639000
@NM00213 DC    X'04'                                                    02640000
@NM00214 DC    X'03'                                                    02641000
@NM00215 DC    AL1(0)                                                   02642000
@NM00216 DC    AL1(8)                                                   02643000
         ORG   RTM2FMT5+8                                               02644000
@NM00217 DS    CL4                                                      02645000
         ORG   @NM00217                                                 02646000
@NM00218 DC    X'04'                                                    02647000
@NM00219 DC    X'03'                                                    02648000
@NM00220 DC    AL1(0)                                                   02649000
@NM00221 DC    AL1(17)                                                  02650000
         ORG   RTM2FMT5+12                                              02651000
@NM00222 DS    CL4                                                      02652000
         ORG   @NM00222                                                 02653000
@NM00223 DC    X'04'                                                    02654000
@NM00224 DC    X'03'                                                    02655000
@NM00225 DC    AL1(0)                                                   02656000
@NM00226 DC    AL1(26)                                                  02657000
         ORG   RTM2FMT5+16                                              02658000
@NM00227 DS    CL4                                                      02659000
         ORG   @NM00227                                                 02660000
@NM00228 DC    X'04'                                                    02661000
@NM00229 DC    X'03'                                                    02662000
@NM00230 DC    AL1(0)                                                   02663000
@NM00231 DC    AL1(35)                                                  02664000
         ORG   RTM2FMT5+20                                              02665000
@NM00232 DS    CL4                                                      02666000
         ORG   @NM00232                                                 02667000
@NM00233 DC    X'04'                                                    02668000
@NM00234 DC    X'03'                                                    02669000
@NM00235 DC    AL1(0)                                                   02670000
@NM00236 DC    AL1(44)                                                  02671000
         ORG   RTM2FMT5+24                                              02672000
@NM00237 DS    CL4                                                      02673000
         ORG   @NM00237                                                 02674000
@NM00238 DC    F'0'                                                     02675000
         ORG   RTM2FMT5+28                                              02676000
RTM2FMT6 DS    CL32                                                     02677000
         ORG   RTM2FMT6                                                 02678000
@NM00239 DS    CL4                                                      02679000
         ORG   @NM00239                                                 02680000
@NM00240 DC    X'01'                                                    02681000
@NM00241 DC    X'40'                                                    02682000
@NM00242 DC    AL1(0)                                                   02683000
@NM00243 DC    AL1(0)                                                   02684000
         ORG   RTM2FMT6+4                                               02685000
@NM00244 DS    CL4                                                      02686000
         ORG   @NM00244                                                 02687000
@NM00245 DC    X'04'                                                    02688000
@NM00246 DC    X'03'                                                    02689000
@NM00247 DC    AL1(0)                                                   02690000
@NM00248 DC    AL1(8)                                                   02691000
         ORG   RTM2FMT6+8                                               02692000
@NM00249 DS    CL4                                                      02693000
         ORG   @NM00249                                                 02694000
@NM00250 DC    X'04'                                                    02695000
@NM00251 DC    X'03'                                                    02696000
@NM00252 DC    AL1(0)                                                   02697000
@NM00253 DC    AL1(17)                                                  02698000
         ORG   RTM2FMT6+12                                              02699000
@NM00254 DS    CL4                                                      02700000
         ORG   @NM00254                                                 02701000
@NM00255 DC    X'04'                                                    02702000
@NM00256 DC    X'03'                                                    02703000
@NM00257 DC    AL1(0)                                                   02704000
@NM00258 DC    AL1(26)                                                  02705000
         ORG   RTM2FMT6+16                                              02706000
@NM00259 DS    CL4                                                      02707000
         ORG   @NM00259                                                 02708000
@NM00260 DC    X'04'                                                    02709000
@NM00261 DC    X'03'                                                    02710000
@NM00262 DC    AL1(0)                                                   02711000
@NM00263 DC    AL1(35)                                                  02712000
         ORG   RTM2FMT6+20                                              02713000
@NM00264 DS    CL4                                                      02714000
         ORG   @NM00264                                                 02715000
@NM00265 DC    X'04'                                                    02716000
@NM00266 DC    X'03'                                                    02717000
@NM00267 DC    AL1(0)                                                   02718000
@NM00268 DC    AL1(44)                                                  02719000
         ORG   RTM2FMT6+24                                              02720000
@NM00269 DS    CL4                                                      02721000
         ORG   @NM00269                                                 02722000
@NM00270 DC    X'04'                                                    02723000
@NM00271 DC    X'03'                                                    02724000
@NM00272 DC    AL1(0)                                                   02725000
@NM00273 DC    AL1(53)                                                  02726000
         ORG   RTM2FMT6+28                                              02727000
@NM00274 DS    CL4                                                      02728000
         ORG   @NM00274                                                 02729000
@NM00275 DC    F'0'                                                     02730000
         ORG   RTM2FMT6+32                                              02731000
RTM2FMT7 DS    CL36                                                     02732000
         ORG   RTM2FMT7                                                 02733000
@NM00276 DS    CL4                                                      02734000
         ORG   @NM00276                                                 02735000
@NM00277 DC    X'01'                                                    02736000
@NM00278 DC    X'40'                                                    02737000
@NM00279 DC    AL1(0)                                                   02738000
@NM00280 DC    AL1(0)                                                   02739000
         ORG   RTM2FMT7+4                                               02740000
@NM00281 DS    CL4                                                      02741000
         ORG   @NM00281                                                 02742000
@NM00282 DC    X'04'                                                    02743000
@NM00283 DC    X'03'                                                    02744000
@NM00284 DC    AL1(0)                                                   02745000
@NM00285 DC    AL1(8)                                                   02746000
         ORG   RTM2FMT7+8                                               02747000
@NM00286 DS    CL4                                                      02748000
         ORG   @NM00286                                                 02749000
@NM00287 DC    X'04'                                                    02750000
@NM00288 DC    X'03'                                                    02751000
@NM00289 DC    AL1(0)                                                   02752000
@NM00290 DC    AL1(17)                                                  02753000
         ORG   RTM2FMT7+12                                              02754000
@NM00291 DS    CL4                                                      02755000
         ORG   @NM00291                                                 02756000
@NM00292 DC    X'04'                                                    02757000
@NM00293 DC    X'03'                                                    02758000
@NM00294 DC    AL1(0)                                                   02759000
@NM00295 DC    AL1(26)                                                  02760000
         ORG   RTM2FMT7+16                                              02761000
@NM00296 DS    CL4                                                      02762000
         ORG   @NM00296                                                 02763000
@NM00297 DC    X'04'                                                    02764000
@NM00298 DC    X'03'                                                    02765000
@NM00299 DC    AL1(0)                                                   02766000
@NM00300 DC    AL1(35)                                                  02767000
         ORG   RTM2FMT7+20                                              02768000
@NM00301 DS    CL4                                                      02769000
         ORG   @NM00301                                                 02770000
@NM00302 DC    X'04'                                                    02771000
@NM00303 DC    X'03'                                                    02772000
@NM00304 DC    AL1(0)                                                   02773000
@NM00305 DC    AL1(44)                                                  02774000
         ORG   RTM2FMT7+24                                              02775000
@NM00306 DS    CL4                                                      02776000
         ORG   @NM00306                                                 02777000
@NM00307 DC    X'04'                                                    02778000
@NM00308 DC    X'03'                                                    02779000
@NM00309 DC    AL1(0)                                                   02780000
@NM00310 DC    AL1(53)                                                  02781000
         ORG   RTM2FMT7+28                                              02782000
@NM00311 DS    CL4                                                      02783000
         ORG   @NM00311                                                 02784000
@NM00312 DC    X'04'                                                    02785000
@NM00313 DC    X'03'                                                    02786000
@NM00314 DC    AL1(0)                                                   02787000
@NM00315 DC    AL1(62)                                                  02788000
         ORG   RTM2FMT7+32                                              02789000
@NM00316 DS    CL4                                                      02790000
         ORG   @NM00316                                                 02791000
@NM00317 DC    F'0'                                                     02792000
         ORG   RTM2FMT7+36                                              02793000
RTM2FMT8 DS    CL40                                                     02794000
         ORG   RTM2FMT8                                                 02795000
@NM00318 DS    CL4                                                      02796000
         ORG   @NM00318                                                 02797000
@NM00319 DC    X'01'                                                    02798000
@NM00320 DC    X'40'                                                    02799000
@NM00321 DC    AL1(0)                                                   02800000
@NM00322 DC    AL1(0)                                                   02801000
         ORG   RTM2FMT8+4                                               02802000
@NM00323 DS    CL4                                                      02803000
         ORG   @NM00323                                                 02804000
@NM00324 DC    X'04'                                                    02805000
@NM00325 DC    X'03'                                                    02806000
@NM00326 DC    AL1(0)                                                   02807000
@NM00327 DC    AL1(8)                                                   02808000
         ORG   RTM2FMT8+8                                               02809000
@NM00328 DS    CL4                                                      02810000
         ORG   @NM00328                                                 02811000
@NM00329 DC    X'04'                                                    02812000
@NM00330 DC    X'03'                                                    02813000
@NM00331 DC    AL1(0)                                                   02814000
@NM00332 DC    AL1(17)                                                  02815000
         ORG   RTM2FMT8+12                                              02816000
@NM00333 DS    CL4                                                      02817000
         ORG   @NM00333                                                 02818000
@NM00334 DC    X'04'                                                    02819000
@NM00335 DC    X'03'                                                    02820000
@NM00336 DC    AL1(0)                                                   02821000
@NM00337 DC    AL1(26)                                                  02822000
         ORG   RTM2FMT8+16                                              02823000
@NM00338 DS    CL4                                                      02824000
         ORG   @NM00338                                                 02825000
@NM00339 DC    X'04'                                                    02826000
@NM00340 DC    X'03'                                                    02827000
@NM00341 DC    AL1(0)                                                   02828000
@NM00342 DC    AL1(35)                                                  02829000
         ORG   RTM2FMT8+20                                              02830000
@NM00343 DS    CL4                                                      02831000
         ORG   @NM00343                                                 02832000
@NM00344 DC    X'04'                                                    02833000
@NM00345 DC    X'03'                                                    02834000
@NM00346 DC    AL1(0)                                                   02835000
@NM00347 DC    AL1(44)                                                  02836000
         ORG   RTM2FMT8+24                                              02837000
@NM00348 DS    CL4                                                      02838000
         ORG   @NM00348                                                 02839000
@NM00349 DC    X'04'                                                    02840000
@NM00350 DC    X'03'                                                    02841000
@NM00351 DC    AL1(0)                                                   02842000
@NM00352 DC    AL1(53)                                                  02843000
         ORG   RTM2FMT8+28                                              02844000
@NM00353 DS    CL4                                                      02845000
         ORG   @NM00353                                                 02846000
@NM00354 DC    X'04'                                                    02847000
@NM00355 DC    X'03'                                                    02848000
@NM00356 DC    AL1(0)                                                   02849000
@NM00357 DC    AL1(62)                                                  02850000
         ORG   RTM2FMT8+32                                              02851000
@NM00358 DS    CL4                                                      02852000
         ORG   @NM00358                                                 02853000
@NM00359 DC    X'04'                                                    02854000
@NM00360 DC    X'03'                                                    02855000
@NM00361 DC    AL1(0)                                                   02856000
@NM00362 DC    AL1(71)                                                  02857000
         ORG   RTM2FMT8+36                                              02858000
@NM00363 DS    CL4                                                      02859000
         ORG   @NM00363                                                 02860000
@NM00364 DC    F'0'                                                     02861000
         ORG   RTM2FMT8+40                                              02862000
RTM2FT9  DC    CL31'-EED TYPE1 REGS AND PSW'                            02863000
RTM2FT10 DC    CL31'-----'                                              02864000
RTM2FT11 DC    CL31'-EED TYPE3 MACHINE CHECK'                           02865000
RTM2FT12 DC    CL31'-SNPPARMS'                                          02866000
RTM2FT13 DC    CL31'-DUMP STORAGE RANGES'                               02867000
RTM2FT14 DC    CL31'-SUBFUNCTION REGISTER SAVE AREA'                    02868000
RTM2FT15 DC    CL31'-RECURSION REGISTERS'                               02869000
RTM2FT16 DC    CL31'-SAVE AREA FOR VTRT2'                               02870000
RTM2FT17 DC    CL31'-SAVE AREA FOR TAS2/TAS3'                           02871000
RTM2FT18 DC    CL31'-RMPL'                                              02872000
RTM2FT19 DC    CL31'-WORK AREA FOR RESOURCE MANAGER'                    02873000
RTM2FT20 DC    CL31'-SAVE AREA FOR RESOURCE MANAGER'                    02874000
SUML1    DS    CL14                                                     02875000
         ORG   SUML1                                                    02876000
@NM00365 DC    CL10'COMPLETION'                                         02877000
@NM00366 DC    CL4'CODE'                                                02878000
         ORG   SUML1+14                                                 02879000
         DS    CL2                                                      02880000
SUMFMT1  DS    CL20                                                     02881000
         ORG   SUMFMT1                                                  02882000
@NM00367 DS    CL4                                                      02883000
         ORG   @NM00367                                                 02884000
@NM00368 DC    X'01'                                                    02885000
@NM00369 DC    X'40'                                                    02886000
@NM00370 DC    AL1(0)                                                   02887000
@NM00371 DC    AL1(0)                                                   02888000
         ORG   SUMFMT1+4                                                02889000
@NM00372 DS    CL8                                                      02890000
         ORG   @NM00372                                                 02891000
@NM00373 DC    X'07'                                                    02892000
@NM00374 DC    X'93'                                                    02893000
@NM00375 DC    AL1(8)                                                   02894000
@NM00376 DC    AL1(33)                                                  02895000
@NM00377 DC    AL4(SUML1)                                               02896000
         ORG   SUMFMT1+12                                               02897000
@NM00378 DS    CL4                                                      02898000
         ORG   @NM00378                                                 02899000
@NM00379 DC    X'01'                                                    02900000
@NM00380 DC    X'30'                                                    02901000
@NM00381 DC    AL1(19)                                                  02902000
@NM00382 DC    AL1(0)                                                   02903000
         ORG   SUMFMT1+16                                               02904000
@NM00383 DS    CL4                                                      02905000
         ORG   @NM00383                                                 02906000
@NM00384 DC    F'0'                                                     02907000
         ORG   SUMFMT1+20                                               02908000
SUML2    DS    CL19                                                     02909000
         ORG   SUML2                                                    02910000
@NM00385 DC    CL8'ABENDING'                                            02911000
@NM00386 DC    CL7'PROGRAM'                                             02912000
@NM00387 DC    CL4'NAME'                                                02913000
         ORG   SUML2+19                                                 02914000
         DS    CL1                                                      02915000
SUMFMT2  DS    CL24                                                     02916000
         ORG   SUMFMT2                                                  02917000
@NM00388 DS    CL4                                                      02918000
         ORG   @NM00388                                                 02919000
@NM00389 DC    X'01'                                                    02920000
@NM00390 DC    X'40'                                                    02921000
@NM00391 DC    AL1(0)                                                   02922000
@NM00392 DC    AL1(0)                                                   02923000
         ORG   SUMFMT2+4                                                02924000
@NM00393 DS    CL8                                                      02925000
         ORG   @NM00393                                                 02926000
@NM00394 DC    X'27'                                                    02927000
@NM00395 DC    X'77'                                                    02928000
@NM00396 DC    AL1(8)                                                   02929000
@NM00397 DC    AL1(33)                                                  02930000
@NM00398 DC    AL4(SUML2)                                               02931000
         ORG   SUMFMT2+12                                               02932000
@NM00399 DS    CL4                                                      02933000
         ORG   @NM00399                                                 02934000
@NM00400 DC    X'01'                                                    02935000
@NM00401 DC    X'60'                                                    02936000
@NM00402 DC    AL1(17)                                                  02937000
@NM00403 DC    AL1(0)                                                   02938000
         ORG   SUMFMT2+16                                               02939000
@NM00404 DS    CL4                                                      02940000
         ORG   @NM00404                                                 02941000
@NM00405 DC    X'01'                                                    02942000
@NM00406 DC    X'30'                                                    02943000
@NM00407 DC    AL1(25)                                                  02944000
@NM00408 DC    AL1(0)                                                   02945000
         ORG   SUMFMT2+20                                               02946000
@NM00409 DS    CL4                                                      02947000
         ORG   @NM00409                                                 02948000
@NM00410 DC    F'0'                                                     02949000
         ORG   SUMFMT2+24                                               02950000
SUML3    DS    CL19                                                     02951000
         ORG   SUML3                                                    02952000
@NM00411 DC    CL8'ABENDING'                                            02953000
@NM00412 DC    CL7'PROGRAM'                                             02954000
@NM00413 DC    CL4'ADDR'                                                02955000
         ORG   SUML3+19                                                 02956000
         DS    CL1                                                      02957000
SUMFMT3  DS    CL24                                                     02958000
         ORG   SUMFMT3                                                  02959000
@NM00414 DS    CL4                                                      02960000
         ORG   @NM00414                                                 02961000
@NM00415 DC    X'01'                                                    02962000
@NM00416 DC    X'40'                                                    02963000
@NM00417 DC    AL1(0)                                                   02964000
@NM00418 DC    AL1(0)                                                   02965000
         ORG   SUMFMT3+4                                                02966000
@NM00419 DS    CL8                                                      02967000
         ORG   @NM00419                                                 02968000
@NM00420 DC    X'07'                                                    02969000
@NM00421 DC    X'73'                                                    02970000
@NM00422 DC    AL1(8)                                                   02971000
@NM00423 DC    AL1(33)                                                  02972000
@NM00424 DC    AL4(SUML3)                                               02973000
         ORG   SUMFMT3+12                                               02974000
@NM00425 DS    CL4                                                      02975000
         ORG   @NM00425                                                 02976000
@NM00426 DC    X'01'                                                    02977000
@NM00427 DC    X'60'                                                    02978000
@NM00428 DC    AL1(17)                                                  02979000
@NM00429 DC    AL1(0)                                                   02980000
         ORG   SUMFMT3+16                                               02981000
@NM00430 DS    CL4                                                      02982000
         ORG   @NM00430                                                 02983000
@NM00431 DC    X'01'                                                    02984000
@NM00432 DC    X'30'                                                    02985000
@NM00433 DC    AL1(25)                                                  02986000
@NM00434 DC    AL1(0)                                                   02987000
         ORG   SUMFMT3+20                                               02988000
@NM00435 DS    CL4                                                      02989000
         ORG   @NM00435                                                 02990000
@NM00436 DC    F'0'                                                     02991000
         ORG   SUMFMT3+24                                               02992000
SUML4    DS    CL22                                                     02993000
         ORG   SUML4                                                    02994000
@NM00437 DC    CL4'REGS'                                                02995000
@NM00438 DC    CL2'AT'                                                  02996000
@NM00439 DC    CL4'TIME'                                                02997000
@NM00440 DC    CL2'OF'                                                  02998000
@NM00441 DC    CL5'ERROR'                                               02999000
@NM00442 DC    CL5'(0-7)'                                               03000000
         ORG   SUML4+22                                                 03001000
         DS    CL2                                                      03002000
SUMFMT4  DS    CL44                                                     03003000
         ORG   SUMFMT4                                                  03004000
@NM00443 DS    CL4                                                      03005000
         ORG   @NM00443                                                 03006000
@NM00444 DC    X'01'                                                    03007000
@NM00445 DC    X'40'                                                    03008000
@NM00446 DC    AL1(0)                                                   03009000
@NM00447 DC    AL1(0)                                                   03010000
         ORG   SUMFMT4+4                                                03011000
@NM00448 DS    CL8                                                      03012000
         ORG   @NM00448                                                 03013000
@NM00449 DC    X'07'                                                    03014000
@NM00450 DC    X'33'                                                    03015000
@NM00451 DC    AL1(8)                                                   03016000
@NM00452 DC    AL1(33)                                                  03017000
@NM00453 DC    AL4(SUML4)                                               03018000
         ORG   SUMFMT4+12                                               03019000
@NM00454 DS    CL4                                                      03020000
         ORG   @NM00454                                                 03021000
@NM00455 DC    X'05'                                                    03022000
@NM00456 DC    X'13'                                                    03023000
@NM00457 DC    AL1(13)                                                  03024000
@NM00458 DC    AL1(42)                                                  03025000
         ORG   SUMFMT4+16                                               03026000
@NM00459 DS    CL4                                                      03027000
         ORG   @NM00459                                                 03028000
@NM00460 DC    X'05'                                                    03029000
@NM00461 DC    X'33'                                                    03030000
@NM00462 DC    AL1(16)                                                  03031000
@NM00463 DC    AL1(51)                                                  03032000
         ORG   SUMFMT4+20                                               03033000
@NM00464 DS    CL4                                                      03034000
         ORG   @NM00464                                                 03035000
@NM00465 DC    X'05'                                                    03036000
@NM00466 DC    X'13'                                                    03037000
@NM00467 DC    AL1(21)                                                  03038000
@NM00468 DC    AL1(60)                                                  03039000
         ORG   SUMFMT4+24                                               03040000
@NM00469 DS    CL4                                                      03041000
         ORG   @NM00469                                                 03042000
@NM00470 DC    X'05'                                                    03043000
@NM00471 DC    X'43'                                                    03044000
@NM00472 DC    AL1(24)                                                  03045000
@NM00473 DC    AL1(69)                                                  03046000
         ORG   SUMFMT4+28                                               03047000
@NM00474 DS    CL4                                                      03048000
         ORG   @NM00474                                                 03049000
@NM00475 DC    X'05'                                                    03050000
@NM00476 DC    X'43'                                                    03051000
@NM00477 DC    AL1(107)                                                 03052000
@NM00478 DC    AL1(78)                                                  03053000
         ORG   SUMFMT4+32                                               03054000
@NM00479 DS    CL4                                                      03055000
         ORG   @NM00479                                                 03056000
@NM00480 DC    X'04'                                                    03057000
@NM00481 DC    X'03'                                                    03058000
@NM00482 DC    AL1(0)                                                   03059000
@NM00483 DC    AL1(87)                                                  03060000
         ORG   SUMFMT4+36                                               03061000
@NM00484 DS    CL4                                                      03062000
         ORG   @NM00484                                                 03063000
@NM00485 DC    X'04'                                                    03064000
@NM00486 DC    X'03'                                                    03065000
@NM00487 DC    AL1(0)                                                   03066000
@NM00488 DC    AL1(96)                                                  03067000
         ORG   SUMFMT4+40                                               03068000
@NM00489 DS    CL4                                                      03069000
         ORG   @NM00489                                                 03070000
@NM00490 DC    F'0'                                                     03071000
         ORG   SUMFMT4+44                                               03072000
SUML5    DS    CL5                                                      03073000
         ORG   SUML5                                                    03074000
@NM00491 DC    CL5'(8-F)'                                               03075000
         ORG   SUML5+5                                                  03076000
         DS    CL3                                                      03077000
SUMFMT5  DS    CL44                                                     03078000
         ORG   SUMFMT5                                                  03079000
@NM00492 DS    CL4                                                      03080000
         ORG   @NM00492                                                 03081000
@NM00493 DC    X'01'                                                    03082000
@NM00494 DC    X'40'                                                    03083000
@NM00495 DC    AL1(0)                                                   03084000
@NM00496 DC    AL1(0)                                                   03085000
         ORG   SUMFMT5+4                                                03086000
@NM00497 DS    CL8                                                      03087000
         ORG   @NM00497                                                 03088000
@NM00498 DC    X'07'                                                    03089000
@NM00499 DC    X'43'                                                    03090000
@NM00500 DC    AL1(107)                                                 03091000
@NM00501 DC    AL1(33)                                                  03092000
@NM00502 DC    AL4(SUML5)                                               03093000
         ORG   SUMFMT5+12                                               03094000
@NM00503 DS    CL4                                                      03095000
         ORG   @NM00503                                                 03096000
@NM00504 DC    X'04'                                                    03097000
@NM00505 DC    X'03'                                                    03098000
@NM00506 DC    AL1(0)                                                   03099000
@NM00507 DC    AL1(42)                                                  03100000
         ORG   SUMFMT5+16                                               03101000
@NM00508 DS    CL4                                                      03102000
         ORG   @NM00508                                                 03103000
@NM00509 DC    X'04'                                                    03104000
@NM00510 DC    X'03'                                                    03105000
@NM00511 DC    AL1(0)                                                   03106000
@NM00512 DC    AL1(51)                                                  03107000
         ORG   SUMFMT5+20                                               03108000
@NM00513 DS    CL4                                                      03109000
         ORG   @NM00513                                                 03110000
@NM00514 DC    X'04'                                                    03111000
@NM00515 DC    X'03'                                                    03112000
@NM00516 DC    AL1(0)                                                   03113000
@NM00517 DC    AL1(60)                                                  03114000
         ORG   SUMFMT5+24                                               03115000
@NM00518 DS    CL4                                                      03116000
         ORG   @NM00518                                                 03117000
@NM00519 DC    X'04'                                                    03118000
@NM00520 DC    X'03'                                                    03119000
@NM00521 DC    AL1(0)                                                   03120000
@NM00522 DC    AL1(69)                                                  03121000
         ORG   SUMFMT5+28                                               03122000
@NM00523 DS    CL4                                                      03123000
         ORG   @NM00523                                                 03124000
@NM00524 DC    X'04'                                                    03125000
@NM00525 DC    X'03'                                                    03126000
@NM00526 DC    AL1(0)                                                   03127000
@NM00527 DC    AL1(78)                                                  03128000
         ORG   SUMFMT5+32                                               03129000
@NM00528 DS    CL4                                                      03130000
         ORG   @NM00528                                                 03131000
@NM00529 DC    X'04'                                                    03132000
@NM00530 DC    X'03'                                                    03133000
@NM00531 DC    AL1(0)                                                   03134000
@NM00532 DC    AL1(87)                                                  03135000
         ORG   SUMFMT5+36                                               03136000
@NM00533 DS    CL4                                                      03137000
         ORG   @NM00533                                                 03138000
@NM00534 DC    X'04'                                                    03139000
@NM00535 DC    X'03'                                                    03140000
@NM00536 DC    AL1(0)                                                   03141000
@NM00537 DC    AL1(96)                                                  03142000
         ORG   SUMFMT5+40                                               03143000
@NM00538 DS    CL4                                                      03144000
         ORG   @NM00538                                                 03145000
@NM00539 DC    F'0'                                                     03146000
         ORG   SUMFMT5+44                                               03147000
SUML6    DS    CL18                                                     03148000
         ORG   SUML6                                                    03149000
@NM00540 DC    CL2'EC'                                                  03150000
@NM00541 DC    CL3'PSW'                                                 03151000
@NM00542 DC    CL2'AT'                                                  03152000
@NM00543 DC    CL4'TIME'                                                03153000
@NM00544 DC    CL2'OF'                                                  03154000
@NM00545 DC    CL5'ERROR'                                               03155000
         ORG   SUML6+18                                                 03156000
         DS    CL2                                                      03157000
SUMFMT6  DS    CL36                                                     03158000
         ORG   SUMFMT6                                                  03159000
@NM00546 DS    CL4                                                      03160000
         ORG   @NM00546                                                 03161000
@NM00547 DC    X'01'                                                    03162000
@NM00548 DC    X'40'                                                    03163000
@NM00549 DC    AL1(0)                                                   03164000
@NM00550 DC    AL1(0)                                                   03165000
         ORG   SUMFMT6+4                                                03166000
@NM00551 DS    CL8                                                      03167000
         ORG   @NM00551                                                 03168000
@NM00552 DC    X'07'                                                    03169000
@NM00553 DC    X'13'                                                    03170000
@NM00554 DC    AL1(8)                                                   03171000
@NM00555 DC    AL1(33)                                                  03172000
@NM00556 DC    AL4(SUML6)                                               03173000
         ORG   SUMFMT6+12                                               03174000
@NM00557 DS    CL4                                                      03175000
         ORG   @NM00557                                                 03176000
@NM00558 DC    X'05'                                                    03177000
@NM00559 DC    X'23'                                                    03178000
@NM00560 DC    AL1(11)                                                  03179000
@NM00561 DC    AL1(42)                                                  03180000
         ORG   SUMFMT6+16                                               03181000
@NM00562 DS    CL4                                                      03182000
         ORG   @NM00562                                                 03183000
@NM00563 DC    X'05'                                                    03184000
@NM00564 DC    X'13'                                                    03185000
@NM00565 DC    AL1(15)                                                  03186000
@NM00566 DC    AL1(51)                                                  03187000
         ORG   SUMFMT6+20                                               03188000
@NM00567 DS    CL4                                                      03189000
         ORG   @NM00567                                                 03190000
@NM00568 DC    X'05'                                                    03191000
@NM00569 DC    X'33'                                                    03192000
@NM00570 DC    AL1(18)                                                  03193000
@NM00571 DC    AL1(60)                                                  03194000
         ORG   SUMFMT6+24                                               03195000
@NM00572 DS    CL4                                                      03196000
         ORG   @NM00572                                                 03197000
@NM00573 DC    X'01'                                                    03198000
@NM00574 DC    X'10'                                                    03199000
@NM00575 DC    AL1(23)                                                  03200000
@NM00576 DC    AL1(0)                                                   03201000
         ORG   SUMFMT6+28                                               03202000
@NM00577 DS    CL4                                                      03203000
         ORG   @NM00577                                                 03204000
@NM00578 DC    X'01'                                                    03205000
@NM00579 DC    X'40'                                                    03206000
@NM00580 DC    AL1(26)                                                  03207000
@NM00581 DC    AL1(0)                                                   03208000
         ORG   SUMFMT6+32                                               03209000
@NM00582 DS    CL4                                                      03210000
         ORG   @NM00582                                                 03211000
@NM00583 DC    F'0'                                                     03212000
         ORG   SUMFMT6+36                                               03213000
SUML7    DS    CL8                                                      03214000
         ORG   SUML7                                                    03215000
@NM00584 DC    CL8'SDWACOMP'                                            03216000
         ORG   SUML7+8                                                  03217000
SUMFMT7  DS    CL16                                                     03218000
         ORG   SUMFMT7                                                  03219000
@NM00585 DS    CL4                                                      03220000
         ORG   @NM00585                                                 03221000
@NM00586 DC    X'01'                                                    03222000
@NM00587 DC    X'40'                                                    03223000
@NM00588 DC    AL1(0)                                                   03224000
@NM00589 DC    AL1(0)                                                   03225000
         ORG   SUMFMT7+4                                                03226000
@NM00590 DS    CL8                                                      03227000
         ORG   @NM00590                                                 03228000
@NM00591 DC    X'07'                                                    03229000
@NM00592 DC    X'73'                                                    03230000
@NM00593 DC    AL1(8)                                                   03231000
@NM00594 DC    AL1(33)                                                  03232000
@NM00595 DC    AL4(SUML7)                                               03233000
         ORG   SUMFMT7+12                                               03234000
@NM00596 DS    CL4                                                      03235000
         ORG   @NM00596                                                 03236000
@NM00597 DC    F'0'                                                     03237000
         ORG   SUMFMT7+16                                               03238000
SUML8    DS    CL33                                                     03239000
         ORG   SUML8                                                    03240000
@NM00598 DC    CL5'RETRY'                                               03241000
@NM00599 DC    CL4'ADDR'                                                03242000
@NM00600 DC    CL8'RETURNED'                                            03243000
@NM00601 DC    CL4'FROM'                                                03244000
@NM00602 DC    CL8'RECOVERY'                                            03245000
@NM00603 DC    CL4'EXIT'                                                03246000
         ORG   SUML8+33                                                 03247000
         DS    CL3                                                      03248000
SUMFMT8  DS    CL36                                                     03249000
         ORG   SUMFMT8                                                  03250000
@NM00604 DS    CL4                                                      03251000
         ORG   @NM00604                                                 03252000
@NM00605 DC    X'01'                                                    03253000
@NM00606 DC    X'40'                                                    03254000
@NM00607 DC    AL1(0)                                                   03255000
@NM00608 DC    AL1(0)                                                   03256000
         ORG   SUMFMT8+4                                                03257000
@NM00609 DS    CL8                                                      03258000
         ORG   @NM00609                                                 03259000
@NM00610 DC    X'07'                                                    03260000
@NM00611 DC    X'43'                                                    03261000
@NM00612 DC    AL1(8)                                                   03262000
@NM00613 DC    AL1(48)                                                  03263000
@NM00614 DC    AL4(SUML8)                                               03264000
         ORG   SUMFMT8+12                                               03265000
@NM00615 DS    CL4                                                      03266000
         ORG   @NM00615                                                 03267000
@NM00616 DC    X'01'                                                    03268000
@NM00617 DC    X'30'                                                    03269000
@NM00618 DC    AL1(14)                                                  03270000
@NM00619 DC    AL1(0)                                                   03271000
         ORG   SUMFMT8+16                                               03272000
@NM00620 DS    CL4                                                      03273000
         ORG   @NM00620                                                 03274000
@NM00621 DC    X'01'                                                    03275000
@NM00622 DC    X'70'                                                    03276000
@NM00623 DC    AL1(19)                                                  03277000
@NM00624 DC    AL1(0)                                                   03278000
         ORG   SUMFMT8+20                                               03279000
@NM00625 DS    CL4                                                      03280000
         ORG   @NM00625                                                 03281000
@NM00626 DC    X'01'                                                    03282000
@NM00627 DC    X'30'                                                    03283000
@NM00628 DC    AL1(28)                                                  03284000
@NM00629 DC    AL1(0)                                                   03285000
         ORG   SUMFMT8+24                                               03286000
@NM00630 DS    CL4                                                      03287000
         ORG   @NM00630                                                 03288000
@NM00631 DC    X'01'                                                    03289000
@NM00632 DC    X'70'                                                    03290000
@NM00633 DC    AL1(33)                                                  03291000
@NM00634 DC    AL1(0)                                                   03292000
         ORG   SUMFMT8+28                                               03293000
@NM00635 DS    CL4                                                      03294000
         ORG   @NM00635                                                 03295000
@NM00636 DC    X'01'                                                    03296000
@NM00637 DC    X'30'                                                    03297000
@NM00638 DC    AL1(42)                                                  03298000
@NM00639 DC    AL1(0)                                                   03299000
         ORG   SUMFMT8+32                                               03300000
@NM00640 DS    CL4                                                      03301000
         ORG   @NM00640                                                 03302000
@NM00641 DC    F'0'                                                     03303000
         ORG   SUMFMT8+36                                               03304000
SUML9    DS    CL14                                                     03305000
         ORG   SUML9                                                    03306000
@NM00642 DC    CL2'RB'                                                  03307000
@NM00643 DC    CL4'ADDR'                                                03308000
@NM00644 DC    CL3'FOR'                                                 03309000
@NM00645 DC    CL5'RETRY'                                               03310000
         ORG   SUML9+14                                                 03311000
         DS    CL2                                                      03312000
SUMFMT9  DS    CL28                                                     03313000
         ORG   SUMFMT9                                                  03314000
@NM00646 DS    CL4                                                      03315000
         ORG   @NM00646                                                 03316000
@NM00647 DC    X'01'                                                    03317000
@NM00648 DC    X'40'                                                    03318000
@NM00649 DC    AL1(0)                                                   03319000
@NM00650 DC    AL1(0)                                                   03320000
         ORG   SUMFMT9+4                                                03321000
@NM00651 DS    CL8                                                      03322000
         ORG   @NM00651                                                 03323000
@NM00652 DC    X'07'                                                    03324000
@NM00653 DC    X'13'                                                    03325000
@NM00654 DC    AL1(8)                                                   03326000
@NM00655 DC    AL1(48)                                                  03327000
@NM00656 DC    AL4(SUML9)                                               03328000
         ORG   SUMFMT9+12                                               03329000
@NM00657 DS    CL4                                                      03330000
         ORG   @NM00657                                                 03331000
@NM00658 DC    X'01'                                                    03332000
@NM00659 DC    X'30'                                                    03333000
@NM00660 DC    AL1(11)                                                  03334000
@NM00661 DC    AL1(0)                                                   03335000
         ORG   SUMFMT9+16                                               03336000
@NM00662 DS    CL4                                                      03337000
         ORG   @NM00662                                                 03338000
@NM00663 DC    X'01'                                                    03339000
@NM00664 DC    X'20'                                                    03340000
@NM00665 DC    AL1(16)                                                  03341000
@NM00666 DC    AL1(0)                                                   03342000
         ORG   SUMFMT9+20                                               03343000
@NM00667 DS    CL4                                                      03344000
         ORG   @NM00667                                                 03345000
@NM00668 DC    X'01'                                                    03346000
@NM00669 DC    X'40'                                                    03347000
@NM00670 DC    AL1(20)                                                  03348000
@NM00671 DC    AL1(0)                                                   03349000
         ORG   SUMFMT9+24                                               03350000
@NM00672 DS    CL4                                                      03351000
         ORG   @NM00672                                                 03352000
@NM00673 DC    F'0'                                                     03353000
         ORG   SUMFMT9+28                                               03354000
SUML10   DS    CL7                                                      03355000
         ORG   SUML10                                                   03356000
@NM00674 DC    CL3'CVT'                                                 03357000
@NM00675 DC    CL4'ADDR'                                                03358000
         ORG   SUML10+7                                                 03359000
         DS    CL1                                                      03360000
SUMFMT10 DS    CL20                                                     03361000
         ORG   SUMFMT10                                                 03362000
@NM00676 DS    CL4                                                      03363000
         ORG   @NM00676                                                 03364000
@NM00677 DC    X'01'                                                    03365000
@NM00678 DC    X'40'                                                    03366000
@NM00679 DC    AL1(0)                                                   03367000
@NM00680 DC    AL1(0)                                                   03368000
         ORG   SUMFMT10+4                                               03369000
@NM00681 DS    CL8                                                      03370000
         ORG   @NM00681                                                 03371000
@NM00682 DC    X'07'                                                    03372000
@NM00683 DC    X'23'                                                    03373000
@NM00684 DC    AL1(8)                                                   03374000
@NM00685 DC    AL1(36)                                                  03375000
@NM00686 DC    AL4(SUML10)                                              03376000
         ORG   SUMFMT10+12                                              03377000
@NM00687 DS    CL4                                                      03378000
         ORG   @NM00687                                                 03379000
@NM00688 DC    X'01'                                                    03380000
@NM00689 DC    X'30'                                                    03381000
@NM00690 DC    AL1(13)                                                  03382000
@NM00691 DC    AL1(0)                                                   03383000
         ORG   SUMFMT10+16                                              03384000
@NM00692 DS    CL4                                                      03385000
         ORG   @NM00692                                                 03386000
@NM00693 DC    F'0'                                                     03387000
         ORG   SUMFMT10+20                                              03388000
SUML11   DS    CL8                                                      03389000
         ORG   SUML11                                                   03390000
@NM00694 DC    CL4'RTCT'                                                03391000
@NM00695 DC    CL4'ADDR'                                                03392000
         ORG   SUML11+8                                                 03393000
SUMFMT11 DS    CL20                                                     03394000
         ORG   SUMFMT11                                                 03395000
@NM00696 DS    CL4                                                      03396000
         ORG   @NM00696                                                 03397000
@NM00697 DC    X'01'                                                    03398000
@NM00698 DC    X'40'                                                    03399000
@NM00699 DC    AL1(0)                                                   03400000
@NM00700 DC    AL1(0)                                                   03401000
         ORG   SUMFMT11+4                                               03402000
@NM00701 DS    CL8                                                      03403000
         ORG   @NM00701                                                 03404000
@NM00702 DC    X'07'                                                    03405000
@NM00703 DC    X'33'                                                    03406000
@NM00704 DC    AL1(8)                                                   03407000
@NM00705 DC    AL1(36)                                                  03408000
@NM00706 DC    AL4(SUML11)                                              03409000
         ORG   SUMFMT11+12                                              03410000
@NM00707 DS    CL4                                                      03411000
         ORG   @NM00707                                                 03412000
@NM00708 DC    X'01'                                                    03413000
@NM00709 DC    X'30'                                                    03414000
@NM00710 DC    AL1(13)                                                  03415000
@NM00711 DC    AL1(0)                                                   03416000
         ORG   SUMFMT11+16                                              03417000
@NM00712 DS    CL4                                                      03418000
         ORG   @NM00712                                                 03419000
@NM00713 DC    F'0'                                                     03420000
         ORG   SUMFMT11+20                                              03421000
SUML12   DS    CL7                                                      03422000
         ORG   SUML12                                                   03423000
@NM00714 DC    CL3'SCB'                                                 03424000
@NM00715 DC    CL4'ADDR'                                                03425000
         ORG   SUML12+7                                                 03426000
         DS    CL1                                                      03427000
SUMFMT12 DS    CL20                                                     03428000
         ORG   SUMFMT12                                                 03429000
@NM00716 DS    CL4                                                      03430000
         ORG   @NM00716                                                 03431000
@NM00717 DC    X'01'                                                    03432000
@NM00718 DC    X'40'                                                    03433000
@NM00719 DC    AL1(0)                                                   03434000
@NM00720 DC    AL1(0)                                                   03435000
         ORG   SUMFMT12+4                                               03436000
@NM00721 DS    CL8                                                      03437000
         ORG   @NM00721                                                 03438000
@NM00722 DC    X'07'                                                    03439000
@NM00723 DC    X'23'                                                    03440000
@NM00724 DC    AL1(8)                                                   03441000
@NM00725 DC    AL1(36)                                                  03442000
@NM00726 DC    AL4(SUML12)                                              03443000
         ORG   SUMFMT12+12                                              03444000
@NM00727 DS    CL4                                                      03445000
         ORG   @NM00727                                                 03446000
@NM00728 DC    X'01'                                                    03447000
@NM00729 DC    X'30'                                                    03448000
@NM00730 DC    AL1(13)                                                  03449000
@NM00731 DC    AL1(0)                                                   03450000
         ORG   SUMFMT12+16                                              03451000
@NM00732 DS    CL4                                                      03452000
         ORG   @NM00732                                                 03453000
@NM00733 DC    F'0'                                                     03454000
         ORG   SUMFMT12+20                                              03455000
SUML13   DS    CL8                                                      03456000
         ORG   SUML13                                                   03457000
@NM00734 DC    CL4'SDWA'                                                03458000
@NM00735 DC    CL4'ADDR'                                                03459000
         ORG   SUML13+8                                                 03460000
SUMFMT13 DS    CL20                                                     03461000
         ORG   SUMFMT13                                                 03462000
@NM00736 DS    CL4                                                      03463000
         ORG   @NM00736                                                 03464000
@NM00737 DC    X'01'                                                    03465000
@NM00738 DC    X'40'                                                    03466000
@NM00739 DC    AL1(0)                                                   03467000
@NM00740 DC    AL1(0)                                                   03468000
         ORG   SUMFMT13+4                                               03469000
@NM00741 DS    CL8                                                      03470000
         ORG   @NM00741                                                 03471000
@NM00742 DC    X'07'                                                    03472000
@NM00743 DC    X'33'                                                    03473000
@NM00744 DC    AL1(8)                                                   03474000
@NM00745 DC    AL1(36)                                                  03475000
@NM00746 DC    AL4(SUML13)                                              03476000
         ORG   SUMFMT13+12                                              03477000
@NM00747 DS    CL4                                                      03478000
         ORG   @NM00747                                                 03479000
@NM00748 DC    X'01'                                                    03480000
@NM00749 DC    X'30'                                                    03481000
@NM00750 DC    AL1(13)                                                  03482000
@NM00751 DC    AL1(0)                                                   03483000
         ORG   SUMFMT13+16                                              03484000
@NM00752 DS    CL4                                                      03485000
         ORG   @NM00752                                                 03486000
@NM00753 DC    F'0'                                                     03487000
         ORG   SUMFMT13+20                                              03488000
SUML14   DS    CL8                                                      03489000
         ORG   SUML14                                                   03490000
@NM00754 DC    CL4'SVRB'                                                03491000
@NM00755 DC    CL4'ADDR'                                                03492000
         ORG   SUML14+8                                                 03493000
SUMFMT14 DS    CL20                                                     03494000
         ORG   SUMFMT14                                                 03495000
@NM00756 DS    CL4                                                      03496000
         ORG   @NM00756                                                 03497000
@NM00757 DC    X'01'                                                    03498000
@NM00758 DC    X'40'                                                    03499000
@NM00759 DC    AL1(0)                                                   03500000
@NM00760 DC    AL1(0)                                                   03501000
         ORG   SUMFMT14+4                                               03502000
@NM00761 DS    CL8                                                      03503000
         ORG   @NM00761                                                 03504000
@NM00762 DC    X'07'                                                    03505000
@NM00763 DC    X'33'                                                    03506000
@NM00764 DC    AL1(8)                                                   03507000
@NM00765 DC    AL1(36)                                                  03508000
@NM00766 DC    AL4(SUML14)                                              03509000
         ORG   SUMFMT14+12                                              03510000
@NM00767 DS    CL4                                                      03511000
         ORG   @NM00767                                                 03512000
@NM00768 DC    X'01'                                                    03513000
@NM00769 DC    X'30'                                                    03514000
@NM00770 DC    AL1(13)                                                  03515000
@NM00771 DC    AL1(0)                                                   03516000
         ORG   SUMFMT14+16                                              03517000
@NM00772 DS    CL4                                                      03518000
         ORG   @NM00772                                                 03519000
@NM00773 DC    F'0'                                                     03520000
         ORG   SUMFMT14+20                                              03521000
SUML15   DS    CL20                                                     03522000
         ORG   SUML15                                                   03523000
@NM00774 DC    CL4'PREV'                                                03524000
@NM00775 DC    CL6'RTM2WA'                                              03525000
@NM00776 DC    CL3'FOR'                                                 03526000
@NM00777 DC    CL3'THE'                                                 03527000
@NM00778 DC    CL4'TASK'                                                03528000
         ORG   SUML15+20                                                03529000
SUMFMT15 DS    CL32                                                     03530000
         ORG   SUMFMT15                                                 03531000
@NM00779 DS    CL4                                                      03532000
         ORG   @NM00779                                                 03533000
@NM00780 DC    X'01'                                                    03534000
@NM00781 DC    X'40'                                                    03535000
@NM00782 DC    AL1(0)                                                   03536000
@NM00783 DC    AL1(0)                                                   03537000
         ORG   SUMFMT15+4                                               03538000
@NM00784 DS    CL8                                                      03539000
         ORG   @NM00784                                                 03540000
@NM00785 DC    X'07'                                                    03541000
@NM00786 DC    X'33'                                                    03542000
@NM00787 DC    AL1(8)                                                   03543000
@NM00788 DC    AL1(36)                                                  03544000
@NM00789 DC    AL4(SUML15)                                              03545000
         ORG   SUMFMT15+12                                              03546000
@NM00790 DS    CL4                                                      03547000
         ORG   @NM00790                                                 03548000
@NM00791 DC    X'01'                                                    03549000
@NM00792 DC    X'50'                                                    03550000
@NM00793 DC    AL1(13)                                                  03551000
@NM00794 DC    AL1(0)                                                   03552000
         ORG   SUMFMT15+16                                              03553000
@NM00795 DS    CL4                                                      03554000
         ORG   @NM00795                                                 03555000
@NM00796 DC    X'01'                                                    03556000
@NM00797 DC    X'20'                                                    03557000
@NM00798 DC    AL1(20)                                                  03558000
@NM00799 DC    AL1(0)                                                   03559000
         ORG   SUMFMT15+20                                              03560000
@NM00800 DS    CL4                                                      03561000
         ORG   @NM00800                                                 03562000
@NM00801 DC    X'01'                                                    03563000
@NM00802 DC    X'20'                                                    03564000
@NM00803 DC    AL1(24)                                                  03565000
@NM00804 DC    AL1(0)                                                   03566000
         ORG   SUMFMT15+24                                              03567000
@NM00805 DS    CL4                                                      03568000
         ORG   @NM00805                                                 03569000
@NM00806 DC    X'01'                                                    03570000
@NM00807 DC    X'30'                                                    03571000
@NM00808 DC    AL1(28)                                                  03572000
@NM00809 DC    AL1(0)                                                   03573000
         ORG   SUMFMT15+28                                              03574000
@NM00810 DS    CL4                                                      03575000
         ORG   @NM00810                                                 03576000
@NM00811 DC    F'0'                                                     03577000
         ORG   SUMFMT15+32                                              03578000
SUML16   DS    CL22                                                     03579000
         ORG   SUML16                                                   03580000
@NM00812 DC    CL4'PREV'                                                03581000
@NM00813 DC    CL6'RTM2WA'                                              03582000
@NM00814 DC    CL3'FOR'                                                 03583000
@NM00815 DC    CL9'RECURSION'                                           03584000
         ORG   SUML16+22                                                03585000
         DS    CL2                                                      03586000
SUMFMT16 DS    CL28                                                     03587000
         ORG   SUMFMT16                                                 03588000
@NM00816 DS    CL4                                                      03589000
         ORG   @NM00816                                                 03590000
@NM00817 DC    X'01'                                                    03591000
@NM00818 DC    X'40'                                                    03592000
@NM00819 DC    AL1(0)                                                   03593000
@NM00820 DC    AL1(0)                                                   03594000
         ORG   SUMFMT16+4                                               03595000
@NM00821 DS    CL8                                                      03596000
         ORG   @NM00821                                                 03597000
@NM00822 DC    X'07'                                                    03598000
@NM00823 DC    X'33'                                                    03599000
@NM00824 DC    AL1(8)                                                   03600000
@NM00825 DC    AL1(36)                                                  03601000
@NM00826 DC    AL4(SUML16)                                              03602000
         ORG   SUMFMT16+12                                              03603000
@NM00827 DS    CL4                                                      03604000
         ORG   @NM00827                                                 03605000
@NM00828 DC    X'01'                                                    03606000
@NM00829 DC    X'50'                                                    03607000
@NM00830 DC    AL1(13)                                                  03608000
@NM00831 DC    AL1(0)                                                   03609000
         ORG   SUMFMT16+16                                              03610000
@NM00832 DS    CL4                                                      03611000
         ORG   @NM00832                                                 03612000
@NM00833 DC    X'01'                                                    03613000
@NM00834 DC    X'20'                                                    03614000
@NM00835 DC    AL1(20)                                                  03615000
@NM00836 DC    AL1(0)                                                   03616000
         ORG   SUMFMT16+20                                              03617000
@NM00837 DS    CL4                                                      03618000
         ORG   @NM00837                                                 03619000
@NM00838 DC    X'01'                                                    03620000
@NM00839 DC    X'80'                                                    03621000
@NM00840 DC    AL1(24)                                                  03622000
@NM00841 DC    AL1(0)                                                   03623000
         ORG   SUMFMT16+24                                              03624000
@NM00842 DS    CL4                                                      03625000
         ORG   @NM00842                                                 03626000
@NM00843 DC    F'0'                                                     03627000
         ORG   SUMFMT16+28                                              03628000
SUML17   DS    CL30                                                     03629000
         ORG   SUML17                                                   03630000
@NM00844 DC    CL4'ASID'                                                03631000
@NM00845 DC    CL2'OF'                                                  03632000
@NM00846 DC    CL5'ERROR'                                               03633000
@NM00847 DC    CL2'IF'                                                  03634000
@NM00848 DC    CL5'CROSS'                                               03635000
@NM00849 DC    CL6'MEMORY'                                              03636000
@NM00850 DC    CL6'ABTERM'                                              03637000
         ORG   SUML17+30                                                03638000
         DS    CL2                                                      03639000
SUMFMT17 DS    CL40                                                     03640000
         ORG   SUMFMT17                                                 03641000
@NM00851 DS    CL4                                                      03642000
         ORG   @NM00851                                                 03643000
@NM00852 DC    X'01'                                                    03644000
@NM00853 DC    X'40'                                                    03645000
@NM00854 DC    AL1(0)                                                   03646000
@NM00855 DC    AL1(0)                                                   03647000
         ORG   SUMFMT17+4                                               03648000
@NM00856 DS    CL8                                                      03649000
         ORG   @NM00856                                                 03650000
@NM00857 DC    X'07'                                                    03651000
@NM00858 DC    X'31'                                                    03652000
@NM00859 DC    AL1(8)                                                   03653000
@NM00860 DC    AL1(51)                                                  03654000
@NM00861 DC    AL4(SUML17)                                              03655000
         ORG   SUMFMT17+12                                              03656000
@NM00862 DS    CL4                                                      03657000
         ORG   @NM00862                                                 03658000
@NM00863 DC    X'01'                                                    03659000
@NM00864 DC    X'10'                                                    03660000
@NM00865 DC    AL1(13)                                                  03661000
@NM00866 DC    AL1(0)                                                   03662000
         ORG   SUMFMT17+16                                              03663000
@NM00867 DS    CL4                                                      03664000
         ORG   @NM00867                                                 03665000
@NM00868 DC    X'01'                                                    03666000
@NM00869 DC    X'40'                                                    03667000
@NM00870 DC    AL1(16)                                                  03668000
@NM00871 DC    AL1(0)                                                   03669000
         ORG   SUMFMT17+20                                              03670000
@NM00872 DS    CL4                                                      03671000
         ORG   @NM00872                                                 03672000
@NM00873 DC    X'01'                                                    03673000
@NM00874 DC    X'10'                                                    03674000
@NM00875 DC    AL1(22)                                                  03675000
@NM00876 DC    AL1(0)                                                   03676000
         ORG   SUMFMT17+24                                              03677000
@NM00877 DS    CL4                                                      03678000
         ORG   @NM00877                                                 03679000
@NM00878 DC    X'01'                                                    03680000
@NM00879 DC    X'40'                                                    03681000
@NM00880 DC    AL1(25)                                                  03682000
@NM00881 DC    AL1(0)                                                   03683000
         ORG   SUMFMT17+28                                              03684000
@NM00882 DS    CL4                                                      03685000
         ORG   @NM00882                                                 03686000
@NM00883 DC    X'01'                                                    03687000
@NM00884 DC    X'50'                                                    03688000
@NM00885 DC    AL1(31)                                                  03689000
@NM00886 DC    AL1(0)                                                   03690000
         ORG   SUMFMT17+32                                              03691000
@NM00887 DS    CL4                                                      03692000
         ORG   @NM00887                                                 03693000
@NM00888 DC    X'01'                                                    03694000
@NM00889 DC    X'50'                                                    03695000
@NM00890 DC    AL1(38)                                                  03696000
@NM00891 DC    AL1(0)                                                   03697000
         ORG   SUMFMT17+36                                              03698000
@NM00892 DS    CL4                                                      03699000
         ORG   @NM00892                                                 03700000
@NM00893 DC    F'0'                                                     03701000
         ORG   SUMFMT17+40                                              03702000
SUML18   DS    CL9                                                      03703000
         ORG   SUML18                                                   03704000
@NM00894 DC    CL5'ERROR'                                               03705000
@NM00895 DC    CL4'ASID'                                                03706000
         ORG   SUML18+9                                                 03707000
         DS    CL3                                                      03708000
SUMFMT18 DS    CL20                                                     03709000
         ORG   SUMFMT18                                                 03710000
@NM00896 DS    CL4                                                      03711000
         ORG   @NM00896                                                 03712000
@NM00897 DC    X'01'                                                    03713000
@NM00898 DC    X'40'                                                    03714000
@NM00899 DC    AL1(0)                                                   03715000
@NM00900 DC    AL1(0)                                                   03716000
         ORG   SUMFMT18+4                                               03717000
@NM00901 DS    CL8                                                      03718000
         ORG   @NM00901                                                 03719000
@NM00902 DC    X'07'                                                    03720000
@NM00903 DC    X'41'                                                    03721000
@NM00904 DC    AL1(8)                                                   03722000
@NM00905 DC    AL1(33)                                                  03723000
@NM00906 DC    AL4(SUML18)                                              03724000
         ORG   SUMFMT18+12                                              03725000
@NM00907 DS    CL4                                                      03726000
         ORG   @NM00907                                                 03727000
@NM00908 DC    X'01'                                                    03728000
@NM00909 DC    X'30'                                                    03729000
@NM00910 DC    AL1(14)                                                  03730000
@NM00911 DC    AL1(0)                                                   03731000
         ORG   SUMFMT18+16                                              03732000
@NM00912 DS    CL4                                                      03733000
         ORG   @NM00912                                                 03734000
@NM00913 DC    F'0'                                                     03735000
         ORG   SUMFMT18+20                                              03736000
SUML19   DS    CL35                                                     03737000
         ORG   SUML19                                                   03738000
@NM00914 DC    CL7'CURRENT'                                             03739000
@NM00915 DC    CL5'TRACE'                                               03740000
@NM00916 DC    CL5'ENTRY'                                               03741000
@NM00917 DC    CL3'FOR'                                                 03742000
@NM00918 DC    CL5'SAVED'                                               03743000
@NM00919 DC    CL5'TRACE'                                               03744000
@NM00920 DC    CL5'TABLE'                                               03745000
         ORG   SUML19+35                                                03746000
         DS    CL1                                                      03747000
SUMFMT19 DS    CL40                                                     03748000
         ORG   SUMFMT19                                                 03749000
@NM00921 DS    CL4                                                      03750000
         ORG   @NM00921                                                 03751000
@NM00922 DC    X'01'                                                    03752000
@NM00923 DC    X'40'                                                    03753000
@NM00924 DC    AL1(0)                                                   03754000
@NM00925 DC    AL1(0)                                                   03755000
         ORG   SUMFMT19+4                                               03756000
@NM00926 DS    CL8                                                      03757000
         ORG   @NM00926                                                 03758000
@NM00927 DC    X'07'                                                    03759000
@NM00928 DC    X'63'                                                    03760000
@NM00929 DC    AL1(8)                                                   03761000
@NM00930 DC    AL1(51)                                                  03762000
@NM00931 DC    AL4(SUML19)                                              03763000
         ORG   SUMFMT19+12                                              03764000
@NM00932 DS    CL4                                                      03765000
         ORG   @NM00932                                                 03766000
@NM00933 DC    X'01'                                                    03767000
@NM00934 DC    X'40'                                                    03768000
@NM00935 DC    AL1(16)                                                  03769000
@NM00936 DC    AL1(0)                                                   03770000
         ORG   SUMFMT19+16                                              03771000
@NM00937 DS    CL4                                                      03772000
         ORG   @NM00937                                                 03773000
@NM00938 DC    X'01'                                                    03774000
@NM00939 DC    X'40'                                                    03775000
@NM00940 DC    AL1(22)                                                  03776000
@NM00941 DC    AL1(0)                                                   03777000
         ORG   SUMFMT19+20                                              03778000
@NM00942 DS    CL4                                                      03779000
         ORG   @NM00942                                                 03780000
@NM00943 DC    X'01'                                                    03781000
@NM00944 DC    X'20'                                                    03782000
@NM00945 DC    AL1(28)                                                  03783000
@NM00946 DC    AL1(0)                                                   03784000
         ORG   SUMFMT19+24                                              03785000
@NM00947 DS    CL4                                                      03786000
         ORG   @NM00947                                                 03787000
@NM00948 DC    X'01'                                                    03788000
@NM00949 DC    X'40'                                                    03789000
@NM00950 DC    AL1(32)                                                  03790000
@NM00951 DC    AL1(0)                                                   03791000
         ORG   SUMFMT19+28                                              03792000
@NM00952 DS    CL4                                                      03793000
         ORG   @NM00952                                                 03794000
@NM00953 DC    X'01'                                                    03795000
@NM00954 DC    X'40'                                                    03796000
@NM00955 DC    AL1(38)                                                  03797000
@NM00956 DC    AL1(0)                                                   03798000
         ORG   SUMFMT19+32                                              03799000
@NM00957 DS    CL4                                                      03800000
         ORG   @NM00957                                                 03801000
@NM00958 DC    X'01'                                                    03802000
@NM00959 DC    X'40'                                                    03803000
@NM00960 DC    AL1(44)                                                  03804000
@NM00961 DC    AL1(0)                                                   03805000
         ORG   SUMFMT19+36                                              03806000
@NM00962 DS    CL4                                                      03807000
         ORG   @NM00962                                                 03808000
@NM00963 DC    F'0'                                                     03809000
         ORG   SUMFMT19+40                                              03810000
SUML20   DS    CL33                                                     03811000
         ORG   SUML20                                                   03812000
@NM00964 DC    CL5'FIRST'                                               03813000
@NM00965 DC    CL5'TRACE'                                               03814000
@NM00966 DC    CL5'ENTRY'                                               03815000
@NM00967 DC    CL3'FOR'                                                 03816000
@NM00968 DC    CL5'SAVED'                                               03817000
@NM00969 DC    CL5'TRACE'                                               03818000
@NM00970 DC    CL5'TABLE'                                               03819000
         ORG   SUML20+33                                                03820000
         DS    CL3                                                      03821000
SUMFMT20 DS    CL40                                                     03822000
         ORG   SUMFMT20                                                 03823000
@NM00971 DS    CL4                                                      03824000
         ORG   @NM00971                                                 03825000
@NM00972 DC    X'01'                                                    03826000
@NM00973 DC    X'40'                                                    03827000
@NM00974 DC    AL1(0)                                                   03828000
@NM00975 DC    AL1(0)                                                   03829000
         ORG   SUMFMT20+4                                               03830000
@NM00976 DS    CL8                                                      03831000
         ORG   @NM00976                                                 03832000
@NM00977 DC    X'07'                                                    03833000
@NM00978 DC    X'43'                                                    03834000
@NM00979 DC    AL1(8)                                                   03835000
@NM00980 DC    AL1(51)                                                  03836000
@NM00981 DC    AL4(SUML20)                                              03837000
         ORG   SUMFMT20+12                                              03838000
@NM00982 DS    CL4                                                      03839000
         ORG   @NM00982                                                 03840000
@NM00983 DC    X'01'                                                    03841000
@NM00984 DC    X'40'                                                    03842000
@NM00985 DC    AL1(14)                                                  03843000
@NM00986 DC    AL1(0)                                                   03844000
         ORG   SUMFMT20+16                                              03845000
@NM00987 DS    CL4                                                      03846000
         ORG   @NM00987                                                 03847000
@NM00988 DC    X'01'                                                    03848000
@NM00989 DC    X'40'                                                    03849000
@NM00990 DC    AL1(20)                                                  03850000
@NM00991 DC    AL1(0)                                                   03851000
         ORG   SUMFMT20+20                                              03852000
@NM00992 DS    CL4                                                      03853000
         ORG   @NM00992                                                 03854000
@NM00993 DC    X'01'                                                    03855000
@NM00994 DC    X'20'                                                    03856000
@NM00995 DC    AL1(26)                                                  03857000
@NM00996 DC    AL1(0)                                                   03858000
         ORG   SUMFMT20+24                                              03859000
@NM00997 DS    CL4                                                      03860000
         ORG   @NM00997                                                 03861000
@NM00998 DC    X'01'                                                    03862000
@NM00999 DC    X'40'                                                    03863000
@NM01000 DC    AL1(30)                                                  03864000
@NM01001 DC    AL1(0)                                                   03865000
         ORG   SUMFMT20+28                                              03866000
@NM01002 DS    CL4                                                      03867000
         ORG   @NM01002                                                 03868000
@NM01003 DC    X'01'                                                    03869000
@NM01004 DC    X'40'                                                    03870000
@NM01005 DC    AL1(36)                                                  03871000
@NM01006 DC    AL1(0)                                                   03872000
         ORG   SUMFMT20+32                                              03873000
@NM01007 DS    CL4                                                      03874000
         ORG   @NM01007                                                 03875000
@NM01008 DC    X'01'                                                    03876000
@NM01009 DC    X'40'                                                    03877000
@NM01010 DC    AL1(42)                                                  03878000
@NM01011 DC    AL1(0)                                                   03879000
         ORG   SUMFMT20+36                                              03880000
@NM01012 DS    CL4                                                      03881000
         ORG   @NM01012                                                 03882000
@NM01013 DC    F'0'                                                     03883000
         ORG   SUMFMT20+40                                              03884000
SUML21   DS    CL32                                                     03885000
         ORG   SUML21                                                   03886000
@NM01014 DC    CL4'LAST'                                                03887000
@NM01015 DC    CL5'TRACE'                                               03888000
@NM01016 DC    CL5'ENTRY'                                               03889000
@NM01017 DC    CL3'FOR'                                                 03890000
@NM01018 DC    CL5'SAVED'                                               03891000
@NM01019 DC    CL5'TRACE'                                               03892000
@NM01020 DC    CL5'TABLE'                                               03893000
         ORG   SUML21+32                                                03894000
SUMFMT21 DS    CL40                                                     03895000
         ORG   SUMFMT21                                                 03896000
@NM01021 DS    CL4                                                      03897000
         ORG   @NM01021                                                 03898000
@NM01022 DC    X'01'                                                    03899000
@NM01023 DC    X'40'                                                    03900000
@NM01024 DC    AL1(0)                                                   03901000
@NM01025 DC    AL1(0)                                                   03902000
         ORG   SUMFMT21+4                                               03903000
@NM01026 DS    CL8                                                      03904000
         ORG   @NM01026                                                 03905000
@NM01027 DC    X'07'                                                    03906000
@NM01028 DC    X'33'                                                    03907000
@NM01029 DC    AL1(8)                                                   03908000
@NM01030 DC    AL1(51)                                                  03909000
@NM01031 DC    AL4(SUML21)                                              03910000
         ORG   SUMFMT21+12                                              03911000
@NM01032 DS    CL4                                                      03912000
         ORG   @NM01032                                                 03913000
@NM01033 DC    X'01'                                                    03914000
@NM01034 DC    X'40'                                                    03915000
@NM01035 DC    AL1(13)                                                  03916000
@NM01036 DC    AL1(0)                                                   03917000
         ORG   SUMFMT21+16                                              03918000
@NM01037 DS    CL4                                                      03919000
         ORG   @NM01037                                                 03920000
@NM01038 DC    X'01'                                                    03921000
@NM01039 DC    X'40'                                                    03922000
@NM01040 DC    AL1(19)                                                  03923000
@NM01041 DC    AL1(0)                                                   03924000
         ORG   SUMFMT21+20                                              03925000
@NM01042 DS    CL4                                                      03926000
         ORG   @NM01042                                                 03927000
@NM01043 DC    X'01'                                                    03928000
@NM01044 DC    X'20'                                                    03929000
@NM01045 DC    AL1(25)                                                  03930000
@NM01046 DC    AL1(0)                                                   03931000
         ORG   SUMFMT21+24                                              03932000
@NM01047 DS    CL4                                                      03933000
         ORG   @NM01047                                                 03934000
@NM01048 DC    X'01'                                                    03935000
@NM01049 DC    X'40'                                                    03936000
@NM01050 DC    AL1(29)                                                  03937000
@NM01051 DC    AL1(0)                                                   03938000
         ORG   SUMFMT21+28                                              03939000
@NM01052 DS    CL4                                                      03940000
         ORG   @NM01052                                                 03941000
@NM01053 DC    X'01'                                                    03942000
@NM01054 DC    X'40'                                                    03943000
@NM01055 DC    AL1(35)                                                  03944000
@NM01056 DC    AL1(0)                                                   03945000
         ORG   SUMFMT21+32                                              03946000
@NM01057 DS    CL4                                                      03947000
         ORG   @NM01057                                                 03948000
@NM01058 DC    X'01'                                                    03949000
@NM01059 DC    X'40'                                                    03950000
@NM01060 DC    AL1(41)                                                  03951000
@NM01061 DC    AL1(0)                                                   03952000
         ORG   SUMFMT21+36                                              03953000
@NM01062 DS    CL4                                                      03954000
         ORG   @NM01062                                                 03955000
@NM01063 DC    F'0'                                                     03956000
         ORG   SUMFMT21+40                                              03957000
REL2     DC    CL2'02'                                                  03958000
TRANS    DS    CL256                                                    03959000
         ORG   TRANS                                                    03960000
@NM01068 DS    CL64                                                     03961000
BL       DC    CL1' '                                                   03962000
@NM01069 DS    CL175                                                    03963000
NUMS     DC    CL16'0123456789ABCDEF'                                   03964000
         ORG   TRANS+256                                                03965000
ESAHDR   DC    CL61'ESA BIT FLAG SUMMARY (RTM1 RELATED INFORMATION) FROC03966000
               M SVRB AT '                                              03967000
ESASTART DC    CL13'RTM2 ENTERED '                                      03968000
ESAUS    DC    CL60'---------------------------------------------------C03969000
               ---------'                                               03970000
RCEND1   DC    CL46',CONTINUE WITH TERMINATION-IMPLIES PERCOLATION'     03971000
RCEND2   DC    CL6',RETRY'                                              03972000
RCEND3   DC    CL64',CONTINUE WITH TERMINATION-PREVENT FURTHER STAI/ESTC03973000
               AI PROCESSING'                                           03974000
RCEND4   DC    CL14',UNKNOWN VALUE'                                     03975000
RCMSG    DC    CL34'RETURN CODE FROM RECOVERY ROUTINE-'                 03976000
RECUR    DC    CL17'RECURSION DURING '                                  03977000
RMPLMSG1 DC    CL16'TASK TERMINATION'                                   03978000
RT2BSUM  DC    CL23'RTM2WA BIT FLAG SUMMARY'                            03979000
RT2FMT   DC    CL120'*** FORMATTING SERVICE ROUTINE ERROR DURING RTM2WAC03980000
                FORMATTING (POSSIBLE CAUSE: DATA NOT IN DUMP) ***'      03981000
RT2HDR   DC    CL54'-RTM2WA-----------------------------------AT LOCATIC03982000
               ON '                                                     03983000
RT2SMHDR DC    CL14'RTM2WA SUMMARY'                                     03984000
RT2US    DC    CL7' ------'                                             03985000
SDWAFMT  DC    CL120'*** FORMATTING SERVICE ROUTINE ERROR DURING SDWA FC03986000
               ORMATTING (POSSIBLE CAUSE: DATA NOT IN DUMP) ***'        03987000
SDWAHDR  DC    CL42'REGISTERS TAKEN FROM THE SDWA AT LOCATION '         03988000
BLANKS   DC    CL120' '                                                 03989000
EXITMSG  DC    CL34'FIELD CONTAINS INTERNAL EXIT FLAGS'                 03990000
RTSTART  DC    CL17'RTM1 ENTERED FOR '                                  03991000
SYSTATE  DC    CL13'SYSTEM STATE:'                                      03992000
RT2PATCH DC    CL200'PATCH AREA FOR IEAFTRT2 - IT IS 200 BYTES LONG'    03993000
         DS    CL3                                                      03994000
RTM2NAME DC    AL4(RTM2FMT1)                                            03995000
         DC    AL4(RTM2FMT2)                                            03996000
         DC    AL4(RTM2FMT3)                                            03997000
         DC    AL4(RTM2FMT4)                                            03998000
         DC    AL4(RTM2FMT5)                                            03999000
         DC    AL4(RTM2FMT6)                                            04000000
         DC    AL4(RTM2FMT7)                                            04001000
         DC    AL4(RTM2FMT8)                                            04002000
         DC    AL4(RTM2FT9)                                             04003000
         DC    AL4(RTM2FT10)                                            04004000
         DC    AL4(RTM2FT11)                                            04005000
         DC    AL4(RTM2FT12)                                            04006000
         DC    AL4(RTM2FT13)                                            04007000
         DC    AL4(RTM2FT14)                                            04008000
         DC    AL4(RTM2FT15)                                            04009000
         DC    AL4(RTM2FT16)                                            04010000
         DC    AL4(RTM2FT17)                                            04011000
         DC    AL4(RTM2FT18)                                            04012000
         DC    AL4(RTM2FT19)                                            04013000
         DC    AL4(RTM2FT20)                                            04014000
SUMNAMES DC    AL4(SUMFMT1)                                             04015000
         DC    AL4(SUMFMT2)                                             04016000
         DC    AL4(SUMFMT3)                                             04017000
         DC    AL4(SUMFMT4)                                             04018000
         DC    AL4(SUMFMT5)                                             04019000
         DC    AL4(SUMFMT6)                                             04020000
         DC    AL4(SUMFMT7)                                             04021000
         DC    AL4(SUMFMT8)                                             04022000
         DC    AL4(SUMFMT9)                                             04023000
         DC    AL4(SUMFMT10)                                            04024000
         DC    AL4(SUMFMT11)                                            04025000
         DC    AL4(SUMFMT12)                                            04026000
         DC    AL4(SUMFMT13)                                            04027000
         DC    AL4(SUMFMT14)                                            04028000
         DC    AL4(SUMFMT15)                                            04029000
         DC    AL4(SUMFMT16)                                            04030000
         DC    AL4(SUMFMT17)                                            04031000
         DC    AL4(SUMFMT18)                                            04032000
         DC    AL4(SUMFMT19)                                            04033000
         DC    AL4(SUMFMT20)                                            04034000
         DC    AL4(SUMFMT21)                                            04035000
FIELDARY DC    AL4(RTM2CODE)                                            04036000
         DC    AL4(RTM2ABNM)                                            04037000
         DC    AL4(RTM2ABEP)                                            04038000
         DC    AL4(RTM2EREG)                                            04039000
         DC    AL4(RTM2EREG+32)                                         04040000
         DC    AL4(RTM2APSW)                                            04041000
         DC    AL4(RTM2COMP)                                            04042000
         DC    AL4(RTM2RTYA)                                            04043000
         DC    AL4(RTM2RYRB)                                            04044000
         DC    AL4(RTM2CVT)                                             04045000
         DC    AL4(RTM2CT)                                              04046000
         DC    AL4(RTM2SCBS)                                            04047000
         DC    AL4(RTM2RTCA)                                            04048000
         DC    AL4(RTM2VRBC)                                            04049000
         DC    AL4(RTM2PREV)                                            04050000
         DC    AL4(RTM2PRWA)                                            04051000
         DC    AL4(RTM2FMID)                                            04052000
         DC    AL4(RTM2ERAS)                                            04053000
         DC    AL4(RTM2TRCU)                                            04054000
         DC    AL4(RTM2TRFS)                                            04055000
         DC    AL4(RTM2TRLS)                                            04056000
RT2ARRAY DC    F'8'                                                     04057000
         DC    F'7'                                                     04058000
         DC    F'21'                                                    04059000
         DC    F'9'                                                     04060000
         DC    F'8'                                                     04061000
         DC    F'8'                                                     04062000
         DC    F'4'                                                     04063000
         DC    F'10'                                                    04064000
         DC    F'21'                                                    04065000
         DC    F'3'                                                     04066000
         DC    F'21'                                                    04067000
         DC    F'11'                                                    04068000
         DC    F'7'                                                     04069000
         DC    F'10'                                                    04070000
         DC    F'21'                                                    04071000
         DC    F'8'                                                     04072000
         DC    F'8'                                                     04073000
         DC    F'3'                                                     04074000
         DC    F'21'                                                    04075000
         DC    F'12'                                                    04076000
         DC    F'5'                                                     04077000
         DC    F'21'                                                    04078000
         DC    F'13'                                                    04079000
         DC    F'8'                                                     04080000
         DC    F'10'                                                    04081000
         DC    F'21'                                                    04082000
         DC    F'8'                                                     04083000
         DC    F'8'                                                     04084000
         DC    F'21'                                                    04085000
         DC    F'14'                                                    04086000
         DC    F'8'                                                     04087000
         DC    F'8'                                                     04088000
         DC    F'2'                                                     04089000
         DC    F'10'                                                    04090000
         DC    F'21'                                                    04091000
         DC    F'8'                                                     04092000
         DC    F'6'                                                     04093000
         DC    F'21'                                                    04094000
         DC    F'15'                                                    04095000
         DC    F'8'                                                     04096000
         DC    F'8'                                                     04097000
         DC    F'21'                                                    04098000
         DC    F'16'                                                    04099000
         DC    F'8'                                                     04100000
         DC    F'8'                                                     04101000
         DC    F'2'                                                     04102000
         DC    F'21'                                                    04103000
         DC    F'17'                                                    04104000
         DC    F'8'                                                     04105000
         DC    F'8'                                                     04106000
         DC    F'2'                                                     04107000
         DC    F'10'                                                    04108000
         DC    F'21'                                                    04109000
         DC    F'1'                                                     04110000
         DC    F'21'                                                    04111000
         DC    F'18'                                                    04112000
         DC    F'6'                                                     04113000
         DC    F'21'                                                    04114000
         DC    F'19'                                                    04115000
         DC    F'8'                                                     04116000
         DC    F'8'                                                     04117000
         DC    F'21'                                                    04118000
         DC    F'20'                                                    04119000
         DC    F'8'                                                     04120000
         DC    F'8'                                                     04121000
         DC    F'2'                                                     04122000
         DC    F'21'                                                    04123000
         DC    F'102'                                                   04124000
CTLRMSG  DC    CL29'RECURSIVE ENTRY'                                    04125000
         DC    CL29'RETRY REQUESTED BY EXIT'                            04126000
         DC    CL29'LAST TASK ENDED'                                    04127000
         DC    CL29'STORAGE RANGES WRAPPED AROUND'                      04128000
         DC    CL29' '                                                  04129000
         DC    CL29' '                                                  04130000
         DC    CL29' '                                                  04131000
         DC    CL29' '                                                  04132000
ERRAMSG  DC    CL37'MACHINE CHECK'                                      04133000
         DC    CL37'PROGRAM CHECK'                                      04134000
         DC    CL37'CONSOLE RESTART'                                    04135000
         DC    CL37'TASK ISSUED SVC 13'                                 04136000
         DC    CL37'ENTRY TO RTM2 VIA ABTERM'                           04137000
         DC    CL37'SVC ISSUED BY A LOCKED OR SRB ROUTINE'              04138000
         DC    CL37'UNRECOVERABLE TRANSLATION FAILURE'                  04139000
         DC    CL37'PAGE I/O ERROR'                                     04140000
ERRBMSG  DC    CL57' '                                                  04141000
         DC    CL57' '                                                  04142000
         DC    CL57' '                                                  04143000
         DC    CL57' '                                                  04144000
         DC    CL57'TYPE 1 SVC IN CONTROL AT ERROR'                     04145000
         DC    CL57'ENABLED RB IN CONTROL AT ERROR'                     04146000
         DC    CL57'LOCKED OR PHYSICALLY DISABLED ROUTINE IN CONTROL ATC04147000
                ERROR'                                                  04148000
         DC    CL57'SYSTEM IN SRB MODE AT ERROR'                        04149000
ERRDMSG  DC    CL47'ONLY CLEAN UP-NOT RETRY'                            04150000
         DC    CL47'RB OF THIS ESTA NOT IN CONTROL AT ERROR'            04151000
         DC    CL47'THIS ESTA EXIT ENTERED FOR PREVIOUS ABEND'          04152000
         DC    CL47'ANOTHER TASK IN JOBSTEP REQUESTED STEP ABEND'       04153000
         DC    CL47'ANCESTOR OF THIS TASK ABENDED'                      04154000
         DC    CL47'REGS AND PSW AT TIME OF ERROR ARE NOT AVAILABLE'    04155000
         DC    CL47'MACHINE CHECK INFORMATION UNAVAILABLE'              04156000
         DC    CL47'ERROR ID INFORMATION AVAILABLE'                     04157000
FLAGSMSG DC    CL40'FOR RECURSION'                                      04158000
         DC    CL40'VIA ABTERM'                                         04159000
         DC    CL40'FOR PURGE ONLY(ANCESTOR OF TASK ABENDED)'           04160000
         DC    CL40'FOR CONVERT TO STEP'                                04161000
         DC    CL40'FOR NORMAL END OF TASK'                             04162000
         DC    CL40'FOR TASK TERMINATION'                               04163000
         DC    CL40'FOR VALID END OF MEMORY'                            04164000
         DC    CL40' '                                                  04165000
RECURMSG DC    CL31'GETMAIN'                                            04166000
         DC    CL31'SDUMP'                                              04167000
         DC    CL31'INITIALIZATION'                                     04168000
         DC    CL31'ACQUIRING LOCK'                                     04169000
         DC    CL31'RTM2 TO STOP FURTHER PROCESSING'                    04170000
         DC    CL31'CHECK FOR RECURSION'                                04171000
         DC    CL31'SLIP PROCESSING'                                    04172000
         DC    CL31' '                                                  04173000
RMPLMSG  DC    CL46'ABNORMAL TERMINATION'                               04174000
         DC    CL46'MEMORY TERMINATION'                                 04175000
         DC    CL46'RB RELATED PURGE'                                   04176000
         DC    CL46'INHIBITING PAGE UNFIXES'                            04177000
         DC    CL46'TASK RECOVERY OF RTM2 IS CALLER'                    04178000
         DC    CL46'TERMINATING TASK IS JOBSTEP'                        04179000
         DC    CL46'TYPE 1 MESSAGE TABLE ENTRIES ARE TO BE WRITTEN'     04180000
         DC    CL46' '                                                  04181000
MODEMSG  DC    CL25'SUPERVISOR CONTROL MODE'                            04182000
         DC    CL25'PHYSICALLY DISABLED STATE'                          04183000
         DC    CL25'GLOBAL SPIN LOCK HELD'                              04184000
         DC    CL25'GLOBAL SUSPEND LOCK HELD'                           04185000
         DC    CL25'LOCALLY LOCKED MODE'                                04186000
         DC    CL25'TYPE 1 SVC MODE'                                    04187000
         DC    CL25'SRB MODE'                                           04188000
         DC    CL25'TASK MODE'                                          04189000
RTARRAY  DC    CL50'PROGRAM CHECK'                                      04190000
         DC    CL50'RESTART'                                            04191000
         DC    CL50'SVC ERROR'                                          04192000
         DC    CL50'DAT ERROR'                                          04193000
         DC    CL50'MACHINE CHECK REENTRY'                              04194000
         DC    CL50'RESCHEDULE OF PAGE I/O ERROR'                       04195000
         DC    CL50'RESCHEDULE OF ABNORMAL TERMINATION'                 04196000
         DC    CL50'RESCHEDULE OF ABNORMAL TERMINATION THROUGH CVTBTRM' 04197000
         DC    CL50'RESCHEDULE OF CROSS MEMORY ABNORMAL TERMINATION'    04198000
         DC    CL50'RESCHEDULE OF ABNORMAL TERMINATION OF CURRENT TCB'  04199000
         DC    CL50'MEMORY TERMINATION'                                 04200000
         DC    CL50'CROSS MEMORY ABNORMAL TERMINATION'                  04201000
         DC    CL50'RESCHEDULE OF RTM1 ON OTHER CPU'                    04202000
         DC    CL50'MACHINE CHECK'                                      04203000
TESTBITS DC    X'80'                                                    04204000
         DC    X'40'                                                    04205000
         DC    X'20'                                                    04206000
         DC    X'10'                                                    04207000
         DC    X'08'                                                    04208000
         DC    X'04'                                                    04209000
         DC    X'02'                                                    04210000
         DC    X'01'                                                    04211000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       04212000
@01      EQU   01                                                       04213000
@02      EQU   02                                                       04214000
@03      EQU   03                                                       04215000
@04      EQU   04                                                       04216000
@05      EQU   05                                                       04217000
@06      EQU   06                                                       04218000
@07      EQU   07                                                       04219000
@08      EQU   08                                                       04220000
@09      EQU   09                                                       04221000
@10      EQU   10                                                       04222000
@11      EQU   11                                                       04223000
@12      EQU   12                                                       04224000
@13      EQU   13                                                       04225000
@14      EQU   14                                                       04226000
@15      EQU   15                                                       04227000
LNGTHEQU EQU   @05                                                      04228000
INDEX    EQU   @07                                                      04229000
CONVRT   EQU   @07                                                      04230000
FIELDADR EQU   @07                                                      04231000
DATAPTR  EQU   @06                                                      04232000
ARRAYCNT EQU   @05                                                      04233000
SDWAPTR  EQU   @05                                                      04234000
RTM2PTR  EQU   @08                                                      04235000
RBSECPTR EQU   @05                                                      04236000
ABDPLPTR EQU   @01                                                      04237000
LINEPTR  EQU   @00                                                      04238000
VADR     EQU   @00                                                      04239000
RCREG    EQU   @15                                                      04240000
ABDPL    EQU   0                                                        04241000
ADPLFLAG EQU   ABDPL+7                                                  04242000
ADPLSNPR EQU   ADPLFLAG                                                 04243000
ADPLBUF  EQU   ABDPL+8                                                  04244000
ADPLPRNT EQU   ABDPL+12                                                 04245000
ADPLCVT  EQU   ABDPL+16                                                 04246000
ADPLMEMA EQU   ABDPL+20                                                 04247000
ADPLFRMT EQU   ABDPL+24                                                 04248000
ADPLCOM1 EQU   ABDPL+28                                                 04249000
ADPLCOM2 EQU   ABDPL+32                                                 04250000
ADPLFMT1 EQU   ABDPL+44                                                 04251000
ADPLFMT2 EQU   ABDPL+48                                                 04252000
CVTMAP   EQU   0                                                        04253000
CVTBTERM EQU   CVTMAP+52                                                04254000
CVTDAR   EQU   CVTMAP+72                                                04255000
CVTFLGS1 EQU   CVTDAR                                                   04256000
CVTDCB   EQU   CVTMAP+116                                               04257000
CVTIERLC EQU   CVTMAP+144                                               04258000
CVTOPTA  EQU   CVTMAP+182                                               04259000
CVTOPTB  EQU   CVTMAP+183                                               04260000
CVTGTF   EQU   CVTMAP+236                                               04261000
CVTGTFST EQU   CVTGTF                                                   04262000
CVTGTFS  EQU   CVTGTFST                                                 04263000
CVTSTATE EQU   CVTGTFST                                                 04264000
CVTTMODE EQU   CVTGTFST                                                 04265000
CVTFORM  EQU   CVTGTFST                                                 04266000
CVTAQAVT EQU   CVTMAP+240                                               04267000
CVTTCMFG EQU   CVTAQAVT                                                 04268000
CVTVOLM2 EQU   CVTMAP+244                                               04269000
CVTTATA  EQU   CVTVOLM2                                                 04270000
CVTTSKS  EQU   CVTTATA                                                  04271000
CVTVOLF2 EQU   CVTTSKS                                                  04272000
CVTTAT   EQU   CVTTATA+1                                                04273000
CVTATER  EQU   CVTMAP+248                                               04274000
CVTEXT1  EQU   CVTMAP+252                                               04275000
CVTPURG  EQU   CVTMAP+260                                               04276000
CVTQMSG  EQU   CVTMAP+268                                               04277000
CVTDMSR  EQU   CVTMAP+272                                               04278000
CVTRSV37 EQU   CVTDMSR                                                  04279000
CVTDMSRF EQU   CVTRSV37                                                 04280000
CVTERPV  EQU   CVTMAP+316                                               04281000
CVTINTLA EQU   CVTMAP+320                                               04282000
CVTAPF   EQU   CVTMAP+324                                               04283000
CVTEXT2  EQU   CVTMAP+328                                               04284000
CVTHJES  EQU   CVTMAP+332                                               04285000
CVTPGSIA EQU   CVTMAP+348                                               04286000
CVTA1F1  EQU   CVTMAP+356                                               04287000
CVTSYSK  EQU   CVTMAP+357                                               04288000
CVTVOLM1 EQU   CVTMAP+380                                               04289000
CVTVOLF1 EQU   CVTVOLM1                                                 04290000
CVTXTNT1 EQU   0                                                        04291000
CVTXTNT2 EQU   0                                                        04292000
CVTDSSV  EQU   CVTXTNT2                                                 04293000
CVTFLGBT EQU   CVTXTNT2+5                                               04294000
CVTQID   EQU   CVTXTNT2+24                                              04295000
CVTRV400 EQU   CVTXTNT2+52                                              04296000
CVTRV409 EQU   CVTXTNT2+53                                              04297000
CVTATCVT EQU   CVTXTNT2+64                                              04298000
CVTRV429 EQU   CVTXTNT2+84                                              04299000
CVTRV438 EQU   CVTXTNT2+85                                              04300000
CVTRV457 EQU   CVTXTNT2+112                                             04301000
CVTRV466 EQU   CVTXTNT2+113                                             04302000
CVTFIX   EQU   0                                                        04303000
CVTRELNO EQU   CVTFIX+252                                               04304000
CVTNUMB  EQU   CVTRELNO                                                 04305000
RTM2ESA  EQU   0                                                        04306000
ESAREGS  EQU   RTM2ESA                                                  04307000
ESAR1    EQU   ESAREGS+4                                                04308000
ESACCF1  EQU   ESAR1                                                    04309000
ESART2D  EQU   RTM2ESA+36                                               04310000
ESAFLAGS EQU   RTM2ESA+40                                               04311000
ESARFLAG EQU   RTM2ESA+41                                               04312000
ESAERTYP EQU   RTM2ESA+42                                               04313000
ESAMODE  EQU   RTM2ESA+43                                               04314000
ESACMP   EQU   RTM2ESA+44                                               04315000
ESACCF   EQU   ESACMP                                                   04316000
RBPRFX   EQU   0                                                        04317000
RBBASIC  EQU   0                                                        04318000
RBEXRTNM EQU   RBBASIC                                                  04319000
RBTMFLD  EQU   RBEXRTNM                                                 04320000
RBSTAB   EQU   RBBASIC+10                                               04321000
XSTAB    EQU   RBSTAB                                                   04322000
RBSTAB1  EQU   XSTAB                                                    04323000
XSTAB1   EQU   RBSTAB1                                                  04324000
RBFTCKPT EQU   XSTAB1                                                   04325000
RBSTAB2  EQU   XSTAB+1                                                  04326000
XSTAB2   EQU   RBSTAB2                                                  04327000
RBTCBNXT EQU   XSTAB2                                                   04328000
RBFACTV  EQU   XSTAB2                                                   04329000
RBFDYN   EQU   XSTAB2                                                   04330000
RBECBWT  EQU   XSTAB2                                                   04331000
RBOPSW   EQU   RBBASIC+16                                               04332000
XRBPSW   EQU   RBOPSW                                                   04333000
RBOPSWB2 EQU   XRBPSW+1                                                 04334000
RBLINK   EQU   RBBASIC+28                                               04335000
XRBLNK   EQU   RBLINK                                                   04336000
RBWCF    EQU   XRBLNK                                                   04337000
RBLINKB  EQU   XRBLNK+1                                                 04338000
RBGRSAVE EQU   RBBASIC+32                                               04339000
XRBREG   EQU   RBGRSAVE                                                 04340000
RBGRS0   EQU   XRBREG                                                   04341000
RBGRS1   EQU   XRBREG+4                                                 04342000
RBGRS2   EQU   XRBREG+8                                                 04343000
RBGRS3   EQU   XRBREG+12                                                04344000
RBGRS4   EQU   XRBREG+16                                                04345000
RBGRS5   EQU   XRBREG+20                                                04346000
RBGRS6   EQU   XRBREG+24                                                04347000
RBGRS7   EQU   XRBREG+28                                                04348000
RBGRS8   EQU   XRBREG+32                                                04349000
RBGRS9   EQU   XRBREG+36                                                04350000
RBGRS10  EQU   XRBREG+40                                                04351000
RBGRS11  EQU   XRBREG+44                                                04352000
RBGRS12  EQU   XRBREG+48                                                04353000
RBGRS13  EQU   XRBREG+52                                                04354000
RBGRS14  EQU   XRBREG+56                                                04355000
RBGRS15  EQU   XRBREG+60                                                04356000
XRBESA   EQU   RBBASIC+96                                               04357000
RBEXSAVE EQU   XRBESA                                                   04358000
RBPREFIX EQU   0                                                        04359000
RBRSV019 EQU   RBPREFIX+14                                              04360000
RBRSV028 EQU   RBPREFIX+15                                              04361000
RBRSV041 EQU   RBPREFIX+27                                              04362000
RBRSV054 EQU   RBPREFIX+39                                              04363000
RBRTOPSW EQU   RBPREFIX+40                                              04364000
RBRTPSW2 EQU   RBRTOPSW+8                                               04365000
RBRTICIL EQU   RBRTPSW2                                                 04366000
RBFLAGS1 EQU   RBPREFIX+56                                              04367000
RBINTCDA EQU   RBPREFIX+61                                              04368000
RBSECT   EQU   0                                                        04369000
RBPPSAV  EQU   RBSECT                                                   04370000
@NM00019 EQU   RBSECT+10                                                04371000
@NM00020 EQU   @NM00019                                                 04372000
RBTRSVRB EQU   @NM00020                                                 04373000
@NM00022 EQU   @NM00019+1                                               04374000
RBETXR   EQU   @NM00022                                                 04375000
RBEP     EQU   RBSECT+12                                                04376000
RBPGMQ   EQU   RBSECT+24                                                04377000
@NM00029 EQU   RBSECT+28                                                04378000
@NM00030 EQU   @NM00029                                                 04379000
IRBEND   EQU   RBSECT+96                                                04380000
@NM00033 EQU   RBSECT+96                                                04381000
RBRSV138 EQU   @NM00033+7                                               04382000
RBSCBB   EQU   RBSECT+144                                               04383000
RBSPARM  EQU   RBSCBB+8                                                 04384000
RBSFLGS1 EQU   RBSPARM                                                  04385000
RBSIOPRC EQU   RBSFLGS1                                                 04386000
RBSOWNR  EQU   RBSCBB+12                                                04387000
RBSFLGS2 EQU   RBSOWNR                                                  04388000
RBSDATA  EQU   RBSCBB+16                                                04389000
RBSFLG3  EQU   RBSDATA                                                  04390000
RBRSV150 EQU   RBSECT+167                                               04391000
SNPPARMS EQU   0                                                        04392000
SNPFLAG  EQU   SNPPARMS+1                                               04393000
SNPSDATA EQU   SNPPARMS+4                                               04394000
SNPSDAT0 EQU   SNPSDATA                                                 04395000
SNPSDAT1 EQU   SNPSDATA+1                                               04396000
SNPPDATA EQU   SNPPARMS+6                                               04397000
RMPL     EQU   0                                                        04398000
RMPLFLG1 EQU   RMPL                                                     04399000
RTM2WA   EQU   0                                                        04400000
RTM2DESC EQU   RTM2WA                                                   04401000
RTM2RT2D EQU   RTM2DESC+8                                               04402000
RTM2CVT  EQU   RTM2WA+12                                                04403000
RTM2VRBC EQU   RTM2WA+20                                                04404000
RTM2CODE EQU   RTM2WA+28                                                04405000
RTM2CCF  EQU   RTM2CODE                                                 04406000
RTM2CT   EQU   RTM2WA+56                                                04407000
RTM2PGCY EQU   RTM2WA+60                                                04408000
RTM2TRRY EQU   RTM2PGCY                                                 04409000
RTM2EEDR EQU   RTM2TRRY                                                 04410000
RTM2EREG EQU   RTM2EEDR                                                 04411000
RTM2APSW EQU   RTM2EEDR+64                                              04412000
RTM2EPSW EQU   RTM2APSW                                                 04413000
RTM2EMK1 EQU   RTM2EPSW                                                 04414000
RTM2MWP1 EQU   RTM2EPSW+1                                               04415000
RTM2INT1 EQU   RTM2EPSW+2                                               04416000
RTM2NXT1 EQU   RTM2EPSW+4                                               04417000
RTM2AEC1 EQU   RTM2APSW+8                                               04418000
RTM2ILC1 EQU   RTM2AEC1+1                                               04419000
RTM2INC1 EQU   RTM2AEC1+2                                               04420000
RTM2ICD1 EQU   RTM2INC1+1                                               04421000
RTM2ABNM EQU   RTM2TRRY+80                                              04422000
RTM2ABEP EQU   RTM2TRRY+88                                              04423000
RTM2EEDH EQU   RTM2TRRY+92                                              04424000
RTM2STCK EQU   RTM2EEDH                                                 04425000
RTM2MCHI EQU   RTM2EEDH+8                                               04426000
RTM2MCHS EQU   RTM2MCHI                                                 04427000
RTM2MCHD EQU   RTM2MCHI+1                                               04428000
RTM2RSR1 EQU   RTM2EEDH+12                                              04429000
RTM2RSR2 EQU   RTM2EEDH+13                                              04430000
RTM2FLGS EQU   RTM2TRRY+120                                             04431000
RTM2ERRA EQU   RTM2FLGS                                                 04432000
RTM2ERRB EQU   RTM2FLGS+1                                               04433000
RTM2ERRC EQU   RTM2FLGS+2                                               04434000
RTM2ERRD EQU   RTM2FLGS+3                                               04435000
RTM2FMID EQU   RTM2TRRY+124                                             04436000
RTM2CVER EQU   RTM2WA+186                                               04437000
RTM2TRRC EQU   RTM2CVER                                                 04438000
RTM2IOFS EQU   RTM2TRRC                                                 04439000
RTM2IOBP EQU   RTM2TRRC+2                                               04440000
RTM2SCBS EQU   RTM2TRRC+14                                              04441000
RTM2RTCD EQU   RTM2TRRC+26                                              04442000
RTM2RTCA EQU   RTM2RTCD                                                 04443000
RTM2SPLL EQU   RTM2RTCD+4                                               04444000
RTM2COMP EQU   RTM2TRRC+34                                              04445000
RTM2RTYA EQU   RTM2TRRC+38                                              04446000
RTM2RYRB EQU   RTM2TRRC+42                                              04447000
RTM2PARQ EQU   RTM2TRRC+46                                              04448000
RTM2RCDE EQU   RTM2PARQ                                                 04449000
RTM2CTL1 EQU   RTM2CVER+50                                              04450000
RTM2CMKA EQU   RTM2CTL1                                                 04451000
RTM2MWPA EQU   RTM2CTL1+1                                               04452000
RTM2PMKA EQU   RTM2CTL1+4                                               04453000
RTM2CTL2 EQU   RTM2CVER+58                                              04454000
RTM2CMKP EQU   RTM2CTL2                                                 04455000
RTM2MWPP EQU   RTM2CTL2+1                                               04456000
RTM2PMKP EQU   RTM2CTL2+4                                               04457000
RTM2SNAP EQU   RTM2CVER+66                                              04458000
RTM2SPRM EQU   RTM2SNAP+4                                               04459000
RTM2DPSL EQU   RTM2SNAP+24                                              04460000
RTM2FRM1 EQU   RTM2DPSL                                                 04461000
RTM2TO1  EQU   RTM2DPSL+4                                               04462000
RTM2FRM2 EQU   RTM2DPSL+8                                               04463000
RTM2TO2  EQU   RTM2DPSL+12                                              04464000
RTM2FRM3 EQU   RTM2DPSL+16                                              04465000
RTM2TO3  EQU   RTM2DPSL+20                                              04466000
RTM2FRM4 EQU   RTM2DPSL+24                                              04467000
RTM2TO4  EQU   RTM2DPSL+28                                              04468000
RTM2SECB EQU   RTM2CVER+138                                             04469000
RTM2ECBA EQU   RTM2SECB                                                 04470000
RTM2PREV EQU   RTM2CVER+178                                             04471000
RTM2PRWA EQU   RTM2CVER+182                                             04472000
RTM2SFRG EQU   RTM2CVER+186                                             04473000
RTM2SCTL EQU   RTM2CVER+259                                             04474000
RTM2CCTL EQU   RTM2SCTL                                                 04475000
RTM2ABDR EQU   RTM2SCTL+4                                               04476000
RTM2ABID EQU   RTM2ABDR                                                 04477000
RTM2ABND EQU   RTM2ABDR+1                                               04478000
RTM2RCTL EQU   RTM2SCTL+6                                               04479000
RTM2INTF EQU   RTM2CVER+266                                             04480000
RTM2CTLR EQU   RTM2INTF                                                 04481000
RTM2TSKT EQU   RTM2INTF+2                                               04482000
RTM2ABDP EQU   RTM2INTF+4                                               04483000
RTM2ASIR EQU   RTM2INTF+5                                               04484000
RTM2FLX  EQU   RTM2INTF+6                                               04485000
RTM2FLX1 EQU   RTM2FLX                                                  04486000
RTM2FLX2 EQU   RTM2FLX+1                                                04487000
RTM2RECL EQU   RTM2CVER+274                                             04488000
RTM2DCTL EQU   RTM2RECL+12                                              04489000
RTM2ECTL EQU   RTM2RECL+13                                              04490000
RTM2TRYR EQU   RTM2RECL+16                                              04491000
RTM2TRF1 EQU   RTM2TRYR                                                 04492000
RTM2TRF2 EQU   RTM2TRYR+2                                               04493000
RTM2RECH EQU   RTM2CVER+294                                             04494000
RTM2RRG  EQU   RTM2CVER+314                                             04495000
RTM2CRG  EQU   RTM2CVER+378                                             04496000
RTM2RMIN EQU   RTM2WA+708                                               04497000
RTM2RMPL EQU   RTM2RMIN+4                                               04498000
RTM2RMWA EQU   RTM2RMIN+28                                              04499000
RTM2ERID EQU   RTM2WA+872                                               04500000
RTM2ERAS EQU   RTM2ERID+4                                               04501000
RTM2ENSN EQU   RTM2WA+884                                               04502000
RTM2SNLN EQU   RTM2ENSN                                                 04503000
RTM2TRCU EQU   RTM2ENSN+8                                               04504000
RTM2TRFS EQU   RTM2ENSN+12                                              04505000
RTM2TRLS EQU   RTM2ENSN+16                                              04506000
RTM2RYRG EQU   RTM2WA+904                                               04507000
STORAGE  EQU   0                                                        04508000
STORFRM  EQU   STORAGE                                                  04509000
STORTO   EQU   STORAGE+4                                                04510000
RT1TRACK EQU   0                                                        04511000
RT1TRECC EQU   RT1TRACK                                                 04512000
RT1TACQR EQU   RT1TRECC+3                                               04513000
RTMBRTAB EQU   0                                                        04514000
RTMBTERM EQU   RTMBRTAB                                                 04515000
MODEBYTE EQU   0                                                        04516000
EED      EQU   0                                                        04517000
EEDDES   EQU   EED+4                                                    04518000
EEDFLAGS EQU   EEDDES+1                                                 04519000
EEDERROR EQU   EED+8                                                    04520000
EEDVARBL EQU   EED+12                                                   04521000
SDWA     EQU   0                                                        04522000
SDWAFIOB EQU   SDWA+4                                                   04523000
SDWAABCC EQU   SDWAFIOB                                                 04524000
SDWACMPF EQU   SDWAABCC                                                 04525000
SDWACTL1 EQU   SDWA+8                                                   04526000
SDWACMKA EQU   SDWACTL1                                                 04527000
SDWAMWPA EQU   SDWACTL1+1                                               04528000
SDWAPMKA EQU   SDWACTL1+4                                               04529000
SDWACTL2 EQU   SDWA+16                                                  04530000
SDWACMKP EQU   SDWACTL2                                                 04531000
SDWAMWPP EQU   SDWACTL2+1                                               04532000
SDWAPMKP EQU   SDWACTL2+4                                               04533000
SDWAGRSV EQU   SDWA+24                                                  04534000
SDWANAME EQU   SDWA+88                                                  04535000
SDWAEC1  EQU   SDWA+104                                                 04536000
SDWAEMK1 EQU   SDWAEC1                                                  04537000
SDWAMWP1 EQU   SDWAEC1+1                                                04538000
SDWAINT1 EQU   SDWAEC1+2                                                04539000
SDWANXT1 EQU   SDWAEC1+4                                                04540000
SDWAAEC1 EQU   SDWA+112                                                 04541000
SDWAILC1 EQU   SDWAAEC1+1                                               04542000
SDWAINC1 EQU   SDWAAEC1+2                                               04543000
SDWAICD1 EQU   SDWAINC1+1                                               04544000
SDWAEC2  EQU   SDWA+120                                                 04545000
SDWAEMK2 EQU   SDWAEC2                                                  04546000
SDWAMWP2 EQU   SDWAEC2+1                                                04547000
SDWAINT2 EQU   SDWAEC2+2                                                04548000
SDWANXT2 EQU   SDWAEC2+4                                                04549000
SDWAAEC2 EQU   SDWA+128                                                 04550000
SDWAILC2 EQU   SDWAAEC2+1                                               04551000
SDWAINC2 EQU   SDWAAEC2+2                                               04552000
SDWAICD2 EQU   SDWAINC2+1                                               04553000
SDWASRSV EQU   SDWA+136                                                 04554000
SDWAIDNT EQU   SDWA+200                                                 04555000
SDWAMCH  EQU   SDWA+204                                                 04556000
SDWASTCK EQU   SDWAMCH                                                  04557000
SDWAMCHI EQU   SDWAMCH+8                                                04558000
SDWAMCHS EQU   SDWAMCHI                                                 04559000
SDWAMCHD EQU   SDWAMCHI+1                                               04560000
SDWARSR1 EQU   SDWAMCH+12                                               04561000
SDWARSR2 EQU   SDWAMCH+13                                               04562000
SDWAFLGS EQU   SDWA+232                                                 04563000
SDWAERRA EQU   SDWAFLGS                                                 04564000
SDWAERRB EQU   SDWAFLGS+1                                               04565000
SDWAERRC EQU   SDWAFLGS+2                                               04566000
SDWAERRD EQU   SDWAFLGS+3                                               04567000
SDWAIOFS EQU   SDWA+238                                                 04568000
SDWACPUA EQU   SDWA+248                                                 04569000
SDWAPARQ EQU   SDWA+252                                                 04570000
SDWAACF2 EQU   SDWAPARQ+1                                               04571000
SDWAACF3 EQU   SDWAPARQ+2                                               04572000
SDWAACF4 EQU   SDWAPARQ+3                                               04573000
SDWALKWA EQU   SDWA+256                                                 04574000
SDWALKWS EQU   SDWALKWA                                                 04575000
SDWARECP EQU   SDWA+292                                                 04576000
SDWASNPA EQU   SDWA+320                                                 04577000
SDWADUMP EQU   SDWASNPA                                                 04578000
SDWADPFS EQU   SDWADUMP+1                                               04579000
SDWADDAT EQU   SDWASNPA+4                                               04580000
SDWASDAT EQU   SDWADDAT                                                 04581000
SDWASDA0 EQU   SDWASDAT                                                 04582000
SDWASDA1 EQU   SDWASDAT+1                                               04583000
SDWAPDAT EQU   SDWADDAT+2                                               04584000
SDWADPSA EQU   SDWA+328                                                 04585000
SDWADPSL EQU   SDWADPSA                                                 04586000
SDWARA   EQU   SDWA+400                                                 04587000
SDWADPVA EQU   SDWARA+2                                                 04588000
SUBITS   EQU   0                                                        04589000
SUBYTE1  EQU   SUBITS                                                   04590000
SUBYTE2  EQU   SUBITS+1                                                 04591000
SUBYTE3  EQU   SUBITS+2                                                 04592000
SU17BIT  EQU   SUBYTE3                                                  04593000
SUBYTE4  EQU   SUBITS+3                                                 04594000
SUBYTE5  EQU   SUBITS+4                                                 04595000
SU33BIT  EQU   SUBYTE5                                                  04596000
SUBYTE6  EQU   SUBITS+5                                                 04597000
SUBYTE7  EQU   SUBITS+6                                                 04598000
SUBYTE8  EQU   SUBITS+7                                                 04599000
SUBYTE9  EQU   SUBITS+8                                                 04600000
SUBYTE10 EQU   SUBITS+9                                                 04601000
SUBYTE11 EQU   SUBITS+10                                                04602000
SUBYTE12 EQU   SUBITS+11                                                04603000
SUBYTE13 EQU   SUBITS+12                                                04604000
ACCESS   EQU   0                                                        04605000
FORMAT   EQU   0                                                        04606000
PRINT    EQU   0                                                        04607000
BUFFER   EQU   0                                                        04608000
OFFSET   EQU   BUFFER                                                   04609000
ADDRESS  EQU   BUFFER+55                                                04610000
DATABYTE EQU   0                                                        04611000
DATADWRD EQU   0                                                        04612000
DATAHALF EQU   0                                                        04613000
DATAWORD EQU   0                                                        04614000
ESTAPARM EQU   0                                                        04615000
ESTAERR  EQU   ESTAPARM                                                 04616000
ERREXP   EQU   ESTAERR                                                  04617000
RTYADR   EQU   ESTAPARM+4                                               04618000
RTYREGS  EQU   ESTAPARM+8                                               04619000
LCALREGS EQU   ESTAPARM+72                                              04620000
TITLE    EQU   0                                                        04621000
ENDMSG   EQU   0                                                        04622000
BITSTR   EQU   0                                                        04623000
MSG      EQU   0                                                        04624000
MSGARY   EQU   0                                                        04625000
CVTPTR   EQU   ADPLCVT                                                  04626000
CVTS01   EQU   CVTPGSIA                                                 04627000
CVTLPDIA EQU   CVTS01+12                                                04628000
CVTDIRST EQU   CVTLPDIA                                                 04629000
CVTSLIDA EQU   CVTS01+24                                                04630000
CVTCTLFG EQU   CVTS01+50                                                04631000
CVTRV210 EQU   CVTS01+424                                               04632000
CVTRV219 EQU   CVTS01+425                                               04633000
CVTRV228 EQU   CVTS01+426                                               04634000
CVTRV237 EQU   CVTS01+427                                               04635000
CVTMFRTR EQU   CVTS01+452                                               04636000
CVTRV262 EQU   CVTS01+468                                               04637000
CVTRV271 EQU   CVTS01+469                                               04638000
CVTRV280 EQU   CVTS01+470                                               04639000
CVTRV289 EQU   CVTS01+471                                               04640000
CVTGSDA  EQU   CVTS01+600                                               04641000
CVTIHASU EQU   CVTS01+696                                               04642000
RBSECS03 EQU   RBEP                                                     04643000
RBCDE    EQU   RBSECS03                                                 04644000
RBCDFLGS EQU   RBCDE                                                    04645000
RBSECS05 EQU   RBPGMQ                                                   04646000
RBSQE    EQU   RBSECS05                                                 04647000
RBSECS06 EQU   RBPGMQ                                                   04648000
RBIQE    EQU   RBSECS06                                                 04649000
RBSECS07 EQU   RBPGMQ                                                   04650000
RBIQE2   EQU   RBSECS07                                                 04651000
RBSECS08 EQU   IRBEND                                                   04652000
RBSECS09 EQU   IRBEND                                                   04653000
RT1W     EQU   FRRSRTMW                                                 04654000
RT1WNPRS EQU   RT1W                                                     04655000
RT1WPRSV EQU   RT1W+52                                                  04656000
RT1WENTR EQU   RT1WPRSV+12                                              04657000
RT1WCOVR EQU   RT1WENTR+2                                               04658000
RT1RTRN  EQU   FRRSRTMW                                                 04659000
RT1RTRRG EQU   RT1RTRN+4                                                04660000
EEDREGSP EQU   EEDVARBL                                                 04661000
EEDREGS  EQU   EEDREGSP                                                 04662000
EEDPSW   EQU   EEDREGSP+64                                              04663000
EEDPSW1  EQU   EEDPSW                                                   04664000
EEDPSW2  EQU   EEDPSW+8                                                 04665000
EEDINILC EQU   EEDPSW2                                                  04666000
EEDDUMPO EQU   EEDVARBL                                                 04667000
EEDSCDMP EQU   EEDDUMPO                                                 04668000
EEDSDDAT EQU   EEDSCDMP+4                                               04669000
EEDHWREP EQU   EEDVARBL                                                 04670000
EEDHMCHS EQU   EEDHWREP+8                                               04671000
EEDHMCHD EQU   EEDHWREP+9                                               04672000
EEDHRSRS EQU   EEDHWREP+12                                              04673000
EEDHRSR1 EQU   EEDHRSRS                                                 04674000
EEDHRSR2 EQU   EEDHRSRS+1                                               04675000
EEDERMAP EQU   EEDVARBL                                                 04676000
EEDERRID EQU   EEDERMAP+70                                              04677000
START    EQU   ADPLFMT1                                                 04678000
RT2BSUS  EQU   ESAUS                                                    04679000
RT2SMUS  EQU   ESAUS                                                    04680000
SDWAUS   EQU   ESAUS                                                    04681000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    04682000
EEDETIME EQU   EEDERRID+6                                               04683000
EEDEASID EQU   EEDERRID+4                                               04684000
EEDECPUI EQU   EEDERRID+2                                               04685000
EEDESEQ# EQU   EEDERRID                                                 04686000
@NM00085 EQU   EEDERMAP                                                 04687000
EEDHTIME EQU   EEDHWREP+20                                              04688000
EEDHRFSA EQU   EEDHWREP+16                                              04689000
@NM00084 EQU   EEDHWREP+14                                              04690000
EEDHVERQ EQU   EEDHRSR2                                                 04691000
EEDHPGFX EQU   EEDHRSR2                                                 04692000
EEDHFLSQ EQU   EEDHRSR2                                                 04693000
EEDHFSQA EQU   EEDHRSR2                                                 04694000
EEDHNUCL EQU   EEDHRSR2                                                 04695000
EEDHSPER EQU   EEDHRSR2                                                 04696000
EEDHINTC EQU   EEDHRSR2                                                 04697000
EEDHOFLN EQU   EEDHRSR2                                                 04698000
EEDHCHNG EQU   EEDHRSR1                                                 04699000
EEDHMSER EQU   EEDHRSR1                                                 04700000
@NM00083 EQU   EEDHRSR1                                                 04701000
EEDHCPID EQU   EEDHWREP+10                                              04702000
EEDHTERR EQU   EEDHMCHD                                                 04703000
EEDHSOFT EQU   EEDHMCHD                                                 04704000
EEDHINSF EQU   EEDHMCHD                                                 04705000
EEDHACR  EQU   EEDHMCHD                                                 04706000
EEDHSCK  EQU   EEDHMCHD                                                 04707000
EEDHPSWU EQU   EEDHMCHD                                                 04708000
EEDHREGU EQU   EEDHMCHD                                                 04709000
EEDHSKYF EQU   EEDHMCHD                                                 04710000
@NM00082 EQU   EEDHMCHS                                                 04711000
@NM00081 EQU   EEDHMCHS                                                 04712000
EEDHRSRF EQU   EEDHMCHS                                                 04713000
EEDRSRC  EQU   EEDHMCHS                                                 04714000
EEDINVP  EQU   EEDHMCHS                                                 04715000
EEDHTSVL EQU   EEDHMCHS                                                 04716000
EEDHRCDF EQU   EEDHMCHS                                                 04717000
EEDHSRVL EQU   EEDHMCHS                                                 04718000
EEDHSCKE EQU   EEDHWREP+4                                               04719000
EEDHSCKB EQU   EEDHWREP                                                 04720000
EEDSDPSL EQU   EEDDUMPO+8                                               04721000
EEDSPDAT EQU   EEDSDDAT+2                                               04722000
EEDSSDAT EQU   EEDSDDAT                                                 04723000
EEDSDUMP EQU   EEDSCDMP                                                 04724000
EEDTRANS EQU   EEDPSW2+4                                                04725000
EEDINTCD EQU   EEDINILC+2                                               04726000
EEDILC   EQU   EEDINILC+1                                               04727000
@NM00080 EQU   EEDINILC                                                 04728000
EEDPSWIC EQU   EEDPSW1+4                                                04729000
EEDPSWMK EQU   EEDPSW1                                                  04730000
EEDREG15 EQU   EEDREGS+60                                               04731000
EEDREG14 EQU   EEDREGS+56                                               04732000
EEDREG13 EQU   EEDREGS+52                                               04733000
EEDREG12 EQU   EEDREGS+48                                               04734000
EEDREG11 EQU   EEDREGS+44                                               04735000
EEDREG10 EQU   EEDREGS+40                                               04736000
EEDREG9  EQU   EEDREGS+36                                               04737000
EEDREG8  EQU   EEDREGS+32                                               04738000
EEDREG7  EQU   EEDREGS+28                                               04739000
EEDREG6  EQU   EEDREGS+24                                               04740000
EEDREG5  EQU   EEDREGS+20                                               04741000
EEDREG4  EQU   EEDREGS+16                                               04742000
EEDREG3  EQU   EEDREGS+12                                               04743000
EEDREG2  EQU   EEDREGS+8                                                04744000
EEDREG1  EQU   EEDREGS+4                                                04745000
EEDREG0  EQU   EEDREGS                                                  04746000
RT1RTYAD EQU   RT1RTRRG+60                                              04747000
RT1R0R14 EQU   RT1RTRRG                                                 04748000
@NM00077 EQU   RT1RTRN                                                  04749000
@NM00076 EQU   RT1WENTR+3                                               04750000
@NM00075 EQU   RT1WCOVR                                                 04751000
RT1NODMP EQU   RT1WCOVR                                                 04752000
RT1WEREX EQU   RT1WCOVR                                                 04753000
RT1TRTCA EQU   RT1WCOVR                                                 04754000
RT1TLOCL EQU   RT1WCOVR                                                 04755000
RT1WRTM  EQU   RT1WCOVR                                                 04756000
RT1WCLUP EQU   RT1WCOVR                                                 04757000
RT1WSRMD EQU   RT1WENTR+1                                               04758000
RT1WMODE EQU   RT1WENTR                                                 04759000
RT1WEED  EQU   RT1WPRSV+8                                               04760000
RT1WSRBR EQU   RT1WPRSV+4                                               04761000
RT1WRTCA EQU   RT1WPRSV                                                 04762000
RT1WVARI EQU   RT1WNPRS+32                                              04763000
RT1WPSW2 EQU   RT1WNPRS+28                                              04764000
RT1WPSW1 EQU   RT1WNPRS+24                                              04765000
RT1WLPTA EQU   RT1WNPRS                                                 04766000
RBRSV161 EQU   RBSECS09+64                                              04767000
RBSIRBWA EQU   RBSECS09                                                 04768000
RBIQEWRK EQU   RBSECS08+4                                               04769000
RBNEXAV  EQU   RBSECS08                                                 04770000
RBIQEA   EQU   RBIQE2                                                   04771000
RBIQE1   EQU   RBIQE+1                                                  04772000
RBUSE    EQU   RBIQE                                                    04773000
RBSQEA   EQU   RBSQE+1                                                  04774000
@NM00034 EQU   RBSQE                                                    04775000
RBCDE1   EQU   RBCDE+1                                                  04776000
RBCDLOAD EQU   RBCDFLGS                                                 04777000
RBCDXCTL EQU   RBCDFLGS                                                 04778000
RBCDSYNC EQU   RBCDFLGS                                                 04779000
RBCDNODE EQU   RBCDFLGS                                                 04780000
RBRSV010 EQU   RBCDFLGS                                                 04781000
RBCDATCH EQU   RBCDFLGS                                                 04782000
RBRSV009 EQU   RBCDFLGS                                                 04783000
RBNOCELL EQU   RBCDFLGS                                                 04784000
CVTRV628 EQU   CVTS01+728                                               04785000
CVTRV627 EQU   CVTS01+724                                               04786000
CVTRV626 EQU   CVTS01+720                                               04787000
CVTRV625 EQU   CVTS01+716                                               04788000
CVTRV624 EQU   CVTS01+712                                               04789000
CVTRV623 EQU   CVTS01+708                                               04790000
CVTRV622 EQU   CVTS01+704                                               04791000
CVTRV621 EQU   CVTS01+700                                               04792000
CVTSUSP  EQU   CVTS01+692                                               04793000
CVTT6SVC EQU   CVTS01+688                                               04794000
CVTCDAL  EQU   CVTS01+684                                               04795000
CVTTCTL  EQU   CVTS01+680                                               04796000
CVTRSUME EQU   CVTS01+676                                               04797000
CVTJTERM EQU   CVTS01+672                                               04798000
CVTASMRM EQU   CVTS01+668                                               04799000
CVTTCASP EQU   CVTS01+664                                               04800000
CVT0PT03 EQU   CVTS01+660                                               04801000
CVT0PT0E EQU   CVTS01+656                                               04802000
CVTRV609 EQU   CVTS01+652                                               04803000
CVTCGK   EQU   CVTS01+648                                               04804000
CVTRAC   EQU   CVTS01+644                                               04805000
CVTRV606 EQU   CVTS01+640                                               04806000
CVTRV605 EQU   CVTS01+636                                               04807000
CVTRV604 EQU   CVTS01+632                                               04808000
CVTEFF02 EQU   CVTS01+628                                               04809000
CVTCBBR  EQU   CVTS01+624                                               04810000
CVTSSCR  EQU   CVTS01+620                                               04811000
CVTEVENT EQU   CVTS01+616                                               04812000
CVTCRCA  EQU   CVTS01+612                                               04813000
CVTTPIO  EQU   CVTS01+608                                               04814000
CVTADV   EQU   CVTS01+604                                               04815000
CVTGSDAB EQU   CVTGSDA                                                  04816000
CVTQV3   EQU   CVTS01+596                                               04817000
CVTQV2   EQU   CVTS01+592                                               04818000
CVTQV1   EQU   CVTS01+588                                               04819000
CVTRPT   EQU   CVTS01+584                                               04820000
CVTSSRB  EQU   CVTS01+580                                               04821000
CVTCSDRL EQU   CVTS01+576                                               04822000
CVTEXP1  EQU   CVTS01+572                                               04823000
CVTRMPMT EQU   CVTS01+568                                               04824000
CVTRMPTT EQU   CVTS01+564                                               04825000
CVTVPSA  EQU   CVTS01+560                                               04826000
CVTVSTOP EQU   CVTS01+556                                               04827000
CVTGTFR8 EQU   CVTS01+552                                               04828000
CVTQUIT  EQU   CVTS01+548                                               04829000
CVTVACR  EQU   CVTS01+544                                               04830000
CVTWTCB  EQU   CVTS01+540                                               04831000
CVTSTPRS EQU   CVTS01+536                                               04832000
CVT0PT02 EQU   CVTS01+532                                               04833000
CVTDARCM EQU   CVTS01+528                                               04834000
CVTIRECM EQU   CVTS01+524                                               04835000
CVTJRECM EQU   CVTS01+520                                               04836000
CVTVEMS0 EQU   CVTS01+516                                               04837000
CVTSPFRR EQU   CVTS01+512                                               04838000
CVTRLSTG EQU   CVTS01+508                                               04839000
CVT0TC0A EQU   CVTS01+504                                               04840000
CVTGMBR  EQU   CVTS01+500                                               04841000
CVTLFRM  EQU   CVTS01+496                                               04842000
CVTRMBR  EQU   CVTS01+492                                               04843000
CVTVIOP  EQU   CVTS01+488                                               04844000
CVTRV307 EQU   CVTS01+486                                               04845000
CVTRV306 EQU   CVTS01+484                                               04846000
CVTRV305 EQU   CVTS01+482                                               04847000
CVTRV304 EQU   CVTS01+480                                               04848000
CVTRV303 EQU   CVTS01+478                                               04849000
CVTRV302 EQU   CVTS01+476                                               04850000
CVTTRCA  EQU   CVTS01+472                                               04851000
CVTRV297 EQU   CVTRV289                                                 04852000
CVTRV296 EQU   CVTRV289                                                 04853000
CVTRV295 EQU   CVTRV289                                                 04854000
CVTRV294 EQU   CVTRV289                                                 04855000
CVTRV293 EQU   CVTRV289                                                 04856000
CVTRV292 EQU   CVTRV289                                                 04857000
CVTRV291 EQU   CVTRV289                                                 04858000
CVTRV290 EQU   CVTRV289                                                 04859000
CVTRV288 EQU   CVTRV280                                                 04860000
CVTRV287 EQU   CVTRV280                                                 04861000
CVTRV286 EQU   CVTRV280                                                 04862000
CVTRV285 EQU   CVTRV280                                                 04863000
CVTRV284 EQU   CVTRV280                                                 04864000
CVTRV283 EQU   CVTRV280                                                 04865000
CVTRV282 EQU   CVTRV280                                                 04866000
CVTRV281 EQU   CVTRV280                                                 04867000
CVTRV279 EQU   CVTRV271                                                 04868000
CVTRV278 EQU   CVTRV271                                                 04869000
CVTRV277 EQU   CVTRV271                                                 04870000
CVTRV276 EQU   CVTRV271                                                 04871000
CVTRV275 EQU   CVTRV271                                                 04872000
CVTRV274 EQU   CVTRV271                                                 04873000
CVTRV273 EQU   CVTRV271                                                 04874000
CVTRV272 EQU   CVTRV271                                                 04875000
CVTRV270 EQU   CVTRV262                                                 04876000
CVTRV269 EQU   CVTRV262                                                 04877000
CVTRV268 EQU   CVTRV262                                                 04878000
CVTRV267 EQU   CVTRV262                                                 04879000
CVTRV266 EQU   CVTRV262                                                 04880000
CVTRV265 EQU   CVTRV262                                                 04881000
CVTRV264 EQU   CVTRV262                                                 04882000
CVTRV263 EQU   CVTRV262                                                 04883000
CVTVFP   EQU   CVTS01+464                                               04884000
CVTVSI   EQU   CVTS01+460                                               04885000
CVTVPSIB EQU   CVTS01+456                                               04886000
CVTMFACT EQU   CVTMFRTR                                                 04887000
CVTMFCTL EQU   CVTS01+448                                               04888000
CVTPVBP  EQU   CVTS01+444                                               04889000
CVTPWI   EQU   CVTS01+440                                               04890000
CVTRV254 EQU   CVTS01+438                                               04891000
CVTRV253 EQU   CVTS01+436                                               04892000
CVTRV252 EQU   CVTS01+434                                               04893000
CVTRV251 EQU   CVTS01+433                                               04894000
CVTRV250 EQU   CVTS01+432                                               04895000
CVTRV249 EQU   CVTS01+431                                               04896000
CVTRV248 EQU   CVTS01+430                                               04897000
CVTRV247 EQU   CVTS01+429                                               04898000
CVTRV246 EQU   CVTS01+428                                               04899000
CVTRV245 EQU   CVTRV237                                                 04900000
CVTRV244 EQU   CVTRV237                                                 04901000
CVTRV243 EQU   CVTRV237                                                 04902000
CVTRV242 EQU   CVTRV237                                                 04903000
CVTRV241 EQU   CVTRV237                                                 04904000
CVTRV240 EQU   CVTRV237                                                 04905000
CVTRV239 EQU   CVTRV237                                                 04906000
CVTRV238 EQU   CVTRV237                                                 04907000
CVTRV236 EQU   CVTRV228                                                 04908000
CVTRV235 EQU   CVTRV228                                                 04909000
CVTRV234 EQU   CVTRV228                                                 04910000
CVTRV233 EQU   CVTRV228                                                 04911000
CVTRV232 EQU   CVTRV228                                                 04912000
CVTRV231 EQU   CVTRV228                                                 04913000
CVTRV230 EQU   CVTRV228                                                 04914000
CVTRV229 EQU   CVTRV228                                                 04915000
CVTRV227 EQU   CVTRV219                                                 04916000
CVTRV226 EQU   CVTRV219                                                 04917000
CVTRV225 EQU   CVTRV219                                                 04918000
CVTRV224 EQU   CVTRV219                                                 04919000
CVTRV223 EQU   CVTRV219                                                 04920000
CVTRV222 EQU   CVTRV219                                                 04921000
CVTRV221 EQU   CVTRV219                                                 04922000
CVTRV220 EQU   CVTRV219                                                 04923000
CVTRV218 EQU   CVTRV210                                                 04924000
CVTRV217 EQU   CVTRV210                                                 04925000
CVTRV216 EQU   CVTRV210                                                 04926000
CVTRV215 EQU   CVTRV210                                                 04927000
CVTRV214 EQU   CVTRV210                                                 04928000
CVTRV213 EQU   CVTRV210                                                 04929000
CVTRV212 EQU   CVTRV210                                                 04930000
CVTRV211 EQU   CVTRV210                                                 04931000
CVTLCCAT EQU   CVTS01+420                                               04932000
CVTPCCAT EQU   CVTS01+416                                               04933000
CVTIPCRP EQU   CVTS01+412                                               04934000
CVTIPCRI EQU   CVTS01+408                                               04935000
CVTIPCDS EQU   CVTS01+404                                               04936000
CVTAIDVT EQU   CVTS01+400                                               04937000
CVTSSAP  EQU   CVTS01+396                                               04938000
CVTEHCIR EQU   CVTS01+392                                               04939000
CVTEHDEF EQU   CVTS01+388                                               04940000
CVTDAIR  EQU   CVTS01+384                                               04941000
CVTPERFM EQU   CVTS01+380                                               04942000
CVT044R2 EQU   CVTS01+376                                               04943000
CVTFETCH EQU   CVTS01+372                                               04944000
CVTRSTWD EQU   CVTS01+368                                               04945000
CVTSPOST EQU   CVTS01+364                                               04946000
CVTIOBP  EQU   CVTS01+360                                               04947000
CVTASMVT EQU   CVTS01+356                                               04948000
CVTRECRQ EQU   CVTS01+352                                               04949000
CVTWSAC  EQU   CVTS01+348                                               04950000
CVTRV149 EQU   CVTS01+344                                               04951000
CVTWSAL  EQU   CVTS01+340                                               04952000
CVTSPSA  EQU   CVTS01+336                                               04953000
CVTGLMN  EQU   CVTS01+332                                               04954000
CVTVEAC0 EQU   CVTS01+328                                               04955000
CVT062R1 EQU   CVTS01+324                                               04956000
CVTRPOST EQU   CVTS01+320                                               04957000
CVTDQIQE EQU   CVTS01+316                                               04958000
CVTCSD   EQU   CVTS01+312                                               04959000
CVTLKRMA EQU   CVTS01+308                                               04960000
CVTRSPIE EQU   CVTS01+304                                               04961000
CVTRENQ  EQU   CVTS01+300                                               04962000
CVTLQCB  EQU   CVTS01+296                                               04963000
CVTFQCB  EQU   CVTS01+292                                               04964000
CVTQCS01 EQU   CVTS01+288                                               04965000
CVTAPFT  EQU   CVTS01+284                                               04966000
CVTPARRL EQU   CVTS01+280                                               04967000
CVTVWAIT EQU   CVTS01+276                                               04968000
CVTGSPL  EQU   CVTS01+272                                               04969000
CVTLSMQ  EQU   CVTS01+268                                               04970000
CVTGSMQ  EQU   CVTS01+264                                               04971000
CVTEXPRO EQU   CVTS01+260                                               04972000
CVTOPCTP EQU   CVTS01+256                                               04973000
CVTSIC   EQU   CVTS01+252                                               04974000
CVTTPIOS EQU   CVTS01+248                                               04975000
CVTRTMS  EQU   CVTS01+244                                               04976000
CVTSDBF  EQU   CVTS01+240                                               04977000
CVTSCBP  EQU   CVTS01+236                                               04978000
CVTSDMP  EQU   CVTS01+232                                               04979000
CVTSV60  EQU   CVTS01+228                                               04980000
CVTRTMCT EQU   CVTS01+224                                               04981000
CVTASCBL EQU   CVTS01+220                                               04982000
CVTASCBH EQU   CVTS01+216                                               04983000
CVTGDA   EQU   CVTS01+212                                               04984000
CVTASVT  EQU   CVTS01+208                                               04985000
CVTVVMDI EQU   CVTS01+204                                               04986000
CVTAQTOP EQU   CVTS01+200                                               04987000
CVTIOSCS EQU   CVTS01+196                                               04988000
CVTSDRM  EQU   CVTS01+192                                               04989000
CVTOPTE  EQU   CVTS01+188                                               04990000
CVTSTXU  EQU   CVTS01+184                                               04991000
CVTQUIS  EQU   CVTS01+180                                               04992000
CVTPARS  EQU   CVTS01+176                                               04993000
CVTS1EE  EQU   CVTS01+172                                               04994000
CVTFRAS  EQU   CVTS01+168                                               04995000
CVTQSAS  EQU   CVTS01+164                                               04996000
CVTCRAS  EQU   CVTS01+160                                               04997000
CVTCRMN  EQU   CVTS01+156                                               04998000
CVTDELCP EQU   CVTS01+152                                               04999000
CVTFRECL EQU   CVTS01+148                                               05000000
CVTGETCL EQU   CVTS01+144                                               05001000
CVTBLDCP EQU   CVTS01+140                                               05002000
CVTAUTHL EQU   CVTS01+136                                               05003000
CVTSCAN  EQU   CVTS01+132                                               05004000
CVTRV144 EQU   CVTS01+130                                               05005000
CVTMAXMP EQU   CVTS01+128                                               05006000
CVTSTCK  EQU   CVTS01+124                                               05007000
CVTRV139 EQU   CVTS01+123                                               05008000
CVTDSSAC EQU   CVTS01+122                                               05009000
CVTRV513 EQU   CVTS01+121                                               05010000
CVTIOSPL EQU   CVTS01+120                                               05011000
CVTPTGT  EQU   CVTS01+116                                               05012000
CVTCSPIE EQU   CVTS01+112                                               05013000
CVTSMFEX EQU   CVTS01+108                                               05014000
CVTOLT0A EQU   CVTS01+104                                               05015000
CVTSRBRT EQU   CVTS01+100                                               05016000
CVTPUTL  EQU   CVTS01+96                                                05017000
CVTASCRL EQU   CVTS01+92                                                05018000
CVTASCRF EQU   CVTS01+88                                                05019000
CVTRV326 EQU   CVTS01+84                                                05020000
CVTRV325 EQU   CVTS01+80                                                05021000
CVTRV324 EQU   CVTS01+76                                                05022000
CVT0VL01 EQU   CVTS01+72                                                05023000
CVTSHRVM EQU   CVTS01+68                                                05024000
CVTRV332 EQU   CVTS01+64                                                05025000
CVTTAS   EQU   CVTS01+60                                                05026000
CVTRSCN  EQU   CVTS01+56                                                05027000
CVTTRAC2 EQU   CVTS01+54                                                05028000
CVTTRACE EQU   CVTS01+52                                                05029000
CVTAPG   EQU   CVTS01+51                                                05030000
CVTSDTRC EQU   CVTCTLFG                                                 05031000
CVTGTRCE EQU   CVTCTLFG                                                 05032000
CVTNOMP  EQU   CVTCTLFG                                                 05033000
CVTRSV79 EQU   CVTCTLFG                                                 05034000
CVTDSTAT EQU   CVTCTLFG                                                 05035000
CVTRSV78 EQU   CVTCTLFG                                                 05036000
CVTRV333 EQU   CVTCTLFG                                                 05037000
CVTRV323 EQU   CVTCTLFG                                                 05038000
CVTSPVLK EQU   CVTS01+49                                                05039000
CVTRSV77 EQU   CVTS01+48                                                05040000
CVTRV331 EQU   CVTS01+44                                                05041000
CVTRV330 EQU   CVTS01+40                                                05042000
CVTRV329 EQU   CVTS01+36                                                05043000
CVTRV328 EQU   CVTS01+32                                                05044000
CVTRV322 EQU   CVTS01+28                                                05045000
CVTSLID  EQU   CVTSLIDA+1                                               05046000
CVTSYLK  EQU   CVTSLIDA                                                 05047000
CVTRV321 EQU   CVTS01+20                                                05048000
CVTRV320 EQU   CVTS01+16                                                05049000
CVTLPDIR EQU   CVTLPDIA+1                                               05050000
CVTRSV69 EQU   CVTDIRST                                                 05051000
CVTRSV68 EQU   CVTDIRST                                                 05052000
CVTRSV67 EQU   CVTDIRST                                                 05053000
CVTRSV66 EQU   CVTDIRST                                                 05054000
CVTRSV65 EQU   CVTDIRST                                                 05055000
CVTRSV64 EQU   CVTDIRST                                                 05056000
CVTRSV63 EQU   CVTDIRST                                                 05057000
CVTDICOM EQU   CVTDIRST                                                 05058000
CVTPVTP  EQU   CVTS01+8                                                 05059000
CVTLPDSR EQU   CVTS01+4                                                 05060000
CVTGETL  EQU   CVTS01                                                   05061000
@NM01067 EQU   ESTAERR                                                  05062000
UNEXP2   EQU   ESTAERR                                                  05063000
LOCKHELD EQU   ESTAERR                                                  05064000
@NM01066 EQU   BUFFER+64                                                05065000
@NM01065 EQU   BUFFER+6                                                 05066000
SURV104  EQU   SUBITS+13                                                05067000
SURV103  EQU   SUBYTE13                                                 05068000
SURV102  EQU   SUBYTE13                                                 05069000
SURV101  EQU   SUBYTE13                                                 05070000
SU100BT  EQU   SUBYTE13                                                 05071000
SU99BIT  EQU   SUBYTE13                                                 05072000
SU98BIT  EQU   SUBYTE13                                                 05073000
SU97BIT  EQU   SUBYTE13                                                 05074000
SU96BIT  EQU   SUBYTE13                                                 05075000
SU95BIT  EQU   SUBYTE12                                                 05076000
SU94BIT  EQU   SUBYTE12                                                 05077000
SU93BIT  EQU   SUBYTE12                                                 05078000
SU92BIT  EQU   SUBYTE12                                                 05079000
SU91BIT  EQU   SUBYTE12                                                 05080000
SU90BIT  EQU   SUBYTE12                                                 05081000
SU89BIT  EQU   SUBYTE12                                                 05082000
SU88BIT  EQU   SUBYTE12                                                 05083000
SU87BIT  EQU   SUBYTE11                                                 05084000
SU86BIT  EQU   SUBYTE11                                                 05085000
SU85BIT  EQU   SUBYTE11                                                 05086000
SU84BIT  EQU   SUBYTE11                                                 05087000
SU83BIT  EQU   SUBYTE11                                                 05088000
SU82BIT  EQU   SUBYTE11                                                 05089000
SU81BIT  EQU   SUBYTE11                                                 05090000
SU80BIT  EQU   SUBYTE11                                                 05091000
SU79BIT  EQU   SUBYTE10                                                 05092000
SU78BIT  EQU   SUBYTE10                                                 05093000
SU77BIT  EQU   SUBYTE10                                                 05094000
SU76BIT  EQU   SUBYTE10                                                 05095000
SU75BIT  EQU   SUBYTE10                                                 05096000
SU74BIT  EQU   SUBYTE10                                                 05097000
SU73BIT  EQU   SUBYTE10                                                 05098000
SU72BIT  EQU   SUBYTE10                                                 05099000
SU71BIT  EQU   SUBYTE9                                                  05100000
SU70BIT  EQU   SUBYTE9                                                  05101000
SU69BIT  EQU   SUBYTE9                                                  05102000
SU68BIT  EQU   SUBYTE9                                                  05103000
SU67BIT  EQU   SUBYTE9                                                  05104000
SU66BIT  EQU   SUBYTE9                                                  05105000
SU65BIT  EQU   SUBYTE9                                                  05106000
SU64BIT  EQU   SUBYTE9                                                  05107000
SU63BIT  EQU   SUBYTE8                                                  05108000
SU62BIT  EQU   SUBYTE8                                                  05109000
SU61BIT  EQU   SUBYTE8                                                  05110000
SU60BIT  EQU   SUBYTE8                                                  05111000
SU59BIT  EQU   SUBYTE8                                                  05112000
SU58BIT  EQU   SUBYTE8                                                  05113000
SU57BIT  EQU   SUBYTE8                                                  05114000
SU56BIT  EQU   SUBYTE8                                                  05115000
SU55BIT  EQU   SUBYTE7                                                  05116000
SU54BIT  EQU   SUBYTE7                                                  05117000
SU53BIT  EQU   SUBYTE7                                                  05118000
SU52BIT  EQU   SUBYTE7                                                  05119000
SU51BIT  EQU   SUBYTE7                                                  05120000
SU50BIT  EQU   SUBYTE7                                                  05121000
SU49BIT  EQU   SUBYTE7                                                  05122000
SU48BIT  EQU   SUBYTE7                                                  05123000
SU47BIT  EQU   SUBYTE6                                                  05124000
SU46BIT  EQU   SUBYTE6                                                  05125000
SU45BIT  EQU   SUBYTE6                                                  05126000
SU44BIT  EQU   SUBYTE6                                                  05127000
SU43BIT  EQU   SUBYTE6                                                  05128000
SU42BIT  EQU   SUBYTE6                                                  05129000
SU41BIT  EQU   SUBYTE6                                                  05130000
SU40BIT  EQU   SUBYTE6                                                  05131000
SU39BIT  EQU   SUBYTE5                                                  05132000
SU38BIT  EQU   SUBYTE5                                                  05133000
SU37BIT  EQU   SUBYTE5                                                  05134000
SU36BIT  EQU   SUBYTE5                                                  05135000
SU35BIT  EQU   SUBYTE5                                                  05136000
SU34BIT  EQU   SUBYTE5                                                  05137000
SU32BIT  EQU   SUBYTE5                                                  05138000
SU31BIT  EQU   SUBYTE4                                                  05139000
SU30BIT  EQU   SUBYTE4                                                  05140000
SU29BIT  EQU   SUBYTE4                                                  05141000
SU28BIT  EQU   SUBYTE4                                                  05142000
SU27BIT  EQU   SUBYTE4                                                  05143000
SU26BIT  EQU   SUBYTE4                                                  05144000
SU25BIT  EQU   SUBYTE4                                                  05145000
SU24BIT  EQU   SUBYTE4                                                  05146000
SU23BIT  EQU   SUBYTE3                                                  05147000
SU22BIT  EQU   SUBYTE3                                                  05148000
SU21BIT  EQU   SUBYTE3                                                  05149000
SU20BIT  EQU   SUBYTE3                                                  05150000
SU19BIT  EQU   SUBYTE3                                                  05151000
SU18BIT  EQU   SUBYTE3                                                  05152000
SU16BIT  EQU   SUBYTE3                                                  05153000
SU15BIT  EQU   SUBYTE2                                                  05154000
SU14BIT  EQU   SUBYTE2                                                  05155000
SU13BIT  EQU   SUBYTE2                                                  05156000
SU12BIT  EQU   SUBYTE2                                                  05157000
SU11BIT  EQU   SUBYTE2                                                  05158000
SU10BIT  EQU   SUBYTE2                                                  05159000
SU9BIT   EQU   SUBYTE2                                                  05160000
SU8BIT   EQU   SUBYTE2                                                  05161000
SU7BIT   EQU   SUBYTE1                                                  05162000
SU6BIT   EQU   SUBYTE1                                                  05163000
SU5BIT   EQU   SUBYTE1                                                  05164000
SU4BIT   EQU   SUBYTE1                                                  05165000
SU3BIT   EQU   SUBYTE1                                                  05166000
SU2BIT   EQU   SUBYTE1                                                  05167000
SU1BIT   EQU   SUBYTE1                                                  05168000
SU0BIT   EQU   SUBYTE1                                                  05169000
@NM00128 EQU   SDWA+512                                                 05170000
SDWAVRA  EQU   SDWARA+4                                                 05171000
SDWAURAL EQU   SDWARA+3                                                 05172000
@NM00127 EQU   SDWADPVA                                                 05173000
SDWAEBC  EQU   SDWADPVA                                                 05174000
SDWAHEX  EQU   SDWADPVA                                                 05175000
SDWAVRAL EQU   SDWARA                                                   05176000
SDWAERTM EQU   SDWA+396                                                 05177000
SDWACOMP EQU   SDWA+392                                                 05178000
SDWARCPL EQU   SDWA+364                                                 05179000
@NM00126 EQU   SDWADPSA+32                                              05180000
SDWATO4  EQU   SDWADPSL+28                                              05181000
SDWAFRM4 EQU   SDWADPSL+24                                              05182000
SDWATO3  EQU   SDWADPSL+20                                              05183000
SDWAFRM3 EQU   SDWADPSL+16                                              05184000
SDWATO2  EQU   SDWADPSL+12                                              05185000
SDWAFRM2 EQU   SDWADPSL+8                                               05186000
SDWATO1  EQU   SDWADPSL+4                                               05187000
SDWAFRM1 EQU   SDWADPSL                                                 05188000
@NM00125 EQU   SDWADDAT+3                                               05189000
@NM00124 EQU   SDWAPDAT                                                 05190000
SDWAUSPL EQU   SDWAPDAT                                                 05191000
SDWADPSW EQU   SDWAPDAT                                                 05192000
SDWATJPA EQU   SDWAPDAT                                                 05193000
SDWATLPA EQU   SDWAPDAT                                                 05194000
SDWADREG EQU   SDWAPDAT                                                 05195000
SDWADSAH EQU   SDWAPDAT                                                 05196000
SDWADSAS EQU   SDWAPDAT                                                 05197000
@NM00123 EQU   SDWASDA1                                                 05198000
SDWAERR  EQU   SDWASDA1                                                 05199000
SDWAIO   EQU   SDWASDA1                                                 05200000
SDWADM   EQU   SDWASDA0                                                 05201000
SDWAQQS  EQU   SDWASDA0                                                 05202000
SDWACBS  EQU   SDWASDA0                                                 05203000
SDWAGTF  EQU   SDWASDA0                                                 05204000
SDWASWA  EQU   SDWASDA0                                                 05205000
SDWALSQA EQU   SDWASDA0                                                 05206000
SDWASQA  EQU   SDWASDA0                                                 05207000
SDWANUC  EQU   SDWASDA0                                                 05208000
@NM00122 EQU   SDWADUMP+2                                               05209000
@NM00121 EQU   SDWADPFS                                                 05210000
SDWASLST EQU   SDWADPFS                                                 05211000
@NM00120 EQU   SDWADPFS                                                 05212000
SDWAENSN EQU   SDWADPFS                                                 05213000
SDWADLST EQU   SDWADPFS                                                 05214000
SDWADPT  EQU   SDWADPFS                                                 05215000
SDWADPID EQU   SDWADUMP                                                 05216000
SDWADPLA EQU   SDWA+316                                                 05217000
SDWAREXN EQU   SDWARECP+16                                              05218000
SDWACSCT EQU   SDWARECP+8                                               05219000
SDWAMODN EQU   SDWARECP                                                 05220000
SDWASEQ# EQU   SDWA+290                                                 05221000
SDWAASID EQU   SDWA+288                                                 05222000
SDWATALW EQU   SDWALKWS+28                                              05223000
SDWATDLW EQU   SDWALKWS+24                                              05224000
SDWATNLW EQU   SDWALKWS+20                                              05225000
SDWAAPLW EQU   SDWALKWS+16                                              05226000
SDWAIPLW EQU   SDWALKWS+12                                              05227000
SDWAILLW EQU   SDWALKWS+8                                               05228000
SDWAIULW EQU   SDWALKWS+4                                               05229000
SDWAICLW EQU   SDWALKWS                                                 05230000
SDWAFLLK EQU   SDWAACF4                                                 05231000
SDWACMS  EQU   SDWAACF4                                                 05232000
SDWAOPTM EQU   SDWAACF4                                                 05233000
SDWATADB EQU   SDWAACF4                                                 05234000
SDWATDNB EQU   SDWAACF4                                                 05235000
SDWATNCB EQU   SDWAACF4                                                 05236000
SDWAILCH EQU   SDWAACF4                                                 05237000
SDWAIUCB EQU   SDWAACF4                                                 05238000
SDWAICAT EQU   SDWAACF3                                                 05239000
SDWAIPRG EQU   SDWAACF3                                                 05240000
SDWASALL EQU   SDWAACF3                                                 05241000
SDWAASMP EQU   SDWAACF3                                                 05242000
SDWADISP EQU   SDWAACF3                                                 05243000
@NM00119 EQU   SDWAACF3                                                 05244000
@NM00118 EQU   SDWAACF2                                                 05245000
SDWAFREE EQU   SDWAACF2                                                 05246000
SDWAUPRG EQU   SDWAACF2                                                 05247000
@NM00117 EQU   SDWAACF2                                                 05248000
SDWASPIN EQU   SDWAACF2                                                 05249000
@NM00116 EQU   SDWAACF2                                                 05250000
SDWARCRD EQU   SDWAACF2                                                 05251000
SDWARCDE EQU   SDWAPARQ                                                 05252000
SDWALCPU EQU   SDWACPUA+2                                               05253000
@NM00115 EQU   SDWACPUA                                                 05254000
SDWARECA EQU   SDWA+244                                                 05255000
SDWARTYA EQU   SDWA+240                                                 05256000
SDWACPUI EQU   SDWA+239                                                 05257000
@NM00114 EQU   SDWAIOFS                                                 05258000
SDWANIOP EQU   SDWAIOFS                                                 05259000
SDWANOIO EQU   SDWAIOFS                                                 05260000
SDWAIOHT EQU   SDWAIOFS                                                 05261000
SDWAIOQR EQU   SDWAIOFS                                                 05262000
SDWAFMID EQU   SDWA+236                                                 05263000
SDWAERFL EQU   SDWAERRD                                                 05264000
SDWAMCIV EQU   SDWAERRD                                                 05265000
SDWARPIV EQU   SDWAERRD                                                 05266000
SDWAMABD EQU   SDWAERRD                                                 05267000
SDWACTS  EQU   SDWAERRD                                                 05268000
SDWASTAE EQU   SDWAERRD                                                 05269000
SDWANRBE EQU   SDWAERRD                                                 05270000
SDWACLUP EQU   SDWAERRD                                                 05271000
@NM00113 EQU   SDWAERRC                                                 05272000
SDWAEAS  EQU   SDWAERRC                                                 05273000
SDWAPERC EQU   SDWAERRC                                                 05274000
SDWAIRB  EQU   SDWAERRC                                                 05275000
SDWASTAI EQU   SDWAERRC                                                 05276000
SDWASTAF EQU   SDWAERRC                                                 05277000
SDWASRBM EQU   SDWAERRB                                                 05278000
SDWALDIS EQU   SDWAERRB                                                 05279000
SDWAENRB EQU   SDWAERRB                                                 05280000
SDWATYP1 EQU   SDWAERRB                                                 05281000
@NM00112 EQU   SDWAERRB                                                 05282000
SDWAPGIO EQU   SDWAERRA                                                 05283000
SDWATEXC EQU   SDWAERRA                                                 05284000
SDWASVCE EQU   SDWAERRA                                                 05285000
SDWAABTM EQU   SDWAERRA                                                 05286000
SDWASVCD EQU   SDWAERRA                                                 05287000
SDWARKEY EQU   SDWAERRA                                                 05288000
SDWAPCHK EQU   SDWAERRA                                                 05289000
SDWAMCHK EQU   SDWAERRA                                                 05290000
SDWATIME EQU   SDWAMCH+20                                               05291000
SDWARFSA EQU   SDWAMCH+16                                               05292000
@NM00111 EQU   SDWAMCH+14                                               05293000
SDWAVEQR EQU   SDWARSR2                                                 05294000
SDWAPGFX EQU   SDWARSR2                                                 05295000
SDWAFLSQ EQU   SDWARSR2                                                 05296000
SDWAFSQA EQU   SDWARSR2                                                 05297000
SDWANUCL EQU   SDWARSR2                                                 05298000
SDWASPER EQU   SDWARSR2                                                 05299000
SDWAINTC EQU   SDWARSR2                                                 05300000
SDWAOFLN EQU   SDWARSR2                                                 05301000
SDWACHNG EQU   SDWARSR1                                                 05302000
SDWAMSER EQU   SDWARSR1                                                 05303000
@NM00110 EQU   SDWARSR1                                                 05304000
SDWACPID EQU   SDWAMCH+10                                               05305000
SDWATERR EQU   SDWAMCHD                                                 05306000
SDWAFPRX EQU   SDWAMCHD                                                 05307000
SDWAINSF EQU   SDWAMCHD                                                 05308000
SDWAACR  EQU   SDWAMCHD                                                 05309000
SDWASCK  EQU   SDWAMCHD                                                 05310000
SDWAPSWU EQU   SDWAMCHD                                                 05311000
SDWAREGU EQU   SDWAMCHD                                                 05312000
SDWASKYF EQU   SDWAMCHD                                                 05313000
@NM00109 EQU   SDWAMCHS                                                 05314000
SDWARSRF EQU   SDWAMCHS                                                 05315000
SDWARSRC EQU   SDWAMCHS                                                 05316000
SDWAINVP EQU   SDWAMCHS                                                 05317000
SDWATSVL EQU   SDWAMCHS                                                 05318000
SDWARCDF EQU   SDWAMCHS                                                 05319000
SDWASRVL EQU   SDWAMCHS                                                 05320000
SDWASCKE EQU   SDWASTCK+4                                               05321000
SDWASCKB EQU   SDWASTCK                                                 05322000
SDWALNTH EQU   SDWAIDNT+1                                               05323000
SDWASPID EQU   SDWAIDNT                                                 05324000
SDWASR15 EQU   SDWASRSV+60                                              05325000
SDWASR14 EQU   SDWASRSV+56                                              05326000
SDWASR13 EQU   SDWASRSV+52                                              05327000
SDWASR12 EQU   SDWASRSV+48                                              05328000
SDWASR11 EQU   SDWASRSV+44                                              05329000
SDWASR10 EQU   SDWASRSV+40                                              05330000
SDWASR09 EQU   SDWASRSV+36                                              05331000
SDWASR08 EQU   SDWASRSV+32                                              05332000
SDWASR07 EQU   SDWASRSV+28                                              05333000
SDWASR06 EQU   SDWASRSV+24                                              05334000
SDWASR05 EQU   SDWASRSV+20                                              05335000
SDWASR04 EQU   SDWASRSV+16                                              05336000
SDWASR03 EQU   SDWASRSV+12                                              05337000
SDWASR02 EQU   SDWASRSV+8                                               05338000
SDWASR01 EQU   SDWASRSV+4                                               05339000
SDWASR00 EQU   SDWASRSV                                                 05340000
SDWATRN2 EQU   SDWAAEC2+4                                               05341000
SDWAIPC2 EQU   SDWAICD2                                                 05342000
SDWAIMC2 EQU   SDWAICD2                                                 05343000
SDWAIPR2 EQU   SDWAICD2                                                 05344000
@NM00108 EQU   SDWAINC2                                                 05345000
@NM00107 EQU   SDWAILC2                                                 05346000
SDWAIL2  EQU   SDWAILC2                                                 05347000
@NM00106 EQU   SDWAILC2                                                 05348000
@NM00105 EQU   SDWAAEC2                                                 05349000
SDWAADD2 EQU   SDWANXT2+1                                               05350000
@NM00104 EQU   SDWANXT2                                                 05351000
@NM00103 EQU   SDWAEC2+3                                                05352000
SDWASGN2 EQU   SDWAINT2                                                 05353000
SDWAEXP2 EQU   SDWAINT2                                                 05354000
SDWADEC2 EQU   SDWAINT2                                                 05355000
SDWAFPO2 EQU   SDWAINT2                                                 05356000
SDWACC2  EQU   SDWAINT2                                                 05357000
@NM00102 EQU   SDWAINT2                                                 05358000
SDWAPGM2 EQU   SDWAMWP2                                                 05359000
SDWAWAT2 EQU   SDWAMWP2                                                 05360000
SDWAMCK2 EQU   SDWAMWP2                                                 05361000
SDWAECT2 EQU   SDWAMWP2                                                 05362000
SDWAKEY2 EQU   SDWAMWP2                                                 05363000
SDWAEXT2 EQU   SDWAEMK2                                                 05364000
SDWAIO2  EQU   SDWAEMK2                                                 05365000
SDWATRM2 EQU   SDWAEMK2                                                 05366000
@NM00101 EQU   SDWAEMK2                                                 05367000
SDWAPER2 EQU   SDWAEMK2                                                 05368000
@NM00100 EQU   SDWAEMK2                                                 05369000
SDWATRAN EQU   SDWAAEC1+4                                               05370000
SDWAIPC1 EQU   SDWAICD1                                                 05371000
SDWAIMC1 EQU   SDWAICD1                                                 05372000
SDWAIPR1 EQU   SDWAICD1                                                 05373000
@NM00099 EQU   SDWAINC1                                                 05374000
@NM00098 EQU   SDWAILC1                                                 05375000
SDWAIL1  EQU   SDWAILC1                                                 05376000
@NM00097 EQU   SDWAILC1                                                 05377000
@NM00096 EQU   SDWAAEC1                                                 05378000
SDWAADD1 EQU   SDWANXT1+1                                               05379000
@NM00095 EQU   SDWANXT1                                                 05380000
@NM00094 EQU   SDWAEC1+3                                                05381000
SDWASGN1 EQU   SDWAINT1                                                 05382000
SDWAEXP1 EQU   SDWAINT1                                                 05383000
SDWADEC1 EQU   SDWAINT1                                                 05384000
SDWAFPO1 EQU   SDWAINT1                                                 05385000
SDWACC1  EQU   SDWAINT1                                                 05386000
@NM00093 EQU   SDWAINT1                                                 05387000
SDWAPGM1 EQU   SDWAMWP1                                                 05388000
SDWAWAT1 EQU   SDWAMWP1                                                 05389000
SDWAMCK1 EQU   SDWAMWP1                                                 05390000
SDWAECT1 EQU   SDWAMWP1                                                 05391000
SDWAKEY1 EQU   SDWAMWP1                                                 05392000
SDWAEXT1 EQU   SDWAEMK1                                                 05393000
SDWAIO1  EQU   SDWAEMK1                                                 05394000
SDWATRM1 EQU   SDWAEMK1                                                 05395000
@NM00092 EQU   SDWAEMK1                                                 05396000
SDWAPER1 EQU   SDWAEMK1                                                 05397000
@NM00091 EQU   SDWAEMK1                                                 05398000
SDWAIOBR EQU   SDWA+100                                                 05399000
SDWAEPA  EQU   SDWA+96                                                  05400000
@NM00090 EQU   SDWANAME+4                                               05401000
SDWARBAD EQU   SDWANAME                                                 05402000
SDWAGR15 EQU   SDWAGRSV+60                                              05403000
SDWAGR14 EQU   SDWAGRSV+56                                              05404000
SDWAGR13 EQU   SDWAGRSV+52                                              05405000
SDWAGR12 EQU   SDWAGRSV+48                                              05406000
SDWAGR11 EQU   SDWAGRSV+44                                              05407000
SDWAGR10 EQU   SDWAGRSV+40                                              05408000
SDWAGR09 EQU   SDWAGRSV+36                                              05409000
SDWAGR08 EQU   SDWAGRSV+32                                              05410000
SDWAGR07 EQU   SDWAGRSV+28                                              05411000
SDWAGR06 EQU   SDWAGRSV+24                                              05412000
SDWAGR05 EQU   SDWAGRSV+20                                              05413000
SDWAGR04 EQU   SDWAGRSV+16                                              05414000
SDWAGR03 EQU   SDWAGRSV+12                                              05415000
SDWAGR02 EQU   SDWAGRSV+8                                               05416000
SDWAGR01 EQU   SDWAGRSV+4                                               05417000
SDWAGR00 EQU   SDWAGRSV                                                 05418000
SDWANXTP EQU   SDWACTL2+5                                               05419000
SDWASGP  EQU   SDWAPMKP                                                 05420000
SDWAEUP  EQU   SDWAPMKP                                                 05421000
SDWADOP  EQU   SDWAPMKP                                                 05422000
SDWAFPP  EQU   SDWAPMKP                                                 05423000
SDWACCP  EQU   SDWAPMKP                                                 05424000
SDWAILP  EQU   SDWAPMKP                                                 05425000
SDWAINTP EQU   SDWACTL2+2                                               05426000
SDWASPVP EQU   SDWAMWPP                                                 05427000
SDWAWATP EQU   SDWAMWPP                                                 05428000
SDWAMCKP EQU   SDWAMWPP                                                 05429000
@NM00089 EQU   SDWAMWPP                                                 05430000
SDWAKEYP EQU   SDWAMWPP                                                 05431000
SDWAEXTP EQU   SDWACMKP                                                 05432000
SDWAIOP  EQU   SDWACMKP                                                 05433000
SDWANXTA EQU   SDWACTL1+5                                               05434000
SDWASGA  EQU   SDWAPMKA                                                 05435000
SDWAEUA  EQU   SDWAPMKA                                                 05436000
SDWADOA  EQU   SDWAPMKA                                                 05437000
SDWAFPA  EQU   SDWAPMKA                                                 05438000
SDWACCA  EQU   SDWAPMKA                                                 05439000
SDWAILA  EQU   SDWAPMKA                                                 05440000
SDWAINTA EQU   SDWACTL1+2                                               05441000
SDWASPVA EQU   SDWAMWPA                                                 05442000
SDWAWATA EQU   SDWAMWPA                                                 05443000
SDWAMCKA EQU   SDWAMWPA                                                 05444000
@NM00088 EQU   SDWAMWPA                                                 05445000
SDWAKEYA EQU   SDWAMWPA                                                 05446000
SDWAEXTA EQU   SDWACMKA                                                 05447000
SDWAIOA  EQU   SDWACMKA                                                 05448000
SDWACMPC EQU   SDWAABCC+1                                               05449000
@NM00087 EQU   SDWACMPF                                                 05450000
SDWASTCC EQU   SDWACMPF                                                 05451000
@NM00086 EQU   SDWACMPF                                                 05452000
SDWASTEP EQU   SDWACMPF                                                 05453000
SDWAREQ  EQU   SDWACMPF                                                 05454000
SDWAPARM EQU   SDWA                                                     05455000
EEDASID  EQU   EEDERROR+2                                               05456000
EEDERTYP EQU   EEDERROR+1                                               05457000
EEDMODE  EQU   EEDERROR                                                 05458000
@NM00079 EQU   EEDDES+2                                                 05459000
@NM00078 EQU   EEDFLAGS                                                 05460000
EEDNODMP EQU   EEDFLAGS                                                 05461000
EEDERFL  EQU   EEDFLAGS                                                 05462000
EEDID    EQU   EEDDES                                                   05463000
EEDFWRDP EQU   EED                                                      05464000
MODETCB  EQU   MODEBYTE                                                 05465000
MODESRB  EQU   MODEBYTE                                                 05466000
MODETYP1 EQU   MODEBYTE                                                 05467000
MODELOC  EQU   MODEBYTE                                                 05468000
MODEGSUS EQU   MODEBYTE                                                 05469000
MODEGSPN EQU   MODEBYTE                                                 05470000
MODEDIS  EQU   MODEBYTE                                                 05471000
MODESUPR EQU   MODEBYTE                                                 05472000
RTMBXABT EQU   RTMBRTAB+44                                              05473000
RTMBACR  EQU   RTMBRTAB+40                                              05474000
RTMBPROG EQU   RTMBRTAB+36                                              05475000
RTMBMEMT EQU   RTMBRTAB+32                                              05476000
RTMBCABT EQU   RTMBRTAB+28                                              05477000
RTMBPGIO EQU   RTMBRTAB+24                                              05478000
RTMBSVC  EQU   RTMBRTAB+20                                              05479000
RTMBMACH EQU   RTMBRTAB+16                                              05480000
RTMBREST EQU   RTMBRTAB+12                                              05481000
RTMBDAT  EQU   RTMBRTAB+8                                               05482000
RTMBPAD2 EQU   RTMBTERM+6                                               05483000
RTMBBRAN EQU   RTMBTERM+2                                               05484000
RTMBBALR EQU   RTMBTERM                                                 05485000
RT1TREGS EQU   RT1TRACK+4                                               05486000
RT1TRETY EQU   RT1TACQR                                                 05487000
RT1TLLCK EQU   RT1TACQR                                                 05488000
RT1TDISP EQU   RT1TACQR                                                 05489000
RT1TENPT EQU   RT1TRECC+2                                               05490000
RT1TLPID EQU   RT1TRECC+1                                               05491000
RT1TLPN  EQU   RT1TRECC                                                 05492000
STORBTO  EQU   STORTO                                                   05493000
STORB    EQU   STORFRM                                                  05494000
RTM2TECB EQU   RTM2RYRG+64                                              05495000
RTM2RYRS EQU   RTM2RYRG                                                 05496000
RTM2TRTB EQU   RTM2ENSN+4                                               05497000
@NM00074 EQU   RTM2SNLN+2                                               05498000
RTM2TRLN EQU   RTM2SNLN                                                 05499000
@NM00073 EQU   RTM2WA+882                                               05500000
RTM2ERTM EQU   RTM2ERID+6                                               05501000
RTM2CPUI EQU   RTM2ERID+2                                               05502000
RTM2SEQ# EQU   RTM2ERID                                                 05503000
RTM2RMSA EQU   RTM2RMIN+92                                              05504000
RTM2RMWS EQU   RTM2RMWA                                                 05505000
RTM2RMPS EQU   RTM2RMIN                                                 05506000
RTM2TRSA EQU   RTM2CVER+450                                             05507000
RTM2CREG EQU   RTM2CRG                                                  05508000
RTM2RREG EQU   RTM2RRG                                                  05509000
RTM2RBRG EQU   RTM2CVER+313                                             05510000
RTM2WARG EQU   RTM2CVER+312                                             05511000
@NM00072 EQU   RTM2CVER+310                                             05512000
RTM2CTRA EQU   RTM2RECH+12                                              05513000
RTM2STRA EQU   RTM2RECH+8                                               05514000
RTM2SKRA EQU   RTM2RECH+4                                               05515000
RTM2TRRA EQU   RTM2RECH                                                 05516000
@NM00071 EQU   RTM2TRYR+3                                               05517000
@NM00070 EQU   RTM2TRF2                                                 05518000
RTM2TREC EQU   RTM2TRF2                                                 05519000
RTM2GMR  EQU   RTM2TRF2                                                 05520000
RTM2PPR  EQU   RTM2TRF2                                                 05521000
RTM2IOR  EQU   RTM2TRF2                                                 05522000
RTM2AS3R EQU   RTM2TRF1+1                                               05523000
RTM2AS2R EQU   RTM2TRF1+1                                               05524000
RTM2AS1R EQU   RTM2TRF1+1                                               05525000
RTM2XFLG EQU   RTM2TRF1+1                                               05526000
RTM2XABD EQU   RTM2TRF1+1                                               05527000
RTM2XIP  EQU   RTM2TRF1+1                                               05528000
RTM2RTYS EQU   RTM2TRF1+1                                               05529000
RTM2RCD  EQU   RTM2TRF1+1                                               05530000
RTM2FMS  EQU   RTM2TRF1                                                 05531000
RTM2VLDY EQU   RTM2TRF1                                                 05532000
RTM2HOOK EQU   RTM2TRF1                                                 05533000
RTM2PPS  EQU   RTM2TRF1                                                 05534000
RTM2GMS  EQU   RTM2TRF1                                                 05535000
RTM2IORS EQU   RTM2TRF1                                                 05536000
RTM2IOHS EQU   RTM2TRF1                                                 05537000
RTM2IOQS EQU   RTM2TRF1                                                 05538000
RTM2TMER EQU   RTM2RECL+14                                              05539000
RTM2EQMN EQU   RTM2ECTL                                                 05540000
RTM2EDEQ EQU   RTM2ECTL                                                 05541000
RTM2EFRM EQU   RTM2ECTL                                                 05542000
RTM2ECLS EQU   RTM2ECTL                                                 05543000
RTM2ESNP EQU   RTM2ECTL                                                 05544000
RTM2EOPN EQU   RTM2ECTL                                                 05545000
RTM2EGET EQU   RTM2ECTL                                                 05546000
RTM2EENQ EQU   RTM2ECTL                                                 05547000
RTM2DFTK EQU   RTM2DCTL                                                 05548000
RTM2DDEQ EQU   RTM2DCTL                                                 05549000
RTM2DFRM EQU   RTM2DCTL                                                 05550000
RTM2DCLS EQU   RTM2DCTL                                                 05551000
RTM2DSNP EQU   RTM2DCTL                                                 05552000
RTM2DOPN EQU   RTM2DCTL                                                 05553000
RTM2DGET EQU   RTM2DCTL                                                 05554000
RTM2DENQ EQU   RTM2DCTL                                                 05555000
RTM2SCTX EQU   RTM2RECL+8                                               05556000
RTM2SCTR EQU   RTM2RECL+4                                               05557000
RTM2SCTC EQU   RTM2RECL                                                 05558000
@NM00069 EQU   RTM2FLX2                                                 05559000
RTM2CERX EQU   RTM2FLX2                                                 05560000
RTM2RCRX EQU   RTM2FLX2                                                 05561000
RTM2RTRX EQU   RTM2FLX1                                                 05562000
RTM2LTX  EQU   RTM2FLX1                                                 05563000
RTM2PRX  EQU   RTM2FLX1                                                 05564000
RTM2CVX  EQU   RTM2FLX1                                                 05565000
RTM2DWX  EQU   RTM2FLX1                                                 05566000
RTM2ABX  EQU   RTM2FLX1                                                 05567000
RTM2EOTX EQU   RTM2FLX1                                                 05568000
RTM2MTX  EQU   RTM2FLX1                                                 05569000
@NM00068 EQU   RTM2ASIR                                                 05570000
RTM2UPRG EQU   RTM2ASIR                                                 05571000
RTM2TRME EQU   RTM2ASIR                                                 05572000
@NM00067 EQU   RTM2ABDP                                                 05573000
RTM2SMDP EQU   RTM2ABDP                                                 05574000
RTM2DMP1 EQU   RTM2ABDP                                                 05575000
RTM2MEMT EQU   RTM2INTF+3                                               05576000
@NM00066 EQU   RTM2TSKT                                                 05577000
RTM2PURG EQU   RTM2TSKT                                                 05578000
@NM00065 EQU   RTM2INTF+1                                               05579000
@NM00064 EQU   RTM2CTLR                                                 05580000
RTM2WRAP EQU   RTM2CTLR                                                 05581000
RTM2TMEM EQU   RTM2CTLR                                                 05582000
RTM2RETR EQU   RTM2CTLR                                                 05583000
RTM2RECR EQU   RTM2CTLR                                                 05584000
@NM00063 EQU   RTM2RCTL                                                 05585000
RTM2JPAQ EQU   RTM2RCTL                                                 05586000
RTM2LPAQ EQU   RTM2RCTL                                                 05587000
RTM2BFTL EQU   RTM2RCTL                                                 05588000
RTM2TRSW EQU   RTM2RCTL                                                 05589000
RTM2WANA EQU   RTM2RCTL                                                 05590000
RTM2WAIN EQU   RTM2RCTL                                                 05591000
RTM2STA2 EQU   RTM2RCTL                                                 05592000
RTM2STAT EQU   RTM2ABND                                                 05593000
RTM2NDMP EQU   RTM2ABND                                                 05594000
@NM00062 EQU   RTM2ABID                                                 05595000
RTM2OERR EQU   RTM2ABID                                                 05596000
RTM2SAV2 EQU   RTM2ABID                                                 05597000
RTM2SAVE EQU   RTM2ABID                                                 05598000
RTM2REG  EQU   RTM2ABID                                                 05599000
RTM2PSW  EQU   RTM2ABID                                                 05600000
RTM2ENQ  EQU   RTM2ABID                                                 05601000
RTM2CB   EQU   RTM2ABID                                                 05602000
RTM2MCTL EQU   RTM2SCTL+3                                               05603000
RTM2TCTL EQU   RTM2SCTL+2                                               05604000
@NM00061 EQU   RTM2CCTL+1                                               05605000
RTM2NODP EQU   RTM2CCTL+1                                               05606000
RTM2RGEB EQU   RTM2CCTL+1                                               05607000
RTM2DEND EQU   RTM2CCTL+1                                               05608000
RTM2RSCN EQU   RTM2CCTL+1                                               05609000
RTM2CONT EQU   RTM2CCTL                                                 05610000
RTM2SLIP EQU   RTM2CCTL                                                 05611000
RTM2HEED EQU   RTM2CCTL                                                 05612000
RTM2REED EQU   RTM2CCTL                                                 05613000
RTM2ISPC EQU   RTM2CCTL                                                 05614000
RTM2SQS  EQU   RTM2CCTL                                                 05615000
RTM2CNCL EQU   RTM2CCTL                                                 05616000
RTM2STPT EQU   RTM2CCTL                                                 05617000
RTM2PKEY EQU   RTM2CVER+258                                             05618000
RTM2SFSA EQU   RTM2SFRG                                                 05619000
RTM2SPWA EQU   RTM2CVER+174                                             05620000
RTM2DCBA EQU   RTM2CVER+170                                             05621000
RTM2ECBS EQU   RTM2SECB+16                                              05622000
RTM2LECB EQU   RTM2ECBA                                                 05623000
RTM2DTCB EQU   RTM2SNAP+68                                              05624000
RTM2SNCC EQU   RTM2SNAP+64                                              05625000
RTM2DD   EQU   RTM2SNAP+56                                              05626000
RTM2LTO4 EQU   RTM2TO4                                                  05627000
RTM2LFR4 EQU   RTM2FRM4                                                 05628000
RTM2LTO3 EQU   RTM2TO3                                                  05629000
RTM2LFR3 EQU   RTM2FRM3                                                 05630000
RTM2LTO2 EQU   RTM2TO2                                                  05631000
RTM2LFR2 EQU   RTM2FRM2                                                 05632000
RTM2LTO1 EQU   RTM2TO1                                                  05633000
RTM2LFR1 EQU   RTM2FRM1                                                 05634000
RTM2DPLA EQU   RTM2SNAP                                                 05635000
RTM2NXTP EQU   RTM2CTL2+5                                               05636000
RTM2SGP  EQU   RTM2PMKP                                                 05637000
RTM2EUP  EQU   RTM2PMKP                                                 05638000
RTM2DOP  EQU   RTM2PMKP                                                 05639000
RTM2FPP  EQU   RTM2PMKP                                                 05640000
RTM2CCP  EQU   RTM2PMKP                                                 05641000
RTM2ILP  EQU   RTM2PMKP                                                 05642000
RTM2INTP EQU   RTM2CTL2+2                                               05643000
RTM2SPVP EQU   RTM2MWPP                                                 05644000
RTM2WATP EQU   RTM2MWPP                                                 05645000
RTM2MCKP EQU   RTM2MWPP                                                 05646000
@NM00060 EQU   RTM2MWPP                                                 05647000
RTM2KEYP EQU   RTM2MWPP                                                 05648000
RTM2EXTP EQU   RTM2CMKP                                                 05649000
RTM2IOP  EQU   RTM2CMKP                                                 05650000
RTM2NXTA EQU   RTM2CTL1+5                                               05651000
RTM2SGA  EQU   RTM2PMKA                                                 05652000
RTM2EUA  EQU   RTM2PMKA                                                 05653000
RTM2DOA  EQU   RTM2PMKA                                                 05654000
RTM2FPA  EQU   RTM2PMKA                                                 05655000
RTM2CCA  EQU   RTM2PMKA                                                 05656000
RTM2ILA  EQU   RTM2PMKA                                                 05657000
RTM2INTA EQU   RTM2CTL1+2                                               05658000
RTM2SPVA EQU   RTM2MWPA                                                 05659000
RTM2WATA EQU   RTM2MWPA                                                 05660000
RTM2MCKA EQU   RTM2MWPA                                                 05661000
@NM00059 EQU   RTM2MWPA                                                 05662000
RTM2KEYA EQU   RTM2MWPA                                                 05663000
RTM2EXTA EQU   RTM2CMKA                                                 05664000
RTM2IOA  EQU   RTM2CMKA                                                 05665000
@NM00058 EQU   RTM2PARQ+1                                               05666000
RTM2SIZE EQU   RTM2SPLL+1                                               05667000
RTM2SUBP EQU   RTM2SPLL                                                 05668000
RTM2SCBO EQU   RTM2SCBS+8                                               05669000
RTM2SCBN EQU   RTM2SCBS+4                                               05670000
RTM2SCBC EQU   RTM2SCBS                                                 05671000
RTM2STAR EQU   RTM2TRRC+10                                              05672000
RTM2RBST EQU   RTM2TRRC+6                                               05673000
RTM2FIOB EQU   RTM2IOBP+1                                               05674000
@NM00057 EQU   RTM2IOBP                                                 05675000
@NM00056 EQU   RTM2TRRC+1                                               05676000
@NM00055 EQU   RTM2IOFS                                                 05677000
RTM2NIOP EQU   RTM2IOFS                                                 05678000
RTM2NOIO EQU   RTM2IOFS                                                 05679000
RTM2IOHT EQU   RTM2IOFS                                                 05680000
RTM2IOQR EQU   RTM2IOFS                                                 05681000
RTM2ERFL EQU   RTM2ERRD                                                 05682000
RTM2MCIV EQU   RTM2ERRD                                                 05683000
RTM2RPIV EQU   RTM2ERRD                                                 05684000
RTM2MABD EQU   RTM2ERRD                                                 05685000
RTM2CTS  EQU   RTM2ERRD                                                 05686000
RTM2STAE EQU   RTM2ERRD                                                 05687000
RTM2NRBE EQU   RTM2ERRD                                                 05688000
RTM2CLUP EQU   RTM2ERRD                                                 05689000
@NM00054 EQU   RTM2ERRC                                                 05690000
RTM2EAS  EQU   RTM2ERRC                                                 05691000
RTM2PERC EQU   RTM2ERRC                                                 05692000
RTM2IRB  EQU   RTM2ERRC                                                 05693000
RTM2STAI EQU   RTM2ERRC                                                 05694000
RTM2STAF EQU   RTM2ERRC                                                 05695000
RTM2SRBM EQU   RTM2ERRB                                                 05696000
RTM2LDIS EQU   RTM2ERRB                                                 05697000
RTM2ENRB EQU   RTM2ERRB                                                 05698000
RTM2TYP1 EQU   RTM2ERRB                                                 05699000
@NM00053 EQU   RTM2ERRB                                                 05700000
RTM2PGIO EQU   RTM2ERRA                                                 05701000
RTM2TEXC EQU   RTM2ERRA                                                 05702000
RTM2SVCE EQU   RTM2ERRA                                                 05703000
RTM2ABTM EQU   RTM2ERRA                                                 05704000
RTM2SVCD EQU   RTM2ERRA                                                 05705000
RTM2RKEY EQU   RTM2ERRA                                                 05706000
RTM2PCHK EQU   RTM2ERRA                                                 05707000
RTM2MCHK EQU   RTM2ERRA                                                 05708000
RTM2TIME EQU   RTM2EEDH+20                                              05709000
RTM2RFSA EQU   RTM2EEDH+16                                              05710000
@NM00052 EQU   RTM2EEDH+14                                              05711000
RTM2VEQR EQU   RTM2RSR2                                                 05712000
RTM2PGFX EQU   RTM2RSR2                                                 05713000
RTM2FLSQ EQU   RTM2RSR2                                                 05714000
RTM2FSQA EQU   RTM2RSR2                                                 05715000
RTM2NUCL EQU   RTM2RSR2                                                 05716000
RTM2SPER EQU   RTM2RSR2                                                 05717000
RTM2INTC EQU   RTM2RSR2                                                 05718000
RTM2OFLN EQU   RTM2RSR2                                                 05719000
RTM2CHNG EQU   RTM2RSR1                                                 05720000
RTM2MSER EQU   RTM2RSR1                                                 05721000
@NM00051 EQU   RTM2RSR1                                                 05722000
RTM2CPID EQU   RTM2EEDH+10                                              05723000
RTM2TERR EQU   RTM2MCHD                                                 05724000
RTM2SOFT EQU   RTM2MCHD                                                 05725000
RTM2INSF EQU   RTM2MCHD                                                 05726000
RTM2ACR  EQU   RTM2MCHD                                                 05727000
RTM2SCK  EQU   RTM2MCHD                                                 05728000
RTM2PSWU EQU   RTM2MCHD                                                 05729000
RTM2REGU EQU   RTM2MCHD                                                 05730000
RTM2SKYF EQU   RTM2MCHD                                                 05731000
@NM00050 EQU   RTM2MCHS                                                 05732000
RTM2RSRF EQU   RTM2MCHS                                                 05733000
RTM2RSRC EQU   RTM2MCHS                                                 05734000
RTM2INVP EQU   RTM2MCHS                                                 05735000
RTM2TSVL EQU   RTM2MCHS                                                 05736000
RTM2RCDF EQU   RTM2MCHS                                                 05737000
RTM2SRVL EQU   RTM2MCHS                                                 05738000
RTM2SCKE EQU   RTM2STCK+4                                               05739000
RTM2SCKB EQU   RTM2STCK                                                 05740000
RTM2TRAN EQU   RTM2AEC1+4                                               05741000
RTM2IPC1 EQU   RTM2ICD1                                                 05742000
RTM2IMC1 EQU   RTM2ICD1                                                 05743000
RTM2IPR1 EQU   RTM2ICD1                                                 05744000
@NM00049 EQU   RTM2INC1                                                 05745000
@NM00048 EQU   RTM2ILC1                                                 05746000
RTM2IL1  EQU   RTM2ILC1                                                 05747000
@NM00047 EQU   RTM2ILC1                                                 05748000
@NM00046 EQU   RTM2AEC1                                                 05749000
RTM2ADD1 EQU   RTM2NXT1+1                                               05750000
@NM00045 EQU   RTM2NXT1                                                 05751000
@NM00044 EQU   RTM2EPSW+3                                               05752000
RTM2SGN1 EQU   RTM2INT1                                                 05753000
RTM2EXP1 EQU   RTM2INT1                                                 05754000
RTM2DEC1 EQU   RTM2INT1                                                 05755000
RTM2FPO1 EQU   RTM2INT1                                                 05756000
RTM2CC1  EQU   RTM2INT1                                                 05757000
@NM00043 EQU   RTM2INT1                                                 05758000
RTM2PGM1 EQU   RTM2MWP1                                                 05759000
RTM2WAT1 EQU   RTM2MWP1                                                 05760000
RTM2MCK1 EQU   RTM2MWP1                                                 05761000
RTM2ECT1 EQU   RTM2MWP1                                                 05762000
RTM2KEY1 EQU   RTM2MWP1                                                 05763000
RTM2EXT1 EQU   RTM2EMK1                                                 05764000
RTM2AIO1 EQU   RTM2EMK1                                                 05765000
RTM2TRM1 EQU   RTM2EMK1                                                 05766000
RTM2EAM1 EQU   RTM2EMK1                                                 05767000
@NM00042 EQU   RTM2EMK1                                                 05768000
RTM2PER1 EQU   RTM2EMK1                                                 05769000
@NM00041 EQU   RTM2EMK1                                                 05770000
RTM2ER15 EQU   RTM2EREG+60                                              05771000
RTM2ER14 EQU   RTM2EREG+56                                              05772000
RTM2ER13 EQU   RTM2EREG+52                                              05773000
RTM2ER12 EQU   RTM2EREG+48                                              05774000
RTM2ER11 EQU   RTM2EREG+44                                              05775000
RTM2ER10 EQU   RTM2EREG+40                                              05776000
RTM2ER9  EQU   RTM2EREG+36                                              05777000
RTM2ER8  EQU   RTM2EREG+32                                              05778000
RTM2ER7  EQU   RTM2EREG+28                                              05779000
RTM2ER6  EQU   RTM2EREG+24                                              05780000
RTM2ER5  EQU   RTM2EREG+20                                              05781000
RTM2ER4  EQU   RTM2EREG+16                                              05782000
RTM2ER3  EQU   RTM2EREG+12                                              05783000
RTM2ER2  EQU   RTM2EREG+8                                               05784000
RTM2ER1  EQU   RTM2EREG+4                                               05785000
RTM2ER0  EQU   RTM2EREG                                                 05786000
RTM2VRBT EQU   RTM2WA+52                                                05787000
RTM2TCBT EQU   RTM2WA+48                                                05788000
RTM2SFWA EQU   RTM2WA+32                                                05789000
RTM2CC   EQU   RTM2CODE+1                                               05790000
@NM00040 EQU   RTM2CCF                                                  05791000
RTM2EOT  EQU   RTM2CCF                                                  05792000
RTM2EOM  EQU   RTM2CCF                                                  05793000
RTM2R0DP EQU   RTM2CCF                                                  05794000
RTM2STEP EQU   RTM2CCF                                                  05795000
RTM2DREQ EQU   RTM2CCF                                                  05796000
RTM2ASC  EQU   RTM2WA+24                                                05797000
RTM2TCBC EQU   RTM2WA+16                                                05798000
RTM2LGTH EQU   RTM2RT2D+1                                               05799000
RTM2SPID EQU   RTM2RT2D                                                 05800000
RTM2ADDR EQU   RTM2DESC+4                                               05801000
RTM2ID   EQU   RTM2DESC                                                 05802000
RMPLDCBL EQU   RMPL+20                                                  05803000
RMPLRMWA EQU   RMPL+16                                                  05804000
RMPLRBPA EQU   RMPL+12                                                  05805000
RMPLTCBA EQU   RMPL+8                                                   05806000
RMPLASCB EQU   RMPL+4                                                   05807000
RMPLASID EQU   RMPL+2                                                   05808000
RMPLFLG2 EQU   RMPL+1                                                   05809000
@NM00039 EQU   RMPLFLG1                                                 05810000
RMPLWT1M EQU   RMPLFLG1                                                 05811000
RMPLJST  EQU   RMPLFLG1                                                 05812000
RMPLRCOV EQU   RMPLFLG1                                                 05813000
RMPLIPUF EQU   RMPLFLG1                                                 05814000
RMPLRBPP EQU   RMPLFLG1                                                 05815000
RMPLTERM EQU   RMPLFLG1                                                 05816000
RMPLTYPE EQU   RMPLFLG1                                                 05817000
SNPHDRA  EQU   SNPPARMS+20                                              05818000
SNPSTOR  EQU   SNPPARMS+16                                              05819000
SNPTCBA  EQU   SNPPARMS+12                                              05820000
SNPDCB   EQU   SNPPARMS+8                                               05821000
@NM00038 EQU   SNPPARMS+7                                               05822000
@NM00037 EQU   SNPPDATA                                                 05823000
SNPSPLS  EQU   SNPPDATA                                                 05824000
SNPPSW   EQU   SNPPDATA                                                 05825000
SNPJPA   EQU   SNPPDATA                                                 05826000
SNPLPA   EQU   SNPPDATA                                                 05827000
SNPREGS  EQU   SNPPDATA                                                 05828000
SNPSAVE2 EQU   SNPPDATA                                                 05829000
SNPSAVE  EQU   SNPPDATA                                                 05830000
@NM00036 EQU   SNPSDAT1                                                 05831000
SNPERR   EQU   SNPSDAT1                                                 05832000
SNPIO    EQU   SNPSDAT1                                                 05833000
SNPDM    EQU   SNPSDAT0                                                 05834000
SNPQCB   EQU   SNPSDAT0                                                 05835000
SNPCB    EQU   SNPSDAT0                                                 05836000
SNPTRT   EQU   SNPSDAT0                                                 05837000
SNPSWA   EQU   SNPSDAT0                                                 05838000
SNPLSQA  EQU   SNPSDAT0                                                 05839000
SNPSQA   EQU   SNPSDAT0                                                 05840000
SNPNUC   EQU   SNPSDAT0                                                 05841000
@NM00035 EQU   SNPPARMS+2                                               05842000
SNPHDR   EQU   SNPFLAG                                                  05843000
SNPSLIST EQU   SNPFLAG                                                  05844000
SNPTCB   EQU   SNPFLAG                                                  05845000
SNPID    EQU   SNPFLAG                                                  05846000
SNPABEND EQU   SNPFLAG                                                  05847000
SNPVS2EN EQU   SNPFLAG                                                  05848000
SNPVS2   EQU   SNPFLAG                                                  05849000
SNPSNAP  EQU   SNPFLAG                                                  05850000
SNPIDENT EQU   SNPPARMS                                                 05851000
SVRBEND  EQU   RBSECT+192                                               05852000
RBFEPARM EQU   RBSECT+168                                               05853000
SIRBEND  EQU   RBSECT+168                                               05854000
RBRSV158 EQU   RBRSV150                                                 05855000
RBRSV157 EQU   RBRSV150                                                 05856000
RBRSV156 EQU   RBRSV150                                                 05857000
RBRSV155 EQU   RBRSV150                                                 05858000
RBRSV154 EQU   RBRSV150                                                 05859000
RBRSV153 EQU   RBRSV150                                                 05860000
RBRSV152 EQU   RBRSV150                                                 05861000
RBRSV151 EQU   RBRSV150                                                 05862000
RBRSV149 EQU   RBSECT+166                                               05863000
RBRSV148 EQU   RBSECT+164                                               05864000
RBRSV169 EQU   RBSDATA+3                                                05865000
RBSID    EQU   RBSDATA+2                                                05866000
RBSPKEY  EQU   RBSDATA+1                                                05867000
RBRSV168 EQU   RBSFLG3                                                  05868000
RBSTERMO EQU   RBSFLG3                                                  05869000
RBSBRNTR EQU   RBSFLG3                                                  05870000
RBSPRNTR EQU   RBSFLG3                                                  05871000
RBSCNCEL EQU   RBSFLG3                                                  05872000
RBSRECRD EQU   RBSFLG3                                                  05873000
RBSTERMI EQU   RBSFLG3                                                  05874000
RBRSV167 EQU   RBSFLG3                                                  05875000
RBSOWNRA EQU   RBSOWNR+1                                                05876000
RBSSUPER EQU   RBSFLGS2                                                 05877000
RBSKEY0  EQU   RBSFLGS2                                                 05878000
RBRSV166 EQU   RBSFLGS2                                                 05879000
RBRSV165 EQU   RBSFLGS2                                                 05880000
RBSINUSE EQU   RBSFLGS2                                                 05881000
RBRSV164 EQU   RBSFLGS2                                                 05882000
RBSXCTL2 EQU   RBSFLGS2                                                 05883000
RBRSV163 EQU   RBSFLGS2                                                 05884000
RBSPARMA EQU   RBSPARM+1                                                05885000
RBSHALT  EQU   RBSIOPRC                                                 05886000
RBSNOIOP EQU   RBSIOPRC                                                 05887000
RBSASYNC EQU   RBSFLGS1                                                 05888000
RBRSV162 EQU   RBSFLGS1                                                 05889000
RBSESTAE EQU   RBSFLGS1                                                 05890000
RBSDUMMY EQU   RBSFLGS1                                                 05891000
RBSSTAR  EQU   RBSFLGS1                                                 05892000
RBSSTAI  EQU   RBSFLGS1                                                 05893000
RBSEXIT  EQU   RBSCBB+4                                                 05894000
RBSCHAIN EQU   RBSCBB                                                   05895000
TIRBEND  EQU   @NM00033+8                                               05896000
PRBEND   EQU   @NM00033+8                                               05897000
RBRSV146 EQU   RBRSV138                                                 05898000
RBRSV145 EQU   RBRSV138                                                 05899000
RBRSV144 EQU   RBRSV138                                                 05900000
RBRSV143 EQU   RBRSV138                                                 05901000
RBRSV142 EQU   RBRSV138                                                 05902000
RBRSV141 EQU   RBRSV138                                                 05903000
RBRSV140 EQU   RBRSV138                                                 05904000
RBRSV139 EQU   RBRSV138                                                 05905000
RBRSV137 EQU   @NM00033+6                                               05906000
RBRSV136 EQU   @NM00033+4                                               05907000
RBRSV135 EQU   @NM00033                                                 05908000
@NM00032 EQU   RBSECT+32                                                05909000
@NM00031 EQU   @NM00029+1                                               05910000
RBSCF    EQU   @NM00030                                                 05911000
RBPGMQ1  EQU   RBPGMQ+1                                                 05912000
@NM00028 EQU   RBPGMQ                                                   05913000
@NM00027 EQU   RBSECT+16                                                05914000
@NM00026 EQU   @NM00022                                                 05915000
@NM00025 EQU   @NM00022                                                 05916000
RBIQETP  EQU   @NM00022                                                 05917000
RBUSIQE  EQU   RBETXR                                                   05918000
RBATTN   EQU   @NM00022                                                 05919000
@NM00024 EQU   @NM00022                                                 05920000
@NM00023 EQU   @NM00022                                                 05921000
RBPMSVRB EQU   @NM00020                                                 05922000
RBATNXIT EQU   @NM00020                                                 05923000
@NM00021 EQU   @NM00020                                                 05924000
RBWAITP  EQU   @NM00020                                                 05925000
RBFNSVRB EQU   RBTRSVRB                                                 05926000
RBFTP    EQU   @NM00020                                                 05927000
RBSIZE   EQU   RBSECT+8                                                 05928000
RBABOPSW EQU   RBSECT+4                                                 05929000
RBPPSAV1 EQU   RBPPSAV+1                                                05930000
@NM00018 EQU   RBPPSAV                                                  05931000
RBPRFXND EQU   RBPREFIX+64                                              05932000
RBINTCOD EQU   RBINTCDA+1                                               05933000
RBINLNTH EQU   RBINTCDA                                                 05934000
RBWCSA   EQU   RBPREFIX+60                                              05935000
RBRSV004 EQU   RBPREFIX+57                                              05936000
RBSSSYN  EQU   RBFLAGS1                                                 05937000
RBSCB    EQU   RBFLAGS1                                                 05938000
RBLONGWT EQU   RBFLAGS1                                                 05939000
RBASIR   EQU   RBFLAGS1                                                 05940000
RBRSV159 EQU   RBFLAGS1                                                 05941000
RBABEND  EQU   RBFLAGS1                                                 05942000
RBXWAIT  EQU   RBFLAGS1                                                 05943000
RBSLOCK  EQU   RBFLAGS1                                                 05944000
RBRTRAN  EQU   RBRTPSW2+4                                               05945000
RBRTINCD EQU   RBRTICIL+2                                               05946000
RBRTILC  EQU   RBRTICIL+1                                               05947000
RBRSV160 EQU   RBRTICIL                                                 05948000
RBRTPSW1 EQU   RBRTOPSW                                                 05949000
RBRSV062 EQU   RBRSV054                                                 05950000
RBRSV061 EQU   RBRSV054                                                 05951000
RBRSV060 EQU   RBRSV054                                                 05952000
RBRSV059 EQU   RBRSV054                                                 05953000
RBRSV058 EQU   RBRSV054                                                 05954000
RBRSV057 EQU   RBRSV054                                                 05955000
RBRSV056 EQU   RBRSV054                                                 05956000
RBRSV055 EQU   RBRSV054                                                 05957000
RBRSV053 EQU   RBPREFIX+38                                              05958000
RBRSV052 EQU   RBPREFIX+36                                              05959000
RBRSV051 EQU   RBPREFIX+32                                              05960000
RBPRFXST EQU   RBPREFIX+32                                              05961000
RBRSV050 EQU   RBPREFIX+28                                              05962000
RBRSV049 EQU   RBRSV041                                                 05963000
RBRSV048 EQU   RBRSV041                                                 05964000
RBRSV047 EQU   RBRSV041                                                 05965000
RBRSV046 EQU   RBRSV041                                                 05966000
RBRSV045 EQU   RBRSV041                                                 05967000
RBRSV044 EQU   RBRSV041                                                 05968000
RBRSV043 EQU   RBRSV041                                                 05969000
RBRSV042 EQU   RBRSV041                                                 05970000
RBRSV040 EQU   RBPREFIX+26                                              05971000
RBRSV039 EQU   RBPREFIX+24                                              05972000
RBRSV038 EQU   RBPREFIX+20                                              05973000
RBRSV037 EQU   RBPREFIX+16                                              05974000
RBRSV036 EQU   RBRSV028                                                 05975000
RBRSV035 EQU   RBRSV028                                                 05976000
RBRSV034 EQU   RBRSV028                                                 05977000
RBRSV033 EQU   RBRSV028                                                 05978000
RBRSV032 EQU   RBRSV028                                                 05979000
RBRSV031 EQU   RBRSV028                                                 05980000
RBRSV030 EQU   RBRSV028                                                 05981000
RBRSV029 EQU   RBRSV028                                                 05982000
RBRSV027 EQU   RBRSV019                                                 05983000
RBRSV026 EQU   RBRSV019                                                 05984000
RBRSV025 EQU   RBRSV019                                                 05985000
RBRSV024 EQU   RBRSV019                                                 05986000
RBRSV023 EQU   RBRSV019                                                 05987000
RBRSV022 EQU   RBRSV019                                                 05988000
RBRSV021 EQU   RBRSV019                                                 05989000
RBRSV020 EQU   RBRSV019                                                 05990000
RBRSV018 EQU   RBPREFIX+13                                              05991000
RBRSV017 EQU   RBPREFIX+12                                              05992000
RBSRV016 EQU   RBPREFIX+11                                              05993000
RBRSV015 EQU   RBPREFIX+10                                              05994000
RBRSV014 EQU   RBPREFIX+8                                               05995000
RBRSV013 EQU   RBPREFIX+4                                               05996000
RBRSV012 EQU   RBPREFIX                                                 05997000
XRBREG15 EQU   RBGRS15                                                  05998000
XRBREG14 EQU   RBGRS14                                                  05999000
XRBREG13 EQU   RBGRS13                                                  06000000
XRBREG12 EQU   RBGRS12                                                  06001000
XRBREG11 EQU   RBGRS11                                                  06002000
XRBREG10 EQU   RBGRS10                                                  06003000
XRBREG9  EQU   RBGRS9                                                   06004000
XRBREG8  EQU   RBGRS8                                                   06005000
XRBREG7  EQU   RBGRS7                                                   06006000
XRBREG6  EQU   RBGRS6                                                   06007000
XRBREG5  EQU   RBGRS5                                                   06008000
XRBREG4  EQU   RBGRS4                                                   06009000
XRBREG3  EQU   RBGRS3                                                   06010000
XRBREG2  EQU   RBGRS2                                                   06011000
XRBREG1  EQU   RBGRS1                                                   06012000
XRBREG0  EQU   RBGRS0                                                   06013000
XRBLNKA  EQU   RBLINKB                                                  06014000
XRBWT    EQU   RBWCF                                                    06015000
@NM00017 EQU   RBBASIC+24                                               06016000
RBOPSWPS EQU   RBOPSWB2                                                 06017000
@NM00016 EQU   RBOPSWB2                                                 06018000
@NM00015 EQU   XRBPSW                                                   06019000
@NM00014 EQU   RBBASIC+12                                               06020000
XRBWAIT  EQU   RBECBWT                                                  06021000
XRBFRRB  EQU   RBFDYN                                                   06022000
@NM00013 EQU   XSTAB2                                                   06023000
XRBACTV  EQU   RBFACTV                                                  06024000
XRBTCBP  EQU   RBTCBNXT                                                 06025000
@NM00012 EQU   XSTAB1                                                   06026000
XRBCKPT  EQU   RBFTCKPT                                                 06027000
@NM00011 EQU   XSTAB1                                                   06028000
@NM00010 EQU   RBBASIC+8                                                06029000
@NM00009 EQU   RBEXRTNM+1                                               06030000
RBTMIND3 EQU   RBTMFLD                                                  06031000
RBTMIND2 EQU   RBTMFLD                                                  06032000
RBTMCMP  EQU   RBTMFLD                                                  06033000
RBWLIM   EQU   RBTMFLD                                                  06034000
RBRSV005 EQU   RBTMFLD                                                  06035000
RBTMTOD  EQU   RBTMFLD                                                  06036000
RBTMQUE  EQU   RBTMFLD                                                  06037000
@NM00008 EQU   RBPRFX                                                   06038000
ESACC    EQU   ESACMP+1                                                 06039000
@NM00007 EQU   ESACCF                                                   06040000
ESAASID  EQU   ESACCF                                                   06041000
ESANOCC  EQU   ESACCF                                                   06042000
ESAR0DP  EQU   ESACCF                                                   06043000
ESASTEP  EQU   ESACCF                                                   06044000
ESADREQ  EQU   ESACCF                                                   06045000
@NM00006 EQU   ESARFLAG                                                 06046000
ESASLIPR EQU   ESARFLAG                                                 06047000
ESARTCR  EQU   ESARFLAG                                                 06048000
ESAFERR  EQU   ESARFLAG                                                 06049000
ESAGLREC EQU   ESARFLAG                                                 06050000
ESAINREC EQU   ESARFLAG                                                 06051000
ESASDREC EQU   ESARFLAG                                                 06052000
ESAGMREC EQU   ESARFLAG                                                 06053000
@NM00005 EQU   ESAFLAGS                                                 06054000
ESAVEOM  EQU   ESAFLAGS                                                 06055000
ESAEOT   EQU   ESAFLAGS                                                 06056000
ESANEOT  EQU   ESAFLAGS                                                 06057000
ESACTS   EQU   ESAFLAGS                                                 06058000
ESAPGNLY EQU   ESAFLAGS                                                 06059000
ESAABTRM EQU   ESAFLAGS                                                 06060000
ESARTM2  EQU   ESAFLAGS                                                 06061000
ESAWLEN  EQU   ESART2D+1                                                06062000
ESAWSPID EQU   ESART2D                                                  06063000
ESART2WA EQU   RTM2ESA+32                                               06064000
ESAEEDQ  EQU   RTM2ESA+28                                               06065000
ESAR14   EQU   ESAREGS+24                                               06066000
ESAR7    EQU   ESAREGS+20                                               06067000
ESAR5    EQU   ESAREGS+16                                               06068000
ESAR4    EQU   ESAREGS+12                                               06069000
ESAR3    EQU   ESAREGS+8                                                06070000
ESACC1   EQU   ESAR1+1                                                  06071000
@NM00004 EQU   ESACCF1                                                  06072000
ESAEOT1  EQU   ESACCF1                                                  06073000
ESAEOM1  EQU   ESACCF1                                                  06074000
ESAR0DP1 EQU   ESACCF1                                                  06075000
ESASTEP1 EQU   ESACCF1                                                  06076000
ESADREQ1 EQU   ESACCF1                                                  06077000
ESAR0    EQU   ESAREGS                                                  06078000
CVTLEVL  EQU   CVTRELNO+2                                               06079000
CVTMDL   EQU   CVTFIX+250                                               06080000
@NM00003 EQU   CVTFIX+248                                               06081000
@NM00002 EQU   CVTFIX                                                   06082000
CVTRV482 EQU   CVTXTNT2+128                                             06083000
CVTRV481 EQU   CVTXTNT2+124                                             06084000
CVTRV480 EQU   CVTXTNT2+120                                             06085000
CVTRV479 EQU   CVTXTNT2+118                                             06086000
CVTRV478 EQU   CVTXTNT2+117                                             06087000
CVTRV477 EQU   CVTXTNT2+116                                             06088000
CVTRV476 EQU   CVTXTNT2+115                                             06089000
CVTRV475 EQU   CVTXTNT2+114                                             06090000
CVTRV474 EQU   CVTRV466                                                 06091000
CVTRV473 EQU   CVTRV466                                                 06092000
CVTRV472 EQU   CVTRV466                                                 06093000
CVTRV471 EQU   CVTRV466                                                 06094000
CVTRV470 EQU   CVTRV466                                                 06095000
CVTRV469 EQU   CVTRV466                                                 06096000
CVTRV468 EQU   CVTRV466                                                 06097000
CVTRV467 EQU   CVTRV466                                                 06098000
CVTRV465 EQU   CVTRV457                                                 06099000
CVTRV464 EQU   CVTRV457                                                 06100000
CVTRV463 EQU   CVTRV457                                                 06101000
CVTRV462 EQU   CVTRV457                                                 06102000
CVTRV461 EQU   CVTRV457                                                 06103000
CVTRV460 EQU   CVTRV457                                                 06104000
CVTRV459 EQU   CVTRV457                                                 06105000
CVTRV458 EQU   CVTRV457                                                 06106000
CVTRV456 EQU   CVTXTNT2+108                                             06107000
CVTRV455 EQU   CVTXTNT2+104                                             06108000
CVTRV454 EQU   CVTXTNT2+100                                             06109000
CVTRV453 EQU   CVTXTNT2+96                                              06110000
CVTRV452 EQU   CVTXTNT2+94                                              06111000
CVTRV451 EQU   CVTXTNT2+92                                              06112000
CVTRV450 EQU   CVTXTNT2+90                                              06113000
CVTRV449 EQU   CVTXTNT2+88                                              06114000
CVTRV448 EQU   CVTXTNT2+87                                              06115000
CVTRV447 EQU   CVTXTNT2+86                                              06116000
CVTRV446 EQU   CVTRV438                                                 06117000
CVTRV445 EQU   CVTRV438                                                 06118000
CVTRV444 EQU   CVTRV438                                                 06119000
CVTRV443 EQU   CVTRV438                                                 06120000
CVTRV442 EQU   CVTRV438                                                 06121000
CVTRV441 EQU   CVTRV438                                                 06122000
CVTRV440 EQU   CVTRV438                                                 06123000
CVTRV439 EQU   CVTRV438                                                 06124000
CVTRV437 EQU   CVTRV429                                                 06125000
CVTRV436 EQU   CVTRV429                                                 06126000
CVTRV435 EQU   CVTRV429                                                 06127000
CVTRV434 EQU   CVTRV429                                                 06128000
CVTRV433 EQU   CVTRV429                                                 06129000
CVTRV432 EQU   CVTRV429                                                 06130000
CVTRV431 EQU   CVTRV429                                                 06131000
CVTRV430 EQU   CVTRV429                                                 06132000
CVTRV428 EQU   CVTXTNT2+80                                              06133000
CVTRV427 EQU   CVTXTNT2+76                                              06134000
CVTRV426 EQU   CVTXTNT2+72                                              06135000
CVTRV425 EQU   CVTXTNT2+68                                              06136000
CVTATACT EQU   CVTATCVT                                                 06137000
CVTRV423 EQU   CVTXTNT2+62                                              06138000
CVTRV422 EQU   CVTXTNT2+60                                              06139000
CVTRV421 EQU   CVTXTNT2+58                                              06140000
CVTRV420 EQU   CVTXTNT2+56                                              06141000
CVTRV419 EQU   CVTXTNT2+55                                              06142000
CVTRV418 EQU   CVTXTNT2+54                                              06143000
CVTRV417 EQU   CVTRV409                                                 06144000
CVTRV416 EQU   CVTRV409                                                 06145000
CVTRV415 EQU   CVTRV409                                                 06146000
CVTRV414 EQU   CVTRV409                                                 06147000
CVTRV413 EQU   CVTRV409                                                 06148000
CVTRV412 EQU   CVTRV409                                                 06149000
CVTRV411 EQU   CVTRV409                                                 06150000
CVTRV410 EQU   CVTRV409                                                 06151000
CVTRV408 EQU   CVTRV400                                                 06152000
CVTRV407 EQU   CVTRV400                                                 06153000
CVTRV406 EQU   CVTRV400                                                 06154000
CVTRV405 EQU   CVTRV400                                                 06155000
CVTRV404 EQU   CVTRV400                                                 06156000
CVTRV403 EQU   CVTRV400                                                 06157000
CVTRV402 EQU   CVTRV400                                                 06158000
CVTRV401 EQU   CVTRV400                                                 06159000
CVTICB   EQU   CVTXTNT2+48                                              06160000
CVTSKTA  EQU   CVTXTNT2+44                                              06161000
CVTRSV99 EQU   CVTXTNT2+40                                              06162000
CVTRSV98 EQU   CVTXTNT2+36                                              06163000
CVTRSV97 EQU   CVTXTNT2+34                                              06164000
CVTRSV96 EQU   CVTXTNT2+32                                              06165000
CVTOLTEP EQU   CVTXTNT2+28                                              06166000
CVTQIDA  EQU   CVTQID+1                                                 06167000
CVTRSV95 EQU   CVTQID                                                   06168000
CVTRSV94 EQU   CVTXTNT2+20                                              06169000
CVTRSV93 EQU   CVTXTNT2+16                                              06170000
CVTRSV92 EQU   CVTXTNT2+12                                              06171000
CVTDEBVR EQU   CVTXTNT2+8                                               06172000
CVTRSV91 EQU   CVTXTNT2+6                                               06173000
CVTRSV9H EQU   CVTFLGBT                                                 06174000
CVTRSV9G EQU   CVTFLGBT                                                 06175000
CVTRSV9F EQU   CVTFLGBT                                                 06176000
CVTRSV9E EQU   CVTFLGBT                                                 06177000
CVTRSV9D EQU   CVTFLGBT                                                 06178000
CVTBAH   EQU   CVTFLGBT                                                 06179000
CVTVME   EQU   CVTFLGBT                                                 06180000
CVTNPE   EQU   CVTFLGBT                                                 06181000
CVTNUCLS EQU   CVTXTNT2+4                                               06182000
CVTDSSVA EQU   CVTDSSV+1                                                06183000
CVTRSV89 EQU   CVTDSSV                                                  06184000
CVTRSV88 EQU   CVTXTNT1+8                                               06185000
CVTRSV87 EQU   CVTXTNT1+4                                               06186000
CVTFACHN EQU   CVTXTNT1                                                 06187000
CVTRV488 EQU   CVTMAP+412                                               06188000
CVTRV487 EQU   CVTMAP+408                                               06189000
CVTRV486 EQU   CVTMAP+404                                               06190000
CVTRV485 EQU   CVTMAP+400                                               06191000
CVTACTAP EQU   CVTMAP+396                                               06192000
CVTAUTH  EQU   CVTMAP+392                                               06193000
CVTRV490 EQU   CVTMAP+388                                               06194000
CVTRSV61 EQU   CVTMAP+384                                               06195000
CVTVOLT1 EQU   CVTVOLM1+1                                               06196000
CVTVOLI1 EQU   CVTVOLF1                                                 06197000
CVTSTOA  EQU   CVTMAP+376                                               06198000
CVTRSV58 EQU   CVTMAP+374                                               06199000
CVTRSV57 EQU   CVTMAP+372                                               06200000
CVTDDCE  EQU   CVTMAP+368                                               06201000
CVTPNWFR EQU   CVTMAP+364                                               06202000
CVTSMF   EQU   CVTMAP+360                                               06203000
CVTSULK  EQU   CVTMAP+358                                               06204000
CVTSLKO  EQU   CVTSYSK                                                  06205000
CVTSLKP  EQU   CVTSYSK                                                  06206000
CVTSLKQ  EQU   CVTSYSK                                                  06207000
CVTSLKR  EQU   CVTSYSK                                                  06208000
CVTRSV56 EQU   CVTSYSK                                                  06209000
CVTRSV55 EQU   CVTSYSK                                                  06210000
CVTRSV54 EQU   CVTSYSK                                                  06211000
CVTRSV53 EQU   CVTSYSK                                                  06212000
CVTRSV52 EQU   CVTA1F1                                                  06213000
CVTRSV51 EQU   CVTA1F1                                                  06214000
CVTRSV50 EQU   CVTA1F1                                                  06215000
CVTRSV49 EQU   CVTA1F1                                                  06216000
CVTRSV48 EQU   CVTA1F1                                                  06217000
CVTRSV47 EQU   CVTA1F1                                                  06218000
CVTSRSW  EQU   CVTA1F1                                                  06219000
CVTPFSW  EQU   CVTA1F1                                                  06220000
CVTPCVT  EQU   CVTMAP+352                                               06221000
CVTRSV46 EQU   CVTMAP+344                                               06222000
CVTRSV45 EQU   CVTMAP+340                                               06223000
CVTRSV44 EQU   CVTMAP+338                                               06224000
CVTRSV43 EQU   CVTMAP+336                                               06225000
CVTHJESA EQU   CVTHJES+1                                                06226000
CVTRSV42 EQU   CVTHJES                                                  06227000
CVTEXT2A EQU   CVTEXT2+1                                                06228000
CVTRSV41 EQU   CVTEXT2                                                  06229000
CVTAPFA  EQU   CVTAPF+1                                                 06230000
CVTRSV40 EQU   CVTAPF                                                   06231000
CVTRV518 EQU   CVTINTLA                                                 06232000
CVTRV517 EQU   CVTERPV                                                  06233000
CVTEORM  EQU   CVTMAP+312                                               06234000
CVTMCHPR EQU   CVTMAP+308                                               06235000
CVTTZ    EQU   CVTMAP+304                                               06236000
CVTJEPS  EQU   CVTMAP+300                                               06237000
CVTJESCT EQU   CVTMAP+296                                               06238000
CVTMODE  EQU   CVTMAP+292                                               06239000
CVTPTRV  EQU   CVTMAP+288                                               06240000
CVTREAL  EQU   CVTMAP+284                                               06241000
CVTRSV39 EQU   CVTMAP+280                                               06242000
CVTRSV38 EQU   CVTMAP+276                                               06243000
CVTDMSRA EQU   CVTDMSR+1                                                06244000
CVTRV634 EQU   CVTDMSRF                                                 06245000
CVTRV633 EQU   CVTDMSRF                                                 06246000
CVTRV632 EQU   CVTDMSRF                                                 06247000
CVTRV631 EQU   CVTDMSRF                                                 06248000
CVTRV630 EQU   CVTDMSRF                                                 06249000
CVTRV629 EQU   CVTDMSRF                                                 06250000
CVTUDUMP EQU   CVTDMSRF                                                 06251000
CVTSDUMP EQU   CVTDMSRF                                                 06252000
CVTQMSGA EQU   CVTQMSG+1                                                06253000
CVTRSV36 EQU   CVTQMSG                                                  06254000
CVTAMFF  EQU   CVTMAP+264                                               06255000
CVTPURGA EQU   CVTPURG+1                                                06256000
CVTRSV35 EQU   CVTPURG                                                  06257000
CVTCBSP  EQU   CVTMAP+256                                               06258000
CVTATERA EQU   CVTATER+1                                                06259000
CVTSYST  EQU   CVTATER                                                  06260000
CVTVOLT2 EQU   CVTTAT                                                   06261000
CVTVOLI2 EQU   CVTVOLF2                                                 06262000
CVTAQAVB EQU   CVTAQAVT+1                                               06263000
CVTRSV34 EQU   CVTTCMFG                                                 06264000
CVTRSV33 EQU   CVTTCMFG                                                 06265000
CVTRSV32 EQU   CVTTCMFG                                                 06266000
CVTRSV31 EQU   CVTTCMFG                                                 06267000
CVTRSV30 EQU   CVTTCMFG                                                 06268000
CVTRSV29 EQU   CVTTCMFG                                                 06269000
CVTLDEV  EQU   CVTTCMFG                                                 06270000
CVTTCRDY EQU   CVTTCMFG                                                 06271000
CVTGTFA  EQU   CVTGTF+1                                                 06272000
CVTRSV27 EQU   CVTGTFST                                                 06273000
CVTRNIO  EQU   CVTGTFST                                                 06274000
CVTUSR   EQU   CVTGTFST                                                 06275000
CVTRV318 EQU   CVTFORM                                                  06276000
CVTRV317 EQU   CVTTMODE                                                 06277000
CVTRV316 EQU   CVTSTATE                                                 06278000
CVTRV315 EQU   CVTGTFS                                                  06279000
CVTGTFAV EQU   CVTGTFS                                                  06280000
CVT0SCR1 EQU   CVTMAP+232                                               06281000
CVTRV515 EQU   CVTMAP+228                                               06282000
CVTRMS   EQU   CVTMAP+224                                               06283000
CVTPATCH EQU   CVTMAP+220                                               06284000
CVTTSCE  EQU   CVTMAP+216                                               06285000
CVTLNKSC EQU   CVTMAP+214                                               06286000
CVTQABST EQU   CVTMAP+212                                               06287000
CVTMDLDS EQU   CVTMAP+208                                               06288000
CVTUSER  EQU   CVTMAP+204                                               06289000
CVTABEND EQU   CVTMAP+200                                               06290000
CVTSMCA  EQU   CVTMAP+196                                               06291000
CVTRSV18 EQU   CVTMAP+192                                               06292000
CVTQLPAQ EQU   CVTMAP+188                                               06293000
CVTQCDSR EQU   CVTMAP+184                                               06294000
CVTRSV17 EQU   CVTOPTB                                                  06295000
CVTVS1A  EQU   CVTOPTB                                                  06296000
CVTFP    EQU   CVTOPTB                                                  06297000
CVTAPTHR EQU   CVTOPTB                                                  06298000
CVTNLOG  EQU   CVTOPTB                                                  06299000
CVTTOD   EQU   CVTOPTB                                                  06300000
CVTCTIMS EQU   CVTOPTB                                                  06301000
CVTPROT  EQU   CVTOPTB                                                  06302000
CVTXPFP  EQU   CVTOPTA                                                  06303000
CVTASCII EQU   CVTOPTA                                                  06304000
CVTRSV13 EQU   CVTOPTA                                                  06305000
CVTRSV12 EQU   CVTOPTA                                                  06306000
CVTNIP   EQU   CVTOPTA                                                  06307000
CVTDDR   EQU   CVTOPTA                                                  06308000
CVTAPR   EQU   CVTOPTA                                                  06309000
CVTCCH   EQU   CVTOPTA                                                  06310000
CVTSNCTR EQU   CVTMAP+180                                               06311000
CVTQMWR  EQU   CVTMAP+176                                               06312000
CVTQOCR  EQU   CVTMAP+172                                               06313000
CVT1EF00 EQU   CVTMAP+168                                               06314000
CVTMZ00  EQU   CVTMAP+164                                               06315000
CVTHEAD  EQU   CVTMAP+160                                               06316000
CVTRSV11 EQU   CVTMAP+156                                               06317000
CVT0PT01 EQU   CVTMAP+152                                               06318000
CVTMSER  EQU   CVTMAP+148                                               06319000
CVTRV516 EQU   CVTIERLC                                                 06320000
CVTILCH  EQU   CVTMAP+140                                               06321000
CVT0DS   EQU   CVTMAP+136                                               06322000
CVTFBOSV EQU   CVTMAP+132                                               06323000
CVTNUCB  EQU   CVTMAP+128                                               06324000
CVTIXAVL EQU   CVTMAP+124                                               06325000
CVTIOQET EQU   CVTMAP+120                                               06326000
CVTDCBA  EQU   CVTMAP+117                                               06327000
CVTMVS2  EQU   CVTDCB                                                   06328000
CVT6DAT  EQU   CVTDCB                                                   06329000
CVT4MPS  EQU   CVTDCB                                                   06330000
CVTRSV09 EQU   CVTDCB                                                   06331000
CVT4MS1  EQU   CVTDCB                                                   06332000
CVT2SPS  EQU   CVTDCB                                                   06333000
CVT1SSS  EQU   CVTDCB                                                   06334000
CVTRSV08 EQU   CVTDCB                                                   06335000
CVTSTB   EQU   CVTMAP+112                                               06336000
CVTQTD00 EQU   CVTMAP+108                                               06337000
CVTQTE00 EQU   CVTMAP+104                                               06338000
CVTCUCB  EQU   CVTMAP+100                                               06339000
CVTSJQ   EQU   CVTMAP+96                                                06340000
CVTPBLDL EQU   CVTMAP+92                                                06341000
CVTTPC   EQU   CVTMAP+88                                                06342000
CVTSVDCB EQU   CVTMAP+84                                                06343000
CVTBRET  EQU   CVTMAP+82                                                06344000
CVTEXIT  EQU   CVTMAP+80                                                06345000
CVT0FN00 EQU   CVTMAP+76                                                06346000
CVTDARA  EQU   CVTDAR+1                                                 06347000
CVTRSV07 EQU   CVTFLGS1                                                 06348000
CVTRSV06 EQU   CVTFLGS1                                                 06349000
CVTRSV05 EQU   CVTFLGS1                                                 06350000
CVTRSV04 EQU   CVTFLGS1                                                 06351000
CVTRSV03 EQU   CVTFLGS1                                                 06352000
CVTRSV02 EQU   CVTFLGS1                                                 06353000
CVTRSV01 EQU   CVTFLGS1                                                 06354000
CVTDMPLK EQU   CVTFLGS1                                                 06355000
CVTXITP  EQU   CVTMAP+68                                                06356000
CVTZDTAB EQU   CVTMAP+64                                                06357000
CVTMSLT  EQU   CVTMAP+60                                                06358000
CVTDATE  EQU   CVTMAP+56                                                06359000
CVTSYSAD EQU   CVTMAP+48                                                06360000
CVTXTLER EQU   CVTMAP+44                                                06361000
CVTILK2  EQU   CVTMAP+40                                                06362000
CVTILK1  EQU   CVTMAP+36                                                06363000
CVTPRLTV EQU   CVTMAP+32                                                06364000
CVTPCNVT EQU   CVTMAP+28                                                06365000
CVT0VL00 EQU   CVTMAP+24                                                06366000
CVTXAPG  EQU   CVTMAP+20                                                06367000
CVTBUF   EQU   CVTMAP+16                                                06368000
CVTJOB   EQU   CVTMAP+12                                                06369000
CVTLINK  EQU   CVTMAP+8                                                 06370000
CVT0EF00 EQU   CVTMAP+4                                                 06371000
CVTTCBP  EQU   CVTMAP                                                   06372000
CVT      EQU   CVTMAP                                                   06373000
ADPLABDA EQU   ABDPL+56                                                 06374000
ADPLEXT  EQU   ABDPL+52                                                 06375000
ADPLCOM4 EQU   ABDPL+40                                                 06376000
ADPLCOM3 EQU   ABDPL+36                                                 06377000
@NM00001 EQU   ADPLFLAG                                                 06378000
ADPLDMGT EQU   ADPLFLAG                                                 06379000
ADPLSYTM EQU   ADPLFLAG                                                 06380000
ADPLSBPL EQU   ABDPL+6                                                  06381000
ADPLASID EQU   ABDPL+4                                                  06382000
ADPLTCB  EQU   ABDPL                                                    06383000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      06384000
@RC00204 EQU   @RC00200                                                 06385000
@RC00210 EQU   @RC00200                                                 06386000
@RC00308 EQU   @RC00298                                                 06387000
@RC00500 EQU   @RC00498                                                 06388000
@RC00688 EQU   @EL00007                                                 06389000
@RC00695 EQU   @EL00007                                                 06390000
@RC00693 EQU   @EL00007                                                 06391000
@RC00214 EQU   @RC00210                                                 06392000
@RC00313 EQU   @RC00308                                                 06393000
@ENDDATA EQU   *                                                        06394000
         END   IEAFTRT2,(C'PLS1147',0701,77091)                         06395000
