         TITLE 'IEAVAD09 - DISPLAY NUCLEUS                             *00001000
                        '                                               00002000
IEAVAD09 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IEAVAD09  78.062'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  ST    @14,12(,@13)                                        0001 00010000
         STM   @00,@12,20(@13)                                     0001 00011000
         BALR  @06,0                                               0001 00012000
@PSTART  DS    0H                                                  0001 00013000
         USING @PSTART,@06                                         0001 00014000
*                                                                  0037 00015000
*/*                    END OF TCB                                    */ 00016000
*                                                                  0038 00017000
*                                                                  0038 00018000
*   /*****************************************************************/ 00019000
*   /*                                                               */ 00020000
*   /* INITIALIZATION ON ENTRY FIRST THE ADDRESSING REGISTERS ARE    */ 00021000
*   /* INITIALIZED, THEN A SAVE AREA FOR THE REGISTER SAVE AREA AND  */ 00022000
*   /* AUTOMATIC DATA AREA IS OBTAINED FROM LSQA. THE ADDRESS OF THE */ 00023000
*   /* AREA IS RETURNED IN ABDGMA, AND THE ADDRESS OF THE GETMAIN    */ 00024000
*   /* PARAMETER LIST IS PASSED IN REGISTER 1. NEXT THE SAVE AREAS   */ 00025000
*   /* ARE CHAINED, AND THE TEMPORARY WORK AREA ZTEMPS IS CLEARED TO */ 00026000
*   /* ZEROS SO THAT THE BOUNDARY ADJUSTMENT MOVES CAN BE DONE       */ 00027000
*   /* PROPERLY.                                                     */ 00028000
*   /*                                                               */ 00029000
*   /*****************************************************************/ 00030000
*                                                                  0038 00031000
*   ABDARPTR=PARMPTR;               /* THE ABDAREA SAVE AREA IS    0038 00032000
*                                      INITIALIZED FROM THE VALUE IN    00033000
*                                      REGISTER 1                    */ 00034000
         LR    ABDARPTR,PARMPTR                                    0038 00035000
*   PARMPTR=ADDR(ABDASIZE);         /* REGISTER 1 IS SET TO POINT TO    00036000
*                                      THE GETMAIN PARAMETER LIST    */ 00037000
         LA    PARMPTR,ABDASIZE(,ABDARPTR)                         0039 00038000
*   GENERATE;                                                      0040 00039000
         GETMAIN EC,LV=72,                                             *00040000
               SP=253,                                                 *00041000
               A=ABDGMA(ABDARPTR),                                     *00042000
               MF=(E,(1))                                               00043000
*   IF RETCODE^=0 THEN              /* GETMAIN SUCCESSFUL            */ 00044000
         LTR   RETCODE,RETCODE                                     0041 00045000
         BZ    @RF00041                                            0041 00046000
*     SAVERET=8;                    /* NO, SET RETURN CODE           */ 00047000
         LA    SAVERET,8                                           0042 00048000
*   ELSE                                                           0043 00049000
*     DO;                                                          0043 00050000
         B     @RC00041                                            0043 00051000
@RF00041 DS    0H                                                  0044 00052000
*       PARMPTR=ABDAAREA;           /* USE PARMPTR AS TEMPORARY    0044 00053000
*                                      POINTER TO SAVE AREA          */ 00054000
         L     PARMPTR,ABDAAREA(,ABDARPTR)                         0044 00055000
*       NEXSAPTR=PARMPTR;           /* INITIALIZE NEXT SAVE AREA   0045 00056000
*                                      POINTER IN OLD SAVE AREA      */ 00057000
         ST    PARMPTR,NEXSAPTR(,SAVEPTR)                          0045 00058000
*       PRESAPTR=SAVEPTR;           /* INITIALIZE PREVIOUS SAVE AREA    00059000
*                                      POINTER IN NEW AREA           */ 00060000
         ST    SAVEPTR,PRESAPTR(,PARMPTR)                          0046 00061000
*       SAVEPTR=PARMPTR;            /* SET SAVE REGISTER TO NEW SAVE    00062000
*                                      AREA ADDRESS                  */ 00063000
         LR    SAVEPTR,PARMPTR                                     0047 00064000
*       PARMPTR=ABDARPTR;           /* INITIALIZE PARAMETER REG      */ 00065000
         LR    PARMPTR,ABDARPTR                                    0048 00066000
*       TCBPTR=ABDTCB;              /* GET TCB ADDRESS               */ 00067000
         L     TCBPTR,ABDTCB(,ABDARPTR)                            0049 00068000
*       SAVERET=0;                  /* INIT RETURN CODE              */ 00069000
         SLR   SAVERET,SAVERET                                     0050 00070000
*       IF APFNUC='1'B THEN         /* NUCLEUS DISPLAY REQUESTED     */ 00071000
         TM    APFNUC(ABDARPTR),B'10000000'                        0051 00072000
         BNO   @RF00051                                            0051 00073000
*         DO;                       /* YES                           */ 00074000
*           APFSQA='1'B;            /* DUMP SQA FOR COMPATIBILITY    */ 00075000
*           APFLSQA='1'B;           /* DUMP LSQA FOR COMPATIBILITY   */ 00076000
         OI    APFSQA(ABDARPTR),B'01100000'                        0054 00077000
*                                                                  0055 00078000
*           /*********************************************************/ 00079000
*           /*                                                       */ 00080000
*           /* THIS SECTION OF CODE PRINTS THE PREFIX STORAGE AREA   */ 00081000
*           /* AND THE NUCLEUS.                                      */ 00082000
*           /*                                                       */ 00083000
*           /*********************************************************/ 00084000
*                                                                  0055 00085000
*           DO WHILE(PSATOLD->TCBAFFN^=PSAPCCAV->PCCACAFM);/*      0055 00086000
*                                                            @ZA01853*/ 00087000
         B     @DE00055                                            0055 00088000
@DL00055 DS    0H                                                  0056 00089000
*             PSATOLD->TCBAFFN=PSAPCCAV->PCCACAFM;/* SET AFFINITY  0056 00090000
*                                                            @ZA01853*/ 00091000
         L     @14,PSATOLD                                         0056 00092000
         L     @05,PSAPCCAV                                        0056 00093000
         MVC   TCBAFFN(2,@14),PCCACAFM(@05)                        0056 00094000
*           END;                    /*                       @ZA01853*/ 00095000
@DE00055 L     @14,PSATOLD                                         0057 00096000
         L     @05,PSAPCCAV                                        0057 00097000
         CLC   TCBAFFN(2,@14),PCCACAFM(@05)                        0057 00098000
         BNE   @DL00055                                            0057 00099000
*           ABDLINEA(1:4)=PSAMSG;   /* SET UP PSA HEADING            */ 00100000
         MVC   ABDLINEA(4,ABDARPTR),PSAMSG                         0058 00101000
*           CALL IEAVAD11;          /* PRINT HEADING                 */ 00102000
         L     @15,@CV00051                                        0059 00103000
         BALR  @14,@15                                             0059 00104000
*           ABDBLOCK=0;             /* GET BEGINNING OF PSA          */ 00105000
         SLR   @14,@14                                             0060 00106000
         ST    @14,ABDBLOCK(,ABDARPTR)                             0060 00107000
*           ABDLENTH=FOURK;         /* INDICATE LENGTH TO BE DUMPED  */ 00108000
         MVC   ABDLENTH(4,ABDARPTR),@CF00057                       0061 00109000
*           CALL IEAVAD71;          /* FORMAT PSA                    */ 00110000
         L     @15,@CV00050                                        0062 00111000
         BALR  @14,@15                                             0062 00112000
*           IF RETCODE^=0 THEN      /* FORMAT SUCCESSFUL             */ 00113000
         LTR   RETCODE,RETCODE                                     0063 00114000
         BZ    @RF00063                                            0063 00115000
*             SAVERET=8;            /* NO                            */ 00116000
         LA    SAVERET,8                                           0064 00117000
*           ELSE                                                   0065 00118000
*             DO;                   /* YES, DUMP NUCLEUS             */ 00119000
         B     @RC00063                                            0065 00120000
@RF00063 DS    0H                                                  0066 00121000
*               ABDLINEA(1:8)=NUCMESS;/* SET UP NUCLEUS HEADING      */ 00122000
         MVC   ABDLINEA(8,ABDARPTR),NUCMESS                        0066 00123000
*               CALL IEAVAD11;      /* PRINT HEADING                 */ 00124000
         L     @15,@CV00051                                        0067 00125000
         BALR  @14,@15                                             0067 00126000
*               RFY                                                0068 00127000
*                 R5 RSTD;                                         0068 00128000
*               R5=CVTNUCB;         /* GET END OF NUCLEUS    @G33SPHW*/ 00129000
         L     @14,CVTPTR                                          0069 00130000
         L     R5,CVTNUCB(,@14)                                    0069 00131000
*NXTPG:                                                            0070 00132000
*               R5=R5-1;            /* GET TO END OF PAGE    @G33SPHW*/ 00133000
NXTPG    BCTR  R5,0                                                0070 00134000
*               GEN SETS(WORKB) REFS(R5);                          0071 00135000
*                             /* TEST FOR END OF NUCLEUS     @G33SPHW*/ 00136000
        LRA  WORKB,0(0,R5)     REFERENCE PAGE                 G33SPHW   00137000
        BZ   NUCEND            NUC END FOUND                  G33SPHW   00138000
*               R5=R5-FOURK+1;      /* BACKUP ONE PAGE       @G33SPHW*/ 00139000
         AL    R5,@CF01860                                         0072 00140000
*               GOTO NXTPG;         /* CHECK FOR END OF NUCLEUS    0073 00141000
*                                                            @G33SPHW*/ 00142000
         B     NXTPG                                               0073 00143000
*NUCEND:                            /* END OF NUCLEUS FOUND  @G33SPHW*/ 00144000
*               WORKB=FOURK;        /* GET BEGINNING OF NUCLEUS      */ 00145000
NUCEND   L     WORKB,@CF00057                                      0074 00146000
*               ABDBLOCK=WORKB;     /* INIT. WORK AREA               */ 00147000
         ST    WORKB,ABDBLOCK(,ABDARPTR)                           0075 00148000
*               ABDCC='F0'X;        /* DOUBLE SPACE LINE 1   @ZA29976*/ 00149000
         MVI   ABDCC(ABDARPTR),X'F0'                               0076 00150000
*               ENDNUC=R5+1;        /* GET END OF NUCLEUS    @G33SPHW*/ 00151000
         LA    ENDNUC,1                                            0077 00152000
         ALR   ENDNUC,R5                                           0077 00153000
*               RFY                                                0078 00154000
*                 R5 UNRSTD;                                       0078 00155000
*               ENDNUC=ENDNUC-WORKB;/* DETERMINE LENGTH TO DUMP      */ 00156000
         SLR   ENDNUC,WORKB                                        0079 00157000
*               ABDLENTH=ENDNUC;    /* SET UP LENGTH                 */ 00158000
         ST    ENDNUC,ABDLENTH(,ABDARPTR)                          0080 00159000
*               UPRFMET='1'B;       /* IF UPR SKIP PAGE & CONTINUE   */ 00160000
         OI    UPRFMET(ABDARPTR),B'01000000'                       0081 00161000
*               ABDUPRSL='1'B;      /* SKIP LINE BEGIN AT NEXT PAGE  */ 00162000
         OI    ABDUPRSL(ABDARPTR),B'01000000'                      0082 00163000
*               CALL IEAVAD71;      /* DISPLAY NUCLEUS               */ 00164000
         L     @15,@CV00050                                        0083 00165000
         BALR  @14,@15                                             0083 00166000
*               IF RETCODE^=0 THEN  /* DISPLAY SUCCESSFUL            */ 00167000
         LTR   RETCODE,RETCODE                                     0084 00168000
         BZ    @RF00084                                            0084 00169000
*                 SAVERET=8;        /* NO                            */ 00170000
         LA    SAVERET,8                                           0085 00171000
*             END;                                                 0086 00172000
@RF00084 DS    0H                                                  0087 00173000
*         END;                                                     0087 00174000
@RC00063 DS    0H                                                  0088 00175000
*       PSATOLD->TCBAFFN=0;         /* RESET AFFINITY OFF    @ZA01853*/ 00176000
@RF00051 SLR   @14,@14                                             0088 00177000
         L     @05,PSATOLD                                         0088 00178000
         STH   @14,TCBAFFN(,@05)                                   0088 00179000
*       PARMPTR=ADDR(ABDASIZE);     /* SET UP FREEMAIN LIST REG      */ 00180000
         LA    PARMPTR,ABDASIZE(,ABDARPTR)                         0089 00181000
*       ABDAAREA=SAVEPTR;           /* SET UP ADDRESS TO FREE        */ 00182000
         ST    SAVEPTR,ABDAAREA(,ABDARPTR)                         0090 00183000
*       SAVEPTR=SAVEPTR->PRESAPTR;  /* SET UP PREVIOUS SAVE AREA     */ 00184000
         L     SAVEPTR,PRESAPTR(,SAVEPTR)                          0091 00185000
*       NEXSAPTR=0;                 /* CLEAR POINTER TO AREA TO BE 0092 00186000
*                                      FREED                         */ 00187000
         ST    @14,NEXSAPTR(,SAVEPTR)                              0092 00188000
*       GENERATE;                                                  0093 00189000
         FREEMAIN E,LV=72,                                             *00190000
               SP=253,                                                 *00191000
               A=ABDGMA(ABDARPTR),                                     *00192000
               MF=(E,(1))                                               00193000
*     END;                                                         0094 00194000
*   RETCODE=SAVERET;                /* SET UP RETURN CODE            */ 00195000
@RC00041 LR    RETCODE,SAVERET                                     0095 00196000
*   RETURN;                                                        0096 00197000
@EL00001 DS    0H                                                  0096 00198000
@EF00001 DS    0H                                                  0096 00199000
@ER00001 L     @14,12(,@13)                                        0096 00200000
         LM    @00,@12,20(@13)                                     0096 00201000
         BR    @14                                                 0096 00202000
*   DCL                                                            0097 00203000
*     PATCHLOC FIXED(31) STATIC;                                   0097 00204000
*   GEN DATA DEFS(PATCHLOC);                                       0098 00205000
*   DECLARE                         /* COMMON VARIABLES              */ 00206000
*     I256C CHAR(256) BASED,                                       0099 00207000
*     I031F FIXED(31) BASED,                                       0099 00208000
*     I031P PTR(31) BASED,                                         0099 00209000
*     I015F FIXED(15) BASED,                                       0099 00210000
*     I015P PTR(15) BASED,                                         0099 00211000
*     I008P PTR(8) BASED,                                          0099 00212000
*     I001C CHAR(1) BASED;          /*                        @Y02705*/ 00213000
*   END IEAVAD09                                                   0100 00214000
*                                                                  0100 00215000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00216000
*/*%INCLUDE SYSLIB  (D09SPEC )                                       */ 00217000
*/*%INCLUDE SYSLIB  (D09DCL  )                                       */ 00218000
*/*%INCLUDE SYSLIB  (IHAABDA )                                       */ 00219000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00220000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00221000
*/*%INCLUDE SYSLIB  (IHAPCCA )                                       */ 00222000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 00223000
*/*%INCLUDE SYSLIB  (D09NUC  )                                       */ 00224000
*                                                                  0100 00225000
*       ;                                                          0100 00226000
         B     @EL00001                                            0100 00227000
@DATA    DS    0H                                                       00228000
@DATD    DSECT                                                          00229000
         DS    0F                                                       00230000
IEAVAD09 CSECT                                                          00231000
         DS    0F                                                       00232000
@CF00057 DC    F'4096'                                                  00233000
@CF01860 DC    F'-4095'                                                 00234000
@DATD    DSECT                                                          00235000
         DS    0D                                                       00236000
IEAVAD09 CSECT                                                          00237000
         DS    0F                                                       00238000
@SIZDATD DC    AL1(0)                                                   00239000
         DC    AL3(@ENDDATD-@DATD)                                      00240000
@CV00050 DC    V(IEAVAD71)                                              00241000
@CV00051 DC    V(IEAVAD11)                                              00242000
         DS    0D                                                       00243000
NUCONMSG DS    CL14                                                     00244000
         ORG   NUCONMSG                                                 00245000
NUCMESS  DC    CL8'-NUCLEUS'                                            00246000
@NM00001 DC    CL6' CONT.'                                              00247000
         ORG   NUCONMSG+14                                              00248000
PSAMSG   DC    CL4'-PSA'                                                00249000
IEAVAD09 CSECT                                                          00250000
         DS   0H                                                        00251000
PATCHLOC DC ((@DATA-@PSTART)/20)X'00'                                   00252000
@DATD    DSECT                                                          00253000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00254000
@ENDDATD EQU   *                                                        00255000
IEAVAD09 CSECT                                                          00256000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00257000
@01      EQU   01                                                       00258000
@02      EQU   02                                                       00259000
@03      EQU   03                                                       00260000
@04      EQU   04                                                       00261000
@05      EQU   05                                                       00262000
@06      EQU   06                                                       00263000
@07      EQU   07                                                       00264000
@08      EQU   08                                                       00265000
@09      EQU   09                                                       00266000
@10      EQU   10                                                       00267000
@11      EQU   11                                                       00268000
@12      EQU   12                                                       00269000
@13      EQU   13                                                       00270000
@14      EQU   14                                                       00271000
@15      EQU   15                                                       00272000
PARMPTR  EQU   @01                                                      00273000
ABDARPTR EQU   @02                                                      00274000
TCBPTR   EQU   @04                                                      00275000
R5       EQU   @05                                                      00276000
BASE     EQU   @06                                                      00277000
ENDNUC   EQU   @07                                                      00278000
WORKB    EQU   @08                                                      00279000
SAVERET  EQU   @09                                                      00280000
AUTOPTR  EQU   @12                                                      00281000
SAVEPTR  EQU   @13                                                      00282000
RETCODE  EQU   @15                                                      00283000
RETERN   EQU   @14                                                      00284000
R7       EQU   @07                                                      00285000
PSA      EQU   0                                                        00286000
FLCRNPSW EQU   PSA                                                      00287000
FLCROPSW EQU   PSA+8                                                    00288000
FLCICCW2 EQU   PSA+16                                                   00289000
FLCCVT   EQU   FLCICCW2                                                 00290000
PSAEEPSW EQU   PSA+132                                                  00291000
PSAESPSW EQU   PSA+136                                                  00292000
FLCSVILC EQU   PSAESPSW+1                                               00293000
PSAEPPSW EQU   PSA+140                                                  00294000
FLCPIILC EQU   PSAEPPSW+1                                               00295000
FLCPICOD EQU   PSAEPPSW+2                                               00296000
PSAPICOD EQU   FLCPICOD+1                                               00297000
FLCTEA   EQU   PSAEPPSW+4                                               00298000
FLCPER   EQU   PSA+152                                                  00299000
FLCMCLA  EQU   PSA+168                                                  00300000
FLCIOEL  EQU   FLCMCLA+4                                                00301000
FLCIOA   EQU   FLCMCLA+16                                               00302000
FLCFSA   EQU   FLCMCLA+80                                               00303000
PSAPCCAV EQU   PSA+520                                                  00304000
PSATOLD  EQU   PSA+540                                                  00305000
PSASUPER EQU   PSA+552                                                  00306000
PSASUP1  EQU   PSASUPER                                                 00307000
PSASUP2  EQU   PSASUPER+1                                               00308000
PSASUP3  EQU   PSASUPER+2                                               00309000
PSASUP4  EQU   PSASUPER+3                                               00310000
PSACLHT  EQU   PSA+640                                                  00311000
PSALKSA  EQU   PSA+696                                                  00312000
PSAHLHI  EQU   PSA+760                                                  00313000
PSADSSFL EQU   PSA+836                                                  00314000
PSADSSF1 EQU   PSADSSFL                                                 00315000
PSADSSF3 EQU   PSADSSFL+2                                               00316000
PSADSSF4 EQU   PSADSSFL+3                                               00317000
PSARSVT  EQU   PSA+896                                                  00318000
NEXSAPTR EQU   8                                                        00319000
PRESAPTR EQU   4                                                        00320000
ABDAREA  EQU   0                                                        00321000
ABDTCB   EQU   ABDAREA                                                  00322000
ABDPARMS EQU   ABDAREA+12                                               00323000
ABDFLAG  EQU   ABDPARMS+1                                               00324000
APFSDATA EQU   ABDPARMS+4                                               00325000
APFNUC   EQU   APFSDATA                                                 00326000
APFSQA   EQU   APFSDATA                                                 00327000
APFLSQA  EQU   APFSDATA                                                 00328000
APFSDAT1 EQU   ABDPARMS+5                                               00329000
APFPDATA EQU   ABDPARMS+6                                               00330000
ABDPTRS  EQU   ABDAREA+84                                               00331000
ABDFLAG1 EQU   ABDAREA+136                                              00332000
ABDFLAG2 EQU   ABDAREA+137                                              00333000
ABDRES1  EQU   ABDAREA+139                                              00334000
ABDWORK  EQU   ABDAREA+140                                              00335000
ABDUPRF  EQU   ABDAREA+265                                              00336000
UPRFMET  EQU   ABDUPRF                                                  00337000
ABDUPRFN EQU   ABDAREA+266                                              00338000
ABDUPRSL EQU   ABDUPRFN                                                 00339000
ABDBLNKS EQU   ABDAREA+267                                              00340000
ABDBLOCK EQU   ABDAREA+272                                              00341000
ABDLENTH EQU   ABDAREA+276                                              00342000
ABDBUFFS EQU   ABDAREA+308                                              00343000
ABDGMA   EQU   ABDAREA+316                                              00344000
ABDAAREA EQU   ABDGMA                                                   00345000
ABDASIZE EQU   ABDGMA+4                                                 00346000
ESPARM   EQU   ABDAREA+340                                              00347000
ESTAEFLG EQU   ESPARM+28                                                00348000
ABDLINEA EQU   ABDAREA+384                                              00349000
ABDCC    EQU   ABDLINEA                                                 00350000
CVTMAP   EQU   0                                                        00351000
CVTDAR   EQU   CVTMAP+72                                                00352000
CVTFLGS1 EQU   CVTDAR                                                   00353000
CVTDCB   EQU   CVTMAP+116                                               00354000
CVTIOQET EQU   CVTMAP+120                                               00355000
CVTNUCB  EQU   CVTMAP+128                                               00356000
CVTIERLC EQU   CVTMAP+144                                               00357000
CVTHEAD  EQU   CVTMAP+160                                               00358000
CVTSV76C EQU   CVTHEAD                                                  00359000
CVTOPTA  EQU   CVTMAP+182                                               00360000
CVTOPTB  EQU   CVTMAP+183                                               00361000
CVTGTF   EQU   CVTMAP+236                                               00362000
CVTGTFST EQU   CVTGTF                                                   00363000
CVTGTFS  EQU   CVTGTFST                                                 00364000
CVTSTATE EQU   CVTGTFST                                                 00365000
CVTTMODE EQU   CVTGTFST                                                 00366000
CVTFORM  EQU   CVTGTFST                                                 00367000
CVTAQAVT EQU   CVTMAP+240                                               00368000
CVTTCMFG EQU   CVTAQAVT                                                 00369000
CVTVOLM2 EQU   CVTMAP+244                                               00370000
CVTTATA  EQU   CVTVOLM2                                                 00371000
CVTTSKS  EQU   CVTTATA                                                  00372000
CVTVOLF2 EQU   CVTTSKS                                                  00373000
CVTTAT   EQU   CVTTATA+1                                                00374000
CVTATER  EQU   CVTMAP+248                                               00375000
CVTEXT1  EQU   CVTMAP+252                                               00376000
CVTPURG  EQU   CVTMAP+260                                               00377000
CVTQMSG  EQU   CVTMAP+268                                               00378000
CVTDMSR  EQU   CVTMAP+272                                               00379000
CVTRSV37 EQU   CVTDMSR                                                  00380000
CVTDMSRF EQU   CVTRSV37                                                 00381000
CVTERPV  EQU   CVTMAP+316                                               00382000
CVTINTLA EQU   CVTMAP+320                                               00383000
CVTAPF   EQU   CVTMAP+324                                               00384000
CVTEXT2  EQU   CVTMAP+328                                               00385000
CVTHJES  EQU   CVTMAP+332                                               00386000
CVTPGSIA EQU   CVTMAP+348                                               00387000
CVTA1F1  EQU   CVTMAP+356                                               00388000
CVTSYSK  EQU   CVTMAP+357                                               00389000
CVTVOLM1 EQU   CVTMAP+380                                               00390000
CVTVOLF1 EQU   CVTVOLM1                                                 00391000
CVTXTNT1 EQU   0                                                        00392000
CVTXTNT2 EQU   0                                                        00393000
CVTDSSV  EQU   CVTXTNT2                                                 00394000
CVTFLGBT EQU   CVTXTNT2+5                                               00395000
CVTQID   EQU   CVTXTNT2+24                                              00396000
CVTRV400 EQU   CVTXTNT2+52                                              00397000
CVTRV409 EQU   CVTXTNT2+53                                              00398000
CVTATCVT EQU   CVTXTNT2+64                                              00399000
CVTRV429 EQU   CVTXTNT2+84                                              00400000
CVTRV438 EQU   CVTXTNT2+85                                              00401000
CVTRV457 EQU   CVTXTNT2+112                                             00402000
CVTRV466 EQU   CVTXTNT2+113                                             00403000
CVTFIX   EQU   0                                                        00404000
CVTRELNO EQU   CVTFIX+252                                               00405000
PCCA     EQU   0                                                        00406000
PCCACAFM EQU   PCCA+18                                                  00407000
PCCATMST EQU   PCCA+128                                                 00408000
PCCATMFL EQU   PCCATMST                                                 00409000
PCCATODE EQU   PCCATMST+1                                               00410000
PCCACCE  EQU   PCCATMST+2                                               00411000
PCCAINTE EQU   PCCATMST+3                                               00412000
PCCAEMSB EQU   PCCA+136                                                 00413000
PCCAEMSI EQU   PCCAEMSB                                                 00414000
PCCARISP EQU   PCCAEMSI                                                 00415000
PCCAEMS2 EQU   PCCAEMSI+1                                               00416000
PCCAEMS3 EQU   PCCAEMSI+2                                               00417000
PCCARMSB EQU   PCCAEMSI+3                                               00418000
PCCAWERP EQU   PCCA+280                                                 00419000
PCCACHPF EQU   PCCAWERP+4                                               00420000
PCCACHBL EQU   PCCAWERP+5                                               00421000
PCCACHVA EQU   PCCAWERP+6                                               00422000
PCCACHTS EQU   PCCAWERP+7                                               00423000
PCCACHS1 EQU   PCCA+288                                                 00424000
PCCACHS2 EQU   PCCA+289                                                 00425000
PCCACHRB EQU   PCCA+290                                                 00426000
PCCACHF1 EQU   PCCA+308                                                 00427000
PCCACHF2 EQU   PCCA+309                                                 00428000
PCCACHF3 EQU   PCCA+310                                                 00429000
PCCACHF4 EQU   PCCA+311                                                 00430000
TCBFIX   EQU   0                                                        00431000
TCBFRS   EQU   TCBFIX                                                   00432000
TCB      EQU   0                                                        00433000
TCBPIE   EQU   TCB+4                                                    00434000
TCBPMASK EQU   TCBPIE                                                   00435000
TCBCMP   EQU   TCB+16                                                   00436000
TCBCMPF  EQU   TCBCMP                                                   00437000
TCBCPP   EQU   TCBCMPF                                                  00438000
TCBSTCC  EQU   TCBCMPF                                                  00439000
TCBCDBL  EQU   TCBCMPF                                                  00440000
TCBCWTO  EQU   TCBCMPF                                                  00441000
TCBCIND  EQU   TCBCMPF                                                  00442000
TCBCMSG  EQU   TCBCMPF                                                  00443000
TCBTRN   EQU   TCB+20                                                   00444000
TCBABF   EQU   TCBTRN                                                   00445000
TCBMSS   EQU   TCB+24                                                   00446000
TCBPKF   EQU   TCB+28                                                   00447000
TCBFLGS  EQU   TCB+29                                                   00448000
TCBFLGS1 EQU   TCBFLGS                                                  00449000
TCBFLGS2 EQU   TCBFLGS+1                                                00450000
TCBFLGS3 EQU   TCBFLGS+2                                                00451000
TCBFLGS4 EQU   TCBFLGS+3                                                00452000
TCBFLGS5 EQU   TCBFLGS+4                                                00453000
TCBABWF  EQU   TCBFLGS5                                                 00454000
TCBJPQ   EQU   TCB+44                                                   00455000
TCBPURGE EQU   TCBJPQ                                                   00456000
TCBGRS   EQU   TCB+48                                                   00457000
TCBFSA   EQU   TCB+112                                                  00458000
TCBTME   EQU   TCB+120                                                  00459000
TCBJSTCB EQU   TCB+124                                                  00460000
TCBTSFLG EQU   TCB+148                                                  00461000
TCBTSTSK EQU   TCBTSFLG                                                 00462000
TCBSTAB  EQU   TCB+160                                                  00463000
TCBNSTAE EQU   TCBSTAB                                                  00464000
TCBTCT   EQU   TCB+164                                                  00465000
TCBTCTGF EQU   TCBTCT                                                   00466000
TCBSCNDY EQU   TCB+172                                                  00467000
TCBNDSP  EQU   TCBSCNDY                                                 00468000
TCBNDSP1 EQU   TCBNDSP+1                                                00469000
TCBNDSP2 EQU   TCBNDSP+2                                                00470000
TCBNDSP3 EQU   TCBNDSP+3                                                00471000
TCBJSCB  EQU   TCB+180                                                  00472000
TCBRECDE EQU   TCBJSCB                                                  00473000
TCBEXT1  EQU   TCB+196                                                  00474000
TCBBITS  EQU   TCB+200                                                  00475000
TCBNDSP4 EQU   TCBBITS                                                  00476000
TCBNDSP5 EQU   TCBBITS+1                                                00477000
TCBFLGS6 EQU   TCBBITS+2                                                00478000
TCBFLGS7 EQU   TCBBITS+3                                                00479000
TCBDAR   EQU   TCB+204                                                  00480000
TCBDARC  EQU   TCBDAR                                                   00481000
TCBEXT2  EQU   TCB+208                                                  00482000
TCBXSCT  EQU   TCB+240                                                  00483000
TCBXSCT1 EQU   TCBXSCT                                                  00484000
TCBFOE   EQU   TCB+244                                                  00485000
TCBESTAE EQU   TCB+264                                                  00486000
TCBESTRM EQU   TCBESTAE+1                                               00487000
TCBAFFN  EQU   TCB+274                                                  00488000
TCBFBYT1 EQU   TCB+276                                                  00489000
TCBFBYT2 EQU   TCB+277                                                  00490000
TCBRV124 EQU   TCB+278                                                  00491000
TCBRV133 EQU   TCB+279                                                  00492000
TCBXTNT2 EQU   0                                                        00493000
TCBGTF   EQU   TCBXTNT2                                                 00494000
TCBTFLG  EQU   TCBGTF                                                   00495000
TCBRV146 EQU   TCBXTNT2+28                                              00496000
TCBRV155 EQU   TCBXTNT2+29                                              00497000
TCBRV164 EQU   TCBXTNT2+30                                              00498000
TCBRV173 EQU   TCBXTNT2+31                                              00499000
I001C    EQU   0                                                        00500000
I008P    EQU   0                                                        00501000
I015F    EQU   0                                                        00502000
I015P    EQU   0                                                        00503000
I031F    EQU   0                                                        00504000
I031P    EQU   0                                                        00505000
I256C    EQU   0                                                        00506000
SAVE14   EQU   8                                                        00507000
CVTPTR   EQU   FLCCVT                                                   00508000
CVTS01   EQU   CVTPGSIA                                                 00509000
CVTLPDIA EQU   CVTS01+12                                                00510000
CVTDIRST EQU   CVTLPDIA                                                 00511000
CVTSLIDA EQU   CVTS01+24                                                00512000
CVTCTLFG EQU   CVTS01+50                                                00513000
CVTRV210 EQU   CVTS01+424                                               00514000
CVTRV219 EQU   CVTS01+425                                               00515000
CVTRV228 EQU   CVTS01+426                                               00516000
CVTRV237 EQU   CVTS01+427                                               00517000
CVTMFRTR EQU   CVTS01+452                                               00518000
CVTRV262 EQU   CVTS01+468                                               00519000
CVTRV271 EQU   CVTS01+469                                               00520000
CVTRV280 EQU   CVTS01+470                                               00521000
CVTRV289 EQU   CVTS01+471                                               00522000
CVTGSDA  EQU   CVTS01+600                                               00523000
PSARSVTE EQU   PSARSVT                                                  00524000
PCCAPTR  EQU   PSATOLD                                                  00525000
FLC      EQU   PSA                                                      00526000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00527000
PSARSAV  EQU   PSARSVTE+60                                              00528000
PSARSTK  EQU   PSARSVTE+56                                              00529000
PSAESAV3 EQU   PSARSVTE+52                                              00530000
PSAESTK3 EQU   PSARSVTE+48                                              00531000
PSAESAV2 EQU   PSARSVTE+44                                              00532000
PSAESTK2 EQU   PSARSVTE+40                                              00533000
PSAESAV1 EQU   PSARSVTE+36                                              00534000
PSAESTK1 EQU   PSARSVTE+32                                              00535000
PSAPSAV  EQU   PSARSVTE+28                                              00536000
PSAPSTK  EQU   PSARSVTE+24                                              00537000
PSAMSAV  EQU   PSARSVTE+20                                              00538000
PSAMSTK  EQU   PSARSVTE+16                                              00539000
PSASSAV  EQU   PSARSVTE+12                                              00540000
PSASSTK  EQU   PSARSVTE+8                                               00541000
PSANSTK  EQU   PSARSVTE+4                                               00542000
PSACSTK  EQU   PSARSVTE                                                 00543000
CVTRV628 EQU   CVTS01+728                                               00544000
CVTRV627 EQU   CVTS01+724                                               00545000
CVTRV626 EQU   CVTS01+720                                               00546000
CVTRV625 EQU   CVTS01+716                                               00547000
CVTRV624 EQU   CVTS01+712                                               00548000
CVTRV623 EQU   CVTS01+708                                               00549000
CVTRV622 EQU   CVTS01+704                                               00550000
CVTRV621 EQU   CVTS01+700                                               00551000
CVTIHASU EQU   CVTS01+696                                               00552000
CVTSUSP  EQU   CVTS01+692                                               00553000
CVTT6SVC EQU   CVTS01+688                                               00554000
CVTCDAL  EQU   CVTS01+684                                               00555000
CVTTCTL  EQU   CVTS01+680                                               00556000
CVTRSUME EQU   CVTS01+676                                               00557000
CVTJTERM EQU   CVTS01+672                                               00558000
CVTASMRM EQU   CVTS01+668                                               00559000
CVTTCASP EQU   CVTS01+664                                               00560000
CVT0PT03 EQU   CVTS01+660                                               00561000
CVT0PT0E EQU   CVTS01+656                                               00562000
CVTRV609 EQU   CVTS01+652                                               00563000
CVTCGK   EQU   CVTS01+648                                               00564000
CVTRAC   EQU   CVTS01+644                                               00565000
CVTHSM   EQU   CVTS01+640                                               00566000
CVTRV605 EQU   CVTS01+636                                               00567000
CVTRV604 EQU   CVTS01+632                                               00568000
CVTEFF02 EQU   CVTS01+628                                               00569000
CVTCBBR  EQU   CVTS01+624                                               00570000
CVTSSCR  EQU   CVTS01+620                                               00571000
CVTEVENT EQU   CVTS01+616                                               00572000
CVTCRCA  EQU   CVTS01+612                                               00573000
CVTTPIO  EQU   CVTS01+608                                               00574000
CVTADV   EQU   CVTS01+604                                               00575000
CVTGSDAB EQU   CVTGSDA                                                  00576000
CVTQV3   EQU   CVTS01+596                                               00577000
CVTQV2   EQU   CVTS01+592                                               00578000
CVTQV1   EQU   CVTS01+588                                               00579000
CVTRPT   EQU   CVTS01+584                                               00580000
CVTSSRB  EQU   CVTS01+580                                               00581000
CVTCSDRL EQU   CVTS01+576                                               00582000
CVTEXP1  EQU   CVTS01+572                                               00583000
CVTRMPMT EQU   CVTS01+568                                               00584000
CVTRMPTT EQU   CVTS01+564                                               00585000
CVTVPSA  EQU   CVTS01+560                                               00586000
CVTVSTOP EQU   CVTS01+556                                               00587000
CVTGTFR8 EQU   CVTS01+552                                               00588000
CVTQUIT  EQU   CVTS01+548                                               00589000
CVTVACR  EQU   CVTS01+544                                               00590000
CVTWTCB  EQU   CVTS01+540                                               00591000
CVTSTPRS EQU   CVTS01+536                                               00592000
CVT0PT02 EQU   CVTS01+532                                               00593000
CVTDARCM EQU   CVTS01+528                                               00594000
CVTIRECM EQU   CVTS01+524                                               00595000
CVTJRECM EQU   CVTS01+520                                               00596000
CVTVEMS0 EQU   CVTS01+516                                               00597000
CVTSPFRR EQU   CVTS01+512                                               00598000
CVTRLSTG EQU   CVTS01+508                                               00599000
CVT0TC0A EQU   CVTS01+504                                               00600000
CVTGMBR  EQU   CVTS01+500                                               00601000
CVTLFRM  EQU   CVTS01+496                                               00602000
CVTRMBR  EQU   CVTS01+492                                               00603000
CVTVIOP  EQU   CVTS01+488                                               00604000
CVTRV307 EQU   CVTS01+486                                               00605000
CVTRV306 EQU   CVTS01+484                                               00606000
CVTRV305 EQU   CVTS01+482                                               00607000
CVTRV304 EQU   CVTS01+480                                               00608000
CVTRV303 EQU   CVTS01+478                                               00609000
CVTRV302 EQU   CVTS01+476                                               00610000
CVTTRCA  EQU   CVTS01+472                                               00611000
CVTRV297 EQU   CVTRV289                                                 00612000
CVTRV296 EQU   CVTRV289                                                 00613000
CVTRV295 EQU   CVTRV289                                                 00614000
CVTRV294 EQU   CVTRV289                                                 00615000
CVTRV293 EQU   CVTRV289                                                 00616000
CVTRV292 EQU   CVTRV289                                                 00617000
CVTRV291 EQU   CVTRV289                                                 00618000
CVTRV290 EQU   CVTRV289                                                 00619000
CVTRV288 EQU   CVTRV280                                                 00620000
CVTRV287 EQU   CVTRV280                                                 00621000
CVTRV286 EQU   CVTRV280                                                 00622000
CVTRV285 EQU   CVTRV280                                                 00623000
CVTRV284 EQU   CVTRV280                                                 00624000
CVTRV283 EQU   CVTRV280                                                 00625000
CVTRV282 EQU   CVTRV280                                                 00626000
CVTRV281 EQU   CVTRV280                                                 00627000
CVTRV279 EQU   CVTRV271                                                 00628000
CVTRV278 EQU   CVTRV271                                                 00629000
CVTRV277 EQU   CVTRV271                                                 00630000
CVTRV276 EQU   CVTRV271                                                 00631000
CVTRV275 EQU   CVTRV271                                                 00632000
CVTRV274 EQU   CVTRV271                                                 00633000
CVTRV273 EQU   CVTRV271                                                 00634000
CVTRV272 EQU   CVTRV271                                                 00635000
CVTRV270 EQU   CVTRV262                                                 00636000
CVTRV269 EQU   CVTRV262                                                 00637000
CVTRV268 EQU   CVTRV262                                                 00638000
CVTRV267 EQU   CVTRV262                                                 00639000
CVTRV266 EQU   CVTRV262                                                 00640000
CVTRV265 EQU   CVTRV262                                                 00641000
CVTRV264 EQU   CVTRV262                                                 00642000
CVTRV263 EQU   CVTRV262                                                 00643000
CVTVFP   EQU   CVTS01+464                                               00644000
CVTVSI   EQU   CVTS01+460                                               00645000
CVTVPSIB EQU   CVTS01+456                                               00646000
CVTMFACT EQU   CVTMFRTR                                                 00647000
CVTMFCTL EQU   CVTS01+448                                               00648000
CVTPVBP  EQU   CVTS01+444                                               00649000
CVTPWI   EQU   CVTS01+440                                               00650000
CVTRV254 EQU   CVTS01+438                                               00651000
CVTRV253 EQU   CVTS01+436                                               00652000
CVTRV252 EQU   CVTS01+434                                               00653000
CVTRV251 EQU   CVTS01+433                                               00654000
CVTRV250 EQU   CVTS01+432                                               00655000
CVTRV249 EQU   CVTS01+431                                               00656000
CVTRV248 EQU   CVTS01+430                                               00657000
CVTRV247 EQU   CVTS01+429                                               00658000
CVTRV246 EQU   CVTS01+428                                               00659000
CVTRV245 EQU   CVTRV237                                                 00660000
CVTRV244 EQU   CVTRV237                                                 00661000
CVTRV243 EQU   CVTRV237                                                 00662000
CVTRV242 EQU   CVTRV237                                                 00663000
CVTRV241 EQU   CVTRV237                                                 00664000
CVTRV240 EQU   CVTRV237                                                 00665000
CVTRV239 EQU   CVTRV237                                                 00666000
CVTRV238 EQU   CVTRV237                                                 00667000
CVTRV236 EQU   CVTRV228                                                 00668000
CVTRV235 EQU   CVTRV228                                                 00669000
CVTRV234 EQU   CVTRV228                                                 00670000
CVTRV233 EQU   CVTRV228                                                 00671000
CVTRV232 EQU   CVTRV228                                                 00672000
CVTRV231 EQU   CVTRV228                                                 00673000
CVTRV230 EQU   CVTRV228                                                 00674000
CVTRV229 EQU   CVTRV228                                                 00675000
CVTRV227 EQU   CVTRV219                                                 00676000
CVTRV226 EQU   CVTRV219                                                 00677000
CVTRV225 EQU   CVTRV219                                                 00678000
CVTRV224 EQU   CVTRV219                                                 00679000
CVTRV223 EQU   CVTRV219                                                 00680000
CVTRV222 EQU   CVTRV219                                                 00681000
CVTRV221 EQU   CVTRV219                                                 00682000
CVTRV220 EQU   CVTRV219                                                 00683000
CVTRV218 EQU   CVTRV210                                                 00684000
CVTRV217 EQU   CVTRV210                                                 00685000
CVTRV216 EQU   CVTRV210                                                 00686000
CVTRV215 EQU   CVTRV210                                                 00687000
CVTRV214 EQU   CVTRV210                                                 00688000
CVTRV213 EQU   CVTRV210                                                 00689000
CVTRV212 EQU   CVTRV210                                                 00690000
CVTRV211 EQU   CVTRV210                                                 00691000
CVTLCCAT EQU   CVTS01+420                                               00692000
CVTPCCAT EQU   CVTS01+416                                               00693000
CVTIPCRP EQU   CVTS01+412                                               00694000
CVTIPCRI EQU   CVTS01+408                                               00695000
CVTIPCDS EQU   CVTS01+404                                               00696000
CVTAIDVT EQU   CVTS01+400                                               00697000
CVTSSAP  EQU   CVTS01+396                                               00698000
CVTEHCIR EQU   CVTS01+392                                               00699000
CVTEHDEF EQU   CVTS01+388                                               00700000
CVTDAIR  EQU   CVTS01+384                                               00701000
CVTPERFM EQU   CVTS01+380                                               00702000
CVT044R2 EQU   CVTS01+376                                               00703000
CVTFETCH EQU   CVTS01+372                                               00704000
CVTRSTWD EQU   CVTS01+368                                               00705000
CVTSPOST EQU   CVTS01+364                                               00706000
CVTIOBP  EQU   CVTS01+360                                               00707000
CVTASMVT EQU   CVTS01+356                                               00708000
CVTRECRQ EQU   CVTS01+352                                               00709000
CVTWSAC  EQU   CVTS01+348                                               00710000
CVTRV149 EQU   CVTS01+344                                               00711000
CVTWSAL  EQU   CVTS01+340                                               00712000
CVTSPSA  EQU   CVTS01+336                                               00713000
CVTGLMN  EQU   CVTS01+332                                               00714000
CVTVEAC0 EQU   CVTS01+328                                               00715000
CVT062R1 EQU   CVTS01+324                                               00716000
CVTRPOST EQU   CVTS01+320                                               00717000
CVTDQIQE EQU   CVTS01+316                                               00718000
CVTCSD   EQU   CVTS01+312                                               00719000
CVTLKRMA EQU   CVTS01+308                                               00720000
CVTRSPIE EQU   CVTS01+304                                               00721000
CVTRENQ  EQU   CVTS01+300                                               00722000
CVTLQCB  EQU   CVTS01+296                                               00723000
CVTFQCB  EQU   CVTS01+292                                               00724000
CVTQCS01 EQU   CVTS01+288                                               00725000
CVTAPFT  EQU   CVTS01+284                                               00726000
CVTPARRL EQU   CVTS01+280                                               00727000
CVTVWAIT EQU   CVTS01+276                                               00728000
CVTGSPL  EQU   CVTS01+272                                               00729000
CVTLSMQ  EQU   CVTS01+268                                               00730000
CVTGSMQ  EQU   CVTS01+264                                               00731000
CVTEXPRO EQU   CVTS01+260                                               00732000
CVTOPCTP EQU   CVTS01+256                                               00733000
CVTSIC   EQU   CVTS01+252                                               00734000
CVTTPIOS EQU   CVTS01+248                                               00735000
CVTRTMS  EQU   CVTS01+244                                               00736000
CVTSDBF  EQU   CVTS01+240                                               00737000
CVTSCBP  EQU   CVTS01+236                                               00738000
CVTSDMP  EQU   CVTS01+232                                               00739000
CVTSV60  EQU   CVTS01+228                                               00740000
CVTRTMCT EQU   CVTS01+224                                               00741000
CVTASCBL EQU   CVTS01+220                                               00742000
CVTASCBH EQU   CVTS01+216                                               00743000
CVTGDA   EQU   CVTS01+212                                               00744000
CVTASVT  EQU   CVTS01+208                                               00745000
CVTVVMDI EQU   CVTS01+204                                               00746000
CVTAQTOP EQU   CVTS01+200                                               00747000
CVTIOSCS EQU   CVTS01+196                                               00748000
CVTSDRM  EQU   CVTS01+192                                               00749000
CVTOPTE  EQU   CVTS01+188                                               00750000
CVTSTXU  EQU   CVTS01+184                                               00751000
CVTQUIS  EQU   CVTS01+180                                               00752000
CVTPARS  EQU   CVTS01+176                                               00753000
CVTS1EE  EQU   CVTS01+172                                               00754000
CVTFRAS  EQU   CVTS01+168                                               00755000
CVTQSAS  EQU   CVTS01+164                                               00756000
CVTCRAS  EQU   CVTS01+160                                               00757000
CVTCRMN  EQU   CVTS01+156                                               00758000
CVTDELCP EQU   CVTS01+152                                               00759000
CVTFRECL EQU   CVTS01+148                                               00760000
CVTGETCL EQU   CVTS01+144                                               00761000
CVTBLDCP EQU   CVTS01+140                                               00762000
CVTAUTHL EQU   CVTS01+136                                               00763000
CVTSCAN  EQU   CVTS01+132                                               00764000
CVTRV144 EQU   CVTS01+130                                               00765000
CVTMAXMP EQU   CVTS01+128                                               00766000
CVTSTCK  EQU   CVTS01+124                                               00767000
CVTRV139 EQU   CVTS01+123                                               00768000
CVTDSSAC EQU   CVTS01+122                                               00769000
CVTRV513 EQU   CVTS01+121                                               00770000
CVTIOSPL EQU   CVTS01+120                                               00771000
CVTPTGT  EQU   CVTS01+116                                               00772000
CVTCSPIE EQU   CVTS01+112                                               00773000
CVTSMFEX EQU   CVTS01+108                                               00774000
CVTOLT0A EQU   CVTS01+104                                               00775000
CVTSRBRT EQU   CVTS01+100                                               00776000
CVTPUTL  EQU   CVTS01+96                                                00777000
CVTASCRL EQU   CVTS01+92                                                00778000
CVTASCRF EQU   CVTS01+88                                                00779000
CVTRV326 EQU   CVTS01+84                                                00780000
CVTRV325 EQU   CVTS01+80                                                00781000
CVTRV324 EQU   CVTS01+76                                                00782000
CVT0VL01 EQU   CVTS01+72                                                00783000
CVTSHRVM EQU   CVTS01+68                                                00784000
CVTRV332 EQU   CVTS01+64                                                00785000
CVTTAS   EQU   CVTS01+60                                                00786000
CVTRSCN  EQU   CVTS01+56                                                00787000
CVTTRAC2 EQU   CVTS01+54                                                00788000
CVTTRACE EQU   CVTS01+52                                                00789000
CVTAPG   EQU   CVTS01+51                                                00790000
CVTSDTRC EQU   CVTCTLFG                                                 00791000
CVTGTRCE EQU   CVTCTLFG                                                 00792000
CVTNOMP  EQU   CVTCTLFG                                                 00793000
CVTRSV79 EQU   CVTCTLFG                                                 00794000
CVTDSTAT EQU   CVTCTLFG                                                 00795000
CVTRSV78 EQU   CVTCTLFG                                                 00796000
CVTRV333 EQU   CVTCTLFG                                                 00797000
CVTRV323 EQU   CVTCTLFG                                                 00798000
CVTSPVLK EQU   CVTS01+49                                                00799000
CVTRSV77 EQU   CVTS01+48                                                00800000
CVTRV331 EQU   CVTS01+44                                                00801000
CVTRV330 EQU   CVTS01+40                                                00802000
CVTRV329 EQU   CVTS01+36                                                00803000
CVTRV328 EQU   CVTS01+32                                                00804000
CVTRV322 EQU   CVTS01+28                                                00805000
CVTSLID  EQU   CVTSLIDA+1                                               00806000
CVTSYLK  EQU   CVTSLIDA                                                 00807000
CVTRV321 EQU   CVTS01+20                                                00808000
CVTRV320 EQU   CVTS01+16                                                00809000
CVTLPDIR EQU   CVTLPDIA+1                                               00810000
CVTRSV69 EQU   CVTDIRST                                                 00811000
CVTRSV68 EQU   CVTDIRST                                                 00812000
CVTRSV67 EQU   CVTDIRST                                                 00813000
CVTRSV66 EQU   CVTDIRST                                                 00814000
CVTRSV65 EQU   CVTDIRST                                                 00815000
CVTRSV64 EQU   CVTDIRST                                                 00816000
CVTRSV63 EQU   CVTDIRST                                                 00817000
CVTDICOM EQU   CVTDIRST                                                 00818000
CVTPVTP  EQU   CVTS01+8                                                 00819000
CVTLPDSR EQU   CVTS01+4                                                 00820000
CVTGETL  EQU   CVTS01                                                   00821000
@NM00059 EQU   TCBXTNT2+32                                              00822000
TCBRV181 EQU   TCBRV173                                                 00823000
TCBRV180 EQU   TCBRV173                                                 00824000
TCBRV179 EQU   TCBRV173                                                 00825000
TCBRV178 EQU   TCBRV173                                                 00826000
TCBRV177 EQU   TCBRV173                                                 00827000
TCBRV176 EQU   TCBRV173                                                 00828000
TCBRV175 EQU   TCBRV173                                                 00829000
TCBRV174 EQU   TCBRV173                                                 00830000
TCBRV172 EQU   TCBRV164                                                 00831000
TCBRV171 EQU   TCBRV164                                                 00832000
TCBRV170 EQU   TCBRV164                                                 00833000
TCBRV169 EQU   TCBRV164                                                 00834000
TCBRV168 EQU   TCBRV164                                                 00835000
TCBRV167 EQU   TCBRV164                                                 00836000
TCBRV166 EQU   TCBRV164                                                 00837000
TCBRV165 EQU   TCBRV164                                                 00838000
TCBRV163 EQU   TCBRV155                                                 00839000
TCBRV162 EQU   TCBRV155                                                 00840000
TCBRV161 EQU   TCBRV155                                                 00841000
TCBRV160 EQU   TCBRV155                                                 00842000
TCBRV159 EQU   TCBRV155                                                 00843000
TCBRV158 EQU   TCBRV155                                                 00844000
TCBRV157 EQU   TCBRV155                                                 00845000
TCBRV156 EQU   TCBRV155                                                 00846000
TCBRV154 EQU   TCBRV146                                                 00847000
TCBRV153 EQU   TCBRV146                                                 00848000
TCBRV152 EQU   TCBRV146                                                 00849000
TCBRV151 EQU   TCBRV146                                                 00850000
TCBRV150 EQU   TCBRV146                                                 00851000
TCBRV149 EQU   TCBRV146                                                 00852000
TCBRV148 EQU   TCBRV146                                                 00853000
TCBRV147 EQU   TCBRV146                                                 00854000
TCBRV145 EQU   TCBXTNT2+26                                              00855000
TCBRV144 EQU   TCBXTNT2+24                                              00856000
TCBRV143 EQU   TCBXTNT2+20                                              00857000
TCBRV142 EQU   TCBXTNT2+16                                              00858000
TCBRSV49 EQU   TCBXTNT2+12                                              00859000
TCBEVENT EQU   TCBXTNT2+8                                               00860000
TCBRCMP  EQU   TCBXTNT2+5                                               00861000
TCBRSVAB EQU   TCBXTNT2+4                                               00862000
TCBGTFA  EQU   TCBGTF+1                                                 00863000
TCBRSV47 EQU   TCBTFLG                                                  00864000
TCBRSV46 EQU   TCBTFLG                                                  00865000
TCBRSV45 EQU   TCBTFLG                                                  00866000
TCBRSV44 EQU   TCBTFLG                                                  00867000
TCBRSV43 EQU   TCBTFLG                                                  00868000
TCBDSPIT EQU   TCBTFLG                                                  00869000
TCBERRTN EQU   TCBTFLG                                                  00870000
TCBASYNC EQU   TCBTFLG                                                  00871000
@NM00058 EQU   TCB+296                                                  00872000
TCBSVCA2 EQU   TCB+292                                                  00873000
TCBSWASA EQU   TCB+288                                                  00874000
TCBDBTB  EQU   TCB+284                                                  00875000
TCBRPT   EQU   TCB+280                                                  00876000
TCBRV141 EQU   TCBRV133                                                 00877000
TCBRV140 EQU   TCBRV133                                                 00878000
TCBRV139 EQU   TCBRV133                                                 00879000
TCBRV138 EQU   TCBRV133                                                 00880000
TCBRV137 EQU   TCBRV133                                                 00881000
TCBRV136 EQU   TCBRV133                                                 00882000
TCBRV135 EQU   TCBRV133                                                 00883000
TCBRV134 EQU   TCBRV133                                                 00884000
TCBRV132 EQU   TCBRV124                                                 00885000
TCBRV131 EQU   TCBRV124                                                 00886000
TCBRV130 EQU   TCBRV124                                                 00887000
TCBRV129 EQU   TCBRV124                                                 00888000
TCBRV128 EQU   TCBRV124                                                 00889000
TCBRV127 EQU   TCBRV124                                                 00890000
TCBRV126 EQU   TCBRV124                                                 00891000
TCBRV125 EQU   TCBRV124                                                 00892000
TCBRV123 EQU   TCBFBYT2                                                 00893000
TCBRV122 EQU   TCBFBYT2                                                 00894000
TCBECBNV EQU   TCBFBYT2                                                 00895000
TCBSSSYN EQU   TCBFBYT2                                                 00896000
TCBFPRAP EQU   TCBFBYT2                                                 00897000
TCBFDW   EQU   TCBFBYT2                                                 00898000
TCBFMW   EQU   TCBFBYT2                                                 00899000
TCBCNCB  EQU   TCBFBYT2                                                 00900000
TCBLLH   EQU   TCBFBYT1                                                 00901000
TCBRV113 EQU   TCBFBYT1                                                 00902000
TCBEOT   EQU   TCBFBYT1                                                 00903000
TCBRTM2  EQU   TCBFBYT1                                                 00904000
TCBPGNLY EQU   TCBFBYT1                                                 00905000
TCBNDIOS EQU   TCBFBYT1                                                 00906000
TCBRV327 EQU   TCBFBYT1                                                 00907000
TCBEOTFM EQU   TCBFBYT1                                                 00908000
TCBRV326 EQU   TCB+272                                                  00909000
TCBUKYSP EQU   TCB+268                                                  00910000
TCBMODE  EQU   TCBESTAE+3                                               00911000
TCBERTYP EQU   TCBESTAE+2                                               00912000
TCBRV314 EQU   TCBESTRM                                                 00913000
TCBRV313 EQU   TCBESTRM                                                 00914000
TCBRV312 EQU   TCBESTRM                                                 00915000
TCBRV311 EQU   TCBESTRM                                                 00916000
TCBRV310 EQU   TCBESTRM                                                 00917000
TCBRV309 EQU   TCBESTRM                                                 00918000
TCBRV308 EQU   TCBESTRM                                                 00919000
TCBETERM EQU   TCBESTRM                                                 00920000
TCBSCBKY EQU   TCBESTAE                                                 00921000
TCBRTM12 EQU   TCB+260                                                  00922000
TCBTCBID EQU   TCB+256                                                  00923000
TCBSTAWA EQU   TCB+252                                                  00924000
TCBSWA   EQU   TCB+248                                                  00925000
TCBFOEA  EQU   TCBFOE+1                                                 00926000
TCBRSV42 EQU   TCBFOE                                                   00927000
TCBCCPVI EQU   TCBXSCT+2                                                00928000
TCBRV325 EQU   TCBXSCT+1                                                00929000
TCBRV324 EQU   TCBXSCT1                                                 00930000
TCBRV323 EQU   TCBXSCT1                                                 00931000
TCBRV322 EQU   TCBXSCT1                                                 00932000
TCBRV321 EQU   TCBXSCT1                                                 00933000
TCBRV320 EQU   TCBXSCT1                                                 00934000
TCBRV319 EQU   TCBXSCT1                                                 00935000
TCBS3A   EQU   TCBXSCT1                                                 00936000
TCBACTIV EQU   TCBXSCT1                                                 00937000
TCBRSV41 EQU   TCB+239                                                  00938000
TCBTID   EQU   TCB+238                                                  00939000
TCBRSVAA EQU   TCB+237                                                  00940000
TCBABCUR EQU   TCB+236                                                  00941000
TCBTMSAV EQU   TCB+232                                                  00942000
TCBIOTIM EQU   TCB+228                                                  00943000
TCBRTWA  EQU   TCB+224                                                  00944000
TCBBACK  EQU   TCB+220                                                  00945000
TCBTIRB  EQU   TCB+216                                                  00946000
TCBAECB  EQU   TCB+212                                                  00947000
TCBEXT2A EQU   TCBEXT2+1                                                00948000
TCBRSV39 EQU   TCBEXT2                                                  00949000
TCBSTMCT EQU   TCB+207                                                  00950000
TCBSYSCT EQU   TCB+206                                                  00951000
TCBRSV37 EQU   TCB+205                                                  00952000
TCBEXSVC EQU   TCBDAR                                                   00953000
TCBDARMS EQU   TCBDAR                                                   00954000
TCBDARWT EQU   TCBDAR                                                   00955000
TCBDARO  EQU   TCBDAR                                                   00956000
TCBDARMC EQU   TCBDARC                                                  00957000
TCBDARD  EQU   TCBDAR                                                   00958000
TCBDARS  EQU   TCBDAR                                                   00959000
TCBDARP  EQU   TCBDAR                                                   00960000
TCBGTOFM EQU   TCBFLGS7                                                 00961000
TCBADMP  EQU   TCBFLGS7                                                 00962000
TCBRSTSK EQU   TCBFLGS7                                                 00963000
TCBSVCS  EQU   TCBFLGS7                                                 00964000
TCBSTACK EQU   TCBFLGS7                                                 00965000
TCBRSV34 EQU   TCBFLGS7                                                 00966000
TCBRSV33 EQU   TCBFLGS7                                                 00967000
TCBGPECB EQU   TCBFLGS7                                                 00968000
TCBNTJS  EQU   TCBFLGS6                                                 00969000
TCBAPG   EQU   TCBFLGS6                                                 00970000
TCBMIGR  EQU   TCBFLGS6                                                 00971000
TCBRV303 EQU   TCBFLGS6                                                 00972000
TCBSPVLK EQU   TCBFLGS6                                                 00973000
TCBCPU   EQU   TCBFLGS6                                                 00974000
TCBPIE17 EQU   TCBFLGS6                                                 00975000
TCBRV    EQU   TCBFLGS6                                                 00976000
TCBRSV79 EQU   TCBNDSP5                                                 00977000
TCBRSV78 EQU   TCBNDSP5                                                 00978000
TCBRSV77 EQU   TCBNDSP5                                                 00979000
TCBRSV76 EQU   TCBNDSP5                                                 00980000
TCBRSV75 EQU   TCBNDSP5                                                 00981000
TCBRSV74 EQU   TCBNDSP5                                                 00982000
TCBRSV95 EQU   TCBNDSP5                                                 00983000
TCBRSV94 EQU   TCBNDSP5                                                 00984000
TCBRSV93 EQU   TCBNDSP4                                                 00985000
TCBRSV92 EQU   TCBNDSP4                                                 00986000
TCBRSV91 EQU   TCBNDSP4                                                 00987000
TCBRSV90 EQU   TCBNDSP4                                                 00988000
TCBRSV89 EQU   TCBNDSP4                                                 00989000
TCBRSV88 EQU   TCBNDSP4                                                 00990000
TCBRSV87 EQU   TCBNDSP4                                                 00991000
TCBRSV86 EQU   TCBNDSP4                                                 00992000
TCBEXT1A EQU   TCBEXT1+1                                                00993000
TCBRSV32 EQU   TCBEXT1                                                  00994000
TCBEXCPD EQU   TCB+192                                                  00995000
TCBIOBRC EQU   TCB+188                                                  00996000
TCBDDWTC EQU   TCB+186                                                  00997000
TCBDDEXC EQU   TCB+184                                                  00998000
TCBJSCBB EQU   TCBJSCB+1                                                00999000
@NM00057 EQU   TCBRECDE                                                 01000000
TCBREC   EQU   TCBRECDE                                                 01001000
TCBMDIDS EQU   TCB+176                                                  01002000
TCBNDINT EQU   TCBNDSP3                                                 01003000
TCBRSV27 EQU   TCBNDSP3                                                 01004000
TCBRSV26 EQU   TCBNDSP3                                                 01005000
TCBRSV25 EQU   TCBNDSP3                                                 01006000
TCBRSV24 EQU   TCBNDSP3                                                 01007000
TCBSRBND EQU   TCBNDSP3                                                 01008000
TCBRV302 EQU   TCBNDSP3                                                 01009000
TCBLJSND EQU   TCBNDSP3                                                 01010000
TCBABE   EQU   TCBNDSP2                                                 01011000
TCBDSS   EQU   TCBNDSP2                                                 01012000
TCBOWAIT EQU   TCBNDSP2                                                 01013000
TCBIWAIT EQU   TCBNDSP2                                                 01014000
TCBNDTS  EQU   TCBNDSP2                                                 01015000
TCBNDSVC EQU   TCBNDSP2                                                 01016000
TCBSTPP  EQU   TCBNDSP2                                                 01017000
TCBABD   EQU   TCBNDSP2                                                 01018000
TCBRSV22 EQU   TCBNDSP1                                                 01019000
TCBPIEND EQU   TCBNDSP1                                                 01020000
TCBTPSP  EQU   TCBNDSP1                                                 01021000
TCBDDRND EQU   TCBNDSP1                                                 01022000
TCBRSPND EQU   TCBNDSP1                                                 01023000
TCBRSTND EQU   TCBNDSP1                                                 01024000
TCBDARPN EQU   TCBNDSP1                                                 01025000
TCBDARTN EQU   TCBNDSP1                                                 01026000
TCBNDSP0 EQU   TCBNDSP                                                  01027000
TCBUSER  EQU   TCB+168                                                  01028000
TCBTCTB  EQU   TCBTCT+1                                                 01029000
TCBRSV9C EQU   TCBTCTGF                                                 01030000
TCBRSV9B EQU   TCBTCTGF                                                 01031000
TCBRSV9A EQU   TCBTCTGF                                                 01032000
TCBRSV99 EQU   TCBTCTGF                                                 01033000
TCBRSV98 EQU   TCBTCTGF                                                 01034000
TCBRSV97 EQU   TCBTCTGF                                                 01035000
TCBRSV20 EQU   TCBTCTGF                                                 01036000
TCBSMFGF EQU   TCBTCTGF                                                 01037000
TCBSTABB EQU   TCBSTAB+1                                                01038000
TCBSTCUR EQU   TCBNSTAE                                                 01039000
TCBRV301 EQU   TCBNSTAE                                                 01040000
TCBSYNCH EQU   TCBNSTAE                                                 01041000
TCBHALT  EQU   TCBNSTAE                                                 01042000
TCBPPSUP EQU   TCBNSTAE                                                 01043000
TCB33E   EQU   TCBNSTAE                                                 01044000
TCBQUIES EQU   TCBNSTAE                                                 01045000
TCBSTABE EQU   TCBNSTAE                                                 01046000
TCBAQE   EQU   TCB+156                                                  01047000
TCBPQE   EQU   TCB+152                                                  01048000
TCBTSDP  EQU   TCB+151                                                  01049000
TCBTSLP  EQU   TCB+150                                                  01050000
TCBSTPCT EQU   TCB+149                                                  01051000
TCBCPUBN EQU   TCBTSFLG                                                 01052000
TCBDYDSP EQU   TCBTSFLG                                                 01053000
TCBRSV18 EQU   TCBTSFLG                                                 01054000
TCBRSV17 EQU   TCBTSFLG                                                 01055000
TCBTIOTG EQU   TCBTSFLG                                                 01056000
TCBATT   EQU   TCBTSFLG                                                 01057000
TCBSTPPR EQU   TCBTSFLG                                                 01058000
TCBRV300 EQU   TCBTSTSK                                                 01059000
TCBECB   EQU   TCB+144                                                  01060000
TCBIQE   EQU   TCB+140                                                  01061000
TCBLTC   EQU   TCB+136                                                  01062000
TCBOTC   EQU   TCB+132                                                  01063000
TCBNTC   EQU   TCB+128                                                  01064000
TCBJSTCA EQU   TCBJSTCB+1                                               01065000
TCBRSV16 EQU   TCBJSTCB                                                 01066000
TCBTQET  EQU   TCBTME                                                   01067000
TCBTCB   EQU   TCB+116                                                  01068000
TCBFSAB  EQU   TCBFSA+1                                                 01069000
TCBQEL   EQU   TCBFSA                                                   01070000
TCBGRS15 EQU   TCBGRS+60                                                01071000
TCBGRS14 EQU   TCBGRS+56                                                01072000
TCBGRS13 EQU   TCBGRS+52                                                01073000
TCBGRS12 EQU   TCBGRS+48                                                01074000
TCBGRS11 EQU   TCBGRS+44                                                01075000
TCBGRS10 EQU   TCBGRS+40                                                01076000
TCBGRS9  EQU   TCBGRS+36                                                01077000
TCBGRS8  EQU   TCBGRS+32                                                01078000
TCBGRS7  EQU   TCBGRS+28                                                01079000
TCBGRS6  EQU   TCBGRS+24                                                01080000
TCBGRS5  EQU   TCBGRS+20                                                01081000
TCBGRS4  EQU   TCBGRS+16                                                01082000
TCBGRS3  EQU   TCBGRS+12                                                01083000
TCBGRS2  EQU   TCBGRS+8                                                 01084000
TCBGRS1  EQU   TCBGRS+4                                                 01085000
TCBGRS0  EQU   TCBGRS                                                   01086000
TCBJPQB  EQU   TCBJPQ+1                                                 01087000
TCBRSV15 EQU   TCBPURGE                                                 01088000
TCBRSV14 EQU   TCBPURGE                                                 01089000
TCBRSV13 EQU   TCBPURGE                                                 01090000
TCBRSV12 EQU   TCBPURGE                                                 01091000
TCBRSV11 EQU   TCBPURGE                                                 01092000
TCBRSV10 EQU   TCBPURGE                                                 01093000
TCBRSV09 EQU   TCBPURGE                                                 01094000
TCBJPQF  EQU   TCBPURGE                                                 01095000
TCBJLB   EQU   TCB+40                                                   01096000
TCBLLS   EQU   TCB+36                                                   01097000
TCBDSP   EQU   TCB+35                                                   01098000
TCBLMP   EQU   TCB+34                                                   01099000
TCBPNDSP EQU   TCBFLGS5                                                 01100000
TCBFCD1  EQU   TCBFLGS5                                                 01101000
TCBSTP   EQU   TCBFLGS5                                                 01102000
TCBSYS   EQU   TCBFLGS5                                                 01103000
TCBANDSP EQU   TCBFLGS5                                                 01104000
TCBPAGE  EQU   TCBFLGS5                                                 01105000
TCBUXNDF EQU   TCBABWF                                                  01106000
TCBFC    EQU   TCBFLGS5                                                 01107000
TCBONDSP EQU   TCBFLGS4                                                 01108000
TCBMPCND EQU   TCBFLGS4                                                 01109000
TCBMPCVQ EQU   TCBFLGS4                                                 01110000
TCBUXNDV EQU   TCBFLGS4                                                 01111000
TCBHNDSP EQU   TCBFLGS4                                                 01112000
TCBRQENA EQU   TCBFLGS4                                                 01113000
TCBSER   EQU   TCBFLGS4                                                 01114000
TCBNDUMP EQU   TCBFLGS4                                                 01115000
TCBDWSTA EQU   TCBFLGS3                                                 01116000
TCBRSV08 EQU   TCBFLGS3                                                 01117000
TCBRSV07 EQU   TCBFLGS3                                                 01118000
TCBRSV06 EQU   TCBFLGS3                                                 01119000
TCBABGM  EQU   TCBFLGS3                                                 01120000
TCBABTRM EQU   TCBFLGS3                                                 01121000
TCBADINP EQU   TCBFLGS3                                                 01122000
TCBFSM   EQU   TCBFLGS3                                                 01123000
TCBFTS   EQU   TCBFLGS2                                                 01124000
TCBFETXR EQU   TCBFLGS2                                                 01125000
TCBFDSOP EQU   TCBFLGS2                                                 01126000
TCBFJMC  EQU   TCBFLGS2                                                 01127000
TCBFSMC  EQU   TCBFLGS2                                                 01128000
TCBFABOP EQU   TCBFLGS2                                                 01129000
TCBFSTI  EQU   TCBFLGS2                                                 01130000
TCBFOINP EQU   TCBFLGS2                                                 01131000
TCBFX    EQU   TCBFLGS1                                                 01132000
TCBFS    EQU   TCBFLGS1                                                 01133000
TCBFT    EQU   TCBFLGS1                                                 01134000
TCBPDUMP EQU   TCBFLGS1                                                 01135000
TCBNONPR EQU   TCBFLGS1                                                 01136000
TCBFERA  EQU   TCBFLGS1                                                 01137000
TCBFE    EQU   TCBFLGS1                                                 01138000
TCBFA    EQU   TCBFLGS1                                                 01139000
TCBZERO  EQU   TCBPKF                                                   01140000
TCBFLAG  EQU   TCBPKF                                                   01141000
TCBMSSB  EQU   TCBMSS+1                                                 01142000
TCBRSV03 EQU   TCBMSS                                                   01143000
TCBTRNB  EQU   TCBTRN+1                                                 01144000
TCBRSV02 EQU   TCBABF                                                   01145000
TCBOLTEP EQU   TCBABF                                                   01146000
TCBTCP   EQU   TCBABF                                                   01147000
TCBTCPP  EQU   TCBABF                                                   01148000
TCBRSV01 EQU   TCBABF                                                   01149000
TCBGRPH  EQU   TCBABF                                                   01150000
TCBNOCHK EQU   TCBABF                                                   01151000
TCBMOD91 EQU   TCBABF                                                   01152000
TCBCMPC  EQU   TCBCMP+1                                                 01153000
TCBRV318 EQU   TCBCMSG                                                  01154000
TCBRV317 EQU   TCBCIND                                                  01155000
TCBRV316 EQU   TCBCWTO                                                  01156000
TCBCASID EQU   TCBCDBL                                                  01157000
TCBNOCC  EQU   TCBSTCC                                                  01158000
TCBDMPO  EQU   TCBCPP                                                   01159000
TCBCSTEP EQU   TCBCMPF                                                  01160000
TCBCREQ  EQU   TCBCMPF                                                  01161000
TCBTIO   EQU   TCB+12                                                   01162000
TCBDEB   EQU   TCB+8                                                    01163000
TCBPIEA  EQU   TCBPIE+1                                                 01164000
TCBPM    EQU   TCBPMASK                                                 01165000
@NM00056 EQU   TCBPMASK                                                 01166000
TCBRBP   EQU   TCB                                                      01167000
TCBFRS6  EQU   TCBFRS+24                                                01168000
TCBFRS4  EQU   TCBFRS+16                                                01169000
TCBFRS2  EQU   TCBFRS+8                                                 01170000
TCBFRS0  EQU   TCBFRS                                                   01171000
@NM00055 EQU   PCCA+512                                                 01172000
PCCACAT  EQU   PCCA+384                                                 01173000
PCCARV36 EQU   PCCA+380                                                 01174000
PCCARV35 EQU   PCCA+378                                                 01175000
PCCARV01 EQU   PCCA+377                                                 01176000
PCCACPUM EQU   PCCA+376                                                 01177000
PCCARV63 EQU   PCCA+372                                                 01178000
PCCARV62 EQU   PCCA+368                                                 01179000
PCCARV61 EQU   PCCA+364                                                 01180000
PCCARV60 EQU   PCCA+360                                                 01181000
PCCARV59 EQU   PCCA+356                                                 01182000
PCCARV58 EQU   PCCA+352                                                 01183000
PCCARV57 EQU   PCCA+348                                                 01184000
PCCARV56 EQU   PCCA+344                                                 01185000
PCCARV55 EQU   PCCA+340                                                 01186000
PCCARV54 EQU   PCCA+336                                                 01187000
PCCALOGA EQU   PCCA+332                                                 01188000
PCCACHID EQU   PCCA+324                                                 01189000
PCCACHSV EQU   PCCA+312                                                 01190000
PCCARV79 EQU   PCCACHF4                                                 01191000
PCCARV78 EQU   PCCACHF4                                                 01192000
PCCARV77 EQU   PCCACHF4                                                 01193000
PCCARV76 EQU   PCCACHF4                                                 01194000
PCCARV75 EQU   PCCACHF4                                                 01195000
PCCARV74 EQU   PCCACHF4                                                 01196000
PCCARV73 EQU   PCCACHF4                                                 01197000
PCCARV72 EQU   PCCACHF4                                                 01198000
PCCARV71 EQU   PCCACHF3                                                 01199000
PCCARV70 EQU   PCCACHF3                                                 01200000
PCCARV69 EQU   PCCACHF3                                                 01201000
PCCARV68 EQU   PCCACHF3                                                 01202000
PCCARV67 EQU   PCCACHF3                                                 01203000
PCCARV66 EQU   PCCACHF3                                                 01204000
PCCARV65 EQU   PCCACHF3                                                 01205000
PCCARV64 EQU   PCCACHF3                                                 01206000
PCCACF28 EQU   PCCACHF2                                                 01207000
PCCACF27 EQU   PCCACHF2                                                 01208000
PCCACF26 EQU   PCCACHF2                                                 01209000
PCCACF25 EQU   PCCACHF2                                                 01210000
PCCACF24 EQU   PCCACHF2                                                 01211000
PCCACF23 EQU   PCCACHF2                                                 01212000
PCCACF22 EQU   PCCACHF2                                                 01213000
PCCACF21 EQU   PCCACHF2                                                 01214000
PCCACF18 EQU   PCCACHF1                                                 01215000
PCCACF17 EQU   PCCACHF1                                                 01216000
PCCACF16 EQU   PCCACHF1                                                 01217000
PCCACF15 EQU   PCCACHF1                                                 01218000
PCCACF14 EQU   PCCACHF1                                                 01219000
PCCACF13 EQU   PCCACHF1                                                 01220000
PCCACF12 EQU   PCCACHF1                                                 01221000
PCCACF11 EQU   PCCACHF1                                                 01222000
PCCARV05 EQU   PCCA+306                                                 01223000
PCCACHPB EQU   PCCA+305                                                 01224000
PCCALGP2 EQU   PCCA+304                                                 01225000
PCCALGP1 EQU   PCCA+303                                                 01226000
PCCALOGL EQU   PCCA+302                                                 01227000
PCCARV80 EQU   PCCA+300                                                 01228000
PCCACHW2 EQU   PCCA+296                                                 01229000
PCCACHW1 EQU   PCCA+292                                                 01230000
PCCAIOSI EQU   PCCA+291                                                 01231000
PCCACNRB EQU   PCCACHRB                                                 01232000
PCCACCVB EQU   PCCACHRB                                                 01233000
PCCACSNB EQU   PCCACHRB                                                 01234000
PCCARV52 EQU   PCCACHRB                                                 01235000
PCCACHIB EQU   PCCACHRB                                                 01236000
PCCACTIB EQU   PCCACHRB                                                 01237000
PCCACINB EQU   PCCACHRB                                                 01238000
PCCACSIB EQU   PCCACHRB                                                 01239000
PCCARV51 EQU   PCCACHS2                                                 01240000
PCCARV50 EQU   PCCACHS2                                                 01241000
PCCACCRA EQU   PCCACHS2                                                 01242000
PCCACURC EQU   PCCACHS2                                                 01243000
PCCACNLG EQU   PCCACHS2                                                 01244000
PCCACMOD EQU   PCCACHS2                                                 01245000
PCCACALT EQU   PCCACHS2                                                 01246000
PCCACIOR EQU   PCCACHS2                                                 01247000
PCCARV47 EQU   PCCACHS1                                                 01248000
PCCACUCB EQU   PCCACHS1                                                 01249000
PCCACIBC EQU   PCCACHS1                                                 01250000
PCCACAND EQU   PCCACHS1                                                 01251000
PCCACNLS EQU   PCCACHS1                                                 01252000
PCCACFRR EQU   PCCACHS1                                                 01253000
PCCACNRE EQU   PCCACHS1                                                 01254000
PCCACCMP EQU   PCCACHS1                                                 01255000
PCCACSEQ EQU   PCCACHTS                                                 01256000
PCCACDIN EQU   PCCACHTS                                                 01257000
PCCARV44 EQU   PCCACHTS                                                 01258000
PCCARV43 EQU   PCCACHTS                                                 01259000
PCCACTEC EQU   PCCACHTS                                                 01260000
PCCACDAV EQU   PCCACHVA                                                 01261000
PCCACCHV EQU   PCCACHVA                                                 01262000
PCCACCMD EQU   PCCACHVA                                                 01263000
PCCACUNS EQU   PCCACHVA                                                 01264000
PCCACSQV EQU   PCCACHVA                                                 01265000
PCCARV42 EQU   PCCACHVA                                                 01266000
PCCARV41 EQU   PCCACHVA                                                 01267000
PCCACITF EQU   PCCACHVA                                                 01268000
PCCARV40 EQU   PCCACHBL                                                 01269000
PCCARV39 EQU   PCCACHBL                                                 01270000
PCCARV38 EQU   PCCACHBL                                                 01271000
PCCACCUE EQU   PCCACHBL                                                 01272000
PCCACSTG EQU   PCCACHBL                                                 01273000
PCCACSCU EQU   PCCACHBL                                                 01274000
PCCACCHA EQU   PCCACHBL                                                 01275000
PCCACCPU EQU   PCCACHBL                                                 01276000
PCCACNOR EQU   PCCACHPF                                                 01277000
PCCACCNT EQU   PCCACHPF                                                 01278000
PCCACSNS EQU   PCCACHPF                                                 01279000
PCCARV37 EQU   PCCACHPF                                                 01280000
PCCACHIO EQU   PCCACHPF                                                 01281000
PCCACTIO EQU   PCCACHPF                                                 01282000
PCCACINT EQU   PCCACHPF                                                 01283000
PCCACSIO EQU   PCCACHPF                                                 01284000
PCCACHUB EQU   PCCAWERP                                                 01285000
PCCACHEL EQU   PCCA+168                                                 01286000
PCCALRBR EQU   PCCA+164                                                 01287000
PCCALRBV EQU   PCCA+160                                                 01288000
PCCAPWAR EQU   PCCA+156                                                 01289000
PCCAPWAV EQU   PCCA+152                                                 01290000
PCCAEMSA EQU   PCCAEMSB+12                                              01291000
PCCAEMSE EQU   PCCAEMSB+8                                               01292000
PCCAEMSP EQU   PCCAEMSB+4                                               01293000
PCCARMS  EQU   PCCARMSB                                                 01294000
PCCARV34 EQU   PCCARMSB                                                 01295000
PCCARV33 EQU   PCCARMSB                                                 01296000
PCCARV32 EQU   PCCARMSB                                                 01297000
PCCARV31 EQU   PCCARMSB                                                 01298000
PCCARV30 EQU   PCCARMSB                                                 01299000
PCCARV29 EQU   PCCARMSB                                                 01300000
PCCARV28 EQU   PCCARMSB                                                 01301000
PCCARV27 EQU   PCCAEMS3                                                 01302000
PCCARV26 EQU   PCCAEMS3                                                 01303000
PCCARV25 EQU   PCCAEMS3                                                 01304000
PCCARV24 EQU   PCCAEMS3                                                 01305000
PCCARV23 EQU   PCCAEMS3                                                 01306000
PCCARV22 EQU   PCCAEMS3                                                 01307000
PCCARV21 EQU   PCCAEMS3                                                 01308000
PCCARV20 EQU   PCCAEMS3                                                 01309000
PCCARV19 EQU   PCCAEMS2                                                 01310000
PCCARV18 EQU   PCCAEMS2                                                 01311000
PCCARV17 EQU   PCCAEMS2                                                 01312000
PCCARV16 EQU   PCCAEMS2                                                 01313000
PCCARV15 EQU   PCCAEMS2                                                 01314000
PCCARV14 EQU   PCCAEMS2                                                 01315000
PCCARV13 EQU   PCCAEMS2                                                 01316000
PCCARV12 EQU   PCCAEMS2                                                 01317000
PCCARV11 EQU   PCCARISP                                                 01318000
PCCARV10 EQU   PCCARISP                                                 01319000
PCCARV09 EQU   PCCARISP                                                 01320000
PCCARV08 EQU   PCCARISP                                                 01321000
PCCARV07 EQU   PCCARISP                                                 01322000
PCCARV06 EQU   PCCARISP                                                 01323000
PCCASERL EQU   PCCARISP                                                 01324000
PCCAPARL EQU   PCCARISP                                                 01325000
PCCARPB  EQU   PCCA+132                                                 01326000
PCCACTIN EQU   PCCAINTE                                                 01327000
PCCANFIN EQU   PCCAINTE                                                 01328000
PCCANUIN EQU   PCCAINTE                                                 01329000
PCCACTCC EQU   PCCACCE                                                  01330000
PCCANFCC EQU   PCCACCE                                                  01331000
PCCANUCC EQU   PCCACCE                                                  01332000
PCCACTTD EQU   PCCATODE                                                 01333000
PCCANFTD EQU   PCCATODE                                                 01334000
PCCANUTD EQU   PCCATODE                                                 01335000
PCCARV04 EQU   PCCATMFL                                                 01336000
PCCARV03 EQU   PCCATMFL                                                 01337000
PCCARV02 EQU   PCCATMFL                                                 01338000
PCCAMINT EQU   PCCATMFL                                                 01339000
PCCAMCC  EQU   PCCATMFL                                                 01340000
PCCAVKIL EQU   PCCATMFL                                                 01341000
PCCASYNC EQU   PCCATMFL                                                 01342000
PCCAINIT EQU   PCCATMFL                                                 01343000
PCCARV9E EQU   PCCA+124                                                 01344000
PCCARV9D EQU   PCCA+120                                                 01345000
PCCARV9C EQU   PCCA+116                                                 01346000
PCCARV9B EQU   PCCA+112                                                 01347000
PCCARV9A EQU   PCCA+108                                                 01348000
PCCARV99 EQU   PCCA+104                                                 01349000
PCCARV98 EQU   PCCA+100                                                 01350000
PCCARV97 EQU   PCCA+96                                                  01351000
PCCARV96 EQU   PCCA+92                                                  01352000
PCCARV95 EQU   PCCA+88                                                  01353000
PCCARV94 EQU   PCCA+84                                                  01354000
PCCARV93 EQU   PCCA+80                                                  01355000
PCCARV92 EQU   PCCA+76                                                  01356000
PCCARV91 EQU   PCCA+72                                                  01357000
PCCARV90 EQU   PCCA+68                                                  01358000
PCCARV89 EQU   PCCA+64                                                  01359000
PCCARV88 EQU   PCCA+60                                                  01360000
PCCARV87 EQU   PCCA+56                                                  01361000
PCCARV86 EQU   PCCA+52                                                  01362000
PCCARV85 EQU   PCCA+48                                                  01363000
PCCARV84 EQU   PCCA+44                                                  01364000
PCCARV83 EQU   PCCA+40                                                  01365000
PCCARV82 EQU   PCCA+36                                                  01366000
PCCARV81 EQU   PCCA+32                                                  01367000
PCCAPSAR EQU   PCCA+28                                                  01368000
PCCAPSAV EQU   PCCA+24                                                  01369000
PCCATQEP EQU   PCCA+20                                                  01370000
PCCACPUA EQU   PCCA+16                                                  01371000
PCCACPID EQU   PCCA+4                                                   01372000
PCCAPCCA EQU   PCCA                                                     01373000
CVTLEVL  EQU   CVTRELNO+2                                               01374000
CVTNUMB  EQU   CVTRELNO                                                 01375000
CVTMDL   EQU   CVTFIX+250                                               01376000
@NM00030 EQU   CVTFIX+248                                               01377000
@NM00029 EQU   CVTFIX                                                   01378000
CVTRV482 EQU   CVTXTNT2+128                                             01379000
CVTRV481 EQU   CVTXTNT2+124                                             01380000
CVTRV480 EQU   CVTXTNT2+120                                             01381000
CVTRV479 EQU   CVTXTNT2+118                                             01382000
CVTRV478 EQU   CVTXTNT2+117                                             01383000
CVTRV477 EQU   CVTXTNT2+116                                             01384000
CVTRV476 EQU   CVTXTNT2+115                                             01385000
CVTRV475 EQU   CVTXTNT2+114                                             01386000
CVTRV474 EQU   CVTRV466                                                 01387000
CVTRV473 EQU   CVTRV466                                                 01388000
CVTRV472 EQU   CVTRV466                                                 01389000
CVTRV471 EQU   CVTRV466                                                 01390000
CVTRV470 EQU   CVTRV466                                                 01391000
CVTRV469 EQU   CVTRV466                                                 01392000
CVTRV468 EQU   CVTRV466                                                 01393000
CVTRV467 EQU   CVTRV466                                                 01394000
CVTRV465 EQU   CVTRV457                                                 01395000
CVTRV464 EQU   CVTRV457                                                 01396000
CVTRV463 EQU   CVTRV457                                                 01397000
CVTRV462 EQU   CVTRV457                                                 01398000
CVTRV461 EQU   CVTRV457                                                 01399000
CVTRV460 EQU   CVTRV457                                                 01400000
CVTRV459 EQU   CVTRV457                                                 01401000
CVTRV458 EQU   CVTRV457                                                 01402000
CVTRV456 EQU   CVTXTNT2+108                                             01403000
CVTRV455 EQU   CVTXTNT2+104                                             01404000
CVTRV454 EQU   CVTXTNT2+100                                             01405000
CVTRV453 EQU   CVTXTNT2+96                                              01406000
CVTRV452 EQU   CVTXTNT2+94                                              01407000
CVTRV451 EQU   CVTXTNT2+92                                              01408000
CVTRV450 EQU   CVTXTNT2+90                                              01409000
CVTRV449 EQU   CVTXTNT2+88                                              01410000
CVTRV448 EQU   CVTXTNT2+87                                              01411000
CVTRV447 EQU   CVTXTNT2+86                                              01412000
CVTRV446 EQU   CVTRV438                                                 01413000
CVTRV445 EQU   CVTRV438                                                 01414000
CVTRV444 EQU   CVTRV438                                                 01415000
CVTRV443 EQU   CVTRV438                                                 01416000
CVTRV442 EQU   CVTRV438                                                 01417000
CVTRV441 EQU   CVTRV438                                                 01418000
CVTRV440 EQU   CVTRV438                                                 01419000
CVTRV439 EQU   CVTRV438                                                 01420000
CVTRV437 EQU   CVTRV429                                                 01421000
CVTRV436 EQU   CVTRV429                                                 01422000
CVTRV435 EQU   CVTRV429                                                 01423000
CVTRV434 EQU   CVTRV429                                                 01424000
CVTRV433 EQU   CVTRV429                                                 01425000
CVTRV432 EQU   CVTRV429                                                 01426000
CVTRV431 EQU   CVTRV429                                                 01427000
CVTRV430 EQU   CVTRV429                                                 01428000
CVTRV428 EQU   CVTXTNT2+80                                              01429000
CVTRV427 EQU   CVTXTNT2+76                                              01430000
CVTRV426 EQU   CVTXTNT2+72                                              01431000
CVTRV425 EQU   CVTXTNT2+68                                              01432000
CVTATACT EQU   CVTATCVT                                                 01433000
CVTRV423 EQU   CVTXTNT2+62                                              01434000
CVTRV422 EQU   CVTXTNT2+60                                              01435000
CVTRV421 EQU   CVTXTNT2+58                                              01436000
CVTRV420 EQU   CVTXTNT2+56                                              01437000
CVTRV419 EQU   CVTXTNT2+55                                              01438000
CVTRV418 EQU   CVTXTNT2+54                                              01439000
CVTRV417 EQU   CVTRV409                                                 01440000
CVTRV416 EQU   CVTRV409                                                 01441000
CVTRV415 EQU   CVTRV409                                                 01442000
CVTRV414 EQU   CVTRV409                                                 01443000
CVTRV413 EQU   CVTRV409                                                 01444000
CVTRV412 EQU   CVTRV409                                                 01445000
CVTRV411 EQU   CVTRV409                                                 01446000
CVTRV410 EQU   CVTRV409                                                 01447000
CVTRV408 EQU   CVTRV400                                                 01448000
CVTRV407 EQU   CVTRV400                                                 01449000
CVTRV406 EQU   CVTRV400                                                 01450000
CVTRV405 EQU   CVTRV400                                                 01451000
CVTRV404 EQU   CVTRV400                                                 01452000
CVTRV403 EQU   CVTRV400                                                 01453000
CVTRV402 EQU   CVTRV400                                                 01454000
CVTRV401 EQU   CVTRV400                                                 01455000
CVTICB   EQU   CVTXTNT2+48                                              01456000
CVTSKTA  EQU   CVTXTNT2+44                                              01457000
CVTCCVT  EQU   CVTXTNT2+40                                              01458000
CVTRSV98 EQU   CVTXTNT2+36                                              01459000
CVTRSV97 EQU   CVTXTNT2+34                                              01460000
CVTRSV96 EQU   CVTXTNT2+32                                              01461000
CVTOLTEP EQU   CVTXTNT2+28                                              01462000
CVTQIDA  EQU   CVTQID+1                                                 01463000
CVTRSV95 EQU   CVTQID                                                   01464000
CVTRSV94 EQU   CVTXTNT2+20                                              01465000
CVTRSV93 EQU   CVTXTNT2+16                                              01466000
CVTRSV92 EQU   CVTXTNT2+12                                              01467000
CVTDEBVR EQU   CVTXTNT2+8                                               01468000
CVTRSV91 EQU   CVTXTNT2+6                                               01469000
CVTRSV9H EQU   CVTFLGBT                                                 01470000
CVTRSV9G EQU   CVTFLGBT                                                 01471000
CVTRSV9F EQU   CVTFLGBT                                                 01472000
CVTRSV9E EQU   CVTFLGBT                                                 01473000
CVTRSV9D EQU   CVTFLGBT                                                 01474000
CVTBAH   EQU   CVTFLGBT                                                 01475000
CVTVME   EQU   CVTFLGBT                                                 01476000
CVTNPE   EQU   CVTFLGBT                                                 01477000
CVTNUCLS EQU   CVTXTNT2+4                                               01478000
CVTDSSVA EQU   CVTDSSV+1                                                01479000
CVTRSV89 EQU   CVTDSSV                                                  01480000
CVTRSV88 EQU   CVTXTNT1+8                                               01481000
CVTRSV87 EQU   CVTXTNT1+4                                               01482000
CVTFACHN EQU   CVTXTNT1                                                 01483000
CVTRV488 EQU   CVTMAP+412                                               01484000
CVTRV487 EQU   CVTMAP+408                                               01485000
CVTRV486 EQU   CVTMAP+404                                               01486000
CVTRV485 EQU   CVTMAP+400                                               01487000
CVTACTAP EQU   CVTMAP+396                                               01488000
CVTAUTH  EQU   CVTMAP+392                                               01489000
CVTRV490 EQU   CVTMAP+388                                               01490000
CVTSU    EQU   CVTMAP+384                                               01491000
CVTVOLT1 EQU   CVTVOLM1+1                                               01492000
CVTVOLI1 EQU   CVTVOLF1                                                 01493000
CVTSTOA  EQU   CVTMAP+376                                               01494000
CVTRSV58 EQU   CVTMAP+374                                               01495000
CVTRSV57 EQU   CVTMAP+372                                               01496000
CVTDDCE  EQU   CVTMAP+368                                               01497000
CVTPNWFR EQU   CVTMAP+364                                               01498000
CVTSMF   EQU   CVTMAP+360                                               01499000
CVTSULK  EQU   CVTMAP+358                                               01500000
CVTSLKO  EQU   CVTSYSK                                                  01501000
CVTSLKP  EQU   CVTSYSK                                                  01502000
CVTSLKQ  EQU   CVTSYSK                                                  01503000
CVTSLKR  EQU   CVTSYSK                                                  01504000
CVTRSV56 EQU   CVTSYSK                                                  01505000
CVTRSV55 EQU   CVTSYSK                                                  01506000
CVTRSV54 EQU   CVTSYSK                                                  01507000
CVTRSV53 EQU   CVTSYSK                                                  01508000
CVTRSV52 EQU   CVTA1F1                                                  01509000
CVTRSV51 EQU   CVTA1F1                                                  01510000
CVTRSV50 EQU   CVTA1F1                                                  01511000
CVTRSV49 EQU   CVTA1F1                                                  01512000
CVTRSV48 EQU   CVTA1F1                                                  01513000
CVTRSV47 EQU   CVTA1F1                                                  01514000
CVTSRSW  EQU   CVTA1F1                                                  01515000
CVTPFSW  EQU   CVTA1F1                                                  01516000
CVTPCVT  EQU   CVTMAP+352                                               01517000
CVTRSV46 EQU   CVTMAP+344                                               01518000
CVTRSV45 EQU   CVTMAP+340                                               01519000
CVTRSV44 EQU   CVTMAP+338                                               01520000
CVTRSV43 EQU   CVTMAP+336                                               01521000
CVTHJESA EQU   CVTHJES+1                                                01522000
CVTRSV42 EQU   CVTHJES                                                  01523000
CVTEXT2A EQU   CVTEXT2+1                                                01524000
CVTRSV41 EQU   CVTEXT2                                                  01525000
CVTAPFA  EQU   CVTAPF+1                                                 01526000
CVTRSV40 EQU   CVTAPF                                                   01527000
CVTRV518 EQU   CVTINTLA                                                 01528000
CVTRV517 EQU   CVTERPV                                                  01529000
CVTEORM  EQU   CVTMAP+312                                               01530000
CVTMCHPR EQU   CVTMAP+308                                               01531000
CVTTZ    EQU   CVTMAP+304                                               01532000
CVTJEPS  EQU   CVTMAP+300                                               01533000
CVTJESCT EQU   CVTMAP+296                                               01534000
CVTMODE  EQU   CVTMAP+292                                               01535000
CVTPTRV  EQU   CVTMAP+288                                               01536000
CVTREAL  EQU   CVTMAP+284                                               01537000
CVTRSV39 EQU   CVTMAP+280                                               01538000
CVTRSV38 EQU   CVTMAP+276                                               01539000
CVTDMSRA EQU   CVTDMSR+1                                                01540000
CVTRV634 EQU   CVTDMSRF                                                 01541000
CVTRV633 EQU   CVTDMSRF                                                 01542000
CVTRV632 EQU   CVTDMSRF                                                 01543000
CVTRV631 EQU   CVTDMSRF                                                 01544000
CVTRV630 EQU   CVTDMSRF                                                 01545000
CVTRV629 EQU   CVTDMSRF                                                 01546000
CVTUDUMP EQU   CVTDMSRF                                                 01547000
CVTSDUMP EQU   CVTDMSRF                                                 01548000
CVTQMSGA EQU   CVTQMSG+1                                                01549000
CVTRSV36 EQU   CVTQMSG                                                  01550000
CVTAMFF  EQU   CVTMAP+264                                               01551000
CVTPURGA EQU   CVTPURG+1                                                01552000
CVTRSV35 EQU   CVTPURG                                                  01553000
CVTCBSP  EQU   CVTMAP+256                                               01554000
CVTATERA EQU   CVTATER+1                                                01555000
CVTSYST  EQU   CVTATER                                                  01556000
CVTVOLT2 EQU   CVTTAT                                                   01557000
CVTVOLI2 EQU   CVTVOLF2                                                 01558000
CVTAQAVB EQU   CVTAQAVT+1                                               01559000
CVTRSV34 EQU   CVTTCMFG                                                 01560000
CVTRSV33 EQU   CVTTCMFG                                                 01561000
CVTRSV32 EQU   CVTTCMFG                                                 01562000
CVTRSV31 EQU   CVTTCMFG                                                 01563000
CVTRSV30 EQU   CVTTCMFG                                                 01564000
CVTRSV29 EQU   CVTTCMFG                                                 01565000
CVTLDEV  EQU   CVTTCMFG                                                 01566000
CVTTCRDY EQU   CVTTCMFG                                                 01567000
CVTGTFA  EQU   CVTGTF+1                                                 01568000
CVTRSV27 EQU   CVTGTFST                                                 01569000
CVTRNIO  EQU   CVTGTFST                                                 01570000
CVTUSR   EQU   CVTGTFST                                                 01571000
CVTRV318 EQU   CVTFORM                                                  01572000
CVTRV317 EQU   CVTTMODE                                                 01573000
CVTRV316 EQU   CVTSTATE                                                 01574000
CVTRV315 EQU   CVTGTFS                                                  01575000
CVTGTFAV EQU   CVTGTFS                                                  01576000
CVT0SCR1 EQU   CVTMAP+232                                               01577000
CVTRV515 EQU   CVTMAP+228                                               01578000
CVTRMS   EQU   CVTMAP+224                                               01579000
CVTPATCH EQU   CVTMAP+220                                               01580000
CVTTSCE  EQU   CVTMAP+216                                               01581000
CVTLNKSC EQU   CVTMAP+214                                               01582000
CVTQABST EQU   CVTMAP+212                                               01583000
CVTMDLDS EQU   CVTMAP+208                                               01584000
CVTUSER  EQU   CVTMAP+204                                               01585000
CVTABEND EQU   CVTMAP+200                                               01586000
CVTSMCA  EQU   CVTMAP+196                                               01587000
CVTRSV18 EQU   CVTMAP+192                                               01588000
CVTQLPAQ EQU   CVTMAP+188                                               01589000
CVTQCDSR EQU   CVTMAP+184                                               01590000
CVTVS1B  EQU   CVTOPTB                                                  01591000
CVTVS1A  EQU   CVTOPTB                                                  01592000
CVTFP    EQU   CVTOPTB                                                  01593000
CVTAPTHR EQU   CVTOPTB                                                  01594000
CVTNLOG  EQU   CVTOPTB                                                  01595000
CVTTOD   EQU   CVTOPTB                                                  01596000
CVTCTIMS EQU   CVTOPTB                                                  01597000
CVTPROT  EQU   CVTOPTB                                                  01598000
CVTXPFP  EQU   CVTOPTA                                                  01599000
CVTASCII EQU   CVTOPTA                                                  01600000
CVTRSV13 EQU   CVTOPTA                                                  01601000
CVTRSV12 EQU   CVTOPTA                                                  01602000
CVTNIP   EQU   CVTOPTA                                                  01603000
CVTDDR   EQU   CVTOPTA                                                  01604000
CVTAPR   EQU   CVTOPTA                                                  01605000
CVTCCH   EQU   CVTOPTA                                                  01606000
CVTSNCTR EQU   CVTMAP+180                                               01607000
CVTQMWR  EQU   CVTMAP+176                                               01608000
CVTQOCR  EQU   CVTMAP+172                                               01609000
CVT1EF00 EQU   CVTMAP+168                                               01610000
CVTMZ00  EQU   CVTMAP+164                                               01611000
CVTSV76Q EQU   CVTSV76C                                                 01612000
CVTRSV11 EQU   CVTMAP+156                                               01613000
CVT0PT01 EQU   CVTMAP+152                                               01614000
CVTMSER  EQU   CVTMAP+148                                               01615000
CVTRV516 EQU   CVTIERLC                                                 01616000
CVTILCH  EQU   CVTMAP+140                                               01617000
CVT0DS   EQU   CVTMAP+136                                               01618000
CVTFBOSV EQU   CVTMAP+132                                               01619000
CVTIXAVL EQU   CVTMAP+124                                               01620000
CVTSV76M EQU   CVTIOQET                                                 01621000
CVTDCBA  EQU   CVTMAP+117                                               01622000
CVTMVS2  EQU   CVTDCB                                                   01623000
CVT6DAT  EQU   CVTDCB                                                   01624000
CVT4MPS  EQU   CVTDCB                                                   01625000
CVTRSV09 EQU   CVTDCB                                                   01626000
CVT4MS1  EQU   CVTDCB                                                   01627000
CVT2SPS  EQU   CVTDCB                                                   01628000
CVT1SSS  EQU   CVTDCB                                                   01629000
CVTRSV08 EQU   CVTDCB                                                   01630000
CVTSTB   EQU   CVTMAP+112                                               01631000
CVTQTD00 EQU   CVTMAP+108                                               01632000
CVTQTE00 EQU   CVTMAP+104                                               01633000
CVTCUCB  EQU   CVTMAP+100                                               01634000
CVTSJQ   EQU   CVTMAP+96                                                01635000
CVTPBLDL EQU   CVTMAP+92                                                01636000
CVTTPC   EQU   CVTMAP+88                                                01637000
CVTSVDCB EQU   CVTMAP+84                                                01638000
CVTBRET  EQU   CVTMAP+82                                                01639000
CVTEXIT  EQU   CVTMAP+80                                                01640000
CVT0FN00 EQU   CVTMAP+76                                                01641000
CVTDARA  EQU   CVTDAR+1                                                 01642000
CVTRSV07 EQU   CVTFLGS1                                                 01643000
CVTRSV06 EQU   CVTFLGS1                                                 01644000
CVTRSV05 EQU   CVTFLGS1                                                 01645000
CVTRSV04 EQU   CVTFLGS1                                                 01646000
CVTRSV03 EQU   CVTFLGS1                                                 01647000
CVTRSV02 EQU   CVTFLGS1                                                 01648000
CVTRSV01 EQU   CVTFLGS1                                                 01649000
CVTDMPLK EQU   CVTFLGS1                                                 01650000
CVTXITP  EQU   CVTMAP+68                                                01651000
CVTZDTAB EQU   CVTMAP+64                                                01652000
CVTMSLT  EQU   CVTMAP+60                                                01653000
CVTDATE  EQU   CVTMAP+56                                                01654000
CVTBTERM EQU   CVTMAP+52                                                01655000
CVTSYSAD EQU   CVTMAP+48                                                01656000
CVTXTLER EQU   CVTMAP+44                                                01657000
CVTILK2  EQU   CVTMAP+40                                                01658000
CVTILK1  EQU   CVTMAP+36                                                01659000
CVTPRLTV EQU   CVTMAP+32                                                01660000
CVTPCNVT EQU   CVTMAP+28                                                01661000
CVT0VL00 EQU   CVTMAP+24                                                01662000
CVTXAPG  EQU   CVTMAP+20                                                01663000
CVTBUF   EQU   CVTMAP+16                                                01664000
CVTJOB   EQU   CVTMAP+12                                                01665000
CVTLINK  EQU   CVTMAP+8                                                 01666000
CVT0EF00 EQU   CVTMAP+4                                                 01667000
CVTTCBP  EQU   CVTMAP                                                   01668000
CVT      EQU   CVTMAP                                                   01669000
ABDTRLN  EQU   ABDAREA+676                                              01670000
ABDSAVE1 EQU   ABDAREA+672                                              01671000
ABDSAVHD EQU   ABDAREA+592                                              01672000
ABDPADC  EQU   ABDAREA+589                                              01673000
ABDLINE  EQU   ABDLINEA+1                                               01674000
ABDSRC2  EQU   ABDAREA+382                                              01675000
ABDLOG   EQU   ABDAREA+380                                              01676000
ABDSRC1  EQU   ABDAREA+378                                              01677000
ABDPHY   EQU   ABDAREA+376                                              01678000
ABDLCNT  EQU   ABDAREA+372                                              01679000
@NM00028 EQU   ESPARM+29                                                01680000
@NM00027 EQU   ESTAEFLG                                                 01681000
EDCB     EQU   ESTAEFLG                                                 01682000
ETCB     EQU   ESTAEFLG                                                 01683000
ESUBSYT  EQU   ESTAEFLG                                                 01684000
ERESTART EQU   ESPARM+24                                                01685000
EMODNAME EQU   ESPARM+16                                                01686000
EABDAREA EQU   ESPARM+12                                                01687000
ESAUTOP  EQU   ESPARM+8                                                 01688000
ESBSREG2 EQU   ESPARM+4                                                 01689000
ESBSREG  EQU   ESPARM                                                   01690000
ABDRTRN  EQU   ABDAREA+336                                              01691000
ABDSVCB  EQU   ABDAREA+332                                              01692000
@NM00026 EQU   ABDGMA+14                                                01693000
ABDCDID  EQU   ABDGMA+12                                                01694000
ABDPAREA EQU   ABDGMA+8                                                 01695000
ABDBUFSZ EQU   ABDBUFFS+4                                               01696000
ABDBUFAD EQU   ABDBUFFS                                                 01697000
ABSLCTSV EQU   ABDAREA+304                                              01698000
ABDSTADS EQU   ABDAREA+300                                              01699000
ABDUPRID EQU   ABDAREA+296                                              01700000
ABDPCAP  EQU   ABDAREA+295                                              01701000
ABDLLNGH EQU   ABDAREA+294                                              01702000
ABDINCPL EQU   ABDAREA+292                                              01703000
ABDFWORK EQU   ABDAREA+288                                              01704000
ABDIDENT EQU   ABDAREA+286                                              01705000
ABDIND   EQU   ABDAREA+284                                              01706000
ABDSIZE  EQU   ABDAREA+280                                              01707000
ABDSTAD  EQU   ABDAREA+268                                              01708000
@NM00025 EQU   ABDBLNKS                                                 01709000
@NM00024 EQU   ABDBLNKS                                                 01710000
@NM00023 EQU   ABDBLNKS                                                 01711000
@NM00022 EQU   ABDBLNKS                                                 01712000
@NM00021 EQU   ABDBLNKS                                                 01713000
@NM00020 EQU   ABDBLNKS                                                 01714000
@NM00019 EQU   ABDBLNKS                                                 01715000
ABDBLKN3 EQU   ABDBLNKS                                                 01716000
@NM00018 EQU   ABDUPRFN                                                 01717000
@NM00017 EQU   ABDUPRFN                                                 01718000
@NM00016 EQU   ABDUPRFN                                                 01719000
@NM00015 EQU   ABDUPRFN                                                 01720000
@NM00014 EQU   ABDUPRFN                                                 01721000
@NM00013 EQU   ABDUPRFN                                                 01722000
ABDUPRPM EQU   ABDUPRFN                                                 01723000
@NM00012 EQU   ABDUPRF                                                  01724000
@NM00011 EQU   ABDUPRF                                                  01725000
@NM00010 EQU   ABDUPRF                                                  01726000
@NM00009 EQU   ABDUPRF                                                  01727000
@NM00008 EQU   ABDUPRF                                                  01728000
UPRFMT20 EQU   ABDUPRF                                                  01729000
UPRFMAT  EQU   ABDUPRF                                                  01730000
ABDFMTWK EQU   ABDAREA+256                                              01731000
ABDLPTR  EQU   ABDAREA+252                                              01732000
ABDLLINE EQU   ABDAREA+248                                              01733000
ABDBPTR  EQU   ABDAREA+244                                              01734000
ABDSSPAR EQU   ABDAREA+188                                              01735000
@NM00007 EQU   ABDRES1                                                  01736000
ABDTRSV  EQU   ABDRES1                                                  01737000
ABDPGHD  EQU   ABDRES1                                                  01738000
ABDFMTLD EQU   ABDRES1                                                  01739000
ABDSQA   EQU   ABDRES1                                                  01740000
ABDOLSQA EQU   ABDRES1                                                  01741000
ABDREGS  EQU   ABDRES1                                                  01742000
ABDPSW   EQU   ABDRES1                                                  01743000
ABDKEY   EQU   ABDAREA+138                                              01744000
ABDLSQA  EQU   ABDFLAG2                                                 01745000
ABDSTAT  EQU   ABDFLAG2                                                 01746000
ABDSWAP  EQU   ABDFLAG2                                                 01747000
ABDGTFCL EQU   ABDFLAG2                                                 01748000
ABDTRNAV EQU   ABDFLAG2                                                 01749000
ABDTRBIT EQU   ABDFLAG2                                                 01750000
ABDGTF   EQU   ABDFLAG2                                                 01751000
ABDSUPER EQU   ABDFLAG2                                                 01752000
ABDIDX   EQU   ABDFLAG1                                                 01753000
ABDSPHD  EQU   ABDFLAG1                                                 01754000
ABDSVCHD EQU   ABDFLAG1                                                 01755000
ABDSQSDM EQU   ABDFLAG1                                                 01756000
ABDLSTHD EQU   ABDFLAG1                                                 01757000
ABDQCBMN EQU   ABDFLAG1                                                 01758000
ABDQCBMJ EQU   ABDFLAG1                                                 01759000
ABDQCBHD EQU   ABDFLAG1                                                 01760000
ABDPGWK  EQU   ABDAREA+128                                              01761000
ABDWORK1 EQU   ABDAREA+120                                              01762000
ABDRESV3 EQU   ABDAREA+116                                              01763000
ABDUPRXT EQU   ABDAREA+112                                              01764000
ABDCP1   EQU   ABDAREA+108                                              01765000
ABDLP    EQU   ABDAREA+104                                              01766000
ABDFP    EQU   ABDAREA+100                                              01767000
ABDCP    EQU   ABDAREA+96                                               01768000
ABDPTRS3 EQU   ABDPTRS+8                                                01769000
ABDPTRS2 EQU   ABDPTRS+4                                                01770000
ABDPTRS1 EQU   ABDPTRS                                                  01771000
ABDPCTR  EQU   ABDAREA+82                                               01772000
ABDLCTR  EQU   ABDAREA+80                                               01773000
ABDIOBP  EQU   ABDAREA+76                                               01774000
ABDPTR   EQU   ABDAREA+72                                               01775000
ABDDCB   EQU   ABDAREA+68                                               01776000
ABDLEN   EQU   ABDAREA+66                                               01777000
ABDTYPE  EQU   ABDAREA+64                                               01778000
ABDECB   EQU   ABDAREA+60                                               01779000
ABDSAVE  EQU   ABDAREA+56                                               01780000
ABDDECB  EQU   ABDAREA+52                                               01781000
ABDPARA  EQU   ABDAREA+48                                               01782000
ABDTABPT EQU   ABDAREA+44                                               01783000
ABDINXPT EQU   ABDAREA+40                                               01784000
ABDCTR   EQU   ABDAREA+38                                               01785000
@NM00006 EQU   ABDAREA+36                                               01786000
ABDHDRAD EQU   ABDPARMS+20                                              01787000
ABDSNAPP EQU   ABDPARMS+16                                              01788000
ABDPTCBP EQU   ABDPARMS+12                                              01789000
ABDPDCBP EQU   ABDPARMS+8                                               01790000
@NM00005 EQU   ABDPARMS+7                                               01791000
@NM00004 EQU   APFPDATA                                                 01792000
APFSPALL EQU   APFPDATA                                                 01793000
APFPSW   EQU   APFPDATA                                                 01794000
APFJPA   EQU   APFPDATA                                                 01795000
APFLPA   EQU   APFPDATA                                                 01796000
APFREGS  EQU   APFPDATA                                                 01797000
APFSAVE2 EQU   APFPDATA                                                 01798000
APFSAVE  EQU   APFPDATA                                                 01799000
@NM00003 EQU   APFSDAT1                                                 01800000
APFERR   EQU   APFSDAT1                                                 01801000
APFIO    EQU   APFSDAT1                                                 01802000
APFDM    EQU   APFSDATA                                                 01803000
APFQCB   EQU   APFSDATA                                                 01804000
APFSUPDA EQU   APFSDATA                                                 01805000
APFTRACE EQU   APFSDATA                                                 01806000
APFSWA   EQU   APFSDATA                                                 01807000
@NM00002 EQU   ABDPARMS+2                                               01808000
APFHDR   EQU   ABDFLAG                                                  01809000
APFSNAPP EQU   ABDFLAG                                                  01810000
APFTCB   EQU   ABDFLAG                                                  01811000
APFID    EQU   ABDFLAG                                                  01812000
APFABEND EQU   ABDFLAG                                                  01813000
APFENVS2 EQU   ABDFLAG                                                  01814000
APFVS2   EQU   ABDFLAG                                                  01815000
APFSNAP  EQU   ABDFLAG                                                  01816000
ABDPID   EQU   ABDPARMS                                                 01817000
ABDCRB   EQU   ABDAREA+8                                                01818000
ABDCTCB  EQU   ABDAREA+4                                                01819000
@NM00054 EQU   PSA+3668                                                 01820000
PSASTAK  EQU   PSA+3072                                                 01821000
@NM00053 EQU   PSA+1048                                                 01822000
PSAUSEND EQU   PSA+1048                                                 01823000
PSARV062 EQU   PSA+1044                                                 01824000
PSACDAL  EQU   PSA+1040                                                 01825000
PSAWTCOD EQU   PSA+1036                                                 01826000
PSAATCVT EQU   PSA+1032                                                 01827000
PSAPCPSW EQU   PSA+1024                                                 01828000
PSAPIR2  EQU   PSA+1020                                                 01829000
PSARV059 EQU   PSA+1018                                                 01830000
PSASVC13 EQU   PSA+1016                                                 01831000
PSALSFCC EQU   PSA+1012                                                 01832000
PSASFACC EQU   PSA+1008                                                 01833000
PSASTOP  EQU   PSA+992                                                  01834000
PSASTART EQU   PSA+976                                                  01835000
PSARSPSW EQU   PSA+968                                                  01836000
PSASRPSW EQU   PSA+960                                                  01837000
PSARV045 EQU   PSA+892                                                  01838000
PSARV044 EQU   PSA+888                                                  01839000
PSARV043 EQU   PSA+884                                                  01840000
PSARV042 EQU   PSA+880                                                  01841000
PSARV041 EQU   PSA+876                                                  01842000
PSARV040 EQU   PSA+872                                                  01843000
PSARV025 EQU   PSA+868                                                  01844000
PSADSSED EQU   PSA+868                                                  01845000
PSADSSPR EQU   PSA+864                                                  01846000
PSADSSFW EQU   PSA+860                                                  01847000
PSADSS14 EQU   PSA+856                                                  01848000
PSADSSPP EQU   PSA+848                                                  01849000
PSADSSRP EQU   PSA+840                                                  01850000
PSADSS05 EQU   PSADSSF4                                                 01851000
PSADSS10 EQU   PSADSSF4                                                 01852000
PSADSSVE EQU   PSADSSF4                                                 01853000
PSADSSDE EQU   PSADSSF4                                                 01854000
PSADSSC0 EQU   PSADSSF4                                                 01855000
PSADSSIE EQU   PSADSSF4                                                 01856000
PSADSS12 EQU   PSADSSF4                                                 01857000
PSADSSRC EQU   PSADSSF4                                                 01858000
PSARV057 EQU   PSADSSF3                                                 01859000
PSARV056 EQU   PSADSSF3                                                 01860000
PSARV055 EQU   PSADSSF3                                                 01861000
PSADSSMC EQU   PSADSSF3                                                 01862000
PSADSSRW EQU   PSADSSF3                                                 01863000
PSADSSNM EQU   PSADSSF3                                                 01864000
PSADSSES EQU   PSADSSF3                                                 01865000
PSADSSGP EQU   PSADSSF3                                                 01866000
PSADSSF2 EQU   PSADSSFL+1                                               01867000
PSADSSPI EQU   PSADSSF1                                                 01868000
PSADSSOI EQU   PSADSSF1                                                 01869000
PSADSSSP EQU   PSADSSF1                                                 01870000
PSADSSTP EQU   PSADSSF1                                                 01871000
PSADSSDW EQU   PSADSSF1                                                 01872000
PSADSSDD EQU   PSADSSF1                                                 01873000
PSADSSDM EQU   PSADSSF1                                                 01874000
PSADSSMV EQU   PSADSSF1                                                 01875000
PSADSSTS EQU   PSA+816                                                  01876000
PSADSSWK EQU   PSA+812                                                  01877000
PSADSSR3 EQU   PSA+808                                                  01878000
PSADSSR2 EQU   PSA+804                                                  01879000
PSADSSRS EQU   PSA+800                                                  01880000
PSASTOR  EQU   PSA+796                                                  01881000
PSACPUSA EQU   PSA+794                                                  01882000
PSAVSTAP EQU   PSA+792                                                  01883000
PSAWKVAP EQU   PSA+788                                                  01884000
PSAWKRAP EQU   PSA+784                                                  01885000
PSAMCHIC EQU   PSA+783                                                  01886000
PSARV061 EQU   PSA+782                                                  01887000
PSASYMSK EQU   PSA+781                                                  01888000
PSAMCHFL EQU   PSA+780                                                  01889000
PSACR0   EQU   PSA+776                                                  01890000
PSAPSWSV EQU   PSA+768                                                  01891000
PSALITA  EQU   PSA+764                                                  01892000
PSACLHS  EQU   PSAHLHI                                                  01893000
PSALKR15 EQU   PSALKSA+60                                               01894000
PSALKR14 EQU   PSALKSA+56                                               01895000
PSALKR13 EQU   PSALKSA+52                                               01896000
PSALKR12 EQU   PSALKSA+48                                               01897000
PSALKR11 EQU   PSALKSA+44                                               01898000
PSALKR10 EQU   PSALKSA+40                                               01899000
PSALKR9  EQU   PSALKSA+36                                               01900000
PSALKR8  EQU   PSALKSA+32                                               01901000
PSALKR7  EQU   PSALKSA+28                                               01902000
PSALKR6  EQU   PSALKSA+24                                               01903000
PSALKR5  EQU   PSALKSA+20                                               01904000
PSALKR4  EQU   PSALKSA+16                                               01905000
PSALKR3  EQU   PSALKSA+12                                               01906000
PSALKR2  EQU   PSALKSA+8                                                01907000
PSALKR1  EQU   PSALKSA+4                                                01908000
PSALKR0  EQU   PSALKSA                                                  01909000
PSARV023 EQU   PSACLHT+52                                               01910000
PSALOCAL EQU   PSACLHT+48                                               01911000
PSACMSL  EQU   PSACLHT+44                                               01912000
PSAOPTL  EQU   PSACLHT+40                                               01913000
PSATPACL EQU   PSACLHT+36                                               01914000
PSATPDNL EQU   PSACLHT+32                                               01915000
PSATPNCL EQU   PSACLHT+28                                               01916000
PSAIOSLL EQU   PSACLHT+24                                               01917000
PSAIOSUL EQU   PSACLHT+20                                               01918000
PSAIOSCL EQU   PSACLHT+16                                               01919000
PSAIOSSL EQU   PSACLHT+12                                               01920000
PSASALCL EQU   PSACLHT+8                                                01921000
PSAASML  EQU   PSACLHT+4                                                01922000
PSADISPL EQU   PSACLHT                                                  01923000
PSASRSA  EQU   PSA+636                                                  01924000
PSARV050 EQU   PSA+634                                                  01925000
PSADSSGO EQU   PSA+633                                                  01926000
PSARECUR EQU   PSA+632                                                  01927000
PSAHLHIS EQU   PSA+628                                                  01928000
PSAIPCSA EQU   PSA+624                                                  01929000
@NM00052 EQU   PSA+621                                                  01930000
PSAIPCDM EQU   PSA+620                                                  01931000
PSAIPCD  EQU   PSA+616                                                  01932000
@NM00051 EQU   PSA+613                                                  01933000
PSAIPCRM EQU   PSA+612                                                  01934000
PSAIPCR  EQU   PSA+608                                                  01935000
PSAMCHEX EQU   PSA+600                                                  01936000
PSAMPSW  EQU   PSA+592                                                  01937000
PSAEXPS2 EQU   PSA+584                                                  01938000
PSAEXPS1 EQU   PSA+576                                                  01939000
PSAPIREG EQU   PSA+572                                                  01940000
PSARSREG EQU   PSA+568                                                  01941000
PSAGPREG EQU   PSA+556                                                  01942000
PSARV022 EQU   PSASUP4                                                  01943000
PSARV021 EQU   PSASUP4                                                  01944000
PSARV020 EQU   PSASUP4                                                  01945000
PSARV019 EQU   PSASUP4                                                  01946000
PSARV018 EQU   PSASUP4                                                  01947000
PSARV017 EQU   PSASUP4                                                  01948000
PSARV016 EQU   PSASUP4                                                  01949000
PSARV015 EQU   PSASUP4                                                  01950000
PSARV014 EQU   PSASUP3                                                  01951000
PSAULCMS EQU   PSASUP3                                                  01952000
PSARV012 EQU   PSASUP3                                                  01953000
PSAESTA  EQU   PSASUP3                                                  01954000
PSASPR   EQU   PSASUP3                                                  01955000
PSAPSREG EQU   PSASUP3                                                  01956000
PSAPI2   EQU   PSASUP3                                                  01957000
PSAIOSUP EQU   PSASUP3                                                  01958000
PSALCR   EQU   PSASUP2                                                  01959000
PSARTM   EQU   PSASUP2                                                  01960000
PSAACR   EQU   PSASUP2                                                  01961000
PSAIPCE2 EQU   PSASUP2                                                  01962000
PSAIPCES EQU   PSASUP2                                                  01963000
PSAIPCEC EQU   PSASUP2                                                  01964000
PSAGTF   EQU   PSASUP2                                                  01965000
PSAIPCRI EQU   PSASUP2                                                  01966000
PSATYPE6 EQU   PSASUP1                                                  01967000
PSATCTL  EQU   PSASUP1                                                  01968000
PSADISP  EQU   PSASUP1                                                  01969000
PSALOCK  EQU   PSASUP1                                                  01970000
PSAPI    EQU   PSASUP1                                                  01971000
PSAEXT   EQU   PSASUP1                                                  01972000
PSASVC   EQU   PSASUP1                                                  01973000
PSAIO    EQU   PSASUP1                                                  01974000
PSAAOLD  EQU   PSA+548                                                  01975000
PSAANEW  EQU   PSA+544                                                  01976000
PSATNEW  EQU   PSA+536                                                  01977000
PSALCCAR EQU   PSA+532                                                  01978000
PSALCCAV EQU   PSA+528                                                  01979000
PSAPCCAR EQU   PSA+524                                                  01980000
PSACPULA EQU   PSA+518                                                  01981000
PSACPUPA EQU   PSA+516                                                  01982000
PSAPSA   EQU   PSA+512                                                  01983000
FLCHDEND EQU   PSA+512                                                  01984000
FLCCRSAV EQU   FLCMCLA+280                                              01985000
FLCGRSAV EQU   FLCMCLA+216                                              01986000
FLCFPSAV EQU   FLCMCLA+184                                              01987000
FLCFLA   EQU   FLCMCLA+88                                               01988000
FLCRGNCD EQU   FLCMCLA+84                                               01989000
FLCFSAA  EQU   FLCFSA+1                                                 01990000
@NM00050 EQU   FLCFSA                                                   01991000
@NM00049 EQU   FLCMCLA+72                                               01992000
FLCMCIC  EQU   FLCMCLA+64                                               01993000
@NM00048 EQU   FLCMCLA+20                                               01994000
FLCIOAA  EQU   FLCIOA+1                                                 01995000
@NM00047 EQU   FLCIOA                                                   01996000
@NM00046 EQU   FLCMCLA+15                                               01997000
@NM00045 EQU   FLCMCLA+14                                               01998000
@NM00044 EQU   FLCMCLA+12                                               01999000
FLCLCL   EQU   FLCMCLA+8                                                02000000
FLCIOELA EQU   FLCIOEL+1                                                02001000
@NM00043 EQU   FLCIOEL                                                  02002000
FLCCHNID EQU   FLCMCLA                                                  02003000
@NM00042 EQU   PSA+160                                                  02004000
FLCMTRCD EQU   PSA+157                                                  02005000
@NM00041 EQU   PSA+156                                                  02006000
FLCPERA  EQU   FLCPER+1                                                 02007000
@NM00040 EQU   FLCPER                                                   02008000
@NM00039 EQU   PSA+151                                                  02009000
FLCPERCD EQU   PSA+150                                                  02010000
FLCMCNUM EQU   PSA+149                                                  02011000
@NM00038 EQU   PSA+148                                                  02012000
FLCTEAA  EQU   FLCTEA+1                                                 02013000
@NM00037 EQU   FLCTEA                                                   02014000
PSAPIPC  EQU   PSAPICOD                                                 02015000
PSAPIMC  EQU   PSAPICOD                                                 02016000
PSAPIPER EQU   PSAPICOD                                                 02017000
PSARV049 EQU   FLCPICOD                                                 02018000
FLCPILCB EQU   FLCPIILC                                                 02019000
@NM00036 EQU   FLCPIILC                                                 02020000
@NM00035 EQU   PSAEPPSW                                                 02021000
FLCSVCN  EQU   PSAESPSW+2                                               02022000
FLCSILCB EQU   FLCSVILC                                                 02023000
@NM00034 EQU   FLCSVILC                                                 02024000
@NM00033 EQU   PSAESPSW                                                 02025000
FLCEICOD EQU   PSAEEPSW+2                                               02026000
PSASPAD  EQU   PSAEEPSW                                                 02027000
@NM00032 EQU   PSA+128                                                  02028000
FLCINPSW EQU   PSA+120                                                  02029000
FLCMNPSW EQU   PSA+112                                                  02030000
FLCPNPSW EQU   PSA+104                                                  02031000
FLCSNPSW EQU   PSA+96                                                   02032000
FLCENPSW EQU   PSA+88                                                   02033000
FLCTRACE EQU   PSA+84                                                   02034000
FLCTIMER EQU   PSA+80                                                   02035000
FLCCVT2  EQU   PSA+76                                                   02036000
FLCCAW   EQU   PSA+72                                                   02037000
FLCCSW   EQU   PSA+64                                                   02038000
FLCIOPSW EQU   PSA+56                                                   02039000
FLCMOPSW EQU   PSA+48                                                   02040000
FLCPOPSW EQU   PSA+40                                                   02041000
FLCSOPSW EQU   PSA+32                                                   02042000
FLCEOPSW EQU   PSA+24                                                   02043000
@NM00031 EQU   FLCICCW2+4                                               02044000
FLCICCW1 EQU   FLCROPSW                                                 02045000
FLCIPPSW EQU   FLCRNPSW                                                 02046000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02047000
@ENDDATA EQU   *                                                        02048000
         END   IEAVAD09,(C'PLS1801',0701,78062)                         02049000
