         TITLE 'IEAVEMDL- MEMORY DELETE                                *00001000
                        '                                               00002000
IEAVEMDL CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IEAVEMDL  75.245'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @09,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@09                                         0001 00013000
         L     @00,@SIZDATD                                        0001 00014000
         GETMAIN  R,LV=(0)                                              00015000
         LR    @10,@01                                             0001 00016000
         USING @DATD,@10                                           0001 00017000
         LM    @00,@01,20(@13)                                     0001 00018000
*   ASCBPTR=ASCBP;                  /* PICK UP ASCB PARAMETER        */ 00019000
         L     @12,PARMPTR(,PARMRG)                                0082 00020000
         MVC   ASCBPTR(4),ASCBP(@12)                               0082 00021000
*   ASID=ASIDP;                     /* PICK UP ASID PARAMETER        */ 00022000
         MVC   ASID(2),ASIDP(@12)                                  0083 00023000
*   RESPECIFY                                                      0084 00024000
*    (PARMRG) UNRSTD;                                              0084 00025000
*                                                                  0085 00026000
*/*                                                                  */ 00027000
*/*                        SET UP ESTAE ENVIRONMENT                  */ 00028000
*/*                                                                  */ 00029000
*                                                                  0085 00030000
*   ESTAPRM=''B;                    /* INITIALIZE PARM AREA TO 0     */ 00031000
         XC    ESTAPRM(24),ESTAPRM                                 0085 00032000
*   SAVADDR=SAVPTR;                 /* SAVE SAVE AREA ADDRESS IN   0086 00033000
*                                      ESTAE PARAMETER AREA          */ 00034000
         ST    SAVPTR,SAVADDR                                      0086 00035000
*   BASESAV=REG9;                   /* SAVE BASE REGISTER            */ 00036000
         ST    REG9,BASESAV                                        0087 00037000
*   DATASAV=REG10;                  /* SAVE DATA REGISTER            */ 00038000
         ST    REG10,DATASAV                                       0088 00039000
*   RESPECIFY                                                      0089 00040000
*    (ESTAPTR) RSTD;                                               0089 00041000
*   ESTAPTR=ADDR(PRMLST);           /* SET UP ADDRESS OF PARM AREA   */ 00042000
         LA    ESTAPTR,PRMLST                                      0090 00043000
*   ESTA=ESTAELST;                  /* MOVE LIST FORM OF MACRO TO  0091 00044000
*                                      GOTTEN CORE                   */ 00045000
         MVC   ESTA(16,ESTAPTR),ESTAELST                           0091 00046000
*   RESPECIFY                                                      0092 00047000
*     WRKRG1 RSTD;                                                 0092 00048000
*   WRKRG1=ADDR(ESTAPRM);           /* ADDRESS OF PARM AREA          */ 00049000
         LA    WRKRG1,ESTAPRM                                      0093 00050000
*   GENERATE REFS(ESTAPTR,WRKRG1);                                 0094 00051000
*                                 /* ISSUE ESTAE MACRO               */ 00052000
         ESTAE PARAM=(WRKRG1),MF=(E,(ESTAPTR)),                        *00053000
               RELATED=(MDLESTAE,IEAVEMDL)                              00054000
*   RESPECIFY                                                      0095 00055000
*    (ESTAPTR,                                                     0095 00056000
*     WRKRG1) UNRSTD;                                              0095 00057000
*                                                                  0096 00058000
*/*                                                                  */ 00059000
*/*               DEQUEUE ASCB FROM ASCB READY QUEUE                 */ 00060000
*/*                                                                  */ 00061000
*                                                                  0096 00062000
*   RESPECIFY                                                      0096 00063000
*    (REG11,                                                       0096 00064000
*     REG12,                                                       0096 00065000
*     REG14) RSTD;                                                 0096 00066000
*   GENERATE REFS(PSALITA);                                        0097 00067000
*                               /* OBTAIN LOCAL LOCK */                 00068000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                        *00069000
               RELATED=(LOCAL,IEAVEMDL)                                 00070000
*   RESPECIFY                                                      0098 00071000
*    (REG11,                                                       0098 00072000
*     REG12,                                                       0098 00073000
*     REG14) UNRSTD;                                               0098 00074000
*   CURASXB=CURASCB->ASCBASXB;      /* GET PTR TO ASXB               */ 00075000
         L     @12,CURASCB                                         0099 00076000
         L     CURASXB,ASCBASXB(,@12)                              0099 00077000
*   SAVPTR=CURASXB->ASXBSPSA;       /* PTR TO SUPERVISOR SAVE AREAS  */ 00078000
         L     SAVPTR,ASXBSPSA(,CURASXB)                           0100 00079000
*   SAVPTR=SAVPTR->WSALACHP;        /* PTR TO ASCB CHAP SAVE AREA    */ 00080000
         L     SAVPTR,WSALACHP(,SAVPTR)                            0101 00081000
*   RESPECIFY                                                      0102 00082000
*    (PARMRG,                                                      0102 00083000
*     REG11,                                                       0102 00084000
*     REG12,                                                       0102 00085000
*     REG14) RSTD;                                                 0102 00086000
*   PARMRG=ASCBPTR;                 /* ASCB ADDRESS IN REG 1         */ 00087000
         L     PARMRG,ASCBPTR                                      0103 00088000
*   GENERATE REFS(CVTVEAC0,CVT);                                   0104 00089000
*                                  /* DEQUEUE ASCB FROM READY QUEUE  */ 00090000
         ASCBCHAP DELETE         DELETE FROM QUEUE                      00091000
         SETLOCK RELEASE,TYPE=LOCAL,RELATED=(LOCAL,IEAVEMDL)            00092000
*   RESPECIFY                                                      0105 00093000
*    (PARMRG,                                                      0105 00094000
*     REG11,                                                       0105 00095000
*     REG12,                                                       0105 00096000
*     REG14) UNRSTD;                                               0105 00097000
*                                                                  0106 00098000
*/*                                                                  */ 00099000
*/*                   NOTIFY SYSTEM RESOURCES MANAGER                */ 00100000
*/*                                                                  */ 00101000
*                                                                  0106 00102000
*   ASCBMECB=''B;                   /* CLEAR ECB AREA                */ 00103000
         L     @12,ASCBPTR                                         0106 00104000
         XC    ASCBMECB(4,@12),ASCBMECB(@12)                       0106 00105000
*   RESPECIFY                                                      0107 00106000
*    (OPTRC) RSTD;                                                 0107 00107000
*   GENERATE REFS(ASID);                                           0108 00108000
*                                    /* CALL THE SRM                 */ 00109000
       SYSEVENT MEMDEL,ASIDL=ASID                                       00110000
*   IF OPTRC=RTNCDE4 THEN           /* IF WAIT FROM SRM, THEN        */ 00111000
         CH    OPTRC,@CH00041                                      0109 00112000
         BNE   @RF00109                                            0109 00113000
*     DO;                           /* ISSUE WAIT MACRO              */ 00114000
*       RESPECIFY                                                  0111 00115000
*        (OPTRC) UNRSTD;                                           0111 00116000
*       ECBLIST=ADDR(ASCBMECB);     /* SET UP ECB ADDRESS            */ 00117000
         L     @12,ASCBPTR                                         0112 00118000
         LA    @12,ASCBMECB(,@12)                                  0112 00119000
         ST    @12,ECBLIST                                         0112 00120000
*       LASTBIT=BITON;              /* INDICATE LAST IN LIST         */ 00121000
         OI    LASTBIT,B'10000000'                                 0113 00122000
*       GENERATE;                                                  0114 00123000
         WAIT ECBLIST=ECBLIST,RELATED=(ASCBMECB,SRM)                    00124000
*     END;                                                         0115 00125000
*                                                                  0116 00126000
*/*                                                                  */ 00127000
*/*                SET UP LOCKED ENVIRONMENT                         */ 00128000
*/*                                                                  */ 00129000
*/* MEMORY DELETE MUST BE FIXED WHILE HOLDING THE GLOBAL DISPATCHER  */ 00130000
*/* LOCK. PAGE FAULTS CANNOT BE HANDLED. THEREFORE, THE PAGE IS      */ 00131000
*/* FIXED, AND THE LOCK IS OBTAINED.                                 */ 00132000
*/*                                                                  */ 00133000
*                                                                  0116 00134000
*   ASCBMECB=''B;                   /* CLEAR ECB AREA                */ 00135000
@RF00109 L     @12,ASCBPTR                                         0116 00136000
         XC    ASCBMECB(4,@12),ASCBMECB(@12)                       0116 00137000
*   RESPECIFY                                                      0117 00138000
*    (ECBRG,                                                       0117 00139000
*     RTNCDERG,                                                    0117 00140000
*     WRKRG1,                                                      0117 00141000
*     WRKRG2) RSTD;                                                0117 00142000
*   ECBRG=ADDR(ASCBMECB);           /* ADDRESS OF ECB TO BE POSTED   */ 00143000
         LA    @14,ASCBMECB(,@12)                                  0118 00144000
         LR    ECBRG,@14                                           0118 00145000
*   ECBLIST=ADDR(ASCBMECB);         /* SET UP ECB ADDRESS            */ 00146000
         ST    @14,ECBLIST                                         0119 00147000
*   LASTBIT=BITON;                  /* INDICATE LAST IN LIST         */ 00148000
         OI    LASTBIT,B'10000000'                                 0120 00149000
*   WRKRG1=ADDR(IEAVEMDL);          /* START OF CORE TO BE FIXED     */ 00150000
         L     WRKRG1,@CA00028                                     0121 00151000
*   WRKRG2=1+ADDR(@ENDDATA);        /* END OF MODULE                 */ 00152000
         LA    WRKRG2,@ENDDATA                                     0122 00153000
         AH    WRKRG2,@CH00047                                     0122 00154000
*   GENERATE REFS(WRKRG1,WRKRG2,ECBRG);                            0123 00155000
*                        FIX ROUTINE                                    00156000
         PGFIX R,A=(WRKRG1),EA=(WRKRG2),ECB=(ECBRG),LONG=N,            *00157000
               RELATED=(IEAVEMDL-@ENDDATA,IEAVEMDL)                     00158000
*   IF RTNCDERG=RTNCDE8             /* PGFIX INDICATE WAIT ?         */ 00159000
*     THEN                                                         0124 00160000
         CH    RTNCDERG,@CH00069                                   0124 00161000
         BNE   @RF00124                                            0124 00162000
*     DO;                           /* YES, ISSUE WAIT               */ 00163000
*       GENERATE REFS(ECBLIST);                                    0126 00164000
*                                     /* ISSUE WAIT */                  00165000
         WAIT  ECBLIST=ECBLIST,   WAIT UNTIL PAGE IS FIXED             *00166000
               RELATED=(ASCBMECB,PGFIX)                                 00167000
*     END;                                                         0127 00168000
*   ASCBMECB=''B;                   /* CLEAR ECB                     */ 00169000
@RF00124 L     @14,ASCBPTR                                         0128 00170000
         XC    ASCBMECB(4,@14),ASCBMECB(@14)                       0128 00171000
*   RESPECIFY                                                      0129 00172000
*    (REG11,                                                       0129 00173000
*     REG12,                                                       0129 00174000
*     REG14) RSTD;                                                 0129 00175000
*   WRKRG1=ADDR(@DATD);             /* GET ADDRESS OF DATA AREA      */ 00176000
         LA    @07,@DATD                                           0130 00177000
         LR    WRKRG1,@07                                          0130 00178000
*   WRKRG2=ADDR(@DATD)+@SIZDATD;    /* ENDING ADDRESS OF DATA      0131 00179000
*                                                            @YM02231*/ 00180000
         AL    @07,@SIZDATD                                        0131 00181000
         LR    WRKRG2,@07                                          0131 00182000
*   ECBRG=ADDR(ASCBMECB);           /* ADDRESS OF ECB TO BE POSTED   */ 00183000
         L     @02,ASCBPTR                                         0132 00184000
         LA    ECBRG,ASCBMECB(,@02)                                0132 00185000
*   GENERATE REFS(ECBRG,WRKRG1,WRKRG2);                            0133 00186000
         PGFIX R,A=(WRKRG1),EA=(WRKRG2),ECB=(ECBRG),LONG=N,            *00187000
               RELATED=(@DATD,IEAVEMRQ)                                 00188000
*   IF RTNCDERG=RTNCDE8             /* PGFIX INDICATE WAIT ?         */ 00189000
*     THEN                                                         0134 00190000
         CH    RTNCDERG,@CH00069                                   0134 00191000
         BNE   @RF00134                                            0134 00192000
*     DO;                           /* YES, ISSUE WAIT               */ 00193000
*       GENERATE REFS(ECBLIST);                                    0136 00194000
*                                     /* ISSUE WAIT */                  00195000
         WAIT  ECBLIST=ECBLIST,   WAIT UNTIL PAGE IS FIXED             *00196000
               RELATED=(ASCBMECB,PGFIX)                                 00197000
*     END;                                                         0137 00198000
*   RTNFIXED=BITON;                 /* INDICATE ROUTINE FIXED        */ 00199000
@RF00134 OI    RTNFIXED,B'00100000'                                0138 00200000
*   GENERATE;                                                      0139 00201000
*                                 OBTAIN GLOBAL DISPATCHER LOCK         00202000
         SETLOCK OBTAIN,TYPE=DISP,MODE=UNCOND,                         *00203000
               RELATED=(DISPATCHER,IEAVEMDL)                            00204000
*   RESPECIFY                                                      0140 00205000
*    (ECBRG,                                                       0140 00206000
*     REG11,                                                       0140 00207000
*     REG12,                                                       0140 00208000
*     REG14,                                                       0140 00209000
*     WRKRG1,                                                      0140 00210000
*     WRKRG2,                                                      0140 00211000
*     RTNCDERG) UNRSTD;                                            0140 00212000
*   ASCBMECB=0;                     /* ZERO ASCBMECB                 */ 00213000
         L     @12,ASCBPTR                                         0141 00214000
         SLR   @11,@11                                             0141 00215000
         ST    @11,ASCBMECB(,@12)                                  0141 00216000
*                                                                  0142 00217000
*/*                                                                  */ 00218000
*/*                      UNASSIGN AN ASID                            */ 00219000
*/*                                                                  */ 00220000
*                                                                  0142 00221000
*   RFY                                                            0142 00222000
*    (WRKRG1,                                                      0142 00223000
*     WRKRG2,                                                      0142 00224000
*     ASCRPTR) RSTD;                                               0142 00225000
*   ENTYADDR=ADDR(ASVTENTY(ASID));                                 0143 00226000
         LH    @11,ASID                                            0143 00227000
         SLA   @11,2                                               0143 00228000
         L     @06,CVTPTR                                          0143 00229000
         L     @15,ASVTPTR(,@06)                                   0143 00230000
         LA    ENTYADDR,ASVTENTY-4(@11,@15)                        0143 00231000
*   AVLENTRY=ASVTFRST;              /* ENTRY POINT TO NEXT AVAIL     */ 00232000
         MVC   AVLENTRY(4,ENTYADDR),ASVTFRST(@15)                  0144 00233000
*   ASGNBIT=BITOFF;                 /* ENTRY STILL ASSIGNED  @ZA04120*/ 00234000
         NI    ASGNBIT(ENTYADDR),B'01111111'                       0145 00235000
*   ASCRPTR=ASCBPTR+LENGTH(ASCB)+LENGTH(LSPL);/* ASCR        @ZA04120*/ 00236000
         AH    @12,@CH01667                                        0146 00237000
         LR    ASCRPTR,@12                                         0146 00238000
*   WRKRG1=ASCRPTR->ASCRFWDP;       /* GET NEXT ELT ON QUEUE @ZA04120*/ 00239000
         L     WRKRG1,ASCRFWDP(,ASCRPTR)                           0147 00240000
*   WRKRG2=ASCRPTR->ASCRBWDP;       /* PREVIOUS ELT ON QUEUE @ZA04120*/ 00241000
         L     WRKRG2,ASCRBWDP(,ASCRPTR)                           0148 00242000
*   IF WRKRG1->ASCRBWDP=WRKRG2->ASCRFWDP|CVTASCRL=ASCRPTR|CVTASCRF=     00243000
*       ASCRPTR                     /* CHECK ASCR STILL QUEUED     0149 00244000
*                                                            @ZA04120*/ 00245000
*     THEN                                                         0149 00246000
         CLC   ASCRBWDP(4,WRKRG1),ASCRFWDP(WRKRG2)                 0149 00247000
         BE    @RT00149                                            0149 00248000
         C     ASCRPTR,CVTASCRL(,@06)                              0149 00249000
         BE    @RT00149                                            0149 00250000
         C     ASCRPTR,CVTASCRF(,@06)                              0149 00251000
         BNE   @RF00149                                            0149 00252000
@RT00149 DS    0H                                                  0150 00253000
*     DO;                           /* DEQUEUE ASCR          @ZA04120*/ 00254000
*       IF WRKRG1^=NULL             /* CHECK ELT WAS LAST    @ZA04120*/ 00255000
*         THEN                                                     0151 00256000
         LTR   WRKRG1,WRKRG1                                       0151 00257000
         BZ    @RF00151                                            0151 00258000
*         WRKRG1->ASCRBWDP=WRKRG2;  /* RECHAIN PREV TO NEXT  @ZA04120*/ 00259000
         ST    WRKRG2,ASCRBWDP(,WRKRG1)                            0152 00260000
*       ELSE                                                       0153 00261000
*         CVTASCRL=WRKRG2;          /* ELSE FIX TRAILER      @ZA04120*/ 00262000
         B     @RC00151                                            0153 00263000
@RF00151 L     @12,CVTPTR                                          0153 00264000
         ST    WRKRG2,CVTASCRL(,@12)                               0153 00265000
*       IF WRKRG2^=NULL             /* CHECK ELT WAS FIRST   @ZA04120*/ 00266000
*         THEN                                                     0154 00267000
@RC00151 LTR   WRKRG2,WRKRG2                                       0154 00268000
         BZ    @RF00154                                            0154 00269000
*         WRKRG2->ASCRFWDP=WRKRG1;  /* RECHAIN NEXT TO PREV  @ZA04120*/ 00270000
         ST    WRKRG1,ASCRFWDP(,WRKRG2)                            0155 00271000
*       ELSE                                                       0156 00272000
*         CVTASCRF=WRKRG1;          /* ELSE FIX HEADER       @ZA04120*/ 00273000
         B     @RC00154                                            0156 00274000
@RF00154 L     @12,CVTPTR                                          0156 00275000
         ST    WRKRG1,CVTASCRF(,@12)                               0156 00276000
*     END;                                                         0157 00277000
@RC00154 DS    0H                                                  0158 00278000
*   ASVTFRST=ENTYADDR;              /* MAKE ENTRY FIRST AVAILABLE    */ 00279000
@RF00149 L     @12,CVTPTR                                          0158 00280000
         L     @12,ASVTPTR(,@12)                                   0158 00281000
         ST    ENTYADDR,ASVTFRST(,@12)                             0158 00282000
*   ASVTAVAI=BITON;                 /* INDICATE ENTRY IS UNASSIGNED  */ 00283000
         OI    ASVTAVAI(@12),B'10000000'                           0159 00284000
*   ASGNBIT=BITON;                  /* MARK ENTRY AVAILABLE  @ZA04120*/ 00285000
         OI    ASGNBIT(ENTYADDR),B'10000000'                       0160 00286000
*   ASSIGN=BITON;                   /* INDICATE ASID UNASSIGNED      */ 00287000
         OI    ASSIGN,B'01000000'                                  0161 00288000
*   RFY                                                            0162 00289000
*    (ASCRPTR) UNRSTD;                                             0162 00290000
*   RESPECIFY                                                      0163 00291000
*    (REG11,                                                       0163 00292000
*     REG12,                                                       0163 00293000
*     REG14) RSTD;                                                 0163 00294000
*   GENERATE;                                                      0164 00295000
*                                 RELEASE DISPATCHER LOCK               00296000
         SETLOCK RELEASE,TYPE=DISP,RELATED=(DISPATCHER,IEAVEMRQ)        00297000
*   RESPECIFY                                                      0165 00298000
*    (REG11,                                                       0165 00299000
*     REG12,                                                       0165 00300000
*     REG14) UNRSTD;                                               0165 00301000
*   WRKRG1=ADDR(IEAVEMDL);          /* START OF CORE TO BE FIXED     */ 00302000
         L     WRKRG1,@CA00028                                     0166 00303000
*   WRKRG2=1+ADDR(@ENDDATA);        /* END OF MODULE                 */ 00304000
         LA    WRKRG2,@ENDDATA                                     0167 00305000
         AH    WRKRG2,@CH00047                                     0167 00306000
*   GENERATE REFS(WRKRG1,WRKRG2);                                  0168 00307000
         PGFREE R,A=(WRKRG1),EA=(WRKRG2),    UNFIX PAGE                *00308000
               RELATED=(IEAVEMDL-@ENDDATA,IEAVEMDL)                     00309000
*   WRKRG1=ADDR(@DATD);             /* GET ADDRESS OF DATA AREA      */ 00310000
         LA    @12,@DATD                                           0169 00311000
         LR    WRKRG1,@12                                          0169 00312000
*   WRKRG2=ADDR(@DATD)+@SIZDATD;    /* ENDING ADDRESS OF DATA      0170 00313000
*                                                            @YM02231*/ 00314000
         AL    @12,@SIZDATD                                        0170 00315000
         LR    WRKRG2,@12                                          0170 00316000
*   GENERATE REFS(WRKRG1,WRKRG2);                                  0171 00317000
         PGFREE R,A=(WRKRG1),EA=(WRKRG2),                              *00318000
               RELATED=(@DATD,IEAVEMRQ)                                 00319000
*   RESPECIFY                                                      0172 00320000
*    (WRKRG1,                                                      0172 00321000
*     WRKRG2) UNRSTD;                                              0172 00322000
*   RTNFIXED=BITOFF;                /* INDICATE ROUTINE UNFIXED      */ 00323000
         NI    RTNFIXED,B'11011111'                                0173 00324000
*                                                                  0174 00325000
*/*                                                                  */ 00326000
*/*                  FREE ASCB AND LSPL                              */ 00327000
*/*                                                                  */ 00328000
*                                                                  0174 00329000
*   RESPECIFY                                                      0174 00330000
*    (LENREG,                                                      0174 00331000
*     ADDRREG,                                                     0174 00332000
*     RTNCDERG,                                                    0174 00333000
*     WRKRG1) RSTD;                                                0174 00334000
*   LENREG=LENGTH(ASCB)+LENGTH(LSPL)+LENGTH(ASCRLIST);/* LEN CORE TO    00335000
*                                      BE FREED              @ZA04120*/ 00336000
         LA    LENREG,232                                          0175 00337000
*   ADDRREG=ASCBPTR;                /* BEGINING ADDRESS OF GOTTEN  0176 00338000
*                                      CORE                          */ 00339000
         L     @14,ASCBPTR                                         0176 00340000
         LR    ADDRREG,@14                                         0176 00341000
*   LSPL=''B;                       /* ZERO LSPL BEFORE FREEING      */ 00342000
         L     @12,LSPLPTR(,@14)                                   0177 00343000
         XC    LSPL(16,@12),LSPL(@12)                              0177 00344000
*   ASCB=''B;                       /* ZERO ASCB BEFORE FREEING      */ 00345000
         XC    ASCB(208,@14),ASCB(@14)                             0178 00346000
*   WRKRG1=ADDRREG+LENGTH(ASCB)+LENGTH(LSPL);/* CALCULATE ASCR     0179 00347000
*                                      ADDRESS               @ZA04120*/ 00348000
         LA    WRKRG1,224                                          0179 00349000
         ALR   WRKRG1,ADDRREG                                      0179 00350000
*   WRKRG1->ASCRLIST=''B;           /* ZREO ASCR BEFORE FREE @ZA04120*/ 00351000
         XC    ASCRLIST(8,WRKRG1),ASCRLIST(WRKRG1)                 0180 00352000
*   GENERATE REFS(ADDRREG);                                        0181 00353000
*                                 FREE ASCB & SPL                       00354000
         FREEMAIN RC,LV=(LENREG),A=(ADDRREG),SP=245,                   *00355000
               RELATED=(SP245-216,IEAVEMRQ)                             00356000
*   ADDRASCB=0;                     /* INDICATE FREEMAIN DONE        */ 00357000
         SLR   @14,@14                                             0182 00358000
         ST    @14,ADDRASCB                                        0182 00359000
*   GENERATE;                                                      0183 00360000
         ESTAE 0,RELATED=(MDLESTAE,IEAVEMDL)        CANCEL ESTAE        00361000
*   RESPECIFY                                                      0184 00362000
*    (LENREG,                                                      0184 00363000
*     ADDRREG,                                                     0184 00364000
*     RTNCDERG,                                                    0184 00365000
*     WRKRG1) UNRSTD;                                              0184 00366000
*   SAVPTR=SAVADDR;                 /* RESTORE SAVE AREA ADDRESS     */ 00367000
         L     SAVPTR,SAVADDR                                      0185 00368000
*   RETURN;                         /* RETURN TO CALLER              */ 00369000
@EL00001 DS    0H                                                  0186 00370000
@EF00001 L     @00,@SIZDATD                                        0186 00371000
         LR    @01,@10                                             0186 00372000
         FREEMAIN R,LV=(0),A=(1)                                        00373000
@ER00001 LM    @14,@12,12(@13)                                     0186 00374000
         BR    @14                                                 0186 00375000
*                                                                  0187 00376000
*/*                                                                  */ 00377000
*/*                    MEMORY DELETE ESTAE ROUTINE                   */ 00378000
*/*                                                                  */ 00379000
*                                                                  0187 00380000
*MDLESTAE:                                                         0187 00381000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* ESTAE EXIT ROUTINE            */ 00382000
MDLESTAE DS    0H                                                  0188 00383000
*   DCL                                                            0188 00384000
*     SDWAPTR PTR(31) REG(4) RSTD;  /* SDWA POINTER                  */ 00385000
*   DCL                                                            0189 00386000
*     MODNAME CHAR(8) CONSTANT('IEAVEMDL');/* MODULE NAME            */ 00387000
*   DCL                                                            0190 00388000
*     EXITNAME CHAR(8) CONSTANT('MDLESTAE');/* EXIT ROUTINE NAME     */ 00389000
*   RESPECIFY                                                      0191 00390000
*    (REG14,                                                       0191 00391000
*     ADDRREG) RSTD;                                               0191 00392000
*   DO;                             /* ENTESTAE (REG9,REG10)SAVEAREA(   00393000
*                                      ESTAESA)ERREXIT(NOSDWA)       */ 00394000
*                                                                  0192 00395000
*     /***************************************************************/ 00396000
*     /*                                                             */ 00397000
*     /* ENTRY CODE FOR ESTAE ROUTINE. IF RTCA ALLOCATED THEN RESTORE*/ 00398000
*     /* CODE AND DATA REGS FROM START OF USERS PARM LIST, AND       */ 00399000
*     /* ESTABLISH ADDR TO ESTAE SAVE AREA IF REQUIRED. IF NO RTCA   */ 00400000
*     /* AVAILABLE THEN BRANCH TO ERROR CODE AFTER ESTABLISHING      */ 00401000
*     /* ADDRESSABILITY                                              */ 00402000
*     /*                                                             */ 00403000
*     /***************************************************************/ 00404000
*                                                                  0193 00405000
*     GEN(USING *,GPR15P);                                         0193 00406000
         USING *,GPR15P                                                 00407000
*     GEN(CH    GPR00F,*+26);       /* CHECK IF RTCA ALLOC FAILED    */ 00408000
         CH    GPR00F,*+26                                              00409000
*     GEN(BNE   *+24);              /* NO,SAVE RTM REGS              */ 00410000
         BNE   *+24                                                     00411000
*     GEN(DROP  GPR15P);            /* DROP LOCAL ADDR               */ 00412000
         DROP  GPR15P                                                   00413000
*     GEN(LR    GPR15P,GPR02P);     /* PTR TO USER PARM LIST         */ 00414000
         LR    GPR15P,GPR02P                                            00415000
*     GEN(L     REG9,00(GPR15P));                                  0198 00416000
         L     REG9,00(GPR15P)                                          00417000
*     GEN(L     REG10,04(GPR15P));                                 0199 00418000
         L     REG10,04(GPR15P)                                         00419000
*     GEN(LA    GPR13P,ESTAESA);    /* SET PTR TO ESTAE SA           */ 00420000
         LA    GPR13P,ESTAESA                                           00421000
*     GEN(B     NOSDWA);            /* BRANCH TO ERROR EXIT          */ 00422000
         B     NOSDWA                                                   00423000
*     GEN(DC    H'12');             /* NO RTCA AVAIL RC              */ 00424000
         DC    H'12'                                                    00425000
*     GEN(STM   GPR14P,GPR12F,12(GPR13P));/* GOOD R13, SAVE RTM'S  0203 00426000
*                                      REGS                          */ 00427000
         STM   GPR14P,GPR12F,12(GPR13P)                                 00428000
*     GEN(L     GPR15P,0(GPR01P));  /* PTR TO USER PARM LIST         */ 00429000
         L     GPR15P,0(GPR01P)                                         00430000
*     GEN(L     REG9,00(GPR15P));                                  0205 00431000
         L     REG9,00(GPR15P)                                          00432000
*     GEN(L     REG10,04(GPR15P));                                 0206 00433000
         L     REG10,04(GPR15P)                                         00434000
*     GEN(ST    GPR13P,ESTAESA+4);  /* SET PTR TO RTM SA             */ 00435000
         ST    GPR13P,ESTAESA+4                                         00436000
*     GEN(LA    GPR13P,ESTAESA);    /* SET PTR TO ESTAE SA           */ 00437000
         LA    GPR13P,ESTAESA                                           00438000
*   END;                            /* ENTESTAE (REG9,REG10)SAVEAREA(   00439000
*                                      ESTAESA)ERREXIT(NOSDWA)       */ 00440000
*   SDWAPTR=ADDRREG;                /* SET UP ADDRESSABILITY FOR SDWA   00441000
*                                                            @YM04768*/ 00442000
         LR    SDWAPTR,ADDRREG                                     0210 00443000
*   GOTO RECOV;                     /* START RECOVERY PROCESSING     */ 00444000
         B     RECOV                                               0211 00445000
*NOSDWA:                                                           0212 00446000
*   ;                               /* NO SDWA GOTTEN                */ 00447000
NOSDWA   DS    0H                                                  0213 00448000
*   NOSDWAF=BITON;                  /* INDICATE NO SDWA GOTTEN       */ 00449000
         OI    NOSDWAF,B'00010000'                                 0213 00450000
*   RECRTN=REG14;                   /* SAVE RETRUN ADDRESS           */ 00451000
         ST    REG14,RECRTN                                        0214 00452000
*   RESPECIFY                                                      0215 00453000
*     REG14 UNRSTD;                                                0215 00454000
*RECOV:                                                            0216 00455000
*   ;                               /* START RECOVERY                */ 00456000
RECOV    DS    0H                                                  0217 00457000
*   RESPECIFY                                                      0217 00458000
*    (LENREG,                                                      0217 00459000
*     PARMRG,                                                      0217 00460000
*     WRKRG1) RSTD;                                                0217 00461000
*   PARMRG=ADDR(SDUMPLST);          /* SET UP SDUMP PARM AREA        */ 00462000
         LA    PARMRG,SDUMPLST                                     0218 00463000
*   GENERATE REFS(PARMRG);                                         0219 00464000
        SDUMP MF=(E,(PARMRG))                                           00465000
*   RESPECIFY                                                      0220 00466000
*    (PARMRG) UNRSTD;                                              0220 00467000
*   IF ASSIGN=BITON THEN            /* DO NOT FREE ASCB UNLESS ASID     00468000
*                                      UNASSIGNED                    */ 00469000
         TM    ASSIGN,B'01000000'                                  0221 00470000
         BNO   @RF00221                                            0221 00471000
*     DO;                           /* FIND OUT IF ASCB FREED        */ 00472000
*       IF ADDRASCB^=0 THEN                                        0223 00473000
         L     @12,ADDRASCB                                        0223 00474000
         LTR   @12,@12                                             0223 00475000
         BZ    @RF00223                                            0223 00476000
*         DO;                       /* HAS ASCB BEEN FREED           */ 00477000
*           ADDRREG=ADDRASCB;       /* GET ADDRESS OF ASCB           */ 00478000
         LR    ADDRREG,@12                                         0225 00479000
*           LENREG=LENGTH(ASCB)+LENGTH(LSPL)+LENGTH(ASCRLIST);     0226 00480000
         LA    LENREG,232                                          0226 00481000
*           LSPL=''B;               /* ZERO LSPL BEFORE FREEING      */ 00482000
         L     @12,ASCBPTR                                         0227 00483000
         L     @11,LSPLPTR(,@12)                                   0227 00484000
         XC    LSPL(16,@11),LSPL(@11)                              0227 00485000
*           ASCB=''B;               /* ZERO ASCB BEFORE FREEING      */ 00486000
         XC    ASCB(208,@12),ASCB(@12)                             0228 00487000
*           WRKRG1=ADDRREG+LENGTH(ASCB)+LENGTH(LSPL);/* CALCULATE  0229 00488000
*                                      ASCR ADDRESS          @ZA04120*/ 00489000
         LA    WRKRG1,224                                          0229 00490000
         ALR   WRKRG1,ADDRREG                                      0229 00491000
*           WRKRG1->ASCRLIST=''B;   /* ZERO ASCR BEFORE FREEING    0230 00492000
*                                                            @ZA04120*/ 00493000
         XC    ASCRLIST(8,WRKRG1),ASCRLIST(WRKRG1)                 0230 00494000
*           GENERATE;                                              0231 00495000
*                                    /* ISSUE FREEMAIN               */ 00496000
          FREEMAIN R,LV=(LENREG),A=(ADDRREG),SP=245                     00497000
*           ADDRASCB=0;             /* INDICATE ASCB FREED           */ 00498000
         SLR   @12,@12                                             0232 00499000
         ST    @12,ADDRASCB                                        0232 00500000
*         END;                                                     0233 00501000
*       RESPECIFY                                                  0234 00502000
*        (LENREG,                                                  0234 00503000
*         ADDRREG) UNRSTD;                                         0234 00504000
@RF00223 DS    0H                                                  0235 00505000
*     END;                                                         0235 00506000
*   IF RTNFIXED=BITON THEN                                         0236 00507000
@RF00221 TM    RTNFIXED,B'00100000'                                0236 00508000
         BNO   @RF00236                                            0236 00509000
*     DO;                           /* IF ROUTINE FIXED, FREE PAGE   */ 00510000
*       WRKRG1=ADDR(IEAVEMDL);      /* START OF CORE TO BE FIXED     */ 00511000
         L     WRKRG1,@CA00028                                     0238 00512000
*       WRKRG2=1+ADDR(@ENDDATA);    /* END OF MODULE                 */ 00513000
         LA    WRKRG2,@ENDDATA                                     0239 00514000
         AH    WRKRG2,@CH00047                                     0239 00515000
*       GENERATE REFS(WRKRG1,WRKRG2);                              0240 00516000
          PGFREE R,A=(WRKRG1),EA=(WRKRG2),    UNFIX PAGE               *00517000
                RELATED=(IEAVEMDL-@ENDDATA,IEAVEMDL)                    00518000
*       WRKRG1=ADDR(@DATD);         /* GET ADDRESS OF DATA AREA      */ 00519000
         LA    @12,@DATD                                           0241 00520000
         LR    WRKRG1,@12                                          0241 00521000
*       WRKRG2=ADDR(@DATD)+@SIZDATD;/* ENDING ADDRESS OF DATA      0242 00522000
*                                                            @YM02231*/ 00523000
         AL    @12,@SIZDATD                                        0242 00524000
         LR    WRKRG2,@12                                          0242 00525000
*       GENERATE REFS(WRKRG1,WRKRG2);                              0243 00526000
         PGFREE R,A=(WRKRG1),EA=(WRKRG2),                              *00527000
               RELATED=(@DATD,IEAVEMRQ)                                 00528000
*       RESPECIFY                                                  0244 00529000
*        (WRKRG1,                                                  0244 00530000
*         WRKRG2) UNRSTD;                                          0244 00531000
*       RTNFIXED=BITOFF;            /* INDICATE ROUTINE UNFIXED      */ 00532000
         NI    RTNFIXED,B'11011111'                                0245 00533000
*     END;                                                         0246 00534000
*   IF NOSDWAF=BITON THEN                                          0247 00535000
@RF00236 TM    NOSDWAF,B'00010000'                                 0247 00536000
         BNO   @RF00247                                            0247 00537000
*     DO;                           /* SDWA GOTTEN?                  */ 00538000
*       RESPECIFY                                                  0249 00539000
*        (REG14,                                                   0249 00540000
*         RTNCDERG) RSTD;                                          0249 00541000
*       RTNCDERG=RTNCDE0;           /* INDICATE CONTINUE WITH      0250 00542000
*                                      TERMINATION                   */ 00543000
         SLR   RTNCDERG,RTNCDERG                                   0250 00544000
*       REG14=RECRTN;                                              0251 00545000
         L     REG14,RECRTN                                        0251 00546000
*       GEN( BR REG14);                                            0252 00547000
          BR REG14                                                      00548000
*       RESPECIFY                                                  0253 00549000
*        (REG14,                                                   0253 00550000
*         RTNCDERG) UNRSTD;                                        0253 00551000
*     END;                                                         0254 00552000
*   SDWAMODN=MODNAME;               /* INITIALIZE MODULE NAME        */ 00553000
@RF00247 MVC   SDWAMODN(8,SDWAPTR),@CC01642                        0255 00554000
*   SDWACSCT=MODNAME;               /* INITIALIZE CSECT NAME IN SDWA */ 00555000
         MVC   SDWACSCT(8,SDWAPTR),@CC01642                        0256 00556000
*   SDWAREXN=EXITNAME;              /* INITIALIZE RECOVERY NAME      */ 00557000
         MVC   SDWAREXN(8,SDWAPTR),@CC01644                        0257 00558000
*   SAVPTR=ESTAESA(2);              /* RESTORE REGISTER 13           */ 00559000
         L     SAVPTR,ESTAESA+4                                    0258 00560000
*   DO;                             /* SETRP RECORD(YES)RC(0)REGS(14,   00561000
*                                      12)WKAREA(SDWAPTR)DUMP(NO)    */ 00562000
*     RESPECIFY                                                    0260 00563000
*      (GPR00P,                                                    0260 00564000
*       GPR01P,                                                    0260 00565000
*       GPR14P,                                                    0260 00566000
*       GPR15P) RSTD;                                              0260 00567000
*     GPR01P=SDWAPTR;                                              0261 00568000
         LR    GPR01P,SDWAPTR                                      0261 00569000
*     GPR01P->SDWARCDE=0;           /* SAVE RC VALUE                 */ 00570000
         MVI   SDWARCDE(GPR01P),X'00'                              0262 00571000
*     GPR01P->SDWARCRD='1'B;        /* TURN ON RECORD INDICATOR      */ 00572000
         OI    SDWARCRD(GPR01P),B'10000000'                        0263 00573000
*     GPR01P->SDWAREQ='0'B;         /* TURN OFF DUMP INDICATOR       */ 00574000
         NI    SDWAREQ(GPR01P),B'01111111'                         0264 00575000
*     GEN(RETURN (14,12));                                         0265 00576000
         RETURN (14,12)                                                 00577000
*     RESPECIFY                                                    0266 00578000
*      (GPR00P,                                                    0266 00579000
*       GPR01P,                                                    0266 00580000
*       GPR14P,                                                    0266 00581000
*       GPR15P) UNRSTD;                                            0266 00582000
*   END;                                                           0267 00583000
*   END MDLESTAE;                                                  0268 00584000
@EL00002 DS    0H                                                  0268 00585000
@EF00002 DS    0H                                                  0268 00586000
@ER00002 BR    @14                                                 0268 00587000
*   DCL                                                            0269 00588000
*     PATCHLOC FIXED(31) STATIC;                                   0269 00589000
*   GEN DATA DEFS(PATCHLOC);                                       0270 00590000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 00591000
*     GPR00F FIXED(31) REG(0),                                     0271 00592000
*     GPR12F FIXED(31) REG(12),                                    0271 00593000
*     GPR00P PTR(31) REG(0),                                       0271 00594000
*     GPR01P PTR(31) REG(1),                                       0271 00595000
*     GPR02P PTR(31) REG(2),                                       0271 00596000
*     GPR13P PTR(31) REG(13),                                      0271 00597000
*     GPR14P PTR(31) REG(14),                                      0271 00598000
*     GPR15P PTR(31) REG(15);                                      0271 00599000
*   DECLARE                         /* COMMON VARIABLES              */ 00600000
*     I256C CHAR(256) BASED,                                       0272 00601000
*     I031F FIXED(31) BASED,                                       0272 00602000
*     I031P PTR(31) BASED,                                         0272 00603000
*     I015F FIXED(15) BASED,                                       0272 00604000
*     I015P PTR(15) BASED,                                         0272 00605000
*     I008P PTR(8) BASED,                                          0272 00606000
*     I001C CHAR(1) BASED;                                         0272 00607000
*   END IEAVEMDL                    /* END OF MEMORY DELETE          */ 00608000
*                                                                  0273 00609000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00610000
*/*%INCLUDE SYSLIB  (IHAASVT )                                       */ 00611000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 00612000
*/*%INCLUDE SYSLIB  (IHASPL  )                                       */ 00613000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00614000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00615000
*/*%INCLUDE SYSLIB  (IHAESTA )                                       */ 00616000
*/*%INCLUDE SYSLIB  (IHAFRRS )                                       */ 00617000
*/*%INCLUDE SYSLIB  (IHAWSAVT)                                       */ 00618000
*/*%INCLUDE SYSLIB  (IHAASXB )                                       */ 00619000
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */ 00620000
*                                                                  0273 00621000
*       ;                                                          0273 00622000
         B     @EL00001                                            0273 00623000
@DATA    DS    0H                                                       00624000
@CH00047 DC    H'1'                                                     00625000
@CH00041 DC    H'4'                                                     00626000
@CH00069 DC    H'8'                                                     00627000
@CH01667 DC    H'224'                                                   00628000
@DATD    DSECT                                                          00629000
         DS    0F                                                       00630000
IEAVEMDL CSECT                                                          00631000
         DS    0F                                                       00632000
@DATD    DSECT                                                          00633000
         DS    0D                                                       00634000
ASCBPTR  DS    A                                                        00635000
ECBLIST  DS    AL4                                                      00636000
         ORG   ECBLIST                                                  00637000
LASTBIT  DS    BL1                                                      00638000
         ORG   ECBLIST+4                                                00639000
ASID     DS    H                                                        00640000
         DS    CL2                                                      00641000
ESTAPRM  DS    CL24                                                     00642000
         ORG   ESTAPRM                                                  00643000
BASESAV  DS    AL4                                                      00644000
DATASAV  DS    AL4                                                      00645000
ADDRASCB DS    AL4                                                      00646000
TRACER   DS    BL1                                                      00647000
         ORG   TRACER                                                   00648000
RECURSOR DS    BL1                                                      00649000
ASSIGN   EQU   TRACER+0                                                 00650000
RTNFIXED EQU   TRACER+0                                                 00651000
NOSDWAF  EQU   TRACER+0                                                 00652000
         ORG   ESTAPRM+13                                               00653000
@NM00083 DS    FL1                                                      00654000
         DS    CL2                                                      00655000
RECRTN   DS    AL4                                                      00656000
SAVADDR  DS    AL4                                                      00657000
         ORG   ESTAPRM+24                                               00658000
PRMLST   DS    CL16                                                     00659000
ESTAESA  DS    18A                                                      00660000
IEAVEMDL CSECT                                                          00661000
         DS    0F                                                       00662000
@SIZDATD DC    AL1(0)                                                   00663000
         DC    AL3(@ENDDATD-@DATD)                                      00664000
@CA00028 DC    A(IEAVEMDL)                                              00665000
         DS    0D                                                       00666000
@CC01642 DC    C'IEAVEMDL'                                              00667000
@CC01644 DC    C'MDLESTAE'                                              00668000
EMPTY    DC    X'80000000'                                              00669000
IEAVEMDL CSECT                                                          00670000
*                                               /* ESTAE MACRO */       00671000
ESTAELST ESTAE MDLESTAE,CT,RECORD=YES,MF=L                              00672000
IEAVEMDL CSECT                                                          00673000
SDUMPLST SDUMP SDATA=(ALLPSA,NUC,SQA,LPA,TRT),MF=L,                    *00674000
               HDR='IEAVEMDL- MEMORY DELETE ABNORMAL TERMINATION'       00675000
IEAVEMDL CSECT                                                          00676000
         DS   0H                                                        00677000
PATCHLOC DC ((@DATA-@PSTART)/20)X'00'                                   00678000
@DATD    DSECT                                                          00679000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00680000
@ENDDATD EQU   *                                                        00681000
IEAVEMDL CSECT                                                          00682000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00683000
@01      EQU   01                                                       00684000
@02      EQU   02                                                       00685000
@03      EQU   03                                                       00686000
@04      EQU   04                                                       00687000
@05      EQU   05                                                       00688000
@06      EQU   06                                                       00689000
@07      EQU   07                                                       00690000
@08      EQU   08                                                       00691000
@09      EQU   09                                                       00692000
@10      EQU   10                                                       00693000
@11      EQU   11                                                       00694000
@12      EQU   12                                                       00695000
@13      EQU   13                                                       00696000
@14      EQU   14                                                       00697000
@15      EQU   15                                                       00698000
CURASXB  EQU   @02                                                      00699000
ENTYADDR EQU   @02                                                      00700000
ESTAPTR  EQU   @01                                                      00701000
SDWAPTR  EQU   @04                                                      00702000
LENREG   EQU   @00                                                      00703000
ADDRREG  EQU   @01                                                      00704000
PARMRG   EQU   @01                                                      00705000
WRKRG1   EQU   @03                                                      00706000
ECBRG    EQU   @06                                                      00707000
ASCRPTR  EQU   @07                                                      00708000
WRKRG2   EQU   @08                                                      00709000
REG9     EQU   @09                                                      00710000
REG10    EQU   @10                                                      00711000
REG11    EQU   @11                                                      00712000
REG12    EQU   @12                                                      00713000
SAVPTR   EQU   @13                                                      00714000
REG14    EQU   @14                                                      00715000
OPTRC    EQU   @15                                                      00716000
RTNCDERG EQU   @15                                                      00717000
GPR00P   EQU   @00                                                      00718000
GPR01P   EQU   @01                                                      00719000
GPR14P   EQU   @14                                                      00720000
GPR15P   EQU   @15                                                      00721000
GPR00F   EQU   @00                                                      00722000
GPR02P   EQU   @02                                                      00723000
GPR12F   EQU   @12                                                      00724000
GPR13P   EQU   @13                                                      00725000
CVTPTR   EQU   16                                                       00726000
PSA      EQU   0                                                        00727000
FLCRNPSW EQU   PSA                                                      00728000
FLCROPSW EQU   PSA+8                                                    00729000
FLCICCW2 EQU   PSA+16                                                   00730000
PSAEEPSW EQU   PSA+132                                                  00731000
PSAESPSW EQU   PSA+136                                                  00732000
FLCSVILC EQU   PSAESPSW+1                                               00733000
PSAEPPSW EQU   PSA+140                                                  00734000
FLCPIILC EQU   PSAEPPSW+1                                               00735000
FLCPICOD EQU   PSAEPPSW+2                                               00736000
PSAPICOD EQU   FLCPICOD+1                                               00737000
FLCTEA   EQU   PSAEPPSW+4                                               00738000
FLCPER   EQU   PSA+152                                                  00739000
FLCMCLA  EQU   PSA+168                                                  00740000
FLCIOEL  EQU   FLCMCLA+4                                                00741000
FLCIOA   EQU   FLCMCLA+16                                               00742000
FLCFSA   EQU   FLCMCLA+80                                               00743000
PSAAOLD  EQU   PSA+548                                                  00744000
PSASUPER EQU   PSA+552                                                  00745000
PSASUP1  EQU   PSASUPER                                                 00746000
PSASUP2  EQU   PSASUPER+1                                               00747000
PSASUP3  EQU   PSASUPER+2                                               00748000
PSASUP4  EQU   PSASUPER+3                                               00749000
PSACLHT  EQU   PSA+640                                                  00750000
PSALKSA  EQU   PSA+696                                                  00751000
PSAHLHI  EQU   PSA+760                                                  00752000
PSALITA  EQU   PSA+764                                                  00753000
PSADSSFL EQU   PSA+836                                                  00754000
PSADSSF1 EQU   PSADSSFL                                                 00755000
PSADSSF3 EQU   PSADSSFL+2                                               00756000
PSADSSF4 EQU   PSADSSFL+3                                               00757000
PSARSVT  EQU   PSA+896                                                  00758000
ASVT     EQU   0                                                        00759000
ASVTFRST EQU   ASVT+524                                                 00760000
ASVTAVAI EQU   ASVTFRST                                                 00761000
ASVTENTY EQU   ASVT+528                                                 00762000
ASCB     EQU   0                                                        00763000
ASCBSPL  EQU   ASCB+28                                                  00764000
ASCBFW1  EQU   ASCB+100                                                 00765000
ASCBRCTF EQU   ASCBFW1+2                                                00766000
ASCBFLG1 EQU   ASCBFW1+3                                                00767000
ASCBASXB EQU   ASCB+108                                                 00768000
ASCBDSP1 EQU   ASCB+114                                                 00769000
ASCBFLG2 EQU   ASCB+115                                                 00770000
ASCBMECB EQU   ASCB+140                                                 00771000
SPLENTRY EQU   0                                                        00772000
GSPL     EQU   0                                                        00773000
GSPLNQ   EQU   GSPL                                                     00774000
GSPLSYS  EQU   GSPL+8                                                   00775000
GSPLPTR  EQU   0                                                        00776000
LSPL     EQU   0                                                        00777000
LSPLNQ   EQU   LSPL                                                     00778000
LSPLSYS  EQU   LSPL+8                                                   00779000
CVTMAP   EQU   0                                                        00780000
CVT      EQU   CVTMAP                                                   00781000
CVTDAR   EQU   CVTMAP+72                                                00782000
CVTFLGS1 EQU   CVTDAR                                                   00783000
CVTDCB   EQU   CVTMAP+116                                               00784000
CVTIERLC EQU   CVTMAP+144                                               00785000
CVTOPTA  EQU   CVTMAP+182                                               00786000
CVTOPTB  EQU   CVTMAP+183                                               00787000
CVTGTF   EQU   CVTMAP+236                                               00788000
CVTGTFST EQU   CVTGTF                                                   00789000
CVTGTFS  EQU   CVTGTFST                                                 00790000
CVTSTATE EQU   CVTGTFST                                                 00791000
CVTTMODE EQU   CVTGTFST                                                 00792000
CVTFORM  EQU   CVTGTFST                                                 00793000
CVTAQAVT EQU   CVTMAP+240                                               00794000
CVTTCMFG EQU   CVTAQAVT                                                 00795000
CVTVOLM2 EQU   CVTMAP+244                                               00796000
CVTTATA  EQU   CVTVOLM2                                                 00797000
CVTTSKS  EQU   CVTTATA                                                  00798000
CVTVOLF2 EQU   CVTTSKS                                                  00799000
CVTTAT   EQU   CVTTATA+1                                                00800000
CVTATER  EQU   CVTMAP+248                                               00801000
CVTEXT1  EQU   CVTMAP+252                                               00802000
CVTPURG  EQU   CVTMAP+260                                               00803000
CVTQMSG  EQU   CVTMAP+268                                               00804000
CVTDMSR  EQU   CVTMAP+272                                               00805000
CVTERPV  EQU   CVTMAP+316                                               00806000
CVTINTLA EQU   CVTMAP+320                                               00807000
CVTAPF   EQU   CVTMAP+324                                               00808000
CVTEXT2  EQU   CVTMAP+328                                               00809000
CVTHJES  EQU   CVTMAP+332                                               00810000
CVTPGSIA EQU   CVTMAP+348                                               00811000
CVTA1F1  EQU   CVTMAP+356                                               00812000
CVTSYSK  EQU   CVTMAP+357                                               00813000
CVTVOLM1 EQU   CVTMAP+380                                               00814000
CVTVOLF1 EQU   CVTVOLM1                                                 00815000
CVTATMCT EQU   CVTMAP+388                                               00816000
CVTXTNT1 EQU   0                                                        00817000
CVTXTNT2 EQU   0                                                        00818000
CVTDSSV  EQU   CVTXTNT2                                                 00819000
CVTFLGBT EQU   CVTXTNT2+5                                               00820000
CVTQID   EQU   CVTXTNT2+24                                              00821000
CVTRV400 EQU   CVTXTNT2+52                                              00822000
CVTRV409 EQU   CVTXTNT2+53                                              00823000
CVTATCVT EQU   CVTXTNT2+64                                              00824000
CVTRV429 EQU   CVTXTNT2+84                                              00825000
CVTRV438 EQU   CVTXTNT2+85                                              00826000
CVTRV457 EQU   CVTXTNT2+112                                             00827000
CVTRV466 EQU   CVTXTNT2+113                                             00828000
CVTFIX   EQU   0                                                        00829000
CVTRELNO EQU   CVTFIX+252                                               00830000
ESTA     EQU   0                                                        00831000
ESTAEXT  EQU   ESTA                                                     00832000
ESTAFLG1 EQU   ESTAEXT                                                  00833000
ESTAIO   EQU   ESTAFLG1                                                 00834000
ESTAFGRS EQU   ESTA+12                                                  00835000
ESTAFLG2 EQU   ESTAFGRS                                                 00836000
FRRS     EQU   0                                                        00837000
FRRSHEAD EQU   FRRS                                                     00838000
FRRSPTR  EQU   0                                                        00839000
FRRSENTR EQU   0                                                        00840000
FRRSFLGS EQU   FRRSENTR+4                                               00841000
FRRSFLG1 EQU   FRRSFLGS                                                 00842000
FRREPTR  EQU   0                                                        00843000
WSAL     EQU   0                                                        00844000
WSALACHP EQU   WSAL+56                                                  00845000
ASXB     EQU   0                                                        00846000
ASXBSPSA EQU   ASXB+112                                                 00847000
ASXBAEQ  EQU   ASXB+168                                                 00848000
SDWA     EQU   0                                                        00849000
SDWAFIOB EQU   SDWA+4                                                   00850000
SDWAABCC EQU   SDWAFIOB                                                 00851000
SDWACMPF EQU   SDWAABCC                                                 00852000
SDWAREQ  EQU   SDWACMPF                                                 00853000
SDWACTL1 EQU   SDWA+8                                                   00854000
SDWACMKA EQU   SDWACTL1                                                 00855000
SDWAMWPA EQU   SDWACTL1+1                                               00856000
SDWAPMKA EQU   SDWACTL1+4                                               00857000
SDWACTL2 EQU   SDWA+16                                                  00858000
SDWACMKP EQU   SDWACTL2                                                 00859000
SDWAMWPP EQU   SDWACTL2+1                                               00860000
SDWAPMKP EQU   SDWACTL2+4                                               00861000
SDWAGRSV EQU   SDWA+24                                                  00862000
SDWANAME EQU   SDWA+88                                                  00863000
SDWAEC1  EQU   SDWA+104                                                 00864000
SDWAEMK1 EQU   SDWAEC1                                                  00865000
SDWAMWP1 EQU   SDWAEC1+1                                                00866000
SDWAINT1 EQU   SDWAEC1+2                                                00867000
SDWANXT1 EQU   SDWAEC1+4                                                00868000
SDWAAEC1 EQU   SDWA+112                                                 00869000
SDWAILC1 EQU   SDWAAEC1+1                                               00870000
SDWAINC1 EQU   SDWAAEC1+2                                               00871000
SDWAICD1 EQU   SDWAINC1+1                                               00872000
SDWAEC2  EQU   SDWA+120                                                 00873000
SDWAEMK2 EQU   SDWAEC2                                                  00874000
SDWAMWP2 EQU   SDWAEC2+1                                                00875000
SDWAINT2 EQU   SDWAEC2+2                                                00876000
SDWANXT2 EQU   SDWAEC2+4                                                00877000
SDWAAEC2 EQU   SDWA+128                                                 00878000
SDWAILC2 EQU   SDWAAEC2+1                                               00879000
SDWAINC2 EQU   SDWAAEC2+2                                               00880000
SDWAICD2 EQU   SDWAINC2+1                                               00881000
SDWASRSV EQU   SDWA+136                                                 00882000
SDWAIDNT EQU   SDWA+200                                                 00883000
SDWAMCH  EQU   SDWA+204                                                 00884000
SDWASTCK EQU   SDWAMCH                                                  00885000
SDWAMCHI EQU   SDWAMCH+8                                                00886000
SDWAMCHS EQU   SDWAMCHI                                                 00887000
SDWAMCHD EQU   SDWAMCHI+1                                               00888000
SDWARSR1 EQU   SDWAMCH+12                                               00889000
SDWARSR2 EQU   SDWAMCH+13                                               00890000
SDWAFLGS EQU   SDWA+232                                                 00891000
SDWAERRA EQU   SDWAFLGS                                                 00892000
SDWAERRB EQU   SDWAFLGS+1                                               00893000
SDWAERRC EQU   SDWAFLGS+2                                               00894000
SDWAERRD EQU   SDWAFLGS+3                                               00895000
SDWAIOFS EQU   SDWA+238                                                 00896000
SDWACPUA EQU   SDWA+248                                                 00897000
SDWAPARQ EQU   SDWA+252                                                 00898000
SDWARCDE EQU   SDWAPARQ                                                 00899000
SDWAACF2 EQU   SDWAPARQ+1                                               00900000
SDWARCRD EQU   SDWAACF2                                                 00901000
SDWAACF3 EQU   SDWAPARQ+2                                               00902000
SDWAACF4 EQU   SDWAPARQ+3                                               00903000
SDWALKWA EQU   SDWA+256                                                 00904000
SDWALKWS EQU   SDWALKWA                                                 00905000
SDWARECP EQU   SDWA+292                                                 00906000
SDWAMODN EQU   SDWARECP                                                 00907000
SDWACSCT EQU   SDWARECP+8                                               00908000
SDWAREXN EQU   SDWARECP+16                                              00909000
SDWASNPA EQU   SDWA+320                                                 00910000
SDWADUMP EQU   SDWASNPA                                                 00911000
SDWADPFS EQU   SDWADUMP+1                                               00912000
SDWADDAT EQU   SDWASNPA+4                                               00913000
SDWASDAT EQU   SDWADDAT                                                 00914000
SDWAPDAT EQU   SDWADDAT+2                                               00915000
SDWADPSA EQU   SDWA+328                                                 00916000
SDWADPSL EQU   SDWADPSA                                                 00917000
SDWARA   EQU   SDWA+400                                                 00918000
SDWADPVA EQU   SDWARA+2                                                 00919000
PARMPTR  EQU   0                                                        00920000
PARMLIST EQU   0                                                        00921000
ASIDP    EQU   PARMLIST+2                                               00922000
ASCBP    EQU   PARMLIST+4                                               00923000
AVLENTRY EQU   0                                                        00924000
ASGNBIT  EQU   AVLENTRY                                                 00925000
ASCRLIST EQU   0                                                        00926000
ASCRFWDP EQU   ASCRLIST                                                 00927000
ASCRBWDP EQU   ASCRLIST+4                                               00928000
I001C    EQU   0                                                        00929000
I008P    EQU   0                                                        00930000
I015F    EQU   0                                                        00931000
I015P    EQU   0                                                        00932000
I031F    EQU   0                                                        00933000
I031P    EQU   0                                                        00934000
I256C    EQU   0                                                        00935000
CVTS01   EQU   CVTPGSIA                                                 00936000
CVTLPDIA EQU   CVTS01+12                                                00937000
CVTDIRST EQU   CVTLPDIA                                                 00938000
CVTSLIDA EQU   CVTS01+24                                                00939000
CVTCTLFG EQU   CVTS01+50                                                00940000
CVTRV327 EQU   CVTS01+88                                                00941000
CVTRV519 EQU   CVTS01+92                                                00942000
CVTASVT  EQU   CVTS01+208                                               00943000
CVTVEAC0 EQU   CVTS01+328                                               00944000
CVTRV210 EQU   CVTS01+424                                               00945000
CVTRV219 EQU   CVTS01+425                                               00946000
CVTRV228 EQU   CVTS01+426                                               00947000
CVTRV237 EQU   CVTS01+427                                               00948000
CVTMFRTR EQU   CVTS01+452                                               00949000
CVTRV262 EQU   CVTS01+468                                               00950000
CVTRV271 EQU   CVTS01+469                                               00951000
CVTRV280 EQU   CVTS01+470                                               00952000
CVTRV289 EQU   CVTS01+471                                               00953000
CVTGSDA  EQU   CVTS01+600                                               00954000
ASVTPTR  EQU   CVTASVT                                                  00955000
LSPLPTR  EQU   ASCBSPL                                                  00956000
PSARSVTE EQU   PSARSVT                                                  00957000
ASXBPTR  EQU   ASCBASXB                                                 00958000
CURASCB  EQU   PSAAOLD                                                  00959000
CVTASCRF EQU   CVTRV327                                                 00960000
CVTASCRL EQU   CVTRV519                                                 00961000
FLC      EQU   PSA                                                      00962000
NOASIDS  EQU   EMPTY                                                    00963000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00964000
PSARSAV  EQU   PSARSVTE+60                                              00965000
PSARSTK  EQU   PSARSVTE+56                                              00966000
PSAESAV3 EQU   PSARSVTE+52                                              00967000
PSAESTK3 EQU   PSARSVTE+48                                              00968000
PSAESAV2 EQU   PSARSVTE+44                                              00969000
PSAESTK2 EQU   PSARSVTE+40                                              00970000
PSAESAV1 EQU   PSARSVTE+36                                              00971000
PSAESTK1 EQU   PSARSVTE+32                                              00972000
PSAPSAV  EQU   PSARSVTE+28                                              00973000
PSAPSTK  EQU   PSARSVTE+24                                              00974000
PSAMSAV  EQU   PSARSVTE+20                                              00975000
PSAMSTK  EQU   PSARSVTE+16                                              00976000
PSASSAV  EQU   PSARSVTE+12                                              00977000
PSASSTK  EQU   PSARSVTE+8                                               00978000
PSANSTK  EQU   PSARSVTE+4                                               00979000
PSACSTK  EQU   PSARSVTE                                                 00980000
CVTRV628 EQU   CVTS01+728                                               00981000
CVTRV627 EQU   CVTS01+724                                               00982000
CVTRV626 EQU   CVTS01+720                                               00983000
CVTRV625 EQU   CVTS01+716                                               00984000
CVTRV624 EQU   CVTS01+712                                               00985000
CVTRV623 EQU   CVTS01+708                                               00986000
CVTRV622 EQU   CVTS01+704                                               00987000
CVTRV621 EQU   CVTS01+700                                               00988000
CVTRV620 EQU   CVTS01+696                                               00989000
CVTRV619 EQU   CVTS01+692                                               00990000
CVTRV618 EQU   CVTS01+688                                               00991000
CVTRV617 EQU   CVTS01+684                                               00992000
CVTRV616 EQU   CVTS01+680                                               00993000
CVTRV615 EQU   CVTS01+676                                               00994000
CVTRV614 EQU   CVTS01+672                                               00995000
CVTRV613 EQU   CVTS01+668                                               00996000
CVTRV612 EQU   CVTS01+664                                               00997000
CVTRV611 EQU   CVTS01+660                                               00998000
CVTRV610 EQU   CVTS01+656                                               00999000
CVTRV609 EQU   CVTS01+652                                               01000000
CVTRV608 EQU   CVTS01+648                                               01001000
CVTRV607 EQU   CVTS01+644                                               01002000
CVTRV606 EQU   CVTS01+640                                               01003000
CVTRV605 EQU   CVTS01+636                                               01004000
CVTRV604 EQU   CVTS01+632                                               01005000
CVTEFF02 EQU   CVTS01+628                                               01006000
CVTCBBR  EQU   CVTS01+624                                               01007000
CVTSSCR  EQU   CVTS01+620                                               01008000
CVTEVENT EQU   CVTS01+616                                               01009000
CVTCRCA  EQU   CVTS01+612                                               01010000
CVTTPIO  EQU   CVTS01+608                                               01011000
CVTADV   EQU   CVTS01+604                                               01012000
CVTGSDAB EQU   CVTGSDA                                                  01013000
CVTQV3   EQU   CVTS01+596                                               01014000
CVTQV2   EQU   CVTS01+592                                               01015000
CVTQV1   EQU   CVTS01+588                                               01016000
CVTRPT   EQU   CVTS01+584                                               01017000
CVTSSRB  EQU   CVTS01+580                                               01018000
CVTCSDRL EQU   CVTS01+576                                               01019000
CVTEXP1  EQU   CVTS01+572                                               01020000
CVTRMPMT EQU   CVTS01+568                                               01021000
CVTRMPTT EQU   CVTS01+564                                               01022000
CVTVPSA  EQU   CVTS01+560                                               01023000
CVTVSTOP EQU   CVTS01+556                                               01024000
CVTGTFR8 EQU   CVTS01+552                                               01025000
CVTQUIT  EQU   CVTS01+548                                               01026000
CVTVACR  EQU   CVTS01+544                                               01027000
CVTWTCB  EQU   CVTS01+540                                               01028000
CVTSTPRS EQU   CVTS01+536                                               01029000
CVT0PT02 EQU   CVTS01+532                                               01030000
CVTDARCM EQU   CVTS01+528                                               01031000
CVTIRECM EQU   CVTS01+524                                               01032000
CVTJRECM EQU   CVTS01+520                                               01033000
CVTVEMS0 EQU   CVTS01+516                                               01034000
CVTSPFRR EQU   CVTS01+512                                               01035000
CVTRLSTG EQU   CVTS01+508                                               01036000
CVT0TC0A EQU   CVTS01+504                                               01037000
CVTGMBR  EQU   CVTS01+500                                               01038000
CVTLFRM  EQU   CVTS01+496                                               01039000
CVTRMBR  EQU   CVTS01+492                                               01040000
CVTVIOP  EQU   CVTS01+488                                               01041000
CVTRV307 EQU   CVTS01+486                                               01042000
CVTRV306 EQU   CVTS01+484                                               01043000
CVTRV305 EQU   CVTS01+482                                               01044000
CVTRV304 EQU   CVTS01+480                                               01045000
CVTRV303 EQU   CVTS01+478                                               01046000
CVTRV302 EQU   CVTS01+476                                               01047000
CVTTRCA  EQU   CVTS01+472                                               01048000
CVTRV297 EQU   CVTRV289                                                 01049000
CVTRV296 EQU   CVTRV289                                                 01050000
CVTRV295 EQU   CVTRV289                                                 01051000
CVTRV294 EQU   CVTRV289                                                 01052000
CVTRV293 EQU   CVTRV289                                                 01053000
CVTRV292 EQU   CVTRV289                                                 01054000
CVTRV291 EQU   CVTRV289                                                 01055000
CVTRV290 EQU   CVTRV289                                                 01056000
CVTRV288 EQU   CVTRV280                                                 01057000
CVTRV287 EQU   CVTRV280                                                 01058000
CVTRV286 EQU   CVTRV280                                                 01059000
CVTRV285 EQU   CVTRV280                                                 01060000
CVTRV284 EQU   CVTRV280                                                 01061000
CVTRV283 EQU   CVTRV280                                                 01062000
CVTRV282 EQU   CVTRV280                                                 01063000
CVTRV281 EQU   CVTRV280                                                 01064000
CVTRV279 EQU   CVTRV271                                                 01065000
CVTRV278 EQU   CVTRV271                                                 01066000
CVTRV277 EQU   CVTRV271                                                 01067000
CVTRV276 EQU   CVTRV271                                                 01068000
CVTRV275 EQU   CVTRV271                                                 01069000
CVTRV274 EQU   CVTRV271                                                 01070000
CVTRV273 EQU   CVTRV271                                                 01071000
CVTRV272 EQU   CVTRV271                                                 01072000
CVTRV270 EQU   CVTRV262                                                 01073000
CVTRV269 EQU   CVTRV262                                                 01074000
CVTRV268 EQU   CVTRV262                                                 01075000
CVTRV267 EQU   CVTRV262                                                 01076000
CVTRV266 EQU   CVTRV262                                                 01077000
CVTRV265 EQU   CVTRV262                                                 01078000
CVTRV264 EQU   CVTRV262                                                 01079000
CVTRV263 EQU   CVTRV262                                                 01080000
CVTVFP   EQU   CVTS01+464                                               01081000
CVTVSI   EQU   CVTS01+460                                               01082000
CVTVPSIB EQU   CVTS01+456                                               01083000
CVTMFACT EQU   CVTMFRTR                                                 01084000
CVTMFCTL EQU   CVTS01+448                                               01085000
CVTPVBP  EQU   CVTS01+444                                               01086000
CVTPWI   EQU   CVTS01+440                                               01087000
CVTRV254 EQU   CVTS01+438                                               01088000
CVTRV253 EQU   CVTS01+436                                               01089000
CVTRV252 EQU   CVTS01+434                                               01090000
CVTRV251 EQU   CVTS01+433                                               01091000
CVTRV250 EQU   CVTS01+432                                               01092000
CVTRV249 EQU   CVTS01+431                                               01093000
CVTRV248 EQU   CVTS01+430                                               01094000
CVTRV247 EQU   CVTS01+429                                               01095000
CVTRV246 EQU   CVTS01+428                                               01096000
CVTRV245 EQU   CVTRV237                                                 01097000
CVTRV244 EQU   CVTRV237                                                 01098000
CVTRV243 EQU   CVTRV237                                                 01099000
CVTRV242 EQU   CVTRV237                                                 01100000
CVTRV241 EQU   CVTRV237                                                 01101000
CVTRV240 EQU   CVTRV237                                                 01102000
CVTRV239 EQU   CVTRV237                                                 01103000
CVTRV238 EQU   CVTRV237                                                 01104000
CVTRV236 EQU   CVTRV228                                                 01105000
CVTRV235 EQU   CVTRV228                                                 01106000
CVTRV234 EQU   CVTRV228                                                 01107000
CVTRV233 EQU   CVTRV228                                                 01108000
CVTRV232 EQU   CVTRV228                                                 01109000
CVTRV231 EQU   CVTRV228                                                 01110000
CVTRV230 EQU   CVTRV228                                                 01111000
CVTRV229 EQU   CVTRV228                                                 01112000
CVTRV227 EQU   CVTRV219                                                 01113000
CVTRV226 EQU   CVTRV219                                                 01114000
CVTRV225 EQU   CVTRV219                                                 01115000
CVTRV224 EQU   CVTRV219                                                 01116000
CVTRV223 EQU   CVTRV219                                                 01117000
CVTRV222 EQU   CVTRV219                                                 01118000
CVTRV221 EQU   CVTRV219                                                 01119000
CVTRV220 EQU   CVTRV219                                                 01120000
CVTRV218 EQU   CVTRV210                                                 01121000
CVTRV217 EQU   CVTRV210                                                 01122000
CVTRV216 EQU   CVTRV210                                                 01123000
CVTRV215 EQU   CVTRV210                                                 01124000
CVTRV214 EQU   CVTRV210                                                 01125000
CVTRV213 EQU   CVTRV210                                                 01126000
CVTRV212 EQU   CVTRV210                                                 01127000
CVTRV211 EQU   CVTRV210                                                 01128000
CVTLCCAT EQU   CVTS01+420                                               01129000
CVTPCCAT EQU   CVTS01+416                                               01130000
CVTIPCRP EQU   CVTS01+412                                               01131000
CVTIPCRI EQU   CVTS01+408                                               01132000
CVTIPCDS EQU   CVTS01+404                                               01133000
CVTAIDVT EQU   CVTS01+400                                               01134000
CVTSSAP  EQU   CVTS01+396                                               01135000
CVTEHCIR EQU   CVTS01+392                                               01136000
CVTEHDEF EQU   CVTS01+388                                               01137000
CVTDAIR  EQU   CVTS01+384                                               01138000
CVTPERFM EQU   CVTS01+380                                               01139000
CVT044R2 EQU   CVTS01+376                                               01140000
CVTFETCH EQU   CVTS01+372                                               01141000
CVTRSTWD EQU   CVTS01+368                                               01142000
CVTSPOST EQU   CVTS01+364                                               01143000
CVTIOBP  EQU   CVTS01+360                                               01144000
CVTASMVT EQU   CVTS01+356                                               01145000
CVTRECRQ EQU   CVTS01+352                                               01146000
CVTWSAC  EQU   CVTS01+348                                               01147000
CVTRV149 EQU   CVTS01+344                                               01148000
CVTWSAL  EQU   CVTS01+340                                               01149000
CVTSPSA  EQU   CVTS01+336                                               01150000
CVTGLMN  EQU   CVTS01+332                                               01151000
CVT062R1 EQU   CVTS01+324                                               01152000
CVTRPOST EQU   CVTS01+320                                               01153000
CVTDQIQE EQU   CVTS01+316                                               01154000
CVTCSD   EQU   CVTS01+312                                               01155000
CVTLKRMA EQU   CVTS01+308                                               01156000
CVTRSPIE EQU   CVTS01+304                                               01157000
CVTRENQ  EQU   CVTS01+300                                               01158000
CVTLQCB  EQU   CVTS01+296                                               01159000
CVTFQCB  EQU   CVTS01+292                                               01160000
CVTQCS01 EQU   CVTS01+288                                               01161000
CVTAPFT  EQU   CVTS01+284                                               01162000
CVTPARRL EQU   CVTS01+280                                               01163000
CVTVWAIT EQU   CVTS01+276                                               01164000
CVTGSPL  EQU   CVTS01+272                                               01165000
CVTLSMQ  EQU   CVTS01+268                                               01166000
CVTGSMQ  EQU   CVTS01+264                                               01167000
CVTEXPRO EQU   CVTS01+260                                               01168000
CVTOPCTP EQU   CVTS01+256                                               01169000
CVTSIC   EQU   CVTS01+252                                               01170000
CVTTPIOS EQU   CVTS01+248                                               01171000
CVTRTMS  EQU   CVTS01+244                                               01172000
CVTSDBF  EQU   CVTS01+240                                               01173000
CVTSCBP  EQU   CVTS01+236                                               01174000
CVTSDMP  EQU   CVTS01+232                                               01175000
CVTSV60  EQU   CVTS01+228                                               01176000
CVTRTMCT EQU   CVTS01+224                                               01177000
CVTASCBL EQU   CVTS01+220                                               01178000
CVTASCBH EQU   CVTS01+216                                               01179000
CVTGDA   EQU   CVTS01+212                                               01180000
CVTVVMDI EQU   CVTS01+204                                               01181000
CVTAQTOP EQU   CVTS01+200                                               01182000
CVTIOSCS EQU   CVTS01+196                                               01183000
CVTSDRM  EQU   CVTS01+192                                               01184000
CVTOPTE  EQU   CVTS01+188                                               01185000
CVTSTXU  EQU   CVTS01+184                                               01186000
CVTQUIS  EQU   CVTS01+180                                               01187000
CVTPARS  EQU   CVTS01+176                                               01188000
CVTS1EE  EQU   CVTS01+172                                               01189000
CVTFRAS  EQU   CVTS01+168                                               01190000
CVTQSAS  EQU   CVTS01+164                                               01191000
CVTCRAS  EQU   CVTS01+160                                               01192000
CVTCRMN  EQU   CVTS01+156                                               01193000
CVTDELCP EQU   CVTS01+152                                               01194000
CVTFRECL EQU   CVTS01+148                                               01195000
CVTGETCL EQU   CVTS01+144                                               01196000
CVTBLDCP EQU   CVTS01+140                                               01197000
CVTAUTHL EQU   CVTS01+136                                               01198000
CVTSCAN  EQU   CVTS01+132                                               01199000
CVTRV144 EQU   CVTS01+130                                               01200000
CVTMAXMP EQU   CVTS01+128                                               01201000
CVTSTCK  EQU   CVTS01+124                                               01202000
CVTRV139 EQU   CVTS01+123                                               01203000
CVTDSSAC EQU   CVTS01+122                                               01204000
CVTRV513 EQU   CVTS01+121                                               01205000
CVTIOSPL EQU   CVTS01+120                                               01206000
CVTPTGT  EQU   CVTS01+116                                               01207000
CVTCSPIE EQU   CVTS01+112                                               01208000
CVTSMFEX EQU   CVTS01+108                                               01209000
CVTOLT0A EQU   CVTS01+104                                               01210000
CVTSRBRT EQU   CVTS01+100                                               01211000
CVTPUTL  EQU   CVTS01+96                                                01212000
CVTRV326 EQU   CVTS01+84                                                01213000
CVTRV325 EQU   CVTS01+80                                                01214000
CVTRV324 EQU   CVTS01+76                                                01215000
CVT0VL01 EQU   CVTS01+72                                                01216000
CVTSHRVM EQU   CVTS01+68                                                01217000
CVTRV332 EQU   CVTS01+64                                                01218000
CVTTAS   EQU   CVTS01+60                                                01219000
CVTRSCN  EQU   CVTS01+56                                                01220000
CVTTRAC2 EQU   CVTS01+54                                                01221000
CVTTRACE EQU   CVTS01+52                                                01222000
CVTAPG   EQU   CVTS01+51                                                01223000
CVTSDTRC EQU   CVTCTLFG                                                 01224000
CVTGTRCE EQU   CVTCTLFG                                                 01225000
CVTNOMP  EQU   CVTCTLFG                                                 01226000
CVTRSV79 EQU   CVTCTLFG                                                 01227000
CVTDSTAT EQU   CVTCTLFG                                                 01228000
CVTRSV78 EQU   CVTCTLFG                                                 01229000
CVTRV333 EQU   CVTCTLFG                                                 01230000
CVTRV323 EQU   CVTCTLFG                                                 01231000
CVTSPVLK EQU   CVTS01+49                                                01232000
CVTRSV77 EQU   CVTS01+48                                                01233000
CVTRV331 EQU   CVTS01+44                                                01234000
CVTRV330 EQU   CVTS01+40                                                01235000
CVTRV329 EQU   CVTS01+36                                                01236000
CVTRV328 EQU   CVTS01+32                                                01237000
CVTRV322 EQU   CVTS01+28                                                01238000
CVTSLID  EQU   CVTSLIDA+1                                               01239000
CVTSYLK  EQU   CVTSLIDA                                                 01240000
CVTRV321 EQU   CVTS01+20                                                01241000
CVTRV320 EQU   CVTS01+16                                                01242000
CVTLPDIR EQU   CVTLPDIA+1                                               01243000
CVTRSV69 EQU   CVTDIRST                                                 01244000
CVTRSV68 EQU   CVTDIRST                                                 01245000
CVTRSV67 EQU   CVTDIRST                                                 01246000
CVTRSV66 EQU   CVTDIRST                                                 01247000
CVTRSV65 EQU   CVTDIRST                                                 01248000
CVTRSV64 EQU   CVTDIRST                                                 01249000
CVTRSV63 EQU   CVTDIRST                                                 01250000
CVTDICOM EQU   CVTDIRST                                                 01251000
CVTPVTP  EQU   CVTS01+8                                                 01252000
CVTLPDSR EQU   CVTS01+4                                                 01253000
CVTGETL  EQU   CVTS01                                                   01254000
@NM00085 EQU   PARMLIST+8                                               01255000
@NM00084 EQU   PARMLIST                                                 01256000
@NM00082 EQU   SDWA+512                                                 01257000
SDWAVRA  EQU   SDWARA+4                                                 01258000
SDWAURAL EQU   SDWARA+3                                                 01259000
@NM00081 EQU   SDWADPVA                                                 01260000
SDWAEBC  EQU   SDWADPVA                                                 01261000
SDWAHEX  EQU   SDWADPVA                                                 01262000
SDWAVRAL EQU   SDWARA                                                   01263000
@NM00080 EQU   SDWA+396                                                 01264000
SDWACOMP EQU   SDWA+392                                                 01265000
SDWARCPL EQU   SDWA+364                                                 01266000
@NM00079 EQU   SDWADPSA+32                                              01267000
SDWATO4  EQU   SDWADPSL+28                                              01268000
SDWAFRM4 EQU   SDWADPSL+24                                              01269000
SDWATO3  EQU   SDWADPSL+20                                              01270000
SDWAFRM3 EQU   SDWADPSL+16                                              01271000
SDWATO2  EQU   SDWADPSL+12                                              01272000
SDWAFRM2 EQU   SDWADPSL+8                                               01273000
SDWATO1  EQU   SDWADPSL+4                                               01274000
SDWAFRM1 EQU   SDWADPSL                                                 01275000
@NM00078 EQU   SDWADDAT+3                                               01276000
@NM00077 EQU   SDWAPDAT                                                 01277000
SDWAUSPL EQU   SDWAPDAT                                                 01278000
SDWADPSW EQU   SDWAPDAT                                                 01279000
SDWATJPA EQU   SDWAPDAT                                                 01280000
SDWATLPA EQU   SDWAPDAT                                                 01281000
SDWADREG EQU   SDWAPDAT                                                 01282000
SDWADSAH EQU   SDWAPDAT                                                 01283000
SDWADSAS EQU   SDWAPDAT                                                 01284000
@NM00076 EQU   SDWADDAT+1                                               01285000
@NM00075 EQU   SDWASDAT                                                 01286000
SDWAQQS  EQU   SDWASDAT                                                 01287000
SDWACBS  EQU   SDWASDAT                                                 01288000
SDWAGTF  EQU   SDWASDAT                                                 01289000
SDWASWA  EQU   SDWASDAT                                                 01290000
SDWALSQA EQU   SDWASDAT                                                 01291000
SDWASQA  EQU   SDWASDAT                                                 01292000
SDWANUC  EQU   SDWASDAT                                                 01293000
@NM00074 EQU   SDWADUMP+2                                               01294000
@NM00073 EQU   SDWADPFS                                                 01295000
SDWASLST EQU   SDWADPFS                                                 01296000
@NM00072 EQU   SDWADPFS                                                 01297000
SDWADLST EQU   SDWADPFS                                                 01298000
SDWADPT  EQU   SDWADPFS                                                 01299000
SDWADPID EQU   SDWADUMP                                                 01300000
SDWADPLA EQU   SDWA+316                                                 01301000
@NM00071 EQU   SDWALKWA+32                                              01302000
SDWATALW EQU   SDWALKWS+28                                              01303000
SDWATDLW EQU   SDWALKWS+24                                              01304000
SDWATNLW EQU   SDWALKWS+20                                              01305000
SDWAAPLW EQU   SDWALKWS+16                                              01306000
SDWAIPLW EQU   SDWALKWS+12                                              01307000
SDWAILLW EQU   SDWALKWS+8                                               01308000
SDWAIULW EQU   SDWALKWS+4                                               01309000
SDWAICLW EQU   SDWALKWS                                                 01310000
SDWAFLLK EQU   SDWAACF4                                                 01311000
SDWACMS  EQU   SDWAACF4                                                 01312000
SDWAOPTM EQU   SDWAACF4                                                 01313000
SDWATADB EQU   SDWAACF4                                                 01314000
SDWATDNB EQU   SDWAACF4                                                 01315000
SDWATNCB EQU   SDWAACF4                                                 01316000
SDWAILCH EQU   SDWAACF4                                                 01317000
SDWAIUCB EQU   SDWAACF4                                                 01318000
SDWAICAT EQU   SDWAACF3                                                 01319000
SDWAIPRG EQU   SDWAACF3                                                 01320000
SDWASALL EQU   SDWAACF3                                                 01321000
SDWAASMP EQU   SDWAACF3                                                 01322000
SDWADISP EQU   SDWAACF3                                                 01323000
@NM00070 EQU   SDWAACF3                                                 01324000
@NM00069 EQU   SDWAACF2                                                 01325000
SDWAFREE EQU   SDWAACF2                                                 01326000
SDWAUPRG EQU   SDWAACF2                                                 01327000
@NM00068 EQU   SDWAACF2                                                 01328000
SDWASPIN EQU   SDWAACF2                                                 01329000
@NM00067 EQU   SDWAACF2                                                 01330000
SDWALCPU EQU   SDWACPUA+2                                               01331000
@NM00066 EQU   SDWACPUA                                                 01332000
SDWARECA EQU   SDWA+244                                                 01333000
SDWARTYA EQU   SDWA+240                                                 01334000
@NM00065 EQU   SDWA+239                                                 01335000
@NM00064 EQU   SDWAIOFS                                                 01336000
SDWANIOP EQU   SDWAIOFS                                                 01337000
SDWANOIO EQU   SDWAIOFS                                                 01338000
SDWAIOHT EQU   SDWAIOFS                                                 01339000
SDWAIOQR EQU   SDWAIOFS                                                 01340000
SDWAFMID EQU   SDWA+236                                                 01341000
@NM00063 EQU   SDWAERRD                                                 01342000
SDWAMCIV EQU   SDWAERRD                                                 01343000
SDWARPIV EQU   SDWAERRD                                                 01344000
SDWAMABD EQU   SDWAERRD                                                 01345000
SDWACTS  EQU   SDWAERRD                                                 01346000
SDWASTAE EQU   SDWAERRD                                                 01347000
SDWANRBE EQU   SDWAERRD                                                 01348000
SDWACLUP EQU   SDWAERRD                                                 01349000
@NM00062 EQU   SDWAERRC                                                 01350000
SDWAEAS  EQU   SDWAERRC                                                 01351000
SDWAPERC EQU   SDWAERRC                                                 01352000
SDWAIRB  EQU   SDWAERRC                                                 01353000
SDWASTAI EQU   SDWAERRC                                                 01354000
SDWASTAF EQU   SDWAERRC                                                 01355000
SDWASRBM EQU   SDWAERRB                                                 01356000
SDWALDIS EQU   SDWAERRB                                                 01357000
SDWAENRB EQU   SDWAERRB                                                 01358000
SDWATYP1 EQU   SDWAERRB                                                 01359000
@NM00061 EQU   SDWAERRB                                                 01360000
SDWAPGIO EQU   SDWAERRA                                                 01361000
SDWATEXC EQU   SDWAERRA                                                 01362000
SDWASVCE EQU   SDWAERRA                                                 01363000
SDWAABTM EQU   SDWAERRA                                                 01364000
SDWASVCD EQU   SDWAERRA                                                 01365000
SDWARKEY EQU   SDWAERRA                                                 01366000
SDWAPCHK EQU   SDWAERRA                                                 01367000
SDWAMCHK EQU   SDWAERRA                                                 01368000
SDWATIME EQU   SDWAMCH+20                                               01369000
SDWARFSA EQU   SDWAMCH+16                                               01370000
@NM00060 EQU   SDWAMCH+14                                               01371000
SDWAVEQR EQU   SDWARSR2                                                 01372000
SDWAPGFX EQU   SDWARSR2                                                 01373000
SDWAFLSQ EQU   SDWARSR2                                                 01374000
SDWAFSQA EQU   SDWARSR2                                                 01375000
SDWANUCL EQU   SDWARSR2                                                 01376000
SDWASPER EQU   SDWARSR2                                                 01377000
SDWAINTC EQU   SDWARSR2                                                 01378000
SDWAOFLN EQU   SDWARSR2                                                 01379000
SDWACHNG EQU   SDWARSR1                                                 01380000
SDWAMSER EQU   SDWARSR1                                                 01381000
@NM00059 EQU   SDWARSR1                                                 01382000
SDWACPID EQU   SDWAMCH+10                                               01383000
SDWATERR EQU   SDWAMCHD                                                 01384000
SDWAFPRX EQU   SDWAMCHD                                                 01385000
SDWAINSF EQU   SDWAMCHD                                                 01386000
SDWAACR  EQU   SDWAMCHD                                                 01387000
SDWASCK  EQU   SDWAMCHD                                                 01388000
SDWAPSWU EQU   SDWAMCHD                                                 01389000
SDWAREGU EQU   SDWAMCHD                                                 01390000
SDWASKYF EQU   SDWAMCHD                                                 01391000
@NM00058 EQU   SDWAMCHS                                                 01392000
SDWARSRF EQU   SDWAMCHS                                                 01393000
SDWARSRC EQU   SDWAMCHS                                                 01394000
SDWAINVP EQU   SDWAMCHS                                                 01395000
SDWATSVL EQU   SDWAMCHS                                                 01396000
SDWARCDF EQU   SDWAMCHS                                                 01397000
SDWASRVL EQU   SDWAMCHS                                                 01398000
SDWASCKE EQU   SDWASTCK+4                                               01399000
SDWASCKB EQU   SDWASTCK                                                 01400000
SDWALNTH EQU   SDWAIDNT+1                                               01401000
SDWASPID EQU   SDWAIDNT                                                 01402000
SDWASR15 EQU   SDWASRSV+60                                              01403000
SDWASR14 EQU   SDWASRSV+56                                              01404000
SDWASR13 EQU   SDWASRSV+52                                              01405000
SDWASR12 EQU   SDWASRSV+48                                              01406000
SDWASR11 EQU   SDWASRSV+44                                              01407000
SDWASR10 EQU   SDWASRSV+40                                              01408000
SDWASR09 EQU   SDWASRSV+36                                              01409000
SDWASR08 EQU   SDWASRSV+32                                              01410000
SDWASR07 EQU   SDWASRSV+28                                              01411000
SDWASR06 EQU   SDWASRSV+24                                              01412000
SDWASR05 EQU   SDWASRSV+20                                              01413000
SDWASR04 EQU   SDWASRSV+16                                              01414000
SDWASR03 EQU   SDWASRSV+12                                              01415000
SDWASR02 EQU   SDWASRSV+8                                               01416000
SDWASR01 EQU   SDWASRSV+4                                               01417000
SDWASR00 EQU   SDWASRSV                                                 01418000
SDWATRN2 EQU   SDWAAEC2+4                                               01419000
SDWAIPC2 EQU   SDWAICD2                                                 01420000
SDWAIMC2 EQU   SDWAICD2                                                 01421000
SDWAIPR2 EQU   SDWAICD2                                                 01422000
@NM00057 EQU   SDWAINC2                                                 01423000
@NM00056 EQU   SDWAILC2                                                 01424000
SDWAIL2  EQU   SDWAILC2                                                 01425000
@NM00055 EQU   SDWAILC2                                                 01426000
@NM00054 EQU   SDWAAEC2                                                 01427000
SDWAADD2 EQU   SDWANXT2+1                                               01428000
@NM00053 EQU   SDWANXT2                                                 01429000
@NM00052 EQU   SDWAEC2+3                                                01430000
SDWASGN2 EQU   SDWAINT2                                                 01431000
SDWAEXP2 EQU   SDWAINT2                                                 01432000
SDWADEC2 EQU   SDWAINT2                                                 01433000
SDWAFPO2 EQU   SDWAINT2                                                 01434000
SDWACC2  EQU   SDWAINT2                                                 01435000
@NM00051 EQU   SDWAINT2                                                 01436000
SDWAPGM2 EQU   SDWAMWP2                                                 01437000
SDWAWAT2 EQU   SDWAMWP2                                                 01438000
SDWAMCK2 EQU   SDWAMWP2                                                 01439000
SDWAECT2 EQU   SDWAMWP2                                                 01440000
SDWAKEY2 EQU   SDWAMWP2                                                 01441000
SDWAEXT2 EQU   SDWAEMK2                                                 01442000
SDWAIO2  EQU   SDWAEMK2                                                 01443000
SDWATRM2 EQU   SDWAEMK2                                                 01444000
@NM00050 EQU   SDWAEMK2                                                 01445000
SDWAPER2 EQU   SDWAEMK2                                                 01446000
@NM00049 EQU   SDWAEMK2                                                 01447000
SDWATRAN EQU   SDWAAEC1+4                                               01448000
SDWAIPC1 EQU   SDWAICD1                                                 01449000
SDWAIMC1 EQU   SDWAICD1                                                 01450000
SDWAIPR1 EQU   SDWAICD1                                                 01451000
@NM00048 EQU   SDWAINC1                                                 01452000
@NM00047 EQU   SDWAILC1                                                 01453000
SDWAIL1  EQU   SDWAILC1                                                 01454000
@NM00046 EQU   SDWAILC1                                                 01455000
@NM00045 EQU   SDWAAEC1                                                 01456000
SDWAADD1 EQU   SDWANXT1+1                                               01457000
@NM00044 EQU   SDWANXT1                                                 01458000
@NM00043 EQU   SDWAEC1+3                                                01459000
SDWASGN1 EQU   SDWAINT1                                                 01460000
SDWAEXP1 EQU   SDWAINT1                                                 01461000
SDWADEC1 EQU   SDWAINT1                                                 01462000
SDWAFPO1 EQU   SDWAINT1                                                 01463000
SDWACC1  EQU   SDWAINT1                                                 01464000
@NM00042 EQU   SDWAINT1                                                 01465000
SDWAPGM1 EQU   SDWAMWP1                                                 01466000
SDWAWAT1 EQU   SDWAMWP1                                                 01467000
SDWAMCK1 EQU   SDWAMWP1                                                 01468000
SDWAECT1 EQU   SDWAMWP1                                                 01469000
SDWAKEY1 EQU   SDWAMWP1                                                 01470000
SDWAEXT1 EQU   SDWAEMK1                                                 01471000
SDWAIO1  EQU   SDWAEMK1                                                 01472000
SDWATRM1 EQU   SDWAEMK1                                                 01473000
@NM00041 EQU   SDWAEMK1                                                 01474000
SDWAPER1 EQU   SDWAEMK1                                                 01475000
@NM00040 EQU   SDWAEMK1                                                 01476000
SDWAIOBR EQU   SDWA+100                                                 01477000
SDWAEPA  EQU   SDWA+96                                                  01478000
@NM00039 EQU   SDWANAME+4                                               01479000
SDWARBAD EQU   SDWANAME                                                 01480000
SDWAGR15 EQU   SDWAGRSV+60                                              01481000
SDWAGR14 EQU   SDWAGRSV+56                                              01482000
SDWAGR13 EQU   SDWAGRSV+52                                              01483000
SDWAGR12 EQU   SDWAGRSV+48                                              01484000
SDWAGR11 EQU   SDWAGRSV+44                                              01485000
SDWAGR10 EQU   SDWAGRSV+40                                              01486000
SDWAGR09 EQU   SDWAGRSV+36                                              01487000
SDWAGR08 EQU   SDWAGRSV+32                                              01488000
SDWAGR07 EQU   SDWAGRSV+28                                              01489000
SDWAGR06 EQU   SDWAGRSV+24                                              01490000
SDWAGR05 EQU   SDWAGRSV+20                                              01491000
SDWAGR04 EQU   SDWAGRSV+16                                              01492000
SDWAGR03 EQU   SDWAGRSV+12                                              01493000
SDWAGR02 EQU   SDWAGRSV+8                                               01494000
SDWAGR01 EQU   SDWAGRSV+4                                               01495000
SDWAGR00 EQU   SDWAGRSV                                                 01496000
SDWANXTP EQU   SDWACTL2+5                                               01497000
SDWASGP  EQU   SDWAPMKP                                                 01498000
SDWAEUP  EQU   SDWAPMKP                                                 01499000
SDWADOP  EQU   SDWAPMKP                                                 01500000
SDWAFPP  EQU   SDWAPMKP                                                 01501000
SDWACCP  EQU   SDWAPMKP                                                 01502000
SDWAILP  EQU   SDWAPMKP                                                 01503000
SDWAINTP EQU   SDWACTL2+2                                               01504000
SDWASPVP EQU   SDWAMWPP                                                 01505000
SDWAWATP EQU   SDWAMWPP                                                 01506000
SDWAMCKP EQU   SDWAMWPP                                                 01507000
@NM00038 EQU   SDWAMWPP                                                 01508000
SDWAKEYP EQU   SDWAMWPP                                                 01509000
SDWAEXTP EQU   SDWACMKP                                                 01510000
SDWAIOP  EQU   SDWACMKP                                                 01511000
SDWANXTA EQU   SDWACTL1+5                                               01512000
SDWASGA  EQU   SDWAPMKA                                                 01513000
SDWAEUA  EQU   SDWAPMKA                                                 01514000
SDWADOA  EQU   SDWAPMKA                                                 01515000
SDWAFPA  EQU   SDWAPMKA                                                 01516000
SDWACCA  EQU   SDWAPMKA                                                 01517000
SDWAILA  EQU   SDWAPMKA                                                 01518000
SDWAINTA EQU   SDWACTL1+2                                               01519000
SDWASPVA EQU   SDWAMWPA                                                 01520000
SDWAWATA EQU   SDWAMWPA                                                 01521000
SDWAMCKA EQU   SDWAMWPA                                                 01522000
@NM00037 EQU   SDWAMWPA                                                 01523000
SDWAKEYA EQU   SDWAMWPA                                                 01524000
SDWAEXTA EQU   SDWACMKA                                                 01525000
SDWAIOA  EQU   SDWACMKA                                                 01526000
SDWACMPC EQU   SDWAABCC+1                                               01527000
@NM00036 EQU   SDWACMPF                                                 01528000
SDWASTCC EQU   SDWACMPF                                                 01529000
@NM00035 EQU   SDWACMPF                                                 01530000
SDWASTEP EQU   SDWACMPF                                                 01531000
SDWAPARM EQU   SDWA                                                     01532000
ASXBEND  EQU   ASXB+232                                                 01533000
ASXBRV25 EQU   ASXB+228                                                 01534000
ASXBRV24 EQU   ASXB+224                                                 01535000
ASXBRV23 EQU   ASXB+220                                                 01536000
ASXBRV22 EQU   ASXB+216                                                 01537000
ASXBRV21 EQU   ASXB+212                                                 01538000
ASXBRV20 EQU   ASXB+208                                                 01539000
ASXBRV19 EQU   ASXB+204                                                 01540000
ASXBRV18 EQU   ASXB+200                                                 01541000
ASXBRV17 EQU   ASXB+196                                                 01542000
ASXBRV16 EQU   ASXB+192                                                 01543000
ASXBLSRB EQU   ASXBAEQ+20                                               01544000
ASXBFSRB EQU   ASXBAEQ+16                                               01545000
ASXBLRQE EQU   ASXBAEQ+12                                               01546000
ASXBFRQE EQU   ASXBAEQ+8                                                01547000
ASXBLIQE EQU   ASXBAEQ+4                                                01548000
ASXBFIQE EQU   ASXBAEQ                                                  01549000
ASXBETSK EQU   ASXB+164                                                 01550000
ASXBSIRB EQU   ASXB+160                                                 01551000
ASXBPSWD EQU   ASXB+152                                                 01552000
ASXBPRG  EQU   ASXB+136                                                 01553000
ASXBRV26 EQU   ASXB+132                                                 01554000
ASXBOUSB EQU   ASXB+128                                                 01555000
ASXBDDR  EQU   ASXB+124                                                 01556000
ASXBRCTD EQU   ASXB+120                                                 01557000
ASXBRSMD EQU   ASXB+116                                                 01558000
ASXBFRWA EQU   ASXB+108                                                 01559000
ASXBFLSA EQU   ASXB+36                                                  01560000
ASXBIHSA EQU   ASXB+32                                                  01561000
ASXBRV15 EQU   ASXB+28                                                  01562000
ASXBRV14 EQU   ASXB+24                                                  01563000
ASXBLWA  EQU   ASXB+20                                                  01564000
ASXBMPST EQU   ASXB+16                                                  01565000
ASXBRS00 EQU   ASXB+14                                                  01566000
ASXBTCBS EQU   ASXB+12                                                  01567000
ASXBLTCB EQU   ASXB+8                                                   01568000
ASXBFTCB EQU   ASXB+4                                                   01569000
ASXBASXB EQU   ASXB                                                     01570000
ASXBEGIN EQU   ASXB                                                     01571000
WSALRSM  EQU   WSAL+52                                                  01572000
WSALEVNT EQU   WSAL+48                                                  01573000
WSALSTAE EQU   WSAL+44                                                  01574000
WSALSTAT EQU   WSAL+40                                                  01575000
WSALWAIT EQU   WSAL+36                                                  01576000
WSALPOST EQU   WSAL+32                                                  01577000
WSALEXIT EQU   WSAL+28                                                  01578000
WSALS2EE EQU   WSAL+24                                                  01579000
WSALCIRB EQU   WSAL+20                                                  01580000
WSALABTM EQU   WSAL+16                                                  01581000
WSALSDMP EQU   WSAL+12                                                  01582000
WSALRTM2 EQU   WSAL+8                                                   01583000
WSALVALC EQU   WSAL+4                                                   01584000
WSALCWSA EQU   WSAL                                                     01585000
FRRSPARM EQU   FRRSENTR+8                                               01586000
@NM00034 EQU   FRRSFLGS+1                                               01587000
@NM00033 EQU   FRRSFLG1                                                 01588000
FRRSNEST EQU   FRRSFLG1                                                 01589000
FRRSRCUR EQU   FRRSFLG1                                                 01590000
FRRSFRRA EQU   FRRSENTR                                                 01591000
FRRSENTS EQU   FRRS+84                                                  01592000
FRRSRTMW EQU   FRRS+16                                                  01593000
FRRSCURR EQU   FRRSHEAD+12                                              01594000
FRRSELEN EQU   FRRSHEAD+8                                               01595000
FRRSLAST EQU   FRRSHEAD+4                                               01596000
FRRSEMP  EQU   FRRSHEAD                                                 01597000
ESTARSVI EQU   ESTAFGRS+1                                               01598000
@NM00032 EQU   ESTAFLG2                                                 01599000
ESTABRNT EQU   ESTAFLG2                                                 01600000
@NM00031 EQU   ESTAFLG2                                                 01601000
ESTAEREC EQU   ESTAFLG2                                                 01602000
ESTATERM EQU   ESTAFLG2                                                 01603000
@NM00030 EQU   ESTAFLG2                                                 01604000
ESTAOWNR EQU   ESTA+8                                                   01605000
ESTAPARM EQU   ESTA+4                                                   01606000
ESTAEXIT EQU   ESTAEXT+1                                                01607000
ESTAHALT EQU   ESTAIO                                                   01608000
ESTANOIO EQU   ESTAIO                                                   01609000
ESTASYNC EQU   ESTAFLG1                                                 01610000
@NM00029 EQU   ESTAFLG1                                                 01611000
ESTAESTA EQU   ESTAFLG1                                                 01612000
@NM00028 EQU   ESTAFLG1                                                 01613000
ESTASTAR EQU   ESTAFLG1                                                 01614000
ESTASTAI EQU   ESTAFLG1                                                 01615000
CVTLEVL  EQU   CVTRELNO+2                                               01616000
CVTNUMB  EQU   CVTRELNO                                                 01617000
CVTMDL   EQU   CVTFIX+250                                               01618000
@NM00003 EQU   CVTFIX+248                                               01619000
@NM00002 EQU   CVTFIX                                                   01620000
CVTRV482 EQU   CVTXTNT2+128                                             01621000
CVTRV481 EQU   CVTXTNT2+124                                             01622000
CVTRV480 EQU   CVTXTNT2+120                                             01623000
CVTRV479 EQU   CVTXTNT2+118                                             01624000
CVTRV478 EQU   CVTXTNT2+117                                             01625000
CVTRV477 EQU   CVTXTNT2+116                                             01626000
CVTRV476 EQU   CVTXTNT2+115                                             01627000
CVTRV475 EQU   CVTXTNT2+114                                             01628000
CVTRV474 EQU   CVTRV466                                                 01629000
CVTRV473 EQU   CVTRV466                                                 01630000
CVTRV472 EQU   CVTRV466                                                 01631000
CVTRV471 EQU   CVTRV466                                                 01632000
CVTRV470 EQU   CVTRV466                                                 01633000
CVTRV469 EQU   CVTRV466                                                 01634000
CVTRV468 EQU   CVTRV466                                                 01635000
CVTRV467 EQU   CVTRV466                                                 01636000
CVTRV465 EQU   CVTRV457                                                 01637000
CVTRV464 EQU   CVTRV457                                                 01638000
CVTRV463 EQU   CVTRV457                                                 01639000
CVTRV462 EQU   CVTRV457                                                 01640000
CVTRV461 EQU   CVTRV457                                                 01641000
CVTRV460 EQU   CVTRV457                                                 01642000
CVTRV459 EQU   CVTRV457                                                 01643000
CVTRV458 EQU   CVTRV457                                                 01644000
CVTRV456 EQU   CVTXTNT2+108                                             01645000
CVTRV455 EQU   CVTXTNT2+104                                             01646000
CVTRV454 EQU   CVTXTNT2+100                                             01647000
CVTRV453 EQU   CVTXTNT2+96                                              01648000
CVTRV452 EQU   CVTXTNT2+94                                              01649000
CVTRV451 EQU   CVTXTNT2+92                                              01650000
CVTRV450 EQU   CVTXTNT2+90                                              01651000
CVTRV449 EQU   CVTXTNT2+88                                              01652000
CVTRV448 EQU   CVTXTNT2+87                                              01653000
CVTRV447 EQU   CVTXTNT2+86                                              01654000
CVTRV446 EQU   CVTRV438                                                 01655000
CVTRV445 EQU   CVTRV438                                                 01656000
CVTRV444 EQU   CVTRV438                                                 01657000
CVTRV443 EQU   CVTRV438                                                 01658000
CVTRV442 EQU   CVTRV438                                                 01659000
CVTRV441 EQU   CVTRV438                                                 01660000
CVTRV440 EQU   CVTRV438                                                 01661000
CVTRV439 EQU   CVTRV438                                                 01662000
CVTRV437 EQU   CVTRV429                                                 01663000
CVTRV436 EQU   CVTRV429                                                 01664000
CVTRV435 EQU   CVTRV429                                                 01665000
CVTRV434 EQU   CVTRV429                                                 01666000
CVTRV433 EQU   CVTRV429                                                 01667000
CVTRV432 EQU   CVTRV429                                                 01668000
CVTRV431 EQU   CVTRV429                                                 01669000
CVTRV430 EQU   CVTRV429                                                 01670000
CVTRV428 EQU   CVTXTNT2+80                                              01671000
CVTRV427 EQU   CVTXTNT2+76                                              01672000
CVTRV426 EQU   CVTXTNT2+72                                              01673000
CVTRV425 EQU   CVTXTNT2+68                                              01674000
CVTATACT EQU   CVTATCVT                                                 01675000
CVTRV423 EQU   CVTXTNT2+62                                              01676000
CVTRV422 EQU   CVTXTNT2+60                                              01677000
CVTRV421 EQU   CVTXTNT2+58                                              01678000
CVTRV420 EQU   CVTXTNT2+56                                              01679000
CVTRV419 EQU   CVTXTNT2+55                                              01680000
CVTRV418 EQU   CVTXTNT2+54                                              01681000
CVTRV417 EQU   CVTRV409                                                 01682000
CVTRV416 EQU   CVTRV409                                                 01683000
CVTRV415 EQU   CVTRV409                                                 01684000
CVTRV414 EQU   CVTRV409                                                 01685000
CVTRV413 EQU   CVTRV409                                                 01686000
CVTRV412 EQU   CVTRV409                                                 01687000
CVTRV411 EQU   CVTRV409                                                 01688000
CVTRV410 EQU   CVTRV409                                                 01689000
CVTRV408 EQU   CVTRV400                                                 01690000
CVTRV407 EQU   CVTRV400                                                 01691000
CVTRV406 EQU   CVTRV400                                                 01692000
CVTRV405 EQU   CVTRV400                                                 01693000
CVTRV404 EQU   CVTRV400                                                 01694000
CVTRV403 EQU   CVTRV400                                                 01695000
CVTRV402 EQU   CVTRV400                                                 01696000
CVTRV401 EQU   CVTRV400                                                 01697000
CVTICB   EQU   CVTXTNT2+48                                              01698000
CVTSKTA  EQU   CVTXTNT2+44                                              01699000
CVTRSV99 EQU   CVTXTNT2+40                                              01700000
CVTRSV98 EQU   CVTXTNT2+36                                              01701000
CVTRSV97 EQU   CVTXTNT2+34                                              01702000
CVTRSV96 EQU   CVTXTNT2+32                                              01703000
CVTOLTEP EQU   CVTXTNT2+28                                              01704000
CVTQIDA  EQU   CVTQID+1                                                 01705000
CVTRSV95 EQU   CVTQID                                                   01706000
CVTRSV94 EQU   CVTXTNT2+20                                              01707000
CVTRSV93 EQU   CVTXTNT2+16                                              01708000
CVTRSV92 EQU   CVTXTNT2+12                                              01709000
CVTDEBVR EQU   CVTXTNT2+8                                               01710000
CVTRSV91 EQU   CVTXTNT2+6                                               01711000
CVTRSV9H EQU   CVTFLGBT                                                 01712000
CVTRSV9G EQU   CVTFLGBT                                                 01713000
CVTRSV9F EQU   CVTFLGBT                                                 01714000
CVTRSV9E EQU   CVTFLGBT                                                 01715000
CVTRSV9D EQU   CVTFLGBT                                                 01716000
CVTRSV9C EQU   CVTFLGBT                                                 01717000
CVTVME   EQU   CVTFLGBT                                                 01718000
CVTNPE   EQU   CVTFLGBT                                                 01719000
CVTNUCLS EQU   CVTXTNT2+4                                               01720000
CVTDSSVA EQU   CVTDSSV+1                                                01721000
CVTRSV89 EQU   CVTDSSV                                                  01722000
CVTRSV88 EQU   CVTXTNT1+8                                               01723000
CVTRSV87 EQU   CVTXTNT1+4                                               01724000
CVTFACHN EQU   CVTXTNT1                                                 01725000
CVTRV488 EQU   CVTMAP+412                                               01726000
CVTRV487 EQU   CVTMAP+408                                               01727000
CVTRV486 EQU   CVTMAP+404                                               01728000
CVTRV485 EQU   CVTMAP+400                                               01729000
CVTACTAP EQU   CVTMAP+396                                               01730000
CVTAUTH  EQU   CVTMAP+392                                               01731000
CVTATMCA EQU   CVTATMCT+1                                               01732000
CVTATMST EQU   CVTATMCT                                                 01733000
CVTRSV61 EQU   CVTMAP+384                                               01734000
CVTVOLT1 EQU   CVTVOLM1+1                                               01735000
CVTVOLI1 EQU   CVTVOLF1                                                 01736000
CVTSTOA  EQU   CVTMAP+376                                               01737000
CVTRSV58 EQU   CVTMAP+374                                               01738000
CVTRSV57 EQU   CVTMAP+372                                               01739000
CVTDDCE  EQU   CVTMAP+368                                               01740000
CVTPNWFR EQU   CVTMAP+364                                               01741000
CVTSMF   EQU   CVTMAP+360                                               01742000
CVTSULK  EQU   CVTMAP+358                                               01743000
CVTSLKO  EQU   CVTSYSK                                                  01744000
CVTSLKP  EQU   CVTSYSK                                                  01745000
CVTSLKQ  EQU   CVTSYSK                                                  01746000
CVTSLKR  EQU   CVTSYSK                                                  01747000
CVTRSV56 EQU   CVTSYSK                                                  01748000
CVTRSV55 EQU   CVTSYSK                                                  01749000
CVTRSV54 EQU   CVTSYSK                                                  01750000
CVTRSV53 EQU   CVTSYSK                                                  01751000
CVTRSV52 EQU   CVTA1F1                                                  01752000
CVTRSV51 EQU   CVTA1F1                                                  01753000
CVTRSV50 EQU   CVTA1F1                                                  01754000
CVTRSV49 EQU   CVTA1F1                                                  01755000
CVTRSV48 EQU   CVTA1F1                                                  01756000
CVTRSV47 EQU   CVTA1F1                                                  01757000
CVTSRSW  EQU   CVTA1F1                                                  01758000
CVTPFSW  EQU   CVTA1F1                                                  01759000
CVTPCVT  EQU   CVTMAP+352                                               01760000
CVTRSV46 EQU   CVTMAP+344                                               01761000
CVTRSV45 EQU   CVTMAP+340                                               01762000
CVTRSV44 EQU   CVTMAP+338                                               01763000
CVTRSV43 EQU   CVTMAP+336                                               01764000
CVTHJESA EQU   CVTHJES+1                                                01765000
CVTRSV42 EQU   CVTHJES                                                  01766000
CVTEXT2A EQU   CVTEXT2+1                                                01767000
CVTRSV41 EQU   CVTEXT2                                                  01768000
CVTAPFA  EQU   CVTAPF+1                                                 01769000
CVTRSV40 EQU   CVTAPF                                                   01770000
CVTRV518 EQU   CVTINTLA                                                 01771000
CVTRV517 EQU   CVTERPV                                                  01772000
CVTEORM  EQU   CVTMAP+312                                               01773000
CVTMCHPR EQU   CVTMAP+308                                               01774000
CVTTZ    EQU   CVTMAP+304                                               01775000
CVTJEPS  EQU   CVTMAP+300                                               01776000
CVTJESCT EQU   CVTMAP+296                                               01777000
CVTMODE  EQU   CVTMAP+292                                               01778000
CVTPTRV  EQU   CVTMAP+288                                               01779000
CVTREAL  EQU   CVTMAP+284                                               01780000
CVTRSV39 EQU   CVTMAP+280                                               01781000
CVTRSV38 EQU   CVTMAP+276                                               01782000
CVTDMSRA EQU   CVTDMSR+1                                                01783000
CVTRSV37 EQU   CVTDMSR                                                  01784000
CVTQMSGA EQU   CVTQMSG+1                                                01785000
CVTRSV36 EQU   CVTQMSG                                                  01786000
CVTAMFF  EQU   CVTMAP+264                                               01787000
CVTPURGA EQU   CVTPURG+1                                                01788000
CVTRSV35 EQU   CVTPURG                                                  01789000
CVTCBSP  EQU   CVTMAP+256                                               01790000
CVTATERA EQU   CVTATER+1                                                01791000
CVTSYST  EQU   CVTATER                                                  01792000
CVTVOLT2 EQU   CVTTAT                                                   01793000
CVTVOLI2 EQU   CVTVOLF2                                                 01794000
CVTAQAVB EQU   CVTAQAVT+1                                               01795000
CVTRSV34 EQU   CVTTCMFG                                                 01796000
CVTRSV33 EQU   CVTTCMFG                                                 01797000
CVTRSV32 EQU   CVTTCMFG                                                 01798000
CVTRSV31 EQU   CVTTCMFG                                                 01799000
CVTRSV30 EQU   CVTTCMFG                                                 01800000
CVTRSV29 EQU   CVTTCMFG                                                 01801000
CVTRSV28 EQU   CVTTCMFG                                                 01802000
CVTTCRDY EQU   CVTTCMFG                                                 01803000
CVTGTFA  EQU   CVTGTF+1                                                 01804000
CVTRSV27 EQU   CVTGTFST                                                 01805000
CVTRNIO  EQU   CVTGTFST                                                 01806000
CVTUSR   EQU   CVTGTFST                                                 01807000
CVTRV318 EQU   CVTFORM                                                  01808000
CVTRV317 EQU   CVTTMODE                                                 01809000
CVTRV316 EQU   CVTSTATE                                                 01810000
CVTRV315 EQU   CVTGTFS                                                  01811000
CVTGTFAV EQU   CVTGTFS                                                  01812000
CVT0SCR1 EQU   CVTMAP+232                                               01813000
CVTRV515 EQU   CVTMAP+228                                               01814000
CVTRMS   EQU   CVTMAP+224                                               01815000
CVTPATCH EQU   CVTMAP+220                                               01816000
CVTTSCE  EQU   CVTMAP+216                                               01817000
CVTLNKSC EQU   CVTMAP+214                                               01818000
CVTQABST EQU   CVTMAP+212                                               01819000
CVTMDLDS EQU   CVTMAP+208                                               01820000
CVTUSER  EQU   CVTMAP+204                                               01821000
CVTABEND EQU   CVTMAP+200                                               01822000
CVTSMCA  EQU   CVTMAP+196                                               01823000
CVTRSV18 EQU   CVTMAP+192                                               01824000
CVTQLPAQ EQU   CVTMAP+188                                               01825000
CVTQCDSR EQU   CVTMAP+184                                               01826000
CVTRSV17 EQU   CVTOPTB                                                  01827000
CVTRSV16 EQU   CVTOPTB                                                  01828000
CVTFP    EQU   CVTOPTB                                                  01829000
CVTAPTHR EQU   CVTOPTB                                                  01830000
CVTNLOG  EQU   CVTOPTB                                                  01831000
CVTTOD   EQU   CVTOPTB                                                  01832000
CVTCTIMS EQU   CVTOPTB                                                  01833000
CVTPROT  EQU   CVTOPTB                                                  01834000
CVTXPFP  EQU   CVTOPTA                                                  01835000
CVTASCII EQU   CVTOPTA                                                  01836000
CVTRSV13 EQU   CVTOPTA                                                  01837000
CVTRSV12 EQU   CVTOPTA                                                  01838000
CVTNIP   EQU   CVTOPTA                                                  01839000
CVTDDR   EQU   CVTOPTA                                                  01840000
CVTAPR   EQU   CVTOPTA                                                  01841000
CVTCCH   EQU   CVTOPTA                                                  01842000
CVTSNCTR EQU   CVTMAP+180                                               01843000
CVTQMWR  EQU   CVTMAP+176                                               01844000
CVTQOCR  EQU   CVTMAP+172                                               01845000
CVT1EF00 EQU   CVTMAP+168                                               01846000
CVTMZ00  EQU   CVTMAP+164                                               01847000
CVTHEAD  EQU   CVTMAP+160                                               01848000
CVTRSV11 EQU   CVTMAP+156                                               01849000
CVT0PT01 EQU   CVTMAP+152                                               01850000
CVTMSER  EQU   CVTMAP+148                                               01851000
CVTRV516 EQU   CVTIERLC                                                 01852000
CVTILCH  EQU   CVTMAP+140                                               01853000
CVT0DS   EQU   CVTMAP+136                                               01854000
CVTFBOSV EQU   CVTMAP+132                                               01855000
CVTNUCB  EQU   CVTMAP+128                                               01856000
CVTIXAVL EQU   CVTMAP+124                                               01857000
CVTIOQET EQU   CVTMAP+120                                               01858000
CVTDCBA  EQU   CVTMAP+117                                               01859000
CVTMVS2  EQU   CVTDCB                                                   01860000
CVT6DAT  EQU   CVTDCB                                                   01861000
CVT4MPS  EQU   CVTDCB                                                   01862000
CVTRSV09 EQU   CVTDCB                                                   01863000
CVT4MS1  EQU   CVTDCB                                                   01864000
CVT2SPS  EQU   CVTDCB                                                   01865000
CVT1SSS  EQU   CVTDCB                                                   01866000
CVTRSV08 EQU   CVTDCB                                                   01867000
CVTSTB   EQU   CVTMAP+112                                               01868000
CVTQTD00 EQU   CVTMAP+108                                               01869000
CVTQTE00 EQU   CVTMAP+104                                               01870000
CVTCUCB  EQU   CVTMAP+100                                               01871000
CVTSJQ   EQU   CVTMAP+96                                                01872000
CVTPBLDL EQU   CVTMAP+92                                                01873000
CVTTPC   EQU   CVTMAP+88                                                01874000
CVTSVDCB EQU   CVTMAP+84                                                01875000
CVTBRET  EQU   CVTMAP+82                                                01876000
CVTEXIT  EQU   CVTMAP+80                                                01877000
CVT0FN00 EQU   CVTMAP+76                                                01878000
CVTDARA  EQU   CVTDAR+1                                                 01879000
CVTRSV07 EQU   CVTFLGS1                                                 01880000
CVTRSV06 EQU   CVTFLGS1                                                 01881000
CVTRSV05 EQU   CVTFLGS1                                                 01882000
CVTRSV04 EQU   CVTFLGS1                                                 01883000
CVTRSV03 EQU   CVTFLGS1                                                 01884000
CVTRSV02 EQU   CVTFLGS1                                                 01885000
CVTRSV01 EQU   CVTFLGS1                                                 01886000
CVTDMPLK EQU   CVTFLGS1                                                 01887000
CVTXITP  EQU   CVTMAP+68                                                01888000
CVTZDTAB EQU   CVTMAP+64                                                01889000
CVTMSLT  EQU   CVTMAP+60                                                01890000
CVTDATE  EQU   CVTMAP+56                                                01891000
CVTBTERM EQU   CVTMAP+52                                                01892000
CVTSYSAD EQU   CVTMAP+48                                                01893000
CVTXTLER EQU   CVTMAP+44                                                01894000
CVTILK2  EQU   CVTMAP+40                                                01895000
CVTILK1  EQU   CVTMAP+36                                                01896000
CVTPRLTV EQU   CVTMAP+32                                                01897000
CVTPCNVT EQU   CVTMAP+28                                                01898000
CVT0VL00 EQU   CVTMAP+24                                                01899000
CVTXAPG  EQU   CVTMAP+20                                                01900000
CVTBUF   EQU   CVTMAP+16                                                01901000
CVTJOB   EQU   CVTMAP+12                                                01902000
CVTLINK  EQU   CVTMAP+8                                                 01903000
CVT0EF00 EQU   CVTMAP+4                                                 01904000
CVTTCBP  EQU   CVTMAP                                                   01905000
LSPLEND  EQU   LSPL+16                                                  01906000
LSPLSYSL EQU   LSPLSYS+4                                                01907000
LSPLSYSF EQU   LSPLSYS                                                  01908000
LSPLNQL  EQU   LSPLNQ+4                                                 01909000
LSPLNQF  EQU   LSPLNQ                                                   01910000
GSPLEND  EQU   GSPL+16                                                  01911000
GSPLSYSL EQU   GSPLSYS+4                                                01912000
GSPLSYSF EQU   GSPLSYS                                                  01913000
GSPLNQL  EQU   GSPLNQ+4                                                 01914000
GSPLNQF  EQU   GSPLNQ                                                   01915000
SPLLSRB  EQU   SPLENTRY+4                                               01916000
SPLFSRB  EQU   SPLENTRY                                                 01917000
ASCBEND  EQU   ASCB+208                                                 01918000
ASCBSRBT EQU   ASCB+200                                                 01919000
ASCBSWTL EQU   ASCB+196                                                 01920000
ASCBRS14 EQU   ASCB+195                                                 01921000
ASCBSMCT EQU   ASCB+194                                                 01922000
ASCBRS12 EQU   ASCB+192                                                 01923000
ASCBPCTT EQU   ASCB+188                                                 01924000
ASCBVGTT EQU   ASCB+184                                                 01925000
ASCBLGCB EQU   ASCB+180                                                 01926000
ASCBJBNS EQU   ASCB+176                                                 01927000
ASCBJBNI EQU   ASCB+172                                                 01928000
ASCBMCC  EQU   ASCB+168                                                 01929000
ASCBRTWA EQU   ASCB+164                                                 01930000
ASCBIQEA EQU   ASCB+160                                                 01931000
ASCBXMPQ EQU   ASCB+156                                                 01932000
ASCBRS01 EQU   ASCB+154                                                 01933000
ASCBFMCT EQU   ASCB+152                                                 01934000
ASCBOUXB EQU   ASCB+148                                                 01935000
ASCBOUCB EQU   ASCB+144                                                 01936000
ASCBQECB EQU   ASCB+136                                                 01937000
ASCBCMSB EQU   ASCB+132                                                 01938000
ASCBCMSF EQU   ASCB+128                                                 01939000
ASCBTCBS EQU   ASCB+124                                                 01940000
ASCBNVSC EQU   ASCB+122                                                 01941000
ASCBVSC  EQU   ASCB+120                                                 01942000
ASCBSRBS EQU   ASCB+118                                                 01943000
ASCBSSRB EQU   ASCB+116                                                 01944000
ASCBRV06 EQU   ASCBFLG2                                                 01945000
ASCBRV05 EQU   ASCBFLG2                                                 01946000
ASCBRV04 EQU   ASCBFLG2                                                 01947000
ASCBSNQS EQU   ASCBFLG2                                                 01948000
ASCBS2S  EQU   ASCBFLG2                                                 01949000
ASCBCEXT EQU   ASCBFLG2                                                 01950000
ASCBPXMT EQU   ASCBFLG2                                                 01951000
ASCBXMPT EQU   ASCBFLG2                                                 01952000
ASCBRF07 EQU   ASCBDSP1                                                 01953000
ASCBRF06 EQU   ASCBDSP1                                                 01954000
ASCBRF05 EQU   ASCBDSP1                                                 01955000
ASCBRF04 EQU   ASCBDSP1                                                 01956000
ASCBRF03 EQU   ASCBDSP1                                                 01957000
ASCBRF02 EQU   ASCBDSP1                                                 01958000
ASCBFAIL EQU   ASCBDSP1                                                 01959000
ASCBNOQ  EQU   ASCBDSP1                                                 01960000
ASCBSWCT EQU   ASCB+112                                                 01961000
ASCBTMCH EQU   ASCB+104                                                 01962000
ASCBNSWP EQU   ASCBFLG1                                                 01963000
ASCBTYP1 EQU   ASCBFLG1                                                 01964000
ASCBSTND EQU   ASCBFLG1                                                 01965000
ASCBABNT EQU   ASCBFLG1                                                 01966000
ASCBTERM EQU   ASCBFLG1                                                 01967000
ASCBS3S  EQU   ASCBFLG1                                                 01968000
ASCBCMSH EQU   ASCBFLG1                                                 01969000
ASCBTOFF EQU   ASCBFLG1                                                 01970000
ASCBRF01 EQU   ASCBRCTF                                                 01971000
ASCBTMLW EQU   ASCBRCTF                                                 01972000
ASCBOUT  EQU   ASCBRCTF                                                 01973000
ASCBWAIT EQU   ASCBRCTF                                                 01974000
ASCBRV08 EQU   ASCBRCTF                                                 01975000
ASCBFQU  EQU   ASCBRCTF                                                 01976000
ASCBFRS  EQU   ASCBRCTF                                                 01977000
ASCBTMNO EQU   ASCBRCTF                                                 01978000
ASCBAFFN EQU   ASCBFW1                                                  01979000
ASCBDUMP EQU   ASCB+96                                                  01980000
ASCBQSVC EQU   ASCB+92                                                  01981000
ASCBUBET EQU   ASCB+88                                                  01982000
ASCBECB  EQU   ASCB+84                                                  01983000
ASCBJSTL EQU   ASCB+80                                                  01984000
ASCBEWST EQU   ASCB+72                                                  01985000
ASCBEJST EQU   ASCB+64                                                  01986000
ASCBTSB  EQU   ASCB+60                                                  01987000
ASCBCSCB EQU   ASCB+56                                                  01988000
ASCBRSM  EQU   ASCB+52                                                  01989000
ASCBLDA  EQU   ASCB+48                                                  01990000
ASCBSTOR EQU   ASCB+44                                                  01991000
ASCBDP   EQU   ASCB+43                                                  01992000
ASCBRV07 EQU   ASCB+42                                                  01993000
ASCBIOSM EQU   ASCB+40                                                  01994000
ASCBSEQN EQU   ASCB+38                                                  01995000
ASCBASID EQU   ASCB+36                                                  01996000
ASCBCPUS EQU   ASCB+32                                                  01997000
ASCBLSLQ EQU   ASCB+24                                                  01998000
ASCBFSLQ EQU   ASCB+20                                                  01999000
ASCBIOSP EQU   ASCB+16                                                  02000000
ASCBLOCK EQU   ASCB+12                                                  02001000
ASCBBWDP EQU   ASCB+8                                                   02002000
ASCBFWDP EQU   ASCB+4                                                   02003000
ASCBASCB EQU   ASCB                                                     02004000
ASCBEGIN EQU   ASCB                                                     02005000
ASVTEND  EQU   ASVT+528                                                 02006000
ASVTAVAL EQU   ASVTENTY                                                 02007000
ASVTRS00 EQU   ASVT+520                                                 02008000
ASVTMAXU EQU   ASVT+516                                                 02009000
ASVTASVT EQU   ASVT+512                                                 02010000
ASVTBEGN EQU   ASVT+512                                                 02011000
@NM00001 EQU   ASVT                                                     02012000
@NM00027 EQU   PSA+3668                                                 02013000
PSASTAK  EQU   PSA+3072                                                 02014000
@NM00026 EQU   PSA+1040                                                 02015000
PSAUSEND EQU   PSA+1040                                                 02016000
PSARV062 EQU   PSA+1036                                                 02017000
PSAATCVT EQU   PSA+1032                                                 02018000
PSAPCPSW EQU   PSA+1024                                                 02019000
PSAPIR2  EQU   PSA+1020                                                 02020000
PSARV059 EQU   PSA+1018                                                 02021000
PSASVC13 EQU   PSA+1016                                                 02022000
PSALSFCC EQU   PSA+1012                                                 02023000
PSASFACC EQU   PSA+1008                                                 02024000
PSASTOP  EQU   PSA+992                                                  02025000
PSASTART EQU   PSA+976                                                  02026000
PSARSPSW EQU   PSA+968                                                  02027000
PSASRPSW EQU   PSA+960                                                  02028000
PSARV045 EQU   PSA+892                                                  02029000
PSARV044 EQU   PSA+888                                                  02030000
PSARV043 EQU   PSA+884                                                  02031000
PSARV042 EQU   PSA+880                                                  02032000
PSARV041 EQU   PSA+876                                                  02033000
PSARV040 EQU   PSA+872                                                  02034000
PSARV025 EQU   PSA+868                                                  02035000
PSADSSED EQU   PSA+868                                                  02036000
PSADSSPR EQU   PSA+864                                                  02037000
PSADSSFW EQU   PSA+860                                                  02038000
PSADSS14 EQU   PSA+856                                                  02039000
PSADSSPP EQU   PSA+848                                                  02040000
PSADSSRP EQU   PSA+840                                                  02041000
PSADSS05 EQU   PSADSSF4                                                 02042000
PSADSS10 EQU   PSADSSF4                                                 02043000
PSADSSVE EQU   PSADSSF4                                                 02044000
PSADSSDE EQU   PSADSSF4                                                 02045000
PSADSSC0 EQU   PSADSSF4                                                 02046000
PSADSSIE EQU   PSADSSF4                                                 02047000
PSADSS12 EQU   PSADSSF4                                                 02048000
PSADSSRC EQU   PSADSSF4                                                 02049000
PSARV057 EQU   PSADSSF3                                                 02050000
PSARV056 EQU   PSADSSF3                                                 02051000
PSARV055 EQU   PSADSSF3                                                 02052000
PSADSSMC EQU   PSADSSF3                                                 02053000
PSADSSRW EQU   PSADSSF3                                                 02054000
PSADSSNM EQU   PSADSSF3                                                 02055000
PSADSSES EQU   PSADSSF3                                                 02056000
PSADSSGP EQU   PSADSSF3                                                 02057000
PSADSSF2 EQU   PSADSSFL+1                                               02058000
PSADSSPI EQU   PSADSSF1                                                 02059000
PSADSSOI EQU   PSADSSF1                                                 02060000
PSADSSSP EQU   PSADSSF1                                                 02061000
PSADSSTP EQU   PSADSSF1                                                 02062000
PSADSSDW EQU   PSADSSF1                                                 02063000
PSADSSDD EQU   PSADSSF1                                                 02064000
PSADSSDM EQU   PSADSSF1                                                 02065000
PSADSSMV EQU   PSADSSF1                                                 02066000
PSADSSTS EQU   PSA+816                                                  02067000
PSADSSWK EQU   PSA+812                                                  02068000
PSADSSR3 EQU   PSA+808                                                  02069000
PSADSSR2 EQU   PSA+804                                                  02070000
PSADSSRS EQU   PSA+800                                                  02071000
PSASTOR  EQU   PSA+796                                                  02072000
PSACPUSA EQU   PSA+794                                                  02073000
PSAVSTAP EQU   PSA+792                                                  02074000
PSAWKVAP EQU   PSA+788                                                  02075000
PSAWKRAP EQU   PSA+784                                                  02076000
PSAMCHIC EQU   PSA+783                                                  02077000
PSARV061 EQU   PSA+782                                                  02078000
PSASYMSK EQU   PSA+781                                                  02079000
PSAMCHFL EQU   PSA+780                                                  02080000
PSACR0   EQU   PSA+776                                                  02081000
PSAPSWSV EQU   PSA+768                                                  02082000
PSACLHS  EQU   PSAHLHI                                                  02083000
PSALKR15 EQU   PSALKSA+60                                               02084000
PSALKR14 EQU   PSALKSA+56                                               02085000
PSALKR13 EQU   PSALKSA+52                                               02086000
PSALKR12 EQU   PSALKSA+48                                               02087000
PSALKR11 EQU   PSALKSA+44                                               02088000
PSALKR10 EQU   PSALKSA+40                                               02089000
PSALKR9  EQU   PSALKSA+36                                               02090000
PSALKR8  EQU   PSALKSA+32                                               02091000
PSALKR7  EQU   PSALKSA+28                                               02092000
PSALKR6  EQU   PSALKSA+24                                               02093000
PSALKR5  EQU   PSALKSA+20                                               02094000
PSALKR4  EQU   PSALKSA+16                                               02095000
PSALKR3  EQU   PSALKSA+12                                               02096000
PSALKR2  EQU   PSALKSA+8                                                02097000
PSALKR1  EQU   PSALKSA+4                                                02098000
PSALKR0  EQU   PSALKSA                                                  02099000
PSARV023 EQU   PSACLHT+52                                               02100000
PSALOCAL EQU   PSACLHT+48                                               02101000
PSACMSL  EQU   PSACLHT+44                                               02102000
PSAOPTL  EQU   PSACLHT+40                                               02103000
PSATPACL EQU   PSACLHT+36                                               02104000
PSATPDNL EQU   PSACLHT+32                                               02105000
PSATPNCL EQU   PSACLHT+28                                               02106000
PSAIOSLL EQU   PSACLHT+24                                               02107000
PSAIOSUL EQU   PSACLHT+20                                               02108000
PSAIOSCL EQU   PSACLHT+16                                               02109000
PSAIOSSL EQU   PSACLHT+12                                               02110000
PSASALCL EQU   PSACLHT+8                                                02111000
PSAASML  EQU   PSACLHT+4                                                02112000
PSADISPL EQU   PSACLHT                                                  02113000
PSASRSA  EQU   PSA+636                                                  02114000
PSARV050 EQU   PSA+634                                                  02115000
PSADSSGO EQU   PSA+633                                                  02116000
PSARECUR EQU   PSA+632                                                  02117000
PSAHLHIS EQU   PSA+628                                                  02118000
PSAIPCSA EQU   PSA+624                                                  02119000
@NM00025 EQU   PSA+621                                                  02120000
PSAIPCDM EQU   PSA+620                                                  02121000
PSAIPCD  EQU   PSA+616                                                  02122000
@NM00024 EQU   PSA+613                                                  02123000
PSAIPCRM EQU   PSA+612                                                  02124000
PSAIPCR  EQU   PSA+608                                                  02125000
PSAMCHEX EQU   PSA+600                                                  02126000
PSAMPSW  EQU   PSA+592                                                  02127000
PSAEXPS2 EQU   PSA+584                                                  02128000
PSAEXPS1 EQU   PSA+576                                                  02129000
PSAPIREG EQU   PSA+572                                                  02130000
PSARSREG EQU   PSA+568                                                  02131000
PSAGPREG EQU   PSA+556                                                  02132000
PSARV022 EQU   PSASUP4                                                  02133000
PSARV021 EQU   PSASUP4                                                  02134000
PSARV020 EQU   PSASUP4                                                  02135000
PSARV019 EQU   PSASUP4                                                  02136000
PSARV018 EQU   PSASUP4                                                  02137000
PSARV017 EQU   PSASUP4                                                  02138000
PSARV016 EQU   PSASUP4                                                  02139000
PSARV015 EQU   PSASUP4                                                  02140000
PSARV014 EQU   PSASUP3                                                  02141000
PSARV013 EQU   PSASUP3                                                  02142000
PSARV012 EQU   PSASUP3                                                  02143000
PSARV011 EQU   PSASUP3                                                  02144000
PSARV010 EQU   PSASUP3                                                  02145000
PSAPSREG EQU   PSASUP3                                                  02146000
PSAPI2   EQU   PSASUP3                                                  02147000
PSAIOSUP EQU   PSASUP3                                                  02148000
PSALCR   EQU   PSASUP2                                                  02149000
PSARTM   EQU   PSASUP2                                                  02150000
PSAACR   EQU   PSASUP2                                                  02151000
PSAIPCE2 EQU   PSASUP2                                                  02152000
PSAIPCES EQU   PSASUP2                                                  02153000
PSAIPCEC EQU   PSASUP2                                                  02154000
PSAGTF   EQU   PSASUP2                                                  02155000
PSAIPCRI EQU   PSASUP2                                                  02156000
PSAIPCRP EQU   PSASUP1                                                  02157000
PSAIPCDR EQU   PSASUP1                                                  02158000
PSADISP  EQU   PSASUP1                                                  02159000
PSALOCK  EQU   PSASUP1                                                  02160000
PSAPI    EQU   PSASUP1                                                  02161000
PSAEXT   EQU   PSASUP1                                                  02162000
PSASVC   EQU   PSASUP1                                                  02163000
PSAIO    EQU   PSASUP1                                                  02164000
PSAANEW  EQU   PSA+544                                                  02165000
PSATOLD  EQU   PSA+540                                                  02166000
PSATNEW  EQU   PSA+536                                                  02167000
PSALCCAR EQU   PSA+532                                                  02168000
PSALCCAV EQU   PSA+528                                                  02169000
PSAPCCAR EQU   PSA+524                                                  02170000
PSAPCCAV EQU   PSA+520                                                  02171000
PSACPULA EQU   PSA+518                                                  02172000
PSACPUPA EQU   PSA+516                                                  02173000
PSAPSA   EQU   PSA+512                                                  02174000
FLCHDEND EQU   PSA+512                                                  02175000
FLCCRSAV EQU   FLCMCLA+280                                              02176000
FLCGRSAV EQU   FLCMCLA+216                                              02177000
FLCFPSAV EQU   FLCMCLA+184                                              02178000
FLCFLA   EQU   FLCMCLA+88                                               02179000
FLCRGNCD EQU   FLCMCLA+84                                               02180000
FLCFSAA  EQU   FLCFSA+1                                                 02181000
@NM00023 EQU   FLCFSA                                                   02182000
@NM00022 EQU   FLCMCLA+72                                               02183000
FLCMCIC  EQU   FLCMCLA+64                                               02184000
@NM00021 EQU   FLCMCLA+20                                               02185000
FLCIOAA  EQU   FLCIOA+1                                                 02186000
@NM00020 EQU   FLCIOA                                                   02187000
@NM00019 EQU   FLCMCLA+15                                               02188000
@NM00018 EQU   FLCMCLA+14                                               02189000
@NM00017 EQU   FLCMCLA+12                                               02190000
FLCLCL   EQU   FLCMCLA+8                                                02191000
FLCIOELA EQU   FLCIOEL+1                                                02192000
@NM00016 EQU   FLCIOEL                                                  02193000
FLCCHNID EQU   FLCMCLA                                                  02194000
@NM00015 EQU   PSA+160                                                  02195000
FLCMTRCD EQU   PSA+157                                                  02196000
@NM00014 EQU   PSA+156                                                  02197000
FLCPERA  EQU   FLCPER+1                                                 02198000
@NM00013 EQU   FLCPER                                                   02199000
@NM00012 EQU   PSA+151                                                  02200000
FLCPERCD EQU   PSA+150                                                  02201000
FLCMCNUM EQU   PSA+149                                                  02202000
@NM00011 EQU   PSA+148                                                  02203000
FLCTEAA  EQU   FLCTEA+1                                                 02204000
@NM00010 EQU   FLCTEA                                                   02205000
PSAPIPC  EQU   PSAPICOD                                                 02206000
PSAPIMC  EQU   PSAPICOD                                                 02207000
PSAPIPER EQU   PSAPICOD                                                 02208000
PSARV049 EQU   FLCPICOD                                                 02209000
FLCPILCB EQU   FLCPIILC                                                 02210000
@NM00009 EQU   FLCPIILC                                                 02211000
@NM00008 EQU   PSAEPPSW                                                 02212000
FLCSVCN  EQU   PSAESPSW+2                                               02213000
FLCSILCB EQU   FLCSVILC                                                 02214000
@NM00007 EQU   FLCSVILC                                                 02215000
@NM00006 EQU   PSAESPSW                                                 02216000
FLCEICOD EQU   PSAEEPSW+2                                               02217000
PSASPAD  EQU   PSAEEPSW                                                 02218000
@NM00005 EQU   PSA+128                                                  02219000
FLCINPSW EQU   PSA+120                                                  02220000
FLCMNPSW EQU   PSA+112                                                  02221000
FLCPNPSW EQU   PSA+104                                                  02222000
FLCSNPSW EQU   PSA+96                                                   02223000
FLCENPSW EQU   PSA+88                                                   02224000
FLCTRACE EQU   PSA+84                                                   02225000
FLCTIMER EQU   PSA+80                                                   02226000
FLCCVT2  EQU   PSA+76                                                   02227000
FLCCAW   EQU   PSA+72                                                   02228000
FLCCSW   EQU   PSA+64                                                   02229000
FLCIOPSW EQU   PSA+56                                                   02230000
FLCMOPSW EQU   PSA+48                                                   02231000
FLCPOPSW EQU   PSA+40                                                   02232000
FLCSOPSW EQU   PSA+32                                                   02233000
FLCEOPSW EQU   PSA+24                                                   02234000
@NM00004 EQU   FLCICCW2+4                                               02235000
FLCCVT   EQU   FLCICCW2                                                 02236000
FLCICCW1 EQU   FLCROPSW                                                 02237000
FLCIPPSW EQU   FLCRNPSW                                                 02238000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02239000
@ENDDATA EQU   *                                                        02240000
         END   IEAVEMDL,(C'PLS1835',0701,75245)                         02241000
