         TITLE 'IEAVTCR1 - ACR RECURSION HANDLER                       *00001000
                        '                                               00002000
IEAVTCR1 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IEAVTCR1  74.085'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  BALR  @08,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@08                                         0001 00012000
*                                      AREA IN ACRSA                 */ 00013000
*   DO;                             /* BEGIN SEGMENT 'CR1INIT'       */ 00014000
*                                                                  0098 00015000
*     /***************************************************************/ 00016000
*     /*                                                             */ 00017000
*     /* SEGMENT 'CR1INIT' INITIALIZES THE RECOVERY ROUTINE WHEN     */ 00018000
*     /* ENTERED VIA FRR ROUTING OR DIRECT RTM BRANCH                */ 00019000
*     /*                                                             */ 00020000
*     /***************************************************************/ 00021000
*                                                                  0099 00022000
*     IF PSAACR=ON THEN             /* WERE WE ENTERED VIA DIRECT  0099 00023000
*                                      BRANCH FROM RTM(SUPER BIT ON) */ 00024000
         TM    PSAACR,B'00000100'                                  0099 00025000
         BNO   @RF00099                                            0099 00026000
*       ENTTYPE=1;                  /* DIRECT BRANCH FROM RTM        */ 00027000
         LA    ENTTYPE,1                                           0100 00028000
*     ELSE                          /* FRR ROUTING                   */ 00029000
*       ENTTYPE=0;                  /* INDICATE FRR TYPE ENTRY       */ 00030000
         B     @RC00099                                            0101 00031000
@RF00099 SLR   ENTTYPE,ENTTYPE                                     0101 00032000
*     PSAACR=ON;                    /* TURN ON SUPER BIT             */ 00033000
@RC00099 OI    PSAACR,B'00000100'                                  0102 00034000
*     LCCAPTR=PSALCCAV;             /* PICK UP LCCA PTR FROM PSA     */ 00035000
         L     LCCAPTR,PSALCCAV                                    0103 00036000
*     IF LCCACRIN=ON THEN           /* DOES LCCA SHOW ACR TO BE IN 0104 00037000
*                                      PRE-PROCESSOR PHASE           */ 00038000
         TM    LCCACRIN(LCCAPTR),B'00001000'                       0104 00039000
         BNO   @RF00104                                            0104 00040000
*       RRPLPTR=LCCACPUS->WSACACR->ACRRRPLP;/* YES, PRE-PROCESSOR GET   00041000
*                                      RRPL PTR FROM CURNT CPU'S   0105 00042000
*                                      ACRSA                         */ 00043000
         L     @15,LCCACPUS(,LCCAPTR)                              0105 00044000
         L     @15,WSACACR(,@15)                                   0105 00045000
         L     RRPLPTR,ACRRRPLP(,@15)                              0105 00046000
*     ELSE                          /* NOT PRE-PROCESSOR PHASE       */ 00047000
*       RRPLPTR=LCCARCPU->LCCACPUS->WSACACR->ACRRRPLP;/* GET RRPL PTR   00048000
*                                      FROM RECOVERY CPU'S ACRSA     */ 00049000
         B     @RC00104                                            0106 00050000
@RF00104 L     @15,LCCARCPU(,LCCAPTR)                              0106 00051000
         L     @15,LCCACPUS(,@15)                                  0106 00052000
         L     @15,WSACACR(,@15)                                   0106 00053000
         L     RRPLPTR,ACRRRPLP(,@15)                              0106 00054000
*   END;                            /* END SEGMENT CR1INIT           */ 00055000
@RC00104 DS    0H                                                  0108 00056000
*   IF RRPLRTRY=ON THEN             /* WAS A RETRY IN PROGRESS WHEN     00057000
*                                      CODE TOOK THE HIT             */ 00058000
         TM    RRPLRTRY(RRPLPTR),B'10000000'                       0108 00059000
         BNO   @RF00108                                            0108 00060000
*     DO;                           /* SEGMENT CR1STERM BEGIN        */ 00061000
*                                                                  0109 00062000
*       /*************************************************************/ 00063000
*       /*                                                           */ 00064000
*       /* SEGMENT CR1STERM HANDLES THE INTERFACE TO THE SYSTEM      */ 00065000
*       /* TERMINATION FACILITY WHEN RECOVERY FOR ACR FAILURES CANNOT*/ 00066000
*       /* BE DONE. IF ENTRY WAS VIA PSAACR FLAG THEN REG0 CONTAINS  */ 00067000
*       /* THE FUNCTION CODE FROM RTM1. IF ENTRY WAS VIA FRR ROUTNIG */ 00068000
*       /* THEN REG1 POINTS TO THE RTCA.                             */ 00069000
*       /*                                                           */ 00070000
*       /*************************************************************/ 00071000
*                                                                  0110 00072000
*       RFY                                                        0110 00073000
*        (BMSGPTR) RSTD;                                           0110 00074000
*       BMSGPTR=ADDR(ACRACRSV);     /* USE AREA FOR BUILDING MSG     */ 00075000
         L     @15,LCCACPUS(,LCCAPTR)                              0111 00076000
         L     BMSGPTR,WSACACR(,@15)                               0111 00077000
         LA    BMSGPTR,ACRACRSV(,BMSGPTR)                          0111 00078000
*       BUILD857=M857W;             /* MOVE IN SKELETON OF MSG       */ 00079000
         MVC   BUILD857(43,BMSGPTR),M857W                          0112 00080000
*       B857TYPE='S';               /* SET TUPE OF ERROR TO        0113 00081000
*                                      'SOFTWARE'                    */ 00082000
         MVI   B857TYPE(BMSGPTR),C'S'                              0113 00083000
*       IF ENTTYPE=1 THEN           /* ENTERED FOR SUPER BIT         */ 00084000
         CH    ENTTYPE,@CH00066                                    0114 00085000
         BNE   @RF00114                                            0114 00086000
*         DO;                       /* YES, SUPER                    */ 00087000
*           IF REG0=RT1WMCHR THEN   /* WAS THIS MACHINE CHECK        */ 00088000
         CH    REG0,@CH00069                                       0116 00089000
         BNE   @RF00116                                            0116 00090000
*             B857TYPE='H';         /* YES, INDICATE HARDWARE FAILURE   00091000
*                                      IN MESSAGE                    */ 00092000
         MVI   B857TYPE(BMSGPTR),C'H'                              0117 00093000
*         END;                      /* END OF SUPER CHECK            */ 00094000
*       ELSE                        /* NOT SUPER BIT ENTRY           */ 00095000
*         DO;                                                      0119 00096000
         B     @RC00114                                            0119 00097000
@RF00114 DS    0H                                                  0120 00098000
*           IF SDWAMCHK=ON THEN     /* WAS THIS MACHINE CHECK        */ 00099000
         TM    SDWAMCHK(SDWAPTR),B'10000000'                       0120 00100000
         BNO   @RF00120                                            0120 00101000
*             B857TYPE='H';         /* YES, INDICATE HARDWARE FAILURE   00102000
*                                      IN MESSAGE                    */ 00103000
         MVI   B857TYPE(BMSGPTR),C'H'                              0121 00104000
*         END;                                                     0122 00105000
@RF00120 DS    0H                                                  0123 00106000
*       IF LOGPHID>='07'X&LOGPHID<='0B'X THEN/* WAS FAILURE IN     0123 00107000
*                                      POST-PROCESSING PHASE         */ 00108000
@RC00114 CLI   LOGPHID(RRPLPTR),X'07'                              0123 00109000
         BL    @RF00123                                            0123 00110000
         CLI   LOGPHID(RRPLPTR),X'0B'                              0123 00111000
         BH    @RF00123                                            0123 00112000
*         B857CODE=PPCODE;          /* SET MSG CODE FOR POST PROC.   */ 00113000
         MVI   B857CODE(BMSGPTR),C'2'                              0124 00114000
*       ELSE                        /* NOT POST-PROCESSOR PHASE      */ 00115000
*         B857CODE=NOTPCODE;        /* SET MSG CODE TO NOT POST    0125 00116000
*                                      PROCESSOR                     */ 00117000
*                                                                  0125 00118000
         B     @RC00123                                            0125 00119000
@RF00123 MVI   B857CODE(BMSGPTR),C'1'                              0125 00120000
*       /*************************************************************/ 00121000
*       /*                                                           */ 00122000
*       /* GET PHYS ADDR OF RECOVERY AND DEAD CPUS                   */ 00123000
*       /*                                                           */ 00124000
*       /*************************************************************/ 00125000
*                                                                  0126 00126000
*       IF LCCACRIN=ON THEN         /* CHECK FOR PRE-PROCESSING PHASE*/ 00127000
@RC00123 TM    LCCACRIN(LCCAPTR),B'00001000'                       0126 00128000
         BNO   @RF00126                                            0126 00129000
*         DO;                       /* YES,PRE-PROCESSOR PHASE       */ 00130000
*           RPHYSAD=PSACPUPA;       /* RECOV. CPU IS THIS CPU        */ 00131000
         L     @15,LCCACPUS(,LCCAPTR)                              0128 00132000
         L     @15,WSACACR(,@15)                                   0128 00133000
         LH    @12,PSACPUPA                                        0128 00134000
         ST    @12,RPHYSAD(,@15)                                   0128 00135000
*           DPHYSAD=PSASPAD;        /* DEAD CPU IS ONE THAT DID SIGP */ 00136000
         LH    @12,PSASPAD                                         0129 00137000
         ST    @12,DPHYSAD(,@15)                                   0129 00138000
*         END;                                                     0130 00139000
*       ELSE                        /* NOT PRE-PROCESSOR PHASE       */ 00140000
*         DO;                                                      0131 00141000
         B     @RC00126                                            0131 00142000
@RF00126 DS    0H                                                  0132 00143000
*           RPHYSAD=LCCARCPU->LCCACPUA-'40'X;/* CONVERT LOGICAL ADDR    00144000
*                                      OF RECOV. CPU TO PHYS ADDR    */ 00145000
         L     @15,LCCACPUS(,LCCAPTR)                              0132 00146000
         L     @15,WSACACR(,@15)                                   0132 00147000
         LA    @12,64                                              0132 00148000
         L     @11,LCCARCPU(,LCCAPTR)                              0132 00149000
         LH    @11,LCCACPUA(,@11)                                  0132 00150000
         SLR   @11,@12                                             0132 00151000
         ST    @11,RPHYSAD(,@15)                                   0132 00152000
*           DPHYSAD=LCCADCPU->LCCACPUA-'40'X;/* CONVERT LOGICAL ADDR    00153000
*                                      OF DEAD CPU TO PHYSICAL ADDR  */ 00154000
         L     @11,LCCADCPU(,LCCAPTR)                              0133 00155000
         LCR   @12,@12                                             0133 00156000
         AH    @12,LCCACPUA(,@11)                                  0133 00157000
         ST    @12,DPHYSAD(,@15)                                   0133 00158000
*         END;                                                     0134 00159000
*       RFY                                                        0135 00160000
*         SDWAPTR UNRSTD;           /* SDWA NOT REFERENCED FROM NOW     00161000
*                                      ON                            */ 00162000
@RC00126 DS    0H                                                  0136 00163000
*       RFY                                                        0136 00164000
*         REG1 RSTD;                /* WORK REG                      */ 00165000
*                                                                  0136 00166000
*       /*************************************************************/ 00167000
*       /*                                                           */ 00168000
*       /* CONVERT ADDRESS TO PRINTABLE DECIMAL                      */ 00169000
*       /*                                                           */ 00170000
*       /*************************************************************/ 00171000
*                                                                  0137 00172000
*       CVD(RPHYSAD,CVDDWD);        /* CONVERT TO DECIMAL            */ 00173000
         L     @15,LCCACPUS(,LCCAPTR)                              0137 00174000
         L     @15,WSACACR(,@15)                                   0137 00175000
         L     @12,RPHYSAD(,@15)                                   0137 00176000
         CVD   @12,CVDDWD(,@15)                                    0137 00177000
*       UNPK(B857RAD,CVDDWD(7:8));  /* UNPACK LAST 2 BYTES           */ 00178000
         UNPK  B857RAD(2,BMSGPTR),CVDDWD+6(2,@15)                  0138 00179000
*       B857RAD(2)=B857RAD(2)|'F0'X;/* MAKE LAST CHAR PRINTABLE      */ 00180000
         OI    B857RAD+1(BMSGPTR),X'F0'                            0139 00181000
*       CVD(DPHYSAD,CVDDWD);        /* CONVERT DEAD CPU ADDR TO DEC. */ 00182000
         L     @12,DPHYSAD(,@15)                                   0140 00183000
         CVD   @12,CVDDWD(,@15)                                    0140 00184000
*       UNPK(B857DAD,CVDDWD(7:8));  /* UNPACK LAST TWO BYTES         */ 00185000
         UNPK  B857DAD(2,BMSGPTR),CVDDWD+6(2,@15)                  0141 00186000
*       B857DAD(2)=B857DAD(2)|'F0'X;/* MAKE LAST CHAR. PRINTABLE     */ 00187000
         OI    B857DAD+1(BMSGPTR),X'F0'                            0142 00188000
*       GEN REFS(REG1,BUILD857)(LRA REG1,BUILD857(BMSGPTR));/* GET 0143 00189000
*                                      REAL ADDRESS OF MSG           */ 00190000
         LRA REG1,BUILD857(BMSGPTR)                                     00191000
*       STMSGP=REG1;                /* PUT REAL MSG ADDR INTO SYSTERM   00192000
*                                      PARM LIST                     */ 00193000
*                                                                  0144 00194000
         L     @15,LCCACPUS(,LCCAPTR)                              0144 00195000
         L     @15,WSACACR(,@15)                                   0144 00196000
         ST    REG1,STMSGP(,@15)                                   0144 00197000
*       /*************************************************************/ 00198000
*       /*                                                           */ 00199000
*       /* GET AND SET UP LRB FOR SYS TERM FACILITY                  */ 00200000
*       /*                                                           */ 00201000
*       /*************************************************************/ 00202000
*                                                                  0145 00203000
*       RFY                                                        0145 00204000
*        (LRBPTR) RSTD;                                            0145 00205000
*       LRBPTR=PCCAT00P(DPHYSAD+1)->PCCALRBV;/* GET ADDR OF LRB FOR     00206000
*                                      DEAD CPU              @YM04283*/ 00207000
*                                                                  0146 00208000
         L     @15,DPHYSAD(,@15)                                   0146 00209000
         SLA   @15,2                                               0146 00210000
         L     @12,CVTPTR                                          0146 00211000
         L     @12,CVTPCCAT(,@12)                                  0146 00212000
         L     @15,PCCAT00P(@15,@12)                               0146 00213000
         L     LRBPTR,PCCALRBV(,@15)                               0146 00214000
*       /*************************************************************/ 00215000
*       /*                                                           */ 00216000
*       /* INSERT PROPER WAIT STATE CODE INTO LRB                    */ 00217000
*       /*                                                           */ 00218000
*       /*************************************************************/ 00219000
*                                                                  0147 00220000
*       IF B857TYPE='H' THEN        /* CHECK TYPE OF FAILURE         */ 00221000
         CLI   B857TYPE(BMSGPTR),C'H'                              0147 00222000
         BNE   @RF00147                                            0147 00223000
*         LRBMWSC='00000052'X;      /* HARDWARE - SET HARDWARE WAIT     00224000
*                                      STATE CODE                    */ 00225000
         MVC   LRBMWSC(4,LRBPTR),@CB02285                          0148 00226000
*       ELSE                        /* NOT HARDWARE                  */ 00227000
*         LRBMWSC='00000051'X;      /* SET SOFTWARE WAIT STATE CODE  */ 00228000
         B     @RC00147                                            0149 00229000
@RF00147 MVC   LRBMWSC(4,LRBPTR),@CB02286                          0149 00230000
*       LRBHTYPE='81'X;             /* INDICATE SYSTEM TERMINATION 0150 00231000
*                                      RECORD TYPE           @YM04283*/ 00232000
*                                                                  0150 00233000
@RC00147 MVI   LRBHTYPE(LRBPTR),X'81'                              0150 00234000
*       /*************************************************************/ 00235000
*       /*                                                           */ 00236000
*       /* GET REAL ADDRESS OF LRB                                   */ 00237000
*       /*                                                           */ 00238000
*       /*************************************************************/ 00239000
*                                                                  0151 00240000
*       GEN REFS(REG1,LRBPTR)(LRA REG1,0(LRBPTR));                 0151 00241000
         LRA REG1,0(LRBPTR)                                             00242000
*       STLRBP=REG1;                /* PUT REAL LRB ADDR INTO SYSTEM    00243000
*                                      TERMINATION PARM              */ 00244000
*                                                                  0152 00245000
         L     @15,LCCACPUS(,LCCAPTR)                              0152 00246000
         L     @15,WSACACR(,@15)                                   0152 00247000
         ST    REG1,STLRBP(,@15)                                   0152 00248000
*       /*************************************************************/ 00249000
*       /*                                                           */ 00250000
*       /* PUT REAL ADDRESS OF PARM IN REG1 AND GO TO SYSTEM         */ 00251000
*       /* TERMINATION                                               */ 00252000
*       /*                                                           */ 00253000
*       /*************************************************************/ 00254000
*                                                                  0153 00255000
*       REG1=ADDR(STRPARM);         /* GET VIRTUAL ADDR              */ 00256000
         LA    REG1,STRPARM(,@15)                                  0153 00257000
*       GEN REFS(REG1)(LRA REG1,0(REG1));                          0154 00258000
         LRA REG1,0(REG1)                                               00259000
*       LPSW(TRMPSW);               /* GO TO SYSTEM TERMINATION      */ 00260000
         LPSW  TRMPSW                                              0155 00261000
*     END;                          /* END SEGMENT CR1STERM          */ 00262000
*   RRPLRTRY=ON;                    /* NO, INDICATE RETRY MODE     0157 00263000
*                                      ENTERED                       */ 00264000
*                                                                  0157 00265000
@RF00108 OI    RRPLRTRY(RRPLPTR),B'10000000'                       0157 00266000
*   /*****************************************************************/ 00267000
*   /*                                                               */ 00268000
*   /* FIND INDEX TO ACTION TABLE THAT CORRESPONDS TO THE PROPER     */ 00269000
*   /* LOGICAL PHASE ID                                              */ 00270000
*   /*                                                               */ 00271000
*   /*****************************************************************/ 00272000
*                                                                  0158 00273000
*   DO ACTINDEX=1 TO 20 WHILE(LOGPHID^=ACTPHID(ACTINDEX));         0158 00274000
         LA    ACTINDEX,1                                          0158 00275000
@DL00158 LR    @15,ACTINDEX                                        0158 00276000
         MH    @15,@CH00071                                        0158 00277000
         LA    @12,ACTPHID-3(@15)                                  0158 00278000
         CLC   LOGPHID(1,RRPLPTR),0(@12)                           0158 00279000
         BE    @DC00158                                            0158 00280000
*   END;                                                           0159 00281000
*                                                                  0159 00282000
         AH    ACTINDEX,@CH00066                                   0159 00283000
         CH    ACTINDEX,@CH01793                                   0159 00284000
         BNH   @DL00158                                            0159 00285000
@DC00158 DS    0H                                                  0160 00286000
*   /*****************************************************************/ 00287000
*   /*                                                               */ 00288000
*   /* PERFORM ACTION INDICATED IN ACTION TABLE(ACTION 0 IS A NO     */ 00289000
*   /* OPERATION ACTION                                              */ 00290000
*   /*                                                               */ 00291000
*   /*****************************************************************/ 00292000
*                                                                  0160 00293000
*   IF ACTACT(ACTINDEX)=1 THEN      /* ACTION 1 - RESET RTM INDICATOR*/ 00294000
         LR    @15,ACTINDEX                                        0160 00295000
         MH    @15,@CH00071                                        0160 00296000
         SLR   @12,@12                                             0160 00297000
         IC    @12,ACTACT-3(@15)                                   0160 00298000
         CH    @12,@CH00066                                        0160 00299000
         BNE   @RF00160                                            0160 00300000
*     DO;                                                          0161 00301000
*       LCCARCPU->LCCACRTM=OFF;     /* RESET RTM FLAG IN RECOV CPU 0162 00302000
*                                      LCCA                          */ 00303000
         L     @15,LCCARCPU(,LCCAPTR)                              0162 00304000
         NI    LCCACRTM(@15),B'01111111'                           0162 00305000
*       LCCADCPU->LCCACRTM=OFF;     /* RESET RTM FLAG IN DEAD CPU  0163 00306000
*                                      LCCA                          */ 00307000
         L     @15,LCCADCPU(,LCCAPTR)                              0163 00308000
         NI    LCCACRTM(@15),B'01111111'                           0163 00309000
*     END;                                                         0164 00310000
*   DO;                             /* BEGIN SEGMENT CR1EXIT         */ 00311000
*                                                                  0165 00312000
@RF00160 DS    0H                                                  0166 00313000
*     /***************************************************************/ 00314000
*     /*                                                             */ 00315000
*     /* SEGMENT CR1EXIT PERFORMS THE RETRY FROM THE RECOVERY        */ 00316000
*     /* ROUTINE. THE METHOD OF RETRYING DEPENDS ON THE WAY IN WHICH */ 00317000
*     /* THE RECOVERY ROUTINE WAS ENTERED. IF ENTRY WAS FROM FRR     */ 00318000
*     /* ROUTING THEN SETRP IS USED. IF ENTRY WAS DIRECT BRANCH      */ 00319000
*     /* BECAUSE SUPER BIT WAS ON, THEN REGS ARE RESTORED AND RETRY  */ 00320000
*     /* POINT IS BRANCHED TO                                        */ 00321000
*     /*                                                             */ 00322000
*     /***************************************************************/ 00323000
*                                                                  0166 00324000
*     IF ENTTYPE=0 THEN             /* ENTRY VIA FRR ROUTING         */ 00325000
         LTR   ENTTYPE,ENTTYPE                                     0166 00326000
         BNZ   @RF00166                                            0166 00327000
*       DO;                         /* ISSUE SETRP FOR RETRY         */ 00328000
*         SDWASRSV=RRPLREGS;        /* MOVE REGS SAVED BY MAINLINE 0168 00329000
*                                      ACR INTO THE SDWA FOR RETRY   */ 00330000
         MVI   SDWASRSV+60(SDWAPTR),C' '                           0168 00331000
         MVC   SDWASRSV+61(3,SDWAPTR),SDWASRSV+60(SDWAPTR)         0168 00332000
         MVC   SDWASRSV(60,SDWAPTR),RRPLREGS(RRPLPTR)              0168 00333000
*         SDWARECP=MODULEID;        /* STORE MODULE,CSECT,FRR IDS IN    00334000
*                                      SDWA                  @YM08145*/ 00335000
         MVC   SDWARECP(24,SDWAPTR),MODULEID                       0169 00336000
*         SDWAURAL='01'X;           /* SET LENGTH OF VAR. DATA     0170 00337000
*                                                            @YM08145*/ 00338000
         MVI   SDWAURAL(SDWAPTR),X'01'                             0170 00339000
*         SDWAHEX=ON;               /* INDICATE TO EREP THAT DATA IS    00340000
*                                      HEX FORMAT            @YM08145*/ 00341000
         OI    SDWAHEX(SDWAPTR),B'10000000'                        0171 00342000
*         SDWAVRA(1:1)=LOGPHID;     /* MOVE IN LOGPHID FOR RECORD  0172 00343000
*                                                            @YM08145*/ 00344000
         MVC   SDWAVRA(1,SDWAPTR),LOGPHID(RRPLPTR)                 0172 00345000
*         DO;                       /* SETRP RC(4) RETADDR(EVAL(RETRY   00346000
*                                      PTS(ACTRETRY(ACTINDEX)))->ALAB   00347000
*                                      EL) RETREGS(YES)              */ 00348000
*           RESPECIFY                                              0174 00349000
*            (GPR00P,                                              0174 00350000
*             GPR01P,                                              0174 00351000
*             GPR14P,                                              0174 00352000
*             GPR15P) RSTD;                                        0174 00353000
*           GPR01P->SDWARCDE=4;     /* STORE RC INTO SDWA            */ 00354000
         MVI   SDWARCDE(GPR01P),X'04'                              0175 00355000
*           GPR01P->SDWARTYA=ADDR(EVAL(RETRYPTS(ACTRETRY(ACTINDEX)))->  00356000
*               ALABEL);            /* SAVE RETRY ADDRESS            */ 00357000
         LR    @12,ACTINDEX                                        0176 00358000
         MH    @12,@CH00071                                        0176 00359000
         SLR   @02,@02                                             0176 00360000
         IC    @02,ACTRETRY-3(@12)                                 0176 00361000
         SLA   @02,2                                               0176 00362000
         L     @12,RETRYPTS-4(@02)                                 0176 00363000
         ST    @12,SDWARTYA(,GPR01P)                               0176 00364000
*           GPR01P->SDWAUPRG='1'B;  /* TURN ON RETREGS INDICATOR     */ 00365000
         OI    SDWAUPRG(GPR01P),B'00001000'                        0177 00366000
*           RESPECIFY                                              0178 00367000
*            (GPR00P,                                              0178 00368000
*             GPR01P,                                              0178 00369000
*             GPR14P,                                              0178 00370000
*             GPR15P) UNRSTD;                                      0178 00371000
*         END;                                                     0179 00372000
*         PSAACR=OFF;               /* TURN OFF SUPER BIT            */ 00373000
         NI    PSAACR,B'11111011'                                  0180 00374000
*         GOTO REG14;               /* RETURN TO RTM FRR ROUTING     */ 00375000
         BR    REG14                                               0181 00376000
*       END;                                                       0182 00377000
*     ELSE                          /* ENTRY WAS VIA SUPER BIT     0183 00378000
*                                      ROUTING                       */ 00379000
*       DO;                                                        0183 00380000
@RF00166 DS    0H                                                  0184 00381000
*         RFY                                                      0184 00382000
*           REG15 RSTD;                                            0184 00383000
*         REG15=RETRYPTS(ACTRETRY(ACTINDEX));/* SET REG 15 TO POINT     00384000
*                                      TO RETRY ADDRESS              */ 00385000
         LR    @12,ACTINDEX                                        0185 00386000
         MH    @12,@CH00071                                        0185 00387000
         SLR   @02,@02                                             0185 00388000
         IC    @02,ACTRETRY-3(@12)                                 0185 00389000
         SLA   @02,2                                               0185 00390000
         L     REG15,RETRYPTS-4(@02)                               0185 00391000
*         GEN REFS(RRPLREGS)(LM 0,14,RRPLREGS(RRPLPTR));/* RELOAD  0186 00392000
*                                      REGS                          */ 00393000
         LM 0,14,RRPLREGS(RRPLPTR)                                      00394000
*         GOTO REG15;               /* GO TO RETRY ADDRESS           */ 00395000
         BR    REG15                                               0187 00396000
*         RFY                                                      0188 00397000
*           REG15 UNRSTD;                                          0188 00398000
*       END;                                                       0189 00399000
*   END;                            /* END OF SEGMENT CR1EXIT        */ 00400000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 00401000
*     GPR00P PTR(31) REG(0),                                       0191 00402000
*     GPR01P PTR(31) REG(1),                                       0191 00403000
*     GPR14P PTR(31) REG(14),                                      0191 00404000
*     GPR15P PTR(31) REG(15);                                      0191 00405000
*   DECLARE                         /* COMMON VARIABLES              */ 00406000
*     I256C CHAR(256) BASED,                                       0192 00407000
*     I031F FIXED(31) BASED,                                       0192 00408000
*     I031P PTR(31) BASED,                                         0192 00409000
*     I015F FIXED(15) BASED,                                       0192 00410000
*     I015P PTR(15) BASED,                                         0192 00411000
*     I008P PTR(8) BASED,                                          0192 00412000
*     I001C CHAR(1) BASED;                                         0192 00413000
*   END                                                            0193 00414000
*                                                                  0193 00415000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00416000
*/*%INCLUDE SYSLIB  (CR1SPEC )                                       */ 00417000
*/*%INCLUDE SYSLIB  (CR1DCL  )                                       */ 00418000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00419000
*/*%INCLUDE SYSLIB  (IHALCCA )                                       */ 00420000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00421000
*/*%INCLUDE SYSLIB  (IHALRB  )                                       */ 00422000
*/*%INCLUDE SYSLIB  (IHAWSAVT)                                       */ 00423000
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */ 00424000
*/*%INCLUDE SYSLIB  (IHART1W )                                       */ 00425000
*/*%INCLUDE SYSLIB  (IHAPCCAT)                                       */ 00426000
*/*%INCLUDE SYSLIB  (IHAPCCA )                                       */ 00427000
*/*%INCLUDE SYSLIB  (CR1INIT )                                       */ 00428000
*/*%INCLUDE SYSLIB  (CR1STERM)                                       */ 00429000
*/*%INCLUDE SYSLIB  (CR1EXIT )                                       */ 00430000
*                                                                  0193 00431000
*       ;                                                          0193 00432000
@DATA    DS    0H                                                       00433000
@CH00066 DC    H'1'                                                     00434000
@CH00071 DC    H'3'                                                     00435000
@CH00069 DC    H'5'                                                     00436000
@CH01793 DC    H'20'                                                    00437000
@DATD    DSECT                                                          00438000
         DS    0F                                                       00439000
IEAVTCR1 CSECT                                                          00440000
         DS    0F                                                       00441000
@DATD    DSECT                                                          00442000
         DS    0D                                                       00443000
@ENDDATD EQU   *                                                        00444000
IEAVTCR1 CSECT                                                          00445000
         NOPR  ((@ENDDATD-@DATD)*16)                                    00446000
         DS    0F                                                       00447000
@SIZDATD DC    AL1(0)                                                   00448000
         DC    AL3(@ENDDATD-@DATD)                                      00449000
@CV02065 DC    V(IGFPTERM)                                              00450000
@CV02066 DC    V(RSTRT0A)                                               00451000
@CV02067 DC    V(RSTRT0B)                                               00452000
@CV02068 DC    V(RSTRT04)                                               00453000
@CV02069 DC    V(RSTRT05)                                               00454000
@CV02070 DC    V(RSTRT06)                                               00455000
@CV02071 DC    V(RSTRT07)                                               00456000
@CV02072 DC    V(RSTRT08)                                               00457000
@CV02073 DC    V(RSTRT09)                                               00458000
@CV02074 DC    V(RSTRT00)                                               00459000
@CV02075 DC    V(RSTRTX0)                                               00460000
@CV02076 DC    V(RSTRTX1)                                               00461000
         DS    0D                                                       00462000
@CB02285 DC    X'00000052'                                              00463000
@CB02286 DC    X'00000051'                                              00464000
TRMPSW   DS    CL8                                                      00465000
         ORG   TRMPSW                                                   00466000
TRMIMSK  DC    X'00'                                                    00467000
TRMKYMWP DC    X'0C'                                                    00468000
TRMCCPMK DC    X'00'                                                    00469000
@NM00107 DC    X'00'                                                    00470000
TRMPSWIC DC    VL4(IGFPTERM)                                            00471000
         ORG   TRMPSW+8                                                 00472000
M857W    DS    CL43                                                     00473000
         ORG   M857W                                                    00474000
M857W01  DC    H'39'                                                    00475000
M857W02  DC    B'1000000000000000'                                      00476000
M857W03  DC    CL35'IEA857W UNREC X ACR ERR-X-R=XX D=XX'                00477000
M857W04  DC    B'1000000000000000'                                      00478000
M857W05  DC    B'1000000000000000'                                      00479000
         ORG   M857W+43                                                 00480000
MODULEID DC    CL24'IEAVTACRIEAVTACRIEAVTCR1'                           00481000
ACTIONS  DC    X'000001'                                                00482000
         ORG   ACTIONS+0                                                00483000
ACTPHID  DS    CL1                                                      00484000
ACTACT   DS    AL1                                                      00485000
ACTRETRY DS    AL1                                                      00486000
         ORG   ACTIONS+3                                                00487000
         DC    X'010001'                                                00488000
         ORG   ACTIONS+6                                                00489000
         DC    X'020101'                                                00490000
         ORG   ACTIONS+9                                                00491000
         DC    X'030001'                                                00492000
         ORG   ACTIONS+12                                               00493000
         DC    X'040001'                                                00494000
         ORG   ACTIONS+15                                               00495000
         DC    X'050003'                                                00496000
         ORG   ACTIONS+18                                               00497000
         DC    X'060004'                                                00498000
         ORG   ACTIONS+21                                               00499000
         DC    X'070005'                                                00500000
         ORG   ACTIONS+24                                               00501000
         DC    X'080006'                                                00502000
         ORG   ACTIONS+27                                               00503000
         DC    X'090007'                                                00504000
         ORG   ACTIONS+30                                               00505000
         DC    X'0A0008'                                                00506000
         ORG   ACTIONS+33                                               00507000
         DC    X'0B0009'                                                00508000
         ORG   ACTIONS+36                                               00509000
         DC    X'10000A'                                                00510000
         ORG   ACTIONS+39                                               00511000
         DC    X'11000B'                                                00512000
         ORG   ACTIONS+42                                               00513000
         DC    X'20000A'                                                00514000
         ORG   ACTIONS+45                                               00515000
         DC    X'21000B'                                                00516000
         ORG   ACTIONS+48                                               00517000
         DC    X'30000A'                                                00518000
         ORG   ACTIONS+51                                               00519000
         DC    X'31000B'                                                00520000
         ORG   ACTIONS+54                                               00521000
         DC    X'40000A'                                                00522000
         ORG   ACTIONS+57                                               00523000
         DC    X'41000B'                                                00524000
         ORG   ACTIONS+60                                               00525000
         DS    CL1                                                      00526000
RETRYPTS DC    VL4(RSTRT00)                                             00527000
         DC    VL4(RSTRT04)                                             00528000
         DC    VL4(RSTRT05)                                             00529000
         DC    VL4(RSTRT06)                                             00530000
         DC    VL4(RSTRT07)                                             00531000
         DC    VL4(RSTRT08)                                             00532000
         DC    VL4(RSTRT09)                                             00533000
         DC    VL4(RSTRT0A)                                             00534000
         DC    VL4(RSTRT0B)                                             00535000
         DC    VL4(RSTRTX0)                                             00536000
         DC    VL4(RSTRTX1)                                             00537000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00538000
@01      EQU   01                                                       00539000
@02      EQU   02                                                       00540000
@03      EQU   03                                                       00541000
@04      EQU   04                                                       00542000
@05      EQU   05                                                       00543000
@06      EQU   06                                                       00544000
@07      EQU   07                                                       00545000
@08      EQU   08                                                       00546000
@09      EQU   09                                                       00547000
@10      EQU   10                                                       00548000
@11      EQU   11                                                       00549000
@12      EQU   12                                                       00550000
@13      EQU   13                                                       00551000
@14      EQU   14                                                       00552000
@15      EQU   15                                                       00553000
LCCAPTR  EQU   @06                                                      00554000
LRBPTR   EQU   @03                                                      00555000
SDWAPTR  EQU   @01                                                      00556000
BMSGPTR  EQU   @04                                                      00557000
REG0     EQU   @00                                                      00558000
REG1     EQU   @01                                                      00559000
ACTINDEX EQU   @09                                                      00560000
ENTTYPE  EQU   @07                                                      00561000
RRPLPTR  EQU   @05                                                      00562000
REG14    EQU   @14                                                      00563000
REG15    EQU   @15                                                      00564000
GPR00P   EQU   @00                                                      00565000
GPR01P   EQU   @01                                                      00566000
GPR14P   EQU   @14                                                      00567000
GPR15P   EQU   @15                                                      00568000
PSA      EQU   0                                                        00569000
FLCRNPSW EQU   PSA                                                      00570000
FLCROPSW EQU   PSA+8                                                    00571000
FLCICCW2 EQU   PSA+16                                                   00572000
FLCCVT   EQU   FLCICCW2                                                 00573000
FLCEOPSW EQU   PSA+24                                                   00574000
FLCENPSW EQU   PSA+88                                                   00575000
PSAEEPSW EQU   PSA+132                                                  00576000
PSASPAD  EQU   PSAEEPSW                                                 00577000
PSAESPSW EQU   PSA+136                                                  00578000
FLCSVILC EQU   PSAESPSW+1                                               00579000
PSAEPPSW EQU   PSA+140                                                  00580000
FLCPIILC EQU   PSAEPPSW+1                                               00581000
FLCPICOD EQU   PSAEPPSW+2                                               00582000
PSAPICOD EQU   FLCPICOD+1                                               00583000
FLCTEA   EQU   PSAEPPSW+4                                               00584000
FLCPER   EQU   PSA+152                                                  00585000
FLCMTRCD EQU   PSA+157                                                  00586000
FLCMCLA  EQU   PSA+168                                                  00587000
FLCIOEL  EQU   FLCMCLA+4                                                00588000
FLCIOA   EQU   FLCMCLA+16                                               00589000
FLCFSA   EQU   FLCMCLA+80                                               00590000
PSAPSA   EQU   PSA+512                                                  00591000
PSACPUPA EQU   PSA+516                                                  00592000
PSAPCCAV EQU   PSA+520                                                  00593000
PSALCCAV EQU   PSA+528                                                  00594000
PSASUPER EQU   PSA+552                                                  00595000
PSASUP1  EQU   PSASUPER                                                 00596000
PSASUP2  EQU   PSASUPER+1                                               00597000
PSAACR   EQU   PSASUP2                                                  00598000
PSASUP3  EQU   PSASUPER+2                                               00599000
PSASUP4  EQU   PSASUPER+3                                               00600000
PSACLHT  EQU   PSA+640                                                  00601000
PSALKSA  EQU   PSA+696                                                  00602000
PSAHLHI  EQU   PSA+760                                                  00603000
PSADSSFL EQU   PSA+836                                                  00604000
PSADSSF1 EQU   PSADSSFL                                                 00605000
PSADSSF3 EQU   PSADSSFL+2                                               00606000
PSADSSF4 EQU   PSADSSFL+3                                               00607000
PSARSVT  EQU   PSA+896                                                  00608000
PSAUSEND EQU   PSA+1032                                                 00609000
LCCA     EQU   0                                                        00610000
LCCACPUA EQU   LCCA+4                                                   00611000
LCCAIHRC EQU   LCCA+520                                                 00612000
LCCAIHR1 EQU   LCCAIHRC                                                 00613000
LCCAIHR2 EQU   LCCAIHRC+1                                               00614000
LCCAIHR3 EQU   LCCAIHRC+2                                               00615000
LCCAIHR4 EQU   LCCAIHRC+3                                               00616000
LCCASPIN EQU   LCCA+524                                                 00617000
LCCASPN1 EQU   LCCASPIN                                                 00618000
LCCASPN2 EQU   LCCASPIN+1                                               00619000
LCCASPN3 EQU   LCCASPIN+2                                               00620000
LCCASPN4 EQU   LCCASPIN+3                                               00621000
LCCACPUS EQU   LCCA+536                                                 00622000
LCCADSF1 EQU   LCCA+540                                                 00623000
LCCADSF2 EQU   LCCA+541                                                 00624000
LCCASPSA EQU   LCCA+544                                                 00625000
LCCADCPU EQU   LCCA+676                                                 00626000
LCCARCPU EQU   LCCA+680                                                 00627000
LCCACRFL EQU   LCCA+692                                                 00628000
LCCACRTM EQU   LCCACRFL                                                 00629000
LCCACREX EQU   LCCA+693                                                 00630000
LCCACRIN EQU   LCCACREX                                                 00631000
LCCALKFG EQU   LCCA+694                                                 00632000
LCCASRBF EQU   LCCA+720                                                 00633000
CVTMAP   EQU   0                                                        00634000
CVTBTERM EQU   CVTMAP+52                                                00635000
CVTDAR   EQU   CVTMAP+72                                                00636000
CVTFLGS1 EQU   CVTDAR                                                   00637000
CVTDCB   EQU   CVTMAP+116                                               00638000
CVTIERLC EQU   CVTMAP+144                                               00639000
CVTOPTA  EQU   CVTMAP+182                                               00640000
CVTOPTB  EQU   CVTMAP+183                                               00641000
CVTGTF   EQU   CVTMAP+236                                               00642000
CVTGTFST EQU   CVTGTF                                                   00643000
CVTGTFS  EQU   CVTGTFST                                                 00644000
CVTSTATE EQU   CVTGTFST                                                 00645000
CVTTMODE EQU   CVTGTFST                                                 00646000
CVTFORM  EQU   CVTGTFST                                                 00647000
CVTUSR   EQU   CVTGTFST                                                 00648000
CVTAQAVT EQU   CVTMAP+240                                               00649000
CVTTCMFG EQU   CVTAQAVT                                                 00650000
CVTVOLM2 EQU   CVTMAP+244                                               00651000
CVTTATA  EQU   CVTVOLM2                                                 00652000
CVTTSKS  EQU   CVTTATA                                                  00653000
CVTVOLF2 EQU   CVTTSKS                                                  00654000
CVTTAT   EQU   CVTTATA+1                                                00655000
CVTATER  EQU   CVTMAP+248                                               00656000
CVTEXT1  EQU   CVTMAP+252                                               00657000
CVTPURG  EQU   CVTMAP+260                                               00658000
CVTQMSG  EQU   CVTMAP+268                                               00659000
CVTDMSR  EQU   CVTMAP+272                                               00660000
CVTERPV  EQU   CVTMAP+316                                               00661000
CVTINTLA EQU   CVTMAP+320                                               00662000
CVTAPF   EQU   CVTMAP+324                                               00663000
CVTEXT2  EQU   CVTMAP+328                                               00664000
CVTHJES  EQU   CVTMAP+332                                               00665000
CVTPGSIA EQU   CVTMAP+348                                               00666000
CVTA1F1  EQU   CVTMAP+356                                               00667000
CVTSYSK  EQU   CVTMAP+357                                               00668000
CVTVOLM1 EQU   CVTMAP+380                                               00669000
CVTVOLF1 EQU   CVTVOLM1                                                 00670000
CVTATMCT EQU   CVTMAP+388                                               00671000
CVTXTNT1 EQU   0                                                        00672000
CVTXTNT2 EQU   0                                                        00673000
CVTDSSV  EQU   CVTXTNT2                                                 00674000
CVTRSV90 EQU   CVTXTNT2+5                                               00675000
CVTQID   EQU   CVTXTNT2+24                                              00676000
CVTRV400 EQU   CVTXTNT2+52                                              00677000
CVTRV409 EQU   CVTXTNT2+53                                              00678000
CVTATCVT EQU   CVTXTNT2+64                                              00679000
CVTRV429 EQU   CVTXTNT2+84                                              00680000
CVTRV438 EQU   CVTXTNT2+85                                              00681000
CVTRV457 EQU   CVTXTNT2+112                                             00682000
CVTRV466 EQU   CVTXTNT2+113                                             00683000
CVTFIX   EQU   0                                                        00684000
CVTRELNO EQU   CVTFIX+252                                               00685000
LRB      EQU   0                                                        00686000
LRBHTYPE EQU   LRB                                                      00687000
LRBHREL  EQU   LRB+1                                                    00688000
LRBHSYS  EQU   LRBHREL                                                  00689000
LRBHSW0  EQU   LRB+2                                                    00690000
LRBHSW1  EQU   LRB+3                                                    00691000
LRBHSW2  EQU   LRB+4                                                    00692000
LRBMACT  EQU   LRBHSW2                                                  00693000
LRBHSW3  EQU   LRB+5                                                    00694000
LRBHCPID EQU   LRB+16                                                   00695000
LRBBASE  EQU   LRB+24                                                   00696000
LRBCVAR  EQU   0                                                        00697000
LRBCMP   EQU   LRBCVAR+8                                                00698000
WSAG     EQU   0                                                        00699000
WSAC     EQU   0                                                        00700000
WSACACR  EQU   WSAC+16                                                  00701000
SDWA     EQU   0                                                        00702000
SDWAFIOB EQU   SDWA+4                                                   00703000
SDWAABCC EQU   SDWAFIOB                                                 00704000
SDWACMPF EQU   SDWAABCC                                                 00705000
SDWACTL1 EQU   SDWA+8                                                   00706000
SDWACMKA EQU   SDWACTL1                                                 00707000
SDWAMWPA EQU   SDWACTL1+1                                               00708000
SDWAPMKA EQU   SDWACTL1+4                                               00709000
SDWACTL2 EQU   SDWA+16                                                  00710000
SDWACMKP EQU   SDWACTL2                                                 00711000
SDWAMWPP EQU   SDWACTL2+1                                               00712000
SDWAPMKP EQU   SDWACTL2+4                                               00713000
SDWAGRSV EQU   SDWA+24                                                  00714000
SDWANAME EQU   SDWA+88                                                  00715000
SDWAEC1  EQU   SDWA+104                                                 00716000
SDWAEMK1 EQU   SDWAEC1                                                  00717000
SDWAMWP1 EQU   SDWAEC1+1                                                00718000
SDWAINT1 EQU   SDWAEC1+2                                                00719000
SDWANXT1 EQU   SDWAEC1+4                                                00720000
SDWAAEC1 EQU   SDWA+112                                                 00721000
SDWAILC1 EQU   SDWAAEC1+1                                               00722000
SDWAINC1 EQU   SDWAAEC1+2                                               00723000
SDWAICD1 EQU   SDWAINC1+1                                               00724000
SDWAEC2  EQU   SDWA+120                                                 00725000
SDWAEMK2 EQU   SDWAEC2                                                  00726000
SDWAMWP2 EQU   SDWAEC2+1                                                00727000
SDWAINT2 EQU   SDWAEC2+2                                                00728000
SDWANXT2 EQU   SDWAEC2+4                                                00729000
SDWAAEC2 EQU   SDWA+128                                                 00730000
SDWAILC2 EQU   SDWAAEC2+1                                               00731000
SDWAINC2 EQU   SDWAAEC2+2                                               00732000
SDWAICD2 EQU   SDWAINC2+1                                               00733000
SDWASRSV EQU   SDWA+136                                                 00734000
SDWAIDNT EQU   SDWA+200                                                 00735000
SDWAMCH  EQU   SDWA+204                                                 00736000
SDWASTCK EQU   SDWAMCH                                                  00737000
SDWAMCHI EQU   SDWAMCH+8                                                00738000
SDWAMCHS EQU   SDWAMCHI                                                 00739000
SDWAMCHD EQU   SDWAMCHI+1                                               00740000
SDWARSR1 EQU   SDWAMCH+12                                               00741000
SDWARSR2 EQU   SDWAMCH+13                                               00742000
SDWAFLGS EQU   SDWA+232                                                 00743000
SDWAERRA EQU   SDWAFLGS                                                 00744000
SDWAMCHK EQU   SDWAERRA                                                 00745000
SDWAERRB EQU   SDWAFLGS+1                                               00746000
SDWAERRC EQU   SDWAFLGS+2                                               00747000
SDWAERRD EQU   SDWAFLGS+3                                               00748000
SDWAIOFS EQU   SDWA+238                                                 00749000
SDWARTYA EQU   SDWA+240                                                 00750000
SDWACPUA EQU   SDWA+248                                                 00751000
SDWAPARQ EQU   SDWA+252                                                 00752000
SDWARCDE EQU   SDWAPARQ                                                 00753000
SDWAACF2 EQU   SDWAPARQ+1                                               00754000
SDWAUPRG EQU   SDWAACF2                                                 00755000
SDWAACF3 EQU   SDWAPARQ+2                                               00756000
SDWAACF4 EQU   SDWAPARQ+3                                               00757000
SDWALKWA EQU   SDWA+256                                                 00758000
SDWALKWS EQU   SDWALKWA                                                 00759000
SDWARECP EQU   SDWA+292                                                 00760000
SDWASNPA EQU   SDWA+320                                                 00761000
SDWADUMP EQU   SDWASNPA                                                 00762000
SDWADPFS EQU   SDWADUMP+1                                               00763000
SDWADDAT EQU   SDWASNPA+4                                               00764000
SDWASDAT EQU   SDWADDAT                                                 00765000
SDWAPDAT EQU   SDWADDAT+2                                               00766000
SDWADPSA EQU   SDWA+328                                                 00767000
SDWADPSL EQU   SDWADPSA                                                 00768000
SDWARA   EQU   SDWA+400                                                 00769000
SDWADPVA EQU   SDWARA+2                                                 00770000
SDWAHEX  EQU   SDWADPVA                                                 00771000
SDWAURAL EQU   SDWARA+3                                                 00772000
SDWAVRA  EQU   SDWARA+4                                                 00773000
RTMBRTAB EQU   0                                                        00774000
RTMBTERM EQU   RTMBRTAB                                                 00775000
PCCAVT   EQU   0                                                        00776000
PCCAT00P EQU   PCCAVT                                                   00777000
PCCA     EQU   0                                                        00778000
PCCATMST EQU   PCCA+128                                                 00779000
PCCATMFL EQU   PCCATMST                                                 00780000
PCCATODE EQU   PCCATMST+1                                               00781000
PCCACCE  EQU   PCCATMST+2                                               00782000
PCCAINTE EQU   PCCATMST+3                                               00783000
PCCAEMSB EQU   PCCA+136                                                 00784000
PCCAEMSI EQU   PCCAEMSB                                                 00785000
PCCARISP EQU   PCCAEMSI                                                 00786000
PCCAEMS2 EQU   PCCAEMSI+1                                               00787000
PCCAEMS3 EQU   PCCAEMSI+2                                               00788000
PCCARMSB EQU   PCCAEMSI+3                                               00789000
PCCALRBV EQU   PCCA+160                                                 00790000
PCCAWERP EQU   PCCA+280                                                 00791000
PCCACHPF EQU   PCCAWERP+4                                               00792000
PCCACHBL EQU   PCCAWERP+5                                               00793000
PCCACHVA EQU   PCCAWERP+6                                               00794000
PCCACHTS EQU   PCCAWERP+7                                               00795000
PCCACHS1 EQU   PCCA+288                                                 00796000
PCCACHS2 EQU   PCCA+289                                                 00797000
PCCACHRB EQU   PCCA+290                                                 00798000
PCCACHF1 EQU   PCCA+308                                                 00799000
PCCACHF2 EQU   PCCA+309                                                 00800000
PCCACHF3 EQU   PCCA+310                                                 00801000
PCCACHF4 EQU   PCCA+311                                                 00802000
PCCAPTR  EQU   0                                                        00803000
ALABEL   EQU   0                                                        00804000
BUILD857 EQU   0                                                        00805000
B857TYPE EQU   BUILD857+18                                              00806000
B857CODE EQU   BUILD857+28                                              00807000
B857RAD  EQU   BUILD857+32                                              00808000
B857DAD  EQU   BUILD857+37                                              00809000
RRPL     EQU   0                                                        00810000
LOGPHID  EQU   RRPL                                                     00811000
RRPLFLGS EQU   RRPL+1                                                   00812000
RRPLRTRY EQU   RRPLFLGS                                                 00813000
RRPLCNTS EQU   RRPL+2                                                   00814000
RRPLREGS EQU   RRPL+4                                                   00815000
ACRSA    EQU   0                                                        00816000
ACRSVBSE EQU   ACRSA                                                    00817000
ACRLMFSV EQU   ACRSVBSE                                                 00818000
ACRLMGSV EQU   ACRSVBSE+32                                              00819000
ACRMCHEB EQU   ACRSVBSE+96                                              00820000
ACRRRPLP EQU   ACRMCHEB                                                 00821000
ACRACRSV EQU   ACRSVBSE+104                                             00822000
ACRACRWA EQU   ACRSVBSE+248                                             00823000
ACRFLCSV EQU   ACRSVBSE+272                                             00824000
ACROPSW  EQU   ACRFLCSV+8                                               00825000
ACREPSWS EQU   ACRFLCSV+72                                              00826000
ACRCPIDS EQU   ACRSA+376                                                00827000
I001C    EQU   0                                                        00828000
I008P    EQU   0                                                        00829000
I015F    EQU   0                                                        00830000
I015P    EQU   0                                                        00831000
I031F    EQU   0                                                        00832000
I031P    EQU   0                                                        00833000
I256C    EQU   0                                                        00834000
PSARSVTE EQU   PSARSVT                                                  00835000
CVTPTR   EQU   FLCCVT                                                   00836000
CVTS01   EQU   CVTPGSIA                                                 00837000
CVTLPDIA EQU   CVTS01+12                                                00838000
CVTDIRST EQU   CVTLPDIA                                                 00839000
CVTSLIDA EQU   CVTS01+24                                                00840000
CVTCTLFG EQU   CVTS01+50                                                00841000
CVTSPSA  EQU   CVTS01+336                                               00842000
CVTPCCAT EQU   CVTS01+416                                               00843000
CVTRV210 EQU   CVTS01+424                                               00844000
CVTRV219 EQU   CVTS01+425                                               00845000
CVTRV228 EQU   CVTS01+426                                               00846000
CVTRV237 EQU   CVTS01+427                                               00847000
CVTMFRTR EQU   CVTS01+452                                               00848000
CVTRV262 EQU   CVTS01+468                                               00849000
CVTRV271 EQU   CVTS01+469                                               00850000
CVTRV280 EQU   CVTS01+470                                               00851000
CVTRV289 EQU   CVTS01+471                                               00852000
CVTGSDA  EQU   CVTS01+600                                               00853000
LRBHRSW1 EQU   LRBHSW1                                                  00854000
LRBHCSW1 EQU   LRBHSW1                                                  00855000
LRBHMSW1 EQU   LRBHSW1                                                  00856000
LRBMMCH  EQU   LRBBASE                                                  00857000
LRBMWSC  EQU   LRBMMCH+4                                                00858000
LRBMCEIA EQU   LRBMMCH+8                                                00859000
LRBMTERM EQU   LRBMCEIA                                                 00860000
LRBMHARD EQU   LRBMCEIA+1                                               00861000
LRBMINTM EQU   LRBMCEIA+2                                               00862000
LRBMSOFT EQU   LRBMCEIA+3                                               00863000
LRBMPDAR EQU   LRBMMCH+12                                               00864000
LRBMRSR1 EQU   LRBMMCH+13                                               00865000
LRBMRSR2 EQU   LRBMMCH+14                                               00866000
LRBMFLO  EQU   LRBMMCH+24                                               00867000
LRBMCIC  EQU   LRBMFLO                                                  00868000
@NM00044 EQU   LRBMCIC                                                  00869000
@NM00046 EQU   LRBMCIC+1                                                00870000
@NM00048 EQU   LRBMCIC+2                                                00871000
@NM00050 EQU   LRBMCIC+3                                                00872000
@NM00053 EQU   LRBMCIC+5                                                00873000
LRBRDDR  EQU   LRBBASE                                                  00874000
LRBCCCH  EQU   LRBBASE                                                  00875000
LRBCCUA  EQU   LRBCCCH+49                                               00876000
LRBDMDR  EQU   LRBBASE                                                  00877000
LRBNMIH  EQU   LRBBASE                                                  00878000
LRBTTER  EQU   LRBBASE                                                  00879000
TEMPWORK EQU   ACRACRWA                                                 00880000
CVDDWD   EQU   TEMPWORK                                                 00881000
STRPARM  EQU   TEMPWORK+8                                               00882000
STMSGP   EQU   STRPARM                                                  00883000
STLRBP   EQU   STRPARM+4                                                00884000
RPHYSAD  EQU   TEMPWORK+16                                              00885000
DPHYSAD  EQU   TEMPWORK+20                                              00886000
ACRCPUPA EQU   PSACPUPA                                                 00887000
ACRLCCAV EQU   PSALCCAV                                                 00888000
ACRPCCAV EQU   PSAPCCAV                                                 00889000
ACRPSA   EQU   PSAPSA                                                   00890000
ACRPSEND EQU   PSAUSEND                                                 00891000
AECEND   EQU   FLCMTRCD+3                                               00892000
AECSTRT  EQU   PSAEEPSW                                                 00893000
APSWEND  EQU   FLCENPSW                                                 00894000
APSWSTRT EQU   FLCEOPSW                                                 00895000
FLC      EQU   PSA                                                      00896000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00897000
LRBTUSR  EQU   LRBTTER+8                                                00898000
LRBTWSC  EQU   LRBTTER+4                                                00899000
LRBTLNH  EQU   LRBTTER                                                  00900000
LRBNINT  EQU   LRBNMIH+24                                               00901000
LRBNDEVT EQU   LRBNMIH+20                                               00902000
LRBNVOL  EQU   LRBNMIH+14                                               00903000
LRBNCUA1 EQU   LRBNMIH+11                                               00904000
LRBNCUA2 EQU   LRBNMIH+8                                                00905000
LRBNJOB  EQU   LRBNMIH                                                  00906000
LRBDSENS EQU   LRBDMDR+8                                                00907000
LRBDVOL  EQU   LRBDMDR+2                                                00908000
LRBDCUA1 EQU   LRBDMDR                                                  00909000
LRBCCLOG EQU   LRBCCCH+56                                               00910000
LRBCLOGL EQU   LRBCCCH+54                                               00911000
LRBCHCUA EQU   LRBCCCH+52                                               00912000
LRBCCUA2 EQU   LRBCCUA+1                                                00913000
@NM00057 EQU   LRBCCUA                                                  00914000
LRBCCHID EQU   LRBCCCH+48                                               00915000
LRBCDEVT EQU   LRBCCCH+44                                               00916000
LRBCECSW EQU   LRBCCCH+40                                               00917000
LRBCFCSW EQU   LRBCCCH+32                                               00918000
LRBCFCCW EQU   LRBCCCH+24                                               00919000
LRBCAIO  EQU   LRBCCCH+8                                                00920000
LRBCJOB  EQU   LRBCCCH                                                  00921000
LRBRDEV2 EQU   LRBRDDR+32                                               00922000
LRBRCUA2 EQU   LRBRDDR+29                                               00923000
LRBRPH2  EQU   LRBRDDR+28                                               00924000
LRBRDEV1 EQU   LRBRDDR+24                                               00925000
LRBRCUA1 EQU   LRBRDDR+21                                               00926000
LRBRPH1  EQU   LRBRDDR+20                                               00927000
LRBRVOL2 EQU   LRBRDDR+14                                               00928000
LRBRVOL1 EQU   LRBRDDR+8                                                00929000
LRBRJOB  EQU   LRBRDDR                                                  00930000
LRBMCEL  EQU   LRBMMCH+304                                              00931000
@NM00056 EQU   LRBMFLO+20                                               00932000
LRBMFSA  EQU   LRBMFLO+16                                               00933000
@NM00055 EQU   LRBMFLO+8                                                00934000
LRBMCELL EQU   LRBMCIC+6                                                00935000
LRBMVCC  EQU   @NM00053                                                 00936000
LRBMVPT  EQU   @NM00053                                                 00937000
@NM00054 EQU   @NM00053                                                 00938000
@NM00052 EQU   LRBMCIC+4                                                00939000
LRBMVST  EQU   @NM00050                                                 00940000
LRBMVLG  EQU   @NM00050                                                 00941000
LRBMVCR  EQU   @NM00050                                                 00942000
LRBMVGR  EQU   @NM00050                                                 00943000
LRBMVFP  EQU   @NM00050                                                 00944000
@NM00051 EQU   @NM00050                                                 00945000
LRBMVRC  EQU   @NM00050                                                 00946000
LRBMVFA  EQU   @NM00050                                                 00947000
LRBMVIA  EQU   @NM00048                                                 00948000
LRBMVPM  EQU   @NM00048                                                 00949000
LRBMVMS  EQU   @NM00048                                                 00950000
LRBMVWP  EQU   @NM00048                                                 00951000
@NM00049 EQU   @NM00048                                                 00952000
LRBMFKE  EQU   @NM00048                                                 00953000
LRBMFSC  EQU   @NM00048                                                 00954000
LRBMFSE  EQU   @NM00048                                                 00955000
LRBMIDY  EQU   @NM00046                                                 00956000
LRBMIBU  EQU   @NM00046                                                 00957000
@NM00047 EQU   @NM00046                                                 00958000
LRBMFWN  EQU   @NM00046                                                 00959000
LRBMFDG  EQU   @NM00044                                                 00960000
@NM00045 EQU   @NM00044                                                 00961000
LRBMFED  EQU   @NM00044                                                 00962000
LRBMFCD  EQU   @NM00044                                                 00963000
LRBMFTD  EQU   @NM00044                                                 00964000
LRBMFSR  EQU   @NM00044                                                 00965000
LRBMFPD  EQU   @NM00044                                                 00966000
LRBMFSD  EQU   @NM00044                                                 00967000
LRBMMOSW EQU   LRBMMCH+16                                               00968000
LRBMPWL  EQU   LRBMMCH+15                                               00969000
LRBMVEQR EQU   LRBMRSR2                                                 00970000
LRBMPGFX EQU   LRBMRSR2                                                 00971000
LRBMLSQA EQU   LRBMRSR2                                                 00972000
LRBMFSQA EQU   LRBMRSR2                                                 00973000
LRBMNUCL EQU   LRBMRSR2                                                 00974000
LRBMSPER EQU   LRBMRSR2                                                 00975000
LRBMINTC EQU   LRBMRSR2                                                 00976000
LRBMOFLN EQU   LRBMRSR2                                                 00977000
LRBMCHNG EQU   LRBMRSR1                                                 00978000
LRBMSER  EQU   LRBMRSR1                                                 00979000
@NM00043 EQU   LRBMRSR1                                                 00980000
@NM00042 EQU   LRBMPDAR                                                 00981000
LRBMRSRF EQU   LRBMPDAR                                                 00982000
LRBMRSRC EQU   LRBMPDAR                                                 00983000
LRBMINVP EQU   LRBMPDAR                                                 00984000
@NM00041 EQU   LRBMPDAR                                                 00985000
LRBMSBUF EQU   LRBMSOFT                                                 00986000
LRBMSHIR EQU   LRBMSOFT                                                 00987000
LRBMSECC EQU   LRBMSOFT                                                 00988000
LRBMSEXD EQU   LRBMSOFT                                                 00989000
@NM00040 EQU   LRBMSOFT                                                 00990000
LRBMSSFT EQU   LRBMSOFT                                                 00991000
LRBMIL80 EQU   LRBMINTM                                                 00992000
LRBMICTM EQU   LRBMINTM                                                 00993000
LRBMICKC EQU   LRBMINTM                                                 00994000
LRBMITOD EQU   LRBMINTM                                                 00995000
@NM00039 EQU   LRBMINTM                                                 00996000
LRBMHIPD EQU   LRBMHARD                                                 00997000
LRBMHSPF EQU   LRBMHARD                                                 00998000
LRBMHSTO EQU   LRBMHARD                                                 00999000
LRBMHINV EQU   LRBMHARD                                                 01000000
@NM00038 EQU   LRBMHARD                                                 01001000
LRBMHHRD EQU   LRBMHARD                                                 01002000
LRBMTINV EQU   LRBMTERM                                                 01003000
LRBMTDMG EQU   LRBMTERM                                                 01004000
LRBMTWRN EQU   LRBMTERM                                                 01005000
LRBMTCKS EQU   LRBMTERM                                                 01006000
LRBMTSEC EQU   LRBMTERM                                                 01007000
@NM00037 EQU   LRBMTERM                                                 01008000
LRBMLNH  EQU   LRBMMCH                                                  01009000
@NM00036 EQU   LRBHMSW1                                                 01010000
LRBMSYST EQU   LRBHMSW1                                                 01011000
@NM00035 EQU   LRBHMSW1                                                 01012000
@NM00034 EQU   LRBHCSW1                                                 01013000
LRBCERPP EQU   LRBHCSW1                                                 01014000
LRBCDATA EQU   LRBHCSW1                                                 01015000
LRBCICUA EQU   LRBHCSW1                                                 01016000
LRBCNOSP EQU   LRBHCSW1                                                 01017000
@NM00033 EQU   LRBHCSW1                                                 01018000
LRBCINCO EQU   LRBHCSW1                                                 01019000
LRBCMESG EQU   LRBHCSW1                                                 01020000
@NM00032 EQU   LRBHRSW1                                                 01021000
LRBRSYSI EQU   LRBHRSW1                                                 01022000
LRBROPER EQU   LRBHRSW1                                                 01023000
LRBRSEC  EQU   LRBHRSW1                                                 01024000
LRBRPRIM EQU   LRBHRSW1                                                 01025000
CVTTPIO  EQU   CVTS01+608                                               01026000
CVTADV   EQU   CVTS01+604                                               01027000
CVTGSDAB EQU   CVTGSDA                                                  01028000
CVTQV3   EQU   CVTS01+596                                               01029000
CVTQV2   EQU   CVTS01+592                                               01030000
CVTQV1   EQU   CVTS01+588                                               01031000
CVTRPT   EQU   CVTS01+584                                               01032000
CVTSSRB  EQU   CVTS01+580                                               01033000
CVTCSDRL EQU   CVTS01+576                                               01034000
CVTEXP1  EQU   CVTS01+572                                               01035000
CVTRMPMT EQU   CVTS01+568                                               01036000
CVTRMPTT EQU   CVTS01+564                                               01037000
CVTVPSA  EQU   CVTS01+560                                               01038000
CVTVSTOP EQU   CVTS01+556                                               01039000
CVTGTFR8 EQU   CVTS01+552                                               01040000
CVTQUIT  EQU   CVTS01+548                                               01041000
CVTVACR  EQU   CVTS01+544                                               01042000
CVTWTCB  EQU   CVTS01+540                                               01043000
CVTSTPRS EQU   CVTS01+536                                               01044000
CVT0PT02 EQU   CVTS01+532                                               01045000
CVTDARCM EQU   CVTS01+528                                               01046000
CVTIRECM EQU   CVTS01+524                                               01047000
CVTJRECM EQU   CVTS01+520                                               01048000
CVTVEMS0 EQU   CVTS01+516                                               01049000
CVTSPFRR EQU   CVTS01+512                                               01050000
CVTRLSTG EQU   CVTS01+508                                               01051000
CVT0TC0A EQU   CVTS01+504                                               01052000
CVTGMBR  EQU   CVTS01+500                                               01053000
CVTLFRM  EQU   CVTS01+496                                               01054000
CVTRMBR  EQU   CVTS01+492                                               01055000
CVTVIOP  EQU   CVTS01+488                                               01056000
CVTRV307 EQU   CVTS01+486                                               01057000
CVTRV306 EQU   CVTS01+484                                               01058000
CVTRV305 EQU   CVTS01+482                                               01059000
CVTRV304 EQU   CVTS01+480                                               01060000
CVTRV303 EQU   CVTS01+478                                               01061000
CVTRV302 EQU   CVTS01+476                                               01062000
CVTRV301 EQU   CVTS01+475                                               01063000
CVTRV300 EQU   CVTS01+474                                               01064000
CVTRV299 EQU   CVTS01+473                                               01065000
CVTRV298 EQU   CVTS01+472                                               01066000
CVTRV297 EQU   CVTRV289                                                 01067000
CVTRV296 EQU   CVTRV289                                                 01068000
CVTRV295 EQU   CVTRV289                                                 01069000
CVTRV294 EQU   CVTRV289                                                 01070000
CVTRV293 EQU   CVTRV289                                                 01071000
CVTRV292 EQU   CVTRV289                                                 01072000
CVTRV291 EQU   CVTRV289                                                 01073000
CVTRV290 EQU   CVTRV289                                                 01074000
CVTRV288 EQU   CVTRV280                                                 01075000
CVTRV287 EQU   CVTRV280                                                 01076000
CVTRV286 EQU   CVTRV280                                                 01077000
CVTRV285 EQU   CVTRV280                                                 01078000
CVTRV284 EQU   CVTRV280                                                 01079000
CVTRV283 EQU   CVTRV280                                                 01080000
CVTRV282 EQU   CVTRV280                                                 01081000
CVTRV281 EQU   CVTRV280                                                 01082000
CVTRV279 EQU   CVTRV271                                                 01083000
CVTRV278 EQU   CVTRV271                                                 01084000
CVTRV277 EQU   CVTRV271                                                 01085000
CVTRV276 EQU   CVTRV271                                                 01086000
CVTRV275 EQU   CVTRV271                                                 01087000
CVTRV274 EQU   CVTRV271                                                 01088000
CVTRV273 EQU   CVTRV271                                                 01089000
CVTRV272 EQU   CVTRV271                                                 01090000
CVTRV270 EQU   CVTRV262                                                 01091000
CVTRV269 EQU   CVTRV262                                                 01092000
CVTRV268 EQU   CVTRV262                                                 01093000
CVTRV267 EQU   CVTRV262                                                 01094000
CVTRV266 EQU   CVTRV262                                                 01095000
CVTRV265 EQU   CVTRV262                                                 01096000
CVTRV264 EQU   CVTRV262                                                 01097000
CVTRV263 EQU   CVTRV262                                                 01098000
CVTVFP   EQU   CVTS01+464                                               01099000
CVTVSI   EQU   CVTS01+460                                               01100000
CVTVPSIB EQU   CVTS01+456                                               01101000
CVTMFACT EQU   CVTMFRTR                                                 01102000
CVTMFCTL EQU   CVTS01+448                                               01103000
CVTPVBP  EQU   CVTS01+444                                               01104000
CVTPWI   EQU   CVTS01+440                                               01105000
CVTRV254 EQU   CVTS01+438                                               01106000
CVTRV253 EQU   CVTS01+436                                               01107000
CVTRV252 EQU   CVTS01+434                                               01108000
CVTRV251 EQU   CVTS01+433                                               01109000
CVTRV250 EQU   CVTS01+432                                               01110000
CVTRV249 EQU   CVTS01+431                                               01111000
CVTRV248 EQU   CVTS01+430                                               01112000
CVTRV247 EQU   CVTS01+429                                               01113000
CVTRV246 EQU   CVTS01+428                                               01114000
CVTRV245 EQU   CVTRV237                                                 01115000
CVTRV244 EQU   CVTRV237                                                 01116000
CVTRV243 EQU   CVTRV237                                                 01117000
CVTRV242 EQU   CVTRV237                                                 01118000
CVTRV241 EQU   CVTRV237                                                 01119000
CVTRV240 EQU   CVTRV237                                                 01120000
CVTRV239 EQU   CVTRV237                                                 01121000
CVTRV238 EQU   CVTRV237                                                 01122000
CVTRV236 EQU   CVTRV228                                                 01123000
CVTRV235 EQU   CVTRV228                                                 01124000
CVTRV234 EQU   CVTRV228                                                 01125000
CVTRV233 EQU   CVTRV228                                                 01126000
CVTRV232 EQU   CVTRV228                                                 01127000
CVTRV231 EQU   CVTRV228                                                 01128000
CVTRV230 EQU   CVTRV228                                                 01129000
CVTRV229 EQU   CVTRV228                                                 01130000
CVTRV227 EQU   CVTRV219                                                 01131000
CVTRV226 EQU   CVTRV219                                                 01132000
CVTRV225 EQU   CVTRV219                                                 01133000
CVTRV224 EQU   CVTRV219                                                 01134000
CVTRV223 EQU   CVTRV219                                                 01135000
CVTRV222 EQU   CVTRV219                                                 01136000
CVTRV221 EQU   CVTRV219                                                 01137000
CVTRV220 EQU   CVTRV219                                                 01138000
CVTRV218 EQU   CVTRV210                                                 01139000
CVTRV217 EQU   CVTRV210                                                 01140000
CVTRV216 EQU   CVTRV210                                                 01141000
CVTRV215 EQU   CVTRV210                                                 01142000
CVTRV214 EQU   CVTRV210                                                 01143000
CVTRV213 EQU   CVTRV210                                                 01144000
CVTRV212 EQU   CVTRV210                                                 01145000
CVTRV211 EQU   CVTRV210                                                 01146000
CVTLCCAT EQU   CVTS01+420                                               01147000
CVTIPCRP EQU   CVTS01+412                                               01148000
CVTIPCRI EQU   CVTS01+408                                               01149000
CVTIPCDS EQU   CVTS01+404                                               01150000
CVTAIDVT EQU   CVTS01+400                                               01151000
CVTSSAP  EQU   CVTS01+396                                               01152000
CVTEHCIR EQU   CVTS01+392                                               01153000
CVTEHDEF EQU   CVTS01+388                                               01154000
CVTDAIR  EQU   CVTS01+384                                               01155000
CVTPERFM EQU   CVTS01+380                                               01156000
CVT044R2 EQU   CVTS01+376                                               01157000
CVTFETCH EQU   CVTS01+372                                               01158000
CVTRSTWD EQU   CVTS01+368                                               01159000
CVTSPOST EQU   CVTS01+364                                               01160000
CVTIOBP  EQU   CVTS01+360                                               01161000
CVTASMVT EQU   CVTS01+356                                               01162000
CVTRECRQ EQU   CVTS01+352                                               01163000
CVTWSAC  EQU   CVTS01+348                                               01164000
CVTRV149 EQU   CVTS01+344                                               01165000
CVTWSAL  EQU   CVTS01+340                                               01166000
CVTGLMN  EQU   CVTS01+332                                               01167000
CVTVEAC0 EQU   CVTS01+328                                               01168000
CVT062R1 EQU   CVTS01+324                                               01169000
CVTRPOST EQU   CVTS01+320                                               01170000
CVTDQIQE EQU   CVTS01+316                                               01171000
CVTCSD   EQU   CVTS01+312                                               01172000
CVTLKRMA EQU   CVTS01+308                                               01173000
CVTRSPIE EQU   CVTS01+304                                               01174000
CVTRENQ  EQU   CVTS01+300                                               01175000
CVTLQCB  EQU   CVTS01+296                                               01176000
CVTFQCB  EQU   CVTS01+292                                               01177000
CVTQCS01 EQU   CVTS01+288                                               01178000
CVTAPFT  EQU   CVTS01+284                                               01179000
CVTPARRL EQU   CVTS01+280                                               01180000
CVTVWAIT EQU   CVTS01+276                                               01181000
CVTGSPL  EQU   CVTS01+272                                               01182000
CVTLSMQ  EQU   CVTS01+268                                               01183000
CVTGSMQ  EQU   CVTS01+264                                               01184000
CVTEXPRO EQU   CVTS01+260                                               01185000
CVTOPCTP EQU   CVTS01+256                                               01186000
CVTSIC   EQU   CVTS01+252                                               01187000
CVTTPIOS EQU   CVTS01+248                                               01188000
CVTRTMS  EQU   CVTS01+244                                               01189000
CVTSDBF  EQU   CVTS01+240                                               01190000
CVTSCBP  EQU   CVTS01+236                                               01191000
CVTSDMP  EQU   CVTS01+232                                               01192000
CVTSV60  EQU   CVTS01+228                                               01193000
CVTRTMCT EQU   CVTS01+224                                               01194000
CVTASCBL EQU   CVTS01+220                                               01195000
CVTASCBH EQU   CVTS01+216                                               01196000
CVTGDA   EQU   CVTS01+212                                               01197000
CVTASVT  EQU   CVTS01+208                                               01198000
CVTVVMDI EQU   CVTS01+204                                               01199000
CVTAQTOP EQU   CVTS01+200                                               01200000
CVTIOSCS EQU   CVTS01+196                                               01201000
CVTSDRM  EQU   CVTS01+192                                               01202000
CVTOPTE  EQU   CVTS01+188                                               01203000
CVTSTXU  EQU   CVTS01+184                                               01204000
CVTQUIS  EQU   CVTS01+180                                               01205000
CVTPARS  EQU   CVTS01+176                                               01206000
CVTS1EE  EQU   CVTS01+172                                               01207000
CVTFRAS  EQU   CVTS01+168                                               01208000
CVTQSAS  EQU   CVTS01+164                                               01209000
CVTCRAS  EQU   CVTS01+160                                               01210000
CVTCRMN  EQU   CVTS01+156                                               01211000
CVTDELCP EQU   CVTS01+152                                               01212000
CVTFRECL EQU   CVTS01+148                                               01213000
CVTGETCL EQU   CVTS01+144                                               01214000
CVTBLDCP EQU   CVTS01+140                                               01215000
CVTAUTHL EQU   CVTS01+136                                               01216000
CVTSCAN  EQU   CVTS01+132                                               01217000
CVTRV144 EQU   CVTS01+130                                               01218000
CVTMAXMP EQU   CVTS01+128                                               01219000
CVTSTCK  EQU   CVTS01+124                                               01220000
CVTRV139 EQU   CVTS01+123                                               01221000
CVTDSSAC EQU   CVTS01+122                                               01222000
CVTRV513 EQU   CVTS01+121                                               01223000
CVTIOSPL EQU   CVTS01+120                                               01224000
CVTPTGT  EQU   CVTS01+116                                               01225000
CVTCSPIE EQU   CVTS01+112                                               01226000
CVTSMFEX EQU   CVTS01+108                                               01227000
CVTOLT0A EQU   CVTS01+104                                               01228000
CVTSRBRT EQU   CVTS01+100                                               01229000
CVTPUTL  EQU   CVTS01+96                                                01230000
CVTRV519 EQU   CVTS01+92                                                01231000
CVTRV327 EQU   CVTS01+88                                                01232000
CVTRV326 EQU   CVTS01+84                                                01233000
CVTRV325 EQU   CVTS01+80                                                01234000
CVTRV324 EQU   CVTS01+76                                                01235000
CVT0VL01 EQU   CVTS01+72                                                01236000
CVTSHRVM EQU   CVTS01+68                                                01237000
CVTRV332 EQU   CVTS01+64                                                01238000
CVTTAS   EQU   CVTS01+60                                                01239000
CVTRSCN  EQU   CVTS01+56                                                01240000
CVTTRAC2 EQU   CVTS01+54                                                01241000
CVTTRACE EQU   CVTS01+52                                                01242000
CVTAPG   EQU   CVTS01+51                                                01243000
CVTSDTRC EQU   CVTCTLFG                                                 01244000
CVTGTRCE EQU   CVTCTLFG                                                 01245000
CVTNOMP  EQU   CVTCTLFG                                                 01246000
CVTRSV79 EQU   CVTCTLFG                                                 01247000
CVTDSTAT EQU   CVTCTLFG                                                 01248000
CVTRSV78 EQU   CVTCTLFG                                                 01249000
CVTRV333 EQU   CVTCTLFG                                                 01250000
CVTRV323 EQU   CVTCTLFG                                                 01251000
CVTSPVLK EQU   CVTS01+49                                                01252000
CVTRSV77 EQU   CVTS01+48                                                01253000
CVTRV331 EQU   CVTS01+44                                                01254000
CVTRV330 EQU   CVTS01+40                                                01255000
CVTRV329 EQU   CVTS01+36                                                01256000
CVTRV328 EQU   CVTS01+32                                                01257000
CVTRV322 EQU   CVTS01+28                                                01258000
CVTSLID  EQU   CVTSLIDA+1                                               01259000
CVTSYLK  EQU   CVTSLIDA                                                 01260000
CVTRV321 EQU   CVTS01+20                                                01261000
CVTRV320 EQU   CVTS01+16                                                01262000
CVTLPDIR EQU   CVTLPDIA+1                                               01263000
CVTRSV69 EQU   CVTDIRST                                                 01264000
CVTRSV68 EQU   CVTDIRST                                                 01265000
CVTRSV67 EQU   CVTDIRST                                                 01266000
CVTRSV66 EQU   CVTDIRST                                                 01267000
CVTRSV65 EQU   CVTDIRST                                                 01268000
CVTRSV64 EQU   CVTDIRST                                                 01269000
CVTRSV63 EQU   CVTDIRST                                                 01270000
CVTDICOM EQU   CVTDIRST                                                 01271000
CVTPVTP  EQU   CVTS01+8                                                 01272000
CVTLPDSR EQU   CVTS01+4                                                 01273000
CVTGETL  EQU   CVTS01                                                   01274000
PSARSAV  EQU   PSARSVTE+60                                              01275000
PSARSTK  EQU   PSARSVTE+56                                              01276000
PSAESAV3 EQU   PSARSVTE+52                                              01277000
PSAESTK3 EQU   PSARSVTE+48                                              01278000
PSAESAV2 EQU   PSARSVTE+44                                              01279000
PSAESTK2 EQU   PSARSVTE+40                                              01280000
PSAESAV1 EQU   PSARSVTE+36                                              01281000
PSAESTK1 EQU   PSARSVTE+32                                              01282000
PSAPSAV  EQU   PSARSVTE+28                                              01283000
PSAPSTK  EQU   PSARSVTE+24                                              01284000
PSAMSAV  EQU   PSARSVTE+20                                              01285000
PSAMSTK  EQU   PSARSVTE+16                                              01286000
PSASSAV  EQU   PSARSVTE+12                                              01287000
PSASSTK  EQU   PSARSVTE+8                                               01288000
PSANSTK  EQU   PSARSVTE+4                                               01289000
PSACSTK  EQU   PSARSVTE                                                 01290000
AWSAEND  EQU   ACRSA+380                                                01291000
ACRCPUAD EQU   ACRCPIDS+2                                               01292000
ACRCAFM  EQU   ACRCPIDS                                                 01293000
ACRMTRCD EQU   ACREPSWS+25                                              01294000
@NM00121 EQU   ACREPSWS+24                                              01295000
ACRPER   EQU   ACREPSWS+20                                              01296000
@NM00120 EQU   ACREPSWS+19                                              01297000
ACRPERCD EQU   ACREPSWS+18                                              01298000
ACRMCNUM EQU   ACREPSWS+17                                              01299000
@NM00119 EQU   ACREPSWS+16                                              01300000
ACRTEA   EQU   ACREPSWS+12                                              01301000
ACRPICOD EQU   ACREPSWS+10                                              01302000
ACRPIILC EQU   ACREPSWS+9                                               01303000
@NM00118 EQU   ACREPSWS+8                                               01304000
ACRSVCN  EQU   ACREPSWS+6                                               01305000
ACRSVILC EQU   ACREPSWS+5                                               01306000
@NM00117 EQU   ACREPSWS+4                                               01307000
ACREICOD EQU   ACREPSWS+2                                               01308000
ACRSPAD  EQU   ACREPSWS                                                 01309000
ACRTRACE EQU   ACROPSW+60                                               01310000
ACRTIMER EQU   ACROPSW+56                                               01311000
ACRCVT2  EQU   ACROPSW+52                                               01312000
ACRCAW   EQU   ACROPSW+48                                               01313000
ACRCSW   EQU   ACROPSW+40                                               01314000
ACRIOPSW EQU   ACROPSW+32                                               01315000
ACRMOPSW EQU   ACROPSW+24                                               01316000
ACRPOPSW EQU   ACROPSW+16                                               01317000
ACRSOPSW EQU   ACROPSW+8                                                01318000
ACREOPSW EQU   ACROPSW                                                  01319000
ACRRPSW  EQU   ACRFLCSV                                                 01320000
@NM00116 EQU   ACRSVBSE+244                                             01321000
ACRLMRTN EQU   ACRSVBSE+240                                             01322000
ACRRRPL  EQU   ACRSVBSE+176                                             01323000
@NM00115 EQU   ACRACRSV+68                                              01324000
ACRSVLMR EQU   ACRACRSV+64                                              01325000
ACRSVR15 EQU   ACRACRSV+60                                              01326000
ACRSVR14 EQU   ACRACRSV+56                                              01327000
ACRSVR13 EQU   ACRACRSV+52                                              01328000
ACRSVR12 EQU   ACRACRSV+48                                              01329000
ACRSVR11 EQU   ACRACRSV+44                                              01330000
ACRSVR10 EQU   ACRACRSV+40                                              01331000
ACRSVR9  EQU   ACRACRSV+36                                              01332000
ACRSVR8  EQU   ACRACRSV+32                                              01333000
ACRSVR7  EQU   ACRACRSV+28                                              01334000
ACRSVR6  EQU   ACRACRSV+24                                              01335000
ACRSVR5  EQU   ACRACRSV+20                                              01336000
ACRSVR4  EQU   ACRACRSV+16                                              01337000
ACRSVR3  EQU   ACRACRSV+12                                              01338000
ACRSVR2  EQU   ACRACRSV+8                                               01339000
ACRSVR1  EQU   ACRACRSV+4                                               01340000
ACRSVR0  EQU   ACRACRSV                                                 01341000
ACRCTRG1 EQU   ACRSVBSE+100                                             01342000
ACRGPR15 EQU   ACRLMGSV+60                                              01343000
ACRGPR14 EQU   ACRLMGSV+56                                              01344000
ACRGPR13 EQU   ACRLMGSV+52                                              01345000
ACRGPR12 EQU   ACRLMGSV+48                                              01346000
ACRGPR11 EQU   ACRLMGSV+44                                              01347000
ACRGPR10 EQU   ACRLMGSV+40                                              01348000
ACRGPR9  EQU   ACRLMGSV+36                                              01349000
ACRGPR8  EQU   ACRLMGSV+32                                              01350000
ACRGPR7  EQU   ACRLMGSV+28                                              01351000
ACRGPR6  EQU   ACRLMGSV+24                                              01352000
ACRGPR5  EQU   ACRLMGSV+20                                              01353000
ACRGPR4  EQU   ACRLMGSV+16                                              01354000
ACRGPR3  EQU   ACRLMGSV+12                                              01355000
ACRGPR2  EQU   ACRLMGSV+8                                               01356000
ACRGPR1  EQU   ACRLMGSV+4                                               01357000
ACRGPR0  EQU   ACRLMGSV                                                 01358000
ACRFLPT6 EQU   ACRLMFSV+24                                              01359000
ACRFLPT4 EQU   ACRLMFSV+16                                              01360000
ACRFLPT2 EQU   ACRLMFSV+8                                               01361000
ACRFLPT0 EQU   ACRLMFSV                                                 01362000
RRPLRRGS EQU   RRPLREGS                                                 01363000
RRPLRF   EQU   RRPLCNTS+1                                               01364000
RRPLRE   EQU   RRPLCNTS+1                                               01365000
RRPLRD   EQU   RRPLCNTS+1                                               01366000
RRPLRC   EQU   RRPLCNTS+1                                               01367000
RRPLRB   EQU   RRPLCNTS+1                                               01368000
RRPLRA   EQU   RRPLCNTS+1                                               01369000
RRPLR9   EQU   RRPLCNTS+1                                               01370000
RRPLR8   EQU   RRPLCNTS+1                                               01371000
RRPLR7   EQU   RRPLCNTS                                                 01372000
RRPLR6   EQU   RRPLCNTS                                                 01373000
RRPLR5   EQU   RRPLCNTS                                                 01374000
RRPLR4   EQU   RRPLCNTS                                                 01375000
RRPLR3   EQU   RRPLCNTS                                                 01376000
RRPLR2   EQU   RRPLCNTS                                                 01377000
RRPLR1   EQU   RRPLCNTS                                                 01378000
RRPLR0   EQU   RRPLCNTS                                                 01379000
@NM00114 EQU   RRPLFLGS                                                 01380000
RRPLCSD  EQU   RRPLFLGS                                                 01381000
RRPLOL   EQU   RRPLFLGS                                                 01382000
@NM00113 EQU   BUILD857+39                                              01383000
@NM00112 EQU   BUILD857+34                                              01384000
@NM00111 EQU   BUILD857+29                                              01385000
@NM00110 EQU   BUILD857+19                                              01386000
@NM00109 EQU   BUILD857+4                                               01387000
@NM00108 EQU   BUILD857                                                 01388000
@NM00106 EQU   PCCA+512                                                 01389000
PCCACAT  EQU   PCCA+384                                                 01390000
PCCARV36 EQU   PCCA+380                                                 01391000
PCCARV35 EQU   PCCA+378                                                 01392000
PCCARV01 EQU   PCCA+377                                                 01393000
PCCACPUM EQU   PCCA+376                                                 01394000
PCCARV63 EQU   PCCA+372                                                 01395000
PCCARV62 EQU   PCCA+368                                                 01396000
PCCARV61 EQU   PCCA+364                                                 01397000
PCCARV60 EQU   PCCA+360                                                 01398000
PCCARV59 EQU   PCCA+356                                                 01399000
PCCARV58 EQU   PCCA+352                                                 01400000
PCCARV57 EQU   PCCA+348                                                 01401000
PCCARV56 EQU   PCCA+344                                                 01402000
PCCARV55 EQU   PCCA+340                                                 01403000
PCCARV54 EQU   PCCA+336                                                 01404000
PCCALOGA EQU   PCCA+332                                                 01405000
PCCACHID EQU   PCCA+324                                                 01406000
PCCACHSV EQU   PCCA+312                                                 01407000
PCCARV79 EQU   PCCACHF4                                                 01408000
PCCARV78 EQU   PCCACHF4                                                 01409000
PCCARV77 EQU   PCCACHF4                                                 01410000
PCCARV76 EQU   PCCACHF4                                                 01411000
PCCARV75 EQU   PCCACHF4                                                 01412000
PCCARV74 EQU   PCCACHF4                                                 01413000
PCCARV73 EQU   PCCACHF4                                                 01414000
PCCARV72 EQU   PCCACHF4                                                 01415000
PCCARV71 EQU   PCCACHF3                                                 01416000
PCCARV70 EQU   PCCACHF3                                                 01417000
PCCARV69 EQU   PCCACHF3                                                 01418000
PCCARV68 EQU   PCCACHF3                                                 01419000
PCCARV67 EQU   PCCACHF3                                                 01420000
PCCARV66 EQU   PCCACHF3                                                 01421000
PCCARV65 EQU   PCCACHF3                                                 01422000
PCCARV64 EQU   PCCACHF3                                                 01423000
PCCACF28 EQU   PCCACHF2                                                 01424000
PCCACF27 EQU   PCCACHF2                                                 01425000
PCCACF26 EQU   PCCACHF2                                                 01426000
PCCACF25 EQU   PCCACHF2                                                 01427000
PCCACF24 EQU   PCCACHF2                                                 01428000
PCCACF23 EQU   PCCACHF2                                                 01429000
PCCACF22 EQU   PCCACHF2                                                 01430000
PCCACF21 EQU   PCCACHF2                                                 01431000
PCCACF18 EQU   PCCACHF1                                                 01432000
PCCACF17 EQU   PCCACHF1                                                 01433000
PCCACF16 EQU   PCCACHF1                                                 01434000
PCCACF15 EQU   PCCACHF1                                                 01435000
PCCACF14 EQU   PCCACHF1                                                 01436000
PCCACF13 EQU   PCCACHF1                                                 01437000
PCCACF12 EQU   PCCACHF1                                                 01438000
PCCACF11 EQU   PCCACHF1                                                 01439000
PCCARV05 EQU   PCCA+306                                                 01440000
PCCACHPB EQU   PCCA+305                                                 01441000
PCCALGP2 EQU   PCCA+304                                                 01442000
PCCALGP1 EQU   PCCA+303                                                 01443000
PCCALOGL EQU   PCCA+302                                                 01444000
PCCARV80 EQU   PCCA+300                                                 01445000
PCCACHW2 EQU   PCCA+296                                                 01446000
PCCACHW1 EQU   PCCA+292                                                 01447000
PCCAIOSI EQU   PCCA+291                                                 01448000
PCCACNRB EQU   PCCACHRB                                                 01449000
PCCACCVB EQU   PCCACHRB                                                 01450000
PCCACSNB EQU   PCCACHRB                                                 01451000
PCCARV52 EQU   PCCACHRB                                                 01452000
PCCACHIB EQU   PCCACHRB                                                 01453000
PCCACTIB EQU   PCCACHRB                                                 01454000
PCCACINB EQU   PCCACHRB                                                 01455000
PCCACSIB EQU   PCCACHRB                                                 01456000
PCCARV51 EQU   PCCACHS2                                                 01457000
PCCARV50 EQU   PCCACHS2                                                 01458000
PCCARV49 EQU   PCCACHS2                                                 01459000
PCCACURC EQU   PCCACHS2                                                 01460000
PCCACNLG EQU   PCCACHS2                                                 01461000
PCCACMOD EQU   PCCACHS2                                                 01462000
PCCACALT EQU   PCCACHS2                                                 01463000
PCCACIOR EQU   PCCACHS2                                                 01464000
PCCARV47 EQU   PCCACHS1                                                 01465000
PCCACUCB EQU   PCCACHS1                                                 01466000
PCCACIBC EQU   PCCACHS1                                                 01467000
PCCACAND EQU   PCCACHS1                                                 01468000
PCCACNLS EQU   PCCACHS1                                                 01469000
PCCACFRR EQU   PCCACHS1                                                 01470000
PCCACNRE EQU   PCCACHS1                                                 01471000
PCCACCMP EQU   PCCACHS1                                                 01472000
PCCACSEQ EQU   PCCACHTS                                                 01473000
PCCACDIN EQU   PCCACHTS                                                 01474000
PCCARV44 EQU   PCCACHTS                                                 01475000
PCCARV43 EQU   PCCACHTS                                                 01476000
PCCACTEC EQU   PCCACHTS                                                 01477000
PCCACDAV EQU   PCCACHVA                                                 01478000
PCCACCHV EQU   PCCACHVA                                                 01479000
PCCACCMD EQU   PCCACHVA                                                 01480000
PCCACUNS EQU   PCCACHVA                                                 01481000
PCCACSQV EQU   PCCACHVA                                                 01482000
PCCARV42 EQU   PCCACHVA                                                 01483000
PCCARV41 EQU   PCCACHVA                                                 01484000
PCCACITF EQU   PCCACHVA                                                 01485000
PCCARV40 EQU   PCCACHBL                                                 01486000
PCCARV39 EQU   PCCACHBL                                                 01487000
PCCARV38 EQU   PCCACHBL                                                 01488000
PCCACCUE EQU   PCCACHBL                                                 01489000
PCCACSTG EQU   PCCACHBL                                                 01490000
PCCACSCU EQU   PCCACHBL                                                 01491000
PCCACCHA EQU   PCCACHBL                                                 01492000
PCCACCPU EQU   PCCACHBL                                                 01493000
PCCACNOR EQU   PCCACHPF                                                 01494000
PCCACCNT EQU   PCCACHPF                                                 01495000
PCCACSNS EQU   PCCACHPF                                                 01496000
PCCARV37 EQU   PCCACHPF                                                 01497000
PCCACHIO EQU   PCCACHPF                                                 01498000
PCCACTIO EQU   PCCACHPF                                                 01499000
PCCACINT EQU   PCCACHPF                                                 01500000
PCCACSIO EQU   PCCACHPF                                                 01501000
PCCACHUB EQU   PCCAWERP                                                 01502000
PCCACHEL EQU   PCCA+168                                                 01503000
PCCALRBR EQU   PCCA+164                                                 01504000
PCCAPWAR EQU   PCCA+156                                                 01505000
PCCAPWAV EQU   PCCA+152                                                 01506000
PCCAEMSA EQU   PCCAEMSB+12                                              01507000
PCCAEMSE EQU   PCCAEMSB+8                                               01508000
PCCAEMSP EQU   PCCAEMSB+4                                               01509000
PCCARMS  EQU   PCCARMSB                                                 01510000
PCCARV34 EQU   PCCARMSB                                                 01511000
PCCARV33 EQU   PCCARMSB                                                 01512000
PCCARV32 EQU   PCCARMSB                                                 01513000
PCCARV31 EQU   PCCARMSB                                                 01514000
PCCARV30 EQU   PCCARMSB                                                 01515000
PCCARV29 EQU   PCCARMSB                                                 01516000
PCCARV28 EQU   PCCARMSB                                                 01517000
PCCARV27 EQU   PCCAEMS3                                                 01518000
PCCARV26 EQU   PCCAEMS3                                                 01519000
PCCARV25 EQU   PCCAEMS3                                                 01520000
PCCARV24 EQU   PCCAEMS3                                                 01521000
PCCARV23 EQU   PCCAEMS3                                                 01522000
PCCARV22 EQU   PCCAEMS3                                                 01523000
PCCARV21 EQU   PCCAEMS3                                                 01524000
PCCARV20 EQU   PCCAEMS3                                                 01525000
PCCARV19 EQU   PCCAEMS2                                                 01526000
PCCARV18 EQU   PCCAEMS2                                                 01527000
PCCARV17 EQU   PCCAEMS2                                                 01528000
PCCARV16 EQU   PCCAEMS2                                                 01529000
PCCARV15 EQU   PCCAEMS2                                                 01530000
PCCARV14 EQU   PCCAEMS2                                                 01531000
PCCARV13 EQU   PCCAEMS2                                                 01532000
PCCARV12 EQU   PCCAEMS2                                                 01533000
PCCARV11 EQU   PCCARISP                                                 01534000
PCCARV10 EQU   PCCARISP                                                 01535000
PCCARV09 EQU   PCCARISP                                                 01536000
PCCARV08 EQU   PCCARISP                                                 01537000
PCCARV07 EQU   PCCARISP                                                 01538000
PCCARV06 EQU   PCCARISP                                                 01539000
PCCASERL EQU   PCCARISP                                                 01540000
PCCAPARL EQU   PCCARISP                                                 01541000
PCCARPB  EQU   PCCA+132                                                 01542000
PCCACTIN EQU   PCCAINTE                                                 01543000
PCCANFIN EQU   PCCAINTE                                                 01544000
PCCANUIN EQU   PCCAINTE                                                 01545000
PCCACTCC EQU   PCCACCE                                                  01546000
PCCANFCC EQU   PCCACCE                                                  01547000
PCCANUCC EQU   PCCACCE                                                  01548000
PCCACTTD EQU   PCCATODE                                                 01549000
PCCANFTD EQU   PCCATODE                                                 01550000
PCCANUTD EQU   PCCATODE                                                 01551000
PCCARV04 EQU   PCCATMFL                                                 01552000
PCCARV03 EQU   PCCATMFL                                                 01553000
PCCARV02 EQU   PCCATMFL                                                 01554000
PCCAMINT EQU   PCCATMFL                                                 01555000
PCCAMCC  EQU   PCCATMFL                                                 01556000
PCCAVKIL EQU   PCCATMFL                                                 01557000
PCCASYNC EQU   PCCATMFL                                                 01558000
PCCAINIT EQU   PCCATMFL                                                 01559000
PCCARV9E EQU   PCCA+124                                                 01560000
PCCARV9D EQU   PCCA+120                                                 01561000
PCCARV9C EQU   PCCA+116                                                 01562000
PCCARV9B EQU   PCCA+112                                                 01563000
PCCARV9A EQU   PCCA+108                                                 01564000
PCCARV99 EQU   PCCA+104                                                 01565000
PCCARV98 EQU   PCCA+100                                                 01566000
PCCARV97 EQU   PCCA+96                                                  01567000
PCCARV96 EQU   PCCA+92                                                  01568000
PCCARV95 EQU   PCCA+88                                                  01569000
PCCARV94 EQU   PCCA+84                                                  01570000
PCCARV93 EQU   PCCA+80                                                  01571000
PCCARV92 EQU   PCCA+76                                                  01572000
PCCARV91 EQU   PCCA+72                                                  01573000
PCCARV90 EQU   PCCA+68                                                  01574000
PCCARV89 EQU   PCCA+64                                                  01575000
PCCARV88 EQU   PCCA+60                                                  01576000
PCCARV87 EQU   PCCA+56                                                  01577000
PCCARV86 EQU   PCCA+52                                                  01578000
PCCARV85 EQU   PCCA+48                                                  01579000
PCCARV84 EQU   PCCA+44                                                  01580000
PCCARV83 EQU   PCCA+40                                                  01581000
PCCARV82 EQU   PCCA+36                                                  01582000
PCCARV81 EQU   PCCA+32                                                  01583000
PCCAPSAR EQU   PCCA+28                                                  01584000
PCCAPSAV EQU   PCCA+24                                                  01585000
PCCATQEP EQU   PCCA+20                                                  01586000
PCCACAFM EQU   PCCA+18                                                  01587000
PCCACPUA EQU   PCCA+16                                                  01588000
PCCACPID EQU   PCCA+4                                                   01589000
PCCAPCCA EQU   PCCA                                                     01590000
RTMBSLIP EQU   RTMBRTAB+48                                              01591000
RTMBXABT EQU   RTMBRTAB+44                                              01592000
RTMBACR  EQU   RTMBRTAB+40                                              01593000
RTMBPROG EQU   RTMBRTAB+36                                              01594000
RTMBMEMT EQU   RTMBRTAB+32                                              01595000
RTMBCABT EQU   RTMBRTAB+28                                              01596000
RTMBPGIO EQU   RTMBRTAB+24                                              01597000
RTMBSVC  EQU   RTMBRTAB+20                                              01598000
RTMBMACH EQU   RTMBRTAB+16                                              01599000
RTMBREST EQU   RTMBRTAB+12                                              01600000
RTMBDAT  EQU   RTMBRTAB+8                                               01601000
RTMBPAD2 EQU   RTMBTERM+6                                               01602000
RTMBBRAN EQU   RTMBTERM+2                                               01603000
RTMBBALR EQU   RTMBTERM                                                 01604000
@NM00105 EQU   SDWA+512                                                 01605000
@NM00104 EQU   SDWADPVA                                                 01606000
SDWAEBC  EQU   SDWADPVA                                                 01607000
SDWAVRAL EQU   SDWARA                                                   01608000
@NM00103 EQU   SDWA+396                                                 01609000
SDWACOMP EQU   SDWA+392                                                 01610000
SDWARCPL EQU   SDWA+364                                                 01611000
@NM00102 EQU   SDWADPSA+32                                              01612000
SDWATO4  EQU   SDWADPSL+28                                              01613000
SDWAFRM4 EQU   SDWADPSL+24                                              01614000
SDWATO3  EQU   SDWADPSL+20                                              01615000
SDWAFRM3 EQU   SDWADPSL+16                                              01616000
SDWATO2  EQU   SDWADPSL+12                                              01617000
SDWAFRM2 EQU   SDWADPSL+8                                               01618000
SDWATO1  EQU   SDWADPSL+4                                               01619000
SDWAFRM1 EQU   SDWADPSL                                                 01620000
@NM00101 EQU   SDWADDAT+3                                               01621000
@NM00100 EQU   SDWAPDAT                                                 01622000
SDWAUSPL EQU   SDWAPDAT                                                 01623000
SDWADPSW EQU   SDWAPDAT                                                 01624000
SDWATJPA EQU   SDWAPDAT                                                 01625000
SDWATLPA EQU   SDWAPDAT                                                 01626000
SDWADREG EQU   SDWAPDAT                                                 01627000
SDWADSAH EQU   SDWAPDAT                                                 01628000
SDWADSAS EQU   SDWAPDAT                                                 01629000
@NM00099 EQU   SDWADDAT+1                                               01630000
@NM00098 EQU   SDWASDAT                                                 01631000
SDWAQQS  EQU   SDWASDAT                                                 01632000
SDWACBS  EQU   SDWASDAT                                                 01633000
SDWAGTF  EQU   SDWASDAT                                                 01634000
SDWASWA  EQU   SDWASDAT                                                 01635000
SDWALSQA EQU   SDWASDAT                                                 01636000
SDWASQA  EQU   SDWASDAT                                                 01637000
SDWANUC  EQU   SDWASDAT                                                 01638000
@NM00097 EQU   SDWADUMP+2                                               01639000
@NM00096 EQU   SDWADPFS                                                 01640000
SDWASLST EQU   SDWADPFS                                                 01641000
@NM00095 EQU   SDWADPFS                                                 01642000
SDWADLST EQU   SDWADPFS                                                 01643000
SDWADPT  EQU   SDWADPFS                                                 01644000
SDWADPID EQU   SDWADUMP                                                 01645000
SDWADPLA EQU   SDWA+316                                                 01646000
SDWAREXN EQU   SDWARECP+16                                              01647000
SDWACSCT EQU   SDWARECP+8                                               01648000
SDWAMODN EQU   SDWARECP                                                 01649000
@NM00094 EQU   SDWALKWA+32                                              01650000
SDWATALW EQU   SDWALKWS+28                                              01651000
SDWATDLW EQU   SDWALKWS+24                                              01652000
SDWATNLW EQU   SDWALKWS+20                                              01653000
SDWAAPLW EQU   SDWALKWS+16                                              01654000
SDWAIPLW EQU   SDWALKWS+12                                              01655000
SDWAILLW EQU   SDWALKWS+8                                               01656000
SDWAIULW EQU   SDWALKWS+4                                               01657000
SDWAICLW EQU   SDWALKWS                                                 01658000
SDWAFLLK EQU   SDWAACF4                                                 01659000
SDWACMS  EQU   SDWAACF4                                                 01660000
SDWAOPTM EQU   SDWAACF4                                                 01661000
SDWATADB EQU   SDWAACF4                                                 01662000
SDWATDNB EQU   SDWAACF4                                                 01663000
SDWATNCB EQU   SDWAACF4                                                 01664000
SDWAILCH EQU   SDWAACF4                                                 01665000
SDWAIUCB EQU   SDWAACF4                                                 01666000
SDWAICAT EQU   SDWAACF3                                                 01667000
SDWAIPRG EQU   SDWAACF3                                                 01668000
SDWASALL EQU   SDWAACF3                                                 01669000
SDWAASMP EQU   SDWAACF3                                                 01670000
SDWADISP EQU   SDWAACF3                                                 01671000
@NM00093 EQU   SDWAACF3                                                 01672000
@NM00092 EQU   SDWAACF2                                                 01673000
SDWAFREE EQU   SDWAACF2                                                 01674000
@NM00091 EQU   SDWAACF2                                                 01675000
SDWASPIN EQU   SDWAACF2                                                 01676000
@NM00090 EQU   SDWAACF2                                                 01677000
SDWARCRD EQU   SDWAACF2                                                 01678000
SDWALCPU EQU   SDWACPUA+2                                               01679000
@NM00089 EQU   SDWACPUA                                                 01680000
SDWARECA EQU   SDWA+244                                                 01681000
@NM00088 EQU   SDWA+239                                                 01682000
@NM00087 EQU   SDWAIOFS                                                 01683000
SDWANIOP EQU   SDWAIOFS                                                 01684000
SDWANOIO EQU   SDWAIOFS                                                 01685000
SDWAIOHT EQU   SDWAIOFS                                                 01686000
SDWAIOQR EQU   SDWAIOFS                                                 01687000
SDWAFMID EQU   SDWA+236                                                 01688000
@NM00086 EQU   SDWAERRD                                                 01689000
SDWAMCIV EQU   SDWAERRD                                                 01690000
SDWARPIV EQU   SDWAERRD                                                 01691000
SDWAMABD EQU   SDWAERRD                                                 01692000
SDWACTS  EQU   SDWAERRD                                                 01693000
SDWASTAE EQU   SDWAERRD                                                 01694000
SDWANRBE EQU   SDWAERRD                                                 01695000
SDWACLUP EQU   SDWAERRD                                                 01696000
@NM00085 EQU   SDWAERRC                                                 01697000
SDWAEAS  EQU   SDWAERRC                                                 01698000
SDWAPERC EQU   SDWAERRC                                                 01699000
SDWAIRB  EQU   SDWAERRC                                                 01700000
SDWASTAI EQU   SDWAERRC                                                 01701000
SDWASTAF EQU   SDWAERRC                                                 01702000
SDWASRBM EQU   SDWAERRB                                                 01703000
SDWALDIS EQU   SDWAERRB                                                 01704000
SDWAENRB EQU   SDWAERRB                                                 01705000
SDWATYP1 EQU   SDWAERRB                                                 01706000
@NM00084 EQU   SDWAERRB                                                 01707000
SDWAPGIO EQU   SDWAERRA                                                 01708000
SDWATEXC EQU   SDWAERRA                                                 01709000
SDWASVCE EQU   SDWAERRA                                                 01710000
SDWAABTM EQU   SDWAERRA                                                 01711000
SDWASVCD EQU   SDWAERRA                                                 01712000
SDWARKEY EQU   SDWAERRA                                                 01713000
SDWAPCHK EQU   SDWAERRA                                                 01714000
SDWATIME EQU   SDWAMCH+20                                               01715000
SDWARFSA EQU   SDWAMCH+16                                               01716000
@NM00083 EQU   SDWAMCH+14                                               01717000
SDWAVEQR EQU   SDWARSR2                                                 01718000
SDWAPGFX EQU   SDWARSR2                                                 01719000
SDWAFLSQ EQU   SDWARSR2                                                 01720000
SDWAFSQA EQU   SDWARSR2                                                 01721000
SDWANUCL EQU   SDWARSR2                                                 01722000
SDWASPER EQU   SDWARSR2                                                 01723000
SDWAINTC EQU   SDWARSR2                                                 01724000
SDWAOFLN EQU   SDWARSR2                                                 01725000
SDWACHNG EQU   SDWARSR1                                                 01726000
SDWAMSER EQU   SDWARSR1                                                 01727000
@NM00082 EQU   SDWARSR1                                                 01728000
SDWACPID EQU   SDWAMCH+10                                               01729000
SDWATERR EQU   SDWAMCHD                                                 01730000
SDWAFPRX EQU   SDWAMCHD                                                 01731000
SDWAINSF EQU   SDWAMCHD                                                 01732000
SDWAACR  EQU   SDWAMCHD                                                 01733000
SDWASCK  EQU   SDWAMCHD                                                 01734000
SDWAPSWU EQU   SDWAMCHD                                                 01735000
SDWAREGU EQU   SDWAMCHD                                                 01736000
SDWASKYF EQU   SDWAMCHD                                                 01737000
@NM00081 EQU   SDWAMCHS                                                 01738000
SDWARSRF EQU   SDWAMCHS                                                 01739000
SDWARSRC EQU   SDWAMCHS                                                 01740000
SDWAINVP EQU   SDWAMCHS                                                 01741000
SDWATSVL EQU   SDWAMCHS                                                 01742000
SDWARCDF EQU   SDWAMCHS                                                 01743000
SDWASRVL EQU   SDWAMCHS                                                 01744000
SDWASCKE EQU   SDWASTCK+4                                               01745000
SDWASCKB EQU   SDWASTCK                                                 01746000
SDWALNTH EQU   SDWAIDNT+1                                               01747000
SDWASPID EQU   SDWAIDNT                                                 01748000
SDWASR15 EQU   SDWASRSV+60                                              01749000
SDWASR14 EQU   SDWASRSV+56                                              01750000
SDWASR13 EQU   SDWASRSV+52                                              01751000
SDWASR12 EQU   SDWASRSV+48                                              01752000
SDWASR11 EQU   SDWASRSV+44                                              01753000
SDWASR10 EQU   SDWASRSV+40                                              01754000
SDWASR09 EQU   SDWASRSV+36                                              01755000
SDWASR08 EQU   SDWASRSV+32                                              01756000
SDWASR07 EQU   SDWASRSV+28                                              01757000
SDWASR06 EQU   SDWASRSV+24                                              01758000
SDWASR05 EQU   SDWASRSV+20                                              01759000
SDWASR04 EQU   SDWASRSV+16                                              01760000
SDWASR03 EQU   SDWASRSV+12                                              01761000
SDWASR02 EQU   SDWASRSV+8                                               01762000
SDWASR01 EQU   SDWASRSV+4                                               01763000
SDWASR00 EQU   SDWASRSV                                                 01764000
SDWATRN2 EQU   SDWAAEC2+4                                               01765000
SDWAIPC2 EQU   SDWAICD2                                                 01766000
SDWAIMC2 EQU   SDWAICD2                                                 01767000
SDWAIPR2 EQU   SDWAICD2                                                 01768000
@NM00080 EQU   SDWAINC2                                                 01769000
@NM00079 EQU   SDWAILC2                                                 01770000
SDWAIL2  EQU   SDWAILC2                                                 01771000
@NM00078 EQU   SDWAILC2                                                 01772000
@NM00077 EQU   SDWAAEC2                                                 01773000
SDWAADD2 EQU   SDWANXT2+1                                               01774000
@NM00076 EQU   SDWANXT2                                                 01775000
@NM00075 EQU   SDWAEC2+3                                                01776000
SDWASGN2 EQU   SDWAINT2                                                 01777000
SDWAEXP2 EQU   SDWAINT2                                                 01778000
SDWADEC2 EQU   SDWAINT2                                                 01779000
SDWAFPO2 EQU   SDWAINT2                                                 01780000
SDWACC2  EQU   SDWAINT2                                                 01781000
@NM00074 EQU   SDWAINT2                                                 01782000
SDWAPGM2 EQU   SDWAMWP2                                                 01783000
SDWAWAT2 EQU   SDWAMWP2                                                 01784000
SDWAMCK2 EQU   SDWAMWP2                                                 01785000
SDWAECT2 EQU   SDWAMWP2                                                 01786000
SDWAKEY2 EQU   SDWAMWP2                                                 01787000
SDWAEXT2 EQU   SDWAEMK2                                                 01788000
SDWAIO2  EQU   SDWAEMK2                                                 01789000
SDWATRM2 EQU   SDWAEMK2                                                 01790000
@NM00073 EQU   SDWAEMK2                                                 01791000
SDWAPER2 EQU   SDWAEMK2                                                 01792000
@NM00072 EQU   SDWAEMK2                                                 01793000
SDWATRAN EQU   SDWAAEC1+4                                               01794000
SDWAIPC1 EQU   SDWAICD1                                                 01795000
SDWAIMC1 EQU   SDWAICD1                                                 01796000
SDWAIPR1 EQU   SDWAICD1                                                 01797000
@NM00071 EQU   SDWAINC1                                                 01798000
@NM00070 EQU   SDWAILC1                                                 01799000
SDWAIL1  EQU   SDWAILC1                                                 01800000
@NM00069 EQU   SDWAILC1                                                 01801000
@NM00068 EQU   SDWAAEC1                                                 01802000
SDWAADD1 EQU   SDWANXT1+1                                               01803000
@NM00067 EQU   SDWANXT1                                                 01804000
@NM00066 EQU   SDWAEC1+3                                                01805000
SDWASGN1 EQU   SDWAINT1                                                 01806000
SDWAEXP1 EQU   SDWAINT1                                                 01807000
SDWADEC1 EQU   SDWAINT1                                                 01808000
SDWAFPO1 EQU   SDWAINT1                                                 01809000
SDWACC1  EQU   SDWAINT1                                                 01810000
@NM00065 EQU   SDWAINT1                                                 01811000
SDWAPGM1 EQU   SDWAMWP1                                                 01812000
SDWAWAT1 EQU   SDWAMWP1                                                 01813000
SDWAMCK1 EQU   SDWAMWP1                                                 01814000
SDWAECT1 EQU   SDWAMWP1                                                 01815000
SDWAKEY1 EQU   SDWAMWP1                                                 01816000
SDWAEXT1 EQU   SDWAEMK1                                                 01817000
SDWAIO1  EQU   SDWAEMK1                                                 01818000
SDWATRM1 EQU   SDWAEMK1                                                 01819000
@NM00064 EQU   SDWAEMK1                                                 01820000
SDWAPER1 EQU   SDWAEMK1                                                 01821000
@NM00063 EQU   SDWAEMK1                                                 01822000
SDWAIOBR EQU   SDWA+100                                                 01823000
SDWAEPA  EQU   SDWA+96                                                  01824000
@NM00062 EQU   SDWANAME+4                                               01825000
SDWARBAD EQU   SDWANAME                                                 01826000
SDWAGR15 EQU   SDWAGRSV+60                                              01827000
SDWAGR14 EQU   SDWAGRSV+56                                              01828000
SDWAGR13 EQU   SDWAGRSV+52                                              01829000
SDWAGR12 EQU   SDWAGRSV+48                                              01830000
SDWAGR11 EQU   SDWAGRSV+44                                              01831000
SDWAGR10 EQU   SDWAGRSV+40                                              01832000
SDWAGR09 EQU   SDWAGRSV+36                                              01833000
SDWAGR08 EQU   SDWAGRSV+32                                              01834000
SDWAGR07 EQU   SDWAGRSV+28                                              01835000
SDWAGR06 EQU   SDWAGRSV+24                                              01836000
SDWAGR05 EQU   SDWAGRSV+20                                              01837000
SDWAGR04 EQU   SDWAGRSV+16                                              01838000
SDWAGR03 EQU   SDWAGRSV+12                                              01839000
SDWAGR02 EQU   SDWAGRSV+8                                               01840000
SDWAGR01 EQU   SDWAGRSV+4                                               01841000
SDWAGR00 EQU   SDWAGRSV                                                 01842000
SDWANXTP EQU   SDWACTL2+5                                               01843000
SDWASGP  EQU   SDWAPMKP                                                 01844000
SDWAEUP  EQU   SDWAPMKP                                                 01845000
SDWADOP  EQU   SDWAPMKP                                                 01846000
SDWAFPP  EQU   SDWAPMKP                                                 01847000
SDWACCP  EQU   SDWAPMKP                                                 01848000
SDWAILP  EQU   SDWAPMKP                                                 01849000
SDWAINTP EQU   SDWACTL2+2                                               01850000
SDWASPVP EQU   SDWAMWPP                                                 01851000
SDWAWATP EQU   SDWAMWPP                                                 01852000
SDWAMCKP EQU   SDWAMWPP                                                 01853000
@NM00061 EQU   SDWAMWPP                                                 01854000
SDWAKEYP EQU   SDWAMWPP                                                 01855000
SDWAEXTP EQU   SDWACMKP                                                 01856000
SDWAIOP  EQU   SDWACMKP                                                 01857000
SDWANXTA EQU   SDWACTL1+5                                               01858000
SDWASGA  EQU   SDWAPMKA                                                 01859000
SDWAEUA  EQU   SDWAPMKA                                                 01860000
SDWADOA  EQU   SDWAPMKA                                                 01861000
SDWAFPA  EQU   SDWAPMKA                                                 01862000
SDWACCA  EQU   SDWAPMKA                                                 01863000
SDWAILA  EQU   SDWAPMKA                                                 01864000
SDWAINTA EQU   SDWACTL1+2                                               01865000
SDWASPVA EQU   SDWAMWPA                                                 01866000
SDWAWATA EQU   SDWAMWPA                                                 01867000
SDWAMCKA EQU   SDWAMWPA                                                 01868000
@NM00060 EQU   SDWAMWPA                                                 01869000
SDWAKEYA EQU   SDWAMWPA                                                 01870000
SDWAEXTA EQU   SDWACMKA                                                 01871000
SDWAIOA  EQU   SDWACMKA                                                 01872000
SDWACMPC EQU   SDWAABCC+1                                               01873000
@NM00059 EQU   SDWACMPF                                                 01874000
SDWASTCC EQU   SDWACMPF                                                 01875000
@NM00058 EQU   SDWACMPF                                                 01876000
SDWASTEP EQU   SDWACMPF                                                 01877000
SDWAREQ  EQU   SDWACMPF                                                 01878000
SDWAPARM EQU   SDWA                                                     01879000
WSACCCH  EQU   WSAC+52                                                  01880000
WSACRRSA EQU   WSAC+48                                                  01881000
WSACREST EQU   WSAC+44                                                  01882000
WSACRSTI EQU   WSAC+40                                                  01883000
WSACABTM EQU   WSAC+36                                                  01884000
WSACMF1  EQU   WSAC+32                                                  01885000
WSACEDS0 EQU   WSAC+28                                                  01886000
WSACIOS  EQU   WSAC+24                                                  01887000
WSACRTMK EQU   WSAC+20                                                  01888000
WSACTIME EQU   WSAC+12                                                  01889000
WSACOPTM EQU   WSAC+8                                                   01890000
WSACGTF  EQU   WSAC+4                                                   01891000
WSACCWSA EQU   WSAC                                                     01892000
WSAGSCHE EQU   WSAG+40                                                  01893000
WSAGREST EQU   WSAG+36                                                  01894000
WSAGNQDQ EQU   WSAG+32                                                  01895000
WSAGMEMT EQU   WSAG+28                                                  01896000
WSAGOPTM EQU   WSAG+24                                                  01897000
WSAGSTAT EQU   WSAG+20                                                  01898000
WSAGEMS0 EQU   WSAG+16                                                  01899000
WSAGSSRS EQU   WSAG+12                                                  01900000
WSAGRSM  EQU   WSAG+8                                                   01901000
WSAGGMFM EQU   WSAG+4                                                   01902000
WSAGPGIO EQU   WSAG                                                     01903000
LRBCMPCS EQU   LRBCMP+2                                                 01904000
LRBCMPPA EQU   LRBCMP                                                   01905000
LRBCMPNO EQU   LRBCVAR+6                                                01906000
LRBCMPF2 EQU   LRBCVAR+5                                                01907000
LRBCMPF1 EQU   LRBCVAR+4                                                01908000
LRBCRESD EQU   LRBCVAR+2                                                01909000
LRBCFT   EQU   LRBCVAR                                                  01910000
LRBHMCEL EQU   LRBHCPID+6                                               01911000
LRBHMDL  EQU   LRBHCPID+4                                               01912000
LRBHCSER EQU   LRBHCPID+1                                               01913000
@NM00031 EQU   LRBHCPID                                                 01914000
LRBHTIME EQU   LRB+12                                                   01915000
LRBHDATE EQU   LRB+8                                                    01916000
@NM00030 EQU   LRB+7                                                    01917000
LRBHCNT  EQU   LRB+6                                                    01918000
LRBMCLB  EQU   LRBHSW3                                                  01919000
LRBNDEM  EQU   LRBMACT                                                  01920000
LRBNCEM  EQU   LRBMACT                                                  01921000
@NM00029 EQU   LRBHSW0                                                  01922000
LRBHTMC  EQU   LRBHSW0                                                  01923000
@NM00028 EQU   LRBHSW0                                                  01924000
LRBHNS   EQU   LRBHSW0                                                  01925000
LRBHMORE EQU   LRBHSW0                                                  01926000
@NM00027 EQU   LRBHSYS                                                  01927000
LRBHSYSB EQU   LRBHSYS                                                  01928000
CVTLEVL  EQU   CVTRELNO+2                                               01929000
CVTNUMB  EQU   CVTRELNO                                                 01930000
CVTMDL   EQU   CVTFIX+250                                               01931000
@NM00026 EQU   CVTFIX+248                                               01932000
@NM00025 EQU   CVTFIX                                                   01933000
CVTRV482 EQU   CVTXTNT2+128                                             01934000
CVTRV481 EQU   CVTXTNT2+124                                             01935000
CVTRV480 EQU   CVTXTNT2+120                                             01936000
CVTRV479 EQU   CVTXTNT2+118                                             01937000
CVTRV478 EQU   CVTXTNT2+117                                             01938000
CVTRV477 EQU   CVTXTNT2+116                                             01939000
CVTRV476 EQU   CVTXTNT2+115                                             01940000
CVTRV475 EQU   CVTXTNT2+114                                             01941000
CVTRV474 EQU   CVTRV466                                                 01942000
CVTRV473 EQU   CVTRV466                                                 01943000
CVTRV472 EQU   CVTRV466                                                 01944000
CVTRV471 EQU   CVTRV466                                                 01945000
CVTRV470 EQU   CVTRV466                                                 01946000
CVTRV469 EQU   CVTRV466                                                 01947000
CVTRV468 EQU   CVTRV466                                                 01948000
CVTRV467 EQU   CVTRV466                                                 01949000
CVTRV465 EQU   CVTRV457                                                 01950000
CVTRV464 EQU   CVTRV457                                                 01951000
CVTRV463 EQU   CVTRV457                                                 01952000
CVTRV462 EQU   CVTRV457                                                 01953000
CVTRV461 EQU   CVTRV457                                                 01954000
CVTRV460 EQU   CVTRV457                                                 01955000
CVTRV459 EQU   CVTRV457                                                 01956000
CVTRV458 EQU   CVTRV457                                                 01957000
CVTRV456 EQU   CVTXTNT2+108                                             01958000
CVTRV455 EQU   CVTXTNT2+104                                             01959000
CVTRV454 EQU   CVTXTNT2+100                                             01960000
CVTRV453 EQU   CVTXTNT2+96                                              01961000
CVTRV452 EQU   CVTXTNT2+94                                              01962000
CVTRV451 EQU   CVTXTNT2+92                                              01963000
CVTRV450 EQU   CVTXTNT2+90                                              01964000
CVTRV449 EQU   CVTXTNT2+88                                              01965000
CVTRV448 EQU   CVTXTNT2+87                                              01966000
CVTRV447 EQU   CVTXTNT2+86                                              01967000
CVTRV446 EQU   CVTRV438                                                 01968000
CVTRV445 EQU   CVTRV438                                                 01969000
CVTRV444 EQU   CVTRV438                                                 01970000
CVTRV443 EQU   CVTRV438                                                 01971000
CVTRV442 EQU   CVTRV438                                                 01972000
CVTRV441 EQU   CVTRV438                                                 01973000
CVTRV440 EQU   CVTRV438                                                 01974000
CVTRV439 EQU   CVTRV438                                                 01975000
CVTRV437 EQU   CVTRV429                                                 01976000
CVTRV436 EQU   CVTRV429                                                 01977000
CVTRV435 EQU   CVTRV429                                                 01978000
CVTRV434 EQU   CVTRV429                                                 01979000
CVTRV433 EQU   CVTRV429                                                 01980000
CVTRV432 EQU   CVTRV429                                                 01981000
CVTRV431 EQU   CVTRV429                                                 01982000
CVTRV430 EQU   CVTRV429                                                 01983000
CVTRV428 EQU   CVTXTNT2+80                                              01984000
CVTRV427 EQU   CVTXTNT2+76                                              01985000
CVTRV426 EQU   CVTXTNT2+72                                              01986000
CVTRV425 EQU   CVTXTNT2+68                                              01987000
CVTATACT EQU   CVTATCVT                                                 01988000
CVTRV423 EQU   CVTXTNT2+62                                              01989000
CVTRV422 EQU   CVTXTNT2+60                                              01990000
CVTRV421 EQU   CVTXTNT2+58                                              01991000
CVTRV420 EQU   CVTXTNT2+56                                              01992000
CVTRV419 EQU   CVTXTNT2+55                                              01993000
CVTRV418 EQU   CVTXTNT2+54                                              01994000
CVTRV417 EQU   CVTRV409                                                 01995000
CVTRV416 EQU   CVTRV409                                                 01996000
CVTRV415 EQU   CVTRV409                                                 01997000
CVTRV414 EQU   CVTRV409                                                 01998000
CVTRV413 EQU   CVTRV409                                                 01999000
CVTRV412 EQU   CVTRV409                                                 02000000
CVTRV411 EQU   CVTRV409                                                 02001000
CVTRV410 EQU   CVTRV409                                                 02002000
CVTRV408 EQU   CVTRV400                                                 02003000
CVTRV407 EQU   CVTRV400                                                 02004000
CVTRV406 EQU   CVTRV400                                                 02005000
CVTRV405 EQU   CVTRV400                                                 02006000
CVTRV404 EQU   CVTRV400                                                 02007000
CVTRV403 EQU   CVTRV400                                                 02008000
CVTRV402 EQU   CVTRV400                                                 02009000
CVTRV401 EQU   CVTRV400                                                 02010000
CVTRSVA1 EQU   CVTXTNT2+48                                              02011000
CVTRSVA0 EQU   CVTXTNT2+44                                              02012000
CVTRSV99 EQU   CVTXTNT2+40                                              02013000
CVTRSV98 EQU   CVTXTNT2+36                                              02014000
CVTRSV97 EQU   CVTXTNT2+34                                              02015000
CVTRSV96 EQU   CVTXTNT2+32                                              02016000
CVTOLTEP EQU   CVTXTNT2+28                                              02017000
CVTQIDA  EQU   CVTQID+1                                                 02018000
CVTRSV95 EQU   CVTQID                                                   02019000
CVTRSV94 EQU   CVTXTNT2+20                                              02020000
CVTRSV93 EQU   CVTXTNT2+16                                              02021000
CVTRSV92 EQU   CVTXTNT2+12                                              02022000
CVTDEBVR EQU   CVTXTNT2+8                                               02023000
CVTRSV91 EQU   CVTXTNT2+6                                               02024000
CVTRSV9H EQU   CVTRSV90                                                 02025000
CVTRSV9G EQU   CVTRSV90                                                 02026000
CVTRSV9F EQU   CVTRSV90                                                 02027000
CVTRSV9E EQU   CVTRSV90                                                 02028000
CVTRSV9D EQU   CVTRSV90                                                 02029000
CVTRSV9C EQU   CVTRSV90                                                 02030000
CVTRSV9B EQU   CVTRSV90                                                 02031000
CVTRSV9A EQU   CVTRSV90                                                 02032000
CVTNUCLS EQU   CVTXTNT2+4                                               02033000
CVTDSSVA EQU   CVTDSSV+1                                                02034000
CVTRSV89 EQU   CVTDSSV                                                  02035000
CVTRSV88 EQU   CVTXTNT1+8                                               02036000
CVTRSV87 EQU   CVTXTNT1+4                                               02037000
CVTFACHN EQU   CVTXTNT1                                                 02038000
CVTRV488 EQU   CVTMAP+412                                               02039000
CVTRV487 EQU   CVTMAP+408                                               02040000
CVTRV486 EQU   CVTMAP+404                                               02041000
CVTRV485 EQU   CVTMAP+400                                               02042000
CVTRV484 EQU   CVTMAP+396                                               02043000
CVTAUTH  EQU   CVTMAP+392                                               02044000
CVTATMCA EQU   CVTATMCT+1                                               02045000
CVTATMST EQU   CVTATMCT                                                 02046000
CVTRSV61 EQU   CVTMAP+384                                               02047000
CVTVOLT1 EQU   CVTVOLM1+1                                               02048000
CVTVOLI1 EQU   CVTVOLF1                                                 02049000
CVTSTOA  EQU   CVTMAP+376                                               02050000
CVTRSV58 EQU   CVTMAP+374                                               02051000
CVTRSV57 EQU   CVTMAP+372                                               02052000
CVTDDCE  EQU   CVTMAP+368                                               02053000
CVTPNWFR EQU   CVTMAP+364                                               02054000
CVTSMF   EQU   CVTMAP+360                                               02055000
CVTSULK  EQU   CVTMAP+358                                               02056000
CVTSLKO  EQU   CVTSYSK                                                  02057000
CVTSLKP  EQU   CVTSYSK                                                  02058000
CVTSLKQ  EQU   CVTSYSK                                                  02059000
CVTSLKR  EQU   CVTSYSK                                                  02060000
CVTRSV56 EQU   CVTSYSK                                                  02061000
CVTRSV55 EQU   CVTSYSK                                                  02062000
CVTRSV54 EQU   CVTSYSK                                                  02063000
CVTRSV53 EQU   CVTSYSK                                                  02064000
CVTRSV52 EQU   CVTA1F1                                                  02065000
CVTRSV51 EQU   CVTA1F1                                                  02066000
CVTRSV50 EQU   CVTA1F1                                                  02067000
CVTRSV49 EQU   CVTA1F1                                                  02068000
CVTRSV48 EQU   CVTA1F1                                                  02069000
CVTRSV47 EQU   CVTA1F1                                                  02070000
CVTSRSW  EQU   CVTA1F1                                                  02071000
CVTPFSW  EQU   CVTA1F1                                                  02072000
CVTPCVT  EQU   CVTMAP+352                                               02073000
CVTRSV46 EQU   CVTMAP+344                                               02074000
CVTRSV45 EQU   CVTMAP+340                                               02075000
CVTRSV44 EQU   CVTMAP+338                                               02076000
CVTRSV43 EQU   CVTMAP+336                                               02077000
CVTHJESA EQU   CVTHJES+1                                                02078000
CVTRSV42 EQU   CVTHJES                                                  02079000
CVTEXT2A EQU   CVTEXT2+1                                                02080000
CVTRSV41 EQU   CVTEXT2                                                  02081000
CVTAPFA  EQU   CVTAPF+1                                                 02082000
CVTRSV40 EQU   CVTAPF                                                   02083000
CVTRV518 EQU   CVTINTLA                                                 02084000
CVTRV517 EQU   CVTERPV                                                  02085000
CVTEORM  EQU   CVTMAP+312                                               02086000
CVTMCHPR EQU   CVTMAP+308                                               02087000
CVTTZ    EQU   CVTMAP+304                                               02088000
CVTJEPS  EQU   CVTMAP+300                                               02089000
CVTJESCT EQU   CVTMAP+296                                               02090000
CVTMODE  EQU   CVTMAP+292                                               02091000
CVTPTRV  EQU   CVTMAP+288                                               02092000
CVTREAL  EQU   CVTMAP+284                                               02093000
CVTRSV39 EQU   CVTMAP+280                                               02094000
CVTRSV38 EQU   CVTMAP+276                                               02095000
CVTDMSRA EQU   CVTDMSR+1                                                02096000
CVTRSV37 EQU   CVTDMSR                                                  02097000
CVTQMSGA EQU   CVTQMSG+1                                                02098000
CVTRSV36 EQU   CVTQMSG                                                  02099000
CVTAMFF  EQU   CVTMAP+264                                               02100000
CVTPURGA EQU   CVTPURG+1                                                02101000
CVTRSV35 EQU   CVTPURG                                                  02102000
CVTCBSP  EQU   CVTMAP+256                                               02103000
CVTATERA EQU   CVTATER+1                                                02104000
CVTSYST  EQU   CVTATER                                                  02105000
CVTVOLT2 EQU   CVTTAT                                                   02106000
CVTVOLI2 EQU   CVTVOLF2                                                 02107000
CVTAQAVB EQU   CVTAQAVT+1                                               02108000
CVTRSV34 EQU   CVTTCMFG                                                 02109000
CVTRSV33 EQU   CVTTCMFG                                                 02110000
CVTRSV32 EQU   CVTTCMFG                                                 02111000
CVTRSV31 EQU   CVTTCMFG                                                 02112000
CVTRSV30 EQU   CVTTCMFG                                                 02113000
CVTRSV29 EQU   CVTTCMFG                                                 02114000
CVTRSV28 EQU   CVTTCMFG                                                 02115000
CVTTCRDY EQU   CVTTCMFG                                                 02116000
CVTGTFA  EQU   CVTGTF+1                                                 02117000
CVTRSV27 EQU   CVTGTFST                                                 02118000
CVTRNIO  EQU   CVTGTFST                                                 02119000
CVTRV319 EQU   CVTUSR                                                   02120000
CVTRV318 EQU   CVTFORM                                                  02121000
CVTRV317 EQU   CVTTMODE                                                 02122000
CVTRV316 EQU   CVTSTATE                                                 02123000
CVTRV315 EQU   CVTGTFS                                                  02124000
CVTGTFAV EQU   CVTGTFS                                                  02125000
CVT0SCR1 EQU   CVTMAP+232                                               02126000
CVTRV515 EQU   CVTMAP+228                                               02127000
CVTRMS   EQU   CVTMAP+224                                               02128000
CVTPATCH EQU   CVTMAP+220                                               02129000
CVTTSCE  EQU   CVTMAP+216                                               02130000
CVTLNKSC EQU   CVTMAP+214                                               02131000
CVTQABST EQU   CVTMAP+212                                               02132000
CVTMDLDS EQU   CVTMAP+208                                               02133000
CVTUSER  EQU   CVTMAP+204                                               02134000
CVTABEND EQU   CVTMAP+200                                               02135000
CVTSMCA  EQU   CVTMAP+196                                               02136000
CVTRSV18 EQU   CVTMAP+192                                               02137000
CVTQLPAQ EQU   CVTMAP+188                                               02138000
CVTQCDSR EQU   CVTMAP+184                                               02139000
CVTRSV17 EQU   CVTOPTB                                                  02140000
CVTRSV16 EQU   CVTOPTB                                                  02141000
CVTFP    EQU   CVTOPTB                                                  02142000
CVTAPTHR EQU   CVTOPTB                                                  02143000
CVTNLOG  EQU   CVTOPTB                                                  02144000
CVTTOD   EQU   CVTOPTB                                                  02145000
CVTCTIMS EQU   CVTOPTB                                                  02146000
CVTPROT  EQU   CVTOPTB                                                  02147000
CVTXPFP  EQU   CVTOPTA                                                  02148000
CVTASCII EQU   CVTOPTA                                                  02149000
CVTRSV13 EQU   CVTOPTA                                                  02150000
CVTRSV12 EQU   CVTOPTA                                                  02151000
CVTNIP   EQU   CVTOPTA                                                  02152000
CVTDDR   EQU   CVTOPTA                                                  02153000
CVTAPR   EQU   CVTOPTA                                                  02154000
CVTCCH   EQU   CVTOPTA                                                  02155000
CVTSNCTR EQU   CVTMAP+180                                               02156000
CVTQMWR  EQU   CVTMAP+176                                               02157000
CVTQOCR  EQU   CVTMAP+172                                               02158000
CVT1EF00 EQU   CVTMAP+168                                               02159000
CVTMZ00  EQU   CVTMAP+164                                               02160000
CVTHEAD  EQU   CVTMAP+160                                               02161000
CVTRSV11 EQU   CVTMAP+156                                               02162000
CVT0PT01 EQU   CVTMAP+152                                               02163000
CVTMSER  EQU   CVTMAP+148                                               02164000
CVTRV516 EQU   CVTIERLC                                                 02165000
CVTILCH  EQU   CVTMAP+140                                               02166000
CVT0DS   EQU   CVTMAP+136                                               02167000
CVTFBOSV EQU   CVTMAP+132                                               02168000
CVTNUCB  EQU   CVTMAP+128                                               02169000
CVTIXAVL EQU   CVTMAP+124                                               02170000
CVTIOQET EQU   CVTMAP+120                                               02171000
CVTDCBA  EQU   CVTMAP+117                                               02172000
CVTMVS2  EQU   CVTDCB                                                   02173000
CVT6DAT  EQU   CVTDCB                                                   02174000
CVT4MPS  EQU   CVTDCB                                                   02175000
CVTRSV09 EQU   CVTDCB                                                   02176000
CVT4MS1  EQU   CVTDCB                                                   02177000
CVT2SPS  EQU   CVTDCB                                                   02178000
CVT1SSS  EQU   CVTDCB                                                   02179000
CVTRSV08 EQU   CVTDCB                                                   02180000
CVTSTB   EQU   CVTMAP+112                                               02181000
CVTQTD00 EQU   CVTMAP+108                                               02182000
CVTQTE00 EQU   CVTMAP+104                                               02183000
CVTCUCB  EQU   CVTMAP+100                                               02184000
CVTSJQ   EQU   CVTMAP+96                                                02185000
CVTPBLDL EQU   CVTMAP+92                                                02186000
CVTTPC   EQU   CVTMAP+88                                                02187000
CVTSVDCB EQU   CVTMAP+84                                                02188000
CVTBRET  EQU   CVTMAP+82                                                02189000
CVTEXIT  EQU   CVTMAP+80                                                02190000
CVT0FN00 EQU   CVTMAP+76                                                02191000
CVTDARA  EQU   CVTDAR+1                                                 02192000
CVTRSV07 EQU   CVTFLGS1                                                 02193000
CVTRSV06 EQU   CVTFLGS1                                                 02194000
CVTRSV05 EQU   CVTFLGS1                                                 02195000
CVTRSV04 EQU   CVTFLGS1                                                 02196000
CVTRSV03 EQU   CVTFLGS1                                                 02197000
CVTRSV02 EQU   CVTFLGS1                                                 02198000
CVTRSV01 EQU   CVTFLGS1                                                 02199000
CVTDMPLK EQU   CVTFLGS1                                                 02200000
CVTXITP  EQU   CVTMAP+68                                                02201000
CVTZDTAB EQU   CVTMAP+64                                                02202000
CVTMSLT  EQU   CVTMAP+60                                                02203000
CVTDATE  EQU   CVTMAP+56                                                02204000
CVTSYSAD EQU   CVTMAP+48                                                02205000
CVTXTLER EQU   CVTMAP+44                                                02206000
CVTILK2  EQU   CVTMAP+40                                                02207000
CVTILK1  EQU   CVTMAP+36                                                02208000
CVTPRLTV EQU   CVTMAP+32                                                02209000
CVTPCNVT EQU   CVTMAP+28                                                02210000
CVT0VL00 EQU   CVTMAP+24                                                02211000
CVTXAPG  EQU   CVTMAP+20                                                02212000
CVTBUF   EQU   CVTMAP+16                                                02213000
CVTJOB   EQU   CVTMAP+12                                                02214000
CVTLINK  EQU   CVTMAP+8                                                 02215000
CVT0EF00 EQU   CVTMAP+4                                                 02216000
CVTTCBP  EQU   CVTMAP                                                   02217000
CVT      EQU   CVTMAP                                                   02218000
LCCAR125 EQU   LCCA+964                                                 02219000
LCCAR124 EQU   LCCA+960                                                 02220000
LCCAR123 EQU   LCCA+956                                                 02221000
LCCAR122 EQU   LCCA+952                                                 02222000
LCCAR121 EQU   LCCA+948                                                 02223000
LCCAR120 EQU   LCCA+944                                                 02224000
LCCAR119 EQU   LCCA+940                                                 02225000
LCCAR118 EQU   LCCA+936                                                 02226000
LCCAR117 EQU   LCCA+932                                                 02227000
LCCAR116 EQU   LCCA+928                                                 02228000
LCCAR115 EQU   LCCA+924                                                 02229000
LCCAR114 EQU   LCCA+920                                                 02230000
LCCAR113 EQU   LCCA+916                                                 02231000
LCCAR112 EQU   LCCA+912                                                 02232000
LCCAR111 EQU   LCCA+908                                                 02233000
LCCAR110 EQU   LCCA+904                                                 02234000
LCCAR109 EQU   LCCA+900                                                 02235000
LCCAR108 EQU   LCCA+896                                                 02236000
LCCADRT2 EQU   LCCA+888                                                 02237000
LCCADRT1 EQU   LCCA+880                                                 02238000
LCCAR103 EQU   LCCA+876                                                 02239000
LCCAESS2 EQU   LCCA+872                                                 02240000
LCCASPLJ EQU   LCCA+868                                                 02241000
LCCASMQJ EQU   LCCA+864                                                 02242000
LCCAIRT  EQU   LCCA+736                                                 02243000
LCCARV90 EQU   LCCA+732                                                 02244000
LCCARV89 EQU   LCCA+728                                                 02245000
LCCAPGTA EQU   LCCASRBF+2                                               02246000
LCCASAFN EQU   LCCASRBF                                                 02247000
LCCAECSA EQU   LCCA+716                                                 02248000
LCCAICR0 EQU   LCCA+712                                                 02249000
LCCALWTM EQU   LCCA+704                                                 02250000
LCCARV78 EQU   LCCA+700                                                 02251000
LCCAPINV EQU   LCCA+696                                                 02252000
LCCARV88 EQU   LCCA+695                                                 02253000
LCCARV87 EQU   LCCALKFG                                                 02254000
LCCARV86 EQU   LCCALKFG                                                 02255000
LCCARV85 EQU   LCCALKFG                                                 02256000
LCCARV84 EQU   LCCALKFG                                                 02257000
LCCALKRD EQU   LCCALKFG                                                 02258000
LCCALKAQ EQU   LCCALKFG                                                 02259000
LCCALKSA EQU   LCCALKFG                                                 02260000
LCCALKDP EQU   LCCALKFG                                                 02261000
LCCACRST EQU   LCCACREX                                                 02262000
LCCACRDP EQU   LCCACREX                                                 02263000
LCCACRLM EQU   LCCACREX                                                 02264000
LCCACRRT EQU   LCCACREX                                                 02265000
LCCACRLE EQU   LCCACREX                                                 02266000
LCCACRRM EQU   LCCACREX                                                 02267000
LCCACREF EQU   LCCACREX                                                 02268000
LCCAVARY EQU   LCCACRFL                                                 02269000
LCCARV73 EQU   LCCACRFL                                                 02270000
LCCARV72 EQU   LCCACRFL                                                 02271000
LCCARV71 EQU   LCCACRFL                                                 02272000
LCCARV70 EQU   LCCACRFL                                                 02273000
LCCARV69 EQU   LCCACRFL                                                 02274000
LCCACLMS EQU   LCCACRFL                                                 02275000
LCCALCR0 EQU   LCCA+688                                                 02276000
LCCACRLC EQU   LCCA+684                                                 02277000
LCCASRBJ EQU   LCCA+672                                                 02278000
LCCADSSR EQU   LCCA+668                                                 02279000
LCCADSSC EQU   LCCA+660                                                 02280000
LCCADSS3 EQU   LCCA+648                                                 02281000
LCCADSS2 EQU   LCCA+636                                                 02282000
LCCADSS1 EQU   LCCA+624                                                 02283000
LCCAWTIM EQU   LCCA+616                                                 02284000
LCCAITOD EQU   LCCA+608                                                 02285000
LCCADTOD EQU   LCCA+600                                                 02286000
LCCASTOD EQU   LCCA+592                                                 02287000
LCCARIR5 EQU   LCCASPSA+44                                              02288000
LCCARIR4 EQU   LCCASPSA+40                                              02289000
LCCARIR3 EQU   LCCASPSA+36                                              02290000
LCCARIR2 EQU   LCCASPSA+32                                              02291000
LCCARPR5 EQU   LCCASPSA+28                                              02292000
LCCARPR4 EQU   LCCASPSA+24                                              02293000
LCCARPR3 EQU   LCCASPSA+20                                              02294000
LCCARPR2 EQU   LCCASPSA+16                                              02295000
LCCADSR5 EQU   LCCASPSA+12                                              02296000
LCCADSR4 EQU   LCCASPSA+8                                               02297000
LCCADSR3 EQU   LCCASPSA+4                                               02298000
LCCADSR2 EQU   LCCASPSA                                                 02299000
LCCARV68 EQU   LCCA+543                                                 02300000
LCCAPSMK EQU   LCCA+542                                                 02301000
LCCARV67 EQU   LCCADSF2                                                 02302000
LCCARV66 EQU   LCCADSF2                                                 02303000
LCCARV65 EQU   LCCADSF2                                                 02304000
LCCARV64 EQU   LCCADSF2                                                 02305000
LCCADSRW EQU   LCCADSF2                                                 02306000
LCCADSPL EQU   LCCADSF2                                                 02307000
LCCAGSRB EQU   LCCADSF2                                                 02308000
LCCASRBM EQU   LCCADSF2                                                 02309000
LCCARV61 EQU   LCCADSF1                                                 02310000
LCCARV60 EQU   LCCADSF1                                                 02311000
LCCARV59 EQU   LCCADSF1                                                 02312000
LCCARV58 EQU   LCCADSF1                                                 02313000
LCCATIMR EQU   LCCADSF1                                                 02314000
LCCADSS  EQU   LCCADSF1                                                 02315000
LCCAVCPU EQU   LCCADSF1                                                 02316000
LCCAACR  EQU   LCCADSF1                                                 02317000
LCCAASCP EQU   LCCA+532                                                 02318000
LCCAESSA EQU   LCCA+528                                                 02319000
LCCARV55 EQU   LCCASPN4                                                 02320000
LCCARV54 EQU   LCCASPN4                                                 02321000
LCCARV53 EQU   LCCASPN4                                                 02322000
LCCARV52 EQU   LCCASPN4                                                 02323000
LCCARV51 EQU   LCCASPN4                                                 02324000
LCCARV50 EQU   LCCASPN4                                                 02325000
LCCARV49 EQU   LCCASPN4                                                 02326000
LCCARV48 EQU   LCCASPN4                                                 02327000
LCCARV47 EQU   LCCASPN3                                                 02328000
LCCARV46 EQU   LCCASPN3                                                 02329000
LCCARV45 EQU   LCCASPN3                                                 02330000
LCCARV44 EQU   LCCASPN3                                                 02331000
LCCARV43 EQU   LCCASPN3                                                 02332000
LCCARV42 EQU   LCCASPN3                                                 02333000
LCCARV41 EQU   LCCASPN3                                                 02334000
LCCARV40 EQU   LCCASPN3                                                 02335000
LCCARV39 EQU   LCCASPN2                                                 02336000
LCCARV38 EQU   LCCASPN2                                                 02337000
LCCARV37 EQU   LCCASPN2                                                 02338000
LCCARV36 EQU   LCCASPN2                                                 02339000
LCCARV35 EQU   LCCASPN2                                                 02340000
LCCARV34 EQU   LCCASPN2                                                 02341000
LCCARV33 EQU   LCCASPN2                                                 02342000
LCCARV32 EQU   LCCASPN2                                                 02343000
LCCARV31 EQU   LCCASPN1                                                 02344000
LCCARV30 EQU   LCCASPN1                                                 02345000
LCCAMFIO EQU   LCCASPN1                                                 02346000
LCCARSTR EQU   LCCASPN1                                                 02347000
LCCATSPN EQU   LCCASPN1                                                 02348000
LCCALOCK EQU   LCCASPN1                                                 02349000
LCCASIGP EQU   LCCASPN1                                                 02350000
LCCAPTLB EQU   LCCASPN1                                                 02351000
LCCARV27 EQU   LCCAIHR4                                                 02352000
LCCARV26 EQU   LCCAIHR4                                                 02353000
LCCARV25 EQU   LCCAIHR4                                                 02354000
LCCARV24 EQU   LCCAIHR4                                                 02355000
LCCARV23 EQU   LCCAIHR4                                                 02356000
LCCARV22 EQU   LCCAIHR4                                                 02357000
LCCARV21 EQU   LCCAIHR4                                                 02358000
LCCARV20 EQU   LCCAIHR4                                                 02359000
LCCARV19 EQU   LCCAIHR3                                                 02360000
LCCARV18 EQU   LCCAIHR3                                                 02361000
LCCARV17 EQU   LCCAIHR3                                                 02362000
LCCARV16 EQU   LCCAIHR3                                                 02363000
LCCARV15 EQU   LCCAIHR3                                                 02364000
LCCARV14 EQU   LCCAIHR3                                                 02365000
LCCARV13 EQU   LCCAIHR3                                                 02366000
LCCARV12 EQU   LCCAIHR3                                                 02367000
LCCARV11 EQU   LCCAIHR2                                                 02368000
LCCARV10 EQU   LCCAIHR2                                                 02369000
LCCARV09 EQU   LCCAIHR2                                                 02370000
LCCARV08 EQU   LCCAIHR2                                                 02371000
LCCARV07 EQU   LCCAIHR2                                                 02372000
LCCARV06 EQU   LCCAIHR2                                                 02373000
LCCARV05 EQU   LCCAIHR2                                                 02374000
LCCARV04 EQU   LCCAIHR2                                                 02375000
LCCARV03 EQU   LCCAIHR1                                                 02376000
LCCARV02 EQU   LCCAIHR1                                                 02377000
LCCARV01 EQU   LCCAIHR1                                                 02378000
LCCAPPIE EQU   LCCAIHR1                                                 02379000
LCCAPSG1 EQU   LCCAIHR1                                                 02380000
LCCAPDAT EQU   LCCAIHR1                                                 02381000
LCCAXRC2 EQU   LCCAIHR1                                                 02382000
LCCAXRC1 EQU   LCCAIHR1                                                 02383000
LCCAIOPS EQU   LCCA+512                                                 02384000
LCCAGPGR EQU   LCCA+448                                                 02385000
LCCARSFP EQU   LCCA+416                                                 02386000
LCCARSGR EQU   LCCA+352                                                 02387000
LCCAXGR3 EQU   LCCA+288                                                 02388000
LCCAXGR2 EQU   LCCA+224                                                 02389000
LCCAXGR1 EQU   LCCA+160                                                 02390000
LCCACR0  EQU   LCCA+156                                                 02391000
LCCAMCR1 EQU   LCCA+152                                                 02392000
LCCAPVAD EQU   LCCA+148                                                 02393000
LCCAPINT EQU   LCCA+144                                                 02394000
LCCAPPSW EQU   LCCA+136                                                 02395000
LCCAPGR2 EQU   LCCA+72                                                  02396000
LCCAPGR1 EQU   LCCA+8                                                   02397000
LCCARV77 EQU   LCCA+6                                                   02398000
LCCALCCA EQU   LCCA                                                     02399000
@NM00024 EQU   PSA+3412                                                 02400000
PSASTAK  EQU   PSA+3072                                                 02401000
@NM00023 EQU   PSA+1032                                                 02402000
PSAPCPSW EQU   PSA+1024                                                 02403000
PSARV060 EQU   PSA+1020                                                 02404000
PSARV059 EQU   PSA+1018                                                 02405000
PSASVC13 EQU   PSA+1016                                                 02406000
PSALSFCC EQU   PSA+1012                                                 02407000
PSASFACC EQU   PSA+1008                                                 02408000
PSASTOP  EQU   PSA+992                                                  02409000
PSASTART EQU   PSA+976                                                  02410000
PSARSPSW EQU   PSA+968                                                  02411000
PSASRPSW EQU   PSA+960                                                  02412000
PSARV045 EQU   PSA+892                                                  02413000
PSARV044 EQU   PSA+888                                                  02414000
PSARV043 EQU   PSA+884                                                  02415000
PSARV042 EQU   PSA+880                                                  02416000
PSARV041 EQU   PSA+876                                                  02417000
PSARV040 EQU   PSA+872                                                  02418000
PSARV025 EQU   PSA+868                                                  02419000
PSADSSED EQU   PSA+868                                                  02420000
PSADSSPR EQU   PSA+864                                                  02421000
PSADSSFW EQU   PSA+860                                                  02422000
PSADSS14 EQU   PSA+856                                                  02423000
PSADSSPP EQU   PSA+848                                                  02424000
PSADSSRP EQU   PSA+840                                                  02425000
PSADSS05 EQU   PSADSSF4                                                 02426000
PSADSS10 EQU   PSADSSF4                                                 02427000
PSADSSVE EQU   PSADSSF4                                                 02428000
PSADSSDE EQU   PSADSSF4                                                 02429000
PSADSSC0 EQU   PSADSSF4                                                 02430000
PSADSSIE EQU   PSADSSF4                                                 02431000
PSADSS12 EQU   PSADSSF4                                                 02432000
PSADSSRC EQU   PSADSSF4                                                 02433000
PSARV057 EQU   PSADSSF3                                                 02434000
PSARV056 EQU   PSADSSF3                                                 02435000
PSARV055 EQU   PSADSSF3                                                 02436000
PSADSSMC EQU   PSADSSF3                                                 02437000
PSADSSRW EQU   PSADSSF3                                                 02438000
PSADSSNM EQU   PSADSSF3                                                 02439000
PSADSSES EQU   PSADSSF3                                                 02440000
PSADSSGP EQU   PSADSSF3                                                 02441000
PSADSSF2 EQU   PSADSSFL+1                                               02442000
PSADSSPI EQU   PSADSSF1                                                 02443000
PSADSSOI EQU   PSADSSF1                                                 02444000
PSADSSSP EQU   PSADSSF1                                                 02445000
PSADSSTP EQU   PSADSSF1                                                 02446000
PSADSSDW EQU   PSADSSF1                                                 02447000
PSADSSDD EQU   PSADSSF1                                                 02448000
PSADSSDM EQU   PSADSSF1                                                 02449000
PSADSSMV EQU   PSADSSF1                                                 02450000
PSADSSTS EQU   PSA+816                                                  02451000
PSADSSWK EQU   PSA+812                                                  02452000
PSADSSR3 EQU   PSA+808                                                  02453000
PSADSSR2 EQU   PSA+804                                                  02454000
PSADSSRS EQU   PSA+800                                                  02455000
PSASTOR  EQU   PSA+796                                                  02456000
PSACPUSA EQU   PSA+794                                                  02457000
PSAVSTAP EQU   PSA+792                                                  02458000
PSAWKVAP EQU   PSA+788                                                  02459000
PSAWKRAP EQU   PSA+784                                                  02460000
PSAMCHIC EQU   PSA+783                                                  02461000
PSARV061 EQU   PSA+782                                                  02462000
PSASYMSK EQU   PSA+781                                                  02463000
PSAMCHFL EQU   PSA+780                                                  02464000
PSACR0   EQU   PSA+776                                                  02465000
PSAPSWSV EQU   PSA+768                                                  02466000
PSALITA  EQU   PSA+764                                                  02467000
PSACLHS  EQU   PSAHLHI                                                  02468000
PSALKR15 EQU   PSALKSA+60                                               02469000
PSALKR14 EQU   PSALKSA+56                                               02470000
PSALKR13 EQU   PSALKSA+52                                               02471000
PSALKR12 EQU   PSALKSA+48                                               02472000
PSALKR11 EQU   PSALKSA+44                                               02473000
PSALKR10 EQU   PSALKSA+40                                               02474000
PSALKR9  EQU   PSALKSA+36                                               02475000
PSALKR8  EQU   PSALKSA+32                                               02476000
PSALKR7  EQU   PSALKSA+28                                               02477000
PSALKR6  EQU   PSALKSA+24                                               02478000
PSALKR5  EQU   PSALKSA+20                                               02479000
PSALKR4  EQU   PSALKSA+16                                               02480000
PSALKR3  EQU   PSALKSA+12                                               02481000
PSALKR2  EQU   PSALKSA+8                                                02482000
PSALKR1  EQU   PSALKSA+4                                                02483000
PSALKR0  EQU   PSALKSA                                                  02484000
PSARV023 EQU   PSACLHT+52                                               02485000
PSALOCAL EQU   PSACLHT+48                                               02486000
PSACMSL  EQU   PSACLHT+44                                               02487000
PSAOPTL  EQU   PSACLHT+40                                               02488000
PSATPACL EQU   PSACLHT+36                                               02489000
PSATPDNL EQU   PSACLHT+32                                               02490000
PSATPNCL EQU   PSACLHT+28                                               02491000
PSAIOSLL EQU   PSACLHT+24                                               02492000
PSAIOSUL EQU   PSACLHT+20                                               02493000
PSAIOSCL EQU   PSACLHT+16                                               02494000
PSAIOSSL EQU   PSACLHT+12                                               02495000
PSASALCL EQU   PSACLHT+8                                                02496000
PSAASML  EQU   PSACLHT+4                                                02497000
PSADISPL EQU   PSACLHT                                                  02498000
PSASRSA  EQU   PSA+636                                                  02499000
PSARV050 EQU   PSA+634                                                  02500000
PSADSSGO EQU   PSA+633                                                  02501000
PSARECUR EQU   PSA+632                                                  02502000
PSAHLHIS EQU   PSA+628                                                  02503000
PSAIPCSA EQU   PSA+624                                                  02504000
@NM00022 EQU   PSA+621                                                  02505000
PSAIPCDM EQU   PSA+620                                                  02506000
PSAIPCD  EQU   PSA+616                                                  02507000
@NM00021 EQU   PSA+613                                                  02508000
PSAIPCRM EQU   PSA+612                                                  02509000
PSAIPCR  EQU   PSA+608                                                  02510000
PSAMCHEX EQU   PSA+600                                                  02511000
PSAMPSW  EQU   PSA+592                                                  02512000
PSAEXPS2 EQU   PSA+584                                                  02513000
PSAEXPS1 EQU   PSA+576                                                  02514000
PSAPIREG EQU   PSA+572                                                  02515000
PSARSREG EQU   PSA+568                                                  02516000
PSAGPREG EQU   PSA+556                                                  02517000
PSARV022 EQU   PSASUP4                                                  02518000
PSARV021 EQU   PSASUP4                                                  02519000
PSARV020 EQU   PSASUP4                                                  02520000
PSARV019 EQU   PSASUP4                                                  02521000
PSARV018 EQU   PSASUP4                                                  02522000
PSARV017 EQU   PSASUP4                                                  02523000
PSARV016 EQU   PSASUP4                                                  02524000
PSARV015 EQU   PSASUP4                                                  02525000
PSARV014 EQU   PSASUP3                                                  02526000
PSARV013 EQU   PSASUP3                                                  02527000
PSARV012 EQU   PSASUP3                                                  02528000
PSARV011 EQU   PSASUP3                                                  02529000
PSARV010 EQU   PSASUP3                                                  02530000
PSARV009 EQU   PSASUP3                                                  02531000
PSARV008 EQU   PSASUP3                                                  02532000
PSAIOSUP EQU   PSASUP3                                                  02533000
PSALCR   EQU   PSASUP2                                                  02534000
PSARTM   EQU   PSASUP2                                                  02535000
PSAIPCE2 EQU   PSASUP2                                                  02536000
PSAIPCES EQU   PSASUP2                                                  02537000
PSAIPCEC EQU   PSASUP2                                                  02538000
PSAGTF   EQU   PSASUP2                                                  02539000
PSAIPCRI EQU   PSASUP2                                                  02540000
PSAIPCRP EQU   PSASUP1                                                  02541000
PSAIPCDR EQU   PSASUP1                                                  02542000
PSADISP  EQU   PSASUP1                                                  02543000
PSALOCK  EQU   PSASUP1                                                  02544000
PSAPI    EQU   PSASUP1                                                  02545000
PSAEXT   EQU   PSASUP1                                                  02546000
PSASVC   EQU   PSASUP1                                                  02547000
PSAIO    EQU   PSASUP1                                                  02548000
PSAAOLD  EQU   PSA+548                                                  02549000
PSAANEW  EQU   PSA+544                                                  02550000
PSATOLD  EQU   PSA+540                                                  02551000
PSATNEW  EQU   PSA+536                                                  02552000
PSALCCAR EQU   PSA+532                                                  02553000
PSAPCCAR EQU   PSA+524                                                  02554000
PSACPULA EQU   PSA+518                                                  02555000
FLCHDEND EQU   PSA+512                                                  02556000
FLCCRSAV EQU   FLCMCLA+280                                              02557000
FLCGRSAV EQU   FLCMCLA+216                                              02558000
FLCFPSAV EQU   FLCMCLA+184                                              02559000
FLCFLA   EQU   FLCMCLA+88                                               02560000
FLCRGNCD EQU   FLCMCLA+84                                               02561000
FLCFSAA  EQU   FLCFSA+1                                                 02562000
@NM00020 EQU   FLCFSA                                                   02563000
@NM00019 EQU   FLCMCLA+72                                               02564000
FLCMCIC  EQU   FLCMCLA+64                                               02565000
@NM00018 EQU   FLCMCLA+20                                               02566000
FLCIOAA  EQU   FLCIOA+1                                                 02567000
@NM00017 EQU   FLCIOA                                                   02568000
@NM00016 EQU   FLCMCLA+15                                               02569000
@NM00015 EQU   FLCMCLA+14                                               02570000
@NM00014 EQU   FLCMCLA+12                                               02571000
FLCLCL   EQU   FLCMCLA+8                                                02572000
FLCIOELA EQU   FLCIOEL+1                                                02573000
@NM00013 EQU   FLCIOEL                                                  02574000
FLCCHNID EQU   FLCMCLA                                                  02575000
@NM00012 EQU   PSA+160                                                  02576000
@NM00011 EQU   PSA+156                                                  02577000
FLCPERA  EQU   FLCPER+1                                                 02578000
@NM00010 EQU   FLCPER                                                   02579000
@NM00009 EQU   PSA+151                                                  02580000
FLCPERCD EQU   PSA+150                                                  02581000
FLCMCNUM EQU   PSA+149                                                  02582000
@NM00008 EQU   PSA+148                                                  02583000
FLCTEAA  EQU   FLCTEA+1                                                 02584000
@NM00007 EQU   FLCTEA                                                   02585000
PSAPIPC  EQU   PSAPICOD                                                 02586000
PSAPIMC  EQU   PSAPICOD                                                 02587000
PSAPIPER EQU   PSAPICOD                                                 02588000
PSARV049 EQU   FLCPICOD                                                 02589000
FLCPILCB EQU   FLCPIILC                                                 02590000
@NM00006 EQU   FLCPIILC                                                 02591000
@NM00005 EQU   PSAEPPSW                                                 02592000
FLCSVCN  EQU   PSAESPSW+2                                               02593000
FLCSILCB EQU   FLCSVILC                                                 02594000
@NM00004 EQU   FLCSVILC                                                 02595000
@NM00003 EQU   PSAESPSW                                                 02596000
FLCEICOD EQU   PSAEEPSW+2                                               02597000
@NM00002 EQU   PSA+128                                                  02598000
FLCINPSW EQU   PSA+120                                                  02599000
FLCMNPSW EQU   PSA+112                                                  02600000
FLCPNPSW EQU   PSA+104                                                  02601000
FLCSNPSW EQU   PSA+96                                                   02602000
FLCTRACE EQU   PSA+84                                                   02603000
FLCTIMER EQU   PSA+80                                                   02604000
FLCCVT2  EQU   PSA+76                                                   02605000
FLCCAW   EQU   PSA+72                                                   02606000
FLCCSW   EQU   PSA+64                                                   02607000
FLCIOPSW EQU   PSA+56                                                   02608000
FLCMOPSW EQU   PSA+48                                                   02609000
FLCPOPSW EQU   PSA+40                                                   02610000
FLCSOPSW EQU   PSA+32                                                   02611000
@NM00001 EQU   FLCICCW2+4                                               02612000
FLCICCW1 EQU   FLCROPSW                                                 02613000
FLCIPPSW EQU   FLCRNPSW                                                 02614000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02615000
@RF00116 EQU   @RC00114                                                 02616000
@ENDDATA EQU   *                                                        02617000
         END   IEAVTCR1                                                 02618000
