         TITLE 'IEAVNP12 - NIP LOCATE                                  *00001000
                        '                                               00002000
IEAVNP12 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IEAVNP12  77.018'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
         L     @00,@SIZDATD                                        0001 00014000
         GETMAIN  R,LV=(0)                                              00015000
         LR    @11,@01                                             0001 00016000
         USING @DATD,@11                                           0001 00017000
         ST    @13,@SA00001+4                                      0001 00018000
         LM    @00,@01,20(@13)                                     0001 00019000
         ST    @11,8(,@13)                                         0001 00020000
         LR    @13,@11                                             0001 00021000
*                                                                       00022000
* REFS ARE GENERATED FOR NVT FIELDS THAT CONTAIN ADDRESSES OF           00023000
* NIP SERVICE ROUTINES, SO IEAPMNIP MACRO CALLS TO THESE ROUTINES       00024000
* WILL ASSEMBLE PROPERLY.                                               00025000
         STM R2,R3,LOCPTR                                               00026000
*   ERRCD=ZERO;                                                    0238 00027000
         SLR   @15,@15                                             0238 00028000
         ST    @15,ERRCD                                           0238 00029000
*   SW='00000000'B;                 /* SET ALL FLAGS OFF             */ 00030000
         MVI   SW,B'00000000'                                      0239 00031000
*   DICTSTR=ADDR(ZDT);              /* DICTIONARY STARTING ADD       */ 00032000
         LA    @15,ZDT                                             0240 00033000
         ST    @15,DICTSTR                                         0240 00034000
*   DICTEND=ADDR(ZCS);                                             0241 00035000
         LA    @15,ZCS                                             0241 00036000
         ST    @15,DICTEND                                         0241 00037000
*   DICTTYP=ADDR(ZTYP);             /* ITYPENT FLD OF DICT           */ 00038000
         LA    @15,ZTYP                                            0242 00039000
         ST    @15,DICTTYP                                         0242 00040000
*   DICTTYP=DICTTYP->DICTST;        /* DISPLAC IN CATALOG            */ 00041000
         SLR   @14,@14                                             0243 00042000
         IC    @14,DICTST(,@15)                                    0243 00043000
         ST    @14,DICTTYP                                         0243 00044000
*   WKLEN=LENGTH(CATLGBUF)*TEN;     /* GET CORE TO HOLD CATALOG      */ 00045000
         MVC   WKLEN(2),@CH02590                                   0244 00046000
*   CALL GETWORK;                   /* RECORD READ                   */ 00047000
         BAL   @14,GETWORK                                         0245 00048000
*   CATBFPTR=WKCORE;                /* SAVE POINTER                  */ 00049000
         L     @15,WKCORE                                          0246 00050000
         ST    @15,CATBFPTR                                        0246 00051000
*   DO IX=TEN TO 1 BY-1;            /* INIT CATBUFPTRS               */ 00052000
         LA    IX,10                                               0247 00053000
@DL00247 DS    0H                                                  0248 00054000
*     BFCTR(IX)=ZERO;               /* USE COUNT TO 0                */ 00055000
         SLR   @06,@06                                             0248 00056000
         LR    @15,IX                                              0248 00057000
         SLA   @15,3                                               0248 00058000
         STC   @06,BFCTR-8(@15)                                    0248 00059000
*     BFCI(IX)=ZERO;                /* CI NBR IS 0                   */ 00060000
         LA    @14,BFCI-8(@15)                                     0249 00061000
         STCM  @06,7,0(@14)                                        0249 00062000
*     BFPTR(IX)=ADDR(CCACPE(IX));   /* BUFFER POINTER                */ 00063000
         LR    @06,IX                                              0250 00064000
         SLA   @06,4                                               0250 00065000
         LA    @06,CCACPE-16(@06)                                  0250 00066000
         ST    @06,BFPTR-8(@15)                                    0250 00067000
*   END;                                                           0251 00068000
         BCTR  IX,0                                                0251 00069000
         LTR   IX,IX                                               0251 00070000
         BP    @DL00247                                            0251 00071000
*   BFCTR(1)=H255;                  /* INITIAL ENTRY REC NEEDED      */ 00072000
         MVI   BFCTR,X'FF'                                         0252 00073000
*   GEN SETS(CTGPLPTR);                                            0253 00074000
        L     R1,@SA00001+K4           POINT TO CALLERS SAVEAREA        00075000
        L     R1,O24(,R1)              LOAD CALLERS PARM LIST PTR       00076000
        ST    R1,CTGPLPTR              STORE CATLG PARM LIST POINTER    00077000
*   CALL CTLBKPTR;                  /* SET POINTERS TO THE CATALOG 0254 00078000
*                                      CONTROL BLOCKS THAT WE NEED   */ 00079000
         BAL   @14,CTLBKPTR                                        0254 00080000
*   IF CTGAM0=OFFX THEN             /* DO WE HAVE A O.S. LOCATE?     */ 00081000
         L     @09,CTGPLPTR                                        0255 00082000
         TM    CTGAM0(@09),B'00000001'                             0255 00083000
         BNZ   @RF00255                                            0255 00084000
*     DO;                           /* YES DO                        */ 00085000
*       CALL MAPOSCPL;              /* CREATE A CPL FPL FROM THE THE    00086000
*                                      CAMLST THE USER GAVE          */ 00087000
         BAL   @14,MAPOSCPL                                        0257 00088000
*       CALL GETTRNM;               /* GET TRUE NAME RECORD          */ 00089000
         BAL   @14,GETTRNM                                         0258 00090000
*       CALL FINDCI;                /* GET A RECORD BY CI NBR        */ 00091000
         BAL   @14,FINDCI                                          0259 00092000
*       CPX=CPE0;                   /* INIT RECORD POINTER           */ 00093000
         ST    CPE0,CPX                                            0260 00094000
*       CTGFLPTR=CTGFIELD(ONE);     /* SET PTR TO FIELD REQUEST      */ 00095000
         L     @08,CTGPLPTR                                        0261 00096000
         L     @08,CTGFIELD(,@08)                                  0261 00097000
         ST    @08,CTGFLPTR                                        0261 00098000
*       CALL CTINTFAC;              /* CATLG INTERFACE               */ 00099000
         BAL   @14,CTINTFAC                                        0262 00100000
*       CAMWORK=CAMPTR3;            /* POINT TO OUTPUT AREA          */ 00101000
         L     @08,CAMLSTPT                                        0263 00102000
         L     CAMWORK,CAMPTR3(,@08)                               0263 00103000
*       CALL MAPCPLOS;              /* MAP FROM CPL-FPL FORM TO THAT    00104000
*                                      REQUIRED BY O.S.              */ 00105000
         BAL   @14,MAPCPLOS                                        0264 00106000
*     END;                                                         0265 00107000
*   ELSE                            /* WE HAVE A VSAM LOCATE         */ 00108000
*     DO;                                                          0266 00109000
         B     @RC00255                                            0266 00110000
@RF00255 DS    0H                                                  0267 00111000
*       IF CTGNAME=ON THEN          /* 44 BYTE NAME?                 */ 00112000
         L     @09,CTGPLPTR                                        0267 00113000
         TM    CTGNAME(@09),B'00000100'                            0267 00114000
         BNO   @RF00267                                            0267 00115000
*         DO;                                                      0268 00116000
*           CALL GETTRNM;           /* GET TRUE NAME RECORD          */ 00117000
         BAL   @14,GETTRNM                                         0269 00118000
*         END;                                                     0270 00119000
*       ELSE                        /* LOCATE BY CI NBR              */ 00120000
*         CIWORK=CIWORK2;           /* MOVE CI NBR FROM CPL          */ 00121000
         B     @RC00267                                            0271 00122000
@RF00267 L     @01,CTGPLPTR                                        0271 00123000
         L     @01,CTGENT(,@01)                                    0271 00124000
         MVC   CIWORK(3),CIWORK2(@01)                              0271 00125000
*       CALL FINDCI;                /* GET PROPER CI INTO CORE       */ 00126000
@RC00267 BAL   @14,FINDCI                                          0272 00127000
*       CPX=CPE0;                                                  0273 00128000
         ST    CPE0,CPX                                            0273 00129000
*       GPFLDPTR=CTGWKA+FOUR;       /* SET OUTPUT POINTER            */ 00130000
         L     @01,CTGPLPTR                                        0274 00131000
         L     @15,CTGWKA(,@01)                                    0274 00132000
         LA    GPFLDPTR,4                                          0274 00133000
         ALR   GPFLDPTR,@15                                        0274 00134000
*       CTWKLIMT=WORKLEN+CTGWKA;    /* SET WORK AREA LIMIT           */ 00135000
         LH    @08,WORKLEN(,@15)                                   0275 00136000
         ALR   @08,@15                                             0275 00137000
         ST    @08,CTWKLIMT                                        0275 00138000
*       DO IX=1 TO CTGNOFLD;        /* PROCESS ALL FIELDS REQUEST    */ 00139000
         LA    IX,1                                                0276 00140000
         B     @DE00276                                            0276 00141000
@DL00276 DS    0H                                                  0277 00142000
*         CTGFLPTR=CTGFIELD(IX);    /* FIELD PTR FOR CAT INTERFAC    */ 00143000
         LR    @08,IX                                              0277 00144000
         SLA   @08,2                                               0277 00145000
         L     @06,CTGPLPTR                                        0277 00146000
         L     @08,CTGFIELD-4(@08,@06)                             0277 00147000
         ST    @08,CTGFLPTR                                        0277 00148000
*         CTGFLPT(ONE)=GPFLDPTR;    /* SET OUTPUT POINTER            */ 00149000
         ST    GPFLDPTR,CTGFLPT(,@08)                              0278 00150000
*         CALL CTINTFAC;            /* CATALOG INTERFACE             */ 00151000
         BAL   @14,CTINTFAC                                        0279 00152000
*         CTGFLNG(ONE)=GPFLDPTR-CTGFLPT(ONE);/* SET LENGTH           */ 00153000
         L     @08,CTGFLPTR                                        0280 00154000
         LR    @06,GPFLDPTR                                        0280 00155000
         SL    @06,CTGFLPT(,@08)                                   0280 00156000
         ST    @06,CTGFLNG(,@08)                                   0280 00157000
*         IF CTGFLNG(ONE)=ZERO THEN /* SET OUTPUT PTR ONLY IF DATA   */ 00158000
         SLR   @15,@15                                             0281 00159000
         CR    @06,@15                                             0281 00160000
         BNE   @RF00281                                            0281 00161000
*           CTGFLPT(ONE)=ZERO;      /* INDICATE NO VALUE             */ 00162000
         ST    @15,CTGFLPT(,@08)                                   0282 00163000
*       END;                                                       0283 00164000
@RF00281 AL    IX,@CF00077                                         0283 00165000
@DE00276 L     @08,CTGPLPTR                                        0283 00166000
         SLR   @06,@06                                             0283 00167000
         IC    @06,CTGNOFLD(,@08)                                  0283 00168000
         CR    IX,@06                                              0283 00169000
         BNH   @DL00276                                            0283 00170000
*     END;                                                         0284 00171000
*EXIT:                                                             0285 00172000
*   IF OSSW=ON THEN                 /* WAS IT AN O.S. TYPE LOCATE?   */ 00173000
@RC00255 DS    0H                                                  0285 00174000
EXIT     TM    OSSW,B'00000001'                                    0285 00175000
         BNO   @RF00285                                            0285 00176000
*     DO;                           /* YES DO                        */ 00177000
*       FREEAD=CTGPLPTR;            /* ADDRESS OF CORE TO FREE       */ 00178000
         L     @15,CTGPLPTR                                        0287 00179000
         ST    @15,FREEAD                                          0287 00180000
*       FREELEN=CTGDDNM;            /* LENGTH OF CORE TO FREE        */ 00181000
         L     @15,CTGDDNM(,@15)                                   0288 00182000
         ST    @15,FREELEN                                         0288 00183000
*       CALL FREEWORK;              /* FREE WORKING STORAGE          */ 00184000
         BAL   @14,FREEWORK                                        0289 00185000
*     END;                                                         0290 00186000
*   FREELEN=LENGTH(CATLGBUF)*TEN;   /* BUFFER LENGTH                 */ 00187000
@RF00285 MVC   FREELEN(4),@CF02590                                 0291 00188000
*   FREEAD=CATBFPTR;                                               0292 00189000
         L     @15,CATBFPTR                                        0292 00190000
         ST    @15,FREEAD                                          0292 00191000
*   CALL FREEWORK;                  /* CALL FREEMAIN ROUTINE         */ 00192000
         BAL   @14,FREEWORK                                        0293 00193000
*   RETURN CODE(ERRCD);             /* RETURN TO USER (NORMAL EXIT)  */ 00194000
*                                                                  0294 00195000
         L     @09,ERRCD                                           0294 00196000
         L     @13,4(,@13)                                         0294 00197000
         L     @00,@SIZDATD                                        0294 00198000
         LR    @01,@11                                             0294 00199000
         FREEMAIN R,LV=(0),A=(1)                                        00200000
         LR    @15,@09                                             0294 00201000
         L     @14,12(,@13)                                        0294 00202000
         LM    @00,@12,20(@13)                                     0294 00203000
         BR    @14                                                 0294 00204000
*   /*****************************************************************/ 00205000
*   /*                                                               */ 00206000
*   /* E X I T                                                       */ 00207000
*   /*                                                               */ 00208000
*   /*****************************************************************/ 00209000
*                                                                  0295 00210000
*MAPOSCPL:                                                         0295 00211000
*                                                                  0295 00212000
*   /*****************************************************************/ 00213000
*   /*                                                               */ 00214000
*   /* MAP AN OS CAMLIST INTO A VSAM CPL-FPL COMBINATION             */ 00215000
*   /*                                                               */ 00216000
*   /*****************************************************************/ 00217000
*                                                                  0295 00218000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0295 00219000
@EL00001 L     @13,4(,@13)                                         0295 00220000
@EF00001 L     @00,@SIZDATD                                        0295 00221000
         LR    @01,@11                                             0295 00222000
         FREEMAIN R,LV=(0),A=(1)                                        00223000
@ER00001 LM    @14,@12,12(@13)                                     0295 00224000
         BR    @14                                                 0295 00225000
MAPOSCPL DS    0H                                                  0296 00226000
*   GEN(ST     R14,RSAVA);                                         0296 00227000
         ST     R14,RSAVA                                               00228000
*   WKLEN=LENGTH(CTGPL)+FOUR        /* GET CORE FOR SIMULATED CPL    */ 00229000
*       +LENGTH(CTGFL)              /* AND AN FPL                    */ 00230000
*       +H44                        /* ROOM TO COPY NAME             */ 00231000
*       +H272;                      /* AND A CATALOG WORK AREA       */ 00232000
         MVC   WKLEN(2),@CH02591                                   0297 00233000
*   CALL GETWORK;                   /* GET WORKING STORAGE           */ 00234000
         BAL   @14,GETWORK                                         0298 00235000
*   OSSW=ON;                        /* SET O.S. LOCATE FLAG          */ 00236000
         OI    OSSW,B'00000001'                                    0299 00237000
*   CAMLSTPT=CTGPLPTR;              /* SAVE THE CAMLST POINTER       */ 00238000
         L     @09,CTGPLPTR                                        0300 00239000
         ST    @09,CAMLSTPT                                        0300 00240000
*   CTGPLPTR=WKCORE;                                               0301 00241000
         L     @09,WKCORE                                          0301 00242000
         ST    @09,CTGPLPTR                                        0301 00243000
*   CTGDDNM=WKLEN;                  /* SAVE FOR FREEMAIN             */ 00244000
         LH    @15,WKLEN                                           0302 00245000
         ST    @15,CTGDDNM(,@09)                                   0302 00246000
*   CTGFLPTR=WKCORE+LENGTH(CTGPL)+FOUR;/* LEAVE ROOM FOR CTGFIELD    */ 00247000
         LA    @15,32                                              0303 00248000
         ALR   @15,@09                                             0303 00249000
         ST    @15,CTGFLPTR                                        0303 00250000
*   CTGOPTN1='84'X;                 /* SET OPTION FLAGS              */ 00251000
         MVI   CTGOPTN1(@09),X'84'                                 0304 00252000
*   CTGOPTN2='00'X;                 /*                               */ 00253000
         MVI   CTGOPTN2(@09),X'00'                                 0305 00254000
*   CTGOPTN3='20'X;                                                0306 00255000
         MVI   CTGOPTN3(@09),X'20'                                 0306 00256000
*   CTGOPTN4='00'X;                 /* SET LAST OPTION BYTE          */ 00257000
         MVI   CTGOPTN4(@09),X'00'                                 0307 00258000
*   CTGENT=ADDR(CTGFL)+LENGTH(CTGFL);/* POINTER TO DATA SET NAME     */ 00259000
         AL    @15,@CF00727                                        0308 00260000
         ST    @15,CTGENT(,@09)                                    0308 00261000
*   DSNAME=' ';                     /* SET AREA TO BLANKS            */ 00262000
         MVI   DSNAME+1(@15),C' '                                  0309 00263000
         MVC   DSNAME+2(42,@15),DSNAME+1(@15)                      0309 00264000
         MVI   DSNAME(@15),C' '                                    0309 00265000
*   DO IX=1 TO 44 WHILE(CAMPTR1->DSNAME(IX:IX)^=' ');              0310 00266000
         LA    IX,1                                                0310 00267000
@DL00310 L     @09,CAMLSTPT                                        0310 00268000
         L     @09,CAMPTR1(,@09)                                   0310 00269000
         LR    @06,@09                                             0310 00270000
         ALR   @06,IX                                              0310 00271000
         BCTR  @06,0                                               0310 00272000
         CLI   DSNAME(@06),C' '                                    0310 00273000
         BE    @DC00310                                            0310 00274000
*     DSNAME(IX:IX)=CAMPTR1->DSNAME(IX:IX);                        0311 00275000
         L     @06,CTGPLPTR                                        0311 00276000
         L     @06,CTGENT(,@06)                                    0311 00277000
         ALR   @06,IX                                              0311 00278000
         BCTR  @06,0                                               0311 00279000
         ALR   @09,IX                                              0311 00280000
         BCTR  @09,0                                               0311 00281000
         MVC   DSNAME(1,@06),DSNAME(@09)                           0311 00282000
*   END;                                                           0312 00283000
         AL    IX,@CF00077                                         0312 00284000
         C     IX,@CF02048                                         0312 00285000
         BNH   @DL00310                                            0312 00286000
@DC00310 DS    0H                                                  0313 00287000
*   CTGWKA=WKCORE+WKLEN-H272;       /* POINT TO WORK AREA            */ 00288000
         L     @15,CTGPLPTR                                        0313 00289000
         LH    @14,WKLEN                                           0313 00290000
         AL    @14,WKCORE                                          0313 00291000
         SL    @14,@CF02483                                        0313 00292000
         ST    @14,CTGWKA(,@15)                                    0313 00293000
*   WORKLEN=H260;                   /* SET WORK AREA LENGTH TO WHAT     00294000
*                                      WE CAN MAP BACK               */ 00295000
         LA    @07,260                                             0314 00296000
         STH   @07,WORKLEN(,@14)                                   0314 00297000
*   GPFLDPTR=CTGWKA+FOUR;           /* SET START                     */ 00298000
         LA    GPFLDPTR,4                                          0315 00299000
         ALR   GPFLDPTR,@14                                        0315 00300000
*   CTWKLIMT=CTGWKA+WORKLEN;        /* SET END OF AREA               */ 00301000
         ALR   @14,@07                                             0316 00302000
         ST    @14,CTWKLIMT                                        0316 00303000
*   CTGNOFLD=ONE;                   /* INDICATE ONE FIELD            */ 00304000
         MVI   CTGNOFLD(@15),X'01'                                 0317 00305000
*   CTGFIELD(ONE)=CTGFLPTR;         /* POINT TO FPL                  */ 00306000
         L     @14,CTGFLPTR                                        0318 00307000
         ST    @14,CTGFIELD(,@15)                                  0318 00308000
*   CTGFLDNM=ADDR('OSLOCATE');      /* POINT TO COMBO FIELD FOR    0319 00309000
*                                      ANSWERING OS LOCATES          */ 00310000
         LA    @15,@CC02522                                        0319 00311000
         ST    @15,CTGFLDNM(,@14)                                  0319 00312000
*   GEN(L      R14,RSAVA);          /* RESTORE RETURN ADDRESS        */ 00313000
         L      R14,RSAVA                                               00314000
*   END MAPOSCPL;                                                  0321 00315000
@EL00002 DS    0H                                                  0321 00316000
@EF00002 DS    0H                                                  0321 00317000
@ER00002 BR    @14                                                 0321 00318000
*MAPCPLOS:                                                         0322 00319000
*                                                                  0322 00320000
*   /*****************************************************************/ 00321000
*   /*                                                               */ 00322000
*   /* MAP THE CATALOG DATA FROM THE CPL-FPL-WORKAREA INTO THE CAMLST*/ 00323000
*   /* WORK AREA                                                     */ 00324000
*   /*                                                               */ 00325000
*   /*****************************************************************/ 00326000
*                                                                  0322 00327000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0322 00328000
MAPCPLOS DS    0H                                                  0323 00329000
*   GEN(ST     R14,RSAVA);          /* SAVE RETURN ADDRESS           */ 00330000
         ST     R14,RSAVA                                               00331000
*   HLD=GPFLDPTR-TWELVE;            /* SAVE ADDRESS OF LAST ENTRY    */ 00332000
         LR    HLD,GPFLDPTR                                        0324 00333000
         SL    HLD,@CF00729                                        0324 00334000
*   GPFLDPTR=CTGWKA+FOUR;           /* POINT TO START OF 1ST VALUE   */ 00335000
         LA    GPFLDPTR,4                                          0325 00336000
         L     @07,CTGPLPTR                                        0325 00337000
         AL    GPFLDPTR,CTGWKA(,@07)                               0325 00338000
*   IF GPFLDPTR>HLD THEN            /* ARE THERE VALUES?             */ 00339000
         CR    GPFLDPTR,HLD                                        0326 00340000
         BNH   @RF00326                                            0326 00341000
*     DO;                                                          0327 00342000
*       ERRCD=RCDSNF;               /* NO, SET ERROR CODE            */ 00343000
         MVC   ERRCD(4),@CF01430                                   0328 00344000
*       RETURN TO EXIT;             /* BAIL OUT                      */ 00345000
         LA    @14,EXIT                                            0329 00346000
@EL00003 DS    0H                                                  0329 00347000
@EF00003 DS    0H                                                  0329 00348000
@ER00003 BR    @14                                                 0329 00349000
*     END;                                                         0330 00350000
*   ELSE                            /* TRANSFER THE DATA             */ 00351000
*     DO;                                                          0331 00352000
@RF00326 DS    0H                                                  0332 00353000
*       CAMVOLPT(ONE)=GPVOLPTR;     /* MOVE ONE VOLUME PTR           */ 00354000
         MVC   CAMVOLPT(12,CAMWORK),GPVOLPTR(GPFLDPTR)             0332 00355000
*       GPFLDPTR=GPFLDPTR+TWELVE;   /* STEP WORKAREA POINTER         */ 00356000
         AL    GPFLDPTR,@CF00729                                   0333 00357000
*       IX=ONE;                     /* INITIALIZE INDEX              */ 00358000
         LA    IX,1                                                0334 00359000
*       DO GPFLDPTR=GPFLDPTR TO HLD BY TWELVE/* LOOP THROUGH VALUES  */ 00360000
*             WHILE(IX^<TWENTY);    /* COLLECTED FROM THE CATALOG    */ 00361000
         B     @DE00335                                            0335 00362000
@DL00335 C     IX,@CF01432                                         0335 00363000
         BL    @DC00335                                            0335 00364000
*         DO IX1=1 TO IX            /* NO DUPLICATE VOLUME ENTRIES   */ 00365000
*               WHILE(CAMVOLSR(IX1)^=GPVOLSER);                    0336 00366000
         LA    IX1,1                                               0336 00367000
         B     @DE00336                                            0336 00368000
@DL00336 LR    @03,IX1                                             0336 00369000
         MH    @03,@CH00729                                        0336 00370000
         ALR   @03,CAMWORK                                         0336 00371000
         AL    @03,@CF02604                                        0336 00372000
         CLC   CAMVOLSR-6(6,@03),GPVOLSER(GPFLDPTR)                0336 00373000
         BE    @DC00336                                            0336 00374000
*         END;                                                     0337 00375000
         AL    IX1,@CF00077                                        0337 00376000
@DE00336 CR    IX1,IX                                              0337 00377000
         BNH   @DL00336                                            0337 00378000
@DC00336 DS    0H                                                  0338 00379000
*         IF IX1=IX THEN            /* DID WE FIND A DUPLICATE?      */ 00380000
         CR    IX1,IX                                              0338 00381000
         BNE   @RF00338                                            0338 00382000
*           DO;                     /* NO MOVE VOLUME POINTER        */ 00383000
*             CAMVOLPT(IX)=GPVOLPTR;/*                               */ 00384000
         LR    @08,IX                                              0340 00385000
         MH    @08,@CH00729                                        0340 00386000
         ALR   @08,CAMWORK                                         0340 00387000
         AL    @08,@CF02605                                        0340 00388000
         MVC   CAMVOLPT-2(12,@08),GPVOLPTR(GPFLDPTR)               0340 00389000
*             IX=IX+ONE;            /* STEP INDEX                    */ 00390000
         AL    IX,@CF00077                                         0341 00391000
*           END;                                                   0342 00392000
*       END;                                                       0343 00393000
@RF00338 AL    GPFLDPTR,@CF00729                                   0343 00394000
@DE00335 CR    GPFLDPTR,HLD                                        0343 00395000
         BNH   @DL00335                                            0343 00396000
@DC00335 DS    0H                                                  0344 00397000
*       CAMWKCNT=IX;                /* SET COUNT OF ENTRIES          */ 00398000
         STH   IX,CAMWKCNT(,CAMWORK)                               0344 00399000
*     END;                                                         0345 00400000
*   GEN(L      R14,RSAVA);          /* RESTORE ADDRESS               */ 00401000
         L      R14,RSAVA                                               00402000
*   END MAPCPLOS;                                                  0347 00403000
         B     @EL00003                                            0347 00404000
*CTINTFAC:                                                         0348 00405000
*                                                                  0348 00406000
*   /*****************************************************************/ 00407000
*   /*                                                               */ 00408000
*   /* INTERFACE WITH THE CATALOG ROUTINE TRAP TEST FIELDS           */ 00409000
*   /*                                                               */ 00410000
*   /*****************************************************************/ 00411000
*                                                                  0348 00412000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0348 00413000
CTINTFAC DS    0H                                                  0349 00414000
*   GEN(ST   R14,RSAVAA);                                          0349 00415000
         ST   R14,RSAVAA                                                00416000
*   IF CTGFLCHN^=ZERO THEN          /* IS THERE A TEST FIELD?        */ 00417000
         L     @08,CTGFLPTR                                        0350 00418000
         L     @06,CTGFLCHN(,@08)                                  0350 00419000
         LTR   @06,@06                                             0350 00420000
         BZ    @RF00350                                            0350 00421000
*     DO;                           /* YES DO                        */ 00422000
*       SAVFLPTR=CTGFLPTR;          /* SAVE FIELD POINTER            */ 00423000
         LR    SAVFLPTR,@08                                        0352 00424000
*       CTGFLPTR=CTGFLCHN;          /* USE TEST FIELD POINTER        */ 00425000
         ST    @06,CTGFLPTR                                        0353 00426000
*       IF FLNAME^='ITYPEXT ' THEN  /* IS SSW TEST                   */ 00427000
         L     @08,CTGFLDNM(,@06)                                  0354 00428000
         CLC   FLNAME(8,@08),@CC02529                              0354 00429000
         BE    @RF00354                                            0354 00430000
*         DO;                       /* NO ERROR                      */ 00431000
*           ERRCD=RCINFNAM;         /* ERROR CODE                    */ 00432000
         MVC   ERRCD(4),@CF02084                                   0356 00433000
*           RETURN TO EXIT;         /* BAIL OUT                      */ 00434000
         LA    @14,EXIT                                            0357 00435000
@EL00004 DS    0H                                                  0357 00436000
@EF00004 DS    0H                                                  0357 00437000
@ER00004 BR    @14                                                 0357 00438000
*         END;                                                     0358 00439000
*       ELSE                        /* SSW TEST                      */ 00440000
*         SWSSW=ON;                 /* INTRESTED IN SSW DATA         */ 00441000
@RF00354 OI    SWSSW,B'00001000'                                   0359 00442000
*       IX8=CTGFLDCD;               /* SET PTR TO TEST FIELD         */ 00443000
         L     @08,CTGFLPTR                                        0360 00444000
         SLR   @06,@06                                             0360 00445000
         IC    @06,CTGFLDCD(,@08)                                  0360 00446000
         ST    @06,IX8                                             0360 00447000
*       IX9=CTGFLPT(ONE);                                          0361 00448000
         L     @06,CTGFLPT(,@08)                                   0361 00449000
         ST    @06,IX9                                             0361 00450000
*       IXA=CTGFLNG(ONE);                                          0362 00451000
         L     IXA,CTGFLNG(,@08)                                   0362 00452000
*       CTGFLPTR=SAVFLPTR;          /* RESTOTRE POINTERS             */ 00453000
         ST    SAVFLPTR,CTGFLPTR                                   0363 00454000
*     END;                                                         0364 00455000
*   CALL CATLG;                     /* NO TEST CALL CATLG            */ 00456000
@RF00350 BAL   @14,CATLG                                           0365 00457000
*   SWSSW=OFFX;                                                    0366 00458000
*   SWBADTST=OFFX;                  /* TURN OFF BAD SSW TEST         */ 00459000
         NI    SWSSW,B'11110101'                                   0367 00460000
*   GEN(L    R14,RSAVAA);                                          0368 00461000
         L    R14,RSAVAA                                                00462000
*   END CTINTFAC;                                                  0369 00463000
         B     @EL00004                                            0369 00464000
*CATLG:                                                            0370 00465000
*                                                                  0370 00466000
*   /*****************************************************************/ 00467000
*   /*                                                               */ 00468000
*   /* GET REQUESTED FIELD(S) FROM THE CATALOG                       */ 00469000
*   /*                                                               */ 00470000
*   /*****************************************************************/ 00471000
*                                                                  0370 00472000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0370 00473000
CATLG    DS    0H                                                  0371 00474000
*   GEN(ST     R14,RSAVA);                                         0371 00475000
         ST     R14,RSAVA                                               00476000
*   CPE0=CPX;                                                      0372 00477000
         L     CPE0,CPX                                            0372 00478000
*   SWCOMB=OFFX;                    /* SET COMBINATION SW OFF        */ 00479000
         NI    SWCOMB,B'01111111'                                  0373 00480000
*   DICTWK(1:2)=FLNAME(1:2);        /* FIRST HALVE OF CONDENSED NM   */ 00481000
         L     @08,CTGFLPTR                                        0374 00482000
         L     @08,CTGFLDNM(,@08)                                  0374 00483000
         MVC   DICTWK(2),FLNAME(@08)                               0374 00484000
*   DICTWK(3:4)=FLNAME(5:6);        /* SECOND HALVE OF COND NAME     */ 00485000
         MVC   DICTWK+2(2),FLNAME+4(@08)                           0375 00486000
*   DO DICTPTR=DICTSTR TO DICTEND BY 8/* SEARCH DICTIONARY FOR       */ 00487000
*         WHILE(DICTWK^=DICTNAME);  /* REQUESTED ENTRY NULL DO LOOP  */ 00488000
         L     @08,DICTSTR                                         0376 00489000
         ST    @08,DICTPTR                                         0376 00490000
         B     @DE00376                                            0376 00491000
@DL00376 CLC   DICTWK(4),DICTNAME(@08)                             0376 00492000
         BE    @DC00376                                            0376 00493000
*   END;                                                           0377 00494000
         AL    @08,@CF00049                                        0377 00495000
         ST    @08,DICTPTR                                         0377 00496000
@DE00376 C     @08,DICTEND                                         0377 00497000
         BNH   @DL00376                                            0377 00498000
@DC00376 DS    0H                                                  0378 00499000
*   IF DICTWK^=DICTNAME THEN        /* FOUND?                        */ 00500000
         L     @08,DICTPTR                                         0378 00501000
         CLC   DICTWK(4),DICTNAME(@08)                             0378 00502000
         BE    @RF00378                                            0378 00503000
*     DO;                           /* NO, DO                        */ 00504000
*       ERRCD=RCINFNAM;             /* SET RETURN CODE               */ 00505000
         MVC   ERRCD(4),@CF02084                                   0380 00506000
*       RETURN TO EXIT;             /* BAIL OUT                      */ 00507000
         LA    @14,EXIT                                            0381 00508000
@EL00005 DS    0H                                                  0381 00509000
@EF00005 DS    0H                                                  0381 00510000
@ER00005 BR    @14                                                 0381 00511000
*     END;                                                         0382 00512000
*   IF DICTCOMB=ON THEN             /* COMBINATION?                  */ 00513000
@RF00378 L     @08,DICTPTR                                         0383 00514000
         TM    DICTCOMB(@08),B'00100000'                           0383 00515000
         BNO   @RF00383                                            0383 00516000
*     SWCOMB=ON;                                                   0384 00517000
         OI    SWCOMB,B'10000000'                                  0384 00518000
*   IF(DICTGC=ZERO&DICTCOMB=OFFX)|DICTWK='CACB' THEN/* COMB OR GROUP    00519000
*                                      OR CATLG ACB REQ?             */ 00520000
@RF00383 L     @08,DICTPTR                                         0385 00521000
         CLI   DICTGC(@08),0                                       0385 00522000
         BNE   @GL00001                                            0385 00523000
         TM    DICTCOMB(@08),B'00100000'                           0385 00524000
         BZ    @RT00385                                            0385 00525000
@GL00001 CLC   DICTWK(4),@CC02534                                  0385 00526000
         BNE   @RF00385                                            0385 00527000
@RT00385 DS    0H                                                  0386 00528000
*     DO;                                                          0386 00529000
*       IF DICTWK='CACB' THEN       /* REQ FOR CATLG ACB ADDR?       */ 00530000
         CLC   DICTWK(4),@CC02534                                  0387 00531000
         BNE   @RF00387                                            0387 00532000
*         DO;                                                      0388 00533000
*           GPFIELD(1:4)=CBSACB;    /* GIVE THE ACBADDRESS           */ 00534000
         L     @08,CBSPTR                                          0389 00535000
         MVC   GPFIELD(4,GPFLDPTR),CBSACB(@08)                     0389 00536000
*           GPFLDPTR=GPFLDPTR+FOUR;                                0390 00537000
         AL    GPFLDPTR,@CF00039                                   0390 00538000
*         END;                                                     0391 00539000
*       ELSE                        /* NOT CATLG ACB REQ             */ 00540000
*         CALL MOVFIXED;            /* MOVE A FIXED LENGTH FIELD     */ 00541000
         B     @RC00387                                            0392 00542000
@RF00387 BAL   @14,MOVFIXED                                        0392 00543000
*     END;                                                         0393 00544000
*   ELSE                            /* COMBINATION OR GROUP          */ 00545000
*     DO;                                                          0394 00546000
         B     @RC00385                                            0394 00547000
@RF00385 DS    0H                                                  0395 00548000
*       IX3=ZERO;                   /* INITIALIZE TO AVOID MSG       */ 00549000
         SLR   @08,@08                                             0395 00550000
         ST    @08,IX3                                             0395 00551000
*       IF SWCOMB=OFFX THEN         /* IF WE DON"T HAVE A COMBINATION   00552000
*                                      FIELD                         */ 00553000
         TM    SWCOMB,B'10000000'                                  0396 00554000
         BNZ   @RF00396                                            0396 00555000
*         IX2=ONE;                  /* SET LOOP COUNT TO 1           */ 00556000
         MVC   IX2(4),@CF00077                                     0397 00557000
*       ELSE                        /* IS COMBINATION FIELD          */ 00558000
*         DO;                                                      0398 00559000
         B     @RC00396                                            0398 00560000
@RF00396 DS    0H                                                  0399 00561000
*           IX3=ADDR(ZCS)+DICTST-ONE;/* POINT TO START OF DICTIONARY */ 00562000
         LA    @08,ZCS                                             0399 00563000
         L     @15,DICTPTR                                         0399 00564000
         SLR   @14,@14                                             0399 00565000
         IC    @14,DICTST(,@15)                                    0399 00566000
         ALR   @08,@14                                             0399 00567000
         BCTR  @08,0                                               0399 00568000
         ST    @08,IX3                                             0399 00569000
*           IX2=DICTLC;             /* LOOP COUNT = NBR OF FIELD     */ 00570000
         SLR   @08,@08                                             0400 00571000
         IC    @08,DICTLC(,@15)                                    0400 00572000
         ST    @08,IX2                                             0400 00573000
*         END;                                                     0401 00574000
*       SWREPT=ON;                  /* TURN REPEATING SW ON          */ 00575000
@RC00396 DS    0H                                                  0403 00576000
*       SWVALUE=ON;                 /* SET VALUE FLAG ON             */ 00577000
         OI    SWREPT,B'00110000'                                  0403 00578000
*       GRPSEQNO=ONE;               /* SET THE GROUP SEQUENCE NBR    */ 00579000
         MVI   GRPSEQNO,X'01'                                      0404 00580000
*       DO WHILE SWREPT=ON&SWVALUE=ON;/* GET REPEATING VALUES        */ 00581000
         B     @DE00405                                            0405 00582000
@DL00405 DS    0H                                                  0406 00583000
*         SWDEL=OFFX;               /* DELETED SW OFF                */ 00584000
*         SWREPT=OFFX;                                             0407 00585000
*         SWVALUE=OFFX;                                            0408 00586000
*         SWREEP=OFFX;              /* RELREPNO SW OFF       @Z40WSRG*/ 00587000
         NI    SWDEL,B'10001011'                                   0409 00588000
*         DO IX1=1 TO IX2           /* GET ALL VALUES OF COMB        */ 00589000
*               WHILE(SWDEL=OFFX);  /* QUIT IF GROUP DELETED         */ 00590000
         LA    IX1,1                                               0410 00591000
         B     @DE00410                                            0410 00592000
@DL00410 TM    SWDEL,B'00000100'                                   0410 00593000
         BNZ   @DC00410                                            0410 00594000
*           IF SWCOMB=ON THEN       /* COMBINATION FIELD?            */ 00595000
         TM    SWCOMB,B'10000000'                                  0411 00596000
         BNO   @RF00411                                            0411 00597000
*             DICTPTR=COMBPTR(IX1)*EIGHT-/* SET DICTPTR USING THE    */ 00598000
*                 EIGHT+ADDR(ZDT);  /* COMB PART OF DICTIONARY       */ 00599000
         L     @01,IX3                                             0412 00600000
         BCTR  @01,0                                               0412 00601000
         SLR   @00,@00                                             0412 00602000
         IC    @00,COMBPTR(IX1,@01)                                0412 00603000
         SLA   @00,3                                               0412 00604000
         SL    @00,@CF00049                                        0412 00605000
         LA    @01,ZDT                                             0412 00606000
         ALR   @00,@01                                             0412 00607000
         ST    @00,DICTPTR                                         0412 00608000
*           IF DICTNAME='REEP' THEN /* IS RELREPNO THE FIELD?        */ 00609000
@RF00411 L     @01,DICTPTR                                         0413 00610000
         CLC   DICTNAME(4,@01),@CC02536                            0413 00611000
         BNE   @RF00413                                            0413 00612000
*             SWREEP=ON;            /* SET SW TO GET RELREPNO        */ 00613000
         OI    SWREEP,B'01000000'                                  0414 00614000
*           ELSE                    /* NOT RELREPNO FIELD            */ 00615000
*             IF DICTGC=ZERO THEN   /* DO WE HAVE A GROUP?           */ 00616000
         B     @RC00413                                            0415 00617000
@RF00413 L     @01,DICTPTR                                         0415 00618000
         CLI   DICTGC(@01),0                                       0415 00619000
         BNE   @RF00415                                            0415 00620000
*               CALL MOVFIXED;      /* MOVE FIXED FIELD TO OUTPUT    */ 00621000
         BAL   @14,MOVFIXED                                        0416 00622000
*             ELSE                  /* WE HAVE A GROUP               */ 00623000
*               CALL GETGROUP;      /* GET A GROUP ELEMENT           */ 00624000
         B     @RC00415                                            0417 00625000
@RF00415 BAL   @14,GETGROUP                                        0417 00626000
*         END;                                                     0418 00627000
@RC00415 DS    0H                                                  0418 00628000
@RC00413 AL    IX1,@CF00077                                        0418 00629000
@DE00410 C     IX1,IX2                                             0418 00630000
         BNH   @DL00410                                            0418 00631000
@DC00410 DS    0H                                                  0419 00632000
*         GRPSEQNO=GRPSEQNO+ONE;    /* STEP GROUP SEQUENCE NBR       */ 00633000
         IC    @08,GRPSEQNO                                        0419 00634000
         LA    @08,1(,@08)                                         0419 00635000
         STC   @08,GRPSEQNO                                        0419 00636000
*       END;                                                       0420 00637000
@DE00405 TM    SWREPT,B'00110000'                                  0420 00638000
         BO    @DL00405                                            0420 00639000
*     END;                                                         0421 00640000
*   GEN(L      R14,RSAVA);                                         0422 00641000
@RC00385 DS    0H                                                  0422 00642000
         L      R14,RSAVA                                               00643000
*   END CATLG;                                                     0423 00644000
         B     @EL00005                                            0423 00645000
*GETGROUP:                                                         0424 00646000
*                                                                  0424 00647000
*   /*****************************************************************/ 00648000
*   /*                                                               */ 00649000
*   /* GET A VALUE FROM A GROUP OCCURENCE ENTRY IN THE CATLAOG       */ 00650000
*   /*                                                               */ 00651000
*   /*****************************************************************/ 00652000
*                                                                  0424 00653000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0424 00654000
GETGROUP DS    0H                                                  0425 00655000
*   GEN(ST     R14,RSAVB);                                         0425 00656000
         ST     R14,RSAVB                                               00657000
*   CALL FINDGOP;                   /* FIND THE PROPER GOP           */ 00658000
         BAL   @14,FINDGOP                                         0426 00659000
*   IF(CCACPE5<CCACPE3)&(CATGODEL=OFFX) THEN/* DID WE FIND A VALUE   */ 00660000
         C     CCACPE5,CCACPE3(,CPE0)                              0427 00661000
         BNL   @RF00427                                            0427 00662000
         TM    CATGODEL(CCACPE5),B'01000000'                       0427 00663000
         BNZ   @RF00427                                            0427 00664000
*     DO;                           /* YES CONTINUE                  */ 00665000
*       IF SWREEP=ON THEN           /* RELREPNO REQUESTED?           */ 00666000
         TM    SWREEP,B'01000000'                                  0429 00667000
         BNO   @RF00429                                            0429 00668000
*         DO;                       /* YES DO                        */ 00669000
*           RREPNO=GRPSEQNO;        /* MOVE TO OUTPUT                */ 00670000
         SLR   @03,@03                                             0431 00671000
         IC    @03,GRPSEQNO                                        0431 00672000
         STH   @03,RREPNO(,GPFLDPTR)                               0431 00673000
*           GPFLDPTR=GPFLDPTR+TWO;  /* ADVANCE PTR                   */ 00674000
         AL    GPFLDPTR,@CF00035                                   0432 00675000
*           SWREEP=OFFX;            /* RESET SWITCH                  */ 00676000
         NI    SWREEP,B'10111111'                                  0433 00677000
*         END;                                                     0434 00678000
*       IF DICTREP=ON THEN          /* IS REPEATING FIELD?           */ 00679000
@RF00429 L     @03,DICTPTR                                         0435 00680000
         TM    DICTREP(@03),B'01000000'                            0435 00681000
         BNO   @RF00435                                            0435 00682000
*         SWREPT=ON;                /* SET REPEAT SW                 */ 00683000
         OI    SWREPT,B'00100000'                                  0436 00684000
*       IF CATGOEXT=ON THEN         /* IS ENTRY IN ANOTHER RECORD    */ 00685000
@RF00435 TM    CATGOEXT(CCACPE5),B'10000000'                       0437 00686000
         BNO   @RF00437                                            0437 00687000
*         DO;                       /* YES, GO GET IT                */ 00688000
*           CIWORK=CATGOCI;         /* MOVE CI NBR TO WORKAREA       */ 00689000
         MVC   CIWORK(3),CATGOCI(CCACPE5)                          0439 00690000
*           CALL FINDCI;            /* FIND THE DESIRED REC          */ 00691000
         BAL   @14,FINDCI                                          0440 00692000
*           CALL FINDGOP;           /* FIND THE PROPER GOP           */ 00693000
         BAL   @14,FINDGOP                                         0441 00694000
*           IF CCACPE5^<CCACPE3|    /* MUST BE THERE                 */ 00695000
*               CATGOEXT=ON|        /* MUST NOT BE EXTERNAL          */ 00696000
*               CATGODEL=ON THEN    /* RECD'S MUST AGREE             */ 00697000
         C     CCACPE5,CCACPE3(,CPE0)                              0442 00698000
         BNL   @RT00442                                            0442 00699000
         TM    CATGOEXT(CCACPE5),B'11000000'                       0442 00700000
         BZ    @RF00442                                            0442 00701000
@RT00442 DS    0H                                                  0443 00702000
*             DO;                   /* WE HAVE A BAD RECORD          */ 00703000
*               ERRCD=RCINFNAM;     /* SET ERROR CODE                */ 00704000
         MVC   ERRCD(4),@CF02084                                   0444 00705000
*               RETURN TO EXIT;     /* BAIL OUT                      */ 00706000
         LA    @14,EXIT                                            0445 00707000
@EL00006 DS    0H                                                  0445 00708000
@EF00006 DS    0H                                                  0445 00709000
@ER00006 BR    @14                                                 0445 00710000
*             END;                                                 0446 00711000
*         END;                                                     0447 00712000
@RF00442 DS    0H                                                  0448 00713000
*       CALL MOVGROUP;              /* MOVE A G O ELEMENT            */ 00714000
@RF00437 BAL   @14,MOVGROUP                                        0448 00715000
*     END;                                                         0449 00716000
*   ELSE                            /* NO VALUE                      */ 00717000
*     IF(CCACPE5<CCACPE3)&(CATGODEL=ON) THEN/* DELETED RECORD?       */ 00718000
         B     @RC00427                                            0450 00719000
@RF00427 C     CCACPE5,CCACPE3(,CPE0)                              0450 00720000
         BNL   @RF00450                                            0450 00721000
         TM    CATGODEL(CCACPE5),B'01000000'                       0450 00722000
         BNO   @RF00450                                            0450 00723000
*       SWDEL=ON;                                                  0451 00724000
         OI    SWDEL,B'00000100'                                   0451 00725000
*   CPE0=CPX;                       /* RESTORE POINTER               */ 00726000
@RF00450 DS    0H                                                  0452 00727000
@RC00427 L     CPE0,CPX                                            0452 00728000
*   GEN(L      R14,RSAVB);                                         0453 00729000
         L      R14,RSAVB                                               00730000
*   END GETGROUP;                                                  0454 00731000
         B     @EL00006                                            0454 00732000
*FINDGOP:                                                          0455 00733000
*                                                                  0455 00734000
*   /*****************************************************************/ 00735000
*   /*                                                               */ 00736000
*   /* FIND THE PROPER GROUP OCCURENCE POINTER                       */ 00737000
*   /*                                                               */ 00738000
*   /*****************************************************************/ 00739000
*                                                                  0455 00740000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0455 00741000
FINDGOP  DS    0H                                                  0456 00742000
*   GEN(ST     R14,RSAVC);                                         0456 00743000
         ST     R14,RSAVC                                               00744000
*   CCACPE5=ADDR(REPGOPT(ONE));     /* POINT TO START OF GROUP     0457 00745000
*                                      OCCURENCE POINTERS            */ 00746000
         L     CCACPE5,CCACPE2(,CPE0)                              0457 00747000
         LA    CCACPE5,REPGOPT(,CCACPE5)                           0457 00748000
*   DO WHILE((CCACPE5<CCACPE3)&     /* NOT PASSED TO GOP'S           */ 00749000
*         ((DICTGC^=(CATGOGC1&TRUEGC))|/* FIND THE RIGHT GROUP       */ 00750000
*         (CATGOSEQ^=GRPSEQNO)));   /* AND THE RIGHT REPETITION      */ 00751000
         B     @DE00458                                            0458 00752000
@DL00458 DS    0H                                                  0459 00753000
*     CCACPE5=CCACPE5+LENGTH(CATGOPT);/* STEP BASE                   */ 00754000
         AL    CCACPE5,@CF00845                                    0459 00755000
*   END;                                                           0460 00756000
@DE00458 C     CCACPE5,CCACPE3(,CPE0)                              0460 00757000
         BNL   @DC00458                                            0460 00758000
         SLR   @03,@03                                             0460 00759000
         IC    @03,CATGOGC1(,CCACPE5)                              0460 00760000
         SLR   @15,@15                                             0460 00761000
         IC    @15,TRUEGC                                          0460 00762000
         NR    @03,@15                                             0460 00763000
         L     @01,DICTPTR                                         0460 00764000
         SLR   @00,@00                                             0460 00765000
         IC    @00,DICTGC(,@01)                                    0460 00766000
         CR    @03,@00                                             0460 00767000
         BNE   @DL00458                                            0460 00768000
         CLC   CATGOSEQ(1,CCACPE5),GRPSEQNO                        0460 00769000
         BNE   @DL00458                                            0460 00770000
@DC00458 DS    0H                                                  0461 00771000
*   GEN(L      R14,RSAVC);                                         0461 00772000
         L      R14,RSAVC                                               00773000
*   END FINDGOP;                                                   0462 00774000
@EL00007 DS    0H                                                  0462 00775000
@EF00007 DS    0H                                                  0462 00776000
@ER00007 BR    @14                                                 0462 00777000
*MOVFIXED:                                                         0463 00778000
*                                                                  0463 00779000
*   /*****************************************************************/ 00780000
*   /*                                                               */ 00781000
*   /* MOVE A FIXED LENGTH FIELD FROM A CATALOG RECORD TO THE USERS  */ 00782000
*   /* WORK AREA                                                     */ 00783000
*   /*                                                               */ 00784000
*   /*****************************************************************/ 00785000
*                                                                  0463 00786000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0463 00787000
MOVFIXED DS    0H                                                  0464 00788000
*   GEN(ST   R14,RSAVC);                                           0464 00789000
         ST   R14,RSAVC                                                 00790000
*   FLLENGTH=DICTLC;                                               0465 00791000
         L     @01,DICTPTR                                         0465 00792000
         SLR   @00,@00                                             0465 00793000
         IC    @00,DICTLC(,@01)                                    0465 00794000
         STH   @00,FLLENGTH                                        0465 00795000
*   CALL TESTSIZE;                  /* CHK WKAREA SIZE               */ 00796000
         BAL   @14,TESTSIZE                                        0466 00797000
*   IX4=DICTST+ONE;                                                0467 00798000
         LA    @15,1                                               0467 00799000
         L     @14,DICTPTR                                         0467 00800000
         SLR   @05,@05                                             0467 00801000
         IC    @05,DICTST(,@14)                                    0467 00802000
         ALR   @15,@05                                             0467 00803000
         ST    @15,IX4                                             0467 00804000
*   GPFIELD(1:FLLENGTH)=            /* OUTPUT AREA                   */ 00805000
*       CATRCD(IX4:IX4+FLLENGTH);   /* INPUT AREA                    */ 00806000
         LH    @14,FLLENGTH                                        0468 00807000
         LR    @05,@14                                             0468 00808000
         BCTR  @05,0                                               0468 00809000
         L     @01,CCACPE1(,CPE0)                                  0468 00810000
         ALR   @01,@15                                             0468 00811000
         BCTR  @01,0                                               0468 00812000
         EX    @05,@SM02610                                        0468 00813000
*   GPFLDPTR=GPFLDPTR+FLLENGTH;     /* ADVANCE POINTER               */ 00814000
         ALR   GPFLDPTR,@14                                        0469 00815000
*   SWVALUE=ON;                     /* INDICATE WE GOT A FIELD       */ 00816000
         OI    SWVALUE,B'00010000'                                 0470 00817000
*   GEN(L    R14,RSAVC);                                           0471 00818000
         L    R14,RSAVC                                                 00819000
*   END MOVFIXED;                                                  0472 00820000
@EL00008 DS    0H                                                  0472 00821000
@EF00008 DS    0H                                                  0472 00822000
@ER00008 BR    @14                                                 0472 00823000
*MOVGROUP:                                                         0473 00824000
*                                                                  0473 00825000
*   /*****************************************************************/ 00826000
*   /*                                                               */ 00827000
*   /* MOVE AN ELEMENT OF A GROUP OCCURENCE                          */ 00828000
*   /*                                                               */ 00829000
*   /*****************************************************************/ 00830000
*                                                                  0473 00831000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0473 00832000
MOVGROUP DS    0H                                                  0474 00833000
*   GEN(ST    R14,RSAVC);                                          0474 00834000
         ST    R14,RSAVC                                                00835000
*   CCACPE6=CCACPE3+CATGODSP;       /* SET POINTER TO FIELD          */ 00836000
         ICM   @03,12,CATGODSP(CCACPE5)                            0475 00837000
         SRA   @03,16                                              0475 00838000
         AL    @03,CCACPE3(,CPE0)                                  0475 00839000
         ST    @03,CCACPE6                                         0475 00840000
*   IF(SWSSW=ON)&SWBADTST=OFFX THEN /* INTRESTED IN SSW              */ 00841000
         TM    SWSSW,B'00001000'                                   0476 00842000
         BNO   @RF00476                                            0476 00843000
         TM    SWBADTST,B'00000010'                                0476 00844000
         BNZ   @RF00476                                            0476 00845000
*     DO;                           /* MAKE CONDITION TEST           */ 00846000
*       RFY                                                        0478 00847000
*        (R1,                                                      0478 00848000
*         R14,                                                     0478 00849000
*         R15) RSTD;                                               0478 00850000
*       R15=IX9->TESTSW;            /* POINT AT TEST FIELD           */ 00851000
         L     @06,IX9                                             0479 00852000
         SLR   R15,R15                                             0479 00853000
         IC    R15,TESTSW(,@06)                                    0479 00854000
*       R14=CCACPE6+DICTTYP;        /* POINT AT CATALOG FIELD        */ 00855000
         AL    @03,DICTTYP                                         0480 00856000
         LR    R14,@03                                             0480 00857000
*       R1=IX8;                     /* TEST CONDITION                */ 00858000
         L     R1,IX8                                              0481 00859000
*       GEN;                                                       0482 00860000
        EX    R15,SSWTEST              TEST USER SPECIFIED CONDITION    00861000
        EX    R1,SSWTSTBR              USE BC INST FOR USERS CC         00862000
        B     SSWFAIL                  TEST FAILED                      00863000
SSWTEST TM    0(R14),0                 TEST FIELD                       00864000
SSWTSTBR BC   0,SSWOK                  IF COND SATISIFYED BR            00865000
*SSWFAIL:                                                          0483 00866000
*       SWBADTST=ON;                /* SET TEST FAILED SW            */ 00867000
SSWFAIL  OI    SWBADTST,B'00000010'                                0483 00868000
*SSWOK:                             /* PASSED USER TEST              */ 00869000
*       RFY                                                        0484 00870000
*        (R1,                                                      0484 00871000
*         R14,                                                     0484 00872000
*         R15) UNRSTD;                                             0484 00873000
SSWOK    DS    0H                                                  0485 00874000
*     END;                                                         0485 00875000
*   IF SWBADTST=OFFX THEN           /* DID WE PASS TEST?             */ 00876000
@RF00476 TM    SWBADTST,B'00000010'                                0486 00877000
         BNZ   @RF00486                                            0486 00878000
*     DO;                                                          0487 00879000
*       IF DICTVAR=OFFX THEN        /* IS IT A VARIABLE LENGTH FLD   */ 00880000
         L     @06,DICTPTR                                         0488 00881000
         TM    DICTVAR(@06),B'10000000'                            0488 00882000
         BNZ   @RF00488                                            0488 00883000
*         DO;                       /* NO, DO                        */ 00884000
*           CCACPE6=CCACPE6+DICTST;                                0490 00885000
         SLR   @15,@15                                             0490 00886000
         IC    @15,DICTST(,@06)                                    0490 00887000
         AL    @15,CCACPE6                                         0490 00888000
         ST    @15,CCACPE6                                         0490 00889000
*           FLLENGTH=DICTLC;                                       0491 00890000
         SLR   @15,@15                                             0491 00891000
         IC    @15,DICTLC(,@06)                                    0491 00892000
         STH   @15,FLLENGTH                                        0491 00893000
*           CALL TESTSIZE;          /* CHK WKAREA SIZE               */ 00894000
         BAL   @14,TESTSIZE                                        0492 00895000
*           GPFIELD(1:FLLENGTH)=    /* OUTPUT AREA                   */ 00896000
*               CCACPE6->GPFIELD(1:FLLENGTH);/* INPUT AREA           */ 00897000
         LH    @06,FLLENGTH                                        0493 00898000
         LR    @15,@06                                             0493 00899000
         BCTR  @15,0                                               0493 00900000
         L     @01,CCACPE6                                         0493 00901000
         EX    @15,@SM02612                                        0493 00902000
*           GPFLDPTR=GPFLDPTR+FLLENGTH;/* ADVANCE OUTPUT POINTER     */ 00903000
         ALR   GPFLDPTR,@06                                        0494 00904000
*         END;                                                     0495 00905000
*       ELSE                        /* NOT VARIABLE LENGTH           */ 00906000
*         DO;                                                      0496 00907000
         B     @RC00488                                            0496 00908000
@RF00488 DS    0H                                                  0497 00909000
*           CCACPE7=CCACPE6+LENFIX; /* POINT TO START OF VAR FLDS    */ 00910000
         L     @06,CCACPE6                                         0497 00911000
         SLR   @15,@15                                             0497 00912000
         IC    @15,LENFIX(,@06)                                    0497 00913000
         ALR   @15,@06                                             0497 00914000
         ST    @15,CCACPE7                                         0497 00915000
*           IF DICTLC>CNTVAR THEN   /* CATLG ERROR?                  */ 00916000
         L     @01,DICTPTR                                         0498 00917000
         CLC   DICTLC(1,@01),CNTVAR(@06)                           0498 00918000
         BNH   @RF00498                                            0498 00919000
*             DO;                   /* YES QUIT                      */ 00920000
*               NVTFLWSC=NVTWCN10;                                 0500 00921000
         L     @06,NVTPTR                                          0500 00922000
         MVI   NVTFLWSC(@06),X'5F'                                 0500 00923000
*               GEN(LM   R2,R3,LOCPTR);                            0501 00924000
         LM   R2,R3,LOCPTR                                              00925000
*               GEN(IEAPMNIP TYPE=SWAIT);/* GO TO SYSTEM WAIT ROUTINE*/ 00926000
         IEAPMNIP TYPE=SWAIT                                            00927000
*             END;                                                 0503 00928000
*           DO IX4=2 TO DICTLC;     /* ADVANCE CATALOG PTR TO FLD    */ 00929000
@RF00498 LA    @06,2                                               0504 00930000
         B     @DE00504                                            0504 00931000
@DL00504 DS    0H                                                  0505 00932000
*             FLLENGTH=VARLEN+TWO;                                 0505 00933000
         L     @15,CCACPE7                                         0505 00934000
         ICM   @14,12,VARLEN(@15)                                  0505 00935000
         SRA   @14,16                                              0505 00936000
         AL    @14,@CF00035                                        0505 00937000
         STH   @14,FLLENGTH                                        0505 00938000
*             CCACPE7=CCACPE7+FLLENGTH;                            0506 00939000
         ALR   @15,@14                                             0506 00940000
         ST    @15,CCACPE7                                         0506 00941000
*           END;                                                   0507 00942000
         AL    @06,@CF00077                                        0507 00943000
@DE00504 ST    @06,IX4                                             0507 00944000
         L     @01,DICTPTR                                         0507 00945000
         SLR   @00,@00                                             0507 00946000
         IC    @00,DICTLC(,@01)                                    0507 00947000
         CR    @06,@00                                             0507 00948000
         BNH   @DL00504                                            0507 00949000
*           FLLENGTH=VARLEN+TWO;    /* STEP FLLENGTH ONE MORE TIM    */ 00950000
         L     @06,CCACPE7                                         0508 00951000
         ICM   @06,12,VARLEN(@06)                                  0508 00952000
         SRA   @06,16                                              0508 00953000
         LA    @06,2(,@06)                                         0508 00954000
         STH   @06,FLLENGTH                                        0508 00955000
*           CALL TESTSIZE;          /* CHK WKAREA SIZE               */ 00956000
         BAL   @14,TESTSIZE                                        0509 00957000
*           GPFIELD(1:FLLENGTH)=    /* OUTPUT AREA                   */ 00958000
*               CCACPE7->GPFIELD(1:FLLENGTH);/* INPUT AREA           */ 00959000
         LH    @06,FLLENGTH                                        0510 00960000
         LR    @15,@06                                             0510 00961000
         BCTR  @15,0                                               0510 00962000
         L     @01,CCACPE7                                         0510 00963000
         EX    @15,@SM02612                                        0510 00964000
*           GPFLDPTR=GPFLDPTR+FLLENGTH;                            0511 00965000
         ALR   GPFLDPTR,@06                                        0511 00966000
*         END;                                                     0512 00967000
*     END;                                                         0513 00968000
@RC00488 DS    0H                                                  0514 00969000
*   SWVALUE=ON;                     /* INDICATE WE GOT A FIELD       */ 00970000
@RF00486 OI    SWVALUE,B'00010000'                                 0514 00971000
*   GEN(L    R14,RSAVC);                                           0515 00972000
         L    R14,RSAVC                                                 00973000
*   END MOVGROUP;                                                  0516 00974000
@EL00009 DS    0H                                                  0516 00975000
@EF00009 DS    0H                                                  0516 00976000
@ER00009 BR    @14                                                 0516 00977000
*FINDCI:                                                           0517 00978000
*                                                                  0517 00979000
*   /*****************************************************************/ 00980000
*   /*                                                               */ 00981000
*   /* FIND A RECORD BY CI NBR. EITHER ON DISK OR IN CORE(BUFFER)    */ 00982000
*   /*                                                               */ 00983000
*   /*****************************************************************/ 00984000
*                                                                  0517 00985000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0517 00986000
FINDCI   DS    0H                                                  0518 00987000
*   GEN(ST     R14,RSAVC);                                         0518 00988000
         ST     R14,RSAVC                                               00989000
*   IX2=ONE;                        /* INITIALIZE SECONDARY INDEX    */ 00990000
         LA    @08,1                                               0519 00991000
         ST    @08,IX2                                             0519 00992000
*   CPE0=ZERO;                      /* INIT OUTPUT AREA              */ 00993000
         SLR   CPE0,CPE0                                           0520 00994000
*   DO IX1=1 TO TEN                 /* SEE IF REC IS IN BUFFER       */ 00995000
*         WHILE(BFCI(IX1)^=ZERO);   /* OR FIND AN AVAILABLE SLOT     */ 00996000
         LA    @15,1                                               0521 00997000
         LR    IX1,@15                                             0521 00998000
@DL00521 LR    @15,IX1                                             0521 00999000
         SLA   @15,3                                               0521 01000000
         L     @14,BFCI-9(@15)                                     0521 01001000
         LA    @14,0(,@14)                                         0521 01002000
         LTR   @14,@14                                             0521 01003000
         BZ    @DC00521                                            0521 01004000
*     IF BFCI(IX1)=CIWORK THEN      /* DID WE FIND IT?               */ 01005000
         SLR   @05,@05                                             0522 01006000
         ICM   @05,7,CIWORK                                        0522 01007000
         CR    @14,@05                                             0522 01008000
         BNE   @RF00522                                            0522 01009000
*       DO;                         /* YES, DO                       */ 01010000
*         CPE0=BFPTR(IX1);          /* SET OUTPUT POINTER            */ 01011000
         L     CPE0,BFPTR-8(@15)                                   0524 01012000
*         IF BFCTR(IX1)^=H255 THEN  /* IF NOT THE MAIN CI            */ 01013000
         SLR   @14,@14                                             0525 01014000
         IC    @14,BFCTR-8(@15)                                    0525 01015000
         C     @14,@CF02480                                        0525 01016000
         BE    @RF00525                                            0525 01017000
*           BFCTR(IX1)=BFCTR(IX1)+ONE;/* INCR USE COUNTER            */ 01018000
         AL    @14,@CF00077                                        0526 01019000
         STC   @14,BFCTR-8(@15)                                    0526 01020000
*       END;                                                       0527 01021000
*     ELSE                          /* NO UNUSED SLOTS               */ 01022000
*       IF BFCTR(IX1)<BFCTR(IX2) THEN/* SMALLEST USE CNT?            */ 01023000
         B     @RC00522                                            0528 01024000
@RF00522 LR    @15,IX1                                             0528 01025000
         SLA   @15,3                                               0528 01026000
         L     @14,IX2                                             0528 01027000
         SLA   @14,3                                               0528 01028000
         LA    @01,BFCTR-8(@15)                                    0528 01029000
         LA    @15,BFCTR-8(@14)                                    0528 01030000
         CLC   0(1,@01),0(@15)                                     0528 01031000
         BNL   @RF00528                                            0528 01032000
*         IX2=IX1;                  /* YES RESET                     */ 01033000
         ST    IX1,IX2                                             0529 01034000
*   END;                                                           0530 01035000
@RF00528 DS    0H                                                  0530 01036000
@RC00522 AL    IX1,@CF00077                                        0530 01037000
         C     IX1,@CF02180                                        0530 01038000
         BNH   @DL00521                                            0530 01039000
@DC00521 DS    0H                                                  0531 01040000
*   IF CPE0=ZERO THEN               /* DID WE FIND IT?               */ 01041000
         LTR   CPE0,CPE0                                           0531 01042000
         BNZ   @RF00531                                            0531 01043000
*     DO;                           /* NO, DO                        */ 01044000
*       BUFCDDDD=CIWORK*AMDCINV;    /* COMPUTE NEW RBA               */ 01045000
         L     @06,AMBPTR                                          0533 01046000
         L     @06,AMBDSB(,@06)                                    0533 01047000
         SLR   @01,@01                                             0533 01048000
         ICM   @01,7,CIWORK                                        0533 01049000
         M     @00,AMDCINV(,@06)                                   0533 01050000
         ST    @01,BUFCDDDD(,BUFCPTR)                              0533 01051000
*/* NOTE:                                                            */ 01052000
*/*      THE WAY THE RBA IS COMPUTED MAY CHANGE WHEN THE CATALOG     */ 01053000
*/*      COPY ROUTINE IS AVAILABLE.                                  */ 01054000
*                                                                  0534 01055000
*       CALL RDRBA;                 /* CALL THE BLOCK PROCESSOR      */ 01056000
         BAL   @14,RDRBA                                           0534 01057000
*       IF BFCI(IX1)^=ZERO THEN     /* IF THERE IS NO EMPTY SLOT     */ 01058000
         LR    @06,IX1                                             0535 01059000
         SLA   @06,3                                               0535 01060000
         L     @06,BFCI-9(@06)                                     0535 01061000
         LA    @06,0(,@06)                                         0535 01062000
         LTR   @06,@06                                             0535 01063000
         BZ    @RF00535                                            0535 01064000
*         IX1=IX2;                  /* USE THE LEAST USED SLOT       */ 01065000
         L     IX1,IX2                                             0536 01066000
*       BFCI(IX1)=CIWORK;           /* SET THE CI NBR                */ 01067000
@RF00535 LR    @06,IX1                                             0537 01068000
         SLA   @06,3                                               0537 01069000
         LA    @01,BFCI-8(@06)                                     0537 01070000
         MVC   0(3,@01),CIWORK                                     0537 01071000
*       IF BFCTR(IX1)^=H255 THEN    /* IF NOT THE MAIN REC           */ 01072000
         SLR   @15,@15                                             0538 01073000
         IC    @15,BFCTR-8(@06)                                    0538 01074000
         C     @15,@CF02480                                        0538 01075000
         BE    @RF00538                                            0538 01076000
*         BFCTR(IX1)=ONE;           /* INIT THE USE COUNT            */ 01077000
         LA    @15,1                                               0539 01078000
         STC   @15,BFCTR-8(@06)                                    0539 01079000
*       IX4=ADDR(CATLGBUF(IX1));    /* ADDR OF AREA TO PUT REC       */ 01080000
@RF00538 LR    @15,IX1                                             0540 01081000
         SLA   @15,9                                               0540 01082000
         L     @01,CATBFPTR                                        0540 01083000
         AL    @01,@CF02614                                        0540 01084000
         LA    @15,CATLGBUF(@15,@01)                               0540 01085000
         ST    @15,IX4                                             0540 01086000
*       IX5=BUFCBAD;                /* ADDR OF I/O BUFFER            */ 01087000
         L     @15,BUFCBAD(,BUFCPTR)                               0541 01088000
         ST    @15,IX5                                             0541 01089000
*       GEN REFS(IX4,IX5,CATCISZ) SETS(CATLGBUF,TEMPSR);           0542 01090000
        STM   R2,R5,TEMPSR                                              01091000
        L     R2,IX5                   FROM ADDRESS                     01092000
        L     R4,IX4                   TO ADDRESS                       01093000
        LA    R3,LNTHINDX              LENGTH OF RECORD                 01094000
        LR    R5,R3                    LENGTH OF RECORD                 01095000
        MVCL  R4,R2                    MOVE RECORD                      01096000
        LM    R2,R4,TEMPSR                                              01097000
*       CPE0=ADDR(CCACPE(IX1));     /* BASE FOR BASES                */ 01098000
         LR    CPE0,IX1                                            0543 01099000
         SLA   CPE0,4                                              0543 01100000
         LA    CPE0,CCACPE-16(CPE0)                                0543 01101000
*       CCACPE1=ADDR(CATLGBUF(IX1));                               0544 01102000
         LR    @15,IX1                                             0544 01103000
         SLA   @15,9                                               0544 01104000
         L     @01,CATBFPTR                                        0544 01105000
         AL    @01,@CF02614                                        0544 01106000
         LA    @15,CATLGBUF(@15,@01)                               0544 01107000
         ST    @15,CCACPE1(,CPE0)                                  0544 01108000
*       CCACPE7=CCACPE1+NREPLF;     /* START OF VARIABLE FLDS        */ 01109000
         SLR   @14,@14                                             0545 01110000
         IC    @14,NREPLF(,@15)                                    0545 01111000
         ALR   @14,@15                                             0545 01112000
         ST    @14,CCACPE7                                         0545 01113000
*       DO IX2=2 TO NREPCV;         /* FIND END OF VARIABLE FLDS     */ 01114000
         LA    @15,2                                               0546 01115000
         B     @DE00546                                            0546 01116000
@DL00546 DS    0H                                                  0547 01117000
*         CCACPE7=CCACPE7+VARLEN+TWO;                              0547 01118000
         L     @14,CCACPE7                                         0547 01119000
         ICM   @05,12,VARLEN(@14)                                  0547 01120000
         SRA   @05,16                                              0547 01121000
         ALR   @05,@14                                             0547 01122000
         AL    @05,@CF00035                                        0547 01123000
         ST    @05,CCACPE7                                         0547 01124000
*       END;                                                       0548 01125000
         AL    @15,@CF00077                                        0548 01126000
@DE00546 ST    @15,IX2                                             0548 01127000
         L     @14,CCACPE1(,CPE0)                                  0548 01128000
         SLR   @05,@05                                             0548 01129000
         IC    @05,NREPCV(,@14)                                    0548 01130000
         CR    @15,@05                                             0548 01131000
         BNH   @DL00546                                            0548 01132000
*       CCACPE2=CCACPE7;            /* PTR TO CTL INFO FOR REPEAT  0549 01133000
*                                      FIELDS                        */ 01134000
         L     @15,CCACPE7                                         0549 01135000
         ST    @15,CCACPE2(,CPE0)                                  0549 01136000
*       CCACPE3=CCACPE2+REPCNT*(LENGTH(CATGOPT))+/* POINTER TO       */ 01137000
*           LENGTH(EXTRCDPT)+LENGTH(REPCNT);/* GRP OCCURRENCES       */ 01138000
         SLR   @14,@14                                             0550 01139000
         IC    @14,REPCNT(,@15)                                    0550 01140000
         MH    @14,@CH00845                                        0550 01141000
         ALR   @15,@14                                             0550 01142000
         AL    @15,@CF00716                                        0550 01143000
         ST    @15,CCACPE3(,CPE0)                                  0550 01144000
*       CCACPE4=CCACPE1+RCDSIZ;     /* POINTER TO END OF RECORD      */ 01145000
         L     @15,CCACPE1(,CPE0)                                  0551 01146000
         ICM   @14,12,RCDSIZ(@15)                                  0551 01147000
         SRA   @14,16                                              0551 01148000
         ALR   @14,@15                                             0551 01149000
         ST    @14,CCACPE4(,CPE0)                                  0551 01150000
*       GEN(L      R14,RSAVC);                                     0552 01151000
         L      R14,RSAVC                                               01152000
*     END;                                                         0553 01153000
*   END FINDCI;                                                    0554 01154000
@EL00010 DS    0H                                                  0554 01155000
@EF00010 DS    0H                                                  0554 01156000
@ER00010 BR    @14                                                 0554 01157000
*GETTRNM:                                                          0555 01158000
*                                                                  0555 01159000
*   /*****************************************************************/ 01160000
*   /*                                                               */ 01161000
*   /* GET THE TRUE NAME RECORD (PROPER INDEX WILL BE IN IX)         */ 01162000
*   /*                                                               */ 01163000
*   /*****************************************************************/ 01164000
*                                                                  0555 01165000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0555 01166000
GETTRNM  DS    0H                                                  0556 01167000
*   GEN(ST     R14,RSAVA);                                         0556 01168000
         ST     R14,RSAVA                                               01169000
*   AMBPTR=AMBLIX;                  /* POINT TO INDEX                */ 01170000
         L     @03,AMBLIX(,AMBLPTR)                                0557 01171000
         ST    @03,AMBPTR                                          0557 01172000
*   BUFCPTR=IOMBUFC;                                               0558 01173000
         L     @01,AMBIOMB(,@03)                                   0558 01174000
         L     BUFCPTR,IOMBUFC(,@01)                               0558 01175000
*   BUFCDDDD=AMDHLRBA;              /* SET FIRST RBA                 */ 01176000
         L     @03,AMBDSB(,@03)                                    0559 01177000
         L     @03,AMDHLRBA(,@03)                                  0559 01178000
         ST    @03,BUFCDDDD(,BUFCPTR)                              0559 01179000
*   SCIBRCD=-ONE;                   /* SET FOR DO LOOP               */ 01180000
         SLR   SCIBRCD,SCIBRCD                                     0560 01181000
         BCTR  SCIBRCD,0                                           0560 01182000
*   DO WHILE(IXHLV^=ONE|SCIBRCD^=ZERO);/* DO UNTIL WE GET TO THE SS  */ 01183000
         B     @DE00561                                            0561 01184000
@DL00561 DS    0H                                                  0562 01185000
*     CALL RDRBA;                   /* GET AN INDEX RECORD           */ 01186000
         BAL   @14,RDRBA                                           0562 01187000
*     RFY                                                          0563 01188000
*       RETCODE RSTD;                                              0563 01189000
*     CALL SCIB;                    /* SCAN INDEX BLOCK              */ 01190000
         BAL   @14,SCIB                                            0564 01191000
*     SCIBRCD=RETCODE;              /* SAVE RETURN CD                */ 01192000
         LR    SCIBRCD,RETCODE                                     0565 01193000
*     IF RETCODE^=ZERO THEN         /* DID WE FIND AN ENTRY?         */ 01194000
         LTR   RETCODE,RETCODE                                     0566 01195000
         BZ    @RF00566                                            0566 01196000
*       BUFCDDDD=IXHHP;             /* NO USE THE HOROZANTAL PTR     */ 01197000
         L     @14,BUFCBAD(,BUFCPTR)                               0567 01198000
         L     @14,IXHHP(,@14)                                     0567 01199000
         ST    @14,BUFCDDDD(,BUFCPTR)                              0567 01200000
*     ELSE                          /* ENTRY FOUND                   */ 01201000
*       DO;                                                        0568 01202000
         B     @RC00566                                            0568 01203000
@RF00566 DS    0H                                                  0569 01204000
*         IX4=IXSHEP+LENGTH(IBFLPF) /* POINT TO THE RECORD           */ 01205000
*             +LENGTH(IBFLPL);      /* POINTER                       */ 01206000
         LA    @14,IXSPAREA                                        0569 01207000
         LA    @03,2                                               0569 01208000
         AL    @03,IXSHEP(,@14)                                    0569 01209000
         ST    @03,IX4                                             0569 01210000
*         IX5=IXHPTLS;              /* GET MASK FOR HEADER           */ 01211000
         L     @14,BUFCBAD(,BUFCPTR)                               0570 01212000
         SLR   @03,@03                                             0570 01213000
         IC    @03,IXHPTLS(,@14)                                   0570 01214000
         ST    @03,IX5                                             0570 01215000
*         GEN REFS(IX4,IX5);                                       0571 01216000
        STM   R2,R5,TEMPSR                                              01217000
        SR    R2,R2                                                     01218000
        L     R5,IX4                  LOAD ADDR OF POINTER              01219000
        L     R4,IX5                   LOAD MASK FROM REC HEADER        01220000
        EX    R4,INSERT                ICM THE NEXT REC PTR             01221000
        ST    R2,IX4                   SAVE VALUE                       01222000
        LM    R2,R5,TEMPSR             RECOVER REGS                     01223000
        B     NOINST                   DONT MOVE POINTER                01224000
INSERT  ICM   R2,0,0(R5)                MOVES POINTER FROM BUFFER       01225000
NOINST  EQU *                          BR POINT                         01226000
*         BUFCDDDD=IX4*AMDCINV+IXHBRBA;/* COMPUTE RBA OF NEXT REC    */ 01227000
         L     @14,AMBPTR                                          0572 01228000
         L     @14,AMBDSB(,@14)                                    0572 01229000
         L     @01,IX4                                             0572 01230000
         M     @00,AMDCINV(,@14)                                   0572 01231000
         L     @14,BUFCBAD(,BUFCPTR)                               0572 01232000
         AL    @01,IXHBRBA(,@14)                                   0572 01233000
         ST    @01,BUFCDDDD(,BUFCPTR)                              0572 01234000
*         HLDRBA=BUFCDDDD;                                         0573 01235000
         ST    @01,HLDRBA                                          0573 01236000
*       END;                                                       0574 01237000
*     RFY                                                          0575 01238000
*       RETCODE UNRSTD;                                            0575 01239000
@RC00566 DS    0H                                                  0576 01240000
*   END;                                                           0576 01241000
@DE00561 L     @03,BUFCBAD(,BUFCPTR)                               0576 01242000
         CLI   IXHLV(@03),1                                        0576 01243000
         BNE   @DL00561                                            0576 01244000
         LTR   SCIBRCD,SCIBRCD                                     0576 01245000
         BNZ   @DL00561                                            0576 01246000
*   AMBPTR=AMBLDTA;                 /* POINT TO INDEX                */ 01247000
         L     @15,AMBLDTA(,AMBLPTR)                               0577 01248000
         ST    @15,AMBPTR                                          0577 01249000
*   BUFCPTR=IOMBUFC;                                               0578 01250000
         L     @08,AMBIOMB(,@15)                                   0578 01251000
         L     BUFCPTR,IOMBUFC(,@08)                               0578 01252000
*   BUFCDDDD=HLDRBA;                /* COMPUTE RBA OF NEXT REC       */ 01253000
         L     @08,HLDRBA                                          0579 01254000
         ST    @08,BUFCDDDD(,BUFCPTR)                              0579 01255000
*   CALL RDRBA;                     /* RD BY RBA                     */ 01256000
         BAL   @14,RDRBA                                           0580 01257000
*   RFY                                                            0581 01258000
*     R0 RSTD;                                                     0581 01259000
*   R0=ONE;                                                        0582 01260000
         LA    R0,1                                                0582 01261000
*   IF RDF1LAST=ON THEN             /* DO WE HAVE A COUNT    @ZA07015*/ 01262000
         L     @08,BUFCBAD(,BUFCPTR)                               0583 01263000
         TM    RDF1LAST(@08),B'01000000'                           0583 01264000
         BNO   @RF00583                                            0583 01265000
*     IX=RECCNT;                    /* YES USE IT            @ZA07015*/ 01266000
         SLR   IX,IX                                               0584 01267000
         ICM   IX,3,RECCNT(@08)                                    0584 01268000
*   ELSE                                                           0585 01269000
*     IX=1;                         /* NO, USE A COUNT OF 1  @ZA07015*/ 01270000
         B     @RC00583                                            0585 01271000
@RF00583 LA    IX,1                                                0585 01272000
*   DO IX=IX TO 1 BY-1              /* SEARCH THE TRUE NAME CI     0586 01273000
*                                                            @ZA07015*/ 01274000
*         WHILE(R0^=ZERO);                                         0586 01275000
@RC00583 B     @DE00586                                            0586 01276000
@DL00586 LTR   R0,R0                                               0586 01277000
         BZ    @DC00586                                            0586 01278000
*     IF TRUENAME(IX)=DSNAME THEN   /* FOR THE TRUE NAME RECORD      */ 01279000
         LR    @08,IX                                              0587 01280000
         MH    @08,@CH02592                                        0587 01281000
         L     @06,BUFCBAD(,BUFCPTR)                               0587 01282000
         L     @01,CTGPLPTR                                        0587 01283000
         L     @01,CTGENT(,@01)                                    0587 01284000
         ST    @08,@TF00001                                        0587 01285000
         ALR   @08,@06                                             0587 01286000
         AL    @08,@CF02615                                        0587 01287000
         CLC   TRUENAME(44,@08),DSNAME(@01)                        0587 01288000
         BNE   @RF00587                                            0587 01289000
*       DO;                                                        0588 01290000
*         CIWORK=TRUENMCI(IX);      /* SET VALUE FOR LATER           */ 01291000
         AL    @06,@TF00001                                        0589 01292000
         AL    @06,@CF02616                                        0589 01293000
         MVC   CIWORK(3),TRUENMCI-44(@06)                          0589 01294000
*         R0=ZERO;                  /* GET OUT OF LOOP               */ 01295000
         SLR   R0,R0                                               0590 01296000
*       END;                                                       0591 01297000
*   END;                                                           0592 01298000
@RF00587 BCTR  IX,0                                                0592 01299000
@DE00586 LTR   IX,IX                                               0592 01300000
         BP    @DL00586                                            0592 01301000
@DC00586 DS    0H                                                  0593 01302000
*   IF R0^=ZERO THEN                /* DID WE FIND THE TRUE NAME     */ 01303000
         LTR   R0,R0                                               0593 01304000
         BZ    @RF00593                                            0593 01305000
*     DO;                                                          0594 01306000
*       ERRCD=RCENT;                /* SET ERROR CODE                */ 01307000
         MVC   ERRCD(4),@CF00049                                   0595 01308000
*       RETURN TO EXIT;             /* BAIL OUT                      */ 01309000
         LA    @14,EXIT                                            0596 01310000
@EL00011 DS    0H                                                  0596 01311000
@EF00011 DS    0H                                                  0596 01312000
@ER00011 BR    @14                                                 0596 01313000
*     END;                                                         0597 01314000
*   GEN(L    R14,RSAVA);                                           0598 01315000
@RF00593 DS    0H                                                  0598 01316000
         L    R14,RSAVA                                                 01317000
*   END GETTRNM;                                                   0599 01318000
         B     @EL00011                                            0599 01319000
*RDRBA:                                                            0600 01320000
*                                                                  0600 01321000
*   /*****************************************************************/ 01322000
*   /*                                                               */ 01323000
*   /* SET UP TO CALL THE BLOCK PROCESSOR                            */ 01324000
*   /*                                                               */ 01325000
*   /*****************************************************************/ 01326000
*                                                                  0600 01327000
*   PROC;                                                          0600 01328000
RDRBA    STM   @14,@12,@SA00012                                    0600 01329000
*   ECB=ZERO;                       /* SET THE ECB                   */ 01330000
         L     @01,AMBPTR                                          0601 01331000
         L     @01,AMBIOMB(,@01)                                   0601 01332000
         L     @15,IOMECBPT(,@01)                                  0601 01333000
         SLR   @14,@14                                             0601 01334000
         ST    @14,ECB(,@15)                                       0601 01335000
*   RFY                                                            0602 01336000
*    (R0,                                                          0602 01337000
*     R1,                                                          0602 01338000
*     R14,                                                         0602 01339000
*     R15) RSTD;                                                   0602 01340000
*   BUFCRRD=ON;                     /* INDICATE READ                 */ 01341000
*   BUFCXEDB=OFFX;                  /* TURN OFF EDB ERROR FLG        */ 01342000
         OI    BUFCRRD(BUFCPTR),B'00100000'                        0604 01343000
         NI    BUFCXEDB(BUFCPTR),B'11111011'                       0604 01344000
*   BUFCER1=OFFX;                   /* TURN OFF READ ERROR FLAG      */ 01345000
*   BUFCER2=OFFX;                   /* TURN OFF WRITE ERROR FLAG     */ 01346000
         NI    BUFCER1(BUFCPTR),B'11100111'                        0606 01347000
*   BUFCAVL='FF'X;                  /* INDICATE AVAILABLE            */ 01348000
         MVI   BUFCAVL(BUFCPTR),X'FF'                              0607 01349000
*   IOMFLAGS='0000'X;               /* RESET BLOCK PROCC FLAGS       */ 01350000
         L     @09,AMBPTR                                          0608 01351000
         L     @09,AMBIOMB(,@09)                                   0608 01352000
         MVI   IOMFLAGS+2(@09),X'00'                               0608 01353000
         MVC   IOMFLAGS(2,@09),@CB02569                            0608 01354000
*   R0=ADDR(SRB);                                                  0609 01355000
         L     @09,IOMIOSB(,@09)                                   0609 01356000
         L     R0,IOSSRB(,@09)                                     0609 01357000
*   R1=ADDR(IOSB);                                                 0610 01358000
         LR    R1,@09                                              0610 01359000
*   R15=ABPABP;                     /* ENTRY POINT ADDR FOR BP       */ 01360000
         L     @09,CVTPTR                                          0611 01361000
         L     @09,CVTIOBP(,@09)                                   0611 01362000
         L     R15,ABPABP(,@09)                                    0611 01363000
*   ABPWORK(1:80)=ABPCALL(1:80);    /* MOVE TO WORKING STG           */ 01364000
         MVC   ABPWORK(80),ABPCALL                                 0612 01365000
*   GEN(BAL R14,ABPWORK);           /* FOR RENTRENT CODE             */ 01366000
         BAL R14,ABPWORK                                                01367000
*   GEN DATA DEFS(ABPCALL);                                        0614 01368000
*LAB:                                                              0615 01369000
*   IF BUFCER1=ON|BUFCER2=ON|       /* I/O ERROR?                    */ 01370000
*       BUFCXEDB=ON THEN            /* POSSIBLE BAD CTL BLK          */ 01371000
LAB      TM    BUFCER1(BUFCPTR),B'00011000'                        0615 01372000
         BNZ   @RT00615                                            0615 01373000
         TM    BUFCXEDB(BUFCPTR),B'00000100'                       0615 01374000
         BNO   @RF00615                                            0615 01375000
@RT00615 DS    0H                                                  0616 01376000
*     DO;                                                          0616 01377000
*       ERRCD=RCIOL;                /* SET RETURN CODE               */ 01378000
         MVC   ERRCD(4),@CF00086                                   0617 01379000
*       RETURN TO EXIT;             /* BAIL OUT                      */ 01380000
         LA    @14,EXIT                                            0618 01381000
         LM    @15,@12,@SA00012+4                                  0618 01382000
         BR    @14                                                 0618 01383000
*     END;                                                         0619 01384000
*   R1=ADDR(ECB);                   /* SET UP FOR WAIT               */ 01385000
@RF00615 L     @09,AMBPTR                                          0620 01386000
         L     @09,AMBIOMB(,@09)                                   0620 01387000
         L     R1,IOMECBPT(,@09)                                   0620 01388000
*   GEN(WAIT ECB=(1));                                             0621 01389000
         WAIT ECB=(1)                                                   01390000
*   IF ECBCODE^='7F'X THEN          /* ERROR?                        */ 01391000
         L     @09,AMBPTR                                          0622 01392000
         L     @09,AMBIOMB(,@09)                                   0622 01393000
         L     @09,IOMECBPT(,@09)                                  0622 01394000
         CLI   ECBCODE(@09),X'7F'                                  0622 01395000
         BE    @RF00622                                            0622 01396000
*     DO;                                                          0623 01397000
*       ERRCD=RCIOL;                /* YES, SET RETURN CODE          */ 01398000
         MVC   ERRCD(4),@CF00086                                   0624 01399000
*       RETURN TO EXIT;             /* BAIL OUT                      */ 01400000
         LA    @14,EXIT                                            0625 01401000
         LM    @15,@12,@SA00012+4                                  0625 01402000
         BR    @14                                                 0625 01403000
*     END;                                                         0626 01404000
*   END RDRBA;                                                     0627 01405000
@EL00012 DS    0H                                                  0627 01406000
@EF00012 DS    0H                                                  0627 01407000
@ER00012 LM    @14,@12,@SA00012                                    0627 01408000
         BR    @14                                                 0627 01409000
*CTLBKPTR:                                                         0628 01410000
*                                                                  0628 01411000
*   /*****************************************************************/ 01412000
*   /*                                                               */ 01413000
*   /* ESTABLISH CONTACT WITH THE MASTER CATALOG CONTROL BLOCKS AND  */ 01414000
*   /* SET UP POINTERS                                               */ 01415000
*   /*                                                               */ 01416000
*   /*****************************************************************/ 01417000
*                                                                  0628 01418000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0628 01419000
CTLBKPTR DS    0H                                                  0629 01420000
*   GEN(ST     R14,RSAVA);                                         0629 01421000
         ST     R14,RSAVA                                               01422000
*   CBSPTR=CVTCBSP;                 /* ADDRESSING FOR THE AMCBS      */ 01423000
         L     @09,CVTPTR                                          0630 01424000
         L     @09,CVTCBSP(,@09)                                   0630 01425000
         ST    @09,CBSPTR                                          0630 01426000
*   AMBLPTR=ACBAMBL;                /* ADDRESSING FOR THE AMBL       */ 01427000
         L     @07,CBSACB(,@09)                                    0631 01428000
         L     AMBLPTR,ACBAMBL(,@07)                               0631 01429000
*   AMBPTR=AMBLDTA;                 /* PT FIRST AT THE DATA AMB      */ 01430000
         L     @09,AMBLDTA(,AMBLPTR)                               0632 01431000
         ST    @09,AMBPTR                                          0632 01432000
*   HLD=ZERO;                       /* SET TO AVOIND MSG             */ 01433000
         SLR   HLD,HLD                                             0633 01434000
*   DO IX=2 TO 1 BY-1;              /* BOTH DATA AND INDEX           */ 01435000
         LA    IX,2                                                0634 01436000
@DL00634 DS    0H                                                  0635 01437000
*     IF AMBPTR=AMBLDTA THEN        /* PLH IS ATTACHED ONLY TO DATA  */ 01438000
         L     @09,AMBPTR                                          0635 01439000
         C     @09,AMBLDTA(,AMBLPTR)                               0635 01440000
         BNE   @RF00635                                            0635 01441000
*       DO;                                                        0636 01442000
*         IOMPLH=AMBPH+LENGTH(IDAPLHDR);/* POINT AT PLACEHOLDER      */ 01443000
         L     @05,AMBIOMB(,@09)                                   0637 01444000
         LA    @04,16                                              0637 01445000
         AL    @04,AMBPH(,@09)                                     0637 01446000
         ST    @04,IOMPLH(,@05)                                    0637 01447000
*         HLD=IOMPLH;               /* SAVE TO USE WITH INDEX        */ 01448000
         LR    HLD,@04                                             0638 01449000
*       END;                                                       0639 01450000
*     ELSE                          /* INDEX AMB                     */ 01451000
*       IOMPLH=HLD;                 /* POINT TO PLACEHOLDER          */ 01452000
         B     @RC00635                                            0640 01453000
@RF00635 L     @09,AMBPTR                                          0640 01454000
         L     @09,AMBIOMB(,@09)                                   0640 01455000
         ST    HLD,IOMPLH(,@09)                                    0640 01456000
*     IOMBUFC=AMBBUFC+LENGTH(IDABUFDR);/* POINT TO BUFC              */ 01457000
@RC00635 L     @09,AMBPTR                                          0641 01458000
         L     @05,AMBIOMB(,@09)                                   0641 01459000
         LA    @04,20                                              0641 01460000
         AL    @04,AMBBUFC(,@09)                                   0641 01461000
         ST    @04,IOMBUFC(,@05)                                   0641 01462000
*     IOMCPA=IOMBUFC->BUFCCPA;      /* REQUIRED BY BLOCK PROCESS     */ 01463000
         L     @09,BUFCCPA(,@04)                                   0642 01464000
         ST    @09,IOMCPA(,@05)                                    0642 01465000
*     AMBPTR=AMBLIX;                /* SWITCH POINTERS TO INDEX      */ 01466000
         L     @09,AMBLIX(,AMBLPTR)                                0643 01467000
         ST    @09,AMBPTR                                          0643 01468000
*   END;                                                           0644 01469000
         BCTR  IX,0                                                0644 01470000
         LTR   IX,IX                                               0644 01471000
         BP    @DL00634                                            0644 01472000
*   AMBPTR=AMBLDTA;                 /* SET FOR LOCATE BY CI          */ 01473000
         L     @09,AMBLDTA(,AMBLPTR)                               0645 01474000
         ST    @09,AMBPTR                                          0645 01475000
*   BUFCPTR=IOMBUFC;                /* DATA SIDE ONLY THEN           */ 01476000
         L     @09,AMBIOMB(,@09)                                   0646 01477000
         L     BUFCPTR,IOMBUFC(,@09)                               0646 01478000
*   GEN(L    R14,RSAVA);                                           0647 01479000
         L    R14,RSAVA                                                 01480000
*   END CTLBKPTR;                                                  0648 01481000
@EL00013 DS    0H                                                  0648 01482000
@EF00013 DS    0H                                                  0648 01483000
@ER00013 BR    @14                                                 0648 01484000
*TESTSIZE:                                                         0649 01485000
*                                                                  0649 01486000
*   /*****************************************************************/ 01487000
*   /*                                                               */ 01488000
*   /* MAKE SURE THAT THE FIELD WE ARE BEING ASKED TO MOVE WILL FIT  */ 01489000
*   /* IN TO THE OUTPUT AREA                                         */ 01490000
*   /*                                                               */ 01491000
*   /*****************************************************************/ 01492000
*                                                                  0649 01493000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0649 01494000
TESTSIZE DS    0H                                                  0650 01495000
*   GEN(ST    R14,RSAVD);                                          0650 01496000
         ST    R14,RSAVD                                                01497000
*   IF GPFLDPTR+FLLENGTH>CTWKLIMT THEN/* FIELD TO BIG?               */ 01498000
         LR    @05,GPFLDPTR                                        0651 01499000
         AH    @05,FLLENGTH                                        0651 01500000
         C     @05,CTWKLIMT                                        0651 01501000
         BNH   @RF00651                                            0651 01502000
*     DO;                                                          0652 01503000
*       ERRCD=RCVLSM;               /* WORKAREA TO SMALL             */ 01504000
         MVC   ERRCD(4),@CF02048                                   0653 01505000
*       RETURN TO EXIT;             /* BAIL OUT                      */ 01506000
         LA    @14,EXIT                                            0654 01507000
@EL00014 DS    0H                                                  0654 01508000
@EF00014 DS    0H                                                  0654 01509000
@ER00014 BR    @14                                                 0654 01510000
*     END;                                                         0655 01511000
*   GEN(L    R14,RSAVD);                                           0656 01512000
@RF00651 DS    0H                                                  0656 01513000
         L    R14,RSAVD                                                 01514000
*   END TESTSIZE;                                                  0657 01515000
         B     @EL00014                                            0657 01516000
*GETWORK:                                                          0658 01517000
*                                                                  0658 01518000
*/* GET WORKING STORAGE - USE & FREED IN THIS MODULE                 */ 01519000
*                                                                  0658 01520000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0658 01521000
GETWORK  DS    0H                                                  0659 01522000
*   GEN(ST     R14,RSAVC);                                         0659 01523000
         ST     R14,RSAVC                                               01524000
*   WKLEN=(WKLEN+SEVEN)/EIGHT*EIGHT;                               0660 01525000
         LA    @02,7                                               0660 01526000
         AH    @02,WKLEN                                           0660 01527000
         SRDA  @02,32                                              0660 01528000
         D     @02,@CF00049                                        0660 01529000
         SLA   @03,3                                               0660 01530000
         STH   @03,WKLEN                                           0660 01531000
*   RFY                                                            0661 01532000
*     RETCODE RSTD;                                                0661 01533000
*   GEN REFS(WKLEN,LOCPTR) SETS(WKCORE,RETCODE);                   0662 01534000
         STM R2,R5,TEMPSR                                               01535000
         LH    R5,WKLEN                                                 01536000
         LM   R2,R3,LOCPTR                                              01537000
         GETMAIN EC,LV=(R5),A=WKCORE,SP=0,MF=(E,MAINLIST)               01538000
*   IF RETCODE^=ZERO THEN           /* IF GETMAIN WAS UNSUCCESSFULL  */ 01539000
         LTR   RETCODE,RETCODE                                     0663 01540000
         BZ    @RF00663                                            0663 01541000
*     DO;                                                          0664 01542000
*       NVTFLWSC=NVTWCN01;                                         0665 01543000
         L     @09,NVTPTR                                          0665 01544000
         MVI   NVTFLWSC(@09),X'63'                                 0665 01545000
*       GEN(IEAPMNIP TYPE=SWAIT);   /* GO TO SYSTEM WAIT ROUTINE     */ 01546000
         IEAPMNIP TYPE=SWAIT                                            01547000
*     END;                                                         0667 01548000
*   GEN(L     R4,WKCORE);                                          0668 01549000
@RF00663 DS    0H                                                  0668 01550000
         L     R4,WKCORE                                                01551000
*   GEN(SR    R3,R3);                                              0669 01552000
         SR    R3,R3                                                    01553000
*   GEN(MVCL R4,R2);                                               0670 01554000
         MVCL R4,R2                                                     01555000
*   GEN(LM R2,R5,TEMPSR);                                          0671 01556000
         LM R2,R5,TEMPSR                                                01557000
*   RFY                                                            0672 01558000
*     RETCODE UNRSTD;                                              0672 01559000
*   GEN(L      R14,RSAVC);                                         0673 01560000
         L      R14,RSAVC                                               01561000
*   END GETWORK;                                                   0674 01562000
@EL00015 DS    0H                                                  0674 01563000
@EF00015 DS    0H                                                  0674 01564000
@ER00015 BR    @14                                                 0674 01565000
*FREEWORK:                                                         0675 01566000
*                                                                  0675 01567000
*/* FREE TEMPORARY WORKING STORAGE                                   */ 01568000
*                                                                  0675 01569000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0675 01570000
FREEWORK DS    0H                                                  0676 01571000
*   GEN(ST     R14,RSAVC);                                         0676 01572000
         ST     R14,RSAVC                                               01573000
*   GEN REFS(LOCPTR) SETS(FREELEN,FREEAD,MAINLIST);                0677 01574000
         STM  R2,R5,TEMPSR                                              01575000
         L     R5,FREELEN                                               01576000
         LA    R4,FREEAD                                                01577000
         LM   R2,R3,LOCPTR                                              01578000
         FREEMAIN E,LV=(R5),A=(R4),SP=0,MF=(E,MAINLIST)                 01579000
         LM  R2,R5,TEMPSR                                               01580000
*   GEN(L      R14,RSAVC);                                         0678 01581000
         L      R14,RSAVC                                               01582000
*   END FREEWORK;                                                  0679 01583000
@EL00016 DS    0H                                                  0679 01584000
@EF00016 DS    0H                                                  0679 01585000
@ER00016 BR    @14                                                 0679 01586000
*SCIB:                                                             0680 01587000
*                                                                  0680 01588000
*   /*****************************************************************/ 01589000
*   /*                                                               */ 01590000
*   /* SCAN INDEX BLOCK ROUTTNE ---- THIS ROUTINE IS TAKEN ALMOST    */ 01591000
*   /* INTACT FROM IDA019RC. THE CHANGES ARE FOR THE PURPOSE OF      */ 01592000
*   /* KEEPING THE REGISTERS FREE.                                   */ 01593000
*   /*                                                               */ 01594000
*   /*****************************************************************/ 01595000
*                                                                  0680 01596000
*   PROC;                                                          0680 01597000
SCIB     STM   @14,@12,@SA00017                                    0680 01598000
*   IX4=BUFCBAD;                    /* ADDRESS OF THE START OF INPUT    01599000
*                                      BUFFER                        */ 01600000
         L     @09,BUFCBAD(,BUFCPTR)                               0681 01601000
         ST    @09,IX4                                             0681 01602000
*   IX5=ADDR(IDAIXSPL);             /* ADDRESS OF WORK AREA          */ 01603000
         LA    @09,IXSPAREA                                        0682 01604000
         ST    @09,IX5                                             0682 01605000
*   IX6=CTGENT;                     /* POINTER TO THE DSNAME         */ 01606000
         L     @09,CTGPLPTR                                        0683 01607000
         L     @09,CTGENT(,@09)                                    0683 01608000
         ST    @09,IX6                                             0683 01609000
*   GEN REFS(IBFLPF,IBFLPL,IXHLEO,IXHLL,IXHSEO,IXSEKON,IXSHEP,IXSLEP,   01610000
*       IXSPEC,IXSSEP,IXHFLPLN,IX4,IX5,IX6);                       0684 01611000
        L     RBUFC,IX4                                                 01612000
        L     RWORK3,IX5                                                01613000
        L     RPARM1,IX6                                                01614000
        SR    RWORK1,RWORK1            CLEAR REGISTER                   01615000
        STC   RWORK1,IXSPEC(RWORK3)    CLEAR PREVIOUS COUNTER           01616000
        SR    RWORK0,RWORK0            CLEAR REGISTER                   01617000
        IC    RWORK0,IXHFLPLN(RBUFC)   PICK UP F+L+POINTER LENGTH       01618000
        STC   RWORK0,IXSEKON(RWORK3)   SAVE IN WORK AREA                01619000
        OI    IXSBFLG(RWORK3),X80      SET FLAG SHOWING SECTION SEARCH  01620000
        ICM   RWORK1,K3,IXHLL(RBUFC)   GET RECORD LENGTH FROM HEADER    01621000
        AR    RWORK1,RBUFC             ADD TO BEGINNING ADD. OF BUFFER  01622000
        SR    RWORK1,RWORK0            BACK UP OVER F,L, POINTER        01623000
        ST    RWORK1,IXSLEP(RWORK3)    SAVE LOW KEY ADDRESS             01624000
        SR    RWORK1,RWORK1            CLEAR REG                        01625000
        ICM   RWORK1,K3,IXHSEO(RBUFC)  GET OFFSET TO 1ST SECTION        01626000
        AR    RWORK1,RBUFC             ADD BEGINNING ADD TO FORM TRUE   01627000
        SR    R15,R15                   ADDRESS                         01628000
COMFN1  SR    RWORK2,RWORK2            CLEAR REGISTERS                  01629000
COMFN2  SR    RWORK4,RWORK4             ...                             01630000
        SR    RWORK5,RWORK5             ...                             01631000
COMFN3  ST    RWORK1,IXSHEP(RWORK3)    SAVE STARTING POINT              01632000
        IC    RWORK2,IBFLPF(RWORK1)    PICK UP F FIELD                  01633000
        CR    RWORK2,R15               COMPARE IT TO NO. HITS           01634000
        BNE   SCIB2                    MISMATCH                         01635000
        TM    IBFLPL(RWORK1),X255     IS THE L FIELD ZERO               01636000
        BZ    SCIB9                    YES, DISCONTINUE THIS SEARCH     01637000
        IC    RWORK5,IBFLPL(RWORK1)    GET LENGTH OF KEY                01638000
        SR    RWORK1,RWORK5            MOVE POINTER TO BEGINNING OF     01639000
COMAI   IC    RWORK4,DZ(RPARM1,R15)     KEY--PICK UP ARG. CHARACTER     01640000
        IC    RWORK2,DZ(RWORK1)        PICK UP INDEX CHARACTER          01641000
        CR    RWORK4,RWORK2            ARE THEY EQUAL                   01642000
        BNE   SCIB1                    NO                               01643000
        LA    R15,ONE(R15)               YES, BUMP UP NO. HITS          01644000
        LA    RWORK1,ONE(RWORK1)       MOVE POINTER TO NEXT CHARACTER   01645000
        BCT   RWORK5,COMAI             BACK TO COMPARE IF ANY ARE LEFT  01646000
SCIB9   TM    IXSBFLG(RWORK3),X80      IS THIS A SECTION SEARCH         01647000
        BNZ   SCIB10                   YES                              01648000
        SR    R15,R15                  CLEAR REG  INDICATING SUCCESS    01649000
*SCIB91:                                                           0685 01650000
*   RETURN CODE(R15);               /* RETURN TO CALLER              */ 01651000
SCIB91   L     @14,@SA00017                                        0685 01652000
         LM    @00,@12,@SA00017+8                                  0685 01653000
         BR    @14                                                 0685 01654000
*   GEN;                                                           0686 01655000
SCIB1   BH    SCIB3                    IS THE ARG GREATER--YES          01656000
        B     SCIB9                    NO, SEARCH COMPLETE              01657000
SCIB2   BL    SCIB9                    IF F LESS THAN N GO              01658000
SCIB3   TM    IXSBFLG(RWORK3),X80     F HIGHER, IS THIS SECT. SEARCH    01659000
        BZ    SCIB5                    NO, INNER SECT, SEARCH           01660000
*                                                                       01661000
*   THE FOLLOWING CODE IS REQUIRED TO TEST FOR END OF BUFFER, THAT IS,  01662000
*   NO MORE SECTIONS FOLLOW TO BE SEARCHED.  IF NOT END OF SECTION      01663000
*   POINTERS MUST BE UPDATED TO NEXT SECTION.  ALSO THE LOW KEY ADD.    01664000
*   OF THE NEXT SECTION MUST BE SAVED. THE NO OF CHARACTERS WHICH HAVE  01665000
*   COMPARED EQUAL (HITS) IS ALSO SAVED FOR LATER USE IN SEARCHING      01666000
*   WITHIN THE SECTION.                                                 01667000
*                                                                       01668000
        ICM   RWORK2,K3,IXHLEO(RBUFC)  GET DISP. OF HIGH SECT.          01669000
        AR    RWORK2,RBUFC             MAKE THAT A POINTER              01670000
        CR    RWORK2,RWORK1            HAVE WE MOVED BEYOND END         01671000
        BNL   SCIB7                    YES, NO MATCH IN THIS BUFFER     01672000
        L     RWORK1,IXSHEP(RWORK3)    POINT BACK TO OLD BASE           01673000
        LR    RWORK5,RWORK1            GET SAME ADDRESS IN RW5          01674000
        IC    RWORK4,IBFLPL(RWORK1)    GET L FROM INDEX                 01675000
        STC   R15,IXSPEC(RWORK3)       SAVE FOR PREVIOUS ENTRY COUNT    01676000
        SR    RWORK5,RWORK4            MOVE BACK TO KEY AREA            01677000
        SH    RWORK5,HLF2              MOVE TO POINTER                  01678000
        ICM   RWORK4,K3,DZ(RWORK5)     PICK UP DISP. TO NEXT SECTION    01679000
        SR    RWORK5,RWORK0            MOVE ADDRESS PAST POINT, L,F     01680000
        ST    RWORK5,IXSLEP(RWORK3)    SAVE LOW ENTRY OF SECT IN WORK   01681000
        SR    RWORK1,RWORK4            UPDATE TO NEXT SECTION           01682000
        B     COMFN1                   BACK TO CONTINUE SEARCH          01683000
*                                                                       01684000
*   THE FOLLOWING CODE UPDATES POINTERS TO CONTINUE SEARCH              01685000
*   WITHIN A SECTION.  WE CANNOT EXIT WITHOUT LOCATING AN ENTRY         01686000
*   SINCE A SECTION SEARCH CAUSED US TO DO THE INNER SECTION SEARCH     01687000
*                                                                       01688000
SCIB5   L     RWORK1,IXSHEP(RWORK3)    START WITH ORIGINAL POINTER      01689000
        IC    RWORK4,IBFLPL(RWORK1)    GET L VALUE                      01690000
        SR    RWORK1,RWORK4            BACK OVER KEY                    01691000
        SR    RWORK1,RWORK0            BACK OVER POINTER,L,F            01692000
        STC   R15,IXSPEC(RWORK3)       SAVE NO. MATCHES FOR PREV. CNT.  01693000
        B     COMFN2                   BACK FOR SEARCH                  01694000
*                                                                       01695000
*  BLOCK HAS BEEN SEARCHED AND NO SECTION ENTRY WAS GREATER THAN OR     01696000
*  EQUAL TO THE KEY -  EXIT TO CALLER WITH R15 = 4                      01697000
*                                                                       01698000
SCIB7   LH    R15,HLF4                                                  01699000
        B     SCIB91                   EXIT                             01700000
*                                                                       01701000
*   THE FOLLOWING CODE IS ENTERED WHEN A SECTION SEARCH HAS BEEN        01702000
*   TERMINATED BY A SATISFIED SEARCH.  AT THIS POINT IT IS NECESSARY    01703000
*   TO INITIALIZE FOR AN INNER SECTION SEARCH                           01704000
*                                                                       01705000
SCIB10  IC    R15,IXSPEC(RWORK3)       RESTORE NO. MATCHES TO WHAT IT   01706000
*                                       WAS AT BEGINNING OF SECTION     01707000
        L     RWORK4,IXSHEP(RWORK3)    GET AND STORE                    01708000
        ST    RWORK4,IXSSEP(RWORK3)     ADDRESS OF SECTION ENTRY        01709000
*                                        IN WORK AREA                   01710000
        L     RWORK1,IXSLEP(RWORK3)    PICK UP ADDRESS OF 1ST. ENTRY    01711000
*                                       IN THIS SECTION                 01712000
        XI    IXSBFLG(RWORK3),X80      TURN OFF SECTION SEARCH          01713000
        B     COMFN2                    LOOP BACK                       01714000
        DS    0H                       ASSURE ALIGNMENT                 01715000
HLF2    DC    H'2'                                                      01716000
HLF4    DC    H'4'                                                      01717000
DZ      EQU   0                        DEFINE ZERO DISPLACEMENT         01718000
RWORK0  EQU   0                                                         01719000
RWORK1  EQU   5                                                         01720000
RWORK2  EQU   6                                                         01721000
RWORK3  EQU   7                                                         01722000
RWORK4  EQU   3                                                         01723000
RWORK5  EQU   9                                                         01724000
RBUFC   EQU   4                                                         01725000
RPARM1  EQU   8                                                         01726000
X80     EQU  X'80'                                                      01727000
X255    EQU  X'FF'                                                      01728000
ONE     EQU  1                                                          01729000
K3      EQU  3                                                          01730000
LNTHINDX EQU  512                                                       01731000
*   END SCIB;                                                      0687 01732000
@EL00017 DS    0H                                                  0687 01733000
@EF00017 DS    0H                                                  0687 01734000
@ER00017 LM    @14,@12,@SA00017                                    0687 01735000
         BR    @14                                                 0687 01736000
*   END IEAVNP12                                                   0688 01737000
*                                                                  0688 01738000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01739000
*/*%INCLUDE SYSLIB  (AMCBS   )                                       */ 01740000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 01741000
*/*%INCLUDE SYSLIB  (IDAAMB  )                                       */ 01742000
*/*%INCLUDE SYSLIB  (IDAAMBL )                                       */ 01743000
*/*%INCLUDE SYSLIB  (IDAAMDSB)                                       */ 01744000
*/*%INCLUDE SYSLIB  (IDABUFC )                                       */ 01745000
*/*%INCLUDE SYSLIB  (IDAIOMB )                                       */ 01746000
*/*%INCLUDE SYSLIB  (IDAIXSPL)                                       */ 01747000
*/*%INCLUDE SYSLIB  (IDAIRD  )                                       */ 01748000
*/*%INCLUDE SYSLIB  (IDAPLH  )                                       */ 01749000
*/*%INCLUDE SYSLIB  (IEAPMNIP)                                       */ 01750000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 01751000
*/*%INCLUDE SYSLIB  (IEZABP  )                                       */ 01752000
*/*%INCLUDE SYSLIB  (IEZCTGPL)                                       */ 01753000
*/*%INCLUDE SYSLIB  (IEZCTGFL)                                       */ 01754000
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */ 01755000
*/*%INCLUDE SYSLIB  (IHANVT  )                                       */ 01756000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 01757000
*/*%INCLUDE SYSLIB  (IGGMCTRC)                                       */ 01758000
*                                                                  0688 01759000
*       ;                                                          0688 01760000
@DATA    DS    0H                                                       01761000
@CH02592 DC    H'47'                                                    01762000
@CH02591 DC    H'364'                                                   01763000
@SM02610 MVC   GPFIELD(0,GPFLDPTR),CATRCD(@01)                          01764000
@SM02612 MVC   GPFIELD(0,GPFLDPTR),GPFIELD(@01)                         01765000
@DATD    DSECT                                                          01766000
         DS    0F                                                       01767000
@SA00001 DS    18F                                                      01768000
@SA00012 DS    15F                                                      01769000
@SA00017 DS    15F                                                      01770000
@TF00001 DS    F                                                        01771000
IEAVNP12 CSECT                                                          01772000
         DS    0F                                                       01773000
@CF00077 DC    F'1'                                                     01774000
@CF00035 DC    F'2'                                                     01775000
@CF00039 DC    F'4'                                                     01776000
@CF00845 DC    F'5'                                                     01777000
@CH00845 EQU   @CF00845+2                                               01778000
@CF00716 DC    F'6'                                                     01779000
@CF00049 DC    F'8'                                                     01780000
@CF02180 DC    F'10'                                                    01781000
@CF00729 DC    F'12'                                                    01782000
@CH00729 EQU   @CF00729+2                                               01783000
@CF00727 DC    F'16'                                                    01784000
@CF01432 DC    F'20'                                                    01785000
@CF00086 DC    F'24'                                                    01786000
@CF01430 DC    F'36'                                                    01787000
@CF02048 DC    F'44'                                                    01788000
@CF02084 DC    F'108'                                                   01789000
@CF02480 DC    F'255'                                                   01790000
@CF02483 DC    F'272'                                                   01791000
@CF02590 DC    F'5120'                                                  01792000
@CH02590 EQU   @CF02590+2                                               01793000
@CF02614 DC    F'-512'                                                  01794000
@CF02615 DC    F'-47'                                                   01795000
@CF02605 DC    F'-10'                                                   01796000
@CF02604 DC    F'-6'                                                    01797000
@CF02616 DC    F'-3'                                                    01798000
@DATD    DSECT                                                          01799000
         DS    0D                                                       01800000
CBSPTR   DS    A                                                        01801000
CTGPLPTR DS    A                                                        01802000
CTGFLPTR DS    A                                                        01803000
FREEAD   DS    A                                                        01804000
FREELEN  DS    A                                                        01805000
WKCORE   DS    A                                                        01806000
AMBPTR   DS    A                                                        01807000
CAMLSTPT DS    A                                                        01808000
CATBFPTR DS    A                                                        01809000
CCACPE6  DS    A                                                        01810000
CCACPE7  DS    A                                                        01811000
DICTEND  DS    A                                                        01812000
DICTSTR  DS    A                                                        01813000
DICTPTR  DS    A                                                        01814000
DICTTYP  DS    A                                                        01815000
HLDRBA   DS    A                                                        01816000
IX2      DS    A                                                        01817000
IX3      DS    A                                                        01818000
IX4      DS    A                                                        01819000
IX5      DS    A                                                        01820000
IX6      DS    A                                                        01821000
IX8      DS    A                                                        01822000
IX9      DS    A                                                        01823000
CPX      DS    A                                                        01824000
CTWKLIMT DS    F                                                        01825000
ERRCD    DS    F                                                        01826000
CATWKPR  DS    A                                                        01827000
CATWKPTR DS    A                                                        01828000
FLPTR    DS    A                                                        01829000
IXB      DS    A                                                        01830000
IX7      DS    A                                                        01831000
LCNT     DS    A                                                        01832000
RSAVA    DS    A                                                        01833000
RSAVAA   DS    A                                                        01834000
RSAVB    DS    A                                                        01835000
RSAVC    DS    A                                                        01836000
RSAVD    DS    A                                                        01837000
RSAVE    DS    A                                                        01838000
SAVGPPTR DS    A                                                        01839000
WKADDR   DS    A                                                        01840000
WKLEN    DS    H                                                        01841000
FLLENGTH DS    H                                                        01842000
GRPSEQNO DS    AL1                                                      01843000
         DS    CL3                                                      01844000
LOCPTR   DS    CL8                                                      01845000
         ORG   LOCPTR                                                   01846000
NVTPTR   DS    AL4                                                      01847000
CVTPTR   DS    AL4                                                      01848000
         ORG   LOCPTR+8                                                 01849000
DICTWK   DS    CL4                                                      01850000
SW       DS    BL1                                                      01851000
         ORG   SW                                                       01852000
SWCOMB   DS    BL1                                                      01853000
SWREEP   EQU   SW+0                                                     01854000
SWREPT   EQU   SW+0                                                     01855000
SWVALUE  EQU   SW+0                                                     01856000
SWSSW    EQU   SW+0                                                     01857000
SWDEL    EQU   SW+0                                                     01858000
SWBADTST EQU   SW+0                                                     01859000
OSSW     EQU   SW+0                                                     01860000
         ORG   SW+1                                                     01861000
         DS    CL3                                                      01862000
IXSPAREA DS    CL32                                                     01863000
CIWORK   DS    CL3                                                      01864000
         DS    CL1                                                      01865000
ABPWORK  DS    CL80                                                     01866000
MAINLIST DS    3A                                                       01867000
CCACPE   DS    10CL16                                                   01868000
BUFWORK  DS    CL8                                                      01869000
         ORG   BUFWORK+0                                                01870000
BFCTR    DS    CL1                                                      01871000
BFCI     DS    AL3                                                      01872000
         ORG   BFCI+0                                                   01873000
BFCCI    DS    CL3                                                      01874000
         ORG   BUFWORK+4                                                01875000
BFPTR    DS    AL4                                                      01876000
         ORG   BUFWORK+80                                               01877000
TEMPSR   DS    4A                                                       01878000
IEAVNP12 CSECT                                                          01879000
         DS    0F                                                       01880000
@SIZDATD DC    AL1(0)                                                   01881000
         DC    AL3(@ENDDATD-@DATD)                                      01882000
         DS    0D                                                       01883000
@CC02522 DC    C'OSLOCATE'                                              01884000
@CC02529 DC    C'ITYPEXT '                                              01885000
@CC02534 DC    C'CACB'                                                  01886000
@CC02536 DC    C'REEP'                                                  01887000
@CB02569 DC    X'0000'                                                  01888000
TRUEGC   DC    X'3F'                                                    01889000
         DS    CL5                                                      01890000
PATCH    DC    CL40' '                                                  01891000
@DATD    DSECT                                                          01892000
K4      EQU  4                                                          01893000
O24     EQU 24                                                          01894000
IEAVNP12 CSECT                                                          01895000
ZDT     DS    0D                                                        01896000
        DICT  AMDSBCAT,64,2,96,1                                        01897000
        DICT  ATTR1,16,107,1,0                                          01898000
        DICT  ATTR2,16,108,1,0                                          01899000
        DICT  BUFSIZE,0,110,4,0                                         01900000
        DICT  CATACB,96,1,4,0                                           01901000
        DICT  CATTR,16,107,1,0                                          01902000
        DICT  DEVTYP,64,2,4,3                                           01903000
        DICT  DSATTR,32,91,2,0                                          01904000
        DICT  DSTYPNAM,32,1,2,0                                         01905000
        DICT  ENTNAME,0,49,44,0                                         01906000
        DICT  ENTIDNO,0,1,3,0                                           01907000
        DICT  ENTYPE,0,44,1,0                                           01908000
        DICT  EXTENT,200,20,3,3                                         01909000
        DICT  FILESEQ,64,12,2,3                                         01910000
        DICT  HARBA,64,24,4,3                                           01911000
        DICT  HIKEYV,192,0,2,3                                          01912000
        DICT  HKRBA,64,16,4,3                                           01913000
        DICT  HURBA,64,20,4,3                                           01914000
        DICT  HURBADS,0,121,4,0                                         01915000
ZTYP    DS    0D                                                        01916000
        DICT  ITYPEXT,80,36,1,3                                         01917000
        DICT  LOKEYV,192,0,1,3                                          01918000
        DICT  NAME,64,3,3,2                                             01919000
        DICT  NAMEDS,32,20,2,2                                          01920000
        DICT  NOBYTAU,64,43,4,3                                         01921000
        DICT  NOTRKAU,64,34,2,3                                         01922000
        DICT  NOBLKTRK,64,32,2,3                                        01923000
        DICT  NOBYTTRK,64,39,4,3                                        01924000
        DICT  NOEXTNT,64,15,1,3                                         01925000
        DICT  OSLOCATE,32,32,4,0                                        01926000
        DICT  OWNERID,0,93,8,0                                          01927000
        DICT  PHYBLKSZ,64,28,4,3                                        01928000
        DICT  RELREPNO,96,3,2,0                                         01929000
        DICT  TOVOLDEV,32,27,6,3                              @Z40WSRG  01930000
        DICT  TYPE,64,2,1,2                                             01931000
        DICT  VOLSER,64,6,6,3                                           01932000
        DICT  VOLDEV,32,34,4,3                                          01933000
        DICT  VOLPHY,32,38,11,3                                         01934000
        DICT  VOLFLG,80,14,1,3                                          01935000
ZCS     DS    0D                                                        01936000
DSPN    COMB  (ENTYPE,ENTIDNO)                                          01937000
DSTR    COMB  (ATTR1,ATTR2)                                             01938000
NADS    COMB  (TYPE,NAME)                                               01939000
OSCA    COMB  (DEVTYP,VOLSER,FILESEQ)                                   01940000
VOEV    COMB  (DEVTYP,PHYBLKSZ,NOBLKTRK,NOTRKAU,NOBYTTRK,NOBYTAU)       01941000
VOHY    COMB  (RELREPNO,VOLSER,VOLFLG,NOEXTNT,HKRBA,HURBA,            **01942000
               HARBA,ITYPEXT,LOKEYV,HIKEYV,EXTENT)                      01943000
TOLD    COMB  (DEVTYP,PHYBLKSZ,NOBLKTRK,NOTRKAU,NOBYTTRK,NOBYTAU)       01944000
*                                                             @Z40WSRG  01945000
IEAVNP12 CSECT                                                          01946000
*                                  /*   THE WK AREA HAS 1 EXTRA WORD*/  01947000
        CNOP  0,4                                                       01948000
ABPCALL STM   R0,R15,ABPWORK+(SAVEXXXX-ABPCALL)                         01949000
        BALR  R14,R15                  GO TO BLOCK PROCESSOR            01950000
        USING *,R14                                                     01951000
        LM    R0,R15,SAVEXXXX                                           01952000
        BR    R14                      BRANCH BACK TO MAINLINE          01953000
        DROP  R14                                                       01954000
SAVEXXXX DS    0F                                                       01955000
@DATD    DSECT                                                          01956000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01957000
@ENDDATD EQU   *                                                        01958000
IEAVNP12 CSECT                                                          01959000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01960000
@01      EQU   01                                                       01961000
@02      EQU   02                                                       01962000
@03      EQU   03                                                       01963000
@04      EQU   04                                                       01964000
@05      EQU   05                                                       01965000
@06      EQU   06                                                       01966000
@07      EQU   07                                                       01967000
@08      EQU   08                                                       01968000
@09      EQU   09                                                       01969000
@10      EQU   10                                                       01970000
@11      EQU   11                                                       01971000
@12      EQU   12                                                       01972000
@13      EQU   13                                                       01973000
@14      EQU   14                                                       01974000
@15      EQU   15                                                       01975000
HLD      EQU   @06                                                      01976000
CPE0     EQU   @06                                                      01977000
IXA      EQU   @03                                                      01978000
IX1      EQU   @08                                                      01979000
IX       EQU   @07                                                      01980000
SCIBRCD  EQU   @02                                                      01981000
SAVFLPTR EQU   @02                                                      01982000
GPFLDPTR EQU   @09                                                      01983000
CCACPE5  EQU   @02                                                      01984000
CAMWORK  EQU   @02                                                      01985000
BUFCPTR  EQU   @10                                                      01986000
AMBLPTR  EQU   @08                                                      01987000
IOSBPTR  EQU   @01                                                      01988000
RNVT     EQU   @02                                                      01989000
SRBPTR   EQU   @01                                                      01990000
R0       EQU   @00                                                      01991000
R1       EQU   @01                                                      01992000
R14      EQU   @14                                                      01993000
R15      EQU   @15                                                      01994000
RETCODE  EQU   @15                                                      01995000
RCVT     EQU   @03                                                      01996000
RENTRY   EQU   @15                                                      01997000
RET      EQU   @14                                                      01998000
REXIT    EQU   @14                                                      01999000
RPARM    EQU   @01                                                      02000000
R10      EQU   @10                                                      02001000
R11      EQU   @11                                                      02002000
R12      EQU   @12                                                      02003000
R13      EQU   @13                                                      02004000
R2       EQU   @02                                                      02005000
R3       EQU   @03                                                      02006000
R4       EQU   @04                                                      02007000
R5       EQU   @05                                                      02008000
R6       EQU   @06                                                      02009000
R7       EQU   @07                                                      02010000
R8       EQU   @08                                                      02011000
R9       EQU   @09                                                      02012000
AMCBS    EQU   0                                                        02013000
CBSACB   EQU   AMCBS+8                                                  02014000
CBSCMP   EQU   AMCBS+16                                                 02015000
CBSVSRT  EQU   AMCBS+32                                                 02016000
CVTMAP   EQU   0                                                        02017000
CVTDAR   EQU   CVTMAP+72                                                02018000
CVTFLGS1 EQU   CVTDAR                                                   02019000
CVTDCB   EQU   CVTMAP+116                                               02020000
CVTIERLC EQU   CVTMAP+144                                               02021000
CVTOPTA  EQU   CVTMAP+182                                               02022000
CVTOPTB  EQU   CVTMAP+183                                               02023000
CVTGTF   EQU   CVTMAP+236                                               02024000
CVTGTFST EQU   CVTGTF                                                   02025000
CVTGTFS  EQU   CVTGTFST                                                 02026000
CVTSTATE EQU   CVTGTFST                                                 02027000
CVTTMODE EQU   CVTGTFST                                                 02028000
CVTFORM  EQU   CVTGTFST                                                 02029000
CVTAQAVT EQU   CVTMAP+240                                               02030000
CVTTCMFG EQU   CVTAQAVT                                                 02031000
CVTVOLM2 EQU   CVTMAP+244                                               02032000
CVTTATA  EQU   CVTVOLM2                                                 02033000
CVTTSKS  EQU   CVTTATA                                                  02034000
CVTVOLF2 EQU   CVTTSKS                                                  02035000
CVTTAT   EQU   CVTTATA+1                                                02036000
CVTATER  EQU   CVTMAP+248                                               02037000
CVTEXT1  EQU   CVTMAP+252                                               02038000
CVTCBSP  EQU   CVTMAP+256                                               02039000
CVTPURG  EQU   CVTMAP+260                                               02040000
CVTQMSG  EQU   CVTMAP+268                                               02041000
CVTDMSR  EQU   CVTMAP+272                                               02042000
CVTRSV37 EQU   CVTDMSR                                                  02043000
CVTDMSRF EQU   CVTRSV37                                                 02044000
CVTERPV  EQU   CVTMAP+316                                               02045000
CVTINTLA EQU   CVTMAP+320                                               02046000
CVTAPF   EQU   CVTMAP+324                                               02047000
CVTEXT2  EQU   CVTMAP+328                                               02048000
CVTHJES  EQU   CVTMAP+332                                               02049000
CVTPGSIA EQU   CVTMAP+348                                               02050000
CVTA1F1  EQU   CVTMAP+356                                               02051000
CVTSYSK  EQU   CVTMAP+357                                               02052000
CVTVOLM1 EQU   CVTMAP+380                                               02053000
CVTVOLF1 EQU   CVTVOLM1                                                 02054000
CVTATMCT EQU   CVTMAP+388                                               02055000
CVTXTNT1 EQU   0                                                        02056000
CVTXTNT2 EQU   0                                                        02057000
CVTDSSV  EQU   CVTXTNT2                                                 02058000
CVTFLGBT EQU   CVTXTNT2+5                                               02059000
CVTQID   EQU   CVTXTNT2+24                                              02060000
CVTRV400 EQU   CVTXTNT2+52                                              02061000
CVTRV409 EQU   CVTXTNT2+53                                              02062000
CVTATCVT EQU   CVTXTNT2+64                                              02063000
CVTRV429 EQU   CVTXTNT2+84                                              02064000
CVTRV438 EQU   CVTXTNT2+85                                              02065000
CVTRV457 EQU   CVTXTNT2+112                                             02066000
CVTRV466 EQU   CVTXTNT2+113                                             02067000
CVTFIX   EQU   0                                                        02068000
CVTRELNO EQU   CVTFIX+252                                               02069000
IDAAMB   EQU   0                                                        02070000
AMBBUFC  EQU   IDAAMB+8                                                 02071000
AMBPH    EQU   IDAAMB+12                                                02072000
AMBDSB   EQU   IDAAMB+20                                                02073000
AMBEOVR  EQU   IDAAMB+24                                                02074000
AMBFLG0  EQU   AMBEOVR                                                  02075000
AMBFLG1  EQU   IDAAMB+25                                                02076000
AMBDSORG EQU   IDAAMB+26                                                02077000
AMBIOBAD EQU   IDAAMB+28                                                02078000
AMBIOMB  EQU   AMBIOBAD                                                 02079000
AMBINFL  EQU   IDAAMB+42                                                02080000
AMBDEBPT EQU   IDAAMB+44                                                02081000
AMBOFLGS EQU   IDAAMB+48                                                02082000
AMBFLG2  EQU   IDAAMB+49                                                02083000
AMBEOVPT EQU   IDAAMB+56                                                02084000
AMBCSWD1 EQU   IDAAMB+84                                                02085000
AMBAFLG  EQU   AMBCSWD1                                                 02086000
IDAAMBL  EQU   0                                                        02087000
AMBLEOV  EQU   IDAAMBL+12                                               02088000
AMBLEFLG EQU   AMBLEOV                                                  02089000
AMBLDDNM EQU   IDAAMBL+16                                               02090000
AMBLIDF  EQU   AMBLDDNM                                                 02091000
AMBLQ    EQU   AMBLIDF+7                                                02092000
AMBLVC   EQU   IDAAMBL+28                                               02093000
AMBLTYPE EQU   IDAAMBL+30                                               02094000
AMBLSHAR EQU   IDAAMBL+33                                               02095000
AMBLFLG1 EQU   IDAAMBL+35                                               02096000
AMBLVVIC EQU   AMBLFLG1                                                 02097000
AMBLFLG2 EQU   IDAAMBL+36                                               02098000
AMBLDTA  EQU   IDAAMBL+52                                               02099000
AMBLIX   EQU   IDAAMBL+56                                               02100000
IDAAMDSB EQU   0                                                        02101000
AMDATTR  EQU   IDAAMDSB+1                                               02102000
AMDNEST  EQU   IDAAMDSB+4                                               02103000
AMDCINV  EQU   IDAAMDSB+20                                              02104000
AMDHLRBA EQU   IDAAMDSB+28                                              02105000
AMDSSRBA EQU   IDAAMDSB+32                                              02106000
AMDATTR3 EQU   IDAAMDSB+40                                              02107000
AMDSTAT  EQU   IDAAMDSB+48                                              02108000
IDABUFDR EQU   0                                                        02109000
BUFDRCIX EQU   IDABUFDR+9                                               02110000
BUFDRFLG EQU   IDABUFDR+11                                              02111000
IDABUFC  EQU   0                                                        02112000
BUFCAVL  EQU   IDABUFC                                                  02113000
BUFCFLG1 EQU   IDABUFC+1                                                02114000
BUFCER1  EQU   BUFCFLG1                                                 02115000
BUFCER2  EQU   BUFCFLG1                                                 02116000
BUFCIOFL EQU   IDABUFC+2                                                02117000
BUFCRRD  EQU   BUFCIOFL                                                 02118000
BUFCXEDB EQU   BUFCIOFL                                                 02119000
BUFCFLG2 EQU   IDABUFC+3                                                02120000
BUFCPLH  EQU   IDABUFC+4                                                02121000
BUFCDDDD EQU   IDABUFC+8                                                02122000
BUFCCPA  EQU   IDABUFC+16                                               02123000
BUFCBAD  EQU   IDABUFC+20                                               02124000
BUFCINV  EQU   IDABUFC+28                                               02125000
IDAIOMB  EQU   0                                                        02126000
IOMBUFC  EQU   IDAIOMB+4                                                02127000
IOMCPA   EQU   IDAIOMB+8                                                02128000
IOMPLH   EQU   IDAIOMB+12                                               02129000
IOMECBPT EQU   IDAIOMB+24                                               02130000
IOMIOSB  EQU   IDAIOMB+36                                               02131000
IOMFLAGS EQU   IDAIOMB+40                                               02132000
IOMFL    EQU   IOMFLAGS                                                 02133000
IOMAPEND EQU   IOMFL                                                    02134000
IOMSTIND EQU   IOMFLAGS+2                                               02135000
IOMSAVER EQU   IDAIOMB+52                                               02136000
IDAIXSPL EQU   0                                                        02137000
IXSBFLG  EQU   IDAIXSPL+17                                              02138000
IXSEKON  EQU   IDAIXSPL+18                                              02139000
IXSPEC   EQU   IDAIXSPL+19                                              02140000
IXSHEP   EQU   IDAIXSPL+20                                              02141000
IXSSEP   EQU   IDAIXSPL+24                                              02142000
IXSLEP   EQU   IDAIXSPL+28                                              02143000
IDAIXH   EQU   0                                                        02144000
IXHLL    EQU   IDAIXH                                                   02145000
IXHFLPLN EQU   IDAIXH+2                                                 02146000
IXHPTLS  EQU   IDAIXH+3                                                 02147000
IXHBRBA  EQU   IDAIXH+4                                                 02148000
IXHHP    EQU   IDAIXH+8                                                 02149000
IXHLV    EQU   IDAIXH+16                                                02150000
IXHLEO   EQU   IDAIXH+20                                                02151000
IXHSEO   EQU   IDAIXH+22                                                02152000
IDAIBFLP EQU   0                                                        02153000
IBFLPF   EQU   IDAIBFLP                                                 02154000
IBFLPL   EQU   IDAIBFLP+1                                               02155000
IBFLP3   EQU   IDAIBFLP+2                                               02156000
IBFLP2   EQU   IBFLP3                                                   02157000
IDASELL  EQU   0                                                        02158000
IDAIXK   EQU   0                                                        02159000
IDAPLHDR EQU   0                                                        02160000
IDAPLH   EQU   0                                                        02161000
PLHFLG1  EQU   IDAPLH+2                                                 02162000
PLHFLG2  EQU   IDAPLH+3                                                 02163000
PLHEFLGS EQU   IDAPLH+4                                                 02164000
PLHFLG3  EQU   IDAPLH+6                                                 02165000
PLHAFLGS EQU   IDAPLH+7                                                 02166000
PLHCRBA  EQU   IDAPLH+28                                                02167000
PLHJORBA EQU   PLHCRBA                                                  02168000
PLHJRNLL EQU   IDAPLH+32                                                02169000
PLHJCODE EQU   IDAPLH+40                                                02170000
PLHDIOB  EQU   IDAPLH+76                                                02171000
PLHEOVPT EQU   IDAPLH+180                                               02172000
PLHIXSPL EQU   IDAPLH+200                                               02173000
PLHSSRBA EQU   PLHIXSPL                                                 02174000
PLHWAX   EQU   IDAPLH+232                                               02175000
PLHKEYPT EQU   IDAPLH+248                                               02176000
PLHEND   EQU   IDAPLH+280                                               02177000
NWTOHDR  EQU   0                                                        02178000
NWTOFL   EQU   NWTOHDR+2                                                02179000
NWTORLST EQU   0                                                        02180000
NWTORFL  EQU   NWTORLST+10                                              02181000
NIPSPE   EQU   0                                                        02182000
NIPMNTPL EQU   0                                                        02183000
NMNTDS   EQU   NIPMNTPL                                                 02184000
NMNTVS   EQU   NIPMNTPL+12                                              02185000
NMNTFL   EQU   NIPMNTPL+20                                              02186000
NIPOPNPL EQU   0                                                        02187000
NOPNDS   EQU   NIPOPNPL                                                 02188000
NOPNFL   EQU   NIPOPNPL+20                                              02189000
NIPSCHDL EQU   0                                                        02190000
IOSB     EQU   0                                                        02191000
IOSFLA   EQU   IOSB                                                     02192000
IOSACHN  EQU   IOSFLA                                                   02193000
IOSFLB   EQU   IOSB+1                                                   02194000
IOSFLC   EQU   IOSB+2                                                   02195000
IOSDVALT EQU   IOSFLC                                                   02196000
IOSPKEY  EQU   IOSB+12                                                  02197000
IOSOPT   EQU   IOSB+14                                                  02198000
IOSOPT2  EQU   IOSB+15                                                  02199000
@NM00047 EQU   IOSB+20                                                  02200000
IOSCSW   EQU   @NM00047+1                                               02201000
IOSTATUS EQU   IOSCSW+3                                                 02202000
IOSSRB   EQU   IOSB+28                                                  02203000
IOSIPIB  EQU   IOSB+44                                                  02204000
IOSDIE   EQU   IOSB+68                                                  02205000
IOSDIEFG EQU   IOSDIE                                                   02206000
IOSPATH  EQU   IOSB+86                                                  02207000
IOSCHN   EQU   IOSPATH                                                  02208000
IOSCKEY  EQU   IOSB+89                                                  02209000
IOSEEKA  EQU   IOSB+100                                                 02210000
IOSCCHH  EQU   IOSEEKA+3                                                02211000
IOSSKHH  EQU   IOSCCHH+2                                                02212000
IEZABP   EQU   0                                                        02213000
ABPABP   EQU   IEZABP+8                                                 02214000
CTGPL    EQU   0                                                        02215000
CTGOPTN1 EQU   CTGPL                                                    02216000
CTGNAME  EQU   CTGOPTN1                                                 02217000
CTGOPTN2 EQU   CTGPL+1                                                  02218000
CTGEXT   EQU   CTGOPTN2                                                 02219000
CTGERASE EQU   CTGOPTN2                                                 02220000
CTGSMF   EQU   CTGERASE                                                 02221000
CTGREL   EQU   CTGSMF                                                   02222000
CTGPURG  EQU   CTGOPTN2                                                 02223000
CTGVMNT  EQU   CTGPURG                                                  02224000
CTGRCATN EQU   CTGVMNT                                                  02225000
CTGOPTN3 EQU   CTGPL+2                                                  02226000
CTGAM0   EQU   CTGOPTN3                                                 02227000
CTGOPTN4 EQU   CTGPL+3                                                  02228000
CTGENT   EQU   CTGPL+4                                                  02229000
CTGCAT   EQU   CTGPL+8                                                  02230000
CTGWKA   EQU   CTGPL+12                                                 02231000
CTGDSORG EQU   CTGPL+16                                                 02232000
CTGNOFLD EQU   CTGPL+19                                                 02233000
CTGDDNM  EQU   CTGPL+20                                                 02234000
CTGNEWNM EQU   CTGDDNM                                                  02235000
CTGFBFLG EQU   CTGNEWNM+2                                               02236000
CTGJSCB  EQU   CTGPL+24                                                 02237000
CTGFIELD EQU   CTGPL+28                                                 02238000
CTGFL    EQU   0                                                        02239000
CTGFLDCD EQU   CTGFL+1                                                  02240000
CTGFLDRE EQU   CTGFL+3                                                  02241000
CTGFLDNM EQU   CTGFL+8                                                  02242000
CTGFLCHN EQU   CTGFL+12                                                 02243000
CTGFLDAT EQU   CTGFL+16                                                 02244000
CTGFLNG  EQU   CTGFLDAT                                                 02245000
CTGFLPT  EQU   CTGFLDAT+4                                               02246000
IFGACB   EQU   0                                                        02247000
ACBCOMN  EQU   IFGACB                                                   02248000
ACBLENG  EQU   ACBCOMN+2                                                02249000
ACBLENG2 EQU   ACBLENG                                                  02250000
ACBAMBL  EQU   ACBCOMN+4                                                02251000
ACBJWA   EQU   ACBAMBL                                                  02252000
ACBMACRF EQU   ACBCOMN+12                                               02253000
ACBMACR1 EQU   ACBMACRF                                                 02254000
ACBADR   EQU   ACBMACR1                                                 02255000
ACBCNV   EQU   ACBMACR1                                                 02256000
ACBMACR2 EQU   ACBMACRF+1                                               02257000
ACBBUFPL EQU   ACBCOMN+20                                               02258000
ACBMACR3 EQU   ACBBUFPL                                                 02259000
ACBRECFM EQU   ACBCOMN+24                                               02260000
ACBCCTYP EQU   ACBCOMN+25                                               02261000
ACBOPT   EQU   ACBCOMN+26                                               02262000
ACBDSORG EQU   ACBOPT                                                   02263000
ACBCROPS EQU   ACBDSORG                                                 02264000
ACBDVIND EQU   ACBDSORG                                                 02265000
ACBEXLST EQU   ACBCOMN+36                                               02266000
ACBDDNM  EQU   ACBCOMN+40                                               02267000
ACBAMETH EQU   ACBDDNM+3                                                02268000
ACBOFLGS EQU   ACBCOMN+48                                               02269000
ACBEXFG  EQU   ACBOFLGS                                                 02270000
ACBIOSFG EQU   ACBOFLGS                                                 02271000
ACBINFLG EQU   ACBCOMN+50                                               02272000
ACBVVIC  EQU   ACBINFLG                                                 02273000
ACBUJFCB EQU   ACBCOMN+52                                               02274000
ACBBLKSZ EQU   ACBCOMN+60                                               02275000
NVT      EQU   0                                                        02276000
NVTNPATR EQU   NVT+54                                                   02277000
NVTNPREN EQU   NVTNPATR                                                 02278000
NVTFLLB  EQU   NVT+55                                                   02279000
NVTABSAV EQU   NVT+140                                                  02280000
NVTFLCN  EQU   NVT+211                                                  02281000
NVTWTPSW EQU   NVT+224                                                  02282000
NVTWPSW2 EQU   NVTWTPSW+4                                               02283000
NVTFLWSC EQU   NVTWPSW2+3                                               02284000
NVTLOAD  EQU   NVT+232                                                  02285000
NVTSENSE EQU   NVT+236                                                  02286000
NVTSWAIT EQU   NVT+240                                                  02287000
NVTTIME  EQU   NVT+244                                                  02288000
NVTUCBFN EQU   NVT+248                                                  02289000
NVTWTO   EQU   NVT+252                                                  02290000
NVTWTOR  EQU   NVT+256                                                  02291000
NVTWTOR2 EQU   NVT+260                                                  02292000
NVTOPEN  EQU   NVT+264                                                  02293000
NVTMOUNT EQU   NVT+268                                                  02294000
NVTVIRT  EQU   NVT+276                                                  02295000
NVTREAL  EQU   NVT+280                                                  02296000
NVTSCHED EQU   NVT+284                                                  02297000
NVTOPIO  EQU   NVT+288                                                  02298000
NVTXCTL  EQU   NVT+428                                                  02299000
NVTLOCAT EQU   NVT+436                                                  02300000
NVTFLPO  EQU   NVT+528                                                  02301000
SRBSECT  EQU   0                                                        02302000
SRB      EQU   SRBSECT                                                  02303000
SRBFLC   EQU   SRB+12                                                   02304000
DICTENT  EQU   0                                                        02305000
DICTNAME EQU   DICTENT                                                  02306000
DICTFLGS EQU   DICTENT+4                                                02307000
DICTVAR  EQU   DICTFLGS                                                 02308000
DICTREP  EQU   DICTFLGS                                                 02309000
DICTCOMB EQU   DICTFLGS                                                 02310000
DICTST   EQU   DICTENT+5                                                02311000
DICTLC   EQU   DICTENT+6                                                02312000
DICTGC   EQU   DICTENT+7                                                02313000
COMBPTR  EQU   0                                                        02314000
CCARAB   EQU   0                                                        02315000
CCACPE1  EQU   CCARAB                                                   02316000
CCACPE2  EQU   CCARAB+4                                                 02317000
CCACPE3  EQU   CCARAB+8                                                 02318000
CCACPE4  EQU   CCARAB+12                                                02319000
CATGOPT  EQU   0                                                        02320000
CATGOCI  EQU   CATGOPT                                                  02321000
CATGODSP EQU   CATGOCI+1                                                02322000
CATGOGC1 EQU   CATGOPT+3                                                02323000
CATGOEXT EQU   CATGOGC1                                                 02324000
CATGODEL EQU   CATGOGC1                                                 02325000
CATGOSEQ EQU   CATGOPT+4                                                02326000
CATRCD   EQU   0                                                        02327000
RCDSIZ   EQU   CATRCD+45                                                02328000
NREPCV   EQU   CATRCD+47                                                02329000
NREPLF   EQU   CATRCD+48                                                02330000
REPCNTRL EQU   0                                                        02331000
EXTRCDPT EQU   REPCNTRL                                                 02332000
EXTGOGC1 EQU   EXTRCDPT+3                                               02333000
REPCNT   EQU   REPCNTRL+5                                               02334000
REPGOPT  EQU   REPCNTRL+6                                               02335000
VARFIELD EQU   0                                                        02336000
VARLEN   EQU   VARFIELD                                                 02337000
CNTRLINE EQU   0                                                        02338000
CNTVAR   EQU   CNTRLINE                                                 02339000
LENFIX   EQU   CNTRLINE+1                                               02340000
CAMLSTD  EQU   0                                                        02341000
CAMOPTNS EQU   CAMLSTD                                                  02342000
CAMOPTN3 EQU   CAMOPTNS+2                                               02343000
CAMPTR1  EQU   CAMLSTD+4                                                02344000
CAMPTR3  EQU   CAMLSTD+12                                               02345000
FLNAME   EQU   0                                                        02346000
GPFIELD  EQU   0                                                        02347000
RREPNO   EQU   0                                                        02348000
TESTSW   EQU   0                                                        02349000
CATWORK  EQU   0                                                        02350000
WORKLEN  EQU   CATWORK                                                  02351000
CATLGBUF EQU   0                                                        02352000
GPVOLPTR EQU   0                                                        02353000
GPVOLSER EQU   GPVOLPTR+4                                               02354000
TRNAMECI EQU   0                                                        02355000
TRNAMREC EQU   TRNAMECI                                                 02356000
TRUENAME EQU   TRNAMREC                                                 02357000
TRUENMCI EQU   TRNAMREC+44                                              02358000
RDF2     EQU   TRNAMECI+502                                             02359000
RECCNT   EQU   RDF2+1                                                   02360000
RDF1     EQU   TRNAMECI+505                                             02361000
RDF1FLGS EQU   RDF1                                                     02362000
RDF1LAST EQU   RDF1FLGS                                                 02363000
CIWORK2  EQU   0                                                        02364000
DSNAME   EQU   0                                                        02365000
CAMWKA   EQU   0                                                        02366000
CAMWKCNT EQU   CAMWKA                                                   02367000
CAMVOLPT EQU   CAMWKA+2                                                 02368000
CAMVOLSR EQU   CAMVOLPT+4                                               02369000
ECB      EQU   0                                                        02370000
ECBCODE  EQU   ECB                                                      02371000
PLHKEY   EQU   0                                                        02372000
CVTS01   EQU   CVTPGSIA                                                 02373000
CVTLPDIA EQU   CVTS01+12                                                02374000
CVTDIRST EQU   CVTLPDIA                                                 02375000
CVTSLIDA EQU   CVTS01+24                                                02376000
CVTCTLFG EQU   CVTS01+50                                                02377000
CVTIOBP  EQU   CVTS01+360                                               02378000
CVTRV210 EQU   CVTS01+424                                               02379000
CVTRV219 EQU   CVTS01+425                                               02380000
CVTRV228 EQU   CVTS01+426                                               02381000
CVTRV237 EQU   CVTS01+427                                               02382000
CVTMFRTR EQU   CVTS01+452                                               02383000
CVTRV262 EQU   CVTS01+468                                               02384000
CVTRV271 EQU   CVTS01+469                                               02385000
CVTRV280 EQU   CVTS01+470                                               02386000
CVTRV289 EQU   CVTS01+471                                               02387000
CVTGSDA  EQU   CVTS01+600                                               02388000
PLHEXTEN EQU   PLHEND                                                   02389000
PLHBMWRK EQU   PLHEXTEN+5                                               02390000
IOSATTSC EQU   IOSIPIB                                                  02391000
IOSWTOWA EQU   IOSIPIB                                                  02392000
IOSPCISC EQU   IOSIPIB                                                  02393000
@NM00058 EQU   CTGDDNM                                                  02394000
CTGPROB  EQU   @NM00058                                                 02395000
CTGREASN EQU   CTGPROB+2                                                02396000
BUFCRSC1 EQU   BUFCAVL                                                  02397000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02398000
CTGREAS2 EQU   CTGREASN+1                                               02399000
CTGREAS1 EQU   CTGREASN                                                 02400000
CTGMODID EQU   CTGPROB                                                  02401000
IOSPCIWA EQU   IOSPCISC+44                                              02402000
IOSPCIRS EQU   IOSPCISC+8                                               02403000
@NM00052 EQU   IOSPCISC+4                                               02404000
@NM00051 EQU   IOSPCISC                                                 02405000
IOSWRNDR EQU   IOSWTOWA+4                                               02406000
IOSWTOPT EQU   IOSWTOWA+3                                               02407000
IOSWTOCP EQU   IOSWTOWA+2                                               02408000
IOSWTOCH EQU   IOSWTOWA                                                 02409000
IOSATTWA EQU   IOSATTSC+40                                              02410000
@NM00050 EQU   IOSATTSC+24                                              02411000
IOSATTSN EQU   IOSATTSC                                                 02412000
PLHBMSV5 EQU   PLHEXTEN+24                                              02413000
PLHBMSV4 EQU   PLHEXTEN+20                                              02414000
PLHBMSV3 EQU   PLHEXTEN+16                                              02415000
PLHBMSV2 EQU   PLHEXTEN+12                                              02416000
PLHBMSV1 EQU   PLHEXTEN+8                                               02417000
PLHRDCNT EQU   PLHEXTEN+6                                               02418000
PLHBMSOV EQU   PLHBMWRK                                                 02419000
PLHBEUC  EQU   PLHBMWRK                                                 02420000
PLHBMRDF EQU   PLHBMWRK                                                 02421000
@NM00038 EQU   PLHEXTEN+4                                               02422000
PLHRESR1 EQU   PLHEXTEN                                                 02423000
CVTRV628 EQU   CVTS01+728                                               02424000
CVTRV627 EQU   CVTS01+724                                               02425000
CVTRV626 EQU   CVTS01+720                                               02426000
CVTRV625 EQU   CVTS01+716                                               02427000
CVTRV624 EQU   CVTS01+712                                               02428000
CVTRV623 EQU   CVTS01+708                                               02429000
CVTRV622 EQU   CVTS01+704                                               02430000
CVTRV621 EQU   CVTS01+700                                               02431000
CVTIHASU EQU   CVTS01+696                                               02432000
CVTSUSP  EQU   CVTS01+692                                               02433000
CVTT6SVC EQU   CVTS01+688                                               02434000
CVTCDAL  EQU   CVTS01+684                                               02435000
CVTTCTL  EQU   CVTS01+680                                               02436000
CVTRSUME EQU   CVTS01+676                                               02437000
CVTJTERM EQU   CVTS01+672                                               02438000
CVTASMRM EQU   CVTS01+668                                               02439000
CVTTCASP EQU   CVTS01+664                                               02440000
CVT0PT03 EQU   CVTS01+660                                               02441000
CVT0PT0E EQU   CVTS01+656                                               02442000
CVTRV609 EQU   CVTS01+652                                               02443000
CVTCGK   EQU   CVTS01+648                                               02444000
CVTRAC   EQU   CVTS01+644                                               02445000
CVTRV606 EQU   CVTS01+640                                               02446000
CVTRV605 EQU   CVTS01+636                                               02447000
CVTRV604 EQU   CVTS01+632                                               02448000
CVTEFF02 EQU   CVTS01+628                                               02449000
CVTCBBR  EQU   CVTS01+624                                               02450000
CVTSSCR  EQU   CVTS01+620                                               02451000
CVTEVENT EQU   CVTS01+616                                               02452000
CVTCRCA  EQU   CVTS01+612                                               02453000
CVTTPIO  EQU   CVTS01+608                                               02454000
CVTADV   EQU   CVTS01+604                                               02455000
CVTGSDAB EQU   CVTGSDA                                                  02456000
CVTQV3   EQU   CVTS01+596                                               02457000
CVTQV2   EQU   CVTS01+592                                               02458000
CVTQV1   EQU   CVTS01+588                                               02459000
CVTRPT   EQU   CVTS01+584                                               02460000
CVTSSRB  EQU   CVTS01+580                                               02461000
CVTCSDRL EQU   CVTS01+576                                               02462000
CVTEXP1  EQU   CVTS01+572                                               02463000
CVTRMPMT EQU   CVTS01+568                                               02464000
CVTRMPTT EQU   CVTS01+564                                               02465000
CVTVPSA  EQU   CVTS01+560                                               02466000
CVTVSTOP EQU   CVTS01+556                                               02467000
CVTGTFR8 EQU   CVTS01+552                                               02468000
CVTQUIT  EQU   CVTS01+548                                               02469000
CVTVACR  EQU   CVTS01+544                                               02470000
CVTWTCB  EQU   CVTS01+540                                               02471000
CVTSTPRS EQU   CVTS01+536                                               02472000
CVT0PT02 EQU   CVTS01+532                                               02473000
CVTDARCM EQU   CVTS01+528                                               02474000
CVTIRECM EQU   CVTS01+524                                               02475000
CVTJRECM EQU   CVTS01+520                                               02476000
CVTVEMS0 EQU   CVTS01+516                                               02477000
CVTSPFRR EQU   CVTS01+512                                               02478000
CVTRLSTG EQU   CVTS01+508                                               02479000
CVT0TC0A EQU   CVTS01+504                                               02480000
CVTGMBR  EQU   CVTS01+500                                               02481000
CVTLFRM  EQU   CVTS01+496                                               02482000
CVTRMBR  EQU   CVTS01+492                                               02483000
CVTVIOP  EQU   CVTS01+488                                               02484000
CVTRV307 EQU   CVTS01+486                                               02485000
CVTRV306 EQU   CVTS01+484                                               02486000
CVTRV305 EQU   CVTS01+482                                               02487000
CVTRV304 EQU   CVTS01+480                                               02488000
CVTRV303 EQU   CVTS01+478                                               02489000
CVTRV302 EQU   CVTS01+476                                               02490000
CVTTRCA  EQU   CVTS01+472                                               02491000
CVTRV297 EQU   CVTRV289                                                 02492000
CVTRV296 EQU   CVTRV289                                                 02493000
CVTRV295 EQU   CVTRV289                                                 02494000
CVTRV294 EQU   CVTRV289                                                 02495000
CVTRV293 EQU   CVTRV289                                                 02496000
CVTRV292 EQU   CVTRV289                                                 02497000
CVTRV291 EQU   CVTRV289                                                 02498000
CVTRV290 EQU   CVTRV289                                                 02499000
CVTRV288 EQU   CVTRV280                                                 02500000
CVTRV287 EQU   CVTRV280                                                 02501000
CVTRV286 EQU   CVTRV280                                                 02502000
CVTRV285 EQU   CVTRV280                                                 02503000
CVTRV284 EQU   CVTRV280                                                 02504000
CVTRV283 EQU   CVTRV280                                                 02505000
CVTRV282 EQU   CVTRV280                                                 02506000
CVTRV281 EQU   CVTRV280                                                 02507000
CVTRV279 EQU   CVTRV271                                                 02508000
CVTRV278 EQU   CVTRV271                                                 02509000
CVTRV277 EQU   CVTRV271                                                 02510000
CVTRV276 EQU   CVTRV271                                                 02511000
CVTRV275 EQU   CVTRV271                                                 02512000
CVTRV274 EQU   CVTRV271                                                 02513000
CVTRV273 EQU   CVTRV271                                                 02514000
CVTRV272 EQU   CVTRV271                                                 02515000
CVTRV270 EQU   CVTRV262                                                 02516000
CVTRV269 EQU   CVTRV262                                                 02517000
CVTRV268 EQU   CVTRV262                                                 02518000
CVTRV267 EQU   CVTRV262                                                 02519000
CVTRV266 EQU   CVTRV262                                                 02520000
CVTRV265 EQU   CVTRV262                                                 02521000
CVTRV264 EQU   CVTRV262                                                 02522000
CVTRV263 EQU   CVTRV262                                                 02523000
CVTVFP   EQU   CVTS01+464                                               02524000
CVTVSI   EQU   CVTS01+460                                               02525000
CVTVPSIB EQU   CVTS01+456                                               02526000
CVTMFACT EQU   CVTMFRTR                                                 02527000
CVTMFCTL EQU   CVTS01+448                                               02528000
CVTPVBP  EQU   CVTS01+444                                               02529000
CVTPWI   EQU   CVTS01+440                                               02530000
CVTRV254 EQU   CVTS01+438                                               02531000
CVTRV253 EQU   CVTS01+436                                               02532000
CVTRV252 EQU   CVTS01+434                                               02533000
CVTRV251 EQU   CVTS01+433                                               02534000
CVTRV250 EQU   CVTS01+432                                               02535000
CVTRV249 EQU   CVTS01+431                                               02536000
CVTRV248 EQU   CVTS01+430                                               02537000
CVTRV247 EQU   CVTS01+429                                               02538000
CVTRV246 EQU   CVTS01+428                                               02539000
CVTRV245 EQU   CVTRV237                                                 02540000
CVTRV244 EQU   CVTRV237                                                 02541000
CVTRV243 EQU   CVTRV237                                                 02542000
CVTRV242 EQU   CVTRV237                                                 02543000
CVTRV241 EQU   CVTRV237                                                 02544000
CVTRV240 EQU   CVTRV237                                                 02545000
CVTRV239 EQU   CVTRV237                                                 02546000
CVTRV238 EQU   CVTRV237                                                 02547000
CVTRV236 EQU   CVTRV228                                                 02548000
CVTRV235 EQU   CVTRV228                                                 02549000
CVTRV234 EQU   CVTRV228                                                 02550000
CVTRV233 EQU   CVTRV228                                                 02551000
CVTRV232 EQU   CVTRV228                                                 02552000
CVTRV231 EQU   CVTRV228                                                 02553000
CVTRV230 EQU   CVTRV228                                                 02554000
CVTRV229 EQU   CVTRV228                                                 02555000
CVTRV227 EQU   CVTRV219                                                 02556000
CVTRV226 EQU   CVTRV219                                                 02557000
CVTRV225 EQU   CVTRV219                                                 02558000
CVTRV224 EQU   CVTRV219                                                 02559000
CVTRV223 EQU   CVTRV219                                                 02560000
CVTRV222 EQU   CVTRV219                                                 02561000
CVTRV221 EQU   CVTRV219                                                 02562000
CVTRV220 EQU   CVTRV219                                                 02563000
CVTRV218 EQU   CVTRV210                                                 02564000
CVTRV217 EQU   CVTRV210                                                 02565000
CVTRV216 EQU   CVTRV210                                                 02566000
CVTRV215 EQU   CVTRV210                                                 02567000
CVTRV214 EQU   CVTRV210                                                 02568000
CVTRV213 EQU   CVTRV210                                                 02569000
CVTRV212 EQU   CVTRV210                                                 02570000
CVTRV211 EQU   CVTRV210                                                 02571000
CVTLCCAT EQU   CVTS01+420                                               02572000
CVTPCCAT EQU   CVTS01+416                                               02573000
CVTIPCRP EQU   CVTS01+412                                               02574000
CVTIPCRI EQU   CVTS01+408                                               02575000
CVTIPCDS EQU   CVTS01+404                                               02576000
CVTAIDVT EQU   CVTS01+400                                               02577000
CVTSSAP  EQU   CVTS01+396                                               02578000
CVTEHCIR EQU   CVTS01+392                                               02579000
CVTEHDEF EQU   CVTS01+388                                               02580000
CVTDAIR  EQU   CVTS01+384                                               02581000
CVTPERFM EQU   CVTS01+380                                               02582000
CVT044R2 EQU   CVTS01+376                                               02583000
CVTFETCH EQU   CVTS01+372                                               02584000
CVTRSTWD EQU   CVTS01+368                                               02585000
CVTSPOST EQU   CVTS01+364                                               02586000
CVTASMVT EQU   CVTS01+356                                               02587000
CVTRECRQ EQU   CVTS01+352                                               02588000
CVTWSAC  EQU   CVTS01+348                                               02589000
CVTRV149 EQU   CVTS01+344                                               02590000
CVTWSAL  EQU   CVTS01+340                                               02591000
CVTSPSA  EQU   CVTS01+336                                               02592000
CVTGLMN  EQU   CVTS01+332                                               02593000
CVTVEAC0 EQU   CVTS01+328                                               02594000
CVT062R1 EQU   CVTS01+324                                               02595000
CVTRPOST EQU   CVTS01+320                                               02596000
CVTDQIQE EQU   CVTS01+316                                               02597000
CVTCSD   EQU   CVTS01+312                                               02598000
CVTLKRMA EQU   CVTS01+308                                               02599000
CVTRSPIE EQU   CVTS01+304                                               02600000
CVTRENQ  EQU   CVTS01+300                                               02601000
CVTLQCB  EQU   CVTS01+296                                               02602000
CVTFQCB  EQU   CVTS01+292                                               02603000
CVTQCS01 EQU   CVTS01+288                                               02604000
CVTAPFT  EQU   CVTS01+284                                               02605000
CVTPARRL EQU   CVTS01+280                                               02606000
CVTVWAIT EQU   CVTS01+276                                               02607000
CVTGSPL  EQU   CVTS01+272                                               02608000
CVTLSMQ  EQU   CVTS01+268                                               02609000
CVTGSMQ  EQU   CVTS01+264                                               02610000
CVTEXPRO EQU   CVTS01+260                                               02611000
CVTOPCTP EQU   CVTS01+256                                               02612000
CVTSIC   EQU   CVTS01+252                                               02613000
CVTTPIOS EQU   CVTS01+248                                               02614000
CVTRTMS  EQU   CVTS01+244                                               02615000
CVTSDBF  EQU   CVTS01+240                                               02616000
CVTSCBP  EQU   CVTS01+236                                               02617000
CVTSDMP  EQU   CVTS01+232                                               02618000
CVTSV60  EQU   CVTS01+228                                               02619000
CVTRTMCT EQU   CVTS01+224                                               02620000
CVTASCBL EQU   CVTS01+220                                               02621000
CVTASCBH EQU   CVTS01+216                                               02622000
CVTGDA   EQU   CVTS01+212                                               02623000
CVTASVT  EQU   CVTS01+208                                               02624000
CVTVVMDI EQU   CVTS01+204                                               02625000
CVTAQTOP EQU   CVTS01+200                                               02626000
CVTIOSCS EQU   CVTS01+196                                               02627000
CVTSDRM  EQU   CVTS01+192                                               02628000
CVTOPTE  EQU   CVTS01+188                                               02629000
CVTSTXU  EQU   CVTS01+184                                               02630000
CVTQUIS  EQU   CVTS01+180                                               02631000
CVTPARS  EQU   CVTS01+176                                               02632000
CVTS1EE  EQU   CVTS01+172                                               02633000
CVTFRAS  EQU   CVTS01+168                                               02634000
CVTQSAS  EQU   CVTS01+164                                               02635000
CVTCRAS  EQU   CVTS01+160                                               02636000
CVTCRMN  EQU   CVTS01+156                                               02637000
CVTDELCP EQU   CVTS01+152                                               02638000
CVTFRECL EQU   CVTS01+148                                               02639000
CVTGETCL EQU   CVTS01+144                                               02640000
CVTBLDCP EQU   CVTS01+140                                               02641000
CVTAUTHL EQU   CVTS01+136                                               02642000
CVTSCAN  EQU   CVTS01+132                                               02643000
CVTRV144 EQU   CVTS01+130                                               02644000
CVTMAXMP EQU   CVTS01+128                                               02645000
CVTSTCK  EQU   CVTS01+124                                               02646000
CVTRV139 EQU   CVTS01+123                                               02647000
CVTDSSAC EQU   CVTS01+122                                               02648000
CVTRV513 EQU   CVTS01+121                                               02649000
CVTIOSPL EQU   CVTS01+120                                               02650000
CVTPTGT  EQU   CVTS01+116                                               02651000
CVTCSPIE EQU   CVTS01+112                                               02652000
CVTSMFEX EQU   CVTS01+108                                               02653000
CVTOLT0A EQU   CVTS01+104                                               02654000
CVTSRBRT EQU   CVTS01+100                                               02655000
CVTPUTL  EQU   CVTS01+96                                                02656000
CVTASCRL EQU   CVTS01+92                                                02657000
CVTASCRF EQU   CVTS01+88                                                02658000
CVTRV326 EQU   CVTS01+84                                                02659000
CVTRV325 EQU   CVTS01+80                                                02660000
CVTRV324 EQU   CVTS01+76                                                02661000
CVT0VL01 EQU   CVTS01+72                                                02662000
CVTSHRVM EQU   CVTS01+68                                                02663000
CVTRV332 EQU   CVTS01+64                                                02664000
CVTTAS   EQU   CVTS01+60                                                02665000
CVTRSCN  EQU   CVTS01+56                                                02666000
CVTTRAC2 EQU   CVTS01+54                                                02667000
CVTTRACE EQU   CVTS01+52                                                02668000
CVTAPG   EQU   CVTS01+51                                                02669000
CVTSDTRC EQU   CVTCTLFG                                                 02670000
CVTGTRCE EQU   CVTCTLFG                                                 02671000
CVTNOMP  EQU   CVTCTLFG                                                 02672000
CVTRSV79 EQU   CVTCTLFG                                                 02673000
CVTDSTAT EQU   CVTCTLFG                                                 02674000
CVTRSV78 EQU   CVTCTLFG                                                 02675000
CVTRV333 EQU   CVTCTLFG                                                 02676000
CVTRV323 EQU   CVTCTLFG                                                 02677000
CVTSPVLK EQU   CVTS01+49                                                02678000
CVTRSV77 EQU   CVTS01+48                                                02679000
CVTRV331 EQU   CVTS01+44                                                02680000
CVTRV330 EQU   CVTS01+40                                                02681000
CVTRV329 EQU   CVTS01+36                                                02682000
CVTRV328 EQU   CVTS01+32                                                02683000
CVTRV322 EQU   CVTS01+28                                                02684000
CVTSLID  EQU   CVTSLIDA+1                                               02685000
CVTSYLK  EQU   CVTSLIDA                                                 02686000
CVTRV321 EQU   CVTS01+20                                                02687000
CVTRV320 EQU   CVTS01+16                                                02688000
CVTLPDIR EQU   CVTLPDIA+1                                               02689000
CVTRSV69 EQU   CVTDIRST                                                 02690000
CVTRSV68 EQU   CVTDIRST                                                 02691000
CVTRSV67 EQU   CVTDIRST                                                 02692000
CVTRSV66 EQU   CVTDIRST                                                 02693000
CVTRSV65 EQU   CVTDIRST                                                 02694000
CVTRSV64 EQU   CVTDIRST                                                 02695000
CVTRSV63 EQU   CVTDIRST                                                 02696000
CVTDICOM EQU   CVTDIRST                                                 02697000
CVTPVTP  EQU   CVTS01+8                                                 02698000
CVTLPDSR EQU   CVTS01+4                                                 02699000
CVTGETL  EQU   CVTS01                                                   02700000
@NM00101 EQU   ECB+1                                                    02701000
CAMWKSEQ EQU   CAMVOLPT+10                                              02702000
CAMWKDEV EQU   CAMVOLPT                                                 02703000
@NM00100 EQU   RDF1+1                                                   02704000
@NM00099 EQU   RDF1FLGS                                                 02705000
RDF1LNTH EQU   RDF1FLGS                                                 02706000
@NM00098 EQU   RDF1FLGS                                                 02707000
@NM00097 EQU   RDF1FLGS                                                 02708000
RDF2FLGS EQU   RDF2                                                     02709000
@NM00096 EQU   TRNAMECI+470                                             02710000
GPFSEQ   EQU   GPVOLPTR+10                                              02711000
GPVOLDEV EQU   GPVOLPTR                                                 02712000
REQLEN   EQU   CATWORK+2                                                02713000
@NM00095 EQU   TESTSW                                                   02714000
SSW      EQU   TESTSW                                                   02715000
@NM00094 EQU   CAMLSTD+20                                               02716000
CAMDSCBP EQU   CAMLSTD+16                                               02717000
CAMCVOLP EQU   CAMLSTD+8                                                02718000
CAMGEN   EQU   CAMOPTNS+3                                               02719000
CAMAM0   EQU   CAMOPTN3                                                 02720000
@NM00093 EQU   CAMOPTN3                                                 02721000
CAMOPTN2 EQU   CAMOPTNS+1                                               02722000
CAMOPTN1 EQU   CAMOPTNS                                                 02723000
VARINFO  EQU   VARFIELD+2                                               02724000
EXTGOFLG EQU   EXTRCDPT+4                                               02725000
EXTGOGC  EQU   EXTGOGC1                                                 02726000
EXTGOEXT EQU   EXTGOGC1                                                 02727000
EXTGOCI  EQU   EXTRCDPT                                                 02728000
RCDID    EQU   CATRCD+44                                                02729000
@NM00092 EQU   CATRCD+4                                                 02730000
RCDCINO  EQU   CATRCD+1                                                 02731000
RCDKEYTY EQU   CATRCD                                                   02732000
CATGOGC  EQU   CATGOGC1                                                 02733000
CATGOFLG EQU   CATGOCI                                                  02734000
@NM00091 EQU   DICTFLGS                                                 02735000
DICTMV   EQU   DICTFLGS                                                 02736000
DICTFLG  EQU   DICTFLGS                                                 02737000
@NM00090 EQU   SRB+40                                                   02738000
@NM00089 EQU   SRB+38                                                   02739000
SRBPRIOR EQU   SRB+37                                                   02740000
SRBPKF   EQU   SRB+36                                                   02741000
SRBSAVE  EQU   SRB+32                                                   02742000
SRBPARM  EQU   SRB+28                                                   02743000
SRBRMTR  EQU   SRB+24                                                   02744000
SRBEP    EQU   SRB+20                                                   02745000
SRBPTCB  EQU   SRBFLC+4                                                 02746000
SRBPASID EQU   SRBFLC+2                                                 02747000
SRBCPAFF EQU   SRBFLC                                                   02748000
SRBASCB  EQU   SRB+8                                                    02749000
SRBFLNK  EQU   SRB+4                                                    02750000
SRBID    EQU   SRB                                                      02751000
NVTLPAHA EQU   NVT+548                                                  02752000
NVTLPALO EQU   NVT+544                                                  02753000
NVTRMSG  EQU   NVT+540                                                  02754000
NVTRLOCK EQU   NVT+536                                                  02755000
NVTRCODE EQU   NVT+532                                                  02756000
@NM00088 EQU   NVT+529                                                  02757000
@NM00087 EQU   NVTFLPO                                                  02758000
NVTFLWS  EQU   NVTFLPO                                                  02759000
NVTFLQS  EQU   NVTFLPO                                                  02760000
@NM00086 EQU   NVTFLPO                                                  02761000
NVTSYSP  EQU   NVTFLPO                                                  02762000
NVTFLLST EQU   NVTFLPO                                                  02763000
NVTRSV48 EQU   NVT+524                                                  02764000
NVTRSV47 EQU   NVT+520                                                  02765000
NVTRSV46 EQU   NVT+516                                                  02766000
@NM00085 EQU   NVT+512                                                  02767000
NVTREALR EQU   NVT+508                                                  02768000
NVTFASVT EQU   NVT+504                                                  02769000
NVTRSV45 EQU   NVT+496                                                  02770000
NVTVRLNG EQU   NVT+492                                                  02771000
NVTVRREG EQU   NVT+488                                                  02772000
NVTLVIRT EQU   NVT+484                                                  02773000
NVTRSV4A EQU   NVT+480                                                  02774000
NVTLPAND EQU   NVT+476                                                  02775000
NVTRMSS  EQU   NVT+472                                                  02776000
NVTRPQE  EQU   NVT+468                                                  02777000
NVTRLLE  EQU   NVT+464                                                  02778000
NVTRJPQ  EQU   NVT+460                                                  02779000
NVTVMSS  EQU   NVT+456                                                  02780000
NVTVPQE  EQU   NVT+452                                                  02781000
NVTVLLE  EQU   NVT+448                                                  02782000
NVTVJPQ  EQU   NVT+444                                                  02783000
NVTLSEC  EQU   NVTLOCAT+4                                               02784000
NVTLFST  EQU   NVTLOCAT                                                 02785000
NVTXSEC  EQU   NVTXCTL+4                                                02786000
NVTXFST  EQU   NVTXCTL                                                  02787000
@NM00084 EQU   NVT+425                                                  02788000
NVTLPACT EQU   NVT+424                                                  02789000
NVTCSLPG EQU   NVT+420                                                  02790000
NVTCSIOB EQU   NVT+416                                                  02791000
NVTCSLNM EQU   NVT+412                                                  02792000
NVTCSLIB EQU   NVT+408                                                  02793000
NVTBLDL  EQU   NVT+404                                                  02794000
NVTVRBLD EQU   NVT+400                                                  02795000
@NM00083 EQU   NVT+392                                                  02796000
NVTVRTCB EQU   NVT+388                                                  02797000
NVTVVTCB EQU   NVT+384                                                  02798000
NVTSPUCB EQU   NVT+382                                                  02799000
NVTRSV44 EQU   NVT+380                                                  02800000
NVTQSBUF EQU   NVT+376                                                  02801000
NVTPTAB  EQU   NVT+372                                                  02802000
NVTPAREA EQU   NVT+368                                                  02803000
NVTRSV43 EQU   NVT+364                                                  02804000
@NM00082 EQU   NVT+363                                                  02805000
NVTABWS1 EQU   NVT+362                                                  02806000
NVTABCD1 EQU   NVT+360                                                  02807000
@NM00081 EQU   NVT+358                                                  02808000
NVTCPUAD EQU   NVT+356                                                  02809000
NVTTOD   EQU   NVT+352                                                  02810000
NVTSPE   EQU   NVT+344                                                  02811000
NVTMBEND EQU   NVT+340                                                  02812000
NVTMBUF  EQU   NVT+336                                                  02813000
NVTDCBSN EQU   NVT+332                                                  02814000
NVTDCBOC EQU   NVT+328                                                  02815000
NVTDCBIC EQU   NVT+324                                                  02816000
@NM00080 EQU   NVT+308                                                  02817000
NVTNMBLD EQU   NVT+304                                                  02818000
NVTNIPM  EQU   NVT+292                                                  02819000
NVTPRMPT EQU   NVT+272                                                  02820000
NVTIX    EQU   NVTFLWSC                                                 02821000
NVTFLWS1 EQU   NVTWPSW2+2                                               02822000
NVTIDPSW EQU   NVTWPSW2                                                 02823000
NVTWPSW1 EQU   NVTWTPSW                                                 02824000
NVTMCPSW EQU   NVT+216                                                  02825000
@NM00079 EQU   NVT+212                                                  02826000
@NM00078 EQU   NVTFLCN                                                  02827000
NVTFLRAC EQU   NVTFLCN                                                  02828000
NVTFLNCK EQU   NVTFLCN                                                  02829000
NVTFLNHC EQU   NVTFLCN                                                  02830000
NVTFLASM EQU   NVTFLCN                                                  02831000
NVTMP    EQU   NVTFLCN                                                  02832000
NVTFLIOC EQU   NVTFLCN                                                  02833000
NVTFLAC  EQU   NVTFLCN                                                  02834000
NVTFLSG  EQU   NVT+210                                                  02835000
NVTTRACE EQU   NVT+208                                                  02836000
NVTNXPTR EQU   NVT+204                                                  02837000
NVTNXSIZ EQU   NVT+202                                                  02838000
@NM00077 EQU   NVT+200                                                  02839000
NVTSGPSA EQU   NVT+196                                                  02840000
NVTN0MSG EQU   NVT+192                                                  02841000
NVTVVPG1 EQU   NVT+188                                                  02842000
NVTNBFND EQU   NVT+184                                                  02843000
NVTNUCND EQU   NVT+180                                                  02844000
NVTSTMAP EQU   NVT+176                                                  02845000
NVTRTMSA EQU   NVT+172                                                  02846000
NVTMFASA EQU   NVT+168                                                  02847000
NVTLSPQE EQU   NVT+164                                                  02848000
NVTALSQA EQU   NVT+160                                                  02849000
NVTPQSAV EQU   NVT+156                                                  02850000
NVTSVC60 EQU   NVT+148                                                  02851000
NVTABSEC EQU   NVTABSAV+4                                               02852000
NVTABFST EQU   NVTABSAV                                                 02853000
NVTNVSQA EQU   NVT+138                                                  02854000
NVTRSVMN EQU   NVT+136                                                  02855000
NVTNBMIN EQU   NVT+134                                                  02856000
NVTRGNAV EQU   NVT+132                                                  02857000
NVTLSQNO EQU   NVT+130                                                  02858000
NVTSQANO EQU   NVT+128                                                  02859000
NVTLSQAS EQU   NVT+124                                                  02860000
NVTLNGFX EQU   NVT+120                                                  02861000
NVTIGXER EQU   NVT+116                                                  02862000
@NM00076 EQU   NVT+112                                                  02863000
NVTRSV49 EQU   NVT+108                                                  02864000
NVTNVRSZ EQU   NVT+104                                                  02865000
NVTMFA   EQU   NVT+100                                                  02866000
NVTDSSNG EQU   NVT+96                                                   02867000
NVTMSLNK EQU   NVT+92                                                   02868000
NVTVVMDI EQU   NVT+88                                                   02869000
NVTIGCER EQU   NVT+84                                                   02870000
NVTVBLDL EQU   NVT+80                                                   02871000
NVTSVCTB EQU   NVT+76                                                   02872000
NVTRSV42 EQU   NVT+72                                                   02873000
NVTRSV41 EQU   NVT+68                                                   02874000
NVTMASCB EQU   NVT+64                                                   02875000
NVTCMTCB EQU   NVT+60                                                   02876000
NVTMSTCB EQU   NVT+56                                                   02877000
@NM00075 EQU   NVTFLLB                                                  02878000
NVTFLSLB EQU   NVTFLLB                                                  02879000
@NM00074 EQU   NVTNPATR                                                 02880000
NVTNPREU EQU   NVTNPREN                                                 02881000
@NM00073 EQU   NVTNPREN                                                 02882000
NVTNPSFX EQU   NVT+53                                                   02883000
@NM00072 EQU   NVT+52                                                   02884000
NVTNPSUF EQU   NVT                                                      02885000
ACBAPID  EQU   ACBCOMN+72                                               02886000
ACBCBMWA EQU   ACBCOMN+68                                               02887000
ACBUAPTR EQU   ACBCOMN+64                                               02888000
ACBLRECL EQU   ACBCOMN+62                                               02889000
ACBMSGLN EQU   ACBBLKSZ                                                 02890000
ACBBUFSP EQU   ACBCOMN+56                                               02891000
@NM00071 EQU   ACBUJFCB+1                                               02892000
ACBOPTN  EQU   ACBUJFCB                                                 02893000
@NM00070 EQU   ACBINFLG+1                                               02894000
ACBBYPSS EQU   ACBINFLG                                                 02895000
ACBSDS   EQU   ACBVVIC                                                  02896000
ACBUCRA  EQU   ACBINFLG                                                 02897000
ACBSCRA  EQU   ACBINFLG                                                 02898000
ACBCAT   EQU   ACBINFLG                                                 02899000
ACBIJRQE EQU   ACBINFLG                                                 02900000
ACBJEPS  EQU   ACBINFLG                                                 02901000
@NM00069 EQU   ACBINFLG                                                 02902000
ACBERFLG EQU   ACBCOMN+49                                               02903000
ACBBUSY  EQU   ACBIOSFG                                                 02904000
ACBLOCK  EQU   ACBEXFG                                                  02905000
@NM00068 EQU   ACBOFLGS                                                 02906000
ACBDSERR EQU   ACBOFLGS                                                 02907000
ACBOPEN  EQU   ACBOFLGS                                                 02908000
ACBEOV   EQU   ACBOFLGS                                                 02909000
@NM00067 EQU   ACBOFLGS                                                 02910000
ACBDEB   EQU   ACBDDNM+5                                                02911000
ACBERFL  EQU   ACBDDNM+4                                                02912000
ACBAM    EQU   ACBAMETH                                                 02913000
ACBINFL  EQU   ACBDDNM+2                                                02914000
ACBTIOT  EQU   ACBDDNM                                                  02915000
ACBUEL   EQU   ACBEXLST                                                 02916000
ACBPASSW EQU   ACBCOMN+32                                               02917000
ACBMSGAR EQU   ACBCOMN+28                                               02918000
@NM00066 EQU   ACBDSORG+1                                               02919000
ACBDORGA EQU   ACBDSORG+1                                               02920000
@NM00065 EQU   ACBDSORG                                                 02921000
ACBOPTJ  EQU   ACBDVIND                                                 02922000
ACBCRNRE EQU   ACBCROPS                                                 02923000
ACBCRNCK EQU   ACBCROPS                                                 02924000
ACBASA   EQU   ACBCCTYP                                                 02925000
@NM00064 EQU   ACBCCTYP                                                 02926000
ACBTRCID EQU   ACBCCTYP                                                 02927000
@NM00063 EQU   ACBRECFM                                                 02928000
ACBRECAF EQU   ACBRECFM                                                 02929000
ACBJBUF  EQU   ACBBUFPL+2                                               02930000
ACBMACR4 EQU   ACBBUFPL+1                                               02931000
@NM00062 EQU   ACBMACR3                                                 02932000
ACBNCFX  EQU   ACBMACR3                                                 02933000
ACBSIS   EQU   ACBMACR3                                                 02934000
ACBDFR   EQU   ACBMACR3                                                 02935000
ACBICI   EQU   ACBMACR3                                                 02936000
ACBGSR   EQU   ACBMACR3                                                 02937000
ACBLSR   EQU   ACBMACR3                                                 02938000
@NM00061 EQU   ACBMACR3                                                 02939000
ACBBUFNI EQU   ACBCOMN+18                                               02940000
ACBBUFND EQU   ACBCOMN+16                                               02941000
ACBSTRNO EQU   ACBCOMN+15                                               02942000
ACBBSTNO EQU   ACBCOMN+14                                               02943000
ACBAIX   EQU   ACBMACR2                                                 02944000
ACBDSN   EQU   ACBMACR2                                                 02945000
ACBRST   EQU   ACBMACR2                                                 02946000
ACBLOGON EQU   ACBMACR2                                                 02947000
ACBSKP   EQU   ACBMACR2                                                 02948000
@NM00060 EQU   ACBMACR2                                                 02949000
ACBUBF   EQU   ACBMACR1                                                 02950000
ACBOUT   EQU   ACBMACR1                                                 02951000
ACBIN    EQU   ACBMACR1                                                 02952000
ACBDIR   EQU   ACBMACR1                                                 02953000
ACBSEQ   EQU   ACBMACR1                                                 02954000
ACBBLK   EQU   ACBCNV                                                   02955000
ACBADD   EQU   ACBADR                                                   02956000
ACBKEY   EQU   ACBMACR1                                                 02957000
ACBINRTN EQU   ACBCOMN+8                                                02958000
ACBIBCT  EQU   ACBJWA                                                   02959000
ACBLEN2  EQU   ACBLENG2                                                 02960000
ACBSTYP  EQU   ACBCOMN+1                                                02961000
ACBID    EQU   ACBCOMN                                                  02962000
CTGFLDWA EQU   CTGFL+4                                                  02963000
CTGFLDTS EQU   CTGFLDRE                                                 02964000
@NM00059 EQU   CTGFLDRE                                                 02965000
CTGFLDGC EQU   CTGFL+2                                                  02966000
CTGFLDNO EQU   CTGFL                                                    02967000
CTGPSWD  EQU   CTGJSCB                                                  02968000
@NM00057 EQU   CTGFBFLG                                                 02969000
CTGNGDSN EQU   CTGFBFLG                                                 02970000
CTGGDGB  EQU   CTGFBFLG                                                 02971000
CTGKEEP  EQU   CTGFBFLG                                                 02972000
CTGPAR   EQU   CTGFBFLG                                                 02973000
CTGFDBK  EQU   CTGNEWNM                                                 02974000
CTGTYPE  EQU   CTGPL+18                                                 02975000
@NM00056 EQU   CTGDSORG                                                 02976000
CTGOPTNS EQU   CTGDSORG                                                 02977000
CTGCVOL  EQU   CTGCAT                                                   02978000
CTGFVT   EQU   CTGENT                                                   02979000
@NM00055 EQU   CTGOPTN4                                                 02980000
CTGBYPMT EQU   CTGOPTN4                                                 02981000
@NM00054 EQU   CTGOPTN4                                                 02982000
CTGNPROF EQU   CTGOPTN4                                                 02983000
CTGDOCAT EQU   CTGOPTN4                                                 02984000
CTGLBASE EQU   CTGOPTN4                                                 02985000
CTGNUM   EQU   CTGOPTN3                                                 02986000
CTGSRH   EQU   CTGOPTN3                                                 02987000
CTGGDGL  EQU   CTGOPTN3                                                 02988000
CTGSUPLT EQU   CTGOPTN3                                                 02989000
CTGFUNC  EQU   CTGOPTN3                                                 02990000
@NM00053 EQU   CTGOPTN2                                                 02991000
CTGSCR   EQU   CTGOPTN2                                                 02992000
CTGOVRID EQU   CTGOPTN2                                                 02993000
CTGDISC  EQU   CTGOPTN2                                                 02994000
CTGGTNXT EQU   CTGOPTN2                                                 02995000
CTGSWAP  EQU   CTGRCATN                                                 02996000
CTGGTALL EQU   CTGREL                                                   02997000
CTGNSVS  EQU   CTGEXT                                                   02998000
CTGGENLD EQU   CTGOPTN1                                                 02999000
CTGCNAME EQU   CTGOPTN1                                                 03000000
CTGREAD  EQU   CTGOPTN1                                                 03001000
CTGUPD   EQU   CTGOPTN1                                                 03002000
CTGCI    EQU   CTGOPTN1                                                 03003000
CTGMAST  EQU   CTGOPTN1                                                 03004000
CTGBYPSS EQU   CTGOPTN1                                                 03005000
ABPAE    EQU   IEZABP+16                                                03006000
ABPNE    EQU   IEZABP+12                                                03007000
ABPSIOD  EQU   IEZABP+4                                                 03008000
ABPBR14  EQU   IEZABP+2                                                 03009000
ABPLEN   EQU   IEZABP+1                                                 03010000
ABPID    EQU   IEZABP                                                   03011000
IOSEND   EQU   IOSB+108                                                 03012000
IOSSKR   EQU   IOSEEKA+7                                                03013000
IOSSKH2  EQU   IOSSKHH+1                                                03014000
IOSSKH1  EQU   IOSSKHH                                                  03015000
IOSSKCC  EQU   IOSCCHH                                                  03016000
IOSSKBB  EQU   IOSEEKA+1                                                03017000
IOSSKM   EQU   IOSEEKA                                                  03018000
IOSEEK   EQU   IOSB+92                                                  03019000
IOSMDM   EQU   IOSB+91                                                  03020000
IOSMDB   EQU   IOSB+90                                                  03021000
IOSCKEY7 EQU   IOSCKEY                                                  03022000
IOSCKEY6 EQU   IOSCKEY                                                  03023000
IOSCKEY5 EQU   IOSCKEY                                                  03024000
IOSCKEY4 EQU   IOSCKEY                                                  03025000
@NM00049 EQU   IOSCKEY                                                  03026000
IOSFMSK  EQU   IOSB+88                                                  03027000
IOSCUDEV EQU   IOSPATH+1                                                03028000
@NM00048 EQU   IOSCHN                                                   03029000
IOSPATH3 EQU   IOSCHN                                                   03030000
IOSPATH2 EQU   IOSCHN                                                   03031000
IOSEXP   EQU   IOSCHN                                                   03032000
IOSGDP   EQU   IOSCHN                                                   03033000
IOSAFF   EQU   IOSB+85                                                  03034000
IOSRSS1B EQU   IOSB+84                                                  03035000
IOSDSID  EQU   IOSB+80                                                  03036000
IOSVST   EQU   IOSB+76                                                  03037000
IOSRST   EQU   IOSB+72                                                  03038000
IOSNOTRS EQU   IOSDIEFG                                                 03039000
IOSABN   EQU   IOSB+64                                                  03040000
IOSNRM   EQU   IOSB+60                                                  03041000
IOSPCI   EQU   IOSB+56                                                  03042000
IOSERP   EQU   IOSB+52                                                  03043000
IOSPCHN  EQU   IOSB+48                                                  03044000
IOSSNS   EQU   IOSB+42                                                  03045000
IOSAPMSK EQU   IOSB+40                                                  03046000
IOSRES4A EQU   IOSB+36                                                  03047000
IOSUSE   EQU   IOSB+32                                                  03048000
IOSCSWRC EQU   IOSCSW+5                                                 03049000
IOSTSB   EQU   IOSTATUS+1                                               03050000
IOSTSA   EQU   IOSTATUS                                                 03051000
IOSCSWCA EQU   IOSCSW                                                   03052000
IOSCC    EQU   @NM00047                                                 03053000
IOSUCB   EQU   IOSB+16                                                  03054000
IOSOPT2X EQU   IOSOPT2                                                  03055000
IOSHTP   EQU   IOSOPT2                                                  03056000
IOSRELSE EQU   IOSOPT                                                   03057000
IOSAPR   EQU   IOSOPT                                                   03058000
IOSTSLL  EQU   IOSOPT                                                   03059000
IOSNERP  EQU   IOSOPT                                                   03060000
IOSPSLL  EQU   IOSOPT                                                   03061000
IOSQISCE EQU   IOSOPT                                                   03062000
IOSDEP   EQU   IOSOPT                                                   03063000
IOSBYP   EQU   IOSOPT                                                   03064000
IOSCOD   EQU   IOSB+13                                                  03065000
IOSPKY7  EQU   IOSPKEY                                                  03066000
IOSPGDPX EQU   IOSPKEY                                                  03067000
IOSIDR   EQU   IOSPKEY                                                  03068000
IOSLCL   EQU   IOSPKEY                                                  03069000
@NM00046 EQU   IOSPKEY                                                  03070000
IOSPGAD  EQU   IOSB+8                                                   03071000
IOSASID  EQU   IOSB+6                                                   03072000
IOSPRLVL EQU   IOSB+5                                                   03073000
IOSDVRID EQU   IOSB+4                                                   03074000
IOSPROC  EQU   IOSB+3                                                   03075000
IOSFLC7  EQU   IOSFLC                                                   03076000
IOSCTCNR EQU   IOSFLC                                                   03077000
IOSRWAIT EQU   IOSFLC                                                   03078000
IOSTP    EQU   IOSFLC                                                   03079000
IOSCC3WE EQU   IOSFLC                                                   03080000
IOSVERIF EQU   IOSDVALT                                                 03081000
IOSDVMNT EQU   IOSFLC                                                   03082000
IOSLOG   EQU   IOSFLB                                                   03083000
IOSBDCST EQU   IOSFLB                                                   03084000
IOSMSG   EQU   IOSFLB                                                   03085000
IOSFLB4  EQU   IOSFLB                                                   03086000
IOSFLB3  EQU   IOSFLB                                                   03087000
IOSFLB2  EQU   IOSFLB                                                   03088000
IOSSDR   EQU   IOSFLB                                                   03089000
IOSDIESE EQU   IOSFLB                                                   03090000
IOSIOSB  EQU   IOSFLA                                                   03091000
IOSDOM   EQU   IOSFLA                                                   03092000
IOSEX    EQU   IOSFLA                                                   03093000
IOSSMDB  EQU   IOSFLA                                                   03094000
IOSSMDA  EQU   IOSFLA                                                   03095000
IOSERR   EQU   IOSFLA                                                   03096000
IOSCCHN  EQU   IOSACHN                                                  03097000
IOSDCHN  EQU   IOSACHN                                                  03098000
NSCHDCPU EQU   NIPSCHDL+8                                               03099000
NSCHDPRM EQU   NIPSCHDL+4                                               03100000
NSCHDPTR EQU   NIPSCHDL                                                 03101000
@NM00045 EQU   NIPOPNPL+22                                              03102000
NOPNRC   EQU   NIPOPNPL+21                                              03103000
NOPNFLSX EQU   NOPNFL                                                   03104000
NOPNFLLC EQU   NOPNFL                                                   03105000
NOPNFLLB EQU   NOPNFL                                                   03106000
NOPNFLNB EQU   NOPNFL                                                   03107000
NOPNFLI  EQU   NOPNFL                                                   03108000
NOPNFLM  EQU   NOPNFL                                                   03109000
NOPNFAU  EQU   NOPNFL                                                   03110000
NOPNFRS  EQU   NOPNFL                                                   03111000
NOPNUCB  EQU   NIPOPNPL+16                                              03112000
NOPNDCB  EQU   NIPOPNPL+12                                              03113000
NOPNDSA  EQU   NOPNDS                                                   03114000
@NM00044 EQU   NIPMNTPL+21                                              03115000
NMNTFLB  EQU   NMNTFL                                                   03116000
NMNTFLC  EQU   NMNTFL                                                   03117000
NMNTFLI  EQU   NMNTFL                                                   03118000
NMNTFUS  EQU   NMNTFL                                                   03119000
@NM00043 EQU   NMNTFL                                                   03120000
NMNTDT   EQU   NIPMNTPL+18                                              03121000
NMNTUCB  EQU   NMNTVS                                                   03122000
NMNTDSA  EQU   NMNTDS                                                   03123000
NIPSPEA  EQU   NIPSPE+4                                                 03124000
NIPSPEQ  EQU   NIPSPE                                                   03125000
NWTORMSG EQU   NWTORLST+12                                              03126000
@NM00042 EQU   NWTORLST+11                                              03127000
@NM00041 EQU   NWTORFL                                                  03128000
NWTORFLB EQU   NWTORFL                                                  03129000
@NM00040 EQU   NWTORFL                                                  03130000
NWTORFLA EQU   NWTORFL                                                  03131000
NMTORRDL EQU   NWTORLST+8                                               03132000
NWTORECB EQU   NWTORLST+4                                               03133000
NWTORRPA EQU   NWTORLST                                                 03134000
@NM00039 EQU   NWTOFL                                                   03135000
NWTOFLNC EQU   NWTOFL                                                   03136000
NWTOFLNH EQU   NWTOFL                                                   03137000
NWTOLNG  EQU   NWTOHDR                                                  03138000
PLHERRET EQU   IDAPLH+276                                               03139000
PLHASCB  EQU   IDAPLH+272                                               03140000
PLHECB   EQU   IDAPLH+268                                               03141000
@NM00037 EQU   IDAPLH+265                                               03142000
PLHDRMSK EQU   IDAPLH+264                                               03143000
PLHR13   EQU   IDAPLH+260                                               03144000
PLHPARM1 EQU   IDAPLH+256                                               03145000
PLHDRRSC EQU   IDAPLH+252                                               03146000
PLHRRN   EQU   PLHKEYPT                                                 03147000
PLHSLRBA EQU   IDAPLH+244                                               03148000
PLHSRCSG EQU   IDAPLH+242                                               03149000
PLHNOSEG EQU   IDAPLH+240                                               03150000
PLHLLOR  EQU   IDAPLH+236                                               03151000
PLHXPLH  EQU   PLHWAX                                                   03152000
@NM00036 EQU   PLHIXSPL+8                                               03153000
PLHIXBFC EQU   PLHIXSPL+4                                               03154000
PLHHIREC EQU   PLHSSRBA                                                 03155000
PLHISPLP EQU   IDAPLH+196                                               03156000
PLHRBUFC EQU   IDAPLH+192                                               03157000
PLHIBUFC EQU   IDAPLH+188                                               03158000
PLHNRBA  EQU   IDAPLH+184                                               03159000
PLHDDDD  EQU   PLHEOVPT                                                 03160000
PLHAR14  EQU   IDAPLH+176                                               03161000
@NM00035 EQU   IDAPLH+172                                               03162000
@NM00034 EQU   IDAPLH+168                                               03163000
PLHASAVE EQU   IDAPLH+164                                               03164000
PLHRET1  EQU   IDAPLH+120                                               03165000
@NM00033 EQU   IDAPLH+118                                               03166000
PLHRETO  EQU   IDAPLH+116                                               03167000
PLHCHAIN EQU   IDAPLH+112                                               03168000
PLHAMB   EQU   IDAPLH+108                                               03169000
PLHSAVE6 EQU   IDAPLH+104                                               03170000
PLHSAVE5 EQU   IDAPLH+100                                               03171000
PLHSAVE4 EQU   IDAPLH+96                                                03172000
PLHSAVE3 EQU   IDAPLH+92                                                03173000
PLHSAVE2 EQU   IDAPLH+88                                                03174000
PLHSAVE1 EQU   IDAPLH+84                                                03175000
PLHARET  EQU   IDAPLH+80                                                03176000
PLHIIOB  EQU   PLHDIOB                                                  03177000
PLHSRSID EQU   IDAPLH+74                                                03178000
PLHRDFC  EQU   IDAPLH+72                                                03179000
PLHRDFP  EQU   IDAPLH+68                                                03180000
PLHFSP   EQU   IDAPLH+64                                                03181000
PLHRECP  EQU   IDAPLH+60                                                03182000
PLHNBUFC EQU   IDAPLH+56                                                03183000
PLHDBUFC EQU   IDAPLH+52                                                03184000
PLHLRECL EQU   IDAPLH+48                                                03185000
PLHARDB  EQU   IDAPLH+44                                                03186000
@NM00032 EQU   IDAPLH+43                                                03187000
PLHEOVR  EQU   IDAPLH+42                                                03188000
PLHRCODE EQU   IDAPLH+41                                                03189000
PLHUCODE EQU   PLHJCODE                                                 03190000
PLHJNRBA EQU   IDAPLH+36                                                03191000
PLHCNCL2 EQU   PLHJRNLL                                                 03192000
PLHUPECB EQU   PLHJORBA                                                 03193000
PLHDSIDA EQU   IDAPLH+24                                                03194000
PLHCRPL  EQU   IDAPLH+20                                                03195000
PLHMRPL  EQU   IDAPLH+16                                                03196000
PLHBFRNO EQU   IDAPLH+15                                                03197000
PLHFRCNT EQU   IDAPLH+14                                                03198000
PLHRMIN  EQU   IDAPLH+13                                                03199000
PLHDSTYP EQU   IDAPLH+12                                                03200000
PLHACB   EQU   IDAPLH+8                                                 03201000
PLHRABWD EQU   PLHAFLGS                                                 03202000
PLHIOSID EQU   PLHAFLGS                                                 03203000
PLHDBDC  EQU   PLHAFLGS                                                 03204000
PLHVAMB  EQU   PLHAFLGS                                                 03205000
PLHIOSRQ EQU   PLHAFLGS                                                 03206000
PLHDRLM  EQU   PLHAFLGS                                                 03207000
PLHEOVDF EQU   PLHFLG3                                                  03208000
PLHRVRS  EQU   PLHFLG3                                                  03209000
PLHBWD   EQU   PLHFLG3                                                  03210000
PLHSLVLD EQU   PLHFLG3                                                  03211000
PLHRAHD  EQU   PLHFLG3                                                  03212000
PLHSRBSG EQU   PLHFLG3                                                  03213000
@NM00031 EQU   PLHEFLGS+1                                               03214000
PLHRSTRT EQU   PLHEFLGS+1                                               03215000
PLHDSCAN EQU   PLHEFLGS                                                 03216000
PLHINVAL EQU   PLHEFLGS                                                 03217000
PLHEODX  EQU   PLHEFLGS                                                 03218000
PLHNOADV EQU   PLHEFLGS                                                 03219000
PLHSRINV EQU   PLHEFLGS                                                 03220000
PLHSKPER EQU   PLHEFLGS                                                 03221000
PLH1ST   EQU   PLHEFLGS                                                 03222000
PLHNOSPC EQU   PLHEFLGS                                                 03223000
PLHIWAIT EQU   PLHFLG2                                                  03224000
PLHSVADV EQU   PLHFLG2                                                  03225000
PLHCIINS EQU   PLHFLG2                                                  03226000
PLHKRE   EQU   PLHFLG2                                                  03227000
PLHADDTE EQU   PLHFLG2                                                  03228000
PLHKEYMD EQU   PLHFLG2                                                  03229000
PLHSQINS EQU   PLHFLG2                                                  03230000
PLHUPD   EQU   PLHFLG2                                                  03231000
PLHSR    EQU   PLHFLG1                                                  03232000
PLHDRPND EQU   PLHFLG1                                                  03233000
PLHASYRQ EQU   PLHFLG1                                                  03234000
PLHRDEXC EQU   PLHFLG1                                                  03235000
PLHSSR   EQU   PLHFLG1                                                  03236000
PLHASKBF EQU   PLHFLG1                                                  03237000
PLHENDRQ EQU   PLHFLG1                                                  03238000
PLHEOVW  EQU   PLHFLG1                                                  03239000
PLHATV   EQU   IDAPLH+1                                                 03240000
PLHAVL   EQU   IDAPLH                                                   03241000
PLHIOSDQ EQU   IDAPLHDR+12                                              03242000
PLHDRCUR EQU   IDAPLHDR+10                                              03243000
PLHDRMAX EQU   IDAPLHDR+8                                               03244000
PLHDRREQ EQU   IDAPLHDR+4                                               03245000
PLHELTH  EQU   IDAPLHDR+2                                               03246000
PLHCNT   EQU   IDAPLHDR+1                                               03247000
PLHID    EQU   IDAPLHDR                                                 03248000
IXKEY    EQU   IDAIXK                                                   03249000
IXSELL   EQU   IDASELL                                                  03250000
IBFLP1   EQU   IBFLP2                                                   03251000
IXHFSO   EQU   IDAIXH+18                                                03252000
IXHFLGS  EQU   IDAIXH+17                                                03253000
IXHXX    EQU   IDAIXH+12                                                03254000
@NM00030 EQU   IXSBFLG                                                  03255000
IXSLELV  EQU   IXSBFLG                                                  03256000
IXSSSRH  EQU   IXSBFLG                                                  03257000
IXSNOSR  EQU   IDAIXSPL+16                                              03258000
IXSKLEN  EQU   IDAIXSPL+14                                              03259000
IXSILN   EQU   IDAIXSPL+13                                              03260000
IXSTLN   EQU   IDAIXSPL+12                                              03261000
IXSARG   EQU   IDAIXSPL+8                                               03262000
IXSBUFC  EQU   IDAIXSPL+4                                               03263000
IXSSTRBA EQU   IDAIXSPL                                                 03264000
IOMSTCB  EQU   IDAIOMB+128                                              03265000
IOMSRBP  EQU   IDAIOMB+124                                              03266000
IOMUFLD  EQU   IDAIOMB+120                                              03267000
IOMNXT1  EQU   IDAIOMB+116                                              03268000
IOMSAVEF EQU   IOMSAVER+60                                              03269000
IOMSAVEE EQU   IOMSAVER+56                                              03270000
IOMSAVED EQU   IOMSAVER+52                                              03271000
IOMSAVEC EQU   IOMSAVER+48                                              03272000
IOMSAVEB EQU   IOMSAVER+44                                              03273000
IOMSAVEA EQU   IOMSAVER+40                                              03274000
IOMSAVE9 EQU   IOMSAVER+36                                              03275000
IOMSAVE8 EQU   IOMSAVER+32                                              03276000
IOMSAVE7 EQU   IOMSAVER+28                                              03277000
IOMSAVE6 EQU   IOMSAVER+24                                              03278000
IOMSAVE5 EQU   IOMSAVER+20                                              03279000
IOMSAVE4 EQU   IOMSAVER+16                                              03280000
IOMSAVE3 EQU   IOMSAVER+12                                              03281000
IOMSAVE2 EQU   IOMSAVER+8                                               03282000
IOMSAVE1 EQU   IOMSAVER+4                                               03283000
IOMSAVE0 EQU   IOMSAVER                                                 03284000
IOMNSEG  EQU   IDAIOMB+50                                               03285000
IOMNBUF  EQU   IDAIOMB+48                                               03286000
IOMNMOD  EQU   IDAIOMB+46                                               03287000
IOMLOCK  EQU   IDAIOMB+45                                               03288000
IOMPFERR EQU   IDAIOMB+44                                               03289000
IOMCKEY  EQU   IDAIOMB+43                                               03290000
IOMSR    EQU   IOMSTIND                                                 03291000
IOMSRBM  EQU   IOMSTIND                                                 03292000
IOMSLOC  EQU   IOMSTIND                                                 03293000
IOMLLOCK EQU   IOMSTIND                                                 03294000
IOMEOVXC EQU   IOMSTIND                                                 03295000
IOMEOVTS EQU   IOMSTIND                                                 03296000
IOMEOVW  EQU   IOMSTIND                                                 03297000
IOMAMUSE EQU   IOMSTIND                                                 03298000
@NM00029 EQU   IOMFL+1                                                  03299000
IOMIRBSW EQU   IOMFL+1                                                  03300000
IOMEEXIT EQU   IOMFL+1                                                  03301000
@NM00028 EQU   IOMFL+1                                                  03302000
IOMCPRB  EQU   IOMFL+1                                                  03303000
IOMDDR   EQU   IOMFL+1                                                  03304000
IOMCSW   EQU   IOMFL                                                    03305000
IOMPGFIX EQU   IOMFL                                                    03306000
IOMADERR EQU   IOMFL                                                    03307000
IOMCBERR EQU   IOMFL                                                    03308000
@NM00027 EQU   IOMFL                                                    03309000
IOMPURGE EQU   IOMFL                                                    03310000
IOMAE    EQU   IOMAPEND                                                 03311000
IOMNE    EQU   IOMAPEND                                                 03312000
IOMPGAD  EQU   IDAIOMB+32                                               03313000
IOMVSL   EQU   IDAIOMB+28                                               03314000
IOMIQE   EQU   IDAIOMB+20                                               03315000
IOMAMB   EQU   IDAIOMB+16                                               03316000
IOMBID   EQU   IDAIOMB                                                  03317000
BUFCEND  EQU   IDABUFC+64                                               03318000
BUFCUCDN EQU   IDABUFC+60                                               03319000
BUFCUCUP EQU   IDABUFC+56                                               03320000
BUFCMDBT EQU   IDABUFC+52                                               03321000
BUFCHAIN EQU   IDABUFC+48                                               03322000
BUFXORBA EQU   IDABUFC+44                                               03323000
BUFXIRBA EQU   IDABUFC+40                                               03324000
BUFCNXT2 EQU   IDABUFC+37                                               03325000
BUFCIDXL EQU   IDABUFC+36                                               03326000
BUFCDSPC EQU   IDABUFC+32                                               03327000
BUFCWLEN EQU   BUFCINV                                                  03328000
BUFCNXT1 EQU   IDABUFC+24                                               03329000
BUFCORBA EQU   IDABUFC+12                                               03330000
BUFCAMB  EQU   BUFCPLH                                                  03331000
@NM00026 EQU   BUFCFLG2                                                 03332000
BUFCBSYW EQU   BUFCFLG2                                                 03333000
BUFCBSYR EQU   BUFCFLG2                                                 03334000
BUFCNLAS EQU   BUFCFLG2                                                 03335000
BUFCXDDR EQU   BUFCFLG2                                                 03336000
BUFCFIX  EQU   BUFCIOFL                                                 03337000
BUFCPFCP EQU   BUFCIOFL                                                 03338000
BUFCWC   EQU   BUFCIOFL                                                 03339000
BUFCREAL EQU   BUFCIOFL                                                 03340000
BUFCFMT  EQU   BUFCIOFL                                                 03341000
BUFCMW   EQU   BUFCIOFL                                                 03342000
BUFCEPT  EQU   BUFCFLG1                                                 03343000
BUFCEXC  EQU   BUFCFLG1                                                 03344000
BUFCVAL  EQU   BUFCFLG1                                                 03345000
BUFCINS  EQU   BUFCFLG1                                                 03346000
BUFCSEG  EQU   BUFCFLG1                                                 03347000
BUFCUPG  EQU   BUFCFLG1                                                 03348000
BUFCUCNT EQU   BUFCAVL                                                  03349000
@NM00025 EQU   IDABUFDR+16                                              03350000
BUFDBUFC EQU   IDABUFDR+12                                              03351000
@NM00024 EQU   BUFDRFLG                                                 03352000
BUFDRAVL EQU   BUFDRFLG                                                 03353000
BUFDRREL EQU   BUFDRFLG                                                 03354000
BUFDRTSB EQU   IDABUFDR+10                                              03355000
BUFDRMAX EQU   BUFDRCIX                                                 03356000
BUFDRPFN EQU   IDABUFDR+8                                               03357000
BUFDRPFB EQU   IDABUFDR+4                                               03358000
BUFDRLEN EQU   IDABUFDR+2                                               03359000
BUFDRNO  EQU   IDABUFDR+1                                               03360000
BUFDRID  EQU   IDABUFDR                                                 03361000
AMDEXCP  EQU   AMDSTAT+44                                               03362000
AMDNCAS  EQU   AMDSTAT+40                                               03363000
AMDNCIS  EQU   AMDSTAT+36                                               03364000
AMDASPA  EQU   AMDSTAT+32                                               03365000
AMDRETR  EQU   AMDSTAT+28                                               03366000
AMDUPR   EQU   AMDSTAT+24                                               03367000
AMDIREC  EQU   AMDSTAT+20                                               03368000
AMDDELR  EQU   AMDSTAT+16                                               03369000
AMDNLR   EQU   AMDSTAT+12                                               03370000
AMDNEXT  EQU   AMDSTAT+10                                               03371000
AMDNIL   EQU   AMDSTAT+8                                                03372000
AMDSTSP  EQU   AMDSTAT                                                  03373000
@NM00023 EQU   IDAAMDSB+41                                              03374000
@NM00022 EQU   AMDATTR3                                                 03375000
AMDLM    EQU   AMDATTR3                                                 03376000
AMDWAIT  EQU   AMDATTR3                                                 03377000
AMDBIND  EQU   AMDATTR3                                                 03378000
AMDFAULT EQU   AMDATTR3                                                 03379000
AMDUNQ   EQU   AMDATTR3                                                 03380000
AMDPARDB EQU   IDAAMDSB+36                                              03381000
AMDMAXRR EQU   AMDSSRBA                                                 03382000
AMDNSLOT EQU   AMDHLRBA                                                 03383000
AMDLRECL EQU   IDAAMDSB+24                                              03384000
AMDFSCI  EQU   IDAAMDSB+16                                              03385000
AMDFSCA  EQU   IDAAMDSB+14                                              03386000
AMDCIPCA EQU   IDAAMDSB+12                                              03387000
AMDPCTCI EQU   IDAAMDSB+11                                              03388000
AMDPCTCA EQU   IDAAMDSB+10                                              03389000
AMDKEYLN EQU   IDAAMDSB+8                                               03390000
AMDRKP   EQU   IDAAMDSB+6                                               03391000
AMDAXRKP EQU   AMDNEST                                                  03392000
AMDLEN   EQU   IDAAMDSB+2                                               03393000
AMDSPAN  EQU   AMDATTR                                                  03394000
AMDRRDS  EQU   AMDATTR                                                  03395000
AMDRANGE EQU   AMDATTR                                                  03396000
AMDORDER EQU   AMDATTR                                                  03397000
AMDREPL  EQU   AMDATTR                                                  03398000
AMDSDT   EQU   AMDATTR                                                  03399000
AMDWCK   EQU   AMDATTR                                                  03400000
AMDDST   EQU   AMDATTR                                                  03401000
AMDSBID  EQU   IDAAMDSB                                                 03402000
AMBLCMB  EQU   IDAAMBL+64                                               03403000
AMBLBIB  EQU   IDAAMBL+60                                               03404000
AMBLMIDS EQU   IDAAMBL+42                                               03405000
AMBLNIDS EQU   IDAAMBL+41                                               03406000
@NM00021 EQU   IDAAMBL+40                                               03407000
AMBLNUM  EQU   IDAAMBL+38                                               03408000
AMBLNST  EQU   IDAAMBL+37                                               03409000
@NM00020 EQU   AMBLFLG2                                                 03410000
AMBLSTAG EQU   AMBLFLG2                                                 03411000
@NM00019 EQU   AMBLFLG2                                                 03412000
AMBLDUMY EQU   AMBLFLG1                                                 03413000
AMBLCAT  EQU   AMBLFLG1                                                 03414000
AMBLUCRA EQU   AMBLFLG1                                                 03415000
AMBLSCRA EQU   AMBLFLG1                                                 03416000
AMBLSDS  EQU   AMBLVVIC                                                 03417000
AMBLUPD  EQU   AMBLFLG1                                                 03418000
AMBLCINV EQU   AMBLFLG1                                                 03419000
AMBLFULL EQU   AMBLFLG1                                                 03420000
AMBLLEN  EQU   IDAAMBL+34                                               03421000
@NM00018 EQU   AMBLSHAR                                                 03422000
AMBLWRIT EQU   AMBLSHAR                                                 03423000
AMBLCATO EQU   AMBLSHAR                                                 03424000
AMBLPRIM EQU   AMBLSHAR                                                 03425000
AMBLID   EQU   IDAAMBL+32                                               03426000
@NM00017 EQU   IDAAMBL+31                                               03427000
@NM00016 EQU   AMBLTYPE                                                 03428000
AMBLFIX  EQU   AMBLTYPE                                                 03429000
AMBLBASE EQU   AMBLTYPE                                                 03430000
AMBLAIX  EQU   AMBLTYPE                                                 03431000
AMBLUPGR EQU   AMBLTYPE                                                 03432000
AMBLPATH EQU   AMBLTYPE                                                 03433000
AMBLENO  EQU   AMBLVC+1                                                 03434000
AMBLVRT  EQU   AMBLVC                                                   03435000
AMBLXPT  EQU   IDAAMBL+24                                               03436000
AMBLDFR  EQU   AMBLQ                                                    03437000
AMBLESDS EQU   AMBLQ                                                    03438000
AMBLKSDS EQU   AMBLQ                                                    03439000
AMBLUBF  EQU   AMBLQ                                                    03440000
AMBLFSTP EQU   AMBLQ                                                    03441000
AMBLLSR  EQU   AMBLQ                                                    03442000
AMBLGSR  EQU   AMBLQ                                                    03443000
AMBLDDC  EQU   AMBLQ                                                    03444000
AMBLDCI  EQU   AMBLIDF+4                                                03445000
AMBLCACB EQU   AMBLIDF                                                  03446000
@NM00015 EQU   AMBLEOV+2                                                03447000
AMBLCOMP EQU   AMBLEOV+1                                                03448000
AMBLESET EQU   AMBLEFLG                                                 03449000
AMBLWAIT EQU   AMBLEFLG                                                 03450000
AMBLACB  EQU   IDAAMBL+8                                                03451000
AMBLSCHN EQU   IDAAMBL+4                                                03452000
AMBLPCHN EQU   IDAAMBL                                                  03453000
AMBVIOT  EQU   IDAAMB+116                                               03454000
AMBSZCP  EQU   IDAAMB+114                                               03455000
AMBSZFW  EQU   IDAAMB+112                                               03456000
AMBSZWR  EQU   IDAAMB+110                                               03457000
AMBSZRD  EQU   IDAAMB+108                                               03458000
AMBEXEX  EQU   IDAAMB+100                                               03459000
AMBWSHD  EQU   IDAAMB+96                                                03460000
AMBCPA   EQU   IDAAMB+92                                                03461000
AMBBM2SH EQU   IDAAMB+88                                                03462000
AMBRDCNT EQU   AMBCSWD1+2                                               03463000
@NM00014 EQU   AMBCSWD1+1                                               03464000
@NM00013 EQU   AMBAFLG                                                  03465000
AMBCFX   EQU   AMBAFLG                                                  03466000
AMBSIS   EQU   AMBAFLG                                                  03467000
AMBDFR   EQU   AMBAFLG                                                  03468000
AMBICI   EQU   AMBAFLG                                                  03469000
AMBGSR   EQU   AMBAFLG                                                  03470000
AMBLSR   EQU   AMBAFLG                                                  03471000
@NM00012 EQU   AMBAFLG                                                  03472000
AMBUPLH  EQU   IDAAMB+80                                                03473000
AMBPAMBL EQU   IDAAMB+76                                                03474000
AMBPIXP  EQU   IDAAMB+72                                                03475000
@NM00011 EQU   IDAAMB+68                                                03476000
AMBIWA   EQU   IDAAMB+64                                                03477000
AMBWKA   EQU   IDAAMB+60                                                03478000
AMBAMBXN EQU   AMBEOVPT                                                 03479000
AMBEDB   EQU   IDAAMB+52                                                03480000
AMBRPT   EQU   IDAAMB+50                                                03481000
AMBPUG   EQU   AMBFLG2                                                  03482000
AMBBUSY  EQU   AMBOFLGS                                                 03483000
AMBEXFG  EQU   AMBOFLGS                                                 03484000
@NM00010 EQU   AMBOFLGS                                                 03485000
AMBOPEN  EQU   AMBOFLGS                                                 03486000
@NM00009 EQU   AMBOFLGS                                                 03487000
AMBDEBAD EQU   AMBDEBPT+1                                               03488000
AMBIFLGS EQU   AMBDEBPT                                                 03489000
AMBAMETH EQU   IDAAMB+43                                                03490000
AMBSDS   EQU   AMBINFL                                                  03491000
AMBUPX   EQU   AMBINFL                                                  03492000
AMBUCRA  EQU   AMBINFL                                                  03493000
AMBSCRA  EQU   AMBINFL                                                  03494000
AMBCAT   EQU   AMBINFL                                                  03495000
@NM00008 EQU   AMBINFL                                                  03496000
@NM00007 EQU   AMBINFL                                                  03497000
AMBTIOT  EQU   IDAAMB+40                                                03498000
@NM00006 EQU   IDAAMB+38                                                03499000
AMBDDSN  EQU   IDAAMB+35                                                03500000
AMBCDSN  EQU   IDAAMB+32                                                03501000
@NM00005 EQU   AMBDSORG+1                                               03502000
AMBDORGA EQU   AMBDSORG+1                                               03503000
@NM00004 EQU   AMBDSORG                                                 03504000
AMBINBUF EQU   AMBFLG1                                                  03505000
AMBJRN   EQU   AMBFLG1                                                  03506000
AMBUBF   EQU   AMBFLG1                                                  03507000
AMBSPEED EQU   AMBFLG1                                                  03508000
AMBPCAT  EQU   AMBFLG1                                                  03509000
AMBMCAT  EQU   AMBFLG1                                                  03510000
AMBTYPE  EQU   AMBFLG1                                                  03511000
AMBCREAT EQU   AMBFLG1                                                  03512000
@NM00003 EQU   AMBFLG0                                                  03513000
AMBSWSP  EQU   AMBFLG0                                                  03514000
AMBPSDS  EQU   AMBFLG0                                                  03515000
AMBCACB  EQU   IDAAMB+16                                                03516000
AMBLINK  EQU   IDAAMB+4                                                 03517000
AMBLEN   EQU   IDAAMB+2                                                 03518000
AMBRSC   EQU   IDAAMB+1                                                 03519000
AMBID    EQU   IDAAMB                                                   03520000
CVTLEVL  EQU   CVTRELNO+2                                               03521000
CVTNUMB  EQU   CVTRELNO                                                 03522000
CVTMDL   EQU   CVTFIX+250                                               03523000
@NM00002 EQU   CVTFIX+248                                               03524000
@NM00001 EQU   CVTFIX                                                   03525000
CVTRV482 EQU   CVTXTNT2+128                                             03526000
CVTRV481 EQU   CVTXTNT2+124                                             03527000
CVTRV480 EQU   CVTXTNT2+120                                             03528000
CVTRV479 EQU   CVTXTNT2+118                                             03529000
CVTRV478 EQU   CVTXTNT2+117                                             03530000
CVTRV477 EQU   CVTXTNT2+116                                             03531000
CVTRV476 EQU   CVTXTNT2+115                                             03532000
CVTRV475 EQU   CVTXTNT2+114                                             03533000
CVTRV474 EQU   CVTRV466                                                 03534000
CVTRV473 EQU   CVTRV466                                                 03535000
CVTRV472 EQU   CVTRV466                                                 03536000
CVTRV471 EQU   CVTRV466                                                 03537000
CVTRV470 EQU   CVTRV466                                                 03538000
CVTRV469 EQU   CVTRV466                                                 03539000
CVTRV468 EQU   CVTRV466                                                 03540000
CVTRV467 EQU   CVTRV466                                                 03541000
CVTRV465 EQU   CVTRV457                                                 03542000
CVTRV464 EQU   CVTRV457                                                 03543000
CVTRV463 EQU   CVTRV457                                                 03544000
CVTRV462 EQU   CVTRV457                                                 03545000
CVTRV461 EQU   CVTRV457                                                 03546000
CVTRV460 EQU   CVTRV457                                                 03547000
CVTRV459 EQU   CVTRV457                                                 03548000
CVTRV458 EQU   CVTRV457                                                 03549000
CVTRV456 EQU   CVTXTNT2+108                                             03550000
CVTRV455 EQU   CVTXTNT2+104                                             03551000
CVTRV454 EQU   CVTXTNT2+100                                             03552000
CVTRV453 EQU   CVTXTNT2+96                                              03553000
CVTRV452 EQU   CVTXTNT2+94                                              03554000
CVTRV451 EQU   CVTXTNT2+92                                              03555000
CVTRV450 EQU   CVTXTNT2+90                                              03556000
CVTRV449 EQU   CVTXTNT2+88                                              03557000
CVTRV448 EQU   CVTXTNT2+87                                              03558000
CVTRV447 EQU   CVTXTNT2+86                                              03559000
CVTRV446 EQU   CVTRV438                                                 03560000
CVTRV445 EQU   CVTRV438                                                 03561000
CVTRV444 EQU   CVTRV438                                                 03562000
CVTRV443 EQU   CVTRV438                                                 03563000
CVTRV442 EQU   CVTRV438                                                 03564000
CVTRV441 EQU   CVTRV438                                                 03565000
CVTRV440 EQU   CVTRV438                                                 03566000
CVTRV439 EQU   CVTRV438                                                 03567000
CVTRV437 EQU   CVTRV429                                                 03568000
CVTRV436 EQU   CVTRV429                                                 03569000
CVTRV435 EQU   CVTRV429                                                 03570000
CVTRV434 EQU   CVTRV429                                                 03571000
CVTRV433 EQU   CVTRV429                                                 03572000
CVTRV432 EQU   CVTRV429                                                 03573000
CVTRV431 EQU   CVTRV429                                                 03574000
CVTRV430 EQU   CVTRV429                                                 03575000
CVTRV428 EQU   CVTXTNT2+80                                              03576000
CVTRV427 EQU   CVTXTNT2+76                                              03577000
CVTRV426 EQU   CVTXTNT2+72                                              03578000
CVTRV425 EQU   CVTXTNT2+68                                              03579000
CVTATACT EQU   CVTATCVT                                                 03580000
CVTRV423 EQU   CVTXTNT2+62                                              03581000
CVTRV422 EQU   CVTXTNT2+60                                              03582000
CVTRV421 EQU   CVTXTNT2+58                                              03583000
CVTRV420 EQU   CVTXTNT2+56                                              03584000
CVTRV419 EQU   CVTXTNT2+55                                              03585000
CVTRV418 EQU   CVTXTNT2+54                                              03586000
CVTRV417 EQU   CVTRV409                                                 03587000
CVTRV416 EQU   CVTRV409                                                 03588000
CVTRV415 EQU   CVTRV409                                                 03589000
CVTRV414 EQU   CVTRV409                                                 03590000
CVTRV413 EQU   CVTRV409                                                 03591000
CVTRV412 EQU   CVTRV409                                                 03592000
CVTRV411 EQU   CVTRV409                                                 03593000
CVTRV410 EQU   CVTRV409                                                 03594000
CVTRV408 EQU   CVTRV400                                                 03595000
CVTRV407 EQU   CVTRV400                                                 03596000
CVTRV406 EQU   CVTRV400                                                 03597000
CVTRV405 EQU   CVTRV400                                                 03598000
CVTRV404 EQU   CVTRV400                                                 03599000
CVTRV403 EQU   CVTRV400                                                 03600000
CVTRV402 EQU   CVTRV400                                                 03601000
CVTRV401 EQU   CVTRV400                                                 03602000
CVTICB   EQU   CVTXTNT2+48                                              03603000
CVTSKTA  EQU   CVTXTNT2+44                                              03604000
CVTRSV99 EQU   CVTXTNT2+40                                              03605000
CVTRSV98 EQU   CVTXTNT2+36                                              03606000
CVTRSV97 EQU   CVTXTNT2+34                                              03607000
CVTRSV96 EQU   CVTXTNT2+32                                              03608000
CVTOLTEP EQU   CVTXTNT2+28                                              03609000
CVTQIDA  EQU   CVTQID+1                                                 03610000
CVTRSV95 EQU   CVTQID                                                   03611000
CVTRSV94 EQU   CVTXTNT2+20                                              03612000
CVTRSV93 EQU   CVTXTNT2+16                                              03613000
CVTRSV92 EQU   CVTXTNT2+12                                              03614000
CVTDEBVR EQU   CVTXTNT2+8                                               03615000
CVTRSV91 EQU   CVTXTNT2+6                                               03616000
CVTRSV9H EQU   CVTFLGBT                                                 03617000
CVTRSV9G EQU   CVTFLGBT                                                 03618000
CVTRSV9F EQU   CVTFLGBT                                                 03619000
CVTRSV9E EQU   CVTFLGBT                                                 03620000
CVTRSV9D EQU   CVTFLGBT                                                 03621000
CVTRSV9C EQU   CVTFLGBT                                                 03622000
CVTVME   EQU   CVTFLGBT                                                 03623000
CVTNPE   EQU   CVTFLGBT                                                 03624000
CVTNUCLS EQU   CVTXTNT2+4                                               03625000
CVTDSSVA EQU   CVTDSSV+1                                                03626000
CVTRSV89 EQU   CVTDSSV                                                  03627000
CVTRSV88 EQU   CVTXTNT1+8                                               03628000
CVTRSV87 EQU   CVTXTNT1+4                                               03629000
CVTFACHN EQU   CVTXTNT1                                                 03630000
CVTRV488 EQU   CVTMAP+412                                               03631000
CVTRV487 EQU   CVTMAP+408                                               03632000
CVTRV486 EQU   CVTMAP+404                                               03633000
CVTRV485 EQU   CVTMAP+400                                               03634000
CVTACTAP EQU   CVTMAP+396                                               03635000
CVTAUTH  EQU   CVTMAP+392                                               03636000
CVTATMCA EQU   CVTATMCT+1                                               03637000
CVTATMST EQU   CVTATMCT                                                 03638000
CVTRSV61 EQU   CVTMAP+384                                               03639000
CVTVOLT1 EQU   CVTVOLM1+1                                               03640000
CVTVOLI1 EQU   CVTVOLF1                                                 03641000
CVTSTOA  EQU   CVTMAP+376                                               03642000
CVTRSV58 EQU   CVTMAP+374                                               03643000
CVTRSV57 EQU   CVTMAP+372                                               03644000
CVTDDCE  EQU   CVTMAP+368                                               03645000
CVTPNWFR EQU   CVTMAP+364                                               03646000
CVTSMF   EQU   CVTMAP+360                                               03647000
CVTSULK  EQU   CVTMAP+358                                               03648000
CVTSLKO  EQU   CVTSYSK                                                  03649000
CVTSLKP  EQU   CVTSYSK                                                  03650000
CVTSLKQ  EQU   CVTSYSK                                                  03651000
CVTSLKR  EQU   CVTSYSK                                                  03652000
CVTRSV56 EQU   CVTSYSK                                                  03653000
CVTRSV55 EQU   CVTSYSK                                                  03654000
CVTRSV54 EQU   CVTSYSK                                                  03655000
CVTRSV53 EQU   CVTSYSK                                                  03656000
CVTRSV52 EQU   CVTA1F1                                                  03657000
CVTRSV51 EQU   CVTA1F1                                                  03658000
CVTRSV50 EQU   CVTA1F1                                                  03659000
CVTRSV49 EQU   CVTA1F1                                                  03660000
CVTRSV48 EQU   CVTA1F1                                                  03661000
CVTRSV47 EQU   CVTA1F1                                                  03662000
CVTSRSW  EQU   CVTA1F1                                                  03663000
CVTPFSW  EQU   CVTA1F1                                                  03664000
CVTPCVT  EQU   CVTMAP+352                                               03665000
CVTRSV46 EQU   CVTMAP+344                                               03666000
CVTRSV45 EQU   CVTMAP+340                                               03667000
CVTRSV44 EQU   CVTMAP+338                                               03668000
CVTRSV43 EQU   CVTMAP+336                                               03669000
CVTHJESA EQU   CVTHJES+1                                                03670000
CVTRSV42 EQU   CVTHJES                                                  03671000
CVTEXT2A EQU   CVTEXT2+1                                                03672000
CVTRSV41 EQU   CVTEXT2                                                  03673000
CVTAPFA  EQU   CVTAPF+1                                                 03674000
CVTRSV40 EQU   CVTAPF                                                   03675000
CVTRV518 EQU   CVTINTLA                                                 03676000
CVTRV517 EQU   CVTERPV                                                  03677000
CVTEORM  EQU   CVTMAP+312                                               03678000
CVTMCHPR EQU   CVTMAP+308                                               03679000
CVTTZ    EQU   CVTMAP+304                                               03680000
CVTJEPS  EQU   CVTMAP+300                                               03681000
CVTJESCT EQU   CVTMAP+296                                               03682000
CVTMODE  EQU   CVTMAP+292                                               03683000
CVTPTRV  EQU   CVTMAP+288                                               03684000
CVTREAL  EQU   CVTMAP+284                                               03685000
CVTRSV39 EQU   CVTMAP+280                                               03686000
CVTRSV38 EQU   CVTMAP+276                                               03687000
CVTDMSRA EQU   CVTDMSR+1                                                03688000
CVTRV634 EQU   CVTDMSRF                                                 03689000
CVTRV633 EQU   CVTDMSRF                                                 03690000
CVTRV632 EQU   CVTDMSRF                                                 03691000
CVTRV631 EQU   CVTDMSRF                                                 03692000
CVTRV630 EQU   CVTDMSRF                                                 03693000
CVTRV629 EQU   CVTDMSRF                                                 03694000
CVTUDUMP EQU   CVTDMSRF                                                 03695000
CVTSDUMP EQU   CVTDMSRF                                                 03696000
CVTQMSGA EQU   CVTQMSG+1                                                03697000
CVTRSV36 EQU   CVTQMSG                                                  03698000
CVTAMFF  EQU   CVTMAP+264                                               03699000
CVTPURGA EQU   CVTPURG+1                                                03700000
CVTRSV35 EQU   CVTPURG                                                  03701000
CVTATERA EQU   CVTATER+1                                                03702000
CVTSYST  EQU   CVTATER                                                  03703000
CVTVOLT2 EQU   CVTTAT                                                   03704000
CVTVOLI2 EQU   CVTVOLF2                                                 03705000
CVTAQAVB EQU   CVTAQAVT+1                                               03706000
CVTRSV34 EQU   CVTTCMFG                                                 03707000
CVTRSV33 EQU   CVTTCMFG                                                 03708000
CVTRSV32 EQU   CVTTCMFG                                                 03709000
CVTRSV31 EQU   CVTTCMFG                                                 03710000
CVTRSV30 EQU   CVTTCMFG                                                 03711000
CVTRSV29 EQU   CVTTCMFG                                                 03712000
CVTRSV28 EQU   CVTTCMFG                                                 03713000
CVTTCRDY EQU   CVTTCMFG                                                 03714000
CVTGTFA  EQU   CVTGTF+1                                                 03715000
CVTRSV27 EQU   CVTGTFST                                                 03716000
CVTRNIO  EQU   CVTGTFST                                                 03717000
CVTUSR   EQU   CVTGTFST                                                 03718000
CVTRV318 EQU   CVTFORM                                                  03719000
CVTRV317 EQU   CVTTMODE                                                 03720000
CVTRV316 EQU   CVTSTATE                                                 03721000
CVTRV315 EQU   CVTGTFS                                                  03722000
CVTGTFAV EQU   CVTGTFS                                                  03723000
CVT0SCR1 EQU   CVTMAP+232                                               03724000
CVTRV515 EQU   CVTMAP+228                                               03725000
CVTRMS   EQU   CVTMAP+224                                               03726000
CVTPATCH EQU   CVTMAP+220                                               03727000
CVTTSCE  EQU   CVTMAP+216                                               03728000
CVTLNKSC EQU   CVTMAP+214                                               03729000
CVTQABST EQU   CVTMAP+212                                               03730000
CVTMDLDS EQU   CVTMAP+208                                               03731000
CVTUSER  EQU   CVTMAP+204                                               03732000
CVTABEND EQU   CVTMAP+200                                               03733000
CVTSMCA  EQU   CVTMAP+196                                               03734000
CVTRSV18 EQU   CVTMAP+192                                               03735000
CVTQLPAQ EQU   CVTMAP+188                                               03736000
CVTQCDSR EQU   CVTMAP+184                                               03737000
CVTRSV17 EQU   CVTOPTB                                                  03738000
CVTRSV16 EQU   CVTOPTB                                                  03739000
CVTFP    EQU   CVTOPTB                                                  03740000
CVTAPTHR EQU   CVTOPTB                                                  03741000
CVTNLOG  EQU   CVTOPTB                                                  03742000
CVTTOD   EQU   CVTOPTB                                                  03743000
CVTCTIMS EQU   CVTOPTB                                                  03744000
CVTPROT  EQU   CVTOPTB                                                  03745000
CVTXPFP  EQU   CVTOPTA                                                  03746000
CVTASCII EQU   CVTOPTA                                                  03747000
CVTRSV13 EQU   CVTOPTA                                                  03748000
CVTRSV12 EQU   CVTOPTA                                                  03749000
CVTNIP   EQU   CVTOPTA                                                  03750000
CVTDDR   EQU   CVTOPTA                                                  03751000
CVTAPR   EQU   CVTOPTA                                                  03752000
CVTCCH   EQU   CVTOPTA                                                  03753000
CVTSNCTR EQU   CVTMAP+180                                               03754000
CVTQMWR  EQU   CVTMAP+176                                               03755000
CVTQOCR  EQU   CVTMAP+172                                               03756000
CVT1EF00 EQU   CVTMAP+168                                               03757000
CVTMZ00  EQU   CVTMAP+164                                               03758000
CVTHEAD  EQU   CVTMAP+160                                               03759000
CVTRSV11 EQU   CVTMAP+156                                               03760000
CVT0PT01 EQU   CVTMAP+152                                               03761000
CVTMSER  EQU   CVTMAP+148                                               03762000
CVTRV516 EQU   CVTIERLC                                                 03763000
CVTILCH  EQU   CVTMAP+140                                               03764000
CVT0DS   EQU   CVTMAP+136                                               03765000
CVTFBOSV EQU   CVTMAP+132                                               03766000
CVTNUCB  EQU   CVTMAP+128                                               03767000
CVTIXAVL EQU   CVTMAP+124                                               03768000
CVTIOQET EQU   CVTMAP+120                                               03769000
CVTDCBA  EQU   CVTMAP+117                                               03770000
CVTMVS2  EQU   CVTDCB                                                   03771000
CVT6DAT  EQU   CVTDCB                                                   03772000
CVT4MPS  EQU   CVTDCB                                                   03773000
CVTRSV09 EQU   CVTDCB                                                   03774000
CVT4MS1  EQU   CVTDCB                                                   03775000
CVT2SPS  EQU   CVTDCB                                                   03776000
CVT1SSS  EQU   CVTDCB                                                   03777000
CVTRSV08 EQU   CVTDCB                                                   03778000
CVTSTB   EQU   CVTMAP+112                                               03779000
CVTQTD00 EQU   CVTMAP+108                                               03780000
CVTQTE00 EQU   CVTMAP+104                                               03781000
CVTCUCB  EQU   CVTMAP+100                                               03782000
CVTSJQ   EQU   CVTMAP+96                                                03783000
CVTPBLDL EQU   CVTMAP+92                                                03784000
CVTTPC   EQU   CVTMAP+88                                                03785000
CVTSVDCB EQU   CVTMAP+84                                                03786000
CVTBRET  EQU   CVTMAP+82                                                03787000
CVTEXIT  EQU   CVTMAP+80                                                03788000
CVT0FN00 EQU   CVTMAP+76                                                03789000
CVTDARA  EQU   CVTDAR+1                                                 03790000
CVTRSV07 EQU   CVTFLGS1                                                 03791000
CVTRSV06 EQU   CVTFLGS1                                                 03792000
CVTRSV05 EQU   CVTFLGS1                                                 03793000
CVTRSV04 EQU   CVTFLGS1                                                 03794000
CVTRSV03 EQU   CVTFLGS1                                                 03795000
CVTRSV02 EQU   CVTFLGS1                                                 03796000
CVTRSV01 EQU   CVTFLGS1                                                 03797000
CVTDMPLK EQU   CVTFLGS1                                                 03798000
CVTXITP  EQU   CVTMAP+68                                                03799000
CVTZDTAB EQU   CVTMAP+64                                                03800000
CVTMSLT  EQU   CVTMAP+60                                                03801000
CVTDATE  EQU   CVTMAP+56                                                03802000
CVTBTERM EQU   CVTMAP+52                                                03803000
CVTSYSAD EQU   CVTMAP+48                                                03804000
CVTXTLER EQU   CVTMAP+44                                                03805000
CVTILK2  EQU   CVTMAP+40                                                03806000
CVTILK1  EQU   CVTMAP+36                                                03807000
CVTPRLTV EQU   CVTMAP+32                                                03808000
CVTPCNVT EQU   CVTMAP+28                                                03809000
CVT0VL00 EQU   CVTMAP+24                                                03810000
CVTXAPG  EQU   CVTMAP+20                                                03811000
CVTBUF   EQU   CVTMAP+16                                                03812000
CVTJOB   EQU   CVTMAP+12                                                03813000
CVTLINK  EQU   CVTMAP+8                                                 03814000
CVT0EF00 EQU   CVTMAP+4                                                 03815000
CVTTCBP  EQU   CVTMAP                                                   03816000
CVT      EQU   CVTMAP                                                   03817000
CBSVPTR  EQU   CBSVSRT+4                                                03818000
CBSVUSE  EQU   CBSVSRT                                                  03819000
CBSCRTCB EQU   AMCBS+28                                                 03820000
CBSCRACA EQU   AMCBS+24                                                 03821000
CBSCAXCN EQU   AMCBS+20                                                 03822000
CBSMCUCB EQU   CBSCMP                                                   03823000
CBSCBP   EQU   AMCBS+12                                                 03824000
CBSMCSTA EQU   AMCBS+4                                                  03825000
CBSSIZ   EQU   AMCBS+2                                                  03826000
CBSID    EQU   AMCBS                                                    03827000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03828000
@RC00387 EQU   @RC00385                                                 03829000
@RF00525 EQU   @RC00522                                                 03830000
@RF00531 EQU   @EL00010                                                 03831000
@RF00622 EQU   @EL00012                                                 03832000
@ENDDATA EQU   *                                                        03833000
         END   IEAVNP12,(C'PLS0232',0701,77018)                         03834000
