         TITLE 'IEAVEOR - VS2 ETM EXIT/EOT - SVC 3                     *00001000
                        '                                               00002000
IGC003   CSECT ,                                                01S0001 00003000
@PROLOG  DS    0H                                               01S0002 00004000
CVTPTR   EQU 16                                                         00005000
RBPRFXLN EQU 64                                                         00006000
RBPRFLNA EQU 32                                                         00007000
PRBLEN   EQU 136                                                        00008000
SIRBLEN  EQU 200                                                        00009000
TIRBLEN  EQU 136                                                        00010000
IRBLEN   EQU 128                                                        00011000
SVRBLEN  EQU 224                                                        00012000
         USING IGC003,R6CSECT                                           00013000
         MODID BR=YES                                                   00014000
*/* P  SAVE R15-R1 FROM ENTRY IN TCB RSA AND DO INITIALIZATION       */ 00015000
*                                                               01S0069 00016000
*   TCBGRS15=R15;                   /* SAVE R15                      */ 00017000
         ST    R15,TCBGRS15(,R4TCB)                             01S0069 00018000
*   TCBGRS0=R0;                     /* SAVE R0                       */ 00019000
         ST    R0,TCBGRS0(,R4TCB)                               01S0070 00020000
*   TCBGRS1=R1;                     /* SAVE R1                       */ 00021000
         ST    R1,TCBGRS1(,R4TCB)                               01S0071 00022000
*   TCBNONPR='0'B;                  /* SET TASK IN A PREEMPTIVE STATE   00023000
*                                      AGAIN                 @Z40FPYK*/ 00024000
         NI    TCBNONPR(R4TCB),B'11101111'                      01S0072 00025000
*   R8DSECT=WSALEXIT;               /* ADDRESS EXIT WORK/SAVE AREA   */ 00026000
         L     @12,ASCBASXB(,R7ASCB)                            01S0073 00027000
         L     @12,ASXBSPSA(,@12)                               01S0073 00028000
         L     R8DSECT,WSALEXIT(,@12)                           01S0073 00029000
*   GEN(USING @DATD,R8DSECT)                                    01S0074 00030000
*   REFS(R8DSECT);                  /* DATAREG(8)                    */ 00031000
         USING @DATD,R8DSECT                                            00032000
*   R14SAVE=CVTEXP1;                /* SAVE RETURN ADDRESS           */ 00033000
         L     @12,CVTEXP1(,R3CVT)                              01S0075 00034000
         ST    @12,R14SAVE                                      01S0075 00035000
*   R13AREA=ADDR(REGSAVE);          /* ADDRESS SUBROUTINE SAVEAREA   */ 00036000
         LA    R13AREA,REGSAVE                                  01S0076 00037000
*   RFY                                                         01S0077 00038000
*    (R14,                                                      01S0077 00039000
*     R15) UNRSTD;                  /* RELEASE ENTRY REGISTERS FOR      00040000
*                                      SUBROUTINE CALLS              */ 00041000
*   FLAGS=0;                        /* INITIALIZE WSA BITS           */ 00042000
         SLR   @12,@12                                          01S0078 00043000
         ST    @12,FLAGS                                        01S0078 00044000
*TESTREGS:                          /* TESTING LABEL                 */ 00045000
*                                                               01S0079 00046000
*   /*****************************************************************/ 00047000
*   /*                                                               */ 00048000
*   /* EXIT TERMINATES NOT ONLY RB'S BUT SPIE EXITS RUNNING UNDER    */ 00049000
*   /* RB'S AND MUST DISTINGUISH THE TWO CASES WITHOUT RECEIVING ANY */ 00050000
*   /* DATA FROM THE EXITING PROGRAM. TOWARD THIS END PFLIH INVOKES  */ 00051000
*   /* SPIE EXITS WITH R14 ADDRESSING AN SVC3 INSTRUCTION RESERVED   */ 00052000
*   /* FOR SPIE EXIT TERMINATION. IF A TASK WHICH HAS NOT ISSUED SPIE*/ 00053000
*   /* EXECUTES THAT SVC3 THEN EXIT TERMINATES THE CURRENT RB        */ 00054000
*   /* NORMALLY.                                                     */ 00055000
*   /*                                                               */ 00056000
*   /*****************************************************************/ 00057000
*                                                               01S0079 00058000
*/* D (YES,DOSPIE,NO,)  SVC3 FROM PCIH AND SPIE ISSUED               */ 00059000
*                                                               01S0079 00060000
*   IF PSWECIA                      /* IF INSTRUCTION ADDRESS FROM      00061000
*                                      SVC 3                         */ 00062000
*       =ADDR(IEAPSVC3)             /* EQUALS ADDRESS OF BYTE   01S0079 00063000
*                                      FOLLOWING PCIH SVC 3          */ 00064000
*       &TCBPIEA^=0                 /* AND TASK HAS ISSUED SPIE      */ 00065000
*       &SCAPIE^=0                  /* AND SPIE VALIDITY CHECK HAS      00066000
*                                      NOT FAILED                    */ 00067000
*       &PIEPICAA^=0 THEN           /* AND TASK HAS NOT CANCELLED       00068000
*                                      SPIE THEN                     */ 00069000
TESTREGS L     @12,@CA02028                                     01S0079 00070000
         C     @12,PSWECIA(,R5RB)                               01S0079 00071000
         BNE   @RF00079                                         01S0079 00072000
         L     @12,TCBPIEA-1(,R4TCB)                            01S0079 00073000
         LA    @12,0(,@12)                                      01S0079 00074000
         LTR   @12,@12                                          01S0079 00075000
         BZ    @RF00079                                         01S0079 00076000
         L     @12,TCBPIE(,R4TCB)                               01S0079 00077000
         L     @12,SCAPIE(,@12)                                 01S0079 00078000
         LTR   @12,@12                                          01S0079 00079000
         BZ    @RF00079                                         01S0079 00080000
         L     @12,PIEPICAA-1(,@12)                             01S0079 00081000
         LA    @12,0(,@12)                                      01S0079 00082000
         LTR   @12,@12                                          01S0079 00083000
         BNZ   @RT00079                                         01S0079 00084000
*     GO TO DOSPIE;                 /* GO TERMINATE SPIE EXIT        */ 00085000
*                                                               01S0081 00086000
*   /*****************************************************************/ 00087000
*   /*                                                               */ 00088000
*   /* AN RB MAY REQUEST BARRING FROM ITS TASK OF STATUS STOPS AND   */ 00089000
*   /* ATTENTION EXITS FOR THE DURATION OF THE EXISTENCE OF THAT RB. */ 00090000
*   /* EXIT UNBARS THE TASK UPON TERMINATION OF SUCH AN RB IF THE    */ 00091000
*   /* TASK HAS NO OTHER SUCH RB.                                    */ 00092000
*   /*                                                               */ 00093000
*   /*****************************************************************/ 00094000
*                                                               01S0081 00095000
*/* P  PERMIT STOP'S AND ATTN'S IF NO RB EXCEPT EXITOR BARS THEM     */ 00096000
*                                                               01S0081 00097000
*   IF RBATTN='1'B                  /* IF EXITING RB REQUESTS   01S0081 00098000
*                                      ATTN/STOP BARRING             */ 00099000
*       &RBTCBNXT='0'B THEN         /* AND HAS MOTHER RB THEN        */ 00100000
@RF00079 TM    RBATTN(R5RB),B'00100000'                         01S0081 00101000
         BNO   @RF00081                                         01S0081 00102000
         TM    RBTCBNXT(R5RB),B'10000000'                       01S0081 00103000
         BNZ   @RF00081                                         01S0081 00104000
*     DO;                           /* TRY TO UNBAR STOP'S AND ATTN'S   00105000
*                                      FROM TASK                     */ 00106000
*       R10WORK=RBLINKB;            /* ADDRESS RB FOR LOOP ON RB        00107000
*                                      CHAIN                         */ 00108000
         L     R10WORK,RBLINKB-1(,R5RB)                         01S0083 00109000
         LA    R10WORK,0(,R10WORK)                              01S0083 00110000
*       DO WHILE                    /* SCAN RB QUEUE FOR ANOTHER RB     00111000
*                                      REQUESTING BARRING WHILE      */ 00112000
*             (R10WORK->RBTCBNXT='0'B/* END OF RB QUEUE NOT REACHED  */ 00113000
*             &R10WORK->RBATTN='0'B);/* AND ANOTHER BARRING ANCESTOR    00114000
*                                      NOT FOUND                     */ 00115000
         B     @DE00084                                         01S0084 00116000
@DL00084 DS    0H                                               01S0085 00117000
*         R10WORK=R10WORK->RBLINKB; /* ADDRESS NEXT MOTHER RB        */ 00118000
         L     @12,RBLINKB-1(,R10WORK)                          01S0085 00119000
         LA    @12,0(,@12)                                      01S0085 00120000
         LR    R10WORK,@12                                      01S0085 00121000
*       END;                        /* LOOP TO TEST EXIT CONDITIONS  */ 00122000
@DE00084 TM    RBTCBNXT(R10WORK),B'10000000'                    01S0086 00123000
         BNZ   @DC00084                                         01S0086 00124000
         TM    RBATTN(R10WORK),B'00100000'                      01S0086 00125000
         BZ    @DL00084                                         01S0086 00126000
@DC00084 DS    0H                                               01S0087 00127000
*       IF R10WORK->RBATTN='0'B THEN/* IF NO BARRING RB FOUND THEN   */ 00128000
         TM    RBATTN(R10WORK),B'00100000'                      01S0087 00129000
         BNZ   @RF00087                                         01S0087 00130000
*         TCBATT='0'B;              /* UNBAR STOP/ATTN'S FROM TASK   */ 00131000
         NI    TCBATT(R4TCB),B'11011111'                        01S0088 00132000
*TESTBAR:                                                       01S0089 00133000
*       GEN(DS 0H);                 /* TESTING LABEL                 */ 00134000
@RF00087 DS    0H                                               01S0089 00135000
TESTBAR  DS 0H                                                          00136000
*     END;                          /* UNBARRING ATTEMPT COMPLETED   */ 00137000
*                                                               01S0091 00138000
*   /*****************************************************************/ 00139000
*   /*                                                               */ 00140000
*   /* MAKING STOP'S PERMISSABLE MAKES ANY DEFERRED STOP COMPLETABLE.*/ 00141000
*   /* EXIT NOTIFIES STATUS STOP SYNCH OF DEFERRED STOP COMPLETION.  */ 00142000
*   /*                                                               */ 00143000
*   /*****************************************************************/ 00144000
*                                                               01S0091 00145000
*/* P  COMPLETE STOP IF TASK HAS STOP PENDING AND DOESN'T BAR STOP'S */ 00146000
*                                                               01S0091 00147000
*   IF TCBSTPPR='1'B THEN                                       01S0091 00148000
@RF00081 TM    TCBSTPPR(R4TCB),B'01000000'                      01S0091 00149000
         BNO   @RF00091                                         01S0091 00150000
*     DO;                           /* IF TASK HAS STOP PENDING      */ 00151000
*       IF TCBATT='0'B THEN         /* AND TASK DOESN'T BAR STOPS       00152000
*                                      THEN                          */ 00153000
         TM    TCBATT(R4TCB),B'00100000'                        01S0093 00154000
         BNZ   @RF00093                                         01S0093 00155000
*         DO;                       /* COMPLETE STOP                 */ 00156000
*           TCBPNDSP='1'B;          /* SET TASK NONDISPATCHABLE      */ 00157000
         OI    TCBPNDSP(R4TCB),B'00000001'                      01S0095 00158000
*           TCBSTPP='1'B;           /* INDICATE NONDISPATCHABILITY      00159000
*                                      DUE TO STOP                   */ 00160000
         OI    TCBSTPP(R4TCB),B'01000000'                       01S0096 00161000
*           TCBSTPPR='0'B;          /* INDICATE TASK HAS NO STOP        00162000
*                                      PENDING                       */ 00163000
         NI    TCBSTPPR(R4TCB),B'10111111'                      01S0097 00164000
*STATUS1:                           /* TESTING LABEL                 */ 00165000
*           CALL IEAVESSS;          /* DECREMENT STATUS STOP    01S0098 00166000
*                                      SYNCH'ER'S WAIT COUNT         */ 00167000
STATUS1  L     @15,@CV02049                                     01S0098 00168000
         BALR  @14,@15                                          01S0098 00169000
*         END;                      /* STOP COMPLETED                */ 00170000
*       ELSE                                                    01S0100 00171000
*         DO;                       /* CHECK END OF TASK             */ 00172000
         B     @RC00093                                         01S0100 00173000
@RF00093 DS    0H                                               01S0101 00174000
*           IF TCBEOT='1'B          /* IF END OF TASK                */ 00175000
*               &RBTCBNXT='1'B THEN                             01S0101 00176000
         TM    TCBEOT(R4TCB),B'00000100'                        01S0101 00177000
         BNO   @RF00101                                         01S0101 00178000
         TM    RBTCBNXT(R5RB),B'10000000'                       01S0101 00179000
         BNO   @RF00101                                         01S0101 00180000
*             DO;                   /* AND LAST RB ON CHAIN          */ 00181000
*               CALL IEAVESSS;      /* GO TO STATUS FOR CLEAN UP     */ 00182000
         L     @15,@CV02049                                     01S0103 00183000
         BALR  @14,@15                                          01S0103 00184000
*             END;                  /* CLEAN UP COMPLETE             */ 00185000
*         END;                      /* END END OF TASK CHECK         */ 00186000
@RF00101 DS    0H                                               01S0106 00187000
*     END;                          /* STOP PENDING COMPLETE         */ 00188000
*                                                               01S0106 00189000
@RC00093 DS    0H                                               01S0107 00190000
*   /*****************************************************************/ 00191000
*   /*                                                               */ 00192000
*   /* A TASK BECOMES NONDISPATCHABLE WHEN THE MOTHER RB HAS         */ 00193000
*   /* OUTSTANDING WAIT'S OR EXIT HAS COMPLETED A STATUS STOP.       */ 00194000
*   /*                                                               */ 00195000
*   /*****************************************************************/ 00196000
*                                                               01S0107 00197000
*/* S CSPROC:  DECREMENT READY TCB COUNT ON WAIT OR STOP             */ 00198000
*                                                               01S0107 00199000
*   IF RBTCBNXT='0'B&               /* IF TASK NOT ENDED BUT         */ 00200000
*       (RBLINKB->RBWCF>0           /* EITHER MOTHER RB WAITING      */ 00201000
*       |TCBSTPP='1'B) THEN         /* OR TASK STOPPED BY EXIT THEN  */ 00202000
@RF00091 TM    RBTCBNXT(R5RB),B'10000000'                       01S0107 00203000
         BNZ   @RF00107                                         01S0107 00204000
         L     @12,RBLINKB-1(,R5RB)                             01S0107 00205000
         CLI   RBWCF(@12),0                                     01S0107 00206000
         BH    @RT00107                                         01S0107 00207000
         TM    TCBSTPP(R4TCB),B'01000000'                       01S0107 00208000
         BNO   @RF00107                                         01S0107 00209000
@RT00107 DS    0H                                               01S0108 00210000
*     CALL CSPROC;                  /* DECREMENT READY TASK COUNT    */ 00211000
         BAL   @14,CSPROC                                       01S0108 00212000
*                                                               01S0109 00213000
*   /*****************************************************************/ 00214000
*   /*                                                               */ 00215000
*   /* SVC 13 PERFORMS NORMAL TASK TERMINATION WHEN EXIT RECOGNIZES  */ 00216000
*   /* THE LAST RB AS EXITING FOR THE FIRST TIME. SVC 13 RUNS UNDER  */ 00217000
*   /* THE LAST RB AND SETS IT UP FOR SVC 3 WHICH TERMINATES IT AFTER*/ 00218000
*   /* SVC 13 HAS EXITED.                                            */ 00219000
*   /*                                                               */ 00220000
*   /*****************************************************************/ 00221000
*                                                               01S0109 00222000
*/* D (YES,DOSVC13,NO,)  LAST RB EXITING AND SVC 13 NOT EXECUTED     */ 00223000
*                                                               01S0109 00224000
*   IF RBTCBNXT='1'B                /* IF TCB HAS ONLY TERMINATING RB*/ 00225000
*       &TCBEOT='0'B THEN           /* AND TASK TERMINATION HAS NOT     00226000
*                                      EXECUTED THEN                 */ 00227000
@RF00107 TM    RBTCBNXT(R5RB),B'10000000'                       01S0109 00228000
         BNO   @RF00109                                         01S0109 00229000
         TM    TCBEOT(R4TCB),B'00000100'                        01S0109 00230000
         BZ    @RT00109                                         01S0109 00231000
*     GO TO DOSVC13;                /* BRANCH TO EXECUTE IT          */ 00232000
*                                                               01S0110 00233000
*   /*****************************************************************/ 00234000
*   /*                                                               */ 00235000
*   /* OTHERWISE EXIT TERMINATES THE EXITING RB.                     */ 00236000
*   /*                                                               */ 00237000
*   /*****************************************************************/ 00238000
*                                                               01S0111 00239000
*/* SVC3RB: L  TERMINATE RB -- CHART SVC3RB                          */ 00240000
*                                                               01S0111 00241000
*                                                               02S0111 00242000
*/* SVC3RB: CHART (AREF)                                             */ 00243000
*/* HEADER                                                      02S0111 00244000
*/* 3.1.7.9.17 - EXIT/EOT - SVC 3 - IEAVEOR                     02S0111 00245000
*/* SECOND OF TWO CHARTS - TERMINATION OF CONTROL LEVEL              */ 00246000
*/* E  RB TERMINATION -- FROM CHART SVC3                             */ 00247000
*                                                               02S0111 00248000
*   ;                                                           02S0111 00249000
*                                                               02S0111 00250000
@RF00109 DS    0H                                               02S0112 00251000
*   /*****************************************************************/ 00252000
*   /*                                                               */ 00253000
*   /* THE INNER HALF OF EXIT PERFORMS SIMPLE RB TERMINATION         */ 00254000
*   /* DEPENDING ON SUPERVISOR/PROGRAM/INTERRUPT/SYSTEM-INTERRUPT    */ 00255000
*   /* REQUEST BLOCK TYPE.                                           */ 00256000
*   /*                                                               */ 00257000
*   /*****************************************************************/ 00258000
*                                                               02S0112 00259000
*                                                               02S0112 00260000
*   /*****************************************************************/ 00261000
*   /*                                                               */ 00262000
*   /* EXIT DEQUEUES THE TERMINATING RB (UNLESS THIS WOULD LEAVE THE */ 00263000
*   /* TCB QUEUED BUT WITHOUT AN RB) MARKS THE RB INACTIVE AND THEN  */ 00264000
*   /* CALLS STAE CONTROL BLOCK PURGE IF THE RB HAS ISSUED STAE OR ON*/ 00265000
*   /* END OF TASK (IN WHICH CASE THE MOTHER TASK MAY HAVE ISSUED    */ 00266000
*   /* STAI).                                                        */ 00267000
*   /*                                                               */ 00268000
*   /*****************************************************************/ 00269000
*                                                               02S0112 00270000
*/* P  DEQUEUE RB UNLESS LAST RB UNDER TCB                           */ 00271000
*                                                               02S0112 00272000
*   IF RBTCBNXT='0'B THEN           /* IF RB HAS MOTHER RB THEN      */ 00273000
         TM    RBTCBNXT(R5RB),B'10000000'                       02S0112 00274000
         BNZ   @RF00112                                         02S0112 00275000
*     TCBRBP=RBLINKB;               /* POINT TCB AT MOTHER RB        */ 00276000
         L     @12,RBLINKB-1(,R5RB)                             02S0113 00277000
         LA    @12,0(,@12)                                      02S0113 00278000
         ST    @12,TCBRBP(,R4TCB)                               02S0113 00279000
*   ELSE                            /* IF RB IS LAST RB THEN @ZA09499*/ 00280000
*     NEXT='1'B;                    /* SET SWITCH TO INDICATE SO        00281000
*                                                            @ZA09499*/ 00282000
         B     @RC00112                                         02S0114 00283000
@RF00112 OI    NEXT,B'10000000'                                 02S0114 00284000
*TESTRB:                            /* TESTING LABEL                 */ 00285000
*/* S SCBPURGE:  CALL SCB PURGE IF STAE ISSUED OR END OF TASK        */ 00286000
*                                                               02S0115 00287000
*   IF RBSCB='1'B                   /* IF RB HAS ISSUED STAE         */ 00288000
*       |RBTCBNXT='1'B THEN         /* OR HAS NO MOTHER THEN         */ 00289000
@RC00112 DS    0H                                               02S0115 00290000
TESTRB   LR    @12,R5RB                                         02S0115 00291000
         AL    @12,@CF02210                                     02S0115 00292000
         TM    RBSCB-56(@12),B'00000010'                        02S0115 00293000
         BO    @RT00115                                         02S0115 00294000
         TM    RBTCBNXT(R5RB),B'10000000'                       02S0115 00295000
         BNO   @RF00115                                         02S0115 00296000
@RT00115 DS    0H                                               02S0116 00297000
*     DO;                           /* CALL SCB PURGE                */ 00298000
*       R0=ADDR(RBSECT);            /* PASS RB ADDRESS               */ 00299000
         LR    R0,R5RB                                          02S0117 00300000
*       R1=0;                       /* INDICATE EXIT NOT XCTL        */ 00301000
         SLR   R1,R1                                            02S0118 00302000
*SCB1:                              /* TESTING LABEL                 */ 00303000
*       CALL SCBPURGE;              /* INVOKE STAE RTRM              */ 00304000
SCB1     L     @15,CVTSCBP(,R3CVT)                              02S0119 00305000
         BALR  @14,@15                                          02S0119 00306000
*SCB2:                              /* TESTING LABEL                 */ 00307000
*     END;                          /* SCB'S PURGED                  */ 00308000
SCB2     DS    0H                                               02S0121 00309000
*                                                               02S0121 00310000
*   /*****************************************************************/ 00311000
*   /*                                                               */ 00312000
*   /* THE SVRB CONTAINS REGISTERS 2-14 FROM TIME OF SVC INSTRUCTION */ 00313000
*   /* EXECUTION AND REGISTERS 15-1 FROM TIME OF SVC ROUTINE RETURN. */ 00314000
*   /*                                                               */ 00315000
*   /*****************************************************************/ 00316000
*                                                               02S0121 00317000
*/* D (YES,,NO,%DOSVRB)  SVRB EXITING                                */ 00318000
*                                                               02S0121 00319000
*   IF RBFTP='110'B THEN            /* IF SVRB EXITING THEN          */ 00320000
@RF00115 TM    RBFTP(R5RB),B'11000000'                          02S0121 00321000
         BNO   @RF00121                                         02S0121 00322000
         TM    RBFTP(R5RB),B'00100000'                          02S0121 00323000
         BNZ   @RF00121                                         02S0121 00324000
*DOSVRB:                                                        02S0122 00325000
*     DO;                           /* TERMINATE SVRB                */ 00326000
DOSVRB   DS    0H                                               02S0123 00327000
*       R14SAVE=CVTEXPRO;           /* SET NORMAL EXIT PROLOGUE ENTRY*/ 00328000
         L     @12,CVTEXPRO(,R3CVT)                             02S0123 00329000
         ST    @12,R14SAVE                                      02S0123 00330000
*/* N  USUAL PATH -- SVRB TERMINATION                                */ 00331000
*/* P  MOVE R2-R14 FROM SVRB TO TCB (R15-R1 DONE AT EXIT ENTRY)      */ 00332000
*                                                               02S0124 00333000
*       ADDR(TCBGRS2)->WORDS13=ADDR(RBGRS2)->WORDS13;/* MOVE 13 02S0124 00334000
*                                      REGISTERS                     */ 00335000
         MVC   WORDS13+56(52,R4TCB),WORDS13+40(R5RB)            02S0124 00336000
*TESTREG1:                          /* TESTING LABEL                 */ 00337000
*                                                               02S0125 00338000
*       /*************************************************************/ 00339000
*       /*                                                           */ 00340000
*       /* THE SVRB STORAGE SHOULD HAVE BEEN ALLOCATED       @Z40FPYK*/ 00341000
*       /* BY THE SVC FIRST LEVEL INTERRUPT HANDLER.         @Z40FPYK*/ 00342000
*       /*                                                           */ 00343000
*       /*************************************************************/ 00344000
*                                                               02S0125 00345000
*/* S MSS:  FREE SP255 OR CELL SVRB IF DYNAMIC                       */ 00346000
*/* D (YES,,NO,DOPRB) CAN SVRB BE FREED ?                            */ 00347000
*                                                               02S0125 00348000
*       IF RBFDYN='1'B              /* IF SVRB FREEABLE              */ 00349000
*           &RBTCBNXT='0'B THEN     /* AND SVRB HAS MOTHER RB THEN   */ 00350000
TESTREG1 TM    RBFDYN(R5RB),B'00000010'                         02S0125 00351000
         BNO   @RF00125                                         02S0125 00352000
         TM    RBTCBNXT(R5RB),B'10000000'                       02S0125 00353000
         BNZ   @RF00125                                         02S0125 00354000
*         DO;                       /* RETURN SVRB TO THE COMMON        00355000
*                                      MEMORY SVRB POOL      @Z40FPYK*/ 00356000
*/* D (YES,,NO,PGMGR) VALID SVRB ?                                   */ 00357000
*                                                               02S0127 00358000
*           RFY                                                 02S0127 00359000
*             MBCB BASED(MBCBPTR);                              02S0127 00360000
*           MBCBPTR=R5RB-LENGTH(MBCBMAIN)-ADDR(RBPRFLNA);/* START OF    00361000
*                                      THE SVRB BUFFER POOL  @Z40FPYK*/ 00362000
         LR    @12,R5RB                                         02S0128 00363000
         SL    @12,@CF00061                                     02S0128 00364000
         LA    @11,RBPRFLNA                                     02S0128 00365000
         SLR   @12,@11                                          02S0128 00366000
         ST    @12,MBCBPTR                                      02S0128 00367000
*/* P SET UP TO RETURN SVRB TO POOL                                  */ 00368000
*                                                               02S0129 00369000
*           IF RBNOCELL='1'B THEN                               02S0129 00370000
         TM    RBNOCELL(R5RB),B'10000000'                       02S0129 00371000
         BO    @RT00129                                         02S0129 00372000
*             GO TO PGMGR;          /*                        @M41810*/ 00373000
*           IF MBCBID=CHARSVRB THEN                             02S0131 00374000
         CLC   MBCBID(4,@12),CHARSVRB                           02S0131 00375000
         BNE   @RF00131                                         02S0131 00376000
*             DO;                   /* DETERMINE IF THIS IS A VALID     00377000
*                                      SVRB THAT IS BEING RETURNED TO   00378000
*                                      THE SVRB POOL. THIS IS   02S0132 00379000
*                                      DETERMINED BY A VERIFICATION     00380000
*                                      OF WHETHER THE MBCB IDENTIFIER   00381000
*                                      IS 'SVRB'. IF YES THEN THIS IS   00382000
*                                      INDEED AN SVRB WHICH BELONGS     00383000
*                                      TO THE COMMON SVRB MEMORY        00384000
*                                      POOL.                 @Z40FPYK*/ 00385000
*               R0=ASCBSVRB;        /* SET UP TO RETURN THE SVRB TO     00386000
*                                      THE COMMON MEMORY POOL   02S0133 00387000
*                                                            @Z40FPYK*/ 00388000
         L     R0,ASCBSVRB(,R7ASCB)                             02S0133 00389000
*               R1=ASCBSYNC;        /* SYNCHRONIZATION COUNTER TO       00390000
*                                      CONTROL MULTIPLE ACCESSES TO     00391000
*                                      THE ASCB SVRB POOL    @Z40FPYK*/ 00392000
         L     R1,ASCBSYNC(,R7ASCB)                             02S0134 00393000
*/*FREESVRB: P SET UP SVRB LINK FIELD FOR POOL                       */ 00394000
*                                                               02S0135 00395000
*FREESVRB:                                                      02S0135 00396000
*               MBCBLINK=ASCBSVRB;  /* UPDATE CURRENT LINK FIELD IN     00397000
*                                      THE SVRB BEING FREED. @Z40FPYK*/ 00398000
FREESVRB L     @12,ASCBSVRB(,R7ASCB)                            02S0135 00399000
         L     @11,MBCBPTR                                      02S0135 00400000
         ST    @12,MBCBLINK(,@11)                               02S0135 00401000
*/* P INCREMENT SYNCHRONOUS COUNTER                                  */ 00402000
*                                                               02S0136 00403000
*               RFY                                             02S0136 00404000
*                (R14,                                          02S0136 00405000
*                 R15) RSTD;        /* RESTRICT REGISTERS 14 AND 15     00406000
*                                                            @Z40FPYK*/ 00407000
*               R15=R1+1;           /* INCREMENT SYNCHRONOUS COUNT IN   00408000
*                                      ASCB                  @Z40FPYK*/ 00409000
         LA    R15,1                                            02S0137 00410000
         ALR   R15,R1                                           02S0137 00411000
*/* P SVRB BEING RETURNED TO POOL                                    */ 00412000
*                                                               02S0138 00413000
*               R14=MBCBPTR;        /* SVRB WHICH IS BEING RETURNED     00414000
*                                      TO POOL               @Z40FPYK*/ 00415000
         L     R14,MBCBPTR                                      02S0138 00416000
*/* P RETURN SVRB TO POOL                                            */ 00417000
*                                                               02S0139 00418000
*               CDS(R0,R14,ASCBSUPC);/* RETURN SVRB TO COMMON MEMORY    00419000
*                                      POOL                  @Z40FPYK*/ 00420000
         CDS   R0,R14,ASCBSUPC(R7ASCB)                          02S0139 00421000
*/* D (YES,FREESVRB,NO,) SVRB RETURNED ?                             */ 00422000
*                                                               02S0140 00423000
*               BC(7,FREESVRB);     /* WAS SVRB RETURNED TO POOL ?      00424000
*                                      NO--                  @Z40FPYK*/ 00425000
         BC    7,FREESVRB                                       02S0140 00426000
*/* P (,DOSVRB) SVRB RETURNED SUCCESSFULLY                           */ 00427000
*                                                               02S0141 00428000
*             END;                  /* YES, WE HAVE FINISHED @Z40FPYK*/ 00429000
*           ELSE                                                02S0142 00430000
*             DO;                   /* DETERMINE IF INVALID SVRB OR     00431000
*                                      PROGRAM MGR SVRB      @Z40FPYK*/ 00432000
         B     @RC00131                                         02S0142 00433000
@RF00131 DS    0H                                               02S0143 00434000
*/*PGMGR: D (YES,,NO,%ABEND) PROGRAM MGR SVRB ?                      */ 00435000
*                                                               02S0143 00436000
*PGMGR:                                                         02S0143 00437000
*               IF RBNOCELL='1'B THEN                           02S0143 00438000
PGMGR    TM    RBNOCELL(R5RB),B'10000000'                       02S0143 00439000
         BNO   @RF00143                                         02S0143 00440000
*                 DO;               /* PROGRAM MANAGER SVRB OR  02S0144 00441000
*                                      REQUEST TO FREE SVRB  @ZM41810*/ 00442000
*/* P SET UP TO FREEMAIN RB                                          */ 00443000
*                                                               02S0145 00444000
*                   R1=ADDR(RBPRFXST);/* POINT TO PREFIX WHICH MUST     00445000
*                                      BE FREED              @Z40FPYK*/ 00446000
         LR    R1,R5RB                                          02S0145 00447000
         AL    R1,@CF02211                                      02S0145 00448000
*                   R0=RBSIZE*8;    /* SIZE OF RB TO BE FREED   02S0146 00449000
*                                                            @Z40FPYK*/ 00450000
         LH    R0,RBSIZE(,R5RB)                                 02S0146 00451000
         SLA   R0,3                                             02S0146 00452000
*                   R10WORK=R3CVT;  /* SAVE REGISTER CLOBBERED BY       00453000
*                                      FREEMAIN              @Z40FPYK*/ 00454000
         LR    R10WORK,R3CVT                                    02S0147 00455000
*/* S (,DOPRB) FREEMAIN:GO FREE THE SVRB                             */ 00456000
*                                                               02S0148 00457000
*                   GEN(FREEMAIN RC,LV=(0),A=(1),SP=255,BRANCH=YES)     00458000
*                   REFS(R13AREA,R0,R1) SETS(R14,R15,R3CVT);/*  02S0148 00459000
*                                      FREEMAIN SVRB FROM SUBPOOL 255   00460000
*                                                            @Z40FPYK*/ 00461000
         FREEMAIN RC,LV=(0),A=(1),SP=255,BRANCH=YES                     00462000
*                   R3CVT=R10WORK;  /* RESTORE REGISTER CLOBBERED BY    00463000
*                                      FREEMAIN              @Z40FPYK*/ 00464000
         LR    R3CVT,R10WORK                                    02S0149 00465000
*                 END;                                          02S0150 00466000
*               ELSE                                            02S0151 00467000
*                 DO;                                           02S0151 00468000
*                                                               02S0151 00469000
         B     @RC00143                                         02S0151 00470000
@RF00143 DS    0H                                               02S0152 00471000
*/*%ABEND: P SET UP ABEND CONDITION = 4                              */ 00472000
*                                                               02S0152 00473000
*                   R15=ABENDCND;   /* ABEND CONDITION CODE = 4 02S0152 00474000
*                                                            @Z40FPYK*/ 00475000
         LA    R15,4                                            02S0152 00476000
*/* R X'0F9' ABEND                                                   */ 00477000
*                                                               02S0153 00478000
*                   GEN SETS(R0,R1) EXIT(ABEND X'0F9',DUMP,,SYSTEM);    00479000
         ABEND X'0F9',DUMP,,SYSTEM                                      00480000
*                                   /* ABEND CALLER WITH A X'0F9' R15   00481000
*                                      = 4 ABEND CODE        @Z40FPYK*/ 00482000
*                   RFY                                         02S0154 00483000
*                    (R14,                                      02S0154 00484000
*                     R15) UNRSTD;  /* UNRESTRICT REGS 14 AND 15        00485000
*                                                            @Z40FPYK*/ 00486000
*                 END;              /* END OF ABEND INVALID SVRB        00487000
*                                      FUNCTION              @Z40FPYK*/ 00488000
*             END;                  /* END OF FREE VALID SVRB   02S0156 00489000
*                                      FUNCTION              @Z40FPYK*/ 00490000
*         END;                      /* END OF ALL SVRB FUNCTIONS        00491000
*                                                            @Z40FPYK*/ 00492000
*/* P MARK SVRB INACTIVE IF NOT DYNAMIC                              */ 00493000
*                                                               02S0158 00494000
*       ELSE                        /* IF SVRB NOT FREEABLE  @ZA09499*/ 00495000
*         RBFACTV='0'B;             /* INDICATE SVRB COMPLETE   02S0158 00496000
*                                                            @ZA09499*/ 00497000
         B     @RC00125                                         02S0158 00498000
@RF00125 NI    RBFACTV(R5RB),B'10111111'                        02S0158 00499000
*     END;                          /* END OF TERMINATE SVRB    02S0159 00500000
*                                      FUNCTIONS             @Z40FPYK*/ 00501000
*                                                               02S0160 00502000
*   /*****************************************************************/ 00503000
*   /*                                                               */ 00504000
*   /* EXIT TERMINATES A PROGRAM REQUEST BY FREEING PROGRAM AND      */ 00505000
*   /* REQUEST BLOCKS.                                               */ 00506000
*   /*                                                               */ 00507000
*   /*****************************************************************/ 00508000
*                                                               02S0160 00509000
*/*DOPRB:    D (YES,,NO,%DOPRB)  PRB EXITING ?                       */ 00510000
*                                                               02S0160 00511000
*   ELSE                                                        02S0160 00512000
*     IF RBFTP='000'B THEN          /* OTHERWISE IF PRB EXITING THEN */ 00513000
         B     @RC00121                                         02S0160 00514000
@RF00121 TM    RBFTP(R5RB),B'11100000'                          02S0160 00515000
         BNZ   @RF00160                                         02S0160 00516000
*DOPRB:                                                         02S0161 00517000
*       DO;                         /* TERMINATE PRB                 */ 00518000
DOPRB    DS    0H                                               02S0162 00519000
*/* P RESTORE REGS 2-14 OF SYNCH PRB                                 */ 00520000
*                                                               02S0162 00521000
*         IF RBCDSYNC='1'B&         /* RESTORE REGS 2-14 OF SYNCH    */ 00522000
*             RBCDSAVE='1'B THEN    /* USER IF REQUIRED              */ 00523000
         TM    RBCDSYNC(R5RB),B'00010100'                       02S0162 00524000
         BNO   @RF00162                                         02S0162 00525000
*           DO;                                                 02S0163 00526000
*             ADDR(TCBGRS2)->WORDS13=ADDR(RBGRS2)->WORDS13;     02S0164 00527000
         MVC   WORDS13+56(52,R4TCB),WORDS13+40(R5RB)            02S0164 00528000
*           END;                                                02S0165 00529000
*                                                               02S0165 00530000
*/* S CDEXIT:  FREE PROGRAMS                                         */ 00531000
*                                                               02S0166 00532000
*CDEXIT1:                           /* TESTING LABEL                 */ 00533000
*         CALL IEAPPGMX;            /* CALL PROGRAM MANAGEMENT RTRM  */ 00534000
@RF00162 DS    0H                                               02S0166 00535000
CDEXIT1  L     @15,@CV02075                                     02S0166 00536000
         BALR  @14,@15                                          02S0166 00537000
*CDEXIT2:                           /* TESTING LABEL                 */ 00538000
*/* S MSS:  FREE SP255 PRB IF DYNAMIC                                */ 00539000
*                                                               02S0167 00540000
*         IF RBFDYN='1'B            /* IF PRB DYNAMIC                */ 00541000
*             &RBTCBNXT='0'B THEN   /* AND PRB HAS MOTHER RB THEN       00542000
*                                                            @YM01975*/ 00543000
CDEXIT2  TM    RBFDYN(R5RB),B'00000010'                         02S0167 00544000
         BNO   @RF00167                                         02S0167 00545000
         TM    RBTCBNXT(R5RB),B'10000000'                       02S0167 00546000
         BNZ   @RF00167                                         02S0167 00547000
*           DO;                     /* FREEMAIN RB                   */ 00548000
*             R0=RBSIZE*8;          /* PASS RB BYTE SIZE INCLUDING      00549000
*                                      THAT OF PARTIAL PREFIX        */ 00550000
         LH    R0,RBSIZE(,R5RB)                                 02S0169 00551000
         SLA   R0,3                                             02S0169 00552000
*             R1=ADDR(RBPRFXST);    /* PASS ADDRESS OF GOTTEN PARTIAL   00553000
*                                      PREFIX                        */ 00554000
         LR    R1,R5RB                                          02S0170 00555000
         AL    R1,@CF02211                                      02S0170 00556000
*             R10WORK=R3CVT;        /* SAVE REGISTER CLOBBERED BY       00557000
*                                      FREEMAIN                      */ 00558000
         LR    R10WORK,R3CVT                                    02S0171 00559000
*MAINP1:                            /* TESTING LABEL                 */ 00560000
*             GEN(FREEMAIN RC,LV=(0),A=(1),SP=255,BRANCH=YES)   02S0172 00561000
*             REFS(R13AREA,R0,R1) SETS(R14,R15,R3CVT);/* FREEMAIN RB    00562000
*                                      FROM SUBPOOL 255              */ 00563000
MAINP1   FREEMAIN RC,LV=(0),A=(1),SP=255,BRANCH=YES                     00564000
*MAINP2:                            /* TESTING LABEL                 */ 00565000
*             R3CVT=R10WORK;        /* RESTORE REGISTER CLOBBERED BY    00566000
*                                      FREEMAIN                      */ 00567000
MAINP2   LR    R3CVT,R10WORK                                    02S0173 00568000
*           END;                    /* RB STORAGE FREED IF DYNAMIC   */ 00569000
*/* P MARK PRB INACTIVE IF NOT DYNAMIC                               */ 00570000
*                                                               02S0175 00571000
*         ELSE                      /* IF PRB WAS NOT FREED  @ZA09499*/ 00572000
*           RBFACTV='0'B;           /* INDICATE PRB COMPLETE @ZA09499*/ 00573000
         B     @RC00167                                         02S0175 00574000
@RF00167 NI    RBFACTV(R5RB),B'10111111'                        02S0175 00575000
*/* N (,%DORB)  PRB TERMINATED                                       */ 00576000
*                                                               02S0176 00577000
*TESTPRB:                                                       02S0176 00578000
*         GEN(DS 0H);               /* TESTING LABEL                 */ 00579000
@RC00167 DS    0H                                               02S0176 00580000
TESTPRB  DS 0H                                                          00581000
*       END DOPRB;                  /* PRB TERMINATED                */ 00582000
*                                                               02S0178 00583000
*   /*****************************************************************/ 00584000
*   /*                                                               */ 00585000
*   /* ATTENTION EXIT EPILOG PERFORMS SPECIAL PROCESSING FOR         */ 00586000
*   /* ATTENTION IRB TERMINATION. IRB CONTAINS REGISTERS FROM TASK   */ 00587000
*   /* INTERRUPTED AT TIME OF IRB SCHEDULING BY STAGE 3 EXIT         */ 00588000
*   /* EFFECTOR.                                                     */ 00589000
*   /*                                                               */ 00590000
*   /*****************************************************************/ 00591000
*                                                               02S0178 00592000
*/* %DOPRB: D (YES,,NO,%DOIRB)  IRB EXITING                          */ 00593000
*                                                               02S0178 00594000
*     ELSE                                                      02S0178 00595000
*       IF RBFTP='010'B THEN        /* OTHERWISE IF IRB EXITING THEN */ 00596000
         B     @RC00160                                         02S0178 00597000
@RF00160 TM    RBFTP(R5RB),B'01000000'                          02S0178 00598000
         BNO   @RF00178                                         02S0178 00599000
         TM    RBFTP(R5RB),B'10100000'                          02S0178 00600000
         BNZ   @RF00178                                         02S0178 00601000
*DOIRB:                                                         02S0179 00602000
*         DO;                       /* TERMINATE IRB                 */ 00603000
DOIRB    DS    0H                                               02S0180 00604000
*/* S ATTNEPLG:  CALL ATTENTION EXIT EPILOG IF ATTN IRB              */ 00605000
*                                                               02S0180 00606000
*           IF RBATNXIT='1'B THEN   /* IF ATTN EXIT IRB THEN         */ 00607000
         TM    RBATNXIT(R5RB),B'00000010'                       02S0180 00608000
         BNO   @RF00180                                         02S0180 00609000
*ATTN1:                             /* TESTING LABEL                 */ 00610000
*             CALL ATTNEPLG;        /* CALL ATTN EXIT RTRM           */ 00611000
ATTN1    L     @15,CVTSTXU(,R3CVT)                              02S0181 00612000
         BALR  @14,@15                                          02S0181 00613000
*ATTN2:                             /* TESTING LABEL                 */ 00614000
*/* P  MOVE R0-R15 FROM IRB TO TCB                                   */ 00615000
*                                                               02S0182 00616000
*           TCBGRS=RBGRSAVE;        /* MOVE 16 REGISTERS             */ 00617000
@RF00180 DS    0H                                               02S0182 00618000
ATTN2    MVC   TCBGRS(64,R4TCB),RBGRSAVE(R5RB)                  02S0182 00619000
*TESTREG2:                          /* TESTING LABEL                 */ 00620000
*                                                               02S0183 00621000
*           /*********************************************************/ 00622000
*           /*                                                       */ 00623000
*           /* EITHER AN IQE OR AN RQE MAY HAVE SCHEDULED AN IRB.    */ 00624000
*           /*                                                       */ 00625000
*           /*********************************************************/ 00626000
*                                                               02S0183 00627000
*                                                               02S0183 00628000
*           /*********************************************************/ 00629000
*           /*                                                       */ 00630000
*           /* TO TERMINATE AN RQE EXIT RETURNS IT TO IOS.           */ 00631000
*           /*                                                       */ 00632000
*           /*********************************************************/ 00633000
*                                                               02S0183 00634000
*/* D (YES,,NO,%DORQE)  QUEUE ELEMENT RQE                            */ 00635000
*/* S (,%DOQE) IOS:  RETURN RQE IF NOT NULL BUT RETURNABLE           */ 00636000
*                                                               02S0183 00637000
*           IF RBIQE1^=0            /* IF QE NOT NULL                */ 00638000
*               &RBIQETP='01'B THEN /* AND QE RETURNABLE RQE THEN    */ 00639000
TESTREG2 L     @12,RBIQE1-1(,R5RB)                              02S0183 00640000
         LA    @12,0(,@12)                                      02S0183 00641000
         LTR   @12,@12                                          02S0183 00642000
         BZ    @RF00183                                         02S0183 00643000
         TM    RBIQETP(R5RB),B'00000100'                        02S0183 00644000
         BNO   @RF00183                                         02S0183 00645000
         TM    RBIQETP(R5RB),B'00001000'                        02S0183 00646000
         BNZ   @RF00183                                         02S0183 00647000
*DORQE:                                                         02S0184 00648000
*             DO;                   /* RETURN RQE TO IOS             */ 00649000
DORQE    DS    0H                                               02S0185 00650000
*               R1=ADDR(IQESECT);   /* PASS RQE ADDRESS              */ 00651000
         L     R1,RBIQE1-1(,R5RB)                               02S0185 00652000
         LA    R1,0(,R1)                                        02S0185 00653000
*IOS1:                              /* TESTING LABEL                 */ 00654000
*               CALL IECVX025;      /* CALL IOS                      */ 00655000
IOS1     L     @15,@CV02098                                     02S0186 00656000
         BALR  @14,@15                                          02S0186 00657000
*IOS2:                              /* TESTING LABEL                 */ 00658000
*               RBIQE1=0;           /* INDICATE RQE TERMINATED       */ 00659000
IOS2     SLR   @12,@12                                          02S0187 00660000
         STCM  @12,7,RBIQE1(R5RB)                               02S0187 00661000
*TESTRQE:                                                       02S0188 00662000
*               GEN(DS 0H);         /* TESTING LABEL                 */ 00663000
TESTRQE  DS 0H                                                          00664000
*             END DORQE;            /* RQE TERMINATED                */ 00665000
*                                                               02S0190 00666000
*           /*********************************************************/ 00667000
*           /*                                                       */ 00668000
*           /* EXIT TERMINATES RETURNABLE AND ETXR IQE'S.            */ 00669000
*           /*                                                       */ 00670000
*           /*********************************************************/ 00671000
*                                                               02S0190 00672000
*/* %DORQE: D (YES,,NO,%DOQE)  IQE RETURNABLE OR ETXR                */ 00673000
*                                                               02S0190 00674000
*           ELSE                                                02S0190 00675000
*             IF RBIQETP='11'B      /* IF QE RETURNABLE IQE          */ 00676000
*                 |RBETXR='1'B THEN /* OR IRB ETXR THEN              */ 00677000
         B     @RC00183                                         02S0190 00678000
@RF00183 TM    RBIQETP(R5RB),B'00001100'                        02S0190 00679000
         BO    @RT00190                                         02S0190 00680000
         TM    RBETXR(R5RB),B'00010000'                         02S0190 00681000
         BNO   @RF00190                                         02S0190 00682000
@RT00190 DS    0H                                               02S0191 00683000
*DOIQE:                                                         02S0191 00684000
*               DO;                 /* TERMINATE IQE                 */ 00685000
*                                                               02S0191 00686000
DOIQE    DS    0H                                               02S0192 00687000
*                 /***************************************************/ 00688000
*                 /*                                                 */ 00689000
*                 /* AN ETXR IRB CONTAINS A COUNT OF THE NUMBER OF   */ 00690000
*                 /* DAUGHTER TASKS ON BEHALF OF WHICH IT WILL RUN. A*/ 00691000
*                 /* NON-ETXR IRB SHOULD CONTAIN A ZERO COUNT. EXIT  */ 00692000
*                 /* PERFORMS FINAL TERMINATION OF AN IRB WHEN IT    */ 00693000
*                 /* CONTAINS A ZERO COUNT.                          */ 00694000
*                 /*                                                 */ 00695000
*                 /***************************************************/ 00696000
*                                                               02S0192 00697000
*/* P  DECREMENT RB USE COUNT IF NONZERO                             */ 00698000
*                                                               02S0192 00699000
*                 IF RBUSE>0 THEN   /* IF ETXR IRB THEN              */ 00700000
         CLI   RBUSE(R5RB),0                                    02S0192 00701000
         BNH   @RF00192                                         02S0192 00702000
*TESTUSE:                           /* TESTING LABEL                 */ 00703000
*                   RBUSE=RBUSE-1;  /* DECREMENT NUMBER OF      02S0193 00704000
*                                      UNTERMINATED ETXR EXECUTIONS  */ 00705000
TESTUSE  SLR   @12,@12                                          02S0193 00706000
         IC    @12,RBUSE(,R5RB)                                 02S0193 00707000
         BCTR  @12,0                                            02S0193 00708000
         STC   @12,RBUSE(,R5RB)                                 02S0193 00709000
*                                                               02S0194 00710000
*                 /***************************************************/ 00711000
*                 /*                                                 */ 00712000
*                 /* EXIT TERMINATES AN IQE IF IT CONTAINS A WORK    */ 00713000
*                 /* AREA XOR SCHEDULES AN END-OF-TASK EXIT ROUTINE. */ 00714000
*                 /*                                                 */ 00715000
*                 /***************************************************/ 00716000
*                                                               02S0194 00717000
*/* D (YES,,NO,%DOWA)  IRB HAS WORK AREA                             */ 00718000
*                                                               02S0194 00719000
*                 IF RBSIZE*8>ADDR(RBIQEWRK)-ADDR(RBPRFXST) THEN/* IF   00720000
*                                      IRB CONTAINS WORKAREA THEN    */ 00721000
@RF00192 LH    @12,RBSIZE(,R5RB)                                02S0194 00722000
         SLA   @12,3                                            02S0194 00723000
         LA    @11,RBIQEWRK(,R5RB)                              02S0194 00724000
         LR    @02,R5RB                                         02S0194 00725000
         AL    @02,@CF02211                                     02S0194 00726000
         SLR   @11,@02                                          02S0194 00727000
         CR    @12,@11                                          02S0194 00728000
         BNH   @RF00194                                         02S0194 00729000
*DOWA:                                                          02S0195 00730000
*                   DO;             /* RETURN IQE TO NEXT-AVAILABLE     00731000
*                                      QUEUE                         */ 00732000
DOWA     DS    0H                                               02S0196 00733000
*                     IQELNKA=RBNEXAV;/* PLACE OLD NEXT-AVAILABLE       00734000
*                                      QUEUE ON IQE                  */ 00735000
         L     @12,RBIQE1-1(,R5RB)                              02S0196 00736000
         LA    @12,0(,@12)                                      02S0196 00737000
         MVC   IQELNKA(3,@12),RBNEXAV+1(R5RB)                   02S0196 00738000
*                     RBNEXAV=RBIQE1;/* PLACE NEW NEXT-AVAILABLE        00739000
*                                      QUEUE ON IRB                  */ 00740000
         ST    @12,RBNEXAV(,R5RB)                               02S0197 00741000
*                     RBIQE1=0;     /* INDICATE IQE TERMINATED       */ 00742000
         SLR   @12,@12                                          02S0198 00743000
         STCM  @12,7,RBIQE1(R5RB)                               02S0198 00744000
*TESTNAQ:                                                       02S0199 00745000
*                     GEN(DS 0H);   /* TESTING LABEL                 */ 00746000
TESTNAQ  DS 0H                                                          00747000
*/* P (,%DOQE)  RETURN IQE TO NEXT-AVAILABLE QUEUE                   */ 00748000
*                                                               02S0200 00749000
*                   END DOWA;       /* IQE RETURNED TO NAQ           */ 00750000
*/* %DOWA: D (YES,,NO,%DOQE)  IRB FOR EOT EXIT ROUTINE               */ 00751000
*                                                               02S0201 00752000
*                 ELSE              /* OTHERWISE NO WA SO            */ 00753000
*                   IF RBETXR='1'B THEN/* IF ETXR IRB THEN           */ 00754000
         B     @RC00194                                         02S0201 00755000
@RF00194 TM    RBETXR(R5RB),B'00010000'                         02S0201 00756000
         BNO   @RF00201                                         02S0201 00757000
*DOETXR:                                                        02S0202 00758000
*                     DO;           /* FREEMAIN IQE                  */ 00759000
DOETXR   DS    0H                                               02S0203 00760000
*                       R0=LENGTH(IQESECT);/* PASS LENGTH OF IQE     */ 00761000
         LA    R0,24                                            02S0203 00762000
*                       R1=ADDR(IQESECT);/* PASS IQE ADDRESS         */ 00763000
         L     R1,RBIQE1-1(,R5RB)                               02S0204 00764000
         LA    R1,0(,R1)                                        02S0204 00765000
*MAINIQE1:                          /* TESTING LABEL                 */ 00766000
*                       GEN(FREEMAIN RC,LV=(0),A=(1),SP=253,BRANCH=YES) 00767000
*                       REFS(CVTCRMN);/* FREEMAIN IQE                */ 00768000
MAINIQE1 FREEMAIN RC,LV=(0),A=(1),SP=253,BRANCH=YES                     00769000
*MAINIQE2:                          /* TESTING LABEL                 */ 00770000
*                       RBIQE1=0;   /* INDICATE IQE TERMINATED       */ 00771000
MAINIQE2 SLR   @12,@12                                          02S0206 00772000
         STCM  @12,7,RBIQE1(R5RB)                               02S0206 00773000
*TESTETXR:                                                      02S0207 00774000
*                       GEN(DS 0H); /* TESTING LABEL                 */ 00775000
TESTETXR DS 0H                                                          00776000
*/* S (,%DOQE) MSS:  FREE SP253 IQE                                  */ 00777000
*                                                               02S0208 00778000
*                     END DOETXR;   /* IQE FREEMAINED                */ 00779000
*TESTIQE:                           /* TESTING LABEL                 */ 00780000
*               END DOIQE;          /* IQE TERMINATED                */ 00781000
@RF00201 DS    0H                                               02S0209 00782000
@RC00194 DS    0H                                               02S0209 00783000
TESTIQE  DS    0H                                               02S0210 00784000
*                                                               02S0210 00785000
*           /*********************************************************/ 00786000
*           /*                                                       */ 00787000
*           /* AN IRB MAY ADDRESS A PROBLEM-PROGRAM SAVE-AREA        */ 00788000
*           /* RESIDING IN SUBPOOL 250 (0).                          */ 00789000
*           /*                                                       */ 00790000
*           /*********************************************************/ 00791000
*                                                               02S0210 00792000
*/* %DOQE: S MSS:  FREE SP250 PPSA IF PRESENT AND IRB ENDING         */ 00793000
*                                                               02S0210 00794000
*           IF RBPPSAV1>0           /* IF IRB HAS PROBLEM PROGRAM       00795000
*                                      SAVEAREA                      */ 00796000
*               &RBFDYN='1'B        /* AND IRB/PPSA STORAGE FREEABLE */ 00797000
*               &RBUSE=0 THEN       /* AND RB USE COUNT ZERO THEN    */ 00798000
@RF00190 DS    0H                                               02S0210 00799000
@RC00183 L     @12,RBPPSAV1-1(,R5RB)                            02S0210 00800000
         LA    @12,0(,@12)                                      02S0210 00801000
         LTR   @12,@12                                          02S0210 00802000
         BNP   @RF00210                                         02S0210 00803000
         TM    RBFDYN(R5RB),B'00000010'                         02S0210 00804000
         BNO   @RF00210                                         02S0210 00805000
         CLI   RBUSE(R5RB),0                                    02S0210 00806000
         BNE   @RF00210                                         02S0210 00807000
*             DO;                   /* FREEMAIN PPSA                 */ 00808000
*               R1=RBPPSAV1;        /* PASS ADDRESS OF PPSA          */ 00809000
         LR    R1,@12                                           02S0212 00810000
*               R0=72;              /* PASS LENGTH OF PPSA           */ 00811000
         LA    R0,72                                            02S0213 00812000
*               R10WORK=R3CVT;      /* SAVE REGISTER CLOBBERED BY       00813000
*                                      FREEMAIN                      */ 00814000
         LR    R10WORK,R3CVT                                    02S0214 00815000
*MAINSA1:                           /* TESTING LABEL                 */ 00816000
*               GEN(FREEMAIN RC,LV=(0),A=(1),SP=250,BRANCH=YES) 02S0215 00817000
*               REFS(CVTCRMN,R13AREA,R0,R1) SETS(R14,R15,R3CVT);/*      00818000
*                                      FREEMAIN PPSA FROM SUBPOOL 250*/ 00819000
MAINSA1  FREEMAIN RC,LV=(0),A=(1),SP=250,BRANCH=YES                     00820000
*MAINSA2:                           /* TESTING LABEL                 */ 00821000
*               R3CVT=R10WORK;      /* RESTORE REGISTER CLOBBERED BY    00822000
*                                      FREEMAIN                      */ 00823000
MAINSA2  LR    R3CVT,R10WORK                                    02S0216 00824000
*             END;                  /* PPSA STORAGE FREED IF PRESENT */ 00825000
*                                                               02S0218 00826000
*           /*********************************************************/ 00827000
*           /*                                                       */ 00828000
*           /* AN IRB RESIDES IN SUBPOOL 253.                        */ 00829000
*           /*                                                       */ 00830000
*           /*********************************************************/ 00831000
*                                                               02S0218 00832000
*/* S MSS:  FREE SP253 IRB IF DYNAMIC AND USE COUNT ZERO             */ 00833000
*                                                               02S0218 00834000
*           IF RBFDYN='1'B          /* IF RB STORAGE FREEABLE        */ 00835000
*               &RBUSE=0 THEN       /* AND RB USE COUNT ZERO THEN    */ 00836000
@RF00210 TM    RBFDYN(R5RB),B'00000010'                         02S0218 00837000
         BNO   @RF00218                                         02S0218 00838000
         CLI   RBUSE(R5RB),0                                    02S0218 00839000
         BNE   @RF00218                                         02S0218 00840000
*             DO;                   /* FREEMAIN RB                   */ 00841000
*               R0=RBSIZE*8;        /* PASS RB BYTE SIZE INCLUDING      00842000
*                                      THAT OF PARTIAL PREFIX AND       00843000
*                                      POSSIBLE WORKAREA             */ 00844000
         LH    R0,RBSIZE(,R5RB)                                 02S0220 00845000
         SLA   R0,3                                             02S0220 00846000
*               R1=ADDR(RBPRFXST);  /* PASS ADDRESS OF RB PARTIAL       00847000
*                                      PREFIX                        */ 00848000
         LR    R1,R5RB                                          02S0221 00849000
         AL    R1,@CF02211                                      02S0221 00850000
*               R10WORK=R3CVT;      /* SAVE REGISTER CLOBBERED BY       00851000
*                                      FREEMAIN                      */ 00852000
         LR    R10WORK,R3CVT                                    02S0222 00853000
*MAINI1:                            /* TESTING LABEL                 */ 00854000
*               GEN(FREEMAIN RC,LV=(0),A=(1),SP=253,BRANCH=YES) 02S0223 00855000
*               REFS(CVTCRMN,R13AREA,R14,R15,R0,R1) SETS(R14,R15,R3CVT) 00856000
*                   ;               /* FREEMAIN IRB FROM SUBPOOL 253 */ 00857000
MAINI1   FREEMAIN RC,LV=(0),A=(1),SP=253,BRANCH=YES                     00858000
*MAINI2:                            /* TESTING LABEL                 */ 00859000
*               R3CVT=R10WORK;      /* RESTORE REGISTER CLOBBERED BY    00860000
*                                      FREEMAIN                      */ 00861000
MAINI2   LR    R3CVT,R10WORK                                    02S0224 00862000
*             END;                  /* IRB STORAGE FREED IF DYNAMIC  */ 00863000
*/* P MARK IRB INACTIVE IF NOT DYNAMIC OR USE COUNT NOT ZERO         */ 00864000
*                                                               02S0226 00865000
*           ELSE                    /* IF IRB NOT FREED      @ZA09499*/ 00866000
*             RBFACTV='0'B;         /* INDICATE IRB COMPLETE @ZA09499*/ 00867000
         B     @RC00218                                         02S0226 00868000
@RF00218 NI    RBFACTV(R5RB),B'10111111'                        02S0226 00869000
*/* N (,%DORB)  IRB TERMINATED                                       */ 00870000
*                                                               02S0227 00871000
*         END DOIRB;                /* IRB TERMINATED                */ 00872000
*                                                               02S0228 00873000
*   /*****************************************************************/ 00874000
*   /*                                                               */ 00875000
*   /* AN SIRB CONTAINS THE TASK REGISTERS FROM TIME OF SIRB         */ 00876000
*   /* SCHEDULING BY STAGE 3 EXIT EFFECTOR.                          */ 00877000
*   /*                                                               */ 00878000
*   /*****************************************************************/ 00879000
*                                                               02S0228 00880000
*/* %DOIRB: N  OTHERWISE SIRB EXITING                                */ 00881000
*                                                               02S0228 00882000
*       ELSE                        /* OTHERWISE SIRB EXITING SO     */ 00883000
*DOSIRB:                                                        02S0228 00884000
*         DO;                       /* TERMINATE SIRB                */ 00885000
         B     @RC00178                                         02S0228 00886000
@RF00178 DS    0H                                               02S0228 00887000
DOSIRB   DS    0H                                               02S0229 00888000
*/* P  MOVE R0-R15 FROM SIRB TO TCB                                  */ 00889000
*                                                               02S0229 00890000
*           TCBGRS=RBGRSAVE;        /* MOVE 16 REGISTERS             */ 00891000
         MVC   TCBGRS(64,R4TCB),RBGRSAVE(R5RB)                  02S0229 00892000
*TESTSIRB:                          /* TESTING LABEL                 */ 00893000
*/* P MARK SIRB INACTIVE                                             */ 00894000
*                                                               02S0230 00895000
*           RBFACTV='0'B;           /* INDICATE SIRB COMPLETE   02S0230 00896000
*                                                            @ZA09499*/ 00897000
TESTSIRB NI    RBFACTV(R5RB),B'10111111'                        02S0230 00898000
*/* N  SIRB TERMINATED                                               */ 00899000
*                                                               02S0231 00900000
*         END DOSIRB;               /* SIRB TERMINATED               */ 00901000
*/* %DORB: R  RB TERMINATED                                          */ 00902000
*/* SVC3RB: END                                                      */ 00903000
*                                                               02S0232 00904000
*   ;                                                           01S0232 00905000
*                                                               01S0232 00906000
@RC00178 DS    0H                                               01S0232 00907000
@RC00160 DS    0H                                               01S0232 00908000
@RC00121 DS    0H                                               01S0233 00909000
*   /*****************************************************************/ 00910000
*   /*                                                               */ 00911000
*   /* AFTER TERMINATING THE LAST RB UNDER A TCB EXIT PERFORMS THAT  */ 00912000
*   /* FINAL EOT CLEANUP WHICH SVC 13 COULD NOT PERFORM.             */ 00913000
*   /*                                                               */ 00914000
*   /*****************************************************************/ 00915000
*                                                               01S0233 00916000
*/* D (YES,DODETACH,NO,)  LAST RB EXITING AND SVC 13 EXECUTED        */ 00917000
*                                                               01S0233 00918000
*   IF NEXT='1'B                    /* IF TCB HAS ONLY TERMINAITNG RB*/ 00919000
*       &TCBEOT='1'B THEN           /* AND TASK TERMINATION HAS 01S0233 00920000
*                                      EXECUTED THEN                 */ 00921000
         TM    NEXT,B'10000000'                                 01S0233 00922000
         BNO   @RF00233                                         01S0233 00923000
         TM    TCBEOT(R4TCB),B'00000100'                        01S0233 00924000
         BO    @RT00233                                         01S0233 00925000
*     GO TO DODETACH;               /* BRANCH TO EOT CLEANUP         */ 00926000
*                                                               01S0234 00927000
*   /*****************************************************************/ 00928000
*   /*                                                               */ 00929000
*   /* EXIT RETURNS NORMALLY AFTER TERMINATING AN RB.                */ 00930000
*   /*                                                               */ 00931000
*   /*****************************************************************/ 00932000
*                                                               01S0235 00933000
*/* N  USUAL PATH -- RB TERMINATION WITHOUT TASK TERMINATION         */ 00934000
*/* R  RETURN TO EXIT PROLOGUE WITH TCB R15-R1                       */ 00935000
*                                                               01S0235 00936000
*   RFY                                                         01S0235 00937000
*     R15 RSTD;                     /* PASS R15 TO EXIT PROLOG       */ 00938000
@RF00233 DS    0H                                               01S0236 00939000
*   R15=TCBGRS15;                   /* PRESERVE TCB R15 OVER PROLOG  */ 00940000
         L     R15,TCBGRS15(,R4TCB)                             01S0236 00941000
*   R0=TCBGRS0;                     /* PRESERVE TCB R0 OVER PROLOG   */ 00942000
         L     R0,TCBGRS0(,R4TCB)                               01S0237 00943000
*   R1=TCBGRS1;                     /* PRESERVE TCB R1 OVER PROLOG   */ 00944000
         L     R1,TCBGRS1(,R4TCB)                               01S0238 00945000
*PROLOG1:                           /* TESTING LABEL                 */ 00946000
*   GO TO PROLOGUE;                 /* CLEAN UP AND EXIT TO     01S0239 00947000
*                                      DISPATCHER                    */ 00948000
PROLOG1  L     @14,R14SAVE                                      01S0239 00949000
         BR    @14                                              01S0239 00950000
*   RFY                                                         01S0240 00951000
*     R15 UNRSTD;                   /* RELEASE R15 PASSED TO EXIT       00952000
*                                      PROLOGUE FOR CALLS            */ 00953000
*                                                               01S0241 00954000
*   /*****************************************************************/ 00955000
*   /*                                                               */ 00956000
*   /* TO TERMINATE A SPIE EXIT EXIT MAKES THE EXIT REUSABLE AND SETS*/ 00957000
*   /* UP A RETRY WITH PARAMETER REGISTERS. FOR INTEGRITY EXIT       */ 00958000
*   /* ACCESSES SP0 PIE UNDER USER KEY.                              */ 00959000
*   /*                                                               */ 00960000
*   /*****************************************************************/ 00961000
*                                                               01S0241 00962000
*/* DOSPIE: N  SPIE EXIT TERMINATION                                 */ 00963000
*                                                               01S0241 00964000
*DOSPIE:                            /* TERMINATE SPIE EXIT RATHER       00965000
*                                      THAN RB                       */ 00966000
*/* S MODESET:  SET PSW KEY TO THAT OF PIE                           */ 00967000
*                                                               01S0241 00968000
*   RFY                                                         01S0241 00969000
*     R2 RSTD;                      /* PRESERVE EXIT KEY ACROSS 01S0241 00970000
*                                      MODESET                       */ 00971000
DOSPIE   DS    0H                                               01S0242 00972000
*   R2=TCBPKF;                      /* OBTAIN TASK PROTECTION KEY    */ 00973000
         SLR   R2,R2                                            01S0242 00974000
         IC    R2,TCBPKF(,R4TCB)                                01S0242 00975000
*MODESET1:                          /* TESTING LABEL                 */ 00976000
*   GEN(MODESET KEYADDR=(2))                                    01S0243 00977000
*   REFS(R2);                       /* OBTAIN TASK KEY TO PRESERVE      00978000
*                                      INTEGRITY                     */ 00979000
MODESET1 MODESET KEYADDR=(2)                                            00980000
*MODESET2:                          /* TESTING LABEL                 */ 00981000
*/* P  INDICATE SPIE EXIT REINVOCABLE                                */ 00982000
*                                                               01S0244 00983000
*   PIENOPI='0'B;                   /* MARK SPIE EXIT NONBUSY        */ 00984000
MODESET2 L     @12,TCBPIE(,R4TCB)                               01S0244 00985000
         L     @12,SCAPIE(,@12)                                 01S0244 00986000
         NI    PIENOPI(@12),B'01111111'                         01S0244 00987000
*/* S MODESET:  SET PSW KEY TO THAT OF SUPERVISOR                    */ 00988000
*                                                               01S0245 00989000
*MODESET3:                          /* TESTING LABEL                 */ 00990000
*   GEN(MODESET EXTKEY=SUPR);       /* OBTAIN EXIT KEY TO CONTINUE      00991000
*                                      SUPERVISOR PROCESSING         */ 00992000
MODESET3 MODESET EXTKEY=SUPR                                            00993000
*   RFY                                                         01S0246 00994000
*     R2 UNRSTD;                    /* RELEASE REGISTER FOR     01S0246 00995000
*                                      OPTIMIZATION                  */ 00996000
*MODESET4:                          /* TESTING LABEL                 */ 00997000
*                                                               01S0247 00998000
*   /*****************************************************************/ 00999000
*   /*                                                               */ 01000000
*   /* (SPIE PROCESSING CONCLUDED.)                                  */ 01001000
*   /*                                                               */ 01002000
*   /*****************************************************************/ 01003000
*                                                               01S0247 01004000
*/* P  MOVE R14-R2 FROM PIE TO TCB                                   */ 01005000
*                                                               01S0247 01006000
*   ADDR(TCBGRS14)->WORDS2=ADDR(PIEGR14)->WORDS2;/* MOVE R14-R15 FROM   01007000
*                                      PIE TO TCB                    */ 01008000
MODESET4 L     @12,TCBPIE(,R4TCB)                               01S0247 01009000
         L     @12,SCAPIE(,@12)                                 01S0247 01010000
         MVC   WORDS2+104(8,R4TCB),WORDS2+12(@12)               01S0247 01011000
*   ADDR(TCBGRS0)->WORDS3=ADDR(PIEGR0)->WORDS3;/* MOVE R0-R2 FROM PIE   01012000
*                                      TO TCB                        */ 01013000
         MVC   WORDS3+48(12,R4TCB),WORDS3+20(@12)               01S0248 01014000
*/* P  TRANSLATE S360 PSW RH IN PIE INTO S370R PSW FIELDS IN RB      */ 01015000
*                                                               01S0249 01016000
*   PSWECIA=PSWBCIA;                /* TRANSLATE INSTRUCTION ADDRESS */ 01017000
         L     @11,PSWBCIA-1(,@12)                              01S0249 01018000
         LA    @11,0(,@11)                                      01S0249 01019000
         ST    @11,PSWECIA(,R5RB)                               01S0249 01020000
*   PSWECB=PSWBCB;                  /* MOVE ILC-CC-PM                */ 01021000
         MVC   PSWECB(1,R5RB),PSWBCB(@12)                       01S0250 01022000
*   PSWECZ='00'B;                   /* CLEAR ILC                     */ 01023000
         NI    PSWECZ(R5RB),B'00111111'                         01S0251 01024000
*/* R  RETURN TO EXIT PROLOGUE WITH PIE R15-1                        */ 01025000
*                                                               01S0252 01026000
*   RFY                                                         01S0252 01027000
*     R15 RSTD;                     /* PRESERVE R15 FOR EXIT PROLOG  */ 01028000
*   R15=TCBGRS15;                   /* PASS R15 TO RETRY             */ 01029000
         L     R15,TCBGRS15(,R4TCB)                             01S0253 01030000
*   R0=TCBGRS0;                     /* PASS R0 TO RETRY              */ 01031000
         L     R0,TCBGRS0(,R4TCB)                               01S0254 01032000
*   R1=TCBGRS1;                     /* PASS R1 TO RETRY              */ 01033000
         L     R1,TCBGRS1(,R4TCB)                               01S0255 01034000
*PROLOG2:                           /* TESTING LABEL                 */ 01035000
*   GO TO PROLOGUE;                 /* CLEAN UP AND EXIT TO     01S0256 01036000
*                                      DISPATCHER                    */ 01037000
PROLOG2  L     @14,R14SAVE                                      01S0256 01038000
         BR    @14                                              01S0256 01039000
*   RFY                                                         01S0257 01040000
*     R15 UNRSTD;                   /* RELEASE R15 FOR SUBROUTINE       01041000
*                                      CALLS                         */ 01042000
*                                                               01S0258 01043000
*   /*****************************************************************/ 01044000
*   /*                                                               */ 01045000
*   /* EXIT INITIATES NORMAL TASK TERMINATION BY INVOKING SVC 13     */ 01046000
*   /* UNDER THE LAST RB. EXIT MUST ASSUME TASK MODE IN ORDER TO     */ 01047000
*   /* ISSUE THE SVC. LOCAL LOCK RELEASE CAUSES REGISTER STATUS      */ 01048000
*   /* SAVING ON INTERRUPT IN TCB.                                   */ 01049000
*   /*                                                               */ 01050000
*   /*****************************************************************/ 01051000
*                                                               01S0258 01052000
*/* DOSVC13: N  TASK EXECUTION COMPLETE                              */ 01053000
*                                                               01S0258 01054000
*DOSVC13:                           /* ISSUE SVC 13 FOR INITIAL 01S0258 01055000
*                                      NORMAL EOT                    */ 01056000
*/* P  SAVE COMPLETION CODE FROM TASK REGISTER SAVE AREA             */ 01057000
*                                                               01S0258 01058000
*   R1=TCBGRS15;                    /* PRESERVE RETURN CODE AGAINST     01059000
*                                      TASK MODE                     */ 01060000
DOSVC13  L     R1,TCBGRS15(,R4TCB)                              01S0258 01061000
*/* P  CLEAR TYPE 1 SVC FLAG BECAUSE BYPASSING EXIT PROLOGUE         */ 01062000
*                                                               01S0259 01063000
*   ASCBTYP1='0'B;                  /* CLEAR TYPE 1 SVC SWITCH  01S0259 01064000
*                                      BECAUSE BYPASSING PROLOGUE    */ 01065000
         NI    ASCBTYP1(R7ASCB),B'11111101'                     01S0259 01066000
*/* S SETLOCK:  FREE LOCAL LOCK                                      */ 01067000
*                                                               01S0260 01068000
*   GEN(DROP R8DSECT);              /* RELEASE AUTOMATIC STORAGE     */ 01069000
         DROP R8DSECT                                                   01070000
*SETLOCK1:                          /* TESTING LABEL                 */ 01071000
*   GEN(SETLOCK RELEASE,TYPE=LOCAL,RELATED=(LOCALSUPV,IEAVESVC,GETRTN)) 01072000
*   REFS(PSALITA) SETS(R11,R12,R13AREA,R14);/* SWITCH TO TASK MODE   */ 01073000
SETLOCK1 SETLOCK RELEASE,TYPE=LOCAL,RELATED=(LOCALSUPV,IEAVESVC,GETRTN) 01074000
*SETLOCK2:                          /* TESTING LABEL                 */ 01075000
*/* R  ISSUE SVC 13 TO TERMINATE TASK NORMALLY                       */ 01076000
*                                                               01S0262 01077000
*   R1=R1&'00FFFFFF'X|'08000000'X;  /* INDICATE NORMAL TASK     01S0262 01078000
*                                      COMPLETION                    */ 01079000
SETLOCK2 LR    @12,R1                                           01S0262 01080000
         N     @12,@CF02155                                     01S0262 01081000
         O     @12,@CF02156                                     01S0262 01082000
         LR    R1,@12                                           01S0262 01083000
*ABEND1:                            /* TESTING LABEL                 */ 01084000
*   GEN(SVC 13);                    /* GO TO TASK TERMINATION        */ 01085000
ABEND1   SVC 13                                                         01086000
*   GEN(USING @DATD,R8DSECT);       /* RESUME AUTOMATIC STORAGE      */ 01087000
         USING @DATD,R8DSECT                                            01088000
*                                                               01S0265 01089000
*   /*****************************************************************/ 01090000
*   /*                                                               */ 01091000
*   /* TASK TERMINATION NEEDED MAIN STORAGE RESOURCES TASK           */ 01092000
*   /* DISPATCHABILITY AND A TCB TO RUN AS A TYPE 4 SVC UNDER THE    */ 01093000
*   /* TASK.                                                         */ 01094000
*   /*                                                               */ 01095000
*   /*****************************************************************/ 01096000
*                                                               01S0265 01097000
*/* DODETACH: N  TASK TERMINATION COMPLETE                           */ 01098000
*                                                               01S0265 01099000
*DODETACH:                          /* PERFORM FINAL END-OF-TASK        01100000
*                                      CLEANUP                       */ 01101000
*/* S SPET:  FREE MAIN STORAGE SUBPOOLS                              */ 01102000
*                                                               01S0265 01103000
*SPET1:                             /* TESTING LABEL                 */ 01104000
*   CALL SPET;                      /* CALL MSS TTRM                 */ 01105000
DODETACH DS    0H                                               01S0265 01106000
SPET1    L     @15,CVTQSAS(,R3CVT)                              01S0265 01107000
         BALR  @14,@15                                          01S0265 01108000
*SPET2:                             /* TESTING LABEL                 */ 01109000
*/* S CSPROC:  DECREMENT READY TCB COUNT                             */ 01110000
*                                                               01S0266 01111000
*   CALL CSPROC;                    /* DECREMENT READY TASK COUNT    */ 01112000
SPET2    BAL   @14,CSPROC                                       01S0266 01113000
*/* S DETACH:  ERASE TCB OR SCHEDULE EOT SERVICES                    */ 01114000
*                                                               01S0267 01115000
*   R1=ADDR(TCB);                   /* PASS TCB ADDRESS              */ 01116000
         LR    R1,R4TCB                                         01S0267 01117000
*   R0=0;                           /* INDICATE BRANCH ENTRY FOR EOT    01118000
*                                      NOT ABEND                     */ 01119000
         SLR   R0,R0                                            01S0268 01120000
*DETACH1:                           /* TESTING LABEL                 */ 01121000
*   CALL DETACH;                    /* CALL TCB TTRM                 */ 01122000
DETACH1  L     @15,CVT062R1(,R3CVT)                             01S0269 01123000
         BALR  @14,@15                                          01S0269 01124000
*DETACH2:                           /* TESTING LABEL                 */ 01125000
*                                                               01S0270 01126000
*   /*****************************************************************/ 01127000
*   /*                                                               */ 01128000
*   /* NORMALLY END-OF-TASK MEANS LAST EXIT FROM A PRB.              */ 01129000
*   /*                                                               */ 01130000
*   /*****************************************************************/ 01131000
*                                                               01S0270 01132000
*/* S MSS:  FREE PRB OR SVRB IF DYNAMIC                              */ 01133000
*                                                               01S0270 01134000
*   IF RBFTP='000'B                 /* IF PRB EXITING                */ 01135000
*       &RBFDYN='1'B THEN           /* AND PRB DYNAMIC THEN          */ 01136000
DETACH2  TM    RBFTP(R5RB),B'11100000'                          01S0270 01137000
         BNZ   @RF00270                                         01S0270 01138000
         TM    RBFDYN(R5RB),B'00000010'                         01S0270 01139000
         BNO   @RF00270                                         01S0270 01140000
*     DO;                           /* FREEMAIN PRB                  */ 01141000
*       R0=RBSIZE*8;                /* PASS RB BYTE SIZE INCLUDING      01142000
*                                      THAT OF PARTIAL PREFIX        */ 01143000
         LH    R0,RBSIZE(,R5RB)                                 01S0272 01144000
         SLA   R0,3                                             01S0272 01145000
*       R1=ADDR(RBPRFXST);          /* PASS ADDRESS OF GOTTEN PARTIAL   01146000
*                                      PREFIX                        */ 01147000
         LR    R1,R5RB                                          01S0273 01148000
         AL    R1,@CF02211                                      01S0273 01149000
*       R10WORK=R3CVT;              /* SAVE REGISTER CLOBBERED BY       01150000
*                                      FREEMAIN                      */ 01151000
         LR    R10WORK,R3CVT                                    01S0274 01152000
*MAINP3:                            /* TESTING LABEL                 */ 01153000
*       GEN(FREEMAIN RC,LV=(0),A=(1),SP=255,BRANCH=YES)         01S0275 01154000
*       REFS(R13AREA,R0,R1) SETS(R14,R15,R3CVT);/* FREEMAIN PRB FROM    01155000
*                                      SUBPOOL 255                   */ 01156000
MAINP3   FREEMAIN RC,LV=(0),A=(1),SP=255,BRANCH=YES                     01157000
*MAINP4:                            /* TESTING LABEL                 */ 01158000
*       R3CVT=R10WORK;              /* RESTORE REGISTER CLOBBERED BY    01159000
*                                      FREEMAIN                      */ 01160000
MAINP4   LR    R3CVT,R10WORK                                    01S0276 01161000
*TESTPR:                                                        01S0277 01162000
*       GEN(DS 0H);                 /* TESTING LABEL                 */ 01163000
TESTPR   DS 0H                                                          01164000
*     END;                          /* PRB STORAGE FREED IF DYNAMIC  */ 01165000
*                                                               01S0279 01166000
*   /*****************************************************************/ 01167000
*   /*                                                               */ 01168000
*   /* AN ATTACH FALIURE MAY CAUSE SVRB EXIT FOR END-OF-TASK.        */ 01169000
*   /*                                                               */ 01170000
*   /*****************************************************************/ 01171000
*                                                               01S0279 01172000
*   ELSE                            /* IF NON-PRB EXITING THEN       */ 01173000
*     IF RBFTP='110'B               /* IF SVRB EXITING               */ 01174000
*         &RBFDYN='1'B THEN         /* AND SVRB FREEABLE THEN        */ 01175000
         B     @RC00270                                         01S0279 01176000
@RF00270 TM    RBFTP(R5RB),B'11000000'                          01S0279 01177000
         BNO   @RF00279                                         01S0279 01178000
         TM    RBFTP(R5RB),B'00100000'                          01S0279 01179000
         BNZ   @RF00279                                         01S0279 01180000
         TM    RBFDYN(R5RB),B'00000010'                         01S0279 01181000
         BNO   @RF00279                                         01S0279 01182000
*       DO;                         /* FREEMAIN OR FREECELL RB       */ 01183000
*/* D (YES,,NO,PGMGRCK) VALID SVRB ?                                 */ 01184000
*                                                               01S0281 01185000
*         RFY                                                   01S0281 01186000
*           MBCB BASED(MBCBPTR);                                01S0281 01187000
*         MBCBPTR=R5RB-LENGTH(MBCBMAIN)-ADDR(RBPRFLNA);/* START OF      01188000
*                                      THE SVRB BUFFER POOL  @Z40FPYK*/ 01189000
         LR    @12,R5RB                                         01S0282 01190000
         SL    @12,@CF00061                                     01S0282 01191000
         LA    @11,RBPRFLNA                                     01S0282 01192000
         SLR   @12,@11                                          01S0282 01193000
         ST    @12,MBCBPTR                                      01S0282 01194000
*/* P SET UP TO RETURN SVRB TO POOL                                  */ 01195000
*                                                               01S0283 01196000
*         IF RBNOCELL='1'B THEN                                 01S0283 01197000
         TM    RBNOCELL(R5RB),B'10000000'                       01S0283 01198000
         BO    @RT00283                                         01S0283 01199000
*           GO TO PGMGRCK;          /*                       @ZM41810*/ 01200000
*         IF MBCBID=CHARSVRB THEN                               01S0285 01201000
         CLC   MBCBID(4,@12),CHARSVRB                           01S0285 01202000
         BNE   @RF00285                                         01S0285 01203000
*           DO;                     /* DETERMINE IF THIS IS A VALID     01204000
*                                      SVRB THAT IS BEING RETURNED TO   01205000
*                                      THE SVRB POOL. THIS IS   01S0286 01206000
*                                      DETERMINED BY A VERIFICATION     01207000
*                                      OF WHETHER THE MBCB IDENTIFIER   01208000
*                                      IS 'SVRB'. IF YES THEN THIS IS   01209000
*                                      INDEED AN SVRB WHICH BELONGS     01210000
*                                      TO THE COMMON SVRB MEMORY        01211000
*                                      POOL.                 @Z40FPYK*/ 01212000
*             R0=ASCBSVRB;          /* SET UP TO RETURN THE SVRB TO     01213000
*                                      THE COMMON MEMORY POOL   01S0287 01214000
*                                                            @Z40FPYK*/ 01215000
         L     R0,ASCBSVRB(,R7ASCB)                             01S0287 01216000
*             R1=ASCBSYNC;          /* SYNCHRONIZATION COUNTER TO       01217000
*                                      CONTROL MULTIPLE ACCESSES TO     01218000
*                                      THE ASCB SVRB POOL    @Z40FPYK*/ 01219000
         L     R1,ASCBSYNC(,R7ASCB)                             01S0288 01220000
*/*RELESVRB: P SET UP SVRB LINK FIELD FOR POOL                       */ 01221000
*                                                               01S0289 01222000
*RELESVRB:                                                      01S0289 01223000
*             MBCBLINK=ASCBSVRB;    /* UPDATE CURRENT LINK FIELD IN     01224000
*                                      THE SVRB BEING FREED. @Z40FPYK*/ 01225000
RELESVRB L     @12,ASCBSVRB(,R7ASCB)                            01S0289 01226000
         L     @11,MBCBPTR                                      01S0289 01227000
         ST    @12,MBCBLINK(,@11)                               01S0289 01228000
*/* P INCREMENT SYNCHRONOUS COUNTER                                  */ 01229000
*                                                               01S0290 01230000
*             RFY                                               01S0290 01231000
*              (R14,                                            01S0290 01232000
*               R15) RSTD;          /* RESTRICT REGISTERS 14 AND 15     01233000
*                                                            @Z40FPYK*/ 01234000
*             R15=R1+1;             /* INCREMENT SYNCHRONOUS COUNT IN   01235000
*                                      ASCB                  @Z40FPYK*/ 01236000
         LA    R15,1                                            01S0291 01237000
         ALR   R15,R1                                           01S0291 01238000
*/* P SVRB BEING RETURNED TO POOL                                    */ 01239000
*                                                               01S0292 01240000
*             R14=MBCBPTR;          /* SVRB WHICH IS BEING RETURNED     01241000
*                                      TO POOL               @Z40FPYK*/ 01242000
         L     R14,MBCBPTR                                      01S0292 01243000
*/* P RETURN SVRB TO POOL                                            */ 01244000
*                                                               01S0293 01245000
*             CDS(R0,R14,ASCBSUPC); /* RETURN SVRB TO COMMON MEMORY     01246000
*                                      POOL                  @Z40FPYK*/ 01247000
         CDS   R0,R14,ASCBSUPC(R7ASCB)                          01S0293 01248000
*/* D (YES,RELESVRB,NO,) SVRB RETURNED ?                             */ 01249000
*                                                               01S0294 01250000
*             BC(7,RELESVRB);       /* WAS SVRB RETURNED TO POOL ?      01251000
*                                      NO--                  @Z40FPYK*/ 01252000
         BC    7,RELESVRB                                       01S0294 01253000
*/* P (,STNSM1) SVRB RETURNED SUCCESSFULLY                           */ 01254000
*                                                               01S0295 01255000
*           END;                    /* YES, WE HAVE FINISHED @Z40FPYK*/ 01256000
*         ELSE                                                  01S0296 01257000
*           DO;                     /* DETERMINE IF INVALID SVRB OR     01258000
*                                      PROGRAM MGR SVRB      @Z40FPYK*/ 01259000
         B     @RC00285                                         01S0296 01260000
@RF00285 DS    0H                                               01S0297 01261000
*/*PGMGRCK: D (YES,,NO,%ABND) PROGRAM MGR SVRB ?                     */ 01262000
*                                                               01S0297 01263000
*PGMGRCK:                                                       01S0297 01264000
*             IF RBNOCELL='1'B THEN                             01S0297 01265000
PGMGRCK  TM    RBNOCELL(R5RB),B'10000000'                       01S0297 01266000
         BNO   @RF00297                                         01S0297 01267000
*               DO;                 /* PGM MANAGER SVRB OR REQUEST TO   01268000
*                                      FREE SVRB ?           @ZM41810*/ 01269000
*/* P SET UP TO FREEMAIN RB                                          */ 01270000
*                                                               01S0299 01271000
*                 R1=ADDR(RBPRFXST);/* POINT TO PREFIX WHICH MUST BE    01272000
*                                      FREED                 @Z40FPYK*/ 01273000
         LR    R1,R5RB                                          01S0299 01274000
         AL    R1,@CF02211                                      01S0299 01275000
*                 R0=RBSIZE*8;      /* SIZE OF RB TO BE FREED   01S0300 01276000
*                                                            @Z40FPYK*/ 01277000
         LH    R0,RBSIZE(,R5RB)                                 01S0300 01278000
         SLA   R0,3                                             01S0300 01279000
*                 R10WORK=R3CVT;    /* SAVE REGISTER CLOBBERED BY       01280000
*                                      FREEMAIN              @Z40FPYK*/ 01281000
         LR    R10WORK,R3CVT                                    01S0301 01282000
*/* S (,STNSM1)FREEMAIN:GO FREE THE SVRB                             */ 01283000
*                                                               01S0302 01284000
*                 GEN(FREEMAIN RC,LV=(0),A=(1),SP=255,BRANCH=YES)       01285000
*                 REFS(R13AREA,R0,R1) SETS(R14,R15,R3CVT);/* FREEMAIN   01286000
*                                      SVRB FROM SUBPOOL 255 @Z40FPYK*/ 01287000
         FREEMAIN RC,LV=(0),A=(1),SP=255,BRANCH=YES                     01288000
*                 R3CVT=R10WORK;    /* RESTORE REGISTER CLOBBERED BY    01289000
*                                      FREEMAIN              @Z40FPYK*/ 01290000
         LR    R3CVT,R10WORK                                    01S0303 01291000
*               END;                                            01S0304 01292000
*             ELSE                                              01S0305 01293000
*               DO;                                             01S0305 01294000
*                                                               01S0305 01295000
         B     @RC00297                                         01S0305 01296000
@RF00297 DS    0H                                               01S0306 01297000
*/*%ABND:  P SET UP ABEND CONDITION = 4                              */ 01298000
*                                                               01S0306 01299000
*                 R15=ABENDCND;     /* ABEND CONDITION CODE = 4 01S0306 01300000
*                                                            @Z40FPYK*/ 01301000
         LA    R15,4                                            01S0306 01302000
*/* R X'0F9' ABEND                                                   */ 01303000
*                                                               01S0307 01304000
*                 GEN SETS(R0,R1) EXIT(ABEND X'0F9',DUMP,,SYSTEM);/*    01305000
*                                      ABEND CALLER WITH A X'0F9' R15   01306000
*                                      = 4 ABEND CODE        @Z40FPYK*/ 01307000
         ABEND X'0F9',DUMP,,SYSTEM                                      01308000
*                 RFY                                           01S0308 01309000
*                  (R14,                                        01S0308 01310000
*                   R15) UNRSTD;    /* UNRESTRICT REGS 14 AND 15        01311000
*                                                            @Z40FPYK*/ 01312000
*               END;                /* END OF ABEND INVALID SVRB        01313000
*                                      FUNCTION              @Z40FPYK*/ 01314000
*           END;                    /* END OF FREE VALID SVRB   01S0310 01315000
*                                      FUNCTION              @Z40FPYK*/ 01316000
@RC00297 DS    0H                                               01S0311 01317000
*       END;                        /* END OF ALL SVRB FUNCTIONS        01318000
*                                                            @Z40FPYK*/ 01319000
@RC00285 DS    0H                                               01S0312 01320000
*                                                               01S0312 01321000
*   /*****************************************************************/ 01322000
*   /*                                                               */ 01323000
*   /* THE DISPATCHER HAS AN ENTRY POINT FOR END OF TASK WHICH       */ 01324000
*   /* CIRCUMVENTS USE OF THE CURRENTLY DISPATCHED TCB AND SWITCHES  */ 01325000
*   /* TO DISPATCHING ANOTHER TASK. ENTRY TO THE DISPATCHER MUST TAKE*/ 01326000
*   /* PLACE UNDER INTERRUPT HANDLER MODE WITH EXIT PROLOG CLEANUP   */ 01327000
*   /* COMPLETED.                                                    */ 01328000
*   /*                                                               */ 01329000
*   /*****************************************************************/ 01330000
*                                                               01S0312 01331000
*/* P  DISABLE I/O AND EXTERNAL INTERRUPTS                           */ 01332000
*                                                               01S0312 01333000
*STNSM1:                            /* TESTING LABEL                 */ 01334000
*   GEN(STNSM REGSAVE,B'11111100')                              01S0312 01335000
*   SETS(REGSAVE);                  /* & OFF INTERRUPT ENABLEMENT       01336000
*                                      BITS (6=I/O, 7=EXT) IN PSW       01337000
*                                      SYSTEM MASK                   */ 01338000
@RF00279 DS    0H                                               01S0312 01339000
@RC00270 DS    0H                                               01S0312 01340000
STNSM1   STNSM REGSAVE,B'11111100'                                      01341000
*STNSM2:                            /* TESTING LABEL                 */ 01342000
*/* P  CLEAR TYPE 1 SVC FLAG BECAUSE BYPASSING EXIT PROLOGUE         */ 01343000
*                                                               01S0313 01344000
*   ASCBTYP1='0'B;                  /* INDICATE NO TYPE 1 SVC   01S0313 01345000
*                                      EXECUTING                     */ 01346000
STNSM2   NI    ASCBTYP1(R7ASCB),B'11111101'                     01S0313 01347000
*/* S SETLOCK:  FREE LOCAL LOCK                                      */ 01348000
*                                                               01S0314 01349000
*   GEN(DROP R8DSECT);              /* RELEASE AUTOMATIC STORAGE     */ 01350000
         DROP R8DSECT                                                   01351000
*SETLOCK3:                          /* TESTING LABEL                 */ 01352000
*   GEN(SETLOCK RELEASE,TYPE=LOCAL,RELATED=(LOCALSUPV,IEAVESVC,GETRTN)) 01353000
*   REFS(PSALITA) SETS(R11,R12,R13AREA,R14);/* RELEASE LOCK BECAUSE     01354000
*                                      BYPASSING EXIT PROLOGUE       */ 01355000
SETLOCK3 SETLOCK RELEASE,TYPE=LOCAL,RELATED=(LOCALSUPV,IEAVESVC,GETRTN) 01356000
*/* R  EXIT TO EOT DISPATCHER ENTRY                                  */ 01357000
*                                                               01S0316 01358000
*   GEN(USING @DATD,R8DSECT);       /* RESUME AUTOMATIC STORAGE      */ 01359000
         USING @DATD,R8DSECT                                            01360000
*SETLOCK4:                          /* TESTING LABEL                 */ 01361000
*SWITCH1:                           /* TESTING LABEL                 */ 01362000
*   GO TO IEAPDS6;                  /* SPECIAL ENTRY POINT FOR END OF   01363000
*                                      TASK                          */ 01364000
SETLOCK4 DS    0H                                               01S0317 01365000
SWITCH1  L     @12,@CV02027                                     01S0317 01366000
         BR    @12                                              01S0317 01367000
*/* SVC3: END                                                        */ 01368000
*                                                               01S0318 01369000
*CSPROC:                                                        01S0318 01370000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* DECREMENT TCB COUNT           */ 01371000
*                                                               01S0318 01372000
CSPROC   DS    0H                                               01S0319 01373000
*   /*****************************************************************/ 01374000
*   /*                                                               */ 01375000
*   /* COMPARE-AND-SWAP INSTRUCTIONS SERIALIZE THE COUNT OF          */ 01376000
*   /* DISPATCHABLE TASKS IN AN ADDRESS SPACE.                       */ 01377000
*   /*                                                               */ 01378000
*   /*****************************************************************/ 01379000
*                                                               01S0319 01380000
*CSLOOP:                            /* CS LOOP                       */ 01381000
*   R0=ASCBTCBS;                    /* LOAD COUNT                    */ 01382000
CSLOOP   L     R0,ASCBTCBS(,R7ASCB)                             01S0319 01383000
*   R1=R0;                          /* COPY COUNT                    */ 01384000
         LR    R1,R0                                            01S0320 01385000
*   R1=R1-1;                        /* DECREMENT COUNT               */ 01386000
         BCTR  R1,0                                             01S0321 01387000
*CSOP:                              /* TESTING LABEL                 */ 01388000
*   CS(R0,R1,ASCBTCBS);             /* ATTEMPT UPDATE                */ 01389000
CSOP     CS    R0,@01,ASCBTCBS(R7ASCB)                          01S0322 01390000
*   BC(7,CSLOOP);                   /* RETRY UPDATE ON INTERFERENCE  */ 01391000
         BC    7,CSLOOP                                         01S0323 01392000
*TESTCS:                            /* TESTING LABEL                 */ 01393000
*   END CSPROC;                     /* READY TASK COUNT DECREMENTED  */ 01394000
@EL00002 DS    0H                                               01S0324 01395000
@EF00002 DS    0H                                               01S0324 01396000
@ER00002 BR    @14                                              01S0324 01397000
*   END IGC003                      /* END                           */ 01398000
*                                                               01S0325 01399000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01400000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 01401000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 01402000
*/*%INCLUDE SYSLIB  (IHARB   )                                       */ 01403000
*/*%INCLUDE SYSLIB  (IKJRB   )                                       */ 01404000
*/*%INCLUDE SYSLIB  (IHAIQE  )                                       */ 01405000
*/*%INCLUDE SYSLIB  (IHASCA  )                                       */ 01406000
*/*%INCLUDE SYSLIB  (IHAPIE  )                                       */ 01407000
*/*%INCLUDE SYSLIB  (IHAMBCB )                                       */ 01408000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 01409000
*/*%INCLUDE SYSLIB  (IHAASXB )                                       */ 01410000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 01411000
*/*%INCLUDE SYSLIB  (IHAWSAVT)                                       */ 01412000
*/*%INCLUDE SYSUT5  (SVC3RB  )                                       */ 01413000
*                                                               01S0325 01414000
*       ;                                                       01S0325 01415000
@DATA    DS    0H                                                       01416000
@DATD    DSECT                                                          01417000
         DS    0F                                                       01418000
IGC003   CSECT                                                          01419000
         DS    0F                                                       01420000
@CF00061 DC    F'8'                                                     01421000
@CF02211 DC    F'-32'                                                   01422000
@CF02210 DC    F'-8'                                                    01423000
@CF02155 DC    XL4'00FFFFFF'                                            01424000
@CF02156 DC    XL4'08000000'                                            01425000
@DATD    DSECT                                                          01426000
         DS    0D                                                       01427000
MBCBPTR  DS    A                                                        01428000
STORAGE  DS    CL84                                                     01429000
         ORG   STORAGE                                                  01430000
UNUSED   DS    FL4                                                      01431000
FLAGS    DS    FL4                                                      01432000
         ORG   FLAGS                                                    01433000
NEXT     DS    BL1                                                      01434000
         ORG   STORAGE+8                                                01435000
R14SAVE  DS    AL4                                                      01436000
REGSAVE  DS    18F                                                      01437000
         ORG   STORAGE+84                                               01438000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01439000
@ENDDATD EQU   *                                                        01440000
IGC003   CSECT                                                          01441000
         NOPR  ((@ENDDATD-@DATD)/129*16)                                01442000
         DS    0F                                                       01443000
@SIZDATD DC    AL1(0)                                                   01444000
         DC    AL3(@ENDDATD-@DATD)                                      01445000
@CV02027 DC    V(IEAPDS6)                                               01446000
@CA02028 DC    A(IEAPSVC3)                                              01447000
@CV02049 DC    V(IEAVESSS)                                              01448000
@CV02075 DC    V(IEAPPGMX)                                              01449000
@CV02098 DC    V(IECVX025)                                              01450000
         DS    0D                                                       01451000
CHARSVRB DC    CL4'SVRB'                                                01452000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01453000
@01      EQU   01                                                       01454000
@02      EQU   02                                                       01455000
@03      EQU   03                                                       01456000
@04      EQU   04                                                       01457000
@05      EQU   05                                                       01458000
@06      EQU   06                                                       01459000
@07      EQU   07                                                       01460000
@08      EQU   08                                                       01461000
@09      EQU   09                                                       01462000
@10      EQU   10                                                       01463000
@11      EQU   11                                                       01464000
@12      EQU   12                                                       01465000
@13      EQU   13                                                       01466000
@14      EQU   14                                                       01467000
@15      EQU   15                                                       01468000
R3CVT    EQU   @03                                                      01469000
R4TCB    EQU   @04                                                      01470000
R5RB     EQU   @05                                                      01471000
R7ASCB   EQU   @07                                                      01472000
R9UNUSED EQU   @09                                                      01473000
R10WORK  EQU   @10                                                      01474000
R15      EQU   @15                                                      01475000
R0       EQU   @00                                                      01476000
R1       EQU   @01                                                      01477000
R11      EQU   @11                                                      01478000
R12      EQU   @12                                                      01479000
R2       EQU   @02                                                      01480000
R6CSECT  EQU   @06                                                      01481000
R14      EQU   @14                                                      01482000
R8DSECT  EQU   @08                                                      01483000
R13AREA  EQU   @13                                                      01484000
         EXTRN IEAPSVC3                                                 01485000
PSA      EQU   0                                                        01486000
FLCRNPSW EQU   PSA                                                      01487000
FLCROPSW EQU   PSA+8                                                    01488000
FLCICCW2 EQU   PSA+16                                                   01489000
PSAEEPSW EQU   PSA+132                                                  01490000
PSAESPSW EQU   PSA+136                                                  01491000
FLCSVILC EQU   PSAESPSW+1                                               01492000
PSAEPPSW EQU   PSA+140                                                  01493000
FLCPIILC EQU   PSAEPPSW+1                                               01494000
FLCPICOD EQU   PSAEPPSW+2                                               01495000
PSAPICOD EQU   FLCPICOD+1                                               01496000
FLCTEA   EQU   PSAEPPSW+4                                               01497000
FLCPER   EQU   PSA+152                                                  01498000
FLCMCLA  EQU   PSA+168                                                  01499000
FLCIOEL  EQU   FLCMCLA+4                                                01500000
FLCIOA   EQU   FLCMCLA+16                                               01501000
FLCFSA   EQU   FLCMCLA+80                                               01502000
PSASUPER EQU   PSA+552                                                  01503000
PSASUP1  EQU   PSASUPER                                                 01504000
PSASUP2  EQU   PSASUPER+1                                               01505000
PSASUP3  EQU   PSASUPER+2                                               01506000
PSASUP4  EQU   PSASUPER+3                                               01507000
PSACLHT  EQU   PSA+640                                                  01508000
PSALKSA  EQU   PSA+696                                                  01509000
PSAHLHI  EQU   PSA+760                                                  01510000
PSALITA  EQU   PSA+764                                                  01511000
PSADSSFL EQU   PSA+836                                                  01512000
PSADSSF1 EQU   PSADSSFL                                                 01513000
PSADSSF3 EQU   PSADSSFL+2                                               01514000
PSADSSF4 EQU   PSADSSFL+3                                               01515000
PSARSVT  EQU   PSA+896                                                  01516000
CVTMAP   EQU   0                                                        01517000
CVTDAR   EQU   CVTMAP+72                                                01518000
CVTFLGS1 EQU   CVTDAR                                                   01519000
CVTDCB   EQU   CVTMAP+116                                               01520000
CVTIOQET EQU   CVTMAP+120                                               01521000
CVTIERLC EQU   CVTMAP+144                                               01522000
CVTHEAD  EQU   CVTMAP+160                                               01523000
CVTSV76C EQU   CVTHEAD                                                  01524000
CVTOPTA  EQU   CVTMAP+182                                               01525000
CVTOPTB  EQU   CVTMAP+183                                               01526000
CVTGTF   EQU   CVTMAP+236                                               01527000
CVTGTFST EQU   CVTGTF                                                   01528000
CVTGTFS  EQU   CVTGTFST                                                 01529000
CVTSTATE EQU   CVTGTFST                                                 01530000
CVTTMODE EQU   CVTGTFST                                                 01531000
CVTFORM  EQU   CVTGTFST                                                 01532000
CVTAQAVT EQU   CVTMAP+240                                               01533000
CVTTCMFG EQU   CVTAQAVT                                                 01534000
CVTVOLM2 EQU   CVTMAP+244                                               01535000
CVTTATA  EQU   CVTVOLM2                                                 01536000
CVTTSKS  EQU   CVTTATA                                                  01537000
CVTVOLF2 EQU   CVTTSKS                                                  01538000
CVTTAT   EQU   CVTTATA+1                                                01539000
CVTATER  EQU   CVTMAP+248                                               01540000
CVTEXT1  EQU   CVTMAP+252                                               01541000
CVTPURG  EQU   CVTMAP+260                                               01542000
CVTQMSG  EQU   CVTMAP+268                                               01543000
CVTDMSR  EQU   CVTMAP+272                                               01544000
CVTRSV37 EQU   CVTDMSR                                                  01545000
CVTDMSRF EQU   CVTRSV37                                                 01546000
CVTERPV  EQU   CVTMAP+316                                               01547000
CVTINTLA EQU   CVTMAP+320                                               01548000
CVTAPF   EQU   CVTMAP+324                                               01549000
CVTEXT2  EQU   CVTMAP+328                                               01550000
CVTHJES  EQU   CVTMAP+332                                               01551000
CVTPGSIA EQU   CVTMAP+348                                               01552000
CVTA1F1  EQU   CVTMAP+356                                               01553000
CVTSYSK  EQU   CVTMAP+357                                               01554000
CVTVOLM1 EQU   CVTMAP+380                                               01555000
CVTVOLF1 EQU   CVTVOLM1                                                 01556000
CVTATMCT EQU   CVTMAP+388                                               01557000
CVTXTNT1 EQU   0                                                        01558000
CVTXTNT2 EQU   0                                                        01559000
CVTDSSV  EQU   CVTXTNT2                                                 01560000
CVTFLGBT EQU   CVTXTNT2+5                                               01561000
CVTQID   EQU   CVTXTNT2+24                                              01562000
CVTRV400 EQU   CVTXTNT2+52                                              01563000
CVTRV409 EQU   CVTXTNT2+53                                              01564000
CVTATCVT EQU   CVTXTNT2+64                                              01565000
CVTRV429 EQU   CVTXTNT2+84                                              01566000
CVTRV438 EQU   CVTXTNT2+85                                              01567000
CVTRV457 EQU   CVTXTNT2+112                                             01568000
CVTRV466 EQU   CVTXTNT2+113                                             01569000
CVTFIX   EQU   0                                                        01570000
CVTRELNO EQU   CVTFIX+252                                               01571000
TCBFIX   EQU   0                                                        01572000
TCBFRS   EQU   TCBFIX                                                   01573000
TCB      EQU   0                                                        01574000
TCBRBP   EQU   TCB                                                      01575000
TCBPIE   EQU   TCB+4                                                    01576000
TCBPMASK EQU   TCBPIE                                                   01577000
TCBPIEA  EQU   TCBPIE+1                                                 01578000
TCBCMP   EQU   TCB+16                                                   01579000
TCBCMPF  EQU   TCBCMP                                                   01580000
TCBCPP   EQU   TCBCMPF                                                  01581000
TCBSTCC  EQU   TCBCMPF                                                  01582000
TCBCDBL  EQU   TCBCMPF                                                  01583000
TCBCWTO  EQU   TCBCMPF                                                  01584000
TCBCIND  EQU   TCBCMPF                                                  01585000
TCBCMSG  EQU   TCBCMPF                                                  01586000
TCBTRN   EQU   TCB+20                                                   01587000
TCBABF   EQU   TCBTRN                                                   01588000
TCBMSS   EQU   TCB+24                                                   01589000
TCBPKF   EQU   TCB+28                                                   01590000
TCBFLGS  EQU   TCB+29                                                   01591000
TCBFLGS1 EQU   TCBFLGS                                                  01592000
TCBNONPR EQU   TCBFLGS1                                                 01593000
TCBFLGS2 EQU   TCBFLGS+1                                                01594000
TCBFLGS3 EQU   TCBFLGS+2                                                01595000
TCBFLGS4 EQU   TCBFLGS+3                                                01596000
TCBFLGS5 EQU   TCBFLGS+4                                                01597000
TCBABWF  EQU   TCBFLGS5                                                 01598000
TCBPNDSP EQU   TCBFLGS5                                                 01599000
TCBJPQ   EQU   TCB+44                                                   01600000
TCBPURGE EQU   TCBJPQ                                                   01601000
TCBGRS   EQU   TCB+48                                                   01602000
TCBGRS0  EQU   TCBGRS                                                   01603000
TCBGRS1  EQU   TCBGRS+4                                                 01604000
TCBGRS2  EQU   TCBGRS+8                                                 01605000
TCBGRS14 EQU   TCBGRS+56                                                01606000
TCBGRS15 EQU   TCBGRS+60                                                01607000
TCBFSA   EQU   TCB+112                                                  01608000
TCBTME   EQU   TCB+120                                                  01609000
TCBJSTCB EQU   TCB+124                                                  01610000
TCBTSFLG EQU   TCB+148                                                  01611000
TCBTSTSK EQU   TCBTSFLG                                                 01612000
TCBSTPPR EQU   TCBTSFLG                                                 01613000
TCBATT   EQU   TCBTSFLG                                                 01614000
TCBSTAB  EQU   TCB+160                                                  01615000
TCBNSTAE EQU   TCBSTAB                                                  01616000
TCBTCT   EQU   TCB+164                                                  01617000
TCBTCTGF EQU   TCBTCT                                                   01618000
TCBSCNDY EQU   TCB+172                                                  01619000
TCBNDSP  EQU   TCBSCNDY                                                 01620000
TCBNDSP1 EQU   TCBNDSP+1                                                01621000
TCBNDSP2 EQU   TCBNDSP+2                                                01622000
TCBSTPP  EQU   TCBNDSP2                                                 01623000
TCBNDSP3 EQU   TCBNDSP+3                                                01624000
TCBJSCB  EQU   TCB+180                                                  01625000
TCBRECDE EQU   TCBJSCB                                                  01626000
TCBEXT1  EQU   TCB+196                                                  01627000
TCBBITS  EQU   TCB+200                                                  01628000
TCBNDSP4 EQU   TCBBITS                                                  01629000
TCBNDSP5 EQU   TCBBITS+1                                                01630000
TCBFLGS6 EQU   TCBBITS+2                                                01631000
TCBFLGS7 EQU   TCBBITS+3                                                01632000
TCBDAR   EQU   TCB+204                                                  01633000
TCBDARC  EQU   TCBDAR                                                   01634000
TCBEXT2  EQU   TCB+208                                                  01635000
TCBXSCT  EQU   TCB+240                                                  01636000
TCBXSCT1 EQU   TCBXSCT                                                  01637000
TCBFOE   EQU   TCB+244                                                  01638000
TCBESTAE EQU   TCB+264                                                  01639000
TCBESTRM EQU   TCBESTAE+1                                               01640000
TCBFBYT1 EQU   TCB+276                                                  01641000
TCBEOT   EQU   TCBFBYT1                                                 01642000
TCBFBYT2 EQU   TCB+277                                                  01643000
TCBRV124 EQU   TCB+278                                                  01644000
TCBRV133 EQU   TCB+279                                                  01645000
TCBXTNT2 EQU   0                                                        01646000
TCBGTF   EQU   TCBXTNT2                                                 01647000
TCBTFLG  EQU   TCBGTF                                                   01648000
TCBRV146 EQU   TCBXTNT2+28                                              01649000
TCBRV155 EQU   TCBXTNT2+29                                              01650000
TCBRV164 EQU   TCBXTNT2+30                                              01651000
TCBRV173 EQU   TCBXTNT2+31                                              01652000
RBPRFX   EQU   0                                                        01653000
RBBASIC  EQU   0                                                        01654000
RBEXRTNM EQU   RBBASIC                                                  01655000
RBTMFLD  EQU   RBEXRTNM                                                 01656000
RBSTAB   EQU   RBBASIC+10                                               01657000
XSTAB    EQU   RBSTAB                                                   01658000
RBSTAB1  EQU   XSTAB                                                    01659000
XSTAB1   EQU   RBSTAB1                                                  01660000
RBFTCKPT EQU   XSTAB1                                                   01661000
RBSTAB2  EQU   XSTAB+1                                                  01662000
XSTAB2   EQU   RBSTAB2                                                  01663000
RBTCBNXT EQU   XSTAB2                                                   01664000
RBFACTV  EQU   XSTAB2                                                   01665000
RBFDYN   EQU   XSTAB2                                                   01666000
RBECBWT  EQU   XSTAB2                                                   01667000
RBOPSW   EQU   RBBASIC+16                                               01668000
XRBPSW   EQU   RBOPSW                                                   01669000
RBOPSWB2 EQU   XRBPSW+1                                                 01670000
RBLINK   EQU   RBBASIC+28                                               01671000
XRBLNK   EQU   RBLINK                                                   01672000
RBWCF    EQU   XRBLNK                                                   01673000
RBLINKB  EQU   XRBLNK+1                                                 01674000
RBGRSAVE EQU   RBBASIC+32                                               01675000
XRBREG   EQU   RBGRSAVE                                                 01676000
RBGRS0   EQU   XRBREG                                                   01677000
RBGRS1   EQU   XRBREG+4                                                 01678000
RBGRS2   EQU   XRBREG+8                                                 01679000
RBGRS3   EQU   XRBREG+12                                                01680000
RBGRS4   EQU   XRBREG+16                                                01681000
RBGRS5   EQU   XRBREG+20                                                01682000
RBGRS6   EQU   XRBREG+24                                                01683000
RBGRS7   EQU   XRBREG+28                                                01684000
RBGRS8   EQU   XRBREG+32                                                01685000
RBGRS9   EQU   XRBREG+36                                                01686000
RBGRS10  EQU   XRBREG+40                                                01687000
RBGRS11  EQU   XRBREG+44                                                01688000
RBGRS12  EQU   XRBREG+48                                                01689000
RBGRS13  EQU   XRBREG+52                                                01690000
RBGRS14  EQU   XRBREG+56                                                01691000
RBGRS15  EQU   XRBREG+60                                                01692000
XRBESA   EQU   RBBASIC+96                                               01693000
RBPREFIX EQU   0                                                        01694000
RBRSV019 EQU   RBPREFIX+14                                              01695000
RBRSV028 EQU   RBPREFIX+15                                              01696000
RBRSV041 EQU   RBPREFIX+27                                              01697000
RBPRFXST EQU   RBPREFIX+32                                              01698000
RBRSV054 EQU   RBPREFIX+39                                              01699000
RBRTOPSW EQU   RBPREFIX+40                                              01700000
RBRTPSW2 EQU   RBRTOPSW+8                                               01701000
RBRTICIL EQU   RBRTPSW2                                                 01702000
RBFLAGS1 EQU   RBPREFIX+56                                              01703000
RBSCB    EQU   RBFLAGS1                                                 01704000
RBINTCDA EQU   RBPREFIX+61                                              01705000
RBSECT   EQU   0                                                        01706000
RBPPSAV  EQU   RBSECT                                                   01707000
RBPPSAV1 EQU   RBPPSAV+1                                                01708000
RBSIZE   EQU   RBSECT+8                                                 01709000
@NM00018 EQU   RBSECT+10                                                01710000
@NM00019 EQU   @NM00018                                                 01711000
RBFTP    EQU   @NM00019                                                 01712000
RBTRSVRB EQU   @NM00019                                                 01713000
RBATNXIT EQU   @NM00019                                                 01714000
@NM00021 EQU   @NM00018+1                                               01715000
RBATTN   EQU   @NM00021                                                 01716000
RBETXR   EQU   @NM00021                                                 01717000
RBIQETP  EQU   @NM00021                                                 01718000
RBEP     EQU   RBSECT+12                                                01719000
RBPGMQ   EQU   RBSECT+24                                                01720000
@NM00028 EQU   RBSECT+28                                                01721000
@NM00029 EQU   @NM00028                                                 01722000
IRBEND   EQU   RBSECT+96                                                01723000
@NM00032 EQU   RBSECT+96                                                01724000
RBRSV138 EQU   @NM00032+7                                               01725000
RBSCBB   EQU   RBSECT+144                                               01726000
RBSPARM  EQU   RBSCBB+8                                                 01727000
RBSFLGS1 EQU   RBSPARM                                                  01728000
RBSIOPRC EQU   RBSFLGS1                                                 01729000
RBSOWNR  EQU   RBSCBB+12                                                01730000
RBSFLGS2 EQU   RBSOWNR                                                  01731000
RBSDATA  EQU   RBSCBB+16                                                01732000
RBSFLG3  EQU   RBSDATA                                                  01733000
RBRSV150 EQU   RBSECT+167                                               01734000
IQESECT  EQU   0                                                        01735000
IQELNK   EQU   IQESECT                                                  01736000
IQELNKA  EQU   IQELNK+1                                                 01737000
IQEIRB   EQU   IQESECT+8                                                01738000
IQEFLAGS EQU   IQEIRB                                                   01739000
IQETCB   EQU   IQESECT+12                                               01740000
SCA      EQU   0                                                        01741000
SCAPIE   EQU   SCA                                                      01742000
PIE      EQU   0                                                        01743000
PIEPICA  EQU   PIE                                                      01744000
PIEFLGS  EQU   PIEPICA                                                  01745000
PIENOPI  EQU   PIEFLGS                                                  01746000
PIEPICAA EQU   PIEPICA+1                                                01747000
PIEPSW   EQU   PIE+4                                                    01748000
PIEGR14  EQU   PIE+12                                                   01749000
PIEGR0   EQU   PIE+20                                                   01750000
MBCB     EQU   0                                                        01751000
MBCBMAIN EQU   MBCB                                                     01752000
MBCBID   EQU   MBCBMAIN                                                 01753000
MBCBLINK EQU   MBCBMAIN+4                                               01754000
ASCB     EQU   0                                                        01755000
ASCBSUPC EQU   ASCB+16                                                  01756000
ASCBSVRB EQU   ASCBSUPC                                                 01757000
ASCBSYNC EQU   ASCBSUPC+4                                               01758000
ASCBRSM  EQU   ASCB+52                                                  01759000
ASCBRSMF EQU   ASCBRSM                                                  01760000
ASCBFW1  EQU   ASCB+100                                                 01761000
ASCBRCTF EQU   ASCBFW1+2                                                01762000
ASCBFLG1 EQU   ASCBFW1+3                                                01763000
ASCBTYP1 EQU   ASCBFLG1                                                 01764000
ASCBASXB EQU   ASCB+108                                                 01765000
ASCBDSP1 EQU   ASCB+114                                                 01766000
ASCBFLG2 EQU   ASCB+115                                                 01767000
ASCBTCBS EQU   ASCB+124                                                 01768000
ASCBLKGP EQU   ASCB+128                                                 01769000
ASCBSRQ  EQU   ASCB+180                                                 01770000
ASCBSRQ1 EQU   ASCBSRQ                                                  01771000
ASCBSRQ2 EQU   ASCBSRQ+1                                                01772000
ASCBSRQ3 EQU   ASCBSRQ+2                                                01773000
ASCBSRQ4 EQU   ASCBSRQ+3                                                01774000
ASXB     EQU   0                                                        01775000
ASXBSPSA EQU   ASXB+112                                                 01776000
ASXBAEQ  EQU   ASXB+168                                                 01777000
ASXBSECR EQU   ASXB+199                                                 01778000
ASCBSFLG EQU   ASXBSECR                                                 01779000
ASXBCASW EQU   ASXB+216                                                 01780000
ASXBCRB1 EQU   ASXBCASW                                                 01781000
WSAL     EQU   0                                                        01782000
WSALEXIT EQU   WSAL+28                                                  01783000
WORDS3   EQU   0                                                        01784000
WORDS13  EQU   0                                                        01785000
WORDS2   EQU   0                                                        01786000
PROLOGUE EQU   0                                                        01787000
SPET     EQU   0                                                        01788000
SCBPURGE EQU   0                                                        01789000
ATTNEPLG EQU   0                                                        01790000
DETACH   EQU   0                                                        01791000
IQEEND   EQU   0                                                        01792000
CVTS01   EQU   CVTPGSIA                                                 01793000
CVTLPDIA EQU   CVTS01+12                                                01794000
CVTDIRST EQU   CVTLPDIA                                                 01795000
CVTSLIDA EQU   CVTS01+24                                                01796000
CVTCTLFG EQU   CVTS01+50                                                01797000
CVTCRMN  EQU   CVTS01+156                                               01798000
CVTQSAS  EQU   CVTS01+164                                               01799000
CVTSTXU  EQU   CVTS01+184                                               01800000
CVTSCBP  EQU   CVTS01+236                                               01801000
CVTEXPRO EQU   CVTS01+260                                               01802000
CVT062R1 EQU   CVTS01+324                                               01803000
CVTRV210 EQU   CVTS01+424                                               01804000
CVTRV219 EQU   CVTS01+425                                               01805000
CVTRV228 EQU   CVTS01+426                                               01806000
CVTRV237 EQU   CVTS01+427                                               01807000
CVTMFRTR EQU   CVTS01+452                                               01808000
CVTRV262 EQU   CVTS01+468                                               01809000
CVTRV271 EQU   CVTS01+469                                               01810000
CVTRV280 EQU   CVTS01+470                                               01811000
CVTRV289 EQU   CVTS01+471                                               01812000
CVTEXP1  EQU   CVTS01+572                                               01813000
CVTGSDA  EQU   CVTS01+600                                               01814000
RBSECS03 EQU   RBEP                                                     01815000
RBCDE    EQU   RBSECS03                                                 01816000
RBCDFLGS EQU   RBCDE                                                    01817000
RBNOCELL EQU   RBCDFLGS                                                 01818000
RBCDSAVE EQU   RBCDFLGS                                                 01819000
RBCDSYNC EQU   RBCDFLGS                                                 01820000
RBSECS05 EQU   RBPGMQ                                                   01821000
RBSQE    EQU   RBSECS05                                                 01822000
RBSECS06 EQU   RBPGMQ                                                   01823000
RBIQE    EQU   RBSECS06                                                 01824000
RBUSE    EQU   RBIQE                                                    01825000
RBIQE1   EQU   RBIQE+1                                                  01826000
RBSECS07 EQU   RBPGMQ                                                   01827000
RBIQE2   EQU   RBSECS07                                                 01828000
RBSECS08 EQU   IRBEND                                                   01829000
RBNEXAV  EQU   RBSECS08                                                 01830000
RBIQEWRK EQU   RBSECS08+4                                               01831000
RBSECS09 EQU   IRBEND                                                   01832000
PSARSVTE EQU   PSARSVT                                                  01833000
PSWBC    EQU   PIEPSW                                                   01834000
PSWBCRH  EQU   PSWBC+4                                                  01835000
PSWBCB   EQU   PSWBCRH                                                  01836000
PSWBCIA  EQU   PSWBCRH+1                                                01837000
PSWEC    EQU   RBOPSW                                                   01838000
PSWECB   EQU   PSWEC+2                                                  01839000
PSWECZ   EQU   PSWECB                                                   01840000
PSWECIA  EQU   PSWEC+4                                                  01841000
FLC      EQU   PSA                                                      01842000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01843000
@NM00068 EQU   PSWEC+3                                                  01844000
PSWECPM  EQU   PSWECB                                                   01845000
PSWECCC  EQU   PSWECB                                                   01846000
@NM00067 EQU   PSWEC                                                    01847000
PSWBCPM  EQU   PSWBCB                                                   01848000
PSWBCCC  EQU   PSWBCB                                                   01849000
PSWBCILC EQU   PSWBCB                                                   01850000
@NM00066 EQU   PSWBC                                                    01851000
PSARSAV  EQU   PSARSVTE+60                                              01852000
PSARSTK  EQU   PSARSVTE+56                                              01853000
PSAESAV3 EQU   PSARSVTE+52                                              01854000
PSAESTK3 EQU   PSARSVTE+48                                              01855000
PSAESAV2 EQU   PSARSVTE+44                                              01856000
PSAESTK2 EQU   PSARSVTE+40                                              01857000
PSAESAV1 EQU   PSARSVTE+36                                              01858000
PSAESTK1 EQU   PSARSVTE+32                                              01859000
PSAPSAV  EQU   PSARSVTE+28                                              01860000
PSAPSTK  EQU   PSARSVTE+24                                              01861000
PSAMSAV  EQU   PSARSVTE+20                                              01862000
PSAMSTK  EQU   PSARSVTE+16                                              01863000
PSASSAV  EQU   PSARSVTE+12                                              01864000
PSASSTK  EQU   PSARSVTE+8                                               01865000
PSANSTK  EQU   PSARSVTE+4                                               01866000
PSACSTK  EQU   PSARSVTE                                                 01867000
RBRSV161 EQU   RBSECS09+64                                              01868000
RBSIRBWA EQU   RBSECS09                                                 01869000
RBIQEA   EQU   RBIQE2                                                   01870000
RBSQEA   EQU   RBSQE+1                                                  01871000
@NM00033 EQU   RBSQE                                                    01872000
RBCDE1   EQU   RBCDE+1                                                  01873000
RBCDLOAD EQU   RBCDFLGS                                                 01874000
RBCDXCTL EQU   RBCDFLGS                                                 01875000
RBCDNODE EQU   RBCDFLGS                                                 01876000
RBCDATCH EQU   RBCDFLGS                                                 01877000
RBRSV009 EQU   RBCDFLGS                                                 01878000
CVTRV628 EQU   CVTS01+728                                               01879000
CVTRV627 EQU   CVTS01+724                                               01880000
CVTRV626 EQU   CVTS01+720                                               01881000
CVTRV625 EQU   CVTS01+716                                               01882000
CVTRV624 EQU   CVTS01+712                                               01883000
CVTRV623 EQU   CVTS01+708                                               01884000
CVTRV622 EQU   CVTS01+704                                               01885000
CVTRV621 EQU   CVTS01+700                                               01886000
CVTIHASU EQU   CVTS01+696                                               01887000
CVTSUSP  EQU   CVTS01+692                                               01888000
CVTT6SVC EQU   CVTS01+688                                               01889000
CVTCDAL  EQU   CVTS01+684                                               01890000
CVTTCTL  EQU   CVTS01+680                                               01891000
CVTRSUME EQU   CVTS01+676                                               01892000
CVTJTERM EQU   CVTS01+672                                               01893000
CVTASMRM EQU   CVTS01+668                                               01894000
CVTTCASP EQU   CVTS01+664                                               01895000
CVT0PT03 EQU   CVTS01+660                                               01896000
CVT0PT0E EQU   CVTS01+656                                               01897000
CVTRV609 EQU   CVTS01+652                                               01898000
CVTCGK   EQU   CVTS01+648                                               01899000
CVTRAC   EQU   CVTS01+644                                               01900000
CVTHSM   EQU   CVTS01+640                                               01901000
CVTRV605 EQU   CVTS01+636                                               01902000
CVTRV604 EQU   CVTS01+632                                               01903000
CVTEFF02 EQU   CVTS01+628                                               01904000
CVTCBBR  EQU   CVTS01+624                                               01905000
CVTSSCR  EQU   CVTS01+620                                               01906000
CVTEVENT EQU   CVTS01+616                                               01907000
CVTCRCA  EQU   CVTS01+612                                               01908000
CVTTPIO  EQU   CVTS01+608                                               01909000
CVTADV   EQU   CVTS01+604                                               01910000
CVTGSDAB EQU   CVTGSDA                                                  01911000
CVTQV3   EQU   CVTS01+596                                               01912000
CVTQV2   EQU   CVTS01+592                                               01913000
CVTQV1   EQU   CVTS01+588                                               01914000
CVTRPT   EQU   CVTS01+584                                               01915000
CVTSSRB  EQU   CVTS01+580                                               01916000
CVTCSDRL EQU   CVTS01+576                                               01917000
CVTRMPMT EQU   CVTS01+568                                               01918000
CVTRMPTT EQU   CVTS01+564                                               01919000
CVTVPSA  EQU   CVTS01+560                                               01920000
CVTVSTOP EQU   CVTS01+556                                               01921000
CVTGTFR8 EQU   CVTS01+552                                               01922000
CVTQUIT  EQU   CVTS01+548                                               01923000
CVTVACR  EQU   CVTS01+544                                               01924000
CVTWTCB  EQU   CVTS01+540                                               01925000
CVTSTPRS EQU   CVTS01+536                                               01926000
CVT0PT02 EQU   CVTS01+532                                               01927000
CVTDARCM EQU   CVTS01+528                                               01928000
CVTIRECM EQU   CVTS01+524                                               01929000
CVTJRECM EQU   CVTS01+520                                               01930000
CVTVEMS0 EQU   CVTS01+516                                               01931000
CVTSPFRR EQU   CVTS01+512                                               01932000
CVTRLSTG EQU   CVTS01+508                                               01933000
CVT0TC0A EQU   CVTS01+504                                               01934000
CVTGMBR  EQU   CVTS01+500                                               01935000
CVTLFRM  EQU   CVTS01+496                                               01936000
CVTRMBR  EQU   CVTS01+492                                               01937000
CVTVIOP  EQU   CVTS01+488                                               01938000
CVTRV307 EQU   CVTS01+486                                               01939000
CVTRV306 EQU   CVTS01+484                                               01940000
CVTRV305 EQU   CVTS01+482                                               01941000
CVTRV304 EQU   CVTS01+480                                               01942000
CVTRV303 EQU   CVTS01+478                                               01943000
CVTRV302 EQU   CVTS01+476                                               01944000
CVTTRCA  EQU   CVTS01+472                                               01945000
CVTRV297 EQU   CVTRV289                                                 01946000
CVTRV296 EQU   CVTRV289                                                 01947000
CVTRV295 EQU   CVTRV289                                                 01948000
CVTRV294 EQU   CVTRV289                                                 01949000
CVTRV293 EQU   CVTRV289                                                 01950000
CVTRV292 EQU   CVTRV289                                                 01951000
CVTRV291 EQU   CVTRV289                                                 01952000
CVTRV290 EQU   CVTRV289                                                 01953000
CVTRV288 EQU   CVTRV280                                                 01954000
CVTRV287 EQU   CVTRV280                                                 01955000
CVTRV286 EQU   CVTRV280                                                 01956000
CVTRV285 EQU   CVTRV280                                                 01957000
CVTRV284 EQU   CVTRV280                                                 01958000
CVTRV283 EQU   CVTRV280                                                 01959000
CVTRV282 EQU   CVTRV280                                                 01960000
CVTRV281 EQU   CVTRV280                                                 01961000
CVTRV279 EQU   CVTRV271                                                 01962000
CVTRV278 EQU   CVTRV271                                                 01963000
CVTRV277 EQU   CVTRV271                                                 01964000
CVTRV276 EQU   CVTRV271                                                 01965000
CVTRV275 EQU   CVTRV271                                                 01966000
CVTRV274 EQU   CVTRV271                                                 01967000
CVTRV273 EQU   CVTRV271                                                 01968000
CVTRV272 EQU   CVTRV271                                                 01969000
CVTRV270 EQU   CVTRV262                                                 01970000
CVTRV269 EQU   CVTRV262                                                 01971000
CVTRV268 EQU   CVTRV262                                                 01972000
CVTRV267 EQU   CVTRV262                                                 01973000
CVTRV266 EQU   CVTRV262                                                 01974000
CVTRV265 EQU   CVTRV262                                                 01975000
CVTRV264 EQU   CVTRV262                                                 01976000
CVTRV263 EQU   CVTRV262                                                 01977000
CVTVFP   EQU   CVTS01+464                                               01978000
CVTVSI   EQU   CVTS01+460                                               01979000
CVTVPSIB EQU   CVTS01+456                                               01980000
CVTMFACT EQU   CVTMFRTR                                                 01981000
CVTMFCTL EQU   CVTS01+448                                               01982000
CVTPVBP  EQU   CVTS01+444                                               01983000
CVTPWI   EQU   CVTS01+440                                               01984000
CVTRV254 EQU   CVTS01+438                                               01985000
CVTRV253 EQU   CVTS01+436                                               01986000
CVTRV252 EQU   CVTS01+434                                               01987000
CVTRV251 EQU   CVTS01+433                                               01988000
CVTRV250 EQU   CVTS01+432                                               01989000
CVTRV249 EQU   CVTS01+431                                               01990000
CVTRV248 EQU   CVTS01+430                                               01991000
CVTRV247 EQU   CVTS01+429                                               01992000
CVTRV246 EQU   CVTS01+428                                               01993000
CVTRV245 EQU   CVTRV237                                                 01994000
CVTRV244 EQU   CVTRV237                                                 01995000
CVTRV243 EQU   CVTRV237                                                 01996000
CVTRV242 EQU   CVTRV237                                                 01997000
CVTRV241 EQU   CVTRV237                                                 01998000
CVTRV240 EQU   CVTRV237                                                 01999000
CVTRV239 EQU   CVTRV237                                                 02000000
CVTRV238 EQU   CVTRV237                                                 02001000
CVTRV236 EQU   CVTRV228                                                 02002000
CVTRV235 EQU   CVTRV228                                                 02003000
CVTRV234 EQU   CVTRV228                                                 02004000
CVTRV233 EQU   CVTRV228                                                 02005000
CVTRV232 EQU   CVTRV228                                                 02006000
CVTRV231 EQU   CVTRV228                                                 02007000
CVTRV230 EQU   CVTRV228                                                 02008000
CVTRV229 EQU   CVTRV228                                                 02009000
CVTRV227 EQU   CVTRV219                                                 02010000
CVTRV226 EQU   CVTRV219                                                 02011000
CVTRV225 EQU   CVTRV219                                                 02012000
CVTRV224 EQU   CVTRV219                                                 02013000
CVTRV223 EQU   CVTRV219                                                 02014000
CVTRV222 EQU   CVTRV219                                                 02015000
CVTRV221 EQU   CVTRV219                                                 02016000
CVTRV220 EQU   CVTRV219                                                 02017000
CVTRV218 EQU   CVTRV210                                                 02018000
CVTRV217 EQU   CVTRV210                                                 02019000
CVTRV216 EQU   CVTRV210                                                 02020000
CVTRV215 EQU   CVTRV210                                                 02021000
CVTRV214 EQU   CVTRV210                                                 02022000
CVTRV213 EQU   CVTRV210                                                 02023000
CVTRV212 EQU   CVTRV210                                                 02024000
CVTRV211 EQU   CVTRV210                                                 02025000
CVTLCCAT EQU   CVTS01+420                                               02026000
CVTPCCAT EQU   CVTS01+416                                               02027000
CVTIPCRP EQU   CVTS01+412                                               02028000
CVTIPCRI EQU   CVTS01+408                                               02029000
CVTIPCDS EQU   CVTS01+404                                               02030000
CVTAIDVT EQU   CVTS01+400                                               02031000
CVTSSAP  EQU   CVTS01+396                                               02032000
CVTEHCIR EQU   CVTS01+392                                               02033000
CVTEHDEF EQU   CVTS01+388                                               02034000
CVTDAIR  EQU   CVTS01+384                                               02035000
CVTPERFM EQU   CVTS01+380                                               02036000
CVT044R2 EQU   CVTS01+376                                               02037000
CVTFETCH EQU   CVTS01+372                                               02038000
CVTRSTWD EQU   CVTS01+368                                               02039000
CVTSPOST EQU   CVTS01+364                                               02040000
CVTIOBP  EQU   CVTS01+360                                               02041000
CVTASMVT EQU   CVTS01+356                                               02042000
CVTRECRQ EQU   CVTS01+352                                               02043000
CVTWSAC  EQU   CVTS01+348                                               02044000
CVTRV149 EQU   CVTS01+344                                               02045000
CVTWSAL  EQU   CVTS01+340                                               02046000
CVTSPSA  EQU   CVTS01+336                                               02047000
CVTGLMN  EQU   CVTS01+332                                               02048000
CVTVEAC0 EQU   CVTS01+328                                               02049000
CVTRPOST EQU   CVTS01+320                                               02050000
CVTDQIQE EQU   CVTS01+316                                               02051000
CVTCSD   EQU   CVTS01+312                                               02052000
CVTLKRMA EQU   CVTS01+308                                               02053000
CVTRSPIE EQU   CVTS01+304                                               02054000
CVTRENQ  EQU   CVTS01+300                                               02055000
CVTLQCB  EQU   CVTS01+296                                               02056000
CVTFQCB  EQU   CVTS01+292                                               02057000
CVTQCS01 EQU   CVTS01+288                                               02058000
CVTAPFT  EQU   CVTS01+284                                               02059000
CVTPARRL EQU   CVTS01+280                                               02060000
CVTVWAIT EQU   CVTS01+276                                               02061000
CVTGSPL  EQU   CVTS01+272                                               02062000
CVTLSMQ  EQU   CVTS01+268                                               02063000
CVTGSMQ  EQU   CVTS01+264                                               02064000
CVTOPCTP EQU   CVTS01+256                                               02065000
CVTSIC   EQU   CVTS01+252                                               02066000
CVTTPIOS EQU   CVTS01+248                                               02067000
CVTRTMS  EQU   CVTS01+244                                               02068000
CVTSDBF  EQU   CVTS01+240                                               02069000
CVTSDMP  EQU   CVTS01+232                                               02070000
CVTSV60  EQU   CVTS01+228                                               02071000
CVTRTMCT EQU   CVTS01+224                                               02072000
CVTASCBL EQU   CVTS01+220                                               02073000
CVTASCBH EQU   CVTS01+216                                               02074000
CVTGDA   EQU   CVTS01+212                                               02075000
CVTASVT  EQU   CVTS01+208                                               02076000
CVTVVMDI EQU   CVTS01+204                                               02077000
CVTAQTOP EQU   CVTS01+200                                               02078000
CVTIOSCS EQU   CVTS01+196                                               02079000
CVTSDRM  EQU   CVTS01+192                                               02080000
CVTOPTE  EQU   CVTS01+188                                               02081000
CVTQUIS  EQU   CVTS01+180                                               02082000
CVTPARS  EQU   CVTS01+176                                               02083000
CVTS1EE  EQU   CVTS01+172                                               02084000
CVTFRAS  EQU   CVTS01+168                                               02085000
CVTCRAS  EQU   CVTS01+160                                               02086000
CVTDELCP EQU   CVTS01+152                                               02087000
CVTFRECL EQU   CVTS01+148                                               02088000
CVTGETCL EQU   CVTS01+144                                               02089000
CVTBLDCP EQU   CVTS01+140                                               02090000
CVTAUTHL EQU   CVTS01+136                                               02091000
CVTSCAN  EQU   CVTS01+132                                               02092000
CVTRV144 EQU   CVTS01+130                                               02093000
CVTMAXMP EQU   CVTS01+128                                               02094000
CVTSTCK  EQU   CVTS01+124                                               02095000
CVTRV139 EQU   CVTS01+123                                               02096000
CVTDSSAC EQU   CVTS01+122                                               02097000
CVTRV513 EQU   CVTS01+121                                               02098000
CVTIOSPL EQU   CVTS01+120                                               02099000
CVTPTGT  EQU   CVTS01+116                                               02100000
CVTCSPIE EQU   CVTS01+112                                               02101000
CVTSMFEX EQU   CVTS01+108                                               02102000
CVTOLT0A EQU   CVTS01+104                                               02103000
CVTSRBRT EQU   CVTS01+100                                               02104000
CVTPUTL  EQU   CVTS01+96                                                02105000
CVTASCRL EQU   CVTS01+92                                                02106000
CVTASCRF EQU   CVTS01+88                                                02107000
CVTRV326 EQU   CVTS01+84                                                02108000
CVTRV325 EQU   CVTS01+80                                                02109000
CVTRV324 EQU   CVTS01+76                                                02110000
CVT0VL01 EQU   CVTS01+72                                                02111000
CVTSHRVM EQU   CVTS01+68                                                02112000
CVTRV332 EQU   CVTS01+64                                                02113000
CVTTAS   EQU   CVTS01+60                                                02114000
CVTRSCN  EQU   CVTS01+56                                                02115000
CVTTRAC2 EQU   CVTS01+54                                                02116000
CVTTRACE EQU   CVTS01+52                                                02117000
CVTAPG   EQU   CVTS01+51                                                02118000
CVTSDTRC EQU   CVTCTLFG                                                 02119000
CVTGTRCE EQU   CVTCTLFG                                                 02120000
CVTNOMP  EQU   CVTCTLFG                                                 02121000
CVTRSV79 EQU   CVTCTLFG                                                 02122000
CVTDSTAT EQU   CVTCTLFG                                                 02123000
CVTRSV78 EQU   CVTCTLFG                                                 02124000
CVTRV333 EQU   CVTCTLFG                                                 02125000
CVTRV323 EQU   CVTCTLFG                                                 02126000
CVTSPVLK EQU   CVTS01+49                                                02127000
CVTRSV77 EQU   CVTS01+48                                                02128000
CVTRV331 EQU   CVTS01+44                                                02129000
CVTRV330 EQU   CVTS01+40                                                02130000
CVTRV329 EQU   CVTS01+36                                                02131000
CVTRV328 EQU   CVTS01+32                                                02132000
CVTRV322 EQU   CVTS01+28                                                02133000
CVTSLID  EQU   CVTSLIDA+1                                               02134000
CVTSYLK  EQU   CVTSLIDA                                                 02135000
CVTRV321 EQU   CVTS01+20                                                02136000
CVTRV320 EQU   CVTS01+16                                                02137000
CVTLPDIR EQU   CVTLPDIA+1                                               02138000
CVTRSV69 EQU   CVTDIRST                                                 02139000
CVTRSV68 EQU   CVTDIRST                                                 02140000
CVTRSV67 EQU   CVTDIRST                                                 02141000
CVTRSV66 EQU   CVTDIRST                                                 02142000
CVTRSV65 EQU   CVTDIRST                                                 02143000
CVTRSV64 EQU   CVTDIRST                                                 02144000
CVTRSV63 EQU   CVTDIRST                                                 02145000
CVTDICOM EQU   CVTDIRST                                                 02146000
CVTPVTP  EQU   CVTS01+8                                                 02147000
CVTLPDSR EQU   CVTS01+4                                                 02148000
CVTGETL  EQU   CVTS01                                                   02149000
WSALACHP EQU   WSAL+56                                                  02150000
WSALRSM  EQU   WSAL+52                                                  02151000
WSALEVNT EQU   WSAL+48                                                  02152000
WSALSTAE EQU   WSAL+44                                                  02153000
WSALSTAT EQU   WSAL+40                                                  02154000
WSALWAIT EQU   WSAL+36                                                  02155000
WSALPOST EQU   WSAL+32                                                  02156000
WSALS2EE EQU   WSAL+24                                                  02157000
WSALCIRB EQU   WSAL+20                                                  02158000
WSALABTM EQU   WSAL+16                                                  02159000
WSALSDMP EQU   WSAL+12                                                  02160000
WSALRTM2 EQU   WSAL+8                                                   02161000
WSALVALC EQU   WSAL+4                                                   02162000
WSALCWSA EQU   WSAL                                                     02163000
ASXBEND  EQU   ASXB+232                                                 02164000
ASXBRV25 EQU   ASXB+228                                                 02165000
ASXBRV24 EQU   ASXB+224                                                 02166000
ASXBPT0E EQU   ASXB+220                                                 02167000
ASXBCRB4 EQU   ASXBCASW+3                                               02168000
ASXBCRB3 EQU   ASXBCASW+2                                               02169000
ASXBCRB2 EQU   ASXBCASW+1                                               02170000
ASXBCR06 EQU   ASXBCRB1                                                 02171000
ASXBCR05 EQU   ASXBCRB1                                                 02172000
ASXBCR04 EQU   ASXBCRB1                                                 02173000
ASXBCR03 EQU   ASXBCRB1                                                 02174000
ASXBCR02 EQU   ASXBCRB1                                                 02175000
ASXBCR01 EQU   ASXBCRB1                                                 02176000
ASXBTFD  EQU   ASXBCRB1                                                 02177000
ASXBPIP  EQU   ASXBCRB1                                                 02178000
ASXBCTDC EQU   ASXB+212                                                 02179000
ASXBTDCB EQU   ASXB+208                                                 02180000
ASXBRV19 EQU   ASXB+204                                                 02181000
ASXBSENV EQU   ASXBSECR+1                                               02182000
ASXBRV34 EQU   ASCBSFLG                                                 02183000
ASXBRV33 EQU   ASCBSFLG                                                 02184000
ASXBRV32 EQU   ASCBSFLG                                                 02185000
ASXBRV31 EQU   ASCBSFLG                                                 02186000
ASXBRV30 EQU   ASCBSFLG                                                 02187000
ASXBRV29 EQU   ASCBSFLG                                                 02188000
ASXBRV28 EQU   ASCBSFLG                                                 02189000
ASXBRV27 EQU   ASCBSFLG                                                 02190000
ASXBUSER EQU   ASXB+192                                                 02191000
ASXBLSRB EQU   ASXBAEQ+20                                               02192000
ASXBFSRB EQU   ASXBAEQ+16                                               02193000
ASXBLRQE EQU   ASXBAEQ+12                                               02194000
ASXBFRQE EQU   ASXBAEQ+8                                                02195000
ASXBLIQE EQU   ASXBAEQ+4                                                02196000
ASXBFIQE EQU   ASXBAEQ                                                  02197000
ASXBETSK EQU   ASXB+164                                                 02198000
ASXBSIRB EQU   ASXB+160                                                 02199000
ASXBPSWD EQU   ASXB+152                                                 02200000
ASXBPRG  EQU   ASXB+136                                                 02201000
ASXBRV26 EQU   ASXB+132                                                 02202000
ASXBOUSB EQU   ASXB+128                                                 02203000
ASXBDDR  EQU   ASXB+124                                                 02204000
ASXBRCTD EQU   ASXB+120                                                 02205000
ASXBRSMD EQU   ASXB+116                                                 02206000
ASXBFRWA EQU   ASXB+108                                                 02207000
ASXBFLSA EQU   ASXB+36                                                  02208000
ASXBIHSA EQU   ASXB+32                                                  02209000
ASXBRV15 EQU   ASXB+28                                                  02210000
ASXBRV14 EQU   ASXB+24                                                  02211000
ASXBLWA  EQU   ASXB+20                                                  02212000
ASXBMPST EQU   ASXB+16                                                  02213000
ASXBRS00 EQU   ASXB+14                                                  02214000
ASXBTCBS EQU   ASXB+12                                                  02215000
ASXBLTCB EQU   ASXB+8                                                   02216000
ASXBFTCB EQU   ASXB+4                                                   02217000
ASXBASXB EQU   ASXB                                                     02218000
ASXBEGIN EQU   ASXB                                                     02219000
ASCBEND  EQU   ASCB+208                                                 02220000
ASCBSRBT EQU   ASCB+200                                                 02221000
ASCBSWTL EQU   ASCB+196                                                 02222000
ASCBRS14 EQU   ASCB+195                                                 02223000
ASCBSMCT EQU   ASCB+194                                                 02224000
ASCBRS12 EQU   ASCB+192                                                 02225000
ASCBPCTT EQU   ASCB+188                                                 02226000
ASCBVGTT EQU   ASCB+184                                                 02227000
ASCBRV43 EQU   ASCBSRQ4                                                 02228000
ASCBRV42 EQU   ASCBSRQ4                                                 02229000
ASCBRV41 EQU   ASCBSRQ4                                                 02230000
ASCBRV40 EQU   ASCBSRQ4                                                 02231000
ASCBRV39 EQU   ASCBSRQ4                                                 02232000
ASCBRV38 EQU   ASCBSRQ4                                                 02233000
ASCBRV37 EQU   ASCBSRQ4                                                 02234000
ASCBRV36 EQU   ASCBSRQ4                                                 02235000
ASCBRV35 EQU   ASCBSRQ3                                                 02236000
ASCBRV34 EQU   ASCBSRQ3                                                 02237000
ASCBRV33 EQU   ASCBSRQ3                                                 02238000
ASCBRV32 EQU   ASCBSRQ3                                                 02239000
ASCBRV31 EQU   ASCBSRQ3                                                 02240000
ASCBRV30 EQU   ASCBSRQ3                                                 02241000
ASCBRV29 EQU   ASCBSRQ3                                                 02242000
ASCBRV28 EQU   ASCBSRQ3                                                 02243000
ASCBRV27 EQU   ASCBSRQ2                                                 02244000
ASCBRV26 EQU   ASCBSRQ2                                                 02245000
ASCBRV25 EQU   ASCBSRQ2                                                 02246000
ASCBRV24 EQU   ASCBSRQ2                                                 02247000
ASCBRV23 EQU   ASCBSRQ2                                                 02248000
ASCBRV22 EQU   ASCBSRQ2                                                 02249000
ASCBRV21 EQU   ASCBSRQ2                                                 02250000
ASCBRV20 EQU   ASCBSRQ2                                                 02251000
ASCBRV19 EQU   ASCBSRQ1                                                 02252000
ASCBRV18 EQU   ASCBSRQ1                                                 02253000
ASCBRV17 EQU   ASCBSRQ1                                                 02254000
ASCBRV16 EQU   ASCBSRQ1                                                 02255000
ASCBRV15 EQU   ASCBSRQ1                                                 02256000
ASCBRV14 EQU   ASCBSRQ1                                                 02257000
ASCBRV13 EQU   ASCBSRQ1                                                 02258000
ASCBSTA  EQU   ASCBSRQ1                                                 02259000
ASCBJBNS EQU   ASCB+176                                                 02260000
ASCBJBNI EQU   ASCB+172                                                 02261000
ASCBMCC  EQU   ASCB+168                                                 02262000
ASCBRTWA EQU   ASCB+164                                                 02263000
ASCBIQEA EQU   ASCB+160                                                 02264000
ASCBXMPQ EQU   ASCB+156                                                 02265000
ASCBRS01 EQU   ASCB+154                                                 02266000
ASCBFMCT EQU   ASCB+152                                                 02267000
ASCBOUXB EQU   ASCB+148                                                 02268000
ASCBOUCB EQU   ASCB+144                                                 02269000
ASCBMECB EQU   ASCB+140                                                 02270000
ASCBQECB EQU   ASCB+136                                                 02271000
ASCBLSQH EQU   ASCBLKGP+4                                               02272000
ASCBLOCK EQU   ASCBLKGP                                                 02273000
ASCBNVSC EQU   ASCB+122                                                 02274000
ASCBVSC  EQU   ASCB+120                                                 02275000
ASCBSRBS EQU   ASCB+118                                                 02276000
ASCBSSRB EQU   ASCB+116                                                 02277000
ASCBRV06 EQU   ASCBFLG2                                                 02278000
ASCBRV05 EQU   ASCBFLG2                                                 02279000
ASCBRV04 EQU   ASCBFLG2                                                 02280000
ASCBSNQS EQU   ASCBFLG2                                                 02281000
ASCBS2S  EQU   ASCBFLG2                                                 02282000
ASCBCEXT EQU   ASCBFLG2                                                 02283000
ASCBPXMT EQU   ASCBFLG2                                                 02284000
ASCBXMPT EQU   ASCBFLG2                                                 02285000
ASCBRF07 EQU   ASCBDSP1                                                 02286000
ASCBRF06 EQU   ASCBDSP1                                                 02287000
ASCBRF05 EQU   ASCBDSP1                                                 02288000
ASCBRF04 EQU   ASCBDSP1                                                 02289000
ASCBRF03 EQU   ASCBDSP1                                                 02290000
ASCBRF02 EQU   ASCBDSP1                                                 02291000
ASCBFAIL EQU   ASCBDSP1                                                 02292000
ASCBNOQ  EQU   ASCBDSP1                                                 02293000
ASCBSWCT EQU   ASCB+112                                                 02294000
ASCBTMCH EQU   ASCB+104                                                 02295000
ASCBNSWP EQU   ASCBFLG1                                                 02296000
ASCBSTND EQU   ASCBFLG1                                                 02297000
ASCBABNT EQU   ASCBFLG1                                                 02298000
ASCBTERM EQU   ASCBFLG1                                                 02299000
ASCBS3S  EQU   ASCBFLG1                                                 02300000
ASCBCMSH EQU   ASCBFLG1                                                 02301000
ASCBTOFF EQU   ASCBFLG1                                                 02302000
ASCBRF01 EQU   ASCBRCTF                                                 02303000
ASCBTMLW EQU   ASCBRCTF                                                 02304000
ASCBOUT  EQU   ASCBRCTF                                                 02305000
ASCBWAIT EQU   ASCBRCTF                                                 02306000
ASCBRV08 EQU   ASCBRCTF                                                 02307000
ASCBFQU  EQU   ASCBRCTF                                                 02308000
ASCBFRS  EQU   ASCBRCTF                                                 02309000
ASCBTMNO EQU   ASCBRCTF                                                 02310000
ASCBAFFN EQU   ASCBFW1                                                  02311000
ASCBDUMP EQU   ASCB+96                                                  02312000
ASCBRV44 EQU   ASCB+92                                                  02313000
ASCBUBET EQU   ASCB+88                                                  02314000
ASCBECB  EQU   ASCB+84                                                  02315000
ASCBJSTL EQU   ASCB+80                                                  02316000
ASCBEWST EQU   ASCB+72                                                  02317000
ASCBEJST EQU   ASCB+64                                                  02318000
ASCBTSB  EQU   ASCB+60                                                  02319000
ASCBCSCB EQU   ASCB+56                                                  02320000
ASCBRSMA EQU   ASCBRSM+1                                                02321000
ASCBRV54 EQU   ASCBRSMF                                                 02322000
ASCBRV53 EQU   ASCBRSMF                                                 02323000
ASCBRV52 EQU   ASCBRSMF                                                 02324000
ASCBRV51 EQU   ASCBRSMF                                                 02325000
ASCBVEQR EQU   ASCBRSMF                                                 02326000
ASCBN2LP EQU   ASCBRSMF                                                 02327000
ASCB1LPU EQU   ASCBRSMF                                                 02328000
ASCB2LPU EQU   ASCBRSMF                                                 02329000
ASCBLDA  EQU   ASCB+48                                                  02330000
ASCBSTOR EQU   ASCB+44                                                  02331000
ASCBDP   EQU   ASCB+43                                                  02332000
ASCBRV07 EQU   ASCB+42                                                  02333000
ASCBIOSM EQU   ASCB+40                                                  02334000
ASCBSEQN EQU   ASCB+38                                                  02335000
ASCBASID EQU   ASCB+36                                                  02336000
ASCBCPUS EQU   ASCB+32                                                  02337000
ASCBSPL  EQU   ASCB+28                                                  02338000
ASCBIOSP EQU   ASCB+24                                                  02339000
ASCBCMSF EQU   ASCB+12                                                  02340000
ASCBBWDP EQU   ASCB+8                                                   02341000
ASCBFWDP EQU   ASCB+4                                                   02342000
ASCBASCB EQU   ASCB                                                     02343000
ASCBEGIN EQU   ASCB                                                     02344000
MBCBBUFF EQU   MBCB+232                                                 02345000
MBCBSVRB EQU   MBCB+8                                                   02346000
PIEGR2   EQU   PIE+28                                                   02347000
PIEGR1   EQU   PIE+24                                                   02348000
PIEGR15  EQU   PIE+16                                                   02349000
@NM00041 EQU   PIEFLGS                                                  02350000
SCASRB   EQU   SCA+32                                                   02351000
SCAFRPPQ EQU   SCA+28                                                   02352000
SCARPPTR EQU   SCA+24                                                   02353000
SCAPARMS EQU   SCA+8                                                    02354000
SCARESV  EQU   SCA+5                                                    02355000
SCAPMASK EQU   SCA+4                                                    02356000
IQEOUTLM EQU   IQESECT+20                                               02357000
IQEDCB   EQU   IQESECT+16                                               02358000
IQETCBA  EQU   IQETCB+1                                                 02359000
IQESTAT2 EQU   IQETCB                                                   02360000
IQEIRBA  EQU   IQEIRB+1                                                 02361000
@NM00040 EQU   IQEFLAGS                                                 02362000
@NM00039 EQU   IQEFLAGS                                                 02363000
@NM00038 EQU   IQEFLAGS                                                 02364000
@NM00037 EQU   IQEFLAGS                                                 02365000
@NM00036 EQU   IQEFLAGS                                                 02366000
@NM00035 EQU   IQEFLAGS                                                 02367000
@NM00034 EQU   IQEFLAGS                                                 02368000
IQEPURGE EQU   IQEFLAGS                                                 02369000
IQEPARAM EQU   IQESECT+4                                                02370000
IQESTAT1 EQU   IQELNK                                                   02371000
SVRBEND  EQU   RBSECT+192                                               02372000
RBFEPARM EQU   RBSECT+168                                               02373000
SIRBEND  EQU   RBSECT+168                                               02374000
RBRSV158 EQU   RBRSV150                                                 02375000
RBRSV157 EQU   RBRSV150                                                 02376000
RBRSV156 EQU   RBRSV150                                                 02377000
RBRSV155 EQU   RBRSV150                                                 02378000
RBRSV154 EQU   RBRSV150                                                 02379000
RBRSV153 EQU   RBRSV150                                                 02380000
RBRSV152 EQU   RBRSV150                                                 02381000
RBRSV151 EQU   RBRSV150                                                 02382000
RBRSV149 EQU   RBSECT+166                                               02383000
RBRSV148 EQU   RBSECT+164                                               02384000
RBRSV169 EQU   RBSDATA+3                                                02385000
RBSID    EQU   RBSDATA+2                                                02386000
RBSPKEY  EQU   RBSDATA+1                                                02387000
RBRSV168 EQU   RBSFLG3                                                  02388000
RBSTERMO EQU   RBSFLG3                                                  02389000
RBSBRNTR EQU   RBSFLG3                                                  02390000
RBSPRNTR EQU   RBSFLG3                                                  02391000
RBSCNCEL EQU   RBSFLG3                                                  02392000
RBSRECRD EQU   RBSFLG3                                                  02393000
RBSTERMI EQU   RBSFLG3                                                  02394000
RBRSV167 EQU   RBSFLG3                                                  02395000
RBSOWNRA EQU   RBSOWNR+1                                                02396000
RBSSUPER EQU   RBSFLGS2                                                 02397000
RBSKEY0  EQU   RBSFLGS2                                                 02398000
RBRSV166 EQU   RBSFLGS2                                                 02399000
RBRSV165 EQU   RBSFLGS2                                                 02400000
RBSINUSE EQU   RBSFLGS2                                                 02401000
RBRSV164 EQU   RBSFLGS2                                                 02402000
RBSXCTL2 EQU   RBSFLGS2                                                 02403000
RBRSV163 EQU   RBSFLGS2                                                 02404000
RBSPARMA EQU   RBSPARM+1                                                02405000
RBSHALT  EQU   RBSIOPRC                                                 02406000
RBSNOIOP EQU   RBSIOPRC                                                 02407000
RBSASYNC EQU   RBSFLGS1                                                 02408000
RBRSV162 EQU   RBSFLGS1                                                 02409000
RBSESTAE EQU   RBSFLGS1                                                 02410000
RBSDUMMY EQU   RBSFLGS1                                                 02411000
RBSSTAR  EQU   RBSFLGS1                                                 02412000
RBSSTAI  EQU   RBSFLGS1                                                 02413000
RBSEXIT  EQU   RBSCBB+4                                                 02414000
RBSCHAIN EQU   RBSCBB                                                   02415000
TIRBEND  EQU   @NM00032+8                                               02416000
PRBEND   EQU   @NM00032+8                                               02417000
RBRSV146 EQU   RBRSV138                                                 02418000
RBRSV145 EQU   RBRSV138                                                 02419000
RBRSV144 EQU   RBRSV138                                                 02420000
RBRSV143 EQU   RBRSV138                                                 02421000
RBRSV142 EQU   RBRSV138                                                 02422000
RBRSV141 EQU   RBRSV138                                                 02423000
RBRSV140 EQU   RBRSV138                                                 02424000
RBRSV139 EQU   RBRSV138                                                 02425000
RBRSV137 EQU   @NM00032+6                                               02426000
RBRSV136 EQU   @NM00032+4                                               02427000
RBRSV135 EQU   @NM00032                                                 02428000
@NM00031 EQU   RBSECT+32                                                02429000
@NM00030 EQU   @NM00028+1                                               02430000
RBSCF    EQU   @NM00029                                                 02431000
RBPGMQ1  EQU   RBPGMQ+1                                                 02432000
@NM00027 EQU   RBPGMQ                                                   02433000
@NM00026 EQU   RBSECT+16                                                02434000
@NM00025 EQU   @NM00021                                                 02435000
@NM00024 EQU   @NM00021                                                 02436000
RBUSIQE  EQU   RBETXR                                                   02437000
@NM00023 EQU   @NM00021                                                 02438000
@NM00022 EQU   @NM00021                                                 02439000
RBPMSVRB EQU   @NM00019                                                 02440000
@NM00020 EQU   @NM00019                                                 02441000
RBWAITP  EQU   @NM00019                                                 02442000
RBFNSVRB EQU   RBTRSVRB                                                 02443000
RBABOPSW EQU   RBSECT+4                                                 02444000
@NM00017 EQU   RBPPSAV                                                  02445000
RBPRFXND EQU   RBPREFIX+64                                              02446000
RBINTCOD EQU   RBINTCDA+1                                               02447000
RBINLNTH EQU   RBINTCDA                                                 02448000
RBWCSA   EQU   RBPREFIX+60                                              02449000
RBRSV004 EQU   RBPREFIX+57                                              02450000
RBSSSYN  EQU   RBFLAGS1                                                 02451000
RBLONGWT EQU   RBFLAGS1                                                 02452000
RBASIR   EQU   RBFLAGS1                                                 02453000
RBRSV159 EQU   RBFLAGS1                                                 02454000
RBABEND  EQU   RBFLAGS1                                                 02455000
RBXWAIT  EQU   RBFLAGS1                                                 02456000
RBSLOCK  EQU   RBFLAGS1                                                 02457000
RBRTRAN  EQU   RBRTPSW2+4                                               02458000
RBRTINCD EQU   RBRTICIL+2                                               02459000
RBRTILC  EQU   RBRTICIL+1                                               02460000
RBRSV160 EQU   RBRTICIL                                                 02461000
RBRTPSW1 EQU   RBRTOPSW                                                 02462000
RBRSV062 EQU   RBRSV054                                                 02463000
RBRSV061 EQU   RBRSV054                                                 02464000
RBRSV060 EQU   RBRSV054                                                 02465000
RBRSV059 EQU   RBRSV054                                                 02466000
RBRSV058 EQU   RBRSV054                                                 02467000
RBRSV057 EQU   RBRSV054                                                 02468000
RBRSV056 EQU   RBRSV054                                                 02469000
RBRSV055 EQU   RBRSV054                                                 02470000
RBRSV053 EQU   RBPREFIX+38                                              02471000
RBRSV052 EQU   RBPREFIX+36                                              02472000
RBRSV051 EQU   RBPREFIX+32                                              02473000
RBRSV050 EQU   RBPREFIX+28                                              02474000
RBRSV049 EQU   RBRSV041                                                 02475000
RBRSV048 EQU   RBRSV041                                                 02476000
RBRSV047 EQU   RBRSV041                                                 02477000
RBRSV046 EQU   RBRSV041                                                 02478000
RBRSV045 EQU   RBRSV041                                                 02479000
RBRSV044 EQU   RBRSV041                                                 02480000
RBRSV043 EQU   RBRSV041                                                 02481000
RBRSV042 EQU   RBRSV041                                                 02482000
RBRSV040 EQU   RBPREFIX+26                                              02483000
RBRSV039 EQU   RBPREFIX+24                                              02484000
RBRSV038 EQU   RBPREFIX+20                                              02485000
RBRSV037 EQU   RBPREFIX+16                                              02486000
RBRSV036 EQU   RBRSV028                                                 02487000
RBRSV035 EQU   RBRSV028                                                 02488000
RBRSV034 EQU   RBRSV028                                                 02489000
RBRSV033 EQU   RBRSV028                                                 02490000
RBRSV032 EQU   RBRSV028                                                 02491000
RBRSV031 EQU   RBRSV028                                                 02492000
RBRSV030 EQU   RBRSV028                                                 02493000
RBRSV029 EQU   RBRSV028                                                 02494000
RBRSV027 EQU   RBRSV019                                                 02495000
RBRSV026 EQU   RBRSV019                                                 02496000
RBRSV025 EQU   RBRSV019                                                 02497000
RBRSV024 EQU   RBRSV019                                                 02498000
RBRSV023 EQU   RBRSV019                                                 02499000
RBRSV022 EQU   RBRSV019                                                 02500000
RBRSV021 EQU   RBRSV019                                                 02501000
RBRSV020 EQU   RBRSV019                                                 02502000
RBRSV018 EQU   RBPREFIX+13                                              02503000
RBRSV017 EQU   RBPREFIX+12                                              02504000
RBSRV016 EQU   RBPREFIX+11                                              02505000
RBRSV015 EQU   RBPREFIX+10                                              02506000
RBRSV014 EQU   RBPREFIX+8                                               02507000
RBRSV013 EQU   RBPREFIX+4                                               02508000
RBRSV012 EQU   RBPREFIX                                                 02509000
RBEXSAVE EQU   XRBESA                                                   02510000
XRBREG15 EQU   RBGRS15                                                  02511000
XRBREG14 EQU   RBGRS14                                                  02512000
XRBREG13 EQU   RBGRS13                                                  02513000
XRBREG12 EQU   RBGRS12                                                  02514000
XRBREG11 EQU   RBGRS11                                                  02515000
XRBREG10 EQU   RBGRS10                                                  02516000
XRBREG9  EQU   RBGRS9                                                   02517000
XRBREG8  EQU   RBGRS8                                                   02518000
XRBREG7  EQU   RBGRS7                                                   02519000
XRBREG6  EQU   RBGRS6                                                   02520000
XRBREG5  EQU   RBGRS5                                                   02521000
XRBREG4  EQU   RBGRS4                                                   02522000
XRBREG3  EQU   RBGRS3                                                   02523000
XRBREG2  EQU   RBGRS2                                                   02524000
XRBREG1  EQU   RBGRS1                                                   02525000
XRBREG0  EQU   RBGRS0                                                   02526000
XRBLNKA  EQU   RBLINKB                                                  02527000
XRBWT    EQU   RBWCF                                                    02528000
@NM00016 EQU   RBBASIC+24                                               02529000
RBOPSWPS EQU   RBOPSWB2                                                 02530000
@NM00015 EQU   RBOPSWB2                                                 02531000
@NM00014 EQU   XRBPSW                                                   02532000
@NM00013 EQU   RBBASIC+12                                               02533000
XRBWAIT  EQU   RBECBWT                                                  02534000
XRBFRRB  EQU   RBFDYN                                                   02535000
@NM00012 EQU   XSTAB2                                                   02536000
XRBACTV  EQU   RBFACTV                                                  02537000
XRBTCBP  EQU   RBTCBNXT                                                 02538000
@NM00011 EQU   XSTAB1                                                   02539000
XRBCKPT  EQU   RBFTCKPT                                                 02540000
@NM00010 EQU   XSTAB1                                                   02541000
@NM00009 EQU   RBBASIC+8                                                02542000
@NM00008 EQU   RBEXRTNM+1                                               02543000
RBTMIND3 EQU   RBTMFLD                                                  02544000
RBTMIND2 EQU   RBTMFLD                                                  02545000
RBTMCMP  EQU   RBTMFLD                                                  02546000
RBWLIM   EQU   RBTMFLD                                                  02547000
RBRSV005 EQU   RBTMFLD                                                  02548000
RBTMTOD  EQU   RBTMFLD                                                  02549000
RBTMQUE  EQU   RBTMFLD                                                  02550000
@NM00007 EQU   RBPRFX                                                   02551000
@NM00006 EQU   TCBXTNT2+32                                              02552000
TCBRV181 EQU   TCBRV173                                                 02553000
TCBRV180 EQU   TCBRV173                                                 02554000
TCBRV179 EQU   TCBRV173                                                 02555000
TCBRV178 EQU   TCBRV173                                                 02556000
TCBRV177 EQU   TCBRV173                                                 02557000
TCBRV176 EQU   TCBRV173                                                 02558000
TCBRV175 EQU   TCBRV173                                                 02559000
TCBRV174 EQU   TCBRV173                                                 02560000
TCBRV172 EQU   TCBRV164                                                 02561000
TCBRV171 EQU   TCBRV164                                                 02562000
TCBRV170 EQU   TCBRV164                                                 02563000
TCBRV169 EQU   TCBRV164                                                 02564000
TCBRV168 EQU   TCBRV164                                                 02565000
TCBRV167 EQU   TCBRV164                                                 02566000
TCBRV166 EQU   TCBRV164                                                 02567000
TCBRV165 EQU   TCBRV164                                                 02568000
TCBRV163 EQU   TCBRV155                                                 02569000
TCBRV162 EQU   TCBRV155                                                 02570000
TCBRV161 EQU   TCBRV155                                                 02571000
TCBRV160 EQU   TCBRV155                                                 02572000
TCBRV159 EQU   TCBRV155                                                 02573000
TCBRV158 EQU   TCBRV155                                                 02574000
TCBRV157 EQU   TCBRV155                                                 02575000
TCBRV156 EQU   TCBRV155                                                 02576000
TCBRV154 EQU   TCBRV146                                                 02577000
TCBRV153 EQU   TCBRV146                                                 02578000
TCBRV152 EQU   TCBRV146                                                 02579000
TCBRV151 EQU   TCBRV146                                                 02580000
TCBRV150 EQU   TCBRV146                                                 02581000
TCBRV149 EQU   TCBRV146                                                 02582000
TCBRV148 EQU   TCBRV146                                                 02583000
TCBRV147 EQU   TCBRV146                                                 02584000
TCBRV145 EQU   TCBXTNT2+26                                              02585000
TCBRV144 EQU   TCBXTNT2+24                                              02586000
TCBCAUF  EQU   TCBXTNT2+20                                              02587000
TCBRV142 EQU   TCBXTNT2+16                                              02588000
TCBRSV49 EQU   TCBXTNT2+12                                              02589000
TCBEVENT EQU   TCBXTNT2+8                                               02590000
TCBRCMP  EQU   TCBXTNT2+5                                               02591000
TCBRSVAB EQU   TCBXTNT2+4                                               02592000
TCBGTFA  EQU   TCBGTF+1                                                 02593000
TCBRSV47 EQU   TCBTFLG                                                  02594000
TCBRSV46 EQU   TCBTFLG                                                  02595000
TCBRSV45 EQU   TCBTFLG                                                  02596000
TCBRSV44 EQU   TCBTFLG                                                  02597000
TCBRSV43 EQU   TCBTFLG                                                  02598000
TCBDSPIT EQU   TCBTFLG                                                  02599000
TCBERRTN EQU   TCBTFLG                                                  02600000
TCBASYNC EQU   TCBTFLG                                                  02601000
@NM00005 EQU   TCB+296                                                  02602000
TCBSVCA2 EQU   TCB+292                                                  02603000
TCBSWASA EQU   TCB+288                                                  02604000
TCBDBTB  EQU   TCB+284                                                  02605000
TCBRPT   EQU   TCB+280                                                  02606000
TCBRV141 EQU   TCBRV133                                                 02607000
TCBRV140 EQU   TCBRV133                                                 02608000
TCBRV139 EQU   TCBRV133                                                 02609000
TCBRV138 EQU   TCBRV133                                                 02610000
TCBRV137 EQU   TCBRV133                                                 02611000
TCBRV136 EQU   TCBRV133                                                 02612000
TCBRV135 EQU   TCBRV133                                                 02613000
TCBRV134 EQU   TCBRV133                                                 02614000
TCBRV132 EQU   TCBRV124                                                 02615000
TCBRV131 EQU   TCBRV124                                                 02616000
TCBRV130 EQU   TCBRV124                                                 02617000
TCBRV129 EQU   TCBRV124                                                 02618000
TCBRV128 EQU   TCBRV124                                                 02619000
TCBRV127 EQU   TCBRV124                                                 02620000
TCBRV126 EQU   TCBRV124                                                 02621000
TCBRV125 EQU   TCBRV124                                                 02622000
TCBRV123 EQU   TCBFBYT2                                                 02623000
TCBRV122 EQU   TCBFBYT2                                                 02624000
TCBECBNV EQU   TCBFBYT2                                                 02625000
TCBSSSYN EQU   TCBFBYT2                                                 02626000
TCBFPRAP EQU   TCBFBYT2                                                 02627000
TCBFDW   EQU   TCBFBYT2                                                 02628000
TCBFMW   EQU   TCBFBYT2                                                 02629000
TCBCNCB  EQU   TCBFBYT2                                                 02630000
TCBLLH   EQU   TCBFBYT1                                                 02631000
TCBRV113 EQU   TCBFBYT1                                                 02632000
TCBRTM2  EQU   TCBFBYT1                                                 02633000
TCBPGNLY EQU   TCBFBYT1                                                 02634000
TCBNDIOS EQU   TCBFBYT1                                                 02635000
TCBRV327 EQU   TCBFBYT1                                                 02636000
TCBEOTFM EQU   TCBFBYT1                                                 02637000
TCBAFFN  EQU   TCB+274                                                  02638000
TCBRV326 EQU   TCB+272                                                  02639000
TCBUKYSP EQU   TCB+268                                                  02640000
TCBMODE  EQU   TCBESTAE+3                                               02641000
TCBERTYP EQU   TCBESTAE+2                                               02642000
TCBRV314 EQU   TCBESTRM                                                 02643000
TCBRV313 EQU   TCBESTRM                                                 02644000
TCBRV312 EQU   TCBESTRM                                                 02645000
TCBRV311 EQU   TCBESTRM                                                 02646000
TCBRV310 EQU   TCBESTRM                                                 02647000
TCBRV309 EQU   TCBESTRM                                                 02648000
TCBSTAFX EQU   TCBESTRM                                                 02649000
TCBETERM EQU   TCBESTRM                                                 02650000
TCBSCBKY EQU   TCBESTAE                                                 02651000
TCBRTM12 EQU   TCB+260                                                  02652000
TCBTCBID EQU   TCB+256                                                  02653000
TCBSTAWA EQU   TCB+252                                                  02654000
TCBSWA   EQU   TCB+248                                                  02655000
TCBFOEA  EQU   TCBFOE+1                                                 02656000
TCBRSV42 EQU   TCBFOE                                                   02657000
TCBCCPVI EQU   TCBXSCT+2                                                02658000
TCBRV325 EQU   TCBXSCT+1                                                02659000
TCBRV324 EQU   TCBXSCT1                                                 02660000
TCBRV323 EQU   TCBXSCT1                                                 02661000
TCBRV322 EQU   TCBXSCT1                                                 02662000
TCBRV321 EQU   TCBXSCT1                                                 02663000
TCBRV320 EQU   TCBXSCT1                                                 02664000
TCBRV319 EQU   TCBXSCT1                                                 02665000
TCBS3A   EQU   TCBXSCT1                                                 02666000
TCBACTIV EQU   TCBXSCT1                                                 02667000
TCBRSV41 EQU   TCB+239                                                  02668000
TCBTID   EQU   TCB+238                                                  02669000
TCBRSVAA EQU   TCB+237                                                  02670000
TCBABCUR EQU   TCB+236                                                  02671000
TCBTMSAV EQU   TCB+232                                                  02672000
TCBIOTIM EQU   TCB+228                                                  02673000
TCBRTWA  EQU   TCB+224                                                  02674000
TCBBACK  EQU   TCB+220                                                  02675000
TCBTIRB  EQU   TCB+216                                                  02676000
TCBAECB  EQU   TCB+212                                                  02677000
TCBEXT2A EQU   TCBEXT2+1                                                02678000
TCBRSV39 EQU   TCBEXT2                                                  02679000
TCBSTMCT EQU   TCB+207                                                  02680000
TCBSYSCT EQU   TCB+206                                                  02681000
TCBRSV37 EQU   TCB+205                                                  02682000
TCBEXSVC EQU   TCBDAR                                                   02683000
TCBDARMS EQU   TCBDAR                                                   02684000
TCBDARWT EQU   TCBDAR                                                   02685000
TCBDARO  EQU   TCBDAR                                                   02686000
TCBDARMC EQU   TCBDARC                                                  02687000
TCBDARD  EQU   TCBDAR                                                   02688000
TCBDARS  EQU   TCBDAR                                                   02689000
TCBDARP  EQU   TCBDAR                                                   02690000
TCBGTOFM EQU   TCBFLGS7                                                 02691000
TCBADMP  EQU   TCBFLGS7                                                 02692000
TCBRSTSK EQU   TCBFLGS7                                                 02693000
TCBSVCS  EQU   TCBFLGS7                                                 02694000
TCBSTACK EQU   TCBFLGS7                                                 02695000
TCBRSV34 EQU   TCBFLGS7                                                 02696000
TCBRSV33 EQU   TCBFLGS7                                                 02697000
TCBGPECB EQU   TCBFLGS7                                                 02698000
TCBNTJS  EQU   TCBFLGS6                                                 02699000
TCBAPG   EQU   TCBFLGS6                                                 02700000
TCBMIGR  EQU   TCBFLGS6                                                 02701000
TCBRV303 EQU   TCBFLGS6                                                 02702000
TCBSPVLK EQU   TCBFLGS6                                                 02703000
TCBCPU   EQU   TCBFLGS6                                                 02704000
TCBPIE17 EQU   TCBFLGS6                                                 02705000
TCBRV    EQU   TCBFLGS6                                                 02706000
TCBRSV79 EQU   TCBNDSP5                                                 02707000
TCBRSV78 EQU   TCBNDSP5                                                 02708000
TCBRSV77 EQU   TCBNDSP5                                                 02709000
TCBRSV76 EQU   TCBNDSP5                                                 02710000
TCBRSV75 EQU   TCBNDSP5                                                 02711000
TCBRSV74 EQU   TCBNDSP5                                                 02712000
TCBRSV95 EQU   TCBNDSP5                                                 02713000
TCBRSV94 EQU   TCBNDSP5                                                 02714000
TCBRSV93 EQU   TCBNDSP4                                                 02715000
TCBRSV92 EQU   TCBNDSP4                                                 02716000
TCBRSV91 EQU   TCBNDSP4                                                 02717000
TCBRSV90 EQU   TCBNDSP4                                                 02718000
TCBRSV89 EQU   TCBNDSP4                                                 02719000
TCBRSV88 EQU   TCBNDSP4                                                 02720000
TCBRSV87 EQU   TCBNDSP4                                                 02721000
TCBRSV86 EQU   TCBNDSP4                                                 02722000
TCBEXT1A EQU   TCBEXT1+1                                                02723000
TCBRSV32 EQU   TCBEXT1                                                  02724000
TCBEXCPD EQU   TCB+192                                                  02725000
TCBIOBRC EQU   TCB+188                                                  02726000
TCBDDWTC EQU   TCB+186                                                  02727000
TCBDDEXC EQU   TCB+184                                                  02728000
TCBJSCBB EQU   TCBJSCB+1                                                02729000
@NM00004 EQU   TCBRECDE                                                 02730000
TCBREC   EQU   TCBRECDE                                                 02731000
TCBMDIDS EQU   TCB+176                                                  02732000
TCBNDINT EQU   TCBNDSP3                                                 02733000
TCBRSV27 EQU   TCBNDSP3                                                 02734000
TCBRSV26 EQU   TCBNDSP3                                                 02735000
TCBRSV25 EQU   TCBNDSP3                                                 02736000
TCBRSV24 EQU   TCBNDSP3                                                 02737000
TCBSRBND EQU   TCBNDSP3                                                 02738000
TCBRV302 EQU   TCBNDSP3                                                 02739000
TCBLJSND EQU   TCBNDSP3                                                 02740000
TCBABE   EQU   TCBNDSP2                                                 02741000
TCBDSS   EQU   TCBNDSP2                                                 02742000
TCBOWAIT EQU   TCBNDSP2                                                 02743000
TCBIWAIT EQU   TCBNDSP2                                                 02744000
TCBNDTS  EQU   TCBNDSP2                                                 02745000
TCBNDSVC EQU   TCBNDSP2                                                 02746000
TCBABD   EQU   TCBNDSP2                                                 02747000
TCBRSV22 EQU   TCBNDSP1                                                 02748000
TCBPIEND EQU   TCBNDSP1                                                 02749000
TCBTPSP  EQU   TCBNDSP1                                                 02750000
TCBDDRND EQU   TCBNDSP1                                                 02751000
TCBRSPND EQU   TCBNDSP1                                                 02752000
TCBRSTND EQU   TCBNDSP1                                                 02753000
TCBDARPN EQU   TCBNDSP1                                                 02754000
TCBDARTN EQU   TCBNDSP1                                                 02755000
TCBNDSP0 EQU   TCBNDSP                                                  02756000
TCBUSER  EQU   TCB+168                                                  02757000
TCBTCTB  EQU   TCBTCT+1                                                 02758000
TCBRSV9C EQU   TCBTCTGF                                                 02759000
TCBRSV9B EQU   TCBTCTGF                                                 02760000
TCBRSV9A EQU   TCBTCTGF                                                 02761000
TCBRSV99 EQU   TCBTCTGF                                                 02762000
TCBRSV98 EQU   TCBTCTGF                                                 02763000
TCBRSV97 EQU   TCBTCTGF                                                 02764000
TCBRSV20 EQU   TCBTCTGF                                                 02765000
TCBSMFGF EQU   TCBTCTGF                                                 02766000
TCBSTABB EQU   TCBSTAB+1                                                02767000
TCBSTCUR EQU   TCBNSTAE                                                 02768000
TCBRV301 EQU   TCBNSTAE                                                 02769000
TCBSYNCH EQU   TCBNSTAE                                                 02770000
TCBHALT  EQU   TCBNSTAE                                                 02771000
TCBPPSUP EQU   TCBNSTAE                                                 02772000
TCB33E   EQU   TCBNSTAE                                                 02773000
TCBQUIES EQU   TCBNSTAE                                                 02774000
TCBSTABE EQU   TCBNSTAE                                                 02775000
TCBAQE   EQU   TCB+156                                                  02776000
TCBPQE   EQU   TCB+152                                                  02777000
TCBTSDP  EQU   TCB+151                                                  02778000
TCBTSLP  EQU   TCB+150                                                  02779000
TCBSTPCT EQU   TCB+149                                                  02780000
TCBCPUBN EQU   TCBTSFLG                                                 02781000
TCBDYDSP EQU   TCBTSFLG                                                 02782000
TCBRSV18 EQU   TCBTSFLG                                                 02783000
TCBRSV17 EQU   TCBTSFLG                                                 02784000
TCBTIOTG EQU   TCBTSFLG                                                 02785000
TCBRV300 EQU   TCBTSTSK                                                 02786000
TCBECB   EQU   TCB+144                                                  02787000
TCBIQE   EQU   TCB+140                                                  02788000
TCBLTC   EQU   TCB+136                                                  02789000
TCBOTC   EQU   TCB+132                                                  02790000
TCBNTC   EQU   TCB+128                                                  02791000
TCBJSTCA EQU   TCBJSTCB+1                                               02792000
TCBRSV16 EQU   TCBJSTCB                                                 02793000
TCBTQET  EQU   TCBTME                                                   02794000
TCBTCB   EQU   TCB+116                                                  02795000
TCBFSAB  EQU   TCBFSA+1                                                 02796000
TCBQEL   EQU   TCBFSA                                                   02797000
TCBGRS13 EQU   TCBGRS+52                                                02798000
TCBGRS12 EQU   TCBGRS+48                                                02799000
TCBGRS11 EQU   TCBGRS+44                                                02800000
TCBGRS10 EQU   TCBGRS+40                                                02801000
TCBGRS9  EQU   TCBGRS+36                                                02802000
TCBGRS8  EQU   TCBGRS+32                                                02803000
TCBGRS7  EQU   TCBGRS+28                                                02804000
TCBGRS6  EQU   TCBGRS+24                                                02805000
TCBGRS5  EQU   TCBGRS+20                                                02806000
TCBGRS4  EQU   TCBGRS+16                                                02807000
TCBGRS3  EQU   TCBGRS+12                                                02808000
TCBJPQB  EQU   TCBJPQ+1                                                 02809000
TCBRSV15 EQU   TCBPURGE                                                 02810000
TCBRSV14 EQU   TCBPURGE                                                 02811000
TCBRSV13 EQU   TCBPURGE                                                 02812000
TCBRSV12 EQU   TCBPURGE                                                 02813000
TCBRSV11 EQU   TCBPURGE                                                 02814000
TCBRSV10 EQU   TCBPURGE                                                 02815000
TCBRSV09 EQU   TCBPURGE                                                 02816000
TCBJPQF  EQU   TCBPURGE                                                 02817000
TCBJLB   EQU   TCB+40                                                   02818000
TCBLLS   EQU   TCB+36                                                   02819000
TCBDSP   EQU   TCB+35                                                   02820000
TCBLMP   EQU   TCB+34                                                   02821000
TCBFCD1  EQU   TCBFLGS5                                                 02822000
TCBSTP   EQU   TCBFLGS5                                                 02823000
TCBSYS   EQU   TCBFLGS5                                                 02824000
TCBANDSP EQU   TCBFLGS5                                                 02825000
TCBPAGE  EQU   TCBFLGS5                                                 02826000
TCBUXNDF EQU   TCBABWF                                                  02827000
TCBFC    EQU   TCBFLGS5                                                 02828000
TCBONDSP EQU   TCBFLGS4                                                 02829000
TCBMPCND EQU   TCBFLGS4                                                 02830000
TCBMPCVQ EQU   TCBFLGS4                                                 02831000
TCBUXNDV EQU   TCBFLGS4                                                 02832000
TCBHNDSP EQU   TCBFLGS4                                                 02833000
TCBRQENA EQU   TCBFLGS4                                                 02834000
TCBSER   EQU   TCBFLGS4                                                 02835000
TCBNDUMP EQU   TCBFLGS4                                                 02836000
TCBDWSTA EQU   TCBFLGS3                                                 02837000
TCBRSV08 EQU   TCBFLGS3                                                 02838000
TCBRSV07 EQU   TCBFLGS3                                                 02839000
TCBRSV06 EQU   TCBFLGS3                                                 02840000
TCBABGM  EQU   TCBFLGS3                                                 02841000
TCBABTRM EQU   TCBFLGS3                                                 02842000
TCBADINP EQU   TCBFLGS3                                                 02843000
TCBFSM   EQU   TCBFLGS3                                                 02844000
TCBFTS   EQU   TCBFLGS2                                                 02845000
TCBFETXR EQU   TCBFLGS2                                                 02846000
TCBFDSOP EQU   TCBFLGS2                                                 02847000
TCBFJMC  EQU   TCBFLGS2                                                 02848000
TCBFSMC  EQU   TCBFLGS2                                                 02849000
TCBFABOP EQU   TCBFLGS2                                                 02850000
TCBFSTI  EQU   TCBFLGS2                                                 02851000
TCBFOINP EQU   TCBFLGS2                                                 02852000
TCBFX    EQU   TCBFLGS1                                                 02853000
TCBFS    EQU   TCBFLGS1                                                 02854000
TCBFT    EQU   TCBFLGS1                                                 02855000
TCBPDUMP EQU   TCBFLGS1                                                 02856000
TCBFERA  EQU   TCBFLGS1                                                 02857000
TCBFE    EQU   TCBFLGS1                                                 02858000
TCBFA    EQU   TCBFLGS1                                                 02859000
TCBZERO  EQU   TCBPKF                                                   02860000
TCBFLAG  EQU   TCBPKF                                                   02861000
TCBMSSB  EQU   TCBMSS+1                                                 02862000
TCBRSV03 EQU   TCBMSS                                                   02863000
TCBTRNB  EQU   TCBTRN+1                                                 02864000
TCBRSV02 EQU   TCBABF                                                   02865000
TCBOLTEP EQU   TCBABF                                                   02866000
TCBTCP   EQU   TCBABF                                                   02867000
TCBTCPP  EQU   TCBABF                                                   02868000
TCBRSV01 EQU   TCBABF                                                   02869000
TCBGRPH  EQU   TCBABF                                                   02870000
TCBNOCHK EQU   TCBABF                                                   02871000
TCBMOD91 EQU   TCBABF                                                   02872000
TCBCMPC  EQU   TCBCMP+1                                                 02873000
TCBRV318 EQU   TCBCMSG                                                  02874000
TCBRV317 EQU   TCBCIND                                                  02875000
TCBRV316 EQU   TCBCWTO                                                  02876000
TCBCASID EQU   TCBCDBL                                                  02877000
TCBNOCC  EQU   TCBSTCC                                                  02878000
TCBDMPO  EQU   TCBCPP                                                   02879000
TCBCSTEP EQU   TCBCMPF                                                  02880000
TCBCREQ  EQU   TCBCMPF                                                  02881000
TCBTIO   EQU   TCB+12                                                   02882000
TCBDEB   EQU   TCB+8                                                    02883000
TCBPM    EQU   TCBPMASK                                                 02884000
@NM00003 EQU   TCBPMASK                                                 02885000
TCBFRS6  EQU   TCBFRS+24                                                02886000
TCBFRS4  EQU   TCBFRS+16                                                02887000
TCBFRS2  EQU   TCBFRS+8                                                 02888000
TCBFRS0  EQU   TCBFRS                                                   02889000
CVTLEVL  EQU   CVTRELNO+2                                               02890000
CVTNUMB  EQU   CVTRELNO                                                 02891000
CVTMDL   EQU   CVTFIX+250                                               02892000
@NM00002 EQU   CVTFIX+248                                               02893000
@NM00001 EQU   CVTFIX                                                   02894000
CVTRV482 EQU   CVTXTNT2+128                                             02895000
CVTRV481 EQU   CVTXTNT2+124                                             02896000
CVTRV480 EQU   CVTXTNT2+120                                             02897000
CVTRV479 EQU   CVTXTNT2+118                                             02898000
CVTRV478 EQU   CVTXTNT2+117                                             02899000
CVTRV477 EQU   CVTXTNT2+116                                             02900000
CVTRV476 EQU   CVTXTNT2+115                                             02901000
CVTRV475 EQU   CVTXTNT2+114                                             02902000
CVTRV474 EQU   CVTRV466                                                 02903000
CVTRV473 EQU   CVTRV466                                                 02904000
CVTRV472 EQU   CVTRV466                                                 02905000
CVTRV471 EQU   CVTRV466                                                 02906000
CVTRV470 EQU   CVTRV466                                                 02907000
CVTRV469 EQU   CVTRV466                                                 02908000
CVTRV468 EQU   CVTRV466                                                 02909000
CVTRV467 EQU   CVTRV466                                                 02910000
CVTRV465 EQU   CVTRV457                                                 02911000
CVTRV464 EQU   CVTRV457                                                 02912000
CVTRV463 EQU   CVTRV457                                                 02913000
CVTRV462 EQU   CVTRV457                                                 02914000
CVTRV461 EQU   CVTRV457                                                 02915000
CVTRV460 EQU   CVTRV457                                                 02916000
CVTRV459 EQU   CVTRV457                                                 02917000
CVTRV458 EQU   CVTRV457                                                 02918000
CVTRV456 EQU   CVTXTNT2+108                                             02919000
CVTRV455 EQU   CVTXTNT2+104                                             02920000
CVTRV454 EQU   CVTXTNT2+100                                             02921000
CVTRV453 EQU   CVTXTNT2+96                                              02922000
CVTRV452 EQU   CVTXTNT2+94                                              02923000
CVTRV451 EQU   CVTXTNT2+92                                              02924000
CVTRV450 EQU   CVTXTNT2+90                                              02925000
CVTRV449 EQU   CVTXTNT2+88                                              02926000
CVTRV448 EQU   CVTXTNT2+87                                              02927000
CVTRV447 EQU   CVTXTNT2+86                                              02928000
CVTRV446 EQU   CVTRV438                                                 02929000
CVTRV445 EQU   CVTRV438                                                 02930000
CVTRV444 EQU   CVTRV438                                                 02931000
CVTRV443 EQU   CVTRV438                                                 02932000
CVTRV442 EQU   CVTRV438                                                 02933000
CVTRV441 EQU   CVTRV438                                                 02934000
CVTRV440 EQU   CVTRV438                                                 02935000
CVTRV439 EQU   CVTRV438                                                 02936000
CVTRV437 EQU   CVTRV429                                                 02937000
CVTRV436 EQU   CVTRV429                                                 02938000
CVTRV435 EQU   CVTRV429                                                 02939000
CVTRV434 EQU   CVTRV429                                                 02940000
CVTRV433 EQU   CVTRV429                                                 02941000
CVTRV432 EQU   CVTRV429                                                 02942000
CVTRV431 EQU   CVTRV429                                                 02943000
CVTRV430 EQU   CVTRV429                                                 02944000
CVTRV428 EQU   CVTXTNT2+80                                              02945000
CVTRV427 EQU   CVTXTNT2+76                                              02946000
CVTRV426 EQU   CVTXTNT2+72                                              02947000
CVTRV425 EQU   CVTXTNT2+68                                              02948000
CVTATACT EQU   CVTATCVT                                                 02949000
CVTRV423 EQU   CVTXTNT2+62                                              02950000
CVTRV422 EQU   CVTXTNT2+60                                              02951000
CVTRV421 EQU   CVTXTNT2+58                                              02952000
CVTRV420 EQU   CVTXTNT2+56                                              02953000
CVTRV419 EQU   CVTXTNT2+55                                              02954000
CVTRV418 EQU   CVTXTNT2+54                                              02955000
CVTRV417 EQU   CVTRV409                                                 02956000
CVTRV416 EQU   CVTRV409                                                 02957000
CVTRV415 EQU   CVTRV409                                                 02958000
CVTRV414 EQU   CVTRV409                                                 02959000
CVTRV413 EQU   CVTRV409                                                 02960000
CVTRV412 EQU   CVTRV409                                                 02961000
CVTRV411 EQU   CVTRV409                                                 02962000
CVTRV410 EQU   CVTRV409                                                 02963000
CVTRV408 EQU   CVTRV400                                                 02964000
CVTRV407 EQU   CVTRV400                                                 02965000
CVTRV406 EQU   CVTRV400                                                 02966000
CVTRV405 EQU   CVTRV400                                                 02967000
CVTRV404 EQU   CVTRV400                                                 02968000
CVTRV403 EQU   CVTRV400                                                 02969000
CVTRV402 EQU   CVTRV400                                                 02970000
CVTRV401 EQU   CVTRV400                                                 02971000
CVTICB   EQU   CVTXTNT2+48                                              02972000
CVTSKTA  EQU   CVTXTNT2+44                                              02973000
CVTCCVT  EQU   CVTXTNT2+40                                              02974000
CVTRSV98 EQU   CVTXTNT2+36                                              02975000
CVTRSV97 EQU   CVTXTNT2+34                                              02976000
CVTRSV96 EQU   CVTXTNT2+32                                              02977000
CVTOLTEP EQU   CVTXTNT2+28                                              02978000
CVTQIDA  EQU   CVTQID+1                                                 02979000
CVTRSV95 EQU   CVTQID                                                   02980000
CVTRSV94 EQU   CVTXTNT2+20                                              02981000
CVTRSV93 EQU   CVTXTNT2+16                                              02982000
CVTRSV92 EQU   CVTXTNT2+12                                              02983000
CVTDEBVR EQU   CVTXTNT2+8                                               02984000
CVTRSV91 EQU   CVTXTNT2+6                                               02985000
CVTRSV9H EQU   CVTFLGBT                                                 02986000
CVTRSV9G EQU   CVTFLGBT                                                 02987000
CVTRSV9F EQU   CVTFLGBT                                                 02988000
CVTRSV9E EQU   CVTFLGBT                                                 02989000
CVTRSV9D EQU   CVTFLGBT                                                 02990000
CVTRSV9C EQU   CVTFLGBT                                                 02991000
CVTVME   EQU   CVTFLGBT                                                 02992000
CVTNPE   EQU   CVTFLGBT                                                 02993000
CVTNUCLS EQU   CVTXTNT2+4                                               02994000
CVTDSSVA EQU   CVTDSSV+1                                                02995000
CVTRSV89 EQU   CVTDSSV                                                  02996000
CVTRSV88 EQU   CVTXTNT1+8                                               02997000
CVTRSV87 EQU   CVTXTNT1+4                                               02998000
CVTFACHN EQU   CVTXTNT1                                                 02999000
CVTRV488 EQU   CVTMAP+412                                               03000000
CVTRV487 EQU   CVTMAP+408                                               03001000
CVTRV486 EQU   CVTMAP+404                                               03002000
CVTRV485 EQU   CVTMAP+400                                               03003000
CVTACTAP EQU   CVTMAP+396                                               03004000
CVTAUTH  EQU   CVTMAP+392                                               03005000
CVTATMCA EQU   CVTATMCT+1                                               03006000
CVTATMST EQU   CVTATMCT                                                 03007000
CVTRSV61 EQU   CVTMAP+384                                               03008000
CVTVOLT1 EQU   CVTVOLM1+1                                               03009000
CVTVOLI1 EQU   CVTVOLF1                                                 03010000
CVTSTOA  EQU   CVTMAP+376                                               03011000
CVTRSV58 EQU   CVTMAP+374                                               03012000
CVTRSV57 EQU   CVTMAP+372                                               03013000
CVTDDCE  EQU   CVTMAP+368                                               03014000
CVTPNWFR EQU   CVTMAP+364                                               03015000
CVTSMF   EQU   CVTMAP+360                                               03016000
CVTSULK  EQU   CVTMAP+358                                               03017000
CVTSLKO  EQU   CVTSYSK                                                  03018000
CVTSLKP  EQU   CVTSYSK                                                  03019000
CVTSLKQ  EQU   CVTSYSK                                                  03020000
CVTSLKR  EQU   CVTSYSK                                                  03021000
CVTRSV56 EQU   CVTSYSK                                                  03022000
CVTRSV55 EQU   CVTSYSK                                                  03023000
CVTRSV54 EQU   CVTSYSK                                                  03024000
CVTRSV53 EQU   CVTSYSK                                                  03025000
CVTRSV52 EQU   CVTA1F1                                                  03026000
CVTRSV51 EQU   CVTA1F1                                                  03027000
CVTRSV50 EQU   CVTA1F1                                                  03028000
CVTRSV49 EQU   CVTA1F1                                                  03029000
CVTRSV48 EQU   CVTA1F1                                                  03030000
CVTRSV47 EQU   CVTA1F1                                                  03031000
CVTSRSW  EQU   CVTA1F1                                                  03032000
CVTPFSW  EQU   CVTA1F1                                                  03033000
CVTPCVT  EQU   CVTMAP+352                                               03034000
CVTRSV46 EQU   CVTMAP+344                                               03035000
CVTRSV45 EQU   CVTMAP+340                                               03036000
CVTRSV44 EQU   CVTMAP+338                                               03037000
CVTRSV43 EQU   CVTMAP+336                                               03038000
CVTHJESA EQU   CVTHJES+1                                                03039000
CVTRSV42 EQU   CVTHJES                                                  03040000
CVTEXT2A EQU   CVTEXT2+1                                                03041000
CVTRSV41 EQU   CVTEXT2                                                  03042000
CVTAPFA  EQU   CVTAPF+1                                                 03043000
CVTRSV40 EQU   CVTAPF                                                   03044000
CVTRV518 EQU   CVTINTLA                                                 03045000
CVTRV517 EQU   CVTERPV                                                  03046000
CVTEORM  EQU   CVTMAP+312                                               03047000
CVTMCHPR EQU   CVTMAP+308                                               03048000
CVTTZ    EQU   CVTMAP+304                                               03049000
CVTJEPS  EQU   CVTMAP+300                                               03050000
CVTJESCT EQU   CVTMAP+296                                               03051000
CVTMODE  EQU   CVTMAP+292                                               03052000
CVTPTRV  EQU   CVTMAP+288                                               03053000
CVTREAL  EQU   CVTMAP+284                                               03054000
CVTRSV39 EQU   CVTMAP+280                                               03055000
CVTRSV38 EQU   CVTMAP+276                                               03056000
CVTDMSRA EQU   CVTDMSR+1                                                03057000
CVTRV634 EQU   CVTDMSRF                                                 03058000
CVTRV633 EQU   CVTDMSRF                                                 03059000
CVTRV632 EQU   CVTDMSRF                                                 03060000
CVTRV631 EQU   CVTDMSRF                                                 03061000
CVTRV630 EQU   CVTDMSRF                                                 03062000
CVTRV629 EQU   CVTDMSRF                                                 03063000
CVTUDUMP EQU   CVTDMSRF                                                 03064000
CVTSDUMP EQU   CVTDMSRF                                                 03065000
CVTQMSGA EQU   CVTQMSG+1                                                03066000
CVTRSV36 EQU   CVTQMSG                                                  03067000
CVTAMFF  EQU   CVTMAP+264                                               03068000
CVTPURGA EQU   CVTPURG+1                                                03069000
CVTRSV35 EQU   CVTPURG                                                  03070000
CVTCBSP  EQU   CVTMAP+256                                               03071000
CVTATERA EQU   CVTATER+1                                                03072000
CVTSYST  EQU   CVTATER                                                  03073000
CVTVOLT2 EQU   CVTTAT                                                   03074000
CVTVOLI2 EQU   CVTVOLF2                                                 03075000
CVTAQAVB EQU   CVTAQAVT+1                                               03076000
CVTRSV34 EQU   CVTTCMFG                                                 03077000
CVTRSV33 EQU   CVTTCMFG                                                 03078000
CVTRSV32 EQU   CVTTCMFG                                                 03079000
CVTRSV31 EQU   CVTTCMFG                                                 03080000
CVTRSV30 EQU   CVTTCMFG                                                 03081000
CVTRSV29 EQU   CVTTCMFG                                                 03082000
CVTLDEV  EQU   CVTTCMFG                                                 03083000
CVTTCRDY EQU   CVTTCMFG                                                 03084000
CVTGTFA  EQU   CVTGTF+1                                                 03085000
CVTRSV27 EQU   CVTGTFST                                                 03086000
CVTRNIO  EQU   CVTGTFST                                                 03087000
CVTUSR   EQU   CVTGTFST                                                 03088000
CVTRV318 EQU   CVTFORM                                                  03089000
CVTRV317 EQU   CVTTMODE                                                 03090000
CVTRV316 EQU   CVTSTATE                                                 03091000
CVTRV315 EQU   CVTGTFS                                                  03092000
CVTGTFAV EQU   CVTGTFS                                                  03093000
CVT0SCR1 EQU   CVTMAP+232                                               03094000
CVTRV515 EQU   CVTMAP+228                                               03095000
CVTRMS   EQU   CVTMAP+224                                               03096000
CVTPATCH EQU   CVTMAP+220                                               03097000
CVTTSCE  EQU   CVTMAP+216                                               03098000
CVTLNKSC EQU   CVTMAP+214                                               03099000
CVTQABST EQU   CVTMAP+212                                               03100000
CVTMDLDS EQU   CVTMAP+208                                               03101000
CVTUSER  EQU   CVTMAP+204                                               03102000
CVTABEND EQU   CVTMAP+200                                               03103000
CVTSMCA  EQU   CVTMAP+196                                               03104000
CVTRSV18 EQU   CVTMAP+192                                               03105000
CVTQLPAQ EQU   CVTMAP+188                                               03106000
CVTQCDSR EQU   CVTMAP+184                                               03107000
CVTRSV17 EQU   CVTOPTB                                                  03108000
CVTRSV16 EQU   CVTOPTB                                                  03109000
CVTFP    EQU   CVTOPTB                                                  03110000
CVTAPTHR EQU   CVTOPTB                                                  03111000
CVTNLOG  EQU   CVTOPTB                                                  03112000
CVTTOD   EQU   CVTOPTB                                                  03113000
CVTCTIMS EQU   CVTOPTB                                                  03114000
CVTPROT  EQU   CVTOPTB                                                  03115000
CVTXPFP  EQU   CVTOPTA                                                  03116000
CVTASCII EQU   CVTOPTA                                                  03117000
CVTRSV13 EQU   CVTOPTA                                                  03118000
CVTRSV12 EQU   CVTOPTA                                                  03119000
CVTNIP   EQU   CVTOPTA                                                  03120000
CVTDDR   EQU   CVTOPTA                                                  03121000
CVTAPR   EQU   CVTOPTA                                                  03122000
CVTCCH   EQU   CVTOPTA                                                  03123000
CVTSNCTR EQU   CVTMAP+180                                               03124000
CVTQMWR  EQU   CVTMAP+176                                               03125000
CVTQOCR  EQU   CVTMAP+172                                               03126000
CVT1EF00 EQU   CVTMAP+168                                               03127000
CVTMZ00  EQU   CVTMAP+164                                               03128000
CVTSV76Q EQU   CVTSV76C                                                 03129000
CVTRSV11 EQU   CVTMAP+156                                               03130000
CVT0PT01 EQU   CVTMAP+152                                               03131000
CVTMSER  EQU   CVTMAP+148                                               03132000
CVTRV516 EQU   CVTIERLC                                                 03133000
CVTILCH  EQU   CVTMAP+140                                               03134000
CVT0DS   EQU   CVTMAP+136                                               03135000
CVTFBOSV EQU   CVTMAP+132                                               03136000
CVTNUCB  EQU   CVTMAP+128                                               03137000
CVTIXAVL EQU   CVTMAP+124                                               03138000
CVTSV76M EQU   CVTIOQET                                                 03139000
CVTDCBA  EQU   CVTMAP+117                                               03140000
CVTMVS2  EQU   CVTDCB                                                   03141000
CVT6DAT  EQU   CVTDCB                                                   03142000
CVT4MPS  EQU   CVTDCB                                                   03143000
CVTRSV09 EQU   CVTDCB                                                   03144000
CVT4MS1  EQU   CVTDCB                                                   03145000
CVT2SPS  EQU   CVTDCB                                                   03146000
CVT1SSS  EQU   CVTDCB                                                   03147000
CVTRSV08 EQU   CVTDCB                                                   03148000
CVTSTB   EQU   CVTMAP+112                                               03149000
CVTQTD00 EQU   CVTMAP+108                                               03150000
CVTQTE00 EQU   CVTMAP+104                                               03151000
CVTCUCB  EQU   CVTMAP+100                                               03152000
CVTSJQ   EQU   CVTMAP+96                                                03153000
CVTPBLDL EQU   CVTMAP+92                                                03154000
CVTTPC   EQU   CVTMAP+88                                                03155000
CVTSVDCB EQU   CVTMAP+84                                                03156000
CVTBRET  EQU   CVTMAP+82                                                03157000
CVTEXIT  EQU   CVTMAP+80                                                03158000
CVT0FN00 EQU   CVTMAP+76                                                03159000
CVTDARA  EQU   CVTDAR+1                                                 03160000
CVTRSV07 EQU   CVTFLGS1                                                 03161000
CVTRSV06 EQU   CVTFLGS1                                                 03162000
CVTRSV05 EQU   CVTFLGS1                                                 03163000
CVTRSV04 EQU   CVTFLGS1                                                 03164000
CVTRSV03 EQU   CVTFLGS1                                                 03165000
CVTRSV02 EQU   CVTFLGS1                                                 03166000
CVTRSV01 EQU   CVTFLGS1                                                 03167000
CVTDMPLK EQU   CVTFLGS1                                                 03168000
CVTXITP  EQU   CVTMAP+68                                                03169000
CVTZDTAB EQU   CVTMAP+64                                                03170000
CVTMSLT  EQU   CVTMAP+60                                                03171000
CVTDATE  EQU   CVTMAP+56                                                03172000
CVTBTERM EQU   CVTMAP+52                                                03173000
CVTSYSAD EQU   CVTMAP+48                                                03174000
CVTXTLER EQU   CVTMAP+44                                                03175000
CVTILK2  EQU   CVTMAP+40                                                03176000
CVTILK1  EQU   CVTMAP+36                                                03177000
CVTPRLTV EQU   CVTMAP+32                                                03178000
CVTPCNVT EQU   CVTMAP+28                                                03179000
CVT0VL00 EQU   CVTMAP+24                                                03180000
CVTXAPG  EQU   CVTMAP+20                                                03181000
CVTBUF   EQU   CVTMAP+16                                                03182000
CVTJOB   EQU   CVTMAP+12                                                03183000
CVTLINK  EQU   CVTMAP+8                                                 03184000
CVT0EF00 EQU   CVTMAP+4                                                 03185000
CVTTCBP  EQU   CVTMAP                                                   03186000
CVT      EQU   CVTMAP                                                   03187000
@NM00065 EQU   PSA+3668                                                 03188000
PSASTAK  EQU   PSA+3072                                                 03189000
@NM00064 EQU   PSA+1048                                                 03190000
PSAUSEND EQU   PSA+1048                                                 03191000
PSARV062 EQU   PSA+1044                                                 03192000
PSACDAL  EQU   PSA+1040                                                 03193000
PSAWTCOD EQU   PSA+1036                                                 03194000
PSAATCVT EQU   PSA+1032                                                 03195000
PSAPCPSW EQU   PSA+1024                                                 03196000
PSAPIR2  EQU   PSA+1020                                                 03197000
PSARV059 EQU   PSA+1018                                                 03198000
PSASVC13 EQU   PSA+1016                                                 03199000
PSALSFCC EQU   PSA+1012                                                 03200000
PSASFACC EQU   PSA+1008                                                 03201000
PSASTOP  EQU   PSA+992                                                  03202000
PSASTART EQU   PSA+976                                                  03203000
PSARSPSW EQU   PSA+968                                                  03204000
PSASRPSW EQU   PSA+960                                                  03205000
PSARV045 EQU   PSA+892                                                  03206000
PSARV044 EQU   PSA+888                                                  03207000
PSARV043 EQU   PSA+884                                                  03208000
PSARV042 EQU   PSA+880                                                  03209000
PSARV041 EQU   PSA+876                                                  03210000
PSARV040 EQU   PSA+872                                                  03211000
PSARV025 EQU   PSA+868                                                  03212000
PSADSSED EQU   PSA+868                                                  03213000
PSADSSPR EQU   PSA+864                                                  03214000
PSADSSFW EQU   PSA+860                                                  03215000
PSADSS14 EQU   PSA+856                                                  03216000
PSADSSPP EQU   PSA+848                                                  03217000
PSADSSRP EQU   PSA+840                                                  03218000
PSADSS05 EQU   PSADSSF4                                                 03219000
PSADSS10 EQU   PSADSSF4                                                 03220000
PSADSSVE EQU   PSADSSF4                                                 03221000
PSADSSDE EQU   PSADSSF4                                                 03222000
PSADSSC0 EQU   PSADSSF4                                                 03223000
PSADSSIE EQU   PSADSSF4                                                 03224000
PSADSS12 EQU   PSADSSF4                                                 03225000
PSADSSRC EQU   PSADSSF4                                                 03226000
PSARV057 EQU   PSADSSF3                                                 03227000
PSARV056 EQU   PSADSSF3                                                 03228000
PSARV055 EQU   PSADSSF3                                                 03229000
PSADSSMC EQU   PSADSSF3                                                 03230000
PSADSSRW EQU   PSADSSF3                                                 03231000
PSADSSNM EQU   PSADSSF3                                                 03232000
PSADSSES EQU   PSADSSF3                                                 03233000
PSADSSGP EQU   PSADSSF3                                                 03234000
PSADSSF2 EQU   PSADSSFL+1                                               03235000
PSADSSPI EQU   PSADSSF1                                                 03236000
PSADSSOI EQU   PSADSSF1                                                 03237000
PSADSSSP EQU   PSADSSF1                                                 03238000
PSADSSTP EQU   PSADSSF1                                                 03239000
PSADSSDW EQU   PSADSSF1                                                 03240000
PSADSSDD EQU   PSADSSF1                                                 03241000
PSADSSDM EQU   PSADSSF1                                                 03242000
PSADSSMV EQU   PSADSSF1                                                 03243000
PSADSSTS EQU   PSA+816                                                  03244000
PSADSSWK EQU   PSA+812                                                  03245000
PSADSSR3 EQU   PSA+808                                                  03246000
PSADSSR2 EQU   PSA+804                                                  03247000
PSADSSRS EQU   PSA+800                                                  03248000
PSASTOR  EQU   PSA+796                                                  03249000
PSACPUSA EQU   PSA+794                                                  03250000
PSAVSTAP EQU   PSA+792                                                  03251000
PSAWKVAP EQU   PSA+788                                                  03252000
PSAWKRAP EQU   PSA+784                                                  03253000
PSAMCHIC EQU   PSA+783                                                  03254000
PSARV061 EQU   PSA+782                                                  03255000
PSASYMSK EQU   PSA+781                                                  03256000
PSAMCHFL EQU   PSA+780                                                  03257000
PSACR0   EQU   PSA+776                                                  03258000
PSAPSWSV EQU   PSA+768                                                  03259000
PSACLHS  EQU   PSAHLHI                                                  03260000
PSALKR15 EQU   PSALKSA+60                                               03261000
PSALKR14 EQU   PSALKSA+56                                               03262000
PSALKR13 EQU   PSALKSA+52                                               03263000
PSALKR12 EQU   PSALKSA+48                                               03264000
PSALKR11 EQU   PSALKSA+44                                               03265000
PSALKR10 EQU   PSALKSA+40                                               03266000
PSALKR9  EQU   PSALKSA+36                                               03267000
PSALKR8  EQU   PSALKSA+32                                               03268000
PSALKR7  EQU   PSALKSA+28                                               03269000
PSALKR6  EQU   PSALKSA+24                                               03270000
PSALKR5  EQU   PSALKSA+20                                               03271000
PSALKR4  EQU   PSALKSA+16                                               03272000
PSALKR3  EQU   PSALKSA+12                                               03273000
PSALKR2  EQU   PSALKSA+8                                                03274000
PSALKR1  EQU   PSALKSA+4                                                03275000
PSALKR0  EQU   PSALKSA                                                  03276000
PSARV023 EQU   PSACLHT+52                                               03277000
PSALOCAL EQU   PSACLHT+48                                               03278000
PSACMSL  EQU   PSACLHT+44                                               03279000
PSAOPTL  EQU   PSACLHT+40                                               03280000
PSATPACL EQU   PSACLHT+36                                               03281000
PSATPDNL EQU   PSACLHT+32                                               03282000
PSATPNCL EQU   PSACLHT+28                                               03283000
PSAIOSLL EQU   PSACLHT+24                                               03284000
PSAIOSUL EQU   PSACLHT+20                                               03285000
PSAIOSCL EQU   PSACLHT+16                                               03286000
PSAIOSSL EQU   PSACLHT+12                                               03287000
PSASALCL EQU   PSACLHT+8                                                03288000
PSAASML  EQU   PSACLHT+4                                                03289000
PSADISPL EQU   PSACLHT                                                  03290000
PSASRSA  EQU   PSA+636                                                  03291000
PSARV050 EQU   PSA+634                                                  03292000
PSADSSGO EQU   PSA+633                                                  03293000
PSARECUR EQU   PSA+632                                                  03294000
PSAHLHIS EQU   PSA+628                                                  03295000
PSAIPCSA EQU   PSA+624                                                  03296000
@NM00063 EQU   PSA+621                                                  03297000
PSAIPCDM EQU   PSA+620                                                  03298000
PSAIPCD  EQU   PSA+616                                                  03299000
@NM00062 EQU   PSA+613                                                  03300000
PSAIPCRM EQU   PSA+612                                                  03301000
PSAIPCR  EQU   PSA+608                                                  03302000
PSAMCHEX EQU   PSA+600                                                  03303000
PSAMPSW  EQU   PSA+592                                                  03304000
PSAEXPS2 EQU   PSA+584                                                  03305000
PSAEXPS1 EQU   PSA+576                                                  03306000
PSAPIREG EQU   PSA+572                                                  03307000
PSARSREG EQU   PSA+568                                                  03308000
PSAGPREG EQU   PSA+556                                                  03309000
PSARV022 EQU   PSASUP4                                                  03310000
PSARV021 EQU   PSASUP4                                                  03311000
PSARV020 EQU   PSASUP4                                                  03312000
PSARV019 EQU   PSASUP4                                                  03313000
PSARV018 EQU   PSASUP4                                                  03314000
PSARV017 EQU   PSASUP4                                                  03315000
PSARV016 EQU   PSASUP4                                                  03316000
PSARV015 EQU   PSASUP4                                                  03317000
PSARV014 EQU   PSASUP3                                                  03318000
PSAULCMS EQU   PSASUP3                                                  03319000
PSARV012 EQU   PSASUP3                                                  03320000
PSAESTA  EQU   PSASUP3                                                  03321000
PSASPR   EQU   PSASUP3                                                  03322000
PSAPSREG EQU   PSASUP3                                                  03323000
PSAPI2   EQU   PSASUP3                                                  03324000
PSAIOSUP EQU   PSASUP3                                                  03325000
PSALCR   EQU   PSASUP2                                                  03326000
PSARTM   EQU   PSASUP2                                                  03327000
PSAACR   EQU   PSASUP2                                                  03328000
PSAIPCE2 EQU   PSASUP2                                                  03329000
PSAIPCES EQU   PSASUP2                                                  03330000
PSAIPCEC EQU   PSASUP2                                                  03331000
PSAGTF   EQU   PSASUP2                                                  03332000
PSAIPCRI EQU   PSASUP2                                                  03333000
PSATYPE6 EQU   PSASUP1                                                  03334000
PSATCTL  EQU   PSASUP1                                                  03335000
PSADISP  EQU   PSASUP1                                                  03336000
PSALOCK  EQU   PSASUP1                                                  03337000
PSAPI    EQU   PSASUP1                                                  03338000
PSAEXT   EQU   PSASUP1                                                  03339000
PSASVC   EQU   PSASUP1                                                  03340000
PSAIO    EQU   PSASUP1                                                  03341000
PSAAOLD  EQU   PSA+548                                                  03342000
PSAANEW  EQU   PSA+544                                                  03343000
PSATOLD  EQU   PSA+540                                                  03344000
PSATNEW  EQU   PSA+536                                                  03345000
PSALCCAR EQU   PSA+532                                                  03346000
PSALCCAV EQU   PSA+528                                                  03347000
PSAPCCAR EQU   PSA+524                                                  03348000
PSAPCCAV EQU   PSA+520                                                  03349000
PSACPULA EQU   PSA+518                                                  03350000
PSACPUPA EQU   PSA+516                                                  03351000
PSAPSA   EQU   PSA+512                                                  03352000
FLCHDEND EQU   PSA+512                                                  03353000
FLCCRSAV EQU   FLCMCLA+280                                              03354000
FLCGRSAV EQU   FLCMCLA+216                                              03355000
FLCFPSAV EQU   FLCMCLA+184                                              03356000
FLCFLA   EQU   FLCMCLA+88                                               03357000
FLCRGNCD EQU   FLCMCLA+84                                               03358000
FLCFSAA  EQU   FLCFSA+1                                                 03359000
@NM00061 EQU   FLCFSA                                                   03360000
@NM00060 EQU   FLCMCLA+72                                               03361000
FLCMCIC  EQU   FLCMCLA+64                                               03362000
@NM00059 EQU   FLCMCLA+20                                               03363000
FLCIOAA  EQU   FLCIOA+1                                                 03364000
@NM00058 EQU   FLCIOA                                                   03365000
@NM00057 EQU   FLCMCLA+15                                               03366000
@NM00056 EQU   FLCMCLA+14                                               03367000
@NM00055 EQU   FLCMCLA+12                                               03368000
FLCLCL   EQU   FLCMCLA+8                                                03369000
FLCIOELA EQU   FLCIOEL+1                                                03370000
@NM00054 EQU   FLCIOEL                                                  03371000
FLCCHNID EQU   FLCMCLA                                                  03372000
@NM00053 EQU   PSA+160                                                  03373000
FLCMTRCD EQU   PSA+157                                                  03374000
@NM00052 EQU   PSA+156                                                  03375000
FLCPERA  EQU   FLCPER+1                                                 03376000
@NM00051 EQU   FLCPER                                                   03377000
@NM00050 EQU   PSA+151                                                  03378000
FLCPERCD EQU   PSA+150                                                  03379000
FLCMCNUM EQU   PSA+149                                                  03380000
@NM00049 EQU   PSA+148                                                  03381000
FLCTEAA  EQU   FLCTEA+1                                                 03382000
@NM00048 EQU   FLCTEA                                                   03383000
PSAPIPC  EQU   PSAPICOD                                                 03384000
PSAPIMC  EQU   PSAPICOD                                                 03385000
PSAPIPER EQU   PSAPICOD                                                 03386000
PSARV049 EQU   FLCPICOD                                                 03387000
FLCPILCB EQU   FLCPIILC                                                 03388000
@NM00047 EQU   FLCPIILC                                                 03389000
@NM00046 EQU   PSAEPPSW                                                 03390000
FLCSVCN  EQU   PSAESPSW+2                                               03391000
FLCSILCB EQU   FLCSVILC                                                 03392000
@NM00045 EQU   FLCSVILC                                                 03393000
@NM00044 EQU   PSAESPSW                                                 03394000
FLCEICOD EQU   PSAEEPSW+2                                               03395000
PSASPAD  EQU   PSAEEPSW                                                 03396000
@NM00043 EQU   PSA+128                                                  03397000
FLCINPSW EQU   PSA+120                                                  03398000
FLCMNPSW EQU   PSA+112                                                  03399000
FLCPNPSW EQU   PSA+104                                                  03400000
FLCSNPSW EQU   PSA+96                                                   03401000
FLCENPSW EQU   PSA+88                                                   03402000
FLCTRACE EQU   PSA+84                                                   03403000
FLCTIMER EQU   PSA+80                                                   03404000
FLCCVT2  EQU   PSA+76                                                   03405000
FLCCAW   EQU   PSA+72                                                   03406000
FLCCSW   EQU   PSA+64                                                   03407000
FLCIOPSW EQU   PSA+56                                                   03408000
FLCMOPSW EQU   PSA+48                                                   03409000
FLCPOPSW EQU   PSA+40                                                   03410000
FLCSOPSW EQU   PSA+32                                                   03411000
FLCEOPSW EQU   PSA+24                                                   03412000
@NM00042 EQU   FLCICCW2+4                                               03413000
FLCCVT   EQU   FLCICCW2                                                 03414000
FLCICCW1 EQU   FLCROPSW                                                 03415000
FLCIPPSW EQU   FLCRNPSW                                                 03416000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03417000
@RT00079 EQU   DOSPIE                                                   03418000
@RT00109 EQU   DOSVC13                                                  03419000
@RT00129 EQU   PGMGR                                                    03420000
@RC00125 EQU   @RC00121                                                 03421000
@RC00218 EQU   @RC00178                                                 03422000
@RT00233 EQU   DODETACH                                                 03423000
@RT00283 EQU   PGMGRCK                                                  03424000
TESTCS   EQU   @EL00002                                                 03425000
@RC00131 EQU   @RC00125                                                 03426000
@RC00143 EQU   @RC00125                                                 03427000
@ENDDATA EQU   *                                                        03428000
         END   IGC003,(C'PLS2132',0701,78093)                           03429000
