         TITLE 'IEAVAD0A - SQA,LSQA DISPLAY                            *00001000
                        '                                               00002000
IEAVAD0A CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IEAVAD0A  77.077'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  ST    @14,12(,@13)                                        0001 00010000
         STM   @00,@12,20(@13)                                     0001 00011000
         BALR  @06,0                                               0001 00012000
@PSTART  DS    0H                                                  0001 00013000
         USING @PSTART,@06                                         0001 00014000
*                                                                  0068 00015000
*/*                    END OF TCB                                    */ 00016000
*                                                                  0069 00017000
*                                                                  0069 00018000
*   /*****************************************************************/ 00019000
*   /*                                                               */ 00020000
*   /* INITIALIZATION ON ENTRY FIRST THE ADDRESSING REGISTERS ARE    */ 00021000
*   /* INITIALIZED, THEN A SAVE AREA FOR THE REGISTER SAVE AREA AND  */ 00022000
*   /* AUTOMATIC DATA AREA IS OBTAINED FROM LSQA. THE ADDRESS OF THE */ 00023000
*   /* AREA IS RETURNED IN ABDGMA, AND THE ADDRESS OF THE GETMAIN    */ 00024000
*   /* PARAMETER LIST IS PASSED IN REGISTER 1. NEXT THE SAVE AREAS   */ 00025000
*   /* ARE CHAINED, AND THE TEMPORARY WORK AREA ZTEMPS IS CLEARED TO */ 00026000
*   /* ZEROS SO THAT THE BOUNDARY ADJUSTMENT MOVES CAN BE DONE       */ 00027000
*   /* PROPERLY.                                                     */ 00028000
*   /*                                                               */ 00029000
*   /*****************************************************************/ 00030000
*                                                                  0069 00031000
*   ABDARPTR=PARMPTR;               /* THE ABDAREA SAVE AREA IS    0069 00032000
*                                      INITIALIZED FROM THE VALUE IN    00033000
*                                      REGISTER 1                    */ 00034000
         LR    ABDARPTR,PARMPTR                                    0069 00035000
*   PARMPTR=ADDR(ABDASIZE);         /* REGISTER 1 IS SET TO POINT TO    00036000
*                                      THE GETMAIN PARAMETER LIST    */ 00037000
         LA    PARMPTR,ABDASIZE(,ABDARPTR)                         0070 00038000
*   GENERATE;                                                      0071 00039000
         GETMAIN EC,LV=@ENDDATD-@DATD+72+3208,                         *00040000
               SP=253,                                                 *00041000
               A=ABDGMA(ABDARPTR),                                     *00042000
               MF=(E,(1))                                               00043000
*   IF RETCODE^=0 THEN              /* GETMAIN SUCCESSFUL            */ 00044000
         LTR   RETCODE,RETCODE                                     0072 00045000
         BZ    @RF00072                                            0072 00046000
*     SAVERET=8;                    /* NO, SET RETURN CODE           */ 00047000
         LA    SAVERET,8                                           0073 00048000
*   ELSE                                                           0074 00049000
*     DO;                                                          0074 00050000
         B     @RC00072                                            0074 00051000
@RF00072 DS    0H                                                  0075 00052000
*       PARMPTR=ABDAAREA;           /* USE PARMPTR AS TEMPORARY    0075 00053000
*                                      POINTER TO SAVE AREA          */ 00054000
         L     PARMPTR,ABDAAREA(,ABDARPTR)                         0075 00055000
*       NEXSAPTR=PARMPTR;           /* INITIALIZE NEXT SAVE AREA   0076 00056000
*                                      POINTER IN OLD SAVE AREA      */ 00057000
         ST    PARMPTR,NEXSAPTR(,SAVEPTR)                          0076 00058000
*       PRESAPTR=SAVEPTR;           /* INITIALIZE PREVIOUS SAVE AREA    00059000
*                                      POINTER IN NEW AREA           */ 00060000
         ST    SAVEPTR,PRESAPTR(,PARMPTR)                          0077 00061000
*       SAVEPTR=PARMPTR;            /* SET SAVE REGISTER TO NEW SAVE    00062000
*                                      AREA ADDRESS                  */ 00063000
         LR    SAVEPTR,PARMPTR                                     0078 00064000
*       RFY                                                        0079 00065000
*         R5 RSTD;                                                 0079 00066000
*       R5=SAVEPTR+72;              /* TABLE STARTS AT END OF      0080 00067000
*                                      SAVEAREA STORAGE      @G33SPHW*/ 00068000
         LA    R5,72                                               0080 00069000
         ALR   R5,SAVEPTR                                          0080 00070000
*       AUTOPTR=R5+TABSZ;           /* DATA AREA BEGINS AT END OF  0081 00071000
*                                      STORAGE TABLE         @G33SPHW*/ 00072000
         LA    AUTOPTR,3208                                        0081 00073000
         ALR   AUTOPTR,R5                                          0081 00074000
*       GENERATE;                                                  0082 00075000
         USING @DATD,AUTOPTR       ESTABLISH ADDRESSABILITY             00076000
         XC 0(@ENDDATD-@DATD,AUTOPTR),0(AUTOPTR) ZERO STORAGE           00077000
*       FRSTTABL=R5;                /* INITIALIZE TABLE ANCHOR     0083 00078000
*                                                            @G33SPHW*/ 00079000
         ST    R5,FRSTTABL                                         0083 00080000
*       STORPTR=FRSTTABL;           /* INITIALIZE TABLE POINTER    0084 00081000
*                                                            @G33SPHW*/ 00082000
         L     @08,FRSTTABL                                        0084 00083000
         ST    @08,STORPTR                                         0084 00084000
*       FWDPTR=0;                   /* INITIALIZE FORWARD POINTER TO    00085000
*                                      ZERO                  @G33SPHW*/ 00086000
         SLR   @07,@07                                             0085 00087000
         ST    @07,FWDPTR(,@08)                                    0085 00088000
*       BWDPTR=0;                   /* INITIALIZE BACKWARD POINTER TO   00089000
*                                      ZERO                  @G33SPHW*/ 00090000
         ST    @07,BWDPTR(,@08)                                    0086 00091000
*       RFY                                                        0087 00092000
*         R5 UNRSTD;                /*                       @G33SPHW*/ 00093000
*       ASCBPTR=PSAAOLD;            /* GET PTR TO CURRENT ASCB     0088 00094000
*                                                            @G33SPHW*/ 00095000
         MVC   ASCBPTR(4),PSAAOLD                                  0088 00096000
*       PARMPTR=ABDARPTR;           /* INITIALIZE PARAMETER REG      */ 00097000
         LR    PARMPTR,ABDARPTR                                    0089 00098000
*       SAVERET=0;                  /* INIT RETURN CODE              */ 00099000
         SLR   SAVERET,SAVERET                                     0090 00100000
*       ENTLIMIT=0;                 /* INITIALIZE TOTAL ENTRY      0091 00101000
*                                      COUNTER.              @G33SPHW*/ 00102000
         STH   @07,ENTLIMIT                                        0091 00103000
*       CTR=0;                      /* INITIALIZE CURRENT ENTRY    0092 00104000
*                                      COUNTER.              @G33SPHW*/ 00105000
         STH   @07,CTR                                             0092 00106000
*       IF TCBPTR=ABDTCB THEN       /* DUMP OF CURRENT TASK          */ 00107000
         C     TCBPTR,ABDTCB(,ABDARPTR)                            0093 00108000
         BNE   @RF00093                                            0093 00109000
*         DO;                       /* YES                           */ 00110000
*           IF TCBLTC^=0&           /* DOES TASK HAVE DAUGHTER       */ 00111000
*               TCBLTC->TCBJSTCB=TCBLTC/* WHICH IS A JOB STEP TASK   */ 00112000
*             THEN                                                 0095 00113000
         L     @08,TCBLTC(,TCBPTR)                                 0095 00114000
         CR    @08,@07                                             0095 00115000
         BE    @RF00095                                            0095 00116000
         C     @08,TCBJSTCB(,@08)                                  0095 00117000
         BE    @RT00095                                            0095 00118000
*             ;                     /* YES, DO NOT SET TASK ND       */ 00119000
*           ELSE                                                   0097 00120000
*             DO;                                                  0097 00121000
@RF00095 DS    0H                                                  0098 00122000
*               TCBADMP='1'B;       /* INDICATE TASK REQUESTING    0098 00123000
*                                                              STATUS*/ 00124000
         OI    TCBADMP(TCBPTR),B'00000010'                         0098 00125000
*               ABDSTAT='1'B;       /* IND STATUS ISSUED     @YM06195*/ 00126000
         OI    ABDSTAT(ABDARPTR),B'00000010'                       0099 00127000
*               GENERATE;                                          0100 00128000
          STATUS SET,ND,STEP,(1)   SET JOB NON-DISPATCHABLE             00129000
*             END;                                                 0101 00130000
*         END;                                                     0102 00131000
@RT00095 DS    0H                                                  0103 00132000
*       IF ABDOLSQA='1'B THEN       /* LSQA REQUESTED        @G33SPHW*/ 00133000
@RF00093 TM    ABDOLSQA(ABDARPTR),B'00100000'                      0103 00134000
         BNO   @RF00103                                            0103 00135000
*         DO;                       /* YES                   @G33SPHW*/ 00136000
*                                                                  0104 00137000
*           /*********************************************************/ 00138000
*           /*                                                       */ 00139000
*           /* THIS SECTION OF CODE DISPLAYES LSQA                   */ 00140000
*           /*                                                       */ 00141000
*           /*********************************************************/ 00142000
*                                                                  0105 00143000
*           PARMPTR=ABDARPTR;       /* SET R1 TO ABDA ADDRESS      0105 00144000
*                                                            @G33SPHW*/ 00145000
         LR    PARMPTR,ABDARPTR                                    0105 00146000
*           LDAPTR=ASCBLDA;         /* GET PTR TO LDA                */ 00147000
         L     @08,ASCBPTR                                         0106 00148000
         L     @08,ASCBLDA(,@08)                                   0106 00149000
         ST    @08,LDAPTR                                          0106 00150000
*           IF LSQAPTR^=0 THEN      /* DOES SPQE EXIST FOR LSQA      */ 00151000
         ICM   @07,15,LSQAPTR(@08)                                 0107 00152000
         BZ    @RF00107                                            0107 00153000
*             DO;                   /* YES                           */ 00154000
*               ABDLINEA(1:15)=LSQAMSG;/* SET UP LSQA HEADING        */ 00155000
         MVC   ABDLINEA(15,ABDARPTR),LSQAMSG                       0109 00156000
*               CALL IEAVAD11;      /* PUT OUT HEADING               */ 00157000
         L     @15,@CV00059                                        0110 00158000
         BALR  @14,@15                                             0110 00159000
*               SPQESPTR=LSQAPTR;   /* GET SPQE PTR FOR LSQA         */ 00160000
         L     @08,LDAPTR                                          0111 00161000
         MVC   SPQESPTR(4),LSQAPTR(@08)                            0111 00162000
*               CALL D0ADSPLY;      /* BUILD STORAGE TABLE           */ 00163000
         BAL   @14,D0ADSPLY                                        0112 00164000
*               CALL D0ASORT;       /* SORT STORAGE TABLE    @G33SPHW*/ 00165000
         BAL   @14,D0ASORT                                         0113 00166000
*               CALL D0APRNT;       /* DISPLAY STORAGE       @G33SPHW*/ 00167000
         BAL   @14,D0APRNT                                         0114 00168000
*             END;                                                 0115 00169000
*         END;                                                     0116 00170000
@RF00107 DS    0H                                                  0117 00171000
*       IF ABDSQA='1'B THEN         /* SQA REQUESTED                 */ 00172000
@RF00103 TM    ABDSQA(ABDARPTR),B'00010000'                        0117 00173000
         BNO   @RF00117                                            0117 00174000
*         DO;                                                      0118 00175000
*                                                                  0118 00176000
*           /*********************************************************/ 00177000
*           /*                                                       */ 00178000
*           /* THIS SECTION OF CODE DISPLAYS SQA                     */ 00179000
*           /*                                                       */ 00180000
*           /*********************************************************/ 00181000
*                                                                  0119 00182000
*           PARMPTR=ABDARPTR;       /* SET R1 TO ABDA ADDRESS      0119 00183000
*                                                            @G33SPHW*/ 00184000
         LR    PARMPTR,ABDARPTR                                    0119 00185000
*           GDAPTR=CVTGDA;          /* GET ADDR OF GDA               */ 00186000
         L     @08,CVTPTR                                          0120 00187000
         L     @08,CVTGDA(,@08)                                    0120 00188000
         ST    @08,GDAPTR                                          0120 00189000
*           IF SQASPQEP^=0 THEN     /* DOES SPQE EXIST FOR SQA       */ 00190000
         ICM   @07,15,SQASPQEP(@08)                                0121 00191000
         BZ    @RF00121                                            0121 00192000
*             DO;                   /* YES                           */ 00193000
*               ABDSQSDM='1'B;      /* INDICATE SQA BEING DUMPED     */ 00194000
         OI    ABDSQSDM(ABDARPTR),B'00001000'                      0123 00195000
*               ABDLINEA(1:15)=LSQAMSG;/* SET SQA HEADING            */ 00196000
         MVC   ABDLINEA(15,ABDARPTR),LSQAMSG                       0124 00197000
*               ABDLINEA(12)=' ';   /* CHANGE L TO BLANK             */ 00198000
         MVI   ABDLINEA+11(ABDARPTR),C' '                          0125 00199000
*               CALL IEAVAD11;      /* PUT OUT HEADING               */ 00200000
         L     @15,@CV00059                                        0126 00201000
         BALR  @14,@15                                             0126 00202000
*               SPQESPTR=SQASPQEP;  /* GET SPQE PTR FOR SQA          */ 00203000
         L     @08,GDAPTR                                          0127 00204000
         MVC   SPQESPTR(4),SQASPQEP(@08)                           0127 00205000
*               CALL D0ADSPLY;      /* BUILD STORAGE TABLE   @G33SPHW*/ 00206000
         BAL   @14,D0ADSPLY                                        0128 00207000
*               CALL D0ASORT;       /* SORT STORAGE LIST     @G33SPHW*/ 00208000
         BAL   @14,D0ASORT                                         0129 00209000
*               CALL D0APRNT;       /* PRINT STORAGE         @G33SPHW*/ 00210000
         BAL   @14,D0APRNT                                         0130 00211000
*             END;                                                 0131 00212000
*         END;                                                     0132 00213000
@RF00121 DS    0H                                                  0133 00214000
*       IF TCBPTR=ABDTCB THEN       /* WAS DUMP OF CURRENT TCB       */ 00215000
@RF00117 C     TCBPTR,ABDTCB(,ABDARPTR)                            0133 00216000
         BNE   @RF00133                                            0133 00217000
*         DO;                       /* YES                           */ 00218000
*           IF TCBLTC^=0&           /* DOES TASK HAVE DAUGHTER       */ 00219000
*               TCBLTC->TCBJSTCB=TCBLTC/* WHICH IS A JOB STEP TASK   */ 00220000
*             THEN                                                 0135 00221000
         L     @08,TCBLTC(,TCBPTR)                                 0135 00222000
         LTR   @08,@08                                             0135 00223000
         BZ    @RF00135                                            0135 00224000
         C     @08,TCBJSTCB(,@08)                                  0135 00225000
         BE    @RT00135                                            0135 00226000
*             ;                     /* YES, DO NOT SET TASK ND       */ 00227000
*           ELSE                                                   0137 00228000
*             DO;                                                  0137 00229000
@RF00135 DS    0H                                                  0138 00230000
*               ABDSTAT='0'B;       /* IND STATUS RESET      @YM06195*/ 00231000
         NI    ABDSTAT(ABDARPTR),B'11111101'                       0138 00232000
*               GENERATE;                                          0139 00233000
         STATUS RESET,ND,STEP,(1) RESET JOB STEP DISPATCHABLE           00234000
*               TCBADMP='0'B;       /* TURN OFF STATUS REQUESTOR   0140 00235000
*                                      INDICATOR                     */ 00236000
         NI    TCBADMP(TCBPTR),B'11111101'                         0140 00237000
*             END;                                                 0141 00238000
*         END;                                                     0142 00239000
@RT00135 DS    0H                                                  0143 00240000
*                                                                  0143 00241000
*       /*************************************************************/ 00242000
*       /*                                                           */ 00243000
*       /* FREE THE STORAGE USED TO HOLD STORAGE ADDRESSES. THE FIRST*/ 00244000
*       /* TABLE POINTED TO BY FRSTTABL, IS FREED BY EXIT CLEAN UP.  */ 00245000
*       /* IF MORE THAN ONE TABLE WAS AQCQUIRED THEY WILL FREED BY   */ 00246000
*       /* THIS ROUTINE.                                     @G33SPHW*/ 00247000
*       /*                                                           */ 00248000
*       /*************************************************************/ 00249000
*                                                                  0143 00250000
*       STORPTR=FRSTTABL;           /* GET FIRST TABLE ADDRESS     0143 00251000
*                                                            @G33SPHW*/ 00252000
@RF00133 L     @08,FRSTTABL                                        0143 00253000
         ST    @08,STORPTR                                         0143 00254000
*       IF FWDPTR^=0 THEN           /* MORE THAN ONE TABLE   @G33SPHW*/ 00255000
         ICM   @07,15,FWDPTR(@08)                                  0144 00256000
         BZ    @RF00144                                            0144 00257000
*         DO;                       /* YES.. FREE ALL        @G33SPHW*/ 00258000
*           DO WHILE FWDPTR^=0;     /* FIND END OF CHAIN     @G33SPHW*/ 00259000
         B     @DE00146                                            0146 00260000
@DL00146 DS    0H                                                  0147 00261000
*             STORPTR=FWDPTR;       /* NEXT TABLE ADDRESS    @G33SPHW*/ 00262000
         L     @08,STORPTR                                         0147 00263000
         L     @08,FWDPTR(,@08)                                    0147 00264000
         ST    @08,STORPTR                                         0147 00265000
*           END;                    /* END ..DO WHILE LAST TBL     0148 00266000
*                                                            @G33SPHW*/ 00267000
@DE00146 L     @08,STORPTR                                         0148 00268000
         ICM   @07,15,FWDPTR(@08)                                  0148 00269000
         BNZ   @DL00146                                            0148 00270000
*           DO WHILE BWDPTR^=0;     /* PROCESS TBL FROM BACK @G33SPHW*/ 00271000
         B     @DE00149                                            0149 00272000
@DL00149 DS    0H                                                  0150 00273000
*             R0=TABSZ;             /* PUT SIZE OF TABLE IN R0     0150 00274000
*                                                            @G33SPHW*/ 00275000
         LA    R0,3208                                             0150 00276000
*             R1=STORPTR;           /* PUT ADDRESS OF TBL IN R1    0151 00277000
*                                                            @G33SPHW*/ 00278000
         L     @08,STORPTR                                         0151 00279000
         LR    R1,@08                                              0151 00280000
*             STORPTR=BWDPTR;       /* SAVE PREVIOUS TABLE ADDR    0152 00281000
*                                                            @G33SPHW*/ 00282000
         L     @08,BWDPTR(,@08)                                    0152 00283000
         ST    @08,STORPTR                                         0152 00284000
*             FREEAREA=R1;          /* GET AREA TO BE FREED  @G33SPHW*/ 00285000
         ST    R1,FREEAREA                                         0153 00286000
*             DO;                   /* FREEMAIN(RC)                0154 00287000
*                                      LV(R0)A(FREEAREA->I256C)    0154 00288000
*                                      SP(253)                       */ 00289000
*               RESPECIFY                                          0155 00290000
*                (GPR01F,                                          0155 00291000
*                 GPR15F,                                          0155 00292000
*                 GPR00F) RESTRICTED;                              0155 00293000
*               GPR01F=0;           /* REG 1 MUST BE ZERO            */ 00294000
         SLR   GPR01F,GPR01F                                       0156 00295000
*               GPR15F=1;           /* SET TYPE                      */ 00296000
         LA    GPR15F,1                                            0157 00297000
*               GPR00F=R0;          /* LENGTH REQUESTED              */ 00298000
*               GPR01F=ADDR(FREEAREA->I256C);/* SET REGISTER ONE     */ 00299000
         L     @08,FREEAREA                                        0159 00300000
         LR    GPR01F,@08                                          0159 00301000
*               GPR15F=GPR15F+((253)*256);/* SUBPOOL VALUE           */ 00302000
         AL    GPR15F,@CF02135                                     0160 00303000
*               SVC(120);           /* RC/RU-FORM OF GETMAIN         */ 00304000
         SVC   120                                                 0161 00305000
*               RESPECIFY                                          0162 00306000
*                (GPR01F,                                          0162 00307000
*                 GPR15F,                                          0162 00308000
*                 GPR00F) UNRESTRICTED;                            0162 00309000
*             END;                  /* FREEMAIN(RC)                0163 00310000
*                                      LV(R0)A(FREEAREA->I256C)    0163 00311000
*                                      SP(253)                       */ 00312000
*           END;                    /* END.. DO WHILE FREEMAIN     0164 00313000
*                                                            @G33SPHW*/ 00314000
@DE00149 L     @08,STORPTR                                         0164 00315000
         ICM   @07,15,BWDPTR(@08)                                  0164 00316000
         BNZ   @DL00149                                            0164 00317000
*         END;                      /* END... MULTI TABLES   @G33SPHW*/ 00318000
*       PARMPTR=ADDR(ABDASIZE);     /* SET UP FREEMAIN LIST REG      */ 00319000
@RF00144 LA    PARMPTR,ABDASIZE(,ABDARPTR)                         0166 00320000
*       ABDAAREA=SAVEPTR;           /* SET UP ADDRESS TO FREE        */ 00321000
         ST    SAVEPTR,ABDAAREA(,ABDARPTR)                         0167 00322000
*       SAVEPTR=SAVEPTR->PRESAPTR;  /* SET UP PREVIOUS SAVE AREA     */ 00323000
         L     SAVEPTR,PRESAPTR(,SAVEPTR)                          0168 00324000
*       NEXSAPTR=0;                 /* CLEAR POINTER TO AREA TO BE 0169 00325000
*                                      FREED                         */ 00326000
         SLR   @08,@08                                             0169 00327000
         ST    @08,NEXSAPTR(,SAVEPTR)                              0169 00328000
*       GENERATE;                                                  0170 00329000
         FREEMAIN E,LV=@ENDDATD-@DATD+72+3208,                         *00330000
               SP=253,                                                 *00331000
               A=ABDGMA(ABDARPTR),                                     *00332000
               MF=(E,(1))                                               00333000
*     END;                                                         0171 00334000
*   RETCODE=SAVERET;                /* SET UP RETURN CODE            */ 00335000
@RC00072 LR    RETCODE,SAVERET                                     0172 00336000
*   RETURN;                                                        0173 00337000
@EL00001 DS    0H                                                  0173 00338000
@EF00001 DS    0H                                                  0173 00339000
@ER00001 L     @14,12(,@13)                                        0173 00340000
         LM    @00,@12,20(@13)                                     0173 00341000
         BR    @14                                                 0173 00342000
*D0ADSPLY:                                                         0174 00343000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0174 00344000
D0ADSPLY DS    0H                                                  0175 00345000
*   SAVE14=RETERN;                  /* SAVE RETURN ADDR              */ 00346000
*                                                                  0175 00347000
         ST    RETERN,SAVE14                                       0175 00348000
*   /*****************************************************************/ 00349000
*   /*                                                               */ 00350000
*   /* OBTAIN LOCAL LOCK WHILE BUILDING THE STORAGE TABLE    @G33SPHW*/ 00351000
*   /*                                                               */ 00352000
*   /*****************************************************************/ 00353000
*                                                                  0176 00354000
*   GEN REFS(CVTPTR,CVTMAP,CVTCRMN,ABDWORK,PSALITA) SETS(R11,R14); 0176 00355000
     STM  R11,R14,ABDWORK(ABDARPTR) SAVE REGS OVER SETLOCK      G33SPHW 00356000
     SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,RELATED=('IEAVAD0A')         00357000
     LM   R11,R14,ABDWORK(ABDARPTR)  RESTORE REGS AFTER SETLOCK G33SPHW 00358000
*   DQELNSVE=0;                     /* INIT LENGTH SAVE FIELD TO ZERO*/ 00359000
         SLR   @08,@08                                             0177 00360000
         ST    @08,DQELNSVE                                        0177 00361000
*   DQESEPTR=SPDQEPTR;              /* GET FIRST DQE PTR             */ 00362000
         L     @07,SPQESPTR                                        0178 00363000
         L     @07,SPDQEPTR(,@07)                                  0178 00364000
         ST    @07,DQESEPTR                                        0178 00365000
*   DQEBLKSV=DQEBLKAD;              /* GET ADDR OF AREA DESCRIBED BY    00366000
*                                      DQE                           */ 00367000
         MVC   DQEBLKSV(4),DQEBLKAD(@07)                           0179 00368000
*   CTR=0;                          /* RESET CURRENT ENTRY COUNTER 0180 00369000
*                                                            @G33SPHW*/ 00370000
         STH   @08,CTR                                             0180 00371000
*   DO WHILE(DQESEPTR^=0);          /* LOOP UNTIL ALL DQES ARE     0181 00372000
*                                      PROCESSED                     */ 00373000
         B     @DE00181                                            0181 00374000
@DL00181 DS    0H                                                  0182 00375000
*     ABDBLOCK=DQEBLKSV;            /* GET ADDR OF AREA              */ 00376000
         MVC   ABDBLOCK(4,ABDARPTR),DQEBLKSV                       0182 00377000
*     ABDLENTH=FOURK;               /* GET LENGTH OF AREA TO BE    0183 00378000
*                                      DISPLAYED                     */ 00379000
         MVC   ABDLENTH(4,ABDARPTR),@CF00066                       0183 00380000
*     IF CTR=LIMIT THEN             /* STORAGE TABLE FULL    @G33SPHW*/ 00381000
         LH    @08,CTR                                             0184 00382000
         CH    @08,@CH00078                                        0184 00383000
         BNE   @RF00184                                            0184 00384000
*       DO;                         /* YES.. OBTAIN NEW TABLE      0185 00385000
*                                                            @G33SPHW*/ 00386000
*         ENTLIMIT=ENTLIMIT+CTR;    /* UPDATE TOTAL ENTRY COUNTER  0186 00387000
*                                                            @G33SPHW*/ 00388000
         AH    @08,ENTLIMIT                                        0186 00389000
         STH   @08,ENTLIMIT                                        0186 00390000
*         CALL D0ATABLE;            /* OBTAIN NEW TABLE      @G33SPHW*/ 00391000
         BAL   @14,D0ATABLE                                        0187 00392000
*         IF RETCODE^=0 THEN        /* ERROR GETMAIN FAILED  @G33SPHW*/ 00393000
         SLR   @08,@08                                             0188 00394000
         CR    RETCODE,@08                                         0188 00395000
         BE    @RF00188                                            0188 00396000
*           DO;                     /* YES GET OUT OF LOOP   @G33SPHW*/ 00397000
*             CTR=0;                /* RESET COUNTER         @G33SPHW*/ 00398000
         STH   @08,CTR                                             0190 00399000
*             DQESEPTR=0;           /* ZERO LOOP CONTROL     @G33SPHW*/ 00400000
         ST    @08,DQESEPTR                                        0191 00401000
*             GO TO SKIPREST;       /* SKIP REST OF STORAGE  @G33SPHW*/ 00402000
         B     SKIPREST                                            0192 00403000
*           END;                    /* END NO MORE TABLES    @G33SPHW*/ 00404000
*         CTR=1;                    /* START COUNTER AT ONE  @G33SPHW*/ 00405000
@RF00188 MVC   CTR(2),@CH00085                                     0194 00406000
*       END;                        /* END... END OF TABLE   @G33SPHW*/ 00407000
*     ELSE                          /* NOT END OF TABLE      @G33SPHW*/ 00408000
*       CTR=CTR+1;                  /* INCREMENT CURRENT ENTRY     0196 00409000
*                                      COUNTER               @G33SPHW*/ 00410000
         B     @RC00184                                            0196 00411000
@RF00184 LH    @08,CTR                                             0196 00412000
         LA    @08,1(,@08)                                         0196 00413000
         STH   @08,CTR                                             0196 00414000
*     STORADDR(CTR)=ABDBLOCK;       /* PUT STORAGE ADDRESS IN TABLE     00415000
*                                                            @G33SPHW*/ 00416000
@RC00184 L     @08,STORPTR                                         0197 00417000
         LH    @07,CTR                                             0197 00418000
         SLA   @07,3                                               0197 00419000
         L     @05,ABDBLOCK(,ABDARPTR)                             0197 00420000
         ST    @05,STORADDR-8(@07,@08)                             0197 00421000
*     STORLEN(CTR)=ABDLENTH;        /* PUT LENGTH OF STORAGE IN TABLE   00422000
*                                                            @G33SPHW*/ 00423000
         L     @05,ABDLENTH(,ABDARPTR)                             0198 00424000
         STH   @05,STORLEN-8(@07,@08)                              0198 00425000
*     DQELNSVE=DQELNSVE+FOURK;      /* INCREMENT LENGTH BY ONE PAGE  */ 00426000
         LH    @08,@CH00066                                        0199 00427000
         L     @07,DQELNSVE                                        0199 00428000
         ALR   @07,@08                                             0199 00429000
         ST    @07,DQELNSVE                                        0199 00430000
*     IF DQELNSVE<DQELNTH THEN      /* END OF DQE            @ZM40330*/ 00431000
         L     @05,DQESEPTR                                        0200 00432000
         C     @07,DQELNTH(,@05)                                   0200 00433000
         BNL   @RF00200                                            0200 00434000
*       DQEBLKSV=DQEBLKSV+FOURK;    /* NO, GET ADDR OF NEXT PAGE     */ 00435000
         AL    @08,DQEBLKSV                                        0201 00436000
         ST    @08,DQEBLKSV                                        0201 00437000
*     ELSE                                                         0202 00438000
*       DO;                                                        0202 00439000
         B     @RC00200                                            0202 00440000
@RF00200 DS    0H                                                  0203 00441000
*         DQESEPTR=DQEPTR;          /* GET NEXT DQE PTR              */ 00442000
         L     @08,DQESEPTR                                        0203 00443000
         L     @08,DQEPTR(,@08)                                    0203 00444000
         ST    @08,DQESEPTR                                        0203 00445000
*         DQELNSVE=0;               /* INIT LENGTH SAVE FIELD TO ZERO*/ 00446000
         SLR   @07,@07                                             0204 00447000
         ST    @07,DQELNSVE                                        0204 00448000
*         IF DQESEPTR^=0 THEN       /* IS THERE ANOTHER DQE          */ 00449000
         CR    @08,@07                                             0205 00450000
         BE    @RF00205                                            0205 00451000
*           DQEBLKSV=DQEBLKAD;      /* YES, GET NEXT BLOCK ADDR      */ 00452000
         MVC   DQEBLKSV(4),DQEBLKAD(@08)                           0206 00453000
*       END;                                                       0207 00454000
@RF00205 DS    0H                                                  0208 00455000
*SKIPREST:                                                         0208 00456000
*   END;                                                           0208 00457000
@RC00200 DS    0H                                                  0208 00458000
SKIPREST DS    0H                                                  0208 00459000
@DE00181 ICM   @08,15,DQESEPTR                                     0208 00460000
         BNZ   @DL00181                                            0208 00461000
*   ENTLIMIT=ENTLIMIT+CTR;          /* SAVE TOTAL ENTRY COUNT      0209 00462000
*                                                            @G33SPHW*/ 00463000
*                                                                  0209 00464000
         LH    @08,ENTLIMIT                                        0209 00465000
         AH    @08,CTR                                             0209 00466000
         STH   @08,ENTLIMIT                                        0209 00467000
*   /*****************************************************************/ 00468000
*   /*                                                               */ 00469000
*   /* RELEASE LOCAL LOCK AFTER BUILDING THE STORAGE TABLE   @G33SPHW*/ 00470000
*   /*                                                               */ 00471000
*   /*****************************************************************/ 00472000
*                                                                  0210 00473000
*   GEN REFS(CVTPTR,CVTMAP,CVTCRMN,ABDARPTR,PSALITA) SETS(R11,R14);     00474000
     STM  R11,R14,ABDWORK(ABDARPTR) SAVE REGS OVER SETLOCK      G33SPHW 00475000
     SETLOCK RELEASE,TYPE=LOCAL,RELATED=('IEAVAD0A')                    00476000
     LM   R11,R14,ABDWORK(ABDARPTR)  RESTORE REGS AFTER SETLOCK G33SPHW 00477000
*   RETERN=SAVE14;                  /* RESTORE RETURN ADDR           */ 00478000
         L     RETERN,SAVE14                                       0211 00479000
*   RETURN;                                                        0212 00480000
@EL00002 DS    0H                                                  0212 00481000
@EF00002 DS    0H                                                  0212 00482000
@ER00002 BR    @14                                                 0212 00483000
*   END D0ADSPLY;                                                  0213 00484000
*D0APRNT:                                                          0214 00485000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0214 00486000
*                                                                  0214 00487000
D0APRNT  DS    0H                                                  0215 00488000
*   /*****************************************************************/ 00489000
*   /*                                                               */ 00490000
*   /* PRINT EACH STORAGE AREA IN STORAGE TABLE              @G33SPHW*/ 00491000
*   /* INPUT - FRSTTABL POINTING AT FIRST TABLE              @G33SPHW*/ 00492000
*   /*                                                               */ 00493000
*   /*****************************************************************/ 00494000
*                                                                  0215 00495000
*   PRNTR14=RETERN;                 /* SAVE RETURN ADDRESS   @G33SPHW*/ 00496000
         ST    RETERN,PRNTR14                                      0215 00497000
*   CTR=1;                          /* INITIALIZE COUNTER    @G33SPHW*/ 00498000
         LA    @08,1                                               0216 00499000
         STH   @08,CTR                                             0216 00500000
*   CTR2=1;                         /* INITIALIZE TABLE COUNTER    0217 00501000
*                                                            @G33SPHW*/ 00502000
         STH   @08,CTR2                                            0217 00503000
*   STORPTR=FRSTTABL;               /* GET FIRST TABLE       @G33SPHW*/ 00504000
         MVC   STORPTR(4),FRSTTABL                                 0218 00505000
*   ABDUPRSL='1'B;                  /* SKIP LINE BEGIN AT NEXT PAGE     00506000
*                                                            @G33SPHW*/ 00507000
         OI    ABDUPRSL(ABDARPTR),B'01000000'                      0219 00508000
*   DO WHILE CTR<=ENTLIMIT;         /* DISPLAY ALL STORAGE   @G33SPHW*/ 00509000
         B     @DE00220                                            0220 00510000
@DL00220 DS    0H                                                  0221 00511000
*     UPRFMET='1'B;                 /* IF UPR SKIP PAGE AND CONTINUE    00512000
*                                                            @G33SPHW*/ 00513000
         OI    UPRFMET(ABDARPTR),B'01000000'                       0221 00514000
*     ABDBLOCK=STORADDR(CTR2);      /* PUT ADDRESS IN BUFFER @G33SPHW*/ 00515000
         L     @08,STORPTR                                         0222 00516000
         LH    @07,CTR2                                            0222 00517000
         SLA   @07,3                                               0222 00518000
         L     @05,STORADDR-8(@07,@08)                             0222 00519000
         ST    @05,ABDBLOCK(,ABDARPTR)                             0222 00520000
*     ABDLENTH=STORLEN(CTR2);       /* PUT LENGTH IN BUFFER  @G33SPHW*/ 00521000
         LH    @08,STORLEN-8(@07,@08)                              0223 00522000
         ST    @08,ABDLENTH(,ABDARPTR)                             0223 00523000
*     RFY                                                          0224 00524000
*       R7 RSTD;                                                   0224 00525000
*     GENERATE SETS(R7);                                           0225 00526000
          L      R7,ABDBLOCK(ABDARPTR) ADDR OF AREA TO BE DISPLAYED     00527000
          LRA    R7,0(0,R7)           IS ADDR VALID                     00528000
          BNZ    NXTBLK               ADDR INVALID                      00529000
*     RFY                                                          0226 00530000
*       R7 UNRSTD;                                                 0226 00531000
*     PARMPTR=ABDARPTR;             /* PASS WORKAREA POINTER @G33SPHW*/ 00532000
         LR    PARMPTR,ABDARPTR                                    0227 00533000
*     CALL IEAVAD71;                /* PRINT STORAGE         @G33SPHW*/ 00534000
         L     @15,@CV00060                                        0228 00535000
         BALR  @14,@15                                             0228 00536000
*     ABDUPRSL='0'B;                /* RESET SKIP LINE BIT   @G33SPHW*/ 00537000
         NI    ABDUPRSL(ABDARPTR),B'10111111'                      0229 00538000
*NXTBLK:                                                           0230 00539000
*     IF CTR2=LIMIT THEN            /* END OF TABLE          @G33SPHW*/ 00540000
NXTBLK   CLC   CTR2(2),@CH00078                                    0230 00541000
         BNE   @RF00230                                            0230 00542000
*       DO;                         /* YES ....GET NEXT TABLE      0231 00543000
*                                                            @G33SPHW*/ 00544000
*         STORPTR=FWDPTR;           /* NEXT TABLE            @G33SPHW*/ 00545000
         L     @08,STORPTR                                         0232 00546000
         L     @08,FWDPTR(,@08)                                    0232 00547000
         ST    @08,STORPTR                                         0232 00548000
*         CTR2=1;                   /* RE-INITIALIZE COUNTER @G33SPHW*/ 00549000
         MVC   CTR2(2),@CH00085                                    0233 00550000
*       END;                        /* END... NEW TABLE      @G33SPHW*/ 00551000
*     ELSE                          /* NOT END OF TABLE      @G33SPHW*/ 00552000
*       CTR2=CTR2+1;                /* BUMP ENTRY COUNTER    @G33SPHW*/ 00553000
         B     @RC00230                                            0235 00554000
@RF00230 LH    @08,CTR2                                            0235 00555000
         LA    @08,1(,@08)                                         0235 00556000
         STH   @08,CTR2                                            0235 00557000
*     CTR=CTR+1;                    /* BUMP COUNTER          @G33SPHW*/ 00558000
@RC00230 LH    @08,CTR                                             0236 00559000
         LA    @08,1(,@08)                                         0236 00560000
         STH   @08,CTR                                             0236 00561000
*   END;                            /* END DO WHILE          @G33SPHW*/ 00562000
@DE00220 LH    @08,CTR                                             0237 00563000
         CH    @08,ENTLIMIT                                        0237 00564000
         BNH   @DL00220                                            0237 00565000
*   RETERN=PRNTR14;                 /* RESTORE RETURN ADDRESS      0238 00566000
*                                                            @G33SPHW*/ 00567000
         L     RETERN,PRNTR14                                      0238 00568000
*   END D0APRNT;                    /* RETURN                @G33SPHW*/ 00569000
@EL00003 DS    0H                                                  0239 00570000
@EF00003 DS    0H                                                  0239 00571000
@ER00003 BR    @14                                                 0239 00572000
*D0ASORT:                                                          0240 00573000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0240 00574000
*                                                                  0240 00575000
D0ASORT  DS    0H                                                  0241 00576000
*   /*****************************************************************/ 00577000
*   /*                                                               */ 00578000
*   /* SORT THE STORAGE TABLE FROM LOW TO HIGH STORAGE ADDRESS       */ 00579000
*   /*                                                       @G33SPHW*/ 00580000
*   /*                                                               */ 00581000
*   /*****************************************************************/ 00582000
*                                                                  0241 00583000
*   STORPTR=FRSTTABL;               /* GET FIRST TABLE POINTER     0241 00584000
*                                                            @G33SPHW*/ 00585000
         MVC   STORPTR(4),FRSTTABL                                 0241 00586000
*   SWAP=ONE;                       /* INITIALIZE SWAP SWITCH      0242 00587000
*                                                            @G33SPHW*/ 00588000
         MVI   SWAP,X'01'                                          0242 00589000
*   DO WHILE SWAP^=ZERO;            /* SORT TABLE UNTIL NOCHANGES  0243 00590000
*                                                            @G33SPHW*/ 00591000
         B     @DE00243                                            0243 00592000
@DL00243 DS    0H                                                  0244 00593000
*     STORPTR=FRSTTABL;             /* START AT FIRST TABLE  @G33SPHW*/ 00594000
         L     @08,FRSTTABL                                        0244 00595000
         ST    @08,STORPTR                                         0244 00596000
*     CURPTR=ADDR(STORENT(1));      /* FIRST ENTRY IN TABLE  @G33SPHW*/ 00597000
         LA    @08,STORENT(,@08)                                   0245 00598000
         ST    @08,CURPTR                                          0245 00599000
*     NXTPTR=CURPTR+LENGTH(TABLENT);/* NEXT ENTRY IN NXTPTR  @G33SPHW*/ 00600000
         AH    @08,@CH00081                                        0246 00601000
         ST    @08,NXTPTR                                          0246 00602000
*     SWAP=ZERO;                    /* SET SWITCH TO NO CHANGE     0247 00603000
*                                                            @G33SPHW*/ 00604000
         MVI   SWAP,X'00'                                          0247 00605000
*     CTR=2;                        /* INITIALIZE LOOP CONTROL     0248 00606000
*                                                            @G33SPHW*/ 00607000
         LA    @08,2                                               0248 00608000
         STH   @08,CTR                                             0248 00609000
*     CTR2=2;                       /* INITIALIZE ENTRY COUNTER    0249 00610000
*                                                            @G33SPHW*/ 00611000
*                                                                  0249 00612000
         STH   @08,CTR2                                            0249 00613000
*     /***************************************************************/ 00614000
*     /*                                                             */ 00615000
*     /* LOOP THRU ALL ENTRIES                               @G33SPHW*/ 00616000
*     /*                                                             */ 00617000
*     /***************************************************************/ 00618000
*                                                                  0250 00619000
*     DO WHILE CTR<=ENTLIMIT;       /* LOOP UNTIL END OF ENTRY     0250 00620000
*                                                            @G33SPHW*/ 00621000
         B     @DE00250                                            0250 00622000
@DL00250 DS    0H                                                  0251 00623000
*       IF NXTPTR->AREADDR<         /* NEXT ENTRY GT CURRENT @G33SPHW*/ 00624000
*           CURPTR->AREADDR THEN    /* ENTRY STORAGE ADDRESS @G33SPHW*/ 00625000
         L     @08,NXTPTR                                          0251 00626000
         L     @07,CURPTR                                          0251 00627000
         CLC   AREADDR(4,@08),AREADDR(@07)                         0251 00628000
         BNL   @RF00251                                            0251 00629000
*         DO;                       /* YES SWAP ENTRIES      @G33SPHW*/ 00630000
*           CURPTR->TABLENT=CURPTR->TABLENT&&NXTPTR->TABLENT;      0253 00631000
         XC    TABLENT(8,@07),TABLENT(@08)                         0253 00632000
*           NXTPTR->TABLENT=NXTPTR->TABLENT&&CURPTR->TABLENT;      0254 00633000
         XC    TABLENT(8,@08),TABLENT(@07)                         0254 00634000
*           CURPTR->TABLENT=CURPTR->TABLENT&&NXTPTR->TABLENT;      0255 00635000
         XC    TABLENT(8,@07),TABLENT(@08)                         0255 00636000
*           SWAP=ONE;               /* INDICATE SWAP MADE    @G33SPHW*/ 00637000
         MVI   SWAP,X'01'                                          0256 00638000
*         END;                      /* END.... SWAP CODE     @G33SPHW*/ 00639000
*       ELSE                        /* NOT LESS THAN CURRENT @G33SPHW*/ 00640000
*         CURPTR=NXTPTR;            /* SET CURRENT TO NEXT   @G33SPHW*/ 00641000
         B     @RC00251                                            0258 00642000
@RF00251 MVC   CURPTR(4),NXTPTR                                    0258 00643000
*       IF CTR2=LIMIT THEN          /* END OF TABLE          @G33SPHW*/ 00644000
@RC00251 CLC   CTR2(2),@CH00078                                    0259 00645000
         BNE   @RF00259                                            0259 00646000
*         DO;                       /* YES.. GET NEW TABLE ADDR    0260 00647000
*                                                            @G33SPHW*/ 00648000
*           STORPTR=FWDPTR;         /* GET NEW TABLE ADDRESS @G33SPHW*/ 00649000
         L     @08,STORPTR                                         0261 00650000
         L     @08,FWDPTR(,@08)                                    0261 00651000
         ST    @08,STORPTR                                         0261 00652000
*           NXTPTR=ADDR(STORENT(1));/* 1ST ENTRY IN TABLE    @G33SPHW*/ 00653000
         LA    @08,STORENT(,@08)                                   0262 00654000
         ST    @08,NXTPTR                                          0262 00655000
*           CTR2=0;                 /* RESET COUNTER         @VS45203*/ 00656000
         SLR   @08,@08                                             0263 00657000
         STH   @08,CTR2                                            0263 00658000
*         END;                      /* END... NEXT TABLE     @G33SPHW*/ 00659000
*       ELSE                        /* NOT END OF TABLE      @G33SPHW*/ 00660000
*         NXTPTR=CURPTR+LENGTH(TABLENT);/* BUMP TO NEXT ENTRY IN   0265 00661000
*                                      TABLE                 @G33SPHW*/ 00662000
         B     @RC00259                                            0265 00663000
@RF00259 LA    @08,8                                               0265 00664000
         AL    @08,CURPTR                                          0265 00665000
         ST    @08,NXTPTR                                          0265 00666000
*       CTR=CTR+1;                  /* BUMP LOOP COUNTER     @G33SPHW*/ 00667000
@RC00259 LA    @08,1                                               0266 00668000
         LH    @07,CTR                                             0266 00669000
         ALR   @07,@08                                             0266 00670000
         STH   @07,CTR                                             0266 00671000
*       CTR2=CTR2+1;                /* BUMP ENTRY COUNTER    @G33SPHW*/ 00672000
         AH    @08,CTR2                                            0267 00673000
         STH   @08,CTR2                                            0267 00674000
*     END;                          /* END .. DO WHILE END OF TABLE     00675000
*                                      NOT FOUND.            @G33SPHW*/ 00676000
@DE00250 LH    @08,CTR                                             0268 00677000
         CH    @08,ENTLIMIT                                        0268 00678000
         BNH   @DL00250                                            0268 00679000
*   END;                            /* END.... DO WHILE SWAP MADE  0269 00680000
*                                                            @G33SPHW*/ 00681000
@DE00243 CLI   SWAP,0                                              0269 00682000
         BNE   @DL00243                                            0269 00683000
*   END D0ASORT;                    /* RETURN                @G33SPHW*/ 00684000
@EL00004 DS    0H                                                  0270 00685000
@EF00004 DS    0H                                                  0270 00686000
@ER00004 BR    @14                                                 0270 00687000
*D0ATABLE:                                                         0271 00688000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0271 00689000
*                                                                  0271 00690000
D0ATABLE DS    0H                                                  0272 00691000
*   /*****************************************************************/ 00692000
*   /*                                                               */ 00693000
*   /* OBTAIN STORAGE FOR NEW STORAGE TABLE                  @G33SPHW*/ 00694000
*   /*                                                               */ 00695000
*   /*****************************************************************/ 00696000
*                                                                  0272 00697000
*   TABR14=RETERN;                  /* SAVE RETURN ADDRESS   @G33SPHW*/ 00698000
         ST    RETERN,TABR14                                       0272 00699000
*   RFY                                                            0273 00700000
*     R7 RSTD;                                                     0273 00701000
*   R7=ASCBPTR;                     /* ASCB ADDRESS IN REG 7 FOR   0274 00702000
*                                      GETMAIN               @G33SPHW*/ 00703000
         L     R7,ASCBPTR                                          0274 00704000
*   GEN(GETMAIN RC,LV=3208,SP=253,BRANCH=YES);/*             @G33SPHW*/ 00705000
         GETMAIN RC,LV=3208,SP=253,BRANCH=YES                           00706000
*   IF RETCODE=0 THEN               /* GETMAIN OK            @G33SPHW*/ 00707000
         SLR   @08,@08                                             0276 00708000
         CR    RETCODE,@08                                         0276 00709000
         BNE   @RF00276                                            0276 00710000
*     DO;                           /* YES....               @G33SPHW*/ 00711000
*       SAVESTOR=R1;                /* SAVE ADDRESS OF TABLE @G33SPHW*/ 00712000
         ST    R1,SAVESTOR                                         0278 00713000
*       FWDPTR=SAVESTOR;            /* FILL IN CHAIN POINTER @G33SPHW*/ 00714000
         L     @05,SAVESTOR                                        0279 00715000
         L     @03,STORPTR                                         0279 00716000
         ST    @05,FWDPTR(,@03)                                    0279 00717000
*       SAVESTOR->BWDPTR=STORPTR;   /* FILL IN BACKWARD POINTER    0280 00718000
*                                                            @G33SPHW*/ 00719000
         ST    @03,BWDPTR(,@05)                                    0280 00720000
*       STORPTR=SAVESTOR;           /* GET NEW TABLE ADDRESS @G33SPHW*/ 00721000
         ST    @05,STORPTR                                         0281 00722000
*       FWDPTR=0;                   /* INITIALIZE FORWARD POINTER  0282 00723000
*                                                            @G33SPHW*/ 00724000
         ST    @08,FWDPTR(,@05)                                    0282 00725000
*     END;                          /* END GETMAIN OK        @G33SPHW*/ 00726000
*   ELSE                            /* GETMAIN FAILED        @G33SPHW*/ 00727000
*     RETCODE=8;                    /* GETMAIN RETCODE       @G33SPHW*/ 00728000
         B     @RC00276                                            0284 00729000
@RF00276 LA    RETCODE,8                                           0284 00730000
*   RETERN=TABR14;                  /* RESTORE RETURN ADDRESS      0285 00731000
*                                                            @G33SPHW*/ 00732000
@RC00276 L     RETERN,TABR14                                       0285 00733000
*   END D0ATABLE;                                                  0286 00734000
@EL00005 DS    0H                                                  0286 00735000
@EF00005 DS    0H                                                  0286 00736000
@ER00005 BR    @14                                                 0286 00737000
*   DCL                                                            0287 00738000
*     PATCHLOC FIXED(31) STATIC;                                   0287 00739000
*   GEN DATA DEFS(PATCHLOC);                                       0288 00740000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 00741000
*     GPR00F FIXED(31) REG(0),                                     0289 00742000
*     GPR01F FIXED(31) REG(1),                                     0289 00743000
*     GPR15F FIXED(31) REG(15);                                    0289 00744000
*   DECLARE                         /* COMMON VARIABLES              */ 00745000
*     I256C CHAR(256) BASED,                                       0290 00746000
*     I031F FIXED(31) BASED,                                       0290 00747000
*     I031P PTR(31) BASED,                                         0290 00748000
*     I015F FIXED(15) BASED,                                       0290 00749000
*     I015P PTR(15) BASED,                                         0290 00750000
*     I008P PTR(8) BASED,                                          0290 00751000
*     I001C CHAR(1) BASED;          /*                        @Y02705*/ 00752000
*   END IEAVAD0A                                                   0291 00753000
*                                                                  0291 00754000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00755000
*/*%INCLUDE SYSLIB  (D0ASPEC )                                       */ 00756000
*/*%INCLUDE SYSLIB  (D0ADCL  )                                       */ 00757000
*/*%INCLUDE SYSLIB  (IHAABDA )                                       */ 00758000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00759000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 00760000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00761000
*/*%INCLUDE SYSLIB  (IHADQE  )                                       */ 00762000
*/*%INCLUDE SYSLIB  (IHAGDA  )                                       */ 00763000
*/*%INCLUDE SYSLIB  (IHALDA  )                                       */ 00764000
*/*%INCLUDE SYSLIB  (IHAPCCA )                                       */ 00765000
*/*%INCLUDE SYSLIB  (IHASPQE )                                       */ 00766000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 00767000
*/*%INCLUDE SYSLIB  (D0ALSQA )                                       */ 00768000
*/*%INCLUDE SYSLIB  (D0ASQA  )                                       */ 00769000
*/*%INCLUDE SYSLIB  (D0AFREE )                                       */ 00770000
*/*%INCLUDE SYSLIB  (D0ADSPLY)                                       */ 00771000
*/*%INCLUDE SYSLIB  (D0APRNT )                                       */ 00772000
*/*%INCLUDE SYSLIB  (D0ASORT )                                       */ 00773000
*/*%INCLUDE SYSLIB  (D0ATABLE)                                       */ 00774000
*                                                                  0291 00775000
*       ;                                                          0291 00776000
         B     @EL00001                                            0291 00777000
@DATA    DS    0H                                                       00778000
@CH00085 DC    H'1'                                                     00779000
@CH00081 DC    H'8'                                                     00780000
@CH00078 DC    H'400'                                                   00781000
@DATD    DSECT                                                          00782000
         DS    0F                                                       00783000
IEAVAD0A CSECT                                                          00784000
         DS    0F                                                       00785000
@CF00066 DC    F'4096'                                                  00786000
@CH00066 EQU   @CF00066+2                                               00787000
@CF02135 DC    F'64768'                                                 00788000
@DATD    DSECT                                                          00789000
         DS    0D                                                       00790000
LDAPTR   DS    A                                                        00791000
GDAPTR   DS    A                                                        00792000
ASCBPTR  DS    A                                                        00793000
SPQESPTR DS    A                                                        00794000
TABR14   DS    A                                                        00795000
DQESEPTR DS    A                                                        00796000
DQEBLKSV DS    A                                                        00797000
DQELNSVE DS    F                                                        00798000
SAVE14   DS    A                                                        00799000
PRNTR14  DS    A                                                        00800000
STORPTR  DS    A                                                        00801000
FRSTTABL DS    A                                                        00802000
SAVESTOR DS    A                                                        00803000
CURPTR   DS    A                                                        00804000
NXTPTR   DS    A                                                        00805000
FREEAREA DS    A                                                        00806000
CTR      DS    H                                                        00807000
CTR2     DS    H                                                        00808000
ENTLIMIT DS    H                                                        00809000
SWAP     DS    FL1                                                      00810000
IEAVAD0A CSECT                                                          00811000
         DS    0F                                                       00812000
@SIZDATD DC    AL1(0)                                                   00813000
         DC    AL3(@ENDDATD-@DATD)                                      00814000
@CV00059 DC    V(IEAVAD11)                                              00815000
@CV00060 DC    V(IEAVAD71)                                              00816000
         DS    0D                                                       00817000
LSQAMSG  DC    CL15'-ALLOCATED LSQA'                                    00818000
IEAVAD0A CSECT                                                          00819000
         DS   0H                                                        00820000
PATCHLOC DC ((@DATA-@PSTART)/20)X'00'                                   00821000
@DATD    DSECT                                                          00822000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00823000
@ENDDATD EQU   *                                                        00824000
IEAVAD0A CSECT                                                          00825000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00826000
@01      EQU   01                                                       00827000
@02      EQU   02                                                       00828000
@03      EQU   03                                                       00829000
@04      EQU   04                                                       00830000
@05      EQU   05                                                       00831000
@06      EQU   06                                                       00832000
@07      EQU   07                                                       00833000
@08      EQU   08                                                       00834000
@09      EQU   09                                                       00835000
@10      EQU   10                                                       00836000
@11      EQU   11                                                       00837000
@12      EQU   12                                                       00838000
@13      EQU   13                                                       00839000
@14      EQU   14                                                       00840000
@15      EQU   15                                                       00841000
R0       EQU   @00                                                      00842000
R1       EQU   @01                                                      00843000
PARMPTR  EQU   @01                                                      00844000
ABDARPTR EQU   @02                                                      00845000
TCBPTR   EQU   @04                                                      00846000
R5       EQU   @05                                                      00847000
R7       EQU   @07                                                      00848000
SAVERET  EQU   @09                                                      00849000
R11      EQU   @11                                                      00850000
AUTOPTR  EQU   @12                                                      00851000
SAVEPTR  EQU   @13                                                      00852000
R14      EQU   @14                                                      00853000
RETERN   EQU   @14                                                      00854000
RETCODE  EQU   @15                                                      00855000
GPR01F   EQU   @01                                                      00856000
GPR15F   EQU   @15                                                      00857000
GPR00F   EQU   @00                                                      00858000
PSA      EQU   0                                                        00859000
FLCRNPSW EQU   PSA                                                      00860000
FLCROPSW EQU   PSA+8                                                    00861000
FLCICCW2 EQU   PSA+16                                                   00862000
FLCCVT   EQU   FLCICCW2                                                 00863000
PSAEEPSW EQU   PSA+132                                                  00864000
PSAESPSW EQU   PSA+136                                                  00865000
FLCSVILC EQU   PSAESPSW+1                                               00866000
PSAEPPSW EQU   PSA+140                                                  00867000
FLCPIILC EQU   PSAEPPSW+1                                               00868000
FLCPICOD EQU   PSAEPPSW+2                                               00869000
PSAPICOD EQU   FLCPICOD+1                                               00870000
FLCTEA   EQU   PSAEPPSW+4                                               00871000
FLCPER   EQU   PSA+152                                                  00872000
FLCMCLA  EQU   PSA+168                                                  00873000
FLCIOEL  EQU   FLCMCLA+4                                                00874000
FLCIOA   EQU   FLCMCLA+16                                               00875000
FLCFSA   EQU   FLCMCLA+80                                               00876000
PSATOLD  EQU   PSA+540                                                  00877000
PSAAOLD  EQU   PSA+548                                                  00878000
PSASUPER EQU   PSA+552                                                  00879000
PSASUP1  EQU   PSASUPER                                                 00880000
PSASUP2  EQU   PSASUPER+1                                               00881000
PSASUP3  EQU   PSASUPER+2                                               00882000
PSASUP4  EQU   PSASUPER+3                                               00883000
PSACLHT  EQU   PSA+640                                                  00884000
PSALKSA  EQU   PSA+696                                                  00885000
PSAHLHI  EQU   PSA+760                                                  00886000
PSALITA  EQU   PSA+764                                                  00887000
PSADSSFL EQU   PSA+836                                                  00888000
PSADSSF1 EQU   PSADSSFL                                                 00889000
PSADSSF3 EQU   PSADSSFL+2                                               00890000
PSADSSF4 EQU   PSADSSFL+3                                               00891000
PSARSVT  EQU   PSA+896                                                  00892000
NEXSAPTR EQU   8                                                        00893000
PRESAPTR EQU   4                                                        00894000
STORHD   EQU   0                                                        00895000
FWDPTR   EQU   STORHD                                                   00896000
BWDPTR   EQU   STORHD+4                                                 00897000
STORENT  EQU   STORHD+8                                                 00898000
STORADDR EQU   STORENT                                                  00899000
STORLEN  EQU   STORENT+4                                                00900000
TABLENT  EQU   0                                                        00901000
AREADDR  EQU   TABLENT                                                  00902000
AREAFLAG EQU   TABLENT+6                                                00903000
ABDAREA  EQU   0                                                        00904000
ABDTCB   EQU   ABDAREA                                                  00905000
ABDPARMS EQU   ABDAREA+12                                               00906000
ABDFLAG  EQU   ABDPARMS+1                                               00907000
APFSDATA EQU   ABDPARMS+4                                               00908000
APFSDAT1 EQU   ABDPARMS+5                                               00909000
APFPDATA EQU   ABDPARMS+6                                               00910000
ABDPTRS  EQU   ABDAREA+84                                               00911000
ABDFLAG1 EQU   ABDAREA+136                                              00912000
ABDSQSDM EQU   ABDFLAG1                                                 00913000
ABDFLAG2 EQU   ABDAREA+137                                              00914000
ABDSTAT  EQU   ABDFLAG2                                                 00915000
ABDRES1  EQU   ABDAREA+139                                              00916000
ABDOLSQA EQU   ABDRES1                                                  00917000
ABDSQA   EQU   ABDRES1                                                  00918000
ABDWORK  EQU   ABDAREA+140                                              00919000
ABDUPRF  EQU   ABDAREA+265                                              00920000
UPRFMET  EQU   ABDUPRF                                                  00921000
ABDUPRFN EQU   ABDAREA+266                                              00922000
ABDUPRSL EQU   ABDUPRFN                                                 00923000
ABDBLNKS EQU   ABDAREA+267                                              00924000
ABDBLOCK EQU   ABDAREA+272                                              00925000
ABDLENTH EQU   ABDAREA+276                                              00926000
ABDBUFFS EQU   ABDAREA+308                                              00927000
ABDGMA   EQU   ABDAREA+316                                              00928000
ABDAAREA EQU   ABDGMA                                                   00929000
ABDASIZE EQU   ABDGMA+4                                                 00930000
ESPARM   EQU   ABDAREA+340                                              00931000
ESTAEFLG EQU   ESPARM+28                                                00932000
ABDLINEA EQU   ABDAREA+384                                              00933000
ASCB     EQU   0                                                        00934000
ASCBSUPC EQU   ASCB+16                                                  00935000
ASCBLDA  EQU   ASCB+48                                                  00936000
ASCBFW1  EQU   ASCB+100                                                 00937000
ASCBRCTF EQU   ASCBFW1+2                                                00938000
ASCBFLG1 EQU   ASCBFW1+3                                                00939000
ASCBDSP1 EQU   ASCB+114                                                 00940000
ASCBFLG2 EQU   ASCB+115                                                 00941000
ASCBLKGP EQU   ASCB+128                                                 00942000
ASCBSRQ  EQU   ASCB+180                                                 00943000
ASCBSRQ1 EQU   ASCBSRQ                                                  00944000
ASCBSRQ2 EQU   ASCBSRQ+1                                                00945000
ASCBSRQ3 EQU   ASCBSRQ+2                                                00946000
ASCBSRQ4 EQU   ASCBSRQ+3                                                00947000
CVTMAP   EQU   0                                                        00948000
CVTDAR   EQU   CVTMAP+72                                                00949000
CVTFLGS1 EQU   CVTDAR                                                   00950000
CVTDCB   EQU   CVTMAP+116                                               00951000
CVTIERLC EQU   CVTMAP+144                                               00952000
CVTOPTA  EQU   CVTMAP+182                                               00953000
CVTOPTB  EQU   CVTMAP+183                                               00954000
CVTGTF   EQU   CVTMAP+236                                               00955000
CVTGTFST EQU   CVTGTF                                                   00956000
CVTGTFS  EQU   CVTGTFST                                                 00957000
CVTSTATE EQU   CVTGTFST                                                 00958000
CVTTMODE EQU   CVTGTFST                                                 00959000
CVTFORM  EQU   CVTGTFST                                                 00960000
CVTAQAVT EQU   CVTMAP+240                                               00961000
CVTTCMFG EQU   CVTAQAVT                                                 00962000
CVTVOLM2 EQU   CVTMAP+244                                               00963000
CVTTATA  EQU   CVTVOLM2                                                 00964000
CVTTSKS  EQU   CVTTATA                                                  00965000
CVTVOLF2 EQU   CVTTSKS                                                  00966000
CVTTAT   EQU   CVTTATA+1                                                00967000
CVTATER  EQU   CVTMAP+248                                               00968000
CVTEXT1  EQU   CVTMAP+252                                               00969000
CVTPURG  EQU   CVTMAP+260                                               00970000
CVTQMSG  EQU   CVTMAP+268                                               00971000
CVTDMSR  EQU   CVTMAP+272                                               00972000
CVTRSV37 EQU   CVTDMSR                                                  00973000
CVTDMSRF EQU   CVTRSV37                                                 00974000
CVTERPV  EQU   CVTMAP+316                                               00975000
CVTINTLA EQU   CVTMAP+320                                               00976000
CVTAPF   EQU   CVTMAP+324                                               00977000
CVTEXT2  EQU   CVTMAP+328                                               00978000
CVTHJES  EQU   CVTMAP+332                                               00979000
CVTPGSIA EQU   CVTMAP+348                                               00980000
CVTA1F1  EQU   CVTMAP+356                                               00981000
CVTSYSK  EQU   CVTMAP+357                                               00982000
CVTVOLM1 EQU   CVTMAP+380                                               00983000
CVTVOLF1 EQU   CVTVOLM1                                                 00984000
CVTXTNT1 EQU   0                                                        00985000
CVTXTNT2 EQU   0                                                        00986000
CVTDSSV  EQU   CVTXTNT2                                                 00987000
CVTFLGBT EQU   CVTXTNT2+5                                               00988000
CVTQID   EQU   CVTXTNT2+24                                              00989000
CVTRV400 EQU   CVTXTNT2+52                                              00990000
CVTRV409 EQU   CVTXTNT2+53                                              00991000
CVTATCVT EQU   CVTXTNT2+64                                              00992000
CVTRV429 EQU   CVTXTNT2+84                                              00993000
CVTRV438 EQU   CVTXTNT2+85                                              00994000
CVTRV457 EQU   CVTXTNT2+112                                             00995000
CVTRV466 EQU   CVTXTNT2+113                                             00996000
CVTFIX   EQU   0                                                        00997000
CVTRELNO EQU   CVTFIX+252                                               00998000
DQESECT  EQU   0                                                        00999000
DQEPTR   EQU   DQESECT+4                                                01000000
DQEBLKAD EQU   DQESECT+8                                                01001000
DQELNTH  EQU   DQESECT+12                                               01002000
GDA      EQU   0                                                        01003000
GVSMFLAG EQU   GDA                                                      01004000
GDAFLAGS EQU   GVSMFLAG                                                 01005000
SQASPQEP EQU   GDA+24                                                   01006000
VRPOSTQ  EQU   GDA+32                                                   01007000
VRWAITQ  EQU   GDA+40                                                   01008000
LDA      EQU   0                                                        01009000
LVSMFLAG EQU   LDA                                                      01010000
LSQAPTR  EQU   LDA+1464                                                 01011000
PCCA     EQU   0                                                        01012000
PCCATMST EQU   PCCA+128                                                 01013000
PCCATMFL EQU   PCCATMST                                                 01014000
PCCATODE EQU   PCCATMST+1                                               01015000
PCCACCE  EQU   PCCATMST+2                                               01016000
PCCAINTE EQU   PCCATMST+3                                               01017000
PCCAEMSB EQU   PCCA+136                                                 01018000
PCCAEMSI EQU   PCCAEMSB                                                 01019000
PCCARISP EQU   PCCAEMSI                                                 01020000
PCCAEMS2 EQU   PCCAEMSI+1                                               01021000
PCCAEMS3 EQU   PCCAEMSI+2                                               01022000
PCCARMSB EQU   PCCAEMSI+3                                               01023000
PCCAWERP EQU   PCCA+280                                                 01024000
PCCACHPF EQU   PCCAWERP+4                                               01025000
PCCACHBL EQU   PCCAWERP+5                                               01026000
PCCACHVA EQU   PCCAWERP+6                                               01027000
PCCACHTS EQU   PCCAWERP+7                                               01028000
PCCACHS1 EQU   PCCA+288                                                 01029000
PCCACHS2 EQU   PCCA+289                                                 01030000
PCCACHRB EQU   PCCA+290                                                 01031000
PCCACHF1 EQU   PCCA+308                                                 01032000
PCCACHF2 EQU   PCCA+309                                                 01033000
PCCACHF3 EQU   PCCA+310                                                 01034000
PCCACHF4 EQU   PCCA+311                                                 01035000
SPQESECT EQU   0                                                        01036000
SPQEAD   EQU   SPQESECT                                                 01037000
SPDQEPTR EQU   SPQESECT+4                                               01038000
SPQEFLGS EQU   SPQESECT+8                                               01039000
TCBFIX   EQU   0                                                        01040000
TCBFRS   EQU   TCBFIX                                                   01041000
TCB      EQU   0                                                        01042000
TCBPIE   EQU   TCB+4                                                    01043000
TCBPMASK EQU   TCBPIE                                                   01044000
TCBCMP   EQU   TCB+16                                                   01045000
TCBCMPF  EQU   TCBCMP                                                   01046000
TCBCPP   EQU   TCBCMPF                                                  01047000
TCBSTCC  EQU   TCBCMPF                                                  01048000
TCBCDBL  EQU   TCBCMPF                                                  01049000
TCBCWTO  EQU   TCBCMPF                                                  01050000
TCBCIND  EQU   TCBCMPF                                                  01051000
TCBCMSG  EQU   TCBCMPF                                                  01052000
TCBTRN   EQU   TCB+20                                                   01053000
TCBABF   EQU   TCBTRN                                                   01054000
TCBMSS   EQU   TCB+24                                                   01055000
TCBPKF   EQU   TCB+28                                                   01056000
TCBFLGS  EQU   TCB+29                                                   01057000
TCBFLGS1 EQU   TCBFLGS                                                  01058000
TCBFLGS2 EQU   TCBFLGS+1                                                01059000
TCBFLGS3 EQU   TCBFLGS+2                                                01060000
TCBFLGS4 EQU   TCBFLGS+3                                                01061000
TCBFLGS5 EQU   TCBFLGS+4                                                01062000
TCBABWF  EQU   TCBFLGS5                                                 01063000
TCBJPQ   EQU   TCB+44                                                   01064000
TCBPURGE EQU   TCBJPQ                                                   01065000
TCBGRS   EQU   TCB+48                                                   01066000
TCBFSA   EQU   TCB+112                                                  01067000
TCBTME   EQU   TCB+120                                                  01068000
TCBJSTCB EQU   TCB+124                                                  01069000
TCBLTC   EQU   TCB+136                                                  01070000
TCBTSFLG EQU   TCB+148                                                  01071000
TCBTSTSK EQU   TCBTSFLG                                                 01072000
TCBSTAB  EQU   TCB+160                                                  01073000
TCBNSTAE EQU   TCBSTAB                                                  01074000
TCBTCT   EQU   TCB+164                                                  01075000
TCBTCTGF EQU   TCBTCT                                                   01076000
TCBSCNDY EQU   TCB+172                                                  01077000
TCBNDSP  EQU   TCBSCNDY                                                 01078000
TCBNDSP1 EQU   TCBNDSP+1                                                01079000
TCBNDSP2 EQU   TCBNDSP+2                                                01080000
TCBNDSP3 EQU   TCBNDSP+3                                                01081000
TCBJSCB  EQU   TCB+180                                                  01082000
TCBRECDE EQU   TCBJSCB                                                  01083000
TCBEXT1  EQU   TCB+196                                                  01084000
TCBBITS  EQU   TCB+200                                                  01085000
TCBNDSP4 EQU   TCBBITS                                                  01086000
TCBNDSP5 EQU   TCBBITS+1                                                01087000
TCBFLGS6 EQU   TCBBITS+2                                                01088000
TCBFLGS7 EQU   TCBBITS+3                                                01089000
TCBADMP  EQU   TCBFLGS7                                                 01090000
TCBDAR   EQU   TCB+204                                                  01091000
TCBDARC  EQU   TCBDAR                                                   01092000
TCBEXT2  EQU   TCB+208                                                  01093000
TCBXSCT  EQU   TCB+240                                                  01094000
TCBXSCT1 EQU   TCBXSCT                                                  01095000
TCBFOE   EQU   TCB+244                                                  01096000
TCBESTAE EQU   TCB+264                                                  01097000
TCBESTRM EQU   TCBESTAE+1                                               01098000
TCBFBYT1 EQU   TCB+276                                                  01099000
TCBFBYT2 EQU   TCB+277                                                  01100000
TCBRV124 EQU   TCB+278                                                  01101000
TCBRV133 EQU   TCB+279                                                  01102000
TCBXTNT2 EQU   0                                                        01103000
TCBGTF   EQU   TCBXTNT2                                                 01104000
TCBTFLG  EQU   TCBGTF                                                   01105000
TCBRV146 EQU   TCBXTNT2+28                                              01106000
TCBRV155 EQU   TCBXTNT2+29                                              01107000
TCBRV164 EQU   TCBXTNT2+30                                              01108000
TCBRV173 EQU   TCBXTNT2+31                                              01109000
I256C    EQU   0                                                        01110000
I001C    EQU   0                                                        01111000
I008P    EQU   0                                                        01112000
I015F    EQU   0                                                        01113000
I015P    EQU   0                                                        01114000
I031F    EQU   0                                                        01115000
I031P    EQU   0                                                        01116000
STORTABL EQU   0                                                        01117000
PSARSVTE EQU   PSARSVT                                                  01118000
CVTPTR   EQU   FLCCVT                                                   01119000
CVTS01   EQU   CVTPGSIA                                                 01120000
CVTLPDIA EQU   CVTS01+12                                                01121000
CVTDIRST EQU   CVTLPDIA                                                 01122000
CVTSLIDA EQU   CVTS01+24                                                01123000
CVTCTLFG EQU   CVTS01+50                                                01124000
CVTCRMN  EQU   CVTS01+156                                               01125000
CVTGDA   EQU   CVTS01+212                                               01126000
CVTRV210 EQU   CVTS01+424                                               01127000
CVTRV219 EQU   CVTS01+425                                               01128000
CVTRV228 EQU   CVTS01+426                                               01129000
CVTRV237 EQU   CVTS01+427                                               01130000
CVTMFRTR EQU   CVTS01+452                                               01131000
CVTRV262 EQU   CVTS01+468                                               01132000
CVTRV271 EQU   CVTS01+469                                               01133000
CVTRV280 EQU   CVTS01+470                                               01134000
CVTRV289 EQU   CVTS01+471                                               01135000
CVTGSDA  EQU   CVTS01+600                                               01136000
PCCAPTR  EQU   PSATOLD                                                  01137000
FLC      EQU   PSA                                                      01138000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01139000
CVTRV628 EQU   CVTS01+728                                               01140000
CVTRV627 EQU   CVTS01+724                                               01141000
CVTRV626 EQU   CVTS01+720                                               01142000
CVTRV625 EQU   CVTS01+716                                               01143000
CVTRV624 EQU   CVTS01+712                                               01144000
CVTRV623 EQU   CVTS01+708                                               01145000
CVTRV622 EQU   CVTS01+704                                               01146000
CVTRV621 EQU   CVTS01+700                                               01147000
CVTIHASU EQU   CVTS01+696                                               01148000
CVTSUSP  EQU   CVTS01+692                                               01149000
CVTT6SVC EQU   CVTS01+688                                               01150000
CVTCDAL  EQU   CVTS01+684                                               01151000
CVTTCTL  EQU   CVTS01+680                                               01152000
CVTRSUME EQU   CVTS01+676                                               01153000
CVTJTERM EQU   CVTS01+672                                               01154000
CVTASMRM EQU   CVTS01+668                                               01155000
CVTTCASP EQU   CVTS01+664                                               01156000
CVT0PT03 EQU   CVTS01+660                                               01157000
CVT0PT0E EQU   CVTS01+656                                               01158000
CVTRV609 EQU   CVTS01+652                                               01159000
CVTCGK   EQU   CVTS01+648                                               01160000
CVTRAC   EQU   CVTS01+644                                               01161000
CVTRV606 EQU   CVTS01+640                                               01162000
CVTRV605 EQU   CVTS01+636                                               01163000
CVTRV604 EQU   CVTS01+632                                               01164000
CVTEFF02 EQU   CVTS01+628                                               01165000
CVTCBBR  EQU   CVTS01+624                                               01166000
CVTSSCR  EQU   CVTS01+620                                               01167000
CVTEVENT EQU   CVTS01+616                                               01168000
CVTCRCA  EQU   CVTS01+612                                               01169000
CVTTPIO  EQU   CVTS01+608                                               01170000
CVTADV   EQU   CVTS01+604                                               01171000
CVTGSDAB EQU   CVTGSDA                                                  01172000
CVTQV3   EQU   CVTS01+596                                               01173000
CVTQV2   EQU   CVTS01+592                                               01174000
CVTQV1   EQU   CVTS01+588                                               01175000
CVTRPT   EQU   CVTS01+584                                               01176000
CVTSSRB  EQU   CVTS01+580                                               01177000
CVTCSDRL EQU   CVTS01+576                                               01178000
CVTEXP1  EQU   CVTS01+572                                               01179000
CVTRMPMT EQU   CVTS01+568                                               01180000
CVTRMPTT EQU   CVTS01+564                                               01181000
CVTVPSA  EQU   CVTS01+560                                               01182000
CVTVSTOP EQU   CVTS01+556                                               01183000
CVTGTFR8 EQU   CVTS01+552                                               01184000
CVTQUIT  EQU   CVTS01+548                                               01185000
CVTVACR  EQU   CVTS01+544                                               01186000
CVTWTCB  EQU   CVTS01+540                                               01187000
CVTSTPRS EQU   CVTS01+536                                               01188000
CVT0PT02 EQU   CVTS01+532                                               01189000
CVTDARCM EQU   CVTS01+528                                               01190000
CVTIRECM EQU   CVTS01+524                                               01191000
CVTJRECM EQU   CVTS01+520                                               01192000
CVTVEMS0 EQU   CVTS01+516                                               01193000
CVTSPFRR EQU   CVTS01+512                                               01194000
CVTRLSTG EQU   CVTS01+508                                               01195000
CVT0TC0A EQU   CVTS01+504                                               01196000
CVTGMBR  EQU   CVTS01+500                                               01197000
CVTLFRM  EQU   CVTS01+496                                               01198000
CVTRMBR  EQU   CVTS01+492                                               01199000
CVTVIOP  EQU   CVTS01+488                                               01200000
CVTRV307 EQU   CVTS01+486                                               01201000
CVTRV306 EQU   CVTS01+484                                               01202000
CVTRV305 EQU   CVTS01+482                                               01203000
CVTRV304 EQU   CVTS01+480                                               01204000
CVTRV303 EQU   CVTS01+478                                               01205000
CVTRV302 EQU   CVTS01+476                                               01206000
CVTTRCA  EQU   CVTS01+472                                               01207000
CVTRV297 EQU   CVTRV289                                                 01208000
CVTRV296 EQU   CVTRV289                                                 01209000
CVTRV295 EQU   CVTRV289                                                 01210000
CVTRV294 EQU   CVTRV289                                                 01211000
CVTRV293 EQU   CVTRV289                                                 01212000
CVTRV292 EQU   CVTRV289                                                 01213000
CVTRV291 EQU   CVTRV289                                                 01214000
CVTRV290 EQU   CVTRV289                                                 01215000
CVTRV288 EQU   CVTRV280                                                 01216000
CVTRV287 EQU   CVTRV280                                                 01217000
CVTRV286 EQU   CVTRV280                                                 01218000
CVTRV285 EQU   CVTRV280                                                 01219000
CVTRV284 EQU   CVTRV280                                                 01220000
CVTRV283 EQU   CVTRV280                                                 01221000
CVTRV282 EQU   CVTRV280                                                 01222000
CVTRV281 EQU   CVTRV280                                                 01223000
CVTRV279 EQU   CVTRV271                                                 01224000
CVTRV278 EQU   CVTRV271                                                 01225000
CVTRV277 EQU   CVTRV271                                                 01226000
CVTRV276 EQU   CVTRV271                                                 01227000
CVTRV275 EQU   CVTRV271                                                 01228000
CVTRV274 EQU   CVTRV271                                                 01229000
CVTRV273 EQU   CVTRV271                                                 01230000
CVTRV272 EQU   CVTRV271                                                 01231000
CVTRV270 EQU   CVTRV262                                                 01232000
CVTRV269 EQU   CVTRV262                                                 01233000
CVTRV268 EQU   CVTRV262                                                 01234000
CVTRV267 EQU   CVTRV262                                                 01235000
CVTRV266 EQU   CVTRV262                                                 01236000
CVTRV265 EQU   CVTRV262                                                 01237000
CVTRV264 EQU   CVTRV262                                                 01238000
CVTRV263 EQU   CVTRV262                                                 01239000
CVTVFP   EQU   CVTS01+464                                               01240000
CVTVSI   EQU   CVTS01+460                                               01241000
CVTVPSIB EQU   CVTS01+456                                               01242000
CVTMFACT EQU   CVTMFRTR                                                 01243000
CVTMFCTL EQU   CVTS01+448                                               01244000
CVTPVBP  EQU   CVTS01+444                                               01245000
CVTPWI   EQU   CVTS01+440                                               01246000
CVTRV254 EQU   CVTS01+438                                               01247000
CVTRV253 EQU   CVTS01+436                                               01248000
CVTRV252 EQU   CVTS01+434                                               01249000
CVTRV251 EQU   CVTS01+433                                               01250000
CVTRV250 EQU   CVTS01+432                                               01251000
CVTRV249 EQU   CVTS01+431                                               01252000
CVTRV248 EQU   CVTS01+430                                               01253000
CVTRV247 EQU   CVTS01+429                                               01254000
CVTRV246 EQU   CVTS01+428                                               01255000
CVTRV245 EQU   CVTRV237                                                 01256000
CVTRV244 EQU   CVTRV237                                                 01257000
CVTRV243 EQU   CVTRV237                                                 01258000
CVTRV242 EQU   CVTRV237                                                 01259000
CVTRV241 EQU   CVTRV237                                                 01260000
CVTRV240 EQU   CVTRV237                                                 01261000
CVTRV239 EQU   CVTRV237                                                 01262000
CVTRV238 EQU   CVTRV237                                                 01263000
CVTRV236 EQU   CVTRV228                                                 01264000
CVTRV235 EQU   CVTRV228                                                 01265000
CVTRV234 EQU   CVTRV228                                                 01266000
CVTRV233 EQU   CVTRV228                                                 01267000
CVTRV232 EQU   CVTRV228                                                 01268000
CVTRV231 EQU   CVTRV228                                                 01269000
CVTRV230 EQU   CVTRV228                                                 01270000
CVTRV229 EQU   CVTRV228                                                 01271000
CVTRV227 EQU   CVTRV219                                                 01272000
CVTRV226 EQU   CVTRV219                                                 01273000
CVTRV225 EQU   CVTRV219                                                 01274000
CVTRV224 EQU   CVTRV219                                                 01275000
CVTRV223 EQU   CVTRV219                                                 01276000
CVTRV222 EQU   CVTRV219                                                 01277000
CVTRV221 EQU   CVTRV219                                                 01278000
CVTRV220 EQU   CVTRV219                                                 01279000
CVTRV218 EQU   CVTRV210                                                 01280000
CVTRV217 EQU   CVTRV210                                                 01281000
CVTRV216 EQU   CVTRV210                                                 01282000
CVTRV215 EQU   CVTRV210                                                 01283000
CVTRV214 EQU   CVTRV210                                                 01284000
CVTRV213 EQU   CVTRV210                                                 01285000
CVTRV212 EQU   CVTRV210                                                 01286000
CVTRV211 EQU   CVTRV210                                                 01287000
CVTLCCAT EQU   CVTS01+420                                               01288000
CVTPCCAT EQU   CVTS01+416                                               01289000
CVTIPCRP EQU   CVTS01+412                                               01290000
CVTIPCRI EQU   CVTS01+408                                               01291000
CVTIPCDS EQU   CVTS01+404                                               01292000
CVTAIDVT EQU   CVTS01+400                                               01293000
CVTSSAP  EQU   CVTS01+396                                               01294000
CVTEHCIR EQU   CVTS01+392                                               01295000
CVTEHDEF EQU   CVTS01+388                                               01296000
CVTDAIR  EQU   CVTS01+384                                               01297000
CVTPERFM EQU   CVTS01+380                                               01298000
CVT044R2 EQU   CVTS01+376                                               01299000
CVTFETCH EQU   CVTS01+372                                               01300000
CVTRSTWD EQU   CVTS01+368                                               01301000
CVTSPOST EQU   CVTS01+364                                               01302000
CVTIOBP  EQU   CVTS01+360                                               01303000
CVTASMVT EQU   CVTS01+356                                               01304000
CVTRECRQ EQU   CVTS01+352                                               01305000
CVTWSAC  EQU   CVTS01+348                                               01306000
CVTRV149 EQU   CVTS01+344                                               01307000
CVTWSAL  EQU   CVTS01+340                                               01308000
CVTSPSA  EQU   CVTS01+336                                               01309000
CVTGLMN  EQU   CVTS01+332                                               01310000
CVTVEAC0 EQU   CVTS01+328                                               01311000
CVT062R1 EQU   CVTS01+324                                               01312000
CVTRPOST EQU   CVTS01+320                                               01313000
CVTDQIQE EQU   CVTS01+316                                               01314000
CVTCSD   EQU   CVTS01+312                                               01315000
CVTLKRMA EQU   CVTS01+308                                               01316000
CVTRSPIE EQU   CVTS01+304                                               01317000
CVTRENQ  EQU   CVTS01+300                                               01318000
CVTLQCB  EQU   CVTS01+296                                               01319000
CVTFQCB  EQU   CVTS01+292                                               01320000
CVTQCS01 EQU   CVTS01+288                                               01321000
CVTAPFT  EQU   CVTS01+284                                               01322000
CVTPARRL EQU   CVTS01+280                                               01323000
CVTVWAIT EQU   CVTS01+276                                               01324000
CVTGSPL  EQU   CVTS01+272                                               01325000
CVTLSMQ  EQU   CVTS01+268                                               01326000
CVTGSMQ  EQU   CVTS01+264                                               01327000
CVTEXPRO EQU   CVTS01+260                                               01328000
CVTOPCTP EQU   CVTS01+256                                               01329000
CVTSIC   EQU   CVTS01+252                                               01330000
CVTTPIOS EQU   CVTS01+248                                               01331000
CVTRTMS  EQU   CVTS01+244                                               01332000
CVTSDBF  EQU   CVTS01+240                                               01333000
CVTSCBP  EQU   CVTS01+236                                               01334000
CVTSDMP  EQU   CVTS01+232                                               01335000
CVTSV60  EQU   CVTS01+228                                               01336000
CVTRTMCT EQU   CVTS01+224                                               01337000
CVTASCBL EQU   CVTS01+220                                               01338000
CVTASCBH EQU   CVTS01+216                                               01339000
CVTASVT  EQU   CVTS01+208                                               01340000
CVTVVMDI EQU   CVTS01+204                                               01341000
CVTAQTOP EQU   CVTS01+200                                               01342000
CVTIOSCS EQU   CVTS01+196                                               01343000
CVTSDRM  EQU   CVTS01+192                                               01344000
CVTOPTE  EQU   CVTS01+188                                               01345000
CVTSTXU  EQU   CVTS01+184                                               01346000
CVTQUIS  EQU   CVTS01+180                                               01347000
CVTPARS  EQU   CVTS01+176                                               01348000
CVTS1EE  EQU   CVTS01+172                                               01349000
CVTFRAS  EQU   CVTS01+168                                               01350000
CVTQSAS  EQU   CVTS01+164                                               01351000
CVTCRAS  EQU   CVTS01+160                                               01352000
CVTDELCP EQU   CVTS01+152                                               01353000
CVTFRECL EQU   CVTS01+148                                               01354000
CVTGETCL EQU   CVTS01+144                                               01355000
CVTBLDCP EQU   CVTS01+140                                               01356000
CVTAUTHL EQU   CVTS01+136                                               01357000
CVTSCAN  EQU   CVTS01+132                                               01358000
CVTRV144 EQU   CVTS01+130                                               01359000
CVTMAXMP EQU   CVTS01+128                                               01360000
CVTSTCK  EQU   CVTS01+124                                               01361000
CVTRV139 EQU   CVTS01+123                                               01362000
CVTDSSAC EQU   CVTS01+122                                               01363000
CVTRV513 EQU   CVTS01+121                                               01364000
CVTIOSPL EQU   CVTS01+120                                               01365000
CVTPTGT  EQU   CVTS01+116                                               01366000
CVTCSPIE EQU   CVTS01+112                                               01367000
CVTSMFEX EQU   CVTS01+108                                               01368000
CVTOLT0A EQU   CVTS01+104                                               01369000
CVTSRBRT EQU   CVTS01+100                                               01370000
CVTPUTL  EQU   CVTS01+96                                                01371000
CVTASCRL EQU   CVTS01+92                                                01372000
CVTASCRF EQU   CVTS01+88                                                01373000
CVTRV326 EQU   CVTS01+84                                                01374000
CVTRV325 EQU   CVTS01+80                                                01375000
CVTRV324 EQU   CVTS01+76                                                01376000
CVT0VL01 EQU   CVTS01+72                                                01377000
CVTSHRVM EQU   CVTS01+68                                                01378000
CVTRV332 EQU   CVTS01+64                                                01379000
CVTTAS   EQU   CVTS01+60                                                01380000
CVTRSCN  EQU   CVTS01+56                                                01381000
CVTTRAC2 EQU   CVTS01+54                                                01382000
CVTTRACE EQU   CVTS01+52                                                01383000
CVTAPG   EQU   CVTS01+51                                                01384000
CVTSDTRC EQU   CVTCTLFG                                                 01385000
CVTGTRCE EQU   CVTCTLFG                                                 01386000
CVTNOMP  EQU   CVTCTLFG                                                 01387000
CVTRSV79 EQU   CVTCTLFG                                                 01388000
CVTDSTAT EQU   CVTCTLFG                                                 01389000
CVTRSV78 EQU   CVTCTLFG                                                 01390000
CVTRV333 EQU   CVTCTLFG                                                 01391000
CVTRV323 EQU   CVTCTLFG                                                 01392000
CVTSPVLK EQU   CVTS01+49                                                01393000
CVTRSV77 EQU   CVTS01+48                                                01394000
CVTRV331 EQU   CVTS01+44                                                01395000
CVTRV330 EQU   CVTS01+40                                                01396000
CVTRV329 EQU   CVTS01+36                                                01397000
CVTRV328 EQU   CVTS01+32                                                01398000
CVTRV322 EQU   CVTS01+28                                                01399000
CVTSLID  EQU   CVTSLIDA+1                                               01400000
CVTSYLK  EQU   CVTSLIDA                                                 01401000
CVTRV321 EQU   CVTS01+20                                                01402000
CVTRV320 EQU   CVTS01+16                                                01403000
CVTLPDIR EQU   CVTLPDIA+1                                               01404000
CVTRSV69 EQU   CVTDIRST                                                 01405000
CVTRSV68 EQU   CVTDIRST                                                 01406000
CVTRSV67 EQU   CVTDIRST                                                 01407000
CVTRSV66 EQU   CVTDIRST                                                 01408000
CVTRSV65 EQU   CVTDIRST                                                 01409000
CVTRSV64 EQU   CVTDIRST                                                 01410000
CVTRSV63 EQU   CVTDIRST                                                 01411000
CVTDICOM EQU   CVTDIRST                                                 01412000
CVTPVTP  EQU   CVTS01+8                                                 01413000
CVTLPDSR EQU   CVTS01+4                                                 01414000
CVTGETL  EQU   CVTS01                                                   01415000
PSARSAV  EQU   PSARSVTE+60                                              01416000
PSARSTK  EQU   PSARSVTE+56                                              01417000
PSAESAV3 EQU   PSARSVTE+52                                              01418000
PSAESTK3 EQU   PSARSVTE+48                                              01419000
PSAESAV2 EQU   PSARSVTE+44                                              01420000
PSAESTK2 EQU   PSARSVTE+40                                              01421000
PSAESAV1 EQU   PSARSVTE+36                                              01422000
PSAESTK1 EQU   PSARSVTE+32                                              01423000
PSAPSAV  EQU   PSARSVTE+28                                              01424000
PSAPSTK  EQU   PSARSVTE+24                                              01425000
PSAMSAV  EQU   PSARSVTE+20                                              01426000
PSAMSTK  EQU   PSARSVTE+16                                              01427000
PSASSAV  EQU   PSARSVTE+12                                              01428000
PSASSTK  EQU   PSARSVTE+8                                               01429000
PSANSTK  EQU   PSARSVTE+4                                               01430000
PSACSTK  EQU   PSARSVTE                                                 01431000
@NM00061 EQU   TCBXTNT2+32                                              01432000
TCBRV181 EQU   TCBRV173                                                 01433000
TCBRV180 EQU   TCBRV173                                                 01434000
TCBRV179 EQU   TCBRV173                                                 01435000
TCBRV178 EQU   TCBRV173                                                 01436000
TCBRV177 EQU   TCBRV173                                                 01437000
TCBRV176 EQU   TCBRV173                                                 01438000
TCBRV175 EQU   TCBRV173                                                 01439000
TCBRV174 EQU   TCBRV173                                                 01440000
TCBRV172 EQU   TCBRV164                                                 01441000
TCBRV171 EQU   TCBRV164                                                 01442000
TCBRV170 EQU   TCBRV164                                                 01443000
TCBRV169 EQU   TCBRV164                                                 01444000
TCBRV168 EQU   TCBRV164                                                 01445000
TCBRV167 EQU   TCBRV164                                                 01446000
TCBRV166 EQU   TCBRV164                                                 01447000
TCBRV165 EQU   TCBRV164                                                 01448000
TCBRV163 EQU   TCBRV155                                                 01449000
TCBRV162 EQU   TCBRV155                                                 01450000
TCBRV161 EQU   TCBRV155                                                 01451000
TCBRV160 EQU   TCBRV155                                                 01452000
TCBRV159 EQU   TCBRV155                                                 01453000
TCBRV158 EQU   TCBRV155                                                 01454000
TCBRV157 EQU   TCBRV155                                                 01455000
TCBRV156 EQU   TCBRV155                                                 01456000
TCBRV154 EQU   TCBRV146                                                 01457000
TCBRV153 EQU   TCBRV146                                                 01458000
TCBRV152 EQU   TCBRV146                                                 01459000
TCBRV151 EQU   TCBRV146                                                 01460000
TCBRV150 EQU   TCBRV146                                                 01461000
TCBRV149 EQU   TCBRV146                                                 01462000
TCBRV148 EQU   TCBRV146                                                 01463000
TCBRV147 EQU   TCBRV146                                                 01464000
TCBRV145 EQU   TCBXTNT2+26                                              01465000
TCBRV144 EQU   TCBXTNT2+24                                              01466000
TCBRV143 EQU   TCBXTNT2+20                                              01467000
TCBRV142 EQU   TCBXTNT2+16                                              01468000
TCBRSV49 EQU   TCBXTNT2+12                                              01469000
TCBEVENT EQU   TCBXTNT2+8                                               01470000
TCBRCMP  EQU   TCBXTNT2+5                                               01471000
TCBRSVAB EQU   TCBXTNT2+4                                               01472000
TCBGTFA  EQU   TCBGTF+1                                                 01473000
TCBRSV47 EQU   TCBTFLG                                                  01474000
TCBRSV46 EQU   TCBTFLG                                                  01475000
TCBRSV45 EQU   TCBTFLG                                                  01476000
TCBRSV44 EQU   TCBTFLG                                                  01477000
TCBRSV43 EQU   TCBTFLG                                                  01478000
TCBDSPIT EQU   TCBTFLG                                                  01479000
TCBERRTN EQU   TCBTFLG                                                  01480000
TCBASYNC EQU   TCBTFLG                                                  01481000
@NM00060 EQU   TCB+296                                                  01482000
TCBSVCA2 EQU   TCB+292                                                  01483000
TCBSWASA EQU   TCB+288                                                  01484000
TCBDBTB  EQU   TCB+284                                                  01485000
TCBRPT   EQU   TCB+280                                                  01486000
TCBRV141 EQU   TCBRV133                                                 01487000
TCBRV140 EQU   TCBRV133                                                 01488000
TCBRV139 EQU   TCBRV133                                                 01489000
TCBRV138 EQU   TCBRV133                                                 01490000
TCBRV137 EQU   TCBRV133                                                 01491000
TCBRV136 EQU   TCBRV133                                                 01492000
TCBRV135 EQU   TCBRV133                                                 01493000
TCBRV134 EQU   TCBRV133                                                 01494000
TCBRV132 EQU   TCBRV124                                                 01495000
TCBRV131 EQU   TCBRV124                                                 01496000
TCBRV130 EQU   TCBRV124                                                 01497000
TCBRV129 EQU   TCBRV124                                                 01498000
TCBRV128 EQU   TCBRV124                                                 01499000
TCBRV127 EQU   TCBRV124                                                 01500000
TCBRV126 EQU   TCBRV124                                                 01501000
TCBRV125 EQU   TCBRV124                                                 01502000
TCBRV123 EQU   TCBFBYT2                                                 01503000
TCBRV122 EQU   TCBFBYT2                                                 01504000
TCBECBNV EQU   TCBFBYT2                                                 01505000
TCBSSSYN EQU   TCBFBYT2                                                 01506000
TCBFPRAP EQU   TCBFBYT2                                                 01507000
TCBFDW   EQU   TCBFBYT2                                                 01508000
TCBFMW   EQU   TCBFBYT2                                                 01509000
TCBCNCB  EQU   TCBFBYT2                                                 01510000
TCBLLH   EQU   TCBFBYT1                                                 01511000
TCBRV113 EQU   TCBFBYT1                                                 01512000
TCBEOT   EQU   TCBFBYT1                                                 01513000
TCBRTM2  EQU   TCBFBYT1                                                 01514000
TCBPGNLY EQU   TCBFBYT1                                                 01515000
TCBNDIOS EQU   TCBFBYT1                                                 01516000
TCBRV327 EQU   TCBFBYT1                                                 01517000
TCBEOTFM EQU   TCBFBYT1                                                 01518000
TCBAFFN  EQU   TCB+274                                                  01519000
TCBRV326 EQU   TCB+272                                                  01520000
TCBUKYSP EQU   TCB+268                                                  01521000
TCBMODE  EQU   TCBESTAE+3                                               01522000
TCBERTYP EQU   TCBESTAE+2                                               01523000
TCBRV314 EQU   TCBESTRM                                                 01524000
TCBRV313 EQU   TCBESTRM                                                 01525000
TCBRV312 EQU   TCBESTRM                                                 01526000
TCBRV311 EQU   TCBESTRM                                                 01527000
TCBRV310 EQU   TCBESTRM                                                 01528000
TCBRV309 EQU   TCBESTRM                                                 01529000
TCBRV308 EQU   TCBESTRM                                                 01530000
TCBETERM EQU   TCBESTRM                                                 01531000
TCBSCBKY EQU   TCBESTAE                                                 01532000
TCBRTM12 EQU   TCB+260                                                  01533000
TCBTCBID EQU   TCB+256                                                  01534000
TCBSTAWA EQU   TCB+252                                                  01535000
TCBSWA   EQU   TCB+248                                                  01536000
TCBFOEA  EQU   TCBFOE+1                                                 01537000
TCBRSV42 EQU   TCBFOE                                                   01538000
TCBCCPVI EQU   TCBXSCT+2                                                01539000
TCBRV325 EQU   TCBXSCT+1                                                01540000
TCBRV324 EQU   TCBXSCT1                                                 01541000
TCBRV323 EQU   TCBXSCT1                                                 01542000
TCBRV322 EQU   TCBXSCT1                                                 01543000
TCBRV321 EQU   TCBXSCT1                                                 01544000
TCBRV320 EQU   TCBXSCT1                                                 01545000
TCBRV319 EQU   TCBXSCT1                                                 01546000
TCBS3A   EQU   TCBXSCT1                                                 01547000
TCBACTIV EQU   TCBXSCT1                                                 01548000
TCBRSV41 EQU   TCB+239                                                  01549000
TCBTID   EQU   TCB+238                                                  01550000
TCBRSVAA EQU   TCB+237                                                  01551000
TCBABCUR EQU   TCB+236                                                  01552000
TCBTMSAV EQU   TCB+232                                                  01553000
TCBIOTIM EQU   TCB+228                                                  01554000
TCBRTWA  EQU   TCB+224                                                  01555000
TCBBACK  EQU   TCB+220                                                  01556000
TCBTIRB  EQU   TCB+216                                                  01557000
TCBAECB  EQU   TCB+212                                                  01558000
TCBEXT2A EQU   TCBEXT2+1                                                01559000
TCBRSV39 EQU   TCBEXT2                                                  01560000
TCBSTMCT EQU   TCB+207                                                  01561000
TCBSYSCT EQU   TCB+206                                                  01562000
TCBRSV37 EQU   TCB+205                                                  01563000
TCBEXSVC EQU   TCBDAR                                                   01564000
TCBDARMS EQU   TCBDAR                                                   01565000
TCBDARWT EQU   TCBDAR                                                   01566000
TCBDARO  EQU   TCBDAR                                                   01567000
TCBDARMC EQU   TCBDARC                                                  01568000
TCBDARD  EQU   TCBDAR                                                   01569000
TCBDARS  EQU   TCBDAR                                                   01570000
TCBDARP  EQU   TCBDAR                                                   01571000
TCBGTOFM EQU   TCBFLGS7                                                 01572000
TCBRSTSK EQU   TCBFLGS7                                                 01573000
TCBSVCS  EQU   TCBFLGS7                                                 01574000
TCBSTACK EQU   TCBFLGS7                                                 01575000
TCBRSV34 EQU   TCBFLGS7                                                 01576000
TCBRSV33 EQU   TCBFLGS7                                                 01577000
TCBGPECB EQU   TCBFLGS7                                                 01578000
TCBNTJS  EQU   TCBFLGS6                                                 01579000
TCBAPG   EQU   TCBFLGS6                                                 01580000
TCBMIGR  EQU   TCBFLGS6                                                 01581000
TCBRV303 EQU   TCBFLGS6                                                 01582000
TCBSPVLK EQU   TCBFLGS6                                                 01583000
TCBCPU   EQU   TCBFLGS6                                                 01584000
TCBPIE17 EQU   TCBFLGS6                                                 01585000
TCBRV    EQU   TCBFLGS6                                                 01586000
TCBRSV79 EQU   TCBNDSP5                                                 01587000
TCBRSV78 EQU   TCBNDSP5                                                 01588000
TCBRSV77 EQU   TCBNDSP5                                                 01589000
TCBRSV76 EQU   TCBNDSP5                                                 01590000
TCBRSV75 EQU   TCBNDSP5                                                 01591000
TCBRSV74 EQU   TCBNDSP5                                                 01592000
TCBRSV95 EQU   TCBNDSP5                                                 01593000
TCBRSV94 EQU   TCBNDSP5                                                 01594000
TCBRSV93 EQU   TCBNDSP4                                                 01595000
TCBRSV92 EQU   TCBNDSP4                                                 01596000
TCBRSV91 EQU   TCBNDSP4                                                 01597000
TCBRSV90 EQU   TCBNDSP4                                                 01598000
TCBRSV89 EQU   TCBNDSP4                                                 01599000
TCBRSV88 EQU   TCBNDSP4                                                 01600000
TCBRSV87 EQU   TCBNDSP4                                                 01601000
TCBRSV86 EQU   TCBNDSP4                                                 01602000
TCBEXT1A EQU   TCBEXT1+1                                                01603000
TCBRSV32 EQU   TCBEXT1                                                  01604000
TCBEXCPD EQU   TCB+192                                                  01605000
TCBIOBRC EQU   TCB+188                                                  01606000
TCBDDWTC EQU   TCB+186                                                  01607000
TCBDDEXC EQU   TCB+184                                                  01608000
TCBJSCBB EQU   TCBJSCB+1                                                01609000
@NM00059 EQU   TCBRECDE                                                 01610000
TCBREC   EQU   TCBRECDE                                                 01611000
TCBMDIDS EQU   TCB+176                                                  01612000
TCBNDINT EQU   TCBNDSP3                                                 01613000
TCBRSV27 EQU   TCBNDSP3                                                 01614000
TCBRSV26 EQU   TCBNDSP3                                                 01615000
TCBRSV25 EQU   TCBNDSP3                                                 01616000
TCBRSV24 EQU   TCBNDSP3                                                 01617000
TCBSRBND EQU   TCBNDSP3                                                 01618000
TCBRV302 EQU   TCBNDSP3                                                 01619000
TCBLJSND EQU   TCBNDSP3                                                 01620000
TCBABE   EQU   TCBNDSP2                                                 01621000
TCBDSS   EQU   TCBNDSP2                                                 01622000
TCBOWAIT EQU   TCBNDSP2                                                 01623000
TCBIWAIT EQU   TCBNDSP2                                                 01624000
TCBNDTS  EQU   TCBNDSP2                                                 01625000
TCBNDSVC EQU   TCBNDSP2                                                 01626000
TCBSTPP  EQU   TCBNDSP2                                                 01627000
TCBABD   EQU   TCBNDSP2                                                 01628000
TCBRSV22 EQU   TCBNDSP1                                                 01629000
TCBPIEND EQU   TCBNDSP1                                                 01630000
TCBTPSP  EQU   TCBNDSP1                                                 01631000
TCBDDRND EQU   TCBNDSP1                                                 01632000
TCBRSPND EQU   TCBNDSP1                                                 01633000
TCBRSTND EQU   TCBNDSP1                                                 01634000
TCBDARPN EQU   TCBNDSP1                                                 01635000
TCBDARTN EQU   TCBNDSP1                                                 01636000
TCBNDSP0 EQU   TCBNDSP                                                  01637000
TCBUSER  EQU   TCB+168                                                  01638000
TCBTCTB  EQU   TCBTCT+1                                                 01639000
TCBRSV9C EQU   TCBTCTGF                                                 01640000
TCBRSV9B EQU   TCBTCTGF                                                 01641000
TCBRSV9A EQU   TCBTCTGF                                                 01642000
TCBRSV99 EQU   TCBTCTGF                                                 01643000
TCBRSV98 EQU   TCBTCTGF                                                 01644000
TCBRSV97 EQU   TCBTCTGF                                                 01645000
TCBRSV20 EQU   TCBTCTGF                                                 01646000
TCBSMFGF EQU   TCBTCTGF                                                 01647000
TCBSTABB EQU   TCBSTAB+1                                                01648000
TCBSTCUR EQU   TCBNSTAE                                                 01649000
TCBRV301 EQU   TCBNSTAE                                                 01650000
TCBSYNCH EQU   TCBNSTAE                                                 01651000
TCBHALT  EQU   TCBNSTAE                                                 01652000
TCBPPSUP EQU   TCBNSTAE                                                 01653000
TCB33E   EQU   TCBNSTAE                                                 01654000
TCBQUIES EQU   TCBNSTAE                                                 01655000
TCBSTABE EQU   TCBNSTAE                                                 01656000
TCBAQE   EQU   TCB+156                                                  01657000
TCBPQE   EQU   TCB+152                                                  01658000
TCBTSDP  EQU   TCB+151                                                  01659000
TCBTSLP  EQU   TCB+150                                                  01660000
TCBSTPCT EQU   TCB+149                                                  01661000
TCBCPUBN EQU   TCBTSFLG                                                 01662000
TCBDYDSP EQU   TCBTSFLG                                                 01663000
TCBRSV18 EQU   TCBTSFLG                                                 01664000
TCBRSV17 EQU   TCBTSFLG                                                 01665000
TCBTIOTG EQU   TCBTSFLG                                                 01666000
TCBATT   EQU   TCBTSFLG                                                 01667000
TCBSTPPR EQU   TCBTSFLG                                                 01668000
TCBRV300 EQU   TCBTSTSK                                                 01669000
TCBECB   EQU   TCB+144                                                  01670000
TCBIQE   EQU   TCB+140                                                  01671000
TCBOTC   EQU   TCB+132                                                  01672000
TCBNTC   EQU   TCB+128                                                  01673000
TCBJSTCA EQU   TCBJSTCB+1                                               01674000
TCBRSV16 EQU   TCBJSTCB                                                 01675000
TCBTQET  EQU   TCBTME                                                   01676000
TCBTCB   EQU   TCB+116                                                  01677000
TCBFSAB  EQU   TCBFSA+1                                                 01678000
TCBQEL   EQU   TCBFSA                                                   01679000
TCBGRS15 EQU   TCBGRS+60                                                01680000
TCBGRS14 EQU   TCBGRS+56                                                01681000
TCBGRS13 EQU   TCBGRS+52                                                01682000
TCBGRS12 EQU   TCBGRS+48                                                01683000
TCBGRS11 EQU   TCBGRS+44                                                01684000
TCBGRS10 EQU   TCBGRS+40                                                01685000
TCBGRS9  EQU   TCBGRS+36                                                01686000
TCBGRS8  EQU   TCBGRS+32                                                01687000
TCBGRS7  EQU   TCBGRS+28                                                01688000
TCBGRS6  EQU   TCBGRS+24                                                01689000
TCBGRS5  EQU   TCBGRS+20                                                01690000
TCBGRS4  EQU   TCBGRS+16                                                01691000
TCBGRS3  EQU   TCBGRS+12                                                01692000
TCBGRS2  EQU   TCBGRS+8                                                 01693000
TCBGRS1  EQU   TCBGRS+4                                                 01694000
TCBGRS0  EQU   TCBGRS                                                   01695000
TCBJPQB  EQU   TCBJPQ+1                                                 01696000
TCBRSV15 EQU   TCBPURGE                                                 01697000
TCBRSV14 EQU   TCBPURGE                                                 01698000
TCBRSV13 EQU   TCBPURGE                                                 01699000
TCBRSV12 EQU   TCBPURGE                                                 01700000
TCBRSV11 EQU   TCBPURGE                                                 01701000
TCBRSV10 EQU   TCBPURGE                                                 01702000
TCBRSV09 EQU   TCBPURGE                                                 01703000
TCBJPQF  EQU   TCBPURGE                                                 01704000
TCBJLB   EQU   TCB+40                                                   01705000
TCBLLS   EQU   TCB+36                                                   01706000
TCBDSP   EQU   TCB+35                                                   01707000
TCBLMP   EQU   TCB+34                                                   01708000
TCBPNDSP EQU   TCBFLGS5                                                 01709000
TCBFCD1  EQU   TCBFLGS5                                                 01710000
TCBSTP   EQU   TCBFLGS5                                                 01711000
TCBSYS   EQU   TCBFLGS5                                                 01712000
TCBANDSP EQU   TCBFLGS5                                                 01713000
TCBPAGE  EQU   TCBFLGS5                                                 01714000
TCBUXNDF EQU   TCBABWF                                                  01715000
TCBFC    EQU   TCBFLGS5                                                 01716000
TCBONDSP EQU   TCBFLGS4                                                 01717000
TCBMPCND EQU   TCBFLGS4                                                 01718000
TCBMPCVQ EQU   TCBFLGS4                                                 01719000
TCBUXNDV EQU   TCBFLGS4                                                 01720000
TCBHNDSP EQU   TCBFLGS4                                                 01721000
TCBRQENA EQU   TCBFLGS4                                                 01722000
TCBSER   EQU   TCBFLGS4                                                 01723000
TCBNDUMP EQU   TCBFLGS4                                                 01724000
TCBDWSTA EQU   TCBFLGS3                                                 01725000
TCBRSV08 EQU   TCBFLGS3                                                 01726000
TCBRSV07 EQU   TCBFLGS3                                                 01727000
TCBRSV06 EQU   TCBFLGS3                                                 01728000
TCBABGM  EQU   TCBFLGS3                                                 01729000
TCBABTRM EQU   TCBFLGS3                                                 01730000
TCBADINP EQU   TCBFLGS3                                                 01731000
TCBFSM   EQU   TCBFLGS3                                                 01732000
TCBFTS   EQU   TCBFLGS2                                                 01733000
TCBFETXR EQU   TCBFLGS2                                                 01734000
TCBFDSOP EQU   TCBFLGS2                                                 01735000
TCBFJMC  EQU   TCBFLGS2                                                 01736000
TCBFSMC  EQU   TCBFLGS2                                                 01737000
TCBFABOP EQU   TCBFLGS2                                                 01738000
TCBFSTI  EQU   TCBFLGS2                                                 01739000
TCBFOINP EQU   TCBFLGS2                                                 01740000
TCBFX    EQU   TCBFLGS1                                                 01741000
TCBFS    EQU   TCBFLGS1                                                 01742000
TCBFT    EQU   TCBFLGS1                                                 01743000
TCBPDUMP EQU   TCBFLGS1                                                 01744000
TCBNONPR EQU   TCBFLGS1                                                 01745000
TCBFERA  EQU   TCBFLGS1                                                 01746000
TCBFE    EQU   TCBFLGS1                                                 01747000
TCBFA    EQU   TCBFLGS1                                                 01748000
TCBZERO  EQU   TCBPKF                                                   01749000
TCBFLAG  EQU   TCBPKF                                                   01750000
TCBMSSB  EQU   TCBMSS+1                                                 01751000
TCBRSV03 EQU   TCBMSS                                                   01752000
TCBTRNB  EQU   TCBTRN+1                                                 01753000
TCBRSV02 EQU   TCBABF                                                   01754000
TCBOLTEP EQU   TCBABF                                                   01755000
TCBTCP   EQU   TCBABF                                                   01756000
TCBTCPP  EQU   TCBABF                                                   01757000
TCBRSV01 EQU   TCBABF                                                   01758000
TCBGRPH  EQU   TCBABF                                                   01759000
TCBNOCHK EQU   TCBABF                                                   01760000
TCBMOD91 EQU   TCBABF                                                   01761000
TCBCMPC  EQU   TCBCMP+1                                                 01762000
TCBRV318 EQU   TCBCMSG                                                  01763000
TCBRV317 EQU   TCBCIND                                                  01764000
TCBRV316 EQU   TCBCWTO                                                  01765000
TCBCASID EQU   TCBCDBL                                                  01766000
TCBNOCC  EQU   TCBSTCC                                                  01767000
TCBDMPO  EQU   TCBCPP                                                   01768000
TCBCSTEP EQU   TCBCMPF                                                  01769000
TCBCREQ  EQU   TCBCMPF                                                  01770000
TCBTIO   EQU   TCB+12                                                   01771000
TCBDEB   EQU   TCB+8                                                    01772000
TCBPIEA  EQU   TCBPIE+1                                                 01773000
TCBPM    EQU   TCBPMASK                                                 01774000
@NM00058 EQU   TCBPMASK                                                 01775000
TCBRBP   EQU   TCB                                                      01776000
TCBFRS6  EQU   TCBFRS+24                                                01777000
TCBFRS4  EQU   TCBFRS+16                                                01778000
TCBFRS2  EQU   TCBFRS+8                                                 01779000
TCBFRS0  EQU   TCBFRS                                                   01780000
SPQERES2 EQU   SPQESECT+12                                              01781000
SPQEKEY  EQU   SPQESECT+11                                              01782000
SPQEID   EQU   SPQESECT+10                                              01783000
SPQERES1 EQU   SPQESECT+9                                               01784000
SPQEOWN  EQU   SPQEFLGS                                                 01785000
LASTSPQE EQU   SPQEFLGS                                                 01786000
SPSHARE  EQU   SPQEFLGS                                                 01787000
SPDQEAD  EQU   SPDQEPTR                                                 01788000
SPQEPTR  EQU   SPQEAD                                                   01789000
@NM00057 EQU   PCCA+512                                                 01790000
PCCACAT  EQU   PCCA+384                                                 01791000
PCCARV36 EQU   PCCA+380                                                 01792000
PCCARV35 EQU   PCCA+378                                                 01793000
PCCARV01 EQU   PCCA+377                                                 01794000
PCCACPUM EQU   PCCA+376                                                 01795000
PCCARV63 EQU   PCCA+372                                                 01796000
PCCARV62 EQU   PCCA+368                                                 01797000
PCCARV61 EQU   PCCA+364                                                 01798000
PCCARV60 EQU   PCCA+360                                                 01799000
PCCARV59 EQU   PCCA+356                                                 01800000
PCCARV58 EQU   PCCA+352                                                 01801000
PCCARV57 EQU   PCCA+348                                                 01802000
PCCARV56 EQU   PCCA+344                                                 01803000
PCCARV55 EQU   PCCA+340                                                 01804000
PCCARV54 EQU   PCCA+336                                                 01805000
PCCALOGA EQU   PCCA+332                                                 01806000
PCCACHID EQU   PCCA+324                                                 01807000
PCCACHSV EQU   PCCA+312                                                 01808000
PCCARV79 EQU   PCCACHF4                                                 01809000
PCCARV78 EQU   PCCACHF4                                                 01810000
PCCARV77 EQU   PCCACHF4                                                 01811000
PCCARV76 EQU   PCCACHF4                                                 01812000
PCCARV75 EQU   PCCACHF4                                                 01813000
PCCARV74 EQU   PCCACHF4                                                 01814000
PCCARV73 EQU   PCCACHF4                                                 01815000
PCCARV72 EQU   PCCACHF4                                                 01816000
PCCARV71 EQU   PCCACHF3                                                 01817000
PCCARV70 EQU   PCCACHF3                                                 01818000
PCCARV69 EQU   PCCACHF3                                                 01819000
PCCARV68 EQU   PCCACHF3                                                 01820000
PCCARV67 EQU   PCCACHF3                                                 01821000
PCCARV66 EQU   PCCACHF3                                                 01822000
PCCARV65 EQU   PCCACHF3                                                 01823000
PCCARV64 EQU   PCCACHF3                                                 01824000
PCCACF28 EQU   PCCACHF2                                                 01825000
PCCACF27 EQU   PCCACHF2                                                 01826000
PCCACF26 EQU   PCCACHF2                                                 01827000
PCCACF25 EQU   PCCACHF2                                                 01828000
PCCACF24 EQU   PCCACHF2                                                 01829000
PCCACF23 EQU   PCCACHF2                                                 01830000
PCCACF22 EQU   PCCACHF2                                                 01831000
PCCACF21 EQU   PCCACHF2                                                 01832000
PCCACF18 EQU   PCCACHF1                                                 01833000
PCCACF17 EQU   PCCACHF1                                                 01834000
PCCACF16 EQU   PCCACHF1                                                 01835000
PCCACF15 EQU   PCCACHF1                                                 01836000
PCCACF14 EQU   PCCACHF1                                                 01837000
PCCACF13 EQU   PCCACHF1                                                 01838000
PCCACF12 EQU   PCCACHF1                                                 01839000
PCCACF11 EQU   PCCACHF1                                                 01840000
PCCARV05 EQU   PCCA+306                                                 01841000
PCCACHPB EQU   PCCA+305                                                 01842000
PCCALGP2 EQU   PCCA+304                                                 01843000
PCCALGP1 EQU   PCCA+303                                                 01844000
PCCALOGL EQU   PCCA+302                                                 01845000
PCCARV80 EQU   PCCA+300                                                 01846000
PCCACHW2 EQU   PCCA+296                                                 01847000
PCCACHW1 EQU   PCCA+292                                                 01848000
PCCAIOSI EQU   PCCA+291                                                 01849000
PCCACNRB EQU   PCCACHRB                                                 01850000
PCCACCVB EQU   PCCACHRB                                                 01851000
PCCACSNB EQU   PCCACHRB                                                 01852000
PCCARV52 EQU   PCCACHRB                                                 01853000
PCCACHIB EQU   PCCACHRB                                                 01854000
PCCACTIB EQU   PCCACHRB                                                 01855000
PCCACINB EQU   PCCACHRB                                                 01856000
PCCACSIB EQU   PCCACHRB                                                 01857000
PCCARV51 EQU   PCCACHS2                                                 01858000
PCCARV50 EQU   PCCACHS2                                                 01859000
PCCACCRA EQU   PCCACHS2                                                 01860000
PCCACURC EQU   PCCACHS2                                                 01861000
PCCACNLG EQU   PCCACHS2                                                 01862000
PCCACMOD EQU   PCCACHS2                                                 01863000
PCCACALT EQU   PCCACHS2                                                 01864000
PCCACIOR EQU   PCCACHS2                                                 01865000
PCCARV47 EQU   PCCACHS1                                                 01866000
PCCACUCB EQU   PCCACHS1                                                 01867000
PCCACIBC EQU   PCCACHS1                                                 01868000
PCCACAND EQU   PCCACHS1                                                 01869000
PCCACNLS EQU   PCCACHS1                                                 01870000
PCCACFRR EQU   PCCACHS1                                                 01871000
PCCACNRE EQU   PCCACHS1                                                 01872000
PCCACCMP EQU   PCCACHS1                                                 01873000
PCCACSEQ EQU   PCCACHTS                                                 01874000
PCCACDIN EQU   PCCACHTS                                                 01875000
PCCARV44 EQU   PCCACHTS                                                 01876000
PCCARV43 EQU   PCCACHTS                                                 01877000
PCCACTEC EQU   PCCACHTS                                                 01878000
PCCACDAV EQU   PCCACHVA                                                 01879000
PCCACCHV EQU   PCCACHVA                                                 01880000
PCCACCMD EQU   PCCACHVA                                                 01881000
PCCACUNS EQU   PCCACHVA                                                 01882000
PCCACSQV EQU   PCCACHVA                                                 01883000
PCCARV42 EQU   PCCACHVA                                                 01884000
PCCARV41 EQU   PCCACHVA                                                 01885000
PCCACITF EQU   PCCACHVA                                                 01886000
PCCARV40 EQU   PCCACHBL                                                 01887000
PCCARV39 EQU   PCCACHBL                                                 01888000
PCCARV38 EQU   PCCACHBL                                                 01889000
PCCACCUE EQU   PCCACHBL                                                 01890000
PCCACSTG EQU   PCCACHBL                                                 01891000
PCCACSCU EQU   PCCACHBL                                                 01892000
PCCACCHA EQU   PCCACHBL                                                 01893000
PCCACCPU EQU   PCCACHBL                                                 01894000
PCCACNOR EQU   PCCACHPF                                                 01895000
PCCACCNT EQU   PCCACHPF                                                 01896000
PCCACSNS EQU   PCCACHPF                                                 01897000
PCCARV37 EQU   PCCACHPF                                                 01898000
PCCACHIO EQU   PCCACHPF                                                 01899000
PCCACTIO EQU   PCCACHPF                                                 01900000
PCCACINT EQU   PCCACHPF                                                 01901000
PCCACSIO EQU   PCCACHPF                                                 01902000
PCCACHUB EQU   PCCAWERP                                                 01903000
PCCACHEL EQU   PCCA+168                                                 01904000
PCCALRBR EQU   PCCA+164                                                 01905000
PCCALRBV EQU   PCCA+160                                                 01906000
PCCAPWAR EQU   PCCA+156                                                 01907000
PCCAPWAV EQU   PCCA+152                                                 01908000
PCCAEMSA EQU   PCCAEMSB+12                                              01909000
PCCAEMSE EQU   PCCAEMSB+8                                               01910000
PCCAEMSP EQU   PCCAEMSB+4                                               01911000
PCCARMS  EQU   PCCARMSB                                                 01912000
PCCARV34 EQU   PCCARMSB                                                 01913000
PCCARV33 EQU   PCCARMSB                                                 01914000
PCCARV32 EQU   PCCARMSB                                                 01915000
PCCARV31 EQU   PCCARMSB                                                 01916000
PCCARV30 EQU   PCCARMSB                                                 01917000
PCCARV29 EQU   PCCARMSB                                                 01918000
PCCARV28 EQU   PCCARMSB                                                 01919000
PCCARV27 EQU   PCCAEMS3                                                 01920000
PCCARV26 EQU   PCCAEMS3                                                 01921000
PCCARV25 EQU   PCCAEMS3                                                 01922000
PCCARV24 EQU   PCCAEMS3                                                 01923000
PCCARV23 EQU   PCCAEMS3                                                 01924000
PCCARV22 EQU   PCCAEMS3                                                 01925000
PCCARV21 EQU   PCCAEMS3                                                 01926000
PCCARV20 EQU   PCCAEMS3                                                 01927000
PCCARV19 EQU   PCCAEMS2                                                 01928000
PCCARV18 EQU   PCCAEMS2                                                 01929000
PCCARV17 EQU   PCCAEMS2                                                 01930000
PCCARV16 EQU   PCCAEMS2                                                 01931000
PCCARV15 EQU   PCCAEMS2                                                 01932000
PCCARV14 EQU   PCCAEMS2                                                 01933000
PCCARV13 EQU   PCCAEMS2                                                 01934000
PCCARV12 EQU   PCCAEMS2                                                 01935000
PCCARV11 EQU   PCCARISP                                                 01936000
PCCARV10 EQU   PCCARISP                                                 01937000
PCCARV09 EQU   PCCARISP                                                 01938000
PCCARV08 EQU   PCCARISP                                                 01939000
PCCARV07 EQU   PCCARISP                                                 01940000
PCCARV06 EQU   PCCARISP                                                 01941000
PCCASERL EQU   PCCARISP                                                 01942000
PCCAPARL EQU   PCCARISP                                                 01943000
PCCARPB  EQU   PCCA+132                                                 01944000
PCCACTIN EQU   PCCAINTE                                                 01945000
PCCANFIN EQU   PCCAINTE                                                 01946000
PCCANUIN EQU   PCCAINTE                                                 01947000
PCCACTCC EQU   PCCACCE                                                  01948000
PCCANFCC EQU   PCCACCE                                                  01949000
PCCANUCC EQU   PCCACCE                                                  01950000
PCCACTTD EQU   PCCATODE                                                 01951000
PCCANFTD EQU   PCCATODE                                                 01952000
PCCANUTD EQU   PCCATODE                                                 01953000
PCCARV04 EQU   PCCATMFL                                                 01954000
PCCARV03 EQU   PCCATMFL                                                 01955000
PCCARV02 EQU   PCCATMFL                                                 01956000
PCCAMINT EQU   PCCATMFL                                                 01957000
PCCAMCC  EQU   PCCATMFL                                                 01958000
PCCAVKIL EQU   PCCATMFL                                                 01959000
PCCASYNC EQU   PCCATMFL                                                 01960000
PCCAINIT EQU   PCCATMFL                                                 01961000
PCCARV9E EQU   PCCA+124                                                 01962000
PCCARV9D EQU   PCCA+120                                                 01963000
PCCARV9C EQU   PCCA+116                                                 01964000
PCCARV9B EQU   PCCA+112                                                 01965000
PCCARV9A EQU   PCCA+108                                                 01966000
PCCARV99 EQU   PCCA+104                                                 01967000
PCCARV98 EQU   PCCA+100                                                 01968000
PCCARV97 EQU   PCCA+96                                                  01969000
PCCARV96 EQU   PCCA+92                                                  01970000
PCCARV95 EQU   PCCA+88                                                  01971000
PCCARV94 EQU   PCCA+84                                                  01972000
PCCARV93 EQU   PCCA+80                                                  01973000
PCCARV92 EQU   PCCA+76                                                  01974000
PCCARV91 EQU   PCCA+72                                                  01975000
PCCARV90 EQU   PCCA+68                                                  01976000
PCCARV89 EQU   PCCA+64                                                  01977000
PCCARV88 EQU   PCCA+60                                                  01978000
PCCARV87 EQU   PCCA+56                                                  01979000
PCCARV86 EQU   PCCA+52                                                  01980000
PCCARV85 EQU   PCCA+48                                                  01981000
PCCARV84 EQU   PCCA+44                                                  01982000
PCCARV83 EQU   PCCA+40                                                  01983000
PCCARV82 EQU   PCCA+36                                                  01984000
PCCARV81 EQU   PCCA+32                                                  01985000
PCCAPSAR EQU   PCCA+28                                                  01986000
PCCAPSAV EQU   PCCA+24                                                  01987000
PCCATQEP EQU   PCCA+20                                                  01988000
PCCACAFM EQU   PCCA+18                                                  01989000
PCCACPUA EQU   PCCA+16                                                  01990000
PCCACPID EQU   PCCA+4                                                   01991000
PCCAPCCA EQU   PCCA                                                     01992000
LDAEND   EQU   LDA+1496                                                 01993000
LCLCELCT EQU   LDA+1492                                                 01994000
LCLCELL  EQU   LDA+1488                                                 01995000
LDALIMIT EQU   LDA+1484                                                 01996000
LDARSVPT EQU   LDA+1480                                                 01997000
LDASRPQE EQU   LDA+1476                                                 01998000
CURRGNTP EQU   LDA+1472                                                 01999000
VVREGSZ  EQU   LDA+1468                                                 02000000
CFAPWKAR EQU   LDA+1164                                                 02001000
CSAVE    EQU   LDA+1100                                                 02002000
OBFRSAVE EQU   LDA+1036                                                 02003000
GFRESAVE EQU   LDA+972                                                  02004000
GMREPSAV EQU   LDA+908                                                  02005000
FBQSAVE  EQU   LDA+844                                                  02006000
G4KSAVE  EQU   LDA+780                                                  02007000
FSAVE    EQU   LDA+716                                                  02008000
BSAVE    EQU   LDA+652                                                  02009000
SAVEREG2 EQU   LDA+588                                                  02010000
BRANCHSV EQU   LDA+524                                                  02011000
GMFMWKAR EQU   LDA+24                                                   02012000
LDARES2  EQU   LDA+21                                                   02013000
LDACBSP  EQU   LDA+20                                                   02014000
LDARQSTA EQU   LDA+16                                                   02015000
LDATCB   EQU   LDA+12                                                   02016000
ASDPQE   EQU   LDA+8                                                    02017000
PASCBSV  EQU   LDA+4                                                    02018000
@NM00056 EQU   LVSMFLAG+1                                               02019000
LDABRSW  EQU   LVSMFLAG                                                 02020000
LDAFPFM  EQU   LVSMFLAG                                                 02021000
LDAFLAGS EQU   LVSMFLAG                                                 02022000
LDASTART EQU   LDA                                                      02023000
GBLCELCT EQU   GDA+60                                                   02024000
GLBLCELL EQU   GDA+56                                                   02025000
CSASPQEP EQU   GDA+52                                                   02026000
PFSTCPAB EQU   GDA+48                                                   02027000
VRWLEL   EQU   VRWAITQ+4                                                02028000
VRWFEL   EQU   VRWAITQ                                                  02029000
VRPLEL   EQU   VRPOSTQ+4                                                02030000
VRPFEL   EQU   VRPOSTQ                                                  02031000
SQASPLFT EQU   GDA+28                                                   02032000
PASIZE   EQU   GDA+20                                                   02033000
PASTRT   EQU   GDA+16                                                   02034000
VRPQEP   EQU   GDA+12                                                   02035000
CSAPQEP  EQU   GDA+8                                                    02036000
VRDREG   EQU   GDA+4                                                    02037000
RESV     EQU   GVSMFLAG+1                                               02038000
@NM00055 EQU   GDAFLAGS                                                 02039000
WAITQUE  EQU   GDAFLAGS                                                 02040000
SQATHRS2 EQU   GDAFLAGS                                                 02041000
SQATHRS1 EQU   GDAFLAGS                                                 02042000
GDAFLAG2 EQU   GDAFLAGS                                                 02043000
NIPFOURK EQU   GDAFLAGS                                                 02044000
GDAFLAG1 EQU   GDAFLAGS                                                 02045000
DQEHRID  EQU   DQEBLKAD                                                 02046000
DQFQEPTR EQU   DQESECT                                                  02047000
CVTLEVL  EQU   CVTRELNO+2                                               02048000
CVTNUMB  EQU   CVTRELNO                                                 02049000
CVTMDL   EQU   CVTFIX+250                                               02050000
@NM00054 EQU   CVTFIX+248                                               02051000
@NM00053 EQU   CVTFIX                                                   02052000
CVTRV482 EQU   CVTXTNT2+128                                             02053000
CVTRV481 EQU   CVTXTNT2+124                                             02054000
CVTRV480 EQU   CVTXTNT2+120                                             02055000
CVTRV479 EQU   CVTXTNT2+118                                             02056000
CVTRV478 EQU   CVTXTNT2+117                                             02057000
CVTRV477 EQU   CVTXTNT2+116                                             02058000
CVTRV476 EQU   CVTXTNT2+115                                             02059000
CVTRV475 EQU   CVTXTNT2+114                                             02060000
CVTRV474 EQU   CVTRV466                                                 02061000
CVTRV473 EQU   CVTRV466                                                 02062000
CVTRV472 EQU   CVTRV466                                                 02063000
CVTRV471 EQU   CVTRV466                                                 02064000
CVTRV470 EQU   CVTRV466                                                 02065000
CVTRV469 EQU   CVTRV466                                                 02066000
CVTRV468 EQU   CVTRV466                                                 02067000
CVTRV467 EQU   CVTRV466                                                 02068000
CVTRV465 EQU   CVTRV457                                                 02069000
CVTRV464 EQU   CVTRV457                                                 02070000
CVTRV463 EQU   CVTRV457                                                 02071000
CVTRV462 EQU   CVTRV457                                                 02072000
CVTRV461 EQU   CVTRV457                                                 02073000
CVTRV460 EQU   CVTRV457                                                 02074000
CVTRV459 EQU   CVTRV457                                                 02075000
CVTRV458 EQU   CVTRV457                                                 02076000
CVTRV456 EQU   CVTXTNT2+108                                             02077000
CVTRV455 EQU   CVTXTNT2+104                                             02078000
CVTRV454 EQU   CVTXTNT2+100                                             02079000
CVTRV453 EQU   CVTXTNT2+96                                              02080000
CVTRV452 EQU   CVTXTNT2+94                                              02081000
CVTRV451 EQU   CVTXTNT2+92                                              02082000
CVTRV450 EQU   CVTXTNT2+90                                              02083000
CVTRV449 EQU   CVTXTNT2+88                                              02084000
CVTRV448 EQU   CVTXTNT2+87                                              02085000
CVTRV447 EQU   CVTXTNT2+86                                              02086000
CVTRV446 EQU   CVTRV438                                                 02087000
CVTRV445 EQU   CVTRV438                                                 02088000
CVTRV444 EQU   CVTRV438                                                 02089000
CVTRV443 EQU   CVTRV438                                                 02090000
CVTRV442 EQU   CVTRV438                                                 02091000
CVTRV441 EQU   CVTRV438                                                 02092000
CVTRV440 EQU   CVTRV438                                                 02093000
CVTRV439 EQU   CVTRV438                                                 02094000
CVTRV437 EQU   CVTRV429                                                 02095000
CVTRV436 EQU   CVTRV429                                                 02096000
CVTRV435 EQU   CVTRV429                                                 02097000
CVTRV434 EQU   CVTRV429                                                 02098000
CVTRV433 EQU   CVTRV429                                                 02099000
CVTRV432 EQU   CVTRV429                                                 02100000
CVTRV431 EQU   CVTRV429                                                 02101000
CVTRV430 EQU   CVTRV429                                                 02102000
CVTRV428 EQU   CVTXTNT2+80                                              02103000
CVTRV427 EQU   CVTXTNT2+76                                              02104000
CVTRV426 EQU   CVTXTNT2+72                                              02105000
CVTRV425 EQU   CVTXTNT2+68                                              02106000
CVTATACT EQU   CVTATCVT                                                 02107000
CVTRV423 EQU   CVTXTNT2+62                                              02108000
CVTRV422 EQU   CVTXTNT2+60                                              02109000
CVTRV421 EQU   CVTXTNT2+58                                              02110000
CVTRV420 EQU   CVTXTNT2+56                                              02111000
CVTRV419 EQU   CVTXTNT2+55                                              02112000
CVTRV418 EQU   CVTXTNT2+54                                              02113000
CVTRV417 EQU   CVTRV409                                                 02114000
CVTRV416 EQU   CVTRV409                                                 02115000
CVTRV415 EQU   CVTRV409                                                 02116000
CVTRV414 EQU   CVTRV409                                                 02117000
CVTRV413 EQU   CVTRV409                                                 02118000
CVTRV412 EQU   CVTRV409                                                 02119000
CVTRV411 EQU   CVTRV409                                                 02120000
CVTRV410 EQU   CVTRV409                                                 02121000
CVTRV408 EQU   CVTRV400                                                 02122000
CVTRV407 EQU   CVTRV400                                                 02123000
CVTRV406 EQU   CVTRV400                                                 02124000
CVTRV405 EQU   CVTRV400                                                 02125000
CVTRV404 EQU   CVTRV400                                                 02126000
CVTRV403 EQU   CVTRV400                                                 02127000
CVTRV402 EQU   CVTRV400                                                 02128000
CVTRV401 EQU   CVTRV400                                                 02129000
CVTICB   EQU   CVTXTNT2+48                                              02130000
CVTSKTA  EQU   CVTXTNT2+44                                              02131000
CVTRSV99 EQU   CVTXTNT2+40                                              02132000
CVTRSV98 EQU   CVTXTNT2+36                                              02133000
CVTRSV97 EQU   CVTXTNT2+34                                              02134000
CVTRSV96 EQU   CVTXTNT2+32                                              02135000
CVTOLTEP EQU   CVTXTNT2+28                                              02136000
CVTQIDA  EQU   CVTQID+1                                                 02137000
CVTRSV95 EQU   CVTQID                                                   02138000
CVTRSV94 EQU   CVTXTNT2+20                                              02139000
CVTRSV93 EQU   CVTXTNT2+16                                              02140000
CVTRSV92 EQU   CVTXTNT2+12                                              02141000
CVTDEBVR EQU   CVTXTNT2+8                                               02142000
CVTRSV91 EQU   CVTXTNT2+6                                               02143000
CVTRSV9H EQU   CVTFLGBT                                                 02144000
CVTRSV9G EQU   CVTFLGBT                                                 02145000
CVTRSV9F EQU   CVTFLGBT                                                 02146000
CVTRSV9E EQU   CVTFLGBT                                                 02147000
CVTRSV9D EQU   CVTFLGBT                                                 02148000
CVTBAH   EQU   CVTFLGBT                                                 02149000
CVTVME   EQU   CVTFLGBT                                                 02150000
CVTNPE   EQU   CVTFLGBT                                                 02151000
CVTNUCLS EQU   CVTXTNT2+4                                               02152000
CVTDSSVA EQU   CVTDSSV+1                                                02153000
CVTRSV89 EQU   CVTDSSV                                                  02154000
CVTRSV88 EQU   CVTXTNT1+8                                               02155000
CVTRSV87 EQU   CVTXTNT1+4                                               02156000
CVTFACHN EQU   CVTXTNT1                                                 02157000
CVTRV488 EQU   CVTMAP+412                                               02158000
CVTRV487 EQU   CVTMAP+408                                               02159000
CVTRV486 EQU   CVTMAP+404                                               02160000
CVTRV485 EQU   CVTMAP+400                                               02161000
CVTACTAP EQU   CVTMAP+396                                               02162000
CVTAUTH  EQU   CVTMAP+392                                               02163000
CVTRV490 EQU   CVTMAP+388                                               02164000
CVTRSV61 EQU   CVTMAP+384                                               02165000
CVTVOLT1 EQU   CVTVOLM1+1                                               02166000
CVTVOLI1 EQU   CVTVOLF1                                                 02167000
CVTSTOA  EQU   CVTMAP+376                                               02168000
CVTRSV58 EQU   CVTMAP+374                                               02169000
CVTRSV57 EQU   CVTMAP+372                                               02170000
CVTDDCE  EQU   CVTMAP+368                                               02171000
CVTPNWFR EQU   CVTMAP+364                                               02172000
CVTSMF   EQU   CVTMAP+360                                               02173000
CVTSULK  EQU   CVTMAP+358                                               02174000
CVTSLKO  EQU   CVTSYSK                                                  02175000
CVTSLKP  EQU   CVTSYSK                                                  02176000
CVTSLKQ  EQU   CVTSYSK                                                  02177000
CVTSLKR  EQU   CVTSYSK                                                  02178000
CVTRSV56 EQU   CVTSYSK                                                  02179000
CVTRSV55 EQU   CVTSYSK                                                  02180000
CVTRSV54 EQU   CVTSYSK                                                  02181000
CVTRSV53 EQU   CVTSYSK                                                  02182000
CVTRSV52 EQU   CVTA1F1                                                  02183000
CVTRSV51 EQU   CVTA1F1                                                  02184000
CVTRSV50 EQU   CVTA1F1                                                  02185000
CVTRSV49 EQU   CVTA1F1                                                  02186000
CVTRSV48 EQU   CVTA1F1                                                  02187000
CVTRSV47 EQU   CVTA1F1                                                  02188000
CVTSRSW  EQU   CVTA1F1                                                  02189000
CVTPFSW  EQU   CVTA1F1                                                  02190000
CVTPCVT  EQU   CVTMAP+352                                               02191000
CVTRSV46 EQU   CVTMAP+344                                               02192000
CVTRSV45 EQU   CVTMAP+340                                               02193000
CVTRSV44 EQU   CVTMAP+338                                               02194000
CVTRSV43 EQU   CVTMAP+336                                               02195000
CVTHJESA EQU   CVTHJES+1                                                02196000
CVTRSV42 EQU   CVTHJES                                                  02197000
CVTEXT2A EQU   CVTEXT2+1                                                02198000
CVTRSV41 EQU   CVTEXT2                                                  02199000
CVTAPFA  EQU   CVTAPF+1                                                 02200000
CVTRSV40 EQU   CVTAPF                                                   02201000
CVTRV518 EQU   CVTINTLA                                                 02202000
CVTRV517 EQU   CVTERPV                                                  02203000
CVTEORM  EQU   CVTMAP+312                                               02204000
CVTMCHPR EQU   CVTMAP+308                                               02205000
CVTTZ    EQU   CVTMAP+304                                               02206000
CVTJEPS  EQU   CVTMAP+300                                               02207000
CVTJESCT EQU   CVTMAP+296                                               02208000
CVTMODE  EQU   CVTMAP+292                                               02209000
CVTPTRV  EQU   CVTMAP+288                                               02210000
CVTREAL  EQU   CVTMAP+284                                               02211000
CVTRSV39 EQU   CVTMAP+280                                               02212000
CVTRSV38 EQU   CVTMAP+276                                               02213000
CVTDMSRA EQU   CVTDMSR+1                                                02214000
CVTRV634 EQU   CVTDMSRF                                                 02215000
CVTRV633 EQU   CVTDMSRF                                                 02216000
CVTRV632 EQU   CVTDMSRF                                                 02217000
CVTRV631 EQU   CVTDMSRF                                                 02218000
CVTRV630 EQU   CVTDMSRF                                                 02219000
CVTRV629 EQU   CVTDMSRF                                                 02220000
CVTUDUMP EQU   CVTDMSRF                                                 02221000
CVTSDUMP EQU   CVTDMSRF                                                 02222000
CVTQMSGA EQU   CVTQMSG+1                                                02223000
CVTRSV36 EQU   CVTQMSG                                                  02224000
CVTAMFF  EQU   CVTMAP+264                                               02225000
CVTPURGA EQU   CVTPURG+1                                                02226000
CVTRSV35 EQU   CVTPURG                                                  02227000
CVTCBSP  EQU   CVTMAP+256                                               02228000
CVTATERA EQU   CVTATER+1                                                02229000
CVTSYST  EQU   CVTATER                                                  02230000
CVTVOLT2 EQU   CVTTAT                                                   02231000
CVTVOLI2 EQU   CVTVOLF2                                                 02232000
CVTAQAVB EQU   CVTAQAVT+1                                               02233000
CVTRSV34 EQU   CVTTCMFG                                                 02234000
CVTRSV33 EQU   CVTTCMFG                                                 02235000
CVTRSV32 EQU   CVTTCMFG                                                 02236000
CVTRSV31 EQU   CVTTCMFG                                                 02237000
CVTRSV30 EQU   CVTTCMFG                                                 02238000
CVTRSV29 EQU   CVTTCMFG                                                 02239000
CVTLDEV  EQU   CVTTCMFG                                                 02240000
CVTTCRDY EQU   CVTTCMFG                                                 02241000
CVTGTFA  EQU   CVTGTF+1                                                 02242000
CVTRSV27 EQU   CVTGTFST                                                 02243000
CVTRNIO  EQU   CVTGTFST                                                 02244000
CVTUSR   EQU   CVTGTFST                                                 02245000
CVTRV318 EQU   CVTFORM                                                  02246000
CVTRV317 EQU   CVTTMODE                                                 02247000
CVTRV316 EQU   CVTSTATE                                                 02248000
CVTRV315 EQU   CVTGTFS                                                  02249000
CVTGTFAV EQU   CVTGTFS                                                  02250000
CVT0SCR1 EQU   CVTMAP+232                                               02251000
CVTRV515 EQU   CVTMAP+228                                               02252000
CVTRMS   EQU   CVTMAP+224                                               02253000
CVTPATCH EQU   CVTMAP+220                                               02254000
CVTTSCE  EQU   CVTMAP+216                                               02255000
CVTLNKSC EQU   CVTMAP+214                                               02256000
CVTQABST EQU   CVTMAP+212                                               02257000
CVTMDLDS EQU   CVTMAP+208                                               02258000
CVTUSER  EQU   CVTMAP+204                                               02259000
CVTABEND EQU   CVTMAP+200                                               02260000
CVTSMCA  EQU   CVTMAP+196                                               02261000
CVTRSV18 EQU   CVTMAP+192                                               02262000
CVTQLPAQ EQU   CVTMAP+188                                               02263000
CVTQCDSR EQU   CVTMAP+184                                               02264000
CVTRSV17 EQU   CVTOPTB                                                  02265000
CVTVS1A  EQU   CVTOPTB                                                  02266000
CVTFP    EQU   CVTOPTB                                                  02267000
CVTAPTHR EQU   CVTOPTB                                                  02268000
CVTNLOG  EQU   CVTOPTB                                                  02269000
CVTTOD   EQU   CVTOPTB                                                  02270000
CVTCTIMS EQU   CVTOPTB                                                  02271000
CVTPROT  EQU   CVTOPTB                                                  02272000
CVTXPFP  EQU   CVTOPTA                                                  02273000
CVTASCII EQU   CVTOPTA                                                  02274000
CVTRSV13 EQU   CVTOPTA                                                  02275000
CVTRSV12 EQU   CVTOPTA                                                  02276000
CVTNIP   EQU   CVTOPTA                                                  02277000
CVTDDR   EQU   CVTOPTA                                                  02278000
CVTAPR   EQU   CVTOPTA                                                  02279000
CVTCCH   EQU   CVTOPTA                                                  02280000
CVTSNCTR EQU   CVTMAP+180                                               02281000
CVTQMWR  EQU   CVTMAP+176                                               02282000
CVTQOCR  EQU   CVTMAP+172                                               02283000
CVT1EF00 EQU   CVTMAP+168                                               02284000
CVTMZ00  EQU   CVTMAP+164                                               02285000
CVTHEAD  EQU   CVTMAP+160                                               02286000
CVTRSV11 EQU   CVTMAP+156                                               02287000
CVT0PT01 EQU   CVTMAP+152                                               02288000
CVTMSER  EQU   CVTMAP+148                                               02289000
CVTRV516 EQU   CVTIERLC                                                 02290000
CVTILCH  EQU   CVTMAP+140                                               02291000
CVT0DS   EQU   CVTMAP+136                                               02292000
CVTFBOSV EQU   CVTMAP+132                                               02293000
CVTNUCB  EQU   CVTMAP+128                                               02294000
CVTIXAVL EQU   CVTMAP+124                                               02295000
CVTIOQET EQU   CVTMAP+120                                               02296000
CVTDCBA  EQU   CVTMAP+117                                               02297000
CVTMVS2  EQU   CVTDCB                                                   02298000
CVT6DAT  EQU   CVTDCB                                                   02299000
CVT4MPS  EQU   CVTDCB                                                   02300000
CVTRSV09 EQU   CVTDCB                                                   02301000
CVT4MS1  EQU   CVTDCB                                                   02302000
CVT2SPS  EQU   CVTDCB                                                   02303000
CVT1SSS  EQU   CVTDCB                                                   02304000
CVTRSV08 EQU   CVTDCB                                                   02305000
CVTSTB   EQU   CVTMAP+112                                               02306000
CVTQTD00 EQU   CVTMAP+108                                               02307000
CVTQTE00 EQU   CVTMAP+104                                               02308000
CVTCUCB  EQU   CVTMAP+100                                               02309000
CVTSJQ   EQU   CVTMAP+96                                                02310000
CVTPBLDL EQU   CVTMAP+92                                                02311000
CVTTPC   EQU   CVTMAP+88                                                02312000
CVTSVDCB EQU   CVTMAP+84                                                02313000
CVTBRET  EQU   CVTMAP+82                                                02314000
CVTEXIT  EQU   CVTMAP+80                                                02315000
CVT0FN00 EQU   CVTMAP+76                                                02316000
CVTDARA  EQU   CVTDAR+1                                                 02317000
CVTRSV07 EQU   CVTFLGS1                                                 02318000
CVTRSV06 EQU   CVTFLGS1                                                 02319000
CVTRSV05 EQU   CVTFLGS1                                                 02320000
CVTRSV04 EQU   CVTFLGS1                                                 02321000
CVTRSV03 EQU   CVTFLGS1                                                 02322000
CVTRSV02 EQU   CVTFLGS1                                                 02323000
CVTRSV01 EQU   CVTFLGS1                                                 02324000
CVTDMPLK EQU   CVTFLGS1                                                 02325000
CVTXITP  EQU   CVTMAP+68                                                02326000
CVTZDTAB EQU   CVTMAP+64                                                02327000
CVTMSLT  EQU   CVTMAP+60                                                02328000
CVTDATE  EQU   CVTMAP+56                                                02329000
CVTBTERM EQU   CVTMAP+52                                                02330000
CVTSYSAD EQU   CVTMAP+48                                                02331000
CVTXTLER EQU   CVTMAP+44                                                02332000
CVTILK2  EQU   CVTMAP+40                                                02333000
CVTILK1  EQU   CVTMAP+36                                                02334000
CVTPRLTV EQU   CVTMAP+32                                                02335000
CVTPCNVT EQU   CVTMAP+28                                                02336000
CVT0VL00 EQU   CVTMAP+24                                                02337000
CVTXAPG  EQU   CVTMAP+20                                                02338000
CVTBUF   EQU   CVTMAP+16                                                02339000
CVTJOB   EQU   CVTMAP+12                                                02340000
CVTLINK  EQU   CVTMAP+8                                                 02341000
CVT0EF00 EQU   CVTMAP+4                                                 02342000
CVTTCBP  EQU   CVTMAP                                                   02343000
CVT      EQU   CVTMAP                                                   02344000
ASCBEND  EQU   ASCB+208                                                 02345000
ASCBSRBT EQU   ASCB+200                                                 02346000
ASCBSWTL EQU   ASCB+196                                                 02347000
ASCBRS14 EQU   ASCB+195                                                 02348000
ASCBSMCT EQU   ASCB+194                                                 02349000
ASCBRS12 EQU   ASCB+192                                                 02350000
ASCBPCTT EQU   ASCB+188                                                 02351000
ASCBVGTT EQU   ASCB+184                                                 02352000
ASCBRV43 EQU   ASCBSRQ4                                                 02353000
ASCBRV42 EQU   ASCBSRQ4                                                 02354000
ASCBRV41 EQU   ASCBSRQ4                                                 02355000
ASCBRV40 EQU   ASCBSRQ4                                                 02356000
ASCBRV39 EQU   ASCBSRQ4                                                 02357000
ASCBRV38 EQU   ASCBSRQ4                                                 02358000
ASCBRV37 EQU   ASCBSRQ4                                                 02359000
ASCBRV36 EQU   ASCBSRQ4                                                 02360000
ASCBRV35 EQU   ASCBSRQ3                                                 02361000
ASCBRV34 EQU   ASCBSRQ3                                                 02362000
ASCBRV33 EQU   ASCBSRQ3                                                 02363000
ASCBRV32 EQU   ASCBSRQ3                                                 02364000
ASCBRV31 EQU   ASCBSRQ3                                                 02365000
ASCBRV30 EQU   ASCBSRQ3                                                 02366000
ASCBRV29 EQU   ASCBSRQ3                                                 02367000
ASCBRV28 EQU   ASCBSRQ3                                                 02368000
ASCBRV27 EQU   ASCBSRQ2                                                 02369000
ASCBRV26 EQU   ASCBSRQ2                                                 02370000
ASCBRV25 EQU   ASCBSRQ2                                                 02371000
ASCBRV24 EQU   ASCBSRQ2                                                 02372000
ASCBRV23 EQU   ASCBSRQ2                                                 02373000
ASCBRV22 EQU   ASCBSRQ2                                                 02374000
ASCBRV21 EQU   ASCBSRQ2                                                 02375000
ASCBRV20 EQU   ASCBSRQ2                                                 02376000
ASCBRV19 EQU   ASCBSRQ1                                                 02377000
ASCBRV18 EQU   ASCBSRQ1                                                 02378000
ASCBRV17 EQU   ASCBSRQ1                                                 02379000
ASCBRV16 EQU   ASCBSRQ1                                                 02380000
ASCBRV15 EQU   ASCBSRQ1                                                 02381000
ASCBRV14 EQU   ASCBSRQ1                                                 02382000
ASCBRV13 EQU   ASCBSRQ1                                                 02383000
ASCBSTA  EQU   ASCBSRQ1                                                 02384000
ASCBJBNS EQU   ASCB+176                                                 02385000
ASCBJBNI EQU   ASCB+172                                                 02386000
ASCBMCC  EQU   ASCB+168                                                 02387000
ASCBRTWA EQU   ASCB+164                                                 02388000
ASCBIQEA EQU   ASCB+160                                                 02389000
ASCBXMPQ EQU   ASCB+156                                                 02390000
ASCBRS01 EQU   ASCB+154                                                 02391000
ASCBFMCT EQU   ASCB+152                                                 02392000
ASCBOUXB EQU   ASCB+148                                                 02393000
ASCBOUCB EQU   ASCB+144                                                 02394000
ASCBMECB EQU   ASCB+140                                                 02395000
ASCBQECB EQU   ASCB+136                                                 02396000
ASCBLSQH EQU   ASCBLKGP+4                                               02397000
ASCBLOCK EQU   ASCBLKGP                                                 02398000
ASCBTCBS EQU   ASCB+124                                                 02399000
ASCBNVSC EQU   ASCB+122                                                 02400000
ASCBVSC  EQU   ASCB+120                                                 02401000
ASCBSRBS EQU   ASCB+118                                                 02402000
ASCBSSRB EQU   ASCB+116                                                 02403000
ASCBRV06 EQU   ASCBFLG2                                                 02404000
ASCBRV05 EQU   ASCBFLG2                                                 02405000
ASCBRV04 EQU   ASCBFLG2                                                 02406000
ASCBSNQS EQU   ASCBFLG2                                                 02407000
ASCBS2S  EQU   ASCBFLG2                                                 02408000
ASCBCEXT EQU   ASCBFLG2                                                 02409000
ASCBPXMT EQU   ASCBFLG2                                                 02410000
ASCBXMPT EQU   ASCBFLG2                                                 02411000
ASCBRF07 EQU   ASCBDSP1                                                 02412000
ASCBRF06 EQU   ASCBDSP1                                                 02413000
ASCBRF05 EQU   ASCBDSP1                                                 02414000
ASCBRF04 EQU   ASCBDSP1                                                 02415000
ASCBRF03 EQU   ASCBDSP1                                                 02416000
ASCBRF02 EQU   ASCBDSP1                                                 02417000
ASCBFAIL EQU   ASCBDSP1                                                 02418000
ASCBNOQ  EQU   ASCBDSP1                                                 02419000
ASCBSWCT EQU   ASCB+112                                                 02420000
ASCBASXB EQU   ASCB+108                                                 02421000
ASCBTMCH EQU   ASCB+104                                                 02422000
ASCBNSWP EQU   ASCBFLG1                                                 02423000
ASCBTYP1 EQU   ASCBFLG1                                                 02424000
ASCBSTND EQU   ASCBFLG1                                                 02425000
ASCBABNT EQU   ASCBFLG1                                                 02426000
ASCBTERM EQU   ASCBFLG1                                                 02427000
ASCBS3S  EQU   ASCBFLG1                                                 02428000
ASCBCMSH EQU   ASCBFLG1                                                 02429000
ASCBTOFF EQU   ASCBFLG1                                                 02430000
ASCBRF01 EQU   ASCBRCTF                                                 02431000
ASCBTMLW EQU   ASCBRCTF                                                 02432000
ASCBOUT  EQU   ASCBRCTF                                                 02433000
ASCBWAIT EQU   ASCBRCTF                                                 02434000
ASCBRV08 EQU   ASCBRCTF                                                 02435000
ASCBFQU  EQU   ASCBRCTF                                                 02436000
ASCBFRS  EQU   ASCBRCTF                                                 02437000
ASCBTMNO EQU   ASCBRCTF                                                 02438000
ASCBAFFN EQU   ASCBFW1                                                  02439000
ASCBDUMP EQU   ASCB+96                                                  02440000
ASCBRV44 EQU   ASCB+92                                                  02441000
ASCBUBET EQU   ASCB+88                                                  02442000
ASCBECB  EQU   ASCB+84                                                  02443000
ASCBJSTL EQU   ASCB+80                                                  02444000
ASCBEWST EQU   ASCB+72                                                  02445000
ASCBEJST EQU   ASCB+64                                                  02446000
ASCBTSB  EQU   ASCB+60                                                  02447000
ASCBCSCB EQU   ASCB+56                                                  02448000
ASCBRSM  EQU   ASCB+52                                                  02449000
ASCBSTOR EQU   ASCB+44                                                  02450000
ASCBDP   EQU   ASCB+43                                                  02451000
ASCBRV07 EQU   ASCB+42                                                  02452000
ASCBIOSM EQU   ASCB+40                                                  02453000
ASCBSEQN EQU   ASCB+38                                                  02454000
ASCBASID EQU   ASCB+36                                                  02455000
ASCBCPUS EQU   ASCB+32                                                  02456000
ASCBSPL  EQU   ASCB+28                                                  02457000
ASCBIOSP EQU   ASCB+24                                                  02458000
ASCBSYNC EQU   ASCBSUPC+4                                               02459000
ASCBSVRB EQU   ASCBSUPC                                                 02460000
ASCBCMSF EQU   ASCB+12                                                  02461000
ASCBBWDP EQU   ASCB+8                                                   02462000
ASCBFWDP EQU   ASCB+4                                                   02463000
ASCBASCB EQU   ASCB                                                     02464000
ASCBEGIN EQU   ASCB                                                     02465000
ABDSAVE1 EQU   ABDAREA+672                                              02466000
ABDSAVHD EQU   ABDAREA+592                                              02467000
ABDPADC  EQU   ABDAREA+589                                              02468000
ABDLINE  EQU   ABDLINEA+1                                               02469000
ABDCC    EQU   ABDLINEA                                                 02470000
ABDSRC2  EQU   ABDAREA+382                                              02471000
ABDLOG   EQU   ABDAREA+380                                              02472000
ABDSRC1  EQU   ABDAREA+378                                              02473000
ABDPHY   EQU   ABDAREA+376                                              02474000
ABDLCNT  EQU   ABDAREA+372                                              02475000
@NM00028 EQU   ESPARM+29                                                02476000
@NM00027 EQU   ESTAEFLG                                                 02477000
EDCB     EQU   ESTAEFLG                                                 02478000
ETCB     EQU   ESTAEFLG                                                 02479000
ESUBSYT  EQU   ESTAEFLG                                                 02480000
ERESTART EQU   ESPARM+24                                                02481000
EMODNAME EQU   ESPARM+16                                                02482000
EABDAREA EQU   ESPARM+12                                                02483000
ESAUTOP  EQU   ESPARM+8                                                 02484000
ESBSREG2 EQU   ESPARM+4                                                 02485000
ESBSREG  EQU   ESPARM                                                   02486000
ABDRTRN  EQU   ABDAREA+336                                              02487000
ABDSVCB  EQU   ABDAREA+332                                              02488000
@NM00026 EQU   ABDGMA+14                                                02489000
ABDCDID  EQU   ABDGMA+12                                                02490000
ABDPAREA EQU   ABDGMA+8                                                 02491000
ABDBUFSZ EQU   ABDBUFFS+4                                               02492000
ABDBUFAD EQU   ABDBUFFS                                                 02493000
ABSLCTSV EQU   ABDAREA+304                                              02494000
ABDSTADS EQU   ABDAREA+300                                              02495000
ABDUPRID EQU   ABDAREA+296                                              02496000
ABDPCAP  EQU   ABDAREA+295                                              02497000
ABDLLNGH EQU   ABDAREA+294                                              02498000
ABDINCPL EQU   ABDAREA+292                                              02499000
ABDFWORK EQU   ABDAREA+288                                              02500000
ABDIDENT EQU   ABDAREA+286                                              02501000
ABDIND   EQU   ABDAREA+284                                              02502000
ABDSIZE  EQU   ABDAREA+280                                              02503000
ABDSTAD  EQU   ABDAREA+268                                              02504000
@NM00025 EQU   ABDBLNKS                                                 02505000
@NM00024 EQU   ABDBLNKS                                                 02506000
@NM00023 EQU   ABDBLNKS                                                 02507000
@NM00022 EQU   ABDBLNKS                                                 02508000
@NM00021 EQU   ABDBLNKS                                                 02509000
@NM00020 EQU   ABDBLNKS                                                 02510000
@NM00019 EQU   ABDBLNKS                                                 02511000
ABDBLKN3 EQU   ABDBLNKS                                                 02512000
@NM00018 EQU   ABDUPRFN                                                 02513000
@NM00017 EQU   ABDUPRFN                                                 02514000
@NM00016 EQU   ABDUPRFN                                                 02515000
@NM00015 EQU   ABDUPRFN                                                 02516000
@NM00014 EQU   ABDUPRFN                                                 02517000
@NM00013 EQU   ABDUPRFN                                                 02518000
ABDUPRPM EQU   ABDUPRFN                                                 02519000
@NM00012 EQU   ABDUPRF                                                  02520000
@NM00011 EQU   ABDUPRF                                                  02521000
@NM00010 EQU   ABDUPRF                                                  02522000
@NM00009 EQU   ABDUPRF                                                  02523000
@NM00008 EQU   ABDUPRF                                                  02524000
UPRFMT20 EQU   ABDUPRF                                                  02525000
UPRFMAT  EQU   ABDUPRF                                                  02526000
ABDFMTWK EQU   ABDAREA+256                                              02527000
ABDLPTR  EQU   ABDAREA+252                                              02528000
ABDLLINE EQU   ABDAREA+248                                              02529000
ABDBPTR  EQU   ABDAREA+244                                              02530000
ABDSSPAR EQU   ABDAREA+188                                              02531000
@NM00007 EQU   ABDRES1                                                  02532000
ABDTRSV  EQU   ABDRES1                                                  02533000
ABDPGHD  EQU   ABDRES1                                                  02534000
ABDFMTLD EQU   ABDRES1                                                  02535000
ABDREGS  EQU   ABDRES1                                                  02536000
ABDPSW   EQU   ABDRES1                                                  02537000
ABDKEY   EQU   ABDAREA+138                                              02538000
ABDLSQA  EQU   ABDFLAG2                                                 02539000
ABDSWAP  EQU   ABDFLAG2                                                 02540000
ABDGTFCL EQU   ABDFLAG2                                                 02541000
ABDTRNAV EQU   ABDFLAG2                                                 02542000
ABDTRBIT EQU   ABDFLAG2                                                 02543000
ABDGTF   EQU   ABDFLAG2                                                 02544000
ABDSUPER EQU   ABDFLAG2                                                 02545000
ABDIDX   EQU   ABDFLAG1                                                 02546000
ABDSPHD  EQU   ABDFLAG1                                                 02547000
ABDSVCHD EQU   ABDFLAG1                                                 02548000
ABDLSTHD EQU   ABDFLAG1                                                 02549000
ABDQCBMN EQU   ABDFLAG1                                                 02550000
ABDQCBMJ EQU   ABDFLAG1                                                 02551000
ABDQCBHD EQU   ABDFLAG1                                                 02552000
ABDPGWK  EQU   ABDAREA+128                                              02553000
ABDWORK1 EQU   ABDAREA+120                                              02554000
ABDRESV3 EQU   ABDAREA+116                                              02555000
ABDUPRXT EQU   ABDAREA+112                                              02556000
ABDCP1   EQU   ABDAREA+108                                              02557000
ABDLP    EQU   ABDAREA+104                                              02558000
ABDFP    EQU   ABDAREA+100                                              02559000
ABDCP    EQU   ABDAREA+96                                               02560000
ABDPTRS3 EQU   ABDPTRS+8                                                02561000
ABDPTRS2 EQU   ABDPTRS+4                                                02562000
ABDPTRS1 EQU   ABDPTRS                                                  02563000
ABDPCTR  EQU   ABDAREA+82                                               02564000
ABDLCTR  EQU   ABDAREA+80                                               02565000
ABDIOBP  EQU   ABDAREA+76                                               02566000
ABDPTR   EQU   ABDAREA+72                                               02567000
ABDDCB   EQU   ABDAREA+68                                               02568000
ABDLEN   EQU   ABDAREA+66                                               02569000
ABDTYPE  EQU   ABDAREA+64                                               02570000
ABDECB   EQU   ABDAREA+60                                               02571000
ABDSAVE  EQU   ABDAREA+56                                               02572000
ABDDECB  EQU   ABDAREA+52                                               02573000
ABDPARA  EQU   ABDAREA+48                                               02574000
ABDTABPT EQU   ABDAREA+44                                               02575000
ABDINXPT EQU   ABDAREA+40                                               02576000
ABDCTR   EQU   ABDAREA+38                                               02577000
ABDTRLN  EQU   ABDAREA+36                                               02578000
ABDHDRAD EQU   ABDPARMS+20                                              02579000
ABDSNAPP EQU   ABDPARMS+16                                              02580000
ABDPTCBP EQU   ABDPARMS+12                                              02581000
ABDPDCBP EQU   ABDPARMS+8                                               02582000
@NM00006 EQU   ABDPARMS+7                                               02583000
@NM00005 EQU   APFPDATA                                                 02584000
APFSPALL EQU   APFPDATA                                                 02585000
APFPSW   EQU   APFPDATA                                                 02586000
APFJPA   EQU   APFPDATA                                                 02587000
APFLPA   EQU   APFPDATA                                                 02588000
APFREGS  EQU   APFPDATA                                                 02589000
APFSAVE2 EQU   APFPDATA                                                 02590000
APFSAVE  EQU   APFPDATA                                                 02591000
@NM00004 EQU   APFSDAT1                                                 02592000
APFERR   EQU   APFSDAT1                                                 02593000
APFIO    EQU   APFSDAT1                                                 02594000
APFDM    EQU   APFSDATA                                                 02595000
APFQCB   EQU   APFSDATA                                                 02596000
APFSUPDA EQU   APFSDATA                                                 02597000
APFTRACE EQU   APFSDATA                                                 02598000
APFSWA   EQU   APFSDATA                                                 02599000
APFLSQA  EQU   APFSDATA                                                 02600000
APFSQA   EQU   APFSDATA                                                 02601000
APFNUC   EQU   APFSDATA                                                 02602000
@NM00003 EQU   ABDPARMS+2                                               02603000
APFHDR   EQU   ABDFLAG                                                  02604000
APFSNAPP EQU   ABDFLAG                                                  02605000
APFTCB   EQU   ABDFLAG                                                  02606000
APFID    EQU   ABDFLAG                                                  02607000
APFABEND EQU   ABDFLAG                                                  02608000
APFENVS2 EQU   ABDFLAG                                                  02609000
APFVS2   EQU   ABDFLAG                                                  02610000
APFSNAP  EQU   ABDFLAG                                                  02611000
ABDPID   EQU   ABDPARMS                                                 02612000
ABDCRB   EQU   ABDAREA+8                                                02613000
ABDCTCB  EQU   ABDAREA+4                                                02614000
@NM00002 EQU   TABLENT+7                                                02615000
@NM00001 EQU   AREAFLAG                                                 02616000
TABEND   EQU   AREAFLAG                                                 02617000
TBLEND   EQU   AREAFLAG                                                 02618000
AREALEN  EQU   TABLENT+4                                                02619000
STORFLAG EQU   STORENT+6                                                02620000
@NM00052 EQU   PSA+3668                                                 02621000
PSASTAK  EQU   PSA+3072                                                 02622000
@NM00051 EQU   PSA+1048                                                 02623000
PSAUSEND EQU   PSA+1048                                                 02624000
PSARV062 EQU   PSA+1044                                                 02625000
PSACDAL  EQU   PSA+1040                                                 02626000
PSAWTCOD EQU   PSA+1036                                                 02627000
PSAATCVT EQU   PSA+1032                                                 02628000
PSAPCPSW EQU   PSA+1024                                                 02629000
PSAPIR2  EQU   PSA+1020                                                 02630000
PSARV059 EQU   PSA+1018                                                 02631000
PSASVC13 EQU   PSA+1016                                                 02632000
PSALSFCC EQU   PSA+1012                                                 02633000
PSASFACC EQU   PSA+1008                                                 02634000
PSASTOP  EQU   PSA+992                                                  02635000
PSASTART EQU   PSA+976                                                  02636000
PSARSPSW EQU   PSA+968                                                  02637000
PSASRPSW EQU   PSA+960                                                  02638000
PSARV045 EQU   PSA+892                                                  02639000
PSARV044 EQU   PSA+888                                                  02640000
PSARV043 EQU   PSA+884                                                  02641000
PSARV042 EQU   PSA+880                                                  02642000
PSARV041 EQU   PSA+876                                                  02643000
PSARV040 EQU   PSA+872                                                  02644000
PSARV025 EQU   PSA+868                                                  02645000
PSADSSED EQU   PSA+868                                                  02646000
PSADSSPR EQU   PSA+864                                                  02647000
PSADSSFW EQU   PSA+860                                                  02648000
PSADSS14 EQU   PSA+856                                                  02649000
PSADSSPP EQU   PSA+848                                                  02650000
PSADSSRP EQU   PSA+840                                                  02651000
PSADSS05 EQU   PSADSSF4                                                 02652000
PSADSS10 EQU   PSADSSF4                                                 02653000
PSADSSVE EQU   PSADSSF4                                                 02654000
PSADSSDE EQU   PSADSSF4                                                 02655000
PSADSSC0 EQU   PSADSSF4                                                 02656000
PSADSSIE EQU   PSADSSF4                                                 02657000
PSADSS12 EQU   PSADSSF4                                                 02658000
PSADSSRC EQU   PSADSSF4                                                 02659000
PSARV057 EQU   PSADSSF3                                                 02660000
PSARV056 EQU   PSADSSF3                                                 02661000
PSARV055 EQU   PSADSSF3                                                 02662000
PSADSSMC EQU   PSADSSF3                                                 02663000
PSADSSRW EQU   PSADSSF3                                                 02664000
PSADSSNM EQU   PSADSSF3                                                 02665000
PSADSSES EQU   PSADSSF3                                                 02666000
PSADSSGP EQU   PSADSSF3                                                 02667000
PSADSSF2 EQU   PSADSSFL+1                                               02668000
PSADSSPI EQU   PSADSSF1                                                 02669000
PSADSSOI EQU   PSADSSF1                                                 02670000
PSADSSSP EQU   PSADSSF1                                                 02671000
PSADSSTP EQU   PSADSSF1                                                 02672000
PSADSSDW EQU   PSADSSF1                                                 02673000
PSADSSDD EQU   PSADSSF1                                                 02674000
PSADSSDM EQU   PSADSSF1                                                 02675000
PSADSSMV EQU   PSADSSF1                                                 02676000
PSADSSTS EQU   PSA+816                                                  02677000
PSADSSWK EQU   PSA+812                                                  02678000
PSADSSR3 EQU   PSA+808                                                  02679000
PSADSSR2 EQU   PSA+804                                                  02680000
PSADSSRS EQU   PSA+800                                                  02681000
PSASTOR  EQU   PSA+796                                                  02682000
PSACPUSA EQU   PSA+794                                                  02683000
PSAVSTAP EQU   PSA+792                                                  02684000
PSAWKVAP EQU   PSA+788                                                  02685000
PSAWKRAP EQU   PSA+784                                                  02686000
PSAMCHIC EQU   PSA+783                                                  02687000
PSARV061 EQU   PSA+782                                                  02688000
PSASYMSK EQU   PSA+781                                                  02689000
PSAMCHFL EQU   PSA+780                                                  02690000
PSACR0   EQU   PSA+776                                                  02691000
PSAPSWSV EQU   PSA+768                                                  02692000
PSACLHS  EQU   PSAHLHI                                                  02693000
PSALKR15 EQU   PSALKSA+60                                               02694000
PSALKR14 EQU   PSALKSA+56                                               02695000
PSALKR13 EQU   PSALKSA+52                                               02696000
PSALKR12 EQU   PSALKSA+48                                               02697000
PSALKR11 EQU   PSALKSA+44                                               02698000
PSALKR10 EQU   PSALKSA+40                                               02699000
PSALKR9  EQU   PSALKSA+36                                               02700000
PSALKR8  EQU   PSALKSA+32                                               02701000
PSALKR7  EQU   PSALKSA+28                                               02702000
PSALKR6  EQU   PSALKSA+24                                               02703000
PSALKR5  EQU   PSALKSA+20                                               02704000
PSALKR4  EQU   PSALKSA+16                                               02705000
PSALKR3  EQU   PSALKSA+12                                               02706000
PSALKR2  EQU   PSALKSA+8                                                02707000
PSALKR1  EQU   PSALKSA+4                                                02708000
PSALKR0  EQU   PSALKSA                                                  02709000
PSARV023 EQU   PSACLHT+52                                               02710000
PSALOCAL EQU   PSACLHT+48                                               02711000
PSACMSL  EQU   PSACLHT+44                                               02712000
PSAOPTL  EQU   PSACLHT+40                                               02713000
PSATPACL EQU   PSACLHT+36                                               02714000
PSATPDNL EQU   PSACLHT+32                                               02715000
PSATPNCL EQU   PSACLHT+28                                               02716000
PSAIOSLL EQU   PSACLHT+24                                               02717000
PSAIOSUL EQU   PSACLHT+20                                               02718000
PSAIOSCL EQU   PSACLHT+16                                               02719000
PSAIOSSL EQU   PSACLHT+12                                               02720000
PSASALCL EQU   PSACLHT+8                                                02721000
PSAASML  EQU   PSACLHT+4                                                02722000
PSADISPL EQU   PSACLHT                                                  02723000
PSASRSA  EQU   PSA+636                                                  02724000
PSARV050 EQU   PSA+634                                                  02725000
PSADSSGO EQU   PSA+633                                                  02726000
PSARECUR EQU   PSA+632                                                  02727000
PSAHLHIS EQU   PSA+628                                                  02728000
PSAIPCSA EQU   PSA+624                                                  02729000
@NM00050 EQU   PSA+621                                                  02730000
PSAIPCDM EQU   PSA+620                                                  02731000
PSAIPCD  EQU   PSA+616                                                  02732000
@NM00049 EQU   PSA+613                                                  02733000
PSAIPCRM EQU   PSA+612                                                  02734000
PSAIPCR  EQU   PSA+608                                                  02735000
PSAMCHEX EQU   PSA+600                                                  02736000
PSAMPSW  EQU   PSA+592                                                  02737000
PSAEXPS2 EQU   PSA+584                                                  02738000
PSAEXPS1 EQU   PSA+576                                                  02739000
PSAPIREG EQU   PSA+572                                                  02740000
PSARSREG EQU   PSA+568                                                  02741000
PSAGPREG EQU   PSA+556                                                  02742000
PSARV022 EQU   PSASUP4                                                  02743000
PSARV021 EQU   PSASUP4                                                  02744000
PSARV020 EQU   PSASUP4                                                  02745000
PSARV019 EQU   PSASUP4                                                  02746000
PSARV018 EQU   PSASUP4                                                  02747000
PSARV017 EQU   PSASUP4                                                  02748000
PSARV016 EQU   PSASUP4                                                  02749000
PSARV015 EQU   PSASUP4                                                  02750000
PSARV014 EQU   PSASUP3                                                  02751000
PSARV013 EQU   PSASUP3                                                  02752000
PSARV012 EQU   PSASUP3                                                  02753000
PSAESTA  EQU   PSASUP3                                                  02754000
PSASPR   EQU   PSASUP3                                                  02755000
PSAPSREG EQU   PSASUP3                                                  02756000
PSAPI2   EQU   PSASUP3                                                  02757000
PSAIOSUP EQU   PSASUP3                                                  02758000
PSALCR   EQU   PSASUP2                                                  02759000
PSARTM   EQU   PSASUP2                                                  02760000
PSAACR   EQU   PSASUP2                                                  02761000
PSAIPCE2 EQU   PSASUP2                                                  02762000
PSAIPCES EQU   PSASUP2                                                  02763000
PSAIPCEC EQU   PSASUP2                                                  02764000
PSAGTF   EQU   PSASUP2                                                  02765000
PSAIPCRI EQU   PSASUP2                                                  02766000
PSATYPE6 EQU   PSASUP1                                                  02767000
PSATCTL  EQU   PSASUP1                                                  02768000
PSADISP  EQU   PSASUP1                                                  02769000
PSALOCK  EQU   PSASUP1                                                  02770000
PSAPI    EQU   PSASUP1                                                  02771000
PSAEXT   EQU   PSASUP1                                                  02772000
PSASVC   EQU   PSASUP1                                                  02773000
PSAIO    EQU   PSASUP1                                                  02774000
PSAANEW  EQU   PSA+544                                                  02775000
PSATNEW  EQU   PSA+536                                                  02776000
PSALCCAR EQU   PSA+532                                                  02777000
PSALCCAV EQU   PSA+528                                                  02778000
PSAPCCAR EQU   PSA+524                                                  02779000
PSAPCCAV EQU   PSA+520                                                  02780000
PSACPULA EQU   PSA+518                                                  02781000
PSACPUPA EQU   PSA+516                                                  02782000
PSAPSA   EQU   PSA+512                                                  02783000
FLCHDEND EQU   PSA+512                                                  02784000
FLCCRSAV EQU   FLCMCLA+280                                              02785000
FLCGRSAV EQU   FLCMCLA+216                                              02786000
FLCFPSAV EQU   FLCMCLA+184                                              02787000
FLCFLA   EQU   FLCMCLA+88                                               02788000
FLCRGNCD EQU   FLCMCLA+84                                               02789000
FLCFSAA  EQU   FLCFSA+1                                                 02790000
@NM00048 EQU   FLCFSA                                                   02791000
@NM00047 EQU   FLCMCLA+72                                               02792000
FLCMCIC  EQU   FLCMCLA+64                                               02793000
@NM00046 EQU   FLCMCLA+20                                               02794000
FLCIOAA  EQU   FLCIOA+1                                                 02795000
@NM00045 EQU   FLCIOA                                                   02796000
@NM00044 EQU   FLCMCLA+15                                               02797000
@NM00043 EQU   FLCMCLA+14                                               02798000
@NM00042 EQU   FLCMCLA+12                                               02799000
FLCLCL   EQU   FLCMCLA+8                                                02800000
FLCIOELA EQU   FLCIOEL+1                                                02801000
@NM00041 EQU   FLCIOEL                                                  02802000
FLCCHNID EQU   FLCMCLA                                                  02803000
@NM00040 EQU   PSA+160                                                  02804000
FLCMTRCD EQU   PSA+157                                                  02805000
@NM00039 EQU   PSA+156                                                  02806000
FLCPERA  EQU   FLCPER+1                                                 02807000
@NM00038 EQU   FLCPER                                                   02808000
@NM00037 EQU   PSA+151                                                  02809000
FLCPERCD EQU   PSA+150                                                  02810000
FLCMCNUM EQU   PSA+149                                                  02811000
@NM00036 EQU   PSA+148                                                  02812000
FLCTEAA  EQU   FLCTEA+1                                                 02813000
@NM00035 EQU   FLCTEA                                                   02814000
PSAPIPC  EQU   PSAPICOD                                                 02815000
PSAPIMC  EQU   PSAPICOD                                                 02816000
PSAPIPER EQU   PSAPICOD                                                 02817000
PSARV049 EQU   FLCPICOD                                                 02818000
FLCPILCB EQU   FLCPIILC                                                 02819000
@NM00034 EQU   FLCPIILC                                                 02820000
@NM00033 EQU   PSAEPPSW                                                 02821000
FLCSVCN  EQU   PSAESPSW+2                                               02822000
FLCSILCB EQU   FLCSVILC                                                 02823000
@NM00032 EQU   FLCSVILC                                                 02824000
@NM00031 EQU   PSAESPSW                                                 02825000
FLCEICOD EQU   PSAEEPSW+2                                               02826000
PSASPAD  EQU   PSAEEPSW                                                 02827000
@NM00030 EQU   PSA+128                                                  02828000
FLCINPSW EQU   PSA+120                                                  02829000
FLCMNPSW EQU   PSA+112                                                  02830000
FLCPNPSW EQU   PSA+104                                                  02831000
FLCSNPSW EQU   PSA+96                                                   02832000
FLCENPSW EQU   PSA+88                                                   02833000
FLCTRACE EQU   PSA+84                                                   02834000
FLCTIMER EQU   PSA+80                                                   02835000
FLCCVT2  EQU   PSA+76                                                   02836000
FLCCAW   EQU   PSA+72                                                   02837000
FLCCSW   EQU   PSA+64                                                   02838000
FLCIOPSW EQU   PSA+56                                                   02839000
FLCMOPSW EQU   PSA+48                                                   02840000
FLCPOPSW EQU   PSA+40                                                   02841000
FLCSOPSW EQU   PSA+32                                                   02842000
FLCEOPSW EQU   PSA+24                                                   02843000
@NM00029 EQU   FLCICCW2+4                                               02844000
FLCICCW1 EQU   FLCROPSW                                                 02845000
FLCIPPSW EQU   FLCRNPSW                                                 02846000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02847000
@ENDDATA EQU   *                                                        02848000
         END   IEAVAD0A,(C'PLS2314',0701,77077)                         02849000
