         TITLE 'IGC00060 - STA/ESTA SERVICE ROUTINE (SVC 60)'           00001000
* SET UP THE SVC ENTRY POINT AND THE ADDRESS USED FOR BRANCH ENTRIES.   00002000
IGC00060 CSECT                                                          00003000
         USING *,R6          BASE REG PRE-SET BY SVC SLIH               00004000
SVCEPT   B     SVCENTRY      IEAVSTA0+0 ENTER HERE ON SVC ENTRY         00005000
         DC    A(ESTAEBRE)   IEAVSTA0+4 = ADDRESS OF BRANCH ENTRY--     00006000
*                            MOVED TO -CVTSV60- DURING OUR NIP          00007000
*                            INITIALIZATION BY -IEAVNPA6-               00008000
*                            IF THE DISPLACEMENT OF THIS                00009000
*                            ADDRESS CONSTANT IS CHANGED IEAVNPA6       00010000
*                            MUST BE CHANGED ACCORDINGLY                00011000
         MODID BR=NO                                                    00012000
         DROP  R6                                                       00013000
         USING *,R15                                                    00014000
         B     RETN               RETRY ENTRY POINT          @Z40FPXA   00015000
         DROP  R15                                                      00016000
ESTAEBRE ST    R14,12(R13)      SAVE RETURN ADDRESS                     00017000
         STM   R2,R12,28(R13)   SAVE REGS ON BRANCH ENTRY               00018000
PROLOG   BALR  R10,0         SET BASE FOR BOTH ENTRY TYPES              00019000
PSTART   DS    0H                                            @Z30EPXA   00020000
         USING PSTART,R10                                               00021000
         B     BRENTP                                        @Z30EPXA   00022000
SVCENTRY LA    R10,PSTART-SVCEPT(R6)                         @Z30EPXA   00023000
RBPRFXLN EQU 64                                                         00024000
RBPRFLNA EQU 32                                                         00025000
PRBLEN   EQU 136                                                        00026000
SIRBLEN  EQU 200                                                        00027000
TIRBLEN  EQU 136                                                        00028000
IRBLEN   EQU 128                                                        00029000
SVRBLEN  EQU 224                                                        00030000
*                                      SAVE AREA (40 BYTES)          */ 00031000
*SVCENTP:                                                          0078 00032000
*                                                                  0078 00033000
*   /*****************************************************************/ 00034000
*   /*                                                               */ 00035000
*   /* OBTAIN WORK AREA IN CURRENT SVRB                              */ 00036000
*   /*                                                               */ 00037000
*   /*****************************************************************/ 00038000
*                                                                  0078 00039000
*   R9=ADDR(RBFEPARM);              /* ADDRESS OF WA IN SVRB.. WORK     00040000
*                                      AREA                  @Z40FPXA*/ 00041000
SVCENTP  LA    R9,RBFEPARM(,RBSECPTR)                              0078 00042000
*   R7=R7->ASXBPTR->ASXBSPSA->WSALSTAE;/* FREE SCB QUEUE PTR @Z40FPXA*/ 00043000
*                                                                  0079 00044000
         L     @15,ASXBPTR(,R7)                                    0079 00045000
         L     @15,ASXBSPSA(,@15)                                  0079 00046000
         L     @15,WSALSTAE(,@15)                                  0079 00047000
         LR    R7,@15                                              0079 00048000
*   /*****************************************************************/ 00049000
*   /*                                                               */ 00050000
*   /* INDICATE TO RTM THAT ESTAE IS IN CONTROL, RTM WILL ROUTE      */ 00051000
*   /* CONTROL TO ESTAE'S RECOVERY ROUTINE IN EVENT OF ERROR         */ 00052000
*   /*                                                               */ 00053000
*   /*****************************************************************/ 00054000
*                                                                  0080 00055000
*   IF TCBFX^='1'B THEN             /* DISALLOW ASYNCRONOUS  @ZA24347*/ 00056000
         TM    TCBFX(TCBPTR),B'00000001'                           0080 00057000
         BO    @RF00080                                            0080 00058000
*     DO;                           /* INTERRUPTS.           @ZA24347*/ 00059000
*       TCBSTAFX='1'B;              /*                       @ZA24347*/ 00060000
         OI    TCBSTAFX(TCBPTR),B'01000000'                        0082 00061000
*       TCBFX='1'B;                 /*                       @ZA24347*/ 00062000
         OI    TCBFX(TCBPTR),B'00000001'                           0083 00063000
*     END;                          /*                       @ZA24347*/ 00064000
*   ELSE                                                           0085 00065000
*     ;                             /*                       @ZA24347*/ 00066000
@RF00080 DS    0H                                                  0086 00067000
*   TCBSTAWA=R9;                    /* SAVE WORK AREA POINTER      0086 00068000
*                                                            @Z40FPXA*/ 00069000
         ST    R9,TCBSTAWA(,TCBPTR)                                0086 00070000
*   R14SAVE=R14;                    /* SAVE RETURN ADDRESS   @Z40FPXA*/ 00071000
         ST    R14,R14SAVE(,R9)                                    0087 00072000
*   WKWORD=REG0;                    /* SAVE FUNCTION CODE AND CLEAR     00073000
*                                      WORK AREA             @Z40FPXA*/ 00074000
         ST    REG0,WKWORD(,R9)                                    0088 00075000
*   IF FC='84'X|FC=4                /* NO PARM LIST IF CANCEL        */ 00076000
*     THEN                          /* CANCEL IS REQUESTED           */ 00077000
         CLI   FC(R9),X'84'                                        0089 00078000
         BE    @RT00089                                            0089 00079000
         CLI   FC(R9),4                                            0089 00080000
         BNE   @RF00089                                            0089 00081000
@RT00089 DS    0H                                                  0090 00082000
*     DO;                                                          0090 00083000
*       CANCELFL='1'B;              /* SET CANCEL FLAG       @Z30EPXA*/ 00084000
         OI    CANCELFL(R9),B'00001000'                            0091 00085000
*     END;                                                         0092 00086000
*   ELSE                                                           0093 00087000
*     DO;                                                          0093 00088000
*                                                                  0093 00089000
         B     @RC00089                                            0093 00090000
@RF00089 DS    0H                                                  0094 00091000
*       /*************************************************************/ 00092000
*       /*                                                           */ 00093000
*       /* CHECK FOR PROP REQUEST                                    */ 00094000
*       /*                                                           */ 00095000
*       /*************************************************************/ 00096000
*                                                                  0094 00097000
*       IF FC=2 THEN                /* PROP REQUEST?         @Z40FPXA*/ 00098000
         CLI   FC(R9),2                                            0094 00099000
         BNE   @RF00094                                            0094 00100000
*         DO;                       /*                       @Z40FPXA*/ 00101000
*           IF(ESTASTAI='0'B|ESTASTAR='1'B|ESTAESTA='0'B)/* PROP ONLY   00102000
*                                      VALID WITH ESTAI      @Z30EPXA*/ 00103000
*             THEN                  /*                       @YM01507*/ 00104000
         TM    ESTASTAR(R1),B'01000000'                            0096 00105000
         BNZ   @RT00096                                            0096 00106000
         TM    ESTASTAI(R1),B'10010000'                            0096 00107000
         BO    @RF00096                                            0096 00108000
@RT00096 DS    0H                                                  0097 00109000
*             DO;                   /* INVALID REQUEST       @YM01507*/ 00110000
*               REASON=8;           /*                       @YM01507*/ 00111000
         MVI   REASON(R9),X'08'                                    0098 00112000
*               CALL INVALID;       /* ISSUE ABEND           @YM01507*/ 00113000
         BAL   @14,INVALID                                         0099 00114000
*             END;                  /*                       @YM01507*/ 00115000
*           ELSE                    /* VALID PROP REQUEST.. PROCESS     00116000
*                                      IT                    @Z40FPXA*/ 00117000
*             GOTO PROPROC;         /* PROCESS PROP          @Z40FPXA*/ 00118000
*         END;                      /* END OF PROP PROCESSING      0102 00119000
*                                                            @Z40FPXA*/ 00120000
*                                                                  0102 00121000
*       /*************************************************************/ 00122000
*       /*                                                           */ 00123000
*       /* THIS SECTION DETERMINES IF A STA RECURSION HAS TAKEN PLACE*/ 00124000
*       /* -VERIFIES STAI REQUESTS                                   */ 00125000
*       /*                                                           */ 00126000
*       /*************************************************************/ 00127000
*                                                                  0103 00128000
*       IF ESTAESTA='0'B            /* STA TYPE REQUEST ?    @Z30EPXA*/ 00129000
*         THEN                      /* YES- CHECK RECURSION          */ 00130000
@RF00094 TM    ESTAESTA(R1),B'00010000'                            0103 00131000
         BNZ   @RF00103                                            0103 00132000
*         DO;                                                      0104 00133000
*           IF TCBSTABE='1'B        /* IS A STA EXIT IN PROGRESS     */ 00134000
*             THEN                  /* YES- INVALID                  */ 00135000
         TM    TCBSTABE(TCBPTR),B'10000000'                        0105 00136000
         BNO   @RF00105                                            0105 00137000
*             DO;                                                  0106 00138000
*               GOTO RETCOD8;       /*                       @Z40FPXA*/ 00139000
         B     RETCOD8                                             0107 00140000
*             END;                                                 0108 00141000
*           ELSE                    /* NO- OKAY SO FAR               */ 00142000
*             DO;                                                  0109 00143000
@RF00105 DS    0H                                                  0110 00144000
*               IF ESTASTAI='1'B    /* STAI REQUEST ?                */ 00145000
*                 THEN              /* YES                           */ 00146000
         TM    ESTASTAI(R1),B'10000000'                            0110 00147000
         BNO   @RF00110                                            0110 00148000
*                 DO;                                              0111 00149000
*                                                                  0111 00150000
*                   /*************************************************/ 00151000
*                   /*                                               */ 00152000
*                   /* THIS SECTION OF CODE INSURES THAT A CREATE    */ 00153000
*                   /* REQUEST IS THE ONLY REQUEST THAT CAN BE       */ 00154000
*                   /* HONORED FOR STAI-CONTROL IS THEN GIVEN TO     */ 00155000
*                   /* VERATTCH TO INSURE ATTACH IS THE REQUESTOR    */ 00156000
*                   /*                                               */ 00157000
*                   /*************************************************/ 00158000
*                                                                  0112 00159000
*                   IF FC=0         /* CREATE REQUESTED ?            */ 00160000
*                     THEN          /* YES                           */ 00161000
         CLI   FC(R9),0                                            0112 00162000
         BNE   @RF00112                                            0112 00163000
*                     DO;                                          0113 00164000
*                       CALL VERATTCH;/* INSURE ATTACH CALLED        */ 00165000
         BAL   @14,VERATTCH                                        0114 00166000
*                     END;                                         0115 00167000
*                   ELSE            /* CREATE IS NOT THE REQUEST     */ 00168000
*                     DO;                                          0116 00169000
         B     @RC00112                                            0116 00170000
@RF00112 DS    0H                                                  0117 00171000
*                       GOTO RETCOD10;/* ONLY CREATE ALLOWED         */ 00172000
         B     RETCOD10                                            0117 00173000
*                     END;                                         0118 00174000
*                 END;                                             0119 00175000
*               ELSE                /* NOT STAI                      */ 00176000
*                 DO;               /* INSURE IT IS NOT A          0120 00177000
*                                      NON-SUPPORTED STAR REQUEST    */ 00178000
         B     @RC00110                                            0120 00179000
@RF00110 DS    0H                                                  0121 00180000
*                   IF ESTASTAR='1'B/* STAR!!!                       */ 00181000
*                     THEN          /* YES                           */ 00182000
         TM    ESTASTAR(R1),B'01000000'                            0121 00183000
         BNO   @RF00121                                            0121 00184000
*                     DO;                                          0122 00185000
*                       GOTO RETCOD10;/* STAR NOT SUPPORTED  @Z40FPXA*/ 00186000
         B     RETCOD10                                            0123 00187000
*                     END;                                         0124 00188000
*                 END;                                             0125 00189000
@RF00121 DS    0H                                                  0126 00190000
*             END;                                                 0126 00191000
*                                                                  0126 00192000
@RC00110 DS    0H                                                  0127 00193000
*           /*********************************************************/ 00194000
*           /*                                                       */ 00195000
*           /* THIS SECTION OF CODE INSURES THAT THE EXIT AND        */ 00196000
*           /* PARAMETER LIST ADDRESSES SPECIFIED ON A STA CREATE OR */ 00197000
*           /* OVERLAY ARE VALID                                     */ 00198000
*           /*                                                       */ 00199000
*           /*********************************************************/ 00200000
*                                                                  0127 00201000
*           IF FC=0|FC=8            /* STA CT OR OV ?        @Z40FPXA*/ 00202000
*             THEN                  /* YES                           */ 00203000
         CLI   FC(R9),0                                            0127 00204000
         BE    @RT00127                                            0127 00205000
         CLI   FC(R9),8                                            0127 00206000
         BNE   @RF00127                                            0127 00207000
@RT00127 DS    0H                                                  0128 00208000
*             DO;                                                  0128 00209000
*               IF ESTAEXIT=0       /* IMPLIED STAE CANCEL?          */ 00210000
*                 THEN              /* YES                           */ 00211000
         L     @15,ESTAEXIT-1(,R1)                                 0129 00212000
         LA    @15,0(,@15)                                         0129 00213000
         LTR   @15,@15                                             0129 00214000
         BNZ   @RF00129                                            0129 00215000
*                 DO;                                              0130 00216000
*                   FC=4;           /* INDICATE STAE CANCEL  @Z40FPXA*/ 00217000
         MVI   FC(R9),X'04'                                        0131 00218000
*                   CANCELFL='1'B;  /* SET CANCEL FLAG       @Z30EPXA*/ 00219000
         OI    CANCELFL(R9),B'00001000'                            0132 00220000
*                 END;                                             0133 00221000
*             END;                                                 0134 00222000
*         END;                                                     0135 00223000
*       ELSE                                                       0136 00224000
*         DO;                                                      0136 00225000
         B     @RC00103                                            0136 00226000
@RF00103 DS    0H                                                  0137 00227000
*           IF ESTASTAI='0'B&ESTASTAR='0'B/* ESTAE?          @Z40FPXA*/ 00228000
*             THEN                  /* YES                           */ 00229000
         TM    ESTASTAI(R1),B'11000000'                            0137 00230000
         BNZ   @RF00137                                            0137 00231000
*             DO;                                                  0138 00232000
*               IF ESTAEXIT=0       /* IMPLIED CANCEL?               */ 00233000
*                 THEN              /* YES                           */ 00234000
         L     @15,ESTAEXIT-1(,R1)                                 0139 00235000
         LA    @15,0(,@15)                                         0139 00236000
         LTR   @15,@15                                             0139 00237000
         BNZ   @RF00139                                            0139 00238000
*                 DO;                                              0140 00239000
*                   FC='84'X;       /* ESTAE CANCEL CODE             */ 00240000
         MVI   FC(R9),X'84'                                        0141 00241000
*                   CANCELFL='1'B;  /* SET CANCEL FLAG       @Z30EPXA*/ 00242000
         OI    CANCELFL(R9),B'00001000'                            0142 00243000
*                 END;                                             0143 00244000
*             END;                                                 0144 00245000
@RF00139 DS    0H                                                  0145 00246000
*         END;                                                     0145 00247000
@RF00137 DS    0H                                                  0146 00248000
*     END;                                                         0146 00249000
*                                                                  0146 00250000
@RC00103 DS    0H                                                  0147 00251000
*   /*****************************************************************/ 00252000
*   /*                                                               */ 00253000
*   /* THIS SECTION OF CODE DETERMINES IF AN ESTAE CANCEL/OVERLAY OR */ 00254000
*   /* STAE CANCEL/OV HAS BEEN REQUESTED AND ROUTES CONTROL TO       */ 00255000
*   /* SPECIFIC VALIDITY ROUTINES                                    */ 00256000
*   /*                                                               */ 00257000
*   /*****************************************************************/ 00258000
*                                                                  0147 00259000
*   IF CANCELFL='1'B|FC=8           /* ANY CANCEL OR OVERLAY       0147 00260000
*                                      REQUESTED ?           @Z30EPXA*/ 00261000
*     THEN                          /* YES                           */ 00262000
@RC00089 TM    CANCELFL(R9),B'00001000'                            0147 00263000
         BO    @RT00147                                            0147 00264000
         CLI   FC(R9),8                                            0147 00265000
         BNE   @RF00147                                            0147 00266000
@RT00147 DS    0H                                                  0148 00267000
*     DO;                                                          0148 00268000
*       CALL SCBSRCH;               /* FIND LAST VALID SCB   @Z40FPXA*/ 00269000
         BAL   @14,SCBSRCH                                         0149 00270000
*       IF FC='84'X THEN            /* ESTAE CANCEL?         @Z40FPXA*/ 00271000
         CLI   FC(R9),X'84'                                        0150 00272000
         BNE   @RF00150                                            0150 00273000
*         DO;                                                      0151 00274000
*           CALL ESTCOVAL;          /* VERIFY ESTAE CANCEL REQUEST 0152 00275000
*                                                            @Z40FPXA*/ 00276000
         BAL   @14,ESTCOVAL                                        0152 00277000
*           GOTO PERFCAN;           /* PROCESS CANCEL REQUEST      0153 00278000
*                                                            @Z40FPXA*/ 00279000
         B     PERFCAN                                             0153 00280000
*         END;                                                     0154 00281000
*       IF FC^=4&ESTAESTA='1'B      /* ESTA REQUEST?         @ZM41808*/ 00282000
*         THEN                      /* YES                           */ 00283000
@RF00150 CLI   FC(R9),4                                            0155 00284000
         BE    @RF00155                                            0155 00285000
         TM    ESTAESTA(R1),B'00010000'                            0155 00286000
         BNO   @RF00155                                            0155 00287000
*         DO;                                                      0156 00288000
*           IF ESTASTAI='0'B&ESTASTAR='0'B/* ESTAE REQUEST ?         */ 00289000
*             THEN                  /* YES                           */ 00290000
         TM    ESTASTAI(R1),B'11000000'                            0157 00291000
         BNZ   @RF00157                                            0157 00292000
*             DO;                                                  0158 00293000
*               CALL ESTCOVAL;      /* VERIFY ESTAE CAN/OV REQ       */ 00294000
         BAL   @14,ESTCOVAL                                        0159 00295000
*             END;                                                 0160 00296000
*         END;                                                     0161 00297000
*       ELSE                        /* STAE REQUESTED                */ 00298000
*         DO;                                                      0162 00299000
*                                                                  0162 00300000
         B     @RC00155                                            0162 00301000
@RF00155 DS    0H                                                  0163 00302000
*           /*********************************************************/ 00303000
*           /*                                                       */ 00304000
*           /* IT HAS BEEN DETERMINED THAT THIS REQUEST IS EITHER A  */ 00305000
*           /* STAE CANCEL OR OVERLAY TYPE OF REQUEST-IN ORDER FOR   */ 00306000
*           /* THIS REQUEST TO BE VALID THE LAST VALID SCB POINTED TO*/ 00307000
*           /* BY REGISTER 2 MUST BE A STAE SCB AND OWNED BY THE     */ 00308000
*           /* INVOKING RB                                           */ 00309000
*           /*                                                       */ 00310000
*           /*********************************************************/ 00311000
*                                                                  0163 00312000
*           IF R2=0                 /* ANY SCB Q AT ALL TO CHECK ?   */ 00313000
*             THEN                  /* NO-INVALID                    */ 00314000
         LTR   R2,R2                                               0163 00315000
         BZ    @RT00163                                            0163 00316000
*             GOTO RETCOD8;         /* STAE RETURN CODE IS 8 @Z40FPXA*/ 00317000
*           IF SCBESTAE='0'B&SCBSTAI='1'B/* IS THIS A STAI SCB?      */ 00318000
*             THEN                  /* YES-INVALID                   */ 00319000
         TM    SCBSTAI(R2),B'10000000'                             0165 00320000
         BNO   @RF00165                                            0165 00321000
         TM    SCBESTAE(R2),B'00010000'                            0165 00322000
         BZ    @RT00165                                            0165 00323000
*             GOTO RETCOD8;         /* STAE RETURN CODE IS 8 @Z40FPXA*/ 00324000
*           IF SCBESTAE='1'B        /* IS IT A ESTA TYPE             */ 00325000
*             THEN                  /* YES                           */ 00326000
@RF00165 TM    SCBESTAE(R2),B'00010000'                            0167 00327000
         BO    @RT00167                                            0167 00328000
*             GOTO RETCOD10;        /* RETN CD FOR STAE REQ WITH ESTA   00329000
*                                      SCB                   @Z40FPXA*/ 00330000
*           IF SCBOWNRA^=RBLINKB    /* DOES THE INVOKER OWN IT       */ 00331000
*             THEN                  /* NO                            */ 00332000
         CLC   SCBOWNRA(3,R2),RBLINKB(RBSECPTR)                    0169 00333000
         BNE   @RT00169                                            0169 00334000
*             GOTO RETCOD10;        /* SCB NOT OWNED BY INVOKER    0170 00335000
*                                                            @Z40FPXA*/ 00336000
*         END;                                                     0171 00337000
*     END;                                                         0172 00338000
@RC00155 DS    0H                                                  0173 00339000
*   DO;                                                            0173 00340000
@RF00147 DS    0H                                                  0174 00341000
*     IF FC=4 THEN                  /* IF STAE CANCEL        @ZM41806*/ 00342000
         CLI   FC(R9),4                                            0174 00343000
         BE    @RT00174                                            0174 00344000
*       GOTO PERFCAN;               /* THEN PROCESS          @ZM41806*/ 00345000
*     IF ESTASTAR='1'B              /* ESTAR REQUEST ?               */ 00346000
*       THEN                        /* YES                           */ 00347000
         TM    ESTASTAR(R1),B'01000000'                            0176 00348000
         BNO   @RF00176                                            0176 00349000
*       DO;                                                        0177 00350000
*                                                                  0177 00351000
*/*  ****************************************************************   00352000
*                                                                  0178 00353000
*     ESTAR REQUESTS ARE VERIFIED BY                               0178 00354000
*                1- INSURING THAT THE INVOKER IS AUTHORIZED        0178 00355000
*                   VIA APF OR IS IN KEY 0 OR IS IN SUPERVISOR     0178 00356000
*                   STATE                                          0178 00357000
*                2- IF CREATE IS REQUESTED THERE MUST NOT BE       0178 00358000
*                   ANY SCBS ON THE QUEUE                          0178 00359000
*                3- IF OVERLAY IS REQUESTED THE LAST VALID SCB     0178 00360000
*                   MUST BE AN ESTAR TYPE                          0178 00361000
*                    A-IF A LAST VALID SCB IS NON EXISTANT         0178 00362000
*                      A CHECK IS MADE TO DETERMINE IF AN          0178 00363000
*                      SCB QUEUE EXISTS-IF THE QUEUE IS NON-EXISTANT    00364000
*                      A CREATE ESTAR WILL BE PERFORMED            0178 00365000
*     ALL INVALID ESTAR REQUESTS RESULT IN ABEND 13C AND A REASON  0178 00366000
*     CODE OF 4 IN REGISTER 15                                     0178 00367000
*                                                                  0178 00368000
*  ***************************************************************** */ 00369000
*                                                                  0178 00370000
*         /***********************************************************/ 00371000
*         /*                                                         */ 00372000
*         /* ISSUE TESTAUTH TO VERIFY INVOKERS VALIDITY              */ 00373000
*         /*                                                         */ 00374000
*         /***********************************************************/ 00375000
*                                                                  0178 00376000
*         R6=R1;                    /* SAVE R1 ACROSS TESTAUTH     0178 00377000
*                                                            @Z40FPXA*/ 00378000
         LR    R6,R1                                               0178 00379000
*         GENERATE;                                                0179 00380000
         TESTAUTH FCTN=1,STATE=YES,KEY=YES,RBLEVEL=2,BRANCH=YES         00381000
*         R1=R6;                    /* RESTORE REG 1         @Z40FPXA*/ 00382000
         LR    R1,R6                                               0180 00383000
*         IF R15^=0|(FC^=0&FC^=8)|ESTAEXIT=0/* IS THE INVOKER VALID     00384000
*                                      AND IS THE ACTION REQUESTED 0181 00385000
*                                      CREATE OR OVERLAY             */ 00386000
*           THEN                    /* NO- THIS REQUEST IS INVALID   */ 00387000
         LTR   R15,R15                                             0181 00388000
         BNZ   @RT00181                                            0181 00389000
         CLI   FC(R9),0                                            0181 00390000
         BE    @GL00005                                            0181 00391000
         CLI   FC(R9),8                                            0181 00392000
         BNE   @RT00181                                            0181 00393000
@GL00005 L     @12,ESTAEXIT-1(,R1)                                 0181 00394000
         LA    @12,0(,@12)                                         0181 00395000
         LTR   @12,@12                                             0181 00396000
         BNZ   @RF00181                                            0181 00397000
@RT00181 DS    0H                                                  0182 00398000
*           DO;                                                    0182 00399000
*             REASON=4;             /* ABEND REASON CODE             */ 00400000
         MVI   REASON(R9),X'04'                                    0183 00401000
*             CALL INVALID;         /* ISSUE ABEND                   */ 00402000
         BAL   @14,INVALID                                         0184 00403000
*           END;                                                   0185 00404000
*                                                                  0185 00405000
*         /***********************************************************/ 00406000
*         /*                                                         */ 00407000
*         /* INVOKER IS VALID                                        */ 00408000
*         /*                                                         */ 00409000
*         /***********************************************************/ 00410000
*                                                                  0186 00411000
*         IF FC=8                   /* OVERLAY REQUEST ?             */ 00412000
*           THEN                    /* YES                           */ 00413000
@RF00181 CLI   FC(R9),8                                            0186 00414000
         BNE   @RF00186                                            0186 00415000
*           DO;                                                    0187 00416000
*             CALL SCBSRCH;         /* FIND LAST VALID SCB           */ 00417000
         BAL   @14,SCBSRCH                                         0188 00418000
*             IF R2=0               /* IS A LAST VALID SCB EXISTANT  */ 00419000
*               THEN                /* NO                            */ 00420000
         LTR   R2,R2                                               0189 00421000
         BNZ   @RF00189                                            0189 00422000
*               DO;                                                0190 00423000
*                 RETCOD=4;         /* SET RETURN CODE 4 FOR MODIFIED   00424000
*                                      CREATE                @Z40FPXA*/ 00425000
         MVI   RETCOD(R9),X'04'                                    0191 00426000
*                 FC='00'X;         /* CHANGE TO CREATE REQUEST    0192 00427000
*                                                            @Z40FPXA*/ 00428000
         MVI   FC(R9),X'00'                                        0192 00429000
*               END;                                               0193 00430000
*             ELSE                  /* A VALID SCB EXISTS            */ 00431000
*               DO;                                                0194 00432000
         B     @RC00189                                            0194 00433000
@RF00189 DS    0H                                                  0195 00434000
*                 IF SCBESTAE='0'B|SCBSTAR='0'B/* IS IT ESTAR TYPE   */ 00435000
*                   THEN            /* NO                            */ 00436000
         TM    SCBESTAE(R2),B'01010000'                            0195 00437000
         BO    @RF00195                                            0195 00438000
*                   DO;                                            0196 00439000
*                     REASON=4;                                    0197 00440000
         MVI   REASON(R9),X'04'                                    0197 00441000
*                     CALL INVALID; /* ISSUE ABEND                   */ 00442000
         BAL   @14,INVALID                                         0198 00443000
*                   END;                                           0199 00444000
*               END;                                               0200 00445000
@RF00195 DS    0H                                                  0201 00446000
*           END;                                                   0201 00447000
@RC00189 DS    0H                                                  0202 00448000
*         IF FC=0                   /* IS CREATE OR MODIFIED CREATE     00449000
*                                      INDICATED                     */ 00450000
*           THEN                    /* YES                           */ 00451000
@RF00186 CLI   FC(R9),0                                            0202 00452000
         BNE   @RF00202                                            0202 00453000
*           DO;                                                    0203 00454000
*             IF TCBSTABB^=0        /* ANY SCBS EXIST ?              */ 00455000
*               THEN                /* YES-INVALID REQUEST           */ 00456000
         L     @15,TCBSTABB-1(,TCBPTR)                             0204 00457000
         LA    @15,0(,@15)                                         0204 00458000
         LTR   @15,@15                                             0204 00459000
         BZ    @RF00204                                            0204 00460000
*               DO;                                                0205 00461000
*                 REASON=4;                                        0206 00462000
         MVI   REASON(R9),X'04'                                    0206 00463000
*                 CALL INVALID;     /* ISSUE ABEND                   */ 00464000
         BAL   @14,INVALID                                         0207 00465000
*               END;                                               0208 00466000
*           END;                                                   0209 00467000
@RF00204 DS    0H                                                  0210 00468000
*       END;                                                       0210 00469000
@RF00202 DS    0H                                                  0211 00470000
*     IF ESTAESTA='1'B&ESTASTAI='1'B/* ESTAI REQUEST?                */ 00471000
*       THEN                        /* YES                           */ 00472000
@RF00176 TM    ESTAESTA(R1),B'10010000'                            0211 00473000
         BNO   @RF00211                                            0211 00474000
*       DO;                                                        0212 00475000
*                                                                  0212 00476000
*         /***********************************************************/ 00477000
*         /*                                                         */ 00478000
*         /* THIS SECTION OF CODE INSURES THAT ONLY CREATE OR        */ 00479000
*         /* PROPAGATE IS SPECIFIED WITH ESTAI REQUESTS-IF CT OR PROP*/ 00480000
*         /* IS SPECIFIED A CALL TO VERATTCH IS ISSUED-IF ATTACH IS  */ 00481000
*         /* NOT THE INVOKER AN ABEND WILL BE ISSUED                 */ 00482000
*         /*                                                         */ 00483000
*         /***********************************************************/ 00484000
*                                                                  0213 00485000
*         IF FC^=0&FC^=2            /* CT OR PROP ?                  */ 00486000
*           THEN                    /* NO                            */ 00487000
         CLI   FC(R9),0                                            0213 00488000
         BE    @RF00213                                            0213 00489000
         CLI   FC(R9),2                                            0213 00490000
         BE    @RF00213                                            0213 00491000
*           DO;                                                    0214 00492000
*             GOTO RETCOD8;         /* SET INVALID RETURN CODE     0215 00493000
*                                                            @Z40FPXA*/ 00494000
         B     RETCOD8                                             0215 00495000
*           END;                                                   0216 00496000
*         ELSE                      /* CT OR PROP IS OKAY            */ 00497000
*           DO;                                                    0217 00498000
@RF00213 DS    0H                                                  0218 00499000
*PROPROC:                                                          0218 00500000
*             ABNDFLG='1'B;         /* SET ABEND FLG         @Z40FPXA*/ 00501000
PROPROC  OI    ABNDFLG(R9),B'00000010'                             0218 00502000
*             CALL VERATTCH;        /* INSURE ATTACH IS THE INVOKER  */ 00503000
         BAL   @14,VERATTCH                                        0219 00504000
*           END;                                                   0220 00505000
*       END;                                                       0221 00506000
*   END;                                                           0222 00507000
*   GOTO PERFORM;                   /* BYPASS BRANCH PROCESSING      */ 00508000
         B     PERFORM                                             0223 00509000
*BRENTP:                                                           0224 00510000
*                                                                  0224 00511000
*   /*****************************************************************/ 00512000
*   /*                                                               */ 00513000
*   /* CHECK FOR VALID ENTRY IF THE ENTRY IS INVALID A 13C ABEND WILL*/ 00514000
*   /* BE ISSUED WITH A VALUE OF HEX 0C IN REG 15                    */ 00515000
*   /*                                                               */ 00516000
*   /*****************************************************************/ 00517000
*                                                                  0224 00518000
*   RFY                                                            0224 00519000
*     R1 RSTD;                      /*                       @Z30EPXA*/ 00520000
BRENTP   DS    0H                                                  0225 00521000
*   R7=WSALSTAE;                    /* POINT TO LOCAL WORK AREA FOR     00522000
*                                      CELLS                 @Z40FPXA*/ 00523000
         L     @15,ASCBPTR                                         0225 00524000
         L     @15,ASXBPTR(,@15)                                   0225 00525000
         L     @15,ASXBSPSA(,@15)                                  0225 00526000
         L     R7,WSALSTAE(,@15)                                   0225 00527000
*   TCBPTR=PSATOLD;                 /* PICK UP TCB ADDRESS   @Z40FPXA*/ 00528000
*                                                                  0226 00529000
         L     TCBPTR,PSATOLD                                      0226 00530000
*   /*****************************************************************/ 00531000
*   /*                                                               */ 00532000
*   /* OBTAIN CELL FROM FREE SCB QUEUE TO USE AS WORK AREA           */ 00533000
*   /*                                                               */ 00534000
*   /*****************************************************************/ 00535000
*                                                                  0227 00536000
*TRYWA:                             /* OBTAIN WORK AREA FOR BRANCH 0227 00537000
*                                      ENTRY                 @Z40FPXA*/ 00538000
*   R9=FREESCBQ;                    /* PICK UP FREE CELL ADDRESS   0227 00539000
*                                                            @Z40FPXA*/ 00540000
TRYWA    L     R9,FREESCBQ(,R7)                                    0227 00541000
*   IF R9=0 THEN                    /* ANY CELLS AVAILABLE?  @Z40FPXA*/ 00542000
         LTR   R9,R9                                               0228 00543000
         BNZ   @RF00228                                            0228 00544000
*     DO;                           /* NO.. GO OBTAIN MORE CELLS   0229 00545000
*                                                            @Z40FPXA*/ 00546000
*       CALL GETSTOR;               /* GET NEW CELLS         @Z40FPXA*/ 00547000
         BAL   @14,GETSTOR                                         0230 00548000
*       GOTO TRYWA;                 /* RETRY CELL OBTAIN     @Z40FPXA*/ 00549000
         B     TRYWA                                               0231 00550000
*     END;                          /*                       @Z40FPXA*/ 00551000
*   R3=R9->SCBCHAIN;                /* NEXT CELL ADDRESS     @Z40FPXA*/ 00552000
@RF00228 L     R3,SCBCHAIN(,R9)                                    0233 00553000
*   CS(R9,R3,FREESCBQ);             /* DEQUEUE CELL          @Z40FPXA*/ 00554000
         CS    R9,@03,FREESCBQ(R7)                                 0234 00555000
*   BC(7,TRYWA);                    /* RETRY IF FAILS        @Z40FPXA*/ 00556000
         BC    7,TRYWA                                             0235 00557000
*   RBSECPTR=TCBRBP;                /* CURRENT RB ADDRESS            */ 00558000
         L     RBSECPTR,TCBRBP(,TCBPTR)                            0236 00559000
*   IF TCBFX^='1'B THEN             /* DISALLOW ASYNCRO-     @ZA24347*/ 00560000
         TM    TCBFX(TCBPTR),B'00000001'                           0237 00561000
         BO    @RF00237                                            0237 00562000
*     DO;                           /* NOUS INTERRUPTS.      @ZA24347*/ 00563000
*       TCBSTAFX='1'B;              /*                       @ZA24347*/ 00564000
         OI    TCBSTAFX(TCBPTR),B'01000000'                        0239 00565000
*       TCBFX='1'B;                 /*                       @ZA24347*/ 00566000
         OI    TCBFX(TCBPTR),B'00000001'                           0240 00567000
*     END;                          /*                       @ZA24347*/ 00568000
*   ELSE                                                           0242 00569000
*     ;                             /*                       @ZA24347*/ 00570000
@RF00237 DS    0H                                                  0243 00571000
*   TCBSTAWA=R9;                    /* INDICATE ESTAE IN CONTROL TO     00572000
*                                      RTM                   @Z40FPXA*/ 00573000
         ST    R9,TCBSTAWA(,TCBPTR)                                0243 00574000
*   WKWORD=REG0;                    /* SAVE FUNCTION CODE AND CLEAR     00575000
*                                      WORK AREA             @Z40FPXA*/ 00576000
         ST    REG0,WKWORD(,R9)                                    0244 00577000
*   IF FC='94'X                     /* CANCEL REQUESTED?     @Z40FPXA*/ 00578000
*     THEN                          /* YES-NO PARMS PASSED           */ 00579000
         CLI   FC(R9),X'94'                                        0245 00580000
         BNE   @RF00245                                            0245 00581000
*     DO;                                                          0246 00582000
*CANPROC:                                                          0247 00583000
*       BRENTFLG='1'B;              /* SET BRANCH ENTRY FLAG @Z40FPXA*/ 00584000
CANPROC  DS    0H                                                  0248 00585000
*       CANCELFL='1'B;              /* SET CANCEL FLAG       @Z30EPXA*/ 00586000
         OI    BRENTFLG(R9),B'00001100'                            0248 00587000
*       CALL SCBSRCH;               /* FIND LAST VALID SCB   @Z40FPXA*/ 00588000
         BAL   @14,SCBSRCH                                         0249 00589000
*       CALL ESTCOVAL;              /* VERIFY CANCEL REQUEST @Z40FPXA*/ 00590000
         BAL   @14,ESTCOVAL                                        0250 00591000
*       GOTO PERFCAN;               /* PERFORM CANCEL PROC   @Z40FPXA*/ 00592000
         B     PERFCAN                                             0251 00593000
*     END;                                                         0252 00594000
*   ELSE                            /* NOT CANCEL SO PARMS ARE PASSED*/ 00595000
*     DO;                                                          0253 00596000
@RF00245 DS    0H                                                  0254 00597000
*       BRENTFLG='1'B;              /* SET BRANCH ENTRY FLAG @Z40FPXA*/ 00598000
         OI    BRENTFLG(R9),B'00000100'                            0254 00599000
*/* *************************************************************  0255 00600000
*                                                                  0255 00601000
*      THIS SECTION OF CODE INSURES THAT THE BRANCH ENTRY REQUEST  0255 00602000
*      IS FOR ESTAE ONLY- IF ESTAE CANCEL OR OVERLAY IS REQUESTED  0255 00603000
*      A CALL TO ESTCOVAL IS EXECUTED TO VERIFY THE REQUEST-IF THE 0255 00604000
*      OVERLAY REQUEST IS INVALID ESTCOVAL CHANGES THE REQUEST TO  0255 00605000
*      A MODIFIED CREATE AND PROCESSING CONTINUES AS A NORMAL      0255 00606000
*      CREATE FOR A BRANCH ENTRY                                   0255 00607000
*                                                                  0255 00608000
* ****************************************************************** */ 00609000
*                                                                  0255 00610000
*       IF(ESTAESTA='0'B|ESTASTAI='1'B|ESTASTAR='1'B)/*      @Z30EPXA   00611000
*                                      IS ESTAE REQUESTED            */ 00612000
*         THEN                      /* NO-THIS REQUEST IS INVALID    */ 00613000
         TM    ESTASTAI(R1),B'11000000'                            0255 00614000
         BNZ   @RT00255                                            0255 00615000
         TM    ESTAESTA(R1),B'00010000'                            0255 00616000
         BO    @RF00255                                            0255 00617000
@RT00255 DS    0H                                                  0256 00618000
*         DO;                                                      0256 00619000
*           REASON='0C'X;           /* ABEND CODE IS 12              */ 00620000
         MVI   REASON(R9),X'0C'                                    0257 00621000
*           CALL INVALID;           /* ISSUE ABEND 13C               */ 00622000
         BAL   @14,INVALID                                         0258 00623000
*         END;                                                     0259 00624000
*       IF ESTAEXIT=0               /* IS THIS AN IMPLIED CANCEL   0260 00625000
*                                      REQUEST                       */ 00626000
*         THEN                      /* YES CHANGE ACTION CODE TO HEX    00627000
*                                      94                            */ 00628000
@RF00255 L     @15,ESTAEXIT-1(,R1)                                 0260 00629000
         LA    @15,0(,@15)                                         0260 00630000
         LTR   @15,@15                                             0260 00631000
         BNZ   @RF00260                                            0260 00632000
*         DO;                                                      0261 00633000
*           FC='94'X;               /* SET CANCEL FUNCTION CODE    0262 00634000
*                                                            @Z40FPXA*/ 00635000
         MVI   FC(R9),X'94'                                        0262 00636000
*           GOTO CANPROC;           /* GO DO CANCEL PROCESSING     0263 00637000
*                                                            @Z40FPXA*/ 00638000
         B     CANPROC                                             0263 00639000
*         END;                                                     0264 00640000
*     END;                                                         0265 00641000
@RF00260 DS    0H                                                  0266 00642000
*   IF FC='00'X                     /* IS THIS A CREATE?     @Z40FPXA*/ 00643000
*     THEN                          /* YES                           */ 00644000
         CLI   FC(R9),X'00'                                        0266 00645000
         BNE   @RF00266                                            0266 00646000
*     DO;                           /* CREATE SCB FROM WORK AREA   0267 00647000
*                                                            @Z40FPXA*/ 00648000
*       R2=R9;                      /* USE WORK AREA FOR SCB @Z40FPXA*/ 00649000
         LR    R2,R9                                               0268 00650000
*       SCBFLGS3=ESTAFLG2;          /* COPY ESTA FLAG INTO SCB     0269 00651000
*                                                            @Z40FPXA*/ 00652000
         MVC   SCBFLGS3(1,R2),ESTAFLG2(R1)                         0269 00653000
*       SCBOWNR=RBSECPTR;           /* SET OWNERS RB ADDRESS @Z40FPXA*/ 00654000
         ST    RBSECPTR,SCBOWNR(,R2)                               0270 00655000
*       CALL FINSCB;                /* FINISH SCB            @Z40FPXA*/ 00656000
         BAL   @14,FINSCB                                          0271 00657000
*       SCBKEY0='1'B;               /* SET KEY ZERO BYTE     @Z40FPXA*/ 00658000
*       SCBSUPER='1'B;              /* SET SUPERVISOR OPTION @Z40FPXA*/ 00659000
         OI    SCBKEY0(R2),B'00000011'                             0273 00660000
*       SCBPKEY='00'X;              /* SET KEY ZERO          @Z40FPXA*/ 00661000
         MVI   SCBPKEY(R2),X'00'                                   0274 00662000
*       RBSCB='1'B;                 /* INDICATE RB OWNS SCB  @Z40FPXA*/ 00663000
         LR    @15,RBSECPTR                                        0275 00664000
         AL    @15,@CF02220                                        0275 00665000
         OI    RBSCB-56(@15),B'00000010'                           0275 00666000
*       SCBCHAIN=TCBSTABB;          /* CHAIN UP SCB          @Z40FPXA*/ 00667000
         L     @15,TCBSTABB-1(,TCBPTR)                             0276 00668000
         LA    @15,0(,@15)                                         0276 00669000
         ST    @15,SCBCHAIN(,R2)                                   0276 00670000
*       TCBSTABB=R2;                /* ADD TO TCB CHAIN      @Z40FPXA*/ 00671000
         STCM  R2,7,TCBSTABB(TCBPTR)                               0277 00672000
*       R15=0;                      /* CLEAR REG 15          @Z40FPXA*/ 00673000
         SLR   R15,R15                                             0278 00674000
*       IF TCBSTAFX='1'B THEN       /* ALLOW ASYNCRO-        @ZA24347*/ 00675000
         TM    TCBSTAFX(TCBPTR),B'01000000'                        0279 00676000
         BNO   @RF00279                                            0279 00677000
*         DO;                       /* NOUS INTERRUPTS.      @ZA24347*/ 00678000
*           TCBFX='0'B;             /*                       @ZA24347*/ 00679000
         NI    TCBFX(TCBPTR),B'11111110'                           0281 00680000
*           TCBSTAFX='0'B;          /*                       @ZA24347*/ 00681000
         NI    TCBSTAFX(TCBPTR),B'10111111'                        0282 00682000
*         END;                      /*                       @ZA24347*/ 00683000
*       ELSE                                                       0284 00684000
*         ;                         /*                       @ZA24347*/ 00685000
@RF00279 DS    0H                                                  0285 00686000
*       TCBSTAWA=R15;               /* ZERO ESTAE IN PROCESS FLAG  0285 00687000
*                                                            @Z40FPXA*/ 00688000
         ST    R15,TCBSTAWA(,TCBPTR)                               0285 00689000
*       GENERATE;                                                  0286 00690000
*                                                       /* @Z40FPXA*/   00691000
      L     R14,12(R13)                                                 00692000
      LM    R2,R12,28(R13)                                              00693000
      BR    R14                                                         00694000
*     END;                                                         0287 00695000
*   ELSE                            /*                       @Z40FPXA*/ 00696000
*     DO;                                                          0288 00697000
*                                                                  0288 00698000
         B     @RC00266                                            0288 00699000
@RF00266 DS    0H                                                  0289 00700000
*       /*************************************************************/ 00701000
*       /*                                                           */ 00702000
*       /* IF FUNCTION CODE IS NOT OVERLAY, THEN A INVALID FUNCTION  */ 00703000
*       /* CODE WAS REQUESTED.. ABEND USER                           */ 00704000
*       /*                                                           */ 00705000
*       /*************************************************************/ 00706000
*                                                                  0289 00707000
*       IF FC^=8 THEN               /* OVERLAY REQUEST?      @Z40FPXA*/ 00708000
         CLI   FC(R9),8                                            0289 00709000
         BE    @RF00289                                            0289 00710000
*         DO;                                                      0290 00711000
*           REASON='0C'X;           /* SET ABEND REASON CODE @Z40FPXA*/ 00712000
         MVI   REASON(R9),X'0C'                                    0291 00713000
*           CALL INVALID;           /* ISSUE ABEND           @Z40FPXA*/ 00714000
         BAL   @14,INVALID                                         0292 00715000
*         END;                                                     0293 00716000
*       CALL SCBSRCH;               /* FIND THE LAST VALID SCB       */ 00717000
@RF00289 BAL   @14,SCBSRCH                                         0294 00718000
*       CALL ESTCOVAL;              /* VERIFY THE REQUEST AS BEING 0295 00719000
*                                      VALID                         */ 00720000
         BAL   @14,ESTCOVAL                                        0295 00721000
*     END;                                                         0296 00722000
*PERFORM:                                                          0297 00723000
*                                                                  0297 00724000
*   /*****************************************************************/ 00725000
*   /*                                                               */ 00726000
*   /* BOTH BRANCH ENTRY AND SVC ENTRY REQUESTS ARE PROCESSED BY THIS*/ 00727000
*   /* COMMON PATH TO PERFORM THE FUNCTION REQUESTED                 */ 00728000
*   /*                                                               */ 00729000
*   /*****************************************************************/ 00730000
*                                                                  0297 00731000
*   DO;                                                            0297 00732000
*                                                                  0297 00733000
@RC00266 DS    0H                                                  0297 00734000
PERFORM  DS    0H                                                  0298 00735000
*     /***************************************************************/ 00736000
*     /*                                                             */ 00737000
*     /* THIS SECTION OF CODE ROUTES CONTROL TO SPECIFIC ROUTINES TO */ 00738000
*     /* PERFORM THE REQUEST THAT WAS SPECIFIED                      */ 00739000
*     /*                                                             */ 00740000
*     /***************************************************************/ 00741000
*                                                                  0298 00742000
*     IF CANCELFL='1'B              /* CANCEL REQUEST ?      @Z30EPXA*/ 00743000
*       THEN                        /* YES                           */ 00744000
         TM    CANCELFL(R9),B'00001000'                            0298 00745000
         BNO   @RF00298                                            0298 00746000
*       DO;                                                        0299 00747000
*PERFCAN:                                                          0300 00748000
*         CALL CANCEL;              /* REMOVE AN SCB         @Z30EPXA*/ 00749000
PERFCAN  BAL   @14,CANCEL                                          0300 00750000
*       END;                                                       0301 00751000
*     ELSE                                                         0302 00752000
*       DO;                                                        0302 00753000
         B     @RC00298                                            0302 00754000
@RF00298 DS    0H                                                  0303 00755000
*         IF FC=0                   /* CREATE REQUEST ?      @Z30EPXA*/ 00756000
*           THEN                    /* YES                           */ 00757000
         CLI   FC(R9),0                                            0303 00758000
         BNE   @RF00303                                            0303 00759000
*           DO;                                                    0304 00760000
*             CALL CREATE;          /* ADD AN SCB            @Z30EPXA*/ 00761000
         BAL   @14,CREATE                                          0305 00762000
*           END;                                                   0306 00763000
*         ELSE                                                     0307 00764000
*           DO;                                                    0307 00765000
         B     @RC00303                                            0307 00766000
@RF00303 DS    0H                                                  0308 00767000
*             IF FC=8               /* OVERLAY REQUEST ?     @Z30EPXA*/ 00768000
*               THEN                /* YES                           */ 00769000
         CLI   FC(R9),8                                            0308 00770000
         BNE   @RF00308                                            0308 00771000
*               DO;                                                0309 00772000
*                 CALL OVERLAY;     /* OVERLAY AN SCB        @Z30EPXA*/ 00773000
         BAL   @14,OVERLAY                                         0310 00774000
*               END;                                               0311 00775000
*             ELSE                                                 0312 00776000
*               DO;                                                0312 00777000
         B     @RC00308                                            0312 00778000
@RF00308 DS    0H                                                  0313 00779000
*                 IF FC=2           /* PROPAGATE REQUEST ?           */ 00780000
*                   THEN            /* YES                           */ 00781000
         CLI   FC(R9),2                                            0313 00782000
         BNE   @RF00313                                            0313 00783000
*                   DO;                                            0314 00784000
*                     CALL PROPA;   /* COPY (E)STAI SCB(S)           */ 00785000
         BAL   @14,PROPA                                           0315 00786000
*                   END;                                           0316 00787000
*                 ELSE              /* CANNOT DETERMINE WHAT ACTION     00788000
*                                      TO BE PERFORMED RETURN CODE IS   00789000
*                                      HEX 10                        */ 00790000
*                   DO;                                            0317 00791000
         B     @RC00313                                            0317 00792000
@RF00313 DS    0H                                                  0318 00793000
*RETCOD10:                                                         0318 00794000
*                     RETCOD=4;     /* SET INITIAL VALUE     @Z40FPXA*/ 00795000
RETCOD10 MVI   RETCOD(R9),X'04'                                    0318 00796000
*RETCODC:                                                          0319 00797000
*                     RETCOD=RETCOD+4;/* INCREMENT RETURN CODE     0319 00798000
*                                                            @Z40FPXA*/ 00799000
RETCODC  LA    @15,4                                               0319 00800000
         SLR   @12,@12                                             0319 00801000
         IC    @12,RETCOD(,R9)                                     0319 00802000
         ALR   @15,@12                                             0319 00803000
         STC   @15,RETCOD(,R9)                                     0319 00804000
*RETCOD8:                                                          0320 00805000
*                     RETCOD=RETCOD+4;/* INCREMENT RETURN CODE     0320 00806000
*                                                            @Z40FPXA*/ 00807000
RETCOD8  LA    @15,4                                               0320 00808000
         SLR   @12,@12                                             0320 00809000
         IC    @12,RETCOD(,R9)                                     0320 00810000
         ALR   @15,@12                                             0320 00811000
         STC   @15,RETCOD(,R9)                                     0320 00812000
*RETCOD4:                                                          0321 00813000
*                     RETCOD=RETCOD+4;/* INCREMENT RETURN CODE     0321 00814000
*                                                            @Z40FPXA*/ 00815000
RETCOD4  LA    @15,4                                               0321 00816000
         SLR   @12,@12                                             0321 00817000
         IC    @12,RETCOD(,R9)                                     0321 00818000
         ALR   @15,@12                                             0321 00819000
         STC   @15,RETCOD(,R9)                                     0321 00820000
*                   END;                                           0322 00821000
*               END;                                               0323 00822000
@RC00313 DS    0H                                                  0324 00823000
*           END;                                                   0324 00824000
@RC00308 DS    0H                                                  0325 00825000
*       END;                                                       0325 00826000
@RC00303 DS    0H                                                  0326 00827000
*   END;                                                           0326 00828000
*                                                                  0326 00829000
@RC00298 DS    0H                                                  0327 00830000
*   /*****************************************************************/ 00831000
*   /*                                                               */ 00832000
*   /* PREPARE FOR RETURN DETERMINE ENTRY TYPE                       */ 00833000
*   /*                                                               */ 00834000
*   /*****************************************************************/ 00835000
*                                                                  0327 00836000
*   RFY                                                            0327 00837000
*    (R15) RSTD;                    /* RESTRICT REG 15       @Z40FPXA*/ 00838000
*RETN:                                                             0328 00839000
*   R15=RETCOD;                     /* PICK UP RETURN CODE   @Z40FPXA*/ 00840000
RETN     SLR   R15,R15                                             0328 00841000
         IC    R15,RETCOD(,R9)                                     0328 00842000
*   IF TCBSTAFX='1'B THEN           /* ALLOW FOR ASYNCRONOUS @ZA24347*/ 00843000
         TM    TCBSTAFX(TCBPTR),B'01000000'                        0329 00844000
         BNO   @RF00329                                            0329 00845000
*     DO;                           /* INTERRUPTS.           @ZA24347*/ 00846000
*       TCBFX='0'B;                 /*                       @ZA24347*/ 00847000
         NI    TCBFX(TCBPTR),B'11111110'                           0331 00848000
*       TCBSTAFX='0'B;              /*                       @ZA24347*/ 00849000
         NI    TCBSTAFX(TCBPTR),B'10111111'                        0332 00850000
*     END;                          /*                       @ZA24347*/ 00851000
*   ELSE                                                           0334 00852000
*     ;                             /*                       @ZA24347*/ 00853000
@RF00329 DS    0H                                                  0335 00854000
*   TCBSTAWA=0;                     /* CLEAR ESTAE IN PROCESS FLAG 0335 00855000
*                                                            @Z40FPXA*/ 00856000
         SLR   @12,@12                                             0335 00857000
         ST    @12,TCBSTAWA(,TCBPTR)                               0335 00858000
*   IF BRENTFLG='1'B                /* BRANCH ENTRY TYPE?    @Z40FPXA*/ 00859000
*     THEN                          /* YES- RESTORE REGS             */ 00860000
         TM    BRENTFLG(R9),B'00000100'                            0336 00861000
         BNO   @RF00336                                            0336 00862000
*     DO;                                                          0337 00863000
*                                                                  0337 00864000
*       /*************************************************************/ 00865000
*       /*                                                           */ 00866000
*       /* RETURN BRANCH ENTRY WORK AREA TO SCB QUEUE                */ 00867000
*       /*                                                           */ 00868000
*       /*************************************************************/ 00869000
*                                                                  0338 00870000
*RETWA:                                                            0338 00871000
*       R5=FREESCBQ;                /* TOP OF CURRENT CELL QUEUE   0338 00872000
*                                                            @Z40FPXA*/ 00873000
RETWA    L     R5,FREESCBQ(,R7)                                    0338 00874000
*       R9->SCBCHAIN=R5;            /* MAINTAIN QUEUE        @Z40FPXA*/ 00875000
         ST    R5,SCBCHAIN(,R9)                                    0339 00876000
*       CS(R5,R9,FREESCBQ);         /* REPLACE CELL IN CHAIN @Z40FPXA*/ 00877000
         CS    R5,@09,FREESCBQ(R7)                                 0340 00878000
*       BC(7,RETWA);                /* RETRY IF UNSUCCESSFUL @Z40FPXA*/ 00879000
         BC    7,RETWA                                             0341 00880000
*NOWORKA:                                                          0342 00881000
*       GENERATE;                                                  0342 00882000
NOWORKA  DS    0H                                                  0342 00883000
*                                         /* @Z40FPXA*/                 00884000
         L     R14,12(R13)                                              00885000
         LM    R2,R12,28(R13)                                           00886000
         BR    R14                                                      00887000
*     END;                                                         0343 00888000
*   ELSE                            /* WAS NORMAL SVC ENTRY  @Z40FPXA*/ 00889000
*     R14=R14SAVE;                  /* RESTORE RETURN ADDRESS      0344 00890000
*                                                            @Z40FPXA*/ 00891000
         B     @RC00336                                            0344 00892000
@RF00336 L     R14,R14SAVE(,R9)                                    0344 00893000
*   RETURN;                                                        0345 00894000
@EL00001 DS    0H                                                  0345 00895000
@EF00001 DS    0H                                                  0345 00896000
@ER00001 BR    @14                                                 0345 00897000
*SCBSRCH:                                                          0346 00898000
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA);                          0346 00899000
         B     @EL00001                                            0346 00900000
SCBSRCH  DS    0H                                                  0347 00901000
*   R2=TCBSTABB;                    /* OBTAIN ADDRESS OF LAST SCB ON    00902000
*                                      THE QUEUE                     */ 00903000
*                                                                  0347 00904000
         L     R2,TCBSTABB-1(,TCBPTR)                              0347 00905000
         LA    R2,0(,R2)                                           0347 00906000
*   /*****************************************************************/ 00907000
*   /*                                                               */ 00908000
*   /* FIND THE LAST SCB PLACED ON THE QUEUE-IF ANY EXIST- THAT IS   */ 00909000
*   /* NOT MARKED AS LOGICALLY CANCELED AND NOT MARKED AS IN USE     */ 00910000
*   /*                                                               */ 00911000
*   /*****************************************************************/ 00912000
*                                                                  0348 00913000
*SRCHLOOP:                                                         0348 00914000
*   IF R2=0 THEN                    /* END OF LOOP?          @Z40FPXA*/ 00915000
SRCHLOOP LTR   R2,R2                                               0348 00916000
         BZ    @RT00348                                            0348 00917000
*     RETURN;                       /* RETURN TO CALLER      @Z40FPXA*/ 00918000
*   IF SCBID^='DB'X                 /* IS IT AN SCB                  */ 00919000
*     THEN                          /* NO                            */ 00920000
         CLI   SCBID(R2),X'DB'                                     0350 00921000
         BE    @RF00350                                            0350 00922000
*     DO;                                                          0351 00923000
*       R2=0;                                                      0352 00924000
         SLR   R2,R2                                               0352 00925000
*       TCBSTABB=R2;                /* TRUNCATE THE Q                */ 00926000
         STCM  R2,7,TCBSTABB(TCBPTR)                               0353 00927000
*     END;                                                         0354 00928000
*   ELSE                            /* IT IS AN SCB                  */ 00929000
*     DO;                                                          0355 00930000
         B     @RC00350                                            0355 00931000
@RF00350 DS    0H                                                  0356 00932000
*       IF SCBCNCEL='1'B|SCBINUSE='1'B THEN/* THIS SCB IS EITHER IN     00933000
*                                      USE OR LOGICALLY CANCELED     */ 00934000
         TM    SCBCNCEL(R2),B'00010000'                            0356 00935000
         BO    @RT00356                                            0356 00936000
         TM    SCBINUSE(R2),B'00010000'                            0356 00937000
         BNO   @RF00356                                            0356 00938000
@RT00356 DS    0H                                                  0357 00939000
*         DO;                       /* GET NEXT SCB                  */ 00940000
*           R2=SCBCHAIN;                                           0358 00941000
         L     R2,SCBCHAIN(,R2)                                    0358 00942000
*           GOTO SRCHLOOP;          /* CONTINUE SCAN         @Z40FPXA*/ 00943000
         B     SRCHLOOP                                            0359 00944000
*         END;                                                     0360 00945000
*       ELSE                        /* USE THIS SCB                  */ 00946000
*         DO;                                                      0361 00947000
@RF00356 DS    0H                                                  0362 00948000
*           RETURN;                 /* GET OUT OF DO WHILE   @Z30EPXA*/ 00949000
@EL00002 DS    0H                                                  0362 00950000
@EF00002 DS    0H                                                  0362 00951000
@ER00002 BR    @14                                                 0362 00952000
*         END;                                                     0363 00953000
*     END;                                                         0364 00954000
*                                                                  0364 00955000
*   /*****************************************************************/ 00956000
*   /*                                                               */ 00957000
*   /* REGISTER 2 NOW CONTAINS EITHER THE ADDRESS OF THE LAST VALID  */ 00958000
*   /* SCB PLACED ON THE QUEUE OR ZERO RETURN TO CALLING PROCEDURE   */ 00959000
*   /*                                                               */ 00960000
*   /*****************************************************************/ 00961000
*                                                                  0365 00962000
*   END SCBSRCH;                                                   0365 00963000
         B     @EL00002                                            0365 00964000
*ESTCOVAL:                                                         0366 00965000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0366 00966000
*                                                                  0366 00967000
ESTCOVAL DS    0H                                                  0367 00968000
*   /*****************************************************************/ 00969000
*   /*                                                               */ 00970000
*   /* THIS ROUTINE DETERMINES THE VALIDITY OF AN ESTAE CANCEL OR    */ 00971000
*   /* OVERLAY REQUEST                                               */ 00972000
*   /*                                                               */ 00973000
*   /*****************************************************************/ 00974000
*                                                                  0367 00975000
*   IF R2=0                         /* ANY SCB TO CHECK              */ 00976000
*     THEN                          /* NO                            */ 00977000
         LTR   R2,R2                                               0367 00978000
         BZ    @RT00367                                            0367 00979000
*     GOTO CKRC4;                   /* INVALID               @Z40FPXA*/ 00980000
*   IF SCBESTAE='0'B|SCBSTAI='1'B|SCBSTAR='1'B/* ESTAE TYPE ?        */ 00981000
*     THEN                                                         0369 00982000
         TM    SCBSTAI(R2),B'11000000'                             0369 00983000
         BNZ   @RT00369                                            0369 00984000
         TM    SCBESTAE(R2),B'00010000'                            0369 00985000
         BNO   @RT00369                                            0369 00986000
*     GOTO CKRC4;                   /* INVALID               @Z40FPXA*/ 00987000
*   IF BRENTFLG='1'B                /* BRANCH ENTERED BY INVOKER?  0371 00988000
*                                                            @Z40FPXA*/ 00989000
*     THEN                          /* YES-INVOKER IS RB POINTED TO     00990000
*                                      BY THE TCB                    */ 00991000
         TM    BRENTFLG(R9),B'00000100'                            0371 00992000
         BNO   @RF00371                                            0371 00993000
*     DO;                                                          0372 00994000
*       IF SCBOWNRA=RBSECPTR        /* IS SCB OWNED BY THE RB POINTED   00995000
*                                      TO BY THE TCB         @Z40FPXA*/ 00996000
*         THEN                      /* YES                           */ 00997000
         L     @12,SCBOWNRA-1(,R2)                                 0373 00998000
         LA    @12,0(,@12)                                         0373 00999000
         CR    RBSECPTR,@12                                        0373 01000000
         BE    @RT00373                                            0373 01001000
*         RETURN;                   /* OK.. RETURN TO CALLER @Z40FPXA*/ 01002000
*     END;                                                         0375 01003000
*   ELSE                            /* SVC ENTERED-INVOKER IS THE  0376 01004000
*                                      SECOND RB ON THE RB Q         */ 01005000
*     DO;                                                          0376 01006000
         B     @RC00371                                            0376 01007000
@RF00371 DS    0H                                                  0377 01008000
*       IF SCBOWNRA=RBLINKB         /* IS IT OWNED?          @Z40FPXA*/ 01009000
*         THEN                      /* YES                           */ 01010000
         CLC   SCBOWNRA(3,R2),RBLINKB(RBSECPTR)                    0377 01011000
         BE    @RT00377                                            0377 01012000
*         RETURN;                   /* OK.. RETURN TO CALLER @Z40FPXA*/ 01013000
*     END;                                                         0379 01014000
*CKRC4:                                                            0380 01015000
*   IF FC=8                         /* INVALID OVERLAY ?     @Z40FPXA*/ 01016000
*     THEN                          /* YES                           */ 01017000
@RC00371 DS    0H                                                  0380 01018000
CKRC4    CLI   FC(R9),8                                            0380 01019000
         BNE   @RF00380                                            0380 01020000
*     DO;                                                          0381 01021000
*       RETCOD=4;                   /* ALLOW PROCESSING      @Z40FPXA*/ 01022000
         MVI   RETCOD(R9),X'04'                                    0382 01023000
*       FC='00'X;                   /* BUT THE REQUEST IS CHANGED TO    01024000
*                                      A CREATE              @Z40FPXA*/ 01025000
         MVI   FC(R9),X'00'                                        0383 01026000
*     END;                                                         0384 01027000
*   ELSE                                                           0385 01028000
*     GOTO RETCODC;                 /* RETURN TO CALLER WITH RET C 0385 01029000
*                                                            @Z40FPXA*/ 01030000
*   END ESTCOVAL;                                                  0386 01031000
@EL00003 DS    0H                                                  0386 01032000
@EF00003 DS    0H                                                  0386 01033000
@ER00003 BR    @14                                                 0386 01034000
*VERATTCH:                                                         0387 01035000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0387 01036000
*                                                                  0387 01037000
VERATTCH DS    0H                                                  0388 01038000
*   /*****************************************************************/ 01039000
*   /*                                                               */ 01040000
*   /* THIS PROCEDURE INSURES THAT ATTACH IS THE INVOKER FOR ALL STAI*/ 01041000
*   /* OR ESTAI REQUESTS IT ALSO INSURES THAT A VALID TCB ADDRESS IS */ 01042000
*   /* PASSED BY ATTACH                                              */ 01043000
*   /*                                                               */ 01044000
*   /*****************************************************************/ 01045000
*                                                                  0388 01046000
*   RBSECPTR=RBLINK->RBLINKB;       /* ADDRESS OF THIRD RB   @Z40FPXA*/ 01047000
         L     @12,RBLINK(,RBSECPTR)                               0388 01048000
         L     @12,RBLINKB-1(,@12)                                 0388 01049000
         LA    @12,0(,@12)                                         0388 01050000
         LR    RBSECPTR,@12                                        0388 01051000
*   IF RBSECPTR=TCBPTR|             /* ARE THERE 3 RBS ON Q  @Z40FPXA*/ 01052000
*       RBINTCOD^='002A'X           /* IF SO DID THE THIRD RB ISSUE     01053000
*                                      ATTACH?               @Z40FPXA*/ 01054000
*     THEN                                                         0389 01055000
         CR    RBSECPTR,TCBPTR                                     0389 01056000
         BE    @RT00389                                            0389 01057000
         LR    @12,RBSECPTR                                        0389 01058000
         BCTR  @12,0                                               0389 01059000
         BCTR  @12,0                                               0389 01060000
         CLC   RBINTCOD-62(2,@12),@CB02152                         0389 01061000
         BNE   @RT00389                                            0389 01062000
*     GOTO CKABND;                  /* RETURN CODE C         @Z40FPXA*/ 01063000
*   IF ESTAOWNR=0                   /* TCB ADDRESS SUPPLIED ?        */ 01064000
*     THEN                          /* NO                            */ 01065000
         L     @12,ESTAOWNR(,R1)                                   0391 01066000
         LTR   @12,@12                                             0391 01067000
         BZ    @RT00391                                            0391 01068000
*     GOTO CKABND;                  /* RETURN CODE C                 */ 01069000
*   IF FC='00'X&ESTAEXIT=0          /* CT WITH EXIT ADD?     @Z40FPXA*/ 01070000
*     THEN                          /* NO                            */ 01071000
         CLI   FC(R9),X'00'                                        0393 01072000
         BNE   @RF00393                                            0393 01073000
         L     @12,ESTAEXIT-1(,R1)                                 0393 01074000
         LA    @12,0(,@12)                                         0393 01075000
         LTR   @12,@12                                             0393 01076000
         BZ    @RT00393                                            0393 01077000
*     GOTO CKABND;                  /* RETURN CODE C         @Z40FPXA*/ 01078000
*   RBSECPTR=TCBRBP;                /* RELOAD RB PTR         @Z40FPXA*/ 01079000
@RF00393 L     RBSECPTR,TCBRBP(,TCBPTR)                            0395 01080000
*   RETURN;                                                        0396 01081000
@EL00004 DS    0H                                                  0396 01082000
@EF00004 DS    0H                                                  0396 01083000
@ER00004 BR    @14                                                 0396 01084000
*CKABND:                            /* DETERMINE IF ABEND SHOULD BE     01085000
*                                      ISSUED, OR RETURN CODE C      */ 01086000
*   IF ABNDFLG='1'B THEN            /* SHOULD ABEND BE ISSUED?     0397 01087000
*                                                            @Z40FPXA*/ 01088000
CKABND   TM    ABNDFLG(R9),B'00000010'                             0397 01089000
         BNO   @RF00397                                            0397 01090000
*     DO;                           /* YES.. ISSUE ABEND             */ 01091000
*       REASON=8;                   /* SET ABEND REASON CODE @Z40FPXA*/ 01092000
         MVI   REASON(R9),X'08'                                    0399 01093000
*       CALL INVALID;               /* GO ISSUE ABEND        @Z40FPXA*/ 01094000
         BAL   @14,INVALID                                         0400 01095000
*     END;                                                         0401 01096000
*   ELSE                                                           0402 01097000
*     GOTO RETCODC;                 /* GO ISSUE RETURN CODE C      0402 01098000
*                                                            @Z40FPXA*/ 01099000
*   END VERATTCH;                                                  0403 01100000
         B     @EL00004                                            0403 01101000
*CANCEL:                                                           0404 01102000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0404 01103000
*                                                                  0404 01104000
CANCEL   DS    0H                                                  0405 01105000
*   /*****************************************************************/ 01106000
*   /*                                                               */ 01107000
*   /* THIS ROUTINE DEQUEUES THE SCB ADDRESSED BY REGISTER 2 IT THEN */ 01108000
*   /* DETERMINES IF THE SCB WAS CREATED VIA BRANCH ENTRY-IF IT WAS  */ 01109000
*   /* IT IS CLEARED TO 0 IF IT WAS NOT THE CORE IS FREEMAINED       */ 01110000
*   /*                                                               */ 01111000
*   /*****************************************************************/ 01112000
*                                                                  0405 01113000
*   IF TCBSTABB=R2                  /* IS THE SCB POINTED TO BY THE     01114000
*                                      TCB THE ONE TO CANCEL         */ 01115000
*     THEN                          /* YES                           */ 01116000
         L     @12,TCBSTABB-1(,TCBPTR)                             0405 01117000
         LA    @12,0(,@12)                                         0405 01118000
         CR    R2,@12                                              0405 01119000
         BNE   @RF00405                                            0405 01120000
*     DO;                                                          0406 01121000
*       TCBSTABB=SCBCHAIN;          /* TCB POINTS TO NEXT SCB ON   0407 01122000
*                                      QUEUE                         */ 01123000
         MVC   TCBSTABB(3,TCBPTR),SCBCHAIN+1(R2)                   0407 01124000
*     END;                                                         0408 01125000
*   ELSE                            /* THE SCB TO CANCEL IS NOT THE     01126000
*                                      LAST ONE ON THE QUEUE-IN ORDER   01127000
*                                      TO DEQUEUE THE SCB A SEARCH OF   01128000
*                                      THE QUEUE MUST BE MADE TO FIND   01129000
*                                      THE SCB THAT POINTS TO THE SCB   01130000
*                                      TO CANCEL                     */ 01131000
*     DO;                                                          0409 01132000
         B     @RC00405                                            0409 01133000
@RF00405 DS    0H                                                  0410 01134000
*       R3=TCBSTAB;                 /* REG 3 IS USED TO ADDRESS THE     01135000
*                                      PREVIOUS SCB                  */ 01136000
         L     R3,TCBSTAB(,TCBPTR)                                 0410 01137000
*       DO WHILE(R3->SCBCHAIN^=R2); /* DOES THIS SCB POINT TO THE SCB   01138000
*                                      TO CANCEL ?                   */ 01139000
         B     @DE00411                                            0411 01140000
@DL00411 DS    0H                                                  0412 01141000
*         R3=R3->SCBCHAIN;          /* NO-GET NEXT SCB ADDRESS       */ 01142000
         L     R3,SCBCHAIN(,R3)                                    0412 01143000
*       END;                        /* END OF DO WHILE               */ 01144000
@DE00411 C     R2,SCBCHAIN(,R3)                                    0413 01145000
         BNE   @DL00411                                            0413 01146000
*       R3->SCBCHAIN=SCBCHAIN;      /* DEQUEUE SCB TO CANCEL         */ 01147000
         L     @12,SCBCHAIN(,R2)                                   0414 01148000
         ST    @12,SCBCHAIN(,R3)                                   0414 01149000
*     END;                                                         0415 01150000
*   RBSECPTR=SCBOWNR;               /* SAVE OWNING RB        @Z40FPXA*/ 01151000
*                                                                  0416 01152000
@RC00405 L     RBSECPTR,SCBOWNR(,R2)                               0416 01153000
*   /*****************************************************************/ 01154000
*   /*                                                               */ 01155000
*   /* DETERMINE IF THE INVOKING RB OWNS ANY MORE SCBS               */ 01156000
*   /*                                                               */ 01157000
*   /*****************************************************************/ 01158000
*                                                                  0417 01159000
*   IF TCBSTABB=0|TCBSTABB->SCBOWNRA^=R2->SCBOWNRA/* THE LAST ONE ON    01160000
*                                      QUEUE OWNED ALSO?             */ 01161000
*     THEN                          /* NO                            */ 01162000
         L     @12,TCBSTABB-1(,TCBPTR)                             0417 01163000
         LA    @12,0(,@12)                                         0417 01164000
         LTR   @12,@12                                             0417 01165000
         BZ    @RT00417                                            0417 01166000
         CLC   SCBOWNRA(3,@12),SCBOWNRA(R2)                        0417 01167000
         BE    @RF00417                                            0417 01168000
@RT00417 DS    0H                                                  0418 01169000
*     DO;                                                          0418 01170000
*       RBSCB='0'B;                 /* INDICATE THAT THE INVOKER DOES   01171000
*                                      NOT OWN AN SCB                */ 01172000
         LR    @12,RBSECPTR                                        0419 01173000
         AL    @12,@CF02220                                        0419 01174000
         NI    RBSCB-56(@12),B'11111101'                           0419 01175000
*     END;                                                         0420 01176000
*                                                                  0420 01177000
*   /*****************************************************************/ 01178000
*   /*                                                               */ 01179000
*   /* SAVE THE SCB CELL FOR USE ON THE NEXT STAE ENTRY, PLACE ON    */ 01180000
*   /* FREE SCB QUEUE                                                */ 01181000
*   /*                                                               */ 01182000
*   /*****************************************************************/ 01183000
*                                                                  0421 01184000
*   IF R2->SCBBRNTR='0'B THEN       /* IF SCB NOT IN SVRB    @ZA15748*/ 01185000
@RF00417 TM    SCBBRNTR(R2),B'00000100'                            0421 01186000
         BNZ   @RF00421                                            0421 01187000
*     DO;                           /*                       @ZA15748*/ 01188000
*RESTLP:                                                           0423 01189000
*       R3=FREESCBQ;                /* TOP OF QUEUE CHAIN    @Z40FPXA*/ 01190000
RESTLP   L     R3,FREESCBQ(,R7)                                    0423 01191000
*       SCBCHAIN=R3;                /* MAINTAIN QUEUE        @Z40FPXA*/ 01192000
         ST    R3,SCBCHAIN(,R2)                                    0424 01193000
*       CS(R3,R2,FREESCBQ);         /* ADD CELL TO FREE QUEUE      0425 01194000
*                                                            @Z40FPXA*/ 01195000
         CS    R3,@02,FREESCBQ(R7)                                 0425 01196000
*       BC(7,RESTLP);               /* RETRY IF UNSUCESSFUL  @Z40FPXA*/ 01197000
         BC    7,RESTLP                                            0426 01198000
*     END;                          /*                       @ZA15748*/ 01199000
*   ELSE                            /* IF SCB IN SVRB        @ZA15748*/ 01200000
*     R2->SCB(1:13)=''B;            /* JUST CLEAR IT         @ZA15748*/ 01201000
         B     @RC00421                                            0428 01202000
@RF00421 XC    SCB(13,R2),SCB(R2)                                  0428 01203000
*   RETURN;                                                        0429 01204000
@EL00005 DS    0H                                                  0429 01205000
@EF00005 DS    0H                                                  0429 01206000
@ER00005 BR    @14                                                 0429 01207000
*   END CANCEL;                                                    0430 01208000
         B     @EL00005                                            0430 01209000
*OVERLAY:                                                          0431 01210000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0431 01211000
*                                                                  0431 01212000
OVERLAY  DS    0H                                                  0432 01213000
*   /*****************************************************************/ 01214000
*   /*                                                               */ 01215000
*   /* THIS ROUTINE REPLACES THE LAST VALID SCB CREATED FOR THE      */ 01216000
*   /* INVOKER IT IS IN EFFECT A CREATE REQUEST EXCEPT THAT AN       */ 01217000
*   /* EXISTING SCB IS REUSED                                        */ 01218000
*   /*                                                               */ 01219000
*   /*****************************************************************/ 01220000
*                                                                  0432 01221000
*   IF SCBBRNTR='1'B                /* IS THE SCB TO BE REPLACED IN     01222000
*                                      THE BRANCH AREA OF AN SVRB    */ 01223000
*     THEN                          /* YES                           */ 01224000
         TM    SCBBRNTR(R2),B'00000100'                            0432 01225000
         BNO   @RF00432                                            0432 01226000
*     DO;                                                          0433 01227000
*       FESTAFLG='1'B;              /* SET BRANCH ENTRY FLAG @Z40FPXA*/ 01228000
         OI    FESTAFLG(R9),B'10000000'                            0434 01229000
*     END;                                                         0435 01230000
*   SCBCLEAR=''B;                   /* ZERO OUT SCB EXCEPT CHAIN FLD    01231000
*                                                            @Z30EPXA*/ 01232000
@RF00432 XC    SCBCLEAR(5,R2),SCBCLEAR(R2)                         0436 01233000
*   WORK1=R14;                      /* SAVE RETURN ADDRESS   @Z40FPXA*/ 01234000
         ST    R14,WORK1(,R9)                                      0437 01235000
*   CALL COMPLSCB;                  /* GO COMPLETE SCB       @Z40FPXA*/ 01236000
         BAL   @14,COMPLSCB                                        0438 01237000
*   IF FESTAFLG='1'B                /* WAS IT FAST ESTAE?    @Z40FPXA*/ 01238000
*     THEN                                                         0439 01239000
         TM    FESTAFLG(R9),B'10000000'                            0439 01240000
         BNO   @RF00439                                            0439 01241000
*     DO;                                                          0440 01242000
*       SCBBRNTR='1'B;              /* RESTORE BRANCH AREA INDICATOR */ 01243000
         OI    SCBBRNTR(R2),B'00000100'                            0441 01244000
*     END;                                                         0442 01245000
*   R14=WORK1;                      /* RESTORE RETURN ADDRESS        */ 01246000
@RF00439 L     R14,WORK1(,R9)                                      0443 01247000
*   RETURN;                         /* RETURN                        */ 01248000
@EL00006 DS    0H                                                  0444 01249000
@EF00006 DS    0H                                                  0444 01250000
@ER00006 BR    @14                                                 0444 01251000
*   END OVERLAY;                                                   0445 01252000
*CREATE:                                                           0446 01253000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0446 01254000
*                                                                  0446 01255000
CREATE   DS    0H                                                  0447 01256000
*   /*****************************************************************/ 01257000
*   /*                                                               */ 01258000
*   /* THIS ROUTINE IS ENTERED TO CREATE AND ENQUEUE AN SCB OBTAINED */ 01259000
*   /* FROM THE FREESCB QUEUE IN SP 255. IF THE REQUEST IS FOR STAI  */ 01260000
*   /* OR ESTAI CONTROL IS THEN ROUTED TO THE PROPA ROUTINE REGISTERS*/ 01261000
*   /* UPON ENTRY 1- ADDRESS OF PARAMETER LIST 4- CURRENT TCB ADDRESS*/ 01262000
*   /* 5- CURRENT RB ADDRESS 14- RETURN ADDRESS                      */ 01263000
*   /*                                                               */ 01264000
*   /*****************************************************************/ 01265000
*                                                                  0447 01266000
*   WORK1=R14;                      /* SAVE RETURN ADDRESS           */ 01267000
         ST    R14,WORK1(,R9)                                      0447 01268000
*   DO;                                                            0448 01269000
*                                                                  0448 01270000
*     /***************************************************************/ 01271000
*     /*                                                             */ 01272000
*     /* CHECK FOR FREE SCB TO USE                                   */ 01273000
*     /*                                                             */ 01274000
*     /***************************************************************/ 01275000
*                                                                  0449 01276000
*TRYA:                                                             0449 01277000
*     R2=FREESCBQ;                                                 0449 01278000
TRYA     L     R2,FREESCBQ(,R7)                                    0449 01279000
*     IF R2=0 THEN                  /* FREE SCB?             @Z30EPXA*/ 01280000
         LTR   R2,R2                                               0450 01281000
         BNZ   @RF00450                                            0450 01282000
*       DO;                                                        0451 01283000
*         CALL GETSTOR;             /* GET STORAGE FOR SCB   @Z30EPXA*/ 01284000
         BAL   @14,GETSTOR                                         0452 01285000
*         GOTO TRYA;                /* RETRY CELL OBTAIN     @Z40FPXA*/ 01286000
         B     TRYA                                                0453 01287000
*       END;                                                       0454 01288000
*     R3=SCBCHAIN;                  /* PICK UP LINK FIELD    @Z40FPXA*/ 01289000
@RF00450 L     R3,SCBCHAIN(,R2)                                    0455 01290000
*     CS(R2,R3,FREESCBQ);           /* DEQUEUE FROM CHAIN    @Z40FPXA*/ 01291000
         CS    R2,@03,FREESCBQ(R7)                                 0456 01292000
*     BC(7,TRYA);                   /* GO TRY OBTAIN AGAIN   @Z40FPXA*/ 01293000
         BC    7,TRYA                                              0457 01294000
*   END;                                                           0458 01295000
*   DO;                                                            0459 01296000
*     SCBFLGS2=0;                   /* CLEAR FLAG BYTE IN SCB      0460 01297000
*                                                            @Z40FPXA*/ 01298000
         MVI   SCBFLGS2(R2),X'00'                                  0460 01299000
*     CALL COMPLSCB;                /* BUILD COMMON SECTION OF SCB   */ 01300000
         BAL   @14,COMPLSCB                                        0461 01301000
*     DO;                                                          0462 01302000
*       IF ESTASTAI='1'B            /* STAI OR ESTAI ?               */ 01303000
*         THEN                      /* YES                           */ 01304000
         TM    ESTASTAI(R1),B'10000000'                            0463 01305000
         BNO   @RF00463                                            0463 01306000
*         DO;                                                      0464 01307000
*           SCBCHAIN=0;             /* CLEAR LINK FIELD      @Z40FPXA*/ 01308000
         SLR   @12,@12                                             0465 01309000
         ST    @12,SCBCHAIN(,R2)                                   0465 01310000
*           SCBOWNRA=TCBPTR;        /* THE CURRENT TCB IS OWNER      */ 01311000
         STCM  TCBPTR,7,SCBOWNRA(R2)                               0466 01312000
*           ESTAOWNR->TCBSTABB=R2;  /* ENQUEUE ON NEW TCB            */ 01313000
         L     @12,ESTAOWNR(,R1)                                   0467 01314000
         STCM  R2,7,TCBSTABB(@12)                                  0467 01315000
*           CALL PROPA;             /* COPY MOMS SCB Q               */ 01316000
         BAL   @14,PROPA                                           0468 01317000
*         END;                                                     0469 01318000
*       ELSE                                                       0470 01319000
*         DO;                                                      0470 01320000
         B     @RC00463                                            0470 01321000
@RF00463 DS    0H                                                  0471 01322000
*           IF ESTASTAR='0'B        /* ESTAR REQUEST                 */ 01323000
*             THEN                  /* NO                            */ 01324000
         TM    ESTASTAR(R1),B'01000000'                            0471 01325000
         BNZ   @RF00471                                            0471 01326000
*             DO;                   /* SET OWNER ADDRESS             */ 01327000
*               RBSECPTR=RBLINK;                                   0473 01328000
         L     RBSECPTR,RBLINK(,RBSECPTR)                          0473 01329000
*               SCBOWNRA=RBSECPTR;                                 0474 01330000
         STCM  RBSECPTR,7,SCBOWNRA(R2)                             0474 01331000
*               RBSCB='1'B;                                        0475 01332000
         LR    @12,RBSECPTR                                        0475 01333000
         AL    @12,@CF02220                                        0475 01334000
         OI    RBSCB-56(@12),B'00000010'                           0475 01335000
*             END;                                                 0476 01336000
*           ELSE                    /* CLEAR SCBOWNRA FIELD FOR ESTAR   01337000
*                                                            @Z40FPXA*/ 01338000
*             SCBOWNRA=0;           /* CLEAR FIELD           @Z40FPXA*/ 01339000
         B     @RC00471                                            0477 01340000
@RF00471 SLR   @12,@12                                             0477 01341000
         STCM  @12,7,SCBOWNRA(R2)                                  0477 01342000
*           SCBCHAIN=TCBSTABB;      /* POINT TO NEXT SCB             */ 01343000
@RC00471 L     @12,TCBSTABB-1(,TCBPTR)                             0478 01344000
         LA    @12,0(,@12)                                         0478 01345000
         ST    @12,SCBCHAIN(,R2)                                   0478 01346000
*           TCBSTABB=R2;            /* PLACE SCB ON QUEUE            */ 01347000
         STCM  R2,7,TCBSTABB(TCBPTR)                               0479 01348000
*         END;                                                     0480 01349000
*     END;                                                         0481 01350000
@RC00463 DS    0H                                                  0482 01351000
*   END;                                                           0482 01352000
*CREATEXT:                                                         0483 01353000
*   R14=WORK1;                      /* RESTORE REG 14        @Z30EPXA*/ 01354000
CREATEXT L     R14,WORK1(,R9)                                      0483 01355000
*   RETURN;                                                        0484 01356000
@EL00007 DS    0H                                                  0484 01357000
@EF00007 DS    0H                                                  0484 01358000
@ER00007 BR    @14                                                 0484 01359000
*   END CREATE;                                                    0485 01360000
*COMPLSCB:                                                         0486 01361000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0486 01362000
*                                                                  0486 01363000
COMPLSCB DS    0H                                                  0487 01364000
*   /*****************************************************************/ 01365000
*   /*                                                               */ 01366000
*   /* THIS ROUTINE OBTAINS THE KEY AND STATE OF THE INVOKER FOR THIS*/ 01367000
*   /* REQUEST-IF SVC 60 IS BRANCH ENTERED THE INVOKER IS IN KEY 0   */ 01368000
*   /* SUPERVISOR STATE. FOR SVC ENTRY THE KEY AND STATE ARE OBTAINED*/ 01369000
*   /* FROM THE RBOPSW FIELD FROM THE INVOKING RB                    */ 01370000
*   /*                                                               */ 01371000
*   /*****************************************************************/ 01372000
*                                                                  0487 01373000
*   IF ESTAESTA='1'B THEN           /* IF ESTA REQUEST THEN  @ZA15766*/ 01374000
         TM    ESTAESTA(R1),B'00010000'                            0487 01375000
         BNO   @RF00487                                            0487 01376000
*     SCBFLGS3=ESTAFLG2;            /* COPY FLAGS FROM ESTA PARM LIST   01377000
*                                                            @Z40FPXA*/ 01378000
         MVC   SCBFLGS3(1,R2),ESTAFLG2(R1)                         0488 01379000
*   ELSE                            /* IF STA REQUEST THEN   @ZA15766*/ 01380000
*     SCBFLGS3=''B;                 /* SET ESTA FLAGS TO ZERO      0489 01381000
*                                                            @ZA15766*/ 01382000
         B     @RC00487                                            0489 01383000
@RF00487 MVI   SCBFLGS3(R2),X'00'                                  0489 01384000
*   IF BRENTFLG='1'B                /* BRANCH ENTERED?       @Z40FPXA*/ 01385000
*     THEN                          /* YES                           */ 01386000
@RC00487 TM    BRENTFLG(R9),B'00000100'                            0490 01387000
         BNO   @RF00490                                            0490 01388000
*     DO;                                                          0491 01389000
*       SCBKEY0='1'B;               /* INDICATE CONTROL PROGRAM KEY  */ 01390000
*       SCBSUPER='1'B;              /* INDICATE SUPERVISOR STATE     */ 01391000
         OI    SCBKEY0(R2),B'00000011'                             0493 01392000
*       SCBPKEY='00'X;              /* KEY VALUE IS ZERO             */ 01393000
         MVI   SCBPKEY(R2),X'00'                                   0494 01394000
*     END;                                                         0495 01395000
*   ELSE                            /* SVC ENTERED                   */ 01396000
*     DO;                                                          0496 01397000
         B     @RC00490                                            0496 01398000
@RF00490 DS    0H                                                  0497 01399000
*       IF ESTASTAI='1'B            /* FOR STAI OR ESTAI THE INVOKER    01400000
*                                      IS THE THIRD RB ON THE QUEUE  */ 01401000
*         THEN                                                     0497 01402000
         TM    ESTASTAI(R1),B'10000000'                            0497 01403000
         BNO   @RF00497                                            0497 01404000
*         DO;                                                      0498 01405000
*           R3=RBLINK->RBLINK;      /* OBTAIN INVOKERS RB ADD      0499 01406000
*                                                            @Z40FPXA*/ 01407000
         L     @12,RBLINK(,RBSECPTR)                               0499 01408000
         L     R3,RBLINK(,@12)                                     0499 01409000
*         END;                                                     0500 01410000
*       ELSE                        /* NOT STAI OR ESTAI SO USE THE     01411000
*                                      SECOND RB                     */ 01412000
*         DO;                                                      0501 01413000
         B     @RC00497                                            0501 01414000
@RF00497 DS    0H                                                  0502 01415000
*           R3=RBLINK;              /* RB ADD                @Z40FPXA*/ 01416000
         L     R3,RBLINK(,RBSECPTR)                                0502 01417000
*         END;                                                     0503 01418000
*       MVZ(SCBPKEY,R3->KEYWMP);    /* PLACE KEY IN SCB FIELD      0504 01419000
*                                                            @Z40FPXA*/ 01420000
@RC00497 MVZ   SCBPKEY(1,R2),KEYWMP(R3)                            0504 01421000
*       SCBPKEY=SCBPKEY&'F0'X;      /* CLEAR UNUSED BYTE     @Z40FPXA*/ 01422000
         NI    SCBPKEY(R2),X'F0'                                   0505 01423000
*       IF SCBPKEY<'80'X            /* IS THE KEY 0-7 ?              */ 01424000
*         THEN                      /* YES                           */ 01425000
         CLI   SCBPKEY(R2),X'80'                                   0506 01426000
         BNL   @RF00506                                            0506 01427000
*         DO;                                                      0507 01428000
*           SCBKEY0='1'B;           /* INDICATE CONTROL PROGRAM KEY  */ 01429000
         OI    SCBKEY0(R2),B'00000010'                             0508 01430000
*         END;                                                     0509 01431000
*       IF R3->PPMODE^='1'B         /* PROBLEM PROGRM MODE?  @Z40FPXA*/ 01432000
*         THEN                      /* YES                           */ 01433000
@RF00506 TM    PPMODE(R3),B'00000001'                              0510 01434000
         BO    @RF00510                                            0510 01435000
*         DO;                                                      0511 01436000
*           SCBSUPER='1'B;          /* INDICATE SUPERVISOR STATE     */ 01437000
         OI    SCBSUPER(R2),B'00000001'                            0512 01438000
*         END;                                                     0513 01439000
*     END;                                                         0514 01440000
*                                                                  0514 01441000
*   /*****************************************************************/ 01442000
*   /*                                                               */ 01443000
*   /* THIS ROUTINE COMPLETES THE COMMON CREATE AND OVERLAY          */ 01444000
*   /* PROCESSING BY INITIALIZING THE REMAINING SCB FIELDS           */ 01445000
*   /*                                                               */ 01446000
*   /*****************************************************************/ 01447000
*                                                                  0515 01448000
*FINSCB:                                                           0515 01449000
*   ENTRY;                                                         0515 01450000
         B     @EC00515                                            0515 01451000
FINSCB   DS    0H                                                  0515 01452000
@EC00515 DS    0H                                                  0516 01453000
*   SCBEXIT=0;                      /* ZERO HIGH ORDER BYTE OF     0516 01454000
*                                      SCBEXIT               @ZA15390*/ 01455000
         SLR   @12,@12                                             0516 01456000
         ST    @12,SCBEXIT(,R2)                                    0516 01457000
*   SCBFLDS=ESTAFLDS;               /* MOVE PARMS INTO SCB   @Z40FPXA*/ 01458000
         MVC   SCBFLDS(7,R2),ESTAFLDS(R1)                          0517 01459000
*   SCBFLGS1=ESTAFLG1;              /* BUILD SCB FLAG 1              */ 01460000
         MVC   SCBFLGS1(1,R2),ESTAFLG1(R1)                         0518 01461000
*   IF XCTLIN<0                     /* WAS XCTL =YES SPECIFIED       */ 01462000
*     THEN                          /* YES                           */ 01463000
         CR    XCTLIN,@12                                          0519 01464000
         BNL   @RF00519                                            0519 01465000
*     DO;                                                          0520 01466000
*       SCBXCTL2='1'B;              /* INDICATE XCTL OPTION          */ 01467000
         OI    SCBXCTL2(R2),B'01000000'                            0521 01468000
*     END;                                                         0522 01469000
*   IF TCBETERM='1'B                /* IS A SPECIAL TERM EXIT IN   0523 01470000
*                                      PROGRESS VIA RTM2             */ 01471000
*     THEN                          /* YES                           */ 01472000
@RF00519 TM    TCBETERM(TCBPTR),B'10000000'                        0523 01473000
         BNO   @RF00523                                            0523 01474000
*     DO;                                                          0524 01475000
*       SCBTERMI='0'B;              /* THEN IN ORDER TO PREVENT    0525 01476000
*                                      LOOPING IN AN INDEFINITE    0525 01477000
*                                      NUMBER OF SPECIAL TERM EXITS     01478000
*                                      THE TERM OPTION IS NOT ALLOWED*/ 01479000
         NI    SCBTERMI(R2),B'10111111'                            0525 01480000
*     END;                                                         0526 01481000
*   SCBID='DB'X;                    /* SET SCB IDENTIFIER            */ 01482000
@RF00523 MVI   SCBID(R2),X'DB'                                     0527 01483000
*   SCBBRNTR='0'B;                  /* RESET FAST ESTAE FLAG IN SCB     01484000
*                                                            @Z40FPXA*/ 01485000
         NI    SCBBRNTR(R2),B'11111011'                            0528 01486000
*   RETURN;                                                        0529 01487000
@EL00008 DS    0H                                                  0529 01488000
@EF00008 DS    0H                                                  0529 01489000
@ER00008 BR    @14                                                 0529 01490000
*   END COMPLSCB;                                                  0530 01491000
*PROPA:                                                            0531 01492000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0531 01493000
*                                                                  0531 01494000
PROPA    DS    0H                                                  0532 01495000
*   /*****************************************************************/ 01496000
*   /*                                                               */ 01497000
*   /* PROPA IS ENTERED TO COPY ALL STAI AND ESTAI SCBS FROM THE TCB */ 01498000
*   /* THAT HAS REQUESTED ATTACH TO THE NEW TCB BEING CREATED BY THE */ 01499000
*   /* ATTACH FUNCTION                                               */ 01500000
*   /*                                                               */ 01501000
*   /*****************************************************************/ 01502000
*                                                                  0532 01503000
*   WORK2=R14;                      /* SAVE RETURN ADDRESS           */ 01504000
         ST    R14,WORK2(,R9)                                      0532 01505000
*   RESPECIFY                                                      0533 01506000
*    (R5) RSTD;                                                    0533 01507000
*   R2=TCBSTABB;                    /* START AT THE TOP OF THE SCB Q */ 01508000
         L     R2,TCBSTABB-1(,TCBPTR)                              0534 01509000
         LA    R2,0(,R2)                                           0534 01510000
*   R5=0;                           /*                       @Z30EPXA*/ 01511000
         SLR   R5,R5                                               0535 01512000
*   DO WHILE(R2^=0&R5=0);           /* FIND FIRST STAI SCB   @Z40FPXA*/ 01513000
         B     @DE00536                                            0536 01514000
@DL00536 DS    0H                                                  0537 01515000
*     IF SCBID^='DB'X               /* IS IT AN SCB ?                */ 01516000
*       THEN                        /* NO                            */ 01517000
         CLI   SCBID(R2),X'DB'                                     0537 01518000
         BE    @RF00537                                            0537 01519000
*       DO;                         /* TRUNCATE THE SCB QUEUE        */ 01520000
*         R2=0;                                                    0539 01521000
         SLR   R2,R2                                               0539 01522000
*         R5=0;                     /*                       @Z30EPXA*/ 01523000
         SLR   R5,R5                                               0540 01524000
*         GOTO RETCODC;                                            0541 01525000
         B     RETCODC                                             0541 01526000
*       END;                                                       0542 01527000
*     ELSE                                                         0543 01528000
*       DO;                                                        0543 01529000
@RF00537 DS    0H                                                  0544 01530000
*         IF SCBSTAI='1'B           /* IS THIS A STAI OR ESTAI TYPE     01531000
*                                      SCB                           */ 01532000
*           THEN                    /* YES-                          */ 01533000
         TM    SCBSTAI(R2),B'10000000'                             0544 01534000
         BNO   @RF00544                                            0544 01535000
*           R5=R2;                  /*                       @Z30EPXA*/ 01536000
         LR    R5,R2                                               0545 01537000
*         R2=SCBCHAIN;              /* ADDRESS OF NEXT SCB           */ 01538000
@RF00544 L     R2,SCBCHAIN(,R2)                                    0546 01539000
*       END;                                                       0547 01540000
*   END;                                                           0548 01541000
@DE00536 SLR   @12,@12                                             0548 01542000
         CR    R2,@12                                              0548 01543000
         BE    @DC00536                                            0548 01544000
         CR    R5,@12                                              0548 01545000
         BE    @DL00536                                            0548 01546000
@DC00536 DS    0H                                                  0549 01547000
*   IF R5=0                         /* ANY SCB TO COPY               */ 01548000
*     THEN                                                         0549 01549000
         LTR   R5,R5                                               0549 01550000
         BZ    @RT00549                                            0549 01551000
*     ;                             /* NO- BYPASS PROCESS            */ 01552000
*   ELSE                            /* YES- OBTAIN STORAGE           */ 01553000
*     DO;                                                          0551 01554000
*                                                                  0551 01555000
*       /*************************************************************/ 01556000
*       /*                                                           */ 01557000
*       /* CHECK IF FREE SCB CAN BE USED. IF NOT OBTAIN MORE SCB'S   */ 01558000
*       /*                                                           */ 01559000
*       /*************************************************************/ 01560000
*                                                                  0552 01561000
*TRYA1:                                                            0552 01562000
*       R2=FREESCBQ;                                               0552 01563000
TRYA1    L     R2,FREESCBQ(,R7)                                    0552 01564000
*       IF R2=0 THEN                /* FREE Q EMPTY?         @Z30EPXA*/ 01565000
         LTR   R2,R2                                               0553 01566000
         BNZ   @RF00553                                            0553 01567000
*         DO;                                                      0554 01568000
*           CALL GETSTOR;           /* OBTAIN SCB'S          @Z30EPXA*/ 01569000
         BAL   @14,GETSTOR                                         0555 01570000
*           GOTO TRYA1;             /* GO RETRY CELL OBTAIN  @Z40FPXA*/ 01571000
         B     TRYA1                                               0556 01572000
*         END;                                                     0557 01573000
*                                                                  0557 01574000
*       /*************************************************************/ 01575000
*       /*                                                           */ 01576000
*       /* PICK UP ADDRESS OF FREE SCB                               */ 01577000
*       /*                                                           */ 01578000
*       /*************************************************************/ 01579000
*                                                                  0558 01580000
*       R3=SCBCHAIN;                /* PICK UP CHAIN FIELD   @Z40FPXA*/ 01581000
@RF00553 L     R3,SCBCHAIN(,R2)                                    0558 01582000
*       CS(R2,R3,FREESCBQ);         /* DEQUEUE ELEMENT       @Z40FPXA*/ 01583000
         CS    R2,@03,FREESCBQ(R7)                                 0559 01584000
*       BC(7,TRYA1);                /* RETRY IF UNSUCCESSFUL @Z40FPXA*/ 01585000
*                                                                  0560 01586000
         BC    7,TRYA1                                             0560 01587000
*       /*************************************************************/ 01588000
*       /*                                                           */ 01589000
*       /* NOW LOOK AT NEW TCB BEING PROP TO                         */ 01590000
*       /*                                                           */ 01591000
*       /*************************************************************/ 01592000
*                                                                  0561 01593000
*       IF ESTAOWNR->TCBSTABB=0     /* WAS AN SCB CREATED ON THE TCB */ 01594000
*         THEN                      /* NO                            */ 01595000
         L     @12,ESTAOWNR(,R1)                                   0561 01596000
         L     @11,TCBSTABB-1(,@12)                                0561 01597000
         LA    @11,0(,@11)                                         0561 01598000
         LTR   @11,@11                                             0561 01599000
         BNZ   @RF00561                                            0561 01600000
*         ESTAOWNR->TCBSTABB=R2;    /* ENQUEUE ON THE TCB            */ 01601000
         STCM  R2,7,TCBSTABB(@12)                                  0562 01602000
*       ELSE                                                       0563 01603000
*         ESTAOWNR->TCBSTAB->SCBCHAIN=R2;/* ENQUEUE AS SECOND SCB    */ 01604000
         B     @RC00561                                            0563 01605000
@RF00561 L     @12,ESTAOWNR(,R1)                                   0563 01606000
         L     @12,TCBSTAB(,@12)                                   0563 01607000
         ST    R2,SCBCHAIN(,@12)                                   0563 01608000
*       DO WHILE(R5^=0);            /* COPY ALL STAI AND ESTAI SCBS     01609000
*                                      FROM MOMS QUEUE       @Z30EPXA*/ 01610000
@RC00561 B     @DE00564                                            0564 01611000
@DL00564 DS    0H                                                  0565 01612000
*         SCB=R5->SCB;              /* COPY THE SCB          @Z30EPXA*/ 01613000
         MVC   SCB(20,R2),SCB(R5)                                  0565 01614000
*         R5=R5->SCBCHAIN;          /* GET NEXT SCB ON MOTHER TCB  0566 01615000
*                                                            @Z30EPXA*/ 01616000
         L     R5,SCBCHAIN(,R5)                                    0566 01617000
*         IF R5=0                   /* LAST ONE COPIED ?     @Z30EPXA*/ 01618000
*           THEN                                                   0567 01619000
         LTR   R5,R5                                               0567 01620000
         BZ    @RT00567                                            0567 01621000
*           ;                       /* YES-BYPASS CHAIN UPDATING     */ 01622000
*         ELSE                                                     0569 01623000
*           DO;                                                    0569 01624000
*                                                                  0569 01625000
*             /*******************************************************/ 01626000
*             /*                                                     */ 01627000
*             /* CHECK IF FREE SCB CAN BE USED. IF NOT OBTAIN NEW    */ 01628000
*             /* SCB'S                                               */ 01629000
*             /*                                                     */ 01630000
*             /*******************************************************/ 01631000
*                                                                  0570 01632000
*TRY2:                                                             0570 01633000
*             R3=FREESCBQ;                                         0570 01634000
TRY2     L     R3,FREESCBQ(,R7)                                    0570 01635000
*             IF R3=0 THEN          /* FREE QUE EMPTY?       @Z30EPXA*/ 01636000
         LTR   R3,R3                                               0571 01637000
         BNZ   @RF00571                                            0571 01638000
*               DO;                                                0572 01639000
*                 CALL GETSTOR;     /* GET NEW SCB'S         @Z30EPXA*/ 01640000
         BAL   @14,GETSTOR                                         0573 01641000
*                 GOTO TRY2;        /* RETRY CELL OBTAIN     @Z40FPXA*/ 01642000
         B     TRY2                                                0574 01643000
*               END;                                               0575 01644000
*             R13=R3->SCBCHAIN;     /* CHAIN FIELD           @Z40FPXA*/ 01645000
@RF00571 L     R13,SCBCHAIN(,R3)                                   0576 01646000
*             CS(R3,R13,FREESCBQ);  /* DEQUEUE FROM CHAIN    @Z40FPXA*/ 01647000
         CS    R3,@13,FREESCBQ(R7)                                 0577 01648000
*             BC(7,TRY2);           /* TRY AGAIN             @Z40FPXA*/ 01649000
         BC    7,TRY2                                              0578 01650000
*             SCBCHAIN=R3;          /* UPDATE CHAIN POINTERS @Z30EPXA*/ 01651000
         ST    R3,SCBCHAIN(,R2)                                    0579 01652000
*             R2=R3;                /* UPDATE SCB POINTER    @Z30EPXA*/ 01653000
         LR    R2,R3                                               0580 01654000
*           END;                                                   0581 01655000
*       END;                                                       0582 01656000
@RT00567 DS    0H                                                  0582 01657000
@DE00564 LTR   R5,R5                                               0582 01658000
         BNZ   @DL00564                                            0582 01659000
*     END;                                                         0583 01660000
*EXITPROP:                                                         0584 01661000
*   R14=WORK2;                      /* RESTORE RETURN ADDR   @Z30EPXA*/ 01662000
@RT00549 DS    0H                                                  0584 01663000
EXITPROP L     R14,WORK2(,R9)                                      0584 01664000
*   R5=TCBRBP;                      /* RESTORE RB POINTER    @Z40FPXA*/ 01665000
         L     R5,TCBRBP(,TCBPTR)                                  0585 01666000
*   RETURN;                                                        0586 01667000
@EL00009 DS    0H                                                  0586 01668000
@EF00009 DS    0H                                                  0586 01669000
@ER00009 BR    @14                                                 0586 01670000
*   END PROPA;                                                     0587 01671000
*GETSTOR:                                                          0588 01672000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/*                       @Z30EPXH*/ 01673000
GETSTOR  DS    0H                                                  0589 01674000
*   RFY                                                            0589 01675000
*    (R1,                                                          0589 01676000
*     R6) RSTD;                     /* RESTRICT REGS         @Z40FPXA*/ 01677000
*   R6=R14;                         /* SAVE RETURN ADDRESS   @Z40FPXA*/ 01678000
         LR    R6,R14                                              0590 01679000
*   R8=0;                           /* CLEAR FLAG REGISTER   @Z40FPXA*/ 01680000
*                                                                  0591 01681000
         SLR   R8,R8                                               0591 01682000
*   /*****************************************************************/ 01683000
*   /*                                                               */ 01684000
*   /* CHECK IF LOCAL LOCK IS CURRENTLY HELD, IF SO SKIP OBTAIN AND  */ 01685000
*   /* DO GETMAIN DIRECTLY                                           */ 01686000
*   /*                                                               */ 01687000
*   /*****************************************************************/ 01688000
*                                                                  0592 01689000
*   GEN(SETLOCK TEST,TYPE=LOCAL,BRANCH=(NOTHELD,GETLOCK));/* @Z40FPXA*/ 01690000
*                                                                  0592 01691000
         SETLOCK TEST,TYPE=LOCAL,BRANCH=(NOTHELD,GETLOCK)               01692000
*   /*****************************************************************/ 01693000
*   /*                                                               */ 01694000
*   /* LOCK IS HELD, GET STORAGE FOR 4 CELLS                         */ 01695000
*   /*                                                               */ 01696000
*   /*****************************************************************/ 01697000
*                                                                  0593 01698000
*   R8=1;                           /* SET LOCK HELD FLAG    @Z40FPXA*/ 01699000
         LA    R8,1                                                0593 01700000
*   GOTO HAVELOCK;                  /* GO OBTAIN STORAGE     @Z40FPXA*/ 01701000
*                                                                  0594 01702000
         B     HAVELOCK                                            0594 01703000
*   /*****************************************************************/ 01704000
*   /*                                                               */ 01705000
*   /* LOCK WAS NOT HELD, OBTAIN LOCAL LOCK, THEN DO GETMAIN         */ 01706000
*   /*                                                               */ 01707000
*   /*****************************************************************/ 01708000
*                                                                  0595 01709000
*GETLOCK:                                                          0595 01710000
*   R15=R13;                        /* SAVE SAVE AREA PTR    @Z40FPXA*/ 01711000
GETLOCK  LR    R15,R13                                             0595 01712000
*   GEN(SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,RELATED=(YES));/*    0596 01713000
*                                                            @Z40FPXA*/ 01714000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,RELATED=(YES)            01715000
*   R13=R15;                        /* RESTORE SAVE AREA PTR @Z40FPXA*/ 01716000
*                                                                  0597 01717000
         LR    R13,R15                                             0597 01718000
*   /*****************************************************************/ 01719000
*   /*                                                               */ 01720000
*   /* LOCAL LOCK HAS BEEN OBTAINED, OBTAIN 4 CELLS AND ADD TO LOCAL */ 01721000
*   /* FREESCB QUEUE                                                 */ 01722000
*   /*                                                               */ 01723000
*   /*****************************************************************/ 01724000
*                                                                  0598 01725000
*HAVELOCK:                                                         0598 01726000
*   GEN(STM  0,3,SAVEREGS(7));      /* SAVE REGISTERS IN WA  @Z40FPXA*/ 01727000
HAVELOCK STM  0,3,SAVEREGS(7)                                           01728000
*   REG0=(LENGTH(SCB)*4);           /* LENGTH OF FOUR SCB'S  @Z30EPXH*/ 01729000
         LA    REG0,80                                             0599 01730000
*   R7=ASCBPTR;                     /*                       @Z30EPXH*/ 01731000
         L     R7,ASCBPTR                                          0600 01732000
*   GEN(GETMAIN RC,LV=(0),SP=255,KEY=0,BRANCH=YES);/*        @Z30EPXH*/ 01733000
         GETMAIN RC,LV=(0),SP=255,KEY=0,BRANCH=YES                      01734000
*   IF R8=0 THEN                    /* NEED TO FREE LOCK?    @Z40FPXA*/ 01735000
         LTR   R8,R8                                               0602 01736000
         BNZ   @RF00602                                            0602 01737000
*     DO;                                                          0603 01738000
*       R3=R13;                     /* SAVE SAVE AREA POINTER      0604 01739000
*                                                            @Z40FPXA*/ 01740000
         LR    R3,R13                                              0604 01741000
*       GEN REFS(CVT,CVTCRMN,PSALITA,SAVEREGS)                     0605 01742000
*           (SETLOCK  RELEASE,TYPE=LOCAL,RELATED=(YES));/*   @Z40FPXA*/ 01743000
         SETLOCK  RELEASE,TYPE=LOCAL,RELATED=(YES)                      01744000
*       R13=R3;                     /* RESTORE SAVE AREA POINTER   0606 01745000
*                                                            @Z40FPXA*/ 01746000
         LR    R13,R3                                              0606 01747000
*     END;                                                         0607 01748000
*   RFY                                                            0608 01749000
*    (R14,                                                         0608 01750000
*     R15) RSTD;                                                   0608 01751000
@RF00602 DS    0H                                                  0609 01752000
*   R14=R6;                         /* RESTORE RETURN ADDR   @Z40FPXA*/ 01753000
         LR    R14,R6                                              0609 01754000
*   R7=WSALSTAE;                    /* ADDRESS OF SAVE AREA  @Z40FPXA*/ 01755000
         L     @12,ASCBPTR                                         0610 01756000
         L     @12,ASXBPTR(,@12)                                   0610 01757000
         L     @12,ASXBSPSA(,@12)                                  0610 01758000
         L     R7,WSALSTAE(,@12)                                   0610 01759000
*   IF R15=0 THEN                   /* SUCCESSFUL?           @Z30EPXH*/ 01760000
         LTR   R15,R15                                             0611 01761000
         BNZ   @RF00611                                            0611 01762000
*     DO;                           /*                       @Z30EPXH*/ 01763000
*       DO REG0=3 TO 0 BY-1;        /*                       @Z30EPXH*/ 01764000
         LA    REG0,3                                              0613 01765000
@DL00613 DS    0H                                                  0614 01766000
*BLDLOOP:                                                          0614 01767000
*         R3=FREESCBQ;              /* CURRENT ANCHOR PTR    @Z40FPXA*/ 01768000
BLDLOOP  L     R3,FREESCBQ(,R7)                                    0614 01769000
*         R1->SCBCHAIN=R3;          /* MAINTAIN CHAIN PTR    @Z40FPXA*/ 01770000
         ST    R3,SCBCHAIN(,R1)                                    0615 01771000
*         CS(R3,R1,FREESCBQ);       /* ADD TO CHAIN          @Z40FPXA*/ 01772000
         CS    R3,@01,FREESCBQ(R7)                                 0616 01773000
*         BC(7,BLDLOOP);            /* TRY AGAIN IF MISSED   @Z40FPXA*/ 01774000
         BC    7,BLDLOOP                                           0617 01775000
*         R1=R1+LENGTH(SCB);        /* UPDATE POINTER        @Z40FPXA*/ 01776000
         AL    R1,@CF00086                                         0618 01777000
*       END;                        /*                       @Z30EPXH*/ 01778000
         BCTR  REG0,0                                              0619 01779000
         LTR   REG0,REG0                                           0619 01780000
         BNM   @DL00613                                            0619 01781000
*     END;                          /*                       @Z30EPXH*/ 01782000
*   ELSE                            /*                       @Z30EPXH*/ 01783000
*                                                                  0621 01784000
*     /***************************************************************/ 01785000
*     /*                                                             */ 01786000
*     /* GETMAIN WAS NOT SUCCESSFUL SET RETURN CODE          @Z30EPXH*/ 01787000
*     /*                                                             */ 01788000
*     /***************************************************************/ 01789000
*                                                                  0621 01790000
*     DO;                           /*                       @Z30EPXH*/ 01791000
*                                                                  0621 01792000
         B     @RC00611                                            0621 01793000
@RF00611 DS    0H                                                  0622 01794000
*       /*************************************************************/ 01795000
*       /*                                                           */ 01796000
*       /* DETERMINE IF GETMAIN FAILED ATTEMPTING TO OBTAIN WORK AREA*/ 01797000
*       /* FOR BRANCH ENTRY                                          */ 01798000
*       /*                                                           */ 01799000
*       /*************************************************************/ 01800000
*                                                                  0622 01801000
*       IF R9=0 THEN                /* NO WORK AREA?         @Z40FPXA*/ 01802000
         LTR   R9,R9                                               0622 01803000
         BNZ   @RF00622                                            0622 01804000
*         DO;                                                      0623 01805000
*           R15=20;                 /* SET RET CODE 20       @Z40FPXA*/ 01806000
         LA    R15,20                                              0624 01807000
*           GOTO NOWORKA;           /* RETURN TO CALLER      @Z40FPXA*/ 01808000
         B     NOWORKA                                             0625 01809000
*         END;                                                     0626 01810000
*       GEN(LM    0,3,SAVEREGS(7)); /* RESTORE REGISTERS     @Z40FPXA*/ 01811000
@RF00622 DS    0H                                                  0627 01812000
         LM    0,3,SAVEREGS(7)                                          01813000
*       IF ESTAESTA='1'B THEN       /* ESTA REQUEST?         @Z30EPXH*/ 01814000
         TM    ESTAESTA(R1),B'00010000'                            0628 01815000
         BNO   @RF00628                                            0628 01816000
*         DO;                       /* SET RETURN CODE 20            */ 01817000
*           RETCOD=20;              /* PRIME FIELD           @Z40FPXA*/ 01818000
         MVI   RETCOD(R9),X'14'                                    0630 01819000
*           GOTO RETN;              /* ISSUE RETURN CODE 20  @Z40FPXA*/ 01820000
         B     RETN                                                0631 01821000
*         END;                                                     0632 01822000
*       ELSE                        /*                       @Z30EPXH*/ 01823000
*         GOTO RETCOD4;             /* ISSUE RETURN CODE 4   @Z40FPXA*/ 01824000
*     END;                          /*                       @Z30EPXH*/ 01825000
*   GEN(LM  0,3,SAVEREGS(7));       /* RESTORE REGISTERS     @Z40FPXA*/ 01826000
@RC00611 DS    0H                                                  0635 01827000
         LM  0,3,SAVEREGS(7)                                            01828000
*   END;                            /*                       @Z30EPXH*/ 01829000
@EL00010 DS    0H                                                  0636 01830000
@EF00010 DS    0H                                                  0636 01831000
@ER00010 BR    @14                                                 0636 01832000
*INVALID:                                                          0637 01833000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0637 01834000
*                                                                  0637 01835000
INVALID  DS    0H                                                  0638 01836000
*   /*****************************************************************/ 01837000
*   /*                                                               */ 01838000
*   /* ONCE THIS ROUTINE IS ENTERED AND ABEND IS ISSUED SVC 60 ENDS  */ 01839000
*   /* ITS PROCESSING FOR THIS REQUEST THIS IS IN EFFECT AN EXIT FROM*/ 01840000
*   /* SVC 60 THIS ROUTINE ABENDS INVALID REQUESTS-BEFORE ENTRY A    */ 01841000
*   /* REASON CODE IS PLACED IN REG 15                               */ 01842000
*   /*                                                               */ 01843000
*   /*****************************************************************/ 01844000
*                                                                  0638 01845000
*   IF TCBSTAFX='1'B THEN           /* ALLOW                 @ZA24347*/ 01846000
         TM    TCBSTAFX(TCBPTR),B'01000000'                        0638 01847000
         BNO   @RF00638                                            0638 01848000
*     DO;                           /* ASYNCRONOUS           @ZA24347*/ 01849000
*       TCBFX='0'B;                 /* INTERRUPTS.           @ZA24347*/ 01850000
         NI    TCBFX(TCBPTR),B'11111110'                           0640 01851000
*       TCBSTAFX='0'B;              /*                       @ZA24347*/ 01852000
         NI    TCBSTAFX(TCBPTR),B'10111111'                        0641 01853000
*     END;                          /*                       @ZA24347*/ 01854000
*   ELSE                                                           0643 01855000
*     ;                             /*                       @ZA24347*/ 01856000
@RF00638 DS    0H                                                  0644 01857000
*   TCBSTAWA=0;                     /* CLEAR ESTAE IN PROCESS FLAG 0644 01858000
*                                                            @Z40FPXA*/ 01859000
         SLR   @12,@12                                             0644 01860000
         ST    @12,TCBSTAWA(,TCBPTR)                               0644 01861000
*   R15=REASON;                     /* PLACE ABEND REASON CODE IN REG   01862000
*                                      15                            */ 01863000
*                                                                  0645 01864000
         SLR   R15,R15                                             0645 01865000
         IC    R15,REASON(,R9)                                     0645 01866000
*   /*****************************************************************/ 01867000
*   /*                                                               */ 01868000
*   /* ISSUE ABEND                                                   */ 01869000
*   /*                                                               */ 01870000
*   /*****************************************************************/ 01871000
*                                                                  0646 01872000
*   GENERATE;                                                      0646 01873000
         ABEND 316,DUMP,,SYSTEM                                         01874000
*   END INVALID;                                                   0647 01875000
@EL00011 DS    0H                                                  0647 01876000
@EF00011 DS    0H                                                  0647 01877000
@ER00011 BR    @14                                                 0647 01878000
*   END IGC00060                                                   0648 01879000
*                                                                  0648 01880000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01881000
*/*%INCLUDE SYSUT5  (TA0SPEC )                                       */ 01882000
*/*%INCLUDE SYSUT5  (TA0DCL  )                                       */ 01883000
*/*%INCLUDE SYSLIB  (IHAESTA )                                       */ 01884000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 01885000
*/*%INCLUDE SYSLIB  (IHAFRRS )                                       */ 01886000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 01887000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 01888000
*/*%INCLUDE SYSLIB  (IHARB   )                                       */ 01889000
*/*%INCLUDE SYSLIB  (IKJRB   )                                       */ 01890000
*/*%INCLUDE SYSLIB  (IHASCB  )                                       */ 01891000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 01892000
*/*%INCLUDE SYSLIB  (IHAASXB )                                       */ 01893000
*/*%INCLUDE SYSLIB  (IHAWSAVT)                                       */ 01894000
*/*%INCLUDE SYSUT5  (SVCVALRQ)                                       */ 01895000
*/*%INCLUDE SYSUT5  (COPYPARM)                                       */ 01896000
*/*%INCLUDE SYSUT5  (REQTYPE )                                       */ 01897000
*/*%INCLUDE SYSUT5  (STIVALRQ)                                       */ 01898000
*/*%INCLUDE SYSUT5  (ADDRCK  )                                       */ 01899000
*/*%INCLUDE SYSUT5  (CANOV   )                                       */ 01900000
*/*%INCLUDE SYSUT5  (STACOVAL)                                       */ 01901000
*/*%INCLUDE SYSUT5  (ESTRVREQ)                                       */ 01902000
*/*%INCLUDE SYSUT5  (ESTIVLRQ)                                       */ 01903000
*/*%INCLUDE SYSUT5  (BRVALCAL)                                       */ 01904000
*/*%INCLUDE SYSUT5  (BRVALREQ)                                       */ 01905000
*/*%INCLUDE SYSUT5  (PERFMREQ)                                       */ 01906000
*/*%INCLUDE SYSUT5  (SCBSRCH )                                       */ 01907000
*/*%INCLUDE SYSUT5  (ESTCOVAL)                                       */ 01908000
*/*%INCLUDE SYSUT5  (VERATTCH)                                       */ 01909000
*/*%INCLUDE SYSUT5  (CANCEL  )                                       */ 01910000
*/*%INCLUDE SYSUT5  (OVERLAY )                                       */ 01911000
*/*%INCLUDE SYSUT5  (CREATE  )                                       */ 01912000
*/*%INCLUDE SYSUT5  (COMPLSCB)                                       */ 01913000
*/*%INCLUDE SYSUT5  (KEYSTATE)                                       */ 01914000
*/*%INCLUDE SYSUT5  (PROPA   )                                       */ 01915000
*/*%INCLUDE SYSUT5  (GETSTOR )                                       */ 01916000
*/*%INCLUDE SYSUT5  (INVALID )                                       */ 01917000
*                                                                  0648 01918000
*       ;                                                          0648 01919000
@DATA    DS    0H                                                       01920000
@DATD    DSECT                                                          01921000
         DS    0F                                                       01922000
IGC00060 CSECT                                                          01923000
         DS    0F                                                       01924000
@CF00086 DC    F'20'                                                    01925000
@CF02220 DC    F'-8'                                                    01926000
@DATD    DSECT                                                          01927000
         DS    0D                                                       01928000
@ENDDATD EQU   *                                                        01929000
IGC00060 CSECT                                                          01930000
         NOPR  ((@ENDDATD-@DATD)*16)                                    01931000
         DS    0F                                                       01932000
@SIZDATD DC    AL1(0)                                                   01933000
         DC    AL3(@ENDDATD-@DATD)                                      01934000
         DS    0D                                                       01935000
@CB02152 DC    X'002A'                                                  01936000
TA0PATCH DS    CL30                                                     01937000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01938000
@01      EQU   01                                                       01939000
@02      EQU   02                                                       01940000
@03      EQU   03                                                       01941000
@04      EQU   04                                                       01942000
@05      EQU   05                                                       01943000
@06      EQU   06                                                       01944000
@07      EQU   07                                                       01945000
@08      EQU   08                                                       01946000
@09      EQU   09                                                       01947000
@10      EQU   10                                                       01948000
@11      EQU   11                                                       01949000
@12      EQU   12                                                       01950000
@13      EQU   13                                                       01951000
@14      EQU   14                                                       01952000
@15      EQU   15                                                       01953000
R1       EQU   @01                                                      01954000
REG0     EQU   @00                                                      01955000
XCTLIN   EQU   @01                                                      01956000
R2       EQU   @02                                                      01957000
R3       EQU   @03                                                      01958000
TCBPTR   EQU   @04                                                      01959000
RBSECPTR EQU   @05                                                      01960000
R5       EQU   @05                                                      01961000
R6       EQU   @06                                                      01962000
R7       EQU   @07                                                      01963000
R8       EQU   @08                                                      01964000
R9       EQU   @09                                                      01965000
R10      EQU   @10                                                      01966000
R13      EQU   @13                                                      01967000
R14      EQU   @14                                                      01968000
R15      EQU   @15                                                      01969000
R11      EQU   @11                                                      01970000
R12      EQU   @12                                                      01971000
PSA      EQU   0                                                        01972000
FLCRNPSW EQU   PSA                                                      01973000
FLCROPSW EQU   PSA+8                                                    01974000
FLCICCW2 EQU   PSA+16                                                   01975000
FLCCVT   EQU   FLCICCW2                                                 01976000
PSAEEPSW EQU   PSA+132                                                  01977000
PSAESPSW EQU   PSA+136                                                  01978000
FLCSVILC EQU   PSAESPSW+1                                               01979000
PSAEPPSW EQU   PSA+140                                                  01980000
FLCPIILC EQU   PSAEPPSW+1                                               01981000
FLCPICOD EQU   PSAEPPSW+2                                               01982000
PSAPICOD EQU   FLCPICOD+1                                               01983000
FLCTEA   EQU   PSAEPPSW+4                                               01984000
FLCPER   EQU   PSA+152                                                  01985000
FLCMCLA  EQU   PSA+168                                                  01986000
FLCIOEL  EQU   FLCMCLA+4                                                01987000
FLCIOA   EQU   FLCMCLA+16                                               01988000
FLCFSA   EQU   FLCMCLA+80                                               01989000
PSATOLD  EQU   PSA+540                                                  01990000
PSAAOLD  EQU   PSA+548                                                  01991000
PSASUPER EQU   PSA+552                                                  01992000
PSASUP1  EQU   PSASUPER                                                 01993000
PSASUP2  EQU   PSASUPER+1                                               01994000
PSASUP3  EQU   PSASUPER+2                                               01995000
PSASUP4  EQU   PSASUPER+3                                               01996000
PSACLHT  EQU   PSA+640                                                  01997000
PSALKSA  EQU   PSA+696                                                  01998000
PSAHLHI  EQU   PSA+760                                                  01999000
PSALITA  EQU   PSA+764                                                  02000000
PSADSSFL EQU   PSA+836                                                  02001000
PSADSSF1 EQU   PSADSSFL                                                 02002000
PSADSSF3 EQU   PSADSSFL+2                                               02003000
PSADSSF4 EQU   PSADSSFL+3                                               02004000
PSARSVT  EQU   PSA+896                                                  02005000
ESTA     EQU   0                                                        02006000
ESTAEXT  EQU   ESTA                                                     02007000
ESTAFLG1 EQU   ESTAEXT                                                  02008000
ESTASTAI EQU   ESTAFLG1                                                 02009000
ESTASTAR EQU   ESTAFLG1                                                 02010000
ESTAESTA EQU   ESTAFLG1                                                 02011000
ESTAIO   EQU   ESTAFLG1                                                 02012000
ESTAEXIT EQU   ESTAEXT+1                                                02013000
ESTAOWNR EQU   ESTA+8                                                   02014000
ESTAFGRS EQU   ESTA+12                                                  02015000
ESTAFLG2 EQU   ESTAFGRS                                                 02016000
ESTAWORK EQU   0                                                        02017000
SAVEREGS EQU   ESTAWORK+72                                              02018000
FREESCBQ EQU   ESTAWORK+108                                             02019000
ESTAWRK  EQU   0                                                        02020000
WORK1    EQU   ESTAWRK+4                                                02021000
WORK2    EQU   ESTAWRK+8                                                02022000
WKWORD   EQU   ESTAWRK+12                                               02023000
RETCOD   EQU   WKWORD                                                   02024000
REASON   EQU   RETCOD                                                   02025000
@NM00009 EQU   WKWORD+2                                                 02026000
FESTAFLG EQU   @NM00009                                                 02027000
CANCELFL EQU   @NM00009                                                 02028000
BRENTFLG EQU   @NM00009                                                 02029000
ABNDFLG  EQU   @NM00009                                                 02030000
FC       EQU   WKWORD+3                                                 02031000
R14SAVE  EQU   ESTAWRK+16                                               02032000
@NM00017 EQU   0                                                        02033000
FRRS     EQU   0                                                        02034000
FRRSHEAD EQU   FRRS                                                     02035000
FRRSCURR EQU   FRRSHEAD+12                                              02036000
FRRSENTR EQU   0                                                        02037000
FRRSFLGS EQU   FRRSENTR+4                                               02038000
FRRSFLG1 EQU   FRRSFLGS                                                 02039000
CVTMAP   EQU   0                                                        02040000
CVT      EQU   CVTMAP                                                   02041000
CVTDAR   EQU   CVTMAP+72                                                02042000
CVTFLGS1 EQU   CVTDAR                                                   02043000
CVTDCB   EQU   CVTMAP+116                                               02044000
CVTIOQET EQU   CVTMAP+120                                               02045000
CVTIERLC EQU   CVTMAP+144                                               02046000
CVTHEAD  EQU   CVTMAP+160                                               02047000
CVTSV76C EQU   CVTHEAD                                                  02048000
CVTOPTA  EQU   CVTMAP+182                                               02049000
CVTOPTB  EQU   CVTMAP+183                                               02050000
CVTGTF   EQU   CVTMAP+236                                               02051000
CVTGTFST EQU   CVTGTF                                                   02052000
CVTGTFS  EQU   CVTGTFST                                                 02053000
CVTSTATE EQU   CVTGTFST                                                 02054000
CVTTMODE EQU   CVTGTFST                                                 02055000
CVTFORM  EQU   CVTGTFST                                                 02056000
CVTAQAVT EQU   CVTMAP+240                                               02057000
CVTTCMFG EQU   CVTAQAVT                                                 02058000
CVTVOLM2 EQU   CVTMAP+244                                               02059000
CVTTATA  EQU   CVTVOLM2                                                 02060000
CVTTSKS  EQU   CVTTATA                                                  02061000
CVTVOLF2 EQU   CVTTSKS                                                  02062000
CVTTAT   EQU   CVTTATA+1                                                02063000
CVTATER  EQU   CVTMAP+248                                               02064000
CVTEXT1  EQU   CVTMAP+252                                               02065000
CVTPURG  EQU   CVTMAP+260                                               02066000
CVTQMSG  EQU   CVTMAP+268                                               02067000
CVTDMSR  EQU   CVTMAP+272                                               02068000
CVTRSV37 EQU   CVTDMSR                                                  02069000
CVTDMSRF EQU   CVTRSV37                                                 02070000
CVTERPV  EQU   CVTMAP+316                                               02071000
CVTINTLA EQU   CVTMAP+320                                               02072000
CVTAPF   EQU   CVTMAP+324                                               02073000
CVTEXT2  EQU   CVTMAP+328                                               02074000
CVTHJES  EQU   CVTMAP+332                                               02075000
CVTPGSIA EQU   CVTMAP+348                                               02076000
CVTA1F1  EQU   CVTMAP+356                                               02077000
CVTSYSK  EQU   CVTMAP+357                                               02078000
CVTVOLM1 EQU   CVTMAP+380                                               02079000
CVTVOLF1 EQU   CVTVOLM1                                                 02080000
CVTATMCT EQU   CVTMAP+388                                               02081000
CVTXTNT1 EQU   0                                                        02082000
CVTXTNT2 EQU   0                                                        02083000
CVTDSSV  EQU   CVTXTNT2                                                 02084000
CVTFLGBT EQU   CVTXTNT2+5                                               02085000
CVTQID   EQU   CVTXTNT2+24                                              02086000
CVTRV400 EQU   CVTXTNT2+52                                              02087000
CVTRV409 EQU   CVTXTNT2+53                                              02088000
CVTATCVT EQU   CVTXTNT2+64                                              02089000
CVTRV429 EQU   CVTXTNT2+84                                              02090000
CVTRV438 EQU   CVTXTNT2+85                                              02091000
CVTRV457 EQU   CVTXTNT2+112                                             02092000
CVTRV466 EQU   CVTXTNT2+113                                             02093000
CVTFIX   EQU   0                                                        02094000
CVTRELNO EQU   CVTFIX+252                                               02095000
TCBFIX   EQU   0                                                        02096000
TCBFRS   EQU   TCBFIX                                                   02097000
TCB      EQU   0                                                        02098000
TCBRBP   EQU   TCB                                                      02099000
TCBPIE   EQU   TCB+4                                                    02100000
TCBPMASK EQU   TCBPIE                                                   02101000
TCBCMP   EQU   TCB+16                                                   02102000
TCBCMPF  EQU   TCBCMP                                                   02103000
TCBCPP   EQU   TCBCMPF                                                  02104000
TCBSTCC  EQU   TCBCMPF                                                  02105000
TCBCDBL  EQU   TCBCMPF                                                  02106000
TCBCWTO  EQU   TCBCMPF                                                  02107000
TCBCIND  EQU   TCBCMPF                                                  02108000
TCBCMSG  EQU   TCBCMPF                                                  02109000
TCBTRN   EQU   TCB+20                                                   02110000
TCBABF   EQU   TCBTRN                                                   02111000
TCBMSS   EQU   TCB+24                                                   02112000
TCBPKF   EQU   TCB+28                                                   02113000
TCBFLGS  EQU   TCB+29                                                   02114000
TCBFLGS1 EQU   TCBFLGS                                                  02115000
TCBFX    EQU   TCBFLGS1                                                 02116000
TCBFLGS2 EQU   TCBFLGS+1                                                02117000
TCBFLGS3 EQU   TCBFLGS+2                                                02118000
TCBFLGS4 EQU   TCBFLGS+3                                                02119000
TCBFLGS5 EQU   TCBFLGS+4                                                02120000
TCBABWF  EQU   TCBFLGS5                                                 02121000
TCBJPQ   EQU   TCB+44                                                   02122000
TCBPURGE EQU   TCBJPQ                                                   02123000
TCBGRS   EQU   TCB+48                                                   02124000
TCBFSA   EQU   TCB+112                                                  02125000
TCBTME   EQU   TCB+120                                                  02126000
TCBJSTCB EQU   TCB+124                                                  02127000
TCBTSFLG EQU   TCB+148                                                  02128000
TCBTSTSK EQU   TCBTSFLG                                                 02129000
TCBSTAB  EQU   TCB+160                                                  02130000
TCBNSTAE EQU   TCBSTAB                                                  02131000
TCBSTABE EQU   TCBNSTAE                                                 02132000
TCBSTABB EQU   TCBSTAB+1                                                02133000
TCBTCT   EQU   TCB+164                                                  02134000
TCBTCTGF EQU   TCBTCT                                                   02135000
TCBSCNDY EQU   TCB+172                                                  02136000
TCBNDSP  EQU   TCBSCNDY                                                 02137000
TCBNDSP1 EQU   TCBNDSP+1                                                02138000
TCBNDSP2 EQU   TCBNDSP+2                                                02139000
TCBNDSP3 EQU   TCBNDSP+3                                                02140000
TCBJSCB  EQU   TCB+180                                                  02141000
TCBRECDE EQU   TCBJSCB                                                  02142000
TCBEXT1  EQU   TCB+196                                                  02143000
TCBBITS  EQU   TCB+200                                                  02144000
TCBNDSP4 EQU   TCBBITS                                                  02145000
TCBNDSP5 EQU   TCBBITS+1                                                02146000
TCBFLGS6 EQU   TCBBITS+2                                                02147000
TCBFLGS7 EQU   TCBBITS+3                                                02148000
TCBDAR   EQU   TCB+204                                                  02149000
TCBDARC  EQU   TCBDAR                                                   02150000
TCBEXT2  EQU   TCB+208                                                  02151000
TCBXSCT  EQU   TCB+240                                                  02152000
TCBXSCT1 EQU   TCBXSCT                                                  02153000
TCBFOE   EQU   TCB+244                                                  02154000
TCBSTAWA EQU   TCB+252                                                  02155000
TCBESTAE EQU   TCB+264                                                  02156000
TCBESTRM EQU   TCBESTAE+1                                               02157000
TCBETERM EQU   TCBESTRM                                                 02158000
TCBSTAFX EQU   TCBESTRM                                                 02159000
TCBFBYT1 EQU   TCB+276                                                  02160000
TCBFBYT2 EQU   TCB+277                                                  02161000
TCBRV124 EQU   TCB+278                                                  02162000
TCBRV133 EQU   TCB+279                                                  02163000
TCBXTNT2 EQU   0                                                        02164000
TCBGTF   EQU   TCBXTNT2                                                 02165000
TCBTFLG  EQU   TCBGTF                                                   02166000
TCBRV146 EQU   TCBXTNT2+28                                              02167000
TCBRV155 EQU   TCBXTNT2+29                                              02168000
TCBRV164 EQU   TCBXTNT2+30                                              02169000
TCBRV173 EQU   TCBXTNT2+31                                              02170000
RBPRFX   EQU   0                                                        02171000
RBBASIC  EQU   0                                                        02172000
RBEXRTNM EQU   RBBASIC                                                  02173000
RBTMFLD  EQU   RBEXRTNM                                                 02174000
RBSTAB   EQU   RBBASIC+10                                               02175000
XSTAB    EQU   RBSTAB                                                   02176000
RBSTAB1  EQU   XSTAB                                                    02177000
XSTAB1   EQU   RBSTAB1                                                  02178000
RBFTCKPT EQU   XSTAB1                                                   02179000
RBSTAB2  EQU   XSTAB+1                                                  02180000
XSTAB2   EQU   RBSTAB2                                                  02181000
RBTCBNXT EQU   XSTAB2                                                   02182000
RBFACTV  EQU   XSTAB2                                                   02183000
RBFDYN   EQU   XSTAB2                                                   02184000
RBECBWT  EQU   XSTAB2                                                   02185000
RBOPSW   EQU   RBBASIC+16                                               02186000
XRBPSW   EQU   RBOPSW                                                   02187000
RBOPSWB2 EQU   XRBPSW+1                                                 02188000
RBLINK   EQU   RBBASIC+28                                               02189000
XRBLNK   EQU   RBLINK                                                   02190000
RBWCF    EQU   XRBLNK                                                   02191000
RBLINKB  EQU   XRBLNK+1                                                 02192000
RBGRSAVE EQU   RBBASIC+32                                               02193000
XRBREG   EQU   RBGRSAVE                                                 02194000
RBGRS0   EQU   XRBREG                                                   02195000
RBGRS1   EQU   XRBREG+4                                                 02196000
RBGRS2   EQU   XRBREG+8                                                 02197000
RBGRS3   EQU   XRBREG+12                                                02198000
RBGRS4   EQU   XRBREG+16                                                02199000
RBGRS5   EQU   XRBREG+20                                                02200000
RBGRS6   EQU   XRBREG+24                                                02201000
RBGRS7   EQU   XRBREG+28                                                02202000
RBGRS8   EQU   XRBREG+32                                                02203000
RBGRS9   EQU   XRBREG+36                                                02204000
RBGRS10  EQU   XRBREG+40                                                02205000
RBGRS11  EQU   XRBREG+44                                                02206000
RBGRS12  EQU   XRBREG+48                                                02207000
RBGRS13  EQU   XRBREG+52                                                02208000
RBGRS14  EQU   XRBREG+56                                                02209000
RBGRS15  EQU   XRBREG+60                                                02210000
XRBESA   EQU   RBBASIC+96                                               02211000
RBPREFIX EQU   0                                                        02212000
RBRSV019 EQU   RBPREFIX+14                                              02213000
RBRSV028 EQU   RBPREFIX+15                                              02214000
RBRSV041 EQU   RBPREFIX+27                                              02215000
RBRSV054 EQU   RBPREFIX+39                                              02216000
RBRTOPSW EQU   RBPREFIX+40                                              02217000
RBRTPSW2 EQU   RBRTOPSW+8                                               02218000
RBRTICIL EQU   RBRTPSW2                                                 02219000
RBFLAGS1 EQU   RBPREFIX+56                                              02220000
RBSCB    EQU   RBFLAGS1                                                 02221000
RBINTCDA EQU   RBPREFIX+61                                              02222000
RBINTCOD EQU   RBINTCDA+1                                               02223000
RBSECT   EQU   0                                                        02224000
RBPPSAV  EQU   RBSECT                                                   02225000
@NM00062 EQU   RBSECT+10                                                02226000
@NM00063 EQU   @NM00062                                                 02227000
RBTRSVRB EQU   @NM00063                                                 02228000
@NM00065 EQU   @NM00062+1                                               02229000
RBETXR   EQU   @NM00065                                                 02230000
RBEP     EQU   RBSECT+12                                                02231000
RBPGMQ   EQU   RBSECT+24                                                02232000
@NM00072 EQU   RBSECT+28                                                02233000
@NM00073 EQU   @NM00072                                                 02234000
IRBEND   EQU   RBSECT+96                                                02235000
@NM00076 EQU   RBSECT+96                                                02236000
RBRSV138 EQU   @NM00076+7                                               02237000
RBSCBB   EQU   RBSECT+144                                               02238000
RBSPARM  EQU   RBSCBB+8                                                 02239000
RBSFLGS1 EQU   RBSPARM                                                  02240000
RBSIOPRC EQU   RBSFLGS1                                                 02241000
RBSOWNR  EQU   RBSCBB+12                                                02242000
RBSFLGS2 EQU   RBSOWNR                                                  02243000
RBSDATA  EQU   RBSCBB+16                                                02244000
RBSFLG3  EQU   RBSDATA                                                  02245000
RBRSV150 EQU   RBSECT+167                                               02246000
RBFEPARM EQU   RBSECT+168                                               02247000
SCB      EQU   0                                                        02248000
SCBCHAIN EQU   SCB                                                      02249000
SCBEXIT  EQU   SCB+4                                                    02250000
SCBPARM  EQU   SCB+8                                                    02251000
SCBFLGS1 EQU   SCBPARM                                                  02252000
SCBSTAI  EQU   SCBFLGS1                                                 02253000
SCBSTAR  EQU   SCBFLGS1                                                 02254000
SCBESTAE EQU   SCBFLGS1                                                 02255000
SCBIOPRC EQU   SCBFLGS1                                                 02256000
SCBOWNR  EQU   SCB+12                                                   02257000
SCBFLGS2 EQU   SCBOWNR                                                  02258000
SCBXCTL2 EQU   SCBFLGS2                                                 02259000
SCBINUSE EQU   SCBFLGS2                                                 02260000
SCBKEY0  EQU   SCBFLGS2                                                 02261000
SCBSUPER EQU   SCBFLGS2                                                 02262000
SCBOWNRA EQU   SCBOWNR+1                                                02263000
SCBDATA  EQU   SCB+16                                                   02264000
SCBFLGS3 EQU   SCBDATA                                                  02265000
SCBTERMI EQU   SCBFLGS3                                                 02266000
SCBCNCEL EQU   SCBFLGS3                                                 02267000
SCBBRNTR EQU   SCBFLGS3                                                 02268000
SCBPKEY  EQU   SCBDATA+1                                                02269000
SCBID    EQU   SCBDATA+2                                                02270000
ASCB     EQU   0                                                        02271000
ASCBSUPC EQU   ASCB+16                                                  02272000
ASCBRSM  EQU   ASCB+52                                                  02273000
ASCBRSMF EQU   ASCBRSM                                                  02274000
ASCBFW1  EQU   ASCB+100                                                 02275000
ASCBRCTF EQU   ASCBFW1+2                                                02276000
ASCBFLG1 EQU   ASCBFW1+3                                                02277000
ASCBASXB EQU   ASCB+108                                                 02278000
ASCBDSP1 EQU   ASCB+114                                                 02279000
ASCBFLG2 EQU   ASCB+115                                                 02280000
ASCBLKGP EQU   ASCB+128                                                 02281000
ASCBSRQ  EQU   ASCB+180                                                 02282000
ASCBSRQ1 EQU   ASCBSRQ                                                  02283000
ASCBSRQ2 EQU   ASCBSRQ+1                                                02284000
ASCBSRQ3 EQU   ASCBSRQ+2                                                02285000
ASCBSRQ4 EQU   ASCBSRQ+3                                                02286000
ASXB     EQU   0                                                        02287000
ASXBSPSA EQU   ASXB+112                                                 02288000
ASXBAEQ  EQU   ASXB+168                                                 02289000
ASXBSECR EQU   ASXB+199                                                 02290000
ASCBSFLG EQU   ASXBSECR                                                 02291000
ASXBCASW EQU   ASXB+216                                                 02292000
ASXBCRB1 EQU   ASXBCASW                                                 02293000
WSAL     EQU   0                                                        02294000
WSALSTAE EQU   WSAL+44                                                  02295000
ESTATST  EQU   0                                                        02296000
STPSW    EQU   RBOPSW                                                   02297000
KEYWMP   EQU   STPSW+1                                                  02298000
PPMODE   EQU   KEYWMP                                                   02299000
CVTPTR   EQU   FLCCVT                                                   02300000
ASCBPTR  EQU   PSAAOLD                                                  02301000
ASXBPTR  EQU   ASCBASXB                                                 02302000
PSARSVTE EQU   PSARSVT                                                  02303000
PSACSTK  EQU   PSARSVTE                                                 02304000
FRRSPTR  EQU   PSACSTK                                                  02305000
FRREPTR  EQU   FRRSCURR                                                 02306000
@NM00013 EQU   SCBEXIT                                                  02307000
SCBEXT   EQU   @NM00013+1                                               02308000
@NM00015 EQU   SCBCHAIN                                                 02309000
ESTAFLDS EQU   ESTAEXIT                                                 02310000
SCBFLDS  EQU   SCBEXT                                                   02311000
SCBCLEAR EQU   SCBFLGS1                                                 02312000
CVTS01   EQU   CVTPGSIA                                                 02313000
CVTPVTP  EQU   CVTS01+8                                                 02314000
CVTLPDIA EQU   CVTS01+12                                                02315000
CVTDIRST EQU   CVTLPDIA                                                 02316000
CVTSLIDA EQU   CVTS01+24                                                02317000
CVTCTLFG EQU   CVTS01+50                                                02318000
CVTCRMN  EQU   CVTS01+156                                               02319000
CVTRV210 EQU   CVTS01+424                                               02320000
CVTRV219 EQU   CVTS01+425                                               02321000
CVTRV228 EQU   CVTS01+426                                               02322000
CVTRV237 EQU   CVTS01+427                                               02323000
CVTMFRTR EQU   CVTS01+452                                               02324000
CVTRV262 EQU   CVTS01+468                                               02325000
CVTRV271 EQU   CVTS01+469                                               02326000
CVTRV280 EQU   CVTS01+470                                               02327000
CVTRV289 EQU   CVTS01+471                                               02328000
CVTGSDA  EQU   CVTS01+600                                               02329000
RBSECS03 EQU   RBEP                                                     02330000
RBCDE    EQU   RBSECS03                                                 02331000
RBCDFLGS EQU   RBCDE                                                    02332000
RBSECS05 EQU   RBPGMQ                                                   02333000
RBSQE    EQU   RBSECS05                                                 02334000
RBSECS06 EQU   RBPGMQ                                                   02335000
RBIQE    EQU   RBSECS06                                                 02336000
RBSECS07 EQU   RBPGMQ                                                   02337000
RBIQE2   EQU   RBSECS07                                                 02338000
RBSECS08 EQU   IRBEND                                                   02339000
RBSECS09 EQU   IRBEND                                                   02340000
FLC      EQU   PSA                                                      02341000
PVTPTR   EQU   CVTPVTP                                                  02342000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02343000
RBRSV161 EQU   RBSECS09+64                                              02344000
RBSIRBWA EQU   RBSECS09                                                 02345000
RBIQEWRK EQU   RBSECS08+4                                               02346000
RBNEXAV  EQU   RBSECS08                                                 02347000
RBIQEA   EQU   RBIQE2                                                   02348000
RBIQE1   EQU   RBIQE+1                                                  02349000
RBUSE    EQU   RBIQE                                                    02350000
RBSQEA   EQU   RBSQE+1                                                  02351000
@NM00077 EQU   RBSQE                                                    02352000
RBCDE1   EQU   RBCDE+1                                                  02353000
RBCDLOAD EQU   RBCDFLGS                                                 02354000
RBCDXCTL EQU   RBCDFLGS                                                 02355000
RBCDSYNC EQU   RBCDFLGS                                                 02356000
RBCDNODE EQU   RBCDFLGS                                                 02357000
RBCDSAVE EQU   RBCDFLGS                                                 02358000
RBCDATCH EQU   RBCDFLGS                                                 02359000
RBRSV009 EQU   RBCDFLGS                                                 02360000
RBNOCELL EQU   RBCDFLGS                                                 02361000
CVTRV628 EQU   CVTS01+728                                               02362000
CVTRV627 EQU   CVTS01+724                                               02363000
CVTRV626 EQU   CVTS01+720                                               02364000
CVTRV625 EQU   CVTS01+716                                               02365000
CVTRV624 EQU   CVTS01+712                                               02366000
CVTRV623 EQU   CVTS01+708                                               02367000
CVTRV622 EQU   CVTS01+704                                               02368000
CVTRV621 EQU   CVTS01+700                                               02369000
CVTIHASU EQU   CVTS01+696                                               02370000
CVTSUSP  EQU   CVTS01+692                                               02371000
CVTT6SVC EQU   CVTS01+688                                               02372000
CVTCDAL  EQU   CVTS01+684                                               02373000
CVTTCTL  EQU   CVTS01+680                                               02374000
CVTRSUME EQU   CVTS01+676                                               02375000
CVTJTERM EQU   CVTS01+672                                               02376000
CVTASMRM EQU   CVTS01+668                                               02377000
CVTTCASP EQU   CVTS01+664                                               02378000
CVT0PT03 EQU   CVTS01+660                                               02379000
CVT0PT0E EQU   CVTS01+656                                               02380000
CVTRV609 EQU   CVTS01+652                                               02381000
CVTCGK   EQU   CVTS01+648                                               02382000
CVTRAC   EQU   CVTS01+644                                               02383000
CVTHSM   EQU   CVTS01+640                                               02384000
CVTRV605 EQU   CVTS01+636                                               02385000
CVTRV604 EQU   CVTS01+632                                               02386000
CVTEFF02 EQU   CVTS01+628                                               02387000
CVTCBBR  EQU   CVTS01+624                                               02388000
CVTSSCR  EQU   CVTS01+620                                               02389000
CVTEVENT EQU   CVTS01+616                                               02390000
CVTCRCA  EQU   CVTS01+612                                               02391000
CVTTPIO  EQU   CVTS01+608                                               02392000
CVTADV   EQU   CVTS01+604                                               02393000
CVTGSDAB EQU   CVTGSDA                                                  02394000
CVTQV3   EQU   CVTS01+596                                               02395000
CVTQV2   EQU   CVTS01+592                                               02396000
CVTQV1   EQU   CVTS01+588                                               02397000
CVTRPT   EQU   CVTS01+584                                               02398000
CVTSSRB  EQU   CVTS01+580                                               02399000
CVTCSDRL EQU   CVTS01+576                                               02400000
CVTEXP1  EQU   CVTS01+572                                               02401000
CVTRMPMT EQU   CVTS01+568                                               02402000
CVTRMPTT EQU   CVTS01+564                                               02403000
CVTVPSA  EQU   CVTS01+560                                               02404000
CVTVSTOP EQU   CVTS01+556                                               02405000
CVTGTFR8 EQU   CVTS01+552                                               02406000
CVTQUIT  EQU   CVTS01+548                                               02407000
CVTVACR  EQU   CVTS01+544                                               02408000
CVTWTCB  EQU   CVTS01+540                                               02409000
CVTSTPRS EQU   CVTS01+536                                               02410000
CVT0PT02 EQU   CVTS01+532                                               02411000
CVTDARCM EQU   CVTS01+528                                               02412000
CVTIRECM EQU   CVTS01+524                                               02413000
CVTJRECM EQU   CVTS01+520                                               02414000
CVTVEMS0 EQU   CVTS01+516                                               02415000
CVTSPFRR EQU   CVTS01+512                                               02416000
CVTRLSTG EQU   CVTS01+508                                               02417000
CVT0TC0A EQU   CVTS01+504                                               02418000
CVTGMBR  EQU   CVTS01+500                                               02419000
CVTLFRM  EQU   CVTS01+496                                               02420000
CVTRMBR  EQU   CVTS01+492                                               02421000
CVTVIOP  EQU   CVTS01+488                                               02422000
CVTRV307 EQU   CVTS01+486                                               02423000
CVTRV306 EQU   CVTS01+484                                               02424000
CVTRV305 EQU   CVTS01+482                                               02425000
CVTRV304 EQU   CVTS01+480                                               02426000
CVTRV303 EQU   CVTS01+478                                               02427000
CVTRV302 EQU   CVTS01+476                                               02428000
CVTTRCA  EQU   CVTS01+472                                               02429000
CVTRV297 EQU   CVTRV289                                                 02430000
CVTRV296 EQU   CVTRV289                                                 02431000
CVTRV295 EQU   CVTRV289                                                 02432000
CVTRV294 EQU   CVTRV289                                                 02433000
CVTRV293 EQU   CVTRV289                                                 02434000
CVTRV292 EQU   CVTRV289                                                 02435000
CVTRV291 EQU   CVTRV289                                                 02436000
CVTRV290 EQU   CVTRV289                                                 02437000
CVTRV288 EQU   CVTRV280                                                 02438000
CVTRV287 EQU   CVTRV280                                                 02439000
CVTRV286 EQU   CVTRV280                                                 02440000
CVTRV285 EQU   CVTRV280                                                 02441000
CVTRV284 EQU   CVTRV280                                                 02442000
CVTRV283 EQU   CVTRV280                                                 02443000
CVTRV282 EQU   CVTRV280                                                 02444000
CVTRV281 EQU   CVTRV280                                                 02445000
CVTRV279 EQU   CVTRV271                                                 02446000
CVTRV278 EQU   CVTRV271                                                 02447000
CVTRV277 EQU   CVTRV271                                                 02448000
CVTRV276 EQU   CVTRV271                                                 02449000
CVTRV275 EQU   CVTRV271                                                 02450000
CVTRV274 EQU   CVTRV271                                                 02451000
CVTRV273 EQU   CVTRV271                                                 02452000
CVTRV272 EQU   CVTRV271                                                 02453000
CVTRV270 EQU   CVTRV262                                                 02454000
CVTRV269 EQU   CVTRV262                                                 02455000
CVTRV268 EQU   CVTRV262                                                 02456000
CVTRV267 EQU   CVTRV262                                                 02457000
CVTRV266 EQU   CVTRV262                                                 02458000
CVTRV265 EQU   CVTRV262                                                 02459000
CVTRV264 EQU   CVTRV262                                                 02460000
CVTRV263 EQU   CVTRV262                                                 02461000
CVTVFP   EQU   CVTS01+464                                               02462000
CVTVSI   EQU   CVTS01+460                                               02463000
CVTVPSIB EQU   CVTS01+456                                               02464000
CVTMFACT EQU   CVTMFRTR                                                 02465000
CVTMFCTL EQU   CVTS01+448                                               02466000
CVTPVBP  EQU   CVTS01+444                                               02467000
CVTPWI   EQU   CVTS01+440                                               02468000
CVTRV254 EQU   CVTS01+438                                               02469000
CVTRV253 EQU   CVTS01+436                                               02470000
CVTRV252 EQU   CVTS01+434                                               02471000
CVTRV251 EQU   CVTS01+433                                               02472000
CVTRV250 EQU   CVTS01+432                                               02473000
CVTRV249 EQU   CVTS01+431                                               02474000
CVTRV248 EQU   CVTS01+430                                               02475000
CVTRV247 EQU   CVTS01+429                                               02476000
CVTRV246 EQU   CVTS01+428                                               02477000
CVTRV245 EQU   CVTRV237                                                 02478000
CVTRV244 EQU   CVTRV237                                                 02479000
CVTRV243 EQU   CVTRV237                                                 02480000
CVTRV242 EQU   CVTRV237                                                 02481000
CVTRV241 EQU   CVTRV237                                                 02482000
CVTRV240 EQU   CVTRV237                                                 02483000
CVTRV239 EQU   CVTRV237                                                 02484000
CVTRV238 EQU   CVTRV237                                                 02485000
CVTRV236 EQU   CVTRV228                                                 02486000
CVTRV235 EQU   CVTRV228                                                 02487000
CVTRV234 EQU   CVTRV228                                                 02488000
CVTRV233 EQU   CVTRV228                                                 02489000
CVTRV232 EQU   CVTRV228                                                 02490000
CVTRV231 EQU   CVTRV228                                                 02491000
CVTRV230 EQU   CVTRV228                                                 02492000
CVTRV229 EQU   CVTRV228                                                 02493000
CVTRV227 EQU   CVTRV219                                                 02494000
CVTRV226 EQU   CVTRV219                                                 02495000
CVTRV225 EQU   CVTRV219                                                 02496000
CVTRV224 EQU   CVTRV219                                                 02497000
CVTRV223 EQU   CVTRV219                                                 02498000
CVTRV222 EQU   CVTRV219                                                 02499000
CVTRV221 EQU   CVTRV219                                                 02500000
CVTRV220 EQU   CVTRV219                                                 02501000
CVTRV218 EQU   CVTRV210                                                 02502000
CVTRV217 EQU   CVTRV210                                                 02503000
CVTRV216 EQU   CVTRV210                                                 02504000
CVTRV215 EQU   CVTRV210                                                 02505000
CVTRV214 EQU   CVTRV210                                                 02506000
CVTRV213 EQU   CVTRV210                                                 02507000
CVTRV212 EQU   CVTRV210                                                 02508000
CVTRV211 EQU   CVTRV210                                                 02509000
CVTLCCAT EQU   CVTS01+420                                               02510000
CVTPCCAT EQU   CVTS01+416                                               02511000
CVTIPCRP EQU   CVTS01+412                                               02512000
CVTIPCRI EQU   CVTS01+408                                               02513000
CVTIPCDS EQU   CVTS01+404                                               02514000
CVTAIDVT EQU   CVTS01+400                                               02515000
CVTSSAP  EQU   CVTS01+396                                               02516000
CVTEHCIR EQU   CVTS01+392                                               02517000
CVTEHDEF EQU   CVTS01+388                                               02518000
CVTDAIR  EQU   CVTS01+384                                               02519000
CVTPERFM EQU   CVTS01+380                                               02520000
CVT044R2 EQU   CVTS01+376                                               02521000
CVTFETCH EQU   CVTS01+372                                               02522000
CVTRSTWD EQU   CVTS01+368                                               02523000
CVTSPOST EQU   CVTS01+364                                               02524000
CVTIOBP  EQU   CVTS01+360                                               02525000
CVTASMVT EQU   CVTS01+356                                               02526000
CVTRECRQ EQU   CVTS01+352                                               02527000
CVTWSAC  EQU   CVTS01+348                                               02528000
CVTRV149 EQU   CVTS01+344                                               02529000
CVTWSAL  EQU   CVTS01+340                                               02530000
CVTSPSA  EQU   CVTS01+336                                               02531000
CVTGLMN  EQU   CVTS01+332                                               02532000
CVTVEAC0 EQU   CVTS01+328                                               02533000
CVT062R1 EQU   CVTS01+324                                               02534000
CVTRPOST EQU   CVTS01+320                                               02535000
CVTDQIQE EQU   CVTS01+316                                               02536000
CVTCSD   EQU   CVTS01+312                                               02537000
CVTLKRMA EQU   CVTS01+308                                               02538000
CVTRSPIE EQU   CVTS01+304                                               02539000
CVTRENQ  EQU   CVTS01+300                                               02540000
CVTLQCB  EQU   CVTS01+296                                               02541000
CVTFQCB  EQU   CVTS01+292                                               02542000
CVTQCS01 EQU   CVTS01+288                                               02543000
CVTAPFT  EQU   CVTS01+284                                               02544000
CVTPARRL EQU   CVTS01+280                                               02545000
CVTVWAIT EQU   CVTS01+276                                               02546000
CVTGSPL  EQU   CVTS01+272                                               02547000
CVTLSMQ  EQU   CVTS01+268                                               02548000
CVTGSMQ  EQU   CVTS01+264                                               02549000
CVTEXPRO EQU   CVTS01+260                                               02550000
CVTOPCTP EQU   CVTS01+256                                               02551000
CVTSIC   EQU   CVTS01+252                                               02552000
CVTTPIOS EQU   CVTS01+248                                               02553000
CVTRTMS  EQU   CVTS01+244                                               02554000
CVTSDBF  EQU   CVTS01+240                                               02555000
CVTSCBP  EQU   CVTS01+236                                               02556000
CVTSDMP  EQU   CVTS01+232                                               02557000
CVTSV60  EQU   CVTS01+228                                               02558000
CVTRTMCT EQU   CVTS01+224                                               02559000
CVTASCBL EQU   CVTS01+220                                               02560000
CVTASCBH EQU   CVTS01+216                                               02561000
CVTGDA   EQU   CVTS01+212                                               02562000
CVTASVT  EQU   CVTS01+208                                               02563000
CVTVVMDI EQU   CVTS01+204                                               02564000
CVTAQTOP EQU   CVTS01+200                                               02565000
CVTIOSCS EQU   CVTS01+196                                               02566000
CVTSDRM  EQU   CVTS01+192                                               02567000
CVTOPTE  EQU   CVTS01+188                                               02568000
CVTSTXU  EQU   CVTS01+184                                               02569000
CVTQUIS  EQU   CVTS01+180                                               02570000
CVTPARS  EQU   CVTS01+176                                               02571000
CVTS1EE  EQU   CVTS01+172                                               02572000
CVTFRAS  EQU   CVTS01+168                                               02573000
CVTQSAS  EQU   CVTS01+164                                               02574000
CVTCRAS  EQU   CVTS01+160                                               02575000
CVTDELCP EQU   CVTS01+152                                               02576000
CVTFRECL EQU   CVTS01+148                                               02577000
CVTGETCL EQU   CVTS01+144                                               02578000
CVTBLDCP EQU   CVTS01+140                                               02579000
CVTAUTHL EQU   CVTS01+136                                               02580000
CVTSCAN  EQU   CVTS01+132                                               02581000
CVTRV144 EQU   CVTS01+130                                               02582000
CVTMAXMP EQU   CVTS01+128                                               02583000
CVTSTCK  EQU   CVTS01+124                                               02584000
CVTRV139 EQU   CVTS01+123                                               02585000
CVTDSSAC EQU   CVTS01+122                                               02586000
CVTRV513 EQU   CVTS01+121                                               02587000
CVTIOSPL EQU   CVTS01+120                                               02588000
CVTPTGT  EQU   CVTS01+116                                               02589000
CVTCSPIE EQU   CVTS01+112                                               02590000
CVTSMFEX EQU   CVTS01+108                                               02591000
CVTOLT0A EQU   CVTS01+104                                               02592000
CVTSRBRT EQU   CVTS01+100                                               02593000
CVTPUTL  EQU   CVTS01+96                                                02594000
CVTASCRL EQU   CVTS01+92                                                02595000
CVTASCRF EQU   CVTS01+88                                                02596000
CVTRV326 EQU   CVTS01+84                                                02597000
CVTRV325 EQU   CVTS01+80                                                02598000
CVTRV324 EQU   CVTS01+76                                                02599000
CVT0VL01 EQU   CVTS01+72                                                02600000
CVTSHRVM EQU   CVTS01+68                                                02601000
CVTRV332 EQU   CVTS01+64                                                02602000
CVTTAS   EQU   CVTS01+60                                                02603000
CVTRSCN  EQU   CVTS01+56                                                02604000
CVTTRAC2 EQU   CVTS01+54                                                02605000
CVTTRACE EQU   CVTS01+52                                                02606000
CVTAPG   EQU   CVTS01+51                                                02607000
CVTSDTRC EQU   CVTCTLFG                                                 02608000
CVTGTRCE EQU   CVTCTLFG                                                 02609000
CVTNOMP  EQU   CVTCTLFG                                                 02610000
CVTRSV79 EQU   CVTCTLFG                                                 02611000
CVTDSTAT EQU   CVTCTLFG                                                 02612000
CVTRSV78 EQU   CVTCTLFG                                                 02613000
CVTRV333 EQU   CVTCTLFG                                                 02614000
CVTRV323 EQU   CVTCTLFG                                                 02615000
CVTSPVLK EQU   CVTS01+49                                                02616000
CVTRSV77 EQU   CVTS01+48                                                02617000
CVTRV331 EQU   CVTS01+44                                                02618000
CVTRV330 EQU   CVTS01+40                                                02619000
CVTRV329 EQU   CVTS01+36                                                02620000
CVTRV328 EQU   CVTS01+32                                                02621000
CVTRV322 EQU   CVTS01+28                                                02622000
CVTSLID  EQU   CVTSLIDA+1                                               02623000
CVTSYLK  EQU   CVTSLIDA                                                 02624000
CVTRV321 EQU   CVTS01+20                                                02625000
CVTRV320 EQU   CVTS01+16                                                02626000
CVTLPDIR EQU   CVTLPDIA+1                                               02627000
CVTRSV69 EQU   CVTDIRST                                                 02628000
CVTRSV68 EQU   CVTDIRST                                                 02629000
CVTRSV67 EQU   CVTDIRST                                                 02630000
CVTRSV66 EQU   CVTDIRST                                                 02631000
CVTRSV65 EQU   CVTDIRST                                                 02632000
CVTRSV64 EQU   CVTDIRST                                                 02633000
CVTRSV63 EQU   CVTDIRST                                                 02634000
CVTDICOM EQU   CVTDIRST                                                 02635000
CVTLPDSR EQU   CVTS01+4                                                 02636000
CVTGETL  EQU   CVTS01                                                   02637000
SCBCHN   EQU   @NM00015+1                                               02638000
@NM00016 EQU   @NM00015                                                 02639000
@NM00014 EQU   @NM00013                                                 02640000
PSARSAV  EQU   PSARSVTE+60                                              02641000
PSARSTK  EQU   PSARSVTE+56                                              02642000
PSAESAV3 EQU   PSARSVTE+52                                              02643000
PSAESTK3 EQU   PSARSVTE+48                                              02644000
PSAESAV2 EQU   PSARSVTE+44                                              02645000
PSAESTK2 EQU   PSARSVTE+40                                              02646000
PSAESAV1 EQU   PSARSVTE+36                                              02647000
PSAESTK1 EQU   PSARSVTE+32                                              02648000
PSAPSAV  EQU   PSARSVTE+28                                              02649000
PSAPSTK  EQU   PSARSVTE+24                                              02650000
PSAMSAV  EQU   PSARSVTE+20                                              02651000
PSAMSTK  EQU   PSARSVTE+16                                              02652000
PSASSAV  EQU   PSARSVTE+12                                              02653000
PSASSTK  EQU   PSARSVTE+8                                               02654000
PSANSTK  EQU   PSARSVTE+4                                               02655000
@NM00012 EQU   STPSW+2                                                  02656000
@NM00011 EQU   KEYWMP                                                   02657000
PKEY     EQU   KEYWMP                                                   02658000
MASKS    EQU   STPSW                                                    02659000
WSALACHP EQU   WSAL+56                                                  02660000
WSALRSM  EQU   WSAL+52                                                  02661000
WSALEVNT EQU   WSAL+48                                                  02662000
WSALSTAT EQU   WSAL+40                                                  02663000
WSALWAIT EQU   WSAL+36                                                  02664000
WSALPOST EQU   WSAL+32                                                  02665000
WSALEXIT EQU   WSAL+28                                                  02666000
WSALS2EE EQU   WSAL+24                                                  02667000
WSALCIRB EQU   WSAL+20                                                  02668000
WSALABTM EQU   WSAL+16                                                  02669000
WSALSDMP EQU   WSAL+12                                                  02670000
WSALRTM2 EQU   WSAL+8                                                   02671000
WSALVALC EQU   WSAL+4                                                   02672000
WSALCWSA EQU   WSAL                                                     02673000
ASXBEND  EQU   ASXB+232                                                 02674000
ASXBRV25 EQU   ASXB+228                                                 02675000
ASXBRV24 EQU   ASXB+224                                                 02676000
ASXBPT0E EQU   ASXB+220                                                 02677000
ASXBCRB4 EQU   ASXBCASW+3                                               02678000
ASXBCRB3 EQU   ASXBCASW+2                                               02679000
ASXBCRB2 EQU   ASXBCASW+1                                               02680000
ASXBCR06 EQU   ASXBCRB1                                                 02681000
ASXBCR05 EQU   ASXBCRB1                                                 02682000
ASXBCR04 EQU   ASXBCRB1                                                 02683000
ASXBCR03 EQU   ASXBCRB1                                                 02684000
ASXBCR02 EQU   ASXBCRB1                                                 02685000
ASXBCR01 EQU   ASXBCRB1                                                 02686000
ASXBTFD  EQU   ASXBCRB1                                                 02687000
ASXBPIP  EQU   ASXBCRB1                                                 02688000
ASXBCTDC EQU   ASXB+212                                                 02689000
ASXBTDCB EQU   ASXB+208                                                 02690000
ASXBRV19 EQU   ASXB+204                                                 02691000
ASXBSENV EQU   ASXBSECR+1                                               02692000
ASXBRV34 EQU   ASCBSFLG                                                 02693000
ASXBRV33 EQU   ASCBSFLG                                                 02694000
ASXBRV32 EQU   ASCBSFLG                                                 02695000
ASXBRV31 EQU   ASCBSFLG                                                 02696000
ASXBRV30 EQU   ASCBSFLG                                                 02697000
ASXBRV29 EQU   ASCBSFLG                                                 02698000
ASXBRV28 EQU   ASCBSFLG                                                 02699000
ASXBRV27 EQU   ASCBSFLG                                                 02700000
ASXBUSER EQU   ASXB+192                                                 02701000
ASXBLSRB EQU   ASXBAEQ+20                                               02702000
ASXBFSRB EQU   ASXBAEQ+16                                               02703000
ASXBLRQE EQU   ASXBAEQ+12                                               02704000
ASXBFRQE EQU   ASXBAEQ+8                                                02705000
ASXBLIQE EQU   ASXBAEQ+4                                                02706000
ASXBFIQE EQU   ASXBAEQ                                                  02707000
ASXBETSK EQU   ASXB+164                                                 02708000
ASXBSIRB EQU   ASXB+160                                                 02709000
ASXBPSWD EQU   ASXB+152                                                 02710000
ASXBPRG  EQU   ASXB+136                                                 02711000
ASXBRV26 EQU   ASXB+132                                                 02712000
ASXBOUSB EQU   ASXB+128                                                 02713000
ASXBDDR  EQU   ASXB+124                                                 02714000
ASXBRCTD EQU   ASXB+120                                                 02715000
ASXBRSMD EQU   ASXB+116                                                 02716000
ASXBFRWA EQU   ASXB+108                                                 02717000
ASXBFLSA EQU   ASXB+36                                                  02718000
ASXBIHSA EQU   ASXB+32                                                  02719000
ASXBRV15 EQU   ASXB+28                                                  02720000
ASXBRV14 EQU   ASXB+24                                                  02721000
ASXBLWA  EQU   ASXB+20                                                  02722000
ASXBMPST EQU   ASXB+16                                                  02723000
ASXBRS00 EQU   ASXB+14                                                  02724000
ASXBTCBS EQU   ASXB+12                                                  02725000
ASXBLTCB EQU   ASXB+8                                                   02726000
ASXBFTCB EQU   ASXB+4                                                   02727000
ASXBASXB EQU   ASXB                                                     02728000
ASXBEGIN EQU   ASXB                                                     02729000
ASCBEND  EQU   ASCB+208                                                 02730000
ASCBSRBT EQU   ASCB+200                                                 02731000
ASCBSWTL EQU   ASCB+196                                                 02732000
ASCBRS14 EQU   ASCB+195                                                 02733000
ASCBSMCT EQU   ASCB+194                                                 02734000
ASCBRS12 EQU   ASCB+192                                                 02735000
ASCBPCTT EQU   ASCB+188                                                 02736000
ASCBVGTT EQU   ASCB+184                                                 02737000
ASCBRV43 EQU   ASCBSRQ4                                                 02738000
ASCBRV42 EQU   ASCBSRQ4                                                 02739000
ASCBRV41 EQU   ASCBSRQ4                                                 02740000
ASCBRV40 EQU   ASCBSRQ4                                                 02741000
ASCBRV39 EQU   ASCBSRQ4                                                 02742000
ASCBRV38 EQU   ASCBSRQ4                                                 02743000
ASCBRV37 EQU   ASCBSRQ4                                                 02744000
ASCBRV36 EQU   ASCBSRQ4                                                 02745000
ASCBRV35 EQU   ASCBSRQ3                                                 02746000
ASCBRV34 EQU   ASCBSRQ3                                                 02747000
ASCBRV33 EQU   ASCBSRQ3                                                 02748000
ASCBRV32 EQU   ASCBSRQ3                                                 02749000
ASCBRV31 EQU   ASCBSRQ3                                                 02750000
ASCBRV30 EQU   ASCBSRQ3                                                 02751000
ASCBRV29 EQU   ASCBSRQ3                                                 02752000
ASCBRV28 EQU   ASCBSRQ3                                                 02753000
ASCBRV27 EQU   ASCBSRQ2                                                 02754000
ASCBRV26 EQU   ASCBSRQ2                                                 02755000
ASCBRV25 EQU   ASCBSRQ2                                                 02756000
ASCBRV24 EQU   ASCBSRQ2                                                 02757000
ASCBRV23 EQU   ASCBSRQ2                                                 02758000
ASCBRV22 EQU   ASCBSRQ2                                                 02759000
ASCBRV21 EQU   ASCBSRQ2                                                 02760000
ASCBRV20 EQU   ASCBSRQ2                                                 02761000
ASCBRV19 EQU   ASCBSRQ1                                                 02762000
ASCBRV18 EQU   ASCBSRQ1                                                 02763000
ASCBRV17 EQU   ASCBSRQ1                                                 02764000
ASCBRV16 EQU   ASCBSRQ1                                                 02765000
ASCBRV15 EQU   ASCBSRQ1                                                 02766000
ASCBRV14 EQU   ASCBSRQ1                                                 02767000
ASCBRV13 EQU   ASCBSRQ1                                                 02768000
ASCBSTA  EQU   ASCBSRQ1                                                 02769000
ASCBJBNS EQU   ASCB+176                                                 02770000
ASCBJBNI EQU   ASCB+172                                                 02771000
ASCBMCC  EQU   ASCB+168                                                 02772000
ASCBRTWA EQU   ASCB+164                                                 02773000
ASCBIQEA EQU   ASCB+160                                                 02774000
ASCBXMPQ EQU   ASCB+156                                                 02775000
ASCBRS01 EQU   ASCB+154                                                 02776000
ASCBFMCT EQU   ASCB+152                                                 02777000
ASCBOUXB EQU   ASCB+148                                                 02778000
ASCBOUCB EQU   ASCB+144                                                 02779000
ASCBMECB EQU   ASCB+140                                                 02780000
ASCBQECB EQU   ASCB+136                                                 02781000
ASCBLSQH EQU   ASCBLKGP+4                                               02782000
ASCBLOCK EQU   ASCBLKGP                                                 02783000
ASCBTCBS EQU   ASCB+124                                                 02784000
ASCBNVSC EQU   ASCB+122                                                 02785000
ASCBVSC  EQU   ASCB+120                                                 02786000
ASCBSRBS EQU   ASCB+118                                                 02787000
ASCBSSRB EQU   ASCB+116                                                 02788000
ASCBRV06 EQU   ASCBFLG2                                                 02789000
ASCBRV05 EQU   ASCBFLG2                                                 02790000
ASCBRV04 EQU   ASCBFLG2                                                 02791000
ASCBSNQS EQU   ASCBFLG2                                                 02792000
ASCBS2S  EQU   ASCBFLG2                                                 02793000
ASCBCEXT EQU   ASCBFLG2                                                 02794000
ASCBPXMT EQU   ASCBFLG2                                                 02795000
ASCBXMPT EQU   ASCBFLG2                                                 02796000
ASCBRF07 EQU   ASCBDSP1                                                 02797000
ASCBRF06 EQU   ASCBDSP1                                                 02798000
ASCBRF05 EQU   ASCBDSP1                                                 02799000
ASCBRF04 EQU   ASCBDSP1                                                 02800000
ASCBRF03 EQU   ASCBDSP1                                                 02801000
ASCBRF02 EQU   ASCBDSP1                                                 02802000
ASCBFAIL EQU   ASCBDSP1                                                 02803000
ASCBNOQ  EQU   ASCBDSP1                                                 02804000
ASCBSWCT EQU   ASCB+112                                                 02805000
ASCBTMCH EQU   ASCB+104                                                 02806000
ASCBNSWP EQU   ASCBFLG1                                                 02807000
ASCBTYP1 EQU   ASCBFLG1                                                 02808000
ASCBSTND EQU   ASCBFLG1                                                 02809000
ASCBABNT EQU   ASCBFLG1                                                 02810000
ASCBTERM EQU   ASCBFLG1                                                 02811000
ASCBS3S  EQU   ASCBFLG1                                                 02812000
ASCBCMSH EQU   ASCBFLG1                                                 02813000
ASCBTOFF EQU   ASCBFLG1                                                 02814000
ASCBRF01 EQU   ASCBRCTF                                                 02815000
ASCBTMLW EQU   ASCBRCTF                                                 02816000
ASCBOUT  EQU   ASCBRCTF                                                 02817000
ASCBWAIT EQU   ASCBRCTF                                                 02818000
ASCBRV08 EQU   ASCBRCTF                                                 02819000
ASCBFQU  EQU   ASCBRCTF                                                 02820000
ASCBFRS  EQU   ASCBRCTF                                                 02821000
ASCBTMNO EQU   ASCBRCTF                                                 02822000
ASCBAFFN EQU   ASCBFW1                                                  02823000
ASCBDUMP EQU   ASCB+96                                                  02824000
ASCBRV44 EQU   ASCB+92                                                  02825000
ASCBUBET EQU   ASCB+88                                                  02826000
ASCBECB  EQU   ASCB+84                                                  02827000
ASCBJSTL EQU   ASCB+80                                                  02828000
ASCBEWST EQU   ASCB+72                                                  02829000
ASCBEJST EQU   ASCB+64                                                  02830000
ASCBTSB  EQU   ASCB+60                                                  02831000
ASCBCSCB EQU   ASCB+56                                                  02832000
ASCBRSMA EQU   ASCBRSM+1                                                02833000
ASCBRV54 EQU   ASCBRSMF                                                 02834000
ASCBRV53 EQU   ASCBRSMF                                                 02835000
ASCBRV52 EQU   ASCBRSMF                                                 02836000
ASCBRV51 EQU   ASCBRSMF                                                 02837000
ASCBVEQR EQU   ASCBRSMF                                                 02838000
ASCBN2LP EQU   ASCBRSMF                                                 02839000
ASCB1LPU EQU   ASCBRSMF                                                 02840000
ASCB2LPU EQU   ASCBRSMF                                                 02841000
ASCBLDA  EQU   ASCB+48                                                  02842000
ASCBSTOR EQU   ASCB+44                                                  02843000
ASCBDP   EQU   ASCB+43                                                  02844000
ASCBRV07 EQU   ASCB+42                                                  02845000
ASCBIOSM EQU   ASCB+40                                                  02846000
ASCBSEQN EQU   ASCB+38                                                  02847000
ASCBASID EQU   ASCB+36                                                  02848000
ASCBCPUS EQU   ASCB+32                                                  02849000
ASCBSPL  EQU   ASCB+28                                                  02850000
ASCBIOSP EQU   ASCB+24                                                  02851000
ASCBSYNC EQU   ASCBSUPC+4                                               02852000
ASCBSVRB EQU   ASCBSUPC                                                 02853000
ASCBCMSF EQU   ASCB+12                                                  02854000
ASCBBWDP EQU   ASCB+8                                                   02855000
ASCBFWDP EQU   ASCB+4                                                   02856000
ASCBASCB EQU   ASCB                                                     02857000
ASCBEGIN EQU   ASCB                                                     02858000
SCBRSVRE EQU   SCBDATA+3                                                02859000
@NM00084 EQU   SCBFLGS3                                                 02860000
SCBTERMO EQU   SCBFLGS3                                                 02861000
SCBPRNTR EQU   SCBFLGS3                                                 02862000
SCBRECRD EQU   SCBFLGS3                                                 02863000
@NM00083 EQU   SCBFLGS3                                                 02864000
@NM00082 EQU   SCBFLGS2                                                 02865000
@NM00081 EQU   SCBFLGS2                                                 02866000
@NM00080 EQU   SCBFLGS2                                                 02867000
@NM00079 EQU   SCBFLGS2                                                 02868000
SCBPARMA EQU   SCBPARM+1                                                02869000
SCBHALT  EQU   SCBIOPRC                                                 02870000
SCBNOIOP EQU   SCBIOPRC                                                 02871000
SCBASYNC EQU   SCBFLGS1                                                 02872000
@NM00078 EQU   SCBFLGS1                                                 02873000
SCBDUMMY EQU   SCBFLGS1                                                 02874000
SVRBEND  EQU   RBSECT+192                                               02875000
SIRBEND  EQU   RBSECT+168                                               02876000
RBRSV158 EQU   RBRSV150                                                 02877000
RBRSV157 EQU   RBRSV150                                                 02878000
RBRSV156 EQU   RBRSV150                                                 02879000
RBRSV155 EQU   RBRSV150                                                 02880000
RBRSV154 EQU   RBRSV150                                                 02881000
RBRSV153 EQU   RBRSV150                                                 02882000
RBRSV152 EQU   RBRSV150                                                 02883000
RBRSV151 EQU   RBRSV150                                                 02884000
RBRSV149 EQU   RBSECT+166                                               02885000
RBRSV148 EQU   RBSECT+164                                               02886000
RBRSV169 EQU   RBSDATA+3                                                02887000
RBSID    EQU   RBSDATA+2                                                02888000
RBSPKEY  EQU   RBSDATA+1                                                02889000
RBRSV168 EQU   RBSFLG3                                                  02890000
RBSTERMO EQU   RBSFLG3                                                  02891000
RBSBRNTR EQU   RBSFLG3                                                  02892000
RBSPRNTR EQU   RBSFLG3                                                  02893000
RBSCNCEL EQU   RBSFLG3                                                  02894000
RBSRECRD EQU   RBSFLG3                                                  02895000
RBSTERMI EQU   RBSFLG3                                                  02896000
RBRSV167 EQU   RBSFLG3                                                  02897000
RBSOWNRA EQU   RBSOWNR+1                                                02898000
RBSSUPER EQU   RBSFLGS2                                                 02899000
RBSKEY0  EQU   RBSFLGS2                                                 02900000
RBRSV166 EQU   RBSFLGS2                                                 02901000
RBRSV165 EQU   RBSFLGS2                                                 02902000
RBSINUSE EQU   RBSFLGS2                                                 02903000
RBRSV164 EQU   RBSFLGS2                                                 02904000
RBSXCTL2 EQU   RBSFLGS2                                                 02905000
RBRSV163 EQU   RBSFLGS2                                                 02906000
RBSPARMA EQU   RBSPARM+1                                                02907000
RBSHALT  EQU   RBSIOPRC                                                 02908000
RBSNOIOP EQU   RBSIOPRC                                                 02909000
RBSASYNC EQU   RBSFLGS1                                                 02910000
RBRSV162 EQU   RBSFLGS1                                                 02911000
RBSESTAE EQU   RBSFLGS1                                                 02912000
RBSDUMMY EQU   RBSFLGS1                                                 02913000
RBSSTAR  EQU   RBSFLGS1                                                 02914000
RBSSTAI  EQU   RBSFLGS1                                                 02915000
RBSEXIT  EQU   RBSCBB+4                                                 02916000
RBSCHAIN EQU   RBSCBB                                                   02917000
TIRBEND  EQU   @NM00076+8                                               02918000
PRBEND   EQU   @NM00076+8                                               02919000
RBRSV146 EQU   RBRSV138                                                 02920000
RBRSV145 EQU   RBRSV138                                                 02921000
RBRSV144 EQU   RBRSV138                                                 02922000
RBRSV143 EQU   RBRSV138                                                 02923000
RBRSV142 EQU   RBRSV138                                                 02924000
RBRSV141 EQU   RBRSV138                                                 02925000
RBRSV140 EQU   RBRSV138                                                 02926000
RBRSV139 EQU   RBRSV138                                                 02927000
RBRSV137 EQU   @NM00076+6                                               02928000
RBRSV136 EQU   @NM00076+4                                               02929000
RBRSV135 EQU   @NM00076                                                 02930000
@NM00075 EQU   RBSECT+32                                                02931000
@NM00074 EQU   @NM00072+1                                               02932000
RBSCF    EQU   @NM00073                                                 02933000
RBPGMQ1  EQU   RBPGMQ+1                                                 02934000
@NM00071 EQU   RBPGMQ                                                   02935000
@NM00070 EQU   RBSECT+16                                                02936000
@NM00069 EQU   @NM00065                                                 02937000
@NM00068 EQU   @NM00065                                                 02938000
RBIQETP  EQU   @NM00065                                                 02939000
RBUSIQE  EQU   RBETXR                                                   02940000
RBATTN   EQU   @NM00065                                                 02941000
@NM00067 EQU   @NM00065                                                 02942000
@NM00066 EQU   @NM00065                                                 02943000
RBPMSVRB EQU   @NM00063                                                 02944000
RBATNXIT EQU   @NM00063                                                 02945000
@NM00064 EQU   @NM00063                                                 02946000
RBWAITP  EQU   @NM00063                                                 02947000
RBFNSVRB EQU   RBTRSVRB                                                 02948000
RBFTP    EQU   @NM00063                                                 02949000
RBSIZE   EQU   RBSECT+8                                                 02950000
RBABOPSW EQU   RBSECT+4                                                 02951000
RBPPSAV1 EQU   RBPPSAV+1                                                02952000
@NM00061 EQU   RBPPSAV                                                  02953000
RBPRFXND EQU   RBPREFIX+64                                              02954000
RBINLNTH EQU   RBINTCDA                                                 02955000
RBWCSA   EQU   RBPREFIX+60                                              02956000
RBRSV004 EQU   RBPREFIX+57                                              02957000
RBSSSYN  EQU   RBFLAGS1                                                 02958000
RBLONGWT EQU   RBFLAGS1                                                 02959000
RBASIR   EQU   RBFLAGS1                                                 02960000
RBRSV159 EQU   RBFLAGS1                                                 02961000
RBABEND  EQU   RBFLAGS1                                                 02962000
RBXWAIT  EQU   RBFLAGS1                                                 02963000
RBSLOCK  EQU   RBFLAGS1                                                 02964000
RBRTRAN  EQU   RBRTPSW2+4                                               02965000
RBRTINCD EQU   RBRTICIL+2                                               02966000
RBRTILC  EQU   RBRTICIL+1                                               02967000
RBRSV160 EQU   RBRTICIL                                                 02968000
RBRTPSW1 EQU   RBRTOPSW                                                 02969000
RBRSV062 EQU   RBRSV054                                                 02970000
RBRSV061 EQU   RBRSV054                                                 02971000
RBRSV060 EQU   RBRSV054                                                 02972000
RBRSV059 EQU   RBRSV054                                                 02973000
RBRSV058 EQU   RBRSV054                                                 02974000
RBRSV057 EQU   RBRSV054                                                 02975000
RBRSV056 EQU   RBRSV054                                                 02976000
RBRSV055 EQU   RBRSV054                                                 02977000
RBRSV053 EQU   RBPREFIX+38                                              02978000
RBRSV052 EQU   RBPREFIX+36                                              02979000
RBRSV051 EQU   RBPREFIX+32                                              02980000
RBPRFXST EQU   RBPREFIX+32                                              02981000
RBRSV050 EQU   RBPREFIX+28                                              02982000
RBRSV049 EQU   RBRSV041                                                 02983000
RBRSV048 EQU   RBRSV041                                                 02984000
RBRSV047 EQU   RBRSV041                                                 02985000
RBRSV046 EQU   RBRSV041                                                 02986000
RBRSV045 EQU   RBRSV041                                                 02987000
RBRSV044 EQU   RBRSV041                                                 02988000
RBRSV043 EQU   RBRSV041                                                 02989000
RBRSV042 EQU   RBRSV041                                                 02990000
RBRSV040 EQU   RBPREFIX+26                                              02991000
RBRSV039 EQU   RBPREFIX+24                                              02992000
RBRSV038 EQU   RBPREFIX+20                                              02993000
RBRSV037 EQU   RBPREFIX+16                                              02994000
RBRSV036 EQU   RBRSV028                                                 02995000
RBRSV035 EQU   RBRSV028                                                 02996000
RBRSV034 EQU   RBRSV028                                                 02997000
RBRSV033 EQU   RBRSV028                                                 02998000
RBRSV032 EQU   RBRSV028                                                 02999000
RBRSV031 EQU   RBRSV028                                                 03000000
RBRSV030 EQU   RBRSV028                                                 03001000
RBRSV029 EQU   RBRSV028                                                 03002000
RBRSV027 EQU   RBRSV019                                                 03003000
RBRSV026 EQU   RBRSV019                                                 03004000
RBRSV025 EQU   RBRSV019                                                 03005000
RBRSV024 EQU   RBRSV019                                                 03006000
RBRSV023 EQU   RBRSV019                                                 03007000
RBRSV022 EQU   RBRSV019                                                 03008000
RBRSV021 EQU   RBRSV019                                                 03009000
RBRSV020 EQU   RBRSV019                                                 03010000
RBRSV018 EQU   RBPREFIX+13                                              03011000
RBRSV017 EQU   RBPREFIX+12                                              03012000
RBSRV016 EQU   RBPREFIX+11                                              03013000
RBRSV015 EQU   RBPREFIX+10                                              03014000
RBRSV014 EQU   RBPREFIX+8                                               03015000
RBRSV013 EQU   RBPREFIX+4                                               03016000
RBRSV012 EQU   RBPREFIX                                                 03017000
RBEXSAVE EQU   XRBESA                                                   03018000
XRBREG15 EQU   RBGRS15                                                  03019000
XRBREG14 EQU   RBGRS14                                                  03020000
XRBREG13 EQU   RBGRS13                                                  03021000
XRBREG12 EQU   RBGRS12                                                  03022000
XRBREG11 EQU   RBGRS11                                                  03023000
XRBREG10 EQU   RBGRS10                                                  03024000
XRBREG9  EQU   RBGRS9                                                   03025000
XRBREG8  EQU   RBGRS8                                                   03026000
XRBREG7  EQU   RBGRS7                                                   03027000
XRBREG6  EQU   RBGRS6                                                   03028000
XRBREG5  EQU   RBGRS5                                                   03029000
XRBREG4  EQU   RBGRS4                                                   03030000
XRBREG3  EQU   RBGRS3                                                   03031000
XRBREG2  EQU   RBGRS2                                                   03032000
XRBREG1  EQU   RBGRS1                                                   03033000
XRBREG0  EQU   RBGRS0                                                   03034000
XRBLNKA  EQU   RBLINKB                                                  03035000
XRBWT    EQU   RBWCF                                                    03036000
@NM00060 EQU   RBBASIC+24                                               03037000
RBOPSWPS EQU   RBOPSWB2                                                 03038000
@NM00059 EQU   RBOPSWB2                                                 03039000
@NM00058 EQU   XRBPSW                                                   03040000
@NM00057 EQU   RBBASIC+12                                               03041000
XRBWAIT  EQU   RBECBWT                                                  03042000
XRBFRRB  EQU   RBFDYN                                                   03043000
@NM00056 EQU   XSTAB2                                                   03044000
XRBACTV  EQU   RBFACTV                                                  03045000
XRBTCBP  EQU   RBTCBNXT                                                 03046000
@NM00055 EQU   XSTAB1                                                   03047000
XRBCKPT  EQU   RBFTCKPT                                                 03048000
@NM00054 EQU   XSTAB1                                                   03049000
@NM00053 EQU   RBBASIC+8                                                03050000
@NM00052 EQU   RBEXRTNM+1                                               03051000
RBTMIND3 EQU   RBTMFLD                                                  03052000
RBTMIND2 EQU   RBTMFLD                                                  03053000
RBTMCMP  EQU   RBTMFLD                                                  03054000
RBWLIM   EQU   RBTMFLD                                                  03055000
RBRSV005 EQU   RBTMFLD                                                  03056000
RBTMTOD  EQU   RBTMFLD                                                  03057000
RBTMQUE  EQU   RBTMFLD                                                  03058000
@NM00051 EQU   RBPRFX                                                   03059000
@NM00050 EQU   TCBXTNT2+32                                              03060000
TCBRV181 EQU   TCBRV173                                                 03061000
TCBRV180 EQU   TCBRV173                                                 03062000
TCBRV179 EQU   TCBRV173                                                 03063000
TCBRV178 EQU   TCBRV173                                                 03064000
TCBRV177 EQU   TCBRV173                                                 03065000
TCBRV176 EQU   TCBRV173                                                 03066000
TCBRV175 EQU   TCBRV173                                                 03067000
TCBRV174 EQU   TCBRV173                                                 03068000
TCBRV172 EQU   TCBRV164                                                 03069000
TCBRV171 EQU   TCBRV164                                                 03070000
TCBRV170 EQU   TCBRV164                                                 03071000
TCBRV169 EQU   TCBRV164                                                 03072000
TCBRV168 EQU   TCBRV164                                                 03073000
TCBRV167 EQU   TCBRV164                                                 03074000
TCBRV166 EQU   TCBRV164                                                 03075000
TCBRV165 EQU   TCBRV164                                                 03076000
TCBRV163 EQU   TCBRV155                                                 03077000
TCBRV162 EQU   TCBRV155                                                 03078000
TCBRV161 EQU   TCBRV155                                                 03079000
TCBRV160 EQU   TCBRV155                                                 03080000
TCBRV159 EQU   TCBRV155                                                 03081000
TCBRV158 EQU   TCBRV155                                                 03082000
TCBRV157 EQU   TCBRV155                                                 03083000
TCBRV156 EQU   TCBRV155                                                 03084000
TCBRV154 EQU   TCBRV146                                                 03085000
TCBRV153 EQU   TCBRV146                                                 03086000
TCBRV152 EQU   TCBRV146                                                 03087000
TCBRV151 EQU   TCBRV146                                                 03088000
TCBRV150 EQU   TCBRV146                                                 03089000
TCBRV149 EQU   TCBRV146                                                 03090000
TCBRV148 EQU   TCBRV146                                                 03091000
TCBRV147 EQU   TCBRV146                                                 03092000
TCBRV145 EQU   TCBXTNT2+26                                              03093000
TCBRV144 EQU   TCBXTNT2+24                                              03094000
TCBCAUF  EQU   TCBXTNT2+20                                              03095000
TCBRV142 EQU   TCBXTNT2+16                                              03096000
TCBRSV49 EQU   TCBXTNT2+12                                              03097000
TCBEVENT EQU   TCBXTNT2+8                                               03098000
TCBRCMP  EQU   TCBXTNT2+5                                               03099000
TCBRSVAB EQU   TCBXTNT2+4                                               03100000
TCBGTFA  EQU   TCBGTF+1                                                 03101000
TCBRSV47 EQU   TCBTFLG                                                  03102000
TCBRSV46 EQU   TCBTFLG                                                  03103000
TCBRSV45 EQU   TCBTFLG                                                  03104000
TCBRSV44 EQU   TCBTFLG                                                  03105000
TCBRSV43 EQU   TCBTFLG                                                  03106000
TCBDSPIT EQU   TCBTFLG                                                  03107000
TCBERRTN EQU   TCBTFLG                                                  03108000
TCBASYNC EQU   TCBTFLG                                                  03109000
@NM00049 EQU   TCB+296                                                  03110000
TCBSVCA2 EQU   TCB+292                                                  03111000
TCBSWASA EQU   TCB+288                                                  03112000
TCBDBTB  EQU   TCB+284                                                  03113000
TCBRPT   EQU   TCB+280                                                  03114000
TCBRV141 EQU   TCBRV133                                                 03115000
TCBRV140 EQU   TCBRV133                                                 03116000
TCBRV139 EQU   TCBRV133                                                 03117000
TCBRV138 EQU   TCBRV133                                                 03118000
TCBRV137 EQU   TCBRV133                                                 03119000
TCBRV136 EQU   TCBRV133                                                 03120000
TCBRV135 EQU   TCBRV133                                                 03121000
TCBRV134 EQU   TCBRV133                                                 03122000
TCBRV132 EQU   TCBRV124                                                 03123000
TCBRV131 EQU   TCBRV124                                                 03124000
TCBRV130 EQU   TCBRV124                                                 03125000
TCBRV129 EQU   TCBRV124                                                 03126000
TCBRV128 EQU   TCBRV124                                                 03127000
TCBRV127 EQU   TCBRV124                                                 03128000
TCBRV126 EQU   TCBRV124                                                 03129000
TCBRV125 EQU   TCBRV124                                                 03130000
TCBRV123 EQU   TCBFBYT2                                                 03131000
TCBRV122 EQU   TCBFBYT2                                                 03132000
TCBECBNV EQU   TCBFBYT2                                                 03133000
TCBSSSYN EQU   TCBFBYT2                                                 03134000
TCBFPRAP EQU   TCBFBYT2                                                 03135000
TCBFDW   EQU   TCBFBYT2                                                 03136000
TCBFMW   EQU   TCBFBYT2                                                 03137000
TCBCNCB  EQU   TCBFBYT2                                                 03138000
TCBLLH   EQU   TCBFBYT1                                                 03139000
TCBRV113 EQU   TCBFBYT1                                                 03140000
TCBEOT   EQU   TCBFBYT1                                                 03141000
TCBRTM2  EQU   TCBFBYT1                                                 03142000
TCBPGNLY EQU   TCBFBYT1                                                 03143000
TCBNDIOS EQU   TCBFBYT1                                                 03144000
TCBRV327 EQU   TCBFBYT1                                                 03145000
TCBEOTFM EQU   TCBFBYT1                                                 03146000
TCBAFFN  EQU   TCB+274                                                  03147000
TCBRV326 EQU   TCB+272                                                  03148000
TCBUKYSP EQU   TCB+268                                                  03149000
TCBMODE  EQU   TCBESTAE+3                                               03150000
TCBERTYP EQU   TCBESTAE+2                                               03151000
TCBRV314 EQU   TCBESTRM                                                 03152000
TCBRV313 EQU   TCBESTRM                                                 03153000
TCBRV312 EQU   TCBESTRM                                                 03154000
TCBRV311 EQU   TCBESTRM                                                 03155000
TCBRV310 EQU   TCBESTRM                                                 03156000
TCBRV309 EQU   TCBESTRM                                                 03157000
TCBSCBKY EQU   TCBESTAE                                                 03158000
TCBRTM12 EQU   TCB+260                                                  03159000
TCBTCBID EQU   TCB+256                                                  03160000
TCBSWA   EQU   TCB+248                                                  03161000
TCBFOEA  EQU   TCBFOE+1                                                 03162000
TCBRSV42 EQU   TCBFOE                                                   03163000
TCBCCPVI EQU   TCBXSCT+2                                                03164000
TCBRV325 EQU   TCBXSCT+1                                                03165000
TCBRV324 EQU   TCBXSCT1                                                 03166000
TCBRV323 EQU   TCBXSCT1                                                 03167000
TCBRV322 EQU   TCBXSCT1                                                 03168000
TCBRV321 EQU   TCBXSCT1                                                 03169000
TCBRV320 EQU   TCBXSCT1                                                 03170000
TCBRV319 EQU   TCBXSCT1                                                 03171000
TCBS3A   EQU   TCBXSCT1                                                 03172000
TCBACTIV EQU   TCBXSCT1                                                 03173000
TCBRSV41 EQU   TCB+239                                                  03174000
TCBTID   EQU   TCB+238                                                  03175000
TCBRSVAA EQU   TCB+237                                                  03176000
TCBABCUR EQU   TCB+236                                                  03177000
TCBTMSAV EQU   TCB+232                                                  03178000
TCBIOTIM EQU   TCB+228                                                  03179000
TCBRTWA  EQU   TCB+224                                                  03180000
TCBBACK  EQU   TCB+220                                                  03181000
TCBTIRB  EQU   TCB+216                                                  03182000
TCBAECB  EQU   TCB+212                                                  03183000
TCBEXT2A EQU   TCBEXT2+1                                                03184000
TCBRSV39 EQU   TCBEXT2                                                  03185000
TCBSTMCT EQU   TCB+207                                                  03186000
TCBSYSCT EQU   TCB+206                                                  03187000
TCBRSV37 EQU   TCB+205                                                  03188000
TCBEXSVC EQU   TCBDAR                                                   03189000
TCBDARMS EQU   TCBDAR                                                   03190000
TCBDARWT EQU   TCBDAR                                                   03191000
TCBDARO  EQU   TCBDAR                                                   03192000
TCBDARMC EQU   TCBDARC                                                  03193000
TCBDARD  EQU   TCBDAR                                                   03194000
TCBDARS  EQU   TCBDAR                                                   03195000
TCBDARP  EQU   TCBDAR                                                   03196000
TCBGTOFM EQU   TCBFLGS7                                                 03197000
TCBADMP  EQU   TCBFLGS7                                                 03198000
TCBRSTSK EQU   TCBFLGS7                                                 03199000
TCBSVCS  EQU   TCBFLGS7                                                 03200000
TCBSTACK EQU   TCBFLGS7                                                 03201000
TCBRSV34 EQU   TCBFLGS7                                                 03202000
TCBRSV33 EQU   TCBFLGS7                                                 03203000
TCBGPECB EQU   TCBFLGS7                                                 03204000
TCBNTJS  EQU   TCBFLGS6                                                 03205000
TCBAPG   EQU   TCBFLGS6                                                 03206000
TCBMIGR  EQU   TCBFLGS6                                                 03207000
TCBRV303 EQU   TCBFLGS6                                                 03208000
TCBSPVLK EQU   TCBFLGS6                                                 03209000
TCBCPU   EQU   TCBFLGS6                                                 03210000
TCBPIE17 EQU   TCBFLGS6                                                 03211000
TCBRV    EQU   TCBFLGS6                                                 03212000
TCBRSV79 EQU   TCBNDSP5                                                 03213000
TCBRSV78 EQU   TCBNDSP5                                                 03214000
TCBRSV77 EQU   TCBNDSP5                                                 03215000
TCBRSV76 EQU   TCBNDSP5                                                 03216000
TCBRSV75 EQU   TCBNDSP5                                                 03217000
TCBRSV74 EQU   TCBNDSP5                                                 03218000
TCBRSV95 EQU   TCBNDSP5                                                 03219000
TCBRSV94 EQU   TCBNDSP5                                                 03220000
TCBRSV93 EQU   TCBNDSP4                                                 03221000
TCBRSV92 EQU   TCBNDSP4                                                 03222000
TCBRSV91 EQU   TCBNDSP4                                                 03223000
TCBRSV90 EQU   TCBNDSP4                                                 03224000
TCBRSV89 EQU   TCBNDSP4                                                 03225000
TCBRSV88 EQU   TCBNDSP4                                                 03226000
TCBRSV87 EQU   TCBNDSP4                                                 03227000
TCBRSV86 EQU   TCBNDSP4                                                 03228000
TCBEXT1A EQU   TCBEXT1+1                                                03229000
TCBRSV32 EQU   TCBEXT1                                                  03230000
TCBEXCPD EQU   TCB+192                                                  03231000
TCBIOBRC EQU   TCB+188                                                  03232000
TCBDDWTC EQU   TCB+186                                                  03233000
TCBDDEXC EQU   TCB+184                                                  03234000
TCBJSCBB EQU   TCBJSCB+1                                                03235000
@NM00048 EQU   TCBRECDE                                                 03236000
TCBREC   EQU   TCBRECDE                                                 03237000
TCBMDIDS EQU   TCB+176                                                  03238000
TCBNDINT EQU   TCBNDSP3                                                 03239000
TCBRSV27 EQU   TCBNDSP3                                                 03240000
TCBRSV26 EQU   TCBNDSP3                                                 03241000
TCBRSV25 EQU   TCBNDSP3                                                 03242000
TCBRSV24 EQU   TCBNDSP3                                                 03243000
TCBSRBND EQU   TCBNDSP3                                                 03244000
TCBRV302 EQU   TCBNDSP3                                                 03245000
TCBLJSND EQU   TCBNDSP3                                                 03246000
TCBABE   EQU   TCBNDSP2                                                 03247000
TCBDSS   EQU   TCBNDSP2                                                 03248000
TCBOWAIT EQU   TCBNDSP2                                                 03249000
TCBIWAIT EQU   TCBNDSP2                                                 03250000
TCBNDTS  EQU   TCBNDSP2                                                 03251000
TCBNDSVC EQU   TCBNDSP2                                                 03252000
TCBSTPP  EQU   TCBNDSP2                                                 03253000
TCBABD   EQU   TCBNDSP2                                                 03254000
TCBRSV22 EQU   TCBNDSP1                                                 03255000
TCBPIEND EQU   TCBNDSP1                                                 03256000
TCBTPSP  EQU   TCBNDSP1                                                 03257000
TCBDDRND EQU   TCBNDSP1                                                 03258000
TCBRSPND EQU   TCBNDSP1                                                 03259000
TCBRSTND EQU   TCBNDSP1                                                 03260000
TCBDARPN EQU   TCBNDSP1                                                 03261000
TCBDARTN EQU   TCBNDSP1                                                 03262000
TCBNDSP0 EQU   TCBNDSP                                                  03263000
TCBUSER  EQU   TCB+168                                                  03264000
TCBTCTB  EQU   TCBTCT+1                                                 03265000
TCBRSV9C EQU   TCBTCTGF                                                 03266000
TCBRSV9B EQU   TCBTCTGF                                                 03267000
TCBRSV9A EQU   TCBTCTGF                                                 03268000
TCBRSV99 EQU   TCBTCTGF                                                 03269000
TCBRSV98 EQU   TCBTCTGF                                                 03270000
TCBRSV97 EQU   TCBTCTGF                                                 03271000
TCBRSV20 EQU   TCBTCTGF                                                 03272000
TCBSMFGF EQU   TCBTCTGF                                                 03273000
TCBSTCUR EQU   TCBNSTAE                                                 03274000
TCBRV301 EQU   TCBNSTAE                                                 03275000
TCBSYNCH EQU   TCBNSTAE                                                 03276000
TCBHALT  EQU   TCBNSTAE                                                 03277000
TCBPPSUP EQU   TCBNSTAE                                                 03278000
TCB33E   EQU   TCBNSTAE                                                 03279000
TCBQUIES EQU   TCBNSTAE                                                 03280000
TCBAQE   EQU   TCB+156                                                  03281000
TCBPQE   EQU   TCB+152                                                  03282000
TCBTSDP  EQU   TCB+151                                                  03283000
TCBTSLP  EQU   TCB+150                                                  03284000
TCBSTPCT EQU   TCB+149                                                  03285000
TCBCPUBN EQU   TCBTSFLG                                                 03286000
TCBDYDSP EQU   TCBTSFLG                                                 03287000
TCBRSV18 EQU   TCBTSFLG                                                 03288000
TCBRSV17 EQU   TCBTSFLG                                                 03289000
TCBTIOTG EQU   TCBTSFLG                                                 03290000
TCBATT   EQU   TCBTSFLG                                                 03291000
TCBSTPPR EQU   TCBTSFLG                                                 03292000
TCBRV300 EQU   TCBTSTSK                                                 03293000
TCBECB   EQU   TCB+144                                                  03294000
TCBIQE   EQU   TCB+140                                                  03295000
TCBLTC   EQU   TCB+136                                                  03296000
TCBOTC   EQU   TCB+132                                                  03297000
TCBNTC   EQU   TCB+128                                                  03298000
TCBJSTCA EQU   TCBJSTCB+1                                               03299000
TCBRSV16 EQU   TCBJSTCB                                                 03300000
TCBTQET  EQU   TCBTME                                                   03301000
TCBTCB   EQU   TCB+116                                                  03302000
TCBFSAB  EQU   TCBFSA+1                                                 03303000
TCBQEL   EQU   TCBFSA                                                   03304000
TCBGRS15 EQU   TCBGRS+60                                                03305000
TCBGRS14 EQU   TCBGRS+56                                                03306000
TCBGRS13 EQU   TCBGRS+52                                                03307000
TCBGRS12 EQU   TCBGRS+48                                                03308000
TCBGRS11 EQU   TCBGRS+44                                                03309000
TCBGRS10 EQU   TCBGRS+40                                                03310000
TCBGRS9  EQU   TCBGRS+36                                                03311000
TCBGRS8  EQU   TCBGRS+32                                                03312000
TCBGRS7  EQU   TCBGRS+28                                                03313000
TCBGRS6  EQU   TCBGRS+24                                                03314000
TCBGRS5  EQU   TCBGRS+20                                                03315000
TCBGRS4  EQU   TCBGRS+16                                                03316000
TCBGRS3  EQU   TCBGRS+12                                                03317000
TCBGRS2  EQU   TCBGRS+8                                                 03318000
TCBGRS1  EQU   TCBGRS+4                                                 03319000
TCBGRS0  EQU   TCBGRS                                                   03320000
TCBJPQB  EQU   TCBJPQ+1                                                 03321000
TCBRSV15 EQU   TCBPURGE                                                 03322000
TCBRSV14 EQU   TCBPURGE                                                 03323000
TCBRSV13 EQU   TCBPURGE                                                 03324000
TCBRSV12 EQU   TCBPURGE                                                 03325000
TCBRSV11 EQU   TCBPURGE                                                 03326000
TCBRSV10 EQU   TCBPURGE                                                 03327000
TCBRSV09 EQU   TCBPURGE                                                 03328000
TCBJPQF  EQU   TCBPURGE                                                 03329000
TCBJLB   EQU   TCB+40                                                   03330000
TCBLLS   EQU   TCB+36                                                   03331000
TCBDSP   EQU   TCB+35                                                   03332000
TCBLMP   EQU   TCB+34                                                   03333000
TCBPNDSP EQU   TCBFLGS5                                                 03334000
TCBFCD1  EQU   TCBFLGS5                                                 03335000
TCBSTP   EQU   TCBFLGS5                                                 03336000
TCBSYS   EQU   TCBFLGS5                                                 03337000
TCBANDSP EQU   TCBFLGS5                                                 03338000
TCBPAGE  EQU   TCBFLGS5                                                 03339000
TCBUXNDF EQU   TCBABWF                                                  03340000
TCBFC    EQU   TCBFLGS5                                                 03341000
TCBONDSP EQU   TCBFLGS4                                                 03342000
TCBMPCND EQU   TCBFLGS4                                                 03343000
TCBMPCVQ EQU   TCBFLGS4                                                 03344000
TCBUXNDV EQU   TCBFLGS4                                                 03345000
TCBHNDSP EQU   TCBFLGS4                                                 03346000
TCBRQENA EQU   TCBFLGS4                                                 03347000
TCBSER   EQU   TCBFLGS4                                                 03348000
TCBNDUMP EQU   TCBFLGS4                                                 03349000
TCBDWSTA EQU   TCBFLGS3                                                 03350000
TCBRSV08 EQU   TCBFLGS3                                                 03351000
TCBRSV07 EQU   TCBFLGS3                                                 03352000
TCBRSV06 EQU   TCBFLGS3                                                 03353000
TCBABGM  EQU   TCBFLGS3                                                 03354000
TCBABTRM EQU   TCBFLGS3                                                 03355000
TCBADINP EQU   TCBFLGS3                                                 03356000
TCBFSM   EQU   TCBFLGS3                                                 03357000
TCBFTS   EQU   TCBFLGS2                                                 03358000
TCBFETXR EQU   TCBFLGS2                                                 03359000
TCBFDSOP EQU   TCBFLGS2                                                 03360000
TCBFJMC  EQU   TCBFLGS2                                                 03361000
TCBFSMC  EQU   TCBFLGS2                                                 03362000
TCBFABOP EQU   TCBFLGS2                                                 03363000
TCBFSTI  EQU   TCBFLGS2                                                 03364000
TCBFOINP EQU   TCBFLGS2                                                 03365000
TCBFS    EQU   TCBFLGS1                                                 03366000
TCBFT    EQU   TCBFLGS1                                                 03367000
TCBPDUMP EQU   TCBFLGS1                                                 03368000
TCBNONPR EQU   TCBFLGS1                                                 03369000
TCBFERA  EQU   TCBFLGS1                                                 03370000
TCBFE    EQU   TCBFLGS1                                                 03371000
TCBFA    EQU   TCBFLGS1                                                 03372000
TCBZERO  EQU   TCBPKF                                                   03373000
TCBFLAG  EQU   TCBPKF                                                   03374000
TCBMSSB  EQU   TCBMSS+1                                                 03375000
TCBRSV03 EQU   TCBMSS                                                   03376000
TCBTRNB  EQU   TCBTRN+1                                                 03377000
TCBRSV02 EQU   TCBABF                                                   03378000
TCBOLTEP EQU   TCBABF                                                   03379000
TCBTCP   EQU   TCBABF                                                   03380000
TCBTCPP  EQU   TCBABF                                                   03381000
TCBRSV01 EQU   TCBABF                                                   03382000
TCBGRPH  EQU   TCBABF                                                   03383000
TCBNOCHK EQU   TCBABF                                                   03384000
TCBMOD91 EQU   TCBABF                                                   03385000
TCBCMPC  EQU   TCBCMP+1                                                 03386000
TCBRV318 EQU   TCBCMSG                                                  03387000
TCBRV317 EQU   TCBCIND                                                  03388000
TCBRV316 EQU   TCBCWTO                                                  03389000
TCBCASID EQU   TCBCDBL                                                  03390000
TCBNOCC  EQU   TCBSTCC                                                  03391000
TCBDMPO  EQU   TCBCPP                                                   03392000
TCBCSTEP EQU   TCBCMPF                                                  03393000
TCBCREQ  EQU   TCBCMPF                                                  03394000
TCBTIO   EQU   TCB+12                                                   03395000
TCBDEB   EQU   TCB+8                                                    03396000
TCBPIEA  EQU   TCBPIE+1                                                 03397000
TCBPM    EQU   TCBPMASK                                                 03398000
@NM00047 EQU   TCBPMASK                                                 03399000
TCBFRS6  EQU   TCBFRS+24                                                03400000
TCBFRS4  EQU   TCBFRS+16                                                03401000
TCBFRS2  EQU   TCBFRS+8                                                 03402000
TCBFRS0  EQU   TCBFRS                                                   03403000
CVTLEVL  EQU   CVTRELNO+2                                               03404000
CVTNUMB  EQU   CVTRELNO                                                 03405000
CVTMDL   EQU   CVTFIX+250                                               03406000
@NM00046 EQU   CVTFIX+248                                               03407000
@NM00045 EQU   CVTFIX                                                   03408000
CVTRV482 EQU   CVTXTNT2+128                                             03409000
CVTRV481 EQU   CVTXTNT2+124                                             03410000
CVTRV480 EQU   CVTXTNT2+120                                             03411000
CVTRV479 EQU   CVTXTNT2+118                                             03412000
CVTRV478 EQU   CVTXTNT2+117                                             03413000
CVTRV477 EQU   CVTXTNT2+116                                             03414000
CVTRV476 EQU   CVTXTNT2+115                                             03415000
CVTRV475 EQU   CVTXTNT2+114                                             03416000
CVTRV474 EQU   CVTRV466                                                 03417000
CVTRV473 EQU   CVTRV466                                                 03418000
CVTRV472 EQU   CVTRV466                                                 03419000
CVTRV471 EQU   CVTRV466                                                 03420000
CVTRV470 EQU   CVTRV466                                                 03421000
CVTRV469 EQU   CVTRV466                                                 03422000
CVTRV468 EQU   CVTRV466                                                 03423000
CVTRV467 EQU   CVTRV466                                                 03424000
CVTRV465 EQU   CVTRV457                                                 03425000
CVTRV464 EQU   CVTRV457                                                 03426000
CVTRV463 EQU   CVTRV457                                                 03427000
CVTRV462 EQU   CVTRV457                                                 03428000
CVTRV461 EQU   CVTRV457                                                 03429000
CVTRV460 EQU   CVTRV457                                                 03430000
CVTRV459 EQU   CVTRV457                                                 03431000
CVTRV458 EQU   CVTRV457                                                 03432000
CVTRV456 EQU   CVTXTNT2+108                                             03433000
CVTRV455 EQU   CVTXTNT2+104                                             03434000
CVTRV454 EQU   CVTXTNT2+100                                             03435000
CVTRV453 EQU   CVTXTNT2+96                                              03436000
CVTRV452 EQU   CVTXTNT2+94                                              03437000
CVTRV451 EQU   CVTXTNT2+92                                              03438000
CVTRV450 EQU   CVTXTNT2+90                                              03439000
CVTRV449 EQU   CVTXTNT2+88                                              03440000
CVTRV448 EQU   CVTXTNT2+87                                              03441000
CVTRV447 EQU   CVTXTNT2+86                                              03442000
CVTRV446 EQU   CVTRV438                                                 03443000
CVTRV445 EQU   CVTRV438                                                 03444000
CVTRV444 EQU   CVTRV438                                                 03445000
CVTRV443 EQU   CVTRV438                                                 03446000
CVTRV442 EQU   CVTRV438                                                 03447000
CVTRV441 EQU   CVTRV438                                                 03448000
CVTRV440 EQU   CVTRV438                                                 03449000
CVTRV439 EQU   CVTRV438                                                 03450000
CVTRV437 EQU   CVTRV429                                                 03451000
CVTRV436 EQU   CVTRV429                                                 03452000
CVTRV435 EQU   CVTRV429                                                 03453000
CVTRV434 EQU   CVTRV429                                                 03454000
CVTRV433 EQU   CVTRV429                                                 03455000
CVTRV432 EQU   CVTRV429                                                 03456000
CVTRV431 EQU   CVTRV429                                                 03457000
CVTRV430 EQU   CVTRV429                                                 03458000
CVTRV428 EQU   CVTXTNT2+80                                              03459000
CVTRV427 EQU   CVTXTNT2+76                                              03460000
CVTRV426 EQU   CVTXTNT2+72                                              03461000
CVTRV425 EQU   CVTXTNT2+68                                              03462000
CVTATACT EQU   CVTATCVT                                                 03463000
CVTRV423 EQU   CVTXTNT2+62                                              03464000
CVTRV422 EQU   CVTXTNT2+60                                              03465000
CVTRV421 EQU   CVTXTNT2+58                                              03466000
CVTRV420 EQU   CVTXTNT2+56                                              03467000
CVTRV419 EQU   CVTXTNT2+55                                              03468000
CVTRV418 EQU   CVTXTNT2+54                                              03469000
CVTRV417 EQU   CVTRV409                                                 03470000
CVTRV416 EQU   CVTRV409                                                 03471000
CVTRV415 EQU   CVTRV409                                                 03472000
CVTRV414 EQU   CVTRV409                                                 03473000
CVTRV413 EQU   CVTRV409                                                 03474000
CVTRV412 EQU   CVTRV409                                                 03475000
CVTRV411 EQU   CVTRV409                                                 03476000
CVTRV410 EQU   CVTRV409                                                 03477000
CVTRV408 EQU   CVTRV400                                                 03478000
CVTRV407 EQU   CVTRV400                                                 03479000
CVTRV406 EQU   CVTRV400                                                 03480000
CVTRV405 EQU   CVTRV400                                                 03481000
CVTRV404 EQU   CVTRV400                                                 03482000
CVTRV403 EQU   CVTRV400                                                 03483000
CVTRV402 EQU   CVTRV400                                                 03484000
CVTRV401 EQU   CVTRV400                                                 03485000
CVTICB   EQU   CVTXTNT2+48                                              03486000
CVTSKTA  EQU   CVTXTNT2+44                                              03487000
CVTCCVT  EQU   CVTXTNT2+40                                              03488000
CVTRSV98 EQU   CVTXTNT2+36                                              03489000
CVTRSV97 EQU   CVTXTNT2+34                                              03490000
CVTRSV96 EQU   CVTXTNT2+32                                              03491000
CVTOLTEP EQU   CVTXTNT2+28                                              03492000
CVTQIDA  EQU   CVTQID+1                                                 03493000
CVTRSV95 EQU   CVTQID                                                   03494000
CVTRSV94 EQU   CVTXTNT2+20                                              03495000
CVTRSV93 EQU   CVTXTNT2+16                                              03496000
CVTRSV92 EQU   CVTXTNT2+12                                              03497000
CVTDEBVR EQU   CVTXTNT2+8                                               03498000
CVTRSV91 EQU   CVTXTNT2+6                                               03499000
CVTRSV9H EQU   CVTFLGBT                                                 03500000
CVTRSV9G EQU   CVTFLGBT                                                 03501000
CVTRSV9F EQU   CVTFLGBT                                                 03502000
CVTRSV9E EQU   CVTFLGBT                                                 03503000
CVTRSV9D EQU   CVTFLGBT                                                 03504000
CVTRSV9C EQU   CVTFLGBT                                                 03505000
CVTVME   EQU   CVTFLGBT                                                 03506000
CVTNPE   EQU   CVTFLGBT                                                 03507000
CVTNUCLS EQU   CVTXTNT2+4                                               03508000
CVTDSSVA EQU   CVTDSSV+1                                                03509000
CVTRSV89 EQU   CVTDSSV                                                  03510000
CVTRSV88 EQU   CVTXTNT1+8                                               03511000
CVTRSV87 EQU   CVTXTNT1+4                                               03512000
CVTFACHN EQU   CVTXTNT1                                                 03513000
CVTRV488 EQU   CVTMAP+412                                               03514000
CVTRV487 EQU   CVTMAP+408                                               03515000
CVTRV486 EQU   CVTMAP+404                                               03516000
CVTRV485 EQU   CVTMAP+400                                               03517000
CVTACTAP EQU   CVTMAP+396                                               03518000
CVTAUTH  EQU   CVTMAP+392                                               03519000
CVTATMCA EQU   CVTATMCT+1                                               03520000
CVTATMST EQU   CVTATMCT                                                 03521000
CVTRSV61 EQU   CVTMAP+384                                               03522000
CVTVOLT1 EQU   CVTVOLM1+1                                               03523000
CVTVOLI1 EQU   CVTVOLF1                                                 03524000
CVTSTOA  EQU   CVTMAP+376                                               03525000
CVTRSV58 EQU   CVTMAP+374                                               03526000
CVTRSV57 EQU   CVTMAP+372                                               03527000
CVTDDCE  EQU   CVTMAP+368                                               03528000
CVTPNWFR EQU   CVTMAP+364                                               03529000
CVTSMF   EQU   CVTMAP+360                                               03530000
CVTSULK  EQU   CVTMAP+358                                               03531000
CVTSLKO  EQU   CVTSYSK                                                  03532000
CVTSLKP  EQU   CVTSYSK                                                  03533000
CVTSLKQ  EQU   CVTSYSK                                                  03534000
CVTSLKR  EQU   CVTSYSK                                                  03535000
CVTRSV56 EQU   CVTSYSK                                                  03536000
CVTRSV55 EQU   CVTSYSK                                                  03537000
CVTRSV54 EQU   CVTSYSK                                                  03538000
CVTRSV53 EQU   CVTSYSK                                                  03539000
CVTRSV52 EQU   CVTA1F1                                                  03540000
CVTRSV51 EQU   CVTA1F1                                                  03541000
CVTRSV50 EQU   CVTA1F1                                                  03542000
CVTRSV49 EQU   CVTA1F1                                                  03543000
CVTRSV48 EQU   CVTA1F1                                                  03544000
CVTRSV47 EQU   CVTA1F1                                                  03545000
CVTSRSW  EQU   CVTA1F1                                                  03546000
CVTPFSW  EQU   CVTA1F1                                                  03547000
CVTPCVT  EQU   CVTMAP+352                                               03548000
CVTRSV46 EQU   CVTMAP+344                                               03549000
CVTRSV45 EQU   CVTMAP+340                                               03550000
CVTRSV44 EQU   CVTMAP+338                                               03551000
CVTRSV43 EQU   CVTMAP+336                                               03552000
CVTHJESA EQU   CVTHJES+1                                                03553000
CVTRSV42 EQU   CVTHJES                                                  03554000
CVTEXT2A EQU   CVTEXT2+1                                                03555000
CVTRSV41 EQU   CVTEXT2                                                  03556000
CVTAPFA  EQU   CVTAPF+1                                                 03557000
CVTRSV40 EQU   CVTAPF                                                   03558000
CVTRV518 EQU   CVTINTLA                                                 03559000
CVTRV517 EQU   CVTERPV                                                  03560000
CVTEORM  EQU   CVTMAP+312                                               03561000
CVTMCHPR EQU   CVTMAP+308                                               03562000
CVTTZ    EQU   CVTMAP+304                                               03563000
CVTJEPS  EQU   CVTMAP+300                                               03564000
CVTJESCT EQU   CVTMAP+296                                               03565000
CVTMODE  EQU   CVTMAP+292                                               03566000
CVTPTRV  EQU   CVTMAP+288                                               03567000
CVTREAL  EQU   CVTMAP+284                                               03568000
CVTRSV39 EQU   CVTMAP+280                                               03569000
CVTRSV38 EQU   CVTMAP+276                                               03570000
CVTDMSRA EQU   CVTDMSR+1                                                03571000
CVTRV634 EQU   CVTDMSRF                                                 03572000
CVTRV633 EQU   CVTDMSRF                                                 03573000
CVTRV632 EQU   CVTDMSRF                                                 03574000
CVTRV631 EQU   CVTDMSRF                                                 03575000
CVTRV630 EQU   CVTDMSRF                                                 03576000
CVTRV629 EQU   CVTDMSRF                                                 03577000
CVTUDUMP EQU   CVTDMSRF                                                 03578000
CVTSDUMP EQU   CVTDMSRF                                                 03579000
CVTQMSGA EQU   CVTQMSG+1                                                03580000
CVTRSV36 EQU   CVTQMSG                                                  03581000
CVTAMFF  EQU   CVTMAP+264                                               03582000
CVTPURGA EQU   CVTPURG+1                                                03583000
CVTRSV35 EQU   CVTPURG                                                  03584000
CVTCBSP  EQU   CVTMAP+256                                               03585000
CVTATERA EQU   CVTATER+1                                                03586000
CVTSYST  EQU   CVTATER                                                  03587000
CVTVOLT2 EQU   CVTTAT                                                   03588000
CVTVOLI2 EQU   CVTVOLF2                                                 03589000
CVTAQAVB EQU   CVTAQAVT+1                                               03590000
CVTRSV34 EQU   CVTTCMFG                                                 03591000
CVTRSV33 EQU   CVTTCMFG                                                 03592000
CVTRSV32 EQU   CVTTCMFG                                                 03593000
CVTRSV31 EQU   CVTTCMFG                                                 03594000
CVTRSV30 EQU   CVTTCMFG                                                 03595000
CVTRSV29 EQU   CVTTCMFG                                                 03596000
CVTLDEV  EQU   CVTTCMFG                                                 03597000
CVTTCRDY EQU   CVTTCMFG                                                 03598000
CVTGTFA  EQU   CVTGTF+1                                                 03599000
CVTRSV27 EQU   CVTGTFST                                                 03600000
CVTRNIO  EQU   CVTGTFST                                                 03601000
CVTUSR   EQU   CVTGTFST                                                 03602000
CVTRV318 EQU   CVTFORM                                                  03603000
CVTRV317 EQU   CVTTMODE                                                 03604000
CVTRV316 EQU   CVTSTATE                                                 03605000
CVTRV315 EQU   CVTGTFS                                                  03606000
CVTGTFAV EQU   CVTGTFS                                                  03607000
CVT0SCR1 EQU   CVTMAP+232                                               03608000
CVTRV515 EQU   CVTMAP+228                                               03609000
CVTRMS   EQU   CVTMAP+224                                               03610000
CVTPATCH EQU   CVTMAP+220                                               03611000
CVTTSCE  EQU   CVTMAP+216                                               03612000
CVTLNKSC EQU   CVTMAP+214                                               03613000
CVTQABST EQU   CVTMAP+212                                               03614000
CVTMDLDS EQU   CVTMAP+208                                               03615000
CVTUSER  EQU   CVTMAP+204                                               03616000
CVTABEND EQU   CVTMAP+200                                               03617000
CVTSMCA  EQU   CVTMAP+196                                               03618000
CVTRSV18 EQU   CVTMAP+192                                               03619000
CVTQLPAQ EQU   CVTMAP+188                                               03620000
CVTQCDSR EQU   CVTMAP+184                                               03621000
CVTRSV17 EQU   CVTOPTB                                                  03622000
CVTRSV16 EQU   CVTOPTB                                                  03623000
CVTFP    EQU   CVTOPTB                                                  03624000
CVTAPTHR EQU   CVTOPTB                                                  03625000
CVTNLOG  EQU   CVTOPTB                                                  03626000
CVTTOD   EQU   CVTOPTB                                                  03627000
CVTCTIMS EQU   CVTOPTB                                                  03628000
CVTPROT  EQU   CVTOPTB                                                  03629000
CVTXPFP  EQU   CVTOPTA                                                  03630000
CVTASCII EQU   CVTOPTA                                                  03631000
CVTRSV13 EQU   CVTOPTA                                                  03632000
CVTRSV12 EQU   CVTOPTA                                                  03633000
CVTNIP   EQU   CVTOPTA                                                  03634000
CVTDDR   EQU   CVTOPTA                                                  03635000
CVTAPR   EQU   CVTOPTA                                                  03636000
CVTCCH   EQU   CVTOPTA                                                  03637000
CVTSNCTR EQU   CVTMAP+180                                               03638000
CVTQMWR  EQU   CVTMAP+176                                               03639000
CVTQOCR  EQU   CVTMAP+172                                               03640000
CVT1EF00 EQU   CVTMAP+168                                               03641000
CVTMZ00  EQU   CVTMAP+164                                               03642000
CVTSV76Q EQU   CVTSV76C                                                 03643000
CVTRSV11 EQU   CVTMAP+156                                               03644000
CVT0PT01 EQU   CVTMAP+152                                               03645000
CVTMSER  EQU   CVTMAP+148                                               03646000
CVTRV516 EQU   CVTIERLC                                                 03647000
CVTILCH  EQU   CVTMAP+140                                               03648000
CVT0DS   EQU   CVTMAP+136                                               03649000
CVTFBOSV EQU   CVTMAP+132                                               03650000
CVTNUCB  EQU   CVTMAP+128                                               03651000
CVTIXAVL EQU   CVTMAP+124                                               03652000
CVTSV76M EQU   CVTIOQET                                                 03653000
CVTDCBA  EQU   CVTMAP+117                                               03654000
CVTMVS2  EQU   CVTDCB                                                   03655000
CVT6DAT  EQU   CVTDCB                                                   03656000
CVT4MPS  EQU   CVTDCB                                                   03657000
CVTRSV09 EQU   CVTDCB                                                   03658000
CVT4MS1  EQU   CVTDCB                                                   03659000
CVT2SPS  EQU   CVTDCB                                                   03660000
CVT1SSS  EQU   CVTDCB                                                   03661000
CVTRSV08 EQU   CVTDCB                                                   03662000
CVTSTB   EQU   CVTMAP+112                                               03663000
CVTQTD00 EQU   CVTMAP+108                                               03664000
CVTQTE00 EQU   CVTMAP+104                                               03665000
CVTCUCB  EQU   CVTMAP+100                                               03666000
CVTSJQ   EQU   CVTMAP+96                                                03667000
CVTPBLDL EQU   CVTMAP+92                                                03668000
CVTTPC   EQU   CVTMAP+88                                                03669000
CVTSVDCB EQU   CVTMAP+84                                                03670000
CVTBRET  EQU   CVTMAP+82                                                03671000
CVTEXIT  EQU   CVTMAP+80                                                03672000
CVT0FN00 EQU   CVTMAP+76                                                03673000
CVTDARA  EQU   CVTDAR+1                                                 03674000
CVTRSV07 EQU   CVTFLGS1                                                 03675000
CVTRSV06 EQU   CVTFLGS1                                                 03676000
CVTRSV05 EQU   CVTFLGS1                                                 03677000
CVTRSV04 EQU   CVTFLGS1                                                 03678000
CVTRSV03 EQU   CVTFLGS1                                                 03679000
CVTRSV02 EQU   CVTFLGS1                                                 03680000
CVTRSV01 EQU   CVTFLGS1                                                 03681000
CVTDMPLK EQU   CVTFLGS1                                                 03682000
CVTXITP  EQU   CVTMAP+68                                                03683000
CVTZDTAB EQU   CVTMAP+64                                                03684000
CVTMSLT  EQU   CVTMAP+60                                                03685000
CVTDATE  EQU   CVTMAP+56                                                03686000
CVTBTERM EQU   CVTMAP+52                                                03687000
CVTSYSAD EQU   CVTMAP+48                                                03688000
CVTXTLER EQU   CVTMAP+44                                                03689000
CVTILK2  EQU   CVTMAP+40                                                03690000
CVTILK1  EQU   CVTMAP+36                                                03691000
CVTPRLTV EQU   CVTMAP+32                                                03692000
CVTPCNVT EQU   CVTMAP+28                                                03693000
CVT0VL00 EQU   CVTMAP+24                                                03694000
CVTXAPG  EQU   CVTMAP+20                                                03695000
CVTBUF   EQU   CVTMAP+16                                                03696000
CVTJOB   EQU   CVTMAP+12                                                03697000
CVTLINK  EQU   CVTMAP+8                                                 03698000
CVT0EF00 EQU   CVTMAP+4                                                 03699000
CVTTCBP  EQU   CVTMAP                                                   03700000
FRRSPARM EQU   FRRSENTR+8                                               03701000
@NM00044 EQU   FRRSFLGS+1                                               03702000
@NM00043 EQU   FRRSFLG1                                                 03703000
FRRSNEST EQU   FRRSFLG1                                                 03704000
FRRSRCUR EQU   FRRSFLG1                                                 03705000
FRRSFRRA EQU   FRRSENTR                                                 03706000
FRRSENTS EQU   FRRS+84                                                  03707000
FRRSRTMW EQU   FRRS+16                                                  03708000
FRRSELEN EQU   FRRSHEAD+8                                               03709000
FRRSLAST EQU   FRRSHEAD+4                                               03710000
FRRSEMP  EQU   FRRSHEAD                                                 03711000
ESTAFLGA EQU   @NM00017+12                                              03712000
@NM00018 EQU   @NM00017                                                 03713000
NEWPRMS  EQU   @NM00009                                                 03714000
@NM00010 EQU   @NM00009                                                 03715000
@NM00008 EQU   WKWORD+1                                                 03716000
@NM00007 EQU   ESTAWRK                                                  03717000
@NM00006 EQU   ESTAWORK+88                                              03718000
GRSVEARA EQU   ESTAWORK                                                 03719000
ESTARSVI EQU   ESTAFGRS+1                                               03720000
@NM00005 EQU   ESTAFLG2                                                 03721000
ESTABRNT EQU   ESTAFLG2                                                 03722000
@NM00004 EQU   ESTAFLG2                                                 03723000
ESTAEREC EQU   ESTAFLG2                                                 03724000
ESTATERM EQU   ESTAFLG2                                                 03725000
@NM00003 EQU   ESTAFLG2                                                 03726000
ESTAPARM EQU   ESTA+4                                                   03727000
ESTAHALT EQU   ESTAIO                                                   03728000
ESTANOIO EQU   ESTAIO                                                   03729000
ESTASYNC EQU   ESTAFLG1                                                 03730000
@NM00002 EQU   ESTAFLG1                                                 03731000
@NM00001 EQU   ESTAFLG1                                                 03732000
@NM00042 EQU   PSA+3668                                                 03733000
PSASTAK  EQU   PSA+3072                                                 03734000
@NM00041 EQU   PSA+1048                                                 03735000
PSAUSEND EQU   PSA+1048                                                 03736000
PSARV062 EQU   PSA+1044                                                 03737000
PSACDAL  EQU   PSA+1040                                                 03738000
PSAWTCOD EQU   PSA+1036                                                 03739000
PSAATCVT EQU   PSA+1032                                                 03740000
PSAPCPSW EQU   PSA+1024                                                 03741000
PSAPIR2  EQU   PSA+1020                                                 03742000
PSARV059 EQU   PSA+1018                                                 03743000
PSASVC13 EQU   PSA+1016                                                 03744000
PSALSFCC EQU   PSA+1012                                                 03745000
PSASFACC EQU   PSA+1008                                                 03746000
PSASTOP  EQU   PSA+992                                                  03747000
PSASTART EQU   PSA+976                                                  03748000
PSARSPSW EQU   PSA+968                                                  03749000
PSASRPSW EQU   PSA+960                                                  03750000
PSARV045 EQU   PSA+892                                                  03751000
PSARV044 EQU   PSA+888                                                  03752000
PSARV043 EQU   PSA+884                                                  03753000
PSARV042 EQU   PSA+880                                                  03754000
PSARV041 EQU   PSA+876                                                  03755000
PSARV040 EQU   PSA+872                                                  03756000
PSARV025 EQU   PSA+868                                                  03757000
PSADSSED EQU   PSA+868                                                  03758000
PSADSSPR EQU   PSA+864                                                  03759000
PSADSSFW EQU   PSA+860                                                  03760000
PSADSS14 EQU   PSA+856                                                  03761000
PSADSSPP EQU   PSA+848                                                  03762000
PSADSSRP EQU   PSA+840                                                  03763000
PSADSS05 EQU   PSADSSF4                                                 03764000
PSADSS10 EQU   PSADSSF4                                                 03765000
PSADSSVE EQU   PSADSSF4                                                 03766000
PSADSSDE EQU   PSADSSF4                                                 03767000
PSADSSC0 EQU   PSADSSF4                                                 03768000
PSADSSIE EQU   PSADSSF4                                                 03769000
PSADSS12 EQU   PSADSSF4                                                 03770000
PSADSSRC EQU   PSADSSF4                                                 03771000
PSARV057 EQU   PSADSSF3                                                 03772000
PSARV056 EQU   PSADSSF3                                                 03773000
PSARV055 EQU   PSADSSF3                                                 03774000
PSADSSMC EQU   PSADSSF3                                                 03775000
PSADSSRW EQU   PSADSSF3                                                 03776000
PSADSSNM EQU   PSADSSF3                                                 03777000
PSADSSES EQU   PSADSSF3                                                 03778000
PSADSSGP EQU   PSADSSF3                                                 03779000
PSADSSF2 EQU   PSADSSFL+1                                               03780000
PSADSSPI EQU   PSADSSF1                                                 03781000
PSADSSOI EQU   PSADSSF1                                                 03782000
PSADSSSP EQU   PSADSSF1                                                 03783000
PSADSSTP EQU   PSADSSF1                                                 03784000
PSADSSDW EQU   PSADSSF1                                                 03785000
PSADSSDD EQU   PSADSSF1                                                 03786000
PSADSSDM EQU   PSADSSF1                                                 03787000
PSADSSMV EQU   PSADSSF1                                                 03788000
PSADSSTS EQU   PSA+816                                                  03789000
PSADSSWK EQU   PSA+812                                                  03790000
PSADSSR3 EQU   PSA+808                                                  03791000
PSADSSR2 EQU   PSA+804                                                  03792000
PSADSSRS EQU   PSA+800                                                  03793000
PSASTOR  EQU   PSA+796                                                  03794000
PSACPUSA EQU   PSA+794                                                  03795000
PSAVSTAP EQU   PSA+792                                                  03796000
PSAWKVAP EQU   PSA+788                                                  03797000
PSAWKRAP EQU   PSA+784                                                  03798000
PSAMCHIC EQU   PSA+783                                                  03799000
PSARV061 EQU   PSA+782                                                  03800000
PSASYMSK EQU   PSA+781                                                  03801000
PSAMCHFL EQU   PSA+780                                                  03802000
PSACR0   EQU   PSA+776                                                  03803000
PSAPSWSV EQU   PSA+768                                                  03804000
PSACLHS  EQU   PSAHLHI                                                  03805000
PSALKR15 EQU   PSALKSA+60                                               03806000
PSALKR14 EQU   PSALKSA+56                                               03807000
PSALKR13 EQU   PSALKSA+52                                               03808000
PSALKR12 EQU   PSALKSA+48                                               03809000
PSALKR11 EQU   PSALKSA+44                                               03810000
PSALKR10 EQU   PSALKSA+40                                               03811000
PSALKR9  EQU   PSALKSA+36                                               03812000
PSALKR8  EQU   PSALKSA+32                                               03813000
PSALKR7  EQU   PSALKSA+28                                               03814000
PSALKR6  EQU   PSALKSA+24                                               03815000
PSALKR5  EQU   PSALKSA+20                                               03816000
PSALKR4  EQU   PSALKSA+16                                               03817000
PSALKR3  EQU   PSALKSA+12                                               03818000
PSALKR2  EQU   PSALKSA+8                                                03819000
PSALKR1  EQU   PSALKSA+4                                                03820000
PSALKR0  EQU   PSALKSA                                                  03821000
PSARV023 EQU   PSACLHT+52                                               03822000
PSALOCAL EQU   PSACLHT+48                                               03823000
PSACMSL  EQU   PSACLHT+44                                               03824000
PSAOPTL  EQU   PSACLHT+40                                               03825000
PSATPACL EQU   PSACLHT+36                                               03826000
PSATPDNL EQU   PSACLHT+32                                               03827000
PSATPNCL EQU   PSACLHT+28                                               03828000
PSAIOSLL EQU   PSACLHT+24                                               03829000
PSAIOSUL EQU   PSACLHT+20                                               03830000
PSAIOSCL EQU   PSACLHT+16                                               03831000
PSAIOSSL EQU   PSACLHT+12                                               03832000
PSASALCL EQU   PSACLHT+8                                                03833000
PSAASML  EQU   PSACLHT+4                                                03834000
PSADISPL EQU   PSACLHT                                                  03835000
PSASRSA  EQU   PSA+636                                                  03836000
PSARV050 EQU   PSA+634                                                  03837000
PSADSSGO EQU   PSA+633                                                  03838000
PSARECUR EQU   PSA+632                                                  03839000
PSAHLHIS EQU   PSA+628                                                  03840000
PSAIPCSA EQU   PSA+624                                                  03841000
@NM00040 EQU   PSA+621                                                  03842000
PSAIPCDM EQU   PSA+620                                                  03843000
PSAIPCD  EQU   PSA+616                                                  03844000
@NM00039 EQU   PSA+613                                                  03845000
PSAIPCRM EQU   PSA+612                                                  03846000
PSAIPCR  EQU   PSA+608                                                  03847000
PSAMCHEX EQU   PSA+600                                                  03848000
PSAMPSW  EQU   PSA+592                                                  03849000
PSAEXPS2 EQU   PSA+584                                                  03850000
PSAEXPS1 EQU   PSA+576                                                  03851000
PSAPIREG EQU   PSA+572                                                  03852000
PSARSREG EQU   PSA+568                                                  03853000
PSAGPREG EQU   PSA+556                                                  03854000
PSARV022 EQU   PSASUP4                                                  03855000
PSARV021 EQU   PSASUP4                                                  03856000
PSARV020 EQU   PSASUP4                                                  03857000
PSARV019 EQU   PSASUP4                                                  03858000
PSARV018 EQU   PSASUP4                                                  03859000
PSARV017 EQU   PSASUP4                                                  03860000
PSARV016 EQU   PSASUP4                                                  03861000
PSARV015 EQU   PSASUP4                                                  03862000
PSARV014 EQU   PSASUP3                                                  03863000
PSAULCMS EQU   PSASUP3                                                  03864000
PSARV012 EQU   PSASUP3                                                  03865000
PSAESTA  EQU   PSASUP3                                                  03866000
PSASPR   EQU   PSASUP3                                                  03867000
PSAPSREG EQU   PSASUP3                                                  03868000
PSAPI2   EQU   PSASUP3                                                  03869000
PSAIOSUP EQU   PSASUP3                                                  03870000
PSALCR   EQU   PSASUP2                                                  03871000
PSARTM   EQU   PSASUP2                                                  03872000
PSAACR   EQU   PSASUP2                                                  03873000
PSAIPCE2 EQU   PSASUP2                                                  03874000
PSAIPCES EQU   PSASUP2                                                  03875000
PSAIPCEC EQU   PSASUP2                                                  03876000
PSAGTF   EQU   PSASUP2                                                  03877000
PSAIPCRI EQU   PSASUP2                                                  03878000
PSATYPE6 EQU   PSASUP1                                                  03879000
PSATCTL  EQU   PSASUP1                                                  03880000
PSADISP  EQU   PSASUP1                                                  03881000
PSALOCK  EQU   PSASUP1                                                  03882000
PSAPI    EQU   PSASUP1                                                  03883000
PSAEXT   EQU   PSASUP1                                                  03884000
PSASVC   EQU   PSASUP1                                                  03885000
PSAIO    EQU   PSASUP1                                                  03886000
PSAANEW  EQU   PSA+544                                                  03887000
PSATNEW  EQU   PSA+536                                                  03888000
PSALCCAR EQU   PSA+532                                                  03889000
PSALCCAV EQU   PSA+528                                                  03890000
PSAPCCAR EQU   PSA+524                                                  03891000
PSAPCCAV EQU   PSA+520                                                  03892000
PSACPULA EQU   PSA+518                                                  03893000
PSACPUPA EQU   PSA+516                                                  03894000
PSAPSA   EQU   PSA+512                                                  03895000
FLCHDEND EQU   PSA+512                                                  03896000
FLCCRSAV EQU   FLCMCLA+280                                              03897000
FLCGRSAV EQU   FLCMCLA+216                                              03898000
FLCFPSAV EQU   FLCMCLA+184                                              03899000
FLCFLA   EQU   FLCMCLA+88                                               03900000
FLCRGNCD EQU   FLCMCLA+84                                               03901000
FLCFSAA  EQU   FLCFSA+1                                                 03902000
@NM00038 EQU   FLCFSA                                                   03903000
@NM00037 EQU   FLCMCLA+72                                               03904000
FLCMCIC  EQU   FLCMCLA+64                                               03905000
@NM00036 EQU   FLCMCLA+20                                               03906000
FLCIOAA  EQU   FLCIOA+1                                                 03907000
@NM00035 EQU   FLCIOA                                                   03908000
@NM00034 EQU   FLCMCLA+15                                               03909000
@NM00033 EQU   FLCMCLA+14                                               03910000
@NM00032 EQU   FLCMCLA+12                                               03911000
FLCLCL   EQU   FLCMCLA+8                                                03912000
FLCIOELA EQU   FLCIOEL+1                                                03913000
@NM00031 EQU   FLCIOEL                                                  03914000
FLCCHNID EQU   FLCMCLA                                                  03915000
@NM00030 EQU   PSA+160                                                  03916000
FLCMTRCD EQU   PSA+157                                                  03917000
@NM00029 EQU   PSA+156                                                  03918000
FLCPERA  EQU   FLCPER+1                                                 03919000
@NM00028 EQU   FLCPER                                                   03920000
@NM00027 EQU   PSA+151                                                  03921000
FLCPERCD EQU   PSA+150                                                  03922000
FLCMCNUM EQU   PSA+149                                                  03923000
@NM00026 EQU   PSA+148                                                  03924000
FLCTEAA  EQU   FLCTEA+1                                                 03925000
@NM00025 EQU   FLCTEA                                                   03926000
PSAPIPC  EQU   PSAPICOD                                                 03927000
PSAPIMC  EQU   PSAPICOD                                                 03928000
PSAPIPER EQU   PSAPICOD                                                 03929000
PSARV049 EQU   FLCPICOD                                                 03930000
FLCPILCB EQU   FLCPIILC                                                 03931000
@NM00024 EQU   FLCPIILC                                                 03932000
@NM00023 EQU   PSAEPPSW                                                 03933000
FLCSVCN  EQU   PSAESPSW+2                                               03934000
FLCSILCB EQU   FLCSVILC                                                 03935000
@NM00022 EQU   FLCSVILC                                                 03936000
@NM00021 EQU   PSAESPSW                                                 03937000
FLCEICOD EQU   PSAEEPSW+2                                               03938000
PSASPAD  EQU   PSAEEPSW                                                 03939000
@NM00020 EQU   PSA+128                                                  03940000
FLCINPSW EQU   PSA+120                                                  03941000
FLCMNPSW EQU   PSA+112                                                  03942000
FLCPNPSW EQU   PSA+104                                                  03943000
FLCSNPSW EQU   PSA+96                                                   03944000
FLCENPSW EQU   PSA+88                                                   03945000
FLCTRACE EQU   PSA+84                                                   03946000
FLCTIMER EQU   PSA+80                                                   03947000
FLCCVT2  EQU   PSA+76                                                   03948000
FLCCAW   EQU   PSA+72                                                   03949000
FLCCSW   EQU   PSA+64                                                   03950000
FLCIOPSW EQU   PSA+56                                                   03951000
FLCMOPSW EQU   PSA+48                                                   03952000
FLCPOPSW EQU   PSA+40                                                   03953000
FLCSOPSW EQU   PSA+32                                                   03954000
FLCEOPSW EQU   PSA+24                                                   03955000
@NM00019 EQU   FLCICCW2+4                                               03956000
FLCICCW1 EQU   FLCROPSW                                                 03957000
FLCIPPSW EQU   FLCRNPSW                                                 03958000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03959000
@RF00096 EQU   PROPROC                                                  03960000
@RC00112 EQU   @RC00110                                                 03961000
@RF00127 EQU   @RC00103                                                 03962000
@RF00129 EQU   @RC00103                                                 03963000
@RF00157 EQU   @RC00155                                                 03964000
@RT00163 EQU   RETCOD8                                                  03965000
@RT00165 EQU   RETCOD8                                                  03966000
@RT00167 EQU   RETCOD10                                                 03967000
@RT00169 EQU   RETCOD10                                                 03968000
@RT00174 EQU   PERFCAN                                                  03969000
@RF00211 EQU   PERFORM                                                  03970000
@RC00336 EQU   @EL00001                                                 03971000
@RT00348 EQU   @EL00002                                                 03972000
@RC00350 EQU   @EL00002                                                 03973000
@RT00367 EQU   CKRC4                                                    03974000
@RT00369 EQU   CKRC4                                                    03975000
@RT00373 EQU   @EL00003                                                 03976000
@RT00377 EQU   @EL00003                                                 03977000
@RF00380 EQU   RETCODC                                                  03978000
@RT00389 EQU   CKABND                                                   03979000
@RT00391 EQU   CKABND                                                   03980000
@RT00393 EQU   CKABND                                                   03981000
@RF00397 EQU   RETCODC                                                  03982000
@RC00421 EQU   @EL00005                                                 03983000
@RC00490 EQU   @EC00515                                                 03984000
@RF00510 EQU   @EC00515                                                 03985000
@RF00628 EQU   RETCOD4                                                  03986000
@ENDDATA EQU   *                                                        03987000
         END   IGC00060,(C'PLS1306',0800,78081)                         03988000
