         TITLE 'IEA0EF00- STAGE 1 EXIT EFFECTOR                        *00001000
                        '                                               00002000
*                                                               02S0002 00003000
*/*  START OF SPECIFICATIONS ****                               02S0002 00004000
*                                                               02S0002 00005000
*01*  MODULE-NAME = IEAVEEE2                                    02S0002 00006000
*                                                               02S0002 00007000
*02*     CSECT-NAME = IEA0EF00                                  02S0002 00008000
*                                                               02S0002 00009000
*01*  DESCRIPTIVE-NAME = STAGE 2 EXIT EFFECTOR                  02S0002 00010000
*                                                               02S0002 00011000
*01*  COPYRIGHT = NONE                                          02S0002 00012000
*01*  STATUS = CHANGE LEVEL 0                                   02S0002 00013000
*                                                               02S0002 00014000
*01*  FUNCTION = THE FUNCTION OF STAGE 2 EXIT EFFECTOR IS TO QUEUE A    00015000
*     REQUEST TO SCHEDULE AN ASYNCHRONOUS EXIT. STAGE 3 EXIT EFFECTOR , 00016000
*     ENTERED FROM THE DISPATCHER, WILL LATER PROCESS THOSE REQUESTS.   00017000
*     THE CALLER OF STAGE 2 WILL PASS EITHER AN SRB, AN RQE, OR AN IQE. 00018000
*     IQES REPRESENT GENERAL REQUESTS FOR SCHEDULING OF THE     02S0002 00019000
*     ASYNCHRONOUS EXIT. RQES ARE SPECIAL REQUESTS BY DATA MANAGEMENT   00020000
*     ROUTINES, GENERALLY SCHEDULED OUT OF I/O  APPENDAGE ROUTINES.     00021000
*     SRBS REPRESENT A SPECIAL REQUEST BY IOS TO SCHEDULE AN ERROR      00022000
*     RECOVERY PROCEDURE TO GET CONTROL UNDER A SPECIAL 'ERROR TASK' IN 00023000
*     THE ADDRESS SPACE.                                        02S0002 00024000
*     STAGE 2 WILL MERELY PLACE THE ELEMENT ON THE CORRECT QUEUE.       00025000
*                                                               02S0002 00026000
*02*     OPERATION =                                            02S0002 00027000
*        1.  IT WILL DETERMINE WHICH ELEMENT HAS BEEN PASSED TO  IT,    00028000
*        AN IQE, RQE, OR SRB.  IT WILL THEN PLACE THE ELEMENT ON THE    00029000
*        CORRECT QUEUE.                                         02S0002 00030000
*        2.  IT WILL THEN SET TWO SWITCHES, THE STAGE 2 SWITCH AND THE  00031000
*        STAGE 3 SWITCH. THE STAGE 3 SWITCH IS TESTED BY THE    02S0002 00032000
*        DISPATCHER. IT INDICATES TO HIM THAT THERE ARE ELEMENTS ON ONE 00033000
*        OF THE QUEUES, AND THUS THAT THE ADDRESS SPACE MAY HAVE        00034000
*        AVAILABLE WORK.  THIS SWITCH IS TURNED OFF BY STAGE 3 WHEN IT  00035000
*        HAS EMPTIED THE QUEUES. THE STAGE 2 SWITCH INDICATES THAT      00036000
*        SOMEONE HAS CALLED STAGE 2 EXIT EFFECTOR WITHOUT A     02S0002 00037000
*        CORRESPONDING ENTRY TO STAGE 3. LOCK MANAGER TESTS THIS SWITCH 00038000
*        WHEN RELEASING THE LOCAL LOCK.  IF IT IS ON, THEN LOCK MANAGER 00039000
*        WILL CALL MEMORY SWITCH FOR THAT ADDRESS SPACE. THIS SWITCH IS 00040000
*        TURNED OFF UNCONDITIONALLY BY STAGE 3 EXIT EFFECTOR ON EVERY   00041000
*        ENTRY.                                                 02S0002 00042000
*                                                               02S0002 00043000
*01*   NOTES =                                                  02S0002 00044000
*                                                               02S0002 00045000
*02*     DEPENDENCIES =                                         02S0002 00046000
*        1.  THE CALLER MUST HOLD THE LOCAL LOCK                02S0002 00047000
*        2.  THE CALLER MUST BE ADDRESSABLE TO THE ADDRESS SPACE IN     00048000
*        WHICH THE ASYNCHRONOUS EXIT WILL BE DISPATCHED.        02S0002 00049000
*                                                               02S0002 00050000
*03*        CHARACTER-CODE-DEPENDENCIES = NO CHARACTER CODE     02S0002 00051000
*           DEPENDENCIES.                                       02S0002 00052000
*                                                               02S0002 00053000
*02*     RESTRICTIONS =                                         02S0002 00054000
*        1. THE CALLER MUST BE IN SUPERVISOR STATE, KEY ZERO.   02S0002 00055000
*                                                               02S0002 00056000
*02*     REGISTER-CONVENTIONS = REGISTER USAGE IS DECLARED IN THE       00057000
*        SEGMENT LABELED 'DECLARES'.                            02S0002 00058000
*                                                               02S0002 00059000
*02*     PATCH-LABEL = NONE                                     02S0002 00060000
*                                                               02S0002 00061000
*01*  MODULE-TYPE = PROCEDURE                                   02S0002 00062000
*                                                               02S0002 00063000
*02*     PROCESSOR = PLS2                                       02S0002 00064000
*                                                               02S0002 00065000
*02*     MODULE-SIZE = 250 BYTES                                02S0002 00066000
*                                                               02S0002 00067000
*02*     ATTRIBUTES = NUCLEUS,ZERO PROTECT KEY, REFRESHABLE, SUPERVISOR 00068000
*        MODE                                                   02S0002 00069000
*                                                               02S0002 00070000
*01*  ENTRY-POINT = IEA0EF00                                    02S0002 00071000
*                                                               02S0002 00072000
*02*     PURPOSE = MAIN ENTRY, TO QUEUE A REQUEST FOR SCHEDULING OF AN  00073000
*        ASYNCHRONOUS EXIT.                                     02S0002 00074000
*                                                               02S0002 00075000
*02*     LINKAGE =                                              02S0002 00076000
*        REGISTER 0 = ADDRESS OF SRB, IF AN SRB IS BEING PASSED.        00077000
*        OTHERWISE, IRRELEVANT.                                 02S0002 00078000
*        REGISTER 1 = 0 , IF AN SRB ADDRESS IS BEING PASSED IN R0       00079000
*                   = COMPLEMENTED ADDR OF AN IQE, IF AN IQE IS BEING   00080000
*                   PASSED.                                     02S0002 00081000
*                   = TRUE ADDRESS OF  AND RQE, IF AN RQE IS BEING      00082000
*                   PASSED.                                     02S0002 00083000
*        REGISTER 14 = RETURN ADDRESS TO THE CALLER.            02S0002 00084000
*                                                               02S0002 00085000
*02*     INPUT = NONE                                           02S0002 00086000
*02*     OUTPUT = NONE                                          02S0002 00087000
*02*     REGISTERS-SAVED = REGISTERS 0-9,11-15 ARE SAVED AT THIS ENTRY  00088000
*        POINT.                                                 02S0002 00089000
*                                                               02S0002 00090000
*                                                               02S0002 00091000
*02*     REGISTERS-RESTORED = REGISTER 0, REGISTERS 2-9,11-15 RESTORED  00092000
*        O                                                      02S0002 00093000
*                                                               02S0002 00094000
*01*  EXIT-NORMAL = CALLER                                      02S0002 00095000
*                                                               02S0002 00096000
*02*     CONDITIONS = RETURN IS ALWAYS TO CALLER, TO ADDRESS POINTED TO 00097000
*        BY REGISTER 14. CONTROL WILL BE RETURNED IN THE SAME MODE,KEY  00098000
*        AND LOCK STATUS AS ON ENTRY.                           02S0002 00099000
*                                                               02S0002 00100000
*02*     OUTPUT =                                               02S0002 00101000
*        REGISTER 0  = UNCHANGED.                               02S0002 00102000
*        REGISTER 1  = TRUE ADDRESS OF IQE, RQE, OR SRB.        02S0002 00103000
*        REGISTERS 2-9,11-15  = UNCHANGED.                      02S0002 00104000
*        REGISTER 10 = VOLATILE.                                02S0002 00105000
*                                                               02S0002 00106000
*02*     RETURN-CODES = NONE                                    02S0002 00107000
*                                                               02S0002 00108000
*01*  EXIT-ERROR = NONE                                         02S0002 00109000
*                                                               02S0002 00110000
*01*  EXTERNAL-REFERENCES =                                     02S0002 00111000
*                                                               02S0002 00112000
*02*     ROUTINES = NONE                                        02S0002 00113000
*                                                               02S0002 00114000
*02*     DATA-AREAS = THE SAVE AREA POINTED TO BY WSALS2EE IS USED TO   00115000
*        SAVE REGISTERS. THIS AREA IS 80 BYTES LONG, AND IS SHARED WITH 00116000
*        STAGE 3 EXIT EFFECTOR.                                 02S0002 00117000
*                                                               02S0002 00118000
*02*     CONTROL-BLOCKS = PSA (R), ASCB (W), ASXB(W), IQE (W), RQE (W), 00119000
*        SRB (W) , DEB(R)                                       02S0002 00120000
*                                                               02S0002 00121000
*01*  TABLES = NONE                                             02S0002 00122000
*01*  MACROS = NONE                                             02S0002 00123000
*                                                               02S0002 00124000
*02*    SERIALIZATION = NO LOCKS OR ENQ RESOURCES ARE OBTAINED. 02S0002 00125000
*                                                               02S0002 00126000
*01*  CHANGE-ACTIVITY = (Y02751,Y02752)                         02S0002 00127000
*                                                               02S0002 00128000
*01*  MESSAGES = NONE                                           02S0002 00129000
*01*  ABEND-CODES = NONE                                        02S0002 00130000
**** END OF SPECIFICATIONS **                                        */ 00131000
*                                                               02S0002 00132000
*   ;                                                           02S0002 00133000
*   GEN CODE;                                                   01S0003 00134000
*                                                               01S0003 00135000
IEA0EF00  CSECT                                                         00136000
*   /*****************************************************************/ 00137000
*   /*                                                               */ 00138000
*   /* DECLARES                                                      */ 00139000
*   /*                                                               */ 00140000
*   /*****************************************************************/ 00141000
*                                                               01S0004 00142000
*                                                               02S0004 00143000
*/********************************************************************  00144000
*                                                                    */ 00145000
*/* DECLARES-                                                        */ 00146000
*/*  THIS SEGMENT CONTAINS ALL THE DECLARE STATEMENTS                */ 00147000
*/********************************************************************  00148000
*                                                                    */ 00149000
*                                                               02S0004 00150000
*   /*****************************************************************/ 00151000
*   /*                                                               */ 00152000
*   /* REGISTERS                                                     */ 00153000
*   /*                                                               */ 00154000
*   /*****************************************************************/ 00155000
*                                                               02S0004 00156000
*   DCL                                                         02S0004 00157000
*     RQEPTR PTR(31) REG(1) RSTD;   /* POINTS TO THE RQE             */ 00158000
*   DCL                                                         02S0005 00159000
*     R1 PTR(31) REG(1) RSTD;       /* REGISTER 1                    */ 00160000
*   DCL                                                         02S0006 00161000
*     R1A FIXED(31) REG(1) RSTD;    /* ARITHMETIC EQUIVALENT OF R1   */ 00162000
*   DCL                                                         02S0007 00163000
*     IQEPTR PTR(31) REG(1) RSTD;   /* BASE FOR IQE                  */ 00164000
*   DCL                                                         02S0008 00165000
*     SRBPTR PTR(31) REG(1) RSTD;   /* BASE FOR SRB                  */ 00166000
*   DCL                                                         02S0009 00167000
*     R0 PTR(31) REG(0) RSTD;       /* REGISTER 0                    */ 00168000
*   DCL                                                         02S0010 00169000
*     WAPTR PTR(31) REG(3) RSTD;    /* POINTER TO STAGE 2 WKAREA     */ 00170000
*   DCL                                                         02S0011 00171000
*     ASXBPTR PTR(31) REG(7) RSTD;  /* POINTS TO THE ASXB            */ 00172000
*   DCL                                                         02S0012 00173000
*     ASCBPTR PTR(31) REG(8) RSTD;  /* POINTS TO THE ASCB            */ 00174000
*   DCL                                                         02S0013 00175000
*     R10 REG(10) PTR(31) RSTD;     /* REGISTER 10                   */ 00176000
*   DCL                                                         02S0014 00177000
*     R11 REG(11) PTR(31);          /* REGISTER 11                   */ 00178000
*   DCL                                                         02S0015 00179000
*     R12 REG(12) PTR(31);          /* REGISTER 12                   */ 00180000
*   DCL                                                         02S0016 00181000
*     R13 REG(13) PTR(31);          /* REGISTER 13                   */ 00182000
*                                                               02S0016 00183000
*   /*****************************************************************/ 00184000
*   /*                                                               */ 00185000
*   /* CONSTANTS                                                     */ 00186000
*   /*                                                               */ 00187000
*   /*****************************************************************/ 00188000
*                                                               02S0017 00189000
*   DCL                                                         02S0017 00190000
*     ON BIT(1) CONSTANT('1'B);     /* SWITCH ON                     */ 00191000
*   DCL                                                         02S0018 00192000
*     OFF BIT(1) CONSTANT('1'B);    /* SWITCH OFF                    */ 00193000
*   DCL                                                         02S0019 00194000
*     NULL CHAR(24) INIT('00'X);    /* COMPARED AGAINST ASXBAEQ      */ 00195000
*   DCL                                                         02S0020 00196000
*     YES FIXED(31) CONSTANT(0);    /* POSITIVE SWITCH               */ 00197000
*   DCL                                                         02S0021 00198000
*     NO FIXED(31) CONSTANT(4);     /* NEGATIVE SWITCH               */ 00199000
*   DCL                                                         02S0022 00200000
*     CVTPTR DEFINED(FLCCVT);       /* POINTS TO CVT                 */ 00201000
*   DCL                                                         02S0023 00202000
*     DEBPTR PTR(31) DEFINED(RQEDEB);/* BASE FOR DEB         @YM01424*/ 00203000
*   DCL                                                         02S0024 00204000
*    (DEBDAPTR,                                                 02S0024 00205000
*     DEBEXPTR,                                                 02S0024 00206000
*     DEBSBPTR) PTR(31) REG(15);    /* DUMMY SYMBOLS TO SATISFY 02S0024 00207000
*                                      MAPPING MACRO                 */ 00208000
*                                                               02S0024 00209000
*   /*****************************************************************/ 00210000
*   /*                                                               */ 00211000
*   /* MAPPING MACROS                                                */ 00212000
*   /*                                                               */ 00213000
*   /*****************************************************************/ 00214000
*                                                               02S0025 00215000
*                                                               03S0025 00216000
*/*            INTERRUPTION QUEUE ELEMENT - I.Q.E.        LEVEL=1    */ 00217000
*                                                               03S0025 00218000
*   DECLARE                                                     03S0025 00219000
*     1 IQESECT BASED(IQEPTR),                                  03S0025 00220000
*      2 IQELNK PTR(31) BDY(BYTE),  /* .WORD REFERENCE FOR IQELNKA   */ 00221000
*       3 IQESTAT1 CHAR(1),         /* .1 BYTE RESERVED              */ 00222000
*       3 IQELNKA PTR(24) BDY(BYTE),/* .ADDR NEXT IQE                */ 00223000
*      2 IQEPARAM PTR(31),          /* .PARMS TO BE PASSED TO ASYN      00224000
*                                      EXIT RTN                      */ 00225000
*      2 IQEIRB PTR(31) BDY(BYTE),  /* .WORD REFERENCE FOR IQEIRBA   */ 00226000
*       3 IQEFLAGS CHAR(1),         /* .FLAG FIELD                   */ 00227000
*        4 IQEPURGE BIT(1),         /* .THIS IQE MUST NOT BE    03S0025 00228000
*                                      SCHEDULED                     */ 00229000
*        4 * BIT(1),                /* RESERVED                      */ 00230000
*        4 * BIT(1),                /* RESERVED                      */ 00231000
*        4 * BIT(1),                /* RESERVED                      */ 00232000
*        4 * BIT(1),                /* RESERVED                      */ 00233000
*        4 * BIT(1),                /* RESERVED                      */ 00234000
*        4 * BIT(1),                /* RESERVED                      */ 00235000
*        4 * BIT(1),                /* RESERVED                      */ 00236000
*       3 IQEIRBA PTR(24) BDY(BYTE),/* .ADDR IRB TO BE SCHEDULED     */ 00237000
*      2 IQETCB PTR(31) BDY(BYTE),  /* .WORD REFERENCE FOR IQETCBA   */ 00238000
*       3 IQESTAT2 CHAR(1),         /* .1 BYTE RESERVED              */ 00239000
*       3 IQETCBA PTR(24) BDY(BYTE),/* .ADDR TCB ASSOCIATED WITH THIS   00240000
*                                      IQE                           */ 00241000
*/*     THE FOLLOWING IS IN BEHALF OF S.M.F.                         */ 00242000
*                                                               03S0025 00243000
*      2 IQEDCB PTR(31),            /* .ADDR OF DCB                  */ 00244000
*      2 IQEOUTLM PTR(31);          /* .ADDR OF OUTPUT LIMIT         */ 00245000
*   DECLARE                                                     03S0026 00246000
*     1 IQEEND(*) CHAR(1) BASED(ADDR(IQESECT)+LENGTH(IQESECT));/*       00247000
*                                      .END OF IQE              03S0026 00248000
*                                                                    */ 00249000
*                                                               03S0027 00250000
*/********************************************************************/ 00251000
*/*                                                                  */ 00252000
*/* THIS DSECT DESCRIBES THE CONTROL BLOCK USED WITHIN THE EXCP PROC-*/ 00253000
*/* ESSOR TO DEFINE A SINGLE REQUEST. IT CONTAINS ALL INFORMATION    */ 00254000
*/* NECESSARY TO INITIATE AND TERMINATE I/O REQUESTS WITHIN THE EXCP */ 00255000
*/* PROCESSOR.                                                       */ 00256000
*/*                                                                  */ 00257000
*/********************************************************************/ 00258000
*                                                               03S0027 00259000
*   DECLARE                                                     03S0027 00260000
*     1 RQE BDY(WORD) BASED(RQEPTR),/* REQUEST QUEUE ELEMENT FOR EXCP*/ 00261000
*      2 RQEUCB PTR(31),            /* ADDRESS OF THE UNIT CONTROL      00262000
*                                      BLOCK.                        */ 00263000
*      2 RQEIOB PTR(31),            /* ADDRESS OF THE INPUT OUTPUT      00264000
*                                      BLOCK                         */ 00265000
*      2 RQEDEB PTR(31),            /* ADDRESS OF THE DATA EXTENT       00266000
*                                      BLOCK                         */ 00267000
*      2 RQETCB PTR(31),            /* ADDRESS OF THE TASK CONTROL      00268000
*                                      BLOCK                         */ 00269000
*      2 RQETCCW PTR(31),           /* ADDRESS OF THE TRANSLATION IS    00270000
*                                      CONTROL BLOCK - THIS FIELD       00271000
*                                      USED BY VIO AS A WORK AREA.   */ 00272000
*      2 RQENRQE PTR(31),           /* ADDRESS OF NEXT RQE ON RELATED   00273000
*                                      REQUEST QUEUE - THIS FIELD IS    00274000
*                                      USED BY VIO AS A WORK AREA.   */ 00275000
*      2 RQERRQ PTR(31),            /* ADDRESS OF THE RELATED REQUEST   00276000
*                                      QUEUE - USED BY VIO AS A WORK    00277000
*                                      AREA                          */ 00278000
*      2 RQESRB PTR(31),            /* ADDRESS OF SRB - USED BY VIO     00279000
*                                      AS A WORK AREA.               */ 00280000
*      2 RQEIPIB PTR(31),           /* ADDRESS OF IOS PURGE INTERFACE   00281000
*                                      BLOCK.                        */ 00282000
*      2 RQEPRT BIT(8),             /* PROTECTION KEY USED IN THE    */ 00283000
*       3 RQEPKEY BIT(4),           /* PROTECTION KEY                */ 00284000
*       3 * BIT(4),                 /* RESERVED - MUST BE ZERO       */ 00285000
*      2 RQETYPE BIT(8),            /* RQE TYPE FLAGS                */ 00286000
*       3 RQE114 BIT(1),            /* EXCPVR REQUEST                */ 00287000
*       3 RQEVIRT BIT(1),           /* VIRTUAL EXCP REQUEST          */ 00288000
*       3 RQE1TO1 BIT(1),           /* VIRTUAL = REAL EXCP REQUEST   */ 00289000
*       3 RQEVAM BIT(1),            /* VIO REQUEST                   */ 00290000
*       3 * BIT(2),                 /* RESERVED - MUST BE ZERO       */ 00291000
*       3 RQETYP3 BIT(2),           /* TYPE 3 RELATED REQUEST        */ 00292000
*        4 RQETYP2 BIT(1),          /* TYPE 2 RELATED REQUEST        */ 00293000
*        4 RQETYP1 BIT(1),          /* TYPE 1 RELATED REQUEST        */ 00294000
*      2 RQEFLAG BIT(8),            /* FLAGS INDICATING WORK TO DO      00295000
*                                      AND POSITION IN EXCP          */ 00296000
*       3 RQERETRY BIT(1),          /* RETRY REQUEST FROM APPENDAGE  */ 00297000
*       3 RQENOPST BIT(1),          /* NO POST REQUEST FROM APPEND   */ 00298000
*       3 RQENOFRE BIT(1),          /* NO FREE REQUEST FROM APPEND   */ 00299000
*       3 RQEFIXST BIT(1),          /* FIXING IS STARTED FOR REQUEST */ 00300000
*       3 RQESTBL BIT(1),           /* REQUEST IS STARTABLE          */ 00301000
*       3 RQESRBS BIT(1),           /* REQUEST SENT TO IOS           */ 00302000
*       3 RQEPURGE BIT(1),          /* PURGE IN CONTROL              */ 00303000
*       3 RQECHEAC BIT(1),          /* CHANNEL END APPENDAGE COMPL   */ 00304000
*      2 * BIT(8),                  /* RESERVED                      */ 00305000
*      2 RQEEND CHAR(0);            /* END OF RQE               03S0027 00306000
*                                                                    */ 00307000
*                                                               03S0028 00308000
*/* **************************************************************** */ 00309000
*/*                                                                  */ 00310000
*/*            ***** DATA EXTENT BLOCK *****                         */ 00311000
*/*                                                                  */ 00312000
*/*  OS/VS1 RELEASE 3, OS/VS2 RELEASE 2, 11/01/73, LEVEL=9           */ 00313000
*/*                                                                  */ 00314000
*/*  METHOD OF ACCESS                                                */ 00315000
*/*      PL/S - DCL (DEBPTR,DEBDAPTR,DEBEXPTR,DEBSBPTR) PTR          */ 00316000
*/*      BAL  - FIVE DSECTS ARE PRODUCED.  USING ON A DSECT NAME     */ 00317000
*/*             GIVES ADDRESSABILITY FOR ALL SYMBOLS WITHIN THAT     */ 00318000
*/*             DSECT.  THE DSECT NAMES AND THE SECTIONS WITHIN EACH */ 00319000
*/*             DSECT ARE                                            */ 00320000
*/*                                                                  */ 00321000
*/*             DEB ***  APPENDAGE VECTOR TABLE SECTION              */ 00322000
*/*                      PREFIX TABLE                                */ 00323000
*/*                      BASIC SECTION                               */ 00324000
*/*                      UNIT RECORD, MAGNETIC TAPE AND              */ 00325000
*/*                        TELECOMMUNICATIONS DEVICES SECTION        */ 00326000
*/*                      ISAM DEPENDENT SECTION                      */ 00327000
*/*                      *** POINTERS TO THE DEB IN OTHER CONTROL    */ 00328000
*/*                          BLOCKS SUCH AS DCB POINT TO THE BASIC   */ 00329000
*/*                          SECTION.  USING ON DEBBASIC GIVES       */ 00330000
*/*                          ADDRESSABILITY FOR BASIC SECTION AND    */ 00331000
*/*                          NEXT TWO SECTIONS.  DEBAPPAD IN BASIC   */ 00332000
*/*                          SECTION CONTAINS ADDRESS OF APPENDAGE   */ 00333000
*/*                          VECTOR TABLE (AVT) SECTION.  PREFIX     */ 00334000
*/*                          FOLLOWS AVT SECTION.                    */ 00335000
*/*             DEBDASD  DIRECT ACCESS STORAGE DEVICE SECTION        */ 00336000
*/*             DEBACSMD EXCP, BSAM AND QSAM DEPENDENT SECTION       */ 00337000
*/*                      BPAM DEPENDENT SECTION                      */ 00338000
*/*                      BDAM DEPENDENT SECTION                      */ 00339000
*/*                      BTAM DEPENDENT SECTION                      */ 00340000
*/*                      GAM DEPENDENT SECTION                       */ 00341000
*/*                      ISAM LOAD MODE EXTENSION **                 */ 00342000
*/*                      ISAM SCAN MODE EXTENSION **                 */ 00343000
*/*                      BISAM MODE EXTENSION **                     */ 00344000
*/*                      ** FOR THESE 3 EXTENSIONS, LOAD REGISTER    */ 00345000
*/*                         FROM DEBEXPT IN ISAM DEPENDENT SECTION   */ 00346000
*/*                         TO SET REGISTER FOR USING.               */ 00347000
*/*             DEBSUBNM SUBROUTINE NAME SECTION                     */ 00348000
*/*             DEBXTN   EXTENSION FOR OS/VS2                        */ 00349000
*/*                                                                  */ 00350000
*/*             WHEN LISTING IS SUPPRESSED, YOU CAN DETERMINE WHICH  */ 00351000
*/*             DSECT A SYNBOL IS IN BY USING THE STARTMENT NUMBER   */ 00352000
*/*             IN THE DEFN COLUMN IN THE CROSS REFERENCE LISTING.   */ 00353000
*/*             FOR EXAMPLE, ANY SYMBOL DEFINED BETWEEN THE          */ 00354000
*/*             STATEMENT NUMBERS FOR DEBDASD AND DEBACSMD IS IN     */ 00355000
*/*             THE DIRECT ACCESS STORAGE DEVICE SECTION.            */ 00356000
*/*                                                                  */ 00357000
*/*  F.E.'S                                                          */ 00358000
*/*      MICROFICHE LISTING - IEZDEB                                 */ 00359000
*/*                                                                  */ 00360000
*/*  DEVELOPERS                                                      */ 00361000
*/*      BAL LISTING  - SPECIFY LIST=YES ON MACRO CALL               */ 00362000
*/*      PL/S LISTING - SPECIFY %IHALIST='YES' BEFORE INCLUDE        */ 00363000
*/*                                                                  */ 00364000
*/*      FOR INTEGRATION, A LISTING SHOULD NOT BE REQUESTED.         */ 00365000
*/*                                                                  */ 00366000
*/*  FUNCTION                                                        */ 00367000
*/*      THE DATA EXTENT BLOCK (DEB) CONTAINS AN EXTENSION OF        */ 00368000
*/*      INFORMATION IN THE DCB.  EACH DEB IS ASSOCIATED WITH A      */ 00369000
*/*      DCB, AND THE TWO POINT TO EACH OTHER.  THE DEB CONTAINS     */ 00370000
*/*      INFORMATION CONCERNING THE PHYSICAL CHARACTERISTICS OF      */ 00371000
*/*      THE DATA SET AND OTHER INFORMATION THAT IS USED BY THE      */ 00372000
*/*      CONTROL PROGRAM.                                            */ 00373000
*/*                                                                  */ 00374000
*/* **************************************************************** */ 00375000
*                                                               03S0028 00376000
*                                                               03S0028 00377000
*/*  *************************************************************** */ 00378000
*/*                   DEB BASIC SECTION                              */ 00379000
*/*  *************************************************************** */ 00380000
*                                                               03S0028 00381000
*   DECLARE                                                     03S0028 00382000
*     1 DEBBASIC BASED(DEBPTR) BDY(WORD),                       03S0028 00383000
*       3 DEBTCBAD PTR(31),         /* ADDRESS OF TCB FOR THIS DEB   */ 00384000
*        4 DEBNMSUB CHAR(1),        /* NUMBER OF SUBROUTINES LOADED     00385000
*                                      BY OPEN EXECUTOR ROUTINES     */ 00386000
*        4 DEBTCBB PTR(24),         /* ADDRESS OF TCB FOR THIS DEB   */ 00387000
*       3 DEBDEBAD PTR(31),         /* ADDRESS OF THE NEXT DEB IN THE   00388000
*                                      SAME TASK                     */ 00389000
*        4 DEBAMLNG CHAR(1),        /* NUMBER OF BYTES IN THE ACCESS    00390000
*                                      METHOD DEPENDENT SECTION. FOR    00391000
*                                      BDAM THIS FIELD CONTAINS THE     00392000
*                                      LENGTH EXPRESSED IN NUMBER OF    00393000
*                                      WORDS                         */ 00394000
*        4 DEBDEBB PTR(24),         /* *** SAME AS DEBDEBAD ABOVE    */ 00395000
*       3 DEBIRBAD PTR(31),         /* IRB STORAGE ADDRESS USED FOR     00396000
*                                      APPENDAGE ASYNCHRONOUS EXITS  */ 00397000
*        4 DEBOFLGS CHAR(1),        /* DATA SET STATUS FLAGS         */ 00398000
*         5 DEBDISP BIT(2),         /* DATA SET DISPOSITION FLAGS    */ 00399000
*         5 DEBEOF BIT(1),          /* END-OF-FILE (EOF) ENCOUNTERED    00400000
*                                      (TAPE INPUT) FORMAT 1 DSCB BIT   00401000
*                                      93.0 INDICATES THAT THE  03S0028 00402000
*                                      CURRENT VOLUME IS THE LAST       00403000
*                                      VOLUME OF THE DATA SET (DASD     00404000
*                                      INPUT)                        */ 00405000
*         5 DEBRLSE BIT(1),         /* RELEASE UNUSED EXTERNAL  03S0028 00406000
*                                      STORAGE (DASD) EMULATOR TAPE     00407000
*                                      WITH SECOND GENERATION FORMAT.   00408000
*                                      TAPE MAY CONTAIN BLOCKS  03S0028 00409000
*                                      SHORTER THAN 12 CHARACTERS       00410000
*                                      (TAPE)                        */ 00411000
*         5 DEBDCB BIT(1),          /* DCB MODIFICATION              */ 00412000
*         5 DEBSPLIT BIT(1),        /* SPLIT CYLINDER (DASD) 7-TRACK    00413000
*                                      EMULATOR TAPE WITH POSSIBLE      00414000
*                                      MIXED PARITY RECORDS (TAPE)   */ 00415000
*         5 DEBLABEL BIT(1),        /* NONSTANDARD LABELS            */ 00416000
*         5 DEBRERR BIT(1),         /* USE REDUCED ERROR RECOVERY       00417000
*                                      PROCEDURE (TAPE) CONCATENATED    00418000
*                                      PARTITIONED ORGANIZATION DATA    00419000
*                                      SETS PROCESSED USING BPAM        00420000
*                                      (DASD)                        */ 00421000
*        4 DEBIRBB PTR(24),         /* *** SAME AS DEBIRBAD ABOVE    */ 00422000
*       3 DEBOPATB CHAR(1),         /* FLAGS INDICATING BOTH THE        00423000
*                                      METHOD OF I/O PROCESSING AND     00424000
*                                      THE DISPOSITION THAT IS TO BE    00425000
*                                      PERFORMED WHEN AN        03S0028 00426000
*                                      END-OF-VOLUME (EOV) CONDITION    00427000
*                                      OCCURS                        */ 00428000
*        4 DEBABEND BIT(1),         /* SET BY ABEND INDICATING A        00429000
*                                      SYSABEND OR SYSUDUMP DATA SET    00430000
*                                      (OS/VS2)                      */ 00431000
*        4 DEBZERO BIT(1),          /* ALWAYS ZERO                   */ 00432000
*        4 DEBPOSIT BIT(2),         /* DATA SET POSITIONING FLAGS    */ 00433000
*        4 DEBACCS BIT(4),          /* TYPE OF I/O ACCESSING BEING      00434000
*                                      DONE                          */ 00435000
*       3 DEBQSCNT CHAR(1),         /* PURGE (SVC 16) - QUIESCE 03S0028 00436000
*                                      COUNT. NUMBER OF DEVICES 03S0028 00437000
*                                      EXECUTING USER'S CHANNEL 03S0028 00438000
*                                      PROGRAMS, AS SHOWN BY BITS 5     00439000
*                                      AND 6 OF UCBFL1 FIELDS        */ 00440000
*       3 DEBFLGS1 CHAR(1),         /* FLAG FIELD                    */ 00441000
*        4 DEBPWCKD BIT(1),         /* PASSWORD WAS SUPPLIED DURING     00442000
*                                      OPEN. EOV WILL NOT REQUEST A     00443000
*                                      PASSWORD FOR EACH ADDITIONAL     00444000
*                                      VOLUME OF A MULTIVOLUME DATA     00445000
*                                      SET                           */ 00446000
*        4 DEBEOFDF BIT(1),         /* SET BY EOV TO INFORM CLOSE       00447000
*                                      THAT AN END-OF-FILE HAS BEEN     00448000
*                                      ENCOUNTERED AND, THEREFORE,      00449000
*                                      DEFERRED LABEL PROCESSING IS     00450000
*                                      ALLOWED                       */ 00451000
*        4 DEBRSV01 BIT(1),         /* RESERVED                      */ 00452000
*        4 DEBRSV02 BIT(1),         /* RESERVED                      */ 00453000
*        4 DEBCINDI BIT(1),         /* DCB ASSOCIATED WITH THIS DEB     00454000
*                                      IS BEING PROCESSED BY THE        00455000
*                                      COMPATIBILITY INTERFACE  03S0028 00456000
*                                      ROUTINES (VSAM) ICB462        */ 00457000
*        4 DEBF1CEV BIT(1),         /* EOV PROCESSING OCCURRED DURING   00458000
*                                      CLOSE PROCESSING. TESTED AND     00459000
*                                      SET TO ZERO BY CLOSE, SET TO     00460000
*                                      ONE BY EOV. (ICB353) A42228   */ 00461000
*        4 DEBAPFIN BIT(1),         /* IF ON, AUTHORIZED PROGRAMS CAN   00462000
*                                      BE LOADED MDC001              */ 00463000
*        4 DEBXTNIN BIT(1),         /* IF ONE, DEB EXTENSION EXISTS     00464000
*                                      (OS/VS2) MDC007               */ 00465000
*       3 DEBRSV05 CHAR(1),         /* RESERVED                      */ 00466000
*       3 DEBUSRPG PTR(31),         /* ADDRESS OF FIRST IOB IN THE      00467000
*                                      USER PURGE CHAIN (OS/VS1)        00468000
*                                      ADDRESS OF PURGED I/O RESTORE    00469000
*                                      LIST (PIRL) (OS/VS2) (MDC029)    00470000
*                                                              YM3158*/ 00471000
*        4 DEBNMEXT CHAR(1),        /* NUMBER OF EXTENTS SPECIFIED IN   00472000
*                                      DSCB'S                        */ 00473000
*        4 DEBUSRPB PTR(24),        /* *** SAME AS DEBUSRPG ABOVE    */ 00474000
*       3 DEBRRQ PTR(31),           /* POINTER TO RELATED REQUEST       00475000
*                                      QUEUE (OS/VS2) MDC026         */ 00476000
*        4 DEBECBAD PTR(31),        /* ADDRESS OF A PARAMETER LIST      00477000
*                                      USED TO LOCATE THE PURGE ECB     00478000
*                                      FOR AN SVC PURGE REQUEST 03S0028 00479000
*                                      (OS/VS1) MDC025               */ 00480000
*         5 DEBPRIOR CHAR(1),       /* PRIORITY OF THE TASK OWNING      00481000
*                                      DEB                           */ 00482000
*         5 DEBECBB PTR(24),        /* *** SAME AS DEBECBAD ABOVE    */ 00483000
*       3 DEBDCBAD PTR(31),         /* ADDRESS OF DCB ASSOCIATED WITH   00484000
*                                      THIS DEB                      */ 00485000
*        4 DEBPROTG CHAR(1),        /* TASK PROTECTION KEY IN HIGH-     00486000
*                                      ORDER 4 BITS                  */ 00487000
*         5 DEBDEBID CHAR(1),       /* A HEX F IN LOW-ORDER 4 BITS TO   00488000
*                                      IDENTIFY THIS BLOCK AS A DEB  */ 00489000
*        4 DEBDCBB PTR(24),         /* *** SAME AS DEBDCBAD ABOVE    */ 00490000
*       3 DEBAPPAD PTR(31),         /* ADDRESS OF THE I/O APPENDAGE     00491000
*                                      VECTOR TABLE                  */ 00492000
*        4 DEBEXSCL CHAR(1),        /* EXTENT SCALE- 4 FOR DIRECT       00493000
*                                      ACCESS DEVICE AND 3525 CARD      00494000
*                                      PUNCH WITH DEVICE-ASSOCIATED     00495000
*                                      DATA SET SUPPORT AND 2 FOR       00496000
*                                      NONDIRECT ACCESS DEVICE AND      00497000
*                                      COMMUNICATION DEVICE. THIS       00498000
*                                      FIELD IS USED TO DETERMINE THE   00499000
*                                      SIZE OF THE DEVICE DEPENDENT     00500000
*                                      SECTION ICB394                */ 00501000
*        4 DEBAPPB PTR(24),         /* *** SAME AS DEBAPPAD ABOVE    */ 00502000
*       3 DEBBASND CHAR(0) BDY(WORD);                           03S0028 00503000
*                                                               03S0028 00504000
*/*  *************************************************************** */ 00505000
*/*    UNIT RECORD, MAGNETIC TAPE, TELECOMMUNICATIONS DEVICES SECTION*/ 00506000
*/*                                                                  */ 00507000
*/*      NOTE  FOR TELECOMMUNICATIONS DEVICES, THE UCB ADDRESS       */ 00508000
*/*            IS REPEATED FOR EACH LINE ASSIGNED                    */ 00509000
*/*  *************************************************************** */ 00510000
*                                                               03S0029 00511000
*   DECLARE                                                     03S0029 00512000
*     1 DEBBAS02 DEF(DEBBASND) BDY(WORD),                       03S0029 00513000
*       3 DEBDDS1 BDY(WORD),                                    03S0029 00514000
*        4 DEBSUCBA PTR(31),        /* ADDRESS OF UCB ASSOCIATED WITH   00515000
*                                      A GIVEN DATA SET              */ 00516000
*         5 DEBSDVM CHAR(1),        /* DEVICE MODIFIER. FOR MAGNETIC    00517000
*                                      TAPE, SET MODE OPERATION CODE.   00518000
*                                      FOR UNIT RECORD, NOT USED.    */ 00519000
*         5 DEBSUCBB PTR(24),       /* *** SAME AS DEBSUCBA ABOVE    */ 00520000
*/*      THE FOLLOWING FIELDS ARE PRESENT ONLY FOR THE 3525 WITH     */ 00521000
*/*      DEVICE-ASSOCIATED DATA SET SUPPORT                          */ 00522000
*                                                               03S0029 00523000
*        4 DEBRDCB PTR(31),         /* ADDRESS OF DCB FOR THE READ      00524000
*                                      ASSOCIATED DATA SET ICB394    */ 00525000
*         5 DEBRSV06 CHAR(1),       /* RESERVED ICB394               */ 00526000
*         5 DEBRDCBA PTR(24),       /* SAME AS DEBRDCB ABOVE ICB394  */ 00527000
*        4 DEBPDCB PTR(31),         /* ADDRESS OF DCB FOR THE PUNCH     00528000
*                                      ASSOCIATED DATA SET ICB394    */ 00529000
*         5 DEBRSV07 CHAR(1),       /* RESERVED ICB394               */ 00530000
*         5 DEBPDCBA PTR(24),       /* SAME AS DEBPDCB ABOVE ICB394  */ 00531000
*        4 DEBWDCB PTR(31),         /* ADDRESS OF DCB FOR THE PRINT     00532000
*                                      ASSOCIATED DATA SET ICB394    */ 00533000
*         5 DEBRSV08 CHAR(1),       /* RESERVED ICB394               */ 00534000
*         5 DEBWDCBA PTR(24);       /* SAME AS DEBWDCB ABOVE ICB394  */ 00535000
*/*  *************************************************************** */ 00536000
*/*              DEB ISAM DEPENDENT SECTION                          */ 00537000
*/*                                                                  */ 00538000
*/*      NOTE  PRESENT ONLY IF ISAM IS USED.  FOLLOWS THE BASIC      */ 00539000
*/*            SECTION AND PRECEDES THE DIRECT ACCESS STORAGE        */ 00540000
*/*            DEVICE SECTION.  COUNTED AS ONE EXTENT IN DEBNMEXT.   */ 00541000
*/*  *************************************************************** */ 00542000
*                                                               03S0030 00543000
*   DECLARE                                                     03S0030 00544000
*     1 DEBBAS01 DEF(DEBBASND) BDY(WORD),                       03S0030 00545000
*      2 DEBISAM BDY(WORD),                                     03S0030 00546000
*       3 DEBFIEAD PTR(31),         /* ADDRESS OF FIRST INDEX EXTENT */ 00547000
*        4 DEBNIEE CHAR(1),         /* NUMBER OF EXTENTS OF     03S0030 00548000
*                                      INDEPENDENT INDEX AREA        */ 00549000
*        4 DEBFIEB PTR(24),         /* *** SAME AS DEBFIEAD ABOVE    */ 00550000
*       3 DEBFPEAD PTR(31),         /* ADDRESS OF THE FIRST PRIME       00551000
*                                      DATA EXTENT                   */ 00552000
*        4 DEBNPEE CHAR(1),         /* NUMBER OF EXTENTS OF PRIME       00553000
*                                      DATA AREA (M=0 EXTENT)        */ 00554000
*        4 DEBFPEB PTR(24),         /* *** SAME AS DEBFPEAD ABOVE    */ 00555000
*       3 DEBFOEAD PTR(31),         /* ADDRESS OF THE FIRST OVERFLOW    00556000
*                                      EXTENT                        */ 00557000
*        4 DEBNOEE CHAR(1),         /* NUMBER OF EXTENTS OF     03S0030 00558000
*                                      INDEPENDENT OVERFLOW AREA     */ 00559000
*        4 DEBFOEB PTR(24),         /* *** SAME AS DEBFOEAD ABOVE    */ 00560000
*       3 DEBEXPT PTR(31),          /* ADDRESS OF ISAM DEB EXTENSION    00561000
*                                      ICB379                        */ 00562000
*        4 DEBRPSID BIT(8),         /* ROTATIONAL POSITION SENSING      00563000
*                                      (RPS) DEVICE INDICATORS       */ 00564000
*         5 DEBRPSP BIT(1),         /* PRIME DATA AREA IS ON RPS        00565000
*                                      DEVICE                        */ 00566000
*         5 DEBRPSI BIT(1),         /* INDEPENDENT INDEX AREA IS ON     00567000
*                                      RPS DEVICE                    */ 00568000
*         5 DEBRPSO BIT(1),         /* INDEPENDENT OVERFLOW AREA IS     00569000
*                                      ON RPS DEVICE                 */ 00570000
*         5 DEBRPSAP BIT(1),        /* RPS SIO APPENDAGE HAS BEEN       00571000
*                                      LOADED                        */ 00572000
*         5 DEBRSV09 BIT(1),        /* RESERVED                      */ 00573000
*         5 DEBRSV10 BIT(1),        /* RESERVED                      */ 00574000
*         5 DEBRSV11 BIT(1),        /* RESERVED                      */ 00575000
*         5 DEBRSV12 BIT(1),        /* RESERVED                      */ 00576000
*        4 DEBEXPTA PTR(24);        /* SAME AS DEBEXPT ABOVE ICB379  */ 00577000
*/*  *************************************************************** */ 00578000
*/*           DIRECT ACCESS STORAGE DEVICE SECTION                   */ 00579000
*/*                                                                  */ 00580000
*/*      NOTE  IF ISAM IS BEING USED, THIS SECTION FOLLOWS THE       */ 00581000
*/*            ISAM DEVICE DEPENDENT SECTION.  OTHERWISE, IT         */ 00582000
*/*            FOLLOWS THE BASIC SECTION.                            */ 00583000
*/*                                                                  */ 00584000
*/*            THERE IS ONE OF THESE SECTIONS FOR EACH EXTENT.       */ 00585000
*/*  *************************************************************** */ 00586000
*                                                               03S0031 00587000
*   DECLARE                                                     03S0031 00588000
*     1 DEBDASD BASED(DEBDAPTR) BDY(WORD),                      03S0031 00589000
*       3 DEBUCBAD PTR(31),         /* ADDRESS OF UCB ASSOCIATED WITH   00590000
*                                      THIS DATA EXTENT              */ 00591000
*        4 DEBDVMOD CHAR(1),        /* DEVICE MODIFIER - FILE MASK   */ 00592000
*        4 DEBUCBA PTR(24),         /* *** SAME AS DEBUCBAD ABOVE    */ 00593000
*       3 DEBBINUM CHAR(2),         /* BIN NUMBER                    */ 00594000
*       3 DEBSTRCC CHAR(2),         /* CYLINDER ADDRESS FOR THE START   00595000
*                                      OF AN EXTENT LIMIT            */ 00596000
*       3 DEBSTRHH CHAR(2),         /* READ/WRITE TRACK ADDRESS FOR     00597000
*                                      THE START OF AN EXTENT LIMIT  */ 00598000
*       3 DEBENDCC CHAR(2),         /* CYLINDER ADDRESS FOR THE END     00599000
*                                      OF AN EXTENT LIMIT            */ 00600000
*       3 DEBENDHH CHAR(2),         /* READ/WRITE TRACK ADDRESS FOR     00601000
*                                      THE END OF AN EXTENT LIMIT    */ 00602000
*       3 DEBNMTRK CHAR(2);         /* NUMBER OF TRACKS ALLOCATED TO    00603000
*                                      A GIVEN EXTENT. FOR SPLIT        00604000
*                                      CYLINDER DATA SETS, THIS FIELD   00605000
*                                      REPRESENTS THE NUMBER OF 03S0031 00606000
*                                      TRACKS BETWEEN THE START 03S0031 00607000
*                                      ADDRESS OF THE EXTENT AND THE    00608000
*                                      END ADDRESS OF THE EXTENT.    */ 00609000
*/*  *************************************************************** */ 00610000
*/*      EXCP ACCESS METHOD, BSAM AND QSAM DEPENDENT SECTION         */ 00611000
*/*  *************************************************************** */ 00612000
*                                                               03S0032 00613000
*   DECLARE                                                     03S0032 00614000
*     1 DEBACSMD BASED(DEBEXPTR) BDY(WORD),                     03S0032 00615000
*       3 DEBVOLSQ CHAR(2),         /* VOLUME SEQUENCE NUMBER FOR       00616000
*                                      MULTIVOLUME SEQUENTIAL DATA      00617000
*                                      SETS                          */ 00618000
*        4 DEBVOLBT BIT(8),         /* FIRST BYTE OF DEBVOLSQ   03S0032 00619000
*                                      (MDC016)               YA00318*/ 00620000
*         5 DEBEXFUL BIT(1),        /* SET BY EOV WHEN REWRITING AN     00621000
*                                      OLD DIRECT ACCESS DATA SET TO    00622000
*                                      INDICATE THAT ALL PREVIOUS       00623000
*                                      EXISTING EXTENTS HAVE BEEN       00624000
*                                      FILLED (MDC017)        YA00318*/ 00625000
*         5 DEBRSV36 BIT(1),        /* RESERVED MDC018               */ 00626000
*         5 DEBRSV37 BIT(1),        /* RESERVED MDC018               */ 00627000
*         5 DEBRSV38 BIT(1),        /* RESERVED MDC018               */ 00628000
*         5 DEBRSV39 BIT(1),        /* RESERVED MDC018               */ 00629000
*         5 DEBRSV40 BIT(1),        /* RESERVED MDC018               */ 00630000
*         5 DEBRSV41 BIT(1),        /* RESERVED MDC018               */ 00631000
*         5 DEBRSV42 BIT(1),        /* RESERVED MDC018               */ 00632000
*        4 DEBVLSEQ PTR(8),         /* FOR DIRECT ACCESS, SEQUENCE      00633000
*                                      NUMBER OF THE VOLUME OF THE      00634000
*                                      DATA SET RELATIVE TO THE FIRST   00635000
*                                      VOLUME OF THE DATA SET. FOR      00636000
*                                      TAPE, SEQUENCE NUMBER OF THE     00637000
*                                      VOLUME OF THE DATA SET   03S0032 00638000
*                                      RELATIVE TO THE FIRST VOLUME     00639000
*                                      PROCESSED. (MDC019)    YA00318*/ 00640000
*       3 DEBVOLNM CHAR(2),         /* TOTAL NUMBER OF VOLUMES IN A     00641000
*                                      MULTIVOLUME SEQUENTIAL DATA      00642000
*                                      SET.                          */ 00643000
*       3 DEBDSNM CHAR(8) BDY(WORD),/* MEMBER NAME. THIS FIELD  03S0032 00644000
*                                      APPEARS ONLY WHEN AN OUTPUT      00645000
*                                      DATA SET HAS BEEN OPENED FOR A   00646000
*                                      MEMBER NAME AND THE DSCB 03S0032 00647000
*                                      SPECIFIES A PARTITIONED DATA     00648000
*                                      SET.                          */ 00649000
*         5 DEBUTSAA PTR(31),       /* ADDRESS OF THE USER TOTALING     00650000
*                                      SAVE AREA                     */ 00651000
*          6 DEBRSV13 CHAR(1),      /* RESERVED                      */ 00652000
*          6 DEBUTSAB PTR(24),      /* *** SAME AS DEBUTSAA ABOVE    */ 00653000
*         5 DEBRSV14 CHAR(4) BDY(WORD);/* RESERVED (IF USER TOTALING    00654000
*                                      WAS SPECIFIED)                */ 00655000
*/*  *************************************************************** */ 00656000
*/*                BPAM DEPENDENT SECTION                            */ 00657000
*/*  *************************************************************** */ 00658000
*                                                               03S0033 00659000
*   DECLARE                                                     03S0033 00660000
*     1 DEBACS01 BASED(DEBEXPTR) BDY(WORD),                     03S0033 00661000
*       3 DEBDSNAM CHAR(8) BDY(WORD),/* FOR A PARTITIONED DATA SET      00662000
*                                      OPENED FOR OUTPUT FOR A MEMBER   00663000
*                                      NAME, THIS FIELD IS THE MEMBER   00664000
*                                      NAME.                         */ 00665000
*        4 DEBEXTNM CHAR(1);        /* FOR A PARTITIONED DATA SET       00666000
*                                      OPENED FOR INPUT, EACH ONE-      00667000
*                                      BYTE FIELD CONTAINS THE EXTENT   00668000
*                                      NUMBER OF THE FIRST EXTENT       00669000
*                                      ENTRY FOR EACH DATA SET EXCEPT   00670000
*                                      THE FIRST, IF TWO OR MORE DATA   00671000
*                                      SETS ARE CONCATENATED. THE       00672000
*                                      NUMBER OF BYTES IN THE FIELD     00673000
*                                      IS EQUAL TO ONE LESS THAN THE    00674000
*                                      NUMBER OF DATA SETS      03S0033 00675000
*                                      CONCATENATED.                 */ 00676000
*/*  *************************************************************** */ 00677000
*/*                BDAM DEPENDENT SECTION                            */ 00678000
*/*  *************************************************************** */ 00679000
*                                                               03S0034 00680000
*   DECLARE                                                     03S0034 00681000
*     1 DEBACS02 BASED(DEBEXPTR) BDY(WORD),                     03S0034 00682000
*                                                               03S0034 00683000
*/*                       *****************************************  */ 00684000
*/*                       * FOR FIXED LENGTH RECORDS WITH THE     *  */ 00685000
*/*                       * OPTION OF RELATIVE BLOCK ADDRESSING   *  */ 00686000
*/*                       * (BUT NOT TRACK OVERFLOW)              *  */ 00687000
*/*                       *****************************************  */ 00688000
*                                                               03S0034 00689000
*       3 DEBDBLK FIXED(31),        /* ONE FOUR-BYTE FIELD FOR EACH     00690000
*                                      EXTENT DESCRIBED IN THE DEVICE   00691000
*                                      DEPENDENT SECTION.            */ 00692000
*        4 DEBDBPT PTR(8),          /* NUMBER OF BLOCKS PER TRACK    */ 00693000
*        4 DEBDBPE CHAR(3);         /* NUMBER OF BLOCKS PER EXTENT   */ 00694000
*   DECLARE                                                     03S0035 00695000
*     1 DEBACS03 BASED(DEBEXPTR) BDY(WORD),                     03S0035 00696000
*                                                               03S0035 00697000
*/*                       *****************************************  */ 00698000
*/*                       * FOR FIXED LENGTH RECORDS WITH THE     *  */ 00699000
*/*                       * OPTION OF RELATIVE BLOCK ADDRESSING   *  */ 00700000
*/*                       * AND TRACK OVERFLOW.                   *  */ 00701000
*/*                       *****************************************  */ 00702000
*                                                               03S0035 00703000
*       3 DEBDTPP FIXED(31),        /* NUMBER OF TRACKS PER PERIOD   */ 00704000
*       3 DEBDBPP FIXED(31),        /* NUMBER OF BLOCKS PER PERIOD   */ 00705000
*/*                       THE FOLLOWING FIELD OCCURS ONCE FOR        */ 00706000
*/*                       EACH EXTENT.                               */ 00707000
*                                                               03S0035 00708000
*       3 DEBDBPEF FIXED(31);       /* NUMBER OF BLOCKS PER EXTENT   */ 00709000
*/*  *************************************************************** */ 00710000
*/*               BTAM DEPENDENT SECTION                             */ 00711000
*/*                                                                  */ 00712000
*/*      NOTE  THIS SEGMENT IS ALWAYS PRESENT FOR BTAM.  IT IS       */ 00713000
*/*            USED WHEN A BUFFER POOL OR DYNAMIC BUFFERING IS       */ 00714000
*/*            USED.  OTHERWISE, THE FIELDS ARE ZERO.                */ 00715000
*/*  *************************************************************** */ 00716000
*                                                               03S0036 00717000
*   DECLARE                                                     03S0036 00718000
*     1 DEBACS04 BASED(DEBEXPTR) BDY(WORD),                     03S0036 00719000
*       3 DEBTBFRA PTR(31),         /* ADDRESS OF THE BUFFER ROUTINE */ 00720000
*        4 DEBRSV15 CHAR(1),        /* RESERVED                      */ 00721000
*        4 DEBTBFRB PTR(24),        /* ADDRESS OF THE BUFFER ROUTINE */ 00722000
*/*                       THE FOLLOWING FIELD IS REPEATED FOR EACH   */ 00723000
*/*                       CCW ON THE CHANNEL PROGRAM QUEUE           */ 00724000
*                                                               03S0036 00725000
*       3 DEBTCCWA PTR(31),         /* ADDRESS OF THE FIRST (OR 03S0036 00726000
*                                      FOLLOWING) CCW ON THE QUEUE   */ 00727000
*        4 DEBRSV16 CHAR(1),        /* RESERVED                      */ 00728000
*        4 DEBTCCWB PTR(24);        /* *** SAME AS DEBCCWA ABOVE     */ 00729000
*/*  *************************************************************** */ 00730000
*/*                 GAM DEPENDENT SECTION                            */ 00731000
*/*  *************************************************************** */ 00732000
*                                                               03S0037 00733000
*   DECLARE                                                     03S0037 00734000
*     1 DEBACS05 BASED(DEBEXPTR) BDY(WORD),                     03S0037 00735000
*       3 DEBFUCBA PTR(31),         /* ADDRESS OF FIRST UCB          */ 00736000
*        4 DEBRSV17 CHAR(1),        /* RESERVED                      */ 00737000
*        4 DEBFUCBB PTR(24),        /* ADDRESS OF FIRST UCB          */ 00738000
*       3 DEBLUCBA PTR(31),         /* ADDRESS OF LAST UCB           */ 00739000
*        4 DEBRSV18 CHAR(1),        /* RESERVED                      */ 00740000
*        4 DEBLUCBB PTR(24);        /* ADDRESS OF LAST UCB           */ 00741000
*/*  *************************************************************** */ 00742000
*/*               ISAM LOAD MODE EXTENSION                           */ 00743000
*/*  *************************************************************** */ 00744000
*                                                               03S0038 00745000
*   DECLARE                                                     03S0038 00746000
*     1 DEBACS06 BASED(DEBEXPT) BDY(WORD),                      03S0038 00747000
*      2 DEBDCBFA PTR(31),          /* ADDRESS OF DCB FIELD AREA        00748000
*                                      MDC013                        */ 00749000
*      2 DEBPUT PTR(31);            /* ADDRESS OF PUT MODULE ICB379  */ 00750000
*/*  *************************************************************** */ 00751000
*/*               ISAM SCAN MODE EXTENSION                           */ 00752000
*/*  *************************************************************** */ 00753000
*                                                               03S0039 00754000
*   DECLARE                                                     03S0039 00755000
*     1 DEBACS07 BASED(DEBEXPT) BDY(WORD),                      03S0039 00756000
*      2 * PTR(31),                 /* DEBDCBFA - ADDRESS OF DCB        00757000
*                                      FIELD AREA MDC014             */ 00758000
*      2 DEBGET PTR(31),            /* ADDRESS OF GET OR PUT MODULE -   00759000
*                                      THIS FIELD IS ALSO CALLED        00760000
*                                      DEBPUT ICB379                 */ 00761000
*      2 DEBWKPT4 PTR(31),          /* SAME AS DCBWKPT4 - ADDRESS OF    00762000
*                                      UCB ICB379                    */ 00763000
*      2 DEBWKPT5 PTR(31),          /* SAME AS DCBWKPT5 - ADDRESS OF    00764000
*                                      GET APPENDAGE MODULE ICB379   */ 00765000
*      2 DEBCREAD PTR(31),          /* ADDRESS OF CHANNEL-END   03S0039 00766000
*                                      APPENDAGE FOR READ ICB379     */ 00767000
*      2 DEBCSETL PTR(31),          /* ADDRESS OF CHANNEL-END   03S0039 00768000
*                                      APPENDAGE FOR SETL ICB379     */ 00769000
*      2 DEBCWRIT PTR(31),          /* ADDRESS OF CHANNEL-END   03S0039 00770000
*                                      APPENDAGE FOR WRITE ICB379    */ 00771000
*      2 DEBCCHK PTR(31),           /* ADDRESS OF CHANNEL-END   03S0039 00772000
*                                      APPENDAGE FOR WRITE VALIDITY     00773000
*                                      CHECK ICB379                  */ 00774000
*      2 DEBCREWT PTR(31),          /* ADDRESS OF CHANNEL-END   03S0039 00775000
*                                      APPENDAGE FOR RE-WRITE ICB379 */ 00776000
*      2 DEBCRECK PTR(31),          /* ADDRESS OF CHANNEL-END   03S0039 00777000
*                                      APPENDAGE FOR RE-CHECK ICB379 */ 00778000
*      2 DEBAREAD PTR(31),          /* ADDRESS OF ABNORMAL-END  03S0039 00779000
*                                      APPENDAGE FOR READ ICB379     */ 00780000
*      2 DEBASETL PTR(31),          /* ADDRESS OF ABNORMAL-END  03S0039 00781000
*                                      APPENDAGE FOR SETL ICB379     */ 00782000
*      2 DEBAWRIT PTR(31),          /* ADDRESS OF ABNORMAL-END  03S0039 00783000
*                                      APPENDAGE FOR WRITE ICB379    */ 00784000
*      2 DEBACHK PTR(31),           /* ADDRESS OF ABNORMAL-END  03S0039 00785000
*                                      APPENDAGE FOR WRITE VALIDITY     00786000
*                                      CHECK ICB379                  */ 00787000
*      2 DEBAREWT PTR(31),          /* ADDRESS OF ABNORMAL-END  03S0039 00788000
*                                      APPENDAGE FOR RE-WRITE ICB379 */ 00789000
*      2 DEBARECK PTR(31),          /* ADDRESS OF ABNORMAL-END  03S0039 00790000
*                                      APPENDAGE FOR RE-CHECK ICB379 */ 00791000
*      2 DEBRPSST PTR(31);          /* ADDRESS OF RPS SIO APPENDAGE     00792000
*                                      IF ADDRSPC=REAL WAS NOT  03S0039 00793000
*                                      SPECIFIED ICB379              */ 00794000
*/*  *************************************************************** */ 00795000
*/*               BISAM MODE EXTENSION                               */ 00796000
*/*  *************************************************************** */ 00797000
*                                                               03S0040 00798000
*   DECLARE                                                     03S0040 00799000
*     1 DEBACS08 BASED(DEBEXPT) BDY(WORD),                      03S0040 00800000
*      2 * PTR(31),                 /* DEBDCBFA - ADDRESS OF DCB        00801000
*                                      FIELD AREA MDC015             */ 00802000
*      2 DEBDISAD PTR(31),          /* ADDRESS OF PRIVILEGED MODULE     00803000
*                                      ENTERED WHEN A BISAM MACRO       00804000
*                                      INSTRUCTION IS EXECUTED ICB379*/ 00805000
*      2 * PTR(31),                 /* DEBWKPT4 - SAME AS DCBWKPT4 -    00806000
*                                      ADDRESS OF THE PART 1    03S0040 00807000
*                                      APPENDAGE MODULE (ABNORMAL AND   00808000
*                                      CHANNEL-END APPANDAGES) ICB379*/ 00809000
*      2 * PTR(31),                 /* DEBWKPT5 - SAME AS DCBWKPT5 -    00810000
*                                      ADDRESS OF THE PART 2    03S0040 00811000
*                                      APPENDAGE MODULE (ABNORMAL AND   00812000
*                                      CHANNEL-END APPANDAGES) ICB379*/ 00813000
*      2 DEBFREED PTR(31),          /* ADDRESS OF DYNAMIC BUFFERING     00814000
*                                      MODULE ICB379                 */ 00815000
*      2 DEBRPSIO PTR(31),          /* ADDRESS OF RPS SIO APPENDAGE     00816000
*                                      MODULE IF ADDRSPC=REAL WAS NOT   00817000
*                                      SPECIFIED AND IF DYNAMIC 03S0040 00818000
*                                      BUFFERING IS USED ICB379      */ 00819000
*      2 DEBSIOA2 PTR(31);          /* ADDRESS OF DYNAMIC BUFFERING     00820000
*                                      APPENDAGE MODULE DISPLACED BY    00821000
*                                      PAGE FIX (PGFX) APPENDAGE IF     00822000
*                                      ADDRSPC=REAL WAS NOT SPECIFIED   00823000
*                                      ICB379                        */ 00824000
*/*  *************************************************************** */ 00825000
*/*               SUBROUTINE NAME SECTION                            */ 00826000
*/*                                                                  */ 00827000
*/*      NOTE  FOLLOWS THE ACCESS METHOD DEPENDENT SECTION, OR THE   */ 00828000
*/*            DEVICE DEPENDENT SECTION IF THERE IS NO ACCESS        */ 00829000
*/*            METHOD SECTION.                                       */ 00830000
*/*  *************************************************************** */ 00831000
*                                                               03S0041 00832000
*   DECLARE                                                     03S0041 00833000
*     1 DEBSUBNM BASED(DEBSBPTR) BDY(WORD),                     03S0041 00834000
*        4 DEBSUBID CHAR(2);        /* SUBORUTINE IDENTIFICATION.       00835000
*                                      EACH ACCESS METHOD SUBROUTINE,   00836000
*                                      APPENDAGE SUBROUTINE, AND IRB    00837000
*                                      ROUTINE WILL HAVE A UNIQUE       00838000
*                                      EIGHT-BYTE NAME. THE LOW-        00839000
*                                      ORDER TWO BYTES OF EACH  03S0041 00840000
*                                      ROUTINE NAME WILL BE IN THIS     00841000
*                                      FIELD IF THE SUBROUTINE IS       00842000
*                                      LOADED BY THE OPEN ROUTINES.  */ 00843000
*/*  *************************************************************** */ 00844000
*/*          APPENDAGE VECTOR TABLE SECTION OF THE DEB               */ 00845000
*/*  *************************************************************** */ 00846000
*                                                               03S0042 00847000
*   DECLARE                                                     03S0042 00848000
*     1 DEB BASED(DEBAPPAD) BDY(WORD),                          03S0042 00849000
*      2 DEBAVT BDY(WORD),          /* APPENDAGE VECTOR TABLE        */ 00850000
*       3 DEBEOEA PTR(31),          /* ADDRESS OF END-OF-EXTENT 03S0042 00851000
*                                      APPENDAGE ROUTINE             */ 00852000
*        4 DEBEOEAB CHAR(1),        /* FLAG BYTE ICB280              */ 00853000
*         5 DEBRSV19 BIT(1),        /* RESERVED                      */ 00854000
*         5 DEBRSV20 BIT(1),        /* RESERVED                      */ 00855000
*         5 DEBRSV21 BIT(1),        /* RESERVED                      */ 00856000
*         5 DEBRSV22 BIT(1),        /* RESERVED                      */ 00857000
*         5 DEBEOENP BIT(4),        /* NUMBER OF 2K PAGES TO BE FIXED   00858000
*                                      FOR THE END-OF-EXTENT    03S0042 00859000
*                                      APPENDAGE ICB280              */ 00860000
*        4 DEBEOEAD PTR(24),        /* ADDRESS OF END-OF-EXTENT 03S0042 00861000
*                                      APPENDAGE ROUTINE ICB280      */ 00862000
*       3 DEBSIOA PTR(31),          /* ADDRESS OF START I/O APPENDAGE   00863000
*                                      ROUTINE                       */ 00864000
*        4 DEBSIOAB CHAR(1),        /* FLAG BYTE ICB280              */ 00865000
*         5 DEBPGFX BIT(1),         /* ADDRESS IN DEBSIOAD CAN BE       00866000
*                                      USED TO DETERMINE THE ENTRY      00867000
*                                      POINT TO THE PAGE FIX (PGFX)     00868000
*                                      APPENDAGE ROUTINE BY ADDING 4    00869000
*                                      TO ADDRESS IN DEBSIOAD ICB280 */ 00870000
*         5 DEBSIOX BIT(1),         /* IF ZERO, DO NOT ENTER SIO        00871000
*                                      APPENDAGE WHEN ERP IS ACTIVE.    00872000
*                                      IF ONE, ENTER SIO APPENDAGE      00873000
*                                      EVEN WHEN ERP IS ACTIVE. 03S0042 00874000
*                                      ICB372                        */ 00875000
*         5 DEBIOVR BIT(1),         /* IF ONE, EXCPVR REQUEST IS        00876000
*                                      VALID. IF ZERO, EXCPVR REQUEST   00877000
*                                      IS INVALID AND WILL NOT BE       00878000
*                                      EXECUTED. ICB401              */ 00879000
*         5 DEBRSV23 BIT(1),        /* RESERVED                      */ 00880000
*         5 DEBSIONP BIT(4),        /* NUMBER OF 2K PAGES TO BE FIXED   00881000
*                                      FOR THE SIO APPENDAGE ICB280  */ 00882000
*        4 DEBSIOAD PTR(24),        /* ADDRESS OF START I/O APPENDAGE   00883000
*                                      ROUTINE ICB280                */ 00884000
*       3 DEBPCIA PTR(31),          /* ADDRESS OF PCI APPENDAGE 03S0042 00885000
*                                      ROUTINE                       */ 00886000
*        4 DEBPCIAB CHAR(1),        /* FLAG BYTE ICB280              */ 00887000
*         5 DEBRSV24 BIT(1),        /* RESERVED                      */ 00888000
*         5 DEBRSV25 BIT(1),        /* RESERVED                      */ 00889000
*         5 DEBRSV26 BIT(1),        /* RESERVED                      */ 00890000
*         5 DEBRSV27 BIT(1),        /* RESERVED                      */ 00891000
*         5 DEBPCINP BIT(4),        /* NUMBER OF 2K PAGES TO BE FIXED   00892000
*                                      FOR THE PCI APPENDAGE ROUTINE    00893000
*                                      ICB280                        */ 00894000
*        4 DEBPCIAD PTR(24),        /* ADDRESS OF PROGRAM-      03S0042 00895000
*                                      CONTROLLED-INTERRUPTION (PCI)    00896000
*                                      APPENDAGE ROUTINE ICB280      */ 00897000
*       3 DEBCEA PTR(31),           /* ADDRESS OF CHANNEL-END   03S0042 00898000
*                                      APPENDAGE ROUTINE             */ 00899000
*        4 DEBCEAB CHAR(1),         /* FLAG BYTE ICB280              */ 00900000
*         5 DEBRSV28 BIT(1),        /* RESERVED                      */ 00901000
*         5 DEBRSV29 BIT(1),        /* RESERVED                      */ 00902000
*         5 DEBRSV30 BIT(1),        /* RESERVED                      */ 00903000
*         5 DEBRSV31 BIT(1),        /* RESERVED                      */ 00904000
*         5 DEBCENP BIT(4),         /* NUMBER OF 2K PAGES TO BE FIXED   00905000
*                                      FOR THE CHANNEL-END APPENDAGE    00906000
*                                      ICB280                        */ 00907000
*        4 DEBCEAD PTR(24),         /* ADDRESS OF CHANNEL END   03S0042 00908000
*                                      APPENDAGE ROUTINE ICB280      */ 00909000
*       3 DEBXCEA PTR(31),          /* ADDRESS OF ABNORMAL-END  03S0042 00910000
*                                      APPENDAGE ROUTINE             */ 00911000
*        4 DEBXCEAB CHAR(1),        /* FLAG BYTE ICB280              */ 00912000
*         5 DEBRSV32 BIT(1),        /* RESERVED                      */ 00913000
*         5 DEBRSV33 BIT(1),        /* RESERVED                      */ 00914000
*         5 DEBRSV34 BIT(1),        /* RESERVED                      */ 00915000
*         5 DEBRSV35 BIT(1),        /* RESERVED                      */ 00916000
*         5 DEBXCENP BIT(4),        /* NUMBER OF 2K PAGES TO BE FIXED   00917000
*                                      FOR THE ABNORMAL-END APPENDAGE   00918000
*                                      ICB280                        */ 00919000
*        4 DEBXCEAD PTR(24),        /* ADDRESS OF ABNORMAL-END  03S0042 00920000
*                                      APPENDAGE ROUTINE ICB280      */ 00921000
*/*  *************************************************************** */ 00922000
*/*                  DEB PREFIX TABLE                                */ 00923000
*/*  *************************************************************** */ 00924000
*                                                               03S0042 00925000
*      2 DEBPREFX BDY(WORD),        /* DEB PREFIX TABLE              */ 00926000
*       3 DEBWKARA CHAR(1) BDY(WORD),/* I/O SUPPORT WORK AREA (DIRECT   00927000
*                                      ACCESS)                       */ 00928000
*       3 DEBDSCBA CHAR(7) BDY(WORD,2),/* DSCB ADDRESS (BBCCHHR) USED   00929000
*                                      BY I/O SUPPORT (DIRECT ACCESS)*/ 00930000
*       3 DEBXTNP PTR(31),          /* POINTER TO DEB EXTENSION 03S0042 00931000
*                                      (OS/VS2) MDC008               */ 00932000
*        4 DEBDCBMK CHAR(4) BDY(WORD),/* DCB MODIFICATION MASK USED     00933000
*                                      BY I/O SUPPORT (OS/VS1) MDC009*/ 00934000
*       3 DEBLNGTH CHAR(1),         /* LENGTH OF DEB IN DOUBLE WORDS */ 00935000
*       3 DEBAMTYP CHAR(1),         /* ACCESS METHOD TYPE ICB380     */ 00936000
*       3 DEBTBLOF FIXED(15);       /* OFFSET IN THE DEB TABLE TO THE   00937000
*                                      ENTRY FOR THIS DEB ICB380     */ 00938000
*/*  *************************************************************** */ 00939000
*/*                  DEB EXTENSION (OS/VS2)                          */ 00940000
*/*  *************************************************************** */ 00941000
*                                                               03S0043 00942000
*   DECLARE                                                     03S0043 00943000
*     1 DEBXTN BASED(DEBXTNP) BDY(WORD),                        03S0043 00944000
*      2 DEBXLNGH FIXED(15),        /* LENGTH OF DEB EXTENSION MDC002*/ 00945000
*      2 DEBXFLG1 BIT(8),           /* FLAG BYTE (MDC027)      YM1272*/ 00946000
*       3 DEBXCDCB BIT(1),          /* DEBDCBAD FIELD CONTAINS THE      00947000
*                                      ADDRESS OF A COPIED DCB. USED    00948000
*                                      BY END-OF-VOLUME, TCLOSE AND     00949000
*                                      TASK CLOSE. (MDC028)    YM1272*/ 00950000
*       3 DEBXTSKC BIT(1),          /* TASK CLOSE IS CLOSING THE        00951000
*                                      RELATED DCB. SET BY TASK CLOSE   00952000
*                                      AND INTERROGATED BY      03S0043 00953000
*                                      END-OF-VOLUME, FEOV AND TCLOSE   00954000
*                                      FOR DEB'S NOT ON THE CURRENT     00955000
*                                      TCB DEB CHAIN. (MDC031) YM2869*/ 00956000
*       3 DEBXRV42 BIT(1),          /* RESERVED                      */ 00957000
*       3 DEBXRV43 BIT(1),          /* RESERVED                      */ 00958000
*       3 DEBXRV44 BIT(1),          /* RESERVED                      */ 00959000
*       3 DEBXRV45 BIT(1),          /* RESERVED                      */ 00960000
*       3 DEBXRV46 BIT(1),          /* RESERVED                      */ 00961000
*       3 DEBXRV47 BIT(1),          /* RESERVED                      */ 00962000
*      2 DEBXRV48 CHAR(1),          /* RESERVED                      */ 00963000
*      2 DEBXDSAB PTR(31),          /* POINTER TO DSAB MDC004        */ 00964000
*      2 DEBXDCBM CHAR(4) BDY(WORD),/* DCB MODIFICATION MASK USED BY    00965000
*                                      I/O SUPPORT MDC005            */ 00966000
*      2 DEBXDBPR PTR(31),          /* POINTER TO DEB MDC006         */ 00967000
*      2 DEBXDSO1 BIT(8),           /* SAME AS DCBDSORG BYTE 1 MDC020*/ 00968000
*      2 DEBXDSO2 BIT(8),           /* SAME AS DCBDSORG BYTE 2 MDC021*/ 00969000
*      2 DEBXMCF1 BIT(8),           /* SAME AS DCBMACRF BYTE 1 MDC022*/ 00970000
*      2 DEBXMCF2 BIT(8),           /* SAME AS DCBMACRF BYTE 2 MDC023*/ 00971000
*      2 DEBXXARG PTR(31),          /* ADDRESS OF BDAM READ EXCLUSIVE   00972000
*                                      LIST MDC024                   */ 00973000
*      2 DEBXRV39 PTR(31),          /* RESERVED                      */ 00974000
*      2 DEBXRV40 PTR(31);          /* RESERVED                 03S0043 00975000
*                                                                    */ 00976000
*                                                               03S0044 00977000
*/*********SERVICE REQUEST BLOCK************************************ */ 00978000
*/*  OS/VS2 RELEASE 2    12/8/72   LEVEL=1                           */ 00979000
*/*     BAL- DSECT  ALWAYS PRODUCED, PERFORM USING ON SRBSECT        */ 00980000
*/*                                                                  */ 00981000
*/*     PL/S  - SRBSECT WILL BE BASED(SRBPTR) .                      */ 00982000
*/*        1. IF YOU WISH TO APPEND THE SRB TO THE END OF            */ 00983000
*/*           ANOTHER CONTROL BLOCK, SET %SRBLEVEL='N'               */ 00984000
*/*           WHERE N IS AN INTEGER BETWEEN 2 AND 3,INCLUSIVE.       */ 00985000
*/*           SRBSECT WILL THEN BE AN UNBASED LEVEL N  VARIABLE.     */ 00986000
*/*        2. IF YOU WISH TO APPEND ANOTHER CONTROL BLOCK TO THE END */ 00987000
*/*           OF THE SRB, SET %SRB9999=',', AND THE SEMICOLON AT     */ 00988000
*/*           THE END OF THE SRB WILL BE REPLACED WITH A COMMA.      */ 00989000
*/*                                                                  */ 00990000
*/*      EXAMPLE OF PLACING SRB BETWEEN TWO OTHER BLOCKS:            */ 00991000
*/*         %SRBLEVEL='2'     ;                                      */ 00992000
*/*         %SRB9999=',' ;                                           */ 00993000
*/*     DECLARE  1 MYBLOCK,                                          */ 00994000
*/*         2 MYFIELD,                                               */ 00995000
*/*        %INCLUDE SYSLIB(IHASRB)  ;                                */ 00996000
*/*         2 MYFIELD2 ;                                             */ 00997000
*/****************************************************************** */ 00998000
*                                                               03S0044 00999000
*   DECLARE                                                     03S0044 01000000
*     1 SRBSECT BASED(SRBPTR) BDY(WORD),                        03S0044 01001000
*        4 SRB,                                                 03S0044 01002000
*          6 SRBID CHAR(4),         /* SRB EBCDIC ACRONYM            */ 01003000
*          6 SRBFLNK PTR(31),       /* FORWARD CHAIN FIELD           */ 01004000
*          6 SRBASCB PTR(31),       /* ADDRESS SPACE TO BE DISPATCHED*/ 01005000
*          6 SRBFLC BDY(WORD),      /* SRB AREA MOVED TO LOW CORE    */ 01006000
*            8 SRBCPAFF BIT(16),    /* CPU AFFINITY MASK             */ 01007000
*            8 SRBPASID FIXED(15),  /* PURGEDQ ASID                  */ 01008000
*            8 SRBPTCB PTR(31),     /* PURGEDQ TCB ADDRESS           */ 01009000
*          6 SRBEP PTR(31),         /* ENTRY POINT ADDRESS OF   03S0044 01010000
*                                      ASYNCHRONOUS ROUTINE          */ 01011000
*          6 SRBRMTR PTR(31),       /* ADDRESS OF RESOURCE MGR  03S0044 01012000
*                                      TERMINATION ROUTINE FOR  03S0044 01013000
*                                      PURGEDQ                       */ 01014000
*          6 SRBPARM PTR(31),       /* USER PARAMETER                */ 01015000
*          6 SRBSAVE PTR(31),       /* SAVE AREA POINTER FOR    03S0044 01016000
*                                      REDISPATCH OF SUSPENDED S SRB.*/ 01017000
*          6 SRBPKF BIT(8),         /* PROTECT KEY IN HIGH ORDER 4      01018000
*                                      BITS, LOW ORDER BITS 0        */ 01019000
*          6 SRBPRIOR PTR(8),       /* PRIORITY LEVEL                */ 01020000
*          6 * CHAR(2),             /* RESERVED                      */ 01021000
*          6 * PTR(31)              /* RESERVED                      */ 01022000
*                ;                                              03S0044 01023000
*                                                               03S0045 01024000
*/* **************************************************************** */ 01025000
*/*                                                                  */ 01026000
*/*            ADDRESS SPACE CONTROL BLOCK                           */ 01027000
*/*                                                                  */ 01028000
*/*  OS/VS2 RELEASE 2, 07/10/73, LEVEL=13                            */ 01029000
*/*                                                                  */ 01030000
*/*  METHOD OF ACCESS                                                */ 01031000
*/*      BAL  - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.      */ 01032000
*/*             USING ON ASCB GIVES ADDRESSABILITY FOR ALL SYMBOLS.  */ 01033000
*/*      PL/S - DCL ASCBPTR PTR                                      */ 01034000
*/*                                                                  */ 01035000
*/* **************************************************************** */ 01036000
*                                                               03S0045 01037000
*   DCL                                                         03S0045 01038000
*     1 ASCB BASED(ASCBPTR) BDY(DWORD),                         03S0045 01039000
*      2 ASCBEGIN CHAR(0),          /* BEGINNING OF ASCB             */ 01040000
*      2 ASCBASCB CHAR(4) BDY(WORD),/* ACRONYM IN EBCDIC -ASCB-      */ 01041000
*      2 ASCBFWDP PTR(31),          /* ADDRESS OF NEXT ASCB ON ASCB     01042000
*                                      READY QUEUE                   */ 01043000
*      2 ASCBBWDP PTR(31),          /* ADDRESS OF PREVIOUS ASCB ON      01044000
*                                      ASCB READY QUEUE              */ 01045000
*      2 ASCBLOCK FIXED(31),        /* LOCAL LOCK                    */ 01046000
*      2 ASCBIOSP PTR(31),          /* POINTER TO IOS PURGE INTERFACE   01047000
*                                      CONTROL BLOCK (IPIB)          */ 01048000
*      2 ASCBFSLQ PTR(31),          /* POINTER TO FIRST SUSPENDED SRB   01049000
*                                      ON THE LOCK SUSPENDED SRB        01050000
*                                      QUEUE                         */ 01051000
*      2 ASCBLSLQ PTR(31),          /* POINTER TO LAST SUSPENDED SRB    01052000
*                                      ON THE LOCK SUSPENDED SRB        01053000
*                                      QUEUE                         */ 01054000
*      2 ASCBSPL PTR(31),           /* POINTER TO SPL                */ 01055000
*      2 ASCBCPUS FIXED(31),        /* NUMBER OF CPU'S ACTIVE IN THIS   01056000
*                                      MEMORY MDC007                 */ 01057000
*      2 ASCBASID BIT(16) BDY(WORD),/* ADDRESS SPACE IDENTIFIER FOR     01058000
*                                      THE ASCB                      */ 01059000
*      2 ASCBSEQN FIXED(15),        /* SEQUENCE NUMBER THAT     03S0045 01060000
*                                      REPRESENTS THE ASCB'S POSITION   01061000
*                                      ON THE DISPATCHING QUEUE      */ 01062000
*      2 ASCBIOSM FIXED(15) BDY(WORD),/* I/O SERVICE MEASURE         */ 01063000
*      2 ASCBRV07 PTR(8),           /* RESERVED MDC017               */ 01064000
*      2 ASCBDP PTR(8),             /* DISPATCHING PRIORITY RANGE       01065000
*                                      FROM 0-255                    */ 01066000
*      2 ASCBSTOR PTR(31),          /* TABLE LENGTH AND REAL ADDRESS    01067000
*                                      OF SEGMENT TABLE IN THE SAME     01068000
*                                      FORMAT AS CONTROL REGISTER ONE   01069000
*                                      MDC027                        */ 01070000
*      2 ASCBLDA PTR(31),           /* POINTER TO LOCAL DATA AREA       01071000
*                                      PART OF LSQA FOR VSM          */ 01072000
*      2 ASCBRSM PTR(31),           /* ADDRESS OF RSM'S CONTROL BLOCK   01073000
*                                      HEADER                        */ 01074000
*      2 ASCBCSCB PTR(31),          /* ADDRESS OF CSCB               */ 01075000
*      2 ASCBTSB PTR(31),           /* ADDRESS OF TSB                */ 01076000
*      2 ASCBEJST BIT(64) BDY(DWORD),/* ELAPSED JOB STEP TIMING 03S0045 01077000
*                                      UNSIGNED 64-BIT BINARY NUMBER */ 01078000
*      2 ASCBEWST BIT(64) BDY(DWORD),/* TIME OF DAY WHENEVER I-STREAM   01079000
*                                      IS SWITCHED FROM A MEMORY     */ 01080000
*      2 ASCBJSTL BIT(32) BDY(WORD),/* CPU TIME LIMIT FOR THE JOB       01081000
*                                      STEP                          */ 01082000
*      2 ASCBECB BIT(32) BDY(WORD), /* RCT'S WORK ECB                */ 01083000
*      2 ASCBUBET BIT(32) BDY(WORD),/* TIME STAMP WHEN USER BECAME      01084000
*                                      READY                         */ 01085000
*      2 ASCBQSVC FIXED(31),        /* CPID FOR SVRB QUICKCELL       */ 01086000
*      2 ASCBDUMP PTR(31),          /* SVC DUMP'S ECB POINTER        */ 01087000
*      2 ASCBFW1 FIXED(31),         /* FULL-WORD LABEL TO BE USED FOR   01088000
*                                      COMPARE AND SWAP FOR ANY BIT     01089000
*                                      IN THIS WORD MDC026           */ 01090000
*       3 ASCBAFFN BIT(16) BDY(WORD),/* CPU AFFINITY INDICATOR       */ 01091000
*       3 ASCBRCTF BIT(8),          /* FLAGS FOR RCT                 */ 01092000
*        4 ASCBTMNO BIT(1),         /* MEMORY IS BEING QUIESCED, IS     01093000
*                                      QUIESCED, OR IS BEING RESTORED*/ 01094000
*        4 ASCBFRS BIT(1),          /* RESTORE REQUEST               */ 01095000
*        4 ASCBFQU BIT(1),          /* QUICESCE REQUEST              */ 01096000
*        4 ASCBRV08 BIT(1),         /* RESERVED (MDC031)       YM2236*/ 01097000
*        4 ASCBWAIT BIT(1),         /* LONG WAIT INDICATOR           */ 01098000
*        4 ASCBOUT BIT(1),          /* ADDRESS SPACE CONSIDERED 03S0045 01099000
*                                      SWAPPED OUT                   */ 01100000
*        4 ASCBTMLW BIT(1),         /* MEMORY IS IN A LONG WAIT      */ 01101000
*        4 ASCBRF01 BIT(1),         /* RESERVED                      */ 01102000
*       3 ASCBFLG1 BIT(8),          /* FLAG BYTE                     */ 01103000
*        4 ASCBTOFF BIT(1),         /* MEMORY SHOULD NOT BE CHECKED     01104000
*                                      FOR JOB STEP TIMING           */ 01105000
*        4 ASCBCMSH BIT(1),         /* CMS LOCK HELD                 */ 01106000
*        4 ASCBS3S BIT(1),          /* STAGE II EXIT EFFECTOR HAS       01107000
*                                      SCHEDULED A RQE OR IQE AND       01108000
*                                      STAGE III EXIT EFFECTOR SHOULD   01109000
*                                      BE INVOKED                    */ 01110000
*        4 ASCBTERM BIT(1),         /* ADDRESS SPACE TERMINATING        01111000
*                                      NORMALLY                      */ 01112000
*        4 ASCBABNT BIT(1),         /* ADDRESS SPACE TERMINATING        01113000
*                                      ABNORMALLY                    */ 01114000
*        4 ASCBSTND BIT(1),         /* TCB'S NON-DISPATCHABLE        */ 01115000
*        4 ASCBTYP1 BIT(1),         /* TYPE1 SVC HAS CONTROL         */ 01116000
*        4 ASCBNSWP BIT(1),         /* PROGRAM IS NON SWAPPABLE OR      01117000
*                                      WILL RUN IN V=R REGION        */ 01118000
*      2 ASCBTMCH PTR(31),          /* TERMINATION QUEUE CHAIN       */ 01119000
*      2 ASCBASXB PTR(31),          /* POINTER TO ADDRESS SPACE 03S0045 01120000
*                                      EXTENSION CONTROL BLOCK (ASXB)*/ 01121000
*      2 ASCBSWCT FIXED(15) BDY(WORD),/* NUMBER OF TIMES MEMORY 03S0045 01122000
*                                      ENTERS SHORT WAIT             */ 01123000
*      2 ASCBDSP1 BIT(8),           /* NON-DISPATCHABILITY FLAGS     */ 01124000
*       3 ASCBNOQ BIT(1),           /* ASCB NOT ON ASCB DISPATCHING     01125000
*                                      QUEUE                         */ 01126000
*       3 ASCBFAIL BIT(1),          /* A FAILURE HAS OCCURRED WITHIN    01127000
*                                      THE ADDRESS SPACE. THE MEMORY    01128000
*                                      IS NONDISPATCHABLE            */ 01129000
*       3 ASCBRF02 BIT(1),          /* RESERVED MDC013               */ 01130000
*       3 ASCBRF03 BIT(1),          /* RESERVED MDC014               */ 01131000
*       3 ASCBRF04 BIT(1),          /* RESERVED                      */ 01132000
*       3 ASCBRF05 BIT(1),          /* RESERVED                      */ 01133000
*       3 ASCBRF06 BIT(1),          /* RESERVED                      */ 01134000
*       3 ASCBRF07 BIT(1),          /* RESERVED                      */ 01135000
*      2 ASCBFLG2 BIT(8),           /* FLAG BYTE MDC015              */ 01136000
*       3 ASCBXMPT BIT(1),          /* ASCB EXEMPT FROM SYSTEM  03S0045 01137000
*                                      NON-DISPATCHABLE MDC013       */ 01138000
*       3 ASCBPXMT BIT(1),          /* ASCB PERMANENTLY EXEMPT FROM     01139000
*                                      SYSTEM NON-DISPATCHABLE MDC014*/ 01140000
*       3 ASCBCEXT BIT(1),          /* CANCEL TIMER EXTENSION BECAUSE   01141000
*                                      EOT PROCESSING IS STARTED FOR    01142000
*                                      THE JOB STEP TCB MDC021       */ 01143000
*       3 ASCBS2S BIT(1),           /* FOR LOCK MANAGER, ENTRY MADE     01144000
*                                      TO STAGE II EXIT EFFECTOR        01145000
*                                      WITHOUT CORRESPONDING ENTRY TO   01146000
*                                      STAGE III EXIT EFFECTOR MDC020*/ 01147000
*       3 ASCBSNQS BIT(1),          /* STATUS STOP NON-QUIESCEABLE      01148000
*                                      LEVEL SRB'S MDC028            */ 01149000
*       3 ASCBRV04 BIT(1),          /* RESERVED                      */ 01150000
*       3 ASCBRV05 BIT(1),          /* RESERVED                      */ 01151000
*       3 ASCBRV06 BIT(1),          /* RESERVED                      */ 01152000
*      2 ASCBSSRB FIXED(15) BDY(WORD),/* COUNT OF STATUS STOP SRB'S  */ 01153000
*      2 ASCBSRBS FIXED(15),        /* COUNT OF SRB'S DISPATCHED IN     01154000
*                                      THIS MEMORY                   */ 01155000
*      2 ASCBVSC FIXED(15) BDY(WORD),/* ALLOCATED AUXILIARY SLOT        01156000
*                                      COUNT (VAM) MDC004            */ 01157000
*      2 ASCBNVSC FIXED(15),        /* ALLOCATED AUXILIARY SLOT COUNT   01158000
*                                      (NON-VAM) MDC005              */ 01159000
*      2 ASCBTCBS FIXED(31),        /* NUMBER OF READY TCB'S IN THIS    01160000
*                                      MEMORY MDC006                 */ 01161000
*      2 ASCBCMSF PTR(31),          /* ADDRESS OF NEXT ASCB ON CMS      01162000
*                                      SUSPEND QUEUE                 */ 01163000
*      2 ASCBCMSB PTR(31),          /* ADDRESS OF PREVIOUS ASCB ON      01164000
*                                      CMS SUSPEND QUEUE             */ 01165000
*      2 ASCBQECB BIT(32) BDY(WORD),/* QUIESCE ECB                   */ 01166000
*      2 ASCBMECB BIT(32) BDY(WORD),/* MEMORY CREATE/DELETE ECB      */ 01167000
*      2 ASCBOUCB PTR(31),          /* SYSTEM RESOURCES MANAGER (SRM)   01168000
*                                      USER CONTROL BLOCK POINTER    */ 01169000
*      2 ASCBOUXB PTR(31),          /* SYSTEM RESOURCES MANAGER (SRM)   01170000
*                                      USER EXTENSION BLOCK POINTER  */ 01171000
*      2 ASCBFMCT FIXED(15) BDY(WORD),/* ALLOCATED PAGE FRAME COUNT  */ 01172000
*      2 ASCBRS01 FIXED(15),        /* RESERVED FOR FUTURE USE       */ 01173000
*      2 ASCBXMPQ PTR(31),          /* POINTER TO XMPOST SRB QUEUE      01174000
*                                      MDC023                        */ 01175000
*      2 ASCBIQEA PTR(31),          /* POINTER TO IQE FOR ATCAM 03S0045 01176000
*                                      ASYNCHRONOUS PROCESSING MDC010*/ 01177000
*      2 ASCBRTWA PTR(31),          /* POINTER TO LAST RTM2 WORK AREA   01178000
*                                      ACQUIRED FROM SQA MDC011      */ 01179000
*      2 ASCBMCC CHAR(4) BDY(WORD), /* USED TO HOLD A MEMORY    03S0045 01180000
*                                      TERMINATION COMPLETION CODE ON   01181000
*                                      ABNORMAL MEMORY TERMINATION      01182000
*                                      MDC012                        */ 01183000
*      2 ASCBJBNI PTR(31),          /* POINTER TO JOBNAME FIELD FOR     01184000
*                                      INITIATED PROGRAMS OR ZERO       01185000
*                                      MDC018                        */ 01186000
*      2 ASCBJBNS PTR(31),          /* POINTER TO JOBNAME FIELD FOR     01187000
*                                      START/MOUNT/LOGON OR ZERO        01188000
*                                      MDC019                        */ 01189000
*      2 ASCBLGCB PTR(31),          /* ADDRESS OF LOGICAL GROUP CHAIN   01190000
*                                      BLOCK (LGCB) CHAIN MDC022     */ 01191000
*      2 ASCBVGTT PTR(31),          /* ADDRESS OF VSAM GLOBAL   03S0045 01192000
*                                      TERMINATION TABLE (VGTT) 03S0045 01193000
*                                      MDC024                        */ 01194000
*      2 ASCBPCTT PTR(31),          /* ADDRESS OF PRIVATE CATALOG       01195000
*                                      TERMINATION TABLE (PCTT) 03S0045 01196000
*                                      MDC025                        */ 01197000
*      2 ASCBRS12 FIXED(15),        /* RESERVED FOR FUTURE USE       */ 01198000
*      2 ASCBSMCT PTR(8),           /* NUMBER OF OUTSTANDING STEP       01199000
*                                      MUST COMPLETE REQUESTS IN        01200000
*                                      ADDRESS SPACE MDC016          */ 01201000
*      2 ASCBRS14 BIT(8),           /* RESERVED FOR FUTURE USE       */ 01202000
*      2 ASCBSWTL FIXED(31),        /* STEP WAIT TIME LIMIT MDC029   */ 01203000
*      2 ASCBSRBT CHAR(8) BDY(DWORD),/* ACCUMULATED SRB TIME MDC030  */ 01204000
*      2 ASCBEND CHAR(0) BDY(DWORD);/* END OF ASCB              03S0045 01205000
*                                                                    */ 01206000
*                                                               03S0046 01207000
*/* **************************************************************** */ 01208000
*/*                                                                  */ 01209000
*/*            ADDRESS SPACE EXTENSION BLOCK                         */ 01210000
*/*                                                                  */ 01211000
*/*  OS/VS2 RELEASE 2, 07/10/73, LEVEL=7                             */ 01212000
*/*                                                                  */ 01213000
*/*  METHOD OF ACCESS                                                */ 01214000
*/*      BAL  - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.      */ 01215000
*/*             USING ON ASXB GIVES ADDRESSABILITY FOR ALL SYMBOLS.  */ 01216000
*/*      PL/S - DCL ASXBPTR PTR                                      */ 01217000
*/*                                                                  */ 01218000
*/* **************************************************************** */ 01219000
*                                                               03S0046 01220000
*   DCL                                                         03S0046 01221000
*     1 ASXB BASED(ASXBPTR) BDY(DWORD),                         03S0046 01222000
*      2 ASXBEGIN CHAR(0),          /* BEGINNING OF ASXB             */ 01223000
*      2 ASXBASXB CHAR(4),          /* ACRONYM IN EBCDIC -ASXB-      */ 01224000
*      2 ASXBFTCB PTR(31),          /* POINTER TO FIRST TCB ON TCB      01225000
*                                      QUEUE                         */ 01226000
*      2 ASXBLTCB PTR(31),          /* POINTER TO LAST TCB ON TCB       01227000
*                                      QUEUE                         */ 01228000
*      2 ASXBTCBS FIXED(15),        /* NUMBER TCB'S IN THE MEMORY    */ 01229000
*      2 ASXBRS00 FIXED(15),        /* RESERVED                      */ 01230000
*      2 ASXBMPST PTR(31),          /* ADDRESS OF MEMORY PROCESS        01231000
*                                      SCHEDULING TABLE MDC015       */ 01232000
*      2 ASXBLWA PTR(31),           /* ADDRESS OF LWA MDC016         */ 01233000
*      2 ASXBRV14 PTR(31),          /* RESERVED MDC006               */ 01234000
*      2 ASXBRV15 PTR(31),          /* RESERVED MDC007               */ 01235000
*      2 ASXBIHSA PTR(31),          /* POINTER TO INTERRUPT HANDLERS    01236000
*                                      SAVE AREA FOR LOCALLY LOCKED     01237000
*                                      INTERRUPTS                    */ 01238000
*      2 ASXBFLSA(18) FIXED(31),    /* SAVE AREA FOR ANY FIRST LEVEL    01239000
*                                      BRANCH ENTRY (MUST BE FIRST      01240000
*                                      USER AFTER LOCAL LOCK    03S0046 01241000
*                                      OBTAINED)                     */ 01242000
*      2 ASXBFRWA PTR(31),          /* POINTER TO FRR WORKAREA       */ 01243000
*      2 ASXBSPSA PTR(31),          /* POINTER TO LOCAL WORK/SAVE       01244000
*                                      AREA VECTOR TABLE             */ 01245000
*      2 ASXBRSMD PTR(31),          /* POINTER TO LOCAL RSM DATA AREA*/ 01246000
*      2 ASXBRCTD PTR(31),          /* POINTER TO LOCAL RCT DATA AREA*/ 01247000
*      2 ASXBDDR PTR(31),           /* POINTER TO DDR WAIT QUEUE     */ 01248000
*      2 ASXBOUSB PTR(31),          /* POINTER TO SYSTEM RESOURCES      01249000
*                                      MANAGER (SRM) USER SWAPPABLE     01250000
*                                      BLOCK MDC004                  */ 01251000
*      2 ASXBRV26 PTR(31),          /* RESERVED (MDC002)       YM2236*/ 01252000
*      2 ASXBPRG CHAR(16) BDY(WORD),/* SVC PURGE I/O PARAMETER LIST     01253000
*                                      MDC003                        */ 01254000
*      2 ASXBPSWD CHAR(8) BDY(WORD),/* USER'S LOGON PASSWORD. IF        01255000
*                                      BLANK, NOT REQUIRED. MDC005   */ 01256000
*      2 ASXBSIRB PTR(31),          /* ADDRESS OF SIRB FOR THIS 03S0046 01257000
*                                      ADDRESS SPACE MDC010          */ 01258000
*      2 ASXBETSK PTR(31),          /* ADDRESS OF ERROR TASK FOR THIS   01259000
*                                      ADDRESS SPACE MDC011          */ 01260000
*      2 ASXBAEQ CHAR(24) BDY(WORD),/* QUEUE ANCHORS FOR EXIT   03S0046 01261000
*                                      EFFECTOR'S ASYNCHRONOUS EXIT     01262000
*                                      QUEUES MDC012                 */ 01263000
*       3 ASXBFIQE PTR(31),         /* ADDRESS OF FIRST IQE MDC006   */ 01264000
*       3 ASXBLIQE PTR(31),         /* ADDRESS OF LAST IQE MDC007    */ 01265000
*       3 ASXBFRQE PTR(31),         /* ADDRESS OF FIRST RQE MDC008   */ 01266000
*       3 ASXBLRQE PTR(31),         /* ADDRESS OF LAST IQE MDC009    */ 01267000
*       3 ASXBFSRB PTR(31),         /* ADDRESS OF FIRST SRB MDC013   */ 01268000
*       3 ASXBLSRB PTR(31),         /* ADDRESS OF LAST SRB MDC014    */ 01269000
*      2 ASXBRV16 PTR(31),          /* RESERVED                      */ 01270000
*      2 ASXBRV17 PTR(31),          /* RESERVED                      */ 01271000
*      2 ASXBRV18 PTR(31),          /* RESERVED                      */ 01272000
*      2 ASXBRV19 PTR(31),          /* RESERVED                      */ 01273000
*      2 ASXBRV20 PTR(31),          /* RESERVED                      */ 01274000
*      2 ASXBRV21 PTR(31),          /* RESERVED                      */ 01275000
*      2 ASXBRV22 PTR(31),          /* RESERVED                      */ 01276000
*      2 ASXBRV23 PTR(31),          /* RESERVED                      */ 01277000
*      2 ASXBRV24 PTR(31),          /* RESERVED                      */ 01278000
*      2 ASXBRV25 PTR(31),          /* RESERVED                      */ 01279000
*      2 ASXBEND CHAR(0)            /* END OF ASXB                   */ 01280000
*            BDY(DWORD);                                        03S0046 01281000
*                                                               03S0047 01282000
*/* **************************************************************** */ 01283000
*/*                                                                  */ 01284000
*/*            WORK/SAVE AREA VECTOR TABLES (WSAVT)                  */ 01285000
*/*                                                                  */ 01286000
*/*  OS/VS2 RELEASE 2, 07/26/73, LEVEL=17                            */ 01287000
*/*                                                                  */ 01288000
*/*  METHOD OF ACCESS                                                */ 01289000
*/*      PL/S - INCLUDE IHAASXB TO DEFINE ASXBSPSA FOR LOCAL WSAVT.  */ 01290000
*/*             INCLUDE CVT TO DEFINE CVTSPSA FOR GLOBAL WSAVT.      */ 01291000
*/*             INCLUDE IHALCCA TO DEFINE LCCACPUS FOR CPU WSAVT.    */ 01292000
*/*                                                                  */ 01293000
*/*             ALL 3 WSAVT'S ARE MAPPED UNLESS MACRO VARIABLE(S)    */ 01294000
*/*             ARE SET TO NO.  CODING %WSALOCAL='NO' BEFORE INCLUDE */ 01295000
*/*             MEANS THAT A MAPPING OF LOCAL WSAVT WILL NOT BE      */ 01296000
*/*             PRODUCED.  %WSAGLOBL='NO' SUPPRESSES GLOBAL WSAVT    */ 01297000
*/*             MAPPING.  %WSACPU='NO' SUPPRESSES CPU WSAVT MAPPING. */ 01298000
*/*                                                                  */ 01299000
*/*      BAL -  THERE ARE 4 KEYWORD PARAMETERS AS FOLLOWS -          */ 01300000
*/*                                                                  */ 01301000
*/*             1. CLASS=LOCAL/GLOBAL/CPU WITH A DEFAULT OF LOCAL.   */ 01302000
*/*                THIS PARAMETER DETERMINES WHICH WSAVT MAPPING IS  */ 01303000
*/*                PRODUCED.                                         */ 01304000
*/*                                                                  */ 01305000
*/*             2. DSECT=YES/NO WITH A DEFAULT OF YES.  IF YES, A    */ 01306000
*/*                DSECT IS PRODUCED FOR MAPPING REQUESTED BY CLASS  */ 01307000
*/*                PARAMETER.  THE DSECT NAMES ARE -                 */ 01308000
*/*                     WSAL - LOCAL WSAVT                           */ 01309000
*/*                     WSAG - GLOBAL WSAVT                          */ 01310000
*/*                     WSAC - CPU WSAVT                             */ 01311000
*/*                                                                  */ 01312000
*/*             3. FUNC=INIT.  IF THIS PARAMETER IS SPECIFIED, AN    */ 01313000
*/*                INITIALIZED TABLE OF HALF-WORD LENGTH VALUES      */ 01314000
*/*                DESCRIBING THE NUMBER OF ENTRIES AND LENGTH OF    */ 01315000
*/*                EACH ENTRY IN WSAVT SPECIFIED BY CLASS PARAMETER  */ 01316000
*/*                IS PRODUCED.                                      */ 01317000
*/*                                                                  */ 01318000
*/*             4. ACR=YES/NO WITH A DEFAULT OF YES.  IF CLASS=CPU   */ 01319000
*/*                AND DSECT=NO, ACR=YES CREATES A WORK/SAVE AREA    */ 01320000
*/*                FOR ACR, AND ACR=NO CREATES A RESERVED 8-BYTE     */ 01321000
*/*                AREA BECAUSE ACR IS NOT IN THE SYSTEM.            */ 01322000
*/*                                                                  */ 01323000
*/*             DSECT=NO MUST BE SPECIFIED IF FUNC=INIT IS SPECIFIED.*/ 01324000
*/*                                                                  */ 01325000
*/*             IF DSECT=NO IS SPECIFIED AND FUNC=INIT IS NOT        */ 01326000
*/*             SPECIFIED, THE MAPPING OF WSAVT WILL BE FOLLOWED BY  */ 01327000
*/*             MAPPING OF ACTUAL WORK/SAVE AREAS.                   */ 01328000
*/*                                                                  */ 01329000
*/* **************************************************************** */ 01330000
*                                                               03S0047 01331000
*   DECLARE                                                     03S0047 01332000
*     1 WSAL BASED(ASXBSPSA) BDY(DWORD),/* LOCAL WORK/SAVE AREA 03S0047 01333000
*                                      VECTOR TABLE                  */ 01334000
*      2 WSALCWSA PTR(31),          /* ADDRESS OF LOW-LEVEL COMMON      01335000
*                                      SAVE AREA (104 BYTES)         */ 01336000
*      2 WSALVALC PTR(31),          /* ADDRESS OF VALIDITY CHECK SAVE   01337000
*                                      AREA (64 BYTES)               */ 01338000
*      2 WSALRTM2 PTR(31),          /* ADDRESS OF RECOVERY      03S0047 01339000
*                                      TERMINATION MONITOR (RTM) SAVE   01340000
*                                      AREA (80 BYTES)               */ 01341000
*      2 WSALSDMP PTR(31),          /* ADDRESS OF SDUMP SAVE AREA (80   01342000
*                                      BYTES)                        */ 01343000
*      2 WSALABTM PTR(31),          /* ADDRESS OF ABTERM SAVE AREA      01344000
*                                      (80 BYTES)                    */ 01345000
*      2 WSALCIRB PTR(31),          /* ADDRESS OF CIRB SAVE AREA (80    01346000
*                                      BYTES) MDC005                 */ 01347000
*      2 WSALS2EE PTR(31),          /* ADDRESS OF STAGE 2 EXIT  03S0047 01348000
*                                      EFFECTOR SAVE AREA (80 BYTES) */ 01349000
*      2 WSALEXIT PTR(31),          /* ADDRESS OF EXIT (SVC 3) SAVE     01350000
*                                      AREA (128 BYTES)              */ 01351000
*      2 WSALPOST PTR(31),          /* ADDRESS OF POST SAVE AREA (72    01352000
*                                      BYTES)                        */ 01353000
*      2 WSALWAIT PTR(31),          /* ADDRESS OF WAIT SAVE AREA (72    01354000
*                                      BYTES)                        */ 01355000
*      2 WSALSTAT PTR(31),          /* ADDRESS OF STATUS SAVE AREA      01356000
*                                      (72 BYTES)                    */ 01357000
*      2 WSALSTAE PTR(31),          /* ADDRESS OF STAE SAVE AREA (112   01358000
*                                      BYTES) MDC003                 */ 01359000
*      2 WSALRV01 PTR(31),          /* RESERVED MDC015               */ 01360000
*      2 WSALRSM PTR(31),           /* ADDRESS OF REAL STORAGE  03S0047 01361000
*                                      MANAGEMENT (RSM) SAVE AREA (72   01362000
*                                      BYTES) (MDC025)         YM2689*/ 01363000
*      2 WSALACHP PTR(31);          /* ADDRESS OF ASCB CHAP ROUTINE     01364000
*                                      SAVE AREA (40 BYTES)          */ 01365000
*   DECLARE                                                     03S0048 01366000
*     1 WSAG BASED(CVTSPSA) BDY(DWORD),/* GLOBAL WORK/SAVE AREA 03S0048 01367000
*                                      VECTOR TABLE                  */ 01368000
*      2 WSAGPGIO PTR(31),          /* ADDRESS OF PAGE I/O ERROR SAVE   01369000
*                                      AREA (80 BYTES)               */ 01370000
*      2 WSAGGMFM PTR(31),          /* ADDRESS OF GETMAIN/ FREEMAIN     01371000
*                                      SAVE AREA (1104 BYTES) MDC010 */ 01372000
*      2 WSAGRSM PTR(31),           /* ADDRESS OF REAL STORAGE  03S0048 01373000
*                                      MANAGEMENT (RSM) SAVE AREA       01374000
*                                      (1024 BYTES)                  */ 01375000
*      2 WSAGSSRS PTR(31),          /* ADDRESS OF SUSPEND/RESET FOR     01376000
*                                      RSM SAVE AREA (80 BYTES)      */ 01377000
*      2 WSAGEMS0 PTR(31),          /* ADDRESS OF MEMORY SWITCH SAVE    01378000
*                                      AREA (56 BYTES)               */ 01379000
*      2 WSAGSTAT PTR(31),          /* ADDRESS OF STATUS SAVE AREA      01380000
*                                      (72 BYTES)                    */ 01381000
*      2 WSAGOPTM PTR(31),          /* ADDRESS OF SYSTEM RESOURCES      01382000
*                                      MANAGER (SRM) SAVE AREA (400     01383000
*                                      BYTES) MDC017                 */ 01384000
*      2 WSAGMEMT PTR(31),          /* ADDRESS OF MEMORY TERMINATION    01385000
*                                      SAVE AREA (80 BYTES)          */ 01386000
*      2 WSAGNQDQ PTR(31),          /* ADDRESS OF ENQ/DEQ SAVE AREA     01387000
*                                      (296 BYTES) MDC011            */ 01388000
*      2 WSAGREST PTR(31),          /* ADDRESS OF WORK/SAVE AREA FOR    01389000
*                                      STATUS SAVING BY STOP AND        01390000
*                                      RESTART SUBROUTINE (168 BYTES)   01391000
*                                      MDC018                        */ 01392000
*      2 WSAGSCHE PTR(31);          /* ADDRESS OF SCHEDULE ROUTINE      01393000
*                                      (IEAVESC0) SAVE AREA FOR 03S0048 01394000
*                                      SYSEVENT BRANCH ENTRY    03S0048 01395000
*                                      INTERFACE (72 BYTES) MDC014   */ 01396000
*   DECLARE                                                     03S0049 01397000
*     1 WSAC BASED(LCCACPUS) BDY(DWORD),/* CPU WORK/SAVE AREA VECTOR    01398000
*                                      TABLE                         */ 01399000
*      2 WSACCWSA PTR(31),          /* ADDRESS OF LOW-LEVEL COMMON      01400000
*                                      SAVE AREA (104 BYTES)         */ 01401000
*      2 WSACGTF PTR(31),           /* ADDRESS OF GTF SAVE AREA (136    01402000
*                                      BYTES) MDC002                 */ 01403000
*      2 WSACOPTM PTR(31),          /* ADDRESS OF SYSTEM RESOURCES      01404000
*                                      MANAGER (SRM) SAVE AREA (192     01405000
*                                      BYTES) MDC016                 */ 01406000
*      2 WSACTIME PTR(31),          /* ADDRESS OF TIMER SAVE AREA (96   01407000
*                                      BYTES) MDC008                 */ 01408000
*      2 WSACACR PTR(31),           /* ADDRESS OF AUTOMATIC CPU 03S0049 01409000
*                                      RECONFIGURATION (ACR) SAVE       01410000
*                                      AREA (1280 BYTES) (376 BYTES +   01411000
*                                      SOFTWARE FIELDS OF PSA) OR       01412000
*                                      ADDRESS OF 8-BYTE RESERVED       01413000
*                                      AREA IF ACR IS NOT IN THE        01414000
*                                      SYSTEM MDC024                 */ 01415000
*      2 WSACRTMK PTR(31),          /* ADDRESS OF RECOVERY      03S0049 01416000
*                                      TERMINATION MONITOR MACHINE      01417000
*                                      CHECK HANDLER (RTM/MACHK) SAVE   01418000
*                                      AREA (88 BYTES)               */ 01419000
*      2 WSACIOS PTR(31),           /* ADDRESS OF IOS (FLIH) SAVE       01420000
*                                      AREA (80 BYTES)               */ 01421000
*      2 WSACEDS0 PTR(31),          /* ADDRESS OF DISPATCHER SAVE       01422000
*                                      AREA (80 BYTES)               */ 01423000
*      2 WSACMF1 PTR(31),           /* ADDRESS OF MEASUREMENT   03S0049 01424000
*                                      FACILITY 1 SAVE AREA (144        01425000
*                                      BYTES) MDC019                 */ 01426000
*      2 WSACABTM PTR(31),          /* ADDRESS OF ABTERM SAVE AREA      01427000
*                                      (72 BYTES) MDC006             */ 01428000
*      2 WSACRSTI PTR(31),          /* ADDRESS OF I/O RESTART SAVE      01429000
*                                      AREA (128 BYTES) MDC009       */ 01430000
*      2 WSACREST PTR(31),          /* ADDRESS OF WORK/SAVE AREA FOR    01431000
*                                      STATUS SAVING BY STOP AND        01432000
*                                      RESTART SUBROUTINE (80 BYTES)    01433000
*                                      MDC013                        */ 01434000
*      2 WSACRRSA PTR(31),          /* ADDRESS OF SUPERVISOR REPAIR     01435000
*                                      ROUTINE SAVE AREA (64 BYTES)     01436000
*                                      MDC022                        */ 01437000
*      2 WSACCCH PTR(31);           /* ADDRESS OF RECOVERY MANAGEMENT   01438000
*                                      SERVICES - CHANNEL CHECK 03S0049 01439000
*                                      HANDLER (RMS-CCH) SAVE AREA      01440000
*                                      (72 BYTES) MDC023        03S0049 01441000
*                                                                    */ 01442000
*                                                               03S0050 01443000
*/* **************************************************************** */ 01444000
*/*                                                                  */ 01445000
*/*            LOGICAL CONFIGURATION COMMUNICATION AREA              */ 01446000
*/*                                                                  */ 01447000
*/*  OS/VS2 RELEASE 2, 09/18/73, LEVEL=15                            */ 01448000
*/*                                                                  */ 01449000
*/*  METHOD OF ACCESS                                                */ 01450000
*/*      BAL  - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.      */ 01451000
*/*             USING ON LCCA GIVES ADDRESSABILITY FOR ALL SYMBOLS.  */ 01452000
*/*      PL/S - DCL LCCAPTR PTR                                      */ 01453000
*/*                                                                  */ 01454000
*/* **************************************************************** */ 01455000
*                                                               03S0050 01456000
*   DECLARE                                                     03S0050 01457000
*     1 LCCA BASED(LCCAPTR) BDY(DWORD),                         03S0050 01458000
*      2 LCCALCCA CHAR(4) BDY(WORD),/* CONTROL BLOCK ACRONYM IN 03S0050 01459000
*                                      EBCDIC                        */ 01460000
*      2 LCCACPUA PTR(15),          /* LOGICAL CPU ADDRESS           */ 01461000
*      2 LCCARV77 FIXED(15),        /* RESERVED                      */ 01462000
*      2 LCCAPGR1(16) FIXED(31),    /* PROGRAM CHECK FLIH REGISTER      01463000
*                                      SAVE AREA 1                   */ 01464000
*      2 LCCAPGR2(16) FIXED(31),    /* PROGRAM CHECK FLIH REGISTER      01465000
*                                      SAVE AREA 2                   */ 01466000
*      2 LCCAPPSW CHAR(8) BDY(DWORD),/* PROGRAM CHECK FLIH PSW SAVE     01467000
*                                      AREA                          */ 01468000
*      2 LCCAPINT FIXED(31),        /* PROGRAM CHECK FLIH ILC AND       01469000
*                                      INTERRUPT CODE SAVE AREA      */ 01470000
*      2 LCCAPVAD FIXED(31),        /* TRANSLATION EXCEPTION ADDRESS    01471000
*                                      SAVE AREA                     */ 01472000
*      2 LCCAMCR1 FIXED(31),        /* MASTER MEMORY'S STOR REGISTER    01473000
*                                      VALUE                         */ 01474000
*      2 LCCACR0 FIXED(31),         /* WORK AREA FOR TESTING BITS IN    01475000
*                                      CONTROL REGISTER 0            */ 01476000
*      2 LCCAXGR1(16) FIXED(31),    /* EXTERNAL FLIH REGISTER SAVE      01477000
*                                      AREA 1                        */ 01478000
*      2 LCCAXGR2(16) FIXED(31),    /* EXTERNAL FLIH REGISTER SAVE      01479000
*                                      AREA 2                        */ 01480000
*      2 LCCAXGR3(16) FIXED(31),    /* EXTERNAL FLIH REGISTER SAVE      01481000
*                                      AREA 3                        */ 01482000
*      2 LCCARSGR(16) FIXED(31),    /* RESTART FLIH REGISTER SAVE       01483000
*                                      AREA                          */ 01484000
*      2 LCCARSFP CHAR(32) BDY(DWORD),/* RESTART FLIH FLOATING POINT    01485000
*                                      REGISTER SAVE AREA            */ 01486000
*      2 LCCAGPGR(16) FIXED(31),    /* I/O AND SVC FLIH REGISTER SAVE   01487000
*                                      AREA                          */ 01488000
*      2 LCCAIOPS CHAR(8) BDY(DWORD),/* I/O FLIH PSW SAVE AREA       */ 01489000
*      2 LCCAIHRC CHAR(4) BDY(WORD),/* GENERAL FLIH RECURSION FLAGS  */ 01490000
*       3 LCCAIHR1 BIT(8),          /* FIRST BYTE OF LCCAIHRC        */ 01491000
*        4 LCCAXRC1 BIT(1),         /* EXTERNAL FLIH RECURSION BIT 1 */ 01492000
*        4 LCCAXRC2 BIT(1),         /* EXTERNAL FLIH RECURSION BIT 2 */ 01493000
*        4 LCCAPDAT BIT(1),         /* PROGRAM CHECK FLIH DAT   03S0050 01494000
*                                      RECURSION BIT                 */ 01495000
*        4 LCCAPSG1 BIT(1),         /* PROGRAM CHECK FLIH SEGMENT       01496000
*                                      RECURSION BIT                 */ 01497000
*        4 LCCAPPIE BIT(1),         /* PROGRAM CHECK FLIH SPIE  03S0050 01498000
*                                      PROCESS RECURSION BIT         */ 01499000
*        4 LCCARV01 BIT(1),         /* RESERVED                      */ 01500000
*        4 LCCARV02 BIT(1),         /* RESERVED                      */ 01501000
*        4 LCCARV03 BIT(1),         /* RESERVED                      */ 01502000
*       3 LCCAIHR2 BIT(8),          /* SECOND BYTE OF LCCAIHRC       */ 01503000
*        4 LCCARV04 BIT(1),         /* RESERVED                      */ 01504000
*        4 LCCARV05 BIT(1),         /* RESERVED                      */ 01505000
*        4 LCCARV06 BIT(1),         /* RESERVED                      */ 01506000
*        4 LCCARV07 BIT(1),         /* RESERVED                      */ 01507000
*        4 LCCARV08 BIT(1),         /* RESERVED                      */ 01508000
*        4 LCCARV09 BIT(1),         /* RESERVED                      */ 01509000
*        4 LCCARV10 BIT(1),         /* RESERVED                      */ 01510000
*        4 LCCARV11 BIT(1),         /* RESERVED                      */ 01511000
*       3 LCCAIHR3 BIT(8),          /* THIRD BYTE OF LCCAIHRC        */ 01512000
*        4 LCCARV12 BIT(1),         /* RESERVED                      */ 01513000
*        4 LCCARV13 BIT(1),         /* RESERVED                      */ 01514000
*        4 LCCARV14 BIT(1),         /* RESERVED                      */ 01515000
*        4 LCCARV15 BIT(1),         /* RESERVED                      */ 01516000
*        4 LCCARV16 BIT(1),         /* RESERVED                      */ 01517000
*        4 LCCARV17 BIT(1),         /* RESERVED                      */ 01518000
*        4 LCCARV18 BIT(1),         /* RESERVED                      */ 01519000
*        4 LCCARV19 BIT(1),         /* RESERVED                      */ 01520000
*       3 LCCAIHR4 BIT(8),          /* FOURTH BYTE OF LCCAIHRC       */ 01521000
*        4 LCCARV20 BIT(1),         /* RESERVED                      */ 01522000
*        4 LCCARV21 BIT(1),         /* RESERVED                      */ 01523000
*        4 LCCARV22 BIT(1),         /* RESERVED                      */ 01524000
*        4 LCCARV23 BIT(1),         /* RESERVED                      */ 01525000
*        4 LCCARV24 BIT(1),         /* RESERVED                      */ 01526000
*        4 LCCARV25 BIT(1),         /* RESERVED                      */ 01527000
*        4 LCCARV26 BIT(1),         /* RESERVED                      */ 01528000
*        4 LCCARV27 BIT(1),         /* RESERVED                      */ 01529000
*      2 LCCASPIN CHAR(4) BDY(WORD),/* PROCESSOR IS SPINNING    03S0050 01530000
*                                      INDICATORS                    */ 01531000
*       3 LCCASPN1 BIT(8),          /* FIRST BYTE OF LCCASPIN        */ 01532000
*        4 LCCAPTLB BIT(1),         /* PTLB PROCESSOR SPIN BIT       */ 01533000
*        4 LCCASIGP BIT(1),         /* SIGP PROCESSOR SPIN BIT       */ 01534000
*        4 LCCALOCK BIT(1),         /* LOCK MANAGER SPIN BIT         */ 01535000
*        4 LCCATSPN BIT(1),         /* SIMULATES SPIN FOR TIMER 03S0050 01536000
*                                      SUPERVISOR AT VARY TIME       */ 01537000
*        4 LCCARSTR BIT(1),         /* USED BY A PROGRAM SPINNING FOR   01538000
*                                      THE RESTART RESOURCE MDC035   */ 01539000
*        4 LCCAMFIO BIT(1),         /* MF/1 IOS INITIALIZATION SPIN     01540000
*                                      BIT - USED BY MF/1 EMERGENCY     01541000
*                                      SIGNAL (EMS) AND MALFUNCTION     01542000
*                                      ALERT (MFA) MDC036            */ 01543000
*        4 LCCARV30 BIT(1),         /* RESERVED                      */ 01544000
*        4 LCCARV31 BIT(1),         /* RESERVED                      */ 01545000
*       3 LCCASPN2 BIT(8),          /* SECOND BYTE OF LCCASPIN       */ 01546000
*        4 LCCARV32 BIT(1),         /* RESERVED                      */ 01547000
*        4 LCCARV33 BIT(1),         /* RESERVED                      */ 01548000
*        4 LCCARV34 BIT(1),         /* RESERVED                      */ 01549000
*        4 LCCARV35 BIT(1),         /* RESERVED                      */ 01550000
*        4 LCCARV36 BIT(1),         /* RESERVED                      */ 01551000
*        4 LCCARV37 BIT(1),         /* RESERVED                      */ 01552000
*        4 LCCARV38 BIT(1),         /* RESERVED                      */ 01553000
*        4 LCCARV39 BIT(1),         /* RESERVED                      */ 01554000
*       3 LCCASPN3 BIT(8),          /* THIRD BYTE OF LCCASPIN        */ 01555000
*        4 LCCARV40 BIT(1),         /* RESERVED                      */ 01556000
*        4 LCCARV41 BIT(1),         /* RESERVED                      */ 01557000
*        4 LCCARV42 BIT(1),         /* RESERVED                      */ 01558000
*        4 LCCARV43 BIT(1),         /* RESERVED                      */ 01559000
*        4 LCCARV44 BIT(1),         /* RESERVED                      */ 01560000
*        4 LCCARV45 BIT(1),         /* RESERVED                      */ 01561000
*        4 LCCARV46 BIT(1),         /* RESERVED                      */ 01562000
*        4 LCCARV47 BIT(1),         /* RESERVED                      */ 01563000
*       3 LCCASPN4 BIT(8),          /* FOURTH BYTE OF LCCASPIN       */ 01564000
*        4 LCCARV48 BIT(1),         /* RESERVED                      */ 01565000
*        4 LCCARV49 BIT(1),         /* RESERVED                      */ 01566000
*        4 LCCARV50 BIT(1),         /* RESERVED                      */ 01567000
*        4 LCCARV51 BIT(1),         /* RESERVED                      */ 01568000
*        4 LCCARV52 BIT(1),         /* RESERVED                      */ 01569000
*        4 LCCARV53 BIT(1),         /* RESERVED                      */ 01570000
*        4 LCCARV54 BIT(1),         /* RESERVED                      */ 01571000
*        4 LCCARV55 BIT(1),         /* RESERVED                      */ 01572000
*      2 LCCAESSA FIXED(31),        /* EMERGENCY SIGNAL SLIH SAVE       01573000
*                                      AREA FOR EXTERNAL FLIH RETURN    01574000
*                                      ADDRESS MDC012                */ 01575000
*      2 LCCAASCP FIXED(31),        /* SAVE AREA FOR ISSUING    03S0050 01576000
*                                      PROCESSOR'S PCCA ADDRESS 03S0050 01577000
*                                      MDC013                        */ 01578000
*      2 LCCACPUS PTR(31),          /* POINTER TO CPU WORK/SAVE AREA    01579000
*                                      VECTOR TABLE                  */ 01580000
*      2 LCCADSF1 BIT(8) BDY(WORD), /* DISPATCHER STATUS INDICATOR      01581000
*                                      BYTE 1                        */ 01582000
*       3 LCCAACR BIT(1),           /* ACR IN PROGRESS               */ 01583000
*       3 LCCAVCPU BIT(1),          /* VARY CPU IN PROGRESS          */ 01584000
*       3 LCCADSS BIT(1),           /* IF ON, INDICATES TO THE  03S0050 01585000
*                                      DISPATCHER THAT DSS IS WAITING   01586000
*                                      TO BE ACTIVATED AND A MEMORY     01587000
*                                      SWITCH MUST BE PERFORMED 03S0050 01588000
*                                      MDC002                        */ 01589000
*       3 LCCATIMR BIT(1),          /* CPU'S TOD CLOCK IS TO BE OR IS   01590000
*                                      BEING SYNCHRONIZED MDC011     */ 01591000
*       3 LCCARV58 BIT(1),          /* RESERVED                      */ 01592000
*       3 LCCARV59 BIT(1),          /* RESERVED                      */ 01593000
*       3 LCCARV60 BIT(1),          /* RESERVED                      */ 01594000
*       3 LCCARV61 BIT(1),          /* RESERVED                      */ 01595000
*      2 LCCADSF2 BIT(8) BDY(WORD,2),/* DISPATCHER STATUS INDICATOR     01596000
*                                      BYTE 2                        */ 01597000
*       3 LCCASRBM BIT(1),          /* SRB MODE INDICATOR            */ 01598000
*       3 LCCAGSRB BIT(1),          /* GLOBAL SRB-MODE INDICATOR     */ 01599000
*       3 LCCADSPL BIT(1),          /* LOCAL LOCK GOTTEN BY     03S0050 01600000
*                                      DISPATCHER MDC040             */ 01601000
*       3 LCCADSRW BIT(1),          /* DISPATCHER HAS DISPATCHED        01602000
*                                      READY WORK MDC046             */ 01603000
*       3 LCCARV64 BIT(1),          /* RESERVED                      */ 01604000
*       3 LCCARV65 BIT(1),          /* RESERVED                      */ 01605000
*       3 LCCARV66 BIT(1),          /* RESERVED                      */ 01606000
*       3 LCCARV67 BIT(1),          /* RESERVED                      */ 01607000
*      2 LCCAPSMK CHAR(1) BDY(WORD,3),/* STORE AREA FOR FLIH'S STOSM    01608000
*                                      INSTRUCTION                   */ 01609000
*      2 LCCARV68 CHAR(1),          /* RESERVED                      */ 01610000
*      2 LCCASPSA CHAR(48) BDY(WORD),/* REGISTER SAVE AREA FOR  03S0050 01611000
*                                      INTER-CPU COMMUNICATION       */ 01612000
*       3 LCCADSR2 FIXED(31),       /* IEAVEDR'S CALLER'S REGISTER 2    01613000
*                                      MDC014                        */ 01614000
*       3 LCCADSR3 FIXED(31),       /* IEAVEDR'S CALLER'S REGISTER 3    01615000
*                                      MDC015                        */ 01616000
*       3 LCCADSR4 FIXED(31),       /* IEAVEDR'S CALLER'S REGISTER 4    01617000
*                                      MDC016                        */ 01618000
*       3 LCCADSR5 FIXED(31),       /* IEAVEDR'S CALLER'S REGISTER 5    01619000
*                                      MDC017                        */ 01620000
*       3 LCCARPR2 FIXED(31),       /* IEAVERP'S CALLER'S REGISTER 2    01621000
*                                      MDC018                        */ 01622000
*       3 LCCARPR3 FIXED(31),       /* IEAVERP'S CALLER'S REGISTER 3    01623000
*                                      MDC019                        */ 01624000
*       3 LCCARPR4 FIXED(31),       /* IEAVERP'S CALLER'S REGISTER 4    01625000
*                                      MDC020                        */ 01626000
*       3 LCCARPR5 FIXED(31),       /* IEAVERP'S CALLER'S REGISTER 5    01627000
*                                      MDC021                        */ 01628000
*       3 LCCARIR2 FIXED(31),       /* IEAVERI'S CALLER'S REGISTER 2    01629000
*                                      MDC022                        */ 01630000
*       3 LCCARIR3 FIXED(31),       /* IEAVERI'S CALLER'S REGISTER 3    01631000
*                                      MDC023                        */ 01632000
*       3 LCCARIR4 FIXED(31),       /* IEAVERI'S CALLER'S REGISTER 4    01633000
*                                      MDC024                        */ 01634000
*       3 LCCARIR5 FIXED(31),       /* IEAVERI'S CALLER'S REGISTER 5    01635000
*                                      MDC025                        */ 01636000
*      2 LCCASTOD CHAR(8) BDY(DWORD),/* TOD AT LAST TASK TIME   03S0050 01637000
*                                      INTERVAL                      */ 01638000
*      2 LCCADTOD CHAR(8) BDY(DWORD),/* TOD VALUE WHEN TCB IS   03S0050 01639000
*                                      DISPATCHED                    */ 01640000
*      2 LCCAITOD CHAR(8) BDY(DWORD),/* TOD VALUE WHEN I/O OR   03S0050 01641000
*                                      EXTERNAL INTERRUPT            */ 01642000
*      2 LCCAWTIM CHAR(8) BDY(DWORD),/* ACCUMULATED CPU WAIT TIME    */ 01643000
*      2 LCCADSS1(3) FIXED(31),     /* GENERAL REGISTERS 15-1 AS        01644000
*                                      SAVED BY DSS PROGRAM OR SVC      01645000
*                                      INTERRUPT HANDLER MDC026      */ 01646000
*      2 LCCADSS2(3) FIXED(31),     /* GENERAL REGISTERS 15-1 AS        01647000
*                                      SAVED BY DSS I/O OR EXTERNAL     01648000
*                                      INTERRUPT HANDLER MDC027      */ 01649000
*      2 LCCADSS3(3) FIXED(31),     /* GENERAL REGISTERS 15-1 AS        01650000
*                                      SAVED BY DSS MACHINE CHECK       01651000
*                                      INTERRUPT HANDLER MDC028      */ 01652000
*      2 LCCADSSC(2) FIXED(31),     /* DSS CONTROL REGISTERS 0 AND 1    01653000
*                                      SAVE AREA MDC029              */ 01654000
*      2 LCCADSSR FIXED(31),        /* DSS CONTROL REGISTER 14 SAVE     01655000
*                                      AREA MDC030                   */ 01656000
*      2 LCCASRBJ FIXED(31),        /* SUSPENDED SERVICE REQUEST        01657000
*                                      BLOCK (SRB) JOURNAL WORD USED    01658000
*                                      BY SETLOCK MDC043             */ 01659000
*      2 LCCADCPU PTR(31),          /* VIRTUAL ADDRESS OF LCCA OF       01660000
*                                      FAILING CPU                   */ 01661000
*      2 LCCARCPU PTR(31),          /* VIRTUAL ADDRESS OF LCCA OF       01662000
*                                      RECOVERING CPU                */ 01663000
*      2 LCCACRLC FIXED(31),        /* ACR SAVE AREA FOR HIGHEST LOCK   01664000
*                                      HELD INDICATOR                */ 01665000
*      2 LCCALCR0 FIXED(31),        /* SAVE AREA FOR CONTROL REGISTER   01666000
*                                      0 FOR SETLOCK                 */ 01667000
*      2 LCCACRFL BIT(8),           /* ACR FLAGS                     */ 01668000
*       3 LCCACRTM BIT(1),          /* RTM ENTRY BIT                 */ 01669000
*       3 LCCACLMS BIT(1),          /* PROCESS SUSPENDED             */ 01670000
*       3 LCCARV69 BIT(1),          /* RESERVED                      */ 01671000
*       3 LCCARV70 BIT(1),          /* RESERVED                      */ 01672000
*       3 LCCARV71 BIT(1),          /* RESERVED                      */ 01673000
*       3 LCCARV72 BIT(1),          /* RESERVED                      */ 01674000
*       3 LCCARV73 BIT(1),          /* RESERVED                      */ 01675000
*       3 LCCAVARY BIT(1),          /* TELLS ACR THAT VARY IS IN        01676000
*                                      PROGRESS MDC038               */ 01677000
*      2 LCCACREX BIT(8),           /* ACR ENTRY AND EXIT FLAGS      */ 01678000
*       3 LCCACREF BIT(1),          /* EXTERNAL ROUTINE              */ 01679000
*       3 LCCACRRM BIT(1),          /* FINAL EXIT                    */ 01680000
*       3 LCCACRLE BIT(1),          /* LOCK MANAGER EXIT             */ 01681000
*       3 LCCACRRT BIT(1),          /* FRR EXIT                      */ 01682000
*       3 LCCACRIN BIT(1),          /* ENTRY TYPE = ACR              */ 01683000
*       3 LCCACRLM BIT(1),          /* ENTRY TYPE = ACRLM            */ 01684000
*       3 LCCACRDP BIT(1),          /* ENTRY TYPE = ACRDISP          */ 01685000
*       3 LCCACRST BIT(1),          /* SYSTERM TERMINATION EXIT FLAG    01686000
*                                      MDC037                        */ 01687000
*      2 LCCALKFG BIT(8),           /* LOCK FLAG BYTE MDC005         */ 01688000
*       3 LCCALKDP BIT(1),          /* DISPATCHER LOCK OBTAINED BY      01689000
*                                      SETLOCK MDC039                */ 01690000
*       3 LCCALKSA BIT(1),          /* STORAGE ALLOCATION LOCK  03S0050 01691000
*                                      OBTAINED BY SETLOCK MDC041    */ 01692000
*       3 LCCALKAQ BIT(1),          /* ASCB BEING QUEUED TO THE 03S0050 01693000
*                                      SUSPEND QUEUE BY SETLOCK 03S0050 01694000
*                                      MDC042                        */ 01695000
*       3 LCCALKRD BIT(1),          /* THIS IS A LOCK MANAGER RELEASE   01696000
*                                      DISABLED REQUEST MDC047       */ 01697000
*       3 LCCARV84 BIT(1),          /* RESERVED                      */ 01698000
*       3 LCCARV85 BIT(1),          /* RESERVED                      */ 01699000
*       3 LCCARV86 BIT(1),          /* RESERVED                      */ 01700000
*       3 LCCARV87 BIT(1),          /* RESERVED                      */ 01701000
*      2 LCCARV88 CHAR(1),          /* RESERVED                      */ 01702000
*      2 LCCAPINV FIXED(31),        /* SAVE AREA FOR CONTROL REGISTER   01703000
*                                      WHEN OPEN WINDOW INTERFACE TO    01704000
*                                      EXTERNAL FLIH IS INVOKED      */ 01705000
*      2 LCCARV78 FIXED(31),        /* RESERVED                      */ 01706000
*      2 LCCALWTM CHAR(8) BDY(DWORD),/* VALUE OF LCCAWTIM AT THE END    01707000
*                                      OF A MEASUREMENT INTERVAL        01708000
*                                      MDC001                        */ 01709000
*      2 LCCAICR0 FIXED(31),        /* SAVE AREA FOR CONTROL REGISTER   01710000
*                                      0 FOR IPC MDC007              */ 01711000
*      2 LCCAECSA FIXED(31),        /* EXTERNAL CALL'S SLIH SAVE AREA   01712000
*                                      FOR EXTERNAL FLIH RETURN 03S0050 01713000
*                                      REGISTER MDC008               */ 01714000
*      2 LCCASRBF CHAR(8) BDY(DWORD),/* SRB FIELDS MDC009            */ 01715000
*       3 LCCASAFN FIXED(15),       /* CPU AFFINITY IF IN SRB MODE      01716000
*                                      MDC003                        */ 01717000
*       3 LCCAPGTA CHAR(6) BDY(DWORD,3),/* ASID/TCB IF IN SRB MODE      01718000
*                                      MDC004                        */ 01719000
*      2 LCCARV89 FIXED(31),        /* RESERVED FOR SRB EXPANSION    */ 01720000
*      2 LCCARV90 FIXED(31),        /* RESERVED                      */ 01721000
*      2 LCCAIRT CHAR(128) BDY(DWORD),/* IOS RECOVERY TABLE     03S0050 01722000
*                                      DESCRIBING ACTIVE REQUESTS,      01723000
*                                      LOCKS, ETC. MDC010            */ 01724000
*      2 LCCASMQJ FIXED(31),        /* GLOBAL SERVICE MANAGER QUEUE     01725000
*                                      (GSMQ) AND LOCAL SERVICE 03S0050 01726000
*                                      MANAGER QUEUE (LSMQ) JOURNAL     01727000
*                                      WORD USED BY DISPATCHER AND      01728000
*                                      SCHEDULE MDC044               */ 01729000
*      2 LCCASPLJ FIXED(31),        /* GLOBAL SYSTEM PRIORITY LIST      01730000
*                                      (GSPL) AND LOCAL SYSTEM  03S0050 01731000
*                                      PRIORITY LIST (LSPL) JOURNAL     01732000
*                                      WORD USED BY DISPATCHER MDC045*/ 01733000
*      2 LCCAESS2 PTR(31),          /* EMERGENCY SIGNAL SLIH SAVE       01734000
*                                      AREA FOR EXTERNAL FLIH'S 03S0050 01735000
*                                      RETURN ADDRESS ON RECURSIVE      01736000
*                                      ENTRIES (MDC048)        YM2608*/ 01737000
*      2 LCCAR103 PTR(31),          /* RESERVED                      */ 01738000
*      2 LCCADRT1 CHAR(8) BDY(DWORD),/* TIME OF DAY (TOD) ON FIRST      01739000
*                                      SIGP BUSY CONDITION (MDC049)     01740000
*                                                              YM3563*/ 01741000
*      2 LCCADRT2 CHAR(8) BDY(DWORD),/* TIME OF DAY (TOD) ON    03S0050 01742000
*                                      SUBSEQUENT SIGP BUSY CONDITION   01743000
*                                      (MDC050)                YM3563*/ 01744000
*      2 LCCAR108 PTR(31),          /* RESERVED                      */ 01745000
*      2 LCCAR109 PTR(31),          /* RESERVED                      */ 01746000
*      2 LCCAR110 PTR(31),          /* RESERVED                      */ 01747000
*      2 LCCAR111 PTR(31),          /* RESERVED                      */ 01748000
*      2 LCCAR112 PTR(31),          /* RESERVED                      */ 01749000
*      2 LCCAR113 PTR(31),          /* RESERVED                      */ 01750000
*      2 LCCAR114 PTR(31),          /* RESERVED                      */ 01751000
*      2 LCCAR115 PTR(31),          /* RESERVED                      */ 01752000
*      2 LCCAR116 PTR(31),          /* RESERVED                      */ 01753000
*      2 LCCAR117 PTR(31),          /* RESERVED                      */ 01754000
*      2 LCCAR118 PTR(31),          /* RESERVED                      */ 01755000
*      2 LCCAR119 PTR(31),          /* RESERVED                      */ 01756000
*      2 LCCAR120 PTR(31),          /* RESERVED                      */ 01757000
*      2 LCCAR121 PTR(31),          /* RESERVED                      */ 01758000
*      2 LCCAR122 PTR(31),          /* RESERVED                      */ 01759000
*      2 LCCAR123 PTR(31),          /* RESERVED                      */ 01760000
*      2 LCCAR124 PTR(31),          /* RESERVED                      */ 01761000
*      2 LCCAR125 PTR(31);          /* RESERVED                 03S0050 01762000
*                                                                    */ 01763000
*                                                               03S0051 01764000
*/*                                                                  */ 01765000
*/*      COMMUNICATION VECTOR TABLE                                  */ 01766000
*/*                                                                  */ 01767000
*/*      OS/VS1 RELEASE 3, OS/VS2 RELEASE 2, 11/15/73, LEVEL=32      */ 01768000
*/*                                                                  */ 01769000
*/*  METHOD OF ACCESS                                                */ 01770000
*/*      PL/S - DCL CVTPTR PTR                                       */ 01771000
*/*      BAL  - DSECT=YES SHOULD BE SPECIFIED ON MACRO CALL EXCEPT   */ 01772000
*/*             WHEN CALLED DURING SYSGEN TO CREATE CSECT.  CVT FOR  */ 01773000
*/*             OS/VS2 IS MAPPED UNLESS SYS=AOS1 IS SPECIFIED.  THE  */ 01774000
*/*             PREFIX IS NOT MAPPED UNLESS PREFIX=YES IS SPECIFIED. */ 01775000
*/*             A USING ON CVTMAP OR DSECT NAME WILL ESTABLISH       */ 01776000
*/*             ADDRESSABILITY FOR ALL SYMBOLS EXCEPT IN THE 2       */ 01777000
*/*             EXTENSIONS.  TO ESTABLISH ADDRESSABILITY FOR THE     */ 01778000
*/*             OS - OS/VS COMMON EXTENSION, YOU SHOULD CODE         */ 01779000
*/*                                                                  */ 01780000
*/*             L     REG,CVTEXT1                                    */ 01781000
*/*             USING CVTXTNT1,REG                                   */ 01782000
*/*                                                                  */ 01783000
*/*             TO ESTABLISH ADDRESSABILITY FOR THE OS/VS1 - OS/VS2  */ 01784000
*/*             COMMON EXTENSION, YOU SHOULD CODE                    */ 01785000
*/*                                                                  */ 01786000
*/*             L     REG,CVTEXT2                                    */ 01787000
*/*             USING CVTXTNT2,REG                                   */ 01788000
*/*                                                                  */ 01789000
*/*             WHERE REG IN EITHER CASE IS ANY REGISTER OTHER       */ 01790000
*/*             THAN ZERO.                                           */ 01791000
*/*                                                                  */ 01792000
*/*             WHEN LISTING IS SUPPRESSED, YOU CAN DETERMINE WHICH  */ 01793000
*/*             DSECT A SYMBOL IS IN BY USING THE STATEMENT NUMBER   */ 01794000
*/*             IN THE DEFN COLUMN IN THE CROSS REFERENCE LISTING.   */ 01795000
*/*             FOR EXAMPLE, ANY SYMBOL DEFINED BETWEEN THE          */ 01796000
*/*             STATEMENT NUMBERS FOR CVTXTNT1 AND CVTXTNT2 IS IN    */ 01797000
*/*             THE OS - OS/VS COMMON EXTENSION.                     */ 01798000
*/*                                                                  */ 01799000
*/*  F.E.'S                                                          */ 01800000
*/*      MICROFICHE LISTING - CVT                                    */ 01801000
*/*                                                                  */ 01802000
*/*  DEVELOPERS                                                      */ 01803000
*/*      BAL LISTING  - SPECIFY LIST=YES ON MACRO CALL               */ 01804000
*/*      PL/S LISTING - SPECIFY %IHALIST='YES' BEFORE INCLUDE        */ 01805000
*/*                                                                  */ 01806000
*/*      FOR INTEGRATION, A LISTING MUST NOT BE REQUESTED UNLESS     */ 01807000
*/*      YOUR MODULE CREATES THE CSECT.                              */ 01808000
*                                                               03S0051 01809000
*                                                               03S0051 01810000
*/*                    CVT PROPER                                    */ 01811000
*                                                               03S0051 01812000
*   DECLARE                                                     03S0051 01813000
*     1 CVTMAP BASED(CVTPTR) BDY(WORD),                         03S0051 01814000
*      2 CVT CHAR(0) BDY(WORD),     /* BEGINNING OF CVT MDC150       */ 01815000
*      2 CVTTCBP PTR(31),           /* ADDRESS OF A DOUBLE WORD, THE    01816000
*                                      FIRST CONTAINING THE NEXT-TO-    01817000
*                                      BE-DISPATCHED TCB ADDRESS. THE   01818000
*                                      SECOND CONTAINING THE LAST       01819000
*                                      (CURRENT) TCB ADDRESS. BOTH      01820000
*                                      WORDS ARE IDENTICAL UNLESS THE   01821000
*                                      TASK GOES INTO A WAIT STATE.     01822000
*                                      WHEN IN A WAIT STATE, THE        01823000
*                                      FIRST WORD IS SET TO ZERO        01824000
*                                      UNTIL THE WAITING IS OVER AND    01825000
*                                      THEN BOTH WORDS ARE ONCE AGAIN   01826000
*                                      IDENTICAL. (OS/VS1) ADDRESS OF   01827000
*                                      4-WORD LIST OF ADDRESSES - THE   01828000
*                                      NEXT TCB, THE CURRENT TCB, THE   01829000
*                                      NEXT ASCB AND THE CURRENT        01830000
*                                      ASCB, IN THAT ORDER (OS/VS2)     01831000
*                                      MDC026                        */ 01832000
*      2 CVT0EF00 PTR(31),          /* ADDRESS OF ROUTINE TO SCHEDULE   01833000
*                                      ASYNCHRONOUS EXITS            */ 01834000
*      2 CVTLINK PTR(31),           /* ADDRESS OF DCB FOR       03S0051 01835000
*                                      SYS1.LINKLIB DATA SET         */ 01836000
*      2 CVTJOB PTR(31),            /* ADDRESS OF QUEUE MANAGER 03S0051 01837000
*                                      RESIDENT DATA AREA (QMRES)       01838000
*                                      (OS/VS1) (MDC083)       XM4042*/ 01839000
*      2 CVTBUF PTR(31),            /* ADDRESS OF THE BUFFER OF THE     01840000
*                                      RESIDENT CONSOLE INTERRUPT       01841000
*                                      ROUTINE                       */ 01842000
*      2 CVTXAPG PTR(31),           /* ADDRESS OF I/O SUPERVISOR        01843000
*                                      APPENDAGE VECTOR TABLE        */ 01844000
*      2 CVT0VL00 PTR(31),          /* ADDRESS OF ENTRY POINT OF THE    01845000
*                                      TASK SUPERVISOR'S ADDRESS        01846000
*                                      VALIDITY CHECKING ROUTINE     */ 01847000
*      2 CVTPCNVT PTR(31),          /* ADDRESS OF ENTRY POINT OF THE    01848000
*                                      ROUTINE WHICH CONVERTS A 03S0051 01849000
*                                      RELATIVE TRACK ADDRESS (TTR)     01850000
*                                      TO AN ABSOLUTE TRACK ADDRESS     01851000
*                                      (MBBCCHHR)                    */ 01852000
*      2 CVTPRLTV PTR(31),          /* ADDRESS OF ENTRY POINT OF THE    01853000
*                                      ROUTINE WHICH CONVERTS AN        01854000
*                                      ABSOLUTE TRACK ADDRESS   03S0051 01855000
*                                      (MBBCCHHR) TO A RELATIVE TRACK   01856000
*                                      ADDRESS (TTR)                 */ 01857000
*      2 CVTILK1 PTR(31),           /* ADDRESS OF THE CHANNEL AND       01858000
*                                      CONTROL UNIT PORTION OF THE      01859000
*                                      UCB LOOKUP TABLE              */ 01860000
*      2 CVTILK2 PTR(31),           /* ADDRESS OF THE UCB HALFWORD      01861000
*                                      ADDRESS LIST PORTION OF THE      01862000
*                                      UCB LOOKUP TABLE              */ 01863000
*      2 CVTXTLER PTR(31),          /* ADDRESS OF ENTRY POINT OF AN     01864000
*                                      XCTL ROUTINE THAT BRINGS 03S0051 01865000
*                                      SYSTEM ERROR ROUTINES INTO THE   01866000
*                                      ERROR TRANSIENT AREA          */ 01867000
*      2 CVTSYSAD PTR(31),          /* ADDRESS OF THE SYSTEM    03S0051 01868000
*                                      RESIDENCE VOLUME ENTRY IN THE    01869000
*                                      UCB LOOKUP TABLE              */ 01870000
*      2 CVTBTERM PTR(31),          /* ADDRESS OF ENTRY POINT OF THE    01871000
*                                      ABTERM ROUTINE                */ 01872000
*      2 CVTDATE CHAR(4) BDY(WORD), /* CURRENT DATE IN PACKED DECIMAL*/ 01873000
*      2 CVTMSLT PTR(31),           /* ADDRESS OF THE MASTER COMMON     01874000
*                                      AREA IN MASTER SCHEDULER 03S0051 01875000
*                                      RESIDENT DATA AREA. NOTE - USE   01876000
*                                      CVTMSER INSTEAD TO ADDRESS       01877000
*                                      MASTER SCHEDULER RESIDENT DATA   01878000
*                                      AREA.                         */ 01879000
*      2 CVTZDTAB PTR(31),          /* ADDRESS OF I/O DEVICE    03S0051 01880000
*                                      CHARACTERISTIC TABLE          */ 01881000
*      2 CVTXITP PTR(31),           /* ADDRESS OF ERROR INTERPRETER     01882000
*                                      ROUTINE                       */ 01883000
*      2 CVTDAR PTR(31),            /* SAME AS CVTDARA BELOW (OS/VS1)   01884000
*                                      MDC029                        */ 01885000
*       3 CVTFLGS1 BIT(8),          /* FLAG BYTE (OS/VS1) MDC030     */ 01886000
*        4 CVTDMPLK BIT(1),         /* SVC DUMP IS IN PROGRESS  03S0051 01887000
*                                      (OS/VS1) MDC030               */ 01888000
*        4 CVTRSV01 BIT(1),         /* RESERVED                      */ 01889000
*        4 CVTRSV02 BIT(1),         /* RESERVED                      */ 01890000
*        4 CVTRSV03 BIT(1),         /* RESERVED                      */ 01891000
*        4 CVTRSV04 BIT(1),         /* RESERVED                      */ 01892000
*        4 CVTRSV05 BIT(1),         /* RESERVED                      */ 01893000
*        4 CVTRSV06 BIT(1),         /* RESERVED                      */ 01894000
*        4 CVTRSV07 BIT(1),         /* RESERVED                      */ 01895000
*       3 CVTDARA PTR(24),          /* ADDRESS OF THE SYS1.DUMP I/O     01896000
*                                      CONTROL BLOCKS NEEDED BY 03S0051 01897000
*                                      ABEND'S DAMAGE ASSESSMENT        01898000
*                                      ROUTINE (DAR) (OS/VS1) MDC029 */ 01899000
*      2 CVT0FN00 PTR(31),          /* ADDRESS OF ENTRY POINT OF THE    01900000
*                                      FINCH ROUTINE (OS/VS1)        */ 01901000
*      2 CVTEXIT CHAR(2) BDY(WORD), /* AN SVC 3 INSTRUCTION. EXIT TO    01902000
*                                      DISPATCHER.                   */ 01903000
*      2 CVTBRET CHAR(2) BDY(WORD,3),/* A BCR 15,14 INSTRUCTION.        01904000
*                                      RETURN TO CALLER (USED BY DATA   01905000
*                                      MANAGEMENT ROUTINES)          */ 01906000
*      2 CVTSVDCB PTR(31),          /* ADDRESS OF THE DCB FOR THE       01907000
*                                      SYS1.SVCLIB DATA SET          */ 01908000
*      2 CVTTPC PTR(31),            /* ADDRESS OF THE TIMER     03S0051 01909000
*                                      SUPERVISOR WORK AREA          */ 01910000
*      2 CVTPBLDL PTR(31),          /* ADDRESS OF BRANCH AND LINK       01911000
*                                      (BALR) ENTRY POINT OF THE BLDL   01912000
*                                      ROUTINE (OS/VS1) MDC103       */ 01913000
*      2 CVTSJQ PTR(31),            /* ADDRESS OF THE SELECTED JOB      01914000
*                                      QUEUE (OS/VS1)                */ 01915000
*      2 CVTCUCB PTR(31),           /* ADDRESS OF THE TABLE THAT        01916000
*                                      CONTAINS THE CURRENT CONSOLE     01917000
*                                      UCB ADDRESSES                 */ 01918000
*      2 CVTQTE00 PTR(31),          /* ADDRESS OF THE TIMER ENQUEUE     01919000
*                                      ROUTINE FOR INTERVAL TIMER    */ 01920000
*      2 CVTQTD00 PTR(31),          /* ADDRESS OF THE TIMER DEQUEUE     01921000
*                                      ROUTINE FOR INTERVAL TIMER    */ 01922000
*      2 CVTSTB PTR(31),            /* ADDRESS OF THE I/O DEVICE        01923000
*                                      STATISTICS TABLE              */ 01924000
*      2 CVTDCB CHAR(1) BDY(WORD),  /* OPERATING SYSTEM CONFIGURATION*/ 01925000
*        4 CVTRSV08 BIT(1),         /* RESERVED                      */ 01926000
*        4 CVT1SSS BIT(1),          /* PCP                           */ 01927000
*        4 CVT2SPS BIT(1),          /* MFT, OS/VS1                   */ 01928000
*        4 CVT4MS1 BIT(1),          /* MVT, OS/VS2                   */ 01929000
*        4 CVTRSV09 BIT(1),         /* RESERVED                      */ 01930000
*        4 CVT4MPS BIT(1),          /* MODEL 65 MULTIPROCESSING      */ 01931000
*        4 CVT6DAT BIT(1),          /* DYNAMIC ADDRESS TRANSLATION BY   01932000
*                                      CPU (OS/VS1, OS/VS2)          */ 01933000
*        4 CVTMVS2 BIT(1),          /* MULTIPLE MEMORY OPTION OF        01934000
*                                      OS/VS2 IS PRESENT MDC131      */ 01935000
*      2 CVTDCBA PTR(24),           /* ADDRESS OF THE DCB FOR THE       01936000
*                                      SYS1.LOGREC (OUTBOARD    03S0051 01937000
*                                      RECORDER) DATA SET FOR SYSTEM    01938000
*                                      ENVIRONMENT RECORDING (SER)   */ 01939000
*      2 CVTIOQET PTR(31),          /* ADDRESS OF IOS REQUEST ELEMENT   01940000
*                                      TABLE (OS/VS1) MDC020         */ 01941000
*      2 CVTIXAVL PTR(31),          /* ADDRESS OF THE I/O       03S0051 01942000
*                                      SUPERVISOR'S FREELIST POINTER    01943000
*                                      WHICH CONTAINS THE ADDRESS OF    01944000
*                                      THE NEXT REQUEST ELEMENT 03S0051 01945000
*                                      (OS/VS1) ADDRESS OF THE I/O      01946000
*                                      SUPERVISOR'S COMMUNICATION       01947000
*                                      AREA (IOCOM) (OS/VS2)         */ 01948000
*      2 CVTNUCB PTR(31),           /* LOWEST ADDRESS NOT IN THE        01949000
*                                      NUCLEUS (ON PAGE BOUNDARY)    */ 01950000
*      2 CVTFBOSV PTR(31),          /* ADDRESS OF PROGRAM FETCH 03S0051 01951000
*                                      ROUTINE                       */ 01952000
*      2 CVT0DS PTR(31),            /* ADDRESS OF ENTRY POINT OF THE    01953000
*                                      DISPATCHER                    */ 01954000
*      2 CVTILCH PTR(31),           /* ADDRESS OF THE LOGICAL CHANNEL   01955000
*                                      WORD TABLE                    */ 01956000
*      2 CVTIERLC PTR(31),          /* ADDRESS OF THE ASYNCHRONOUS      01957000
*                                      EXIT QUEUE                    */ 01958000
*      2 CVTMSER PTR(31),           /* ADDRESS OF DATA AREA OF MASTER   01959000
*                                      SCHEDULER RESIDENT DATA AREA  */ 01960000
*      2 CVT0PT01 PTR(31),          /* ADDRESS OF BRANCH ENTRY POINT    01961000
*                                      OF POST ROUTINE               */ 01962000
*      2 CVTRSV11 PTR(31),          /* ** CVTTRMTB FIELD UNUSED IN      01963000
*                                      OS/VS **                      */ 01964000
*      2 CVTHEAD PTR(31),           /* ADDRESS OF THE HIGHEST   03S0051 01965000
*                                      PRIORITY TCB IN THE READY        01966000
*                                      QUEUE (OS/VS1) MDC025         */ 01967000
*      2 CVTMZ00 PTR(31),           /* HIGHEST ADDRESS IN VIRTUAL       01968000
*                                      STORAGE FOR THE MACHINE       */ 01969000
*      2 CVT1EF00 PTR(31),          /* ADDRESS OF ROUTINE WHICH 03S0051 01970000
*                                      CREATES IRB'S FOR EXITS       */ 01971000
*      2 CVTQOCR PTR(31),           /* GRAPHICS INTERFACE TASK (GFX)    01972000
*                                      FIELD. ADDRESS OF SEVENTH WORD   01973000
*                                      OF GFX PARAMETER LIST, IF GFX    01974000
*                                      IS ACTIVE. ZERO IF GFX IS NOT    01975000
*                                      ACTIVE.                       */ 01976000
*      2 CVTQMWR PTR(31),           /* ADDRESS OF QUEUE MANAGER'S       01977000
*                                      SYSTEM OUTPUT COMMUNICATIONS-    01978000
*                                      DATA-AREA (CDA), WHICH IS        01979000
*                                      STORED ON AN EXTERNAL DEVICE  */ 01980000
*      2 CVTSNCTR FIXED(15),        /* SERIAL NUMBER COUNTER FOR        01981000
*                                      ASSIGNING SERIAL NUMBERS TO      01982000
*                                      NON-SPECIFIC, UNLABELED  03S0051 01983000
*                                      MAGNETIC TAPE VOLUMES         */ 01984000
*      2 CVTOPTA CHAR(1),           /* OPTION INDICATORS             */ 01985000
*       3 CVTCCH BIT(1),            /* CHANNEL CHECK HANDLER (CCH)      01986000
*                                      OPTION PRESENT - RECOVERY        01987000
*                                      MANAGEMENT SUPPORT (RMS) 03S0051 01988000
*                                                              XM4686*/ 01989000
*       3 CVTAPR BIT(1),            /* ALTERNATE PATH RETRY (APR)       01990000
*                                      OPTION PRESENT - RECOVERY        01991000
*                                      MANAGEMENT SUPPORT (RMS)      */ 01992000
*       3 CVTDDR BIT(1),            /* DYNAMIC DEVICE RECONFIGURATION   01993000
*                                      (DDR) OPTION PRESENT -   03S0051 01994000
*                                      RECOVERY MANAGEMENT SUPPORT      01995000
*                                      (RMS) (OS/VS1) DDR       03S0051 01996000
*                                      SYSTEM-INITIATED SWAP ACTIVE     01997000
*                                      (OS/VS2) MDC126               */ 01998000
*       3 CVTNIP BIT(1),            /* NIP IS EXECUTING              */ 01999000
*       3 CVTRSV12 BIT(1),          /* RESERVED                      */ 02000000
*       3 CVTRSV13 BIT(1),          /* RESERVED                      */ 02001000
*       3 CVTASCII BIT(1),          /* ASCII TAPE PROCESSING IS 03S0051 02002000
*                                      GENERATED IN THIS SYSTEM      */ 02003000
*       3 CVTXPFP BIT(1),           /* CPU HAS EXTENDED PRECISION       02004000
*                                      FLOATING POINT FEATURE        */ 02005000
*      2 CVTOPTB CHAR(1),           /* MISCELLANEOUS FLAGS           */ 02006000
*       3 CVTPROT BIT(1),           /* CPU HAS STORE PROTECTION 03S0051 02007000
*                                      FEATURE (OS/VS1)              */ 02008000
*       3 CVTCTIMS BIT(1),          /* IF ON, HARDWARE HAS THE CLOCK    02009000
*                                      COMPARATOR AND CPU TIMER 03S0051 02010000
*                                      FEATURE INSTALLED, AND OS/VS1    02011000
*                                      SYSGEN HAS SPECIFIED THIS        02012000
*                                      FEATURE (OS/VS1) MDC127       */ 02013000
*       3 CVTTOD BIT(1),            /* CPU HAS TIME-OF-DAY CLOCK        02014000
*                                      FEATURE                       */ 02015000
*       3 CVTNLOG BIT(1),           /* SYS1.LOGREC IS UNAVAILABLE FOR   02016000
*                                      ERROR RECORDING. ALWAYS SET TO   02017000
*                                      ZERO FOR OS/VS1 ICB382        */ 02018000
*       3 CVTAPTHR BIT(1),          /* NIP SETS THIS BIT TO 1 WHEN      02019000
*                                      DEVICE TESTING IS COMPLETE. IF   02020000
*                                      1, I/O SUPERVISOR USES AN        02021000
*                                      ALTERNATE PATH TO A DEVICE       02022000
*                                      WHEN A CONDITION CODE OF 3       02023000
*                                      EXISTS. THIS BIT IS RESET BY     02024000
*                                      NIP TO 0 AFTER THE LINK PACK     02025000
*                                      AREA IS INITIALIZED.    YM2670*/ 02026000
*       3 CVTFP BIT(1),             /* CPU HAS FETCH PROTECTION 03S0051 02027000
*                                      FEATURE (OS/VS1) ICB427       */ 02028000
*       3 CVTRSV16 BIT(1),          /* RESERVED                      */ 02029000
*       3 CVTRSV17 BIT(1),          /* RESERVED                      */ 02030000
*      2 CVTQCDSR PTR(31),          /* CDE SEARCH ROUTINE ADDRESS       02031000
*                                      (OS/VS2) ADDRESS OF THE  03S0051 02032000
*                                      ROUTINE THAT SEARCHES THE        02033000
*                                      REENTERABLE LOAD MODULE QUEUE    02034000
*                                      (OS/VS1)                      */ 02035000
*      2 CVTQLPAQ PTR(31),          /* ADDRESS OF POINTER TO MOST       02036000
*                                      RECENT ENTRY ON LINK PACK AREA   02037000
*                                      CDE QUEUE (OS/VS2) ADDRESS OF    02038000
*                                      THE REENTERABLE LOAD MODULE      02039000
*                                      QUEUE (OS/VS1)                */ 02040000
*      2 CVTRSV18 PTR(31),          /* ** CVTMPCVT FIELD UNUSED IN      02041000
*                                      OS/VS **                      */ 02042000
*      2 CVTSMCA PTR(31),           /* ADDRESS OF THE SYSTEM    03S0051 02043000
*                                      MANAGEMENT CONTROL AREA (SMCA)   02044000
*                                      IF THE SYSTEM MANAGEMENT 03S0051 02045000
*                                      FACILITIES (SMF) OPTION IS       02046000
*                                      PRESENT IN THE SYSTEM.   03S0051 02047000
*                                      OTHERWISE, ZERO.              */ 02048000
*      2 CVTABEND PTR(31),          /* ADDRESS OF SECONDARY CVT FOR     02049000
*                                      ABEND IN EOT (OS/VS2) USED BY    02050000
*                                      AN INTERNAL ABEND TRACE  03S0051 02051000
*                                      ROUTINE FOR DEBUG PURPOSES       02052000
*                                      (OS/VS1)                XM0615*/ 02053000
*      2 CVTUSER PTR(31),           /* A WORD AVAILABLE TO THE USER  */ 02054000
*      2 CVTMDLDS PTR(31),          /* RESERVED FOR MODEL-DEPENDENT     02055000
*                                      SUPPORT                       */ 02056000
*      2 CVTQABST CHAR(2) BDY(WORD),/* AN SVC 13 (ABEND) INSTRUCTION    02057000
*                                      (OS/VS2) RESERVED (OS/VS1)    */ 02058000
*      2 CVTLNKSC CHAR(2) BDY(WORD,3),/* AN SVC 6 (LINK) INSTRUCTION    02059000
*                                      ICB369                        */ 02060000
*      2 CVTTSCE PTR(31),           /* ADDRESS OF THE FIRST TIME        02061000
*                                      SLICE CONTROL ELEMENT (TSCE)  */ 02062000
*      2 CVTPATCH PTR(31),          /* ADDRESS OF A 200-BYTE FE PATCH   02063000
*                                      AREA                          */ 02064000
*      2 CVTRMS PTR(31),            /* RECOVERY MANAGEMENT SUPPORT      02065000
*                                      (RMS) COMMUNICATIONS VECTOR.     02066000
*                                      ADDRESS OF A MACHINE STATUS      02067000
*                                      BLOCK.                        */ 02068000
*      2 CVTRV515 PTR(31),          /* ** CVTTSCVT FIELD UNUSED IN      02069000
*                                      OS/VS2 REL 2 ** MDC037        */ 02070000
*      2 CVT0SCR1 PTR(31),          /* ADDRESS OF THE SECTOR    03S0051 02071000
*                                      CALCULATION ROUTINE FOR  03S0051 02072000
*                                      ROTATIONAL POSITION SENSING      02073000
*                                      (RPS)                         */ 02074000
*      2 CVTGTF PTR(31),            /* GENERALIZED TRACE FACILITY       02075000
*                                      (GTF) CONTROL WORD ICB312     */ 02076000
*       3 CVTGTFST BIT(8),          /* GTF FLAG BYTE ICB312          */ 02077000
*        4 CVTGTFS BIT(2),          /* GTF STATUS (OS/VS1) MDC088    */ 02078000
*         5 CVTGTFAV BIT(1),        /* IF ZERO, GTF NOT ACTIVE. IF      02079000
*                                      ONE, GTF ACTIVE. (OS/VS2)        02080000
*                                      MDC098                        */ 02081000
*         5 CVTRV315 BIT(1),        /* RESERVED (OS/VS2)             */ 02082000
*        4 CVTSTATE BIT(1),         /* GTF IS IN CONTROL PROCESSING A   02083000
*                                      HOOK (OS/VS1) MDC093          */ 02084000
*         5 CVTRV316 BIT(1),        /* RESERVED (OS/VS2)             */ 02085000
*        4 CVTTMODE BIT(1),         /* IF 0, MODE=INT SPECIFIED. IF     02086000
*                                      1, MODE=EXT SPECIFIED WHICH      02087000
*                                      MEANS TRACE DATA IS TO BE        02088000
*                                      WRITTEN TO AN EXTERNAL DEVICE.   02089000
*                                      (OS/VS1) MDC094               */ 02090000
*         5 CVTRV317 BIT(1),        /* RESERVED (OS/VS2)             */ 02091000
*        4 CVTFORM BIT(1),          /* TRACE DATA IS TO BE FORMATTED    02092000
*                                      ON ABNORMAL TERMINATION  03S0051 02093000
*                                      (OS/VS1) MDC095               */ 02094000
*         5 CVTRV318 BIT(1),        /* RESERVED (OS/VS2)             */ 02095000
*        4 CVTUSR BIT(1),           /* TRACE=USR SPECIFIED.     03S0051 02096000
*                                      USER-REQUESTED TRACE DATA IS     02097000
*                                      TO BE INCLUDED IN THE TRACE      02098000
*                                      DATA SET. (OS/VS1) MDC096     */ 02099000
*         5 CVTRV319 BIT(1),        /* RESERVED (OS/VS2)             */ 02100000
*        4 CVTRNIO BIT(1),          /* GTF IS ACTIVE AND TRACING RNIO   02101000
*                                      EVENTS MDC187                 */ 02102000
*        4 CVTRSV27 BIT(1),         /* RESERVED                      */ 02103000
*       3 CVTGTFA PTR(24),          /* ADDRESS OF THE MONITOR CALL      02104000
*                                      VECTOR TABLE (OS/VS1) ADDRESS    02105000
*                                      OF MAIN MONITOR CALL ROUTING     02106000
*                                      TABLE, MCHEAD (OS/VS2) MDC156 */ 02107000
*      2 CVTAQAVT PTR(31),          /* ADDRESS OF THE FIRST WORD OF     02108000
*                                      THE TCAM DISPATCHER WHICH        02109000
*                                      CONTAINS THE ADDRESS OF THE      02110000
*                                      ADDRESS VECTOR TABLE (AVT). IF   02111000
*                                      ZERO, TCAM IS NOT STARTED     */ 02112000
*       3 CVTTCMFG CHAR(1),         /* TCAM FLAGS                    */ 02113000
*        4 CVTTCRDY BIT(1),         /* TCAM IS READY TO ACCEPT USERS */ 02114000
*        4 CVTRSV28 BIT(1),         /* RESERVED                      */ 02115000
*        4 CVTRSV29 BIT(1),         /* RESERVED                      */ 02116000
*        4 CVTRSV30 BIT(1),         /* RESERVED                      */ 02117000
*        4 CVTRSV31 BIT(1),         /* RESERVED                      */ 02118000
*        4 CVTRSV32 BIT(1),         /* RESERVED                      */ 02119000
*        4 CVTRSV33 BIT(1),         /* RESERVED                      */ 02120000
*        4 CVTRSV34 BIT(1),         /* RESERVED                      */ 02121000
*       3 CVTAQAVB PTR(24),         /* SAME AS CVTAQAVT ABOVE        */ 02122000
*      2 CVTVOLM2 PTR(31),          /* RESERVED POINTER (OS/VS2)        02123000
*                                      MDC192                        */ 02124000
*       3 CVTTATA PTR(31),          /* ADDRESS OF THE FIRST ENTRY IN    02125000
*                                      THE TCB ADDRESS TABLE. THE       02126000
*                                      FIRST ENTRY IS FOR PARTITION     02127000
*                                      0. (OS/VS1)                   */ 02128000
*        4 CVTTSKS PTR(8),          /* MAXIMUM ALLOWABLE NUMBER OF      02129000
*                                      ENTRIES IN THE TCB ADDRESS       02130000
*                                      TABLE (OS/VS1)                */ 02131000
*         5 CVTVOLF2 BIT(8),        /* RESERVED INITIALIZATION BYTE     02132000
*                                      (OS/VS2) MDC202               */ 02133000
*          6 CVTVOLI2 BIT(1),       /* RESERVED INITIALIZATION FLAG     02134000
*                                      (OS/VS2) MDC203               */ 02135000
*        4 CVTTAT PTR(24),          /* SAME AS CVTTATA ABOVE         */ 02136000
*         5 CVTVOLT2 PTR(24),       /* RESERVED PARAMETER (OS/VS2)      02137000
*                                      MDC204                        */ 02138000
*      2 CVTATER PTR(31),           /* ADDRESS OF THE SYSTEM ERROR      02139000
*                                      TCB. THE PURGE ROUTINE USES      02140000
*                                      THIS FIELD TO ACCESS THE SIRB.   02141000
*                                      (OS/VS1) ICB346               */ 02142000
*       3 CVTSYST PTR(8),           /* NUMBER OF ENTRIES IN THE TCB     02143000
*                                      ADDRESS TABLE FOR TCB'S  03S0051 02144000
*                                      CREATED DURING SYSTEM    03S0051 02145000
*                                      GENERATION (OS/VS1)           */ 02146000
*       3 CVTATERA PTR(24),         /* SAME AS CVTATER ABOVE         */ 02147000
*      2 CVTEXT1 PTR(31),           /* ADDRESS OF OS - OS/VS COMMON     02148000
*                                      EXTENSION ICB421              */ 02149000
*      2 CVTCBSP PTR(31),           /* ADDRESS OF ACCESS METHOD 03S0051 02150000
*                                      CONTROL BLOCK STRUCTURE MDC195*/ 02151000
*      2 CVTPURG PTR(31),           /* ADDRESS OF SUBSYSTEM PURGE       02152000
*                                      ROUTINE ICB330                */ 02153000
*       3 CVTRSV35 PTR(8),          /* RESERVED ICB330               */ 02154000
*       3 CVTPURGA PTR(24),         /* ADDRESS OF SUBSYSTEM PURGE       02155000
*                                      ROUTINE ICB330                */ 02156000
*      2 CVTAMFF CHAR(4),           /* RESERVED FOR ACCESS METHOD       02157000
*                                      FLAGS ICB436                  */ 02158000
*      2 CVTQMSG PTR(31),           /* ADDRESS OF INFORMATION TO BE     02159000
*                                      PRINTED BY ABEND ICB307       */ 02160000
*       3 CVTRSV36 PTR(8),          /* RESERVED ICB307               */ 02161000
*       3 CVTQMSGA PTR(24),         /* ADDRESS OF INFORMATION TO BE     02162000
*                                      PRINTED BY ABEND ICB307       */ 02163000
*      2 CVTDMSR PTR(31),           /* SAME AS CVTDMSRA BELOW ICB346 */ 02164000
*       3 CVTRSV37 PTR(8),          /* RESERVED ICB346               */ 02165000
*       3 CVTDMSRA PTR(24),         /* ADDRESS OF THE OPEN/CLOSE/EOV    02166000
*                                      SUPERVISORY ROUTINE IN THE       02167000
*                                      NUCLEUS. THIS ROUTINE HANDLES    02168000
*                                      THE ROUTING OF CONTROL AMONG     02169000
*                                      THE I/O SUPPORT ROUTINES.        02170000
*                                      ICB346                        */ 02171000
*      2 CVTRSV38 PTR(31),          /* RESERVED                      */ 02172000
*      2 CVTRSV39 PTR(31),          /* RESERVED                      */ 02173000
*/*            OS/VS1 - OS/VS2 COMMON SECTION                        */ 02174000
*                                                               03S0051 02175000
*      2 CVTREAL PTR(31),           /* ADDRESS OF THE VIRTUAL STORAGE   02176000
*                                      BYTE FOLLOWING THE HIGHEST       02177000
*                                      VIRTUAL=REAL STORAGE ADDRESS     02178000
*                                      ICB368                        */ 02179000
*      2 CVTPTRV PTR(31),           /* ADDRESS OF PAGING SUPERVISOR     02180000
*                                      GENERAL ROUTINE TO TRANSLATE     02181000
*                                      REAL ADDRESSES TO VIRTUAL        02182000
*                                      ADDRESSES                     */ 02183000
*      2 CVTMODE PTR(31),           /* ADDRESS OF ROUTINE TO CHANGE     02184000
*                                      SYSTEM MASK (OS/VS1) (MDC217)    02185000
*                                                              YM4244*/ 02186000
*      2 CVTJESCT PTR(31),          /* ADDRESS OF JOB ENTRY SUBSYSTEM   02187000
*                                      (JES) CONTROL TABLE           */ 02188000
*      2 CVTJEPS PTR(31),           /* ADDRESS OF JOB ENTRY     03S0051 02189000
*                                      PERIPHERAL SERVICES (JEPS)       02190000
*                                      MONITOR TCB (OS/VS1)    YM2702*/ 02191000
*      2 CVTTZ FIXED(31),           /* DIFFERENCE BETWEEN LOCAL TIME    02192000
*                                      AND GREENWICH MEAN TIME IN       02193000
*                                      BINARY UNITS OF 1.048576 03S0051 02194000
*                                      SECONDS                       */ 02195000
*      2 CVTMCHPR PTR(31),          /* ADDRESS OF MACHINE CHECK 03S0051 02196000
*                                      PARAMETER LIST                */ 02197000
*      2 CVTEORM PTR(31),           /* HIGHEST REAL ADDRESS IN MAIN     02198000
*                                      STORAGE (OS/VS1) POTENTIAL       02199000
*                                      REAL HIGH STORAGE ADDRESS        02200000
*                                      (OS/VS2) MDC087               */ 02201000
*      2 CVTERPV PTR(31),           /* ADDRESS OF I/O SUPERVISOR        02202000
*                                      SUBROUTINE TO CONVERT CCW DATA   02203000
*                                      ADDRESSES TO VIRTUAL ADDRESSES   02204000
*                                      ICB367                        */ 02205000
*      2 CVTINTLA PTR(31),          /* ADDRESS OF A TIME INTERVAL.      02206000
*                                      I/O LOAD BALANCING COUNTS THE    02207000
*                                      NUMBER OF EXCP'S ISSUED DURING   02208000
*                                      THIS TIME INTERVAL AND USES      02209000
*                                      THE VALUE IN DETERMINING THE     02210000
*                                      AMOUNT OF I/O ACTIVITY IN THE    02211000
*                                      SYSTEM. ICB341                */ 02212000
*      2 CVTAPF PTR(31),            /* SAME AS CVTAPFA BELOW ICB360  */ 02213000
*       3 CVTRSV40 PTR(8),          /* RESERVED ICB360               */ 02214000
*       3 CVTAPFA PTR(24),          /* ADDRESS OF BRANCH ENTRY POINT    02215000
*                                      IN AUTHORIZED PROGRAM FACILITY   02216000
*                                      (APF) ROUTINE                 */ 02217000
*      2 CVTEXT2 PTR(31),           /* ADDRESS OF OS/VS1 - OS/VS2       02218000
*                                      COMMON EXTENSION ICB330       */ 02219000
*       3 CVTRSV41 PTR(8),          /* RESERVED ICB330               */ 02220000
*       3 CVTEXT2A PTR(24),         /* SAME AS CVTEXT2 ABOVE ICB330  */ 02221000
*      2 CVTHJES PTR(31),           /* SAME AS CVTHJESA BELOW ICB454 */ 02222000
*       3 CVTRSV42 PTR(8),          /* RESERVED ICB454               */ 02223000
*       3 CVTHJESA PTR(24),         /* ADDRESS OF OPTIONAL JOB ENTRY    02224000
*                                      SUBSYSTEM (JES) COMMUNICATION    02225000
*                                      VECTOR TABLE ICB454           */ 02226000
*      2 CVTRSV43 FIXED(15),        /* RESERVED                      */ 02227000
*      2 CVTRSV44 FIXED(15),        /* RESERVED                      */ 02228000
*      2 CVTRSV45 PTR(31),          /* RESERVED                      */ 02229000
*      2 CVTRSV46 PTR(31),          /* RESERVED                      */ 02230000
*/*            OS/VS1 OVERLAY                                        */ 02231000
*                                                               03S0051 02232000
*      2 CVTPGSIA PTR(31),          /* ADDRESS OF PAGING SUPERVISOR     02233000
*                                      INFORMATION AREA              */ 02234000
*      2 CVTPCVT PTR(31),           /* ADDRESS OF PAGED CVT EXTENSION*/ 02235000
*      2 CVTA1F1 CHAR(1),           /* PAGE FAULT FLAGS              */ 02236000
*       3 CVTPFSW BIT(1),           /* ONLY THE PAGING TASK MAY BE      02237000
*                                      DISPATCHED                    */ 02238000
*       3 CVTSRSW BIT(1),           /* NO TASK EXCEPT THE PAGING TASK   02239000
*                                      MAY EXECUTE DISABLED CODE     */ 02240000
*       3 CVTRSV47 BIT(1),          /* RESERVED                      */ 02241000
*       3 CVTRSV48 BIT(1),          /* RESERVED                      */ 02242000
*       3 CVTRSV49 BIT(1),          /* RESERVED                      */ 02243000
*       3 CVTRSV50 BIT(1),          /* RESERVED                      */ 02244000
*       3 CVTRSV51 BIT(1),          /* RESERVED                      */ 02245000
*       3 CVTRSV52 BIT(1),          /* RESERVED                      */ 02246000
*      2 CVTSYSK CHAR(1),           /* SYSTEM LOCK. IF NOT ZERO, ONLY   02247000
*                                      THE PAGING TASK MAY BE   03S0051 02248000
*                                      DISPATCHED                    */ 02249000
*       3 CVTRSV53 BIT(1),          /* RESERVED                      */ 02250000
*       3 CVTRSV54 BIT(1),          /* RESERVED                      */ 02251000
*       3 CVTRSV55 BIT(1),          /* RESERVED                      */ 02252000
*       3 CVTRSV56 BIT(1),          /* RESERVED                      */ 02253000
*       3 CVTSLKR BIT(1),           /* MACHINE CHECK HANDLING IS IN     02254000
*                                      PROGRESS ICB320               */ 02255000
*       3 CVTSLKQ BIT(1),           /* SYSTEM QUEUE AREA (SQA) HAS      02256000
*                                      BEEN EXHAUSTED                */ 02257000
*       3 CVTSLKP BIT(1),           /* LAST PAGING CONTROL BLOCK        02258000
*                                      (PCB) HAS BEEN USED           */ 02259000
*       3 CVTSLKO BIT(1),           /* A ROUTINE RUNNING DISABLED HAS   02260000
*                                      PRODUCED A PAGE FAULT         */ 02261000
*      2 CVTSULK FIXED(15),         /* SUPERVISOR LOCK. NUMBER OF       02262000
*                                      TASKS ATTEMPTING TO EXECUTE      02263000
*                                      DISABLED ROUTINES. IF NOT        02264000
*                                      ZERO, ONLY ENABLED TASKS MAY     02265000
*                                      RUN.                          */ 02266000
*      2 CVTSMF PTR(31),            /* ADDRESS OF SYSTEM MANAGEMENT     02267000
*                                      FACILITIES (SMF) TCB ICB395   */ 02268000
*      2 CVTPNWFR PTR(31),          /* ADDRESS OF ROUTINE WHICH FREES   02269000
*                                      THE 'EMERGENCY' WORK AREA        02270000
*                                      (ICB413)                XM2452*/ 02271000
*      2 CVTDDCE PTR(31),           /* ADDRESS OF DYNAMIC DISPATCHING   02272000
*                                      CONTROL ELEMENT ICB466        */ 02273000
*      2 CVTRSV57 FIXED(15),        /* RESERVED                      */ 02274000
*      2 CVTRSV58 FIXED(15),        /* RESERVED                      */ 02275000
*      2 CVTSTOA FIXED(31),         /* SAVE AREA FOR THE REAL STORAGE   02276000
*                                      ADDRESS OF THE SEGMENT TABLE     02277000
*                                      ORIGIN ICB496                 */ 02278000
*      2 CVTVOLM1 PTR(31),          /* RESERVED POINTER MDC191       */ 02279000
*       3 CVTVOLF1 BIT(8),          /* RESERVED INITIALIZATION BYTE     02280000
*                                      MDC199                        */ 02281000
*        4 CVTVOLI1 BIT(1),         /* RESERVED INITIALIZATION FLAG     02282000
*                                      MDC200                        */ 02283000
*       3 CVTVOLT1 PTR(24),         /* RESERVED PARAMETER MDC201     */ 02284000
*      2 CVTRSV61 PTR(31),          /* RESERVED                      */ 02285000
*      2 CVTATMCT PTR(31),          /* POINTER TO VTAM CONTROL TABLE    02286000
*                                      MDC082                        */ 02287000
*       3 CVTATMST CHAR(1),         /* VTAM START STATUS MDC135      */ 02288000
*       3 CVTATMCA PTR(24),         /* POINTER TO VTAM CONTROL TABLE    02289000
*                                      MDC138                        */ 02290000
*      2 CVTAUTH PTR(31),           /* POINTER TO AUTHORIZED LIBRARY    02291000
*                                      TABLE MDC188                  */ 02292000
*      2 CVTRV484 PTR(31),          /* RESERVED MDC106               */ 02293000
*      2 CVTRV485 PTR(31),          /* RESERVED MDC106               */ 02294000
*      2 CVTRV486 PTR(31),          /* RESERVED MDC106               */ 02295000
*      2 CVTRV487 PTR(31),          /* RESERVED MDC106               */ 02296000
*      2 CVTRV488 PTR(31);          /* RESERVED MDC106               */ 02297000
*/*            OS/VS2 OVERLAY                                        */ 02298000
*                                                               03S0052 02299000
*   DECLARE                                                     03S0052 02300000
*     1 CVTS01 DEF(CVTPGSIA) BDY(WORD),                         03S0052 02301000
*      2 CVTGETL PTR(31),           /* ADDRESS OF IKJGETL, TSO GET      02302000
*                                      LINE ROUTINE (MDC206)   YM2225*/ 02303000
*      2 CVTLPDSR PTR(31),          /* ADDRESS OF LINK PACK AREA        02304000
*                                      (LPA) DIRECTORY SEARCH ROUTINE*/ 02305000
*      2 CVTPVTP PTR(31),           /* ADDRESS OF PAGE VECTOR TABLE  */ 02306000
*      2 CVTLPDIA PTR(31),          /* ADDRESS OF LINK PACK AREA        02307000
*                                      (LPA) DIRECTORY (ON PAGE 03S0052 02308000
*                                      BOUNDARY)                     */ 02309000
*       3 CVTDIRST CHAR(1),         /* FLAG BYTE                     */ 02310000
*        4 CVTDICOM BIT(1),         /* LPA DIRECTORY HAS BEEN   03S0052 02311000
*                                      INITIALIZED BY NIP            */ 02312000
*        4 CVTRSV63 BIT(1),         /* RESERVED                      */ 02313000
*        4 CVTRSV64 BIT(1),         /* RESERVED                      */ 02314000
*        4 CVTRSV65 BIT(1),         /* RESERVED                      */ 02315000
*        4 CVTRSV66 BIT(1),         /* RESERVED                      */ 02316000
*        4 CVTRSV67 BIT(1),         /* RESERVED                      */ 02317000
*        4 CVTRSV68 BIT(1),         /* RESERVED                      */ 02318000
*        4 CVTRSV69 BIT(1),         /* RESERVED                      */ 02319000
*       3 CVTLPDIR PTR(24),         /* ADDRESS OF LPA DIRECTORY. ON     02320000
*                                      PAGE BOUNDARY                 */ 02321000
*      2 CVTRV320 PTR(31),          /* ** CVTPAGE1 FIELD UNUSED IN      02322000
*                                      OS/VS2 REL 2 ** MDC112        */ 02323000
*      2 CVTRV321 PTR(31),          /* ** CVTPGSUP FIELD UNUSED IN      02324000
*                                      OS/VS2 REL 2 ** MDC113        */ 02325000
*      2 CVTSLIDA CHAR(4) BDY(WORD),/* IDENTITY OF TCB CAUSING  03S0052 02326000
*                                      SUPERVISOR LOCK BYTE (CVTSYLK)   02327000
*                                      TO BE SET OR IDENTITY OF TCB     02328000
*                                      THAT SECOND EXIT PROCESSING IS   02329000
*                                      FOR WHEN CVTSEIC=1            */ 02330000
*       3 CVTSYLK CHAR(1),          /* SUPERVISOR LOCK. ONLY ENABLED    02331000
*                                      TASKS MAY BE DISPATCHED       */ 02332000
*       3 CVTSLID CHAR(3),          /* SAME AS CVTSLIDA ABOVE        */ 02333000
*      2 CVTRV322 PTR(31),          /* ** CVTSER AND SUBFIELDS UNUSED   02334000
*                                      IN OS/VS2 REL 2 **       03S0052 02335000
*                                      MDC114-MDC117                 */ 02336000
*      2 CVTRV328 PTR(31),          /* ** CVTSEG AND CVTSEGA FIELDS     02337000
*                                      UNUSED IN OS/VS2 REL 2 **        02338000
*                                      MDC139-MDC140                 */ 02339000
*      2 CVTRV329 PTR(31),          /* ** CVTSEGB FIELD UNUSED IN       02340000
*                                      OS/VS2 REL 2 ** MDC141        */ 02341000
*      2 CVTRV330 PTR(31),          /* ** CVTSEGC AND SUBFIELDS 03S0052 02342000
*                                      UNUSED IN OS/VS2 REL 2 **        02343000
*                                      MDC142-MDC144                 */ 02344000
*      2 CVTRV331 PTR(31),          /* ** CVTSEGD AND SUBFIELDS 03S0052 02345000
*                                      UNUSED IN OS/VS2 REL 2 **        02346000
*                                      MDC145-MDC147                 */ 02347000
*      2 CVTRSV77 PTR(8),           /* RESERVED                      */ 02348000
*      2 CVTSPVLK PTR(8),           /* NUMBER OF TASKS WHICH HAVE       02349000
*                                      TERMINATED WHILE OWNING  03S0052 02350000
*                                      SUPERVISOR LOCK WITHOUT  03S0052 02351000
*                                      OPERATOR HAVING YET BEEN 03S0052 02352000
*                                      NOTIFIED                      */ 02353000
*      2 CVTCTLFG CHAR(1),          /* SYSTEM CONTROL FLAGS          */ 02354000
*       3 CVTRV323 BIT(1),          /* ** CVTPSIC BIT UNUSED IN 03S0052 02355000
*                                      OS/VS2 REL 2 ** MDC118        */ 02356000
*       3 CVTRV333 BIT(1),          /* ** CVTAPGB BIT UNUSED IN 03S0052 02357000
*                                      OS/VS2 REL 2 ** MDC151        */ 02358000
*       3 CVTRSV78 BIT(1),          /* RESERVED ICB382               */ 02359000
*       3 CVTDSTAT BIT(1),          /* DEVSTAT OPTION IN EFFECT.        02360000
*                                      DEVICE ADDRESS FOR 2319, 3330,   02361000
*                                      2314, 3330-1, 3340 CAN VARY      02362000
*                                      ACROSS SYSTEMS MDC189         */ 02363000
*       3 CVTRSV79 BIT(1),          /* RESERVED                      */ 02364000
*       3 CVTNOMP BIT(1),           /* MULTIPROCESSING CODE IS NOT IN   02365000
*                                      THE SYSTEM MDC176             */ 02366000
*       3 CVTGTRCE BIT(1),          /* GENERALIZED TRACE FACILITY       02367000
*                                      (GTF) HAS SUPPRESSED     03S0052 02368000
*                                      SUPERVISOR TRACE ICB446       */ 02369000
*       3 CVTSDTRC BIT(1),          /* SVC DUMP HAS SUPPRESSED  03S0052 02370000
*                                      SUPERVISOR TRACE ICB446       */ 02371000
*      2 CVTAPG CHAR(1),            /* DISPATCHING PRIORITY OF  03S0052 02372000
*                                      AUTOMATIC PRIORITY GROUP (APG)   02373000
*                                      ICB339                        */ 02374000
*      2 CVTTRACE CHAR(2) BDY(WORD),/* BRANCH ON REGISTER       03S0052 02375000
*                                      INSTRUCTION. SET BY NIP. 03S0052 02376000
*                                      REGISTER TEN FOR TRACE.  03S0052 02377000
*                                      REGISTER ELEVEN FOR NO TRACE. */ 02378000
*      2 CVTTRAC2 CHAR(2) BDY(WORD,3),/* BRANCH ON REGISTER 11  03S0052 02379000
*                                      INSTRUCTION. THIS ALLOWS FOR     02380000
*                                      SUPPRESSING TRACE DYNAMICALLY    02381000
*                                      BY SETTING CONDITION CODE MASK   02382000
*                                      TO ZERO IN FIRST INSTRUCTION     02383000
*                                      (CVTTRACE)                    */ 02384000
*      2 CVTRSCN PTR(31),           /* ADDRESS OF ROUTINE TO SCAN TCB   02385000
*                                      TREE                          */ 02386000
*      2 CVTTAS PTR(31),            /* ADDRESS OF ROUTINE TO TRANSFER   02387000
*                                      ADDRESS SPACE                 */ 02388000
*      2 CVTRV332 PTR(31),          /* ** CVTPVALD FIELD UNUSED IN      02389000
*                                      OS/VS2 REL 2 ** MDC148        */ 02390000
*      2 CVTSHRVM PTR(31),          /* LOWEST ADDRESS OF SHARED 03S0052 02391000
*                                      VIRTUAL STORAGE AREA. THIS       02392000
*                                      ADDRESS WILL BE EITHER THE       02393000
*                                      BEGINNING OF LINK PACK AREA      02394000
*                                      (LPA) DIRECTORY OR THE   03S0052 02395000
*                                      BEGINNING OF LPA UPDATE AREA     02396000
*                                      IF 'MLPA' OPTION WAS USED AT     02397000
*                                      SUPERVISOR INITIALIZATION.    */ 02398000
*      2 CVT0VL01 PTR(31),          /* ENTRY POINT ADDRESS OF   03S0052 02399000
*                                      VALIDITY CHECK ROUTINE   03S0052 02400000
*                                      (IEA0VL01) USED TO COMPARE       02401000
*                                      PROTECT KEY OF AN ADDRESS WITH   02402000
*                                      TCB PROTECT KEY.              */ 02403000
*      2 CVTRV324 PTR(31),          /* ** CVTPFIXQ FIELD UNUSED IN      02404000
*                                      OS/VS2 REL 2 ** MDC119        */ 02405000
*      2 CVTRV325 PTR(31),          /* ** CVTPFIXR FIELD UNUSED IN      02406000
*                                      OS/VS2 REL 2 ** MDC120        */ 02407000
*      2 CVTRV326 PTR(31),          /* ** CVTPFIXP FIELD UNUSED IN      02408000
*                                      OS/VS2 REL 2 ** MDC121        */ 02409000
*      2 CVTRV327 PTR(31),          /* ** CVTPTCD FIELD UNUSED IN       02410000
*                                      OS/VS2 REL 2 ** MDC122        */ 02411000
*      2 CVTSYSWT PTR(31),          /* ADDRESS OF THE SYSTEM    03S0052 02412000
*                                      MANAGEMENT FACILITIES (SMF)      02413000
*                                      SYSTEM WAIT TIME COLLECTION      02414000
*                                      AREA ICB469                   */ 02415000
*      2 CVTPUTL PTR(31),           /* ADDRESS OF IKJPUTL, TSO PUT      02416000
*                                      LINE ROUTINE (MDC207)   YM2225*/ 02417000
*      2 CVTSRBRT PTR(31),          /* DISPATCHER RETURN ADDRESS FOR    02418000
*                                      SRB ROUTINES MDC130           */ 02419000
*      2 CVTOLT0A PTR(31),          /* BRANCH ENTRY TO OLTEP MEMORY     02420000
*                                      TERMINATION RESOURCE MANAGER     02421000
*                                      MDC129                        */ 02422000
*      2 CVTSMFEX PTR(31),          /* BRANCH ENTRY TO SYSTEM   03S0052 02423000
*                                      MANAGEMENT FACILITIES (SMF)      02424000
*                                      EXCP COUNTING ROUTINE FOR VAM    02425000
*                                      WINDOW INTERCEPT MDC133       */ 02426000
*      2 CVTCSPIE PTR(31),          /* FOR CHECKPOINT/RESTART, BRANCH   02427000
*                                      ENTRY TO SPIE MDC149          */ 02428000
*      2 CVTPTGT PTR(31),           /* ADDRESS OF IKJPTGT, TSO PUTGET   02429000
*                                      ROUTINE (MDC208)        YM2225*/ 02430000
*      2 CVTIOSPL PTR(8),           /* PRIORITY LEVEL OF I/O    03S0052 02431000
*                                      SUPERVISOR CHANNEL SCHEDULER     02432000
*                                      MDC019                        */ 02433000
*      2 CVTRV513 CHAR(1),          /* RESERVED MDC165               */ 02434000
*      2 CVTDSSAC CHAR(1),          /* DYNAMIC SUPPORT SYSTEM (DSS)     02435000
*                                      ACTIVATED FLAG - USED BY 03S0052 02436000
*                                      RESTART FLIH. IF X'00', DSS      02437000
*                                      NOT INITIALIZED. IF X'FF', DSS   02438000
*                                      HAS BEEN INITIALIZED. MDC163  */ 02439000
*      2 CVTRV139 PTR(8),           /* RESERVED                      */ 02440000
*      2 CVTSTCK PTR(31),           /* ADDRESS OF IKJSTCK, TSO STACK    02441000
*                                      ROUTINE (MDC209)        YM2225*/ 02442000
*      2 CVTMAXMP PTR(15),          /* FOR MEASUREMENT FACILITY 03S0052 02443000
*                                      (MF/1), MAXIMUM PHYSICAL CPU     02444000
*                                      ADDRESS SUPPORTED BY THIS        02445000
*                                      RELEASE MDC165                */ 02446000
*      2 CVTRV144 FIXED(15),        /* RESERVED                      */ 02447000
*      2 CVTSCAN PTR(31),           /* ADDRESS OF IKJSCAN, TSO SCAN     02448000
*                                      ROUTINE (MDC210)        YM2225*/ 02449000
*      2 CVTAUTHL PTR(31),          /* POINTER TO AUTHORIZED LIBRARY    02450000
*                                      TABLE MDC001                  */ 02451000
*      2 CVTBLDCP PTR(31),          /* BRANCH ENTRY TO BUILD POOL       02452000
*                                      MDC003                        */ 02453000
*      2 CVTGETCL PTR(31),          /* BRANCH ENTRY TO GET CELL 03S0052 02454000
*                                      MDC004                        */ 02455000
*      2 CVTFRECL PTR(31),          /* BRANCH ENTRY TO FREE CELL        02456000
*                                      MDC005                        */ 02457000
*      2 CVTDELCP PTR(31),          /* BRANCH ENTRY TO DELETE POOL      02458000
*                                      MDC006                        */ 02459000
*      2 CVTCRMN PTR(31),           /* BRANCH ENTRY TO SVC 120  03S0052 02460000
*                                      (GETMAIN/FREEMAIN:CRBRANCH)      02461000
*                                      MDC007                        */ 02462000
*      2 CVTCRAS PTR(31),           /* BRANCH ENTRY TO 'CREATE  03S0052 02463000
*                                      ADDRESS SPACE' MDC008         */ 02464000
*      2 CVTQSAS PTR(31),           /* BRANCH ENTRY TO TASK     03S0052 02465000
*                                      TERMINATION MDC009            */ 02466000
*      2 CVTFRAS PTR(31),           /* BRANCH ENTRY TO FREE ADDRESS     02467000
*                                      SPACE MDC010                  */ 02468000
*      2 CVTS1EE PTR(31),           /* BRANCH ENTRY TO STAGE 1 EXIT     02469000
*                                      EFFECTOR MDC011               */ 02470000
*      2 CVTPARS PTR(31),           /* ADDRESS OF IKJPARS, TSO PARSE    02471000
*                                      ROUTINE (MDC211)        YM2225*/ 02472000
*      2 CVTQUIS PTR(31),           /* BRANCH ENTRY TO QUIESCE MDC013*/ 02473000
*      2 CVTSTXU PTR(31),           /* BRANCH ENTRY TO ATTENTION EXIT   02474000
*                                      EPILOGUE MDC014               */ 02475000
*      2 CVTOPTE PTR(31),           /* BRANCH ENTRY ADDRESS TO  03S0052 02476000
*                                      SYSEVENT MDC015               */ 02477000
*      2 CVTSDRM PTR(31),           /* BRNACH ENTRY ADDRESS OF THE      02478000
*                                      RESOURCE MANAGER ROUTINE FOR     02479000
*                                      SVC DUMP. THIS ROUTINE CAN BE    02480000
*                                      INVOKED BY MEMORY TERMINATION    02481000
*                                      MDC077                        */ 02482000
*      2 CVTIOSCS PTR(31),          /* ENTRY POINT OF I/O SUPERVISOR    02483000
*                                      CHANNEL SCHEDULER MDC018      */ 02484000
*      2 CVTAQTOP PTR(31),          /* POINTER TO AREA CONTAINING       02485000
*                                      QUIESCE DESCRIPTOR BLOCK 03S0052 02486000
*                                      (QDB'S) FOR DEVICE ALLOCATION    02487000
*                                      MDC021                        */ 02488000
*      2 CVTVVMDI PTR(31),          /* CONSTANT USED BY PAGED LINK      02489000
*                                      PACK AREA (LPA) DIRECTORY        02490000
*                                      SEARCH ALGORITHM MDC022       */ 02491000
*      2 CVTASVT PTR(31),           /* POINTER TO ADDRESS SPACE 03S0052 02492000
*                                      VECTOR TABLE (ASVT) MDC070    */ 02493000
*      2 CVTGDA PTR(31),            /* POINTER TO GLOBAL DATA AREA      02494000
*                                      (GDA) IN SQA MDC024           */ 02495000
*      2 CVTASCBH PTR(31),          /* POINTER TO HIGHEST PRIORITY      02496000
*                                      ADDRESS SPACE CONTROL BLOCK      02497000
*                                      (ASCB) ON THE ASCB DISPATCHING   02498000
*                                      QUEUE (HEAD OF ASCB QUEUE)       02499000
*                                      MDC027                        */ 02500000
*      2 CVTASCBL PTR(31),          /* POINTER TO LOWEST PRIORITY       02501000
*                                      ASCB ON ASCB DISPATCHING QUEUE   02502000
*                                      MDC028                        */ 02503000
*      2 CVTRTMCT PTR(31),          /* POINTER TO               03S0052 02504000
*                                      RECOVERY/TERMINATION CONTROL     02505000
*                                      TABLE MDC031                  */ 02506000
*      2 CVTSV60 PTR(31),           /* ADDRESS OF SVC 60 BRANCH ENTRY   02507000
*                                      POINT USED BY TYPE 2, 3, 4,      02508000
*                                      SVC'S MDC032                  */ 02509000
*      2 CVTSDMP PTR(31),           /* ADDRESS OF SVC DUMP BRANCH       02510000
*                                      ENTRY POINT MDC033            */ 02511000
*      2 CVTSCBP PTR(31),           /* ADDRESS OF SCB PURGE RESOURCE    02512000
*                                      MANAGER MDC034                */ 02513000
*      2 CVTSDBF PTR(31),           /* ADDRESS OF 4K SQA BUFFER USED    02514000
*                                      BY SVC DUMP. HIGH ORDER BIT OF   02515000
*                                      THIS CVT WORD IS USED AS LOCK    02516000
*                                      TO INDICATE BUFFER IS IN USE     02517000
*                                      MDC035                        */ 02518000
*      2 CVTRTMS PTR(31),           /* RTM1 INTERNAL SERVICABILITY      02519000
*                                      LEVEL INDICATOR MDC036        */ 02520000
*      2 CVTTPIOS PTR(31),          /* ADDRESS OF THE TELEPROCESSING    02521000
*                                      I/O SUPERV1SOR ROUTINE (TPIOS)   02522000
*                                      MDC078                        */ 02523000
*      2 CVTSIC PTR(31),            /* BRANCH ENTRY ADDRESS OF THE      02524000
*                                      ROUTINE TO SCHEDULE SYSTEM       02525000
*                                      INITIALIZED CANCEL MDC042     */ 02526000
*      2 CVTOPCTP PTR(31),          /* ADDRESS OF SYSTEM RESOURCES      02527000
*                                      MANAGER (SRM) CONTROL TABLE      02528000
*                                      MDC043                        */ 02529000
*      2 CVTEXPRO PTR(31),          /* ADDRESS OF EXIT PROLOGUE/TYPE    02530000
*                                      1 EXIT MDC044                 */ 02531000
*      2 CVTGSMQ PTR(31),           /* ADDRESS OF GLOBAL SERVICE        02532000
*                                      MANAGER QUEUE MDC045          */ 02533000
*      2 CVTLSMQ PTR(31),           /* ADDRESS OF LOCAL SERVICE 03S0052 02534000
*                                      MANAGER QUEUE MDC046          */ 02535000
*      2 CVTGSPL PTR(31),           /* ADDRESS OF GLOBAL SYSTEM 03S0052 02536000
*                                      PRIORITY LIST QUEUE MDC047    */ 02537000
*      2 CVTVWAIT PTR(31),          /* ADDRESS OF WAIT ROUTINE MDC048*/ 02538000
*      2 CVTPARRL PTR(31),          /* ADDRESS OF PARTIALLY LOADED      02539000
*                                      DELETE QUEUE MDC049           */ 02540000
*      2 CVTAPFT PTR(31),           /* ADDRESS OF AUTHORIZED PROGRAM    02541000
*                                      FACILITY (APF) TABLE.    03S0052 02542000
*                                      INITIALIZED BY NIP. MDC050    */ 02543000
*      2 CVTQCS01 PTR(31),          /* BRANCH ENTRY ADDRESS TO  03S0052 02544000
*                                      PROGRAM MANAGER USED BY ATTACH   02545000
*                                      MDC051                        */ 02546000
*      2 CVTFQCB PTR(31),           /* POINTER TO FIRST MAJOR QCB FOR   02547000
*                                      ENQ MDC052                    */ 02548000
*      2 CVTLQCB PTR(31),           /* POINTER TO LAST MAJOR QCB FOR    02549000
*                                      ENQ MDC053                    */ 02550000
*      2 CVTRENQ PTR(31),           /* RESOURCE MANAGER ADDRESS FOR     02551000
*                                      ENQ MDC054                    */ 02552000
*      2 CVTRSPIE PTR(31),          /* RESOURCE MANAGER FOR SPIE        02553000
*                                      MDC055                        */ 02554000
*      2 CVTLKRMA PTR(31),          /* RESOURCE MANAGER ADDRESS FOR     02555000
*                                      LOCK MANAGER MDC056           */ 02556000
*      2 CVTCSD PTR(31),            /* VIRTUAL ADDRESS OF COMMON        02557000
*                                      SYSTEM DATA AREA (CSD).  03S0052 02558000
*                                      INITIALIZED BY NIP. MDC057    */ 02559000
*      2 CVTDQIQE PTR(31),          /* RESOURCE MANAGER FOR EXIT        02560000
*                                      EFFECTORS MDC058              */ 02561000
*      2 CVTRPOST PTR(31),          /* RESOURCE MANAGER FOR POST        02562000
*                                      MDC059                        */ 02563000
*      2 CVT062R1 PTR(31),          /* BRANCH ENTRY TO DETACH MDC060 */ 02564000
*      2 CVTVEAC0 PTR(31),          /* ASCBCHAP BRANCH ENTRY MDC061  */ 02565000
*      2 CVTGLMN PTR(31),           /* GLOBAL BRANCH ENTRY ADDRESS      02566000
*                                      FOR GETMAIN/FREEMAIN MDC062   */ 02567000
*      2 CVTSPSA PTR(31),           /* POINTER TO GLOBAL WORK/SAVE      02568000
*                                      AREA VECTOR TABLE (WSAG) 03S0052 02569000
*                                      MDC071                        */ 02570000
*      2 CVTWSAL PTR(31),           /* ADDRESS OF TABLE OF LENGTHS OF   02571000
*                                      LOCAL WORK/SAVE AREAS MDC072  */ 02572000
*      2 CVTWSAG PTR(31),           /* ADDRESS OF TABLE OF LENGTHS OF   02573000
*                                      GLOBAL WORK/SAVE AREAS MDC073 */ 02574000
*      2 CVTWSAC PTR(31),           /* ADDRESS OF TABLE OF LENGTHS OF   02575000
*                                      CPU WORK/SAVE AREAS MDC074    */ 02576000
*      2 CVTRECRQ PTR(31),          /* ADDRESS OF THE RECORDING 03S0052 02577000
*                                      REQUEST FACILITY (PART OF RTM1   02578000
*                                      - CALLED BY RTM2 AND RMS)        02579000
*                                      MDC075                        */ 02580000
*      2 CVTASMVT PTR(31),          /* POINTER TO AUXILIARY STORAGE     02581000
*                                      MANAGEMENT VECTOR TABLE (AMVT)   02582000
*                                      MDC076                        */ 02583000
*      2 CVTIOBP PTR(31),           /* ADDRESS OF THE BLOCK PROCESSOR   02584000
*                                      CVT MDC079                    */ 02585000
*      2 CVTSPOST PTR(31),          /* POST RESOURCE MANAGER    03S0052 02586000
*                                      TERMINATION ROUTINE (RMTR)       02587000
*                                      ENTRY POINT MDC085            */ 02588000
*      2 CVTRSTWD FIXED(31),        /* RESTART RESOURCE MANAGEMENT      02589000
*                                      WORD - CONTAINS IDENTIFIER OF    02590000
*                                      USER IF RESTART IS IN USE.       02591000
*                                      OTHERWISE, ZERO. MDC161       */ 02592000
*      2 CVTFETCH PTR(31),          /* ADDRESS OF ENTRY POINT FOR       02593000
*                                      BASIC FETCH MDC196            */ 02594000
*      2 CVT044R2 PTR(31),          /* ADDRESS OF IGC044R2 IN CHAP      02595000
*                                      SERVICE ROUTINE MDC197        */ 02596000
*      2 CVTPERFM PTR(31),          /* ADDRESS OF THE PERFORMANCE       02597000
*                                      WORK AREA. SET BY IGX00018.      02598000
*                                      MDC205                        */ 02599000
*      2 CVTDAIR PTR(31),           /* ADDRESS OF IKJDAIR, TSO  03S0052 02600000
*                                      DYNAMIC ALLOCATION INTERFACE     02601000
*                                      ROUTINE (MDC212)        YM2225*/ 02602000
*      2 CVTEHDEF PTR(31),          /* ADDRESS OF IKJEHDEF, TSO 03S0052 02603000
*                                      DEFAULT SERVICE ROUTINE  03S0052 02604000
*                                      (MDC213)                YM2225*/ 02605000
*      2 CVTEHCIR PTR(31),          /* ADDRESS OF IKJEHCIR, TSO 03S0052 02606000
*                                      CATALOG INFORMATION ROUTINE      02607000
*                                      (MDC214)                YM2225*/ 02608000
*      2 CVTSSAP PTR(31),           /* ADDRESS OF SYSTEM SAVE AREA      02609000
*                                      MDC063                        */ 02610000
*      2 CVTAIDVT PTR(31),          /* POINTER TO APPENDAGE ID VECTOR   02611000
*                                      TABLE MDC064                  */ 02612000
*      2 CVTIPCDS PTR(31),          /* BRANCH ENTRY FOR DIRECT SIGNAL   02613000
*                                      SERVICE ROUTINE MDC065        */ 02614000
*      2 CVTIPCRI PTR(31),          /* BRANCH ENTRY FOR REMOTE  03S0052 02615000
*                                      IMMEDIATE SIGNAL SERVICE 03S0052 02616000
*                                      ROUTINE MDC066                */ 02617000
*      2 CVTIPCRP PTR(31),          /* BRANCH ENTRY FOR REMOTE  03S0052 02618000
*                                      PENDABLE SIGNAL SERVICE  03S0052 02619000
*                                      ROUTINE MDC067                */ 02620000
*      2 CVTPCCAT PTR(31),          /* POINTER TO PHYSICAL CCA VECTOR   02621000
*                                      TABLE MDC068                  */ 02622000
*      2 CVTLCCAT PTR(31),          /* POINTER TO LOGICAL CCA VECTOR    02623000
*                                      TABLE MDC069                  */ 02624000
*      2 CVTRV210 BIT(8),           /* RESERVED                      */ 02625000
*       3 CVTRV211 BIT(1),          /* RESERVED                      */ 02626000
*       3 CVTRV212 BIT(1),          /* RESERVED                      */ 02627000
*       3 CVTRV213 BIT(1),          /* RESERVED                      */ 02628000
*       3 CVTRV214 BIT(1),          /* RESERVED                      */ 02629000
*       3 CVTRV215 BIT(1),          /* RESERVED                      */ 02630000
*       3 CVTRV216 BIT(1),          /* RESERVED                      */ 02631000
*       3 CVTRV217 BIT(1),          /* RESERVED                      */ 02632000
*       3 CVTRV218 BIT(1),          /* RESERVED                      */ 02633000
*      2 CVTRV219 BIT(8),           /* RESERVED                      */ 02634000
*       3 CVTRV220 BIT(1),          /* RESERVED                      */ 02635000
*       3 CVTRV221 BIT(1),          /* RESERVED                      */ 02636000
*       3 CVTRV222 BIT(1),          /* RESERVED                      */ 02637000
*       3 CVTRV223 BIT(1),          /* RESERVED                      */ 02638000
*       3 CVTRV224 BIT(1),          /* RESERVED                      */ 02639000
*       3 CVTRV225 BIT(1),          /* RESERVED                      */ 02640000
*       3 CVTRV226 BIT(1),          /* RESERVED                      */ 02641000
*       3 CVTRV227 BIT(1),          /* RESERVED                      */ 02642000
*      2 CVTRV228 BIT(8),           /* RESERVED                      */ 02643000
*       3 CVTRV229 BIT(1),          /* RESERVED                      */ 02644000
*       3 CVTRV230 BIT(1),          /* RESERVED                      */ 02645000
*       3 CVTRV231 BIT(1),          /* RESERVED                      */ 02646000
*       3 CVTRV232 BIT(1),          /* RESERVED                      */ 02647000
*       3 CVTRV233 BIT(1),          /* RESERVED                      */ 02648000
*       3 CVTRV234 BIT(1),          /* RESERVED                      */ 02649000
*       3 CVTRV235 BIT(1),          /* RESERVED                      */ 02650000
*       3 CVTRV236 BIT(1),          /* RESERVED                      */ 02651000
*      2 CVTRV237 BIT(8),           /* RESERVED                      */ 02652000
*       3 CVTRV238 BIT(1),          /* RESERVED                      */ 02653000
*       3 CVTRV239 BIT(1),          /* RESERVED                      */ 02654000
*       3 CVTRV240 BIT(1),          /* RESERVED                      */ 02655000
*       3 CVTRV241 BIT(1),          /* RESERVED                      */ 02656000
*       3 CVTRV242 BIT(1),          /* RESERVED                      */ 02657000
*       3 CVTRV243 BIT(1),          /* RESERVED                      */ 02658000
*       3 CVTRV244 BIT(1),          /* RESERVED                      */ 02659000
*       3 CVTRV245 BIT(1),          /* RESERVED                      */ 02660000
*      2 CVTRV246 PTR(8),           /* RESERVED                      */ 02661000
*      2 CVTRV247 PTR(8),           /* RESERVED                      */ 02662000
*      2 CVTRV248 PTR(8),           /* RESERVED                      */ 02663000
*      2 CVTRV249 PTR(8),           /* RESERVED                      */ 02664000
*      2 CVTRV250 PTR(8),           /* RESERVED                      */ 02665000
*      2 CVTRV251 PTR(8),           /* RESERVED                      */ 02666000
*      2 CVTRV252 PTR(15),          /* RESERVED                      */ 02667000
*      2 CVTRV253 FIXED(15),        /* RESERVED                      */ 02668000
*      2 CVTRV254 FIXED(15),        /* RESERVED                      */ 02669000
*      2 CVTPWI PTR(31),            /* ADDRESS OF THE WINDOW    03S0052 02670000
*                                      INTERCEPT ROUTINE MDC104      */ 02671000
*      2 CVTPVBP PTR(31),           /* ADDRESS OF THE VIRTUAL BLOCK     02672000
*                                      PROCESSOR MDC105              */ 02673000
*      2 CVTMFCTL PTR(31),          /* POINTER TO MEASUREMENT   03S0052 02674000
*                                      FACILITY CONTROL BLOCK MDC100 */ 02675000
*      2 CVTMFRTR PTR(31),          /* IF MEASUREMENT FACILITY IS       02676000
*                                      ACTIVE, CONTAINS ADDRESS OF      02677000
*                                      MEASUREMENT FACILITY ROUTER.     02678000
*                                      OTHERWISE, ADDRESS OF CVTBRET.   02679000
*                                      MDC101                        */ 02680000
*       3 CVTMFACT BIT(1),          /* IF ONE, I/O SUPERVISOR AND       02681000
*                                      TIMER SECOND LEVEL INTERRUPT     02682000
*                                      HANDLER HOOKS BRANCH TO  03S0052 02683000
*                                      MEASUREMENT FACILITY ROUTER      02684000
*                                      MDC102                        */ 02685000
*      2 CVTVPSIB PTR(31),          /* BRANCH ENTRY TO PAGE SERVICES    02686000
*                                      MDC108                        */ 02687000
*      2 CVTVSI PTR(31),            /* BRANCH ENTRY TO VAM SERVICES     02688000
*                                      MDC109                        */ 02689000
*      2 CVTVFP PTR(31),            /* BRANCH ENTRY TO FINDPAGE 03S0052 02690000
*                                      MDC110                        */ 02691000
*      2 CVTRV262 BIT(8),           /* RESERVED                      */ 02692000
*       3 CVTRV263 BIT(1),          /* RESERVED                      */ 02693000
*       3 CVTRV264 BIT(1),          /* RESERVED                      */ 02694000
*       3 CVTRV265 BIT(1),          /* RESERVED                      */ 02695000
*       3 CVTRV266 BIT(1),          /* RESERVED                      */ 02696000
*       3 CVTRV267 BIT(1),          /* RESERVED                      */ 02697000
*       3 CVTRV268 BIT(1),          /* RESERVED                      */ 02698000
*       3 CVTRV269 BIT(1),          /* RESERVED                      */ 02699000
*       3 CVTRV270 BIT(1),          /* RESERVED                      */ 02700000
*      2 CVTRV271 BIT(8),           /* RESERVED                      */ 02701000
*       3 CVTRV272 BIT(1),          /* RESERVED                      */ 02702000
*       3 CVTRV273 BIT(1),          /* RESERVED                      */ 02703000
*       3 CVTRV274 BIT(1),          /* RESERVED                      */ 02704000
*       3 CVTRV275 BIT(1),          /* RESERVED                      */ 02705000
*       3 CVTRV276 BIT(1),          /* RESERVED                      */ 02706000
*       3 CVTRV277 BIT(1),          /* RESERVED                      */ 02707000
*       3 CVTRV278 BIT(1),          /* RESERVED                      */ 02708000
*       3 CVTRV279 BIT(1),          /* RESERVED                      */ 02709000
*      2 CVTRV280 BIT(8),           /* RESERVED                      */ 02710000
*       3 CVTRV281 BIT(1),          /* RESERVED                      */ 02711000
*       3 CVTRV282 BIT(1),          /* RESERVED                      */ 02712000
*       3 CVTRV283 BIT(1),          /* RESERVED                      */ 02713000
*       3 CVTRV284 BIT(1),          /* RESERVED                      */ 02714000
*       3 CVTRV285 BIT(1),          /* RESERVED                      */ 02715000
*       3 CVTRV286 BIT(1),          /* RESERVED                      */ 02716000
*       3 CVTRV287 BIT(1),          /* RESERVED                      */ 02717000
*       3 CVTRV288 BIT(1),          /* RESERVED                      */ 02718000
*      2 CVTRV289 BIT(8),           /* RESERVED                      */ 02719000
*       3 CVTRV290 BIT(1),          /* RESERVED                      */ 02720000
*       3 CVTRV291 BIT(1),          /* RESERVED                      */ 02721000
*       3 CVTRV292 BIT(1),          /* RESERVED                      */ 02722000
*       3 CVTRV293 BIT(1),          /* RESERVED                      */ 02723000
*       3 CVTRV294 BIT(1),          /* RESERVED                      */ 02724000
*       3 CVTRV295 BIT(1),          /* RESERVED                      */ 02725000
*       3 CVTRV296 BIT(1),          /* RESERVED                      */ 02726000
*       3 CVTRV297 BIT(1),          /* RESERVED                      */ 02727000
*      2 CVTRV298 PTR(8),           /* RESERVED                      */ 02728000
*      2 CVTRV299 PTR(8),           /* RESERVED                      */ 02729000
*      2 CVTRV300 PTR(8),           /* RESERVED                      */ 02730000
*      2 CVTRV301 PTR(8),           /* RESERVED                      */ 02731000
*      2 CVTRV302 PTR(15),          /* RESERVED                      */ 02732000
*      2 CVTRV303 PTR(15),          /* RESERVED                      */ 02733000
*      2 CVTRV304 FIXED(15),        /* RESERVED                      */ 02734000
*      2 CVTRV305 FIXED(15),        /* RESERVED                      */ 02735000
*      2 CVTRV306 FIXED(15),        /* RESERVED                      */ 02736000
*      2 CVTRV307 FIXED(15),        /* RESERVED                      */ 02737000
*      2 CVTVIOP PTR(31),           /* ENTRY POINT OF PAGE I/O POST     02738000
*                                      MDC111                        */ 02739000
*      2 CVTRMBR PTR(31),           /* ADDRESS OF REGMAIN BRANCH        02740000
*                                      ENTRY MDC123                  */ 02741000
*      2 CVTLFRM PTR(31),           /* LIST FORMAT FREEMAIN BRANCH      02742000
*                                      ENTRY POINT MDC124            */ 02743000
*      2 CVTGMBR PTR(31),           /* LIST FORMAT GETMAIN BRANCH       02744000
*                                      ENTRY POINT MDC125            */ 02745000
*      2 CVT0TC0A PTR(31),          /* ADDRESS OF TASK CLOSE MODULE     02746000
*                                      IFG0TC0A MDC128               */ 02747000
*      2 CVTRLSTG FIXED(31),        /* SIZE OF ACTUAL REAL STORAGE      02748000
*                                      ONLINE AT IPL TIME IN 'K'.       02749000
*                                      VALUE PLACED HERE BY IEAVNIP0.   02750000
*                                      MDC153                        */ 02751000
*      2 CVTSPFRR PTR(31),          /* 'SUPER FRR' ADDRESS (ADDRESS     02752000
*                                      OF FUNCTIONAL RECOVERY ROUTINE   02753000
*                                      ESTABLISHED AT NIP0 TIME TO      02754000
*                                      PROTECT SUPERVISOR CONTROL       02755000
*                                      PROGRAM) MDC154               */ 02756000
*      2 CVTVEMS0 PTR(31),          /* ADDRESS OF MEMORY SWITCH 03S0052 02757000
*                                      ROUTINE MDC155                */ 02758000
*      2 CVTJRECM PTR(31),          /* ADDRESS OF SUBSYSTEM INTERFACE   02759000
*                                      RESOURCE MANAGER MDC157       */ 02760000
*      2 CVTIRECM PTR(31),          /* ADDRESS OF INITIATOR RESOURCE    02761000
*                                      MANAGER MDC158                */ 02762000
*      2 CVTDARCM PTR(31),          /* ADDRESS OF DEVICE ALLOCATION     02763000
*                                      RESOURCE MANAGER MDC159       */ 02764000
*      2 CVT0PT02 PTR(31),          /* ADDRESS OF POST ENTRY POINT      02765000
*                                      IEA0PT02 MDC160               */ 02766000
*      2 CVTSTPRS PTR(31),          /* ENTRY POINT OF STOP AND  03S0052 02767000
*                                      RESTART SUBROUTINE MDC162     */ 02768000
*      2 CVTWTCB PTR(31),           /* ADDRESS OF WAIT STATE TCB        02769000
*                                      MDC164                        */ 02770000
*      2 CVTVACR PTR(31),           /* ACR/VARY CPU CHANNEL RECOVERY    02771000
*                                      ROUTINE ADDRESS. ADDRESS 03S0052 02772000
*                                      FILLED IN BY VARY CPU    03S0052 02773000
*                                      PROCESSOR. MDC178             */ 02774000
*      2 CVTQUIT PTR(31),           /* VARY CPU SHUTDOWN ROUTINE        02775000
*                                      ADDRESS. ADDRESS FILLED IN BY    02776000
*                                      VARY CPU PROCESSOR. MDC179    */ 02777000
*      2 CVTGTFR8 PTR(31),          /* GENERALIZED TRACE FACILITY       02778000
*                                      (GTF) CONTROL REGISTER 8 03S0052 02779000
*                                      INITIALIZATION ROUTINE ADDRESS   02780000
*                                      MDC180                        */ 02781000
*      2 CVTVSTOP PTR(31),          /* ADDRESS OF VARY CPU STOP CPU     02782000
*                                      ROUTINE MDC169                */ 02783000
*      2 CVTVPSA PTR(31),           /* ADDRESS OF COPY OF SYSGEN'ED     02784000
*                                      PSA - PLACED HERE BY NIP 03S0052 02785000
*                                      MDC170                        */ 02786000
*      2 CVTRMPTT PTR(31),          /* ADDRESS OF ISTRAMA1, THE 03S0052 02787000
*                                      RESOURCE MANAGER FOR NORMAL      02788000
*                                      AND ABNORMAL TASK TERMINATION    02789000
*                                      MDC171                        */ 02790000
*      2 CVTRMPMT PTR(31),          /* ADDRESS OF ISTRAMA2, THE 03S0052 02791000
*                                      RESOURCE MANAGER FOR NORMAL      02792000
*                                      AND ABNORMAL MEMORY      03S0052 02793000
*                                      TERMINATION MDC172            */ 02794000
*      2 CVTEXP1 PTR(31),           /* ADDRESS OF EXIT PROLOGUE WHICH   02795000
*                                      RETURNS TO THE DISPATCHER        02796000
*                                      MDC173                        */ 02797000
*      2 CVTCSDRL PTR(31),          /* REAL ADDRESS OF COMMON SYSTEM    02798000
*                                      DATA AREA (CSD). INITIALIZED     02799000
*                                      BY NIP. MDC174                */ 02800000
*      2 CVTSSRB PTR(31),           /* STATUS STOP SRB ENTRY MDC175  */ 02801000
*      2 CVTRPT PTR(31),            /* ADDRESS OF IGARPT01 MODULE OF    02802000
*                                      RADIX PARTITION TREE SERVICES.   02803000
*                                      INITIALIZED BY NIP. MDC177    */ 02804000
*      2 CVTQV1 PTR(31),            /* ADDRESS OF QUEUE VERIFICATION    02805000
*                                      FOR SINGLE THREADED QUEUES       02806000
*                                      WITH HEADERS ONLY MDC181      */ 02807000
*      2 CVTQV2 PTR(31),            /* ADDRESS OF QUEUE VERIFICATION    02808000
*                                      FOR SINGLE THREADED QUEUES       02809000
*                                      WITH HEADER AND TRAILER MDC182*/ 02810000
*      2 CVTQV3 PTR(31),            /* ADDRESS OF QUEUE VERIFICATION    02811000
*                                      FOR DOUBLE THREADED QUEUES       02812000
*                                      MDC183                        */ 02813000
*      2 CVTGSDA PTR(31),           /* ADDRESS OF GLOBAL SYSTEM 03S0052 02814000
*                                      DUPLEX AREA. ADDRESS FILLED IN   02815000
*                                      BY NIP0. MDC184               */ 02816000
*       3 CVTGSDAB BIT(1),          /* IF HIGH-ORDER BIT IS ONE,        02817000
*                                      THERE IS A VALID VALUE IN        02818000
*                                      FOLLOWING 31 BITS MDC185      */ 02819000
*      2 CVTADV PTR(31),            /* ADDRESS OF ADDRESS       03S0052 02820000
*                                      VERIFICATION ROUTINE MDC186   */ 02821000
*      2 CVTTPIO PTR(31);           /* ADDRESS OF VTAM TPIO (SVC 124)   02822000
*                                      ROUTINE MDC193                */ 02823000
*/*                                                                  */ 02824000
*/*            OS - OS/VS COMMON EXTENSION                           */ 02825000
*/*                                                                  */ 02826000
*                                                               03S0053 02827000
*   DECLARE                                                     03S0053 02828000
*     1 CVTXTNT1 BASED(CVTEXT1),    /* START OF OS - OS/VS COMMON       02829000
*                                      EXTENSION ICB421              */ 02830000
*      2 CVTFACHN PTR(31),          /* ADDRESS OF CHAIN OF DCB FIELD    02831000
*                                      AREAS (ISAM) ICB421           */ 02832000
*      2 CVTRSV87 PTR(31),          /* RESERVED                      */ 02833000
*      2 CVTRSV88 PTR(31);          /* RESERVED                      */ 02834000
*/*                                                                  */ 02835000
*/*            OS/VS1 - OS/VS2 COMMON EXTENSION                      */ 02836000
*/*                                                                  */ 02837000
*                                                               03S0054 02838000
*   DECLARE                                                     03S0054 02839000
*     1 CVTXTNT2 BASED(CVTEXT2),    /* START OF OS/VS1 - OS/VS2 03S0054 02840000
*                                      EXTENSION                     */ 02841000
*      2 CVTDSSV PTR(31),           /* ADDRESS OF THE DYNAMIC SUPPORT   02842000
*                                      SYSTEM (DSS) VECTOR TABLE        02843000
*                                      ICB313                        */ 02844000
*       3 CVTRSV89 PTR(8),          /* RESERVED ICB313               */ 02845000
*       3 CVTDSSVA PTR(24),         /* ADDRESS OF THE DSS VECTOR        02846000
*                                      TABLE ICB313                  */ 02847000
*      2 CVTNUCLS CHAR(1),          /* IDENTIFICATION OF THE NUCLEUS    02848000
*                                      MEMBER NAME ICB322            */ 02849000
*      2 CVTRSV90 BIT(8),           /* RESERVED                      */ 02850000
*       3 CVTRSV9A BIT(1),          /* RESERVED                      */ 02851000
*       3 CVTRSV9B BIT(1),          /* RESERVED                      */ 02852000
*       3 CVTRSV9C BIT(1),          /* RESERVED                      */ 02853000
*       3 CVTRSV9D BIT(1),          /* RESERVED                      */ 02854000
*       3 CVTRSV9E BIT(1),          /* RESERVED                      */ 02855000
*       3 CVTRSV9F BIT(1),          /* RESERVED                      */ 02856000
*       3 CVTRSV9G BIT(1),          /* RESERVED                      */ 02857000
*       3 CVTRSV9H BIT(1),          /* RESERVED                      */ 02858000
*      2 CVTRSV91 FIXED(15),        /* RESERVED                      */ 02859000
*      2 CVTDEBVR PTR(31),          /* ADDRESS OF BRANCH ENTRY POINT    02860000
*                                      OF DEB VALIDITY CHECK ROUTINE    02861000
*                                      (ICB380)                XM9028*/ 02862000
*      2 CVTRSV92 PTR(31),          /* RESERVED (MDC190)       YM2278*/ 02863000
*      2 CVTRSV93 PTR(31),          /* RESERVED                      */ 02864000
*      2 CVTRSV94 PTR(31),          /* RESERVED                      */ 02865000
*      2 CVTQID PTR(31),            /* SAVE AS CVTQIDA BELOW ICB381  */ 02866000
*       3 CVTRSV95 PTR(8),          /* RESERVED ICB381               */ 02867000
*       3 CVTQIDA PTR(24),          /* ADDRESS OF QUEUE         03S0054 02868000
*                                      IDENTIFICATION (QID) TABLE       02869000
*                                      PREFIX ICB381                 */ 02870000
*      2 CVTOLTEP PTR(31),          /* POINTER TO CONTROL BLOCK 03S0054 02871000
*                                      CREATED BY SVC 59 TO POINT TO    02872000
*                                      PSEUDO-DEB'S ICB423           */ 02873000
*      2 CVTRSV96 FIXED(15),        /* RESERVED                      */ 02874000
*      2 CVTRSV97 FIXED(15),        /* RESERVED                      */ 02875000
*      2 CVTRSV98 PTR(31),          /* RESERVED                      */ 02876000
*      2 CVTRSV99 PTR(31),          /* RESERVED                      */ 02877000
*      2 CVTRSVA0 PTR(31),          /* RESERVED                      */ 02878000
*      2 CVTRSVA1 PTR(31),          /* RESERVED                      */ 02879000
*      2 CVTRV400 BIT(8),           /* RESERVED                      */ 02880000
*       3 CVTRV401 BIT(1),          /* RESERVED                      */ 02881000
*       3 CVTRV402 BIT(1),          /* RESERVED                      */ 02882000
*       3 CVTRV403 BIT(1),          /* RESERVED                      */ 02883000
*       3 CVTRV404 BIT(1),          /* RESERVED                      */ 02884000
*       3 CVTRV405 BIT(1),          /* RESERVED                      */ 02885000
*       3 CVTRV406 BIT(1),          /* RESERVED                      */ 02886000
*       3 CVTRV407 BIT(1),          /* RESERVED                      */ 02887000
*       3 CVTRV408 BIT(1),          /* RESERVED                      */ 02888000
*      2 CVTRV409 BIT(8),           /* RESERVED                      */ 02889000
*       3 CVTRV410 BIT(1),          /* RESERVED                      */ 02890000
*       3 CVTRV411 BIT(1),          /* RESERVED                      */ 02891000
*       3 CVTRV412 BIT(1),          /* RESERVED                      */ 02892000
*       3 CVTRV413 BIT(1),          /* RESERVED                      */ 02893000
*       3 CVTRV414 BIT(1),          /* RESERVED                      */ 02894000
*       3 CVTRV415 BIT(1),          /* RESERVED                      */ 02895000
*       3 CVTRV416 BIT(1),          /* RESERVED                      */ 02896000
*       3 CVTRV417 BIT(1),          /* RESERVED                      */ 02897000
*      2 CVTRV418 PTR(8),           /* RESERVED                      */ 02898000
*      2 CVTRV419 PTR(8),           /* RESERVED                      */ 02899000
*      2 CVTRV420 PTR(15),          /* RESERVED                      */ 02900000
*      2 CVTRV421 FIXED(15),        /* RESERVED                      */ 02901000
*      2 CVTRV422 FIXED(15),        /* RESERVED                      */ 02902000
*      2 CVTRV423 FIXED(15),        /* RESERVED                      */ 02903000
*      2 CVTATCVT PTR(31),          /* POINTER TO VTAM'S CVT MDC080  */ 02904000
*       3 CVTATACT BIT(1),          /* IF ON, VTAM IS ACTIVE MDC081  */ 02905000
*      2 CVTRV425 PTR(31),          /* RESERVED                      */ 02906000
*      2 CVTRV426 PTR(31),          /* RESERVED                      */ 02907000
*      2 CVTRV427 PTR(31),          /* RESERVED                      */ 02908000
*      2 CVTRV428 FIXED(31),        /* RESERVED                      */ 02909000
*      2 CVTRV429 BIT(8),           /* RESERVED                      */ 02910000
*       3 CVTRV430 BIT(1),          /* RESERVED                      */ 02911000
*       3 CVTRV431 BIT(1),          /* RESERVED                      */ 02912000
*       3 CVTRV432 BIT(1),          /* RESERVED                      */ 02913000
*       3 CVTRV433 BIT(1),          /* RESERVED                      */ 02914000
*       3 CVTRV434 BIT(1),          /* RESERVED                      */ 02915000
*       3 CVTRV435 BIT(1),          /* RESERVED                      */ 02916000
*       3 CVTRV436 BIT(1),          /* RESERVED                      */ 02917000
*       3 CVTRV437 BIT(1),          /* RESERVED                      */ 02918000
*      2 CVTRV438 BIT(8),           /* RESERVED                      */ 02919000
*       3 CVTRV439 BIT(1),          /* RESERVED                      */ 02920000
*       3 CVTRV440 BIT(1),          /* RESERVED                      */ 02921000
*       3 CVTRV441 BIT(1),          /* RESERVED                      */ 02922000
*       3 CVTRV442 BIT(1),          /* RESERVED                      */ 02923000
*       3 CVTRV443 BIT(1),          /* RESERVED                      */ 02924000
*       3 CVTRV444 BIT(1),          /* RESERVED                      */ 02925000
*       3 CVTRV445 BIT(1),          /* RESERVED                      */ 02926000
*       3 CVTRV446 BIT(1),          /* RESERVED                      */ 02927000
*      2 CVTRV447 PTR(8),           /* RESERVED                      */ 02928000
*      2 CVTRV448 PTR(8),           /* RESERVED                      */ 02929000
*      2 CVTRV449 PTR(15),          /* RESERVED                      */ 02930000
*      2 CVTRV450 FIXED(15),        /* RESERVED                      */ 02931000
*      2 CVTRV451 FIXED(15),        /* RESERVED                      */ 02932000
*      2 CVTRV452 FIXED(15),        /* RESERVED                      */ 02933000
*      2 CVTRV453 PTR(31),          /* RESERVED                      */ 02934000
*      2 CVTRV454 PTR(31),          /* RESERVED                      */ 02935000
*      2 CVTRV455 PTR(31),          /* RESERVED                      */ 02936000
*      2 CVTRV456 PTR(31),          /* RESERVED                      */ 02937000
*      2 CVTRV457 BIT(8),           /* RESERVED                      */ 02938000
*       3 CVTRV458 BIT(1),          /* RESERVED                      */ 02939000
*       3 CVTRV459 BIT(1),          /* RESERVED                      */ 02940000
*       3 CVTRV460 BIT(1),          /* RESERVED                      */ 02941000
*       3 CVTRV461 BIT(1),          /* RESERVED                      */ 02942000
*       3 CVTRV462 BIT(1),          /* RESERVED                      */ 02943000
*       3 CVTRV463 BIT(1),          /* RESERVED                      */ 02944000
*       3 CVTRV464 BIT(1),          /* RESERVED                      */ 02945000
*       3 CVTRV465 BIT(1),          /* RESERVED                      */ 02946000
*      2 CVTRV466 BIT(8),           /* RESERVED                      */ 02947000
*       3 CVTRV467 BIT(1),          /* RESERVED                      */ 02948000
*       3 CVTRV468 BIT(1),          /* RESERVED                      */ 02949000
*       3 CVTRV469 BIT(1),          /* RESERVED                      */ 02950000
*       3 CVTRV470 BIT(1),          /* RESERVED                      */ 02951000
*       3 CVTRV471 BIT(1),          /* RESERVED                      */ 02952000
*       3 CVTRV472 BIT(1),          /* RESERVED                      */ 02953000
*       3 CVTRV473 BIT(1),          /* RESERVED                      */ 02954000
*       3 CVTRV474 BIT(1),          /* RESERVED                      */ 02955000
*      2 CVTRV475 PTR(8),           /* RESERVED                      */ 02956000
*      2 CVTRV476 PTR(8),           /* RESERVED                      */ 02957000
*      2 CVTRV477 PTR(8),           /* RESERVED                      */ 02958000
*      2 CVTRV478 PTR(8),           /* RESERVED                      */ 02959000
*      2 CVTRV479 FIXED(15),        /* RESERVED                      */ 02960000
*      2 CVTRV480 PTR(31),          /* RESERVED                      */ 02961000
*      2 CVTRV481 PTR(31),          /* RESERVED                      */ 02962000
*      2 CVTRV482 PTR(31);          /* RESERVED                      */ 02963000
*/*                       CVT PREFIX                                 */ 02964000
*                                                               03S0055 02965000
*   DCL                                                         03S0055 02966000
*     1 CVTFIX BASED(CVTPTR-256) BDY(WORD),                     03S0055 02967000
*      2 * CHAR(248) BDY(WORD),     /* RESERVED                      */ 02968000
*      2 * CHAR(2) BDY(WORD),       /* RESERVED                      */ 02969000
*      2 CVTMDL CHAR(2) BDY(WORD,3),/* CPU MODEL NUMBER IN SIGNLESS     02970000
*                                      PACKED DECIMAL, I.E., A MODEL    02971000
*                                      145 WOULD BE REPRESENTED AS      02972000
*                                      0145 HEX                      */ 02973000
*      2 CVTRELNO CHAR(4) BDY(WORD),/* RELEASE NUMBER (EBCDIC)       */ 02974000
*       3 CVTNUMB CHAR(2) BDY(WORD),/* RELEASE NUMBER                */ 02975000
*       3 CVTLEVL CHAR(2) BDY(WORD,3);/* LEVEL NUMBER OF THIS RELEASE*/ 02976000
*/*                    END OF CVT MACRO                              */ 02977000
*                                                               03S0056 02978000
*                                                               03S0056 02979000
*/* **************************************************************** */ 02980000
*/*                                                                  */ 02981000
*/*            PREFIXED SAVE AREA                                    */ 02982000
*/*                                                                  */ 02983000
*/*  OS/VS2 RELEASE 2, 11/15/73, LEVEL=24                            */ 02984000
*/*                                                                  */ 02985000
*/*  METHOD OF ACCESS                                                */ 02986000
*/*      BAL  - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.      */ 02987000
*/*             USING ON PSA GIVES ADDRESSABILITY FOR ALL SYMBOLS.   */ 02988000
*/*      PL/S - PSA WILL BE BASED(0) FOR PL/S I OR LOCATION(0) FOR   */ 02989000
*/*             PL/S II UNLESS %PSABASE IS SET TO SOME OTHER VALUE   */ 02990000
*/*             BEFORE INCLUDE FOR MACRO.                            */ 02991000
*/*                                                                  */ 02992000
*/*  NOTE                                                            */ 02993000
*/*      THE LABELS BEGINNING WITH PSA OR FLC ARE THE PROPER LABELS  */ 02994000
*/*      TO USE.  THE OTHER LABELS ARE GIVEN AS ALIAS NAMES FOR      */ 02995000
*/*      COMPATIBILITY WITH LABELS USED FOR SYSTEM 360 LOW CORE.     */ 02996000
*/*                                                                  */ 02997000
*/* **************************************************************** */ 02998000
*                                                               03S0056 02999000
*   DECLARE                                                     03S0056 03000000
*     1 PSA LOCATION(0) BDY(DWORD),                             03S0056 03001000
*      2 FLCRNPSW CHAR(8) BDY(DWORD),/* RESTART NEW PSW (AFTER IPL)  */ 03002000
*       3 FLCIPPSW CHAR(8) BDY(DWORD),/* IPL PSW                     */ 03003000
*      2 FLCROPSW CHAR(8) BDY(DWORD),/* RESTART OLD PSW (AFTER IPL)  */ 03004000
*       3 FLCICCW1 CHAR(8) BDY(DWORD),/* IPL CCW1                    */ 03005000
*      2 FLCICCW2 CHAR(8) BDY(DWORD),/* IPL CCW2                     */ 03006000
*       3 FLCCVT PTR(31),           /* ADDRESS OF CVT (AFTER IPL)    */ 03007000
*       3 * CHAR(4),                /* RESERVED (AFTER IPL)          */ 03008000
*      2 FLCEOPSW CHAR(8) BDY(DWORD),/* EXTERNAL OLD PSW             */ 03009000
*      2 FLCSOPSW CHAR(8) BDY(DWORD),/* SVC OLD PSW                  */ 03010000
*      2 FLCPOPSW CHAR(8) BDY(DWORD),/* PROGRAM CHECK OLD PSW        */ 03011000
*      2 FLCMOPSW CHAR(8) BDY(DWORD),/* MACHINE CHECK OLD PSW        */ 03012000
*      2 FLCIOPSW CHAR(8) BDY(DWORD),/* INPUT/OUTPUT OLD PSW         */ 03013000
*      2 FLCCSW CHAR(8) BDY(DWORD), /* CHANNEL STATUS WORD           */ 03014000
*      2 FLCCAW CHAR(4) BDY(WORD),  /* CHANNEL ADDRESS WORD          */ 03015000
*      2 FLCCVT2 PTR(31),           /* ADDRESS OF CVT - USED BY DUMP    03016000
*                                      ROUTINES ICB319               */ 03017000
*      2 FLCTIMER CHAR(4),          /* TIMER                         */ 03018000
*      2 FLCTRACE PTR(31),          /* ADDRESS OF TRACE TABLE HEADER */ 03019000
*      2 FLCENPSW CHAR(8) BDY(DWORD),/* EXTERNAL NEW PSW             */ 03020000
*      2 FLCSNPSW CHAR(8) BDY(DWORD),/* SVC NEW PSW                  */ 03021000
*      2 FLCPNPSW CHAR(8) BDY(DWORD),/* PROGRAM CHECK NEW PSW        */ 03022000
*      2 FLCMNPSW CHAR(8) BDY(DWORD),/* MACHINE CHECK NEW PSW        */ 03023000
*      2 FLCINPSW CHAR(8) BDY(DWORD),/* INPUT/OUTPUT NEW PSW         */ 03024000
*      2 * CHAR(4),                 /* RESERVED                      */ 03025000
*      2 PSAEEPSW CHAR(4) BDY(WORD),/* EXTENDED PSW DATA STORED ON      03026000
*                                      EXTERNAL INTERRUPT MDC084     */ 03027000
*       3 PSASPAD FIXED(15),        /* ISSUING PROCESSOR'S PHYSICAL     03028000
*                                      ADDRESS ON EMS OR EXTERNAL       03029000
*                                      CALL INTERRUPT MDC046         */ 03030000
*       3 FLCEICOD FIXED(15),       /* EXTERNAL INTERRUPTION CODE    */ 03031000
*      2 PSAESPSW CHAR(4) BDY(WORD),/* EXTENDED PSW DATA STORED ON      03032000
*                                      SVC INTERRUPT MDC085          */ 03033000
*       3 * CHAR(1),                /* RESERVED - SET TO ZERO        */ 03034000
*       3 FLCSVILC PTR(8),          /* SVC INSTRUCTION LENGTH COUNTER   03035000
*                                      - NUMBER OF BYTES MDC079      */ 03036000
*        4 * BIT(5),                /* ALWAYS ZERO                   */ 03037000
*        4 FLCSILCB BIT(3),         /* SIGNIFICANT BITS IN ILC FIELD    03038000
*                                      - LAST BIT IS ALWAYS ZERO        03039000
*                                      MDC080                        */ 03040000
*       3 FLCSVCN FIXED(15),        /* SVC INTERRUPTION CODE - SVC      03041000
*                                      NUMBER MDC081                 */ 03042000
*      2 PSAEPPSW CHAR(8) BDY(WORD),/* EXTENDED PSW FOR PROGRAM 03S0056 03043000
*                                      INTERRUPT MDC086              */ 03044000
*       3 * CHAR(1),                /* RESERVED - SET TO ZERO        */ 03045000
*       3 FLCPIILC PTR(8),          /* PROGRAM INSTRUCTION LENGTH       03046000
*                                      COUNTER - NUMBER OF BYTES IN     03047000
*                                      INSTRUCTION CAUSING PROGRAM      03048000
*                                      INTERRUPTION MDC082           */ 03049000
*        4 * BIT(5),                /* ALWAYS ZERO                   */ 03050000
*        4 FLCPILCB BIT(3),         /* SIGNIFICANT BITS IN ILC FIELD    03051000
*                                      - LAST BIT IS ALWAYS ZERO        03052000
*                                      MDC083                        */ 03053000
*       3 FLCPICOD FIXED(15),       /* PROGRAM INTERRUPTION CODE     */ 03054000
*        4 PSARV049 CHAR(1),        /* RESERVED FOR IMPRECISE   03S0056 03055000
*                                      INTERRUPTS MDC087             */ 03056000
*        4 PSAPICOD PTR(8),         /* 8-BIT INTERRUPT CODE MDC088   */ 03057000
*         5 PSAPIPER BIT(1),        /* PER INTERRUPT OCCURRED MDC089 */ 03058000
*         5 PSAPIMC BIT(1),         /* MONITOR CALL INTERRUPT   03S0056 03059000
*                                      OCCURRED MDC090               */ 03060000
*         5 PSAPIPC BIT(6),         /* AN UNSOLICITED PROGRAM CHECK     03061000
*                                      HAS OCCURRED IF ANY OF THESE 6   03062000
*                                      BITS ARE ON MDC091            */ 03063000
*       3 FLCTEA PTR(31),           /* TRANSLATION EXCEPTION ADDRESS */ 03064000
*        4 * CHAR(1),               /* RESERVED - SET TO ZERO        */ 03065000
*        4 FLCTEAA PTR(24),         /* TRANSLATION EXCEPTION ADDRESS */ 03066000
*      2 * CHAR(1),                 /* RESERVED - SET TO ZERO        */ 03067000
*      2 FLCMCNUM PTR(8),           /* MONITOR CLASS NUMBER          */ 03068000
*      2 FLCPERCD CHAR(1),          /* PROGRAM EVENT RECORDING CODE  */ 03069000
*      2 * CHAR(1),                 /* RESERVED - SET TO ZERO        */ 03070000
*      2 FLCPER PTR(31),            /* PER ADDRESS                   */ 03071000
*       3 * CHAR(1),                /* RESERVED - SET TO ZERO        */ 03072000
*       3 FLCPERA PTR(24),          /* PER ADDRESS                   */ 03073000
*      2 * CHAR(1),                 /* RESERVED - SET TO ZERO        */ 03074000
*      2 FLCMTRCD CHAR(3),          /* MONITOR CODE                  */ 03075000
*      2 * CHAR(8),                 /* RESERVED                      */ 03076000
*      2 FLCMCLA CHAR(344) BDY(DWORD),/* MACHINE CHECK LOGOUT AREA   */ 03077000
*       3 FLCCHNID CHAR(4),         /* CHANNEL ID                    */ 03078000
*       3 FLCIOEL PTR(31),          /* SAME AS FLCIOELA BELOW        */ 03079000
*        4 * CHAR(1),               /* RESERVED                      */ 03080000
*        4 FLCIOELA PTR(24),        /* I/O EXTENDED LOGOUT (IOEL)       03081000
*                                      POINTER                       */ 03082000
*       3 FLCLCL CHAR(4),           /* LIMITED CHANNEL LOGOUT (ECSW) */ 03083000
*       3 * CHAR(2),                /* RESERVED                      */ 03084000
*       3 * CHAR(1),                /* RESERVED MDC051               */ 03085000
*       3 * CHAR(1),                /* RESERVED MDC052               */ 03086000
*       3 FLCIOA PTR(31),           /* I/O ADDRESS                   */ 03087000
*        4 * CHAR(1),               /* RESERVED                      */ 03088000
*        4 FLCIOAA PTR(24),         /* I/O ADDRESS                   */ 03089000
*       3 * CHAR(44),               /* RESERVED                      */ 03090000
*       3 FLCMCIC CHAR(8),          /* MACHINE-CHECK INTERRUPTION       03091000
*                                      CODE                          */ 03092000
*       3 * CHAR(8),                /* RESERVED                      */ 03093000
*       3 FLCFSA PTR(31),           /* FAILING STORAGE ADDRESS       */ 03094000
*        4 * CHAR(1),               /* ZEROES                        */ 03095000
*        4 FLCFSAA PTR(24),         /* FAILING STORAGE ADDRESS       */ 03096000
*       3 FLCRGNCD CHAR(4),         /* REGION CODE                   */ 03097000
*       3 FLCFLA CHAR(96) BDY(WORD),/* FIXED LOGOUT AREA             */ 03098000
*       3 FLCFPSAV CHAR(32) BDY(DWORD),/* FLOATING POINT REGISTER       03099000
*                                      SAVE AREA                     */ 03100000
*       3 FLCGRSAV(16) FIXED(31),   /* GENERAL REGISTER SAVE AREA    */ 03101000
*       3 FLCCRSAV(16) FIXED(31),   /* CONTROL REGISTER SAVE AREA    */ 03102000
*      2 FLCHDEND CHAR(0) BDY(DWORD),/* END OF HARDWARE ASSIGNMENTS  */ 03103000
*      2 PSAPSA CHAR(4) BDY(WORD),  /* CONTROL BLOCK ACRONYM IN 03S0056 03104000
*                                      EBCDIC                        */ 03105000
*      2 PSACPUPA PTR(15),          /* PHYSICAL CPU ADDRESS (CHANGED    03106000
*                                      DURING ACR) (MDC130)    YM3489*/ 03107000
*      2 PSACPULA PTR(15),          /* LOGICAL CPU ADDRESS           */ 03108000
*      2 PSAPCCAV PTR(31),          /* VIRTUAL ADDRESS OF PCCA       */ 03109000
*      2 PSAPCCAR PTR(31),          /* REAL ADDRESS OF PCCA          */ 03110000
*      2 PSALCCAV PTR(31),          /* VIRTUAL ADDRESS OF LCCA       */ 03111000
*      2 PSALCCAR PTR(31),          /* REAL ADDRESS OF LCCA          */ 03112000
*      2 PSATNEW PTR(31),           /* TCB NEW POINTER               */ 03113000
*      2 PSATOLD PTR(31),           /* TCB OLD POINTER               */ 03114000
*      2 PSAANEW PTR(31),           /* ASCB NEW POINTER              */ 03115000
*      2 PSAAOLD PTR(31),           /* ASCB OLD POINTER              */ 03116000
*      2 PSASUPER CHAR(4) BDY(WORD),/* SUPERVISOR CONTROL WORD       */ 03117000
*       3 PSASUP1 BIT(8),           /* FIRST BYTE OF PSASUPER        */ 03118000
*        4 PSAIO BIT(1),            /* I/O FLIH                      */ 03119000
*        4 PSASVC BIT(1),           /* SVC FLIH                      */ 03120000
*        4 PSAEXT BIT(1),           /* EXTERNAL FLIH                 */ 03121000
*        4 PSAPI BIT(1),            /* PROGRAM CHECK FLIH            */ 03122000
*        4 PSALOCK BIT(1),          /* LOCK ROUTINE                  */ 03123000
*        4 PSADISP BIT(1),          /* DISPATCHER                    */ 03124000
*        4 PSAIPCDR BIT(1),         /* SIGP - DIRECT                 */ 03125000
*        4 PSAIPCRP BIT(1),         /* SIGP - REMOTE PENDING         */ 03126000
*       3 PSASUP2 BIT(8),           /* SECOND BYTE OF PSASUPER       */ 03127000
*        4 PSAIPCRI BIT(1),         /* SIGP - REMOTE IMMEDIATE       */ 03128000
*        4 PSAGTF BIT(1),           /* GTF GIVEN CONTROL FROM FLIH   */ 03129000
*        4 PSAIPCEC BIT(1),         /* EXTERNAL CALL SLIH IS ACTIVE     03130000
*                                      MDC047                        */ 03131000
*        4 PSAIPCES BIT(1),         /* EMERGENCY SIGNAL SLIH IS 03S0056 03132000
*                                      ACTIVE MDC048                 */ 03133000
*        4 PSAIPCE2 BIT(1),         /* EMERGENCY SIGNAL (EMS) SLIH      03134000
*                                      RECURSIVE ENTRY FLAG MDC110   */ 03135000
*        4 PSAACR BIT(1),           /* AUTOMATIC CPU RECONFIGURATION    03136000
*                                      (ACR) IN CONTROL MDC119       */ 03137000
*        4 PSARTM BIT(1),           /* RECOVERY TERMINATION MONITOR     03138000
*                                      (RTM) IN CONTROL MDC120       */ 03139000
*        4 PSALCR BIT(1),           /* LOW CORE REFRESH ROUTINE IS      03140000
*                                      ACTIVE MDC126                 */ 03141000
*       3 PSASUP3 BIT(8),           /* THIRD BYTE OF PSASUPER        */ 03142000
*        4 PSAIOSUP BIT(1),         /* IF ON, A MAINLINE IOS    03S0056 03143000
*                                      COMPONENT SUCH AS CHANNEL        03144000
*                                      SCHEDULER HAS ENTERED A  03S0056 03145000
*                                      PHYSICALLY DISABLED STATE        03146000
*                                      WITHOUT REGARD TO LOCKING        03147000
*                                      REQUIREMENTS MDC127           */ 03148000
*        4 PSARV008 BIT(1),         /* RESERVED                      */ 03149000
*        4 PSARV009 BIT(1),         /* RESERVED                      */ 03150000
*        4 PSARV010 BIT(1),         /* RESERVED                      */ 03151000
*        4 PSARV011 BIT(1),         /* RESERVED                      */ 03152000
*        4 PSARV012 BIT(1),         /* RESERVED                      */ 03153000
*        4 PSARV013 BIT(1),         /* RESERVED                      */ 03154000
*        4 PSARV014 BIT(1),         /* RESERVED                      */ 03155000
*       3 PSASUP4 BIT(8),           /* FOURTH BYTE OF PSASUPER       */ 03156000
*        4 PSARV015 BIT(1),         /* RESERVED                      */ 03157000
*        4 PSARV016 BIT(1),         /* RESERVED                      */ 03158000
*        4 PSARV017 BIT(1),         /* RESERVED                      */ 03159000
*        4 PSARV018 BIT(1),         /* RESERVED                      */ 03160000
*        4 PSARV019 BIT(1),         /* RESERVED                      */ 03161000
*        4 PSARV020 BIT(1),         /* RESERVED                      */ 03162000
*        4 PSARV021 BIT(1),         /* RESERVED                      */ 03163000
*        4 PSARV022 BIT(1),         /* RESERVED                      */ 03164000
*      2 PSAGPREG(3) FIXED(31),     /* REGISTER SAVE AREA FOR I/O       03165000
*                                      FLIH, SVC FLIH, EXTERNAL FLIH    03166000
*                                      AND SYSTEM TRACE              */ 03167000
*      2 PSARSREG FIXED(31),        /* RESTART FLIH REGISTER SAVE    */ 03168000
*      2 PSAPIREG FIXED(31),        /* PROGRAM CHECK FLIH REGISTER      03169000
*                                      SAVE                          */ 03170000
*      2 PSAEXPS1 CHAR(8) BDY(DWORD),/* EXTERNAL FLIH PSW SAVE AREA 1*/ 03171000
*      2 PSAEXPS2 CHAR(8) BDY(DWORD),/* EXTERNAL FLIH PSW SAVE AREA 2*/ 03172000
*      2 PSAMPSW CHAR(8) BDY(DWORD),/* SETLOCK MODEL PSW             */ 03173000
*      2 PSAMCHEX CHAR(8) BDY(DWORD),/* MCH EXIT PSW                 */ 03174000
*      2 PSAIPCR CHAR(4) BDY(WORD), /* IPC INSTRUCTION TO BE EXECUTED*/ 03175000
*      2 PSAIPCRM CHAR(1),          /* BYTE USED BY ABOVE IPC   03S0056 03176000
*                                      INSTRUCTION                   */ 03177000
*      2 * CHAR(3),                 /* RESERVED                      */ 03178000
*      2 PSAIPCD CHAR(4) BDY(WORD), /* IPC INSTRUCTION TO BE EXECUTED*/ 03179000
*      2 PSAIPCDM CHAR(1),          /* BYTE USED BY ABOVE IPC   03S0056 03180000
*                                      INSTRUCTION                   */ 03181000
*      2 * CHAR(3),                 /* RESERVED                      */ 03182000
*      2 PSAIPCSA FIXED(31),        /* IPC REGISTER SAVE AREA MDC049 */ 03183000
*      2 PSAHLHIS FIXED(31),        /* SAVE AREA FOR PSAHLHI MDC050  */ 03184000
*      2 PSARECUR CHAR(1),          /* RESTART FLIH RECURSION   03S0056 03185000
*                                      INDICATOR. IF X'00', FLIH NOT    03186000
*                                      IN CONTROL. IF X'FF', FLIH IN    03187000
*                                      CONTROL, ENTRY IS RECURSIVE      03188000
*                                      MDC093                        */ 03189000
*      2 PSADSSGO PTR(8),           /* INITIALIZE DSS FLAG, SET BY      03190000
*                                      OPERATOR. IF X'00', DSS NOT TO   03191000
*                                      BE ACTIVATED. IF NOT X'00',      03192000
*                                      NEXT RESTART INTERRUPT FROM      03193000
*                                      CONSOLE SHOULD INITIALIZE DSS.   03194000
*                                      MDC094                        */ 03195000
*      2 PSARV050 FIXED(15),        /* RESERVED                      */ 03196000
*      2 PSASRSA PTR(31),           /* REAL ADDRESS OF SAVE AREA USED   03197000
*                                      DURING STOP AND RESTART  03S0056 03198000
*                                      SUBROUTINE MDC095             */ 03199000
*      2 PSACLHT CHAR(56) BDY(WORD),/* CPU LOCKS HELD TABLE.    03S0056 03200000
*                                      INITIALIZED TO ZERO. IF LOCK     03201000
*                                      IS HELD, WORD REPRESENTING       03202000
*                                      LOCK HAS ITS ADDRESS.         */ 03203000
*       3 PSADISPL PTR(31),         /* GLOBAL DISPATCHER LOCK        */ 03204000
*       3 PSAASML PTR(31),          /* AUXILIARY STORAGE MANAGEMENT     03205000
*                                      (ASM) LOCK MDC002             */ 03206000
*       3 PSASALCL PTR(31),         /* SPACE ALLOCATION LOCK MDC003  */ 03207000
*       3 PSAIOSSL PTR(31),         /* IOS SYNCHRONIZATION LOCK 03S0056 03208000
*                                      MDC010                        */ 03209000
*       3 PSAIOSCL PTR(31),         /* IOS CHANNEL AVAILABLE TABLE      03210000
*                                      LOCK MDC004                   */ 03211000
*       3 PSAIOSUL PTR(31),         /* IOS UNIT CONTROL BLOCK LOCK      03212000
*                                      MDC005                        */ 03213000
*       3 PSAIOSLL PTR(31),         /* IOS LOGICAL CHANNEL QUEUE LOCK   03214000
*                                      MDC006                        */ 03215000
*       3 PSATPNCL PTR(31),         /* TCAM'S TPNCP LOCK MDC007      */ 03216000
*       3 PSATPDNL PTR(31),         /* TCAM'S TPDNCB LOCK MDC008     */ 03217000
*       3 PSATPACL PTR(31),         /* TCAM'S TPACBDEB LOCK MDC009   */ 03218000
*       3 PSAOPTL PTR(31),          /* OPTIMIZER LOCK                */ 03219000
*       3 PSACMSL PTR(31),          /* CROSS MEMORY SERVICES LOCK    */ 03220000
*       3 PSALOCAL PTR(31),         /* LOCAL LOCK                    */ 03221000
*       3 PSARV023 PTR(31),         /* RESERVED LOCK                 */ 03222000
*      2 PSALKSA CHAR(64) BDY(WORD),/* SETLOCK REGISTER SAVE AREA    */ 03223000
*       3 PSALKR0 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 0 */ 03224000
*       3 PSALKR1 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 1 */ 03225000
*       3 PSALKR2 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 2 */ 03226000
*       3 PSALKR3 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 3 */ 03227000
*       3 PSALKR4 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 4 */ 03228000
*       3 PSALKR5 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 5 */ 03229000
*       3 PSALKR6 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 6 */ 03230000
*       3 PSALKR7 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 7 */ 03231000
*       3 PSALKR8 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 8 */ 03232000
*       3 PSALKR9 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 9 */ 03233000
*       3 PSALKR10 FIXED(31),       /* SETLOCK'S CALLER'S REGISTER 10*/ 03234000
*       3 PSALKR11 FIXED(31),       /* SETLOCK'S CALLER'S REGISTER 11*/ 03235000
*       3 PSALKR12 FIXED(31),       /* SETLOCK'S CALLER'S REGISTER 12*/ 03236000
*       3 PSALKR13 FIXED(31),       /* SETLOCK'S CALLER'S REGISTER 13*/ 03237000
*       3 PSALKR14 FIXED(31),       /* SETLOCK'S CALLER'S REGISTER 14*/ 03238000
*       3 PSALKR15 FIXED(31),       /* SETLOCK'S CALLER'S REGISTER 15*/ 03239000
*      2 PSAHLHI CHAR(4) BDY(WORD), /* HIGHEST LOCK HELD INDICATOR   */ 03240000
*       3 PSACLHS BIT(32) BDY(WORD),/* CPU LOCKS HELD STRING MDC122  */ 03241000
*      2 PSALITA PTR(31),           /* ADDRESS OF LOCK INTERFACE        03242000
*                                      TABLE                         */ 03243000
*      2 PSAPSWSV CHAR(8) BDY(DWORD),/* PSW SAVE AREA FOR DISPATCHER    03244000
*                                      AND ACR                       */ 03245000
*      2 PSACR0 FIXED(31),          /* SAVE AREA FOR CONTROL REGISTER   03246000
*                                      0                             */ 03247000
*      2 PSAMCHFL BIT(8),           /* MCH RECURSION FLAGS           */ 03248000
*      2 PSASYMSK CHAR(1),          /* THIS FIELD WILL BE USED IN       03249000
*                                      CONJUNCTION WITH THE STNSM       03250000
*                                      INSTRUCTION TO PLACE IOS 03S0056 03251000
*                                      CHANNEL SCHEDULER INTO A 03S0056 03252000
*                                      DISABLED STATE AND       03S0056 03253000
*                                      SIMULTANEOUSLY SAVE THE SYSTEM   03254000
*                                      MASK OF THE CALLER MDC022     */ 03255000
*      2 PSARV061 CHAR(1),          /* RESERVED (MDC060)       YM4244*/ 03256000
*      2 PSAMCHIC CHAR(1),          /* MCH INITIALIZATION COMPLETE      03257000
*                                      FLAGS MDC098                  */ 03258000
*      2 PSAWKRAP PTR(31),          /* REAL ADDRESS OF VARY CPU 03S0056 03259000
*                                      PARAMETER LIST MDC106         */ 03260000
*      2 PSAWKVAP PTR(31),          /* VIRTUAL ADDRESS OF VARY CPU      03261000
*                                      PARAMETER LIST MDC107         */ 03262000
*      2 PSAVSTAP FIXED(15),        /* WORK AREA FOR VARY CPU MDC108 */ 03263000
*      2 PSACPUSA PTR(15),          /* PHYSICAL CPU ADDRESS (STATIC)    03264000
*                                      (MDC131)                YM3489*/ 03265000
*      2 PSASTOR FIXED(31),         /* MASTER MEMORY'S SEGMENT TABLE    03266000
*                                      ORIGIN REGISTER (STOR) VALUE  */ 03267000
*      2 PSADSSRS FIXED(31),        /* REGISTER SAVE FOR DSS PROGRAM    03268000
*                                      AND SVC INTERRUPT HANDLERS       03269000
*                                      MDC053                        */ 03270000
*      2 PSADSSR2 FIXED(31),        /* REGISTER SAVE AREA FOR DSS I/O   03271000
*                                      AND EXTERNAL INTERRUPT   03S0056 03272000
*                                      HANDLERS MDC054               */ 03273000
*      2 PSADSSR3 FIXED(31),        /* REGISTER SAVE AREA FOR DSS       03274000
*                                      ERROR RECOVERY ROUTINE MDC055 */ 03275000
*      2 PSADSSWK FIXED(31),        /* WORK AREA FOR DSS INTERRUPT      03276000
*                                      HANDLERS MDC056               */ 03277000
*      2 PSADSSTS(5) FIXED(31),     /* REGISTER SAVE FOR DSS MODULES    03278000
*                                      MAKING CALLS TO IQATSS MDC023 */ 03279000
*      2 PSADSSFL CHAR(4) BDY(WORD),/* DSS FLAG BYTES MDC024         */ 03280000
*       3 PSADSSF1 BIT(8),          /* DSS STATUS BYTE MDC029        */ 03281000
*        4 PSADSSMV BIT(1),         /* DSS MONITORING, VS2 RUNNING      03282000
*                                      MDC030                        */ 03283000
*        4 PSADSSDM BIT(1),         /* DSS IN VS2-2 VM MDC031        */ 03284000
*        4 PSADSSDD BIT(1),         /* DSS IN DSS VM MDC032          */ 03285000
*        4 PSADSSDW BIT(1),         /* DSS IN DSS WAIT MDC033        */ 03286000
*        4 PSADSSTP BIT(1),         /* DSS PROCESSING SIGP MDC034    */ 03287000
*        4 PSADSSSP BIT(1),         /* DSS SIGP PENDING MDC035       */ 03288000
*        4 PSADSSOI BIT(1),         /* DSS EXECUTING OVERLAID   03S0056 03289000
*                                      INSTRUCTION MDC036            */ 03290000
*        4 PSADSSPI BIT(1),         /* DSS EXECUTING PRIVILEGED 03S0056 03291000
*                                      INSTRUCTION MDC037            */ 03292000
*       3 PSADSSF2 CHAR(1),         /* SYSTEM STATUS BYTE MDC038     */ 03293000
*       3 PSADSSF3 BIT(8),          /* DSS FLAG BYTE MDC099          */ 03294000
*        4 PSADSSGP BIT(1),         /* DSS SIGP INDICATOR MDC100     */ 03295000
*        4 PSADSSES BIT(1),         /* ERROR SHORT SAVE INDICATOR       03296000
*                                      MDC113                        */ 03297000
*        4 PSADSSNM BIT(1),         /* NON-MONITORABLE CODE INDICATOR   03298000
*                                      MDC114                        */ 03299000
*        4 PSADSSRW BIT(1),         /* DSS OWNS CVTRSTWD MDC117      */ 03300000
*        4 PSARV054 BIT(1),         /* RESERVED FOR DSS MDC100       */ 03301000
*        4 PSARV055 BIT(1),         /* RESERVED FOR DSS MDC100       */ 03302000
*        4 PSARV056 BIT(1),         /* RESERVED FOR DSS MDC100       */ 03303000
*        4 PSARV057 BIT(1),         /* RESERVED FOR DSS MDC100       */ 03304000
*       3 PSADSSF4 BIT(8),          /* DSS RECURSION FLAGS MDC101    */ 03305000
*        4 PSADSSRC BIT(1),         /* PROGRAM-SVC RECURSION FLAG       03306000
*                                      MDC057                        */ 03307000
*        4 PSADSS12 BIT(1),         /* PROGRAM INTERRUPT 12 RECURSION   03308000
*                                      FLAG MDC058                   */ 03309000
*        4 PSADSSIE BIT(1),         /* I/O-EXTERNAL RECURSION FLAG      03310000
*                                      MDC059                        */ 03311000
*        4 PSADSSC0 BIT(1),         /* CONTROL REGISTER 0 INVALID       03312000
*                                      FLAG MDC092                   */ 03313000
*        4 PSADSSDE BIT(1),         /* DAT ERROR WHILE DSS RUNNING IN   03314000
*                                      VS2 VM MDC102                 */ 03315000
*        4 PSADSSVE BIT(1),         /* DAT ERROR WHILE DSS RUNNING IN   03316000
*                                      DSS VM MDC103                 */ 03317000
*        4 PSADSS10 BIT(1),         /* SEGMENT EXCEPTION RECURSION      03318000
*                                      FLAG MDC104                   */ 03319000
*        4 PSADSS05 BIT(1),         /* ADDRESSING EXCEPTION RECURSION   03320000
*                                      FLAG MDC105                   */ 03321000
*      2 PSADSSRP CHAR(8) BDY(DWORD),/* DSS TO VS2-2 RESUME PSW 03S0056 03322000
*                                      MDC025                        */ 03323000
*      2 PSADSSPP CHAR(8) BDY(DWORD),/* DSS PSW FOR RETURNING CONTROL   03324000
*                                      FROM PRIVILEGED INSTRUCTION      03325000
*                                      STREAM TO VS2 MDC026          */ 03326000
*      2 PSADSS14 FIXED(31),        /* RESTART SECOND LEVEL INTERRUPT   03327000
*                                      HANDLER CONTROL REGISTER 14      03328000
*                                      SAVE AREA MDC115              */ 03329000
*      2 PSADSSFW FIXED(31),        /* FULL-WORD DSS WORK AREA MDC116*/ 03330000
*      2 PSADSSPR FIXED(31),        /* DSS REGISTER SAVE FOR    03S0056 03331000
*                                      PRIVILEGED INSTRUCTION STREAM    03332000
*                                      MDC028                        */ 03333000
*      2 PSADSSED CHAR(0) BDY(WORD),/* END OF DSS FIELDS MDC045      */ 03334000
*      2 PSARV025 FIXED(31),        /* RESERVED FOR DSS              */ 03335000
*      2 PSARV040 PTR(31),          /* RESERVED FOR DSS              */ 03336000
*      2 PSARV041 PTR(31),          /* RESERVED FOR DSS              */ 03337000
*      2 PSARV042 PTR(31),          /* RESERVED FOR DSS              */ 03338000
*      2 PSARV043 PTR(31),          /* RESERVED FOR DSS              */ 03339000
*      2 PSARV044 PTR(31),          /* RESERVED FOR DSS              */ 03340000
*      2 PSARV045 PTR(31),          /* RESERVED FOR DSS              */ 03341000
*      2 PSARSVT(16) PTR(31),       /* RECOVERY STACK VECTOR TABLE      03342000
*                                      (EACH ELEMENT MAPPED BELOW)      03343000
*                                      MDC064                        */ 03344000
*      2 PSASRPSW CHAR(8) BDY(DWORD),/* RESUME PSW FOR STOP AND 03S0056 03345000
*                                      RESTART SUBROUTINE MDC096     */ 03346000
*      2 PSARSPSW CHAR(8) BDY(DWORD),/* RESUME PSW FIELD FOR RESTART    03347000
*                                      INTERRUPT HANDLER MDC097      */ 03348000
*      2 PSASTART CHAR(16) BDY(DWORD),/* START FATHOM RECORDING 03S0056 03349000
*                                      MDC111                        */ 03350000
*      2 PSASTOP CHAR(16) BDY(DWORD),/* STOP FATHOM RECORDING MDC112 */ 03351000
*      2 PSASFACC CHAR(4) BDY(WORD),/* SETFRR ABEND COMPLETION CODE     03352000
*                                      USED WHEN A SETFRR ADD IS        03353000
*                                      ISSUED AGAINST A FULL FRR        03354000
*                                      STACK MDC123                  */ 03355000
*      2 PSALSFCC CHAR(4) BDY(WORD),/* A LOAD INSTRUCTION TO PRIME      03356000
*                                      REGISTER 1 WITH THE SETFRR       03357000
*                                      ABEND COMPLETION CODE IN 03S0056 03358000
*                                      PSASFACC MDC124               */ 03359000
*      2 PSASVC13 CHAR(2),          /* AN SVC 13 INSTRUCTION MDC125  */ 03360000
*      2 PSARV059 FIXED(15),        /* RESERVED                      */ 03361000
*      2 PSARV060 FIXED(31),        /* RESERVED                      */ 03362000
*      2 PSAPCPSW CHAR(8) BDY(DWORD),/* TEMPORARY OLD PSW STORAGE FOR   03363000
*                                      PROGRAM FLIH (MDC129)   YM0943*/ 03364000
*      2 PSAUSEND CHAR(0) BDY(DWORD),/* END OF ASSIGNED FIELDS MDC109*/ 03365000
*      2 * CHAR(2040) BDY(DWORD),   /* RESERVED                      */ 03366000
*      2 PSASTAK CHAR(340) BDY(DWORD),/* NORMAL FRR STACK MDC118     */ 03367000
*      2 * CHAR(684);               /* RESERVED FOR EXPANSION OF        03368000
*                                      PSASTAK MDC118                */ 03369000
*   DECLARE                                                     03S0057 03370000
*     FLC DEF(PSA) CHAR(LENGTH(PSA)) BDY(DWORD);                03S0057 03371000
*   DECLARE                                                     03S0058 03372000
*     1 PSARSVTE CHAR(64) DEF(PSARSVT) BDY(WORD),/* RECOVERY STACK      03373000
*                                      VECTOR TABLE MDC065           */ 03374000
*      2 PSACSTK PTR(31),           /* ADDRESS OF CURRENTLY USED        03375000
*                                      FUNCTIONAL RECOVERY ROUTINE      03376000
*                                      (FRR) STACK MDC061            */ 03377000
*      2 PSANSTK PTR(31),           /* ADDRESS OF NORMAL FRR STACK      03378000
*                                      MDC062                        */ 03379000
*      2 PSASSTK PTR(31),           /* ADDRESS OF SVC-I/O- DISPATCHER   03380000
*                                      FRR STACK MDC063              */ 03381000
*      2 PSASSAV PTR(31),           /* ADDRESS OF INTERRUPTED STACK     03382000
*                                      SAVED BY SVC-I/O- DISPATCHER     03383000
*                                      MDC066                        */ 03384000
*      2 PSAMSTK PTR(31),           /* ADDRESS OF MCH FRR STACK 03S0058 03385000
*                                      MDC067                        */ 03386000
*      2 PSAMSAV PTR(31),           /* ADDRESS OF INTERRUPTED STACK     03387000
*                                      SAVED BY MCH MDC068           */ 03388000
*      2 PSAPSTK PTR(31),           /* ADDRESS OF PROGRAM CHECK FLIH    03389000
*                                      FRR STACK MDC069              */ 03390000
*      2 PSAPSAV PTR(31),           /* ADDRESS OF INTERRUPTED STACK     03391000
*                                      SAVED BY PROGRAM CHECK FLIH      03392000
*                                      MDC070                        */ 03393000
*      2 PSAESTK1 PTR(31),          /* ADDRESS OF EXTERNAL FLIH FRR     03394000
*                                      STACK FOR NON- RECURSIVE 03S0058 03395000
*                                      ENTRIES MDC071                */ 03396000
*      2 PSAESAV1 PTR(31),          /* ADDRESS OF INTERRUPTED STACK     03397000
*                                      SAVED BY NON- RECURSIVE  03S0058 03398000
*                                      ENTRIES MDC072                */ 03399000
*      2 PSAESTK2 PTR(31),          /* ADDRESS OF EXTERNAL FLIH FRR     03400000
*                                      STACK FOR FIRST LEVEL    03S0058 03401000
*                                      RECURSIONS MDC073             */ 03402000
*      2 PSAESAV2 PTR(31),          /* ADDRESS OF INTERRUPTED STACK     03403000
*                                      SAVED BY EXTERNAL FLIH FOR       03404000
*                                      FIRST LEVEL RECURSIONS MDC074 */ 03405000
*      2 PSAESTK3 PTR(31),          /* ADDRESS OF EXTERNAL FLIH FRR     03406000
*                                      STACK FOR SECOND LEVEL   03S0058 03407000
*                                      RECURSIONS AND ACR MDC075     */ 03408000
*      2 PSAESAV3 PTR(31),          /* ADDRESS OF INTERRUPTED STACK     03409000
*                                      SAVED BY EXTERNAL FLIH (ACR)     03410000
*                                      FOR SECOND LEVEL RECURSIONS      03411000
*                                      MDC076                        */ 03412000
*      2 PSARSTK PTR(31),           /* ADDRESS OF RESTART FLIH FRR      03413000
*                                      STACK MDC077                  */ 03414000
*      2 PSARSAV PTR(31);           /* ADDRESS OF INTERRUPTED STACK     03415000
*                                      SAVED BY RESTART FLIH MDC078     03416000
*                                                                    */ 03417000
*                                                               01S0059 03418000
*   /*****************************************************************/ 03419000
*   /*                                                               */ 03420000
*   /* EXECUTABLE CODE                                               */ 03421000
*   /*                                                               */ 03422000
*   /*****************************************************************/ 03423000
*                                                               01S0059 03424000
*                                                               02S0059 03425000
*   /*****************************************************************/ 03426000
*   /*                                                               */ 03427000
*   /* STAGE2 - THIS SEGMENT IS THE MAINLINE EXECUTABLE CODE. SEE THE*/ 03428000
*   /* MODULE PROLOG FOR DESCRIPTION OF INPUTS. PERFORM              */ 03429000
*   /* INITIALIZATION                                                */ 03430000
*   /*                                                               */ 03431000
*   /*****************************************************************/ 03432000
*                                                               02S0059 03433000
*                                                               03S0059 03434000
*/********************************************************************  03435000
*                                                                    */ 03436000
*/********************************************************************  03437000
*                                                                    */ 03438000
*/*  INIT2-                                                          */ 03439000
*/*  THIS SEGMENT SAVES STATUS AND ESTABLISHES AN FRR.               */ 03440000
*/*      INPUT:                                                      */ 03441000
*/*        R0-R9,R11-R15  - AS PASSED FROM USER. THESE WILL          */ 03442000
*/*                 BE SAVED.                                        */ 03443000
*/********************************************************************  03444000
*                                                                    */ 03445000
*                                                               03S0059 03446000
*   GEN CODE REFS(PSAAOLD,ASXBSPSA,ASCBASXB,WSALS2EE,RECADDR,R12,R13,   03447000
*       R10,ASXB,ASCB,WSAL,PSACSTK);                            03S0059 03448000
        L   R10,PSAAOLD                GET CURRENT ASCB ADDR            03449000
        L   R10,ASCBASXB-ASCB(R10)     GET CURRENT ASXB                 03450000
        L   R10,ASXBSPSA-ASXB(R10)     GET ADDR OF WSA VECTOR TBL       03451000
        L   R10,WSALS2EE-WSAL(R10)     GET WORK AREA ADDR               03452000
        STM 0,15,0(R10)                SAVE REGISTERS                   03453000
        LR   WAPTR,R10                 SAVE WORKAREA ADDR               03454000
        BALR  10,0                     ESTABLISH BASE                   03455000
        USING *,10                                                      03456000
IEAVEEE2  MODID  BR=YES                                                 03457000
*   ASCBPTR=PSAAOLD;                /* GET CURRENT ASCB ADDR         */ 03458000
         L     ASCBPTR,PSAAOLD                                  03S0060 03459000
*   ASXBPTR=ASCBASXB;               /* GET CURRENT ASXB ADDR         */ 03460000
         L     ASXBPTR,ASCBASXB(,ASCBPTR)                       03S0061 03461000
*/********************************************************************  03462000
*                                                                    */ 03463000
*/*  END OF INIT2 -                                                  */ 03464000
*/*      OUTPUT:                                                     */ 03465000
*/*        R10 - CONTAINS BASE ADDRESS                               */ 03466000
*/*        WAPTR (R3) - CONTAINS ADDR OF WORK SAVE AREA.             */ 03467000
*/*        ASCBPTR (R8) - CONTAINS ADDR OF CURRENT ASCB.             */ 03468000
*/*        ASXBPTR (R7) - CONTAINS ADDR OF CURRENT ASXB.             */ 03469000
*/*        THE SAVE AREA POINTED TO BY WAPTR CONTAINS THE            */ 03470000
*/*             CALLERS REGISTERS.                                   */ 03471000
*/********************************************************************  03472000
*                                                                    */ 03473000
*                                                               03S0062 03474000
*   IF R1=0                         /* IF SRBS ARE PASSED            */ 03475000
*     THEN                                                      02S0062 03476000
         SLR   @12,@12                                          02S0062 03477000
         CR    R1,@12                                           02S0062 03478000
         BNE   @RF00062                                         02S0062 03479000
*     DO;                                                       02S0063 03480000
*                                                               02S0063 03481000
*       /*************************************************************/ 03482000
*       /*                                                           */ 03483000
*       /* QUEUE THE SRB TO THE ASYNCHRONOUS EXIT QUEUE              */ 03484000
*       /*                                                           */ 03485000
*       /*************************************************************/ 03486000
*                                                               02S0064 03487000
*                                                               03S0064 03488000
*/********************************************************************  03489000
*                                                                    */ 03490000
*/*  QSRB -                                                          */ 03491000
*/*  THIS SEGMENT QUEUES THE SRB TO THE ASYNCHRONOUS EXIT QUEUE      */ 03492000
*/*      INPUT:                                                      */ 03493000
*/*        R0 - CONTAINS ADDR OF SRB TO BE ENQUEUED.                 */ 03494000
*/*        ASXBPTR (R7) -CONTAINS ADDR OF CURRENT ASXB.              */ 03495000
*/********************************************************************  03496000
*                                                                    */ 03497000
*                                                               03S0064 03498000
*       SRBPTR=R0;                  /* GET ADDRESS OF SRB            */ 03499000
         LR    SRBPTR,R0                                        03S0064 03500000
*       IF ASXBLSRB=0               /* IF Q IS EMPTY                 */ 03501000
*         THEN                                                  03S0065 03502000
         C     @12,ASXBLSRB(,ASXBPTR)                           03S0065 03503000
         BNE   @RF00065                                         03S0065 03504000
*         DO;                                                   03S0066 03505000
*           ASXBFSRB=SRBPTR;        /* POINT TO FIRST                */ 03506000
         ST    SRBPTR,ASXBFSRB(,ASXBPTR)                        03S0067 03507000
*           ASXBLSRB=SRBPTR;        /* AND LAST                      */ 03508000
         ST    SRBPTR,ASXBLSRB(,ASXBPTR)                        03S0068 03509000
*         END;                                                  03S0069 03510000
*       ELSE                                                    03S0070 03511000
*         DO;                                                   03S0070 03512000
         B     @RC00065                                         03S0070 03513000
@RF00065 DS    0H                                               03S0071 03514000
*           ASXBLSRB->SRBFLNK=SRBPTR;/* CHAIN OFF LAST SRB           */ 03515000
         L     @12,ASXBLSRB(,ASXBPTR)                           03S0071 03516000
         ST    SRBPTR,SRBFLNK(,@12)                             03S0071 03517000
*           ASXBLSRB=SRBPTR;        /* POINT TO LAST                 */ 03518000
         ST    SRBPTR,ASXBLSRB(,ASXBPTR)                        03S0072 03519000
*         END;                                                  03S0073 03520000
*       SRBFLNK=0;                  /* ZERO CHAIN FIELD              */ 03521000
@RC00065 SLR   @12,@12                                          03S0074 03522000
         ST    @12,SRBFLNK(,SRBPTR)                             03S0074 03523000
*/********************************************************************  03524000
*                                                                    */ 03525000
*/*  END OF QSRB -                                                   */ 03526000
*/*      OUTPUT:                                                     */ 03527000
*/*        SRBPTR (R1) -CONTAINS ADDR OF SRB.                        */ 03528000
*/********************************************************************  03529000
*                                                                    */ 03530000
*                                                               03S0075 03531000
*     END;                                                      02S0075 03532000
*   ELSE                                                        02S0076 03533000
*     IF R1A<0                      /* IF AN IQE IS PASSED           */ 03534000
*       THEN                                                    02S0076 03535000
         B     @RC00062                                         02S0076 03536000
@RF00062 SLR   @12,@12                                          02S0076 03537000
         CR    R1A,@12                                          02S0076 03538000
         BNL   @RF00076                                         02S0076 03539000
*       DO;                                                     02S0077 03540000
*                                                               02S0077 03541000
*         /***********************************************************/ 03542000
*         /*                                                         */ 03543000
*         /* QUEUE THE IQE TO THE ASYNCHRONOUS EXIT QUEUE            */ 03544000
*         /*                                                         */ 03545000
*         /***********************************************************/ 03546000
*                                                               02S0078 03547000
*                                                               03S0078 03548000
*/********************************************************************  03549000
*                                                                    */ 03550000
*/*  QIQE -                                                          */ 03551000
*/* THIS SEGMENT QUEUES THE IQE TO THE ASYNCHRONOUS EXIT QUEUE       */ 03552000
*/*      INPUT:                                                      */ 03553000
*/*        IQEPTR (R1) - CONTAINS THE COMPLEMENTED ADDR OF THE       */ 03554000
*/*                   IQE TO BE ENQUEUED.                            */ 03555000
*/*        ASXBPTR (R7) - CONTAINS ADDR OF THE CURRENT ASXB.         */ 03556000
*/********************************************************************  03557000
*                                                                    */ 03558000
*                                                               03S0078 03559000
*         IQEPTR=-IQEPTR;           /* GET TRUE ADDRESS OF IQE       */ 03560000
         LCR   IQEPTR,IQEPTR                                    03S0078 03561000
*         IF ASXBLIQE=0             /* IF THE QUEUE IS EMPTY         */ 03562000
*           THEN                                                03S0079 03563000
         C     @12,ASXBLIQE(,ASXBPTR)                           03S0079 03564000
         BNE   @RF00079                                         03S0079 03565000
*           DO;                                                 03S0080 03566000
*             ASXBFIQE=IQEPTR;      /* SET PTR TO FIRST IQE          */ 03567000
         ST    IQEPTR,ASXBFIQE(,ASXBPTR)                        03S0081 03568000
*             ASXBLIQE=IQEPTR;      /* SET PTR TO LAST IQE           */ 03569000
         ST    IQEPTR,ASXBLIQE(,ASXBPTR)                        03S0082 03570000
*           END;                                                03S0083 03571000
*         ELSE                                                  03S0084 03572000
*           DO;                                                 03S0084 03573000
         B     @RC00079                                         03S0084 03574000
@RF00079 DS    0H                                               03S0085 03575000
*             ASXBLIQE->IQELNKA=IQEPTR;/* SET PTR IN LAST IQE        */ 03576000
         L     @12,ASXBLIQE(,ASXBPTR)                           03S0085 03577000
         STCM  IQEPTR,7,IQELNKA(@12)                            03S0085 03578000
*             ASXBLIQE=IQEPTR;      /* SET PTR TO LAST               */ 03579000
         ST    IQEPTR,ASXBLIQE(,ASXBPTR)                        03S0086 03580000
*           END;                                                03S0087 03581000
*         IQELNKA=0;                /* CLEAR FORWARD CHAIN IN LAST   */ 03582000
@RC00079 SLR   @12,@12                                          03S0088 03583000
         STCM  @12,7,IQELNKA(IQEPTR)                            03S0088 03584000
*/********************************************************************  03585000
*                                                                    */ 03586000
*/*  END OF QIQE -                                                   */ 03587000
*/*      OUTPUT:                                                     */ 03588000
*/*        IQEPTR (R1) - CONTAINS TRUE ADDR OF THE IQE.              */ 03589000
*/********************************************************************  03590000
*                                                                    */ 03591000
*                                                               03S0089 03592000
*       END;                                                    02S0089 03593000
*     ELSE                                                      02S0090 03594000
*       DO;                                                     02S0090 03595000
*                                                               02S0090 03596000
         B     @RC00076                                         02S0090 03597000
@RF00076 DS    0H                                               02S0091 03598000
*         /***********************************************************/ 03599000
*         /*                                                         */ 03600000
*         /* QUEUE THE RQE TO THE ASYNCHRONOUS EXIT QUEUE            */ 03601000
*         /*                                                         */ 03602000
*         /***********************************************************/ 03603000
*                                                               02S0091 03604000
*                                                               03S0091 03605000
*/********************************************************************  03606000
*                                                                    */ 03607000
*/*  QRQE -                                                          */ 03608000
*/* THIS SEGMENT QUEUES THE RQE TO THE ASYNCHRONOUS EXIT QUEUE       */ 03609000
*/*      INPUT:                                                      */ 03610000
*/*        RQEPTR    (R1) -CONTAINS ADDR OF RQE TO BE ENQUEUED.      */ 03611000
*/*        ASXBPTR (R7) - CONTAINS ADDR OF CURRENT ASXB.             */ 03612000
*/********************************************************************  03613000
*                                                                    */ 03614000
*                                                               03S0091 03615000
*         IF ASXBLRQE=0             /* IF THERE ARE NO RQES ON Q     */ 03616000
*           THEN                                                03S0091 03617000
         ICM   @12,15,ASXBLRQE(ASXBPTR)                         03S0091 03618000
         BNZ   @RF00091                                         03S0091 03619000
*           DO;                                                 03S0092 03620000
*             ASXBFRQE=RQEPTR;      /* POINT TO FIRST                */ 03621000
         ST    RQEPTR,ASXBFRQE(,ASXBPTR)                        03S0093 03622000
*             ASXBLRQE=RQEPTR;      /* POINT TO LAST                 */ 03623000
         ST    RQEPTR,ASXBLRQE(,ASXBPTR)                        03S0094 03624000
*           END;                                                03S0095 03625000
*         ELSE                                                  03S0096 03626000
*           DO;                                                 03S0096 03627000
         B     @RC00091                                         03S0096 03628000
@RF00091 DS    0H                                               03S0097 03629000
*             ASXBLRQE->RQENRQE=RQEPTR;/* CHAIN OFF LAST RQE         */ 03630000
         L     @12,ASXBLRQE(,ASXBPTR)                           03S0097 03631000
         ST    RQEPTR,RQENRQE(,@12)                             03S0097 03632000
*             ASXBLRQE=RQEPTR;      /* POINT TO LAST                 */ 03633000
         ST    RQEPTR,ASXBLRQE(,ASXBPTR)                        03S0098 03634000
*           END;                                                03S0099 03635000
*         RQENRQE=0;                /* ZERO CHAIN FIELD              */ 03636000
@RC00091 SLR   @12,@12                                          03S0100 03637000
         ST    @12,RQENRQE(,RQEPTR)                             03S0100 03638000
*         RQETCB=DEBTCBB;           /* COPY TCB ADDR INTO A FIXED       03639000
*                                      AREA                  @YM05064*/ 03640000
         L     @12,DEBPTR(,RQEPTR)                              03S0101 03641000
         SLR   @11,@11                                          03S0101 03642000
         ICM   @11,7,DEBTCBB(@12)                               03S0101 03643000
         ST    @11,RQETCB(,RQEPTR)                              03S0101 03644000
*         RQERRQ=DEBIRBB;           /* COPY IRB ADDR INTO A FIXED       03645000
*                                      AREA                  @YM05064*/ 03646000
         SLR   @11,@11                                          03S0102 03647000
         ICM   @11,7,DEBIRBB(@12)                               03S0102 03648000
         ST    @11,RQERRQ(,RQEPTR)                              03S0102 03649000
*/********************************************************************  03650000
*                                                                    */ 03651000
*/*  END OF QRQE -                                                   */ 03652000
*/*      OUTPUT:  NONE.                                              */ 03653000
*/********************************************************************  03654000
*                                                                    */ 03655000
*                                                               03S0103 03656000
*       END;                                                    02S0103 03657000
*   ASCBS3S=ON;                     /* TURN ON THE STAGE 3 SWITCH    */ 03658000
@RC00076 DS    0H                                               02S0104 03659000
@RC00062 OI    ASCBS3S(ASCBPTR),B'00100000'                     02S0104 03660000
*   ASCBS2S=ON;                     /* TURN ON THE STAGE 2 SWITCH    */ 03661000
*                                                               02S0105 03662000
         OI    ASCBS2S(ASCBPTR),B'00010000'                     02S0105 03663000
*   /*****************************************************************/ 03664000
*   /*                                                               */ 03665000
*   /* RESTORE REGISTERS                                             */ 03666000
*   /*                                                               */ 03667000
*   /*****************************************************************/ 03668000
*                                                               02S0106 03669000
*                                                               03S0106 03670000
*/********************************************************************  03671000
*                                                                    */ 03672000
*/*   RESREG  -                                                      */ 03673000
*/*   THIS SEGMENT RESTORES THE CALLERS REGISTERS,                   */ 03674000
*/*    AND RETURNS TO THE CALLER VIA A BR14.                         */ 03675000
*/*      INPUT:                                                      */ 03676000
*/*        R1   -CONTAINS TRUE ADDR OF IQE ,RQE,OR SRB               */ 03677000
*/*        WAPTR (R3) -CONTAINS ADDR OF WORK SAVE AREA.              */ 03678000
*/*              THIS WORK SAVE AREA CONTAINS THE CALLERS            */ 03679000
*/*               REGISTERS.                                         */ 03680000
*/********************************************************************  03681000
*                                                                    */ 03682000
*                                                               03S0106 03683000
*   GEN CODE REFS(PSACSTK,R11,R12);                             03S0106 03684000
*                                                               03S0106 03685000
        L     0,0(WAPTR)           RESTORE REGISTER 0                   03686000
        LM    2,15,8(WAPTR)        RESTORE REGISTERS 2-15               03687000
        BR     14                                                       03688000
*/********************************************************************  03689000
*                                                                    */ 03690000
*/*  END OF RESREG -                                                 */ 03691000
*/*      OUTPUT:                                                     */ 03692000
*/*        R1 - CONTAINS TRUE ADDR OF IQE,RQE,OR SRB                 */ 03693000
*/*        R0,R2-R9,R11-R15 - ARE RESTORED TO THE CONTENTS AT THE    */ 03694000
*/*        CALL TO STAGE 2 EXIT EFFECTOR.                            */ 03695000
*/*        THIS SEGMENT RETURNS TO THE CALLER OF STAGE 2 EXIT        */ 03696000
*/*         EFFECTOR.                                                */ 03697000
*/********************************************************************  03698000
*                                                                    */ 03699000
*                                                               03S0107 03700000
*                                                               02S0107 03701000
*/********************************************************************  03702000
*                                                                    */ 03703000
*                                                               02S0107 03704000
*   END IEA0EF00                                                01S0107 03705000
*                                                               01S0107 03706000
*/********************************************************************  03707000
*                                                                    */ 03708000
*                                                               01S0107 03709000
*                                                               01S0107 03710000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 03711000
*/*%INCLUDE SYSUT5  (PROLOG  )                                       */ 03712000
*/*%INCLUDE SYSUT5  (DECLARES)                                       */ 03713000
*/*%INCLUDE SYSLIB  (IHAIQE  )                                       */ 03714000
*/*%INCLUDE SYSLIB  (IECDRQE )                                       */ 03715000
*/*%INCLUDE SYSLIB  (IEZDEB  )                                       */ 03716000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 03717000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 03718000
*/*%INCLUDE SYSLIB  (IHAASXB )                                       */ 03719000
*/*%INCLUDE SYSLIB  (IHAWSAVT)                                       */ 03720000
*/*%INCLUDE SYSLIB  (IHALCCA )                                       */ 03721000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 03722000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 03723000
*/*%INCLUDE SYSUT5  (STAGE2  )                                       */ 03724000
*/*%INCLUDE SYSUT5  (INIT2   )                                       */ 03725000
*/*%INCLUDE SYSUT5  (QSRB    )                                       */ 03726000
*/*%INCLUDE SYSUT5  (QIQE    )                                       */ 03727000
*/*%INCLUDE SYSUT5  (QRQE    )                                       */ 03728000
*/*%INCLUDE SYSUT5  (RESREG  )                                       */ 03729000
*                                                               01S0107 03730000
*       ;                                                       01S0107 03731000
@DATA    DS    0H                                                       03732000
@DATD    DSECT                                                          03733000
         DS    0F                                                       03734000
IEA0EF00 CSECT                                                          03735000
         DS    0F                                                       03736000
@DATD    DSECT                                                          03737000
         DS    0D                                                       03738000
LCCAPTR  DS    A                                                        03739000
RECADDR  DS    F                                                        03740000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                03741000
@ENDDATD EQU   *                                                        03742000
IEA0EF00 CSECT                                                          03743000
         DS    0F                                                       03744000
@SIZDATD DC    AL1(0)                                                   03745000
         DC    AL3(@ENDDATD-@DATD)                                      03746000
         DS    0D                                                       03747000
NULL     DC    X'00'                                                    03748000
         DC    XL23'0'                                                  03749000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       03750000
@01      EQU   01                                                       03751000
@02      EQU   02                                                       03752000
@03      EQU   03                                                       03753000
@04      EQU   04                                                       03754000
@05      EQU   05                                                       03755000
@06      EQU   06                                                       03756000
@07      EQU   07                                                       03757000
@08      EQU   08                                                       03758000
@09      EQU   09                                                       03759000
@10      EQU   10                                                       03760000
@11      EQU   11                                                       03761000
@12      EQU   12                                                       03762000
@13      EQU   13                                                       03763000
@14      EQU   14                                                       03764000
@15      EQU   15                                                       03765000
RQEPTR   EQU   @01                                                      03766000
R1       EQU   @01                                                      03767000
R1A      EQU   @01                                                      03768000
IQEPTR   EQU   @01                                                      03769000
SRBPTR   EQU   @01                                                      03770000
R0       EQU   @00                                                      03771000
WAPTR    EQU   @03                                                      03772000
ASXBPTR  EQU   @07                                                      03773000
ASCBPTR  EQU   @08                                                      03774000
R10      EQU   @10                                                      03775000
R11      EQU   @11                                                      03776000
R12      EQU   @12                                                      03777000
R13      EQU   @13                                                      03778000
DEBDAPTR EQU   @15                                                      03779000
DEBEXPTR EQU   @15                                                      03780000
DEBSBPTR EQU   @15                                                      03781000
PSA      EQU   0                                                        03782000
FLCRNPSW EQU   PSA                                                      03783000
FLCROPSW EQU   PSA+8                                                    03784000
FLCICCW2 EQU   PSA+16                                                   03785000
FLCCVT   EQU   FLCICCW2                                                 03786000
PSAEEPSW EQU   PSA+132                                                  03787000
PSAESPSW EQU   PSA+136                                                  03788000
FLCSVILC EQU   PSAESPSW+1                                               03789000
PSAEPPSW EQU   PSA+140                                                  03790000
FLCPIILC EQU   PSAEPPSW+1                                               03791000
FLCPICOD EQU   PSAEPPSW+2                                               03792000
PSAPICOD EQU   FLCPICOD+1                                               03793000
FLCTEA   EQU   PSAEPPSW+4                                               03794000
FLCPER   EQU   PSA+152                                                  03795000
FLCMCLA  EQU   PSA+168                                                  03796000
FLCIOEL  EQU   FLCMCLA+4                                                03797000
FLCIOA   EQU   FLCMCLA+16                                               03798000
FLCFSA   EQU   FLCMCLA+80                                               03799000
PSAAOLD  EQU   PSA+548                                                  03800000
PSASUPER EQU   PSA+552                                                  03801000
PSASUP1  EQU   PSASUPER                                                 03802000
PSASUP2  EQU   PSASUPER+1                                               03803000
PSASUP3  EQU   PSASUPER+2                                               03804000
PSASUP4  EQU   PSASUPER+3                                               03805000
PSACLHT  EQU   PSA+640                                                  03806000
PSALKSA  EQU   PSA+696                                                  03807000
PSAHLHI  EQU   PSA+760                                                  03808000
PSADSSFL EQU   PSA+836                                                  03809000
PSADSSF1 EQU   PSADSSFL                                                 03810000
PSADSSF3 EQU   PSADSSFL+2                                               03811000
PSADSSF4 EQU   PSADSSFL+3                                               03812000
PSARSVT  EQU   PSA+896                                                  03813000
IQESECT  EQU   0                                                        03814000
IQELNK   EQU   IQESECT                                                  03815000
IQELNKA  EQU   IQELNK+1                                                 03816000
IQEIRB   EQU   IQESECT+8                                                03817000
IQEFLAGS EQU   IQEIRB                                                   03818000
IQETCB   EQU   IQESECT+12                                               03819000
RQE      EQU   0                                                        03820000
RQEDEB   EQU   RQE+8                                                    03821000
RQETCB   EQU   RQE+12                                                   03822000
RQENRQE  EQU   RQE+20                                                   03823000
RQERRQ   EQU   RQE+24                                                   03824000
RQEPRT   EQU   RQE+36                                                   03825000
RQETYPE  EQU   RQE+37                                                   03826000
RQETYP3  EQU   RQETYPE                                                  03827000
RQEFLAG  EQU   RQE+38                                                   03828000
DEBBASIC EQU   0                                                        03829000
DEBTCBAD EQU   DEBBASIC                                                 03830000
DEBTCBB  EQU   DEBTCBAD+1                                               03831000
DEBDEBAD EQU   DEBBASIC+4                                               03832000
DEBIRBAD EQU   DEBBASIC+8                                               03833000
DEBOFLGS EQU   DEBIRBAD                                                 03834000
DEBIRBB  EQU   DEBIRBAD+1                                               03835000
DEBOPATB EQU   DEBBASIC+12                                              03836000
DEBFLGS1 EQU   DEBBASIC+14                                              03837000
DEBUSRPG EQU   DEBBASIC+16                                              03838000
DEBRRQ   EQU   DEBBASIC+20                                              03839000
DEBECBAD EQU   DEBRRQ                                                   03840000
DEBDCBAD EQU   DEBBASIC+24                                              03841000
DEBPROTG EQU   DEBDCBAD                                                 03842000
DEBAPPAD EQU   DEBBASIC+28                                              03843000
DEBBASND EQU   DEBBASIC+32                                              03844000
DEBDASD  EQU   0                                                        03845000
DEBUCBAD EQU   DEBDASD                                                  03846000
DEBACSMD EQU   0                                                        03847000
DEBVOLSQ EQU   DEBACSMD                                                 03848000
DEBVOLBT EQU   DEBVOLSQ                                                 03849000
DEBDSNM  EQU   DEBACSMD+4                                               03850000
DEBUTSAA EQU   DEBDSNM                                                  03851000
DEBACS01 EQU   0                                                        03852000
DEBDSNAM EQU   DEBACS01                                                 03853000
DEBACS02 EQU   0                                                        03854000
DEBDBLK  EQU   DEBACS02                                                 03855000
DEBACS03 EQU   0                                                        03856000
DEBACS04 EQU   0                                                        03857000
DEBTBFRA EQU   DEBACS04                                                 03858000
DEBTCCWA EQU   DEBACS04+4                                               03859000
DEBACS05 EQU   0                                                        03860000
DEBFUCBA EQU   DEBACS05                                                 03861000
DEBLUCBA EQU   DEBACS05+4                                               03862000
DEBACS06 EQU   0                                                        03863000
DEBACS07 EQU   0                                                        03864000
DEBACS08 EQU   0                                                        03865000
DEBSUBNM EQU   0                                                        03866000
DEB      EQU   0                                                        03867000
DEBAVT   EQU   DEB                                                      03868000
DEBEOEA  EQU   DEBAVT                                                   03869000
DEBEOEAB EQU   DEBEOEA                                                  03870000
DEBSIOA  EQU   DEBAVT+4                                                 03871000
DEBSIOAB EQU   DEBSIOA                                                  03872000
DEBPCIA  EQU   DEBAVT+8                                                 03873000
DEBPCIAB EQU   DEBPCIA                                                  03874000
DEBCEA   EQU   DEBAVT+12                                                03875000
DEBCEAB  EQU   DEBCEA                                                   03876000
DEBXCEA  EQU   DEBAVT+16                                                03877000
DEBXCEAB EQU   DEBXCEA                                                  03878000
DEBPREFX EQU   DEB+20                                                   03879000
DEBXTNP  EQU   DEBPREFX+8                                               03880000
DEBXTN   EQU   0                                                        03881000
DEBXFLG1 EQU   DEBXTN+2                                                 03882000
SRBSECT  EQU   0                                                        03883000
SRB      EQU   SRBSECT                                                  03884000
SRBFLNK  EQU   SRB+4                                                    03885000
SRBFLC   EQU   SRB+12                                                   03886000
ASCB     EQU   0                                                        03887000
ASCBFW1  EQU   ASCB+100                                                 03888000
ASCBRCTF EQU   ASCBFW1+2                                                03889000
ASCBFLG1 EQU   ASCBFW1+3                                                03890000
ASCBS3S  EQU   ASCBFLG1                                                 03891000
ASCBASXB EQU   ASCB+108                                                 03892000
ASCBDSP1 EQU   ASCB+114                                                 03893000
ASCBFLG2 EQU   ASCB+115                                                 03894000
ASCBS2S  EQU   ASCBFLG2                                                 03895000
ASXB     EQU   0                                                        03896000
ASXBSPSA EQU   ASXB+112                                                 03897000
ASXBAEQ  EQU   ASXB+168                                                 03898000
ASXBFIQE EQU   ASXBAEQ                                                  03899000
ASXBLIQE EQU   ASXBAEQ+4                                                03900000
ASXBFRQE EQU   ASXBAEQ+8                                                03901000
ASXBLRQE EQU   ASXBAEQ+12                                               03902000
ASXBFSRB EQU   ASXBAEQ+16                                               03903000
ASXBLSRB EQU   ASXBAEQ+20                                               03904000
WSAL     EQU   0                                                        03905000
WSALS2EE EQU   WSAL+24                                                  03906000
WSAG     EQU   0                                                        03907000
WSAC     EQU   0                                                        03908000
LCCA     EQU   0                                                        03909000
LCCAIHRC EQU   LCCA+520                                                 03910000
LCCAIHR1 EQU   LCCAIHRC                                                 03911000
LCCAIHR2 EQU   LCCAIHRC+1                                               03912000
LCCAIHR3 EQU   LCCAIHRC+2                                               03913000
LCCAIHR4 EQU   LCCAIHRC+3                                               03914000
LCCASPIN EQU   LCCA+524                                                 03915000
LCCASPN1 EQU   LCCASPIN                                                 03916000
LCCASPN2 EQU   LCCASPIN+1                                               03917000
LCCASPN3 EQU   LCCASPIN+2                                               03918000
LCCASPN4 EQU   LCCASPIN+3                                               03919000
LCCACPUS EQU   LCCA+536                                                 03920000
LCCADSF1 EQU   LCCA+540                                                 03921000
LCCADSF2 EQU   LCCA+541                                                 03922000
LCCASPSA EQU   LCCA+544                                                 03923000
LCCACRFL EQU   LCCA+692                                                 03924000
LCCACREX EQU   LCCA+693                                                 03925000
LCCALKFG EQU   LCCA+694                                                 03926000
LCCASRBF EQU   LCCA+720                                                 03927000
CVTMAP   EQU   0                                                        03928000
CVTDAR   EQU   CVTMAP+72                                                03929000
CVTFLGS1 EQU   CVTDAR                                                   03930000
CVTDCB   EQU   CVTMAP+116                                               03931000
CVTOPTA  EQU   CVTMAP+182                                               03932000
CVTOPTB  EQU   CVTMAP+183                                               03933000
CVTGTF   EQU   CVTMAP+236                                               03934000
CVTGTFST EQU   CVTGTF                                                   03935000
CVTGTFS  EQU   CVTGTFST                                                 03936000
CVTSTATE EQU   CVTGTFST                                                 03937000
CVTTMODE EQU   CVTGTFST                                                 03938000
CVTFORM  EQU   CVTGTFST                                                 03939000
CVTUSR   EQU   CVTGTFST                                                 03940000
CVTAQAVT EQU   CVTMAP+240                                               03941000
CVTTCMFG EQU   CVTAQAVT                                                 03942000
CVTVOLM2 EQU   CVTMAP+244                                               03943000
CVTTATA  EQU   CVTVOLM2                                                 03944000
CVTTSKS  EQU   CVTTATA                                                  03945000
CVTVOLF2 EQU   CVTTSKS                                                  03946000
CVTTAT   EQU   CVTTATA+1                                                03947000
CVTATER  EQU   CVTMAP+248                                               03948000
CVTEXT1  EQU   CVTMAP+252                                               03949000
CVTPURG  EQU   CVTMAP+260                                               03950000
CVTQMSG  EQU   CVTMAP+268                                               03951000
CVTDMSR  EQU   CVTMAP+272                                               03952000
CVTAPF   EQU   CVTMAP+324                                               03953000
CVTEXT2  EQU   CVTMAP+328                                               03954000
CVTHJES  EQU   CVTMAP+332                                               03955000
CVTPGSIA EQU   CVTMAP+348                                               03956000
CVTA1F1  EQU   CVTMAP+356                                               03957000
CVTSYSK  EQU   CVTMAP+357                                               03958000
CVTVOLM1 EQU   CVTMAP+380                                               03959000
CVTVOLF1 EQU   CVTVOLM1                                                 03960000
CVTATMCT EQU   CVTMAP+388                                               03961000
CVTXTNT1 EQU   0                                                        03962000
CVTXTNT2 EQU   0                                                        03963000
CVTDSSV  EQU   CVTXTNT2                                                 03964000
CVTRSV90 EQU   CVTXTNT2+5                                               03965000
CVTQID   EQU   CVTXTNT2+24                                              03966000
CVTRV400 EQU   CVTXTNT2+52                                              03967000
CVTRV409 EQU   CVTXTNT2+53                                              03968000
CVTATCVT EQU   CVTXTNT2+64                                              03969000
CVTRV429 EQU   CVTXTNT2+84                                              03970000
CVTRV438 EQU   CVTXTNT2+85                                              03971000
CVTRV457 EQU   CVTXTNT2+112                                             03972000
CVTRV466 EQU   CVTXTNT2+113                                             03973000
CVTFIX   EQU   0                                                        03974000
CVTRELNO EQU   CVTFIX+252                                               03975000
IQEEND   EQU   0                                                        03976000
CVTPTR   EQU   FLCCVT                                                   03977000
DEBPTR   EQU   RQEDEB                                                   03978000
DEBBAS02 EQU   DEBBASND                                                 03979000
DEBDDS1  EQU   DEBBAS02                                                 03980000
DEBSUCBA EQU   DEBDDS1                                                  03981000
DEBRDCB  EQU   DEBDDS1+4                                                03982000
DEBPDCB  EQU   DEBDDS1+8                                                03983000
DEBWDCB  EQU   DEBDDS1+12                                               03984000
DEBBAS01 EQU   DEBBASND                                                 03985000
DEBISAM  EQU   DEBBAS01                                                 03986000
DEBFIEAD EQU   DEBISAM                                                  03987000
DEBFPEAD EQU   DEBISAM+4                                                03988000
DEBFOEAD EQU   DEBISAM+8                                                03989000
DEBEXPT  EQU   DEBISAM+12                                               03990000
DEBRPSID EQU   DEBEXPT                                                  03991000
CVTS01   EQU   CVTPGSIA                                                 03992000
CVTLPDIA EQU   CVTS01+12                                                03993000
CVTDIRST EQU   CVTLPDIA                                                 03994000
CVTSLIDA EQU   CVTS01+24                                                03995000
CVTCTLFG EQU   CVTS01+50                                                03996000
CVTSPSA  EQU   CVTS01+336                                               03997000
CVTRV210 EQU   CVTS01+424                                               03998000
CVTRV219 EQU   CVTS01+425                                               03999000
CVTRV228 EQU   CVTS01+426                                               04000000
CVTRV237 EQU   CVTS01+427                                               04001000
CVTMFRTR EQU   CVTS01+452                                               04002000
CVTRV262 EQU   CVTS01+468                                               04003000
CVTRV271 EQU   CVTS01+469                                               04004000
CVTRV280 EQU   CVTS01+470                                               04005000
CVTRV289 EQU   CVTS01+471                                               04006000
CVTGSDA  EQU   CVTS01+600                                               04007000
PSARSVTE EQU   PSARSVT                                                  04008000
PSACSTK  EQU   PSARSVTE                                                 04009000
FLC      EQU   PSA                                                      04010000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    04011000
PSARSAV  EQU   PSARSVTE+60                                              04012000
PSARSTK  EQU   PSARSVTE+56                                              04013000
PSAESAV3 EQU   PSARSVTE+52                                              04014000
PSAESTK3 EQU   PSARSVTE+48                                              04015000
PSAESAV2 EQU   PSARSVTE+44                                              04016000
PSAESTK2 EQU   PSARSVTE+40                                              04017000
PSAESAV1 EQU   PSARSVTE+36                                              04018000
PSAESTK1 EQU   PSARSVTE+32                                              04019000
PSAPSAV  EQU   PSARSVTE+28                                              04020000
PSAPSTK  EQU   PSARSVTE+24                                              04021000
PSAMSAV  EQU   PSARSVTE+20                                              04022000
PSAMSTK  EQU   PSARSVTE+16                                              04023000
PSASSAV  EQU   PSARSVTE+12                                              04024000
PSASSTK  EQU   PSARSVTE+8                                               04025000
PSANSTK  EQU   PSARSVTE+4                                               04026000
CVTTPIO  EQU   CVTS01+608                                               04027000
CVTADV   EQU   CVTS01+604                                               04028000
CVTGSDAB EQU   CVTGSDA                                                  04029000
CVTQV3   EQU   CVTS01+596                                               04030000
CVTQV2   EQU   CVTS01+592                                               04031000
CVTQV1   EQU   CVTS01+588                                               04032000
CVTRPT   EQU   CVTS01+584                                               04033000
CVTSSRB  EQU   CVTS01+580                                               04034000
CVTCSDRL EQU   CVTS01+576                                               04035000
CVTEXP1  EQU   CVTS01+572                                               04036000
CVTRMPMT EQU   CVTS01+568                                               04037000
CVTRMPTT EQU   CVTS01+564                                               04038000
CVTVPSA  EQU   CVTS01+560                                               04039000
CVTVSTOP EQU   CVTS01+556                                               04040000
CVTGTFR8 EQU   CVTS01+552                                               04041000
CVTQUIT  EQU   CVTS01+548                                               04042000
CVTVACR  EQU   CVTS01+544                                               04043000
CVTWTCB  EQU   CVTS01+540                                               04044000
CVTSTPRS EQU   CVTS01+536                                               04045000
CVT0PT02 EQU   CVTS01+532                                               04046000
CVTDARCM EQU   CVTS01+528                                               04047000
CVTIRECM EQU   CVTS01+524                                               04048000
CVTJRECM EQU   CVTS01+520                                               04049000
CVTVEMS0 EQU   CVTS01+516                                               04050000
CVTSPFRR EQU   CVTS01+512                                               04051000
CVTRLSTG EQU   CVTS01+508                                               04052000
CVT0TC0A EQU   CVTS01+504                                               04053000
CVTGMBR  EQU   CVTS01+500                                               04054000
CVTLFRM  EQU   CVTS01+496                                               04055000
CVTRMBR  EQU   CVTS01+492                                               04056000
CVTVIOP  EQU   CVTS01+488                                               04057000
CVTRV307 EQU   CVTS01+486                                               04058000
CVTRV306 EQU   CVTS01+484                                               04059000
CVTRV305 EQU   CVTS01+482                                               04060000
CVTRV304 EQU   CVTS01+480                                               04061000
CVTRV303 EQU   CVTS01+478                                               04062000
CVTRV302 EQU   CVTS01+476                                               04063000
CVTRV301 EQU   CVTS01+475                                               04064000
CVTRV300 EQU   CVTS01+474                                               04065000
CVTRV299 EQU   CVTS01+473                                               04066000
CVTRV298 EQU   CVTS01+472                                               04067000
CVTRV297 EQU   CVTRV289                                                 04068000
CVTRV296 EQU   CVTRV289                                                 04069000
CVTRV295 EQU   CVTRV289                                                 04070000
CVTRV294 EQU   CVTRV289                                                 04071000
CVTRV293 EQU   CVTRV289                                                 04072000
CVTRV292 EQU   CVTRV289                                                 04073000
CVTRV291 EQU   CVTRV289                                                 04074000
CVTRV290 EQU   CVTRV289                                                 04075000
CVTRV288 EQU   CVTRV280                                                 04076000
CVTRV287 EQU   CVTRV280                                                 04077000
CVTRV286 EQU   CVTRV280                                                 04078000
CVTRV285 EQU   CVTRV280                                                 04079000
CVTRV284 EQU   CVTRV280                                                 04080000
CVTRV283 EQU   CVTRV280                                                 04081000
CVTRV282 EQU   CVTRV280                                                 04082000
CVTRV281 EQU   CVTRV280                                                 04083000
CVTRV279 EQU   CVTRV271                                                 04084000
CVTRV278 EQU   CVTRV271                                                 04085000
CVTRV277 EQU   CVTRV271                                                 04086000
CVTRV276 EQU   CVTRV271                                                 04087000
CVTRV275 EQU   CVTRV271                                                 04088000
CVTRV274 EQU   CVTRV271                                                 04089000
CVTRV273 EQU   CVTRV271                                                 04090000
CVTRV272 EQU   CVTRV271                                                 04091000
CVTRV270 EQU   CVTRV262                                                 04092000
CVTRV269 EQU   CVTRV262                                                 04093000
CVTRV268 EQU   CVTRV262                                                 04094000
CVTRV267 EQU   CVTRV262                                                 04095000
CVTRV266 EQU   CVTRV262                                                 04096000
CVTRV265 EQU   CVTRV262                                                 04097000
CVTRV264 EQU   CVTRV262                                                 04098000
CVTRV263 EQU   CVTRV262                                                 04099000
CVTVFP   EQU   CVTS01+464                                               04100000
CVTVSI   EQU   CVTS01+460                                               04101000
CVTVPSIB EQU   CVTS01+456                                               04102000
CVTMFACT EQU   CVTMFRTR                                                 04103000
CVTMFCTL EQU   CVTS01+448                                               04104000
CVTPVBP  EQU   CVTS01+444                                               04105000
CVTPWI   EQU   CVTS01+440                                               04106000
CVTRV254 EQU   CVTS01+438                                               04107000
CVTRV253 EQU   CVTS01+436                                               04108000
CVTRV252 EQU   CVTS01+434                                               04109000
CVTRV251 EQU   CVTS01+433                                               04110000
CVTRV250 EQU   CVTS01+432                                               04111000
CVTRV249 EQU   CVTS01+431                                               04112000
CVTRV248 EQU   CVTS01+430                                               04113000
CVTRV247 EQU   CVTS01+429                                               04114000
CVTRV246 EQU   CVTS01+428                                               04115000
CVTRV245 EQU   CVTRV237                                                 04116000
CVTRV244 EQU   CVTRV237                                                 04117000
CVTRV243 EQU   CVTRV237                                                 04118000
CVTRV242 EQU   CVTRV237                                                 04119000
CVTRV241 EQU   CVTRV237                                                 04120000
CVTRV240 EQU   CVTRV237                                                 04121000
CVTRV239 EQU   CVTRV237                                                 04122000
CVTRV238 EQU   CVTRV237                                                 04123000
CVTRV236 EQU   CVTRV228                                                 04124000
CVTRV235 EQU   CVTRV228                                                 04125000
CVTRV234 EQU   CVTRV228                                                 04126000
CVTRV233 EQU   CVTRV228                                                 04127000
CVTRV232 EQU   CVTRV228                                                 04128000
CVTRV231 EQU   CVTRV228                                                 04129000
CVTRV230 EQU   CVTRV228                                                 04130000
CVTRV229 EQU   CVTRV228                                                 04131000
CVTRV227 EQU   CVTRV219                                                 04132000
CVTRV226 EQU   CVTRV219                                                 04133000
CVTRV225 EQU   CVTRV219                                                 04134000
CVTRV224 EQU   CVTRV219                                                 04135000
CVTRV223 EQU   CVTRV219                                                 04136000
CVTRV222 EQU   CVTRV219                                                 04137000
CVTRV221 EQU   CVTRV219                                                 04138000
CVTRV220 EQU   CVTRV219                                                 04139000
CVTRV218 EQU   CVTRV210                                                 04140000
CVTRV217 EQU   CVTRV210                                                 04141000
CVTRV216 EQU   CVTRV210                                                 04142000
CVTRV215 EQU   CVTRV210                                                 04143000
CVTRV214 EQU   CVTRV210                                                 04144000
CVTRV213 EQU   CVTRV210                                                 04145000
CVTRV212 EQU   CVTRV210                                                 04146000
CVTRV211 EQU   CVTRV210                                                 04147000
CVTLCCAT EQU   CVTS01+420                                               04148000
CVTPCCAT EQU   CVTS01+416                                               04149000
CVTIPCRP EQU   CVTS01+412                                               04150000
CVTIPCRI EQU   CVTS01+408                                               04151000
CVTIPCDS EQU   CVTS01+404                                               04152000
CVTAIDVT EQU   CVTS01+400                                               04153000
CVTSSAP  EQU   CVTS01+396                                               04154000
CVTEHCIR EQU   CVTS01+392                                               04155000
CVTEHDEF EQU   CVTS01+388                                               04156000
CVTDAIR  EQU   CVTS01+384                                               04157000
CVTPERFM EQU   CVTS01+380                                               04158000
CVT044R2 EQU   CVTS01+376                                               04159000
CVTFETCH EQU   CVTS01+372                                               04160000
CVTRSTWD EQU   CVTS01+368                                               04161000
CVTSPOST EQU   CVTS01+364                                               04162000
CVTIOBP  EQU   CVTS01+360                                               04163000
CVTASMVT EQU   CVTS01+356                                               04164000
CVTRECRQ EQU   CVTS01+352                                               04165000
CVTWSAC  EQU   CVTS01+348                                               04166000
CVTWSAG  EQU   CVTS01+344                                               04167000
CVTWSAL  EQU   CVTS01+340                                               04168000
CVTGLMN  EQU   CVTS01+332                                               04169000
CVTVEAC0 EQU   CVTS01+328                                               04170000
CVT062R1 EQU   CVTS01+324                                               04171000
CVTRPOST EQU   CVTS01+320                                               04172000
CVTDQIQE EQU   CVTS01+316                                               04173000
CVTCSD   EQU   CVTS01+312                                               04174000
CVTLKRMA EQU   CVTS01+308                                               04175000
CVTRSPIE EQU   CVTS01+304                                               04176000
CVTRENQ  EQU   CVTS01+300                                               04177000
CVTLQCB  EQU   CVTS01+296                                               04178000
CVTFQCB  EQU   CVTS01+292                                               04179000
CVTQCS01 EQU   CVTS01+288                                               04180000
CVTAPFT  EQU   CVTS01+284                                               04181000
CVTPARRL EQU   CVTS01+280                                               04182000
CVTVWAIT EQU   CVTS01+276                                               04183000
CVTGSPL  EQU   CVTS01+272                                               04184000
CVTLSMQ  EQU   CVTS01+268                                               04185000
CVTGSMQ  EQU   CVTS01+264                                               04186000
CVTEXPRO EQU   CVTS01+260                                               04187000
CVTOPCTP EQU   CVTS01+256                                               04188000
CVTSIC   EQU   CVTS01+252                                               04189000
CVTTPIOS EQU   CVTS01+248                                               04190000
CVTRTMS  EQU   CVTS01+244                                               04191000
CVTSDBF  EQU   CVTS01+240                                               04192000
CVTSCBP  EQU   CVTS01+236                                               04193000
CVTSDMP  EQU   CVTS01+232                                               04194000
CVTSV60  EQU   CVTS01+228                                               04195000
CVTRTMCT EQU   CVTS01+224                                               04196000
CVTASCBL EQU   CVTS01+220                                               04197000
CVTASCBH EQU   CVTS01+216                                               04198000
CVTGDA   EQU   CVTS01+212                                               04199000
CVTASVT  EQU   CVTS01+208                                               04200000
CVTVVMDI EQU   CVTS01+204                                               04201000
CVTAQTOP EQU   CVTS01+200                                               04202000
CVTIOSCS EQU   CVTS01+196                                               04203000
CVTSDRM  EQU   CVTS01+192                                               04204000
CVTOPTE  EQU   CVTS01+188                                               04205000
CVTSTXU  EQU   CVTS01+184                                               04206000
CVTQUIS  EQU   CVTS01+180                                               04207000
CVTPARS  EQU   CVTS01+176                                               04208000
CVTS1EE  EQU   CVTS01+172                                               04209000
CVTFRAS  EQU   CVTS01+168                                               04210000
CVTQSAS  EQU   CVTS01+164                                               04211000
CVTCRAS  EQU   CVTS01+160                                               04212000
CVTCRMN  EQU   CVTS01+156                                               04213000
CVTDELCP EQU   CVTS01+152                                               04214000
CVTFRECL EQU   CVTS01+148                                               04215000
CVTGETCL EQU   CVTS01+144                                               04216000
CVTBLDCP EQU   CVTS01+140                                               04217000
CVTAUTHL EQU   CVTS01+136                                               04218000
CVTSCAN  EQU   CVTS01+132                                               04219000
CVTRV144 EQU   CVTS01+130                                               04220000
CVTMAXMP EQU   CVTS01+128                                               04221000
CVTSTCK  EQU   CVTS01+124                                               04222000
CVTRV139 EQU   CVTS01+123                                               04223000
CVTDSSAC EQU   CVTS01+122                                               04224000
CVTRV513 EQU   CVTS01+121                                               04225000
CVTIOSPL EQU   CVTS01+120                                               04226000
CVTPTGT  EQU   CVTS01+116                                               04227000
CVTCSPIE EQU   CVTS01+112                                               04228000
CVTSMFEX EQU   CVTS01+108                                               04229000
CVTOLT0A EQU   CVTS01+104                                               04230000
CVTSRBRT EQU   CVTS01+100                                               04231000
CVTPUTL  EQU   CVTS01+96                                                04232000
CVTSYSWT EQU   CVTS01+92                                                04233000
CVTRV327 EQU   CVTS01+88                                                04234000
CVTRV326 EQU   CVTS01+84                                                04235000
CVTRV325 EQU   CVTS01+80                                                04236000
CVTRV324 EQU   CVTS01+76                                                04237000
CVT0VL01 EQU   CVTS01+72                                                04238000
CVTSHRVM EQU   CVTS01+68                                                04239000
CVTRV332 EQU   CVTS01+64                                                04240000
CVTTAS   EQU   CVTS01+60                                                04241000
CVTRSCN  EQU   CVTS01+56                                                04242000
CVTTRAC2 EQU   CVTS01+54                                                04243000
CVTTRACE EQU   CVTS01+52                                                04244000
CVTAPG   EQU   CVTS01+51                                                04245000
CVTSDTRC EQU   CVTCTLFG                                                 04246000
CVTGTRCE EQU   CVTCTLFG                                                 04247000
CVTNOMP  EQU   CVTCTLFG                                                 04248000
CVTRSV79 EQU   CVTCTLFG                                                 04249000
CVTDSTAT EQU   CVTCTLFG                                                 04250000
CVTRSV78 EQU   CVTCTLFG                                                 04251000
CVTRV333 EQU   CVTCTLFG                                                 04252000
CVTRV323 EQU   CVTCTLFG                                                 04253000
CVTSPVLK EQU   CVTS01+49                                                04254000
CVTRSV77 EQU   CVTS01+48                                                04255000
CVTRV331 EQU   CVTS01+44                                                04256000
CVTRV330 EQU   CVTS01+40                                                04257000
CVTRV329 EQU   CVTS01+36                                                04258000
CVTRV328 EQU   CVTS01+32                                                04259000
CVTRV322 EQU   CVTS01+28                                                04260000
CVTSLID  EQU   CVTSLIDA+1                                               04261000
CVTSYLK  EQU   CVTSLIDA                                                 04262000
CVTRV321 EQU   CVTS01+20                                                04263000
CVTRV320 EQU   CVTS01+16                                                04264000
CVTLPDIR EQU   CVTLPDIA+1                                               04265000
CVTRSV69 EQU   CVTDIRST                                                 04266000
CVTRSV68 EQU   CVTDIRST                                                 04267000
CVTRSV67 EQU   CVTDIRST                                                 04268000
CVTRSV66 EQU   CVTDIRST                                                 04269000
CVTRSV65 EQU   CVTDIRST                                                 04270000
CVTRSV64 EQU   CVTDIRST                                                 04271000
CVTRSV63 EQU   CVTDIRST                                                 04272000
CVTDICOM EQU   CVTDIRST                                                 04273000
CVTPVTP  EQU   CVTS01+8                                                 04274000
CVTLPDSR EQU   CVTS01+4                                                 04275000
CVTGETL  EQU   CVTS01                                                   04276000
DEBEXPTA EQU   DEBEXPT+1                                                04277000
DEBRSV12 EQU   DEBRPSID                                                 04278000
DEBRSV11 EQU   DEBRPSID                                                 04279000
DEBRSV10 EQU   DEBRPSID                                                 04280000
DEBRSV09 EQU   DEBRPSID                                                 04281000
DEBRPSAP EQU   DEBRPSID                                                 04282000
DEBRPSO  EQU   DEBRPSID                                                 04283000
DEBRPSI  EQU   DEBRPSID                                                 04284000
DEBRPSP  EQU   DEBRPSID                                                 04285000
DEBFOEB  EQU   DEBFOEAD+1                                               04286000
DEBNOEE  EQU   DEBFOEAD                                                 04287000
DEBFPEB  EQU   DEBFPEAD+1                                               04288000
DEBNPEE  EQU   DEBFPEAD                                                 04289000
DEBFIEB  EQU   DEBFIEAD+1                                               04290000
DEBNIEE  EQU   DEBFIEAD                                                 04291000
DEBWDCBA EQU   DEBWDCB+1                                                04292000
DEBRSV08 EQU   DEBWDCB                                                  04293000
DEBPDCBA EQU   DEBPDCB+1                                                04294000
DEBRSV07 EQU   DEBPDCB                                                  04295000
DEBRDCBA EQU   DEBRDCB+1                                                04296000
DEBRSV06 EQU   DEBRDCB                                                  04297000
DEBSUCBB EQU   DEBSUCBA+1                                               04298000
DEBSDVM  EQU   DEBSUCBA                                                 04299000
CVTLEVL  EQU   CVTRELNO+2                                               04300000
CVTNUMB  EQU   CVTRELNO                                                 04301000
CVTMDL   EQU   CVTFIX+250                                               04302000
@NM00018 EQU   CVTFIX+248                                               04303000
@NM00017 EQU   CVTFIX                                                   04304000
CVTRV482 EQU   CVTXTNT2+128                                             04305000
CVTRV481 EQU   CVTXTNT2+124                                             04306000
CVTRV480 EQU   CVTXTNT2+120                                             04307000
CVTRV479 EQU   CVTXTNT2+118                                             04308000
CVTRV478 EQU   CVTXTNT2+117                                             04309000
CVTRV477 EQU   CVTXTNT2+116                                             04310000
CVTRV476 EQU   CVTXTNT2+115                                             04311000
CVTRV475 EQU   CVTXTNT2+114                                             04312000
CVTRV474 EQU   CVTRV466                                                 04313000
CVTRV473 EQU   CVTRV466                                                 04314000
CVTRV472 EQU   CVTRV466                                                 04315000
CVTRV471 EQU   CVTRV466                                                 04316000
CVTRV470 EQU   CVTRV466                                                 04317000
CVTRV469 EQU   CVTRV466                                                 04318000
CVTRV468 EQU   CVTRV466                                                 04319000
CVTRV467 EQU   CVTRV466                                                 04320000
CVTRV465 EQU   CVTRV457                                                 04321000
CVTRV464 EQU   CVTRV457                                                 04322000
CVTRV463 EQU   CVTRV457                                                 04323000
CVTRV462 EQU   CVTRV457                                                 04324000
CVTRV461 EQU   CVTRV457                                                 04325000
CVTRV460 EQU   CVTRV457                                                 04326000
CVTRV459 EQU   CVTRV457                                                 04327000
CVTRV458 EQU   CVTRV457                                                 04328000
CVTRV456 EQU   CVTXTNT2+108                                             04329000
CVTRV455 EQU   CVTXTNT2+104                                             04330000
CVTRV454 EQU   CVTXTNT2+100                                             04331000
CVTRV453 EQU   CVTXTNT2+96                                              04332000
CVTRV452 EQU   CVTXTNT2+94                                              04333000
CVTRV451 EQU   CVTXTNT2+92                                              04334000
CVTRV450 EQU   CVTXTNT2+90                                              04335000
CVTRV449 EQU   CVTXTNT2+88                                              04336000
CVTRV448 EQU   CVTXTNT2+87                                              04337000
CVTRV447 EQU   CVTXTNT2+86                                              04338000
CVTRV446 EQU   CVTRV438                                                 04339000
CVTRV445 EQU   CVTRV438                                                 04340000
CVTRV444 EQU   CVTRV438                                                 04341000
CVTRV443 EQU   CVTRV438                                                 04342000
CVTRV442 EQU   CVTRV438                                                 04343000
CVTRV441 EQU   CVTRV438                                                 04344000
CVTRV440 EQU   CVTRV438                                                 04345000
CVTRV439 EQU   CVTRV438                                                 04346000
CVTRV437 EQU   CVTRV429                                                 04347000
CVTRV436 EQU   CVTRV429                                                 04348000
CVTRV435 EQU   CVTRV429                                                 04349000
CVTRV434 EQU   CVTRV429                                                 04350000
CVTRV433 EQU   CVTRV429                                                 04351000
CVTRV432 EQU   CVTRV429                                                 04352000
CVTRV431 EQU   CVTRV429                                                 04353000
CVTRV430 EQU   CVTRV429                                                 04354000
CVTRV428 EQU   CVTXTNT2+80                                              04355000
CVTRV427 EQU   CVTXTNT2+76                                              04356000
CVTRV426 EQU   CVTXTNT2+72                                              04357000
CVTRV425 EQU   CVTXTNT2+68                                              04358000
CVTATACT EQU   CVTATCVT                                                 04359000
CVTRV423 EQU   CVTXTNT2+62                                              04360000
CVTRV422 EQU   CVTXTNT2+60                                              04361000
CVTRV421 EQU   CVTXTNT2+58                                              04362000
CVTRV420 EQU   CVTXTNT2+56                                              04363000
CVTRV419 EQU   CVTXTNT2+55                                              04364000
CVTRV418 EQU   CVTXTNT2+54                                              04365000
CVTRV417 EQU   CVTRV409                                                 04366000
CVTRV416 EQU   CVTRV409                                                 04367000
CVTRV415 EQU   CVTRV409                                                 04368000
CVTRV414 EQU   CVTRV409                                                 04369000
CVTRV413 EQU   CVTRV409                                                 04370000
CVTRV412 EQU   CVTRV409                                                 04371000
CVTRV411 EQU   CVTRV409                                                 04372000
CVTRV410 EQU   CVTRV409                                                 04373000
CVTRV408 EQU   CVTRV400                                                 04374000
CVTRV407 EQU   CVTRV400                                                 04375000
CVTRV406 EQU   CVTRV400                                                 04376000
CVTRV405 EQU   CVTRV400                                                 04377000
CVTRV404 EQU   CVTRV400                                                 04378000
CVTRV403 EQU   CVTRV400                                                 04379000
CVTRV402 EQU   CVTRV400                                                 04380000
CVTRV401 EQU   CVTRV400                                                 04381000
CVTRSVA1 EQU   CVTXTNT2+48                                              04382000
CVTRSVA0 EQU   CVTXTNT2+44                                              04383000
CVTRSV99 EQU   CVTXTNT2+40                                              04384000
CVTRSV98 EQU   CVTXTNT2+36                                              04385000
CVTRSV97 EQU   CVTXTNT2+34                                              04386000
CVTRSV96 EQU   CVTXTNT2+32                                              04387000
CVTOLTEP EQU   CVTXTNT2+28                                              04388000
CVTQIDA  EQU   CVTQID+1                                                 04389000
CVTRSV95 EQU   CVTQID                                                   04390000
CVTRSV94 EQU   CVTXTNT2+20                                              04391000
CVTRSV93 EQU   CVTXTNT2+16                                              04392000
CVTRSV92 EQU   CVTXTNT2+12                                              04393000
CVTDEBVR EQU   CVTXTNT2+8                                               04394000
CVTRSV91 EQU   CVTXTNT2+6                                               04395000
CVTRSV9H EQU   CVTRSV90                                                 04396000
CVTRSV9G EQU   CVTRSV90                                                 04397000
CVTRSV9F EQU   CVTRSV90                                                 04398000
CVTRSV9E EQU   CVTRSV90                                                 04399000
CVTRSV9D EQU   CVTRSV90                                                 04400000
CVTRSV9C EQU   CVTRSV90                                                 04401000
CVTRSV9B EQU   CVTRSV90                                                 04402000
CVTRSV9A EQU   CVTRSV90                                                 04403000
CVTNUCLS EQU   CVTXTNT2+4                                               04404000
CVTDSSVA EQU   CVTDSSV+1                                                04405000
CVTRSV89 EQU   CVTDSSV                                                  04406000
CVTRSV88 EQU   CVTXTNT1+8                                               04407000
CVTRSV87 EQU   CVTXTNT1+4                                               04408000
CVTFACHN EQU   CVTXTNT1                                                 04409000
CVTRV488 EQU   CVTMAP+412                                               04410000
CVTRV487 EQU   CVTMAP+408                                               04411000
CVTRV486 EQU   CVTMAP+404                                               04412000
CVTRV485 EQU   CVTMAP+400                                               04413000
CVTRV484 EQU   CVTMAP+396                                               04414000
CVTAUTH  EQU   CVTMAP+392                                               04415000
CVTATMCA EQU   CVTATMCT+1                                               04416000
CVTATMST EQU   CVTATMCT                                                 04417000
CVTRSV61 EQU   CVTMAP+384                                               04418000
CVTVOLT1 EQU   CVTVOLM1+1                                               04419000
CVTVOLI1 EQU   CVTVOLF1                                                 04420000
CVTSTOA  EQU   CVTMAP+376                                               04421000
CVTRSV58 EQU   CVTMAP+374                                               04422000
CVTRSV57 EQU   CVTMAP+372                                               04423000
CVTDDCE  EQU   CVTMAP+368                                               04424000
CVTPNWFR EQU   CVTMAP+364                                               04425000
CVTSMF   EQU   CVTMAP+360                                               04426000
CVTSULK  EQU   CVTMAP+358                                               04427000
CVTSLKO  EQU   CVTSYSK                                                  04428000
CVTSLKP  EQU   CVTSYSK                                                  04429000
CVTSLKQ  EQU   CVTSYSK                                                  04430000
CVTSLKR  EQU   CVTSYSK                                                  04431000
CVTRSV56 EQU   CVTSYSK                                                  04432000
CVTRSV55 EQU   CVTSYSK                                                  04433000
CVTRSV54 EQU   CVTSYSK                                                  04434000
CVTRSV53 EQU   CVTSYSK                                                  04435000
CVTRSV52 EQU   CVTA1F1                                                  04436000
CVTRSV51 EQU   CVTA1F1                                                  04437000
CVTRSV50 EQU   CVTA1F1                                                  04438000
CVTRSV49 EQU   CVTA1F1                                                  04439000
CVTRSV48 EQU   CVTA1F1                                                  04440000
CVTRSV47 EQU   CVTA1F1                                                  04441000
CVTSRSW  EQU   CVTA1F1                                                  04442000
CVTPFSW  EQU   CVTA1F1                                                  04443000
CVTPCVT  EQU   CVTMAP+352                                               04444000
CVTRSV46 EQU   CVTMAP+344                                               04445000
CVTRSV45 EQU   CVTMAP+340                                               04446000
CVTRSV44 EQU   CVTMAP+338                                               04447000
CVTRSV43 EQU   CVTMAP+336                                               04448000
CVTHJESA EQU   CVTHJES+1                                                04449000
CVTRSV42 EQU   CVTHJES                                                  04450000
CVTEXT2A EQU   CVTEXT2+1                                                04451000
CVTRSV41 EQU   CVTEXT2                                                  04452000
CVTAPFA  EQU   CVTAPF+1                                                 04453000
CVTRSV40 EQU   CVTAPF                                                   04454000
CVTINTLA EQU   CVTMAP+320                                               04455000
CVTERPV  EQU   CVTMAP+316                                               04456000
CVTEORM  EQU   CVTMAP+312                                               04457000
CVTMCHPR EQU   CVTMAP+308                                               04458000
CVTTZ    EQU   CVTMAP+304                                               04459000
CVTJEPS  EQU   CVTMAP+300                                               04460000
CVTJESCT EQU   CVTMAP+296                                               04461000
CVTMODE  EQU   CVTMAP+292                                               04462000
CVTPTRV  EQU   CVTMAP+288                                               04463000
CVTREAL  EQU   CVTMAP+284                                               04464000
CVTRSV39 EQU   CVTMAP+280                                               04465000
CVTRSV38 EQU   CVTMAP+276                                               04466000
CVTDMSRA EQU   CVTDMSR+1                                                04467000
CVTRSV37 EQU   CVTDMSR                                                  04468000
CVTQMSGA EQU   CVTQMSG+1                                                04469000
CVTRSV36 EQU   CVTQMSG                                                  04470000
CVTAMFF  EQU   CVTMAP+264                                               04471000
CVTPURGA EQU   CVTPURG+1                                                04472000
CVTRSV35 EQU   CVTPURG                                                  04473000
CVTCBSP  EQU   CVTMAP+256                                               04474000
CVTATERA EQU   CVTATER+1                                                04475000
CVTSYST  EQU   CVTATER                                                  04476000
CVTVOLT2 EQU   CVTTAT                                                   04477000
CVTVOLI2 EQU   CVTVOLF2                                                 04478000
CVTAQAVB EQU   CVTAQAVT+1                                               04479000
CVTRSV34 EQU   CVTTCMFG                                                 04480000
CVTRSV33 EQU   CVTTCMFG                                                 04481000
CVTRSV32 EQU   CVTTCMFG                                                 04482000
CVTRSV31 EQU   CVTTCMFG                                                 04483000
CVTRSV30 EQU   CVTTCMFG                                                 04484000
CVTRSV29 EQU   CVTTCMFG                                                 04485000
CVTRSV28 EQU   CVTTCMFG                                                 04486000
CVTTCRDY EQU   CVTTCMFG                                                 04487000
CVTGTFA  EQU   CVTGTF+1                                                 04488000
CVTRSV27 EQU   CVTGTFST                                                 04489000
CVTRNIO  EQU   CVTGTFST                                                 04490000
CVTRV319 EQU   CVTUSR                                                   04491000
CVTRV318 EQU   CVTFORM                                                  04492000
CVTRV317 EQU   CVTTMODE                                                 04493000
CVTRV316 EQU   CVTSTATE                                                 04494000
CVTRV315 EQU   CVTGTFS                                                  04495000
CVTGTFAV EQU   CVTGTFS                                                  04496000
CVT0SCR1 EQU   CVTMAP+232                                               04497000
CVTRV515 EQU   CVTMAP+228                                               04498000
CVTRMS   EQU   CVTMAP+224                                               04499000
CVTPATCH EQU   CVTMAP+220                                               04500000
CVTTSCE  EQU   CVTMAP+216                                               04501000
CVTLNKSC EQU   CVTMAP+214                                               04502000
CVTQABST EQU   CVTMAP+212                                               04503000
CVTMDLDS EQU   CVTMAP+208                                               04504000
CVTUSER  EQU   CVTMAP+204                                               04505000
CVTABEND EQU   CVTMAP+200                                               04506000
CVTSMCA  EQU   CVTMAP+196                                               04507000
CVTRSV18 EQU   CVTMAP+192                                               04508000
CVTQLPAQ EQU   CVTMAP+188                                               04509000
CVTQCDSR EQU   CVTMAP+184                                               04510000
CVTRSV17 EQU   CVTOPTB                                                  04511000
CVTRSV16 EQU   CVTOPTB                                                  04512000
CVTFP    EQU   CVTOPTB                                                  04513000
CVTAPTHR EQU   CVTOPTB                                                  04514000
CVTNLOG  EQU   CVTOPTB                                                  04515000
CVTTOD   EQU   CVTOPTB                                                  04516000
CVTCTIMS EQU   CVTOPTB                                                  04517000
CVTPROT  EQU   CVTOPTB                                                  04518000
CVTXPFP  EQU   CVTOPTA                                                  04519000
CVTASCII EQU   CVTOPTA                                                  04520000
CVTRSV13 EQU   CVTOPTA                                                  04521000
CVTRSV12 EQU   CVTOPTA                                                  04522000
CVTNIP   EQU   CVTOPTA                                                  04523000
CVTDDR   EQU   CVTOPTA                                                  04524000
CVTAPR   EQU   CVTOPTA                                                  04525000
CVTCCH   EQU   CVTOPTA                                                  04526000
CVTSNCTR EQU   CVTMAP+180                                               04527000
CVTQMWR  EQU   CVTMAP+176                                               04528000
CVTQOCR  EQU   CVTMAP+172                                               04529000
CVT1EF00 EQU   CVTMAP+168                                               04530000
CVTMZ00  EQU   CVTMAP+164                                               04531000
CVTHEAD  EQU   CVTMAP+160                                               04532000
CVTRSV11 EQU   CVTMAP+156                                               04533000
CVT0PT01 EQU   CVTMAP+152                                               04534000
CVTMSER  EQU   CVTMAP+148                                               04535000
CVTIERLC EQU   CVTMAP+144                                               04536000
CVTILCH  EQU   CVTMAP+140                                               04537000
CVT0DS   EQU   CVTMAP+136                                               04538000
CVTFBOSV EQU   CVTMAP+132                                               04539000
CVTNUCB  EQU   CVTMAP+128                                               04540000
CVTIXAVL EQU   CVTMAP+124                                               04541000
CVTIOQET EQU   CVTMAP+120                                               04542000
CVTDCBA  EQU   CVTMAP+117                                               04543000
CVTMVS2  EQU   CVTDCB                                                   04544000
CVT6DAT  EQU   CVTDCB                                                   04545000
CVT4MPS  EQU   CVTDCB                                                   04546000
CVTRSV09 EQU   CVTDCB                                                   04547000
CVT4MS1  EQU   CVTDCB                                                   04548000
CVT2SPS  EQU   CVTDCB                                                   04549000
CVT1SSS  EQU   CVTDCB                                                   04550000
CVTRSV08 EQU   CVTDCB                                                   04551000
CVTSTB   EQU   CVTMAP+112                                               04552000
CVTQTD00 EQU   CVTMAP+108                                               04553000
CVTQTE00 EQU   CVTMAP+104                                               04554000
CVTCUCB  EQU   CVTMAP+100                                               04555000
CVTSJQ   EQU   CVTMAP+96                                                04556000
CVTPBLDL EQU   CVTMAP+92                                                04557000
CVTTPC   EQU   CVTMAP+88                                                04558000
CVTSVDCB EQU   CVTMAP+84                                                04559000
CVTBRET  EQU   CVTMAP+82                                                04560000
CVTEXIT  EQU   CVTMAP+80                                                04561000
CVT0FN00 EQU   CVTMAP+76                                                04562000
CVTDARA  EQU   CVTDAR+1                                                 04563000
CVTRSV07 EQU   CVTFLGS1                                                 04564000
CVTRSV06 EQU   CVTFLGS1                                                 04565000
CVTRSV05 EQU   CVTFLGS1                                                 04566000
CVTRSV04 EQU   CVTFLGS1                                                 04567000
CVTRSV03 EQU   CVTFLGS1                                                 04568000
CVTRSV02 EQU   CVTFLGS1                                                 04569000
CVTRSV01 EQU   CVTFLGS1                                                 04570000
CVTDMPLK EQU   CVTFLGS1                                                 04571000
CVTXITP  EQU   CVTMAP+68                                                04572000
CVTZDTAB EQU   CVTMAP+64                                                04573000
CVTMSLT  EQU   CVTMAP+60                                                04574000
CVTDATE  EQU   CVTMAP+56                                                04575000
CVTBTERM EQU   CVTMAP+52                                                04576000
CVTSYSAD EQU   CVTMAP+48                                                04577000
CVTXTLER EQU   CVTMAP+44                                                04578000
CVTILK2  EQU   CVTMAP+40                                                04579000
CVTILK1  EQU   CVTMAP+36                                                04580000
CVTPRLTV EQU   CVTMAP+32                                                04581000
CVTPCNVT EQU   CVTMAP+28                                                04582000
CVT0VL00 EQU   CVTMAP+24                                                04583000
CVTXAPG  EQU   CVTMAP+20                                                04584000
CVTBUF   EQU   CVTMAP+16                                                04585000
CVTJOB   EQU   CVTMAP+12                                                04586000
CVTLINK  EQU   CVTMAP+8                                                 04587000
CVT0EF00 EQU   CVTMAP+4                                                 04588000
CVTTCBP  EQU   CVTMAP                                                   04589000
CVT      EQU   CVTMAP                                                   04590000
LCCAR125 EQU   LCCA+964                                                 04591000
LCCAR124 EQU   LCCA+960                                                 04592000
LCCAR123 EQU   LCCA+956                                                 04593000
LCCAR122 EQU   LCCA+952                                                 04594000
LCCAR121 EQU   LCCA+948                                                 04595000
LCCAR120 EQU   LCCA+944                                                 04596000
LCCAR119 EQU   LCCA+940                                                 04597000
LCCAR118 EQU   LCCA+936                                                 04598000
LCCAR117 EQU   LCCA+932                                                 04599000
LCCAR116 EQU   LCCA+928                                                 04600000
LCCAR115 EQU   LCCA+924                                                 04601000
LCCAR114 EQU   LCCA+920                                                 04602000
LCCAR113 EQU   LCCA+916                                                 04603000
LCCAR112 EQU   LCCA+912                                                 04604000
LCCAR111 EQU   LCCA+908                                                 04605000
LCCAR110 EQU   LCCA+904                                                 04606000
LCCAR109 EQU   LCCA+900                                                 04607000
LCCAR108 EQU   LCCA+896                                                 04608000
LCCADRT2 EQU   LCCA+888                                                 04609000
LCCADRT1 EQU   LCCA+880                                                 04610000
LCCAR103 EQU   LCCA+876                                                 04611000
LCCAESS2 EQU   LCCA+872                                                 04612000
LCCASPLJ EQU   LCCA+868                                                 04613000
LCCASMQJ EQU   LCCA+864                                                 04614000
LCCAIRT  EQU   LCCA+736                                                 04615000
LCCARV90 EQU   LCCA+732                                                 04616000
LCCARV89 EQU   LCCA+728                                                 04617000
LCCAPGTA EQU   LCCASRBF+2                                               04618000
LCCASAFN EQU   LCCASRBF                                                 04619000
LCCAECSA EQU   LCCA+716                                                 04620000
LCCAICR0 EQU   LCCA+712                                                 04621000
LCCALWTM EQU   LCCA+704                                                 04622000
LCCARV78 EQU   LCCA+700                                                 04623000
LCCAPINV EQU   LCCA+696                                                 04624000
LCCARV88 EQU   LCCA+695                                                 04625000
LCCARV87 EQU   LCCALKFG                                                 04626000
LCCARV86 EQU   LCCALKFG                                                 04627000
LCCARV85 EQU   LCCALKFG                                                 04628000
LCCARV84 EQU   LCCALKFG                                                 04629000
LCCALKRD EQU   LCCALKFG                                                 04630000
LCCALKAQ EQU   LCCALKFG                                                 04631000
LCCALKSA EQU   LCCALKFG                                                 04632000
LCCALKDP EQU   LCCALKFG                                                 04633000
LCCACRST EQU   LCCACREX                                                 04634000
LCCACRDP EQU   LCCACREX                                                 04635000
LCCACRLM EQU   LCCACREX                                                 04636000
LCCACRIN EQU   LCCACREX                                                 04637000
LCCACRRT EQU   LCCACREX                                                 04638000
LCCACRLE EQU   LCCACREX                                                 04639000
LCCACRRM EQU   LCCACREX                                                 04640000
LCCACREF EQU   LCCACREX                                                 04641000
LCCAVARY EQU   LCCACRFL                                                 04642000
LCCARV73 EQU   LCCACRFL                                                 04643000
LCCARV72 EQU   LCCACRFL                                                 04644000
LCCARV71 EQU   LCCACRFL                                                 04645000
LCCARV70 EQU   LCCACRFL                                                 04646000
LCCARV69 EQU   LCCACRFL                                                 04647000
LCCACLMS EQU   LCCACRFL                                                 04648000
LCCACRTM EQU   LCCACRFL                                                 04649000
LCCALCR0 EQU   LCCA+688                                                 04650000
LCCACRLC EQU   LCCA+684                                                 04651000
LCCARCPU EQU   LCCA+680                                                 04652000
LCCADCPU EQU   LCCA+676                                                 04653000
LCCASRBJ EQU   LCCA+672                                                 04654000
LCCADSSR EQU   LCCA+668                                                 04655000
LCCADSSC EQU   LCCA+660                                                 04656000
LCCADSS3 EQU   LCCA+648                                                 04657000
LCCADSS2 EQU   LCCA+636                                                 04658000
LCCADSS1 EQU   LCCA+624                                                 04659000
LCCAWTIM EQU   LCCA+616                                                 04660000
LCCAITOD EQU   LCCA+608                                                 04661000
LCCADTOD EQU   LCCA+600                                                 04662000
LCCASTOD EQU   LCCA+592                                                 04663000
LCCARIR5 EQU   LCCASPSA+44                                              04664000
LCCARIR4 EQU   LCCASPSA+40                                              04665000
LCCARIR3 EQU   LCCASPSA+36                                              04666000
LCCARIR2 EQU   LCCASPSA+32                                              04667000
LCCARPR5 EQU   LCCASPSA+28                                              04668000
LCCARPR4 EQU   LCCASPSA+24                                              04669000
LCCARPR3 EQU   LCCASPSA+20                                              04670000
LCCARPR2 EQU   LCCASPSA+16                                              04671000
LCCADSR5 EQU   LCCASPSA+12                                              04672000
LCCADSR4 EQU   LCCASPSA+8                                               04673000
LCCADSR3 EQU   LCCASPSA+4                                               04674000
LCCADSR2 EQU   LCCASPSA                                                 04675000
LCCARV68 EQU   LCCA+543                                                 04676000
LCCAPSMK EQU   LCCA+542                                                 04677000
LCCARV67 EQU   LCCADSF2                                                 04678000
LCCARV66 EQU   LCCADSF2                                                 04679000
LCCARV65 EQU   LCCADSF2                                                 04680000
LCCARV64 EQU   LCCADSF2                                                 04681000
LCCADSRW EQU   LCCADSF2                                                 04682000
LCCADSPL EQU   LCCADSF2                                                 04683000
LCCAGSRB EQU   LCCADSF2                                                 04684000
LCCASRBM EQU   LCCADSF2                                                 04685000
LCCARV61 EQU   LCCADSF1                                                 04686000
LCCARV60 EQU   LCCADSF1                                                 04687000
LCCARV59 EQU   LCCADSF1                                                 04688000
LCCARV58 EQU   LCCADSF1                                                 04689000
LCCATIMR EQU   LCCADSF1                                                 04690000
LCCADSS  EQU   LCCADSF1                                                 04691000
LCCAVCPU EQU   LCCADSF1                                                 04692000
LCCAACR  EQU   LCCADSF1                                                 04693000
LCCAASCP EQU   LCCA+532                                                 04694000
LCCAESSA EQU   LCCA+528                                                 04695000
LCCARV55 EQU   LCCASPN4                                                 04696000
LCCARV54 EQU   LCCASPN4                                                 04697000
LCCARV53 EQU   LCCASPN4                                                 04698000
LCCARV52 EQU   LCCASPN4                                                 04699000
LCCARV51 EQU   LCCASPN4                                                 04700000
LCCARV50 EQU   LCCASPN4                                                 04701000
LCCARV49 EQU   LCCASPN4                                                 04702000
LCCARV48 EQU   LCCASPN4                                                 04703000
LCCARV47 EQU   LCCASPN3                                                 04704000
LCCARV46 EQU   LCCASPN3                                                 04705000
LCCARV45 EQU   LCCASPN3                                                 04706000
LCCARV44 EQU   LCCASPN3                                                 04707000
LCCARV43 EQU   LCCASPN3                                                 04708000
LCCARV42 EQU   LCCASPN3                                                 04709000
LCCARV41 EQU   LCCASPN3                                                 04710000
LCCARV40 EQU   LCCASPN3                                                 04711000
LCCARV39 EQU   LCCASPN2                                                 04712000
LCCARV38 EQU   LCCASPN2                                                 04713000
LCCARV37 EQU   LCCASPN2                                                 04714000
LCCARV36 EQU   LCCASPN2                                                 04715000
LCCARV35 EQU   LCCASPN2                                                 04716000
LCCARV34 EQU   LCCASPN2                                                 04717000
LCCARV33 EQU   LCCASPN2                                                 04718000
LCCARV32 EQU   LCCASPN2                                                 04719000
LCCARV31 EQU   LCCASPN1                                                 04720000
LCCARV30 EQU   LCCASPN1                                                 04721000
LCCAMFIO EQU   LCCASPN1                                                 04722000
LCCARSTR EQU   LCCASPN1                                                 04723000
LCCATSPN EQU   LCCASPN1                                                 04724000
LCCALOCK EQU   LCCASPN1                                                 04725000
LCCASIGP EQU   LCCASPN1                                                 04726000
LCCAPTLB EQU   LCCASPN1                                                 04727000
LCCARV27 EQU   LCCAIHR4                                                 04728000
LCCARV26 EQU   LCCAIHR4                                                 04729000
LCCARV25 EQU   LCCAIHR4                                                 04730000
LCCARV24 EQU   LCCAIHR4                                                 04731000
LCCARV23 EQU   LCCAIHR4                                                 04732000
LCCARV22 EQU   LCCAIHR4                                                 04733000
LCCARV21 EQU   LCCAIHR4                                                 04734000
LCCARV20 EQU   LCCAIHR4                                                 04735000
LCCARV19 EQU   LCCAIHR3                                                 04736000
LCCARV18 EQU   LCCAIHR3                                                 04737000
LCCARV17 EQU   LCCAIHR3                                                 04738000
LCCARV16 EQU   LCCAIHR3                                                 04739000
LCCARV15 EQU   LCCAIHR3                                                 04740000
LCCARV14 EQU   LCCAIHR3                                                 04741000
LCCARV13 EQU   LCCAIHR3                                                 04742000
LCCARV12 EQU   LCCAIHR3                                                 04743000
LCCARV11 EQU   LCCAIHR2                                                 04744000
LCCARV10 EQU   LCCAIHR2                                                 04745000
LCCARV09 EQU   LCCAIHR2                                                 04746000
LCCARV08 EQU   LCCAIHR2                                                 04747000
LCCARV07 EQU   LCCAIHR2                                                 04748000
LCCARV06 EQU   LCCAIHR2                                                 04749000
LCCARV05 EQU   LCCAIHR2                                                 04750000
LCCARV04 EQU   LCCAIHR2                                                 04751000
LCCARV03 EQU   LCCAIHR1                                                 04752000
LCCARV02 EQU   LCCAIHR1                                                 04753000
LCCARV01 EQU   LCCAIHR1                                                 04754000
LCCAPPIE EQU   LCCAIHR1                                                 04755000
LCCAPSG1 EQU   LCCAIHR1                                                 04756000
LCCAPDAT EQU   LCCAIHR1                                                 04757000
LCCAXRC2 EQU   LCCAIHR1                                                 04758000
LCCAXRC1 EQU   LCCAIHR1                                                 04759000
LCCAIOPS EQU   LCCA+512                                                 04760000
LCCAGPGR EQU   LCCA+448                                                 04761000
LCCARSFP EQU   LCCA+416                                                 04762000
LCCARSGR EQU   LCCA+352                                                 04763000
LCCAXGR3 EQU   LCCA+288                                                 04764000
LCCAXGR2 EQU   LCCA+224                                                 04765000
LCCAXGR1 EQU   LCCA+160                                                 04766000
LCCACR0  EQU   LCCA+156                                                 04767000
LCCAMCR1 EQU   LCCA+152                                                 04768000
LCCAPVAD EQU   LCCA+148                                                 04769000
LCCAPINT EQU   LCCA+144                                                 04770000
LCCAPPSW EQU   LCCA+136                                                 04771000
LCCAPGR2 EQU   LCCA+72                                                  04772000
LCCAPGR1 EQU   LCCA+8                                                   04773000
LCCARV77 EQU   LCCA+6                                                   04774000
LCCACPUA EQU   LCCA+4                                                   04775000
LCCALCCA EQU   LCCA                                                     04776000
WSACCCH  EQU   WSAC+52                                                  04777000
WSACRRSA EQU   WSAC+48                                                  04778000
WSACREST EQU   WSAC+44                                                  04779000
WSACRSTI EQU   WSAC+40                                                  04780000
WSACABTM EQU   WSAC+36                                                  04781000
WSACMF1  EQU   WSAC+32                                                  04782000
WSACEDS0 EQU   WSAC+28                                                  04783000
WSACIOS  EQU   WSAC+24                                                  04784000
WSACRTMK EQU   WSAC+20                                                  04785000
WSACACR  EQU   WSAC+16                                                  04786000
WSACTIME EQU   WSAC+12                                                  04787000
WSACOPTM EQU   WSAC+8                                                   04788000
WSACGTF  EQU   WSAC+4                                                   04789000
WSACCWSA EQU   WSAC                                                     04790000
WSAGSCHE EQU   WSAG+40                                                  04791000
WSAGREST EQU   WSAG+36                                                  04792000
WSAGNQDQ EQU   WSAG+32                                                  04793000
WSAGMEMT EQU   WSAG+28                                                  04794000
WSAGOPTM EQU   WSAG+24                                                  04795000
WSAGSTAT EQU   WSAG+20                                                  04796000
WSAGEMS0 EQU   WSAG+16                                                  04797000
WSAGSSRS EQU   WSAG+12                                                  04798000
WSAGRSM  EQU   WSAG+8                                                   04799000
WSAGGMFM EQU   WSAG+4                                                   04800000
WSAGPGIO EQU   WSAG                                                     04801000
WSALACHP EQU   WSAL+56                                                  04802000
WSALRSM  EQU   WSAL+52                                                  04803000
WSALRV01 EQU   WSAL+48                                                  04804000
WSALSTAE EQU   WSAL+44                                                  04805000
WSALSTAT EQU   WSAL+40                                                  04806000
WSALWAIT EQU   WSAL+36                                                  04807000
WSALPOST EQU   WSAL+32                                                  04808000
WSALEXIT EQU   WSAL+28                                                  04809000
WSALCIRB EQU   WSAL+20                                                  04810000
WSALABTM EQU   WSAL+16                                                  04811000
WSALSDMP EQU   WSAL+12                                                  04812000
WSALRTM2 EQU   WSAL+8                                                   04813000
WSALVALC EQU   WSAL+4                                                   04814000
WSALCWSA EQU   WSAL                                                     04815000
ASXBEND  EQU   ASXB+232                                                 04816000
ASXBRV25 EQU   ASXB+228                                                 04817000
ASXBRV24 EQU   ASXB+224                                                 04818000
ASXBRV23 EQU   ASXB+220                                                 04819000
ASXBRV22 EQU   ASXB+216                                                 04820000
ASXBRV21 EQU   ASXB+212                                                 04821000
ASXBRV20 EQU   ASXB+208                                                 04822000
ASXBRV19 EQU   ASXB+204                                                 04823000
ASXBRV18 EQU   ASXB+200                                                 04824000
ASXBRV17 EQU   ASXB+196                                                 04825000
ASXBRV16 EQU   ASXB+192                                                 04826000
ASXBETSK EQU   ASXB+164                                                 04827000
ASXBSIRB EQU   ASXB+160                                                 04828000
ASXBPSWD EQU   ASXB+152                                                 04829000
ASXBPRG  EQU   ASXB+136                                                 04830000
ASXBRV26 EQU   ASXB+132                                                 04831000
ASXBOUSB EQU   ASXB+128                                                 04832000
ASXBDDR  EQU   ASXB+124                                                 04833000
ASXBRCTD EQU   ASXB+120                                                 04834000
ASXBRSMD EQU   ASXB+116                                                 04835000
ASXBFRWA EQU   ASXB+108                                                 04836000
ASXBFLSA EQU   ASXB+36                                                  04837000
ASXBIHSA EQU   ASXB+32                                                  04838000
ASXBRV15 EQU   ASXB+28                                                  04839000
ASXBRV14 EQU   ASXB+24                                                  04840000
ASXBLWA  EQU   ASXB+20                                                  04841000
ASXBMPST EQU   ASXB+16                                                  04842000
ASXBRS00 EQU   ASXB+14                                                  04843000
ASXBTCBS EQU   ASXB+12                                                  04844000
ASXBLTCB EQU   ASXB+8                                                   04845000
ASXBFTCB EQU   ASXB+4                                                   04846000
ASXBASXB EQU   ASXB                                                     04847000
ASXBEGIN EQU   ASXB                                                     04848000
ASCBEND  EQU   ASCB+208                                                 04849000
ASCBSRBT EQU   ASCB+200                                                 04850000
ASCBSWTL EQU   ASCB+196                                                 04851000
ASCBRS14 EQU   ASCB+195                                                 04852000
ASCBSMCT EQU   ASCB+194                                                 04853000
ASCBRS12 EQU   ASCB+192                                                 04854000
ASCBPCTT EQU   ASCB+188                                                 04855000
ASCBVGTT EQU   ASCB+184                                                 04856000
ASCBLGCB EQU   ASCB+180                                                 04857000
ASCBJBNS EQU   ASCB+176                                                 04858000
ASCBJBNI EQU   ASCB+172                                                 04859000
ASCBMCC  EQU   ASCB+168                                                 04860000
ASCBRTWA EQU   ASCB+164                                                 04861000
ASCBIQEA EQU   ASCB+160                                                 04862000
ASCBXMPQ EQU   ASCB+156                                                 04863000
ASCBRS01 EQU   ASCB+154                                                 04864000
ASCBFMCT EQU   ASCB+152                                                 04865000
ASCBOUXB EQU   ASCB+148                                                 04866000
ASCBOUCB EQU   ASCB+144                                                 04867000
ASCBMECB EQU   ASCB+140                                                 04868000
ASCBQECB EQU   ASCB+136                                                 04869000
ASCBCMSB EQU   ASCB+132                                                 04870000
ASCBCMSF EQU   ASCB+128                                                 04871000
ASCBTCBS EQU   ASCB+124                                                 04872000
ASCBNVSC EQU   ASCB+122                                                 04873000
ASCBVSC  EQU   ASCB+120                                                 04874000
ASCBSRBS EQU   ASCB+118                                                 04875000
ASCBSSRB EQU   ASCB+116                                                 04876000
ASCBRV06 EQU   ASCBFLG2                                                 04877000
ASCBRV05 EQU   ASCBFLG2                                                 04878000
ASCBRV04 EQU   ASCBFLG2                                                 04879000
ASCBSNQS EQU   ASCBFLG2                                                 04880000
ASCBCEXT EQU   ASCBFLG2                                                 04881000
ASCBPXMT EQU   ASCBFLG2                                                 04882000
ASCBXMPT EQU   ASCBFLG2                                                 04883000
ASCBRF07 EQU   ASCBDSP1                                                 04884000
ASCBRF06 EQU   ASCBDSP1                                                 04885000
ASCBRF05 EQU   ASCBDSP1                                                 04886000
ASCBRF04 EQU   ASCBDSP1                                                 04887000
ASCBRF03 EQU   ASCBDSP1                                                 04888000
ASCBRF02 EQU   ASCBDSP1                                                 04889000
ASCBFAIL EQU   ASCBDSP1                                                 04890000
ASCBNOQ  EQU   ASCBDSP1                                                 04891000
ASCBSWCT EQU   ASCB+112                                                 04892000
ASCBTMCH EQU   ASCB+104                                                 04893000
ASCBNSWP EQU   ASCBFLG1                                                 04894000
ASCBTYP1 EQU   ASCBFLG1                                                 04895000
ASCBSTND EQU   ASCBFLG1                                                 04896000
ASCBABNT EQU   ASCBFLG1                                                 04897000
ASCBTERM EQU   ASCBFLG1                                                 04898000
ASCBCMSH EQU   ASCBFLG1                                                 04899000
ASCBTOFF EQU   ASCBFLG1                                                 04900000
ASCBRF01 EQU   ASCBRCTF                                                 04901000
ASCBTMLW EQU   ASCBRCTF                                                 04902000
ASCBOUT  EQU   ASCBRCTF                                                 04903000
ASCBWAIT EQU   ASCBRCTF                                                 04904000
ASCBRV08 EQU   ASCBRCTF                                                 04905000
ASCBFQU  EQU   ASCBRCTF                                                 04906000
ASCBFRS  EQU   ASCBRCTF                                                 04907000
ASCBTMNO EQU   ASCBRCTF                                                 04908000
ASCBAFFN EQU   ASCBFW1                                                  04909000
ASCBDUMP EQU   ASCB+96                                                  04910000
ASCBQSVC EQU   ASCB+92                                                  04911000
ASCBUBET EQU   ASCB+88                                                  04912000
ASCBECB  EQU   ASCB+84                                                  04913000
ASCBJSTL EQU   ASCB+80                                                  04914000
ASCBEWST EQU   ASCB+72                                                  04915000
ASCBEJST EQU   ASCB+64                                                  04916000
ASCBTSB  EQU   ASCB+60                                                  04917000
ASCBCSCB EQU   ASCB+56                                                  04918000
ASCBRSM  EQU   ASCB+52                                                  04919000
ASCBLDA  EQU   ASCB+48                                                  04920000
ASCBSTOR EQU   ASCB+44                                                  04921000
ASCBDP   EQU   ASCB+43                                                  04922000
ASCBRV07 EQU   ASCB+42                                                  04923000
ASCBIOSM EQU   ASCB+40                                                  04924000
ASCBSEQN EQU   ASCB+38                                                  04925000
ASCBASID EQU   ASCB+36                                                  04926000
ASCBCPUS EQU   ASCB+32                                                  04927000
ASCBSPL  EQU   ASCB+28                                                  04928000
ASCBLSLQ EQU   ASCB+24                                                  04929000
ASCBFSLQ EQU   ASCB+20                                                  04930000
ASCBIOSP EQU   ASCB+16                                                  04931000
ASCBLOCK EQU   ASCB+12                                                  04932000
ASCBBWDP EQU   ASCB+8                                                   04933000
ASCBFWDP EQU   ASCB+4                                                   04934000
ASCBASCB EQU   ASCB                                                     04935000
ASCBEGIN EQU   ASCB                                                     04936000
@NM00016 EQU   SRB+40                                                   04937000
@NM00015 EQU   SRB+38                                                   04938000
SRBPRIOR EQU   SRB+37                                                   04939000
SRBPKF   EQU   SRB+36                                                   04940000
SRBSAVE  EQU   SRB+32                                                   04941000
SRBPARM  EQU   SRB+28                                                   04942000
SRBRMTR  EQU   SRB+24                                                   04943000
SRBEP    EQU   SRB+20                                                   04944000
SRBPTCB  EQU   SRBFLC+4                                                 04945000
SRBPASID EQU   SRBFLC+2                                                 04946000
SRBCPAFF EQU   SRBFLC                                                   04947000
SRBASCB  EQU   SRB+8                                                    04948000
SRBID    EQU   SRB                                                      04949000
DEBXRV40 EQU   DEBXTN+28                                                04950000
DEBXRV39 EQU   DEBXTN+24                                                04951000
DEBXXARG EQU   DEBXTN+20                                                04952000
DEBXMCF2 EQU   DEBXTN+19                                                04953000
DEBXMCF1 EQU   DEBXTN+18                                                04954000
DEBXDSO2 EQU   DEBXTN+17                                                04955000
DEBXDSO1 EQU   DEBXTN+16                                                04956000
DEBXDBPR EQU   DEBXTN+12                                                04957000
DEBXDCBM EQU   DEBXTN+8                                                 04958000
DEBXDSAB EQU   DEBXTN+4                                                 04959000
DEBXRV48 EQU   DEBXTN+3                                                 04960000
DEBXRV47 EQU   DEBXFLG1                                                 04961000
DEBXRV46 EQU   DEBXFLG1                                                 04962000
DEBXRV45 EQU   DEBXFLG1                                                 04963000
DEBXRV44 EQU   DEBXFLG1                                                 04964000
DEBXRV43 EQU   DEBXFLG1                                                 04965000
DEBXRV42 EQU   DEBXFLG1                                                 04966000
DEBXTSKC EQU   DEBXFLG1                                                 04967000
DEBXCDCB EQU   DEBXFLG1                                                 04968000
DEBXLNGH EQU   DEBXTN                                                   04969000
DEBTBLOF EQU   DEBPREFX+14                                              04970000
DEBAMTYP EQU   DEBPREFX+13                                              04971000
DEBLNGTH EQU   DEBPREFX+12                                              04972000
DEBDCBMK EQU   DEBXTNP                                                  04973000
DEBDSCBA EQU   DEBPREFX+1                                               04974000
DEBWKARA EQU   DEBPREFX                                                 04975000
DEBXCEAD EQU   DEBXCEA+1                                                04976000
DEBXCENP EQU   DEBXCEAB                                                 04977000
DEBRSV35 EQU   DEBXCEAB                                                 04978000
DEBRSV34 EQU   DEBXCEAB                                                 04979000
DEBRSV33 EQU   DEBXCEAB                                                 04980000
DEBRSV32 EQU   DEBXCEAB                                                 04981000
DEBCEAD  EQU   DEBCEA+1                                                 04982000
DEBCENP  EQU   DEBCEAB                                                  04983000
DEBRSV31 EQU   DEBCEAB                                                  04984000
DEBRSV30 EQU   DEBCEAB                                                  04985000
DEBRSV29 EQU   DEBCEAB                                                  04986000
DEBRSV28 EQU   DEBCEAB                                                  04987000
DEBPCIAD EQU   DEBPCIA+1                                                04988000
DEBPCINP EQU   DEBPCIAB                                                 04989000
DEBRSV27 EQU   DEBPCIAB                                                 04990000
DEBRSV26 EQU   DEBPCIAB                                                 04991000
DEBRSV25 EQU   DEBPCIAB                                                 04992000
DEBRSV24 EQU   DEBPCIAB                                                 04993000
DEBSIOAD EQU   DEBSIOA+1                                                04994000
DEBSIONP EQU   DEBSIOAB                                                 04995000
DEBRSV23 EQU   DEBSIOAB                                                 04996000
DEBIOVR  EQU   DEBSIOAB                                                 04997000
DEBSIOX  EQU   DEBSIOAB                                                 04998000
DEBPGFX  EQU   DEBSIOAB                                                 04999000
DEBEOEAD EQU   DEBEOEA+1                                                05000000
DEBEOENP EQU   DEBEOEAB                                                 05001000
DEBRSV22 EQU   DEBEOEAB                                                 05002000
DEBRSV21 EQU   DEBEOEAB                                                 05003000
DEBRSV20 EQU   DEBEOEAB                                                 05004000
DEBRSV19 EQU   DEBEOEAB                                                 05005000
DEBSUBID EQU   DEBSUBNM                                                 05006000
DEBSIOA2 EQU   DEBACS08+24                                              05007000
DEBRPSIO EQU   DEBACS08+20                                              05008000
DEBFREED EQU   DEBACS08+16                                              05009000
@NM00014 EQU   DEBACS08+12                                              05010000
@NM00013 EQU   DEBACS08+8                                               05011000
DEBDISAD EQU   DEBACS08+4                                               05012000
@NM00012 EQU   DEBACS08                                                 05013000
DEBRPSST EQU   DEBACS07+64                                              05014000
DEBARECK EQU   DEBACS07+60                                              05015000
DEBAREWT EQU   DEBACS07+56                                              05016000
DEBACHK  EQU   DEBACS07+52                                              05017000
DEBAWRIT EQU   DEBACS07+48                                              05018000
DEBASETL EQU   DEBACS07+44                                              05019000
DEBAREAD EQU   DEBACS07+40                                              05020000
DEBCRECK EQU   DEBACS07+36                                              05021000
DEBCREWT EQU   DEBACS07+32                                              05022000
DEBCCHK  EQU   DEBACS07+28                                              05023000
DEBCWRIT EQU   DEBACS07+24                                              05024000
DEBCSETL EQU   DEBACS07+20                                              05025000
DEBCREAD EQU   DEBACS07+16                                              05026000
DEBWKPT5 EQU   DEBACS07+12                                              05027000
DEBWKPT4 EQU   DEBACS07+8                                               05028000
DEBGET   EQU   DEBACS07+4                                               05029000
@NM00011 EQU   DEBACS07                                                 05030000
DEBPUT   EQU   DEBACS06+4                                               05031000
DEBDCBFA EQU   DEBACS06                                                 05032000
DEBLUCBB EQU   DEBLUCBA+1                                               05033000
DEBRSV18 EQU   DEBLUCBA                                                 05034000
DEBFUCBB EQU   DEBFUCBA+1                                               05035000
DEBRSV17 EQU   DEBFUCBA                                                 05036000
DEBTCCWB EQU   DEBTCCWA+1                                               05037000
DEBRSV16 EQU   DEBTCCWA                                                 05038000
DEBTBFRB EQU   DEBTBFRA+1                                               05039000
DEBRSV15 EQU   DEBTBFRA                                                 05040000
DEBDBPEF EQU   DEBACS03+8                                               05041000
DEBDBPP  EQU   DEBACS03+4                                               05042000
DEBDTPP  EQU   DEBACS03                                                 05043000
DEBDBPE  EQU   DEBDBLK+1                                                05044000
DEBDBPT  EQU   DEBDBLK                                                  05045000
DEBEXTNM EQU   DEBDSNAM                                                 05046000
DEBRSV14 EQU   DEBDSNM+4                                                05047000
DEBUTSAB EQU   DEBUTSAA+1                                               05048000
DEBRSV13 EQU   DEBUTSAA                                                 05049000
DEBVOLNM EQU   DEBACSMD+2                                               05050000
DEBVLSEQ EQU   DEBVOLSQ+1                                               05051000
DEBRSV42 EQU   DEBVOLBT                                                 05052000
DEBRSV41 EQU   DEBVOLBT                                                 05053000
DEBRSV40 EQU   DEBVOLBT                                                 05054000
DEBRSV39 EQU   DEBVOLBT                                                 05055000
DEBRSV38 EQU   DEBVOLBT                                                 05056000
DEBRSV37 EQU   DEBVOLBT                                                 05057000
DEBRSV36 EQU   DEBVOLBT                                                 05058000
DEBEXFUL EQU   DEBVOLBT                                                 05059000
DEBNMTRK EQU   DEBDASD+14                                               05060000
DEBENDHH EQU   DEBDASD+12                                               05061000
DEBENDCC EQU   DEBDASD+10                                               05062000
DEBSTRHH EQU   DEBDASD+8                                                05063000
DEBSTRCC EQU   DEBDASD+6                                                05064000
DEBBINUM EQU   DEBDASD+4                                                05065000
DEBUCBA  EQU   DEBUCBAD+1                                               05066000
DEBDVMOD EQU   DEBUCBAD                                                 05067000
DEBAPPB  EQU   DEBAPPAD+1                                               05068000
DEBEXSCL EQU   DEBAPPAD                                                 05069000
DEBDCBB  EQU   DEBDCBAD+1                                               05070000
DEBDEBID EQU   DEBPROTG                                                 05071000
DEBECBB  EQU   DEBECBAD+1                                               05072000
DEBPRIOR EQU   DEBECBAD                                                 05073000
DEBUSRPB EQU   DEBUSRPG+1                                               05074000
DEBNMEXT EQU   DEBUSRPG                                                 05075000
DEBRSV05 EQU   DEBBASIC+15                                              05076000
DEBXTNIN EQU   DEBFLGS1                                                 05077000
DEBAPFIN EQU   DEBFLGS1                                                 05078000
DEBF1CEV EQU   DEBFLGS1                                                 05079000
DEBCINDI EQU   DEBFLGS1                                                 05080000
DEBRSV02 EQU   DEBFLGS1                                                 05081000
DEBRSV01 EQU   DEBFLGS1                                                 05082000
DEBEOFDF EQU   DEBFLGS1                                                 05083000
DEBPWCKD EQU   DEBFLGS1                                                 05084000
DEBQSCNT EQU   DEBBASIC+13                                              05085000
DEBACCS  EQU   DEBOPATB                                                 05086000
DEBPOSIT EQU   DEBOPATB                                                 05087000
DEBZERO  EQU   DEBOPATB                                                 05088000
DEBABEND EQU   DEBOPATB                                                 05089000
DEBRERR  EQU   DEBOFLGS                                                 05090000
DEBLABEL EQU   DEBOFLGS                                                 05091000
DEBSPLIT EQU   DEBOFLGS                                                 05092000
DEBDCB   EQU   DEBOFLGS                                                 05093000
DEBRLSE  EQU   DEBOFLGS                                                 05094000
DEBEOF   EQU   DEBOFLGS                                                 05095000
DEBDISP  EQU   DEBOFLGS                                                 05096000
DEBDEBB  EQU   DEBDEBAD+1                                               05097000
DEBAMLNG EQU   DEBDEBAD                                                 05098000
DEBNMSUB EQU   DEBTCBAD                                                 05099000
RQEEND   EQU   RQE+40                                                   05100000
@NM00010 EQU   RQE+39                                                   05101000
RQECHEAC EQU   RQEFLAG                                                  05102000
RQEPURGE EQU   RQEFLAG                                                  05103000
RQESRBS  EQU   RQEFLAG                                                  05104000
RQESTBL  EQU   RQEFLAG                                                  05105000
RQEFIXST EQU   RQEFLAG                                                  05106000
RQENOFRE EQU   RQEFLAG                                                  05107000
RQENOPST EQU   RQEFLAG                                                  05108000
RQERETRY EQU   RQEFLAG                                                  05109000
RQETYP1  EQU   RQETYP3                                                  05110000
RQETYP2  EQU   RQETYP3                                                  05111000
@NM00009 EQU   RQETYPE                                                  05112000
RQEVAM   EQU   RQETYPE                                                  05113000
RQE1TO1  EQU   RQETYPE                                                  05114000
RQEVIRT  EQU   RQETYPE                                                  05115000
RQE114   EQU   RQETYPE                                                  05116000
@NM00008 EQU   RQEPRT                                                   05117000
RQEPKEY  EQU   RQEPRT                                                   05118000
RQEIPIB  EQU   RQE+32                                                   05119000
RQESRB   EQU   RQE+28                                                   05120000
RQETCCW  EQU   RQE+16                                                   05121000
RQEIOB   EQU   RQE+4                                                    05122000
RQEUCB   EQU   RQE                                                      05123000
IQEOUTLM EQU   IQESECT+20                                               05124000
IQEDCB   EQU   IQESECT+16                                               05125000
IQETCBA  EQU   IQETCB+1                                                 05126000
IQESTAT2 EQU   IQETCB                                                   05127000
IQEIRBA  EQU   IQEIRB+1                                                 05128000
@NM00007 EQU   IQEFLAGS                                                 05129000
@NM00006 EQU   IQEFLAGS                                                 05130000
@NM00005 EQU   IQEFLAGS                                                 05131000
@NM00004 EQU   IQEFLAGS                                                 05132000
@NM00003 EQU   IQEFLAGS                                                 05133000
@NM00002 EQU   IQEFLAGS                                                 05134000
@NM00001 EQU   IQEFLAGS                                                 05135000
IQEPURGE EQU   IQEFLAGS                                                 05136000
IQEPARAM EQU   IQESECT+4                                                05137000
IQESTAT1 EQU   IQELNK                                                   05138000
@NM00042 EQU   PSA+3412                                                 05139000
PSASTAK  EQU   PSA+3072                                                 05140000
@NM00041 EQU   PSA+1032                                                 05141000
PSAUSEND EQU   PSA+1032                                                 05142000
PSAPCPSW EQU   PSA+1024                                                 05143000
PSARV060 EQU   PSA+1020                                                 05144000
PSARV059 EQU   PSA+1018                                                 05145000
PSASVC13 EQU   PSA+1016                                                 05146000
PSALSFCC EQU   PSA+1012                                                 05147000
PSASFACC EQU   PSA+1008                                                 05148000
PSASTOP  EQU   PSA+992                                                  05149000
PSASTART EQU   PSA+976                                                  05150000
PSARSPSW EQU   PSA+968                                                  05151000
PSASRPSW EQU   PSA+960                                                  05152000
PSARV045 EQU   PSA+892                                                  05153000
PSARV044 EQU   PSA+888                                                  05154000
PSARV043 EQU   PSA+884                                                  05155000
PSARV042 EQU   PSA+880                                                  05156000
PSARV041 EQU   PSA+876                                                  05157000
PSARV040 EQU   PSA+872                                                  05158000
PSARV025 EQU   PSA+868                                                  05159000
PSADSSED EQU   PSA+868                                                  05160000
PSADSSPR EQU   PSA+864                                                  05161000
PSADSSFW EQU   PSA+860                                                  05162000
PSADSS14 EQU   PSA+856                                                  05163000
PSADSSPP EQU   PSA+848                                                  05164000
PSADSSRP EQU   PSA+840                                                  05165000
PSADSS05 EQU   PSADSSF4                                                 05166000
PSADSS10 EQU   PSADSSF4                                                 05167000
PSADSSVE EQU   PSADSSF4                                                 05168000
PSADSSDE EQU   PSADSSF4                                                 05169000
PSADSSC0 EQU   PSADSSF4                                                 05170000
PSADSSIE EQU   PSADSSF4                                                 05171000
PSADSS12 EQU   PSADSSF4                                                 05172000
PSADSSRC EQU   PSADSSF4                                                 05173000
PSARV057 EQU   PSADSSF3                                                 05174000
PSARV056 EQU   PSADSSF3                                                 05175000
PSARV055 EQU   PSADSSF3                                                 05176000
PSARV054 EQU   PSADSSF3                                                 05177000
PSADSSRW EQU   PSADSSF3                                                 05178000
PSADSSNM EQU   PSADSSF3                                                 05179000
PSADSSES EQU   PSADSSF3                                                 05180000
PSADSSGP EQU   PSADSSF3                                                 05181000
PSADSSF2 EQU   PSADSSFL+1                                               05182000
PSADSSPI EQU   PSADSSF1                                                 05183000
PSADSSOI EQU   PSADSSF1                                                 05184000
PSADSSSP EQU   PSADSSF1                                                 05185000
PSADSSTP EQU   PSADSSF1                                                 05186000
PSADSSDW EQU   PSADSSF1                                                 05187000
PSADSSDD EQU   PSADSSF1                                                 05188000
PSADSSDM EQU   PSADSSF1                                                 05189000
PSADSSMV EQU   PSADSSF1                                                 05190000
PSADSSTS EQU   PSA+816                                                  05191000
PSADSSWK EQU   PSA+812                                                  05192000
PSADSSR3 EQU   PSA+808                                                  05193000
PSADSSR2 EQU   PSA+804                                                  05194000
PSADSSRS EQU   PSA+800                                                  05195000
PSASTOR  EQU   PSA+796                                                  05196000
PSACPUSA EQU   PSA+794                                                  05197000
PSAVSTAP EQU   PSA+792                                                  05198000
PSAWKVAP EQU   PSA+788                                                  05199000
PSAWKRAP EQU   PSA+784                                                  05200000
PSAMCHIC EQU   PSA+783                                                  05201000
PSARV061 EQU   PSA+782                                                  05202000
PSASYMSK EQU   PSA+781                                                  05203000
PSAMCHFL EQU   PSA+780                                                  05204000
PSACR0   EQU   PSA+776                                                  05205000
PSAPSWSV EQU   PSA+768                                                  05206000
PSALITA  EQU   PSA+764                                                  05207000
PSACLHS  EQU   PSAHLHI                                                  05208000
PSALKR15 EQU   PSALKSA+60                                               05209000
PSALKR14 EQU   PSALKSA+56                                               05210000
PSALKR13 EQU   PSALKSA+52                                               05211000
PSALKR12 EQU   PSALKSA+48                                               05212000
PSALKR11 EQU   PSALKSA+44                                               05213000
PSALKR10 EQU   PSALKSA+40                                               05214000
PSALKR9  EQU   PSALKSA+36                                               05215000
PSALKR8  EQU   PSALKSA+32                                               05216000
PSALKR7  EQU   PSALKSA+28                                               05217000
PSALKR6  EQU   PSALKSA+24                                               05218000
PSALKR5  EQU   PSALKSA+20                                               05219000
PSALKR4  EQU   PSALKSA+16                                               05220000
PSALKR3  EQU   PSALKSA+12                                               05221000
PSALKR2  EQU   PSALKSA+8                                                05222000
PSALKR1  EQU   PSALKSA+4                                                05223000
PSALKR0  EQU   PSALKSA                                                  05224000
PSARV023 EQU   PSACLHT+52                                               05225000
PSALOCAL EQU   PSACLHT+48                                               05226000
PSACMSL  EQU   PSACLHT+44                                               05227000
PSAOPTL  EQU   PSACLHT+40                                               05228000
PSATPACL EQU   PSACLHT+36                                               05229000
PSATPDNL EQU   PSACLHT+32                                               05230000
PSATPNCL EQU   PSACLHT+28                                               05231000
PSAIOSLL EQU   PSACLHT+24                                               05232000
PSAIOSUL EQU   PSACLHT+20                                               05233000
PSAIOSCL EQU   PSACLHT+16                                               05234000
PSAIOSSL EQU   PSACLHT+12                                               05235000
PSASALCL EQU   PSACLHT+8                                                05236000
PSAASML  EQU   PSACLHT+4                                                05237000
PSADISPL EQU   PSACLHT                                                  05238000
PSASRSA  EQU   PSA+636                                                  05239000
PSARV050 EQU   PSA+634                                                  05240000
PSADSSGO EQU   PSA+633                                                  05241000
PSARECUR EQU   PSA+632                                                  05242000
PSAHLHIS EQU   PSA+628                                                  05243000
PSAIPCSA EQU   PSA+624                                                  05244000
@NM00040 EQU   PSA+621                                                  05245000
PSAIPCDM EQU   PSA+620                                                  05246000
PSAIPCD  EQU   PSA+616                                                  05247000
@NM00039 EQU   PSA+613                                                  05248000
PSAIPCRM EQU   PSA+612                                                  05249000
PSAIPCR  EQU   PSA+608                                                  05250000
PSAMCHEX EQU   PSA+600                                                  05251000
PSAMPSW  EQU   PSA+592                                                  05252000
PSAEXPS2 EQU   PSA+584                                                  05253000
PSAEXPS1 EQU   PSA+576                                                  05254000
PSAPIREG EQU   PSA+572                                                  05255000
PSARSREG EQU   PSA+568                                                  05256000
PSAGPREG EQU   PSA+556                                                  05257000
PSARV022 EQU   PSASUP4                                                  05258000
PSARV021 EQU   PSASUP4                                                  05259000
PSARV020 EQU   PSASUP4                                                  05260000
PSARV019 EQU   PSASUP4                                                  05261000
PSARV018 EQU   PSASUP4                                                  05262000
PSARV017 EQU   PSASUP4                                                  05263000
PSARV016 EQU   PSASUP4                                                  05264000
PSARV015 EQU   PSASUP4                                                  05265000
PSARV014 EQU   PSASUP3                                                  05266000
PSARV013 EQU   PSASUP3                                                  05267000
PSARV012 EQU   PSASUP3                                                  05268000
PSARV011 EQU   PSASUP3                                                  05269000
PSARV010 EQU   PSASUP3                                                  05270000
PSARV009 EQU   PSASUP3                                                  05271000
PSARV008 EQU   PSASUP3                                                  05272000
PSAIOSUP EQU   PSASUP3                                                  05273000
PSALCR   EQU   PSASUP2                                                  05274000
PSARTM   EQU   PSASUP2                                                  05275000
PSAACR   EQU   PSASUP2                                                  05276000
PSAIPCE2 EQU   PSASUP2                                                  05277000
PSAIPCES EQU   PSASUP2                                                  05278000
PSAIPCEC EQU   PSASUP2                                                  05279000
PSAGTF   EQU   PSASUP2                                                  05280000
PSAIPCRI EQU   PSASUP2                                                  05281000
PSAIPCRP EQU   PSASUP1                                                  05282000
PSAIPCDR EQU   PSASUP1                                                  05283000
PSADISP  EQU   PSASUP1                                                  05284000
PSALOCK  EQU   PSASUP1                                                  05285000
PSAPI    EQU   PSASUP1                                                  05286000
PSAEXT   EQU   PSASUP1                                                  05287000
PSASVC   EQU   PSASUP1                                                  05288000
PSAIO    EQU   PSASUP1                                                  05289000
PSAANEW  EQU   PSA+544                                                  05290000
PSATOLD  EQU   PSA+540                                                  05291000
PSATNEW  EQU   PSA+536                                                  05292000
PSALCCAR EQU   PSA+532                                                  05293000
PSALCCAV EQU   PSA+528                                                  05294000
PSAPCCAR EQU   PSA+524                                                  05295000
PSAPCCAV EQU   PSA+520                                                  05296000
PSACPULA EQU   PSA+518                                                  05297000
PSACPUPA EQU   PSA+516                                                  05298000
PSAPSA   EQU   PSA+512                                                  05299000
FLCHDEND EQU   PSA+512                                                  05300000
FLCCRSAV EQU   FLCMCLA+280                                              05301000
FLCGRSAV EQU   FLCMCLA+216                                              05302000
FLCFPSAV EQU   FLCMCLA+184                                              05303000
FLCFLA   EQU   FLCMCLA+88                                               05304000
FLCRGNCD EQU   FLCMCLA+84                                               05305000
FLCFSAA  EQU   FLCFSA+1                                                 05306000
@NM00038 EQU   FLCFSA                                                   05307000
@NM00037 EQU   FLCMCLA+72                                               05308000
FLCMCIC  EQU   FLCMCLA+64                                               05309000
@NM00036 EQU   FLCMCLA+20                                               05310000
FLCIOAA  EQU   FLCIOA+1                                                 05311000
@NM00035 EQU   FLCIOA                                                   05312000
@NM00034 EQU   FLCMCLA+15                                               05313000
@NM00033 EQU   FLCMCLA+14                                               05314000
@NM00032 EQU   FLCMCLA+12                                               05315000
FLCLCL   EQU   FLCMCLA+8                                                05316000
FLCIOELA EQU   FLCIOEL+1                                                05317000
@NM00031 EQU   FLCIOEL                                                  05318000
FLCCHNID EQU   FLCMCLA                                                  05319000
@NM00030 EQU   PSA+160                                                  05320000
FLCMTRCD EQU   PSA+157                                                  05321000
@NM00029 EQU   PSA+156                                                  05322000
FLCPERA  EQU   FLCPER+1                                                 05323000
@NM00028 EQU   FLCPER                                                   05324000
@NM00027 EQU   PSA+151                                                  05325000
FLCPERCD EQU   PSA+150                                                  05326000
FLCMCNUM EQU   PSA+149                                                  05327000
@NM00026 EQU   PSA+148                                                  05328000
FLCTEAA  EQU   FLCTEA+1                                                 05329000
@NM00025 EQU   FLCTEA                                                   05330000
PSAPIPC  EQU   PSAPICOD                                                 05331000
PSAPIMC  EQU   PSAPICOD                                                 05332000
PSAPIPER EQU   PSAPICOD                                                 05333000
PSARV049 EQU   FLCPICOD                                                 05334000
FLCPILCB EQU   FLCPIILC                                                 05335000
@NM00024 EQU   FLCPIILC                                                 05336000
@NM00023 EQU   PSAEPPSW                                                 05337000
FLCSVCN  EQU   PSAESPSW+2                                               05338000
FLCSILCB EQU   FLCSVILC                                                 05339000
@NM00022 EQU   FLCSVILC                                                 05340000
@NM00021 EQU   PSAESPSW                                                 05341000
FLCEICOD EQU   PSAEEPSW+2                                               05342000
PSASPAD  EQU   PSAEEPSW                                                 05343000
@NM00020 EQU   PSA+128                                                  05344000
FLCINPSW EQU   PSA+120                                                  05345000
FLCMNPSW EQU   PSA+112                                                  05346000
FLCPNPSW EQU   PSA+104                                                  05347000
FLCSNPSW EQU   PSA+96                                                   05348000
FLCENPSW EQU   PSA+88                                                   05349000
FLCTRACE EQU   PSA+84                                                   05350000
FLCTIMER EQU   PSA+80                                                   05351000
FLCCVT2  EQU   PSA+76                                                   05352000
FLCCAW   EQU   PSA+72                                                   05353000
FLCCSW   EQU   PSA+64                                                   05354000
FLCIOPSW EQU   PSA+56                                                   05355000
FLCMOPSW EQU   PSA+48                                                   05356000
FLCPOPSW EQU   PSA+40                                                   05357000
FLCSOPSW EQU   PSA+32                                                   05358000
FLCEOPSW EQU   PSA+24                                                   05359000
@NM00019 EQU   FLCICCW2+4                                               05360000
FLCICCW1 EQU   FLCROPSW                                                 05361000
FLCIPPSW EQU   FLCRNPSW                                                 05362000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      05363000
@ENDDATA EQU   *                                                        05364000
         END   IEA0EF00                                                 05365000
