         TITLE 'TTIMER/STIMER RTN -MODULE IEAVRT00 -CSECT IGC0004F     *00001000
                        '                                               00002000
IGC0004F CSECT ,                                                   0001 00003000
@MAINENT BALR  @15,0                                               0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL2(@EP00001-@MAINENT-2)                                 00007000
         DC    AL1(16)                                             0001 00008000
         DC    C'IGC0004F  77.103'                                 0001 00009000
IGC0004G BALR  @15,0                                               0001 00010000
         USING *,@15                                               0001 00011000
         B     @PROLOG                                             0001 00012000
         DC    AL2(@EP00257-IGC0004G-2)                                 00013000
         ENTRY IGC0004G                                                 00014000
         DROP  @15                                                      00015000
@PROLOG  BALR  @09,0                                               0001 00016000
@PSTART  DS    0H                                                  0001 00017000
         USING @PSTART,@09                                         0001 00018000
         AH    @15,4(,@15)                                         0001 00019000
         BR    @15                                                 0001 00020000
@EP00001 DS    0H                                                  0002 00021000
RBPRFXLN EQU 64                                                         00022000
RBPRFLNA EQU 32                                                         00023000
PRBLEN   EQU 136                                                        00024000
SIRBLEN  EQU 200                                                        00025000
TIRBLEN  EQU 136                                                        00026000
IRBLEN   EQU 128                                                        00027000
SVRBLEN  EQU 224                                                        00028000
FIXSTART DS    0H                                                  0103 00029000
*   SAVR(1)=AREAPTR;                /* SAVE INPUT REGS               */ 00030000
         ST    AREAPTR,SAVR(,RBPTR)                                0104 00031000
*   SAVR(2)=CODERG;                 /* DO                            */ 00032000
         ST    CODERG,SAVR+4(,RBPTR)                               0105 00033000
*   SAVR(3)=RETADDR;                /* DO                            */ 00034000
         ST    RETADDR,SAVR+8(,RBPTR)                              0106 00035000
*   RESPECIFY                                                      0107 00036000
*    (AREAPTR,                                                     0107 00037000
*     CODERG,                                                      0107 00038000
*     RETADDR) UNRSTD;                                             0107 00039000
*   XSAFLGS='00'X;                  /* INITIALIZE BIT FLAGS          */ 00040000
         MVI   XSAFLGS(RBPTR),X'00'                                0108 00041000
*   RESPECIFY                                                      0109 00042000
*    (R0,                                                          0109 00043000
*     R1,                                                          0109 00044000
*     R7,                                                          0109 00045000
*     R13) RSTD;                    /*                       @Z40FPYB*/ 00046000
*   R1=ADDR(TTSTSTAE);              /* SET ESTAE ROUTINE ENTRY PT  0110 00047000
*                                                            @Z40FPYB*/ 00048000
         LA    R1,TTSTSTAE                                         0110 00049000
*   R7=ADDR(RBPRFX);                /* SET POINTER TO RB PREFIX    0111 00050000
*                                                            @Z40FPYB*/ 00051000
         LR    R7,RBPTR                                            0111 00052000
         SL    R7,@CF00214                                         0111 00053000
*   GENERATE CODE;                                                 0112 00054000
*                            /* ESTABLISH ESTAE COVERAGE    @Z40FPYB*/  00055000
    FESTAE EXITADR=(R1),RBADDR=(R7),PARAM=(RBPTR),                    CC00056000
               TCBADDR=(TCBPTR),RECORD=YES                              00057000
*   RESPECIFY                                                      0113 00058000
*    (R0,                                                          0113 00059000
*     R1,                                                          0113 00060000
*     R7,                                                          0113 00061000
*     R13) UNRSTD;                  /*                       @Z40FPYB*/ 00062000
*   CVTREG=R3;                      /* SET PTR TO CVT                */ 00063000
         LR    CVTREG,R3                                           0114 00064000
*   RESPECIFY                                                      0115 00065000
*    (R3) UNRSTD;                                                  0115 00066000
*   IF SAVR(2,31:31)='1'B           /* IF MIC UNITS REQUESTED        */ 00067000
*     THEN                          /* CLEAR OUT AREA FOR RESULTS    */ 00068000
         TM    SAVR+7(RBPTR),B'00000010'                           0116 00069000
         BNO   @RF00116                                            0116 00070000
*     DO;                                                          0117 00071000
*       RESPECIFY                                                  0118 00072000
*        (KEYREG) RSTD;             /* INDICATE USER AREA STORE      */ 00073000
*       XSAUAREA='1'B;              /*                       @YM02417*/ 00074000
         OI    XSAUAREA(RBPTR),B'00001000'                         0119 00075000
*       DO;                         /* MODESET EXTKEY(RBT234)      0120 00076000
*                                      WORKREG(KEYREG)               */ 00077000
*         KEYREG=TCBRBP;            /* RB PTR FROM TCB               */ 00078000
         L     KEYREG,TCBRBP(,TCBPTR)                              0121 00079000
*         KEYREG=KEYREG->RBLINK;    /* NEXT RB ADDRESS               */ 00080000
         L     KEYREG,RBLINK(,KEYREG)                              0122 00081000
*         KEYREG=KEYREG->RBOPSW(2); /* PSW KEY FROM RB OLD PSW       */ 00082000
         SLR   @12,@12                                             0123 00083000
         IC    @12,RBOPSW+1(,KEYREG)                               0123 00084000
         LR    KEYREG,@12                                          0123 00085000
*         SPKA(KEYREG);             /* SET PSW KEY                   */ 00086000
         SPKA  0(KEYREG)                                           0124 00087000
*       END;                        /* MODESET EXTKEY(RBT234)      0125 00088000
*                                      WORKREG(KEYREG)               */ 00089000
*       AREA='0000000000000000'X;                                  0126 00090000
         L     @12,INPTR(,RBPTR)                                   0126 00091000
         MVC   AREA(8,@12),@CB02935                                0126 00092000
*       GENERATE                    /* RETURN TO PROTECT KEY 0       */ 00093000
*           (SPKA  0);                                             0127 00094000
         SPKA  0                                                        00095000
*       XSAUAREA='0'B;              /*                       @YM02417*/ 00096000
         NI    XSAUAREA(RBPTR),B'11110111'                         0128 00097000
*       RESPECIFY                                                  0129 00098000
*        (KEYREG) UNRSTD;                                          0129 00099000
*     END;                                                         0130 00100000
*   RESPECIFY                                                      0131 00101000
*    (R11,                                                         0131 00102000
*     R12,                                                         0131 00103000
*     R13,                                                         0131 00104000
*     R14) RSTD;                                                   0131 00105000
@RF00116 DS    0H                                                  0132 00106000
*   GEN(LA    TTSTBASE,0(0,TTSTBASE));/* CLEAR HIGH ORDER BYTE OF  0132 00107000
*                                      BASE REG FOR NEXT ADDRESS   0132 00108000
*                                      COMPARISON            @ZA02745*/ 00109000
         LA    TTSTBASE,0(0,TTSTBASE)                                   00110000
*   IF TTSTBASE^<CVTNUCB THEN       /* IF MODULE NOT IN FIXED LPA  0133 00111000
*                                                            @ZA02745*/ 00112000
         C     TTSTBASE,CVTNUCB(,CVTREG)                           0133 00113000
         BL    @RF00133                                            0133 00114000
*     DO;                           /* PAGE FIX THE MODULE   @ZA02745*/ 00115000
*       R11=ADDR(FIXSTART);         /* SET REG FOR PAGE FIX INTF     */ 00116000
         LA    R11,FIXSTART                                        0135 00117000
*       R12=ADDR(FIXEND);           /* SET REG FOR PAGE FIX INTF     */ 00118000
         LA    R12,FIXEND                                          0136 00119000
*       R13=ADDR(PGFIXECB);         /* SET REG FOR PAGE FIX INTF     */ 00120000
         LA    R13,PGFIXECB(,RBPTR)                                0137 00121000
*       PGFIXECB=0;                 /* INITIALIZE THE PGFIX ECB      */ 00122000
         SLR   @10,@10                                             0138 00123000
         ST    @10,PGFIXECB(,RBPTR)                                0138 00124000
*       GENERATE(PGFIX R,A=(R11),EA=(R12),ECB=(R13),LONG=N);       0139 00125000
         PGFIX R,A=(R11),EA=(R12),ECB=(R13),LONG=N                      00126000
*       IF RETCODE=8 THEN           /*                       @ZA07160*/ 00127000
         C     RETCODE,@CF00036                                    0140 00128000
         BNE   @RF00140                                            0140 00129000
*         DO;                                                      0141 00130000
*           R13=ADDR(PGFIXECB);     /* SET REG FOR WAIT              */ 00131000
         LA    R13,PGFIXECB(,RBPTR)                                0142 00132000
*           GEN(WAIT  1,ECB=(R13)); /* WAIT FOR PAGE FIX             */ 00133000
         WAIT  1,ECB=(R13)                                              00134000
*         END;                                                     0144 00135000
*     END;                          /*                       @ZA02745*/ 00136000
@RF00140 DS    0H                                                  0146 00137000
*   GENERATE REFS(PSALITA,FLC);                                    0146 00138000
@RF00133 DS    0H                                                  0146 00139000
*                             /* GET DISP LOCK */                       00140000
         SETLOCK OBTAIN,TYPE=DISP,MODE=UNCOND,                        CC00141000
               RELATED=('TQE QUEUE',IEAVRT00(NONE,NONE,NONE))           00142000
*   RESPECIFY                                                      0147 00143000
*    (R11,                                                         0147 00144000
*     R12,                                                         0147 00145000
*     R13,                                                         0147 00146000
*     R14) UNRSTD;                                                 0147 00147000
*   RESPECIFY                                                      0148 00148000
*    (TQEPTR) RSTD;                                                0148 00149000
*   TQEPTR=TCBTME;                                                 0149 00150000
         L     TQEPTR,TCBTME(,TCBPTR)                              0149 00151000
*   IF TQEPTR=0|(TQEPTR^=0&TQEOFF='1'B)/* IF THERE IS NO TQE ON QUEUE*/ 00152000
*     THEN                          /* RETURN ZERO INTERVAL LEFT     */ 00153000
         SLR   @14,@14                                             0150 00154000
         CR    TQEPTR,@14                                          0150 00155000
         BE    @RT00150                                            0150 00156000
         CR    TQEPTR,@14                                          0150 00157000
         BE    @RF00150                                            0150 00158000
         TM    TQEOFF(TQEPTR),B'10000000'                          0150 00159000
         BNO   @RF00150                                            0150 00160000
@RT00150 DS    0H                                                  0151 00161000
*     DO;                           /* AND EIXT.                     */ 00162000
*       RESPECIFY                                                  0152 00163000
*        (R11,                                                     0152 00164000
*         R12,                                                     0152 00165000
*         R13,                                                     0152 00166000
*         R14) RSTD;                                               0152 00167000
*       GENERATE;                                                  0153 00168000
           SETLOCK RELEASE,TYPE=DISP,                                 CC00169000
               RELATED=('TQE QUEUE',IEAVRT00(NONE))                     00170000
*       RESPECIFY                                                  0154 00171000
*        (R11,                                                     0154 00172000
*         R12,                                                     0154 00173000
*         R13,                                                     0154 00174000
*         R14) UNRSTD;                                             0154 00175000
*       IF SAVR(2,31:31)^='1'B      /* IF UNITS ARE TU               */ 00176000
*         THEN                      /* SET INTERVAL=0 IN SAVE        */ 00177000
         TM    SAVR+7(RBPTR),B'00000010'                           0155 00178000
         BO    @RF00155                                            0155 00179000
*         SAVR(1)=0;                /* FROM WHICH R0 IS RESTORED.    */ 00180000
         SLR   @14,@14                                             0156 00181000
         ST    @14,SAVR(,RBPTR)                                    0156 00182000
*       RETCODE=0;                  /* SET SUCCESSFUL RETURN CODE    */ 00183000
@RF00155 SLR   RETCODE,RETCODE                                     0157 00184000
*     END;                                                         0158 00185000
*   ELSE                            /* HERE IF A TQE ON QUEUE        */ 00186000
*     DO;                                                          0159 00187000
         B     @RC00150                                            0159 00188000
@RF00150 DS    0H                                                  0160 00189000
*       IF TQETYPE='00'B            /* IF TQE IS TASK TYPE,          */ 00190000
*         THEN                      /* GET TASK TIME INTV LEFT       */ 00191000
         TM    TQETYPE(TQEPTR),B'00000011'                         0160 00192000
         BNZ   @RF00160                                            0160 00193000
*         DO;                                                      0161 00194000
*           IF PCCANUIN='0'B        /* IF CPU TIMER IS USABLE,       */ 00195000
*             THEN                  /* CPU TIMER HAS INTV LEFT.      */ 00196000
         L     @14,PCCAPTR                                         0162 00197000
         TM    PCCANUIN(@14),B'10000000'                           0162 00198000
         BNZ   @RF00162                                            0162 00199000
*             GENERATE              /* STORE THE CPU TIMER           */ 00200000
*                 (STPT INTV(RBPTR));                              0163 00201000
         STPT INTV(RBPTR)                                               00202000
*           ELSE                    /* IF NOT USABLE,                */ 00203000
*             INTV=TQEVAL;          /* TQEVAL HAS INTV LEFT          */ 00204000
         B     @RC00162                                            0164 00205000
@RF00162 MVC   INTV(8,RBPTR),TQEVAL(TQEPTR)                        0164 00206000
*           XSATMTYP='0'B;          /* INDICATE TASK TYPE INTV       */ 00207000
@RC00162 NI    XSATMTYP(RBPTR),B'01111111'                         0165 00208000
*         END;                                                     0166 00209000
*       ELSE                        /* IF REAL/WAIT TYPE,            */ 00210000
*         DO;                       /* INTV LEFT IS TQEVAL-TIME      */ 00211000
         B     @RC00160                                            0167 00212000
@RF00160 DS    0H                                                  0168 00213000
*           INTV=TQEVAL;            /* GET TQEVAL FOR NOW            */ 00214000
         MVC   INTV(8,RBPTR),TQEVAL(TQEPTR)                        0168 00215000
*           XSATMTYP='1'B;          /* INDICATE REAL/WAIT TYPE       */ 00216000
         OI    XSATMTYP(RBPTR),B'10000000'                         0169 00217000
*         END;                                                     0170 00218000
*       IF(TQETYPE='11'B|TQETYPE='00'B)&/* IF LEGAL CANCEL           */ 00219000
*           SAVR(2,32:32)='1'B THEN /* TQE MUST BE FREED.            */ 00220000
@RC00160 TM    TQETYPE(TQEPTR),B'00000011'                         0171 00221000
         BO    @GL00003                                            0171 00222000
         TM    TQETYPE(TQEPTR),B'00000011'                         0171 00223000
         BNZ   @RF00171                                            0171 00224000
@GL00003 TM    SAVR+7(RBPTR),B'00000001'                           0171 00225000
         BNO   @RF00171                                            0171 00226000
*         DO;                                                      0172 00227000
*           RESPECIFY                                              0173 00228000
*            (R2) RSTD;             /* FIRST DEQ THE TQE FROM THE    */ 00229000
*           R2=ADDR(DEQRET1);       /* TIMER QUEUE BY MEANS OF       */ 00230000
         LA    R2,DEQRET1                                          0174 00231000
*           CALL DEQTQE;            /* THE TQE DEQ ROUTINE.          */ 00232000
         L     @15,CVTQTD00(,CVTREG)                               0175 00233000
         BALR  @14,@15                                             0175 00234000
*           RESPECIFY                                              0176 00235000
*            (R11,                                                 0176 00236000
*             R12,                                                 0176 00237000
*             R13,                                                 0176 00238000
*             R14) RSTD;                                           0176 00239000
*DEQRET1:                                                          0177 00240000
*           TCBTME=0;                                              0177 00241000
DEQRET1  SLR   @10,@10                                             0177 00242000
         ST    @10,TCBTME(,TCBPTR)                                 0177 00243000
*           GENERATE;                                              0178 00244000
              SETLOCK RELEASE,TYPE=DISP,                              CC00245000
               RELATED=('TQE QUEUE',IEAVRT00(NONE))                     00246000
*           RESPECIFY                                              0179 00247000
*            (R11,                                                 0179 00248000
*             R12,                                                 0179 00249000
*             R13,                                                 0179 00250000
*             R14) UNRSTD;                                         0179 00251000
*           RESPECIFY                                              0180 00252000
*            (R2) UNRSTD;                                          0180 00253000
*           RESPECIFY                                              0181 00254000
*            (R0) RSTD;                                            0181 00255000
*           R0=128;                 /* FINALLY, FREE THE TQE         */ 00256000
         LA    R0,128                                              0182 00257000
*           IF TQETYPE='00'B        /* IF TASK TYPE,                 */ 00258000
*             THEN                  /* FROM LSQA (SP253)             */ 00259000
         TM    TQETYPE(TQEPTR),B'00000011'                         0183 00260000
         BNZ   @RF00183                                            0183 00261000
*             GENERATE(ICM  R0,8,LSQA);                            0184 00262000
         ICM  R0,8,LSQA                                                 00263000
*           ELSE                    /* HERE IF NOT TASK TYPE         */ 00264000
*             GENERATE              /* FREE IT FROM SQA (SP245)      */ 00265000
*                 (ICM  R0,8,SQA);                                 0185 00266000
         B     @RC00183                                            0185 00267000
@RF00183 DS    0H                                                  0185 00268000
         ICM  R0,8,SQA                                                  00269000
*           GENERATE                /* NOW FREE THE TQE              */ 00270000
*               (FREEMAIN R,LV=(0),A=(1));                         0186 00271000
@RC00183 DS    0H                                                  0186 00272000
         FREEMAIN R,LV=(0),A=(1)                                        00273000
*           RESPECIFY                                              0187 00274000
*            (R0,                                                  0187 00275000
*             TQEPTR) UNRSTD;                                      0187 00276000
*         END;                                                     0188 00277000
*       ELSE                        /* IF NOT A CANCEL               */ 00278000
*         DO;                                                      0189 00279000
         B     @RC00171                                            0189 00280000
@RF00171 DS    0H                                                  0190 00281000
*           RESPECIFY                                              0190 00282000
*            (R11,                                                 0190 00283000
*             R12,                                                 0190 00284000
*             R13,                                                 0190 00285000
*             R14) RSTD;                                           0190 00286000
*           GENERATE;                                              0191 00287000
              SETLOCK RELEASE,TYPE=DISP,                              CC00288000
               RELATED=('TQE QUEUE',IEAVRT00(NONE))                     00289000
*           RESPECIFY                                              0192 00290000
*            (R11,                                                 0192 00291000
*             R12,                                                 0192 00292000
*             R13,                                                 0192 00293000
*             R14) UNRSTD;                                         0192 00294000
*         END;                                                     0193 00295000
*       ERROR='00'X;                /* INITIALIZE TO NO ERROR        */ 00296000
@RC00171 MVI   ERROR(RBPTR),X'00'                                  0194 00297000
*       IF XSATMTYP='1'B            /* IF REAL/WAIT TYPE TQE,        */ 00298000
*         THEN                      /* MUST CALCULATE INTV LEFT      */ 00299000
         TM    XSATMTYP(RBPTR),B'10000000'                         0195 00300000
         BNO   @RF00195                                            0195 00301000
*         DO;                       /* USING CURRENT TIME.           */ 00302000
*           RESPECIFY                                              0197 00303000
*            (R0,                                                  0197 00304000
*             R1,                                                  0197 00305000
*             R3) RSTD;             /*                       @ZA11878*/ 00306000
*           GENERATE CODE;                                         0198 00307000
               STCK  TIME(RBPTR)          STORE TOD CLOCK               00308000
               BZ    TIMESET1             TIME OK IF CC=0.              00309000
               L     R0,AREASIZE          STCK FAILED. USE TIME SVC     00310000
               GETMAIN  R,LV=(0)          GET STCK AREA FOR TIME SVC    00311000
               LR    R3,R1                SAVE AREA ADDRESS   @ZA11878  00312000
               LR    R0,R1                TIME INTERFACE REGISTER       00313000
               TIME  STCK,(0),ERRET=TTIMENG                             00314000
               MVC   TIME(8,RBPTR),0(R3)                      @ZA11878  00315000
               B     FREEAREA             LEAVE ERROR=0 IF TIME OK      00316000
TTIMENG        MVI   ERROR(RBPTR),X'08'   SET ERROR=8 IF TIME NO GOOD   00317000
FREEAREA       L    R0,AREASIZE                               @ZA11878  00318000
               FREEMAIN  R,LV=(0),A=(3)    FREE STCK AREA     @ZA11878  00319000
TIMESET1       EQU   *                                                  00320000
*           RFY                                                    0199 00321000
*            (R3) UNRSTD;           /*                       @ZA11878*/ 00322000
*           R0=INTVLH;              /* NOW CALCULATE TRUE REAL       */ 00323000
         L     R0,INTVLH(,RBPTR)                                   0200 00324000
*           R1=INTVRH;              /* INTERVAL REMAINING            */ 00325000
         L     R1,INTVRH(,RBPTR)                                   0201 00326000
*           GENERATE CODE;                                         0202 00327000
*                                     /* INTV = INTV - TIME         */  00328000
               SL    R1,TIMERH(RBPTR)                                   00329000
               BC    11,SUBLEFT1                                        00330000
               BCTR  R0,0                                               00331000
SUBLEFT1       SL    R0,TIMELH(RBPTR)                                   00332000
*           INTVLH=R0;                                             0203 00333000
         ST    R0,INTVLH(,RBPTR)                                   0203 00334000
*           INTVRH=R1;                                             0204 00335000
         ST    R1,INTVRH(,RBPTR)                                   0204 00336000
*         END;                                                     0205 00337000
*       IF ERROR^='00'X             /* IF INTV LEFT NOT CORRECT      */ 00338000
*         THEN                      /* THEN GIVE ERROR RETURN        */ 00339000
@RF00195 CLI   ERROR(RBPTR),X'00'                                  0206 00340000
         BE    @RF00206                                            0206 00341000
*         RETCODE=8;                /* CODE = 8                      */ 00342000
         LA    RETCODE,8                                           0207 00343000
*       ELSE                        /* HERE IF INTV IS CORRECT       */ 00344000
*         DO;                                                      0208 00345000
         B     @RC00206                                            0208 00346000
@RF00206 DS    0H                                                  0209 00347000
*           IF INTV(1:1)='1'B       /* IF NEGATIVE TIME LEFT,        */ 00348000
*             THEN                  /* RETURN TIME LEFT OF ZERO      */ 00349000
         TM    INTV(RBPTR),B'10000000'                             0209 00350000
         BNO   @RF00209                                            0209 00351000
*             INTV='0000000000000000'X;                            0210 00352000
         MVC   INTV(8,RBPTR),@CB02935                              0210 00353000
*           IF SAVR(2,31:31)='1'B   /* IF MIC REQUESTED,             */ 00354000
*             THEN                  /* STORE RESULTS IN USER AREA    */ 00355000
@RF00209 TM    SAVR+7(RBPTR),B'00000010'                           0211 00356000
         BNO   @RF00211                                            0211 00357000
*             DO;                                                  0212 00358000
*               RESPECIFY                                          0213 00359000
*                (KEYREG) RSTD;     /* INDICATE USER AREA STORE      */ 00360000
*               XSAUAREA='1'B;      /*                       @YM02417*/ 00361000
         OI    XSAUAREA(RBPTR),B'00001000'                         0214 00362000
*               DO;                 /* MODESET EXTKEY(RBT234)      0215 00363000
*                                      WORKREG(KEYREG)               */ 00364000
*                 KEYREG=TCBRBP;    /* RB PTR FROM TCB               */ 00365000
         L     KEYREG,TCBRBP(,TCBPTR)                              0216 00366000
*                 KEYREG=KEYREG->RBLINK;/* NEXT RB ADDRESS           */ 00367000
         L     KEYREG,RBLINK(,KEYREG)                              0217 00368000
*                 KEYREG=KEYREG->RBOPSW(2);/* PSW KEY FROM RB OLD PSW*/ 00369000
         SLR   @12,@12                                             0218 00370000
         IC    @12,RBOPSW+1(,KEYREG)                               0218 00371000
         LR    KEYREG,@12                                          0218 00372000
*                 SPKA(KEYREG);     /* SET PSW KEY                   */ 00373000
         SPKA  0(KEYREG)                                           0219 00374000
*               END;                /* MODESET EXTKEY(RBT234)      0220 00375000
*                                      WORKREG(KEYREG)               */ 00376000
*               AREA=INTV;          /* STORE RESULTS FOR USER        */ 00377000
         L     @12,INPTR(,RBPTR)                                   0221 00378000
         MVC   AREA(8,@12),INTV(RBPTR)                             0221 00379000
*               GENERATE            /* RETURN TO PROTECT KEY ZERO    */ 00380000
*                   (SPKA  0);                                     0222 00381000
         SPKA  0                                                        00382000
*               XSAUAREA='0'B;      /*                       @YM02417*/ 00383000
         NI    XSAUAREA(RBPTR),B'11110111'                         0223 00384000
*               RESPECIFY                                          0224 00385000
*                (KEYREG) UNRSTD;                                  0224 00386000
*             END;                                                 0225 00387000
*           ELSE                    /* IF TO REQUESTED               */ 00388000
*             DO;                   /* CONVERT TO TIMER UNITS        */ 00389000
         B     @RC00211                                            0226 00390000
@RF00211 DS    0H                                                  0227 00391000
*               R0=INTVLH;                                         0227 00392000
         L     R0,INTVLH(,RBPTR)                                   0227 00393000
*               R1=INTVRH;                                         0228 00394000
         L     R1,INTVRH(,RBPTR)                                   0228 00395000
*               GENERATE;                                          0229 00396000
                    SLDL  R0,13                                         00397000
                    D     R0,KTU                                        00398000
                    SLL  R1,1                                           00399000
*               SAVR(1)=R1;         /* PUT TIMER UNIT RESULTS INTO 0230 00400000
*                                      SAVE FOR R0 RESTORE LATER.    */ 00401000
         ST    R1,SAVR(,RBPTR)                                     0230 00402000
*             END;                                                 0231 00403000
*           RESPECIFY                                              0232 00404000
*            (R0,                                                  0232 00405000
*             R1) UNRSTD;                                          0232 00406000
@RC00211 DS    0H                                                  0233 00407000
*           RETCODE=0;                                             0233 00408000
         SLR   RETCODE,RETCODE                                     0233 00409000
*         END;                                                     0234 00410000
*     END;                                                         0235 00411000
@RC00206 DS    0H                                                  0236 00412000
*   RESPECIFY                                                      0236 00413000
*    (AREAPTR,                                                     0236 00414000
*     INTVPTR,                                                     0236 00415000
*     R11,                                                         0236 00416000
*     R12,                                                         0236 00417000
*     R13,                                                         0236 00418000
*     RETADDR) RSTD;                                               0236 00419000
@RC00150 DS    0H                                                  0237 00420000
*   R13=RETCODE;                    /* SAVE RETCODE ACROSS PGFREE AND   00421000
*                                      ESTAE                         */ 00422000
         LR    R13,RETCODE                                         0237 00423000
*   IF TTSTBASE^<CVTNUCB THEN       /* IF MODULE NOT IN FLPA @ZA02745*/ 00424000
         C     TTSTBASE,CVTNUCB(,CVTREG)                           0238 00425000
         BL    @RF00238                                            0238 00426000
*     DO;                           /* PAGE FREE THE MODULE  @ZA02745*/ 00427000
*       R11=ADDR(FIXSTART);         /* SET REG FOR PAGE FREE INTF    */ 00428000
         LA    R11,FIXSTART                                        0240 00429000
*       R12=ADDR(FIXEND);           /* SET REG FOR PAGE FREE INTF    */ 00430000
         LA    R12,FIXEND                                          0241 00431000
*       GENERATE(PGFREE R,A=(R11),EA=(R12));                       0242 00432000
         PGFREE R,A=(R11),EA=(R12)                                      00433000
*     END;                          /*                       @ZA02745*/ 00434000
*   GENERATE;                                                      0244 00435000
@RF00238 DS    0H                                                  0244 00436000
*                                     /* REMOVE ESTAE       @Z40FPYB*/  00437000
    FESTAE 0,WRKREG=(R11)                                               00438000
*   RETCODE=R13;                                                   0245 00439000
         LR    RETCODE,R13                                         0245 00440000
*   RESPECIFY                                                      0246 00441000
*    (R13) UNRSTD;                                                 0246 00442000
*   AREAPTR=SAVR(1);                /* RESTOR INPUT PARAMETER        */ 00443000
         L     AREAPTR,SAVR(,RBPTR)                                0247 00444000
*   INTVPTR=SAVR(2);                /* REGISTERS AND RET ADDRESS     */ 00445000
         L     INTVPTR,SAVR+4(,RBPTR)                              0248 00446000
*   RETADDR=SAVR(3);                                               0249 00447000
         L     RETADDR,SAVR+8(,RBPTR)                              0249 00448000
*   IF RETCODE^=0                   /* IF TTIMER NOT SUCCESSFUL      */ 00449000
*     THEN                          /* CHECK FOR ERRET               */ 00450000
         LTR   RETCODE,RETCODE                                     0250 00451000
         BZ    @RF00250                                            0250 00452000
*     DO;                                                          0251 00453000
*       IF SAVR(2,30:30)='0'B THEN  /* IF ERRET NOT SPECIFIED        */ 00454000
         TM    SAVR+7(RBPTR),B'00000100'                           0252 00455000
         BNZ   @RF00252                                            0252 00456000
*         GENERATE                  /* ABEND USER 22E                */ 00457000
*             (ABEND  X'22E',,,SYSTEM);                            0253 00458000
         ABEND  X'22E',,,SYSTEM                                         00459000
*     END;                                                         0254 00460000
*   RETURN;                         /* NORMAL RETURN FOR TTIMER      */ 00461000
@EL00001 DS    0H                                                  0255 00462000
@EF00001 DS    0H                                                  0255 00463000
@ER00001 BR    @14                                                 0255 00464000
*   RESPECIFY                                                      0256 00465000
*    (AREAPTR,                                                     0256 00466000
*     INTVPTR,                                                     0256 00467000
*     RETADDR) UNRSTD;                                             0256 00468000
*                                                                  0257 00469000
*/*  *****************************************************************/ 00470000
*/*                                                                  */ 00471000
*/*                         STIMER START                             */ 00472000
*/*                                                                  */ 00473000
*/*  *****************************************************************/ 00474000
*                                                                  0257 00475000
*IGC0004G:                                                         0257 00476000
*   ENTRY;                          /* E.P. FOR STIMER ROUTINE       */ 00477000
@EP00257 DS    0H                                                  0258 00478000
*   RESPECIFY                                                      0258 00479000
*     CVTMAP BASED(CVTREG);                                        0258 00480000
*   RESPECIFY                                                      0259 00481000
*    (R3,                                                          0259 00482000
*     INPUTRG,                                                     0259 00483000
*     INTVPTR,                                                     0259 00484000
*     RETADDR,                                                     0259 00485000
*     ASCBPTR) RSTD;                                               0259 00486000
*   SAVR(1)=INPUTRG;                /* SAVE INPUT REGISTERS          */ 00487000
         ST    INPUTRG,SAVR(,RBPTR)                                0260 00488000
*   SAVR(2)=INTVPTR;                /* DO                            */ 00489000
         ST    INTVPTR,SAVR+4(,RBPTR)                              0261 00490000
*   SAVR(3)=RETADDR;                /* DO                    @YM05461*/ 00491000
         ST    RETADDR,SAVR+8(,RBPTR)                              0262 00492000
*   IF SAVR(1,1:3)='000'B           /* IF BINTVL OR TUINTVL  @YM05461*/ 00493000
*     THEN                          /* USER INTERVAL IS ONE WORD   0263 00494000
*                                                            @YM05461*/ 00495000
         TM    SAVR(RBPTR),B'11100000'                             0263 00496000
         BNZ   @RF00263                                            0263 00497000
*     INTVLH=USERINTH;              /* SAVE USER SPECIFIED INTERL  0264 00498000
*                                                            @YM05461*/ 00499000
         MVC   INTVLH(4,RBPTR),USERINTH(INTVPTR)                   0264 00500000
*   ELSE                            /* USER INTERVAL DOUBLE WORD   0265 00501000
*                                                            @YM05461*/ 00502000
*     INTV=USERINTV;                /* SAVE USER SPECIFIED INTRVL    */ 00503000
         B     @RC00263                                            0265 00504000
@RF00263 MVC   INTV(8,RBPTR),USERINTV(INTVPTR)                     0265 00505000
*   CVTREG=R3;                      /* SET CVT PTR           @YM06037*/ 00506000
@RC00263 LR    CVTREG,R3                                           0266 00507000
*   RESPECIFY                                                      0267 00508000
*    (R3,                                                          0267 00509000
*     INPUTRG,                                                     0267 00510000
*     INTVPTR,                                                     0267 00511000
*     RETADDR) UNRSTD;                                             0267 00512000
*   XSAFLGS='00'X;                  /* INITIALIZE BIT FLAGS          */ 00513000
         MVI   XSAFLGS(RBPTR),X'00'                                0268 00514000
*   RETCODE=0;                      /* INITIALIZE FOR NO ERROR       */ 00515000
         SLR   RETCODE,RETCODE                                     0269 00516000
*   IF SAVR(1,7:8)='00'B            /* IF TASK TYPE REQUEST,         */ 00517000
*     THEN                          /* CANNOT REQUEST TOD OR GMT     */ 00518000
         TM    SAVR(RBPTR),B'00000011'                             0270 00519000
         BNZ   @RF00270                                            0270 00520000
*     DO;                                                          0271 00521000
*       IF SAVR(1,1:4)='0110'B|     /* IF GMT OR                     */ 00522000
*           SAVR(1,1:4)='0111'B     /* TOD SPECIFIED                 */ 00523000
*         THEN                      /* SET UP A RETURN CODE OF 4     */ 00524000
         TM    SAVR(RBPTR),B'01100000'                             0272 00525000
         BNO   @GL00005                                            0272 00526000
         TM    SAVR(RBPTR),B'10010000'                             0272 00527000
         BZ    @RT00272                                            0272 00528000
@GL00005 TM    SAVR(RBPTR),B'01110000'                             0272 00529000
         BNO   @RF00272                                            0272 00530000
         TM    SAVR(RBPTR),B'10000000'                             0272 00531000
         BNZ   @RF00272                                            0272 00532000
@RT00272 DS    0H                                                  0273 00533000
*         RETCODE=4;                                               0273 00534000
         LA    RETCODE,4                                           0273 00535000
*     END;                                                         0274 00536000
*   ELSE                            /* IF REAL/WAIT TYPE REQUEST,    */ 00537000
*     DO;                           /* MUST GET TIME OF DAY          */ 00538000
         B     @RC00270                                            0275 00539000
@RF00270 DS    0H                                                  0276 00540000
*       RESPECIFY                                                  0276 00541000
*        (R0,                                                      0276 00542000
*         R1,                                                      0276 00543000
*         R3) RSTD;                 /*                       @ZA11878*/ 00544000
*       GENERATE CODE;                                             0277 00545000
           STCK   TIME(RBPTR)            STORE TIME OF DAY CLOCK        00546000
           BZ     TIMESET2               TIME OK IF CC=0.               00547000
           L      R0,AREASIZE            STCK FAILED. USE TIME SVC.     00548000
           GETMAIN  R,LV=(0)             GET STCK AREA FOR TIME SVC     00549000
           LR     R3,R1                  SAVE AREA ADDR       @ZA11878  00550000
           LR     R0,R1                  TIME INTERFACE REGISTER        00551000
           TIME   STCK,(0),ERRET=STIMENG                                00552000
           MVC    TIME(8,RBPTR),0(R3)                         @ZA11878  00553000
           MVI    ERROR(RBPTR),X'00'     ERROR=0 MEANS TIME OF DAY OK   00554000
           B      AREAFREE                                              00555000
STIMENG    MVI    ERROR(RBPTR),X'08'     ERROR=8 MEANS TIME OF DAY NG   00556000
AREAFREE   L      R0,AREASIZE                                 @ZA11878  00557000
           FREEMAIN  R,LV=(0),A=(3)      FREE STCK AREA       @ZA11878  00558000
           IC     RETCODE,ERROR(RBPTR)   SET R15 TO ERROR CODE          00559000
TIMESET2   EQU    *                                                     00560000
*     END;                                                         0278 00561000
*   RESPECIFY                                                      0279 00562000
*    (R0,                                                          0279 00563000
*     R1,                                                          0279 00564000
*     R3) UNRSTD;                   /*                       @ZA11878*/ 00565000
@RC00270 DS    0H                                                  0280 00566000
*   IF SAVR(1,1:4)='0110'B|         /* IF PACKED DECIMAL,            */ 00567000
*       SAVR(1,1:4)='0111'B|SAVR(1,1:4)='0011'B THEN/* CONVERT TO  0280 00568000
*                                      BINARY - UNITS                */ 00569000
         TM    SAVR(RBPTR),B'01100000'                             0280 00570000
         BNO   @GL00007                                            0280 00571000
         TM    SAVR(RBPTR),B'10010000'                             0280 00572000
         BZ    @RT00280                                            0280 00573000
@GL00007 TM    SAVR(RBPTR),B'01110000'                             0280 00574000
         BNO   @GL00006                                            0280 00575000
         TM    SAVR(RBPTR),B'10000000'                             0280 00576000
         BZ    @RT00280                                            0280 00577000
@GL00006 TM    SAVR(RBPTR),B'00110000'                             0280 00578000
         BNO   @RF00280                                            0280 00579000
         TM    SAVR(RBPTR),B'11000000'                             0280 00580000
         BNZ   @RF00280                                            0280 00581000
@RT00280 DS    0H                                                  0281 00582000
*     DO;                           /* OF HUNDREDTHS OF SECONDS.     */ 00583000
*       RESPECIFY                                                  0282 00584000
*        (X,                                                       0282 00585000
*         PROBE,                                                   0282 00586000
*         BINSUM,                                                  0282 00587000
*         BINVAL) RSTD;                                            0282 00588000
*       BINSUM=0;                   /* INITIALIZE RESULTS TO ZERO    */ 00589000
         SLR   BINSUM,BINSUM                                       0283 00590000
*       PROBE=RBPTR;                /* INITIALIZE PROBE POINTER      */ 00591000
         LR    PROBE,RBPTR                                         0284 00592000
*       DO X=4 TO 1 BY-1;                                          0285 00593000
         LA    X,4                                                 0285 00594000
@DL00285 DS    0H                                                  0286 00595000
*         PACK(STCKAREA(1:64),PROBE->INTV(1:16));/* PACK             */ 00596000
         PACK  STCKAREA(8,RBPTR),INTV(2,PROBE)                     0286 00597000
*         STCKAREA(61:64)='1111'B;  /* ENSURE POSITIVE SIGN          */ 00598000
         OI    STCKAREA+7(RBPTR),B'00001111'                       0287 00599000
*         GENERATE                  /* CONVERT TO BINARY             */ 00600000
*             (CVB BINVAL,STCKAREA(RBPTR));                        0288 00601000
         CVB BINVAL,STCKAREA(RBPTR)                                     00602000
*         BINSUM=BINSUM+(BINVAL*K(X));/* ACCUMULATE SECS/100         */ 00603000
         LR    @10,X                                               0289 00604000
         SLA   @10,2                                               0289 00605000
         LR    @03,BINVAL                                          0289 00606000
         M     @02,K-4(@10)                                        0289 00607000
         ALR   BINSUM,@03                                          0289 00608000
*         PROBE=PROBE+2;            /* MOVE TO NXT PAIR              */ 00609000
         AL    PROBE,@CF00108                                      0290 00610000
*       END;                        /* BELOW GENERATE DOES         0291 00611000
*                                      INTV(1:32)=BINSUM, BUT WITHOUT   00612000
*                                      USE IF TEMPORARIES            */ 00613000
         BCTR  X,0                                                 0291 00614000
         LTR   X,X                                                 0291 00615000
         BP    @DL00285                                            0291 00616000
*       GENERATE                    /* SAVE CONVERTED VALUE          */ 00617000
*           (ST  BINSUM,INTV(RBPTR));                              0292 00618000
         ST  BINSUM,INTV(RBPTR)                                         00619000
*       RESPECIFY                                                  0293 00620000
*        (X,                                                       0293 00621000
*         PROBE,                                                   0293 00622000
*         BINVAL) UNRSTD;                                          0293 00623000
*       IF SAVR(1,1:4)='0110'B|     /* IF GMT OR                     */ 00624000
*           SAVR(1,1:4)='0111'B     /* TOD SPECIFIED,                */ 00625000
*         THEN                      /* ENSURE 2400 NOT EXCEEDED.     */ 00626000
         TM    SAVR(RBPTR),B'01100000'                             0294 00627000
         BNO   @GL00008                                            0294 00628000
         TM    SAVR(RBPTR),B'10010000'                             0294 00629000
         BZ    @RT00294                                            0294 00630000
@GL00008 TM    SAVR(RBPTR),B'01110000'                             0294 00631000
         BNO   @RF00294                                            0294 00632000
         TM    SAVR(RBPTR),B'10000000'                             0294 00633000
         BNZ   @RF00294                                            0294 00634000
@RT00294 DS    0H                                                  0295 00635000
*         IF BINSUM>8640000         /* IF MORE THAN 2400 HOURS,      */ 00636000
*           THEN                    /* INDICATE USER ERROR BY        */ 00637000
         CL    BINSUM,@CF02956                                     0295 00638000
         BNH   @RF00295                                            0295 00639000
*           RETCODE=4;              /* SETTING RETCODE TO 4.         */ 00640000
         LA    RETCODE,4                                           0296 00641000
*       RESPECIFY                                                  0297 00642000
*        (BINSUM) UNRSTD;                                          0297 00643000
@RF00295 DS    0H                                                  0297 00644000
@RF00294 DS    0H                                                  0298 00645000
*     END;                                                         0298 00646000
*   IF RETCODE=0                    /* IF NO ERROR                   */ 00647000
*     THEN                          /* PROCEED                       */ 00648000
@RF00280 LTR   RETCODE,RETCODE                                     0299 00649000
         BNZ   @RF00299                                            0299 00650000
*     DO;                                                          0300 00651000
*       RESPECIFY                                                  0301 00652000
*        (R11,                                                     0301 00653000
*         R12,                                                     0301 00654000
*         R13,                                                     0301 00655000
*         R14) RSTD;                                               0301 00656000
*       GEN(LA    TTSTBASE,0(0,TTSTBASE));/* CLEAR HIGH ORDER BYTE OF   00657000
*                                      BASE REG FOR NEXT ADDRESS   0302 00658000
*                                      COMPARISON            @ZA02745*/ 00659000
         LA    TTSTBASE,0(0,TTSTBASE)                                   00660000
*       IF TTSTBASE^<CVTNUCB THEN   /* IF MODULE NOT IN FLPA @ZA02745*/ 00661000
         C     TTSTBASE,CVTNUCB(,CVTREG)                           0303 00662000
         BL    @RF00303                                            0303 00663000
*         DO;                       /* PAGE FIX THE MODULE   @ZA02745*/ 00664000
*           R11=ADDR(FIXSTART);     /* SET REG FOR PAGE FIX INTF     */ 00665000
         LA    R11,FIXSTART                                        0305 00666000
*           R12=ADDR(FIXEND);       /* SET REG FOR PAGE FIX INTF     */ 00667000
         LA    R12,FIXEND                                          0306 00668000
*           R13=ADDR(PGFIXECB);     /* SET REG FOR PAGE FIX INTF     */ 00669000
         LA    R13,PGFIXECB(,RBPTR)                                0307 00670000
*           PGFIXECB=0;             /* INITIALIZE THE PGFIX ECB      */ 00671000
         SLR   @10,@10                                             0308 00672000
         ST    @10,PGFIXECB(,RBPTR)                                0308 00673000
*           GENERATE(PGFIX   R,A=(R11),EA=(R12),ECB=(R13),LONG=N); 0309 00674000
         PGFIX   R,A=(R11),EA=(R12),ECB=(R13),LONG=N                    00675000
*           IF RETCODE=8 THEN       /*                       @ZA07160*/ 00676000
         C     RETCODE,@CF00036                                    0310 00677000
         BNE   @RF00310                                            0310 00678000
*             DO;                                                  0311 00679000
*               R13=ADDR(PGFIXECB); /* SET REG FOR WAIT              */ 00680000
         LA    R13,PGFIXECB(,RBPTR)                                0312 00681000
*               GEN(WAIT  1,ECB=(R13));/* WAIT FOR PAGE FIX          */ 00682000
         WAIT  1,ECB=(R13)                                              00683000
*             END;                                                 0314 00684000
*         END;                      /*                       @ZA02745*/ 00685000
@RF00310 DS    0H                                                  0316 00686000
*       GEN REFS(PSALITA,FLC);                                     0316 00687000
@RF00303 DS    0H                                                  0316 00688000
*                              /* GET DISP AND LOCAL LOCKS */           00689000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                       CC00690000
               RELATED=(MEMORY,IEAVRT00(NONE,NONE))                     00691000
         SETLOCK OBTAIN,TYPE=DISP,MODE=UNCOND,                        cc00692000
               RELATED=('TQE QUEUE',IEAVRT00(NONE))                     00693000
*       RESPECIFY                                                  0317 00694000
*        (R11,                                                     0317 00695000
*         R12,                                                     0317 00696000
*         R13,                                                     0317 00697000
*         R14) UNRSTD;                                             0317 00698000
*       RESPECIFY                                                  0318 00699000
*        (TQEPTR,                                                  0318 00700000
*         R2) RSTD;                                                0318 00701000
*       TQEPTR=TCBTME;                                             0319 00702000
         L     TQEPTR,TCBTME(,TCBPTR)                              0319 00703000
*       DO WHILE TCBTME^=0&TQETYPE='01'B&/* CANNOT PROCEED WHILE     */ 00704000
*             TQEOFF='0'B;          /* THERE IS A WAIT TQE           */ 00705000
         B     @DE00320                                            0320 00706000
@DL00320 DS    0H                                                  0321 00707000
*         R2=ADDR(DEQRET2);         /* IF THERE IS ONE...            */ 00708000
         LA    R2,DEQRET2                                          0321 00709000
*         CALL DEQTQE;              /* 1. DEQ THE TQE                */ 00710000
         L     @15,CVTQTD00(,CVTREG)                               0322 00711000
         BALR  @14,@15                                             0322 00712000
*DEQRET2:                                                          0323 00713000
*         TQEVAL='0000000000000000'X;/* 2. ZERO ITS INTERVAL         */ 00714000
DEQRET2  MVC   TQEVAL(8,TQEPTR),@CB02935                           0323 00715000
*         R2=ADDR(ENQRET1);         /* FOR IMMED INTERPT             */ 00716000
         LA    R2,ENQRET1                                          0324 00717000
*         CALL ENQTQE;              /* 3. REENQUEUE THE TQE          */ 00718000
         L     @15,CVTQTE00(,CVTREG)                               0325 00719000
         BALR  @14,@15                                             0325 00720000
*         RESPECIFY                                                0326 00721000
*          (R11,                                                   0326 00722000
*           R12,                                                   0326 00723000
*           R13,                                                   0326 00724000
*           R14) RSTD;                                             0326 00725000
*ENQRET1:                                                          0327 00726000
*         GENERATE CODE;                                           0327 00727000
ENQRET1  DS    0H                                                  0327 00728000
*                                          /* 4.  ALLOW INTERRUPTS  */  00729000
            SETLOCK RELEASE,TYPE=LOCAL,                               CC00730000
               RELATED=(MEMORY,IEAVRT00(NONE))                          00731000
            SETLOCK RELEASE,TYPE=DISP,                                CC00732000
               RELATED=('TQE QUEUE',IEAVRT00(NONE))                     00733000
            SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                    CC00734000
               RELATED=(MEMORY,IEAVRT00(NONE))                          00735000
            SETLOCK OBTAIN,TYPE=DISP,MODE=UNCOND,                     CC00736000
               RELATED=('TQE QUEUE',IEAVRT00(NONE))                     00737000
*         RESPECIFY                                                0328 00738000
*          (R11,                                                   0328 00739000
*           R12,                                                   0328 00740000
*           R13,                                                   0328 00741000
*           R14) UNRSTD;                                           0328 00742000
*       END;                                                       0329 00743000
@DE00320 L     @14,TCBTME(,TCBPTR)                                 0329 00744000
         LTR   @14,@14                                             0329 00745000
         BZ    @DC00320                                            0329 00746000
         TM    TQETYPE(TQEPTR),B'00000001'                         0329 00747000
         BNO   @DC00320                                            0329 00748000
         TM    TQETYPE(TQEPTR),B'00000010'                         0329 00749000
         BNZ   @DC00320                                            0329 00750000
         TM    TQEOFF(TQEPTR),B'10000000'                          0329 00751000
         BZ    @DL00320                                            0329 00752000
@DC00320 DS    0H                                                  0330 00753000
*       XSATMOK='0'B;               /* INITIALIZE TO NEED NEW TQE    */ 00754000
         NI    XSATMOK(RBPTR),B'10111111'                          0330 00755000
*       TCBTQET='0'B;               /* CLEAR HO BIT FOR FREEMAIN     */ 00756000
         NI    TCBTQET(TCBPTR),B'01111111'                         0331 00757000
*       TQEPTR=TCBTME;                                             0332 00758000
         L     TQEPTR,TCBTME(,TCBPTR)                              0332 00759000
*       IF TQEPTR^=0&TQEOFF='0'B    /* IF THERE IS A TQE ON QUEUE    */ 00760000
*         THEN                      /* GET RID OF IT.                */ 00761000
         LTR   TQEPTR,TQEPTR                                       0333 00762000
         BZ    @RF00333                                            0333 00763000
         TM    TQEOFF(TQEPTR),B'10000000'                          0333 00764000
         BNZ   @RF00333                                            0333 00765000
*         DO;                                                      0334 00766000
*           R2=ADDR(DEQRET3);                                      0335 00767000
         LA    R2,DEQRET3                                          0335 00768000
*           CALL DEQTQE;            /* DEQ THE OLD TQE               */ 00769000
         L     @15,CVTQTD00(,CVTREG)                               0336 00770000
         BALR  @14,@15                                             0336 00771000
*           RESPECIFY                                              0337 00772000
*            (R11,                                                 0337 00773000
*             R12,                                                 0337 00774000
*             R13,                                                 0337 00775000
*             R14) RSTD;                                           0337 00776000
*DEQRET3:                                                          0338 00777000
*           TCBTME=0;                                              0338 00778000
DEQRET3  SLR   @10,@10                                             0338 00779000
         ST    @10,TCBTME(,TCBPTR)                                 0338 00780000
*           GENERATE;                                              0339 00781000
*                                     /* NO LONGER NEED LOCK        */  00782000
                SETLOCK RELEASE,TYPE=DISP,                            CC00783000
               RELATED=('TQE QUEUE',IEAVRT00(NONE))                     00784000
*           RESPECIFY                                              0340 00785000
*            (R11,                                                 0340 00786000
*             R12,                                                 0340 00787000
*             R13,                                                 0340 00788000
*             R14) UNRSTD;          /* IF OLD TQE TYPE= NEW RQST,    */ 00789000
*           IF(TQETYPE='00'B&SAVR(1,7:8)='00'B)|(TQETYPE^='00'B&SAVR(1, 00790000
*               7:8)^='00'B) THEN   /* CAN REUSE CORE OF OLD TQE.    */ 00791000
         TM    TQETYPE(TQEPTR),B'00000011'                         0341 00792000
         BNZ   @GL00012                                            0341 00793000
         TM    SAVR(RBPTR),B'00000011'                             0341 00794000
         BZ    @RT00341                                            0341 00795000
@GL00012 TM    TQETYPE(TQEPTR),B'00000011'                         0341 00796000
         BZ    @RF00341                                            0341 00797000
         TM    SAVR(RBPTR),B'00000011'                             0341 00798000
         BZ    @RF00341                                            0341 00799000
@RT00341 DS    0H                                                  0342 00800000
*             XSATMOK='1'B;         /* INDICATE OK TO USE OLD TQE    */ 00801000
         OI    XSATMOK(RBPTR),B'01000000'                          0342 00802000
*           ELSE                    /* IF OLD TQE TYPE IS NOT THE  0343 00803000
*                                      SAME AS THE NEW REQUEST,      */ 00804000
*             DO;                   /* THE OLD TQE MUST BE FREED.    */ 00805000
         B     @RC00341                                            0343 00806000
@RF00341 DS    0H                                                  0344 00807000
*               RESPECIFY                                          0344 00808000
*                (R0,                                              0344 00809000
*                 R3) RSTD;                                        0344 00810000
*               R0=128;             /* PREPARE FOR FREEMAIN- (TCB PTR   00811000
*                                      AND ASCBPTR ALRDY SET)        */ 00812000
         LA    R0,128                                              0345 00813000
*               IF TQETYPE='00'B    /* IF IT WAS A TASK TYPE TQE,    */ 00814000
*                 THEN              /* FREE IT FROM LSQA (SP253).    */ 00815000
         TM    TQETYPE(TQEPTR),B'00000011'                         0346 00816000
         BNZ   @RF00346                                            0346 00817000
*                 R3=253;                                          0347 00818000
         LA    R3,253                                              0347 00819000
*               ELSE                /* FROM SQA IF REAL TYPE TQE     */ 00820000
*                 R3=245;                                          0348 00821000
         B     @RC00346                                            0348 00822000
@RF00346 LA    R3,245                                              0348 00823000
*               RESPECIFY                                          0349 00824000
*                (R11,                                             0349 00825000
*                 R14) RSTD;                                       0349 00826000
@RC00346 DS    0H                                                  0350 00827000
*               R11=TQEPTR;         /* FREE THE TQE                  */ 00828000
         LR    R11,TQEPTR                                          0350 00829000
*               R14=R3;                                            0351 00830000
         LR    R14,R3                                              0351 00831000
*               DO;                 /* FREEMAIN(RU) LV(R0)A(FREESTRG)   00832000
*                                      SP(R14) BRANCH                */ 00833000
*                 RESPECIFY                                        0353 00834000
*                  (GPR01F,                                        0353 00835000
*                   GPR03F,                                        0353 00836000
*                   GPR00F) RESTRICTED;                            0353 00837000
*                 GPR01F=0;         /* REG 1 MUST BE ZERO            */ 00838000
         SLR   GPR01F,GPR01F                                       0354 00839000
*                 GPR03F=3;         /* SET TYPE                      */ 00840000
         LA    GPR03F,3                                            0355 00841000
*                 GPR00F=R0;        /* LENGTH REQUESTED              */ 00842000
*                 GPR01F=ADDR(FREESTRG);/* SET REGISTER ONE          */ 00843000
         LR    GPR01F,R11                                          0357 00844000
*                 GPR03F=GPR03F+((R14)*256);/* SUBPOOL VALUE         */ 00845000
         LR    @12,R14                                             0358 00846000
         SLA   @12,8                                               0358 00847000
         ALR   GPR03F,@12                                          0358 00848000
*                 CALL CVTCRMN;     /* BRANCH ENTRY POINT            */ 00849000
         L     @15,CVTCRMN(,CVTREG)                                0359 00850000
         BALR  @14,@15                                             0359 00851000
*                 RESPECIFY                                        0360 00852000
*                  (GPR01F,                                        0360 00853000
*                   GPR03F,                                        0360 00854000
*                   GPR00F) UNRESTRICTED;                          0360 00855000
*               END;                /* FREEMAIN(RU) LV(R0)A(FREESTRG)   00856000
*                                      SP(R14) BRANCH                */ 00857000
*               RESPECIFY                                          0362 00858000
*                (R0,                                              0362 00859000
*                 R3,                                              0362 00860000
*                 R11,                                             0362 00861000
*                 R14) UNRSTD;                                     0362 00862000
*             END;                                                 0363 00863000
*         END;                                                     0364 00864000
*       ELSE                        /* IF THERE IS NO OLD TQE,       */ 00865000
*         DO;                                                      0365 00866000
         B     @RC00333                                            0365 00867000
@RF00333 DS    0H                                                  0366 00868000
*           RESPECIFY                                              0366 00869000
*            (R11,                                                 0366 00870000
*             R12,                                                 0366 00871000
*             R13,                                                 0366 00872000
*             R14) RSTD;            /* FREE DISPATCHER LOCK          */ 00873000
*           GENERATE;                                              0367 00874000
              SETLOCK RELEASE,TYPE=DISP,                              CC00875000
               RELATED=('TQE QUEUE',IEAVRT00(NONE))                     00876000
*           RESPECIFY                                              0368 00877000
*            (R11,                                                 0368 00878000
*             R12,                                                 0368 00879000
*             R13,                                                 0368 00880000
*             R14) UNRSTD;                                         0368 00881000
*         END;                                                     0369 00882000
*       IF XSATMOK='0'B             /* IF A NEW TQE IS NEEDED,       */ 00883000
*         THEN                      /* GET CORE AND BUILD IT.        */ 00884000
@RC00333 TM    XSATMOK(RBPTR),B'01000000'                          0370 00885000
         BNZ   @RF00370                                            0370 00886000
*         DO;                                                      0371 00887000
*           RESPECIFY                                              0372 00888000
*            (R0,                                                  0372 00889000
*             R3) RSTD;                                            0372 00890000
*           R0=128;                 /* PREPARE FOR GETMAIN=(TCBPTR 0373 00891000
*                                      AND ASCBPTR ALREADY SETUP)    */ 00892000
         LA    R0,128                                              0373 00893000
*           IF SAVR(1,7:8)='00'B    /* IF TASK TYPE REQUEST,         */ 00894000
*             THEN                  /* GET CORE FROM LSQA.           */ 00895000
         TM    SAVR(RBPTR),B'00000011'                             0374 00896000
         BNZ   @RF00374                                            0374 00897000
*             R3=253;                                              0375 00898000
         LA    R3,253                                              0375 00899000
*           ELSE                    /* FROM SQA IF REAL/WAIT TYPE    */ 00900000
*             R3=245;                                              0376 00901000
         B     @RC00374                                            0376 00902000
@RF00374 LA    R3,245                                              0376 00903000
*           RESPECIFY                                              0377 00904000
*            (R14) RSTD;            /* GET CORE FOR TQE              */ 00905000
@RC00374 DS    0H                                                  0378 00906000
*           R14=R3;                                                0378 00907000
         LR    R14,R3                                              0378 00908000
*           DO;                     /* GETMAIN (RU) LV(R0) SP(R14) 0379 00909000
*                                      BRANCH                        */ 00910000
*             RESPECIFY                                            0380 00911000
*              (GPR01F,                                            0380 00912000
*               GPR03F,                                            0380 00913000
*               GPR00F) RESTRICTED;                                0380 00914000
*             GPR01F=0;             /* REG 1 MUST BE ZERO            */ 00915000
         SLR   GPR01F,GPR01F                                       0381 00916000
*             GPR03F=2;             /* RU-TYPE GETMAIN               */ 00917000
         LA    GPR03F,2                                            0382 00918000
*             GPR00F=R0;            /* LENGTH REQUESTED              */ 00919000
*             GPR03F=GPR03F|((R14)*256);/* SP IN BYTE 2              */ 00920000
         LR    @12,R14                                             0384 00921000
         SLA   @12,8                                               0384 00922000
         OR    GPR03F,@12                                          0384 00923000
*             CALL CVTCRMN;         /* BRANCH ENTRY POINT            */ 00924000
         L     @15,CVTCRMN(,CVTREG)                                0385 00925000
         BALR  @14,@15                                             0385 00926000
*             RESPECIFY                                            0386 00927000
*              (GPR01F,                                            0386 00928000
*               GPR03F,                                            0386 00929000
*               GPR00F) UNRESTRICTED;                              0386 00930000
*           END;                    /* GETMAIN (RU) LV(R0) SP(R14) 0387 00931000
*                                      BRANCH                        */ 00932000
*           RESPECIFY                                              0388 00933000
*            (R0,                                                  0388 00934000
*             R14) UNRSTD;          /* SET UP TQE POINTER NOW BUILD     00935000
*                                      THE BASIC PORTION OF THE TQE     00936000
*                                      IN THE NEW CORE               */ 00937000
*           TQETQE=' TQE';          /* PUT IN CONTROL BLOCK ID       */ 00938000
         MVC   TQETQE(4,TQEPTR),@CC02729                           0389 00939000
*           TQEAID=ASCBASID;        /* SAVE REQUESTORS ASID          */ 00940000
         LH    @14,ASCBASID(,ASCBPTR)                              0390 00941000
         N     @14,@CF03004                                        0390 00942000
         STH   @14,TQEAID(,TQEPTR)                                 0390 00943000
*           TQESADDR=0;             /* NO PP SAVE AREA YET           */ 00944000
         SLR   @14,@14                                             0391 00945000
         ST    @14,TQESADDR(,TQEPTR)                               0391 00946000
*           TQETCB=TCBPTR;          /* SAVE REQUESTORS TCB ADDR      */ 00947000
         ST    TCBPTR,TQETCB(,TQEPTR)                              0392 00948000
*           TQEASCB=ASCBPTR;        /* SAVE REQUESTORS ASCB ADDR     */ 00949000
         ST    ASCBPTR,TQEASCB(,TQEPTR)                            0393 00950000
*         END;                      /* NOW BUILD THE COMMON PORTION     00951000
*                                      OF THE TQE                    */ 00952000
*       TQEFLGS='80'X;              /* INITIALIZE FLAGS              */ 00953000
@RF00370 MVI   TQEFLGS(TQEPTR),X'80'                               0395 00954000
*       TQEFLGS2='40'X;             /* INITIALIZE FLAGS              */ 00955000
         MVI   TQEFLGS2(TQEPTR),X'40'                              0396 00956000
*       TQEFLGS3='00'X;             /* INITIALIZE FLAGS      @Z40FPYB*/ 00957000
         MVI   TQEFLGS3(TQEPTR),X'00'                              0397 00958000
*       TQEEXIT=SAVR(1);            /* SAVE USER EXIT ADDRESS        */ 00959000
         L     @14,SAVR(,RBPTR)                                    0398 00960000
         ST    @14,TQEEXIT(,TQEPTR)                                0398 00961000
*       IF SAVR(1,9:32)^='000000'X  /* IF NO USER EXIT SPECIFIED     */ 00962000
*         THEN                      /* INDICATE THIS IN TQEFLGS      */ 00963000
         CLC   SAVR+1(3,RBPTR),@CB02971                            0399 00964000
         BE    @RF00399                                            0399 00965000
*         TQEXITSP='1'B;                                           0400 00966000
         OI    TQEXITSP(TQEPTR),B'00000100'                        0400 00967000
*       TQELHPSW=RBLINK->RBOPSW(1:4);/* SAVE USER PSW - LEFT HALF    */ 00968000
@RF00399 L     @14,RBLINK(,RBPTR)                                  0401 00969000
         MVC   TQELHPSW(4,TQEPTR),RBOPSW(@14)                      0401 00970000
*       IF SAVR(1,1:4)='0110'B|     /* IF INTV IN BINARY,            */ 00971000
*           SAVR(1,1:4)='0111'B|SAVR(1,1:4)='0011'B|SAVR(1,1:4)='0001'B 00972000
*         THEN                      /* CONVERT TO TOD                */ 00973000
         TM    SAVR(RBPTR),B'01100000'                             0402 00974000
         BNO   @GL00017                                            0402 00975000
         TM    SAVR(RBPTR),B'10010000'                             0402 00976000
         BZ    @RT00402                                            0402 00977000
@GL00017 TM    SAVR(RBPTR),B'01110000'                             0402 00978000
         BNO   @GL00016                                            0402 00979000
         TM    SAVR(RBPTR),B'10000000'                             0402 00980000
         BZ    @RT00402                                            0402 00981000
@GL00016 TM    SAVR(RBPTR),B'00110000'                             0402 00982000
         BNO   @GL00015                                            0402 00983000
         TM    SAVR(RBPTR),B'11000000'                             0402 00984000
         BZ    @RT00402                                            0402 00985000
@GL00015 TM    SAVR(RBPTR),B'00010000'                             0402 00986000
         BNO   @RF00402                                            0402 00987000
         TM    SAVR(RBPTR),B'11100000'                             0402 00988000
         BNZ   @RF00402                                            0402 00989000
@RT00402 DS    0H                                                  0403 00990000
*         DO;                       /* CLOCK UNITS                   */ 00991000
*           R3=INTVLH;                                             0404 00992000
         L     R3,INTVLH(,RBPTR)                                   0404 00993000
*           GENERATE                /* BIN * 10,000 = CLK            */ 00994000
*               (M     R2,K10000);                                 0405 00995000
         M     R2,K10000                                                00996000
*           INTVLH=R2;              /* LEFT HALF OF CLOCK UNITS      */ 00997000
         ST    R2,INTVLH(,RBPTR)                                   0406 00998000
*           INTVRH=R3;              /* RIGHT HALF OF CLOCK UNITS     */ 00999000
         ST    R3,INTVRH(,RBPTR)                                   0407 01000000
*         END;                                                     0408 01001000
*       ELSE                        /* IF MICVL, VALUE IS ALREADY    */ 01002000
*         DO;                       /* IN TOD CLOCK UNITS.           */ 01003000
         B     @RC00402                                            0409 01004000
@RF00402 DS    0H                                                  0410 01005000
*           IF SAVR(1,1:4)='0000'B  /* IF TUINTVL SPECIFIED,         */ 01006000
*             THEN                  /* CONVERT TO TOD CLOCK UNITS    */ 01007000
         TM    SAVR(RBPTR),B'11110000'                             0410 01008000
         BNZ   @RF00410                                            0410 01009000
*             DO;                                                  0411 01010000
*               XSAHIGH='0'B;       /* INITIALIZE TO TUS<2**31       */ 01011000
         NI    XSAHIGH(RBPTR),B'11011111'                          0412 01012000
*               IF INTV(1:1)='1'B   /* IF TUS TOO HIGH,              */ 01013000
*                 THEN              /* REDUCE SO HO BIT IS ZERO.     */ 01014000
         TM    INTV(RBPTR),B'10000000'                             0413 01015000
         BNO   @RF00413                                            0413 01016000
*                 DO;                                              0414 01017000
*                   INTV(1:1)='0'B; /* TURN OFF HO BIT               */ 01018000
         NI    INTV(RBPTR),B'01111111'                             0415 01019000
*                   XSAHIGH='1'B;   /* REMEMBER THIS ACTION          */ 01020000
         OI    XSAHIGH(RBPTR),B'00100000'                          0416 01021000
*                 END;                                             0417 01022000
*               R3=INTVLH;                                         0418 01023000
@RF00413 L     R3,INTVLH(,RBPTR)                                   0418 01024000
*               GENERATE CODE;                                     0419 01025000
                      M     R2,KTU         TU * 26.01466 * CLK          01026000
                      SRDL  R2,14          SHIFT SO BIT 51 = MICROSEC   01027000
*               IF XSAHIGH='1'B     /* IF HO BIT OF TUS WAS ON       */ 01028000
*                 THEN              /* ADD IN ITS VALUE IN US.       */ 01029000
         TM    XSAHIGH(RBPTR),B'00100000'                          0420 01030000
         BNO   @RF00420                                            0420 01031000
*                 DO;                                              0421 01032000
*                   GENERATE CODE;                                 0422 01033000
                            AL   R3,KTURH    ADD IN RH OF MICROSECNDS   01034000
                            BC   12,ADDLEFT1 BRANCH IF NO CARRY         01035000
                            AL   R2,ONE    ADD IN CARRY                 01036000
ADDLEFT1                    A    R2,KTULH    ADD IN LH OF MICROSECNDS   01037000
*                 END;                                             0423 01038000
*               INTVLH=R2;                                         0424 01039000
@RF00420 ST    R2,INTVLH(,RBPTR)                                   0424 01040000
*               INTVRH=R3;                                         0425 01041000
         ST    R3,INTVRH(,RBPTR)                                   0425 01042000
*             END;                                                 0426 01043000
*         END;                      /* NOW HAVE INTV=INTERVAL IN   0427 01044000
*                                      MICROSECONDS- BIT 51= 1 US    */ 01045000
@RF00410 DS    0H                                                  0428 01046000
*       IF SAVR(1,1:4)='0110'B|     /* IF SPECIFIC TIME OF DAY,      */ 01047000
*           SAVR(1,1:4)='0111'B THEN/* CHANGE TO CORRECT TODC VAL    */ 01048000
@RC00402 TM    SAVR(RBPTR),B'01100000'                             0428 01049000
         BNO   @GL00018                                            0428 01050000
         TM    SAVR(RBPTR),B'10010000'                             0428 01051000
         BZ    @RT00428                                            0428 01052000
@GL00018 TM    SAVR(RBPTR),B'01110000'                             0428 01053000
         BNO   @RF00428                                            0428 01054000
         TM    SAVR(RBPTR),B'10000000'                             0428 01055000
         BNZ   @RF00428                                            0428 01056000
@RT00428 DS    0H                                                  0429 01057000
*         DO;                                                      0429 01058000
*           IF SAVR(1,1:4)='0111'B  /* IF LOCAL TOD SPECIFIED,       */ 01059000
*             THEN                  /* INITALIZE TZ TO 0 AND         */ 01060000
         TM    SAVR(RBPTR),B'01110000'                             0430 01061000
         BNO   @RF00430                                            0430 01062000
         TM    SAVR(RBPTR),B'10000000'                             0430 01063000
         BNZ   @RF00430                                            0430 01064000
*             DO;                                                  0431 01065000
*               TQETOD='1'B;        /* PUT TOD BIT ON IN TQE         */ 01066000
         OI    TQETOD(TQEPTR),B'01000000'                          0432 01067000
*               TZ=0;                                              0433 01068000
         SLR   @14,@14                                             0433 01069000
         ST    @14,TZ(,RBPTR)                                      0433 01070000
*             END;                                                 0434 01071000
*           ELSE                    /* IF GMT SPECIFIED, MUST        */ 01072000
*             TZ=CVTTZ;             /* USE TIME ZONE IN CALCS        */ 01073000
         B     @RC00430                                            0435 01074000
@RF00430 L     @14,CVTTZ(,CVTREG)                                  0435 01075000
         ST    @14,TZ(,RBPTR)                                      0435 01076000
*           RESPECIFY                                              0436 01077000
*            (TPCPTR) RSTD;                                        0436 01078000
@RC00430 DS    0H                                                  0437 01079000
*           TPCPTR=CVTTPC;                                         0437 01080000
         L     TPCPTR,CVTTPC(,CVTREG)                              0437 01081000
*           R2=MNIGHTLH;            /* NOW, SUBTRACT 1 DAY IN        */ 01082000
         L     R2,MNIGHTLH(,TPCPTR)                                0438 01083000
*           R3=MNIGHTRH;            /* MICROSECS FROM MNIGHT AND     */ 01084000
         L     R3,MNIGHTRH(,TPCPTR)                                0439 01085000
*           RESPECIFY                                              0440 01086000
*            (TPCPTR) UNRSTD;                                      0440 01087000
*           GENERATE CODE;                                         0441 01088000
*                                     /* ADD TO IT INTV PLUS TZ.    */  01089000
                SL     R3,DAYRH                                         01090000
                BC     11,SUBLEFT2                                      01091000
                BCTR   R2,0                                             01092000
SUBLEFT2        SL     R2,DAYLH       R2,R3= MNIGHT-86.4 *(10**9)=X     01093000
                AL     R3,INTVRH(RBPTR)                                 01094000
                BC     12,ADDLEFT2                                      01095000
                AL     R2,ONE                                           01096000
ADDLEFT2        AL     R2,INTVLH(RBPTR)     R2,R3=X+INTV                01097000
                AL     R2,TZ(RBPTR)         ADD IN TIMAE ZONE          01098000
*           INTVLH=R2;              /* SAVE CLOCK COMP VALUE         */ 01099000
         ST    R2,INTVLH(,RBPTR)                                   0442 01100000
*           INTVRH=R3;                                             0443 01101000
         ST    R3,INTVRH(,RBPTR)                                   0443 01102000
*           IF INTVLH<TIMELH|(INTVLH=TIMELH&(INTVRH^>TIMERH))/* IF 0444 01103000
*                                      CLK COMP VALUE LESS THAN OR 0444 01104000
*                                      EQUAL TO CURRENT TODC         */ 01105000
*             THEN                  /* ADD IN 24 HOURS OF US         */ 01106000
         L     @14,INTVLH(,RBPTR)                                  0444 01107000
         L     @12,TIMELH(,RBPTR)                                  0444 01108000
         CLR   @14,@12                                             0444 01109000
         BL    @RT00444                                            0444 01110000
         CLR   @14,@12                                             0444 01111000
         BNE   @RF00444                                            0444 01112000
         L     @14,INTVRH(,RBPTR)                                  0444 01113000
         CL    @14,TIMERH(,RBPTR)                                  0444 01114000
         BH    @RF00444                                            0444 01115000
@RT00444 DS    0H                                                  0445 01116000
*             DO;                                                  0445 01117000
*               R2=INTVLH;                                         0446 01118000
         L     R2,INTVLH(,RBPTR)                                   0446 01119000
*               R3=INTVRH;                                         0447 01120000
         L     R3,INTVRH(,RBPTR)                                   0447 01121000
*               GENERATE;                                          0448 01122000
                      AL   R3,DAYRH                                     01123000
                      BC   12,ADDLEFT3                                  01124000
                      AL   R2,ONE                                       01125000
ADDLEFT3              AL   R2,DAYLH                                     01126000
*               INTVLH=R2;                                         0449 01127000
         ST    R2,INTVLH(,RBPTR)                                   0449 01128000
*               INTVRH=R3;                                         0450 01129000
         ST    R3,INTVRH(,RBPTR)                                   0450 01130000
*             END;                                                 0451 01131000
*         END;                                                     0452 01132000
*       ELSE                        /* IS GMT OR TOD NOT SPCFIED     */ 01133000
*         DO;                       /* ENSURE INTERVAL ^> 24 HRS     */ 01134000
         B     @RC00428                                            0453 01135000
@RF00428 DS    0H                                                  0454 01136000
*           IF INTVLH>DAYLH|(INTVLH=DAYLH&INTVRH>DAYRH)/* IF GRTR,   */ 01137000
*             THEN                  /* SET IT TO 24 HOURS            */ 01138000
         L     @14,DAYLH                                           0454 01139000
         L     @12,INTVLH(,RBPTR)                                  0454 01140000
         CLR   @12,@14                                             0454 01141000
         BH    @RT00454                                            0454 01142000
         CLR   @12,@14                                             0454 01143000
         BNE   @RF00454                                            0454 01144000
         CLC   INTVRH(4,RBPTR),DAYRH                               0454 01145000
         BNH   @RF00454                                            0454 01146000
@RT00454 DS    0H                                                  0455 01147000
*             DO;                                                  0455 01148000
*               INTVLH=DAYLH;                                      0456 01149000
         L     @14,DAYLH                                           0456 01150000
         ST    @14,INTVLH(,RBPTR)                                  0456 01151000
*               INTVRH=DAYRH;                                      0457 01152000
         L     @14,DAYRH                                           0457 01153000
         ST    @14,INTVRH(,RBPTR)                                  0457 01154000
*             END;                                                 0458 01155000
*           IF SAVR(1,7:8)^='00'B   /* IF REAL/WAIT TYPE,            */ 01156000
*             THEN                  /* CLR COMP VAL IS INTV+TIME.    */ 01157000
@RF00454 TM    SAVR(RBPTR),B'00000011'                             0459 01158000
         BZ    @RF00459                                            0459 01159000
*             DO;                                                  0460 01160000
*               R2=INTVLH;                                         0461 01161000
         L     R2,INTVLH(,RBPTR)                                   0461 01162000
*               R3=INTVRH;                                         0462 01163000
         L     R3,INTVRH(,RBPTR)                                   0462 01164000
*               GENERATE;                                          0463 01165000
                    AL   R3,TIMERH(RBPTR)                               01166000
                    BC   12,ADDLEFT4                                    01167000
                    AL   R2,ONE                                         01168000
ADDLEFT4            AL   R2,TIMELH(RBPTR)                               01169000
*               INTVLH=R2;                                         0464 01170000
         ST    R2,INTVLH(,RBPTR)                                   0464 01171000
*               INTVRH=R3;                                         0465 01172000
         ST    R3,INTVRH(,RBPTR)                                   0465 01173000
*             END;                                                 0466 01174000
*         END;                                                     0467 01175000
@RF00459 DS    0H                                                  0468 01176000
*       RESPECIFY                                                  0468 01177000
*        (R2,                                                      0468 01178000
*         R3) UNRSTD;                                              0468 01179000
@RC00428 DS    0H                                                  0469 01180000
*       TQEVAL=INTV;                /* PUT INTERVAL INTO NEW TQE     */ 01181000
         MVC   TQEVAL(8,TQEPTR),INTV(RBPTR)                        0469 01182000
*       IF SAVR(1,7:8)^='00'B       /* IF REAL OR WAIT TYPE,         */ 01183000
*         THEN                      /* SET TQETYPE ACCORINGLY.       */ 01184000
         TM    SAVR(RBPTR),B'00000011'                             0470 01185000
         BZ    @RF00470                                            0470 01186000
*         IF SAVR(1,7:8)='01'B      /* IF WAIT TYPE ,                */ 01187000
*           THEN                    /* SET TQETYPE ACCORDINGLY       */ 01188000
         TM    SAVR(RBPTR),B'00000001'                             0471 01189000
         BNO   @RF00471                                            0471 01190000
         TM    SAVR(RBPTR),B'00000010'                             0471 01191000
         BNZ   @RF00471                                            0471 01192000
*           DO;                                                    0472 01193000
*             TQETYPE='01'B;        /* SET TQETYPE AND               */ 01194000
         NI    TQETYPE(TQEPTR),B'11111101'                         0473 01195000
         OI    TQETYPE(TQEPTR),B'00000001'                         0473 01196000
*             TQEECB=0;             /* CLEAR ECB.                    */ 01197000
         SLR   @14,@14                                             0474 01198000
         ST    @14,TQEECB(,TQEPTR)                                 0474 01199000
*           END;                                                   0475 01200000
*         ELSE                      /* IF REAL TYPE                  */ 01201000
*           TQETYPE='11'B;          /* SET TQETYPE                   */ 01202000
         B     @RC00471                                            0476 01203000
@RF00471 OI    TQETYPE(TQEPTR),B'00000011'                         0476 01204000
*       RESPECIFY                                                  0477 01205000
*        (R11,                                                     0477 01206000
*         R12,                                                     0477 01207000
*         R13,                                                     0477 01208000
*         R14) RSTD;                                               0477 01209000
@RC00471 DS    0H                                                  0477 01210000
@RF00470 DS    0H                                                  0478 01211000
*       GENERATE;                                                  0478 01212000
*                                     /* GET THE DISPATCHER LOCK    */  01213000
          SETLOCK OBTAIN,TYPE=DISP,MODE=UNCOND,                       CC01214000
               RELATED=('TQE QUEUE',IEAVRT00(NONE))                     01215000
*       RESPECIFY                                                  0479 01216000
*        (R11,                                                     0479 01217000
*         R12,                                                     0479 01218000
*         R13,                                                     0479 01219000
*         R14) UNRSTD;                                             0479 01220000
*       RETCODE=0;                  /* INITIALIZE TO NO ERROR        */ 01221000
         SLR   RETCODE,RETCODE                                     0480 01222000
*       IF SAVR(1,7:8)='00'B        /* IF TASK TYPE REQUEST,         */ 01223000
*         THEN                      /* CHECK FOR GOOD CPU TIMER.     */ 01224000
*                                                                  0481 01225000
         TM    SAVR(RBPTR),B'00000011'                             0481 01226000
         BNZ   @RF00481                                            0481 01227000
*         /***********************************************************/ 01228000
*         /*                                                         */ 01229000
*         /* TEST FOR TASK TO CPU AFFINITY. NO AFFINITY IS INDICATED */ 01230000
*         /* BY A MASK OF ALL 0'S OR ALL F'S.                        */ 01231000
*         /*                                                         */ 01232000
*         /***********************************************************/ 01233000
*                                                                  0482 01234000
*         DO;                                                      0482 01235000
*           IF TCBAFFN^='0000'X&TCBAFFN^='FFFF'X/*           @ZA13903*/ 01236000
*             THEN                  /* THIS CPU MUST HAVE A GOOD     */ 01237000
         CLC   TCBAFFN(2,TCBPTR),@CB02722                          0483 01238000
         BE    @RF00483                                            0483 01239000
         CLC   TCBAFFN(2,TCBPTR),@CB02974                          0483 01240000
         BE    @RF00483                                            0483 01241000
*             DO;                   /* CPU TIMER.                    */ 01242000
*               IF PCCANUIN='1'B    /* IF CPU'S CPU TIMER NO GOOD    */ 01243000
*                 THEN              /* INDICATE WITH RETCODE 8.      */ 01244000
         L     @14,PCCAPTR                                         0485 01245000
         TM    PCCANUIN(@14),B'10000000'                           0485 01246000
         BNO   @RF00485                                            0485 01247000
*                 RETCODE=8;                                       0486 01248000
         LA    RETCODE,8                                           0486 01249000
*             END;                                                 0487 01250000
*           ELSE                    /* IF NO CPU AFFINITY THEN       */ 01251000
*             IF CSDGDINT=0         /* IF NO GOOD CPU TMR IN SYS,    */ 01252000
*               THEN                /* INDICATE WITH RETCODE 8.      */ 01253000
         B     @RC00483                                            0488 01254000
@RF00483 L     @14,CVTCSD(,CVTREG)                                 0488 01255000
         L     @14,CSDGDINT(,@14)                                  0488 01256000
         LTR   @14,@14                                             0488 01257000
         BNZ   @RF00488                                            0488 01258000
*               RETCODE=8;                                         0489 01259000
         LA    RETCODE,8                                           0489 01260000
*         END;                                                     0490 01261000
*       ELSE                        /* IF REAL OR WAIT THEN          */ 01262000
*         IF CSDGDCC=0              /* IF NO GOOD CLK CMP IN SYS,    */ 01263000
*           THEN                    /* INDICATE WITH RETCODE=8.      */ 01264000
         B     @RC00481                                            0491 01265000
@RF00481 L     @14,CVTCSD(,CVTREG)                                 0491 01266000
         L     @14,CSDGDCC(,@14)                                   0491 01267000
         LTR   @14,@14                                             0491 01268000
         BNZ   @RF00491                                            0491 01269000
*           RETCODE=8;                                             0492 01270000
         LA    RETCODE,8                                           0492 01271000
*       IF RETCODE=0                /* IF NO ERROR,                  */ 01272000
*         THEN                      /* PROCEED WITH STIMER RQST      */ 01273000
@RF00491 DS    0H                                                  0493 01274000
@RC00481 LTR   RETCODE,RETCODE                                     0493 01275000
         BNZ   @RF00493                                            0493 01276000
*         DO;                                                      0494 01277000
*           RESPECIFY                                              0495 01278000
*            (RZERO,                                               0495 01279000
*             R2) RSTD;                                            0495 01280000
*           R2=ADDR(ENQRET2);                                      0496 01281000
         LA    R2,ENQRET2                                          0496 01282000
*           CALL ENQTQE;            /* ENQUEUE THE NEW TQE           */ 01283000
         L     @15,CVTQTE00(,CVTREG)                               0497 01284000
         BALR  @14,@15                                             0497 01285000
*ENQRET2:                                                          0498 01286000
*           RESPECIFY                                              0498 01287000
*            (R11,                                                 0498 01288000
*             R12,                                                 0498 01289000
*             R13,                                                 0498 01290000
*             R14) RSTD;                                           0498 01291000
ENQRET2  DS    0H                                                  0499 01292000
*           GENERATE;                                              0499 01293000
*                                     /* RELEASE DISPATCHER LOCK    */  01294000
         SETLOCK RELEASE,TYPE=DISP,                                   cc01295000
               RELATED=('TQE QUEUE',IEAVRT00(NONE))                     01296000
*           IF TTSTBASE^<CVTNUCB THEN/* IF NOT IN FLPA       @ZA02745*/ 01297000
         C     TTSTBASE,CVTNUCB(,CVTREG)                           0500 01298000
         BL    @RF00500                                            0500 01299000
*             DO;                   /* PAGE FREE THE MODULE  @ZA02745*/ 01300000
*               R11=TQEPTR;         /* SAVE TQEPTR           @YM06795*/ 01301000
         LR    R11,TQEPTR                                          0502 01302000
*               R0=0;               /* SET REG FOR PAGE FREE INTF    */ 01303000
         SLR   R0,R0                                               0503 01304000
*               R1=ADDR(FIXSTART);  /* SET REG FOR PAGE FREE INTF    */ 01305000
         LA    R1,FIXSTART                                         0504 01306000
*               R2=ADDR(FIXEND);    /* SET REG FOR PAGE FREE INTF    */ 01307000
         LA    R2,FIXEND                                           0505 01308000
*               R4=PSATOLD;         /* SET REG FOR PAGE FREE INTF    */ 01309000
         L     R4,PSATOLD                                          0506 01310000
*               R14=CVTPTR;         /* GET ADDRESSABILITY TO CVT     */ 01311000
         L     R14,CVTPTR                                          0507 01312000
*               GENERATE REFS(CVTPVTP,PVTPSIB,PGFRMSK);            0508 01313000
*                                                        /* @YM06795*/  01314000
         ICM   R1,8,PGFRMSK         SET PAGE FREE INDICATOR             01315000
         L     R15,CVTPVTP(R14)     GET ADDR OF THE PVT                 01316000
         L     R15,PVTPSIB(R15)     GET PGFREE ENTRY POINT              01317000
         BALR  R14,R15              BRANCH ENTER PGFREE                 01318000
*               TQEPTR=R11;         /* RESTORE TQEPTR        @YM06795*/ 01319000
         LR    TQEPTR,R11                                          0509 01320000
*             END;                  /*                       @ZA02745*/ 01321000
*           RESPECIFY                                              0511 01322000
*            (R11,                                                 0511 01323000
*             R12,                                                 0511 01324000
*             R13,                                                 0511 01325000
*             R14) UNRSTD;                                         0511 01326000
@RF00500 DS    0H                                                  0512 01327000
*           IF SAVR(1,7:8)^='01'B   /* IF NOT WAIT TYPE REQUEST,     */ 01328000
*             THEN                  /* RELEASE LOCAL LOCK            */ 01329000
         TM    SAVR(RBPTR),B'00000001'                             0512 01330000
         BNO   @RT00512                                            0512 01331000
         TM    SAVR(RBPTR),B'00000010'                             0512 01332000
         BZ    @RF00512                                            0512 01333000
@RT00512 DS    0H                                                  0513 01334000
*             DO;                                                  0513 01335000
*               RESPECIFY                                          0514 01336000
*                (R11,                                             0514 01337000
*                 R12,                                             0514 01338000
*                 R13,                                             0514 01339000
*                 R14) RSTD;                                       0514 01340000
*               GENERATE;                                          0515 01341000
                      SETLOCK RELEASE,TYPE=LOCAL,                     CC01342000
               RELATED=(MEMORY,IEAVRT00(NONE))                          01343000
*               RESPECIFY                                          0516 01344000
*                (R11,                                             0516 01345000
*                 R12,                                             0516 01346000
*                 R13,                                             0516 01347000
*                 R14) UNRSTD;                                     0516 01348000
*             END;                                                 0517 01349000
*           ELSE                    /* PUT STIMER SVRB INTO WAIT.    */ 01350000
*             DO;                   /* INITIALIZE BELOW GENERATE DOES   01351000
*                                      RBOPSW(5:8)=ADDR(WAITRET) BUT    01352000
*                                      WITHOUT TEMPORARIES           */ 01353000
         B     @RC00512                                            0518 01354000
@RF00512 DS    0H                                                  0519 01355000
*               GENERATE;                                          0519 01356000
*                                     /* SAVE WAIT RETURN ADDRESS   */  01357000
                      LA  R14,WAITRET                                   01358000
                      ST  R14,RBOPSW+4(RBPTR)                           01359000
*               GENERATE            /* RETURN REGISTERS              */ 01360000
*                   (STM  0,15,TCBGRS(TCBPTR));                    0520 01361000
         STM  0,15,TCBGRS(TCBPTR)                                       01362000
*               RESPECIFY                                          0521 01363000
*                (R3) RSTD;                                        0521 01364000
*               R2=TIMELH;                                         0522 01365000
         L     R2,TIMELH(,RBPTR)                                   0522 01366000
*               R3=TIMERH;                                         0523 01367000
         L     R3,TIMERH(,RBPTR)                                   0523 01368000
*               GENERATE REFS(HALFSEC);                            0524 01369000
                      AL   R3,HALFSEC                                   01370000
                      BC   12,ADDLEFT5                                  01371000
                      AL   R2,ONE                                       01372000
ADDLEFT5              EQU  *                                            01373000
*               TIMELH=R2;                                         0525 01374000
         ST    R2,TIMELH(,RBPTR)                                   0525 01375000
*               TIMERH=R3;                                         0526 01376000
         ST    R3,TIMERH(,RBPTR)                                   0526 01377000
*               RESPECIFY                                          0527 01378000
*                (R3) RSTD;                                        0527 01379000
*               IF TQEVALLH>TIMELH| /* IF INTV>HALF SECND            */ 01380000
*                   (TQEVALLH=TIMELH&(TQEVALRH>TIMERH)) THEN/* GO  0528 01381000
*                                      INTO LONG WAIT.               */ 01382000
         L     @14,TQEVALLH(,TQEPTR)                               0528 01383000
         L     @12,TIMELH(,RBPTR)                                  0528 01384000
         CLR   @14,@12                                             0528 01385000
         BH    @RT00528                                            0528 01386000
         CLR   @14,@12                                             0528 01387000
         BNE   @RF00528                                            0528 01388000
         L     @14,TIMERH(,RBPTR)                                  0528 01389000
         CL    @14,TQEVALRH(,TQEPTR)                               0528 01390000
         BNL   @RF00528                                            0528 01391000
@RT00528 DS    0H                                                  0529 01392000
*                 RZERO='80000001'X;                               0529 01393000
         L     RZERO,@CF02977                                      0529 01394000
*               ELSE                /* IF SHORT WAIT THEN            */ 01395000
*                 RZERO=1;          /* HO BIT R0=0                   */ 01396000
         B     @RC00528                                            0530 01397000
@RF00528 LA    RZERO,1                                             0530 01398000
*               R1=ADDR(TQEECB);                                   0531 01399000
@RC00528 LA    @14,TQEECB(,TQEPTR)                                 0531 01400000
         LR    R1,@14                                              0531 01401000
*               CALL WAITBR;        /* GO INTO WAIT                  */ 01402000
         L     @15,CVTVWAIT(,CVTREG)                               0532 01403000
         BALR  @14,@15                                             0532 01404000
*             END;                                                 0533 01405000
*WAITRET:                                                          0534 01406000
*           RETCODE=0;              /* INDICATE SUCCESS              */ 01407000
@RC00512 DS    0H                                                  0534 01408000
WAITRET  SLR   RETCODE,RETCODE                                     0534 01409000
*           RESPECIFY                                              0535 01410000
*            (RZERO,                                               0535 01411000
*             R2) UNRSTD;                                          0535 01412000
*         END;                                                     0536 01413000
*       ELSE                        /* IF ERROR ENCOUNTED            */ 01414000
*         DO;                                                      0537 01415000
         B     @RC00493                                            0537 01416000
@RF00493 DS    0H                                                  0538 01417000
*           RESPECIFY                                              0538 01418000
*            (R11,                                                 0538 01419000
*             R12,                                                 0538 01420000
*             R13,                                                 0538 01421000
*             R14) RSTD;                                           0538 01422000
*           GENERATE;                                              0539 01423000
*                                     /* RELEASE DISPATCHER LOCK    */  01424000
              SETLOCK RELEASE,TYPE=DISP,                              CC01425000
               RELATED=('TQE QUEUE',IEAVRT00(NONE))                     01426000
*           RESPECIFY                                              0540 01427000
*            (R11,                                                 0540 01428000
*             R12,                                                 0540 01429000
*             R13,                                                 0540 01430000
*             R14) UNRSTD;                                         0540 01431000
*           RESPECIFY                                              0541 01432000
*            (R0,                                                  0541 01433000
*             R2,                                                  0541 01434000
*             R3,                                                  0541 01435000
*             R11) RSTD;                                           0541 01436000
*           R0=128;                 /* PREPARE TO FREE THE TQE       */ 01437000
         LA    R0,128                                              0542 01438000
*           R11=TQEPTR;                                            0543 01439000
         LR    R11,TQEPTR                                          0543 01440000
*           ASCBPTR=TQEASCB;                                       0544 01441000
         L     ASCBPTR,TQEASCB(,TQEPTR)                            0544 01442000
*           IF SAVR(1,7:8)='00'B    /* IF TASK TYPE                  */ 01443000
*             THEN                  /* FREE IT FROM LSQA - SP253     */ 01444000
         TM    SAVR(RBPTR),B'00000011'                             0545 01445000
         BNZ   @RF00545                                            0545 01446000
*             R3=253;                                              0546 01447000
         LA    R3,253                                              0546 01448000
*           ELSE                    /* IF REAL OR WAIT TYPE          */ 01449000
*             R3=245;               /* FREE IT FROM SQA - SP245      */ 01450000
         B     @RC00545                                            0547 01451000
@RF00545 LA    R3,245                                              0547 01452000
*           RESPECIFY                                              0548 01453000
*            (R14) RSTD;                                           0548 01454000
@RC00545 DS    0H                                                  0549 01455000
*           R14=R3;                                                0549 01456000
         LR    R14,R3                                              0549 01457000
*           DO;                     /* FREEMAIN(RU) LV(R0)A(FREESTRG)   01458000
*                                      SP(R14) BRANCH                */ 01459000
*             RESPECIFY                                            0551 01460000
*              (GPR01F,                                            0551 01461000
*               GPR03F,                                            0551 01462000
*               GPR00F) RESTRICTED;                                0551 01463000
*             GPR01F=0;             /* REG 1 MUST BE ZERO            */ 01464000
         SLR   GPR01F,GPR01F                                       0552 01465000
*             GPR03F=3;             /* SET TYPE                      */ 01466000
         LA    GPR03F,3                                            0553 01467000
*             GPR00F=R0;            /* LENGTH REQUESTED              */ 01468000
*             GPR01F=ADDR(FREESTRG);/* SET REGISTER ONE              */ 01469000
         LR    GPR01F,R11                                          0555 01470000
*             GPR03F=GPR03F+((R14)*256);/* SUBPOOL VALUE             */ 01471000
         LR    @12,R14                                             0556 01472000
         SLA   @12,8                                               0556 01473000
         ALR   GPR03F,@12                                          0556 01474000
*             CALL CVTCRMN;         /* BRANCH ENTRY POINT            */ 01475000
         L     @15,CVTCRMN(,CVTREG)                                0557 01476000
         BALR  @14,@15                                             0557 01477000
*             RESPECIFY                                            0558 01478000
*              (GPR01F,                                            0558 01479000
*               GPR03F,                                            0558 01480000
*               GPR00F) UNRESTRICTED;                              0558 01481000
*           END;                    /* FREEMAIN(RU) LV(R0)A(FREESTRG)   01482000
*                                      SP(R14) BRANCH                */ 01483000
*           RESPECIFY                                              0560 01484000
*            (R14) UNRSTD;                                         0560 01485000
*           RESPECIFY                                              0561 01486000
*            (R0,                                                  0561 01487000
*             R3,                                                  0561 01488000
*             R11) UNRSTD;                                         0561 01489000
*           RESPECIFY                                              0562 01490000
*            (R11,                                                 0562 01491000
*             R12,                                                 0562 01492000
*             R13,                                                 0562 01493000
*             R14) RSTD;                                           0562 01494000
*           GENERATE;                                              0563 01495000
*                                     /* RELEASE LOCAL LOCK         */  01496000
         SETLOCK RELEASE,TYPE=LOCAL,                                  cc01497000
               RELATED=(MEMORY,IEAVRT00(NONE))                          01498000
*           IF TTSTBASE^<CVTNUCB THEN/* IF MOD NOT IN FLPA   @ZA02745*/ 01499000
         C     TTSTBASE,CVTNUCB(,CVTREG)                           0564 01500000
         BL    @RF00564                                            0564 01501000
*             DO;                   /* PAGE FREE THE MODULE  @ZA02745*/ 01502000
*               R11=ADDR(FIXSTART); /* SET REG FOR PAGE FREE INTF    */ 01503000
         LA    R11,FIXSTART                                        0566 01504000
*               R12=ADDR(FIXEND);   /* SET REG FOR PAGE FREE INTF    */ 01505000
         LA    R12,FIXEND                                          0567 01506000
*               GENERATE(PGFREE  R,A=(R11),EA=(R12));              0568 01507000
         PGFREE  R,A=(R11),EA=(R12)                                     01508000
*             END;                  /*                       @ZA02745*/ 01509000
*           RESPECIFY                                              0570 01510000
*            (R11,                                                 0570 01511000
*             R12,                                                 0570 01512000
*             R13,                                                 0570 01513000
*             R14) UNRSTD;                                         0570 01514000
@RF00564 DS    0H                                                  0571 01515000
*           RETCODE=8;              /* INDICATE ERROR                */ 01516000
         LA    RETCODE,8                                           0571 01517000
*           RESPECIFY                                              0572 01518000
*            (TQEPTR) UNRSTD;                                      0572 01519000
*         END;                                                     0573 01520000
*     END;                                                         0574 01521000
@RC00493 DS    0H                                                  0575 01522000
*   RESPECIFY                                                      0575 01523000
*    (ASCBPTR) UNRSTD;                                             0575 01524000
@RF00299 DS    0H                                                  0576 01525000
*   RESPECIFY                                                      0576 01526000
*    (INPUTRG,                                                     0576 01527000
*     INTVPTR,                                                     0576 01528000
*     RETADDR) RSTD;                /*                       @YM06037*/ 01529000
*   INPUTRG=SAVR(1);                /* RESTORE INPUT REGS            */ 01530000
         L     INPUTRG,SAVR(,RBPTR)                                0577 01531000
*   INTVPTR=SAVR(2);                /* DO                            */ 01532000
         L     INTVPTR,SAVR+4(,RBPTR)                              0578 01533000
*   RETADDR=SAVR(3);                /* DO                            */ 01534000
         L     RETADDR,SAVR+8(,RBPTR)                              0579 01535000
*   IF RETCODE^=0                   /* IF THERE WAS AN ERROR,        */ 01536000
*     THEN                          /* ABEND USER OR GO TO ERRET.    */ 01537000
         LTR   RETCODE,RETCODE                                     0580 01538000
         BZ    @RF00580                                            0580 01539000
*     DO;                                                          0581 01540000
*       IF RETCODE=4                /* IF RETCODE=4                  */ 01541000
*         THEN                      /* ABEND USER 12F.               */ 01542000
         C     RETCODE,@CF00044                                    0582 01543000
         BNE   @RF00582                                            0582 01544000
*         GENERATE(ABEND  X'12F',,,SYSTEM);                        0583 01545000
         ABEND  X'12F',,,SYSTEM                                         01546000
*       ELSE                        /* CK FOR ERRET (RETCODE=8)      */ 01547000
*         IF SAVR(1,5:5)='0'B       /* IF RETCODE=8 & NO ERRET       */ 01548000
*           THEN                    /* ABEND USER 22F.               */ 01549000
         B     @RC00582                                            0584 01550000
@RF00582 TM    SAVR(RBPTR),B'00001000'                             0584 01551000
         BNZ   @RF00584                                            0584 01552000
*           GENERATE(ABEND  X'22F',,,SYSTEM);                      0585 01553000
         ABEND  X'22F',,,SYSTEM                                         01554000
*     END;                                                         0586 01555000
*   RETURN;                         /* RETURN TO CALLER              */ 01556000
         B     @EL00001                                            0587 01557000
*                                                                  0588 01558000
*/*  *****************************************************************/ 01559000
*/*                                                                  */ 01560000
*/*                    TTIMER/STIMER ESTAE ROUTINE                   */ 01561000
*/*                                                                  */ 01562000
*/*  *****************************************************************/ 01563000
*/*                                                                  */ 01564000
*/*        FUNCTION  - RECORDS IN SDWA ANY ERRORS OCCURRING IN       */ 01565000
*/*                    TTIMER.  ADDITIONALLY,                        */ 01566000
*/*                    IF MIC OR STCK ARE SPECIFIED,  TTIMER STORES  */ 01567000
*/*                    INTO A USER SUPPLIED DATA AREA.  WHEN DOING   */ 01568000
*/*                    THIS, TTIMER ASSUMES THE USER'S PROTECT KEY.  */ 01569000
*/*                    IF AN 0C4 OR 0C5 PROGRAM CHECK ENSUES,        */ 01570000
*/*                    THIS ROUTINE WILL CONVERT IT TO A 12E ABEND   */ 01571000
*/*                                                                  */ 01572000
*/*        INPUT     - 1. R0^=12 IF AN SDWA PRESENT                  */ 01573000
*/*                    2. R1= POINTER TO THE SDWA IF PRESENT         */ 01574000
*/*                    3. R13= POINTER TO 72 BYTE SAVE AREA          */ 01575000
*/*                    4. R14= RETURN ADDRESS                        */ 01576000
*/*                                                                  */ 01577000
*/*        ENVIRONMENT                                               */ 01578000
*/*        CHANGES   - NONE                                          */ 01579000
*/*                                                                  */ 01580000
*/*        OTHER RTNS                                                */ 01581000
*/*        USED      - SETRP                                         */ 01582000
*/*                                                                  */ 01583000
*/*        CALLERS   - RTM                                           */ 01584000
*/*                                                                  */ 01585000
*/*        OUTPUT    - IF ENTRY DUE TO A 0C4 OR 0C5 PROGRAM CHECK,   */ 01586000
*/*                    WHILE BIT XSAUAREA IS ONE, THE PROGRAM        */ 01587000
*/*                    CHECK IS CONVERTED TO A 12E ABEND.            */ 01588000
*/*                                                                  */ 01589000
*/*  *****************************************************************/ 01590000
*                                                                  0588 01591000
*TTSTSTAE:                          /* ENTRY POINT TO ESTAE RTN      */ 01592000
*   RESPECIFY                                                      0588 01593000
*     RBSECT BASED(SDWAPARM);                                      0588 01594000
TTSTSTAE DS    0H                                                  0589 01595000
*   RESPECIFY                                                      0589 01596000
*    (R0,                                                          0589 01597000
*     SDWAPTR,                                                     0589 01598000
*     R13,                                                         0589 01599000
*     BASEREG) RSTD;                                               0589 01600000
*   GENERATE;                                                      0590 01601000
       SR    R15,R15                  CLEAR R15 FOR R0=12 CASE.         01602000
       LA    R11,12                   CANNOT DO ANYTHING IF R0=12.      01603000
       CR    R11,R0                   IF R0=12, RETURN IMMEDIATELY      01604000
       BE    0(R14)                   WITH ZERO IN R15.                 01605000
       STM   14,12,12(R13)            OTHERWISE, SAVE OTHER REGISTERS   01606000
       BALR  BASEREG,0                ESTABLISH ADDRESSABILITY          01607000
       USING *,BASEREG                                                  01608000
*   SDWAMODN='IGC0004F';            /* PUT MODULE NAME INTO SDWA     */ 01609000
         MVC   SDWAMODN(8,SDWAPTR),@CC02982                        0591 01610000
*   SDWACSCT='IGC0004F';            /* PUT CSECT NAME INTO SDWA      */ 01611000
         MVC   SDWACSCT(8,SDWAPTR),@CC02982                        0592 01612000
*   SDWAREXN='TTSTSTAE';            /* PUT RECOV RTN NAME IN SDWA  0593 01613000
*                                                            @YM05461*/ 01614000
         MVC   SDWAREXN(8,SDWAPTR),@CC02983                        0593 01615000
*   RBPTR=SDWAGR05;                 /* SET UP SVRB ADDRESSABILITY    */ 01616000
         L     RBPTR,SDWAGR05(,SDWAPTR)                            0594 01617000
*   IF SDWAFMID=0&                  /* IF THE RIGHT MEMORY AND       */ 01618000
*       SDWAPCHK='1'B&              /* ENTRY DUE TO A PROG CK        */ 01619000
*       (SDWAICD1=4|                /* 0C4 OR                        */ 01620000
*       SDWAICD1=5)&                /* 0C5 AND                       */ 01621000
*       XSAUAREA='1'B               /* WERE STORING INTO USER AREA   */ 01622000
*     THEN                          /* ABEND USER 12E                */ 01623000
         LH    @03,SDWAFMID(,SDWAPTR)                              0595 01624000
         N     @03,@CF03004                                        0595 01625000
         LTR   @03,@03                                             0595 01626000
         BNZ   @RF00595                                            0595 01627000
         TM    SDWAPCHK(SDWAPTR),B'01000000'                       0595 01628000
         BNO   @RF00595                                            0595 01629000
         CLI   SDWAICD1(SDWAPTR),4                                 0595 01630000
         BE    @GL00026                                            0595 01631000
         CLI   SDWAICD1(SDWAPTR),5                                 0595 01632000
         BNE   @RF00595                                            0595 01633000
@GL00026 TM    XSAUAREA(RBPTR),B'00001000'                         0595 01634000
         BNO   @RF00595                                            0595 01635000
*     DO;                                                          0596 01636000
*       DO;                         /* SETRP RECORD(NO)WKAREA(SDWAPTR   01637000
*                                      )RC(0)COMPCOD(302,SYSTEM)DUMP(   01638000
*                                      YES)                          */ 01639000
*         RESPECIFY                                                0598 01640000
*          (GPR00P,                                                0598 01641000
*           GPR01P,                                                0598 01642000
*           GPR14P,                                                0598 01643000
*           GPR15P) RSTD;                                          0598 01644000
*         GPR01P=SDWAPTR;                                          0599 01645000
*         GPR01P->SDWARCDE=0;       /* SAVE RC VALUE                 */ 01646000
         MVI   SDWARCDE(GPR01P),X'00'                              0600 01647000
*         GPR01P->SDWARCRD='0'B;    /* TURN OFF RECORD INDICATOR     */ 01648000
         NI    SDWARCRD(GPR01P),B'01111111'                        0601 01649000
*         GPR01P->SDWAREQ='1'B;     /* TURN ON DUMP INDICATOR        */ 01650000
         OI    SDWAREQ(GPR01P),B'10000000'                         0602 01651000
*         GPR14P=302;               /* ACCESS COMPLETION CODE        */ 01652000
         LA    GPR14P,302                                          0603 01653000
*         GEN(SLL    14,12);        /* SHIFT TO SYSTEM COMPLETION  0604 01654000
*                                      CODE                          */ 01655000
         SLL    14,12                                                   01656000
*         GPR01P->SDWACMPC=GPR14P;  /* STORE COMPLETION CODE         */ 01657000
         STCM  GPR14P,7,SDWACMPC(GPR01P)                           0605 01658000
*         RESPECIFY                                                0606 01659000
*          (GPR00P,                                                0606 01660000
*           GPR01P,                                                0606 01661000
*           GPR14P,                                                0606 01662000
*           GPR15P) UNRSTD;                                        0606 01663000
*       END;                                                       0607 01664000
*     END;                          /* HERE IF NOT 12E ABEND         */ 01665000
*   ELSE                                                           0609 01666000
*     DO;                           /* SETRP RECORD(YES)WKAREA(SDWAPT   01667000
*                                      R)RC(0)                       */ 01668000
         B     @RC00595                                            0609 01669000
@RF00595 DS    0H                                                  0610 01670000
*       RESPECIFY                                                  0610 01671000
*        (GPR00P,                                                  0610 01672000
*         GPR01P,                                                  0610 01673000
*         GPR14P,                                                  0610 01674000
*         GPR15P) RSTD;                                            0610 01675000
*       GPR01P=SDWAPTR;                                            0611 01676000
*       GPR01P->SDWARCDE=0;         /* SAVE RC VALUE                 */ 01677000
         MVI   SDWARCDE(GPR01P),X'00'                              0612 01678000
*       GPR01P->SDWARCRD='1'B;      /* TURN ON RECORD INDICATOR      */ 01679000
         OI    SDWARCRD(GPR01P),B'10000000'                        0613 01680000
*       RESPECIFY                                                  0614 01681000
*        (GPR00P,                                                  0614 01682000
*         GPR01P,                                                  0614 01683000
*         GPR14P,                                                  0614 01684000
*         GPR15P) UNRSTD;                                          0614 01685000
*     END;                                                         0615 01686000
*   GENERATE;                                                      0616 01687000
@RC00595 DS    0H                                                  0616 01688000
       LM    14,12,12(R13)             RESTORE ALL REGISTERS            01689000
       BR    R14                       RETURN                           01690000
*   RESPECIFY                                                      0617 01691000
*    (R0,                                                          0617 01692000
*     SDWAPTR,                                                     0617 01693000
*     R13,                                                         0617 01694000
*     BASEREG) UNRSTD;                                             0617 01695000
*   RESPECIFY                                                      0618 01696000
*     RBSECT BASED(RBPTR);                                         0618 01697000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 01698000
*     GPR00F FIXED(31) REG(0),                                     0619 01699000
*     GPR01F FIXED(31) REG(1),                                     0619 01700000
*     GPR03F FIXED(31) REG(3),                                     0619 01701000
*     GPR00P PTR(31) REG(0),                                       0619 01702000
*     GPR01P PTR(31) REG(1),                                       0619 01703000
*     GPR14P PTR(31) REG(14),                                      0619 01704000
*     GPR15P PTR(31) REG(15);                                      0619 01705000
*   DECLARE                         /* COMMON VARIABLES              */ 01706000
*     I256C CHAR(256) BASED,                                       0620 01707000
*     I031F FIXED(31) BASED,                                       0620 01708000
*     I031P PTR(31) BASED,                                         0620 01709000
*     I015F FIXED(15) BASED,                                       0620 01710000
*     I015P PTR(15) BASED,                                         0620 01711000
*     I008P PTR(8) BASED,                                          0620 01712000
*     I001C CHAR(1) BASED;                                         0620 01713000
*   GENERATE;                                                      0621 01714000
*              /*  MAINTENANCE PATCH AREA */                            01715000
STMRPTCH   DC   35F'0'                                                  01716000
*   END IGC0004F                    /* END OF IEAVRT00               */ 01717000
*                                                                  0622 01718000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01719000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 01720000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 01721000
*/*%INCLUDE SYSLIB  (IHACSD  )                                       */ 01722000
*/*%INCLUDE SYSLIB  (IHAPCCA )                                       */ 01723000
*/*%INCLUDE SYSLIB  (IHAPVT  )                                       */ 01724000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 01725000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 01726000
*/*%INCLUDE SYSLIB  (IHARB   )                                       */ 01727000
*/*%INCLUDE SYSLIB  (IKJRB   )                                       */ 01728000
*/*%INCLUDE SYSLIB  (IHASCB  )                                       */ 01729000
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */ 01730000
*/*%INCLUDE SYSLIB  (IEAVVTPC)                                       */ 01731000
*/*%INCLUDE SYSLIB  (IHATQE  )                                       */ 01732000
*                                                                  0622 01733000
*       ;                                                          0622 01734000
         B     @EL00001                                            0622 01735000
@DATA    DS    0H                                                       01736000
@DATD    DSECT                                                          01737000
         DS    0F                                                       01738000
IGC0004F CSECT                                                          01739000
         DS    0F                                                       01740000
@CF00108 DC    F'2'                                                     01741000
@CF00044 DC    F'4'                                                     01742000
@CF00036 DC    F'8'                                                     01743000
@CF00214 DC    F'64'                                                    01744000
@CF02956 DC    F'8640000'                                               01745000
@CF02977 DC    XL4'80000001'                                            01746000
@CF03004 DC    XL4'0000FFFF'                                            01747000
@DATD    DSECT                                                          01748000
         DS    0D                                                       01749000
IGC0004F CSECT                                                          01750000
         NOPR  ((@ENDDATD-@DATD)*16)                                    01751000
         DS    0F                                                       01752000
@SIZDATD DC    AL1(0)                                                   01753000
         DC    AL3(@ENDDATD-@DATD)                                      01754000
         DS    0D                                                       01755000
ONE      DC    A(1)                                                     01756000
K10000   DC    F'40960000'                                              01757000
KTU      DC    XL4'682AAAAB'                                            01758000
HALFSEC  DC    A((16777215+2031222785))                                 01759000
KTULH    DC    XL4'D055'                                                01760000
KTURH    DC    XL4'55556000'                                            01761000
DAYLH    DC    F'82397'                                                 01762000
DAYRH    DC    A((16777215+1962934273))                                 01763000
@CC02982 DC    C'IGC0004F'                                              01764000
@CC02983 DC    C'TTSTSTAE'                                              01765000
@CC02729 DC    C' TQE'                                                  01766000
@CB02935 DC    X'0000000000000000'                                      01767000
@CB02971 EQU   @CB02935                                                 01768000
@CB02722 EQU   @CB02935                                                 01769000
@CB02974 DC    X'FFFF'                                                  01770000
LSQA     DC    X'FD'                                                    01771000
SQA      DC    X'F5'                                                    01772000
SP250    DC    X'FA'                                                    01773000
PGFRMSK  DC    X'20'                                                    01774000
         DS    CL2                                                      01775000
AREASIZE DC    X'FA000008'                                              01776000
K        DC    F'1'                                                     01777000
         DC    F'100'                                                   01778000
         DC    F'6000'                                                  01779000
         DC    F'360000'                                                01780000
IGC0004F CSECT                                                          01781000
*                                   /*  END ADDRESS FOR PAGE FIX   */   01782000
FIXEND    EQU   *                                                       01783000
@DATD    DSECT                                                          01784000
@ENDDATD EQU   *                                                        01785000
IGC0004F CSECT                                                          01786000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01787000
@01      EQU   01                                                       01788000
@02      EQU   02                                                       01789000
@03      EQU   03                                                       01790000
@04      EQU   04                                                       01791000
@05      EQU   05                                                       01792000
@06      EQU   06                                                       01793000
@07      EQU   07                                                       01794000
@08      EQU   08                                                       01795000
@09      EQU   09                                                       01796000
@10      EQU   10                                                       01797000
@11      EQU   11                                                       01798000
@12      EQU   12                                                       01799000
@13      EQU   13                                                       01800000
@14      EQU   14                                                       01801000
@15      EQU   15                                                       01802000
ASCBPTR  EQU   @07                                                      01803000
TCBPTR   EQU   @04                                                      01804000
RBPTR    EQU   @05                                                      01805000
SDWAPTR  EQU   @01                                                      01806000
TPCPTR   EQU   @14                                                      01807000
TQEPTR   EQU   @01                                                      01808000
INTVPTR  EQU   @01                                                      01809000
R11      EQU   @11                                                      01810000
AREAPTR  EQU   @00                                                      01811000
INPUTRG  EQU   @00                                                      01812000
RZERO    EQU   @00                                                      01813000
BINSUM   EQU   @00                                                      01814000
CODERG   EQU   @01                                                      01815000
X        EQU   @01                                                      01816000
CVTREG   EQU   @08                                                      01817000
TTSTBASE EQU   @09                                                      01818000
BASEREG  EQU   @12                                                      01819000
BINVAL   EQU   @13                                                      01820000
KEYREG   EQU   @14                                                      01821000
PROBE    EQU   @14                                                      01822000
RETADDR  EQU   @14                                                      01823000
RETCODE  EQU   @15                                                      01824000
R0       EQU   @00                                                      01825000
R1       EQU   @01                                                      01826000
R2       EQU   @02                                                      01827000
R3       EQU   @03                                                      01828000
R4       EQU   @04                                                      01829000
R7       EQU   @07                                                      01830000
R12      EQU   @12                                                      01831000
R13      EQU   @13                                                      01832000
R14      EQU   @14                                                      01833000
GPR01F   EQU   @01                                                      01834000
GPR03F   EQU   @03                                                      01835000
GPR00F   EQU   @00                                                      01836000
GPR00P   EQU   @00                                                      01837000
GPR01P   EQU   @01                                                      01838000
GPR14P   EQU   @14                                                      01839000
GPR15P   EQU   @15                                                      01840000
R15      EQU   @15                                                      01841000
PSA      EQU   0                                                        01842000
FLCRNPSW EQU   PSA                                                      01843000
FLCROPSW EQU   PSA+8                                                    01844000
FLCICCW2 EQU   PSA+16                                                   01845000
PSAEEPSW EQU   PSA+132                                                  01846000
PSAESPSW EQU   PSA+136                                                  01847000
FLCSVILC EQU   PSAESPSW+1                                               01848000
PSAEPPSW EQU   PSA+140                                                  01849000
FLCPIILC EQU   PSAEPPSW+1                                               01850000
FLCPICOD EQU   PSAEPPSW+2                                               01851000
PSAPICOD EQU   FLCPICOD+1                                               01852000
FLCTEA   EQU   PSAEPPSW+4                                               01853000
FLCPER   EQU   PSA+152                                                  01854000
FLCMCLA  EQU   PSA+168                                                  01855000
FLCIOEL  EQU   FLCMCLA+4                                                01856000
FLCIOA   EQU   FLCMCLA+16                                               01857000
FLCFSA   EQU   FLCMCLA+80                                               01858000
PSAPCCAV EQU   PSA+520                                                  01859000
PSATOLD  EQU   PSA+540                                                  01860000
PSASUPER EQU   PSA+552                                                  01861000
PSASUP1  EQU   PSASUPER                                                 01862000
PSASUP2  EQU   PSASUPER+1                                               01863000
PSASUP3  EQU   PSASUPER+2                                               01864000
PSASUP4  EQU   PSASUPER+3                                               01865000
PSACLHT  EQU   PSA+640                                                  01866000
PSALKSA  EQU   PSA+696                                                  01867000
PSAHLHI  EQU   PSA+760                                                  01868000
PSALITA  EQU   PSA+764                                                  01869000
PSADSSFL EQU   PSA+836                                                  01870000
PSADSSF1 EQU   PSADSSFL                                                 01871000
PSADSSF3 EQU   PSADSSFL+2                                               01872000
PSADSSF4 EQU   PSADSSFL+3                                               01873000
PSARSVT  EQU   PSA+896                                                  01874000
CVTPTR   EQU   16                                                       01875000
CVTMAP   EQU   0                                                        01876000
CVTDAR   EQU   CVTMAP+72                                                01877000
CVTFLGS1 EQU   CVTDAR                                                   01878000
CVTTPC   EQU   CVTMAP+88                                                01879000
CVTQTE00 EQU   CVTMAP+104                                               01880000
CVTQTD00 EQU   CVTMAP+108                                               01881000
CVTDCB   EQU   CVTMAP+116                                               01882000
CVTIOQET EQU   CVTMAP+120                                               01883000
CVTNUCB  EQU   CVTMAP+128                                               01884000
CVTIERLC EQU   CVTMAP+144                                               01885000
CVTHEAD  EQU   CVTMAP+160                                               01886000
CVTSV76C EQU   CVTHEAD                                                  01887000
CVTOPTA  EQU   CVTMAP+182                                               01888000
CVTOPTB  EQU   CVTMAP+183                                               01889000
CVTGTF   EQU   CVTMAP+236                                               01890000
CVTGTFST EQU   CVTGTF                                                   01891000
CVTGTFS  EQU   CVTGTFST                                                 01892000
CVTSTATE EQU   CVTGTFST                                                 01893000
CVTTMODE EQU   CVTGTFST                                                 01894000
CVTFORM  EQU   CVTGTFST                                                 01895000
CVTAQAVT EQU   CVTMAP+240                                               01896000
CVTTCMFG EQU   CVTAQAVT                                                 01897000
CVTVOLM2 EQU   CVTMAP+244                                               01898000
CVTTATA  EQU   CVTVOLM2                                                 01899000
CVTTSKS  EQU   CVTTATA                                                  01900000
CVTVOLF2 EQU   CVTTSKS                                                  01901000
CVTTAT   EQU   CVTTATA+1                                                01902000
CVTATER  EQU   CVTMAP+248                                               01903000
CVTEXT1  EQU   CVTMAP+252                                               01904000
CVTPURG  EQU   CVTMAP+260                                               01905000
CVTQMSG  EQU   CVTMAP+268                                               01906000
CVTDMSR  EQU   CVTMAP+272                                               01907000
CVTRSV37 EQU   CVTDMSR                                                  01908000
CVTDMSRF EQU   CVTRSV37                                                 01909000
CVTTZ    EQU   CVTMAP+304                                               01910000
CVTERPV  EQU   CVTMAP+316                                               01911000
CVTINTLA EQU   CVTMAP+320                                               01912000
CVTAPF   EQU   CVTMAP+324                                               01913000
CVTEXT2  EQU   CVTMAP+328                                               01914000
CVTHJES  EQU   CVTMAP+332                                               01915000
CVTPGSIA EQU   CVTMAP+348                                               01916000
CVTA1F1  EQU   CVTMAP+356                                               01917000
CVTSYSK  EQU   CVTMAP+357                                               01918000
CVTVOLM1 EQU   CVTMAP+380                                               01919000
CVTVOLF1 EQU   CVTVOLM1                                                 01920000
CVTATMCT EQU   CVTMAP+388                                               01921000
CVTXTNT1 EQU   0                                                        01922000
CVTXTNT2 EQU   0                                                        01923000
CVTDSSV  EQU   CVTXTNT2                                                 01924000
CVTFLGBT EQU   CVTXTNT2+5                                               01925000
CVTQID   EQU   CVTXTNT2+24                                              01926000
CVTRV400 EQU   CVTXTNT2+52                                              01927000
CVTRV409 EQU   CVTXTNT2+53                                              01928000
CVTATCVT EQU   CVTXTNT2+64                                              01929000
CVTRV429 EQU   CVTXTNT2+84                                              01930000
CVTRV438 EQU   CVTXTNT2+85                                              01931000
CVTRV457 EQU   CVTXTNT2+112                                             01932000
CVTRV466 EQU   CVTXTNT2+113                                             01933000
CVTFIX   EQU   0                                                        01934000
CVTRELNO EQU   CVTFIX+252                                               01935000
CSD      EQU   0                                                        01936000
CSDCPUAL EQU   CSD+8                                                    01937000
CSDSCWRD EQU   CSD+12                                                   01938000
CSDSCFL1 EQU   CSDSCWRD                                                 01939000
CSDSCFL2 EQU   CSDSCWRD+1                                               01940000
CSDSCFL3 EQU   CSDSCWRD+2                                               01941000
CSDSCFL4 EQU   CSDSCWRD+3                                               01942000
CSDFLAGS EQU   CSD+23                                                   01943000
CSDGDCC  EQU   CSD+108                                                  01944000
CSDGDINT EQU   CSD+112                                                  01945000
PCCA     EQU   0                                                        01946000
PCCATMST EQU   PCCA+128                                                 01947000
PCCATMFL EQU   PCCATMST                                                 01948000
PCCATODE EQU   PCCATMST+1                                               01949000
PCCACCE  EQU   PCCATMST+2                                               01950000
PCCAINTE EQU   PCCATMST+3                                               01951000
PCCANUIN EQU   PCCAINTE                                                 01952000
PCCAEMSB EQU   PCCA+136                                                 01953000
PCCAEMSI EQU   PCCAEMSB                                                 01954000
PCCARISP EQU   PCCAEMSI                                                 01955000
PCCAEMS2 EQU   PCCAEMSI+1                                               01956000
PCCAEMS3 EQU   PCCAEMSI+2                                               01957000
PCCARMSB EQU   PCCAEMSI+3                                               01958000
PCCAWERP EQU   PCCA+280                                                 01959000
PCCACHPF EQU   PCCAWERP+4                                               01960000
PCCACHBL EQU   PCCAWERP+5                                               01961000
PCCACHVA EQU   PCCAWERP+6                                               01962000
PCCACHTS EQU   PCCAWERP+7                                               01963000
PCCACHS1 EQU   PCCA+288                                                 01964000
PCCACHS2 EQU   PCCA+289                                                 01965000
PCCACHRB EQU   PCCA+290                                                 01966000
PCCACHF1 EQU   PCCA+308                                                 01967000
PCCACHF2 EQU   PCCA+309                                                 01968000
PCCACHF3 EQU   PCCA+310                                                 01969000
PCCACHF4 EQU   PCCA+311                                                 01970000
PVT      EQU   0                                                        01971000
PVTFLAG1 EQU   PVT                                                      01972000
PVTPSIB  EQU   PVT+72                                                   01973000
PVTQS    EQU   PVT+304                                                  01974000
PVTWSAX  EQU   PVT+344                                                  01975000
ASCB     EQU   0                                                        01976000
ASCBSUPC EQU   ASCB+16                                                  01977000
ASCBASID EQU   ASCB+36                                                  01978000
ASCBRSM  EQU   ASCB+52                                                  01979000
ASCBRSMF EQU   ASCBRSM                                                  01980000
ASCBFW1  EQU   ASCB+100                                                 01981000
ASCBRCTF EQU   ASCBFW1+2                                                01982000
ASCBFLG1 EQU   ASCBFW1+3                                                01983000
ASCBDSP1 EQU   ASCB+114                                                 01984000
ASCBFLG2 EQU   ASCB+115                                                 01985000
ASCBLKGP EQU   ASCB+128                                                 01986000
ASCBSRQ  EQU   ASCB+180                                                 01987000
ASCBSRQ1 EQU   ASCBSRQ                                                  01988000
ASCBSRQ2 EQU   ASCBSRQ+1                                                01989000
ASCBSRQ3 EQU   ASCBSRQ+2                                                01990000
ASCBSRQ4 EQU   ASCBSRQ+3                                                01991000
TCBFIX   EQU   0                                                        01992000
TCBFRS   EQU   TCBFIX                                                   01993000
TCB      EQU   0                                                        01994000
TCBRBP   EQU   TCB                                                      01995000
TCBPIE   EQU   TCB+4                                                    01996000
TCBPMASK EQU   TCBPIE                                                   01997000
TCBCMP   EQU   TCB+16                                                   01998000
TCBCMPF  EQU   TCBCMP                                                   01999000
TCBCPP   EQU   TCBCMPF                                                  02000000
TCBSTCC  EQU   TCBCMPF                                                  02001000
TCBCDBL  EQU   TCBCMPF                                                  02002000
TCBCWTO  EQU   TCBCMPF                                                  02003000
TCBCIND  EQU   TCBCMPF                                                  02004000
TCBCMSG  EQU   TCBCMPF                                                  02005000
TCBTRN   EQU   TCB+20                                                   02006000
TCBABF   EQU   TCBTRN                                                   02007000
TCBMSS   EQU   TCB+24                                                   02008000
TCBPKF   EQU   TCB+28                                                   02009000
TCBFLGS  EQU   TCB+29                                                   02010000
TCBFLGS1 EQU   TCBFLGS                                                  02011000
TCBFLGS2 EQU   TCBFLGS+1                                                02012000
TCBFLGS3 EQU   TCBFLGS+2                                                02013000
TCBFLGS4 EQU   TCBFLGS+3                                                02014000
TCBFLGS5 EQU   TCBFLGS+4                                                02015000
TCBABWF  EQU   TCBFLGS5                                                 02016000
TCBJPQ   EQU   TCB+44                                                   02017000
TCBPURGE EQU   TCBJPQ                                                   02018000
TCBGRS   EQU   TCB+48                                                   02019000
TCBFSA   EQU   TCB+112                                                  02020000
TCBTME   EQU   TCB+120                                                  02021000
TCBTQET  EQU   TCBTME                                                   02022000
TCBJSTCB EQU   TCB+124                                                  02023000
TCBTSFLG EQU   TCB+148                                                  02024000
TCBTSTSK EQU   TCBTSFLG                                                 02025000
TCBSTAB  EQU   TCB+160                                                  02026000
TCBNSTAE EQU   TCBSTAB                                                  02027000
TCBTCT   EQU   TCB+164                                                  02028000
TCBTCTGF EQU   TCBTCT                                                   02029000
TCBSCNDY EQU   TCB+172                                                  02030000
TCBNDSP  EQU   TCBSCNDY                                                 02031000
TCBNDSP1 EQU   TCBNDSP+1                                                02032000
TCBNDSP2 EQU   TCBNDSP+2                                                02033000
TCBNDSP3 EQU   TCBNDSP+3                                                02034000
TCBJSCB  EQU   TCB+180                                                  02035000
TCBRECDE EQU   TCBJSCB                                                  02036000
TCBEXT1  EQU   TCB+196                                                  02037000
TCBBITS  EQU   TCB+200                                                  02038000
TCBNDSP4 EQU   TCBBITS                                                  02039000
TCBNDSP5 EQU   TCBBITS+1                                                02040000
TCBFLGS6 EQU   TCBBITS+2                                                02041000
TCBFLGS7 EQU   TCBBITS+3                                                02042000
TCBDAR   EQU   TCB+204                                                  02043000
TCBDARC  EQU   TCBDAR                                                   02044000
TCBEXT2  EQU   TCB+208                                                  02045000
TCBXSCT  EQU   TCB+240                                                  02046000
TCBXSCT1 EQU   TCBXSCT                                                  02047000
TCBFOE   EQU   TCB+244                                                  02048000
TCBESTAE EQU   TCB+264                                                  02049000
TCBESTRM EQU   TCBESTAE+1                                               02050000
TCBAFFN  EQU   TCB+274                                                  02051000
TCBFBYT1 EQU   TCB+276                                                  02052000
TCBFBYT2 EQU   TCB+277                                                  02053000
TCBRV124 EQU   TCB+278                                                  02054000
TCBRV133 EQU   TCB+279                                                  02055000
TCBXTNT2 EQU   0                                                        02056000
TCBGTF   EQU   TCBXTNT2                                                 02057000
TCBTFLG  EQU   TCBGTF                                                   02058000
TCBRV146 EQU   TCBXTNT2+28                                              02059000
TCBRV155 EQU   TCBXTNT2+29                                              02060000
TCBRV164 EQU   TCBXTNT2+30                                              02061000
TCBRV173 EQU   TCBXTNT2+31                                              02062000
RBPRFX   EQU   0                                                        02063000
RBBASIC  EQU   0                                                        02064000
RBEXRTNM EQU   RBBASIC                                                  02065000
RBTMFLD  EQU   RBEXRTNM                                                 02066000
RBSTAB   EQU   RBBASIC+10                                               02067000
XSTAB    EQU   RBSTAB                                                   02068000
RBSTAB1  EQU   XSTAB                                                    02069000
XSTAB1   EQU   RBSTAB1                                                  02070000
RBFTCKPT EQU   XSTAB1                                                   02071000
RBSTAB2  EQU   XSTAB+1                                                  02072000
XSTAB2   EQU   RBSTAB2                                                  02073000
RBTCBNXT EQU   XSTAB2                                                   02074000
RBFACTV  EQU   XSTAB2                                                   02075000
RBFDYN   EQU   XSTAB2                                                   02076000
RBECBWT  EQU   XSTAB2                                                   02077000
RBOPSW   EQU   RBBASIC+16                                               02078000
XRBPSW   EQU   RBOPSW                                                   02079000
RBOPSWB2 EQU   XRBPSW+1                                                 02080000
RBLINK   EQU   RBBASIC+28                                               02081000
XRBLNK   EQU   RBLINK                                                   02082000
RBWCF    EQU   XRBLNK                                                   02083000
RBLINKB  EQU   XRBLNK+1                                                 02084000
RBGRSAVE EQU   RBBASIC+32                                               02085000
XRBREG   EQU   RBGRSAVE                                                 02086000
RBGRS0   EQU   XRBREG                                                   02087000
RBGRS1   EQU   XRBREG+4                                                 02088000
RBGRS2   EQU   XRBREG+8                                                 02089000
RBGRS3   EQU   XRBREG+12                                                02090000
RBGRS4   EQU   XRBREG+16                                                02091000
RBGRS5   EQU   XRBREG+20                                                02092000
RBGRS6   EQU   XRBREG+24                                                02093000
RBGRS7   EQU   XRBREG+28                                                02094000
RBGRS8   EQU   XRBREG+32                                                02095000
RBGRS9   EQU   XRBREG+36                                                02096000
RBGRS10  EQU   XRBREG+40                                                02097000
RBGRS11  EQU   XRBREG+44                                                02098000
RBGRS12  EQU   XRBREG+48                                                02099000
RBGRS13  EQU   XRBREG+52                                                02100000
RBGRS14  EQU   XRBREG+56                                                02101000
RBGRS15  EQU   XRBREG+60                                                02102000
XRBESA   EQU   RBBASIC+96                                               02103000
RBEXSAVE EQU   XRBESA                                                   02104000
RBPREFIX EQU   0                                                        02105000
RBRSV019 EQU   RBPREFIX+14                                              02106000
RBRSV028 EQU   RBPREFIX+15                                              02107000
RBRSV041 EQU   RBPREFIX+27                                              02108000
RBRSV054 EQU   RBPREFIX+39                                              02109000
RBRTOPSW EQU   RBPREFIX+40                                              02110000
RBRTPSW2 EQU   RBRTOPSW+8                                               02111000
RBRTICIL EQU   RBRTPSW2                                                 02112000
RBFLAGS1 EQU   RBPREFIX+56                                              02113000
RBINTCDA EQU   RBPREFIX+61                                              02114000
RBSECT   EQU   0                                                        02115000
RBPPSAV  EQU   RBSECT                                                   02116000
@NM00044 EQU   RBSECT+10                                                02117000
@NM00045 EQU   @NM00044                                                 02118000
RBTRSVRB EQU   @NM00045                                                 02119000
@NM00047 EQU   @NM00044+1                                               02120000
RBETXR   EQU   @NM00047                                                 02121000
RBEP     EQU   RBSECT+12                                                02122000
RBPGMQ   EQU   RBSECT+24                                                02123000
@NM00054 EQU   RBSECT+28                                                02124000
@NM00055 EQU   @NM00054                                                 02125000
IRBEND   EQU   RBSECT+96                                                02126000
@NM00058 EQU   RBSECT+96                                                02127000
RBRSV138 EQU   @NM00058+7                                               02128000
RBSCBB   EQU   RBSECT+144                                               02129000
RBSPARM  EQU   RBSCBB+8                                                 02130000
RBSFLGS1 EQU   RBSPARM                                                  02131000
RBSIOPRC EQU   RBSFLGS1                                                 02132000
RBSOWNR  EQU   RBSCBB+12                                                02133000
RBSFLGS2 EQU   RBSOWNR                                                  02134000
RBSDATA  EQU   RBSCBB+16                                                02135000
RBSFLG3  EQU   RBSDATA                                                  02136000
RBRSV150 EQU   RBSECT+167                                               02137000
SCB      EQU   0                                                        02138000
SCBPARM  EQU   SCB+8                                                    02139000
SCBFLGS1 EQU   SCBPARM                                                  02140000
SCBIOPRC EQU   SCBFLGS1                                                 02141000
SCBOWNR  EQU   SCB+12                                                   02142000
SCBFLGS2 EQU   SCBOWNR                                                  02143000
SCBDATA  EQU   SCB+16                                                   02144000
SCBFLGS3 EQU   SCBDATA                                                  02145000
SDWA     EQU   0                                                        02146000
SDWAPARM EQU   SDWA                                                     02147000
SDWAFIOB EQU   SDWA+4                                                   02148000
SDWAABCC EQU   SDWAFIOB                                                 02149000
SDWACMPF EQU   SDWAABCC                                                 02150000
SDWAREQ  EQU   SDWACMPF                                                 02151000
SDWACMPC EQU   SDWAABCC+1                                               02152000
SDWACTL1 EQU   SDWA+8                                                   02153000
SDWACMKA EQU   SDWACTL1                                                 02154000
SDWAMWPA EQU   SDWACTL1+1                                               02155000
SDWAPMKA EQU   SDWACTL1+4                                               02156000
SDWACTL2 EQU   SDWA+16                                                  02157000
SDWACMKP EQU   SDWACTL2                                                 02158000
SDWAMWPP EQU   SDWACTL2+1                                               02159000
SDWAPMKP EQU   SDWACTL2+4                                               02160000
SDWAGRSV EQU   SDWA+24                                                  02161000
SDWAGR05 EQU   SDWAGRSV+20                                              02162000
SDWANAME EQU   SDWA+88                                                  02163000
SDWAEC1  EQU   SDWA+104                                                 02164000
SDWAEMK1 EQU   SDWAEC1                                                  02165000
SDWAMWP1 EQU   SDWAEC1+1                                                02166000
SDWAINT1 EQU   SDWAEC1+2                                                02167000
SDWANXT1 EQU   SDWAEC1+4                                                02168000
SDWAAEC1 EQU   SDWA+112                                                 02169000
SDWAILC1 EQU   SDWAAEC1+1                                               02170000
SDWAINC1 EQU   SDWAAEC1+2                                               02171000
SDWAICD1 EQU   SDWAINC1+1                                               02172000
SDWAEC2  EQU   SDWA+120                                                 02173000
SDWAEMK2 EQU   SDWAEC2                                                  02174000
SDWAMWP2 EQU   SDWAEC2+1                                                02175000
SDWAINT2 EQU   SDWAEC2+2                                                02176000
SDWANXT2 EQU   SDWAEC2+4                                                02177000
SDWAAEC2 EQU   SDWA+128                                                 02178000
SDWAILC2 EQU   SDWAAEC2+1                                               02179000
SDWAINC2 EQU   SDWAAEC2+2                                               02180000
SDWAICD2 EQU   SDWAINC2+1                                               02181000
SDWASRSV EQU   SDWA+136                                                 02182000
SDWAIDNT EQU   SDWA+200                                                 02183000
SDWAMCH  EQU   SDWA+204                                                 02184000
SDWASTCK EQU   SDWAMCH                                                  02185000
SDWAMCHI EQU   SDWAMCH+8                                                02186000
SDWAMCHS EQU   SDWAMCHI                                                 02187000
SDWAMCHD EQU   SDWAMCHI+1                                               02188000
SDWARSR1 EQU   SDWAMCH+12                                               02189000
SDWARSR2 EQU   SDWAMCH+13                                               02190000
SDWAFLGS EQU   SDWA+232                                                 02191000
SDWAERRA EQU   SDWAFLGS                                                 02192000
SDWAPCHK EQU   SDWAERRA                                                 02193000
SDWAERRB EQU   SDWAFLGS+1                                               02194000
SDWAERRC EQU   SDWAFLGS+2                                               02195000
SDWAERRD EQU   SDWAFLGS+3                                               02196000
SDWAFMID EQU   SDWA+236                                                 02197000
SDWAIOFS EQU   SDWA+238                                                 02198000
SDWACPUA EQU   SDWA+248                                                 02199000
SDWAPARQ EQU   SDWA+252                                                 02200000
SDWARCDE EQU   SDWAPARQ                                                 02201000
SDWAACF2 EQU   SDWAPARQ+1                                               02202000
SDWARCRD EQU   SDWAACF2                                                 02203000
SDWAACF3 EQU   SDWAPARQ+2                                               02204000
SDWAACF4 EQU   SDWAPARQ+3                                               02205000
SDWALKWA EQU   SDWA+256                                                 02206000
SDWALKWS EQU   SDWALKWA                                                 02207000
SDWARECP EQU   SDWA+292                                                 02208000
SDWAMODN EQU   SDWARECP                                                 02209000
SDWACSCT EQU   SDWARECP+8                                               02210000
SDWAREXN EQU   SDWARECP+16                                              02211000
SDWASNPA EQU   SDWA+320                                                 02212000
SDWADUMP EQU   SDWASNPA                                                 02213000
SDWADPFS EQU   SDWADUMP+1                                               02214000
SDWADDAT EQU   SDWASNPA+4                                               02215000
SDWASDAT EQU   SDWADDAT                                                 02216000
SDWAPDAT EQU   SDWADDAT+2                                               02217000
SDWADPSA EQU   SDWA+328                                                 02218000
SDWADPSL EQU   SDWADPSA                                                 02219000
SDWARA   EQU   SDWA+400                                                 02220000
SDWADPVA EQU   SDWARA+2                                                 02221000
TPC      EQU   0                                                        02222000
IEATPC   EQU   TPC                                                      02223000
TPCFLGS1 EQU   IEATPC+4                                                 02224000
TPCHDCCQ EQU   IEATPC+12                                                02225000
TPCDMTQE EQU   IEATPC+16                                                02226000
DFD      EQU   TPCDMTQE+4                                               02227000
TPCMNTQE EQU   IEATPC+40                                                02228000
MNIGHT   EQU   TPCMNTQE+16                                              02229000
MNIGHTLH EQU   MNIGHT                                                   02230000
MNIGHTRH EQU   MNIGHT+4                                                 02231000
TPCMFTQE EQU   IEATPC+64                                                02232000
IEATSELM EQU   IEATPC+88                                                02233000
TPCLMTQE EQU   IEATPC+112                                               02234000
TPCWORK  EQU   IEATPC+264                                               02235000
TQE      EQU   0                                                        02236000
TQETQE   EQU   TQE                                                      02237000
TQEAID   EQU   TQE+12                                                   02238000
TQEFLGS  EQU   TQE+14                                                   02239000
TQEOFF   EQU   TQEFLGS                                                  02240000
TQETOD   EQU   TQEFLGS                                                  02241000
TQEXITSP EQU   TQEFLGS                                                  02242000
TQETYPE  EQU   TQEFLGS                                                  02243000
TQEFLGS2 EQU   TQE+15                                                   02244000
TQEVAL   EQU   TQE+16                                                   02245000
TQEVALLH EQU   TQEVAL                                                   02246000
TQEVALRH EQU   TQEVAL+4                                                 02247000
TQESADDR EQU   TQE+24                                                   02248000
TQEEXIT  EQU   TQE+28                                                   02249000
TQETCB   EQU   TQE+32                                                   02250000
TQEASCB  EQU   TQE+36                                                   02251000
TQELHPSW EQU   TQE+40                                                   02252000
TQESRB   EQU   TQE+44                                                   02253000
TQEFLGS3 EQU   TQE+88                                                   02254000
TQESTCK  EQU   TQE+120                                                  02255000
USERINTV EQU   0                                                        02256000
USERINTH EQU   0                                                        02257000
FREESTRG EQU   0                                                        02258000
AREA     EQU   0                                                        02259000
ENQTQE   EQU   0                                                        02260000
DEQTQE   EQU   0                                                        02261000
WAITBR   EQU   0                                                        02262000
I001C    EQU   0                                                        02263000
I008P    EQU   0                                                        02264000
I015F    EQU   0                                                        02265000
I015P    EQU   0                                                        02266000
I031F    EQU   0                                                        02267000
I031P    EQU   0                                                        02268000
I256C    EQU   0                                                        02269000
FLC      EQU   PSA                                                      02270000
PSARSVTE EQU   PSARSVT                                                  02271000
CVTS01   EQU   CVTPGSIA                                                 02272000
CVTPVTP  EQU   CVTS01+8                                                 02273000
CVTLPDIA EQU   CVTS01+12                                                02274000
CVTDIRST EQU   CVTLPDIA                                                 02275000
CVTSLIDA EQU   CVTS01+24                                                02276000
CVTCTLFG EQU   CVTS01+50                                                02277000
CVTCRMN  EQU   CVTS01+156                                               02278000
CVTVWAIT EQU   CVTS01+276                                               02279000
CVTCSD   EQU   CVTS01+312                                               02280000
CVTRV210 EQU   CVTS01+424                                               02281000
CVTRV219 EQU   CVTS01+425                                               02282000
CVTRV228 EQU   CVTS01+426                                               02283000
CVTRV237 EQU   CVTS01+427                                               02284000
CVTMFRTR EQU   CVTS01+452                                               02285000
CVTRV262 EQU   CVTS01+468                                               02286000
CVTRV271 EQU   CVTS01+469                                               02287000
CVTRV280 EQU   CVTS01+470                                               02288000
CVTRV289 EQU   CVTS01+471                                               02289000
CVTGSDA  EQU   CVTS01+600                                               02290000
PCCAPTR  EQU   PSAPCCAV                                                 02291000
PVTPTR   EQU   CVTPVTP                                                  02292000
RBSECS03 EQU   RBEP                                                     02293000
RBCDE    EQU   RBSECS03                                                 02294000
RBCDFLGS EQU   RBCDE                                                    02295000
RBSECS05 EQU   RBPGMQ                                                   02296000
RBSQE    EQU   RBSECS05                                                 02297000
RBSECS06 EQU   RBPGMQ                                                   02298000
RBIQE    EQU   RBSECS06                                                 02299000
RBSECS07 EQU   RBPGMQ                                                   02300000
RBIQE2   EQU   RBSECS07                                                 02301000
RBSECS08 EQU   IRBEND                                                   02302000
RBSECS09 EQU   IRBEND                                                   02303000
SCBPTR   EQU   TCBSTAB                                                  02304000
TQEECB   EQU   TQEEXIT                                                  02305000
SVRBXSA  EQU   RBEXSAVE                                                 02306000
TIME     EQU   SVRBXSA                                                  02307000
TIMELH   EQU   TIME                                                     02308000
TIMERH   EQU   TIME+4                                                   02309000
INTV     EQU   SVRBXSA+8                                                02310000
INTVLH   EQU   INTV                                                     02311000
INTVRH   EQU   INTV+4                                                   02312000
SAVR     EQU   SVRBXSA+16                                               02313000
ERROR    EQU   SVRBXSA+28                                               02314000
XSAFLGS  EQU   SVRBXSA+31                                               02315000
XSATMTYP EQU   XSAFLGS                                                  02316000
XSATMOK  EQU   XSAFLGS                                                  02317000
XSAHIGH  EQU   XSAFLGS                                                  02318000
XSAUAREA EQU   XSAFLGS                                                  02319000
TZ       EQU   SVRBXSA+32                                               02320000
PGFIXECB EQU   TZ                                                       02321000
STCKAREA EQU   SVRBXSA+40                                               02322000
INPTR    EQU   SAVR                                                     02323000
CSDPTR   EQU   CVTCSD                                                   02324000
*                                      START UNREFERENCED COMPONENTS    02325000
DATE     EQU   SVRBXSA+36                                               02326000
@NM00155 EQU   XSAFLGS                                                  02327000
@NM00154 EQU   XSAFLGS                                                  02328000
@NM00153 EQU   SVRBXSA+30                                               02329000
CCODE    EQU   SVRBXSA+29                                               02330000
RBRSV161 EQU   RBSECS09+64                                              02331000
RBSIRBWA EQU   RBSECS09                                                 02332000
RBIQEWRK EQU   RBSECS08+4                                               02333000
RBNEXAV  EQU   RBSECS08                                                 02334000
RBIQEA   EQU   RBIQE2                                                   02335000
RBIQE1   EQU   RBIQE+1                                                  02336000
RBUSE    EQU   RBIQE                                                    02337000
RBSQEA   EQU   RBSQE+1                                                  02338000
@NM00059 EQU   RBSQE                                                    02339000
RBCDE1   EQU   RBCDE+1                                                  02340000
RBCDLOAD EQU   RBCDFLGS                                                 02341000
RBCDXCTL EQU   RBCDFLGS                                                 02342000
RBCDSYNC EQU   RBCDFLGS                                                 02343000
RBCDNODE EQU   RBCDFLGS                                                 02344000
RBRSV010 EQU   RBCDFLGS                                                 02345000
RBCDATCH EQU   RBCDFLGS                                                 02346000
RBRSV009 EQU   RBCDFLGS                                                 02347000
RBNOCELL EQU   RBCDFLGS                                                 02348000
CVTRV628 EQU   CVTS01+728                                               02349000
CVTRV627 EQU   CVTS01+724                                               02350000
CVTRV626 EQU   CVTS01+720                                               02351000
CVTRV625 EQU   CVTS01+716                                               02352000
CVTRV624 EQU   CVTS01+712                                               02353000
CVTRV623 EQU   CVTS01+708                                               02354000
CVTRV622 EQU   CVTS01+704                                               02355000
CVTRV621 EQU   CVTS01+700                                               02356000
CVTIHASU EQU   CVTS01+696                                               02357000
CVTSUSP  EQU   CVTS01+692                                               02358000
CVTT6SVC EQU   CVTS01+688                                               02359000
CVTCDAL  EQU   CVTS01+684                                               02360000
CVTTCTL  EQU   CVTS01+680                                               02361000
CVTRSUME EQU   CVTS01+676                                               02362000
CVTJTERM EQU   CVTS01+672                                               02363000
CVTASMRM EQU   CVTS01+668                                               02364000
CVTTCASP EQU   CVTS01+664                                               02365000
CVT0PT03 EQU   CVTS01+660                                               02366000
CVT0PT0E EQU   CVTS01+656                                               02367000
CVTRV609 EQU   CVTS01+652                                               02368000
CVTCGK   EQU   CVTS01+648                                               02369000
CVTRAC   EQU   CVTS01+644                                               02370000
CVTRV606 EQU   CVTS01+640                                               02371000
CVTRV605 EQU   CVTS01+636                                               02372000
CVTRV604 EQU   CVTS01+632                                               02373000
CVTEFF02 EQU   CVTS01+628                                               02374000
CVTCBBR  EQU   CVTS01+624                                               02375000
CVTSSCR  EQU   CVTS01+620                                               02376000
CVTEVENT EQU   CVTS01+616                                               02377000
CVTCRCA  EQU   CVTS01+612                                               02378000
CVTTPIO  EQU   CVTS01+608                                               02379000
CVTADV   EQU   CVTS01+604                                               02380000
CVTGSDAB EQU   CVTGSDA                                                  02381000
CVTQV3   EQU   CVTS01+596                                               02382000
CVTQV2   EQU   CVTS01+592                                               02383000
CVTQV1   EQU   CVTS01+588                                               02384000
CVTRPT   EQU   CVTS01+584                                               02385000
CVTSSRB  EQU   CVTS01+580                                               02386000
CVTCSDRL EQU   CVTS01+576                                               02387000
CVTEXP1  EQU   CVTS01+572                                               02388000
CVTRMPMT EQU   CVTS01+568                                               02389000
CVTRMPTT EQU   CVTS01+564                                               02390000
CVTVPSA  EQU   CVTS01+560                                               02391000
CVTVSTOP EQU   CVTS01+556                                               02392000
CVTGTFR8 EQU   CVTS01+552                                               02393000
CVTQUIT  EQU   CVTS01+548                                               02394000
CVTVACR  EQU   CVTS01+544                                               02395000
CVTWTCB  EQU   CVTS01+540                                               02396000
CVTSTPRS EQU   CVTS01+536                                               02397000
CVT0PT02 EQU   CVTS01+532                                               02398000
CVTDARCM EQU   CVTS01+528                                               02399000
CVTIRECM EQU   CVTS01+524                                               02400000
CVTJRECM EQU   CVTS01+520                                               02401000
CVTVEMS0 EQU   CVTS01+516                                               02402000
CVTSPFRR EQU   CVTS01+512                                               02403000
CVTRLSTG EQU   CVTS01+508                                               02404000
CVT0TC0A EQU   CVTS01+504                                               02405000
CVTGMBR  EQU   CVTS01+500                                               02406000
CVTLFRM  EQU   CVTS01+496                                               02407000
CVTRMBR  EQU   CVTS01+492                                               02408000
CVTVIOP  EQU   CVTS01+488                                               02409000
CVTRV307 EQU   CVTS01+486                                               02410000
CVTRV306 EQU   CVTS01+484                                               02411000
CVTRV305 EQU   CVTS01+482                                               02412000
CVTRV304 EQU   CVTS01+480                                               02413000
CVTRV303 EQU   CVTS01+478                                               02414000
CVTRV302 EQU   CVTS01+476                                               02415000
CVTTRCA  EQU   CVTS01+472                                               02416000
CVTRV297 EQU   CVTRV289                                                 02417000
CVTRV296 EQU   CVTRV289                                                 02418000
CVTRV295 EQU   CVTRV289                                                 02419000
CVTRV294 EQU   CVTRV289                                                 02420000
CVTRV293 EQU   CVTRV289                                                 02421000
CVTRV292 EQU   CVTRV289                                                 02422000
CVTRV291 EQU   CVTRV289                                                 02423000
CVTRV290 EQU   CVTRV289                                                 02424000
CVTRV288 EQU   CVTRV280                                                 02425000
CVTRV287 EQU   CVTRV280                                                 02426000
CVTRV286 EQU   CVTRV280                                                 02427000
CVTRV285 EQU   CVTRV280                                                 02428000
CVTRV284 EQU   CVTRV280                                                 02429000
CVTRV283 EQU   CVTRV280                                                 02430000
CVTRV282 EQU   CVTRV280                                                 02431000
CVTRV281 EQU   CVTRV280                                                 02432000
CVTRV279 EQU   CVTRV271                                                 02433000
CVTRV278 EQU   CVTRV271                                                 02434000
CVTRV277 EQU   CVTRV271                                                 02435000
CVTRV276 EQU   CVTRV271                                                 02436000
CVTRV275 EQU   CVTRV271                                                 02437000
CVTRV274 EQU   CVTRV271                                                 02438000
CVTRV273 EQU   CVTRV271                                                 02439000
CVTRV272 EQU   CVTRV271                                                 02440000
CVTRV270 EQU   CVTRV262                                                 02441000
CVTRV269 EQU   CVTRV262                                                 02442000
CVTRV268 EQU   CVTRV262                                                 02443000
CVTRV267 EQU   CVTRV262                                                 02444000
CVTRV266 EQU   CVTRV262                                                 02445000
CVTRV265 EQU   CVTRV262                                                 02446000
CVTRV264 EQU   CVTRV262                                                 02447000
CVTRV263 EQU   CVTRV262                                                 02448000
CVTVFP   EQU   CVTS01+464                                               02449000
CVTVSI   EQU   CVTS01+460                                               02450000
CVTVPSIB EQU   CVTS01+456                                               02451000
CVTMFACT EQU   CVTMFRTR                                                 02452000
CVTMFCTL EQU   CVTS01+448                                               02453000
CVTPVBP  EQU   CVTS01+444                                               02454000
CVTPWI   EQU   CVTS01+440                                               02455000
CVTRV254 EQU   CVTS01+438                                               02456000
CVTRV253 EQU   CVTS01+436                                               02457000
CVTRV252 EQU   CVTS01+434                                               02458000
CVTRV251 EQU   CVTS01+433                                               02459000
CVTRV250 EQU   CVTS01+432                                               02460000
CVTRV249 EQU   CVTS01+431                                               02461000
CVTRV248 EQU   CVTS01+430                                               02462000
CVTRV247 EQU   CVTS01+429                                               02463000
CVTRV246 EQU   CVTS01+428                                               02464000
CVTRV245 EQU   CVTRV237                                                 02465000
CVTRV244 EQU   CVTRV237                                                 02466000
CVTRV243 EQU   CVTRV237                                                 02467000
CVTRV242 EQU   CVTRV237                                                 02468000
CVTRV241 EQU   CVTRV237                                                 02469000
CVTRV240 EQU   CVTRV237                                                 02470000
CVTRV239 EQU   CVTRV237                                                 02471000
CVTRV238 EQU   CVTRV237                                                 02472000
CVTRV236 EQU   CVTRV228                                                 02473000
CVTRV235 EQU   CVTRV228                                                 02474000
CVTRV234 EQU   CVTRV228                                                 02475000
CVTRV233 EQU   CVTRV228                                                 02476000
CVTRV232 EQU   CVTRV228                                                 02477000
CVTRV231 EQU   CVTRV228                                                 02478000
CVTRV230 EQU   CVTRV228                                                 02479000
CVTRV229 EQU   CVTRV228                                                 02480000
CVTRV227 EQU   CVTRV219                                                 02481000
CVTRV226 EQU   CVTRV219                                                 02482000
CVTRV225 EQU   CVTRV219                                                 02483000
CVTRV224 EQU   CVTRV219                                                 02484000
CVTRV223 EQU   CVTRV219                                                 02485000
CVTRV222 EQU   CVTRV219                                                 02486000
CVTRV221 EQU   CVTRV219                                                 02487000
CVTRV220 EQU   CVTRV219                                                 02488000
CVTRV218 EQU   CVTRV210                                                 02489000
CVTRV217 EQU   CVTRV210                                                 02490000
CVTRV216 EQU   CVTRV210                                                 02491000
CVTRV215 EQU   CVTRV210                                                 02492000
CVTRV214 EQU   CVTRV210                                                 02493000
CVTRV213 EQU   CVTRV210                                                 02494000
CVTRV212 EQU   CVTRV210                                                 02495000
CVTRV211 EQU   CVTRV210                                                 02496000
CVTLCCAT EQU   CVTS01+420                                               02497000
CVTPCCAT EQU   CVTS01+416                                               02498000
CVTIPCRP EQU   CVTS01+412                                               02499000
CVTIPCRI EQU   CVTS01+408                                               02500000
CVTIPCDS EQU   CVTS01+404                                               02501000
CVTAIDVT EQU   CVTS01+400                                               02502000
CVTSSAP  EQU   CVTS01+396                                               02503000
CVTEHCIR EQU   CVTS01+392                                               02504000
CVTEHDEF EQU   CVTS01+388                                               02505000
CVTDAIR  EQU   CVTS01+384                                               02506000
CVTPERFM EQU   CVTS01+380                                               02507000
CVT044R2 EQU   CVTS01+376                                               02508000
CVTFETCH EQU   CVTS01+372                                               02509000
CVTRSTWD EQU   CVTS01+368                                               02510000
CVTSPOST EQU   CVTS01+364                                               02511000
CVTIOBP  EQU   CVTS01+360                                               02512000
CVTASMVT EQU   CVTS01+356                                               02513000
CVTRECRQ EQU   CVTS01+352                                               02514000
CVTWSAC  EQU   CVTS01+348                                               02515000
CVTRV149 EQU   CVTS01+344                                               02516000
CVTWSAL  EQU   CVTS01+340                                               02517000
CVTSPSA  EQU   CVTS01+336                                               02518000
CVTGLMN  EQU   CVTS01+332                                               02519000
CVTVEAC0 EQU   CVTS01+328                                               02520000
CVT062R1 EQU   CVTS01+324                                               02521000
CVTRPOST EQU   CVTS01+320                                               02522000
CVTDQIQE EQU   CVTS01+316                                               02523000
CVTLKRMA EQU   CVTS01+308                                               02524000
CVTRSPIE EQU   CVTS01+304                                               02525000
CVTRENQ  EQU   CVTS01+300                                               02526000
CVTLQCB  EQU   CVTS01+296                                               02527000
CVTFQCB  EQU   CVTS01+292                                               02528000
CVTQCS01 EQU   CVTS01+288                                               02529000
CVTAPFT  EQU   CVTS01+284                                               02530000
CVTPARRL EQU   CVTS01+280                                               02531000
CVTGSPL  EQU   CVTS01+272                                               02532000
CVTLSMQ  EQU   CVTS01+268                                               02533000
CVTGSMQ  EQU   CVTS01+264                                               02534000
CVTEXPRO EQU   CVTS01+260                                               02535000
CVTOPCTP EQU   CVTS01+256                                               02536000
CVTSIC   EQU   CVTS01+252                                               02537000
CVTTPIOS EQU   CVTS01+248                                               02538000
CVTRTMS  EQU   CVTS01+244                                               02539000
CVTSDBF  EQU   CVTS01+240                                               02540000
CVTSCBP  EQU   CVTS01+236                                               02541000
CVTSDMP  EQU   CVTS01+232                                               02542000
CVTSV60  EQU   CVTS01+228                                               02543000
CVTRTMCT EQU   CVTS01+224                                               02544000
CVTASCBL EQU   CVTS01+220                                               02545000
CVTASCBH EQU   CVTS01+216                                               02546000
CVTGDA   EQU   CVTS01+212                                               02547000
CVTASVT  EQU   CVTS01+208                                               02548000
CVTVVMDI EQU   CVTS01+204                                               02549000
CVTAQTOP EQU   CVTS01+200                                               02550000
CVTIOSCS EQU   CVTS01+196                                               02551000
CVTSDRM  EQU   CVTS01+192                                               02552000
CVTOPTE  EQU   CVTS01+188                                               02553000
CVTSTXU  EQU   CVTS01+184                                               02554000
CVTQUIS  EQU   CVTS01+180                                               02555000
CVTPARS  EQU   CVTS01+176                                               02556000
CVTS1EE  EQU   CVTS01+172                                               02557000
CVTFRAS  EQU   CVTS01+168                                               02558000
CVTQSAS  EQU   CVTS01+164                                               02559000
CVTCRAS  EQU   CVTS01+160                                               02560000
CVTDELCP EQU   CVTS01+152                                               02561000
CVTFRECL EQU   CVTS01+148                                               02562000
CVTGETCL EQU   CVTS01+144                                               02563000
CVTBLDCP EQU   CVTS01+140                                               02564000
CVTAUTHL EQU   CVTS01+136                                               02565000
CVTSCAN  EQU   CVTS01+132                                               02566000
CVTRV144 EQU   CVTS01+130                                               02567000
CVTMAXMP EQU   CVTS01+128                                               02568000
CVTSTCK  EQU   CVTS01+124                                               02569000
CVTRV139 EQU   CVTS01+123                                               02570000
CVTDSSAC EQU   CVTS01+122                                               02571000
CVTRV513 EQU   CVTS01+121                                               02572000
CVTIOSPL EQU   CVTS01+120                                               02573000
CVTPTGT  EQU   CVTS01+116                                               02574000
CVTCSPIE EQU   CVTS01+112                                               02575000
CVTSMFEX EQU   CVTS01+108                                               02576000
CVTOLT0A EQU   CVTS01+104                                               02577000
CVTSRBRT EQU   CVTS01+100                                               02578000
CVTPUTL  EQU   CVTS01+96                                                02579000
CVTASCRL EQU   CVTS01+92                                                02580000
CVTASCRF EQU   CVTS01+88                                                02581000
CVTRV326 EQU   CVTS01+84                                                02582000
CVTRV325 EQU   CVTS01+80                                                02583000
CVTRV324 EQU   CVTS01+76                                                02584000
CVT0VL01 EQU   CVTS01+72                                                02585000
CVTSHRVM EQU   CVTS01+68                                                02586000
CVTRV332 EQU   CVTS01+64                                                02587000
CVTTAS   EQU   CVTS01+60                                                02588000
CVTRSCN  EQU   CVTS01+56                                                02589000
CVTTRAC2 EQU   CVTS01+54                                                02590000
CVTTRACE EQU   CVTS01+52                                                02591000
CVTAPG   EQU   CVTS01+51                                                02592000
CVTSDTRC EQU   CVTCTLFG                                                 02593000
CVTGTRCE EQU   CVTCTLFG                                                 02594000
CVTNOMP  EQU   CVTCTLFG                                                 02595000
CVTRSV79 EQU   CVTCTLFG                                                 02596000
CVTDSTAT EQU   CVTCTLFG                                                 02597000
CVTRSV78 EQU   CVTCTLFG                                                 02598000
CVTRV333 EQU   CVTCTLFG                                                 02599000
CVTRV323 EQU   CVTCTLFG                                                 02600000
CVTSPVLK EQU   CVTS01+49                                                02601000
CVTRSV77 EQU   CVTS01+48                                                02602000
CVTRV331 EQU   CVTS01+44                                                02603000
CVTRV330 EQU   CVTS01+40                                                02604000
CVTRV329 EQU   CVTS01+36                                                02605000
CVTRV328 EQU   CVTS01+32                                                02606000
CVTRV322 EQU   CVTS01+28                                                02607000
CVTSLID  EQU   CVTSLIDA+1                                               02608000
CVTSYLK  EQU   CVTSLIDA                                                 02609000
CVTRV321 EQU   CVTS01+20                                                02610000
CVTRV320 EQU   CVTS01+16                                                02611000
CVTLPDIR EQU   CVTLPDIA+1                                               02612000
CVTRSV69 EQU   CVTDIRST                                                 02613000
CVTRSV68 EQU   CVTDIRST                                                 02614000
CVTRSV67 EQU   CVTDIRST                                                 02615000
CVTRSV66 EQU   CVTDIRST                                                 02616000
CVTRSV65 EQU   CVTDIRST                                                 02617000
CVTRSV64 EQU   CVTDIRST                                                 02618000
CVTRSV63 EQU   CVTDIRST                                                 02619000
CVTDICOM EQU   CVTDIRST                                                 02620000
CVTLPDSR EQU   CVTS01+4                                                 02621000
CVTGETL  EQU   CVTS01                                                   02622000
PSARSAV  EQU   PSARSVTE+60                                              02623000
PSARSTK  EQU   PSARSVTE+56                                              02624000
PSAESAV3 EQU   PSARSVTE+52                                              02625000
PSAESTK3 EQU   PSARSVTE+48                                              02626000
PSAESAV2 EQU   PSARSVTE+44                                              02627000
PSAESTK2 EQU   PSARSVTE+40                                              02628000
PSAESAV1 EQU   PSARSVTE+36                                              02629000
PSAESTK1 EQU   PSARSVTE+32                                              02630000
PSAPSAV  EQU   PSARSVTE+28                                              02631000
PSAPSTK  EQU   PSARSVTE+24                                              02632000
PSAMSAV  EQU   PSARSVTE+20                                              02633000
PSAMSTK  EQU   PSARSVTE+16                                              02634000
PSASSAV  EQU   PSARSVTE+12                                              02635000
PSASSTK  EQU   PSARSVTE+8                                               02636000
PSANSTK  EQU   PSARSVTE+4                                               02637000
PSACSTK  EQU   PSARSVTE                                                 02638000
TQESTCKR EQU   TQESTCK+4                                                02639000
TQESTCKL EQU   TQESTCK                                                  02640000
TQERSAVE EQU   TQE+116                                                  02641000
@NM00152 EQU   TQE+89                                                   02642000
@NM00151 EQU   TQEFLGS3                                                 02643000
TQEDIE   EQU   TQEFLGS3                                                 02644000
TQEDREGS EQU   TQESRB                                                   02645000
TQEMIDN  EQU   TQEFLGS2                                                 02646000
TQEMF1   EQU   TQEFLGS2                                                 02647000
TQEOPT   EQU   TQEFLGS2                                                 02648000
TQELM    EQU   TQEFLGS2                                                 02649000
TQEDUM   EQU   TQEFLGS2                                                 02650000
TQECRH   EQU   TQEFLGS2                                                 02651000
TQEUSER  EQU   TQEFLGS2                                                 02652000
TQECOMP  EQU   TQEFLGS2                                                 02653000
TQEINCOM EQU   TQEFLGS                                                  02654000
TQEWLIM  EQU   TQEFLGS                                                  02655000
@NM00150 EQU   TQEFLGS                                                  02656000
TQEBLNK  EQU   TQE+8                                                    02657000
TQEFLNK  EQU   TQE+4                                                    02658000
TPCOCL   EQU   IEATPC+416                                               02659000
TPCSDIE  EQU   IEATPC+412                                               02660000
TPCCLA   EQU   IEATPC+408                                               02661000
TPCCKQ   EQU   IEATPC+404                                               02662000
TPCRSRB  EQU   IEATPC+360                                               02663000
TPCTCWA  EQU   IEATPC+356                                               02664000
TPCCRSAV EQU   IEATPC+352                                               02665000
TPCFRRP  EQU   IEATPC+348                                               02666000
TPCVPTR  EQU   IEATPC+344                                               02667000
TPCMISC  EQU   IEATPC+272                                               02668000
TPCWORKR EQU   TPCWORK+4                                                02669000
TPCWORKL EQU   TPCWORK                                                  02670000
TPCSAVE2 EQU   IEATPC+200                                               02671000
TPCSAVE1 EQU   IEATPC+136                                               02672000
@NM00149 EQU   TPCLMTQE+16                                              02673000
@NM00148 EQU   TPCLMTQE+15                                              02674000
@NM00147 EQU   TPCLMTQE+14                                              02675000
@NM00146 EQU   TPCLMTQE+12                                              02676000
@NM00145 EQU   TPCLMTQE+8                                               02677000
@NM00144 EQU   TPCLMTQE+4                                               02678000
@NM00143 EQU   TPCLMTQE                                                 02679000
@NM00142 EQU   IEATSELM+16                                              02680000
@NM00141 EQU   IEATSELM+15                                              02681000
@NM00140 EQU   IEATSELM+14                                              02682000
@NM00139 EQU   IEATSELM+12                                              02683000
@NM00138 EQU   IEATSELM+8                                               02684000
@NM00137 EQU   IEATSELM+4                                               02685000
@NM00136 EQU   IEATSELM                                                 02686000
@NM00135 EQU   TPCMFTQE+16                                              02687000
@NM00134 EQU   TPCMFTQE+15                                              02688000
@NM00133 EQU   TPCMFTQE+14                                              02689000
@NM00132 EQU   TPCMFTQE+12                                              02690000
@NM00131 EQU   TPCMFTQE+8                                               02691000
@NM00130 EQU   TPCMFTQE+4                                               02692000
@NM00129 EQU   TPCMFTQE                                                 02693000
@NM00128 EQU   TPCMNTQE+15                                              02694000
@NM00127 EQU   TPCMNTQE+14                                              02695000
@NM00126 EQU   TPCMNTQE+12                                              02696000
@NM00125 EQU   TPCMNTQE+8                                               02697000
@NM00124 EQU   TPCMNTQE+4                                               02698000
@NM00123 EQU   TPCMNTQE                                                 02699000
@NM00122 EQU   TPCDMTQE+16                                              02700000
@NM00121 EQU   TPCDMTQE+15                                              02701000
@NM00120 EQU   TPCDMTQE+14                                              02702000
@NM00119 EQU   TPCDMTQE+12                                              02703000
@NM00118 EQU   TPCDMTQE+8                                               02704000
@NM00117 EQU   TPCDMTQE                                                 02705000
TPCTZORG EQU   IEATPC+8                                                 02706000
TPCCC    EQU   IEATPC+7                                                 02707000
@NM00116 EQU   IEATPC+5                                                 02708000
@NM00115 EQU   TPCFLGS1                                                 02709000
TPCSYNC  EQU   TPCFLGS1                                                 02710000
TPCABND  EQU   TPCFLGS1                                                 02711000
TPCTPCA  EQU   IEATPC                                                   02712000
@NM00114 EQU   SDWA+512                                                 02713000
SDWAVRA  EQU   SDWARA+4                                                 02714000
SDWAURAL EQU   SDWARA+3                                                 02715000
@NM00113 EQU   SDWADPVA                                                 02716000
SDWAEBC  EQU   SDWADPVA                                                 02717000
SDWAHEX  EQU   SDWADPVA                                                 02718000
SDWAVRAL EQU   SDWARA                                                   02719000
@NM00112 EQU   SDWA+396                                                 02720000
SDWACOMP EQU   SDWA+392                                                 02721000
SDWARCPL EQU   SDWA+364                                                 02722000
@NM00111 EQU   SDWADPSA+32                                              02723000
SDWATO4  EQU   SDWADPSL+28                                              02724000
SDWAFRM4 EQU   SDWADPSL+24                                              02725000
SDWATO3  EQU   SDWADPSL+20                                              02726000
SDWAFRM3 EQU   SDWADPSL+16                                              02727000
SDWATO2  EQU   SDWADPSL+12                                              02728000
SDWAFRM2 EQU   SDWADPSL+8                                               02729000
SDWATO1  EQU   SDWADPSL+4                                               02730000
SDWAFRM1 EQU   SDWADPSL                                                 02731000
@NM00110 EQU   SDWADDAT+3                                               02732000
@NM00109 EQU   SDWAPDAT                                                 02733000
SDWAUSPL EQU   SDWAPDAT                                                 02734000
SDWADPSW EQU   SDWAPDAT                                                 02735000
SDWATJPA EQU   SDWAPDAT                                                 02736000
SDWATLPA EQU   SDWAPDAT                                                 02737000
SDWADREG EQU   SDWAPDAT                                                 02738000
SDWADSAH EQU   SDWAPDAT                                                 02739000
SDWADSAS EQU   SDWAPDAT                                                 02740000
@NM00108 EQU   SDWADDAT+1                                               02741000
@NM00107 EQU   SDWASDAT                                                 02742000
SDWAQQS  EQU   SDWASDAT                                                 02743000
SDWACBS  EQU   SDWASDAT                                                 02744000
SDWAGTF  EQU   SDWASDAT                                                 02745000
SDWASWA  EQU   SDWASDAT                                                 02746000
SDWALSQA EQU   SDWASDAT                                                 02747000
SDWASQA  EQU   SDWASDAT                                                 02748000
SDWANUC  EQU   SDWASDAT                                                 02749000
@NM00106 EQU   SDWADUMP+2                                               02750000
@NM00105 EQU   SDWADPFS                                                 02751000
SDWASLST EQU   SDWADPFS                                                 02752000
@NM00104 EQU   SDWADPFS                                                 02753000
SDWADLST EQU   SDWADPFS                                                 02754000
SDWADPT  EQU   SDWADPFS                                                 02755000
SDWADPID EQU   SDWADUMP                                                 02756000
SDWADPLA EQU   SDWA+316                                                 02757000
@NM00103 EQU   SDWA+290                                                 02758000
SDWAASID EQU   SDWA+288                                                 02759000
SDWATALW EQU   SDWALKWS+28                                              02760000
SDWATDLW EQU   SDWALKWS+24                                              02761000
SDWATNLW EQU   SDWALKWS+20                                              02762000
SDWAAPLW EQU   SDWALKWS+16                                              02763000
SDWAIPLW EQU   SDWALKWS+12                                              02764000
SDWAILLW EQU   SDWALKWS+8                                               02765000
SDWAIULW EQU   SDWALKWS+4                                               02766000
SDWAICLW EQU   SDWALKWS                                                 02767000
SDWAFLLK EQU   SDWAACF4                                                 02768000
SDWACMS  EQU   SDWAACF4                                                 02769000
SDWAOPTM EQU   SDWAACF4                                                 02770000
SDWATADB EQU   SDWAACF4                                                 02771000
SDWATDNB EQU   SDWAACF4                                                 02772000
SDWATNCB EQU   SDWAACF4                                                 02773000
SDWAILCH EQU   SDWAACF4                                                 02774000
SDWAIUCB EQU   SDWAACF4                                                 02775000
SDWAICAT EQU   SDWAACF3                                                 02776000
SDWAIPRG EQU   SDWAACF3                                                 02777000
SDWASALL EQU   SDWAACF3                                                 02778000
SDWAASMP EQU   SDWAACF3                                                 02779000
SDWADISP EQU   SDWAACF3                                                 02780000
@NM00102 EQU   SDWAACF3                                                 02781000
@NM00101 EQU   SDWAACF2                                                 02782000
SDWAFREE EQU   SDWAACF2                                                 02783000
SDWAUPRG EQU   SDWAACF2                                                 02784000
@NM00100 EQU   SDWAACF2                                                 02785000
SDWASPIN EQU   SDWAACF2                                                 02786000
@NM00099 EQU   SDWAACF2                                                 02787000
SDWALCPU EQU   SDWACPUA+2                                               02788000
@NM00098 EQU   SDWACPUA                                                 02789000
SDWARECA EQU   SDWA+244                                                 02790000
SDWARTYA EQU   SDWA+240                                                 02791000
@NM00097 EQU   SDWA+239                                                 02792000
@NM00096 EQU   SDWAIOFS                                                 02793000
SDWANIOP EQU   SDWAIOFS                                                 02794000
SDWANOIO EQU   SDWAIOFS                                                 02795000
SDWAIOHT EQU   SDWAIOFS                                                 02796000
SDWAIOQR EQU   SDWAIOFS                                                 02797000
@NM00095 EQU   SDWAERRD                                                 02798000
SDWAMCIV EQU   SDWAERRD                                                 02799000
SDWARPIV EQU   SDWAERRD                                                 02800000
SDWAMABD EQU   SDWAERRD                                                 02801000
SDWACTS  EQU   SDWAERRD                                                 02802000
SDWASTAE EQU   SDWAERRD                                                 02803000
SDWANRBE EQU   SDWAERRD                                                 02804000
SDWACLUP EQU   SDWAERRD                                                 02805000
@NM00094 EQU   SDWAERRC                                                 02806000
SDWAEAS  EQU   SDWAERRC                                                 02807000
SDWAPERC EQU   SDWAERRC                                                 02808000
SDWAIRB  EQU   SDWAERRC                                                 02809000
SDWASTAI EQU   SDWAERRC                                                 02810000
SDWASTAF EQU   SDWAERRC                                                 02811000
SDWASRBM EQU   SDWAERRB                                                 02812000
SDWALDIS EQU   SDWAERRB                                                 02813000
SDWAENRB EQU   SDWAERRB                                                 02814000
SDWATYP1 EQU   SDWAERRB                                                 02815000
@NM00093 EQU   SDWAERRB                                                 02816000
SDWAPGIO EQU   SDWAERRA                                                 02817000
SDWATEXC EQU   SDWAERRA                                                 02818000
SDWASVCE EQU   SDWAERRA                                                 02819000
SDWAABTM EQU   SDWAERRA                                                 02820000
SDWASVCD EQU   SDWAERRA                                                 02821000
SDWARKEY EQU   SDWAERRA                                                 02822000
SDWAMCHK EQU   SDWAERRA                                                 02823000
SDWATIME EQU   SDWAMCH+20                                               02824000
SDWARFSA EQU   SDWAMCH+16                                               02825000
@NM00092 EQU   SDWAMCH+14                                               02826000
SDWAVEQR EQU   SDWARSR2                                                 02827000
SDWAPGFX EQU   SDWARSR2                                                 02828000
SDWAFLSQ EQU   SDWARSR2                                                 02829000
SDWAFSQA EQU   SDWARSR2                                                 02830000
SDWANUCL EQU   SDWARSR2                                                 02831000
SDWASPER EQU   SDWARSR2                                                 02832000
SDWAINTC EQU   SDWARSR2                                                 02833000
SDWAOFLN EQU   SDWARSR2                                                 02834000
SDWACHNG EQU   SDWARSR1                                                 02835000
SDWAMSER EQU   SDWARSR1                                                 02836000
@NM00091 EQU   SDWARSR1                                                 02837000
SDWACPID EQU   SDWAMCH+10                                               02838000
SDWATERR EQU   SDWAMCHD                                                 02839000
SDWAFPRX EQU   SDWAMCHD                                                 02840000
SDWAINSF EQU   SDWAMCHD                                                 02841000
SDWAACR  EQU   SDWAMCHD                                                 02842000
SDWASCK  EQU   SDWAMCHD                                                 02843000
SDWAPSWU EQU   SDWAMCHD                                                 02844000
SDWAREGU EQU   SDWAMCHD                                                 02845000
SDWASKYF EQU   SDWAMCHD                                                 02846000
@NM00090 EQU   SDWAMCHS                                                 02847000
SDWARSRF EQU   SDWAMCHS                                                 02848000
SDWARSRC EQU   SDWAMCHS                                                 02849000
SDWAINVP EQU   SDWAMCHS                                                 02850000
SDWATSVL EQU   SDWAMCHS                                                 02851000
SDWARCDF EQU   SDWAMCHS                                                 02852000
SDWASRVL EQU   SDWAMCHS                                                 02853000
SDWASCKE EQU   SDWASTCK+4                                               02854000
SDWASCKB EQU   SDWASTCK                                                 02855000
SDWALNTH EQU   SDWAIDNT+1                                               02856000
SDWASPID EQU   SDWAIDNT                                                 02857000
SDWASR15 EQU   SDWASRSV+60                                              02858000
SDWASR14 EQU   SDWASRSV+56                                              02859000
SDWASR13 EQU   SDWASRSV+52                                              02860000
SDWASR12 EQU   SDWASRSV+48                                              02861000
SDWASR11 EQU   SDWASRSV+44                                              02862000
SDWASR10 EQU   SDWASRSV+40                                              02863000
SDWASR09 EQU   SDWASRSV+36                                              02864000
SDWASR08 EQU   SDWASRSV+32                                              02865000
SDWASR07 EQU   SDWASRSV+28                                              02866000
SDWASR06 EQU   SDWASRSV+24                                              02867000
SDWASR05 EQU   SDWASRSV+20                                              02868000
SDWASR04 EQU   SDWASRSV+16                                              02869000
SDWASR03 EQU   SDWASRSV+12                                              02870000
SDWASR02 EQU   SDWASRSV+8                                               02871000
SDWASR01 EQU   SDWASRSV+4                                               02872000
SDWASR00 EQU   SDWASRSV                                                 02873000
SDWATRN2 EQU   SDWAAEC2+4                                               02874000
SDWAIPC2 EQU   SDWAICD2                                                 02875000
SDWAIMC2 EQU   SDWAICD2                                                 02876000
SDWAIPR2 EQU   SDWAICD2                                                 02877000
@NM00089 EQU   SDWAINC2                                                 02878000
@NM00088 EQU   SDWAILC2                                                 02879000
SDWAIL2  EQU   SDWAILC2                                                 02880000
@NM00087 EQU   SDWAILC2                                                 02881000
@NM00086 EQU   SDWAAEC2                                                 02882000
SDWAADD2 EQU   SDWANXT2+1                                               02883000
@NM00085 EQU   SDWANXT2                                                 02884000
@NM00084 EQU   SDWAEC2+3                                                02885000
SDWASGN2 EQU   SDWAINT2                                                 02886000
SDWAEXP2 EQU   SDWAINT2                                                 02887000
SDWADEC2 EQU   SDWAINT2                                                 02888000
SDWAFPO2 EQU   SDWAINT2                                                 02889000
SDWACC2  EQU   SDWAINT2                                                 02890000
@NM00083 EQU   SDWAINT2                                                 02891000
SDWAPGM2 EQU   SDWAMWP2                                                 02892000
SDWAWAT2 EQU   SDWAMWP2                                                 02893000
SDWAMCK2 EQU   SDWAMWP2                                                 02894000
SDWAECT2 EQU   SDWAMWP2                                                 02895000
SDWAKEY2 EQU   SDWAMWP2                                                 02896000
SDWAEXT2 EQU   SDWAEMK2                                                 02897000
SDWAIO2  EQU   SDWAEMK2                                                 02898000
SDWATRM2 EQU   SDWAEMK2                                                 02899000
@NM00082 EQU   SDWAEMK2                                                 02900000
SDWAPER2 EQU   SDWAEMK2                                                 02901000
@NM00081 EQU   SDWAEMK2                                                 02902000
SDWATRAN EQU   SDWAAEC1+4                                               02903000
SDWAIPC1 EQU   SDWAICD1                                                 02904000
SDWAIMC1 EQU   SDWAICD1                                                 02905000
SDWAIPR1 EQU   SDWAICD1                                                 02906000
@NM00080 EQU   SDWAINC1                                                 02907000
@NM00079 EQU   SDWAILC1                                                 02908000
SDWAIL1  EQU   SDWAILC1                                                 02909000
@NM00078 EQU   SDWAILC1                                                 02910000
@NM00077 EQU   SDWAAEC1                                                 02911000
SDWAADD1 EQU   SDWANXT1+1                                               02912000
@NM00076 EQU   SDWANXT1                                                 02913000
@NM00075 EQU   SDWAEC1+3                                                02914000
SDWASGN1 EQU   SDWAINT1                                                 02915000
SDWAEXP1 EQU   SDWAINT1                                                 02916000
SDWADEC1 EQU   SDWAINT1                                                 02917000
SDWAFPO1 EQU   SDWAINT1                                                 02918000
SDWACC1  EQU   SDWAINT1                                                 02919000
@NM00074 EQU   SDWAINT1                                                 02920000
SDWAPGM1 EQU   SDWAMWP1                                                 02921000
SDWAWAT1 EQU   SDWAMWP1                                                 02922000
SDWAMCK1 EQU   SDWAMWP1                                                 02923000
SDWAECT1 EQU   SDWAMWP1                                                 02924000
SDWAKEY1 EQU   SDWAMWP1                                                 02925000
SDWAEXT1 EQU   SDWAEMK1                                                 02926000
SDWAIO1  EQU   SDWAEMK1                                                 02927000
SDWATRM1 EQU   SDWAEMK1                                                 02928000
@NM00073 EQU   SDWAEMK1                                                 02929000
SDWAPER1 EQU   SDWAEMK1                                                 02930000
@NM00072 EQU   SDWAEMK1                                                 02931000
SDWAIOBR EQU   SDWA+100                                                 02932000
SDWAEPA  EQU   SDWA+96                                                  02933000
@NM00071 EQU   SDWANAME+4                                               02934000
SDWARBAD EQU   SDWANAME                                                 02935000
SDWAGR15 EQU   SDWAGRSV+60                                              02936000
SDWAGR14 EQU   SDWAGRSV+56                                              02937000
SDWAGR13 EQU   SDWAGRSV+52                                              02938000
SDWAGR12 EQU   SDWAGRSV+48                                              02939000
SDWAGR11 EQU   SDWAGRSV+44                                              02940000
SDWAGR10 EQU   SDWAGRSV+40                                              02941000
SDWAGR09 EQU   SDWAGRSV+36                                              02942000
SDWAGR08 EQU   SDWAGRSV+32                                              02943000
SDWAGR07 EQU   SDWAGRSV+28                                              02944000
SDWAGR06 EQU   SDWAGRSV+24                                              02945000
SDWAGR04 EQU   SDWAGRSV+16                                              02946000
SDWAGR03 EQU   SDWAGRSV+12                                              02947000
SDWAGR02 EQU   SDWAGRSV+8                                               02948000
SDWAGR01 EQU   SDWAGRSV+4                                               02949000
SDWAGR00 EQU   SDWAGRSV                                                 02950000
SDWANXTP EQU   SDWACTL2+5                                               02951000
SDWASGP  EQU   SDWAPMKP                                                 02952000
SDWAEUP  EQU   SDWAPMKP                                                 02953000
SDWADOP  EQU   SDWAPMKP                                                 02954000
SDWAFPP  EQU   SDWAPMKP                                                 02955000
SDWACCP  EQU   SDWAPMKP                                                 02956000
SDWAILP  EQU   SDWAPMKP                                                 02957000
SDWAINTP EQU   SDWACTL2+2                                               02958000
SDWASPVP EQU   SDWAMWPP                                                 02959000
SDWAWATP EQU   SDWAMWPP                                                 02960000
SDWAMCKP EQU   SDWAMWPP                                                 02961000
@NM00070 EQU   SDWAMWPP                                                 02962000
SDWAKEYP EQU   SDWAMWPP                                                 02963000
SDWAEXTP EQU   SDWACMKP                                                 02964000
SDWAIOP  EQU   SDWACMKP                                                 02965000
SDWANXTA EQU   SDWACTL1+5                                               02966000
SDWASGA  EQU   SDWAPMKA                                                 02967000
SDWAEUA  EQU   SDWAPMKA                                                 02968000
SDWADOA  EQU   SDWAPMKA                                                 02969000
SDWAFPA  EQU   SDWAPMKA                                                 02970000
SDWACCA  EQU   SDWAPMKA                                                 02971000
SDWAILA  EQU   SDWAPMKA                                                 02972000
SDWAINTA EQU   SDWACTL1+2                                               02973000
SDWASPVA EQU   SDWAMWPA                                                 02974000
SDWAWATA EQU   SDWAMWPA                                                 02975000
SDWAMCKA EQU   SDWAMWPA                                                 02976000
@NM00069 EQU   SDWAMWPA                                                 02977000
SDWAKEYA EQU   SDWAMWPA                                                 02978000
SDWAEXTA EQU   SDWACMKA                                                 02979000
SDWAIOA  EQU   SDWACMKA                                                 02980000
@NM00068 EQU   SDWACMPF                                                 02981000
SDWASTCC EQU   SDWACMPF                                                 02982000
@NM00067 EQU   SDWACMPF                                                 02983000
SDWASTEP EQU   SDWACMPF                                                 02984000
SCBRSVRE EQU   SCBDATA+3                                                02985000
SCBID    EQU   SCBDATA+2                                                02986000
SCBPKEY  EQU   SCBDATA+1                                                02987000
@NM00066 EQU   SCBFLGS3                                                 02988000
SCBTERMO EQU   SCBFLGS3                                                 02989000
SCBBRNTR EQU   SCBFLGS3                                                 02990000
SCBPRNTR EQU   SCBFLGS3                                                 02991000
SCBCNCEL EQU   SCBFLGS3                                                 02992000
SCBRECRD EQU   SCBFLGS3                                                 02993000
SCBTERMI EQU   SCBFLGS3                                                 02994000
@NM00065 EQU   SCBFLGS3                                                 02995000
SCBOWNRA EQU   SCBOWNR+1                                                02996000
SCBSUPER EQU   SCBFLGS2                                                 02997000
SCBKEY0  EQU   SCBFLGS2                                                 02998000
@NM00064 EQU   SCBFLGS2                                                 02999000
@NM00063 EQU   SCBFLGS2                                                 03000000
SCBINUSE EQU   SCBFLGS2                                                 03001000
@NM00062 EQU   SCBFLGS2                                                 03002000
SCBXCTL2 EQU   SCBFLGS2                                                 03003000
@NM00061 EQU   SCBFLGS2                                                 03004000
SCBPARMA EQU   SCBPARM+1                                                03005000
SCBHALT  EQU   SCBIOPRC                                                 03006000
SCBNOIOP EQU   SCBIOPRC                                                 03007000
SCBASYNC EQU   SCBFLGS1                                                 03008000
@NM00060 EQU   SCBFLGS1                                                 03009000
SCBESTAE EQU   SCBFLGS1                                                 03010000
SCBDUMMY EQU   SCBFLGS1                                                 03011000
SCBSTAR  EQU   SCBFLGS1                                                 03012000
SCBSTAI  EQU   SCBFLGS1                                                 03013000
SCBEXIT  EQU   SCB+4                                                    03014000
SCBCHAIN EQU   SCB                                                      03015000
SVRBEND  EQU   RBSECT+192                                               03016000
RBFEPARM EQU   RBSECT+168                                               03017000
SIRBEND  EQU   RBSECT+168                                               03018000
RBRSV158 EQU   RBRSV150                                                 03019000
RBRSV157 EQU   RBRSV150                                                 03020000
RBRSV156 EQU   RBRSV150                                                 03021000
RBRSV155 EQU   RBRSV150                                                 03022000
RBRSV154 EQU   RBRSV150                                                 03023000
RBRSV153 EQU   RBRSV150                                                 03024000
RBRSV152 EQU   RBRSV150                                                 03025000
RBRSV151 EQU   RBRSV150                                                 03026000
RBRSV149 EQU   RBSECT+166                                               03027000
RBRSV148 EQU   RBSECT+164                                               03028000
RBRSV169 EQU   RBSDATA+3                                                03029000
RBSID    EQU   RBSDATA+2                                                03030000
RBSPKEY  EQU   RBSDATA+1                                                03031000
RBRSV168 EQU   RBSFLG3                                                  03032000
RBSTERMO EQU   RBSFLG3                                                  03033000
RBSBRNTR EQU   RBSFLG3                                                  03034000
RBSPRNTR EQU   RBSFLG3                                                  03035000
RBSCNCEL EQU   RBSFLG3                                                  03036000
RBSRECRD EQU   RBSFLG3                                                  03037000
RBSTERMI EQU   RBSFLG3                                                  03038000
RBRSV167 EQU   RBSFLG3                                                  03039000
RBSOWNRA EQU   RBSOWNR+1                                                03040000
RBSSUPER EQU   RBSFLGS2                                                 03041000
RBSKEY0  EQU   RBSFLGS2                                                 03042000
RBRSV166 EQU   RBSFLGS2                                                 03043000
RBRSV165 EQU   RBSFLGS2                                                 03044000
RBSINUSE EQU   RBSFLGS2                                                 03045000
RBRSV164 EQU   RBSFLGS2                                                 03046000
RBSXCTL2 EQU   RBSFLGS2                                                 03047000
RBRSV163 EQU   RBSFLGS2                                                 03048000
RBSPARMA EQU   RBSPARM+1                                                03049000
RBSHALT  EQU   RBSIOPRC                                                 03050000
RBSNOIOP EQU   RBSIOPRC                                                 03051000
RBSASYNC EQU   RBSFLGS1                                                 03052000
RBRSV162 EQU   RBSFLGS1                                                 03053000
RBSESTAE EQU   RBSFLGS1                                                 03054000
RBSDUMMY EQU   RBSFLGS1                                                 03055000
RBSSTAR  EQU   RBSFLGS1                                                 03056000
RBSSTAI  EQU   RBSFLGS1                                                 03057000
RBSEXIT  EQU   RBSCBB+4                                                 03058000
RBSCHAIN EQU   RBSCBB                                                   03059000
TIRBEND  EQU   @NM00058+8                                               03060000
PRBEND   EQU   @NM00058+8                                               03061000
RBRSV146 EQU   RBRSV138                                                 03062000
RBRSV145 EQU   RBRSV138                                                 03063000
RBRSV144 EQU   RBRSV138                                                 03064000
RBRSV143 EQU   RBRSV138                                                 03065000
RBRSV142 EQU   RBRSV138                                                 03066000
RBRSV141 EQU   RBRSV138                                                 03067000
RBRSV140 EQU   RBRSV138                                                 03068000
RBRSV139 EQU   RBRSV138                                                 03069000
RBRSV137 EQU   @NM00058+6                                               03070000
RBRSV136 EQU   @NM00058+4                                               03071000
RBRSV135 EQU   @NM00058                                                 03072000
@NM00057 EQU   RBSECT+32                                                03073000
@NM00056 EQU   @NM00054+1                                               03074000
RBSCF    EQU   @NM00055                                                 03075000
RBPGMQ1  EQU   RBPGMQ+1                                                 03076000
@NM00053 EQU   RBPGMQ                                                   03077000
@NM00052 EQU   RBSECT+16                                                03078000
@NM00051 EQU   @NM00047                                                 03079000
@NM00050 EQU   @NM00047                                                 03080000
RBIQETP  EQU   @NM00047                                                 03081000
RBUSIQE  EQU   RBETXR                                                   03082000
RBATTN   EQU   @NM00047                                                 03083000
@NM00049 EQU   @NM00047                                                 03084000
@NM00048 EQU   @NM00047                                                 03085000
RBPMSVRB EQU   @NM00045                                                 03086000
RBATNXIT EQU   @NM00045                                                 03087000
@NM00046 EQU   @NM00045                                                 03088000
RBWAITP  EQU   @NM00045                                                 03089000
RBFNSVRB EQU   RBTRSVRB                                                 03090000
RBFTP    EQU   @NM00045                                                 03091000
RBSIZE   EQU   RBSECT+8                                                 03092000
RBABOPSW EQU   RBSECT+4                                                 03093000
RBPPSAV1 EQU   RBPPSAV+1                                                03094000
@NM00043 EQU   RBPPSAV                                                  03095000
RBPRFXND EQU   RBPREFIX+64                                              03096000
RBINTCOD EQU   RBINTCDA+1                                               03097000
RBINLNTH EQU   RBINTCDA                                                 03098000
RBWCSA   EQU   RBPREFIX+60                                              03099000
RBRSV004 EQU   RBPREFIX+57                                              03100000
RBSSSYN  EQU   RBFLAGS1                                                 03101000
RBSCB    EQU   RBFLAGS1                                                 03102000
RBLONGWT EQU   RBFLAGS1                                                 03103000
RBASIR   EQU   RBFLAGS1                                                 03104000
RBRSV159 EQU   RBFLAGS1                                                 03105000
RBABEND  EQU   RBFLAGS1                                                 03106000
RBXWAIT  EQU   RBFLAGS1                                                 03107000
RBSLOCK  EQU   RBFLAGS1                                                 03108000
RBRTRAN  EQU   RBRTPSW2+4                                               03109000
RBRTINCD EQU   RBRTICIL+2                                               03110000
RBRTILC  EQU   RBRTICIL+1                                               03111000
RBRSV160 EQU   RBRTICIL                                                 03112000
RBRTPSW1 EQU   RBRTOPSW                                                 03113000
RBRSV062 EQU   RBRSV054                                                 03114000
RBRSV061 EQU   RBRSV054                                                 03115000
RBRSV060 EQU   RBRSV054                                                 03116000
RBRSV059 EQU   RBRSV054                                                 03117000
RBRSV058 EQU   RBRSV054                                                 03118000
RBRSV057 EQU   RBRSV054                                                 03119000
RBRSV056 EQU   RBRSV054                                                 03120000
RBRSV055 EQU   RBRSV054                                                 03121000
RBRSV053 EQU   RBPREFIX+38                                              03122000
RBRSV052 EQU   RBPREFIX+36                                              03123000
RBRSV051 EQU   RBPREFIX+32                                              03124000
RBPRFXST EQU   RBPREFIX+32                                              03125000
RBRSV050 EQU   RBPREFIX+28                                              03126000
RBRSV049 EQU   RBRSV041                                                 03127000
RBRSV048 EQU   RBRSV041                                                 03128000
RBRSV047 EQU   RBRSV041                                                 03129000
RBRSV046 EQU   RBRSV041                                                 03130000
RBRSV045 EQU   RBRSV041                                                 03131000
RBRSV044 EQU   RBRSV041                                                 03132000
RBRSV043 EQU   RBRSV041                                                 03133000
RBRSV042 EQU   RBRSV041                                                 03134000
RBRSV040 EQU   RBPREFIX+26                                              03135000
RBRSV039 EQU   RBPREFIX+24                                              03136000
RBRSV038 EQU   RBPREFIX+20                                              03137000
RBRSV037 EQU   RBPREFIX+16                                              03138000
RBRSV036 EQU   RBRSV028                                                 03139000
RBRSV035 EQU   RBRSV028                                                 03140000
RBRSV034 EQU   RBRSV028                                                 03141000
RBRSV033 EQU   RBRSV028                                                 03142000
RBRSV032 EQU   RBRSV028                                                 03143000
RBRSV031 EQU   RBRSV028                                                 03144000
RBRSV030 EQU   RBRSV028                                                 03145000
RBRSV029 EQU   RBRSV028                                                 03146000
RBRSV027 EQU   RBRSV019                                                 03147000
RBRSV026 EQU   RBRSV019                                                 03148000
RBRSV025 EQU   RBRSV019                                                 03149000
RBRSV024 EQU   RBRSV019                                                 03150000
RBRSV023 EQU   RBRSV019                                                 03151000
RBRSV022 EQU   RBRSV019                                                 03152000
RBRSV021 EQU   RBRSV019                                                 03153000
RBRSV020 EQU   RBRSV019                                                 03154000
RBRSV018 EQU   RBPREFIX+13                                              03155000
RBRSV017 EQU   RBPREFIX+12                                              03156000
RBSRV016 EQU   RBPREFIX+11                                              03157000
RBRSV015 EQU   RBPREFIX+10                                              03158000
RBRSV014 EQU   RBPREFIX+8                                               03159000
RBRSV013 EQU   RBPREFIX+4                                               03160000
RBRSV012 EQU   RBPREFIX                                                 03161000
XRBREG15 EQU   RBGRS15                                                  03162000
XRBREG14 EQU   RBGRS14                                                  03163000
XRBREG13 EQU   RBGRS13                                                  03164000
XRBREG12 EQU   RBGRS12                                                  03165000
XRBREG11 EQU   RBGRS11                                                  03166000
XRBREG10 EQU   RBGRS10                                                  03167000
XRBREG9  EQU   RBGRS9                                                   03168000
XRBREG8  EQU   RBGRS8                                                   03169000
XRBREG7  EQU   RBGRS7                                                   03170000
XRBREG6  EQU   RBGRS6                                                   03171000
XRBREG5  EQU   RBGRS5                                                   03172000
XRBREG4  EQU   RBGRS4                                                   03173000
XRBREG3  EQU   RBGRS3                                                   03174000
XRBREG2  EQU   RBGRS2                                                   03175000
XRBREG1  EQU   RBGRS1                                                   03176000
XRBREG0  EQU   RBGRS0                                                   03177000
XRBLNKA  EQU   RBLINKB                                                  03178000
XRBWT    EQU   RBWCF                                                    03179000
@NM00042 EQU   RBBASIC+24                                               03180000
RBOPSWPS EQU   RBOPSWB2                                                 03181000
@NM00041 EQU   RBOPSWB2                                                 03182000
@NM00040 EQU   XRBPSW                                                   03183000
@NM00039 EQU   RBBASIC+12                                               03184000
XRBWAIT  EQU   RBECBWT                                                  03185000
XRBFRRB  EQU   RBFDYN                                                   03186000
@NM00038 EQU   XSTAB2                                                   03187000
XRBACTV  EQU   RBFACTV                                                  03188000
XRBTCBP  EQU   RBTCBNXT                                                 03189000
@NM00037 EQU   XSTAB1                                                   03190000
XRBCKPT  EQU   RBFTCKPT                                                 03191000
@NM00036 EQU   XSTAB1                                                   03192000
@NM00035 EQU   RBBASIC+8                                                03193000
@NM00034 EQU   RBEXRTNM+1                                               03194000
RBTMIND3 EQU   RBTMFLD                                                  03195000
RBTMIND2 EQU   RBTMFLD                                                  03196000
RBTMCMP  EQU   RBTMFLD                                                  03197000
RBWLIM   EQU   RBTMFLD                                                  03198000
RBRSV005 EQU   RBTMFLD                                                  03199000
RBTMTOD  EQU   RBTMFLD                                                  03200000
RBTMQUE  EQU   RBTMFLD                                                  03201000
@NM00033 EQU   RBPRFX                                                   03202000
@NM00032 EQU   TCBXTNT2+32                                              03203000
TCBRV181 EQU   TCBRV173                                                 03204000
TCBRV180 EQU   TCBRV173                                                 03205000
TCBRV179 EQU   TCBRV173                                                 03206000
TCBRV178 EQU   TCBRV173                                                 03207000
TCBRV177 EQU   TCBRV173                                                 03208000
TCBRV176 EQU   TCBRV173                                                 03209000
TCBRV175 EQU   TCBRV173                                                 03210000
TCBRV174 EQU   TCBRV173                                                 03211000
TCBRV172 EQU   TCBRV164                                                 03212000
TCBRV171 EQU   TCBRV164                                                 03213000
TCBRV170 EQU   TCBRV164                                                 03214000
TCBRV169 EQU   TCBRV164                                                 03215000
TCBRV168 EQU   TCBRV164                                                 03216000
TCBRV167 EQU   TCBRV164                                                 03217000
TCBRV166 EQU   TCBRV164                                                 03218000
TCBRV165 EQU   TCBRV164                                                 03219000
TCBRV163 EQU   TCBRV155                                                 03220000
TCBRV162 EQU   TCBRV155                                                 03221000
TCBRV161 EQU   TCBRV155                                                 03222000
TCBRV160 EQU   TCBRV155                                                 03223000
TCBRV159 EQU   TCBRV155                                                 03224000
TCBRV158 EQU   TCBRV155                                                 03225000
TCBRV157 EQU   TCBRV155                                                 03226000
TCBRV156 EQU   TCBRV155                                                 03227000
TCBRV154 EQU   TCBRV146                                                 03228000
TCBRV153 EQU   TCBRV146                                                 03229000
TCBRV152 EQU   TCBRV146                                                 03230000
TCBRV151 EQU   TCBRV146                                                 03231000
TCBRV150 EQU   TCBRV146                                                 03232000
TCBRV149 EQU   TCBRV146                                                 03233000
TCBRV148 EQU   TCBRV146                                                 03234000
TCBRV147 EQU   TCBRV146                                                 03235000
TCBRV145 EQU   TCBXTNT2+26                                              03236000
TCBRV144 EQU   TCBXTNT2+24                                              03237000
TCBRV143 EQU   TCBXTNT2+20                                              03238000
TCBRV142 EQU   TCBXTNT2+16                                              03239000
TCBRSV49 EQU   TCBXTNT2+12                                              03240000
TCBEVENT EQU   TCBXTNT2+8                                               03241000
TCBRCMP  EQU   TCBXTNT2+5                                               03242000
TCBRSVAB EQU   TCBXTNT2+4                                               03243000
TCBGTFA  EQU   TCBGTF+1                                                 03244000
TCBRSV47 EQU   TCBTFLG                                                  03245000
TCBRSV46 EQU   TCBTFLG                                                  03246000
TCBRSV45 EQU   TCBTFLG                                                  03247000
TCBRSV44 EQU   TCBTFLG                                                  03248000
TCBRSV43 EQU   TCBTFLG                                                  03249000
TCBDSPIT EQU   TCBTFLG                                                  03250000
TCBERRTN EQU   TCBTFLG                                                  03251000
TCBASYNC EQU   TCBTFLG                                                  03252000
@NM00031 EQU   TCB+296                                                  03253000
TCBSVCA2 EQU   TCB+292                                                  03254000
TCBSWASA EQU   TCB+288                                                  03255000
TCBDBTB  EQU   TCB+284                                                  03256000
TCBRPT   EQU   TCB+280                                                  03257000
TCBRV141 EQU   TCBRV133                                                 03258000
TCBRV140 EQU   TCBRV133                                                 03259000
TCBRV139 EQU   TCBRV133                                                 03260000
TCBRV138 EQU   TCBRV133                                                 03261000
TCBRV137 EQU   TCBRV133                                                 03262000
TCBRV136 EQU   TCBRV133                                                 03263000
TCBRV135 EQU   TCBRV133                                                 03264000
TCBRV134 EQU   TCBRV133                                                 03265000
TCBRV132 EQU   TCBRV124                                                 03266000
TCBRV131 EQU   TCBRV124                                                 03267000
TCBRV130 EQU   TCBRV124                                                 03268000
TCBRV129 EQU   TCBRV124                                                 03269000
TCBRV128 EQU   TCBRV124                                                 03270000
TCBRV127 EQU   TCBRV124                                                 03271000
TCBRV126 EQU   TCBRV124                                                 03272000
TCBRV125 EQU   TCBRV124                                                 03273000
TCBRV123 EQU   TCBFBYT2                                                 03274000
TCBRV122 EQU   TCBFBYT2                                                 03275000
TCBECBNV EQU   TCBFBYT2                                                 03276000
TCBSSSYN EQU   TCBFBYT2                                                 03277000
TCBFPRAP EQU   TCBFBYT2                                                 03278000
TCBFDW   EQU   TCBFBYT2                                                 03279000
TCBFMW   EQU   TCBFBYT2                                                 03280000
TCBCNCB  EQU   TCBFBYT2                                                 03281000
TCBLLH   EQU   TCBFBYT1                                                 03282000
TCBRV113 EQU   TCBFBYT1                                                 03283000
TCBEOT   EQU   TCBFBYT1                                                 03284000
TCBRTM2  EQU   TCBFBYT1                                                 03285000
TCBPGNLY EQU   TCBFBYT1                                                 03286000
TCBNDIOS EQU   TCBFBYT1                                                 03287000
TCBRV327 EQU   TCBFBYT1                                                 03288000
TCBEOTFM EQU   TCBFBYT1                                                 03289000
TCBRV326 EQU   TCB+272                                                  03290000
TCBUKYSP EQU   TCB+268                                                  03291000
TCBMODE  EQU   TCBESTAE+3                                               03292000
TCBERTYP EQU   TCBESTAE+2                                               03293000
TCBRV314 EQU   TCBESTRM                                                 03294000
TCBRV313 EQU   TCBESTRM                                                 03295000
TCBRV312 EQU   TCBESTRM                                                 03296000
TCBRV311 EQU   TCBESTRM                                                 03297000
TCBRV310 EQU   TCBESTRM                                                 03298000
TCBRV309 EQU   TCBESTRM                                                 03299000
TCBRV308 EQU   TCBESTRM                                                 03300000
TCBETERM EQU   TCBESTRM                                                 03301000
TCBSCBKY EQU   TCBESTAE                                                 03302000
TCBRTM12 EQU   TCB+260                                                  03303000
TCBTCBID EQU   TCB+256                                                  03304000
TCBSTAWA EQU   TCB+252                                                  03305000
TCBSWA   EQU   TCB+248                                                  03306000
TCBFOEA  EQU   TCBFOE+1                                                 03307000
TCBRSV42 EQU   TCBFOE                                                   03308000
TCBCCPVI EQU   TCBXSCT+2                                                03309000
TCBRV325 EQU   TCBXSCT+1                                                03310000
TCBRV324 EQU   TCBXSCT1                                                 03311000
TCBRV323 EQU   TCBXSCT1                                                 03312000
TCBRV322 EQU   TCBXSCT1                                                 03313000
TCBRV321 EQU   TCBXSCT1                                                 03314000
TCBRV320 EQU   TCBXSCT1                                                 03315000
TCBRV319 EQU   TCBXSCT1                                                 03316000
TCBS3A   EQU   TCBXSCT1                                                 03317000
TCBACTIV EQU   TCBXSCT1                                                 03318000
TCBRSV41 EQU   TCB+239                                                  03319000
TCBTID   EQU   TCB+238                                                  03320000
TCBRSVAA EQU   TCB+237                                                  03321000
TCBABCUR EQU   TCB+236                                                  03322000
TCBTMSAV EQU   TCB+232                                                  03323000
TCBIOTIM EQU   TCB+228                                                  03324000
TCBRTWA  EQU   TCB+224                                                  03325000
TCBBACK  EQU   TCB+220                                                  03326000
TCBTIRB  EQU   TCB+216                                                  03327000
TCBAECB  EQU   TCB+212                                                  03328000
TCBEXT2A EQU   TCBEXT2+1                                                03329000
TCBRSV39 EQU   TCBEXT2                                                  03330000
TCBSTMCT EQU   TCB+207                                                  03331000
TCBSYSCT EQU   TCB+206                                                  03332000
TCBRSV37 EQU   TCB+205                                                  03333000
TCBEXSVC EQU   TCBDAR                                                   03334000
TCBDARMS EQU   TCBDAR                                                   03335000
TCBDARWT EQU   TCBDAR                                                   03336000
TCBDARO  EQU   TCBDAR                                                   03337000
TCBDARMC EQU   TCBDARC                                                  03338000
TCBDARD  EQU   TCBDAR                                                   03339000
TCBDARS  EQU   TCBDAR                                                   03340000
TCBDARP  EQU   TCBDAR                                                   03341000
TCBGTOFM EQU   TCBFLGS7                                                 03342000
TCBADMP  EQU   TCBFLGS7                                                 03343000
TCBRSTSK EQU   TCBFLGS7                                                 03344000
TCBSVCS  EQU   TCBFLGS7                                                 03345000
TCBSTACK EQU   TCBFLGS7                                                 03346000
TCBRSV34 EQU   TCBFLGS7                                                 03347000
TCBRSV33 EQU   TCBFLGS7                                                 03348000
TCBGPECB EQU   TCBFLGS7                                                 03349000
TCBNTJS  EQU   TCBFLGS6                                                 03350000
TCBAPG   EQU   TCBFLGS6                                                 03351000
TCBMIGR  EQU   TCBFLGS6                                                 03352000
TCBRV303 EQU   TCBFLGS6                                                 03353000
TCBSPVLK EQU   TCBFLGS6                                                 03354000
TCBCPU   EQU   TCBFLGS6                                                 03355000
TCBPIE17 EQU   TCBFLGS6                                                 03356000
TCBRV    EQU   TCBFLGS6                                                 03357000
TCBRSV79 EQU   TCBNDSP5                                                 03358000
TCBRSV78 EQU   TCBNDSP5                                                 03359000
TCBRSV77 EQU   TCBNDSP5                                                 03360000
TCBRSV76 EQU   TCBNDSP5                                                 03361000
TCBRSV75 EQU   TCBNDSP5                                                 03362000
TCBRSV74 EQU   TCBNDSP5                                                 03363000
TCBRSV95 EQU   TCBNDSP5                                                 03364000
TCBRSV94 EQU   TCBNDSP5                                                 03365000
TCBRSV93 EQU   TCBNDSP4                                                 03366000
TCBRSV92 EQU   TCBNDSP4                                                 03367000
TCBRSV91 EQU   TCBNDSP4                                                 03368000
TCBRSV90 EQU   TCBNDSP4                                                 03369000
TCBRSV89 EQU   TCBNDSP4                                                 03370000
TCBRSV88 EQU   TCBNDSP4                                                 03371000
TCBRSV87 EQU   TCBNDSP4                                                 03372000
TCBRSV86 EQU   TCBNDSP4                                                 03373000
TCBEXT1A EQU   TCBEXT1+1                                                03374000
TCBRSV32 EQU   TCBEXT1                                                  03375000
TCBEXCPD EQU   TCB+192                                                  03376000
TCBIOBRC EQU   TCB+188                                                  03377000
TCBDDWTC EQU   TCB+186                                                  03378000
TCBDDEXC EQU   TCB+184                                                  03379000
TCBJSCBB EQU   TCBJSCB+1                                                03380000
@NM00030 EQU   TCBRECDE                                                 03381000
TCBREC   EQU   TCBRECDE                                                 03382000
TCBMDIDS EQU   TCB+176                                                  03383000
TCBNDINT EQU   TCBNDSP3                                                 03384000
TCBRSV27 EQU   TCBNDSP3                                                 03385000
TCBRSV26 EQU   TCBNDSP3                                                 03386000
TCBRSV25 EQU   TCBNDSP3                                                 03387000
TCBRSV24 EQU   TCBNDSP3                                                 03388000
TCBSRBND EQU   TCBNDSP3                                                 03389000
TCBRV302 EQU   TCBNDSP3                                                 03390000
TCBLJSND EQU   TCBNDSP3                                                 03391000
TCBABE   EQU   TCBNDSP2                                                 03392000
TCBDSS   EQU   TCBNDSP2                                                 03393000
TCBOWAIT EQU   TCBNDSP2                                                 03394000
TCBIWAIT EQU   TCBNDSP2                                                 03395000
TCBNDTS  EQU   TCBNDSP2                                                 03396000
TCBNDSVC EQU   TCBNDSP2                                                 03397000
TCBSTPP  EQU   TCBNDSP2                                                 03398000
TCBABD   EQU   TCBNDSP2                                                 03399000
TCBRSV22 EQU   TCBNDSP1                                                 03400000
TCBPIEND EQU   TCBNDSP1                                                 03401000
TCBTPSP  EQU   TCBNDSP1                                                 03402000
TCBDDRND EQU   TCBNDSP1                                                 03403000
TCBRSPND EQU   TCBNDSP1                                                 03404000
TCBRSTND EQU   TCBNDSP1                                                 03405000
TCBDARPN EQU   TCBNDSP1                                                 03406000
TCBDARTN EQU   TCBNDSP1                                                 03407000
TCBNDSP0 EQU   TCBNDSP                                                  03408000
TCBUSER  EQU   TCB+168                                                  03409000
TCBTCTB  EQU   TCBTCT+1                                                 03410000
TCBRSV9C EQU   TCBTCTGF                                                 03411000
TCBRSV9B EQU   TCBTCTGF                                                 03412000
TCBRSV9A EQU   TCBTCTGF                                                 03413000
TCBRSV99 EQU   TCBTCTGF                                                 03414000
TCBRSV98 EQU   TCBTCTGF                                                 03415000
TCBRSV97 EQU   TCBTCTGF                                                 03416000
TCBRSV20 EQU   TCBTCTGF                                                 03417000
TCBSMFGF EQU   TCBTCTGF                                                 03418000
TCBSTABB EQU   TCBSTAB+1                                                03419000
TCBSTCUR EQU   TCBNSTAE                                                 03420000
TCBRV301 EQU   TCBNSTAE                                                 03421000
TCBSYNCH EQU   TCBNSTAE                                                 03422000
TCBHALT  EQU   TCBNSTAE                                                 03423000
TCBPPSUP EQU   TCBNSTAE                                                 03424000
TCB33E   EQU   TCBNSTAE                                                 03425000
TCBQUIES EQU   TCBNSTAE                                                 03426000
TCBSTABE EQU   TCBNSTAE                                                 03427000
TCBAQE   EQU   TCB+156                                                  03428000
TCBPQE   EQU   TCB+152                                                  03429000
TCBTSDP  EQU   TCB+151                                                  03430000
TCBTSLP  EQU   TCB+150                                                  03431000
TCBSTPCT EQU   TCB+149                                                  03432000
TCBCPUBN EQU   TCBTSFLG                                                 03433000
TCBDYDSP EQU   TCBTSFLG                                                 03434000
TCBRSV18 EQU   TCBTSFLG                                                 03435000
TCBRSV17 EQU   TCBTSFLG                                                 03436000
TCBTIOTG EQU   TCBTSFLG                                                 03437000
TCBATT   EQU   TCBTSFLG                                                 03438000
TCBSTPPR EQU   TCBTSFLG                                                 03439000
TCBRV300 EQU   TCBTSTSK                                                 03440000
TCBECB   EQU   TCB+144                                                  03441000
TCBIQE   EQU   TCB+140                                                  03442000
TCBLTC   EQU   TCB+136                                                  03443000
TCBOTC   EQU   TCB+132                                                  03444000
TCBNTC   EQU   TCB+128                                                  03445000
TCBJSTCA EQU   TCBJSTCB+1                                               03446000
TCBRSV16 EQU   TCBJSTCB                                                 03447000
TCBTCB   EQU   TCB+116                                                  03448000
TCBFSAB  EQU   TCBFSA+1                                                 03449000
TCBQEL   EQU   TCBFSA                                                   03450000
TCBGRS15 EQU   TCBGRS+60                                                03451000
TCBGRS14 EQU   TCBGRS+56                                                03452000
TCBGRS13 EQU   TCBGRS+52                                                03453000
TCBGRS12 EQU   TCBGRS+48                                                03454000
TCBGRS11 EQU   TCBGRS+44                                                03455000
TCBGRS10 EQU   TCBGRS+40                                                03456000
TCBGRS9  EQU   TCBGRS+36                                                03457000
TCBGRS8  EQU   TCBGRS+32                                                03458000
TCBGRS7  EQU   TCBGRS+28                                                03459000
TCBGRS6  EQU   TCBGRS+24                                                03460000
TCBGRS5  EQU   TCBGRS+20                                                03461000
TCBGRS4  EQU   TCBGRS+16                                                03462000
TCBGRS3  EQU   TCBGRS+12                                                03463000
TCBGRS2  EQU   TCBGRS+8                                                 03464000
TCBGRS1  EQU   TCBGRS+4                                                 03465000
TCBGRS0  EQU   TCBGRS                                                   03466000
TCBJPQB  EQU   TCBJPQ+1                                                 03467000
TCBRSV15 EQU   TCBPURGE                                                 03468000
TCBRSV14 EQU   TCBPURGE                                                 03469000
TCBRSV13 EQU   TCBPURGE                                                 03470000
TCBRSV12 EQU   TCBPURGE                                                 03471000
TCBRSV11 EQU   TCBPURGE                                                 03472000
TCBRSV10 EQU   TCBPURGE                                                 03473000
TCBRSV09 EQU   TCBPURGE                                                 03474000
TCBJPQF  EQU   TCBPURGE                                                 03475000
TCBJLB   EQU   TCB+40                                                   03476000
TCBLLS   EQU   TCB+36                                                   03477000
TCBDSP   EQU   TCB+35                                                   03478000
TCBLMP   EQU   TCB+34                                                   03479000
TCBPNDSP EQU   TCBFLGS5                                                 03480000
TCBFCD1  EQU   TCBFLGS5                                                 03481000
TCBSTP   EQU   TCBFLGS5                                                 03482000
TCBSYS   EQU   TCBFLGS5                                                 03483000
TCBANDSP EQU   TCBFLGS5                                                 03484000
TCBPAGE  EQU   TCBFLGS5                                                 03485000
TCBUXNDF EQU   TCBABWF                                                  03486000
TCBFC    EQU   TCBFLGS5                                                 03487000
TCBONDSP EQU   TCBFLGS4                                                 03488000
TCBMPCND EQU   TCBFLGS4                                                 03489000
TCBMPCVQ EQU   TCBFLGS4                                                 03490000
TCBUXNDV EQU   TCBFLGS4                                                 03491000
TCBHNDSP EQU   TCBFLGS4                                                 03492000
TCBRQENA EQU   TCBFLGS4                                                 03493000
TCBSER   EQU   TCBFLGS4                                                 03494000
TCBNDUMP EQU   TCBFLGS4                                                 03495000
TCBDWSTA EQU   TCBFLGS3                                                 03496000
TCBRSV08 EQU   TCBFLGS3                                                 03497000
TCBRSV07 EQU   TCBFLGS3                                                 03498000
TCBRSV06 EQU   TCBFLGS3                                                 03499000
TCBABGM  EQU   TCBFLGS3                                                 03500000
TCBABTRM EQU   TCBFLGS3                                                 03501000
TCBADINP EQU   TCBFLGS3                                                 03502000
TCBFSM   EQU   TCBFLGS3                                                 03503000
TCBFTS   EQU   TCBFLGS2                                                 03504000
TCBFETXR EQU   TCBFLGS2                                                 03505000
TCBFDSOP EQU   TCBFLGS2                                                 03506000
TCBFJMC  EQU   TCBFLGS2                                                 03507000
TCBFSMC  EQU   TCBFLGS2                                                 03508000
TCBFABOP EQU   TCBFLGS2                                                 03509000
TCBFSTI  EQU   TCBFLGS2                                                 03510000
TCBFOINP EQU   TCBFLGS2                                                 03511000
TCBFX    EQU   TCBFLGS1                                                 03512000
TCBFS    EQU   TCBFLGS1                                                 03513000
TCBFT    EQU   TCBFLGS1                                                 03514000
TCBPDUMP EQU   TCBFLGS1                                                 03515000
TCBNONPR EQU   TCBFLGS1                                                 03516000
TCBFERA  EQU   TCBFLGS1                                                 03517000
TCBFE    EQU   TCBFLGS1                                                 03518000
TCBFA    EQU   TCBFLGS1                                                 03519000
TCBZERO  EQU   TCBPKF                                                   03520000
TCBFLAG  EQU   TCBPKF                                                   03521000
TCBMSSB  EQU   TCBMSS+1                                                 03522000
TCBRSV03 EQU   TCBMSS                                                   03523000
TCBTRNB  EQU   TCBTRN+1                                                 03524000
TCBRSV02 EQU   TCBABF                                                   03525000
TCBOLTEP EQU   TCBABF                                                   03526000
TCBTCP   EQU   TCBABF                                                   03527000
TCBTCPP  EQU   TCBABF                                                   03528000
TCBRSV01 EQU   TCBABF                                                   03529000
TCBGRPH  EQU   TCBABF                                                   03530000
TCBNOCHK EQU   TCBABF                                                   03531000
TCBMOD91 EQU   TCBABF                                                   03532000
TCBCMPC  EQU   TCBCMP+1                                                 03533000
TCBRV318 EQU   TCBCMSG                                                  03534000
TCBRV317 EQU   TCBCIND                                                  03535000
TCBRV316 EQU   TCBCWTO                                                  03536000
TCBCASID EQU   TCBCDBL                                                  03537000
TCBNOCC  EQU   TCBSTCC                                                  03538000
TCBDMPO  EQU   TCBCPP                                                   03539000
TCBCSTEP EQU   TCBCMPF                                                  03540000
TCBCREQ  EQU   TCBCMPF                                                  03541000
TCBTIO   EQU   TCB+12                                                   03542000
TCBDEB   EQU   TCB+8                                                    03543000
TCBPIEA  EQU   TCBPIE+1                                                 03544000
TCBPM    EQU   TCBPMASK                                                 03545000
@NM00029 EQU   TCBPMASK                                                 03546000
TCBFRS6  EQU   TCBFRS+24                                                03547000
TCBFRS4  EQU   TCBFRS+16                                                03548000
TCBFRS2  EQU   TCBFRS+8                                                 03549000
TCBFRS0  EQU   TCBFRS                                                   03550000
ASCBEND  EQU   ASCB+208                                                 03551000
ASCBSRBT EQU   ASCB+200                                                 03552000
ASCBSWTL EQU   ASCB+196                                                 03553000
ASCBRS14 EQU   ASCB+195                                                 03554000
ASCBSMCT EQU   ASCB+194                                                 03555000
ASCBRS12 EQU   ASCB+192                                                 03556000
ASCBPCTT EQU   ASCB+188                                                 03557000
ASCBVGTT EQU   ASCB+184                                                 03558000
ASCBRV43 EQU   ASCBSRQ4                                                 03559000
ASCBRV42 EQU   ASCBSRQ4                                                 03560000
ASCBRV41 EQU   ASCBSRQ4                                                 03561000
ASCBRV40 EQU   ASCBSRQ4                                                 03562000
ASCBRV39 EQU   ASCBSRQ4                                                 03563000
ASCBRV38 EQU   ASCBSRQ4                                                 03564000
ASCBRV37 EQU   ASCBSRQ4                                                 03565000
ASCBRV36 EQU   ASCBSRQ4                                                 03566000
ASCBRV35 EQU   ASCBSRQ3                                                 03567000
ASCBRV34 EQU   ASCBSRQ3                                                 03568000
ASCBRV33 EQU   ASCBSRQ3                                                 03569000
ASCBRV32 EQU   ASCBSRQ3                                                 03570000
ASCBRV31 EQU   ASCBSRQ3                                                 03571000
ASCBRV30 EQU   ASCBSRQ3                                                 03572000
ASCBRV29 EQU   ASCBSRQ3                                                 03573000
ASCBRV28 EQU   ASCBSRQ3                                                 03574000
ASCBRV27 EQU   ASCBSRQ2                                                 03575000
ASCBRV26 EQU   ASCBSRQ2                                                 03576000
ASCBRV25 EQU   ASCBSRQ2                                                 03577000
ASCBRV24 EQU   ASCBSRQ2                                                 03578000
ASCBRV23 EQU   ASCBSRQ2                                                 03579000
ASCBRV22 EQU   ASCBSRQ2                                                 03580000
ASCBRV21 EQU   ASCBSRQ2                                                 03581000
ASCBRV20 EQU   ASCBSRQ2                                                 03582000
ASCBRV19 EQU   ASCBSRQ1                                                 03583000
ASCBRV18 EQU   ASCBSRQ1                                                 03584000
ASCBRV17 EQU   ASCBSRQ1                                                 03585000
ASCBRV16 EQU   ASCBSRQ1                                                 03586000
ASCBRV15 EQU   ASCBSRQ1                                                 03587000
ASCBRV14 EQU   ASCBSRQ1                                                 03588000
ASCBRV13 EQU   ASCBSRQ1                                                 03589000
ASCBSTA  EQU   ASCBSRQ1                                                 03590000
ASCBJBNS EQU   ASCB+176                                                 03591000
ASCBJBNI EQU   ASCB+172                                                 03592000
ASCBMCC  EQU   ASCB+168                                                 03593000
ASCBRTWA EQU   ASCB+164                                                 03594000
ASCBIQEA EQU   ASCB+160                                                 03595000
ASCBXMPQ EQU   ASCB+156                                                 03596000
ASCBRS01 EQU   ASCB+154                                                 03597000
ASCBFMCT EQU   ASCB+152                                                 03598000
ASCBOUXB EQU   ASCB+148                                                 03599000
ASCBOUCB EQU   ASCB+144                                                 03600000
ASCBMECB EQU   ASCB+140                                                 03601000
ASCBQECB EQU   ASCB+136                                                 03602000
ASCBLSQH EQU   ASCBLKGP+4                                               03603000
ASCBLOCK EQU   ASCBLKGP                                                 03604000
ASCBTCBS EQU   ASCB+124                                                 03605000
ASCBNVSC EQU   ASCB+122                                                 03606000
ASCBVSC  EQU   ASCB+120                                                 03607000
ASCBSRBS EQU   ASCB+118                                                 03608000
ASCBSSRB EQU   ASCB+116                                                 03609000
ASCBRV06 EQU   ASCBFLG2                                                 03610000
ASCBRV05 EQU   ASCBFLG2                                                 03611000
ASCBRV04 EQU   ASCBFLG2                                                 03612000
ASCBSNQS EQU   ASCBFLG2                                                 03613000
ASCBS2S  EQU   ASCBFLG2                                                 03614000
ASCBCEXT EQU   ASCBFLG2                                                 03615000
ASCBPXMT EQU   ASCBFLG2                                                 03616000
ASCBXMPT EQU   ASCBFLG2                                                 03617000
ASCBRF07 EQU   ASCBDSP1                                                 03618000
ASCBRF06 EQU   ASCBDSP1                                                 03619000
ASCBRF05 EQU   ASCBDSP1                                                 03620000
ASCBRF04 EQU   ASCBDSP1                                                 03621000
ASCBRF03 EQU   ASCBDSP1                                                 03622000
ASCBRF02 EQU   ASCBDSP1                                                 03623000
ASCBFAIL EQU   ASCBDSP1                                                 03624000
ASCBNOQ  EQU   ASCBDSP1                                                 03625000
ASCBSWCT EQU   ASCB+112                                                 03626000
ASCBASXB EQU   ASCB+108                                                 03627000
ASCBTMCH EQU   ASCB+104                                                 03628000
ASCBNSWP EQU   ASCBFLG1                                                 03629000
ASCBTYP1 EQU   ASCBFLG1                                                 03630000
ASCBSTND EQU   ASCBFLG1                                                 03631000
ASCBABNT EQU   ASCBFLG1                                                 03632000
ASCBTERM EQU   ASCBFLG1                                                 03633000
ASCBS3S  EQU   ASCBFLG1                                                 03634000
ASCBCMSH EQU   ASCBFLG1                                                 03635000
ASCBTOFF EQU   ASCBFLG1                                                 03636000
ASCBRF01 EQU   ASCBRCTF                                                 03637000
ASCBTMLW EQU   ASCBRCTF                                                 03638000
ASCBOUT  EQU   ASCBRCTF                                                 03639000
ASCBWAIT EQU   ASCBRCTF                                                 03640000
ASCBRV08 EQU   ASCBRCTF                                                 03641000
ASCBFQU  EQU   ASCBRCTF                                                 03642000
ASCBFRS  EQU   ASCBRCTF                                                 03643000
ASCBTMNO EQU   ASCBRCTF                                                 03644000
ASCBAFFN EQU   ASCBFW1                                                  03645000
ASCBDUMP EQU   ASCB+96                                                  03646000
ASCBRV44 EQU   ASCB+92                                                  03647000
ASCBUBET EQU   ASCB+88                                                  03648000
ASCBECB  EQU   ASCB+84                                                  03649000
ASCBJSTL EQU   ASCB+80                                                  03650000
ASCBEWST EQU   ASCB+72                                                  03651000
ASCBEJST EQU   ASCB+64                                                  03652000
ASCBTSB  EQU   ASCB+60                                                  03653000
ASCBCSCB EQU   ASCB+56                                                  03654000
ASCBRSMA EQU   ASCBRSM+1                                                03655000
ASCBRV54 EQU   ASCBRSMF                                                 03656000
ASCBRV53 EQU   ASCBRSMF                                                 03657000
ASCBRV52 EQU   ASCBRSMF                                                 03658000
ASCBRV51 EQU   ASCBRSMF                                                 03659000
ASCBVEQR EQU   ASCBRSMF                                                 03660000
ASCBN2LP EQU   ASCBRSMF                                                 03661000
ASCB1LPU EQU   ASCBRSMF                                                 03662000
ASCB2LPU EQU   ASCBRSMF                                                 03663000
ASCBLDA  EQU   ASCB+48                                                  03664000
ASCBSTOR EQU   ASCB+44                                                  03665000
ASCBDP   EQU   ASCB+43                                                  03666000
ASCBRV07 EQU   ASCB+42                                                  03667000
ASCBIOSM EQU   ASCB+40                                                  03668000
ASCBSEQN EQU   ASCB+38                                                  03669000
ASCBCPUS EQU   ASCB+32                                                  03670000
ASCBSPL  EQU   ASCB+28                                                  03671000
ASCBIOSP EQU   ASCB+24                                                  03672000
ASCBSYNC EQU   ASCBSUPC+4                                               03673000
ASCBSVRB EQU   ASCBSUPC                                                 03674000
ASCBCMSF EQU   ASCB+12                                                  03675000
ASCBBWDP EQU   ASCB+8                                                   03676000
ASCBFWDP EQU   ASCB+4                                                   03677000
ASCBASCB EQU   ASCB                                                     03678000
ASCBEGIN EQU   ASCB                                                     03679000
PVTEND   EQU   PVT+1848                                                 03680000
PVTTASID EQU   PVT+1846                                                 03681000
PVTXXXXX EQU   PVT+1844                                                 03682000
PVTMVCLC EQU   PVT+1840                                                 03683000
PVTSPARE EQU   PVT+1838                                                 03684000
PVTCHUIC EQU   PVT+1836                                                 03685000
PVTCOMFX EQU   PVT+1834                                                 03686000
PVTSQAFX EQU   PVT+1832                                                 03687000
PVTCNTFX EQU   PVT+1830                                                 03688000
PVTDEFFX EQU   PVT+1828                                                 03689000
PVTFIXOK EQU   PVT+1826                                                 03690000
PVTPEROK EQU   PVT+1824                                                 03691000
PVTMAXFX EQU   PVT+1822                                                 03692000
PVTPERFX EQU   PVT+1820                                                 03693000
PVTRSRB  EQU   PVT+1776                                                 03694000
PVTRESV5 EQU   PVT+1773                                                 03695000
PVTSRBS  EQU   PVT+1772                                                 03696000
PVTSSRB  EQU   PVT+1768                                                 03697000
PVTACA   EQU   PVTWSAX+1400                                             03698000
PVTSAVE  EQU   PVTWSAX+1328                                             03699000
PVTWSA18 EQU   PVTWSAX+1256                                             03700000
PVTWSA17 EQU   PVTWSAX+1184                                             03701000
PVTWSA16 EQU   PVTWSAX+1112                                             03702000
PVTWSA15 EQU   PVTWSAX+1040                                             03703000
PVTWSA14 EQU   PVTWSAX+968                                              03704000
PVTWSA13 EQU   PVTWSAX+896                                              03705000
PVTWSA12 EQU   PVTWSAX+824                                              03706000
PVTWSA11 EQU   PVTWSAX+752                                              03707000
PVTWSA10 EQU   PVTWSAX+672                                              03708000
PVTWSA9  EQU   PVTWSAX+592                                              03709000
PVTWSA8  EQU   PVTWSAX+504                                              03710000
PVTWSA7  EQU   PVTWSAX+432                                              03711000
PVTWSA6  EQU   PVTWSAX+360                                              03712000
PVTWSA5  EQU   PVTWSAX+288                                              03713000
PVTWSA4  EQU   PVTWSAX+216                                              03714000
PVTWSA3  EQU   PVTWSAX+144                                              03715000
PVTWSA2  EQU   PVTWSAX+72                                               03716000
PVTWSA1  EQU   PVTWSAX                                                  03717000
PVTCIOQL EQU   PVTQS+36                                                 03718000
PVTCIOQF EQU   PVTQS+32                                                 03719000
PVTGFADL EQU   PVTQS+28                                                 03720000
PVTGFADF EQU   PVTQS+24                                                 03721000
PVTFPCBL EQU   PVTQS+20                                                 03722000
PVTFPCBF EQU   PVTQS+16                                                 03723000
PVTSQAQL EQU   PVTQS+14                                                 03724000
PVTSQAQF EQU   PVTQS+12                                                 03725000
PVTCFQL  EQU   PVTQS+10                                                 03726000
PVTCFQF  EQU   PVTQS+8                                                  03727000
PVTRSRVL EQU   PVTQS+6                                                  03728000
PVTRSRVF EQU   PVTQS+4                                                  03729000
PVTAFQL  EQU   PVTQS+2                                                  03730000
PVTAFQF  EQU   PVTQS                                                    03731000
PVTSPFR  EQU   PVT+302                                                  03732000
PVTCFMCT EQU   PVT+300                                                  03733000
PVTSPREC EQU   PVT+296                                                  03734000
PVTCAREC EQU   PVT+292                                                  03735000
PVTCAOUT EQU   PVT+288                                                  03736000
PVTCAIN  EQU   PVT+284                                                  03737000
PVTNSWPS EQU   PVT+280                                                  03738000
PVTNPREC EQU   PVT+276                                                  03739000
PVTSPOUT EQU   PVT+272                                                  03740000
PVTSPIN  EQU   PVT+268                                                  03741000
PVTVAMR  EQU   PVT+264                                                  03742000
PVTVAMO  EQU   PVT+260                                                  03743000
PVTVAMI  EQU   PVT+256                                                  03744000
PVTNPOUT EQU   PVT+252                                                  03745000
PVTNPIN  EQU   PVT+248                                                  03746000
PVTPRSET EQU   PVT+244                                                  03747000
PVTFRSLT EQU   PVT+240                                                  03748000
PVTPAGIO EQU   PVT+236                                                  03749000
PVTSWPIO EQU   PVT+232                                                  03750000
PVTPSWPP EQU   PVT+228                                                  03751000
PVTPPREF EQU   PVT+224                                                  03752000
PVTPOPBR EQU   PVT+220                                                  03753000
PVTPRELF EQU   PVT+216                                                  03754000
PVTPRELV EQU   PVT+212                                                  03755000
PVTPFREE EQU   PVT+208                                                  03756000
PVTPRELS EQU   PVT+204                                                  03757000
PVTPOUT  EQU   PVT+200                                                  03758000
PVTPFXLD EQU   PVT+196                                                  03759000
PVTPITAS EQU   PVT+192                                                  03760000
PVTPSRBP EQU   PVT+188                                                  03761000
PVTPDSEG EQU   PVT+184                                                  03762000
PVTPCSGB EQU   PVT+180                                                  03763000
PVTPCSEG EQU   PVT+176                                                  03764000
PVTPINV  EQU   PVT+172                                                  03765000
PVTPSWPC EQU   PVT+168                                                  03766000
PVTPSOUT EQU   PVT+164                                                  03767000
PVTPSWIN EQU   PVT+160                                                  03768000
PVTPRCV  EQU   PVT+156                                                  03769000
PVTPRCFI EQU   PVT+152                                                  03770000
PVTPRCF  EQU   PVT+148                                                  03771000
PVTPVRC  EQU   PVT+144                                                  03772000
PVTPVRIN EQU   PVT+140                                                  03773000
PVTPVRLS EQU   PVT+136                                                  03774000
PVTPVEQR EQU   PVT+132                                                  03775000
PVTPPIOI EQU   PVT+128                                                  03776000
PVTPVRPO EQU   PVT+124                                                  03777000
PVTPRFR  EQU   PVT+120                                                  03778000
PVTPFP2  EQU   PVT+116                                                  03779000
PVTPFP   EQU   PVT+112                                                  03780000
PVTPFTE  EQU   PVT+108                                                  03781000
PVTPCB   EQU   PVT+104                                                  03782000
PVTREP2  EQU   PVT+100                                                  03783000
PVTPIOCP EQU   PVT+96                                                   03784000
PVTPIOP  EQU   PVT+92                                                   03785000
PVTPGFAD EQU   PVT+88                                                   03786000
PVTPGFA  EQU   PVT+84                                                   03787000
PVTPSQA  EQU   PVT+80                                                   03788000
PVTPSINT EQU   PVT+76                                                   03789000
PVTSRBID EQU   PVT+68                                                   03790000
PVTPCIWA EQU   PVT+64                                                   03791000
PVTHQSA  EQU   PVT+62                                                   03792000
PVTLQSA  EQU   PVT+60                                                   03793000
PVTOROOT EQU   PVT+56                                                   03794000
PVTPRCA  EQU   PVT+52                                                   03795000
PVTREUS  EQU   PVT+48                                                   03796000
PVTSQNPC EQU   PVT+47                                                   03797000
PVTSQVRC EQU   PVT+46                                                   03798000
PVTRSUS  EQU   PVT+44                                                   03799000
PVTVROOT EQU   PVT+40                                                   03800000
PVTPCBLO EQU   PVT+38                                                   03801000
PVTPCBCT EQU   PVT+36                                                   03802000
PVTDFRS  EQU   PVT+34                                                   03803000
PVTRSQA  EQU   PVT+32                                                   03804000
PVTPTLB  EQU   PVT+31                                                   03805000
PVTPCBNO EQU   PVT+30                                                   03806000
PVTSRBNO EQU   PVT+29                                                   03807000
PVTSQDC  EQU   PVT+28                                                   03808000
PVTLCSA  EQU   PVT+26                                                   03809000
PVTLPRIV EQU   PVT+24                                                   03810000
PVTLVR   EQU   PVT+22                                                   03811000
PVTFVR   EQU   PVT+20                                                   03812000
PVTLPFN  EQU   PVT+18                                                   03813000
PVTFPFN  EQU   PVT+16                                                   03814000
PVTPFTP  EQU   PVT+12                                                   03815000
PVTSSPIN EQU   PVT+11                                                   03816000
PVTPCBS  EQU   PVT+10                                                   03817000
PVTPOOL  EQU   PVT+8                                                    03818000
PVTAFCOK EQU   PVT+6                                                    03819000
PVTAFCLO EQU   PVT+4                                                    03820000
PVTAFC   EQU   PVT+2                                                    03821000
PVTFLAG2 EQU   PVT+1                                                    03822000
PVTDUMP  EQU   PVTFLAG1                                                 03823000
PVTSIT   EQU   PVTFLAG1                                                 03824000
PVTLSI   EQU   PVTFLAG1                                                 03825000
PVTAPREF EQU   PVTFLAG1                                                 03826000
PVTPCBLT EQU   PVTFLAG1                                                 03827000
PVTSRBIU EQU   PVTFLAG1                                                 03828000
PVTBGMS  EQU   PVTFLAG1                                                 03829000
PVTPMSG  EQU   PVTFLAG1                                                 03830000
@NM00028 EQU   PCCA+512                                                 03831000
PCCACAT  EQU   PCCA+384                                                 03832000
PCCARV36 EQU   PCCA+380                                                 03833000
PCCARV35 EQU   PCCA+378                                                 03834000
PCCARV01 EQU   PCCA+377                                                 03835000
PCCACPUM EQU   PCCA+376                                                 03836000
PCCARV63 EQU   PCCA+372                                                 03837000
PCCARV62 EQU   PCCA+368                                                 03838000
PCCARV61 EQU   PCCA+364                                                 03839000
PCCARV60 EQU   PCCA+360                                                 03840000
PCCARV59 EQU   PCCA+356                                                 03841000
PCCARV58 EQU   PCCA+352                                                 03842000
PCCARV57 EQU   PCCA+348                                                 03843000
PCCARV56 EQU   PCCA+344                                                 03844000
PCCARV55 EQU   PCCA+340                                                 03845000
PCCARV54 EQU   PCCA+336                                                 03846000
PCCALOGA EQU   PCCA+332                                                 03847000
PCCACHID EQU   PCCA+324                                                 03848000
PCCACHSV EQU   PCCA+312                                                 03849000
PCCARV79 EQU   PCCACHF4                                                 03850000
PCCARV78 EQU   PCCACHF4                                                 03851000
PCCARV77 EQU   PCCACHF4                                                 03852000
PCCARV76 EQU   PCCACHF4                                                 03853000
PCCARV75 EQU   PCCACHF4                                                 03854000
PCCARV74 EQU   PCCACHF4                                                 03855000
PCCARV73 EQU   PCCACHF4                                                 03856000
PCCARV72 EQU   PCCACHF4                                                 03857000
PCCARV71 EQU   PCCACHF3                                                 03858000
PCCARV70 EQU   PCCACHF3                                                 03859000
PCCARV69 EQU   PCCACHF3                                                 03860000
PCCARV68 EQU   PCCACHF3                                                 03861000
PCCARV67 EQU   PCCACHF3                                                 03862000
PCCARV66 EQU   PCCACHF3                                                 03863000
PCCARV65 EQU   PCCACHF3                                                 03864000
PCCARV64 EQU   PCCACHF3                                                 03865000
PCCACF28 EQU   PCCACHF2                                                 03866000
PCCACF27 EQU   PCCACHF2                                                 03867000
PCCACF26 EQU   PCCACHF2                                                 03868000
PCCACF25 EQU   PCCACHF2                                                 03869000
PCCACF24 EQU   PCCACHF2                                                 03870000
PCCACF23 EQU   PCCACHF2                                                 03871000
PCCACF22 EQU   PCCACHF2                                                 03872000
PCCACF21 EQU   PCCACHF2                                                 03873000
PCCACF18 EQU   PCCACHF1                                                 03874000
PCCACF17 EQU   PCCACHF1                                                 03875000
PCCACF16 EQU   PCCACHF1                                                 03876000
PCCACF15 EQU   PCCACHF1                                                 03877000
PCCACF14 EQU   PCCACHF1                                                 03878000
PCCACF13 EQU   PCCACHF1                                                 03879000
PCCACF12 EQU   PCCACHF1                                                 03880000
PCCACF11 EQU   PCCACHF1                                                 03881000
PCCARV05 EQU   PCCA+306                                                 03882000
PCCACHPB EQU   PCCA+305                                                 03883000
PCCALGP2 EQU   PCCA+304                                                 03884000
PCCALGP1 EQU   PCCA+303                                                 03885000
PCCALOGL EQU   PCCA+302                                                 03886000
PCCARV80 EQU   PCCA+300                                                 03887000
PCCACHW2 EQU   PCCA+296                                                 03888000
PCCACHW1 EQU   PCCA+292                                                 03889000
PCCAIOSI EQU   PCCA+291                                                 03890000
PCCACNRB EQU   PCCACHRB                                                 03891000
PCCACCVB EQU   PCCACHRB                                                 03892000
PCCACSNB EQU   PCCACHRB                                                 03893000
PCCARV52 EQU   PCCACHRB                                                 03894000
PCCACHIB EQU   PCCACHRB                                                 03895000
PCCACTIB EQU   PCCACHRB                                                 03896000
PCCACINB EQU   PCCACHRB                                                 03897000
PCCACSIB EQU   PCCACHRB                                                 03898000
PCCARV51 EQU   PCCACHS2                                                 03899000
PCCARV50 EQU   PCCACHS2                                                 03900000
PCCACCRA EQU   PCCACHS2                                                 03901000
PCCACURC EQU   PCCACHS2                                                 03902000
PCCACNLG EQU   PCCACHS2                                                 03903000
PCCACMOD EQU   PCCACHS2                                                 03904000
PCCACALT EQU   PCCACHS2                                                 03905000
PCCACIOR EQU   PCCACHS2                                                 03906000
PCCARV47 EQU   PCCACHS1                                                 03907000
PCCACUCB EQU   PCCACHS1                                                 03908000
PCCACIBC EQU   PCCACHS1                                                 03909000
PCCACAND EQU   PCCACHS1                                                 03910000
PCCACNLS EQU   PCCACHS1                                                 03911000
PCCACFRR EQU   PCCACHS1                                                 03912000
PCCACNRE EQU   PCCACHS1                                                 03913000
PCCACCMP EQU   PCCACHS1                                                 03914000
PCCACSEQ EQU   PCCACHTS                                                 03915000
PCCACDIN EQU   PCCACHTS                                                 03916000
PCCARV44 EQU   PCCACHTS                                                 03917000
PCCARV43 EQU   PCCACHTS                                                 03918000
PCCACTEC EQU   PCCACHTS                                                 03919000
PCCACDAV EQU   PCCACHVA                                                 03920000
PCCACCHV EQU   PCCACHVA                                                 03921000
PCCACCMD EQU   PCCACHVA                                                 03922000
PCCACUNS EQU   PCCACHVA                                                 03923000
PCCACSQV EQU   PCCACHVA                                                 03924000
PCCARV42 EQU   PCCACHVA                                                 03925000
PCCARV41 EQU   PCCACHVA                                                 03926000
PCCACITF EQU   PCCACHVA                                                 03927000
PCCARV40 EQU   PCCACHBL                                                 03928000
PCCARV39 EQU   PCCACHBL                                                 03929000
PCCARV38 EQU   PCCACHBL                                                 03930000
PCCACCUE EQU   PCCACHBL                                                 03931000
PCCACSTG EQU   PCCACHBL                                                 03932000
PCCACSCU EQU   PCCACHBL                                                 03933000
PCCACCHA EQU   PCCACHBL                                                 03934000
PCCACCPU EQU   PCCACHBL                                                 03935000
PCCACNOR EQU   PCCACHPF                                                 03936000
PCCACCNT EQU   PCCACHPF                                                 03937000
PCCACSNS EQU   PCCACHPF                                                 03938000
PCCARV37 EQU   PCCACHPF                                                 03939000
PCCACHIO EQU   PCCACHPF                                                 03940000
PCCACTIO EQU   PCCACHPF                                                 03941000
PCCACINT EQU   PCCACHPF                                                 03942000
PCCACSIO EQU   PCCACHPF                                                 03943000
PCCACHUB EQU   PCCAWERP                                                 03944000
PCCACHEL EQU   PCCA+168                                                 03945000
PCCALRBR EQU   PCCA+164                                                 03946000
PCCALRBV EQU   PCCA+160                                                 03947000
PCCAPWAR EQU   PCCA+156                                                 03948000
PCCAPWAV EQU   PCCA+152                                                 03949000
PCCAEMSA EQU   PCCAEMSB+12                                              03950000
PCCAEMSE EQU   PCCAEMSB+8                                               03951000
PCCAEMSP EQU   PCCAEMSB+4                                               03952000
PCCARMS  EQU   PCCARMSB                                                 03953000
PCCARV34 EQU   PCCARMSB                                                 03954000
PCCARV33 EQU   PCCARMSB                                                 03955000
PCCARV32 EQU   PCCARMSB                                                 03956000
PCCARV31 EQU   PCCARMSB                                                 03957000
PCCARV30 EQU   PCCARMSB                                                 03958000
PCCARV29 EQU   PCCARMSB                                                 03959000
PCCARV28 EQU   PCCARMSB                                                 03960000
PCCARV27 EQU   PCCAEMS3                                                 03961000
PCCARV26 EQU   PCCAEMS3                                                 03962000
PCCARV25 EQU   PCCAEMS3                                                 03963000
PCCARV24 EQU   PCCAEMS3                                                 03964000
PCCARV23 EQU   PCCAEMS3                                                 03965000
PCCARV22 EQU   PCCAEMS3                                                 03966000
PCCARV21 EQU   PCCAEMS3                                                 03967000
PCCARV20 EQU   PCCAEMS3                                                 03968000
PCCARV19 EQU   PCCAEMS2                                                 03969000
PCCARV18 EQU   PCCAEMS2                                                 03970000
PCCARV17 EQU   PCCAEMS2                                                 03971000
PCCARV16 EQU   PCCAEMS2                                                 03972000
PCCARV15 EQU   PCCAEMS2                                                 03973000
PCCARV14 EQU   PCCAEMS2                                                 03974000
PCCARV13 EQU   PCCAEMS2                                                 03975000
PCCARV12 EQU   PCCAEMS2                                                 03976000
PCCARV11 EQU   PCCARISP                                                 03977000
PCCARV10 EQU   PCCARISP                                                 03978000
PCCARV09 EQU   PCCARISP                                                 03979000
PCCARV08 EQU   PCCARISP                                                 03980000
PCCARV07 EQU   PCCARISP                                                 03981000
PCCARV06 EQU   PCCARISP                                                 03982000
PCCASERL EQU   PCCARISP                                                 03983000
PCCAPARL EQU   PCCARISP                                                 03984000
PCCARPB  EQU   PCCA+132                                                 03985000
PCCACTIN EQU   PCCAINTE                                                 03986000
PCCANFIN EQU   PCCAINTE                                                 03987000
PCCACTCC EQU   PCCACCE                                                  03988000
PCCANFCC EQU   PCCACCE                                                  03989000
PCCANUCC EQU   PCCACCE                                                  03990000
PCCACTTD EQU   PCCATODE                                                 03991000
PCCANFTD EQU   PCCATODE                                                 03992000
PCCANUTD EQU   PCCATODE                                                 03993000
PCCARV04 EQU   PCCATMFL                                                 03994000
PCCARV03 EQU   PCCATMFL                                                 03995000
PCCARV02 EQU   PCCATMFL                                                 03996000
PCCAMINT EQU   PCCATMFL                                                 03997000
PCCAMCC  EQU   PCCATMFL                                                 03998000
PCCAVKIL EQU   PCCATMFL                                                 03999000
PCCASYNC EQU   PCCATMFL                                                 04000000
PCCAINIT EQU   PCCATMFL                                                 04001000
PCCARV9E EQU   PCCA+124                                                 04002000
PCCARV9D EQU   PCCA+120                                                 04003000
PCCARV9C EQU   PCCA+116                                                 04004000
PCCARV9B EQU   PCCA+112                                                 04005000
PCCARV9A EQU   PCCA+108                                                 04006000
PCCARV99 EQU   PCCA+104                                                 04007000
PCCARV98 EQU   PCCA+100                                                 04008000
PCCARV97 EQU   PCCA+96                                                  04009000
PCCARV96 EQU   PCCA+92                                                  04010000
PCCARV95 EQU   PCCA+88                                                  04011000
PCCARV94 EQU   PCCA+84                                                  04012000
PCCARV93 EQU   PCCA+80                                                  04013000
PCCARV92 EQU   PCCA+76                                                  04014000
PCCARV91 EQU   PCCA+72                                                  04015000
PCCARV90 EQU   PCCA+68                                                  04016000
PCCARV89 EQU   PCCA+64                                                  04017000
PCCARV88 EQU   PCCA+60                                                  04018000
PCCARV87 EQU   PCCA+56                                                  04019000
PCCARV86 EQU   PCCA+52                                                  04020000
PCCARV85 EQU   PCCA+48                                                  04021000
PCCARV84 EQU   PCCA+44                                                  04022000
PCCARV83 EQU   PCCA+40                                                  04023000
PCCARV82 EQU   PCCA+36                                                  04024000
PCCARV81 EQU   PCCA+32                                                  04025000
PCCAPSAR EQU   PCCA+28                                                  04026000
PCCAPSAV EQU   PCCA+24                                                  04027000
PCCATQEP EQU   PCCA+20                                                  04028000
PCCACAFM EQU   PCCA+18                                                  04029000
PCCACPUA EQU   PCCA+16                                                  04030000
PCCACPID EQU   PCCA+4                                                   04031000
PCCAPCCA EQU   PCCA                                                     04032000
@NM00027 EQU   CSD+160                                                  04033000
CSDMASK  EQU   CSD+128                                                  04034000
CSDUCNT  EQU   CSD+124                                                  04035000
CSDTCNT  EQU   CSD+120                                                  04036000
CSDGDTOD EQU   CSD+116                                                  04037000
CSDDDRCT EQU   CSD+106                                                  04038000
CSDRV044 EQU   CSD+104                                                  04039000
CSDMAFF  EQU   CSD+24                                                   04040000
CSDRV038 EQU   CSDFLAGS                                                 04041000
CSDRV037 EQU   CSDFLAGS                                                 04042000
CSDRV036 EQU   CSDFLAGS                                                 04043000
CSDRV035 EQU   CSDFLAGS                                                 04044000
CSDRV034 EQU   CSDFLAGS                                                 04045000
CSDRV033 EQU   CSDFLAGS                                                 04046000
CSDRV032 EQU   CSDFLAGS                                                 04047000
CSDMP    EQU   CSDFLAGS                                                 04048000
CSDACR   EQU   CSD+22                                                   04049000
CSDMF1CP EQU   CSD+20                                                   04050000
CSDRV043 EQU   CSD+16                                                   04051000
CSDRV030 EQU   CSDSCFL4                                                 04052000
CSDRV029 EQU   CSDSCFL4                                                 04053000
CSDRV028 EQU   CSDSCFL4                                                 04054000
CSDRV027 EQU   CSDSCFL4                                                 04055000
CSDRV026 EQU   CSDSCFL4                                                 04056000
CSDRV025 EQU   CSDSCFL4                                                 04057000
CSDRV024 EQU   CSDSCFL4                                                 04058000
CSDRV023 EQU   CSDSCFL4                                                 04059000
CSDRV022 EQU   CSDSCFL3                                                 04060000
CSDRV021 EQU   CSDSCFL3                                                 04061000
CSDRV020 EQU   CSDSCFL3                                                 04062000
CSDRV019 EQU   CSDSCFL3                                                 04063000
CSDRV018 EQU   CSDSCFL3                                                 04064000
CSDRV017 EQU   CSDSCFL3                                                 04065000
CSDRV016 EQU   CSDSCFL3                                                 04066000
CSDRV015 EQU   CSDSCFL3                                                 04067000
CSDRV014 EQU   CSDSCFL2                                                 04068000
CSDRV013 EQU   CSDSCFL2                                                 04069000
CSDRV012 EQU   CSDSCFL2                                                 04070000
CSDRV011 EQU   CSDSCFL2                                                 04071000
CSDRV010 EQU   CSDSCFL2                                                 04072000
CSDRV009 EQU   CSDSCFL2                                                 04073000
CSDRV008 EQU   CSDSCFL2                                                 04074000
CSDRV007 EQU   CSDSCFL2                                                 04075000
CSDRV006 EQU   CSDSCFL1                                                 04076000
CSDRV005 EQU   CSDSCFL1                                                 04077000
CSDRV004 EQU   CSDSCFL1                                                 04078000
CSDRV003 EQU   CSDSCFL1                                                 04079000
CSDRV002 EQU   CSDSCFL1                                                 04080000
CSDRV001 EQU   CSDSCFL1                                                 04081000
CSDSYSND EQU   CSDSCFL1                                                 04082000
CSDRV042 EQU   CSDSCFL1                                                 04083000
CSDCPUOL EQU   CSD+10                                                   04084000
CSDSAFF  EQU   CSDCPUAL                                                 04085000
CSDCHAD  EQU   CSD+6                                                    04086000
CSDCPUJS EQU   CSD+4                                                    04087000
CSDCSD   EQU   CSD                                                      04088000
CVTLEVL  EQU   CVTRELNO+2                                               04089000
CVTNUMB  EQU   CVTRELNO                                                 04090000
CVTMDL   EQU   CVTFIX+250                                               04091000
@NM00026 EQU   CVTFIX+248                                               04092000
@NM00025 EQU   CVTFIX                                                   04093000
CVTRV482 EQU   CVTXTNT2+128                                             04094000
CVTRV481 EQU   CVTXTNT2+124                                             04095000
CVTRV480 EQU   CVTXTNT2+120                                             04096000
CVTRV479 EQU   CVTXTNT2+118                                             04097000
CVTRV478 EQU   CVTXTNT2+117                                             04098000
CVTRV477 EQU   CVTXTNT2+116                                             04099000
CVTRV476 EQU   CVTXTNT2+115                                             04100000
CVTRV475 EQU   CVTXTNT2+114                                             04101000
CVTRV474 EQU   CVTRV466                                                 04102000
CVTRV473 EQU   CVTRV466                                                 04103000
CVTRV472 EQU   CVTRV466                                                 04104000
CVTRV471 EQU   CVTRV466                                                 04105000
CVTRV470 EQU   CVTRV466                                                 04106000
CVTRV469 EQU   CVTRV466                                                 04107000
CVTRV468 EQU   CVTRV466                                                 04108000
CVTRV467 EQU   CVTRV466                                                 04109000
CVTRV465 EQU   CVTRV457                                                 04110000
CVTRV464 EQU   CVTRV457                                                 04111000
CVTRV463 EQU   CVTRV457                                                 04112000
CVTRV462 EQU   CVTRV457                                                 04113000
CVTRV461 EQU   CVTRV457                                                 04114000
CVTRV460 EQU   CVTRV457                                                 04115000
CVTRV459 EQU   CVTRV457                                                 04116000
CVTRV458 EQU   CVTRV457                                                 04117000
CVTRV456 EQU   CVTXTNT2+108                                             04118000
CVTRV455 EQU   CVTXTNT2+104                                             04119000
CVTRV454 EQU   CVTXTNT2+100                                             04120000
CVTRV453 EQU   CVTXTNT2+96                                              04121000
CVTRV452 EQU   CVTXTNT2+94                                              04122000
CVTRV451 EQU   CVTXTNT2+92                                              04123000
CVTRV450 EQU   CVTXTNT2+90                                              04124000
CVTRV449 EQU   CVTXTNT2+88                                              04125000
CVTRV448 EQU   CVTXTNT2+87                                              04126000
CVTRV447 EQU   CVTXTNT2+86                                              04127000
CVTRV446 EQU   CVTRV438                                                 04128000
CVTRV445 EQU   CVTRV438                                                 04129000
CVTRV444 EQU   CVTRV438                                                 04130000
CVTRV443 EQU   CVTRV438                                                 04131000
CVTRV442 EQU   CVTRV438                                                 04132000
CVTRV441 EQU   CVTRV438                                                 04133000
CVTRV440 EQU   CVTRV438                                                 04134000
CVTRV439 EQU   CVTRV438                                                 04135000
CVTRV437 EQU   CVTRV429                                                 04136000
CVTRV436 EQU   CVTRV429                                                 04137000
CVTRV435 EQU   CVTRV429                                                 04138000
CVTRV434 EQU   CVTRV429                                                 04139000
CVTRV433 EQU   CVTRV429                                                 04140000
CVTRV432 EQU   CVTRV429                                                 04141000
CVTRV431 EQU   CVTRV429                                                 04142000
CVTRV430 EQU   CVTRV429                                                 04143000
CVTRV428 EQU   CVTXTNT2+80                                              04144000
CVTRV427 EQU   CVTXTNT2+76                                              04145000
CVTRV426 EQU   CVTXTNT2+72                                              04146000
CVTRV425 EQU   CVTXTNT2+68                                              04147000
CVTATACT EQU   CVTATCVT                                                 04148000
CVTRV423 EQU   CVTXTNT2+62                                              04149000
CVTRV422 EQU   CVTXTNT2+60                                              04150000
CVTRV421 EQU   CVTXTNT2+58                                              04151000
CVTRV420 EQU   CVTXTNT2+56                                              04152000
CVTRV419 EQU   CVTXTNT2+55                                              04153000
CVTRV418 EQU   CVTXTNT2+54                                              04154000
CVTRV417 EQU   CVTRV409                                                 04155000
CVTRV416 EQU   CVTRV409                                                 04156000
CVTRV415 EQU   CVTRV409                                                 04157000
CVTRV414 EQU   CVTRV409                                                 04158000
CVTRV413 EQU   CVTRV409                                                 04159000
CVTRV412 EQU   CVTRV409                                                 04160000
CVTRV411 EQU   CVTRV409                                                 04161000
CVTRV410 EQU   CVTRV409                                                 04162000
CVTRV408 EQU   CVTRV400                                                 04163000
CVTRV407 EQU   CVTRV400                                                 04164000
CVTRV406 EQU   CVTRV400                                                 04165000
CVTRV405 EQU   CVTRV400                                                 04166000
CVTRV404 EQU   CVTRV400                                                 04167000
CVTRV403 EQU   CVTRV400                                                 04168000
CVTRV402 EQU   CVTRV400                                                 04169000
CVTRV401 EQU   CVTRV400                                                 04170000
CVTICB   EQU   CVTXTNT2+48                                              04171000
CVTSKTA  EQU   CVTXTNT2+44                                              04172000
CVTRSV99 EQU   CVTXTNT2+40                                              04173000
CVTRSV98 EQU   CVTXTNT2+36                                              04174000
CVTRSV97 EQU   CVTXTNT2+34                                              04175000
CVTRSV96 EQU   CVTXTNT2+32                                              04176000
CVTOLTEP EQU   CVTXTNT2+28                                              04177000
CVTQIDA  EQU   CVTQID+1                                                 04178000
CVTRSV95 EQU   CVTQID                                                   04179000
CVTRSV94 EQU   CVTXTNT2+20                                              04180000
CVTRSV93 EQU   CVTXTNT2+16                                              04181000
CVTRSV92 EQU   CVTXTNT2+12                                              04182000
CVTDEBVR EQU   CVTXTNT2+8                                               04183000
CVTRSV91 EQU   CVTXTNT2+6                                               04184000
CVTRSV9H EQU   CVTFLGBT                                                 04185000
CVTRSV9G EQU   CVTFLGBT                                                 04186000
CVTRSV9F EQU   CVTFLGBT                                                 04187000
CVTRSV9E EQU   CVTFLGBT                                                 04188000
CVTRSV9D EQU   CVTFLGBT                                                 04189000
CVTRSV9C EQU   CVTFLGBT                                                 04190000
CVTVME   EQU   CVTFLGBT                                                 04191000
CVTNPE   EQU   CVTFLGBT                                                 04192000
CVTNUCLS EQU   CVTXTNT2+4                                               04193000
CVTDSSVA EQU   CVTDSSV+1                                                04194000
CVTRSV89 EQU   CVTDSSV                                                  04195000
CVTRSV88 EQU   CVTXTNT1+8                                               04196000
CVTRSV87 EQU   CVTXTNT1+4                                               04197000
CVTFACHN EQU   CVTXTNT1                                                 04198000
CVTRV488 EQU   CVTMAP+412                                               04199000
CVTRV487 EQU   CVTMAP+408                                               04200000
CVTRV486 EQU   CVTMAP+404                                               04201000
CVTRV485 EQU   CVTMAP+400                                               04202000
CVTACTAP EQU   CVTMAP+396                                               04203000
CVTAUTH  EQU   CVTMAP+392                                               04204000
CVTATMCA EQU   CVTATMCT+1                                               04205000
CVTATMST EQU   CVTATMCT                                                 04206000
CVTRSV61 EQU   CVTMAP+384                                               04207000
CVTVOLT1 EQU   CVTVOLM1+1                                               04208000
CVTVOLI1 EQU   CVTVOLF1                                                 04209000
CVTSTOA  EQU   CVTMAP+376                                               04210000
CVTRSV58 EQU   CVTMAP+374                                               04211000
CVTRSV57 EQU   CVTMAP+372                                               04212000
CVTDDCE  EQU   CVTMAP+368                                               04213000
CVTPNWFR EQU   CVTMAP+364                                               04214000
CVTSMF   EQU   CVTMAP+360                                               04215000
CVTSULK  EQU   CVTMAP+358                                               04216000
CVTSLKO  EQU   CVTSYSK                                                  04217000
CVTSLKP  EQU   CVTSYSK                                                  04218000
CVTSLKQ  EQU   CVTSYSK                                                  04219000
CVTSLKR  EQU   CVTSYSK                                                  04220000
CVTRSV56 EQU   CVTSYSK                                                  04221000
CVTRSV55 EQU   CVTSYSK                                                  04222000
CVTRSV54 EQU   CVTSYSK                                                  04223000
CVTRSV53 EQU   CVTSYSK                                                  04224000
CVTRSV52 EQU   CVTA1F1                                                  04225000
CVTRSV51 EQU   CVTA1F1                                                  04226000
CVTRSV50 EQU   CVTA1F1                                                  04227000
CVTRSV49 EQU   CVTA1F1                                                  04228000
CVTRSV48 EQU   CVTA1F1                                                  04229000
CVTRSV47 EQU   CVTA1F1                                                  04230000
CVTSRSW  EQU   CVTA1F1                                                  04231000
CVTPFSW  EQU   CVTA1F1                                                  04232000
CVTPCVT  EQU   CVTMAP+352                                               04233000
CVTRSV46 EQU   CVTMAP+344                                               04234000
CVTRSV45 EQU   CVTMAP+340                                               04235000
CVTRSV44 EQU   CVTMAP+338                                               04236000
CVTRSV43 EQU   CVTMAP+336                                               04237000
CVTHJESA EQU   CVTHJES+1                                                04238000
CVTRSV42 EQU   CVTHJES                                                  04239000
CVTEXT2A EQU   CVTEXT2+1                                                04240000
CVTRSV41 EQU   CVTEXT2                                                  04241000
CVTAPFA  EQU   CVTAPF+1                                                 04242000
CVTRSV40 EQU   CVTAPF                                                   04243000
CVTRV518 EQU   CVTINTLA                                                 04244000
CVTRV517 EQU   CVTERPV                                                  04245000
CVTEORM  EQU   CVTMAP+312                                               04246000
CVTMCHPR EQU   CVTMAP+308                                               04247000
CVTJEPS  EQU   CVTMAP+300                                               04248000
CVTJESCT EQU   CVTMAP+296                                               04249000
CVTMODE  EQU   CVTMAP+292                                               04250000
CVTPTRV  EQU   CVTMAP+288                                               04251000
CVTREAL  EQU   CVTMAP+284                                               04252000
CVTRSV39 EQU   CVTMAP+280                                               04253000
CVTRSV38 EQU   CVTMAP+276                                               04254000
CVTDMSRA EQU   CVTDMSR+1                                                04255000
CVTRV634 EQU   CVTDMSRF                                                 04256000
CVTRV633 EQU   CVTDMSRF                                                 04257000
CVTRV632 EQU   CVTDMSRF                                                 04258000
CVTRV631 EQU   CVTDMSRF                                                 04259000
CVTRV630 EQU   CVTDMSRF                                                 04260000
CVTRV629 EQU   CVTDMSRF                                                 04261000
CVTUDUMP EQU   CVTDMSRF                                                 04262000
CVTSDUMP EQU   CVTDMSRF                                                 04263000
CVTQMSGA EQU   CVTQMSG+1                                                04264000
CVTRSV36 EQU   CVTQMSG                                                  04265000
CVTAMFF  EQU   CVTMAP+264                                               04266000
CVTPURGA EQU   CVTPURG+1                                                04267000
CVTRSV35 EQU   CVTPURG                                                  04268000
CVTCBSP  EQU   CVTMAP+256                                               04269000
CVTATERA EQU   CVTATER+1                                                04270000
CVTSYST  EQU   CVTATER                                                  04271000
CVTVOLT2 EQU   CVTTAT                                                   04272000
CVTVOLI2 EQU   CVTVOLF2                                                 04273000
CVTAQAVB EQU   CVTAQAVT+1                                               04274000
CVTRSV34 EQU   CVTTCMFG                                                 04275000
CVTRSV33 EQU   CVTTCMFG                                                 04276000
CVTRSV32 EQU   CVTTCMFG                                                 04277000
CVTRSV31 EQU   CVTTCMFG                                                 04278000
CVTRSV30 EQU   CVTTCMFG                                                 04279000
CVTRSV29 EQU   CVTTCMFG                                                 04280000
CVTLDEV  EQU   CVTTCMFG                                                 04281000
CVTTCRDY EQU   CVTTCMFG                                                 04282000
CVTGTFA  EQU   CVTGTF+1                                                 04283000
CVTRSV27 EQU   CVTGTFST                                                 04284000
CVTRNIO  EQU   CVTGTFST                                                 04285000
CVTUSR   EQU   CVTGTFST                                                 04286000
CVTRV318 EQU   CVTFORM                                                  04287000
CVTRV317 EQU   CVTTMODE                                                 04288000
CVTRV316 EQU   CVTSTATE                                                 04289000
CVTRV315 EQU   CVTGTFS                                                  04290000
CVTGTFAV EQU   CVTGTFS                                                  04291000
CVT0SCR1 EQU   CVTMAP+232                                               04292000
CVTRV515 EQU   CVTMAP+228                                               04293000
CVTRMS   EQU   CVTMAP+224                                               04294000
CVTPATCH EQU   CVTMAP+220                                               04295000
CVTTSCE  EQU   CVTMAP+216                                               04296000
CVTLNKSC EQU   CVTMAP+214                                               04297000
CVTQABST EQU   CVTMAP+212                                               04298000
CVTMDLDS EQU   CVTMAP+208                                               04299000
CVTUSER  EQU   CVTMAP+204                                               04300000
CVTABEND EQU   CVTMAP+200                                               04301000
CVTSMCA  EQU   CVTMAP+196                                               04302000
CVTRSV18 EQU   CVTMAP+192                                               04303000
CVTQLPAQ EQU   CVTMAP+188                                               04304000
CVTQCDSR EQU   CVTMAP+184                                               04305000
CVTRSV17 EQU   CVTOPTB                                                  04306000
CVTRSV16 EQU   CVTOPTB                                                  04307000
CVTFP    EQU   CVTOPTB                                                  04308000
CVTAPTHR EQU   CVTOPTB                                                  04309000
CVTNLOG  EQU   CVTOPTB                                                  04310000
CVTTOD   EQU   CVTOPTB                                                  04311000
CVTCTIMS EQU   CVTOPTB                                                  04312000
CVTPROT  EQU   CVTOPTB                                                  04313000
CVTXPFP  EQU   CVTOPTA                                                  04314000
CVTASCII EQU   CVTOPTA                                                  04315000
CVTRSV13 EQU   CVTOPTA                                                  04316000
CVTRSV12 EQU   CVTOPTA                                                  04317000
CVTNIP   EQU   CVTOPTA                                                  04318000
CVTDDR   EQU   CVTOPTA                                                  04319000
CVTAPR   EQU   CVTOPTA                                                  04320000
CVTCCH   EQU   CVTOPTA                                                  04321000
CVTSNCTR EQU   CVTMAP+180                                               04322000
CVTQMWR  EQU   CVTMAP+176                                               04323000
CVTQOCR  EQU   CVTMAP+172                                               04324000
CVT1EF00 EQU   CVTMAP+168                                               04325000
CVTMZ00  EQU   CVTMAP+164                                               04326000
CVTSV76Q EQU   CVTSV76C                                                 04327000
CVTRSV11 EQU   CVTMAP+156                                               04328000
CVT0PT01 EQU   CVTMAP+152                                               04329000
CVTMSER  EQU   CVTMAP+148                                               04330000
CVTRV516 EQU   CVTIERLC                                                 04331000
CVTILCH  EQU   CVTMAP+140                                               04332000
CVT0DS   EQU   CVTMAP+136                                               04333000
CVTFBOSV EQU   CVTMAP+132                                               04334000
CVTIXAVL EQU   CVTMAP+124                                               04335000
CVTSV76M EQU   CVTIOQET                                                 04336000
CVTDCBA  EQU   CVTMAP+117                                               04337000
CVTMVS2  EQU   CVTDCB                                                   04338000
CVT6DAT  EQU   CVTDCB                                                   04339000
CVT4MPS  EQU   CVTDCB                                                   04340000
CVTRSV09 EQU   CVTDCB                                                   04341000
CVT4MS1  EQU   CVTDCB                                                   04342000
CVT2SPS  EQU   CVTDCB                                                   04343000
CVT1SSS  EQU   CVTDCB                                                   04344000
CVTRSV08 EQU   CVTDCB                                                   04345000
CVTSTB   EQU   CVTMAP+112                                               04346000
CVTCUCB  EQU   CVTMAP+100                                               04347000
CVTSJQ   EQU   CVTMAP+96                                                04348000
CVTPBLDL EQU   CVTMAP+92                                                04349000
CVTSVDCB EQU   CVTMAP+84                                                04350000
CVTBRET  EQU   CVTMAP+82                                                04351000
CVTEXIT  EQU   CVTMAP+80                                                04352000
CVT0FN00 EQU   CVTMAP+76                                                04353000
CVTDARA  EQU   CVTDAR+1                                                 04354000
CVTRSV07 EQU   CVTFLGS1                                                 04355000
CVTRSV06 EQU   CVTFLGS1                                                 04356000
CVTRSV05 EQU   CVTFLGS1                                                 04357000
CVTRSV04 EQU   CVTFLGS1                                                 04358000
CVTRSV03 EQU   CVTFLGS1                                                 04359000
CVTRSV02 EQU   CVTFLGS1                                                 04360000
CVTRSV01 EQU   CVTFLGS1                                                 04361000
CVTDMPLK EQU   CVTFLGS1                                                 04362000
CVTXITP  EQU   CVTMAP+68                                                04363000
CVTZDTAB EQU   CVTMAP+64                                                04364000
CVTMSLT  EQU   CVTMAP+60                                                04365000
CVTDATE  EQU   CVTMAP+56                                                04366000
CVTBTERM EQU   CVTMAP+52                                                04367000
CVTSYSAD EQU   CVTMAP+48                                                04368000
CVTXTLER EQU   CVTMAP+44                                                04369000
CVTILK2  EQU   CVTMAP+40                                                04370000
CVTILK1  EQU   CVTMAP+36                                                04371000
CVTPRLTV EQU   CVTMAP+32                                                04372000
CVTPCNVT EQU   CVTMAP+28                                                04373000
CVT0VL00 EQU   CVTMAP+24                                                04374000
CVTXAPG  EQU   CVTMAP+20                                                04375000
CVTBUF   EQU   CVTMAP+16                                                04376000
CVTJOB   EQU   CVTMAP+12                                                04377000
CVTLINK  EQU   CVTMAP+8                                                 04378000
CVT0EF00 EQU   CVTMAP+4                                                 04379000
CVTTCBP  EQU   CVTMAP                                                   04380000
CVT      EQU   CVTMAP                                                   04381000
@NM00024 EQU   PSA+3668                                                 04382000
PSASTAK  EQU   PSA+3072                                                 04383000
@NM00023 EQU   PSA+1048                                                 04384000
PSAUSEND EQU   PSA+1048                                                 04385000
PSARV062 EQU   PSA+1044                                                 04386000
PSACDAL  EQU   PSA+1040                                                 04387000
PSAWTCOD EQU   PSA+1036                                                 04388000
PSAATCVT EQU   PSA+1032                                                 04389000
PSAPCPSW EQU   PSA+1024                                                 04390000
PSAPIR2  EQU   PSA+1020                                                 04391000
PSARV059 EQU   PSA+1018                                                 04392000
PSASVC13 EQU   PSA+1016                                                 04393000
PSALSFCC EQU   PSA+1012                                                 04394000
PSASFACC EQU   PSA+1008                                                 04395000
PSASTOP  EQU   PSA+992                                                  04396000
PSASTART EQU   PSA+976                                                  04397000
PSARSPSW EQU   PSA+968                                                  04398000
PSASRPSW EQU   PSA+960                                                  04399000
PSARV045 EQU   PSA+892                                                  04400000
PSARV044 EQU   PSA+888                                                  04401000
PSARV043 EQU   PSA+884                                                  04402000
PSARV042 EQU   PSA+880                                                  04403000
PSARV041 EQU   PSA+876                                                  04404000
PSARV040 EQU   PSA+872                                                  04405000
PSARV025 EQU   PSA+868                                                  04406000
PSADSSED EQU   PSA+868                                                  04407000
PSADSSPR EQU   PSA+864                                                  04408000
PSADSSFW EQU   PSA+860                                                  04409000
PSADSS14 EQU   PSA+856                                                  04410000
PSADSSPP EQU   PSA+848                                                  04411000
PSADSSRP EQU   PSA+840                                                  04412000
PSADSS05 EQU   PSADSSF4                                                 04413000
PSADSS10 EQU   PSADSSF4                                                 04414000
PSADSSVE EQU   PSADSSF4                                                 04415000
PSADSSDE EQU   PSADSSF4                                                 04416000
PSADSSC0 EQU   PSADSSF4                                                 04417000
PSADSSIE EQU   PSADSSF4                                                 04418000
PSADSS12 EQU   PSADSSF4                                                 04419000
PSADSSRC EQU   PSADSSF4                                                 04420000
PSARV057 EQU   PSADSSF3                                                 04421000
PSARV056 EQU   PSADSSF3                                                 04422000
PSARV055 EQU   PSADSSF3                                                 04423000
PSADSSMC EQU   PSADSSF3                                                 04424000
PSADSSRW EQU   PSADSSF3                                                 04425000
PSADSSNM EQU   PSADSSF3                                                 04426000
PSADSSES EQU   PSADSSF3                                                 04427000
PSADSSGP EQU   PSADSSF3                                                 04428000
PSADSSF2 EQU   PSADSSFL+1                                               04429000
PSADSSPI EQU   PSADSSF1                                                 04430000
PSADSSOI EQU   PSADSSF1                                                 04431000
PSADSSSP EQU   PSADSSF1                                                 04432000
PSADSSTP EQU   PSADSSF1                                                 04433000
PSADSSDW EQU   PSADSSF1                                                 04434000
PSADSSDD EQU   PSADSSF1                                                 04435000
PSADSSDM EQU   PSADSSF1                                                 04436000
PSADSSMV EQU   PSADSSF1                                                 04437000
PSADSSTS EQU   PSA+816                                                  04438000
PSADSSWK EQU   PSA+812                                                  04439000
PSADSSR3 EQU   PSA+808                                                  04440000
PSADSSR2 EQU   PSA+804                                                  04441000
PSADSSRS EQU   PSA+800                                                  04442000
PSASTOR  EQU   PSA+796                                                  04443000
PSACPUSA EQU   PSA+794                                                  04444000
PSAVSTAP EQU   PSA+792                                                  04445000
PSAWKVAP EQU   PSA+788                                                  04446000
PSAWKRAP EQU   PSA+784                                                  04447000
PSAMCHIC EQU   PSA+783                                                  04448000
PSARV061 EQU   PSA+782                                                  04449000
PSASYMSK EQU   PSA+781                                                  04450000
PSAMCHFL EQU   PSA+780                                                  04451000
PSACR0   EQU   PSA+776                                                  04452000
PSAPSWSV EQU   PSA+768                                                  04453000
PSACLHS  EQU   PSAHLHI                                                  04454000
PSALKR15 EQU   PSALKSA+60                                               04455000
PSALKR14 EQU   PSALKSA+56                                               04456000
PSALKR13 EQU   PSALKSA+52                                               04457000
PSALKR12 EQU   PSALKSA+48                                               04458000
PSALKR11 EQU   PSALKSA+44                                               04459000
PSALKR10 EQU   PSALKSA+40                                               04460000
PSALKR9  EQU   PSALKSA+36                                               04461000
PSALKR8  EQU   PSALKSA+32                                               04462000
PSALKR7  EQU   PSALKSA+28                                               04463000
PSALKR6  EQU   PSALKSA+24                                               04464000
PSALKR5  EQU   PSALKSA+20                                               04465000
PSALKR4  EQU   PSALKSA+16                                               04466000
PSALKR3  EQU   PSALKSA+12                                               04467000
PSALKR2  EQU   PSALKSA+8                                                04468000
PSALKR1  EQU   PSALKSA+4                                                04469000
PSALKR0  EQU   PSALKSA                                                  04470000
PSARV023 EQU   PSACLHT+52                                               04471000
PSALOCAL EQU   PSACLHT+48                                               04472000
PSACMSL  EQU   PSACLHT+44                                               04473000
PSAOPTL  EQU   PSACLHT+40                                               04474000
PSATPACL EQU   PSACLHT+36                                               04475000
PSATPDNL EQU   PSACLHT+32                                               04476000
PSATPNCL EQU   PSACLHT+28                                               04477000
PSAIOSLL EQU   PSACLHT+24                                               04478000
PSAIOSUL EQU   PSACLHT+20                                               04479000
PSAIOSCL EQU   PSACLHT+16                                               04480000
PSAIOSSL EQU   PSACLHT+12                                               04481000
PSASALCL EQU   PSACLHT+8                                                04482000
PSAASML  EQU   PSACLHT+4                                                04483000
PSADISPL EQU   PSACLHT                                                  04484000
PSASRSA  EQU   PSA+636                                                  04485000
PSARV050 EQU   PSA+634                                                  04486000
PSADSSGO EQU   PSA+633                                                  04487000
PSARECUR EQU   PSA+632                                                  04488000
PSAHLHIS EQU   PSA+628                                                  04489000
PSAIPCSA EQU   PSA+624                                                  04490000
@NM00022 EQU   PSA+621                                                  04491000
PSAIPCDM EQU   PSA+620                                                  04492000
PSAIPCD  EQU   PSA+616                                                  04493000
@NM00021 EQU   PSA+613                                                  04494000
PSAIPCRM EQU   PSA+612                                                  04495000
PSAIPCR  EQU   PSA+608                                                  04496000
PSAMCHEX EQU   PSA+600                                                  04497000
PSAMPSW  EQU   PSA+592                                                  04498000
PSAEXPS2 EQU   PSA+584                                                  04499000
PSAEXPS1 EQU   PSA+576                                                  04500000
PSAPIREG EQU   PSA+572                                                  04501000
PSARSREG EQU   PSA+568                                                  04502000
PSAGPREG EQU   PSA+556                                                  04503000
PSARV022 EQU   PSASUP4                                                  04504000
PSARV021 EQU   PSASUP4                                                  04505000
PSARV020 EQU   PSASUP4                                                  04506000
PSARV019 EQU   PSASUP4                                                  04507000
PSARV018 EQU   PSASUP4                                                  04508000
PSARV017 EQU   PSASUP4                                                  04509000
PSARV016 EQU   PSASUP4                                                  04510000
PSARV015 EQU   PSASUP4                                                  04511000
PSARV014 EQU   PSASUP3                                                  04512000
PSARV013 EQU   PSASUP3                                                  04513000
PSARV012 EQU   PSASUP3                                                  04514000
PSAESTA  EQU   PSASUP3                                                  04515000
PSASPR   EQU   PSASUP3                                                  04516000
PSAPSREG EQU   PSASUP3                                                  04517000
PSAPI2   EQU   PSASUP3                                                  04518000
PSAIOSUP EQU   PSASUP3                                                  04519000
PSALCR   EQU   PSASUP2                                                  04520000
PSARTM   EQU   PSASUP2                                                  04521000
PSAACR   EQU   PSASUP2                                                  04522000
PSAIPCE2 EQU   PSASUP2                                                  04523000
PSAIPCES EQU   PSASUP2                                                  04524000
PSAIPCEC EQU   PSASUP2                                                  04525000
PSAGTF   EQU   PSASUP2                                                  04526000
PSAIPCRI EQU   PSASUP2                                                  04527000
PSATYPE6 EQU   PSASUP1                                                  04528000
PSATCTL  EQU   PSASUP1                                                  04529000
PSADISP  EQU   PSASUP1                                                  04530000
PSALOCK  EQU   PSASUP1                                                  04531000
PSAPI    EQU   PSASUP1                                                  04532000
PSAEXT   EQU   PSASUP1                                                  04533000
PSASVC   EQU   PSASUP1                                                  04534000
PSAIO    EQU   PSASUP1                                                  04535000
PSAAOLD  EQU   PSA+548                                                  04536000
PSAANEW  EQU   PSA+544                                                  04537000
PSATNEW  EQU   PSA+536                                                  04538000
PSALCCAR EQU   PSA+532                                                  04539000
PSALCCAV EQU   PSA+528                                                  04540000
PSAPCCAR EQU   PSA+524                                                  04541000
PSACPULA EQU   PSA+518                                                  04542000
PSACPUPA EQU   PSA+516                                                  04543000
PSAPSA   EQU   PSA+512                                                  04544000
FLCHDEND EQU   PSA+512                                                  04545000
FLCCRSAV EQU   FLCMCLA+280                                              04546000
FLCGRSAV EQU   FLCMCLA+216                                              04547000
FLCFPSAV EQU   FLCMCLA+184                                              04548000
FLCFLA   EQU   FLCMCLA+88                                               04549000
FLCRGNCD EQU   FLCMCLA+84                                               04550000
FLCFSAA  EQU   FLCFSA+1                                                 04551000
@NM00020 EQU   FLCFSA                                                   04552000
@NM00019 EQU   FLCMCLA+72                                               04553000
FLCMCIC  EQU   FLCMCLA+64                                               04554000
@NM00018 EQU   FLCMCLA+20                                               04555000
FLCIOAA  EQU   FLCIOA+1                                                 04556000
@NM00017 EQU   FLCIOA                                                   04557000
@NM00016 EQU   FLCMCLA+15                                               04558000
@NM00015 EQU   FLCMCLA+14                                               04559000
@NM00014 EQU   FLCMCLA+12                                               04560000
FLCLCL   EQU   FLCMCLA+8                                                04561000
FLCIOELA EQU   FLCIOEL+1                                                04562000
@NM00013 EQU   FLCIOEL                                                  04563000
FLCCHNID EQU   FLCMCLA                                                  04564000
@NM00012 EQU   PSA+160                                                  04565000
FLCMTRCD EQU   PSA+157                                                  04566000
@NM00011 EQU   PSA+156                                                  04567000
FLCPERA  EQU   FLCPER+1                                                 04568000
@NM00010 EQU   FLCPER                                                   04569000
@NM00009 EQU   PSA+151                                                  04570000
FLCPERCD EQU   PSA+150                                                  04571000
FLCMCNUM EQU   PSA+149                                                  04572000
@NM00008 EQU   PSA+148                                                  04573000
FLCTEAA  EQU   FLCTEA+1                                                 04574000
@NM00007 EQU   FLCTEA                                                   04575000
PSAPIPC  EQU   PSAPICOD                                                 04576000
PSAPIMC  EQU   PSAPICOD                                                 04577000
PSAPIPER EQU   PSAPICOD                                                 04578000
PSARV049 EQU   FLCPICOD                                                 04579000
FLCPILCB EQU   FLCPIILC                                                 04580000
@NM00006 EQU   FLCPIILC                                                 04581000
@NM00005 EQU   PSAEPPSW                                                 04582000
FLCSVCN  EQU   PSAESPSW+2                                               04583000
FLCSILCB EQU   FLCSVILC                                                 04584000
@NM00004 EQU   FLCSVILC                                                 04585000
@NM00003 EQU   PSAESPSW                                                 04586000
FLCEICOD EQU   PSAEEPSW+2                                               04587000
PSASPAD  EQU   PSAEEPSW                                                 04588000
@NM00002 EQU   PSA+128                                                  04589000
FLCINPSW EQU   PSA+120                                                  04590000
FLCMNPSW EQU   PSA+112                                                  04591000
FLCPNPSW EQU   PSA+104                                                  04592000
FLCSNPSW EQU   PSA+96                                                   04593000
FLCENPSW EQU   PSA+88                                                   04594000
FLCTRACE EQU   PSA+84                                                   04595000
FLCTIMER EQU   PSA+80                                                   04596000
FLCCVT2  EQU   PSA+76                                                   04597000
FLCCAW   EQU   PSA+72                                                   04598000
FLCCSW   EQU   PSA+64                                                   04599000
FLCIOPSW EQU   PSA+56                                                   04600000
FLCMOPSW EQU   PSA+48                                                   04601000
FLCPOPSW EQU   PSA+40                                                   04602000
FLCSOPSW EQU   PSA+32                                                   04603000
FLCEOPSW EQU   PSA+24                                                   04604000
@NM00001 EQU   FLCICCW2+4                                               04605000
FLCCVT   EQU   FLCICCW2                                                 04606000
FLCICCW1 EQU   FLCROPSW                                                 04607000
FLCIPPSW EQU   FLCRNPSW                                                 04608000
*                                      END UNREFERENCED COMPONENTS      04609000
@RF00250 EQU   @EL00001                                                 04610000
@RF00252 EQU   @EL00001                                                 04611000
@RF00272 EQU   @RC00270                                                 04612000
@RC00341 EQU   @RC00333                                                 04613000
@RF00444 EQU   @RC00428                                                 04614000
@RF00488 EQU   @RC00481                                                 04615000
@RC00483 EQU   @RC00481                                                 04616000
@RF00580 EQU   @EL00001                                                 04617000
@RF00584 EQU   @EL00001                                                 04618000
@RC00582 EQU   @EL00001                                                 04619000
@RF00485 EQU   @RC00483                                                 04620000
@ENDDATA EQU   *                                                        04621000
         END   IGC0004F,(C'PLS1332',0701,77103)                         04622000
