*                                                                       00100002
*        %GOTO QDBL1;  /*                                               00150002
         MACRO                                                          00200002
         IHAQDB &DSECT=YES    */                                        00250002
*%QDBL1 : ;                                                             00300002
*                                                                       00350002
*/* **************************************************************** */ 00400002
*/*                                                                  */ 00450002
*/*                         QUEUE DESCRIPTOR BLOCK                   */ 00500002
*/*                                                                  */ 00600002
*/*  OS/VS2 RELEASE 2, 08/02/72, LEVEL=1                             */ 00650002
*/*                                                                  */ 00700002
*/*  METHOD OF ACCESS                                                */ 00750002
*/*      BAL   - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.     */ 00800002
*/*              USING ON QDB GIVES ADDRESSABILITY FOR ALL SYMBOLS.  */ 00850002
*/*      PL/S  - DCL QDBPTR PTR                                      */ 00900002
*/*                                                                  */ 00950002
*/* **************************************************************** */ 01000002
*%GOTO QDBL2;  /*                                                       01050002
         SPACE 1                                                        01100002
         AIF ('DSECT' EQ 'NO').QDB10                                    01150002
QDB      DSECT                                                          01200002
         AGO   .QDB20                                                   01250002
.QDB10    ANOP                                                          01300002
         DS    0D                                                       01350002
QDB      EQU   *                                                        01400002
.QDB20   ANOP                                                           01450002
QDBQDB   DS    CL4 -          ACRONYM IN EBCDIC -QDB-                   01550002
QDBATTR  DS    BL2 -          QUEUE ATTRIBUTES                          01600002
QDBRV001 DS    H -            RESERVED                                  01650002
QDBNELMS DS    F -            NUMBER OF ELEMENTS ON QUEUE               01700002
QDBFELMP DS    A -            POINTER TO FIRST ELEMENT                  01750002
QDBLELMP DS    A -            POINTER TO LAST ELEMENT                   01800002
QDBFPTDS DS    H -            FORWARD POINTER DISPLACEMENT              01850002
QDBBPTDS DS    H -            BACKWARD POINTER DISPLACEMENT             01900002
QDBPRSZ  DS    H -            PRIORITY FIELD SIZE                       01950002
QDBPRDS  DS    H -            PRIORITY FIELD DISPLACEMENT               02000002
QDBRV002 DS    A -            RESERVED                                  02050002
         MEND  , -  */                                                  02100002
*%QDBL2 : ;                                                             02150002
*                                                                       02200002
*DECLARE                                                                02250002
*  1 QDB     BASED(QDBPTR)  BDY(WORD),                                  02300002
*   2 QDBQDB      CHAR(4) BDY(WORD),     /* ACRONYM IN EBCIDIC -QDB- */ 02350002
*   2 QDBATTR     CHAR(2),               /* QUEUE ATTRIBUTES         */ 02400002
*   2 QDBRV001    FIXED(15),             /* RESERVED                 */ 02450002
*   2 QDBNELMS    FIXED(31),             /* NUMBER OF ELEMENTS ON       02500002
*                                           QUEUE                    */ 02550002
*   2 QDBFELMP    PTR(31),               /* POINTER TO FIRST ELEMENT */ 02600002
*   2 QDBLELMP    PTR(31),               /* POINTER TO LAST ELEMENT  */ 02650002
*   2 QDBFPTDS    FIXED(15),             /* FORWARD POINTER             02700002
*                                           DISPLACEMENT             */ 02750002
*   2 QDBBPTDS    FIXED(15),             /* BACKWARD POINTER            02800002
*                                           DISPLACEMENT             */ 02850002
*   2 QDBPRSZ     FIXED(15),             /* PRIORITY FIELD SIZE      */ 02900002
*   2 QDBPRDS     FIXED(15),             /* PRIORITY FIELD              02950002
*                                           DISPLACEMENT             */ 03000002
*   2 QDBRV002    PTR(31);               /* RESERVED                 */ 03050002
