         MACRO                                                          00020000
&NAME    GETBUF  &DCB,&REG,&DUMMY=                                      00030017
         LCLB  &NOGO                                                    00040017
         AIF   ('&DCB' EQ '').E1                                        00060000
.R1      AIF   ('&REG' EQ '').E2                                        00080017
.R2      AIF   ('&REG(1)' EQ '0' OR '&REG(1)' EQ '14').E3               00090017
         AIF   (&NOGO EQ 1).TERM                                        00100017
&NAME    IHBINNRA &DCB                                                  00120000
         L     14,20(0,1)               LOAD BUFCB ADDRESS              00140019
         L     &REG(1),0(0,14)                   LOAD BUFFER ADDRESS    00160000
         LTR   &REG(1),&REG(1)                   IS A BUFFER AVAILABLE  00180000
         BZ    *+10                    NO,RETURN ZERO                   00200017
         MVC   0(4,14),0(&REG(1))                YES,UPDATE BUFCB ADDR  00220000
         MEXIT                                                          00240000
.E1      IHBERMAC 06                                                    00260000
&NOGO    SETB  1                                                        00270017
         AGO   .R1                                                      00280017
.E2      IHBERMAC 18                                                    00300000
&NOGO    SETB  1                                                        00310017
         AGO   .R2                                                      00320017
.E3      IHBERMAC 37,,&REG                                              00340000
.TERM    MEND                                                           40340017
