* %GOTO SSETCMT;             /*                                @ZA34144 00050003
         MACRO                                                 @ZA34144 00100003
         IEFSSET                                                        00150003
.*/ %SSETCMT:;               /*                              @ZA34144*/ 00200003
*/********************************************************************/ 00250003
*/*  MACRO NAME =       IEFSSET                              @ZA34144*/ 00300003
*/*  DESCRIPTIVE NAME = END OF TASK (EOT) FUNCTION           @ZA34144*/ 00350003
*/*  STATUS =           SPLITOUT FROM IEFJSSOB               @ZA34144*/ 00400003
*/*  ACCESS METHOD =    INVOKED VIA IEFJSSOB MACRO           @ZA34144*/ 00450003
*/*  COPYRIGHT =        NONE                                 @ZA34144*/ 00500003
*/********************************************************************/ 00550003
* %GOTO SSETPLS;             /*                                @ZA34144 00600003
*                                                                       00700003
SSOBEOT  EQU   4                  EOT FUNCTION ID (SSOBFUNC)            00750003
*                                                                       00800003
*  EOT RETURN CODES (SSOBRETN) -                                        00850003
*                                                                       00900003
*    NO EOT RETURN CODES CURRENTLY DEFINED                              00950003
*                                                                       01000003
         ORG   SSOBGN                                                   01050003
SSETBGN  EQU   *                                                        01100003
SSETLEN  DC    AL2(SSETSIZE)      EOT EXTENSION LENGTH                  01150003
SSETRSV0 DS    H                  RESERVED                              01200003
SSETASID DS    H                  ASID OF MEMORY IN WHICH TASK          01250003
*                                 WAS ACTIVE                            01300003
SSETFLAG DS    B                  END OF TASK FLAGS -                   01350003
SSETYPE  EQU   X'80'              ON - ABNORMAL TASK TERMINATION        01400003
*                                 OFF- NORMAL TASK TERMINATION          01450003
SSETRSV1 DS    X                  RESERVED                              01500003
SSETCBA  DS    A                  ADDRESS OF TERMINATING TCB            01550003
SSETASCB DS    A                  ASCB ADDRESS OF TERMINATING           01600003
*                                 TASK'S MEMORY                         01650003
*                                                                       01700003
SSETSIZE EQU   *-SSETBGN          EOT EXTENSION LENGTH                  01750003
SSOBLEND EQU   SSOBHSIZ+SSETSIZE  TOTAL SSOB LENGTH                     01800003
         MEND                                                @ZA34144*/ 01850003
* %SSETPLS:;                           /*                    @ZA34144*/ 01880003
*   DCL SSOBEOT FIXED(15) CONSTANT(4); /* EOT FUNCTION ID(SSOBFUNC)  */ 01950003
*   /*                                                               */ 02000003
*   /*  EOT RETURN CODES (SSOBRETN) -                                */ 02050003
* /*                                                                 */ 02100003
* /*    NO EOT RETURN CODES CURRENTLY DEFINED                        */ 02150003
* /*                                                                 */ 02200003
*   /*   S S E T                                                     */ 02250003
*   DCL                                                                 02300003
*   1      SSET           SSOBET,                                       02350003
*     2      SSETLEN      FIXED(15),/* LENGTH OF SSET                */ 02400003
*     2      *            FIXED(15),/* RESERVED                      */ 02450003
*     2      SSETASID     FIXED(15),/* ASID OF MEMORY IN WHICH TASK     02500003
*                                      WAS ACTIVE                    */ 02550003
*     2      SSETFLAG     BIT(8),   /* END OF TASK FLAGS             */ 02600003
*       3    SSETYPE      BIT(1),   /* ON - ABNORMAL TASK TERMINATION   02650003
*                                      OFF- NORMAL TASK TERMINATION  */ 02700003
*       3    *            BIT(7),   /* RESERVED FLAGS                */ 02750003
*     2      *            PTR(8),   /* RESERVED                      */ 02800003
*     2      SSETCBA      PTR(31),  /* ADDRESS OF TERMINATING TCB    */ 02850003
*     2      SSETASCB     PTR(31);  /* ASCB ADDRESS OF TERMINATING      02900003
*                                      TASK'S MEMORY                 */ 02950003
