         MACRO                                                          01000000
         IEFVTIOT                                                       02000000
.*                                                                      03000000
.*   TIOT  MACRO                                                        04000000
.*   STRUCTURE  OF  TIOT  FOR  MASTER  SCHEDULER  AND  INTERPRETER      05000000
.*                                                                      06000000
*                  ****************************                         07000000
*                  *                          *                         08000000
*                  *                          *                         09000000
*                  *       VTIOT  MACRO       *                         10000000
*                  *                          *                         11000000
*                  *                          *                         12000000
*                  ****************************                         13000000
VTIOT    DS    0D                                                       14000000
         DC    CL8'MASTER'              JOB NAME                        15000000
         DC    CL16'SCHEDULR'                                           16000000
.*                                                                      17000000
.*   TIOT  ENTRY  OF  INPUT  READER                                     18000000
*                                                                       19000000
VRENTRY  DC    XL1'14'                  TIOT ENTRY LENGTH               20000000
         DC    XL1'00'                  STATUS A                        21000000
         DC    XL2'0000'                REL. LOC OF POOL                22000000
VRDNAME  DC    CL8'IEFRDER'             READER DDNAME                   23000000
VRJFCBT  DC    F'0'                     DISK ADDR OF JFCB AND STATUS C  24000000
VRUCBPT  DC    X'80000000'              STATUS B AND UCB POINTER        25000000
.*                                                                      26000000
.*   TIOT  ENTRY  OF  SYSTEM  INPUT  DATA                               27000000
*                                                                       28000000
VDENTRY  DC    XL1'14'                  TIOT ENTRY LENGTH               29000000
         DC    XL1'00'                  STATUS A                        30000000
         DC    XL2'0000'                REL. LOC OF POOL                31000000
VDDNAME  DC    CL8'IEFDATA'             SYSIN DATA DDNAME               32000000
VDJFCBT  DC    F'0'                     DISK ADDR OF JFCB AND STATUS C  33000000
VDUCBPT  DC    X'80000000'              STATUS B AND UCB POINTER        34000000
.*                                                                      35000000
.*   TIOT  ENTRY  OF  PROCEDURE  LIBRARY                                36000000
*                                                                       37000000
VPENTRY  DC    XL1'14'                  TIOT ENTRY LENGTH               38000000
         DC    XL1'00'                  STATUS A                        39000000
         DC    XL2'0000'                REL. LOC OF POOL                40000000
VPDNAME  DC    CL8'IEFPDSI'             PROCEDURE LIBRARY DDNAME        41000000
VPJFCBT  DC    F'0'                     DISK ADDR OF JFCB AND STATUS C  42000000
VPUCBPT  DC    X'80000000'              STATUS B AND UCB POINTER        43000000
.*                                                                      44000000
.*   TIOT  ENTRY  OF  SYSTEM  JOB  QUEUE                                45000000
*                                                                       46000000
VJENTRY  DC    XL1'14'                  TIOT ENTRY LENGTH               47000000
         DC    XL1'00'                  STATUS A                        48000000
         DC    XL2'0000'                REL. LOC OF POOL                49000000
VJDNAME  DC    CL8'SYSJOBQE'            SYSTEM JOB QUEUE DDNAME         50000000
VJJFCBT  DC    F'0'                     DISK ADDR OF JFCB AND STATUS C  51000000
VJUCBPT  DC    X'80000000'              STATUS B AND UCB POINTER        52000000
.*                                                                      53000000
VTIOTEND DC    F'0'                     FINAL END                       54000000
         MEND                                                           55000000
