*        %GOTO CDEBSL;                                               /* 00050002
         MACRO                                                          00100002
         IHACDE                                                         00150002
CDENTRY  DSECT                                                          00200002
         SPACE 1                                                        00250002
*********************************************************************** 00300002
*          MACCOMP OS/VS2,RELEASE 4       SC1CJ/PZD81                 * 00350004
*                                                                     * 00400002
*          MACSTAT OS/VS2,RELEASE 4       74240                       * 00450004
*                                                                     * 00460004
*          MACMEAN CDE MEANS CONTENTS DIRECTORY ENTRY                 * 00470004
*********************************************************************** 00500002
         SPACE 1                                                        00550002
CDCHAIN  DS    F -            ADDRESS OF NEXT CDE IN QUEUE (EITHER JPAQ 00600002
*                             OR LPAQ)                                  00650002
CDRRBP   DS    F -            IF THE MODULE IS REENTERABLE, THIS FIELD  00700002
*                             CONTAINS THE ADDRESS OF THE LAST RB THAT  00750002
*                             CONTROLLED THE MODULE.  IF THE MODULE IS  00800002
*                             SERIALLY REUSABLE, THIS FIELD CONTAINS    00850002
*                             THE ADDRESS OF THE RB AT THE TOP OF THE   00900002
*                             WAITING (RBPGMQ) QUEUE.  IF THE MODULE    00950002
*                             WAS REQUESTED ONLY THROUGH LOAD MACRO     01000002
*                             INSTRUCTIONS, CONTAINS ZERO.              01050002
CDNAME   DS    CL8 -          8-BYTE NAME                               01100002
CDENTPT  DS    F -            MODULE'S RELOCATED ENTRY POINT ADDRESS    01150002
CDXLMJP  DS    F -            EXTENT LIST ADDRESS OR MAJOR CDE ADDRESS  01200002
*                             IF THIS CDE IS A MINOR                    01250002
CDUSE    DS    H -            VALUE CONTAINS THE TOTAL MODULE USE       01300002
*                             COUNT                                     01350002
CDATTRB  DS    B -            FLAG BYTE                        @ZA47842 01360000
CDIDENTY EQU   X'40' -        ON=MAJOR BUILT BY IDENTIFY FOR AN         01370000
*                             UNAUTHORIZED CALLER THAT IDENTIFIED TO    01380000
*                             AN APF LIBRARY JPA MODULE        @ZA47842 01390000
CDRESV1  DS    B  -           RESERVED - D                     @ZA47842 01400000
CDATTR   DS    B -            ATTRIBUTE FLAGS                           01500002
CDNIP    EQU   X'80' -        MODULE LOADED BY NIP OR FIXED/MODIFIED    01550002
*                             LPA MODULE                                01600002
CDNIC    EQU   X'40' -        MODULE IS IN PROCESS OF BEING LOADED      01650002
CDREN    EQU   X'20' -        MODULE IS REENTERABLE                     01700002
CDSER    EQU   X'10' -        MODULE IS SERIALLY REUSABLE               01750002
CDNFN    EQU   X'08' -        MODULE IS NOT REUSABLE (NON-FUNCTIONAL)   01800002
CDMIN    EQU   X'04' -        THIS IS A MINOR CDE                       01850002
CDJPA    EQU   X'02' -        MODULE IS IN JOB PACK AREA                01900002
CDNLR    EQU   X'01' -        MODULE IS NOT LOADABLE-ONLY               01950002
CDATTR2  DS    B -            SECOND ATTRIBUTE FIELD                    02000002
CDSPZ    EQU   X'80' -        MODULE IS IN SUBPOOL ZERO                 02050002
CDREL    EQU   X'40' -        MODULE IS INACTIVE AND MAY BE RELEASED    02100002
CDXLE    EQU   X'20' -        EXTENT LIST HAS BEEN BUILT FOR MODULE.    02150002
*                             MAIN STORAGE OCCUPIED BY MODULE IS        02200002
*                             DESCRIBED THEREIN.                        02250002
CDRLC    EQU   X'10' -        THIS CDE CONTAINS A MINOR ENTRY POINT     02300002
*                             ADDRESS THAT HAS BEEN RELOCATED BY THE    02350002
*                             PROGRAM FETCH ROUTINE                     02400002
CDOLY    EQU   X'04' -        MODULE IS IN OVERLAY FORMAT        A27026 02450002
CDSYSLIB EQU   X'02' -        AUTHORIZED LIBRARY MODULE                 02500002
CDAUTH   EQU   X'01' -        PROGRAM AUTHORIZATION FLAG         ICB360 02550002
CDATTR3  DS    H  -            RESERVED                         D       02600004
         MEND  , */                                                     02650002
*%CDEBSL  :  ;                                                          02700002
*                                                                       02750002
* /* *************************************************************** */ 02800002
* /*         MACCOMP OS/VS2,RELEASE 4        SC1CJ/PZD81             */ 02850004
* /*                                                                 */ 02900002
* /*         MACSTAT OS/VS2,RELEASE 4        74240                   */ 02950004
* /*                                                                 */ 02960004
* /*         MACMEAN  CDE MEANS CONTENTS DIRECTORY ENTRY             */ 02970004
* /* *************************************************************** */ 03000002
*                                                                       03050002
*DECLARE                                                                03100002
*  1 CDENTRY  BASED(CDENTPTR),                                          03150002
*   2 CDCHAIN     PTR(31),               /* ADDRESS OF NEXT CDE IN      03200002
*                                           QUEUE (EITHER JPAQ OR       03250002
*                                           LPAQ)                    */ 03300002
*   2 CDRRBP      PTR(31),               /* IF THE MODULE IS            03350002
*                                           REENTERABLE, THIS FIELD     03400002
*                                           CONTAINS THE ADDRESS OF     03450002
*                                           THE LAST RB THAT            03500002
*                                           CONTROLLED THE MODULE.      03550002
*                                           IF THE MODULE IS SERIALLY   03600002
*                                           REUSABLE, THIS FIELD        03650002
*                                           CONTAINS THE ADDRESS OF     03700002
*                                           THE RB AT THE TOP OF THE    03750002
*                                           WAITING (RBPGMQ) QUEUE.     03800002
*                                           IF THE MODULE WAS           03850002
*                                           REQUESTED ONLY THROUGH      03900002
*                                           LOAD MACRO INSTRUCTIONS,    03950002
*                                           CONTAINS ZERO.           */ 04000002
*   2 CDNAME      CHAR(8),               /* 8 BYTE NAME              */ 04050002
*   2 CDENTPT     PTR(31),               /* MODULE'S RELOCATED ENTRY    04100002
*                                           POINT ADDRESS            */ 04150002
*   2 CDXLMJP     PTR(31),               /* EXTENT LIST ADDRESS OR      04200002
*                                           MAJOR CDE ADDRESS IF THIS   04250002
*                                           CDE IS A MINOR.          */ 04300002
*   2 CDUSE       PTR(15),               /* VALUE CONTAINS THE TOTAL    04350002
*                                           MODULE USE COUNT         */ 04400002
*   2 CDATTRB     CHAR(1),               /* FLAG BYTE        @ZA47842*/ 04405500
*     3 *        BIT(1),                 /* RESERVED         @ZA47842*/ 04411000
*     3 CDIDENTY BIT(1),                 /* ON=MAJOR BUILT BY IDENTIFY  04416500
*                                           FOR AN UNAUTHORIZED CALLER  04422000
*                                           THAT IDENTIFIED TO AN APF   04427500
*                                           LIBRARY JPA MODULE          04433000
*                                                            @ZA47842*/ 04438500
*     3 *        BIT(6),                 /* RESERVED         @ZA47842*/ 04444000
*   2 *           FIXED(8),              /* RESERVED -  D    @ZA47842*/ 04450000
*   2 CDATTR      CHAR(1),               /* ATTRIBUTE FLAGS          */ 04600002
*     3 CDNIP    BIT(1),                 /* MODULE LOAD BY NIP OR       04650002
*                                           FIXED/MODIFIED LPA          04700002
*                                           MODULE                   */ 04750002
*     3 CDNIC    BIT(1),                 /* MODULE IS IN PROCESS OF     04800002
*                                           BEING LOADED             */ 04850002
*     3 CDREN    BIT(1),                 /* MODULE IS REENTRABLE     */ 04900002
*     3 CDSER    BIT(1),                 /* MODULE IS SERIALLY          04950002
*                                           REUSABLE                 */ 05000002
*     3 CDNFN    BIT(1),                 /* MODULE IS NOT REUSABLE      05050002
*                                           (NON-FUNCTIONAL)         */ 05100002
*     3 CDMIN    BIT(1),                 /* THIS IS A MINOR CDE      */ 05150002
*     3 CDJPA    BIT(1),                 /* MODULE IS IN JOB PACK       05200002
*                                           AREA                     */ 05250002
*     3 CDNLR    BIT(1),                 /* MODULE IS NOT               05300002
*                                           LOADABLE-ONLY            */ 05350002
*   2 CDATTR2     CHAR(1),               /* SECOND ATTRIBUTE FIELD   */ 05400002
*     3 CDSPZ    BIT(1),                 /* MODULE IS IN SUBPOOL ZERO*/ 05450002
*     3 CDREL    BIT(1),                 /* MODULE IS INACTIVE AND      05500002
*                                           MAY BE RELEASED          */ 05550002
*     3 CDXLE    BIT(1),                 /* EXTENT LIST HAS BEEN        05600002
*                                           BUILT FOR MODULE.           05650002
*                                           MAIN STORAGE  OCCUPIED      05700002
*                                           BY MODULE IS DESCRIBED      05750002
*                                           THEREIN                  */ 05800002
*     3 CDRLC    BIT(1),                 /* THIS CDE CONTAINS A         05850002
*                                           MINOR ENTRY POINT ADDRESS   05900002
*                                           THAT HAS BEEN RELOCATED     05950002
*                                           BY THE PROGRAM FETCH        06000002
*                                           ROUTINE                  */ 06050002
*     3 *        BIT(1),                 /* RESERVED                 */ 06100004
*     3 CDOLY    BIT(1),                 /* MODULE IS IN OVERLAY        06150002
*                                           FORMAT             A27026*/ 06200002
*     3 CDSYSLIB BIT(1),                 /* AUTHORIZED LIBRARY MODULE*/ 06250002
*     3 CDAUTH   BIT(1),                 /* PROGRAM AUTHORIZATION       06300002
*                                           FLAG               ICB360*/ 06350002
*   2 CDATTR3    CHAR(2);                /* RESERVED                 */ 06400004
