*        %GOTO SCABSL;                                               /* 00050002
         MACRO                                                          00100002
&NAME    IHASCA                                                         00150002
SCA      DSECT                                                          00200002
*********************************************************************** 00250002
*              SPIE CONTROL AREA                                      * 00300002
*********************************************************************** 00400002
SCAPIE   DS    A                   ADDRESS OF PIE                       00450002
SCAPMASK DS    CL1                 PROGRAM MASK AT TIME OF SPIE         00470002
*                                  INITIATION. RESTORED AT SPIE         00480002
*                                  NULLIFICATION.                       00490002
SCARESV  DS    CL3                 RESERVED FOR FUTURE USE              00500002
SCAPARMS DS    CL16                PROG CHECK FLIH'S SRB PARMS          00510002
SCARPPTR DS    A                   RECOVERY PIE PICA ADDRESS  @ZA06785  00520003
SCAFRPPQ DS    A                   FREE RPIEPICA QUEUE HEADER @ZA06785  00530003
SCASRB   DS    0F                  SRB USED BY PROG CHECK FLIH          00550002
SCALEN   EQU   *-SCA               LENGTH OF SCA EXCLUDING THE SRB      00600002
         MEND  ,                                                     */ 00650002
*%SCABSL  :  ;                                                          00700002
*/* **************************************************************** */ 00750002
*/*            SPIE CONTROL AREA                                     */ 00800002
*/* **************************************************************** */ 00850002
*DECLARE                                                                00900002
*  1 SCA  BASED,                   /* SPIE CONTROL AREA              */ 00950002
*   2 SCAPIE     PTR(31),          /* ADDRESS OF PROG INTERRUPT ELEM */ 01000002
*   2 SCAPMASK   CHAR(1),          /* PROGRAM MASK AT THE TIME OF    */ 01020002
*                                  /* SPIE INITIATION. RESTORED AT   */ 01030002
*                                  /* SPIE NULLIFICATION.            */ 01040002
*   2 SCARESV    CHAR(3),          /* RESERVED FOR FUTURE USE        */ 01050002
*   2 SCAPARMS   CHAR(16),         /* PROG CHK FLIH'S SRB PARMS      */ 01060002
    2 SCARPPTR   PTR(31),         /*RECOVERY PIE PICA ADDRESS @ZA06785*/01070003
    2 SCAFRPPQ   PTR(31),         /*FREE RPIEPICA QUEUE PTR  @ZA06785*/ 01080003
*   2 SCASRB     CHAR(1);          /* SRB USED BY PROG CHECK FLIH    */ 01100002
