*        %GOTO DSEBSL   ; /*                                            00600000
         MACRO                                                          01200000
         IKJDSE                                                         01800000
DSE      DSECT                                                          02400000
*********************************************************************** 03000000
*                                                                       03600000
*                                                                       04200000
*DSE IS USED TO MAINTAIN DATA SET INFORMATION, SUCH AS THE DDNAME--     04800000
*DSNAME RELATIONSHIP. IT IS A SERIES OF CHAINED ELEMENTS EACH ONE       05400000
*VARIABLE IN SIZE DEPENDENT ON THE INFORMATION PRESENT.                 06000000
*                                                                       06600000
*                                                                       07200000
*********************************************************************** 07800000
DSEFORWD DS    A        ADDRESS OF NEXT DSE BLK(ZERO IN LAST DSE)       08400000
DSEBCKWD DS    A        ADDRESS OF PREV. DSE BLK (ZERO IN FIRST DSE)    09000000
DSEBLKSZ DS    1H       TOTAL NO. OF BYTES IN THIS DSE BLK INCLUDES     09600000
*                       THIS FIELD AND TWO PRIOR FIELDS                 10200000
DSESTAT  DS    X        THE ALLOCATED STATUS OF THE DATA SET            10850000
*        EQU   X'80'    RESERVED                                        10900000
*        EQU   X'40'    RESERVED                                        10950000
*        EQU   X'20'    RESERVED                                        11000000
*        EQU   X'10'    RESERVED                                        11050000
DSESHR   EQU   X'08'    SHR                                             11100000
DSENEW   EQU   X'04'    NEW                                             11110000
DSEMOD   EQU   X'02'    MOD                                             11120000
DSEOLD   EQU   X'01'    OLD                                             11150000
DSECNTRL DS    X        STATUS OF DATA SETS WHEN BITS ARE ON AS FOLLOWS 11400000
DSEDYN   EQU   X'80'    DATA SET ALLOCATED DYNAMICALLY                  12000000
DSENUSED EQU   X'40'    DATA SET NOT IN USE                             12600000
DSEMEM   EQU   X'20'    MEMBER FIELD IS PRESENT IN THIS DSE             13200000
DSEDTIOT EQU   X'10'    TIOT ENTRY IS DYNAM                             13800000
DSECON   EQU   X'08'    DATA SET CONCATENATED DYNAMICALLY               14400000
*        EQU   X'04'    RESERVED                                        15000000
DSEPERM  EQU   X'02'    DATA SET IS PERMAMENTLY ALLOCATED               15600000
*        EQU   X'01'    RESERVED                                        16200000
DSEDDNAM DS    CL8      DDNAME AS IT APPEARS IN TIOT                    16800000
DSETCBAD DS    A        ADD. OF TCB FOR CP WHICH SECURED DYNAMIC ALLOC. 17400000
DSETTRPW DS    1F       RELATIVE TTR OF PASSWD FOR THIS FIELD IS ZERO.  18000000
DSENDISP DS    X        NORMAL DISPOSITION IND. BY BIT SETTINGS:        18600000
*        EQU   X'80'    RESERVED                                        19200000
*        EQU   X'40'    RESERVED                                        19800000
*        EQU   X'20'    RESERVED                                        20400000
*        EQU   X'10'    RESERVED                                        21000000
DSEKEP   EQU   X'08'    KEEP                                            21600000
DSEDEL   EQU   X'04'    DELETE                                          22200000
DSECAT   EQU   X'02'    CATLG                                           22800000
DSEUCAT  EQU   X'01'    UNCATLG                                         23400000
DSEADISP DS    CL1      ABNORMAL DISPOSITION IS IND. BY SETTING BITS    24000000
*                       IN THIS FIELD THE SAME AS IN DSENDISP           24600000
DSEAKEP  EQU   X'08'    KEEP                                            25200000
DSEADEL  EQU   X'04'    DELETE                                          25800000
DSEACAT  EQU   X'02'    CATALOG                                         26400000
DSEAUCAT EQU   X'01'    UNCATALOG                                       27000000
DSEDSORG DS    X        ORGANIZATION IND. BY FOLLOWING BITS:            27600000
DSEIS    EQU   X'80'    INDEXED SEQUENTIAL                              28200000
DSEPS    EQU   X'40'    PHYSICAL SEQUENTIAL                             28800000
DSEDA    EQU   X'20'    DIRECT ORGANIZATION                             29400000
*        EQU   X'10'    RESERVED                                        30000000
*        EQU   X'08'    RESERVED                                        30600000
*        EQU   X'04'    RESERVED                                        31200000
DSEPO    EQU   X'02'    PARTITIONED ORGANIZATION                        31800000
DSEU     EQU   X'01'    UNMOVABLE                                       32400000
DSEDSLNG DS    CL1      LENGTH OF DATA SET NAME IN BYTES (1-44)         33000000
DSEDSNAM DS    CL44     DATA SET NAME DSE DESCRIBES                     33600000
**/                                                                     34200000
         MEND                                                           34800000
* %DSEBSL  :  ;                                                         35400000
* DECLARE                                                               36000000
*   1 DSE      BASED(DSEPTR),                                           36600000
* /* *************************************************************** */ 37200000
*                                                                       37800000
*                                                                       38400000
* /* IS USED TO MAINTAIN DATA SET INFORMATION, SUCH AS THE DDNAME--  */ 39000000
* /* ME RELATIONSHIP. IT IS A SERIES OF CHAINED ELEMENTS EACH ONE    */ 39600000
* /* ABLE IN SIZE DEPENDENT ON THE INFORMATION PRESENT.              */ 40200000
*                                                                       40800000
*                                                                       41400000
* /* *************************************************************** */ 42000000
*    2 DSEFORWD PTR(31),             /* ADDRESS OF NEXT DSE BLK(ZERO    42600000
*                                       IN LAST DSE)                 */ 43200000
*    2 DSEBCKWD PTR(31),             /* ADDRESS OF PREV. DSE BLK        43800000
*                                       (ZERO IN FIRST DSE)          */ 44400000
*    2 DSEBLKSZ FIXED(15),           /* TOTAL NO. OF BYTES IN THIS      45000000
*                                       DSE BLK INCLUDES THIS FIELD     45600000
*                                       AND TWO PRIOR FIELDS         */ 46200000
*    2 DSESTAT  CHAR(1),             /* THE ALLOCATED STATUS OF         46850000
*                                       THE DATA SET                 */ 46900000
*     3 *        BIT(1),             /* RESERVED                     */ 46950000
*     3 *        BIT(1),             /* RESERVED                     */ 46960000
*     3 *        BIT(1),             /* RESERVED                     */ 46970000
*     3 *        BIT(1),             /* RESERVED                     */ 47000000
*     3 DSESHR   BIT(1),             /* SHR                          */ 47050000
*     3 DSENEW   BIT(1),             /* NEW                          */ 47100000
*     3 DSEMOD   BIT(1),             /* MOD                          */ 47150000
*     3 DSEOLD   BIT(1),             /* OLD                          */ 47200000
*    2 DSECNTRL CHAR(1),             /* STATUS OF DATA SETS WHEN        47400000
*                                       BITS ARE ON AS FOLLOWS       */ 48000000
*     3 DSEDYN   BIT(1),             /* DATA SET ALLOCATED              48600000
*                                       DYNAMICALLY                  */ 49200000
*     3 DSENUSED BIT(1),             /* DATA SET NOT IN USE          */ 49800000
*     3 DSEMEM   BIT(1),             /* MEMBER FIELD IS PRESENT IN      50400000
*                                       THIS DSE                     */ 51000000
*     3 DSEDTIOT BIT(1),             /* TIOT ENTRY IS DYNAM          */ 51600000
*     3 DSECON   BIT(1),             /* DATA SET CONCATENATED           52200000
*                                       DYNAMICALLY                  */ 52800000
*     3 *        BIT(1),             /* RESERVED                     */ 53400000
*     3 DSEPERM  BIT(1),             /* DATA SET IS PERMAMENTLY         54600000
*                                       ALLOCATED EQU                */ 55200000
*     3 *        BIT(1),             /* RESERVED                     */ 55800000
*    2 DSEDDNAM CHAR(8),             /* DDNAME AS IT APPEARS IN TIOT */ 56400000
*    2 DSETCBAD PTR(31),             /* ADD. OF TCB FOR CP WHICH        57000000
*                                       SECURED DYNAMIC ALLOC.       */ 57600000
*    2 DSETTRPW FIXED(31),           /* RELATIVE TTR OF PASSWD FOR      58200000
*                                       THIS FIELD IS ZERO.          */ 58800000
*    2 DSENDISP CHAR(1),             /* NORMAL DISPOSITION IND. BY      59400000
*                                       BIT SETTINGS: EQU EQU EQU       60000000
*                                       EQU                          */ 60600000
*     3 *        BIT(1),             /* RESERVED                     */ 61200000
*     3 *        BIT(1),             /* RESERVED                     */ 61800000
*     3 *        BIT(1),             /* RESERVED                     */ 62400000
*     3 *        BIT(1),             /* RESERVED                     */ 63000000
*     3 DSEKEP   BIT(1),             /* KEEP                         */ 63600000
*     3 DSEDEL   BIT(1),             /* DELETE                       */ 64200000
*     3 DSECAT   BIT(1),             /* CATLG                        */ 64800000
*     3 DSEUCAT  BIT(1),             /* UNCATLG                      */ 65400000
*    2 DSEADISP CHAR(1),             /* ABNORMAL DISPOSITION IS IND.    66000000
*                                       BY SETTING BITS IN THIS         66600000
*                                       FIELD THE SAME AS IN            67200000
*                                       DSENDISP                     */ 67800000
*     3 *        BIT(1),          /* RESERVED      */                   68400000
*     3 *        BIT(1),          /* RESERVED      */                   69000000
*     3 *        BIT(1),          /* RESERVED      */                   69600000
*     3 *        BIT(1),          /* RESERVED      */                   70200000
*     3 DSEAKEP  BIT(1),          /*  KEEP         */                   70800000
*     3 DSEADEL  BIT(1),          /*  DELETE       */                   71400000
*     3 DSEACAT  BIT(1),          /*  CATALOG      */                   72000000
*     3 DSEAUCAT BIT(1),          /*  UNCATALOG    */                   72600000
*    2 DSEDSORG CHAR(1),             /* ORGANIZATION IND. BY            73200000
*                                       FOLLOWING BITS:              */ 73800000
*     3 DSEIS    BIT(1),             /* INDEXED SEQUENTIAL           */ 74400000
*     3 DSEPS    BIT(1),             /* PHYSICAL SEQUENTIAL          */ 75000000
*     3 DSEDA    BIT(1),             /* DIRECT ORGANIZATION EQU EQU     75600000
*                                       EQU                          */ 76200000
*     3 *        BIT(1),             /* RESERVED                     */ 76800000
*     3 *        BIT(1),             /* RESERVED                     */ 77400000
*     3 *        BIT(1),             /* RESERVED                     */ 78000000
*     3 DSEPO    BIT(1),             /* PARTITIONED ORGANIZATION     */ 78600000
*     3 DSEU     BIT(1),             /* UNMOVABLE                    */ 79200000
*    2 DSEDSLNG  PTR(8),             /* LENGTH OF DATA SET NAME IN      79800000
*                                       BYTES (1-44)                 */ 80400000
*    2 DSEDSNAM CHAR(44),            /* DATA SET NAME DSE DESCRIBES  */ 81000000
*  1  DSEMEMBR CHAR(8) BASED(DSEMPTR); /* FIELD CAN ONLY BE PRESENT     81600000
*                                       WHEN DATA SET IS OF A           82200000
*                                       PARTITIONED ORGANIZATION. IT    82800000
*                                       IS THE MEMBER OF THE PDS        83400000
*                                       CURRENTLY ALLOCATEDAND IS       84000000
*                                       PRESENT WHEN BIT TWO OF         84600000
*                                       CONTROL BYTE IS SET          */ 85200000
*                                                                       85800000
