         MACRO                                                          00000403
         IKJXSA                                                         00000803
.* A000000-999999                                              @G76XRYU 00001203
         SPACE                                                          00001603
*********************************************************************** 00002003
.* A000038,000039                                              @OZ43223 00002403
.* C000013,000017,000038,000052,000084                         @OZ43223 00002803
.* D000018-000037,000040-000041,000081,000085                  @OZ43223 00003203
*                                                                     * 00003603
*  EXTENDED SUPERVISOR RB SAVE AREA AS USED BY TCAM/TSO MODULES. IF   * 00004003
*  USED, IT MUST BE INCLUDED IMMEDIATELY FOLLOWING MACRO 'IKJRB'.     * 00004403
*                                                                     * 00004803
*********************************************************************** 00005203
         SPACE                                                          00005603
         ORG   RBEXSAVE           START OF RB EXTENDED SAVE AREA        00006003
XSAPRM0  DS    0F                 SVC 93 PARMLIST WORD 0      @OZ43223  00006403
XSANEDIT EQU   X'80'              NOEDIT OPTION SELECTED                00006803
XSAPRMTJ DS    H                  ASID OF TARGET TERMINAL (TPUT ONLY)   00007203
XSAPRMSZ DS    H                  SIZE OF DATA BUFFER                   00007603
XSAPRM1  DS    A                  BUF ADDR FROM PARM LIST      @OZ43223 00008003
XSAFLAG  DS    X                  SVC 93 PARMLIST FLAGS2       @OZ43223 00008403
*        EQU   X'80'              TPUT END OF LIST FLAG        @OZ43223 00008803
*        EQU   X'40'              AVAILABLE                    @OZ43223 00009203
XSATCBFX EQU   X'20'              TURN OFF TCBFX AT EXIT                00009603
*        EQU   X'10'-X'04'        AVAILABLE                    @OZ43223 00010003
XSATPG   EQU   X'02'              TPG MACRO INVOCATION         @OZ43223 00010403
XSATNEDT EQU   X'01'              TPUT NOEDIT                  @OZ43223 00010803
XSAOPTNS DS    X                  SVC 93 PARMLIST FLAGS1       @OZ43223 00011203
*                                                              @OZ43223 00011603
*  TGET, TPUT FLAG SETTINGS                                    @OZ43223 00012003
*                                                              @OZ43223 00012403
MTGET    EQU   X'80'              TGET REQUESTED               @OZ43223 00012803
MUSERP   EQU   X'40'              USERID SPECIFIED (TPUT)      @OZ43223 00013203
MLOWP    EQU   X'20'              LOWPRI (TPUT ONLY)           @OZ43223 00013603
MWAIT    EQU   X'10'              NOWAIT                       @OZ43223 00014003
MHOLD    EQU   X'08'              HOLD                         @OZ43223 00014403
MBREAK   EQU   X'04'              BREAKIN SPECIFIED (TPUT ONLY)@OZ43223 00014803
*                                                              @OZ43223 00015203
*   DATA MODE FLAGS:                                           @OZ43223 00015603
*                                                              @OZ43223 00016003
MFULLSCR EQU   X'03'              FULLSCREEN OPTION (TPUT ONLY)@OZ43223 00016403
MCNTRL   EQU   X'02'              CONTROL OPTION (TPUT ONLY)   @OZ43223 00016803
MASIS    EQU   X'01'              ASIS OPTION                  @OZ43223 00017203
*        EQU   X'00'              EDIT OPTION                  @OZ43223 00017603
XSAUBFRS DS    H                  AMOUNT DATA LEFT TO MOVE              00018003
XSAUBFRP DS    0F                 LOCATION DATA LEFT TO MOVE            00018403
XSAESTAL DS    0CL16              LIST FOR ESTAE MACRO                  00018803
         ORG   XSAUBFRP+4                                               00019203
XSAWD5   DS    F                  FOR SAVING REGISTERS                  00019603
XSAWD6   DS    F                  FOR SAVING REGISTERS                  00020003
         ORG   XSAWD5             USE WORDS 5-6 FOR NAME                00020403
XSAENQNM DS    CL8                ENQUEUE NAME FOR ASID TPUT            00020803
XSAWD7   DS    0F                 FOR SAVING REGISTERS                  00021203
XSAENQAD DS    2F                 WORK AREA FOR ENQUEUE/DEQUEUE         00021603
XSAUSERP DS    F                  SVC 93 PARMLIST WORD 2       @OZ43223 00022003
XSARETRG DS    F                  FOR SAVING RETURN ADDRESS             00022403
         DS    CL1                RESERVED                              00022803
XSAUSERK DS    CL1                KEY OF TGET CALLER                    00023203
XSARC    DS    H                  RETURN CODE SAVE AREA                 00023603
XSATJID  DS    H                  CALLER'S ASID                         00024003
XSAFLAG2 DS    X                  FLAGS                                 00024403
XSAATR   EQU   X'80'              NEXT CHAR IN TIOC BUFFER              00024803
*                                 IS A 3270 ATTRIBUTE BYTE              00025203
XSABFRAL EQU   X'40'              TIOC BUFFER HAS BEEN ALLOCATED        00025603
XSA15D   EQU   X'20'              CHANGE COMPLETION CODE TO 15D         00026003
*        X'10'-X'01'              RESERVED                              00026403
XSAF     DS    X                  FLAGS USED BY TPUT-INITIALIZED FROM   00026803
*                                 XSAFLAG                               00027203
HSW      EQU   X'80'              HEADER BUFFER DONE                    00027603
PSW      EQU   X'40'              NEED TO TPOST QCB                     00028003
*        EQU   X'20'              TURN OFF TCBFX AT EXIT                00028403
OSW      EQU   X'10'              TSBOWIP TURNED ON BY US               00028803
XSADMOVE EQU   X'08'              DATA MOVEMENT GOES ON                 00029203
XSAAUTH  EQU   X'04'              USER IS AUTHORIZED                    00029603
*                                 (NOT SOME OTHER TPUT)                 00030003
XSAIDENQ EQU   X'02'              ASID TPUT-ASID ENQUEUED               00030403
XSAPARTO EQU   X'01'              QCBPARTO IS SET ON                    00030803
         SPACE 2                                                        00031203
*********************************************************************** 00031603
*               |                 |                                   * 00032003
*           XSAPRMTJ              |             XSAPRMSZ              * 00032403
*                              XSAPRM0                                * 00032803
*********************************************************************** 00033203
*                              XSAPRM1                                * 00033603
*********************************************************************** 00034003
*   XSAFLAG     |   XSAOPTNS      |             XSAUBFRS              * 00034403
****|****************************************************************** 00034803
*   |                         XSAUBFRP                                * 00035203
* X |****************************************************************** 00035603
* S |                          XSAWD5                                 * 00036003
* A |                     -----------------                           * 00036403
* E |*********************|   XSAEQNM     |**************************** 00036803
* S |                     -----------------                           * 00037203
* T |                          XSAWD6                                 * 00037603
* A |****************************************************************** 00038003
* L |                          XSAWD7                                 * 00038403
*   |                     -----------------                           * 00038803
****|*********************|    XSAENQAD   |**************************** 00039203
*                         -----------------                           * 00039603
*********************************************************************** 00040003
*                             XSAUSERP                                * 00040403
*********************************************************************** 00040803
*                             XSARETRG                                * 00041203
*********************************************************************** 00041603
*   RESERVED    |    XSAUSERK     |               XSARC               * 00042003
*********************************************************************** 00042403
*            XSATJID              |    XSAFLAG2     |     XSAF        * 00042803
*********************************************************************** 00043203
         MEND                                                           00043603
