*    THIS STRUCTURE MAY BE USED TO MAP THE SESSION PARAMETERS           00050000
*    OR THE DATA PORTION OF A BIND RU.                                  00050200
*                                                                       00050400
*    INITIAL LEVEL (LEVEL SET TO CURRENT BIND LEVEL)  005 02/07/75      00050600
         MACRO                                                          00050800
         ISTDBIND                                                       00051000
ISTDBIND DSECT                                                          00051200
BINFMTY  DS    C                   BIND FORMAT AND TYPE                 00051400
BINFMT   EQU   X'F0'               BIND FORMAT                          00051600
BINTYPE  EQU   X'0F'               BIND TYPE                            00051800
BINFM    DS    C                   FUNCTION MANAGEMENT PROFILE          00052000
BINTS    DS    C                   TRANSMISSION SERVICES PROFILE        00052200
BINPRIP  DS    C                   PRIMARY NAU PROTOCOLS                00052400
BINPCHN  EQU   X'80'               1 = MULTIPLE RU CHAINS,              00052600
*                                  0 = SINGLE RU CHAINS                 00052800
BINPMCH  EQU   X'40'               1 = MULTIPLE OUTSTANDING CHAINS      00053000
*                                  (DELAYED REQUEST MODE)               00053200
*                                  0 = SINGLE OUTSTANDING CHAIN         00053400
*                                  (IMMEDIATE REQUEST MODE)             00053600
BINPCHNR EQU   X'30'               CHAIN RESPONSE PROTOCOL              00053800
BINRSV01 EQU   X'0C'               RESERVED                             00054000
BINPCMP  EQU   X'02'               1 = COMPRESSION MAY BE USED,         00054200
*                                  0 = COMPRESSION MUST NOT BE USED     00054400
BINPSEB  EQU   X'01'               1 = PRIMARY MAY SEND EB,             00054600
*                                  0 = PRIMARY WILL NOT SEND EB         00054800
BINSECP  DS    C                   SECONDARY NAU PROTOCOLS              00055000
BINSCHN  EQU   X'80'               1 = MULTIPLE RU CHAINS,              00055200
*                                  0 = SINGLE RU CHAIN                  00055400
BINSMCH  EQU   X'40'               1 = MULTIPLE OUTSTANDING CHAINS      00055600
*                                  (DELAYED REQUEST MODE)               00055800
*                                  0 = SINGLE OUTSTANDING CHAIN         00056000
*                                  (IMMEDIATE REQUEST MODE)             00056200
BINSCHNR EQU   X'30'               CHAIN RESPONSE PROTOCOLS             00056400
BINRSV02 EQU   X'0C'               RESERVED                             00056600
BINSCMP  EQU   X'02'               1 = COMPRESSION MAY BE USED          00056800
*                                  0 = COMPRESSION MUST NOT BE USED     00057000
BINSSEB  EQU   X'01'               1 = SECONDARY MAY SEND EB,           00057200
*                                  0 = SECONDARY WILL NOT SEND EB       00057400
BINCMNP  DS    C                   COMMON NAU PROTOCOLS                 00057600
BINRSV03 EQU   X'80'               RESERVED                             00057800
BINFMHD  EQU   X'40'               1 = FM HEADERS MAY BE USED           00058000
*                                  0 = FM HEADERS MUST NOT BE USED      00058200
BINBRAK  EQU   X'20'               1 = BRACKETS WILL BE USED,           00058400
*                                  0 = BRACKETS WILL NOT BE USED        00058600
BINBKTR  EQU   X'10'               1 = CONDITIONAL TERMINATION          00058800
*                                  0 = UNCONDITIONAL TERMINATION        00059000
BINALT   EQU   X'08'               1 = ALTERNATE CODE MAY BE USED       00059200
*                                  0 = ALT. CODE MUST NOT BE USED       00059400
BINRSV04 EQU   X'07'               RESERVED                             00059600
BINCMNP2 DS    C                   COMMON NAU PROTOCOLS                 00059800
BINFMTRM EQU   X'C0'               FM TRANSACTION MODE                  00060000
BINRCVR  EQU   X'20'               1 = SENDER OF RU RESPONSIBLE         00060200
*                                  FOR RECOVERY,  0 = PRIMARY           00060400
*                                  RESPONSIBLE FOR RECOVERY             00060600
BINBKFS  EQU   X'10'               1 = PRIMARY IS BRACKETS              00060800
*                                  FIRST SPEAKER,  0 = SECONDARY        00061000
*                                  IS BRACKETS FIRST SPEAKER            00061200
BINMDIBK EQU   X'0C'               RESERVED                             00061400
BINRCHN  EQU   X'02'               RESERVED                             00061600
BINCONR  EQU   X'01'               CONTENTION RESOLUTION-               00061800
*                                  FOR HDX FLIP-FLOP:                   00062000
*                                  1 = PRIMARY SPEAKS FIRST WHEN        00062200
*                                  DATA TRAFFIC RESET STATE IS LEFT     00062400
*                                  0 = SECONDARY SPEAKS FIRST WHEN      00062600
*                                  DATA TRAFFIC RESET STATE IS LEFT     00062800
*                                  FOR HDX CONTENTION:                  00063000
*                                  1 = PRIMARY WINS CONTENTION          00063200
*                                  0 = SECONDARY WINS CONTENTION        00063400
BINTSU   DS    CL6                 TS USAGE                             00063600
BINPRSVC DS    CL12                PRESENTATION SERVICES                00063800
BINRSV05 DS    C                   RESERVED                             00064000
BINPRIML DS    C                   PRIMARY NAU NAME LENGTH              00064200
BINPRIM  DS    8C                  PRIMARY NAU NAME                     00064400
BINUSEL  DS    C                   USER DATA LENGTH                     00064600
BINUSE   EQU   *                   USER DATA                            00064800
BINUSERD EQU   X'00'               USER DATA LENGTH DEFAULT             00065000
*                                                                       00065200
*  OVERLAY FOR 'BINTSU' (TS USAGE)                                      00065400
         ORG   BINTSU                                                   00065600
BINRSV06 DS    C                   RESERVED                             00065800
BINRPACE DS    C                   SLU RECEIVE PACING COUNT             00066000
BINRSV07 EQU   X'C0'               RESERVED                             00066200
BINRPACM EQU   X'3F'               SLU RECEIVE PACING COUNT             00066400
BINRUSZ  DS    0CL2                RU SIZES                             00066600
BINSRUSZ DS    C                   SLU MAXIMUM SEND RU SIZE             00066800
BINPRUSZ DS    C                   PLU MAXIMUM SEND RU SIZE             00067000
BINRUSZM EQU   X'F0'               MANTISSA (M)                         00067200
BINRUSZE EQU   X'0F'               EXPONENT (E)  SIZE=M*2**E            00067400
BINRSV08 DS    CL2                 RESERVED                             00067600
*                                                                       00067800
*  OVERLAY FOR 'BINPRSVC' (PRESENTATION SERVICES)                       00068000
         ORG   BINPRSVC                                                 00068200
BINLUP   DS    C                   LU PROFILE                           00068400
BINRSV27 EQU   X'80'               RESERVED                             00068600
BINLUTYP EQU   X'7F'               LU TYPE                              00068800
BINPSCHR DS    CL11                LU PROFILE DEPENDENT PRESENTATION    00069000
*                                  SERVICES CHARACTERISTICS             00069200
*                                                                       00069400
*  OVERLAY FOR 'BINPSCHR' (PRESENTATION SERVICES CHARACTERISTICS        00069600
*                          FOR LU PROFILE 1.)                           00069800
         ORG   BINPSCHR                                                 00070000
BINLUP1  DS    X                   LU PROFILE 1 FMHS AND DSN            00070200
BINFMHS1 EQU   X'F0'               FM HEADER SUBSET                     00070400
BINDSP1  EQU   X'0F'               DATA STREAM PROFILE                  00070600
BINPLUS1 DS    0XL5                PLU USAGE                            00070800
BINPFMF1 DS    0XL2                FMH SUBSET DEPENDENT FLAGS           00071000
BINPFMB1 DS    X                   FIRST BYTE                           00071200
BINPFMB2 DS    X                   SECOND BYTE                          00071400
BINPDSP1 DS    0XL2                DATA STREAM FLAGS FOR DSP0 & DSP1    00071600
BINPDSB1 DS    X                   FIRST BYTE                           00071800
BINPDSB2 DS    X                   SECOND BYTE (RESERVED)               00072000
BINPMED1 DS    X                   MEDIA FLAGS                          00072200
BINSLUS1 DS    0XL5                SLU USAGE                            00072400
BINSFMF1 DS    0XL2                FMH SUBSET DEPENDENT FLAGS           00072600
BINSFMB1 DS    X                   FIRST BYTE                           00072800
BINSFMB2 DS    X                   SECOND BYTE                          00073000
BINSDSP1 DS    0XL2                DATA STREAM FLAGS FOR DSP0 & DSP1    00073200
BINSDSB1 DS    X                   FIRST BYTE                           00073400
BINSDSB2 DS    X                   SECOND BYTE (RESERVED)               00073600
BINSMED1 DS    X                   MEDIA FLAGS                          00073800
*                                                                       00074000
*  FLAGS FOR LU PROFILE 1                                               00074200
*                                                                       00074400
*  FLAGS FOR BINPFMB1 AND BINSFMB1 (FIRST BYTE OF FM HEADER FLAGS)      00074600
BINDESTS EQU   X'80'               NUMBER OF OUTSTANDING DESTINATIONS   00074800
*                                  (0=TRANSMISSION MAY BE INTERUPTED    00075000
*                                   ONCE, 1=TWICE.                      00075200
BINCMPCT EQU   X'40'               0=PRIMARY WILL NOT SEND COMPACTION   00075400
*                                  TABLE HEADERS/SECONDARY WILL NOT     00075600
*                                  QUERY FOR COMPACTION TABLES.         00075800
*                                  1=PRIMARY MAY SEND/SECONDARY MAY Q.  00076000
BINPDIR  EQU   X'20'               0=PDIR WILL NOT BE SENT              00076200
*                                  1=PDIR MAY BE SENT                   00076400
BINRSV09 EQU   X'1F'               RESERVED FOR FMHS1                   00076600
*  ADDITIONAL FLAGS FOR FMHS3                                           00076800
BINKDDSI EQU   X'10'               0=KEYED DIRECT DATA SET WILL NOT BE  00077000
*                                  SENT, 1=MAY BE SENT.                 00077200
BINSDSI  EQU   X'08'               0=SEQUENTIAL DATA SETS WILL NOT BE   00077400
*                                  SENT, 1=MAY BE SENT.                 00077600
BINSAI   EQU   X'04'               0=SEQUENTIAL ACCESS TO ADDRESSED     00077800
*                                  DIRECT DATA SET WILL NOT BE SENT,    00078000
*                                  1=MAY BE SENT.                       00078200
BINSIDS  EQU   X'02'               0=SERIES ID NOT SUPPORTED (WITH      00078400
*                                  STATUS IN REPLY), 1=SUPPORTED.       00078600
BINARRR  EQU   X'01'               0=ADD REPLICATE, REPLACE REPLICATE   00078800
*                                  NOT SUPPORTED,  1=SUPPORTED.         00079000
*  FLAGS FOR BINPFMB2 AND BINSFMB2 (SECOND BYTE OF FM HEADER FLAGS)     00079200
BINRSV17 EQU   X'FF'               RESERVED FOR FMHS1                   00079400
*  ADDITIONAL FLAGS FOR FMHS3                                           00079600
BINRSV16 EQU   X'80'               RESERVED                             00079800
BINQDSI  EQU   X'40'               0=QUERY DATA SET NOT SUPPORTED,      00080000
*                                  1=SUPPORTED.                         00080200
BINCSDS  EQU   X'20'               0=CREATE/SCRATCH/SCRATCH ALL DATA    00080400
*                                  SET NOT ALLOWED, 1=ALLOWED.          00080600
BINXFPD  EQU   X'10'               0=EXECUTE FP DELAYED NOT ALLOWED,    00080800
*                                  1=ALLOWED.                           00081000
BINRSV11 EQU   X'0F'               RESERVED FOR FMHS3                   00081200
*                                                                       00081400
*  FLAGS FOR 'BINPDSB1 AND BINSDSB1' (PLU/SLU DATA STREAM               00081600
*                                     FLAGS FOR DSP0 AND DSP1)          00081800
BININTR  EQU   X'80'               INTERACTIVE DATA STREAM (BS,CR,LF,   00082000
*                                  ENP,INP)-0=WILL NOT BE SENT,         00082200
*                                  1=MAY BE SENT.                       00082400
BINHFDS  EQU   X'40'               HORIZONTAL FORMAT, DATA STREAM(SHF,  00082600
*                                  HT)-0=WILL NOT BE SENT,1=MAY BE SENT 00082800
BINVTDS  EQU   X'20'               VERTICAL TAB DATA STREAM (SVF,VT)-   00083000
*                                  0=WILL NOT BE SENT, 1=MAY BE SENT.   00083200
BINVSDS  EQU   X'10'               VERTICAL SELECT DATA STREAM (SVF     00083400
*                                  (CHANNELS),SEL)-0=WILL NOT BE SENT,  00083600
*                                  1=MAY BE SENT.                       00083800
BINRSV12 EQU   X'0E'               RESERVED                             00084000
BINTRNDS EQU   X'01'               TRANSPARENCY DATA STREAM (TRN,IRS)-  00084200
*                                  0=WILL NOT BE SENT, 1=MAY BE SENT.   00084400
*                                                                       00084600
*  FLAGS FOR BINPMED1 AND BINSMED1 (PLU/SLU MEDIA FLAGS)                00084800
BINDOCMT EQU   X'80'               0=DOCUMENT FORMAT WILL NOT BE SENT,  00085000
*                                  1=MAY BE SENT.                       00085200
BINCARD  EQU   X'40'               0=CARD FORMAT WILL NOT BE SENT,      00085400
*                                  1=MAY BE SENT.                       00085600
BINXCHNG EQU   X'20'               0=EXCHANGE MEDIA FORMAT WILL NOT BE  00085800
*                                  SENT, 1=MAY BE SENT.                 00086000
BINDISK  EQU   X'10'               0=DISK FORMAT WILL NOT BE SENT,      00086200
*                                  1=MAY BE SENT.                       00086400
BINRSV13 EQU   X'0F'               RESERVED                             00086600
*                                                                       00086800
*  OVERLAY FOR 'BINPSCHR' (PRESENTATION SERVICES CHARACTERISTICS        00087000
*                          FOR LU PROFILE 2)                            00087200
         ORG   BINPSCHR                                                 00087400
BINRSV14 DS    XL9                 RESERVED                             00087600
BINPRESZ DS    X                   PRESENTATION SPACE SIZE              00087800
BINRSV15 DS    X                   RESERVED                             00088000
*                                                                       00088200
*  OVERLAY FOR 'BINPSCHR' (PRESENTATION SERVICES CHARACTERISTICS        00088400
*                          FOR LU TYPE 3                                00088600
         ORG   BINPSCHR                                                 00088800
BINRSV26 DS    XL11                RESERVED                             00089000
*                                                                       00089200
*    VALUES FOR BINPCHNR/BINSCHNR                                       00089400
*    (TYPE OF RESPONSES ASKED FOR BY REQUESTS FROM PRIMARY/SECONDARY)   00089600
BINNORSP EQU   X'00'               NO RESPONSE                          00089800
BINEXRSP EQU   X'10'               NO RESPONSE OR                       00090000
*                                  EXCEPTION RESPONSE                   00090200
BINDFRSP EQU   X'20'               DEFINITE RESPONSE                    00090400
BINNYRSP EQU   X'30'               DEFINITE OR EXCEPTION RESPONSE       00090600
*    VALUES FOR BINFMTRM  (TRANSACTION MODE)                            00090800
BINFLDPX EQU   X'00'               FULL DUPLEX                          00091000
BINHDXC  EQU   X'40'               HDX CONTENTION                       00091200
BINHDXFF EQU   X'80'               HDX FLIP FLOP                        00091400
BINMSTSL EQU   X'C0'               MASTER/SLAVE                         00091600
*    VALUES FOR BINTS (TRANSMISSION SERVICES PROFILE)                   00091800
BINTS0   EQU   X'00'               ID'S - NO RESET STATE                00092000
BINTS1   EQU   X'01'               ID'S - NO RESET STATE                00092200
BINTS2   EQU   X'02'               SEQ NOS - NO RESET STATE             00092400
BINTS3   EQU   X'03'               SEQ NOS - RESET STATE                00092600
BINTS4   EQU   X'04'               SEQ NOS - RESET STATE - STSN - RQR   00092800
*    VALUES FOR BINTYPE (TYPE)                                          00093000
BINCOLD  EQU   X'01'               COLD                                 00093200
*    VALUES FOR BINFMT (FORMAT)                                         00093400
BINFMT0  EQU   X'00'               FORMAT 0                             00093600
*  VALUES FOR BINSRUSZ AND BINPRUSZ (RU SIZES)                          00093800
BINRU256 EQU   X'85'               PRESENTATION OF 256 (8*2**5)         00094000
*  VALUES FOR BINLUP (LU PROFILE)                                       00094200
BINLUP1C EQU   X'01'               LU PROFILE 1                         00094400
BINLUP2C EQU   X'02'               LU PROFILE 2                         00094600
BINLUP3C EQU   X'03'               LU PROFILE 3                         00094800
*  VALUES FOR BINFMHS1 (FM HEADER FOR LU PROFILE)                       00095000
BINFMS1C EQU   X'10'               TYPE 1 HEADERS, DATA SET NAME FIELD  00095200
*                                  NOT USED, ALSO ONLY BEGIN DATA SET   00095400
*                                  AND END DATA SET IN SAME CHAIN CAN   00095600
*                                  SHARE A CHAIN WITH DATA.             00095800
BINFMS2C EQU   X'20'                                                    00095900
BINFMS3C EQU   X'30'               DATA MANAGEMENT SUBSET               00096000
*  VALUES FOR BINDSP1 (DATA STREAM PROFILE)                             00096200
BINDSP0C EQU   X'00'               BASIC CONTROLS                       00096400
BINDSP1C EQU   X'01'               BASIC CONTROLS, CARDS MAY SPAN RUS   00096600
*  VALUES FOR BINPRESZ (PRESENTATION SPACE SIZE)                        00096800
BINPSZ1  EQU   X'01'               12X40 CHARACTER MATRIX               00097000
BINPSZ2  EQU   X'02'               24X80 CHARACTER MATRIX               00097200
*  VALUES FOR BINDSP1 (DATA STREAM PROFILE)                             00097400
         MEND                                                           00097600
