         MACRO                                                          01000020
&NAME    REDIRECT &MASK,&DEST=ORIGIN,&CONNECT=OR,&EXIT=0        X30X5MT 02000010
         GBLA  &IEDQZD,&IEDQZE(64),&IEDQZK                              03000020
         GBLB  &IEDQZA(64)                                              04000020
         LCLA  &BIT                                                     05000020
         LCLB  &NOGO,&ALG                                               06000020
         LCLC  &C                                                       07000020
.********************** MICROFICHE FLAGS ****************************** 08000010
.*               VERSION DATED AUGUST 4,1975                    X30X5MT 08000110
.*C020000,140000,400000                                         X30X5MT 08000210
.*A550000,570000,580000,590000,790000                           X30X5MT 08000310
.********************************************************************** 08000410
         SPACE                                                          09000020
&C       SETC  '&SYSECT'                                                10000020
         AIF   (NOT &IEDQZA(9)).TSOCHK                              TSO 11000020
         MNOTE 12,'***  IHB312  MUST FOLLOW STARTMH MACRO WITH TSOMH=NO*12000020
               '                                                        13000020
         AGO   .MEND1                                           X30X5MT 14000010
.TSOCHK  AIF   (&IEDQZA(5)).CHECK                                       15000020
         MNOTE 12,'***  IHB070  SEQUENCE ERROR-MUST FOLLOW INMSG OR OUT*17000020
               MSG MACRO'                                               18000020
&NOGO    SETB  1                                                        19000020
.CHECK   AIF   ('&MASK' EQ '').NXT                                      20000020
         IEDQMASK &MASK,5                                               21000020
         AIF   (&IEDQZA(24)).ERR                                        22000020
         AIF   ('&MASK'(1,1) NE 'X').NXT                                23000020
         AIF   ('&MASK'(2,1) EQ 'L' AND '&MASK'(3,1) NE '5').ERR        24000020
         AIF   ('&MASK'(2,1) NE 'L' AND K'&MASK NE 13).ERR              25000020
         AGO   .NXT                                                     26000020
.ERR     MNOTE 12,'***  IHB300  MASK OPERAND INVALID AS SPECIFIED'      27000020
&NOGO    SETB  1                                                        28000020
.NXT     AIF   ('&DEST' EQ '' OR '&DEST' EQ 'ORIGIN' OR '&DEST' EQ 'DES*29000020
               TIN').AND                                                30000020
         IEDQCHAR 8,&DEST                                               31000020
         AIF   (&IEDQZA(24)).DESTERR                                    32000020
         AIF   (&IEDQZD GT 8).DESTERR                                   32300020
         AIF   ('&DEST'(K'&DEST,1) EQ '''').AND                         32600020
         AIF   (('&DEST'(1,1) GE 'A' AND '&DEST'(1,1) LE 'Z') OR '&DEST*32900020
               '(1,1) EQ '$' OR '&DEST'(1,1) EQ '#' OR '&DEST'(1,1) EQ *33200020
               '@').AND                                                 33500020
.DESTERR MNOTE 12,'***  IHB300  DESTINATION OPERAND INVALID AS SPECIFIE*34000020
               D'                                                       35000020
&NOGO    SETB  1                                                        36000020
.AND     AIF   ('&CONNECT' EQ 'AND' OR '&CONNECT' EQ 'OR').OP           37000020
         MNOTE 12,'***  IHB300  CONNECT OPERAND INVALID AS SPECIFIED'   38000020
&NOGO    SETB  1                                                        39000020
.OP      AIF   ('&EXIT' NE '').OP1                              X30X5MT 40000010
         MNOTE 12,'***IHB002 INVALID EXIT OPERAND SPECIFIED-  ' X30X5MT 40200010
&NOGO    SETB  1                                                X30X5MT 40400010
.OP1     AIF   (&NOGO).MEND1                                    X30X5MT 40600010
         AIF   ('&CONNECT' EQ 'OR').ORG                                 41000020
&ALG     SETB  1                                                        42000020
.ORG     AIF   ('&DEST' EQ '' OR '&DEST' EQ 'ORIGIN' OR '&DEST'(K'&DEST*43000020
               ,1) EQ '''').SMV                                         44000020
         IEDQVCON (7,31),(IEDQAZ,IEDQAE)                                45000020
         AGO   .TEST                                                    46000020
.SMV     IEDQVCON 7,IEDQAZ                                              47000020
.TEST    AIF   (NOT &IEDQZA(1)).PARM                                    48000020
&IEDQZA(18) SETB 1                                                      49000020
.PARM    AIF   ('&MASK' NE '0' AND '&MASK' NE 'X''0000000000''' AND '&M*50000020
               ASK' NE 'XL5''0000000000''' AND '&MASK' NE '').SKP       51000020
&BIT     SETA  1                                                        52000020
.SKP     ANOP                                                           53000020
&BIT     SETA  &BIT+2                                                   54000020
         AIF   (&BIT NE 1 AND &BIT NE 3).S                              55000020
         AIF   ('&EXIT' NE '0').EXP                             X30X5MT 55500010
&NAME    DC    AL1(&IEDQZE(7)+&BIT),AL1(8+&ALG),H'0'                    56000020
         AGO   .DEST                                                    57000020
.EXP     ANOP                                                   X30X5MT 57200010
&NAME    DC    AL1(&IEDQZE(7)+&BIT),AL1(12+&ALG),AL1(2),AL1(0)  X30X5MT 57400010
         AGO   .DEST                                            X30X5MT 57600010
.S       ANOP                                                           58000020
         AIF   ('&EXIT' NE '0').EXP1                            X30X5MT 58500010
&NAME    DC    AL1(&IEDQZE(7)+&BIT),AL1(12+&ALG),AL1(0)                 59000020
         AGO   .NXT1                                            X30X5MT 59200010
.EXP1    ANOP                                                   X30X5MT 59400010
&NAME    DC    AL1(&IEDQZE(7)+&BIT),AL1(16+&ALG),AL1(2)         X30X5MT 59600010
.NXT1    ANOP                                                   X30X5MT 59800010
         AIF   ('&MASK'(1,1) EQ 'X').XM                                 60000020
         DC    FL5'&MASK' .             ERROR MASK                      61000020
         AGO   .DEST                                                    62000020
.XM      DC    &MASK .                  ERROR MASK                      63000020
.DEST    AIF   ('&DEST' NE 'ORIGIN').OPT                                64000020
         DC    C'S',AL3(0) .            REDIRECT TO ORIGIN              65000020
         AGO   .MEND                                                    66000020
.OPT     AIF   ('&DEST' NE '' AND '&DEST' NE 'DESTIN').OPN              67000020
         DC    C'D',AL3(0) .            REDIRECT TO DESTINATION         68000020
         AGO   .MEND                                                    69000020
.OPN     AIF   ('&DEST'(K'&DEST,1) EQ '''').BUF                         70000020
         DC    C'O',AL1(&IEDQZE(31)),AL1(&DEST),AL1(15)        @YM08438 71000010
         AGO   .MEND                                                    72000020
.BUF     DC    C'N' .                   REDIRECT PER SPECIFIED DEST     73000020
IEDQMISC CSECT                                                          74000020
         DC    AL1(&IEDQZD),&DEST .     DESTINATION                     75000020
&C       CSECT                                                          76000020
         DC    AL3(IEDQMISC+&IEDQZK)                                    77000020
&IEDQZK  SETA  &IEDQZK+1+&IEDQZD                                        78000020
.MEND    SPACE 2                                                        79000020
         AIF   ('&EXIT' EQ '0').MEND1                           X30X5MT 79200010
         DC    V(&EXIT)                                         X30X5MT 79400010
.MEND1   ANOP                                                   X30X5MT 79600010
         MEND                                                           80000020
