         MACRO                                                          01000022
&NAME    TGOTO &MH=                                                     02000022
         GBLA  &IEDQZE(64)                                              03000022
         GBLB  &IEDQZA(64)                                              04000022
         LCLA  &BIT                                                     05000022
         LCLB  &NOGO                                                    06000022
         LCLC  &C                                                       07000022
.*A22026                                                         S22026 08000022
.*A522000-528000                                                 S22029 08300010
.*C190000-200000,410000,420000,450000                            S22029 08600010
.*             VERSION DATED JANUARY 11, 1977                  @YM08438 09000010
         SPACE                                                          10000022
         AIF   (&IEDQZA(13)).TSOCHK                                     11000022
         MNOTE 8,'*** IHB233 INCONSISTENT WITH FEATURE OPERAND OF THE IX12000022
               NTRO MACRO' .                                            13000022
&NOGO    SETB  1                                                        14000022
.TSOCHK  AIF   (NOT &IEDQZA(9)).SEQCHK                                  15000022
         MNOTE 12,'*** IHB312 MUST FOLLOW STARTMH MACRO WITH TSOMH=NO'  16000022
&NOGO    SETB  1                                                        17000022
.SEQCHK  AIF   (&IEDQZA(1) AND &IEDQZA(6)).OMITCHK                      18000022
         MNOTE 12,'*** IHB070 SEQUENCE ERROR - MUST FOLLOW INHDR OR INBX19000010
               UF MACRO' .                                       S22029 20000010
&NOGO    SETB  1                                                        21000022
.OMITCHK AIF   ('&MH' NE '').CONTINU                                    22000022
         MNOTE 12,'*** IHB001 MH OPERAND REQ''D- NOT SPECIFIED' .       23000022
         AGO   .MEND                                                    24000022
.CONTINU ANOP                                                           25000022
         IEDQCHAR 8,&MH                                                 26000022
         AIF   (NOT &IEDQZA(24)).TEST                                   27000022
.ERR     MNOTE 12,'*** IHB300 MH OPERAND INVALID AS SPECIFIED' .        28000022
         AGO   .MEND                                                    29000022
.TEST    AIF   ('&MH'(K'&MH,1) EQ '''').BLDPARM                         30000022
         AIF   ('&MH'(1,1) GE 'A' AND '&MH'(1,1) LE 'Z').SETOPT         31000022
         AIF   ('&MH'(1,1) NE '$' AND '&MH'(1,1) NE '@' AND '&MH'(1,1) *32000022
               NE '#').ERR                                              33000022
.SETOPT  AIF   (&NOGO).MEND                                             34000022
&BIT     SETA  &BIT+128                                                 35000022
         IEDQVCON (50,31),(IEDQBP,IEDQAE)                               36000022
         AGO   .BAL                                                     37000022
.BLDPARM AIF   (&NOGO).MEND                                             38000022
         IEDQVCON 50,IEDQBP                                             39000022
.BAL     CNOP  0,4                                                      40000022
&NAME    BAL   1,*+16 .                 BRANCH AROUND PARMLIST   S22029 41000010
         DC    AL1(&IEDQZE(50)),X'0C',AL1(&BIT),X'00' BP PRMLIST S22029 42000010
         AIF   ('&MH'(K'&MH,1) EQ '''').NOTOPT                          43000022
         DC    AL1(&IEDQZE(31)),X'04',AL1(&MH),AL1(15)         @YM08438 44000010
         AGO   .GENSTMH                                        @PI06957 45000010
.NOTOPT  ANOP                                                           46000022
         AIF   ('&MH'(2,1) EQ 'L').CLN                                  47000022
&C       SETC  '&MH'(3,K'&MH-3)                                         48000022
         AGO   .DC                                                      49000022
.CLN     ANOP                                                           50000022
&C       SETC  '&MH'(5,K'&MH-5)                                         51000022
.DC      DC    AL4(&C) .                MH ADDRESS                      52000022
.GENSTMH DC    V(IEDQAA) .              ADDR OF STARTMH CODE   @PI06957 52400010
         L     15,IEDUI                                                 54000022
         BALR  14,15                                                    55000022
.MEND    SPACE 2                                                        56000022
         MEND                                                           57000022
