         MACRO                                                          00050004
&NAME    WRTBFR &RPL=,&TYPE=                                            00100004
         LCLA  &CODE                    CODE ACCUMULATOR                00150004
         LCLA  &I                       WORK VARIABLE                   00200004
         LCLB  &LRU                     TYPE=LRU INDICATOR              00250004
         LCLB  &ERR                     ERROR INDICATOR                 00300004
         LCLB  &LRUREG                  REGISTER FORM OF LRU            00310004
         LCLB  &LRUR0                   PERCENT IS IN REG 0             00320004
         LCLC  &LRUPCT                  LRU VALUE                       00350004
         AIF   (N'&SYSLIST EQ 0).NOPOS  GO IF NO POSITIONAL OPERANDS    00400004
.POSLOOP ANOP                                                           00410004
&I       SETA  &I+1                     POINT TO NEXT POS OPERAND       00420004
         IDAERMAC 1,&SYSLIST(&I)        ISSUE WARNING MNOTE             00450004
         AIF   (&I LT N'&SYSLIST).POSLOOP  GO IF MORE POS OPERANDS      00460004
.NOPOS   ANOP                                                           00500004
         AIF   ('&RPL' NE '').ROKY      GO IF RPL SPECIFIED             00550004
         IDAERMAC 2,RPL                 ISSUE ERROR MNOTE               00600004
&ERR     SETB  1                        INDICATE ERROR                  00650004
.ROKY    ANOP                                                           00700004
         AIF   ('&TYPE' NE '').TOKY     GO IF TYPE NOT SPECIFIED NULL   00750004
         IDAERMAC 2,TYPE                ISSUE ERROR MNOTE               00800004
&ERR     SETB  1                        INDICATE ERROR                  00850004
         AGO   .TYPEB                   GO AROUND TYPE ANALYSIS         00900004
.TOKY    ANOP                                                           00950004
         AIF   ('&TYPE' NE 'DS').TDSB   GO IF NOT FOR DATA SET          01000004
&CODE    SETA  0*256                    INDICATE DATA SET               01050004
         AGO   .TYPEB                   GO AROUND TYPE ANALYSIS         01100004
.TDSB    ANOP                                                           01150004
         AIF   (K'&TYPE LT 6).TLRUB     GO IF NOT AT LEAST 6 CHARS      01200004
         AIF   ('&TYPE'(1,4) NE 'LRU(').TLRUB  GO IF NOT LEAST RCNT USD 01250004
&I       SETA  K'&TYPE                  POINT TO LAST CHARACTER         01300004
         AIF   ('&TYPE'(&I,1) NE ')').TLRUB  GO IF LAST CHAR NOT ')'    01350004
         AIF   ('&TYPE'(5,1) NE '(').NOREG  GO IF NOT REG FORM          01360004
         AIF   ('&TYPE'(6,1) NE '1').REGOK  OK IF NOT 1 OR 13           01380004
         AIF   ('&TYPE'(7,1) EQ '3').TLRUB  ERROR IF REG 13             01390004
         AIF   ('&TYPE'(7,1) EQ ')').TLRUB  ERROR IF REG 1              01392004
.REGOK   ANOP                                                           01394004
         AIF   ('&TYPE'(6,1) NE '0').NOTR0  GO IF NOT REGISTER ZERO     01394404
         AIF   ('&TYPE'(7,1) NE ')').NOTR0  GO IF NOT REGISTER ZERO     01394804
&LRUR0   SETB  1                        INDICATE PERCENTAGE IS IN REG 0 01395204
.NOTR0   ANOP                                                           01395604
&LRUREG  SETB  1                        INDICATE REGISTER FORM          01396004
.NOREG   ANOP                                                           01398004
&LRU     SETB  1                        INDICATE LEAST                  01400004
&CODE    SETA  4*256                    ..RECENTLY USED                 01450004
         AIF   (&LRUREG).REGOK1         GO IF REGISTER FORM             01460004
&I       SETA  K'&TYPE-5                CALC LENGTH OF N IN LRU(N)      01500004
&LRUPCT  SETC  '&TYPE'(5,&I)            PICK UP PERCENT OF BUFFERS      01550004
         AGO   .TYPEB                   GO AROUND TYPE ANALYSIS         02050004
.REGOK1  ANOP                                                           02060004
&I       SETA  K'&TYPE-7                CALC LENGTH OF N IN LRU((N))    02070004
&LRUPCT  SETC  '&TYPE'(6,&I)            PICK UP PERCENT OF BUFFERS      02080004
         AGO   .TYPEB                                                   02090004
.TLRUB   ANOP                                                           02100004
         AIF   ('&TYPE' NE 'ALL').TALLB  GO IF NOT FOR ALL BUFFERS      02150004
&CODE    SETA  8*256                    INDICATE ALL BUFFERS            02200004
         AGO   .TYPEB                   GO AROUND TYPE ANALYSIS         02250004
.TALLB   ANOP                                                           02300004
         AIF   ('&TYPE' NE 'TRN').TTRNB  GO IF NOT FOR TRANSACTION      02350004
&CODE    SETA  12*256                   INDICATE TRANSACTION            02400004
         AGO   .TYPEB                   GO AROUND TYPE ANALYSIS         02450004
.TTRNB   ANOP                                                           02500004
         AIF   ('&TYPE' NE 'CHK').TCHKB  GO IF NOT FOR CHECK POINT      02550004
&CODE    SETA  16*256                   INDICATE CHECK POINT            02600004
         AGO   .TYPEB                   GO AROUND TYPE ANALYSIS         02650004
.TCHKB   ANOP                                                           02700004
         IDAERMAC 3,TYPE,&TYPE          ISSUE ERROR MNOTE               02750004
&ERR     SETB  1                        INDICATE ERROR                  02800004
.TYPEB   ANOP                                                           02850004
         AIF   (&ERR).END               GO IF ANY ERRORS                02900004
         AIF   ('&NAME' EQ '').NAMEB    GO IF NO NAME                   02910004
&NAME    DS    0H                                                       02950004
.NAMEB   ANOP                                                           02960004
         AIF   ('&RPL'(1,1) EQ '(').RPLR  GO IF RPL SPECIFIED AS REG    03000004
         LA    1,&RPL                   LOAD RPL ADDRESS                03050004
         AGO   .AREG                    GO AROUND REG CODE              03100004
.RPLR    ANOP                                                           03150004
         AIF   ('&RPL' EQ '(1)').AREG   GO IF RPL ADDRESS ALREADY IN 1  03200004
         LR    1,&RPL(1)                LOAD RPL ADDRESS                03250004
.AREG    ANOP                                                           03300004
         AIF   (NOT &LRU).LRUB          GO IF NOT LEAST RECENTLY USED   03350004
         AIF   (&LRUREG).REG            BRANCH IF REGISTER FORM         03360004
         LA    0,&LRUPCT                LOAD PERCENT OF BUFFERS         03400004
         AGO   .LRUOK                                                   03410004
.REG     ANOP                                                           03420004
         AIF   (&LRUR0).LRUOK           GO IF ALREADY IN REG 0          03430004
         LR    0,&LRUPCT                LOAD PERCENT OF BUFFERS         03440004
.LRUOK   ANOP                                                           03442004
         SLL   0,16                     SHIFT TO HIGH ORDER             03450004
         ICM   0,3,*+18                 INSERT WRITE BUFFER CODES       03550004
         AGO   .NLRUB                   GO AROUND NOT LRU CODE          03560004
.LRUB    ANOP                                                           03570004
         LH    0,*+18                   LOAD WRITE BUFFER CODES         03580004
.NLRUB   ANOP                                                           03590004
         L     15,24(,1)                LOAD ACB ADDRESS FROM RPL       03600004
         L     15,8(,15)                LOAD VSAM INTERFACE RTN ADDR    03650004
         LA    14,*+8                   LOAD RETURN ADDRESS             03700004
         BR    15                       BRANCH TO INTERFACE ROUTINE     03750004
&CODE    SETA  &CODE+15                 INDICATE WRITE BUFFER           03800004
         DC    AL2(&CODE)               WRITE BUFFER CODES              03850004
.END     ANOP                                                           03900004
         MEND                                                           03950004
