         TITLE 'HMASMUPD - UPDATE CDS CONTROL DRIVER OF SMP'            00001000
HMASMUPD CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'HMASMUPD  78.334'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  LA    @10,4095(,@12)                                      0001 00011000
         USING @PSTART,@12                                         0001 00012000
         USING @PSTART+4095,@10                                    0001 00013000
         ST    @13,@SA00001+4                                      0001 00014000
         LA    @08,@SA00001                                        0001 00015000
         ST    @08,8(,@13)                                         0001 00016000
         LR    @13,@08                                             0001 00017000
         MVC   @PC00001(4),0(@01)                                  0001 00018000
*                                                                  0203 00019000
*   /*****************************************************************/ 00020000
*   /*                                                               */ 00021000
*   /* INITIALIZE INTERNAL FIELDS                                    */ 00022000
*   /*                                                               */ 00023000
*   /*****************************************************************/ 00024000
*                                                                  0203 00025000
*   UPDRTNCD=IOPGOOD;               /* INIT RC               @YA07506*/ 00026000
         MVI   UPDRTNCD,X'00'                                      0203 00027000
*   NAMESAVE=BLANK;                 /* BLANK SAVE AREA FOR NAME      */ 00028000
         MVI   NAMESAVE+1,C' '                                     0204 00029000
         MVC   NAMESAVE+2(6),NAMESAVE+1                            0204 00030000
         MVI   NAMESAVE,C' '                                       0204 00031000
*   STEPNAME=BLANK;                 /* INDICATE BLANK STEP           */ 00032000
         MVI   STEPNAME+1,C' '                                     0205 00033000
         MVC   STEPNAME+2(6),STEPNAME+1                            0205 00034000
         MVI   STEPNAME,C' '                                       0205 00035000
*   JOBNAME=BLANK;                  /* INDICATE BLANK JOB            */ 00036000
         MVI   JOBNAME+1,C' '                                      0206 00037000
         MVC   JOBNAME+2(6),JOBNAME+1                              0206 00038000
         MVI   JOBNAME,C' '                                        0206 00039000
*   IOPPTR=CCAIOPTR;                /* INITIALIZE PTR TO IOP         */ 00040000
         L     IOPPTR,CCAIOPTR(,CCAPTR)                            0207 00041000
*   FLAGS=ZERO;                     /* ZERO INDICATOR FLAGS          */ 00042000
         MVI   FLAGS,X'00'                                         0208 00043000
*   BUFRPTR=ADDR(JCLBUF);           /* INIT ADDR OF JCL BUFFER       */ 00044000
         LA    @08,JCLBUF                                          0209 00045000
         ST    @08,BUFRPTR                                         0209 00046000
*   MAXJCL=INCR;                    /* SET MAX NUMBER OF JCL STMTS   */ 00047000
*                                                                  0210 00048000
         MVC   MAXJCL(2),@CH00488                                  0210 00049000
*   /*****************************************************************/ 00050000
*   /*                                                               */ 00051000
*   /* INITIALIZE SCAN PARAMETER AND MESSAGE PARAMETER       @Z67SP00*/ 00052000
*   /*                                                               */ 00053000
*   /*****************************************************************/ 00054000
*                                                                  0211 00055000
*   HMASMSCP=''B;                   /* INIT SCAN PARM        @Z67SP00*/ 00056000
         XC    HMASMSCP(26),HMASMSCP                               0211 00057000
*   HMASMMGP=HMASMMGP&&HMASMMGP;    /* INIT MSG PARM         @Z40SP00*/ 00058000
         XC    HMASMMGP(24),HMASMMGP                               0212 00059000
*   MGPHLDS=ON;                     /* INDICATE MSG TO LOG   @XA06770*/ 00060000
*   MGPPRINT=ON;                    /* INDICATE MESSAGES TO PRINTER  */ 00061000
*                                                                  0214 00062000
         OI    MGPHLDS,B'10010000'                                 0214 00063000
*   /*****************************************************************/ 00064000
*   /*                                                               */ 00065000
*   /* INITIALIZE PARAMETER TO HMASMBUE TO BACKUP ENTRIES    @Z67SP00*/ 00066000
*   /*                                                               */ 00067000
*   /*****************************************************************/ 00068000
*                                                                  0215 00069000
*   BUPPARM=''B;                    /* INIT TO ZERO          @Z67SP00*/ 00070000
         XC    BUPPARM(20),BUPPARM                                 0215 00071000
*   BUPFUNCT=BUPABKUP;              /* FUNCT IS ADD          @Z67SP00*/ 00072000
         MVI   BUPFUNCT,X'01'                                      0216 00073000
*   BUPIOPAD=ADDR(HMASMIOP);        /* CHIN TO IOP           @Z67SP00*/ 00074000
         ST    IOPPTR,BUPIOPAD                                     0217 00075000
*   BUPSYSMD=UPDSYSMD;              /* SYSMOD NUMBER         @Z67SP00*/ 00076000
         L     @08,@PC00001                                        0218 00077000
         MVC   BUPSYSMD(7),UPDSYSMD(@08)                           0218 00078000
*   BUPSTYPE=UPDSTYPE;              /*                       @Z67SP00*/ 00079000
         IC    @07,UPDSTYPE(,@08)                                  0219 00080000
         STC   @07,BUPSTYPE                                        0219 00081000
*   BUPGTPAD=UPDGTPAD;              /* GTP FOR ASSEM FILE    @Z67SP00*/ 00082000
         L     @07,UPDGTPAD(,@08)                                  0220 00083000
         ST    @07,BUPGTPAD                                        0220 00084000
*   IF UPDREDO=ON                   /* IF SYSMOD BEING       @Z67SP00*/ 00085000
*     THEN                          /* REPROCESSED           @Z67SP00*/ 00086000
         TM    UPDREDO(@08),B'00100000'                            0221 00087000
         BNO   @RF00221                                            0221 00088000
*     BUPREDO=ON;                   /* THEN PASS INFO TO BUE @Z67SP00*/ 00089000
         OI    BUPREDO,B'10000000'                                 0222 00090000
         EJECT                                                          00091000
*                                                                  0223 00092000
*   /*****************************************************************/ 00093000
*   /*                                                               */ 00094000
*   /* MODIFY ALTERNATE DSCAN WITH PARM LIST PASSED FROM DRV         */ 00095000
*   /*                                                               */ 00096000
*   /*****************************************************************/ 00097000
*                                                                  0223 00098000
*   RFY                                                            0223 00099000
*     DSCANMAP BASED(ALTADDR(I));   /*                               */ 00100000
@RF00221 DS    0H                                                  0224 00101000
*   DO I=1 TO DIM(UPDPGMS);         /* SCAN ALL ENTRIES      @Z67SP00*/ 00102000
         LA    @08,1                                               0224 00103000
         STH   @08,I                                               0224 00104000
@DL00224 DS    0H                                                  0225 00105000
*     IF UPDPGMLN(I)^=0             /* AND ALT PGM?          @Z67SP00*/ 00106000
*       THEN                        /* YES                   @SA73847*/ 00107000
         LR    @07,@08                                             0225 00108000
         MH    @07,@CH00467                                        0225 00109000
         L     @06,@PC00001                                        0225 00110000
         LA    @01,0(@07,@06)                                      0225 00111000
         AL    @01,@CF01597                                        0225 00112000
         SLR   @05,@05                                             0225 00113000
         IC    @05,UPDPGMLN(,@01)                                  0225 00114000
         LTR   @05,@05                                             0225 00115000
         BZ    @RF00225                                            0225 00116000
*       DO;                         /* CHANGE DSCAN          @SA73847*/ 00117000
*         DSCKEY(1:UPDPGMLN(I))=UPDPGMNM(I,1:UPDPGMLN(I));/* MOVE PGM   00118000
*                                      NAME TO DSCAN KEY AREA      0227 00119000
*                                                            @Z67SP00*/ 00120000
         SLA   @08,2                                               0227 00121000
         L     @08,ALTADDR-4(@08)                                  0227 00122000
         LR    @04,@05                                             0227 00123000
         BCTR  @04,0                                               0227 00124000
         ALR   @06,@07                                             0227 00125000
         AL    @06,@CF01598                                        0227 00126000
         EX    @04,@SM01599                                        0227 00127000
*         DSCKEYLN=UPDPGMLN(I);     /* SET UP DSCAN KEY LEN  @Z67SP00*/ 00128000
         STC   @05,DSCKEYLN(,@08)                                  0228 00129000
*       END;                        /*                       @SA73847*/ 00130000
*   END;                            /* END DSCAN SET UP      @SA73847*/ 00131000
*                                                                  0230 00132000
@RF00225 LA    @08,1                                               0230 00133000
         AH    @08,I                                               0230 00134000
         STH   @08,I                                               0230 00135000
         C     @08,@CF00037                                        0230 00136000
         BNH   @DL00224                                            0230 00137000
*   /*****************************************************************/ 00138000
*   /*                                                               */ 00139000
*   /* INITIALIZE PARAMETER FOR HMASMCRD. IF INPUT DATASET IS EITHER */ 00140000
*   /* THE PTS OR SMPJCLIN THEN NO PROCESSING REQUIRED. SMPJCLIN WILL*/ 00141000
*   /* BE OPENED AT FIRST GET AND PTS HAS ALREADY BEEN PREPARED BY   */ 00142000
*   /* CALLER.                                               @Z67SP00*/ 00143000
*   /*                                                               */ 00144000
*   /*****************************************************************/ 00145000
*                                                                  0231 00146000
*   HMASMCRP=''B;                   /* INIT TO ZERO          @Z67SP00*/ 00147000
         XC    HMASMCRP(106),HMASMCRP                              0231 00148000
*   CRPINDS=UPDDSID;                /* MOVE INPUT DSID       @Z67SP00*/ 00149000
         L     @08,@PC00001                                        0232 00150000
         IC    @07,UPDDSID(,@08)                                   0232 00151000
         STC   @07,CRPINDS                                         0232 00152000
*   CRPDDNAM=UPDDDNAM;              /* MOVE INPUT DDNAME     @Z67SP00*/ 00153000
         MVC   CRPDDNAM(8),UPDDDNAM(@08)                           0233 00154000
*   IF CRPINDS=IOPLRF               /* IF RELFILE            @Z67SP00*/ 00155000
*       |CRPINDS=IOPANYDD           /* OR TXTLIB             @Z67SP00*/ 00156000
*     THEN                          /*                       @Z67SP00*/ 00157000
         CLI   CRPINDS,32                                          0234 00158000
         BE    @RT00234                                            0234 00159000
         CLI   CRPINDS,24                                          0234 00160000
         BNE   @RF00234                                            0234 00161000
@RT00234 DS    0H                                                  0235 00162000
*     DO;                           /*                       @Z67SP00*/ 00163000
*       IOPRETRN=IOPGOOD;           /*                       @Z67SP00*/ 00164000
         MVI   IOPRETRN(IOPPTR),X'00'                              0236 00165000
*       IOPDSID=CRPINDS;            /* SET UP IOP            @Z67SP00*/ 00166000
         IC    @08,CRPINDS                                         0237 00167000
         STC   @08,IOPDSID(,IOPPTR)                                0237 00168000
*       IF CRPINDS=IOPLRF           /* IF RELFILE THEN       @Z67SP00*/ 00169000
*         THEN                      /* MUST ALLOC IT         @Z67SP00*/ 00170000
         CLI   CRPINDS,32                                          0238 00171000
         BNE   @RF00238                                            0238 00172000
*         DO;                       /*                       @Z67SP00*/ 00173000
*           IOPDSN=UPDDSNAM;        /* PASS LRF DATASET NAME @Z67SP00*/ 00174000
         L     @08,@PC00001                                        0240 00175000
         MVC   IOPDSN(44,IOPPTR),UPDDSNAM(@08)                     0240 00176000
*           IOPSPACE=''B;           /* ZERO SPACE(DS EXISTS) @Z67SP00*/ 00177000
         XC    IOPSPACE(6,IOPPTR),IOPSPACE(IOPPTR)                 0241 00178000
*           IOPFUNCT=IOPALC;        /* ALLOC SMPTLIB         @Z67SP00*/ 00179000
         MVI   IOPFUNCT(IOPPTR),X'0D'                              0242 00180000
*           CALL HMASMIO(HMASMIOP); /* ALLOC DATASET         @Z67SP00*/ 00181000
         ST    IOPPTR,@AL00001                                     0243 00182000
         L     @15,@CV01377                                        0243 00183000
         LA    @01,@AL00001                                        0243 00184000
         BALR  @14,@15                                             0243 00185000
*           UPDRTNCD=MAX(UPDRTNCD,IOPRETRN);/* SAVE RC       @Z67SP00*/ 00186000
         SLR   @08,@08                                             0244 00187000
         IC    @08,UPDRTNCD                                        0244 00188000
         SLR   @07,@07                                             0244 00189000
         IC    @07,IOPRETRN(,IOPPTR)                               0244 00190000
         CR    @08,@07                                             0244 00191000
         BNL   *+6                                                      00192000
         LR    @08,@07                                             0244 00193000
         STC   @08,UPDRTNCD                                        0244 00194000
*           DDNAME=TXTLRF;          /* SET UP FOR MSG        @Z67SP00*/ 00195000
         MVC   DDNAME(8),@CC01420                                  0245 00196000
*           IF IOPRETRN=IOPGOOD     /* IF ALC OK             @Z67SP00*/ 00197000
*             THEN                  /* REMEMBER SO FREE      @Z67SP00*/ 00198000
         CLI   IOPRETRN(IOPPTR),0                                  0246 00199000
         BNE   @RF00246                                            0246 00200000
*             ALCDONE=ON;           /* CAN BE DONE           @Z67SP00*/ 00201000
         OI    ALCDONE,B'00010000'                                 0247 00202000
*         END;                      /* END RELFILE           @Z67SP00*/ 00203000
*       ELSE                        /* MUST BE TXTLIB        @Z67SP00*/ 00204000
*         DO;                       /*                       @Z67SP00*/ 00205000
         B     @RC00238                                            0249 00206000
@RF00238 DS    0H                                                  0250 00207000
*           IOPDDNAM=UPDDDNAM;      /* TO CORRECT DDNAME     @Z67SP00*/ 00208000
         L     @08,@PC00001                                        0250 00209000
         MVC   IOPDDNAM(8,IOPPTR),UPDDDNAM(@08)                    0250 00210000
*           DDNAME=UPDDDNAM;        /*                       @Z67SP00*/ 00211000
         MVC   DDNAME(8),UPDDDNAM(@08)                             0251 00212000
*         END;                      /*                       @Z67SP00*/ 00213000
*       IF IOPRETRN=IOPGOOD         /*                       @Z67SP00*/ 00214000
*         THEN                      /*                       @Z67SP00*/ 00215000
@RC00238 CLI   IOPRETRN(IOPPTR),0                                  0253 00216000
         BNE   @RF00253                                            0253 00217000
*         DO;                       /*                       @Z67SP00*/ 00218000
*           IOPNAME=BUPSYSMD;       /*                               */ 00219000
         MVI   IOPNAME+7(IOPPTR),C' '                              0255 00220000
         MVC   IOPNAME(7,IOPPTR),BUPSYSMD                          0255 00221000
*           IOPTYPE=IOPMEM;         /*                               */ 00222000
         MVI   IOPTYPE(IOPPTR),X'11'                               0256 00223000
*           IOPFUNCT=IOPBLDL;       /* NOW FIND MEMBER ON    @Z67SP00*/ 00224000
         MVI   IOPFUNCT(IOPPTR),X'04'                              0257 00225000
*           CALL HMASMIO(HMASMIOP); /* GET MEMBER            @Z67SP00*/ 00226000
         ST    IOPPTR,@AL00001                                     0258 00227000
         L     @15,@CV01377                                        0258 00228000
         LA    @01,@AL00001                                        0258 00229000
         BALR  @14,@15                                             0258 00230000
*           IF IOPRETRN=IOPGOOD     /* IF DATASET OPENED OK  @Z67SP00*/ 00231000
*             THEN                  /* AND MEMBER FOUND      @Z67SP00*/ 00232000
         CLI   IOPRETRN(IOPPTR),0                                  0259 00233000
         BNE   @RF00259                                            0259 00234000
*             DO;                   /* THEN POSITION TO READ @Z67SP00*/ 00235000
*               IOPFUNCT=IOPPOSI;   /* DATA                  @Z67SP00*/ 00236000
         MVI   IOPFUNCT(IOPPTR),X'02'                              0261 00237000
*               CALL HMASMIO(HMASMIOP);/*                    @Z67SP00*/ 00238000
         ST    IOPPTR,@AL00001                                     0262 00239000
         L     @15,@CV01377                                        0262 00240000
         LA    @01,@AL00001                                        0262 00241000
         BALR  @14,@15                                             0262 00242000
*             END;                  /*                       @Z67SP00*/ 00243000
*           ELSE                    /*                       @Z67SP00*/ 00244000
*             IF IOPRETRN=IOPNTFND  /* IF NOT FOUND          @Z67SP00*/ 00245000
*               THEN                /*                       @Z67SP00*/ 00246000
         B     @RC00259                                            0264 00247000
@RF00259 CLI   IOPRETRN(IOPPTR),4                                  0264 00248000
         BNE   @RF00264                                            0264 00249000
*               DO;                 /*                       @Z67SP00*/ 00250000
*                 MGPCLEAR=''B;     /*                       @Z67SP00*/ 00251000
         XC    MGPCLEAR(6),MGPCLEAR                                0266 00252000
*                 MGPMGNO1=HMA246I; /* XXXXXXXX XXXXXXXX NOT FOUND ON   00253000
*                                      XXXXXXXX LIBRARY      @Z67SP00*/ 00254000
         MVC   MGPMGNO1(2),@CH01388                                0267 00255000
*                 MGPVARPT(1)=ADDR(UPDSYSMD);/* SYSMOD NUMBER      0268 00256000
*                                                            @Z67SP00*/ 00257000
         L     @08,@PC00001                                        0268 00258000
         LA    @08,UPDSYSMD(,@08)                                  0268 00259000
         ST    @08,MGPVARPT                                        0268 00260000
*                 MGPVARPT(2)=ADDR(TXTJCLIN);/* JCLIN        @Z67SP00*/ 00261000
         LA    @08,@CC01422                                        0269 00262000
         ST    @08,MGPVARPT+4                                      0269 00263000
*                 MGPVARPT(3)=ADDR(DDNAME);/* LIBRARY DD NAME      0270 00264000
*                                                            @Z67SP00*/ 00265000
         LA    @08,DDNAME                                          0270 00266000
         ST    @08,MGPVARPT+8                                      0270 00267000
*                 MGPTYPE=MGPERR;   /*                       @Z67SP00*/ 00268000
         MVI   MGPTYPE,X'03'                                       0271 00269000
*                 CALL HMASMMSG(HMASMMGP);/* WRITE MSG       @Z67SP00*/ 00270000
         L     @15,@CV01383                                        0272 00271000
         LA    @01,@AL00272                                        0272 00272000
         BALR  @14,@15                                             0272 00273000
*                 UPDRTNCD=MAX(UPDRTNCD,STOPPTF);/* RC=8     @Z67SP00*/ 00274000
         SLR   @08,@08                                             0273 00275000
         IC    @08,UPDRTNCD                                        0273 00276000
         LA    @07,8                                               0273 00277000
         CR    @08,@07                                             0273 00278000
         BNL   *+6                                                      00279000
         LR    @08,@07                                             0273 00280000
         STC   @08,UPDRTNCD                                        0273 00281000
*               END;                /*                       @Z67SP00*/ 00282000
*         END;                      /* END DS ALLOCATED OK   @Z67SP00*/ 00283000
@RF00264 DS    0H                                                  0275 00284000
@RC00259 DS    0H                                                  0276 00285000
*       UPDRTNCD=MAX(UPDRTNCD,IOPRETRN);/*                   @Z67SP00*/ 00286000
@RF00253 SLR   @08,@08                                             0276 00287000
         IC    @08,UPDRTNCD                                        0276 00288000
         SLR   @07,@07                                             0276 00289000
         IC    @07,IOPRETRN(,IOPPTR)                               0276 00290000
         CR    @08,@07                                             0276 00291000
         BNL   *+6                                                      00292000
         LR    @08,@07                                             0276 00293000
         STC   @08,UPDRTNCD                                        0276 00294000
*       IF UPDRTNCD>=STOPPTF        /* BLDL OR POSI. IF ERR  @Z67SP00*/ 00295000
*         THEN                      /* THEN STOP PROCESS     @Z67SP00*/ 00296000
         CLI   UPDRTNCD,8                                          0277 00297000
         BNL   @RT00277                                            0277 00298000
*         GO TO TERMMSG;            /*                       @Z67SP00*/ 00299000
*     END;                          /*                       @Z67SP00*/ 00300000
         EJECT                                                          00301000
*                                                                  0280 00302000
*   /*****************************************************************/ 00303000
*   /*                                                               */ 00304000
*   /* READ SYSGEN TAPE AND INVOKE SCAN                              */ 00305000
*   /*                                                               */ 00306000
*   /*****************************************************************/ 00307000
*                                                                  0280 00308000
*   DO WHILE SCPRET=SCPGOOD;        /* PROCESS UNTIL EOF     @YA07506*/ 00309000
@RF00234 B     @DE00280                                            0280 00310000
@DL00280 DS    0H                                                  0281 00311000
*     IF EOFSW=ON                   /* HAS EOF BEEN FOUNC?           */ 00312000
*       THEN                        /* EOF ALREADY FOUND - EXIT      */ 00313000
         TM    EOFSW,B'10000000'                                   0281 00314000
         BO    @RT00281                                            0281 00315000
*       GO TO GOODEXIT;             /* WITH GOOD RETURN CODE         */ 00316000
*     UPDSW1=OFF;                   /* RESET SCAN SWITCHES   @YA05008*/ 00317000
         MVI   UPDSW1,B'00000000'                                  0283 00318000
*     UPDSW2=OFF;                   /* RESET SCAN SWITCHES   @YA05008*/ 00319000
         MVI   UPDSW2,B'00000000'                                  0284 00320000
*     IF SKIPREAD=OFF               /* IF OK TO READ                 */ 00321000
*       THEN                        /* READ SYSGEN TAPE RECORD       */ 00322000
         TM    SKIPREAD,B'01000000'                                0285 00323000
         BNZ   @RF00285                                            0285 00324000
*       DO;                                                        0286 00325000
*         CRPSCPAD=ADDR(HMASMSCP);  /* ADDR OF SCAN PARM     @Z67SP00*/ 00326000
         LA    @08,HMASMSCP                                        0287 00327000
         ST    @08,CRPSCPAD                                        0287 00328000
*         CALL HMASMCRD(HMASMCRP);  /* RECORD FROM SMPJCLIN  @Z67SP00*/ 00329000
         L     @15,@CV01379                                        0288 00330000
         LA    @01,@AL00288                                        0288 00331000
         BALR  @14,@15                                             0288 00332000
*         IF CRPRETRN=CRPGOOD       /* IF NEXT CARD READ     @Z67SP00*/ 00333000
*             &(CRPINDS=IOPPTS      /* FROM PTS AND ITS A    @Z67SP00*/ 00334000
*             &CRPBUFFR(1:2)='++')  /* CONTROL CARD THEN     @Z67SP00*/ 00335000
*           THEN                    /* TREAT AS IF END OF    @Z67SP00*/ 00336000
         CLI   CRPRETRN,0                                          0289 00337000
         BNE   @RF00289                                            0289 00338000
         CLI   CRPINDS,6                                           0289 00339000
         BNE   @RF00289                                            0289 00340000
         CLC   CRPBUFFR(2),@CC01487                                0289 00341000
         BNE   @RF00289                                            0289 00342000
*           CRPRETRN=CRPEOF;        /* FILE CONDITION        @Z67SP00*/ 00343000
         MVI   CRPRETRN,X'04'                                      0290 00344000
*         IF CRPRETRN>CRPEOF        /* GOOD I/O OPERATION?   @Z67SP00*/ 00345000
*           THEN                    /*                       @YA07506*/ 00346000
@RF00289 CLI   CRPRETRN,4                                          0291 00347000
         BNH   @RF00291                                            0291 00348000
*           DO;                     /*                       @Z67SP00*/ 00349000
*             UPDRTNCD=CRPRETRN;    /* SET BAD RC            @YA07506*/ 00350000
         IC    @08,CRPRETRN                                        0293 00351000
         STC   @08,UPDRTNCD                                        0293 00352000
*             GO TO TERMMSG;        /* EXIT BADLY            @YA07506*/ 00353000
         B     TERMMSG                                             0294 00354000
*           END;                    /*                       @YA07506*/ 00355000
*         IF CRPRETRN=CRPEOF        /* END OF FILE ON TAPE?  @YA07506*/ 00356000
*           THEN                    /* YES                   @SA75002*/ 00357000
@RF00291 CLI   CRPRETRN,4                                          0296 00358000
         BNE   @RF00296                                            0296 00359000
*           IF FRSTREAD=ON          /* AT LEAST ONE READ?    @SA75002*/ 00360000
*             THEN                  /* YES                   @SA75002*/ 00361000
         TM    FRSTREAD,B'00100000'                                0297 00362000
         BO    @RT00297                                            0297 00363000
*             GO TO GOODEXIT;       /* EXIT OK               @SA75002*/ 00364000
*           ELSE                    /* EOF ON FIRST READ     @SA75002*/ 00365000
*             DO;                   /*                       @YA07506*/ 00366000
*               UPDRTNCD=WARNPTF;   /* SET RC                @YA07506*/ 00367000
         MVI   UPDRTNCD,X'04'                                      0300 00368000
*               MGPCLEAR=''B;       /* ZERO MSG PARM         @Z40SP00*/ 00369000
         XC    MGPCLEAR(6),MGPCLEAR                                0301 00370000
*               MGPTYPE=MGPWARN;    /* SET SEVERITY          @MS00001*/ 00371000
         MVI   MGPTYPE,X'02'                                       0302 00372000
*               MGPMGNO1=HMA273I;   /* INPUT TEXT NOT FOUND  @YA12132*/ 00373000
         MVC   MGPMGNO1(2),@CH00353                                0303 00374000
*               CALL HMASMMSG(HMASMMGP);/* WRITE MSG         @YA12132*/ 00375000
         L     @15,@CV01383                                        0304 00376000
         LA    @01,@AL00304                                        0304 00377000
         BALR  @14,@15                                             0304 00378000
*               MGPTYPE=MGPINFO;    /* SET SEVERITY          @MS00001*/ 00379000
         MVI   MGPTYPE,X'01'                                       0305 00380000
*               MGPMGNO1=HMA288I;   /* NO HMASMP UPDATE FUNCTIONS  0306 00381000
*                                      HAVE BEEN PERFORMED   @YA12132*/ 00382000
         MVC   MGPMGNO1(2),@CH00557                                0306 00383000
*               CALL HMASMMSG(HMASMMGP);/* WRITE MSG         @Z40SP00*/ 00384000
         L     @15,@CV01383                                        0307 00385000
         LA    @01,@AL00307                                        0307 00386000
         BALR  @14,@15                                             0307 00387000
*               GO TO EXIT;         /* EXIT WITH ERR MSG     @SA75002*/ 00388000
         B     EXIT                                                0308 00389000
*             END;                  /*                       @YA07506*/ 00390000
*         FRSTREAD=ON;              /* SET DID ONE READ SW   @SA75002*/ 00391000
@RF00296 OI    FRSTREAD,B'00100000'                                0310 00392000
*       END;                                                       0311 00393000
*     ELSE                          /* OTHERWISE - RESET SKIP SWITCH */ 00394000
*       SKIPREAD=OFF;               /* RESET SO READ NEXT TIME       */ 00395000
         B     @RC00285                                            0312 00396000
@RF00285 NI    SKIPREAD,B'10111111'                                0312 00397000
*     BUFFER(1)=CRPBUFFR;           /* MOVE TO SCAN BUFFER   @Z67SP00*/ 00398000
@RC00285 L     @08,BUFRPTR                                         0313 00399000
         MVC   BUFFER(80,@08),CRPBUFFR                             0313 00400000
*     SCPCHAR=ADDR(CRPBUFFR);       /* POINT TO SCAN BUFFER  @ZA28056*/ 00401000
         LA    @08,CRPBUFFR                                        0314 00402000
         ST    @08,SCPCHAR                                         0314 00403000
*     SCPSRCH=ADDR(KSLBLNK);        /* SET FRST DSCAN ADDR   @Z67SP00*/ 00404000
         LA    @08,KSLBLNK                                         0315 00405000
         ST    @08,SCPSRCH                                         0315 00406000
*     SCPINLN=LENGTH(CRPBFDTA);     /* SET INPUT CARD LEN    @Z67SP00*/ 00407000
         MVC   SCPINLN(2),@CH01064                                 0316 00408000
*     CALL HMASMSCN(HMASMSCP);      /* SCAN JCL STATEMENT            */ 00409000
         L     @15,@CV01380                                        0317 00410000
         LA    @01,@AL00317                                        0317 00411000
         BALR  @14,@15                                             0317 00412000
*   END;                                                           0318 00413000
@DE00280 CLI   SCPRET,0                                            0318 00414000
         BE    @DL00280                                            0318 00415000
         EJECT                                                          00416000
*                                                                  0319 00417000
*   /*****************************************************************/ 00418000
*   /*                                                               */ 00419000
*   /* AN ERROR HAS OCCURRED. ISSUE MESSAGE INDICATING JOBNAME AND   */ 00420000
*   /* STEP NAME CONTAINING FAILING JCL                              */ 00421000
*   /*                                                               */ 00422000
*   /*****************************************************************/ 00423000
*                                                                  0319 00424000
*   MGPCLEAR=''B;                   /* ZERO MSG PARM         @Z67SP00*/ 00425000
         XC    MGPCLEAR(6),MGPCLEAR                                0319 00426000
*   MGPTYPE=MGPINFO;                /* SET SEVERITY          @MS00001*/ 00427000
         MVI   MGPTYPE,X'01'                                       0320 00428000
*   MGPVARPT(1)=ADDR(STEPNAME);     /* POINT TO STEPNAME             */ 00429000
         LA    @08,STEPNAME                                        0321 00430000
         ST    @08,MGPVARPT                                        0321 00431000
*   MGPVARPT(2)=ADDR(JOBNAME);      /* POINT TO JOBNAME              */ 00432000
         LA    @08,JOBNAME                                         0322 00433000
         ST    @08,MGPVARPT+4                                      0322 00434000
*   MGPMGNO1=HMA263I;               /* ERROR OCCURRED IN STEP      0323 00435000
*                                      XXXXXXXX OF JOB XXXXXXXX    0323 00436000
*                                                            @Z40SP00*/ 00437000
         MVC   MGPMGNO1(2),@CH01050                                0323 00438000
*   CALL HMASMMSG(HMASMMGP);        /* ISSUE MESSAGE                 */ 00439000
*                                                                  0324 00440000
         L     @15,@CV01383                                        0324 00441000
         LA    @01,@AL00324                                        0324 00442000
         BALR  @14,@15                                             0324 00443000
*   /*****************************************************************/ 00444000
*   /*                                                               */ 00445000
*   /* FOLLOWING CODE IS FOR FORCED TERMINATE MESSAGE                */ 00446000
*   /*                                                               */ 00447000
*   /*****************************************************************/ 00448000
*                                                                  0325 00449000
*TERMMSG:                           /*                       @OX05075*/ 00450000
*   MGPCLEAR=''B;                   /* ZERO MSG PARM         @Z67SP00*/ 00451000
TERMMSG  XC    MGPCLEAR(6),MGPCLEAR                                0325 00452000
*   MGPTYPE=MGPINFO;                /* SET SEVERITY          @MS00001*/ 00453000
         MVI   MGPTYPE,X'01'                                       0326 00454000
*   MGPMGNO1=HMA262I;               /* ERROR FORCES SYSGEN SCAN TO 0327 00455000
*                                      TERMINATE             @Z40SP00*/ 00456000
         MVC   MGPMGNO1(2),@CH00708                                0327 00457000
*   CALL HMASMMSG(HMASMMGP);        /* ISSUE MESSAGE                 */ 00458000
         L     @15,@CV01383                                        0328 00459000
         LA    @01,@AL00328                                        0328 00460000
         BALR  @14,@15                                             0328 00461000
         EJECT                                                          00462000
*                                                                  0329 00463000
*   /*****************************************************************/ 00464000
*   /*                                                               */ 00465000
*   /* MAJOR RETURN POINT FROM HMASMUPD                      @Z67SP00*/ 00466000
*   /*                                                               */ 00467000
*   /*****************************************************************/ 00468000
*                                                                  0329 00469000
*GOODEXIT:                          /*                       @YA07506*/ 00470000
*   BUPFUNCT=BUPSTOW;               /* STOW SCDS SYSMOD      @Z67SP00*/ 00471000
GOODEXIT MVI   BUPFUNCT,X'03'                                      0329 00472000
*   CALL HMASMBUE(BUPPARM);         /*                       @Z67SP00*/ 00473000
         L     @15,@CV01378                                        0330 00474000
         LA    @01,@AL00330                                        0330 00475000
         BALR  @14,@15                                             0330 00476000
*   UPDRTNCD=MAX(UPDRTNCD,RTNCODE); /* SAVE RC               @Z67SP00*/ 00477000
         SLR   @08,@08                                             0331 00478000
         IC    @08,UPDRTNCD                                        0331 00479000
         CR    @08,RTNCODE                                         0331 00480000
         BNL   *+6                                                      00481000
         LR    @08,RTNCODE                                         0331 00482000
         STC   @08,UPDRTNCD                                        0331 00483000
*EXIT:                                                             0332 00484000
*   IOPFUNCT=IOPCLOSE;              /* INDICATE CLOSE OPERATION      */ 00485000
EXIT     MVI   IOPFUNCT(IOPPTR),X'50'                              0332 00486000
*   IOPDSID=UPDDSID;                /*                       @Z67SP00*/ 00487000
         L     @08,@PC00001                                        0333 00488000
         IC    @07,UPDDSID(,@08)                                   0333 00489000
         STC   @07,IOPDSID(,IOPPTR)                                0333 00490000
*   CALL HMASMIO(HMASMIOP);         /* CLOSE SYSGEN TAPE             */ 00491000
         ST    IOPPTR,@AL00001                                     0334 00492000
         L     @15,@CV01377                                        0334 00493000
         LA    @01,@AL00001                                        0334 00494000
         BALR  @14,@15                                             0334 00495000
*   UPDRTNCD=MAX(UPDRTNCD,IOPRETRN);/* SAVE RC               @Z67SP00*/ 00496000
         SLR   @08,@08                                             0335 00497000
         IC    @08,UPDRTNCD                                        0335 00498000
         SLR   @07,@07                                             0335 00499000
         IC    @07,IOPRETRN(,IOPPTR)                               0335 00500000
         CR    @08,@07                                             0335 00501000
         BNL   *+6                                                      00502000
         LR    @08,@07                                             0335 00503000
         STC   @08,UPDRTNCD                                        0335 00504000
*   IF NXTBFRAD^=ZERO               /* HAS GETMAIN FOR JCL BUFFER    */ 00505000
*     THEN                          /* BEEN DONE.. YES , FREE IT     */ 00506000
         L     @08,NXTBFRAD                                        0336 00507000
         LTR   @08,@08                                             0336 00508000
         BZ    @RF00336                                            0336 00509000
*     DO;                                                          0337 00510000
*       RFY                                                        0338 00511000
*         SIZE RSTD;                /*                       @Z40SP00*/ 00512000
*       SIZE=MAXJCL*LENGTH(BUFFER); /* CALCULATE SIZE TO FREE        */ 00513000
         LH    SIZE,MAXJCL                                         0339 00514000
         MH    SIZE,@CH00539                                       0339 00515000
*       GEN(FREEMAIN E,LV=(SIZE),A=NXTBFRAD)                       0340 00516000
*       REFS(SIZE,NXTBFRAD);        /* FREE JCL BUFFER       @Z40SP00*/ 00517000
         FREEMAIN E,LV=(SIZE),A=NXTBFRAD                                00518000
*       RFY                                                        0341 00519000
*         SIZE UNRSTD;              /*                       @Z40SP00*/ 00520000
*       NXTBFRAD=ZERO;              /* KRESET BUFFER ADDRESS         */ 00521000
         SLR   @08,@08                                             0342 00522000
         ST    @08,NXTBFRAD                                        0342 00523000
*     END;                                                         0343 00524000
*                                                                  0343 00525000
*   /*****************************************************************/ 00526000
*   /*                                                               */ 00527000
*   /* IF RELFILE ALLOCATION DONE THEN CALL IO TO FREE IT    @Z67SP00*/ 00528000
*   /*                                                               */ 00529000
*   /*****************************************************************/ 00530000
*                                                                  0344 00531000
*   IF ALCDONE=ON                   /*                       @Z67SP00*/ 00532000
*     THEN                          /*                       @Z67SP00*/ 00533000
@RF00336 TM    ALCDONE,B'00010000'                                 0344 00534000
         BNO   @RF00344                                            0344 00535000
*     DO;                           /*                       @Z67SP00*/ 00536000
*       IOPFUNCT=IOPDALC;           /*                       @Z67SP00*/ 00537000
         MVI   IOPFUNCT(IOPPTR),X'0E'                              0346 00538000
*       IOPDSN=UPDDSNAM;            /*                       @Z67SP00*/ 00539000
         L     @08,@PC00001                                        0347 00540000
         MVC   IOPDSN(44,IOPPTR),UPDDSNAM(@08)                     0347 00541000
*       CALL HMASMIO(HMASMIOP);     /*                       @Z67SP00*/ 00542000
         ST    IOPPTR,@AL00001                                     0348 00543000
         L     @15,@CV01377                                        0348 00544000
         LA    @01,@AL00001                                        0348 00545000
         BALR  @14,@15                                             0348 00546000
*       UPDRTNCD=MAX(UPDRTNCD,IOPRETRN);/*                   @Z67SP00*/ 00547000
         SLR   @08,@08                                             0349 00548000
         IC    @08,UPDRTNCD                                        0349 00549000
         SLR   @07,@07                                             0349 00550000
         IC    @07,IOPRETRN(,IOPPTR)                               0349 00551000
         CR    @08,@07                                             0349 00552000
         BNL   *+6                                                      00553000
         LR    @08,@07                                             0349 00554000
         STC   @08,UPDRTNCD                                        0349 00555000
*     END;                          /*                       @Z67SP00*/ 00556000
*                                                                  0350 00557000
*   /*****************************************************************/ 00558000
*   /*                                                               */ 00559000
*   /* RETURN WITH CODE SET UPDURING PROCESSING              @Z67SP00*/ 00560000
*   /*                                                               */ 00561000
*   /*****************************************************************/ 00562000
*                                                                  0351 00563000
*   RETURN CODE(UPDRTNCD);          /* EXIT WITH RETURN CODE@YA07506 */ 00564000
@RF00344 SLR   @15,@15                                             0351 00565000
         IC    @15,UPDRTNCD                                        0351 00566000
         L     @13,4(,@13)                                         0351 00567000
         L     @14,12(,@13)                                        0351 00568000
         LM    @00,@12,20(@13)                                     0351 00569000
         BR    @14                                                 0351 00570000
         EJECT                                                          00571000
*                                                                  0352 00572000
*   /*****************************************************************/ 00573000
*   /*                                                               */ 00574000
*   /* ENTER HERE TO SAVE JOB AND STEP NAMES                         */ 00575000
*   /*                                                               */ 00576000
*   /*****************************************************************/ 00577000
*                                                                  0352 00578000
*RJOBNMV:                                                          0352 00579000
*   PROCEDURE;                                                     0352 00580000
@EL00001 L     @13,4(,@13)                                         0352 00581000
@EF00001 DS    0H                                                  0352 00582000
@ER00001 LM    @14,@12,12(@13)                                     0352 00583000
         BR    @14                                                 0352 00584000
RJOBNMV  STM   @14,@12,12(@13)                                     0352 00585000
*   IF SCPPMLN=ZERO                 /* IS LENGTH ZERO?               */ 00586000
*     THEN                          /* YES - MUST BUMP TO 1          */ 00587000
         LH    @08,SCPPMLN                                         0353 00588000
         LTR   @08,@08                                             0353 00589000
         BNZ   @RF00353                                            0353 00590000
*     SCPPMLN=ONE;                  /* SET TO 1 SO DONT LOOP HERE    */ 00591000
         MVC   SCPPMLN(2),@CH00054                                 0354 00592000
*   ELSE                                                           0355 00593000
*     IF SCPPMLN>MAXNAME            /* OR GREATER THAN MAX?          */ 00594000
*       THEN                        /*                       @Z40SP00*/ 00595000
         B     @RC00353                                            0355 00596000
@RF00353 LH    @08,SCPPMLN                                         0355 00597000
         C     @08,@CF00039                                        0355 00598000
         BNH   @RF00355                                            0355 00599000
*       NAMESAVE=SCPSTRNG(1:MAXNAME);/* SAVE PART            @Z40SP00*/ 00600000
         L     @08,SCPCHAR                                         0356 00601000
         MVC   NAMESAVE(8),SCPSTRNG(@08)                           0356 00602000
*     ELSE                          /* ELSE, SAVE THE NAME           */ 00603000
*       NAMESAVE=SCPSTRNG(1:SCPPMLN);/* SAVE JOB OR STEP NAME        */ 00604000
         B     @RC00355                                            0357 00605000
@RF00355 MVI   NAMESAVE+1,C' '                                     0357 00606000
         MVC   NAMESAVE+2(6),NAMESAVE+1                            0357 00607000
         LH    @08,SCPPMLN                                         0357 00608000
         BCTR  @08,0                                               0357 00609000
         L     @01,SCPCHAR                                         0357 00610000
         EX    @08,@SM01604                                        0357 00611000
*   SCPRET=SCPGOOD;                 /* INDICATE CONTINUE SCN@YA07506 */ 00612000
@RC00355 DS    0H                                                  0358 00613000
@RC00353 MVI   SCPRET,X'00'                                        0358 00614000
*   END RJOBNMV;                    /* RETURN                        */ 00615000
*                                                                  0359 00616000
@EL00002 DS    0H                                                  0359 00617000
@EF00002 DS    0H                                                  0359 00618000
@ER00002 LM    @14,@12,12(@13)                                     0359 00619000
         BR    @14                                                 0359 00620000
*   /*****************************************************************/ 00621000
*   /*                                                               */ 00622000
*   /* ENTER HERE TO SET DUMMY JOB OR STEP NAME IF NONE CODED ON JCL */ 00623000
*   /*                                                       @XA07937*/ 00624000
*   /*                                                               */ 00625000
*   /*****************************************************************/ 00626000
*                                                                  0360 00627000
*RSLBLNK:                           /*                       @XA07937*/ 00628000
*   PROCEDURE;                      /*                       @XA07937*/ 00629000
RSLBLNK  STM   @14,@12,12(@13)                                     0360 00630000
*   NAMESAVE=TXTNONAM;              /* SET DUMMY NAME        @XA07937*/ 00631000
         MVC   NAMESAVE(8),@CC01418                                0361 00632000
*   SCPRET=SCPGOOD;                 /* SET GOOD RC           @YA07506*/ 00633000
         MVI   SCPRET,X'00'                                        0362 00634000
*   END RSLBLNK;                    /* END PROC              @XA07937*/ 00635000
*                                                                  0363 00636000
@EL00003 DS    0H                                                  0363 00637000
@EF00003 DS    0H                                                  0363 00638000
@ER00003 LM    @14,@12,12(@13)                                     0363 00639000
         BR    @14                                                 0363 00640000
*   /*****************************************************************/ 00641000
*   /*                                                               */ 00642000
*   /* ENTER HERE TO INDICATE JOB KEYWORD FOUND AND SAVE JOBNAME     */ 00643000
*   /*                                                               */ 00644000
*   /*****************************************************************/ 00645000
*                                                                  0364 00646000
*RJOB:                                                             0364 00647000
*   PROCEDURE;                                                     0364 00648000
RJOB     STM   @14,@12,12(@13)                                     0364 00649000
*   JOBNAME=NAMESAVE;               /* PUT SAVED NAME IN JOBNAME     */ 00650000
         MVC   JOBNAME(8),NAMESAVE                                 0365 00651000
*   SCPRET=SCPGOOD;                 /* INDICATE SUCCESS      @YA07506*/ 00652000
         MVI   SCPRET,X'00'                                        0366 00653000
*   END RJOB;                       /* RETURN                        */ 00654000
@EL00004 DS    0H                                                  0367 00655000
@EF00004 DS    0H                                                  0367 00656000
@ER00004 LM    @14,@12,12(@13)                                     0367 00657000
         BR    @14                                                 0367 00658000
         EJECT                                                          00659000
*                                                                  0368 00660000
*   /*****************************************************************/ 00661000
*   /*                                                               */ 00662000
*   /* SCAN HAS ENCOUNTERED AN EXEC STATEMENT - READ AND SAVE JCL    */ 00663000
*   /*                                                               */ 00664000
*   /*****************************************************************/ 00665000
*                                                                  0368 00666000
*UPDEXC10:                                                         0368 00667000
*   PROCEDURE OPTIONS(SAVEAREA);                                   0368 00668000
UPDEXC10 STM   @14,@12,12(@13)                                     0368 00669000
         ST    @13,@SA00005+4                                      0368 00670000
         LA    @08,@SA00005                                        0368 00671000
         ST    @08,8(,@13)                                         0368 00672000
         LR    @13,@08                                             0368 00673000
*RASMS:                             /* ENTRY IF ASM TYPE STEP        */ 00674000
*RPIEUASM:                          /*                               */ 00675000
*RPIFOX00:                          /*                               */ 00676000
*RPASMBLR:                          /*                               */ 00677000
*RALTASM:                           /*                               */ 00678000
*   ENTRY;                          /* ENTRY IF ASM TYPE STEP        */ 00679000
         B     @EC00369                                            0369 00680000
RASMS    DS    0H                                                  0369 00681000
RPIEUASM DS    0H                                                  0369 00682000
RPIFOX00 DS    0H                                                  0369 00683000
RPASMBLR DS    0H                                                  0369 00684000
RALTASM  STM   @14,@12,12(@13)                                     0369 00685000
         ST    @13,@SA00005+4                                      0369 00686000
         LA    @08,@SA00005                                        0369 00687000
         ST    @08,8(,@13)                                         0369 00688000
         LR    @13,@08                                             0369 00689000
@EC00369 DS    0H                                                  0370 00690000
*   ASMSW=ON;                       /* SET ASM SW            @YA05008*/ 00691000
         OI    ASMSW,B'01000000'                                   0370 00692000
*   GO TO UPDEXC05;                 /* BRANCH ARND OTHER ENTRY       */ 00693000
         B     UPDEXC05                                            0371 00694000
*RLINKS:                            /* ENTRY IF LINK TYPE STEP       */ 00695000
*RPIEWL:                            /*                               */ 00696000
*RPHEWL:                            /*                               */ 00697000
*RALTLKED:                          /*                               */ 00698000
*   ENTRY;                          /* ENTRY IF LINK TYPE STEP       */ 00699000
RLINKS   DS    0H                                                  0372 00700000
RPIEWL   DS    0H                                                  0372 00701000
RPHEWL   DS    0H                                                  0372 00702000
RALTLKED STM   @14,@12,12(@13)                                     0372 00703000
         ST    @13,@SA00005+4                                      0372 00704000
         LA    @08,@SA00005                                        0372 00705000
         ST    @08,8(,@13)                                         0372 00706000
         LR    @13,@08                                             0372 00707000
*   LKDSW=ON;                       /* SET LKD SW            @YA05008*/ 00708000
         OI    LKDSW,B'00100000'                                   0373 00709000
*   GO TO UPDEXC05;                 /* BRANCH ARND OTHER ENTRY       */ 00710000
         B     UPDEXC05                                            0374 00711000
*RPCOPY:                            /* ENTRY IF COPY TYPE STEP       */ 00712000
*RALTCOPY:                          /*                               */ 00713000
*   ENTRY;                          /* ENTRY IF COPY TYPE STEP       */ 00714000
RPCOPY   DS    0H                                                  0375 00715000
RALTCOPY STM   @14,@12,12(@13)                                     0375 00716000
         ST    @13,@SA00005+4                                      0375 00717000
         LA    @08,@SA00005                                        0375 00718000
         ST    @08,8(,@13)                                         0375 00719000
         LR    @13,@08                                             0375 00720000
*   CPYSW=ON;                       /* SET CPY SW            @YA05008*/ 00721000
         OI    CPYSW,B'00010000'                                   0376 00722000
*   GO TO UPDEXC05;                 /* BRANCH ARND OTHER ENTRY       */ 00723000
         B     UPDEXC05                                            0377 00724000
*RPUPDTE:                           /* IEBUPDTE TYPE STEP    @YA05008*/ 00725000
*RALTUPDT:                          /*                               */ 00726000
*   ENTRY;                          /* IEBUPDTE TYPE STEP    @YA05008*/ 00727000
RPUPDTE  DS    0H                                                  0378 00728000
RALTUPDT STM   @14,@12,12(@13)                                     0378 00729000
         ST    @13,@SA00005+4                                      0378 00730000
         LA    @08,@SA00005                                        0378 00731000
         ST    @08,8(,@13)                                         0378 00732000
         LR    @13,@08                                             0378 00733000
*   UPDSW=ON;                       /* SET UPD SW            @YA05008*/ 00734000
         OI    UPDSW,B'10000000'                                   0379 00735000
*UPDEXC05:                                                         0380 00736000
*   SCPCHAR=SCPCHAR-SCPPMLN;        /* RESET PTR TO INSURE THAT THE     00737000
*                                      NEXT DSCAN WILL FIND AT LEAST    00738000
*                                      ONE VALID CHAR        @YA05008*/ 00739000
UPDEXC05 L     @08,SCPCHAR                                         0380 00740000
         SH    @08,SCPPMLN                                         0380 00741000
         ST    @08,SCPCHAR                                         0380 00742000
*   STEPNAME=NAMESAVE;              /* PUT SAVED NAME IN STEPNAME    */ 00743000
         MVC   STEPNAME(8),NAMESAVE                                0381 00744000
*   NUMJCL=2;                       /* SET STARTING LOOP VAL @Z67SP00*/ 00745000
         MVC   NUMJCL(2),@CH00067                                  0382 00746000
*JCLSAV:                                                           0383 00747000
*   DO NUMJCL=NUMJCL TO MAXJCL;     /* READ IN JCL STATEMENT @Z67SP00*/ 00748000
JCLSAV   LH    @08,NUMJCL                                          0383 00749000
         B     @DE00383                                            0383 00750000
@DL00383 DS    0H                                                  0384 00751000
*     CALL HMASMCRD(HMASMCRP);      /* READ NEXT RCD         @Z67SP00*/ 00752000
         L     @15,@CV01379                                        0384 00753000
         LA    @01,@AL00384                                        0384 00754000
         BALR  @14,@15                                             0384 00755000
*     IF CRPRETRN=CRPGOOD           /* IF NEXT CARD READ     @Z67SP00*/ 00756000
*         &CRPINDS=IOPPTS           /* FROM PTS AND ITS A    @Z67SP00*/ 00757000
*         &CRPBUFFR(1:2)='++'       /* CONTROL CARD THEN     @Z67SP00*/ 00758000
*       THEN                        /* TREAT AS IF END OF    @Z67SP00*/ 00759000
         CLI   CRPRETRN,0                                          0385 00760000
         BNE   @RF00385                                            0385 00761000
         CLI   CRPINDS,6                                           0385 00762000
         BNE   @RF00385                                            0385 00763000
         CLC   CRPBUFFR(2),@CC01487                                0385 00764000
         BNE   @RF00385                                            0385 00765000
*       CRPRETRN=CRPEOF;            /* FILE CONDITION        @Z67SP00*/ 00766000
         MVI   CRPRETRN,X'04'                                      0386 00767000
*     IF CRPRETRN^=CRPGOOD          /* GOOD RETURN?          @Z67SP00*/ 00768000
*       THEN                        /* NO - ERROR FOUND              */ 00769000
@RF00385 CLI   CRPRETRN,0                                          0387 00770000
         BE    @RF00387                                            0387 00771000
*       DO;                         /* TELL SCAN AND RETURN          */ 00772000
*         IF CRPRETRN=CRPEOF        /* END OF FILE?          @Z67SP00*/ 00773000
*           THEN                    /* YES - INDICATE FOUND          */ 00774000
         CLI   CRPRETRN,4                                          0389 00775000
         BNE   @RF00389                                            0389 00776000
*           DO;                     /* INDICATE STOP                 */ 00777000
*             SCPRET=SCPNDSCN;      /* INDICATE STOP SCAN    @YA07506*/ 00778000
         MVI   SCPRET,X'04'                                        0391 00779000
*             EOFSW=ON;             /* INDICATE EOF FOUND            */ 00780000
         OI    EOFSW,B'10000000'                                   0392 00781000
*           END;                                                   0393 00782000
*         ELSE                      /* OTHERWISE - BAD ERROR         */ 00783000
*           SCPRET=CRPRETRN;        /* INDICATE ERROR        @YA07506*/ 00784000
         B     @RC00389                                            0394 00785000
@RF00389 IC    @08,CRPRETRN                                        0394 00786000
         STC   @08,SCPRET                                          0394 00787000
*         RETURN;                   /* EXIT TO EFFECT ERROR          */ 00788000
@EL00005 L     @13,4(,@13)                                         0395 00789000
@EF00005 DS    0H                                                  0395 00790000
@ER00005 LM    @14,@12,12(@13)                                     0395 00791000
         BR    @14                                                 0395 00792000
*       END;                                                       0396 00793000
*     BUFFER(NUMJCL)=CRPBUFFR;      /* MOVE RCD TO BUFFER    @Z67SP00*/ 00794000
@RF00387 L     @08,BUFRPTR                                         0397 00795000
         LH    @07,NUMJCL                                          0397 00796000
         MH    @07,@CH00539                                        0397 00797000
         ST    @07,@TF00001                                        0397 00798000
         ALR   @07,@08                                             0397 00799000
         AL    @07,@CF01607                                        0397 00800000
         MVC   BUFFER(80,@07),CRPBUFFR                             0397 00801000
*                                                                  0398 00802000
*     /***************************************************************/ 00803000
*     /*                                                             */ 00804000
*     /* SEARCH INPUT FOR IEBUPDTE INPUT AND SKIP OVER IT    @YA05008*/ 00805000
*     /*                                                             */ 00806000
*     /***************************************************************/ 00807000
*                                                                  0398 00808000
*     IF(BUFFER(NUMJCL,1:8)=SYSIN&UPDSW=ON)/* UPDTE SYSIN?   @Z67SP00*/ 00809000
*         |CONTSW=ON                /* OR CONTINUATION CARD  @YA05008*/ 00810000
*       THEN                        /* YES                   @YA05008*/ 00811000
         AL    @08,@TF00001                                        0398 00812000
         AL    @08,@CF01607                                        0398 00813000
         CLC   BUFFER(8,@08),@CC01416                              0398 00814000
         BNE   @GL00006                                            0398 00815000
         TM    UPDSW,B'10000000'                                   0398 00816000
         BO    @RT00398                                            0398 00817000
@GL00006 TM    CONTSW,B'10000000'                                  0398 00818000
         BNO   @RF00398                                            0398 00819000
@RT00398 DS    0H                                                  0399 00820000
*       DO;                         /* SCAN IT               @YA05008*/ 00821000
*         CONTSW=OFF;               /* SET TO NOT CONTINUATION     0400 00822000
*                                                            @YA05008*/ 00823000
         NI    CONTSW,B'01111111'                                  0400 00824000
*         K=3;                      /* STARTING SCAN COLUMN  @YA05008*/ 00825000
         LA    @08,3                                               0401 00826000
         ST    @08,K                                               0401 00827000
*         IF DDSW=OFF               /* ALREADY HIT DD        @YA05008*/ 00828000
*           THEN                    /* NO THEN LOOK FOR IT   @YA05008*/ 00829000
         TM    DDSW,B'01000000'                                    0402 00830000
         BNZ   @RF00402                                            0402 00831000
*           DO;                     /*                       @YA05008*/ 00832000
*             DO K=K TO UPDTLRCL;   /* SCAN THRU COLUMN 72   @YA05008*/ 00833000
         B     @DE00404                                            0404 00834000
@DL00404 DS    0H                                                  0405 00835000
*               IF BUFFER(NUMJCL,K:K+2)=DD/* HIT DD?         @Z67SP00*/ 00836000
*                 THEN              /* YES                   @YA05008*/ 00837000
         LH    @07,NUMJCL                                          0405 00838000
         MH    @07,@CH00539                                        0405 00839000
         ALR   @07,@08                                             0405 00840000
         L     @01,BUFRPTR                                         0405 00841000
         ALR   @01,@07                                             0405 00842000
         AL    @01,@CF01609                                        0405 00843000
         CLC   BUFFER(3,@01),@CC01414                              0405 00844000
         BNE   @RF00405                                            0405 00845000
*                 DO;               /*                       @YA05008*/ 00846000
*                   DDSW=ON;        /* SET FOUND DD SW       @YA05008*/ 00847000
         OI    DDSW,B'01000000'                                    0407 00848000
*                   K=K+3;          /* INCR PTR TO NEXT BYTE @YA05008*/ 00849000
         AL    @08,@CF00046                                        0408 00850000
         ST    @08,K                                               0408 00851000
*                   GO TO UPDT010;  /* BRANCH OUT OF DD SCAN @YA05008*/ 00852000
         B     UPDT010                                             0409 00853000
*                 END;              /* END FOUND DD GROUP    @YA05008*/ 00854000
*             END;                  /* END DD SEARCH GROUP   @YA05008*/ 00855000
@RF00405 LA    @08,1                                               0411 00856000
         AL    @08,K                                               0411 00857000
         ST    @08,K                                               0411 00858000
@DE00404 C     @08,@CF00860                                        0411 00859000
         BNH   @DL00404                                            0411 00860000
*             NUMJCL=NUMJCL-1;      /* SET BUFFER INDEX TO USE     0412 00861000
*                                                            @Z67SP00*/ 00862000
         LH    @08,NUMJCL                                          0412 00863000
         BCTR  @08,0                                               0412 00864000
         STH   @08,NUMJCL                                          0412 00865000
*             CONTSW=ON;            /* SAME AREA AGAIN       @YA05008*/ 00866000
         OI    CONTSW,B'10000000'                                  0413 00867000
*             GO TO JCLSCN30;       /* GET NEXT CARD         @YA05008*/ 00868000
         B     JCLSCN30                                            0414 00869000
*           END;                    /* END DD OFF LOOP       @YA05008*/ 00870000
*UPDT010:                           /*                       @YA05008*/ 00871000
*         IF DLMSW=OFF              /* DLM KEYWORD FOUND?    @YA05008*/ 00872000
*           THEN                    /* NO                    @YA05008*/ 00873000
@RF00402 DS    0H                                                  0416 00874000
UPDT010  TM    DLMSW,B'00100000'                                   0416 00875000
         BNZ   @RF00416                                            0416 00876000
*           DO;                     /* SCAN FOR IT           @YA05008*/ 00877000
*             DO K=K TO UPDTLRCL WHILE BUFFER(NUMJCL,K)=BLANK;/* LOOP   00878000
*                                      THRU CARD LOOKING FOR FIRST 0418 00879000
*                                      NON BLANK AFTER DD CHARACTERS    00880000
*                                                            @Z40SP00*/ 00881000
         L     @08,K                                               0418 00882000
         B     @DE00418                                            0418 00883000
@DL00418 LH    @07,NUMJCL                                          0418 00884000
         MH    @07,@CH00539                                        0418 00885000
         ALR   @07,@08                                             0418 00886000
         L     @01,BUFRPTR                                         0418 00887000
         ALR   @01,@07                                             0418 00888000
         AL    @01,@CF01609                                        0418 00889000
         CLI   BUFFER(@01),C' '                                    0418 00890000
         BNE   @DC00418                                            0418 00891000
*             END;                  /* END BLANK SEARCH      @Z40SP00*/ 00892000
         AL    @08,@CF00054                                        0419 00893000
         ST    @08,K                                               0419 00894000
@DE00418 C     @08,@CF00860                                        0419 00895000
         BNH   @DL00418                                            0419 00896000
@DC00418 DS    0H                                                  0420 00897000
*             DO K=K TO UPDTLRCL WHILE BUFFER(NUMJCL,K)^=' ';/* AT 0420 00898000
*                                      THIS POINT K IS INDEX TO FIRST   00899000
*                                      NON-BLANK AFTER DD KEYWORD  0420 00900000
*                                                            @Z40SP00*/ 00901000
         L     @08,K                                               0420 00902000
         B     @DE00420                                            0420 00903000
@DL00420 L     @07,BUFRPTR                                         0420 00904000
         LH    @06,NUMJCL                                          0420 00905000
         MH    @06,@CH00539                                        0420 00906000
         ALR   @06,@08                                             0420 00907000
         ST    @06,@TF00001                                        0420 00908000
         ALR   @06,@07                                             0420 00909000
         AL    @06,@CF01609                                        0420 00910000
         CLI   BUFFER(@06),C' '                                    0420 00911000
         BE    @DC00420                                            0420 00912000
*               DLMSW=ON;           /* SET TO FIUND DLM      @YA05008*/ 00913000
         OI    DLMSW,B'00100000'                                   0421 00914000
*               IF BUFFER(NUMJCL,K:K+2)='DSN'/* DSNAME HIT   @YA05008*/ 00915000
*                 THEN              /* YES - SKIP CARD       @YA05008*/ 00916000
         LR    @08,@07                                             0422 00917000
         AL    @08,@TF00001                                        0422 00918000
         AL    @08,@CF01609                                        0422 00919000
         CLC   BUFFER(3,@08),@CC01568                              0422 00920000
         BE    @RT00422                                            0422 00921000
*                 GO TO JCLSCN30;   /*                       @YA05008*/ 00922000
*               IF BUFFER(NUMJCL,K)='*'/* DD * TYPE INPUT?   @YA05008*/ 00923000
*                 THEN              /* YES                   @YA05008*/ 00924000
         AL    @07,@TF00001                                        0424 00925000
         AL    @07,@CF01609                                        0424 00926000
         CLI   BUFFER(@07),C'*'                                    0424 00927000
         BNE   @RF00424                                            0424 00928000
*                 ASTFSW=ON;        /* SET SW                @YA05008*/ 00929000
         OI    ASTFSW,B'00010000'                                  0425 00930000
*               IF BUFFER(NUMJCL,K:K+3)='DATA'/* DD DATA?    @Z67SP00*/ 00931000
*                 THEN              /* YES                   @YA05008*/ 00932000
@RF00424 LH    @08,NUMJCL                                          0426 00933000
         MH    @08,@CH00539                                        0426 00934000
         AL    @08,K                                               0426 00935000
         L     @01,BUFRPTR                                         0426 00936000
         ALR   @01,@08                                             0426 00937000
         AL    @01,@CF01609                                        0426 00938000
         CLC   BUFFER(4,@01),@CC01569                              0426 00939000
         BNE   @RF00426                                            0426 00940000
*                 DATAFSW=ON;       /* SET SW                @YA05008*/ 00941000
         OI    DATAFSW,B'00001000'                                 0427 00942000
*               IF BUFFER(NUMJCL,K:K+3)='DLM='/* DLM KEYWORD?      0428 00943000
*                                                            @Z67SP00*/ 00944000
*                 THEN              /* YES                   @YA05008*/ 00945000
@RF00426 L     @08,BUFRPTR                                         0428 00946000
         LH    @07,NUMJCL                                          0428 00947000
         MH    @07,@CH00539                                        0428 00948000
         AL    @07,K                                               0428 00949000
         ST    @07,@TF00001                                        0428 00950000
         ALR   @07,@08                                             0428 00951000
         AL    @07,@CF01609                                        0428 00952000
         CLC   BUFFER(4,@07),@CC01570                              0428 00953000
         BNE   @RF00428                                            0428 00954000
*                 DO;               /*                       @YA05008*/ 00955000
*                   DLMFSW=ON;      /* SET SW                @YA05008*/ 00956000
*                   ASTFSW=OFF;     /* RESET AST SW          @YA05008*/ 00957000
*                   DATAFSW=OFF;    /* RESET DATA SW         @YA05008*/ 00958000
         OI    DLMFSW,B'00000100'                                  0432 00959000
         NI    ASTFSW,B'11100111'                                  0432 00960000
*                   DLM=BUFFER(NUMJCL,K+4:K+5);/* SAVE DLM   @Z67SP00*/ 00961000
         AL    @08,@TF00001                                        0433 00962000
         AL    @08,@CF01611                                        0433 00963000
         MVC   DLM(2),BUFFER(@08)                                  0433 00964000
*                   GO TO UPDT030;  /* BR OUT OF SEARCH      @YA05008*/ 00965000
         B     UPDT030                                             0434 00966000
*                 END;              /* END DLM FOUND         @YA05008*/ 00967000
*             END;                  /* END BUFFER LOOP       @YA05008*/ 00968000
@RF00428 LA    @08,1                                               0436 00969000
         AL    @08,K                                               0436 00970000
         ST    @08,K                                               0436 00971000
@DE00420 C     @08,@CF00860                                        0436 00972000
         BNH   @DL00420                                            0436 00973000
@DC00420 DS    0H                                                  0437 00974000
*             IF BUFFER(NUMJCL,K-1)=','/* CONTINUATION?      @Z67SP00*/ 00975000
*               THEN                /* YES                   @YA05008*/ 00976000
         LH    @08,NUMJCL                                          0437 00977000
         MH    @08,@CH00539                                        0437 00978000
         AL    @08,K                                               0437 00979000
         L     @01,BUFRPTR                                         0437 00980000
         ALR   @01,@08                                             0437 00981000
         AL    @01,@CF01612                                        0437 00982000
         CLI   BUFFER(@01),C','                                    0437 00983000
         BNE   @RF00437                                            0437 00984000
*               DLMSW=OFF;          /* KRESET SW TO GO THRU NXT    0438 00985000
*                                                            @YA05008*/ 00986000
         NI    DLMSW,B'11011111'                                   0438 00987000
*             GO TO UPDT030;        /* GET NEXT CARD         @YA05008*/ 00988000
         B     UPDT030                                             0439 00989000
*           END;                    /* END DLM SEARCH        @YA05008*/ 00990000
*         IF(ASTFSW=ON&(BUFFER(NUMJCL,1:2)^=SLASHAST&/*      @Z67SP00*/ 00991000
*             BUFFER(NUMJCL,1:2)^=SLASHES))/*                @Z67SP00*/ 00992000
*             |(DATAFSW=ON&BUFFER(NUMJCL,1:2)^=SLASHAST)/*   @Z67SP00*/ 00993000
*             |(DLMFSW=ON&BUFFER(NUMJCL,1:2)^=DLM)/* EOF     @Z67SP00*/ 00994000
*           THEN                    /* NO                    @YA05008*/ 00995000
@RF00416 TM    ASTFSW,B'00010000'                                  0441 00996000
         BNO   @GL00009                                            0441 00997000
         L     @08,BUFRPTR                                         0441 00998000
         LH    @07,NUMJCL                                          0441 00999000
         MH    @07,@CH00539                                        0441 01000000
         ST    @07,@TF00001                                        0441 01001000
         ALR   @07,@08                                             0441 01002000
         AL    @07,@CF01607                                        0441 01003000
         CLC   BUFFER(2,@07),@CC01431                              0441 01004000
         BE    @GL00009                                            0441 01005000
         AL    @08,@TF00001                                        0441 01006000
         AL    @08,@CF01607                                        0441 01007000
         CLC   BUFFER(2,@08),@CC01429                              0441 01008000
         BNE   @RT00441                                            0441 01009000
@GL00009 TM    DATAFSW,B'00001000'                                 0441 01010000
         BNO   @GL00008                                            0441 01011000
         LH    @08,NUMJCL                                          0441 01012000
         MH    @08,@CH00539                                        0441 01013000
         L     @01,BUFRPTR                                         0441 01014000
         ALR   @01,@08                                             0441 01015000
         AL    @01,@CF01607                                        0441 01016000
         CLC   BUFFER(2,@01),@CC01431                              0441 01017000
         BNE   @RT00441                                            0441 01018000
@GL00008 TM    DLMFSW,B'00000100'                                  0441 01019000
         BNO   @RF00441                                            0441 01020000
         LH    @08,NUMJCL                                          0441 01021000
         MH    @08,@CH00539                                        0441 01022000
         L     @01,BUFRPTR                                         0441 01023000
         ALR   @01,@08                                             0441 01024000
         AL    @01,@CF01607                                        0441 01025000
         CLC   BUFFER(2,@01),DLM                                   0441 01026000
         BE    @RF00441                                            0441 01027000
@RT00441 DS    0H                                                  0442 01028000
*           DO;                     /*                       @YA05008*/ 01029000
*UPDT030:                           /*                       @YA05008*/ 01030000
*             NUMJCL=NUMJCL-1;      /* SET TO REUSE SAME BUFFER    0443 01031000
*                                                            @Z67SP00*/ 01032000
UPDT030  LH    @08,NUMJCL                                          0443 01033000
         BCTR  @08,0                                               0443 01034000
         STH   @08,NUMJCL                                          0443 01035000
*             CONTSW=ON;            /* SET TO COME THRU AGAIN      0444 01036000
*                                                            @YA05008*/ 01037000
         OI    CONTSW,B'10000000'                                  0444 01038000
*             GO TO JCLSCN30;       /* GET NEXT CARD         @YA05008*/ 01039000
         B     JCLSCN30                                            0445 01040000
*           END;                    /*                       @YA05008*/ 01041000
*         IF ASTFSW=ON&BUFFER(NUMJCL,1:2)=SLASHES/* NEXT JCL @Z67SP00*/ 01042000
*           THEN                    /* FOR DD * TYPE INPUT?  @YA05008*/ 01043000
@RF00441 TM    ASTFSW,B'00010000'                                  0447 01044000
         BNO   @RF00447                                            0447 01045000
         L     @08,BUFRPTR                                         0447 01046000
         LH    @07,NUMJCL                                          0447 01047000
         MH    @07,@CH00539                                        0447 01048000
         ST    @07,@TF00001                                        0447 01049000
         ALR   @07,@08                                             0447 01050000
         AL    @07,@CF01607                                        0447 01051000
         CLC   BUFFER(2,@07),@CC01429                              0447 01052000
         BNE   @RF00447                                            0447 01053000
*           DO;                     /* YES - WANT TO SCAN IT @YA05008*/ 01054000
*             BUFFER(1)=BUFFER(NUMJCL);/* MOVE TO TOP OF BUF @Z67SP00*/ 01055000
         LR    @01,@08                                             0449 01056000
         AL    @01,@TF00001                                        0449 01057000
         AL    @01,@CF01607                                        0449 01058000
         MVC   @TS00001(80),BUFFER(@01)                            0449 01059000
         MVC   BUFFER(80,@08),@TS00001                             0449 01060000
*             SKIPREAD=ON;          /* SET TO SKIP NEXT READ @YA05008*/ 01061000
         OI    SKIPREAD,B'01000000'                                0450 01062000
*           END;                    /*                       @YA05008*/ 01063000
*         SCPRET=SCPNDSCN;          /* HIT END OF SYSIN      @YA07506*/ 01064000
@RF00447 MVI   SCPRET,X'04'                                        0452 01065000
*         RETURN;                   /* RETURN TO SCAN        @YA05008*/ 01066000
         B     @EL00005                                            0453 01067000
*       END;                        /*                       @YA05008*/ 01068000
*     IF BUFFER(NUMJCL,1:2)^=SLASHES/* END OF JCL?           @Z67SP00*/ 01069000
*       THEN                                                       0455 01070000
@RF00398 LH    @08,NUMJCL                                          0455 01071000
         MH    @08,@CH00539                                        0455 01072000
         L     @01,BUFRPTR                                         0455 01073000
         ALR   @01,@08                                             0455 01074000
         AL    @01,@CF01607                                        0455 01075000
         CLC   BUFFER(2,@01),@CC01429                              0455 01076000
         BNE   @RT00455                                            0455 01077000
*       GO TO UPDEXC20;             /* YES - EXIT FROM LOOP          */ 01078000
*JCLSCN05:                          /*                       @YA05008*/ 01079000
*                                                                  0457 01080000
*     /***************************************************************/ 01081000
*     /*                                                             */ 01082000
*     /* SCAN JCL STATEMENT FOR POSSIBLE JOB OR EXEC                 */ 01083000
*     /*                                                             */ 01084000
*     /***************************************************************/ 01085000
*                                                                  0457 01086000
*     J=3;                          /* SET BLANK START POSITION      */ 01087000
JCLSCN05 MVC   J(2),@CH00046                                       0457 01088000
*     IF BUFFER(NUMJCL,3)^=BLANK    /* IS THERE A LABEL      @Z67SP00*/ 01089000
*       THEN                        /* YES - SKIP PAST IT            */ 01090000
         LH    @08,NUMJCL                                          0458 01091000
         MH    @08,@CH00539                                        0458 01092000
         L     @01,BUFRPTR                                         0458 01093000
         ALR   @01,@08                                             0458 01094000
         AL    @01,@CF01614                                        0458 01095000
         CLI   BUFFER(@01),C' '                                    0458 01096000
         BE    @RF00458                                            0458 01097000
*       DO;                                                        0459 01098000
*         DO J=4 TO LENGTH(CRPBFDTA);/* SCAN FOR BLANK CHAR  @Z67SP00*/ 01099000
         LA    @08,4                                               0460 01100000
         STH   @08,J                                               0460 01101000
@DL00460 DS    0H                                                  0461 01102000
*           IF BUFFER(NUMJCL,J)=BLANK/* IS THIS CHAR BLANK   @Z67SP00*/ 01103000
*             THEN                  /* YES - JUMP OUT                */ 01104000
         LH    @07,NUMJCL                                          0461 01105000
         MH    @07,@CH00539                                        0461 01106000
         ALR   @07,@08                                             0461 01107000
         L     @01,BUFRPTR                                         0461 01108000
         ALR   @01,@07                                             0461 01109000
         AL    @01,@CF01609                                        0461 01110000
         CLI   BUFFER(@01),C' '                                    0461 01111000
         BE    @RT00461                                            0461 01112000
*             GO TO JCLSCN10;       /* EXIT WITH BLANK FOUND         */ 01113000
*         END;                                                     0463 01114000
         AL    @08,@CF00054                                        0463 01115000
         STH   @08,J                                               0463 01116000
         C     @08,@CF01064                                        0463 01117000
         BNH   @DL00460                                            0463 01118000
*         GO TO JCLSCN30;           /* SKIP STATEMENT IF FALL THRU   */ 01119000
         B     JCLSCN30                                            0464 01120000
*       END;                                                       0465 01121000
*JCLSCN10:                                                         0466 01122000
*     DO J=J+1 TO LENGTH(CRPBFDTA); /* SCAN FOR NON-BLANK    @Z67SP00*/ 01123000
@RF00458 DS    0H                                                  0466 01124000
JCLSCN10 LA    @08,1                                               0466 01125000
         AH    @08,J                                               0466 01126000
         B     @DE00466                                            0466 01127000
@DL00466 DS    0H                                                  0467 01128000
*       IF BUFFER(NUMJCL,J)^=BLANK  /* IS THIS NON=BLANK     @Z67SP00*/ 01129000
*         THEN                      /* YES - EXIT FROM LOOP          */ 01130000
         LH    @07,NUMJCL                                          0467 01131000
         MH    @07,@CH00539                                        0467 01132000
         ALR   @07,@08                                             0467 01133000
         L     @01,BUFRPTR                                         0467 01134000
         ALR   @01,@07                                             0467 01135000
         AL    @01,@CF01609                                        0467 01136000
         CLI   BUFFER(@01),C' '                                    0467 01137000
         BNE   @RT00467                                            0467 01138000
*         GO TO JCLSCN20;           /* QUIT CHECKING                 */ 01139000
*     END;                                                         0469 01140000
         AL    @08,@CF00054                                        0469 01141000
@DE00466 STH   @08,J                                               0469 01142000
         C     @08,@CF01064                                        0469 01143000
         BNH   @DL00466                                            0469 01144000
*     GO TO JCLSCN30;               /* SKIP STATEMENT                */ 01145000
         B     JCLSCN30                                            0470 01146000
*JCLSCN20:                                                         0471 01147000
*     IF BUFFER(NUMJCL,J:J+LENGTH(JOB)-1)=JOB/* IS THIS JOB  @Z67SP00*/ 01148000
*         |BUFFER(NUMJCL,J:J+LENGTH(EXEC)-1)=EXEC/* OR EXEC  @Z67SP00*/ 01149000
*       THEN                        /* YES - NEW JOB OR STEP         */ 01150000
JCLSCN20 L     @08,BUFRPTR                                         0471 01151000
         LH    @07,NUMJCL                                          0471 01152000
         MH    @07,@CH00539                                        0471 01153000
         AH    @07,J                                               0471 01154000
         ST    @07,@TF00001                                        0471 01155000
         ALR   @07,@08                                             0471 01156000
         AL    @07,@CF01609                                        0471 01157000
         CLC   BUFFER(4,@07),@CC01410                              0471 01158000
         BE    @RT00471                                            0471 01159000
         AL    @08,@TF00001                                        0471 01160000
         AL    @08,@CF01609                                        0471 01161000
         CLC   BUFFER(5,@08),@CC01412                              0471 01162000
         BNE   @RF00471                                            0471 01163000
@RT00471 DS    0H                                                  0472 01164000
*       DO;                                                        0472 01165000
*         BUFFER(1)=BUFFER(NUMJCL); /* MOVE RECORD TO HEAD   @Z67SP00*/ 01166000
         L     @08,BUFRPTR                                         0473 01167000
         LH    @07,NUMJCL                                          0473 01168000
         MH    @07,@CH00539                                        0473 01169000
         ALR   @07,@08                                             0473 01170000
         AL    @07,@CF01607                                        0473 01171000
         MVC   @TS00001(80),BUFFER(@07)                            0473 01172000
         MVC   BUFFER(80,@08),@TS00001                             0473 01173000
*         SKIPREAD=ON;              /* INDICATE SKIP NEXT READ       */ 01174000
         OI    SKIPREAD,B'01000000'                                0474 01175000
*         SCPRET=SCPNDSCN;          /* INDICATE STOP SCAN    @YA07506*/ 01176000
         MVI   SCPRET,X'04'                                        0475 01177000
*         RETURN;                   /* RETURN TO CONTINUE SCAN       */ 01178000
         B     @EL00005                                            0476 01179000
*       END;                                                       0477 01180000
*JCLSCN30:                                                         0478 01181000
*   END;                                                           0478 01182000
@RF00471 DS    0H                                                  0478 01183000
JCLSCN30 LA    @08,1                                               0478 01184000
         AH    @08,NUMJCL                                          0478 01185000
         STH   @08,NUMJCL                                          0478 01186000
@DE00383 CH    @08,MAXJCL                                          0478 01187000
         BNH   @DL00383                                            0478 01188000
*                                                                  0479 01189000
*   /*****************************************************************/ 01190000
*   /*                                                               */ 01191000
*   /* GET STORAGE FOR NEW JCL BUFFER AND FREE OLD IF GOTTEN         */ 01192000
*   /*                                                               */ 01193000
*   /*****************************************************************/ 01194000
*                                                                  0479 01195000
*JCLBUFGM:                          /* GET NEW JCL BUFFER    @YP12114*/ 01196000
*   RFY                                                            0479 01197000
*     SIZE RSTD;                    /*                       @Z40SP00*/ 01198000
JCLBUFGM DS    0H                                                  0480 01199000
*   SIZE=(MAXJCL+INCR)*LENGTH(BUFFER);/* CALCULATE SIZE OF BUFFER    */ 01200000
         LA    SIZE,25                                             0480 01201000
         AH    SIZE,MAXJCL                                         0480 01202000
         MH    SIZE,@CH00539                                       0480 01203000
*   GEN(GETMAIN EC,LV=(SIZE),A=NXTBFRAD)                           0481 01204000
*   REFS(SIZE,NXTBFRAD);            /* GET STORAGE FOR BFR   @Z40SP00*/ 01205000
         GETMAIN EC,LV=(SIZE),A=NXTBFRAD                                01206000
*   RFY                                                            0482 01207000
*     SIZE UNRSTD;                  /*                       @Z40SP00*/ 01208000
*   IF RTNCODE^=ZERO                /* WAS STORAGE AVAIL?    @Z40SP00*/ 01209000
*     THEN                          /* NO - ISSUE MESSAGE AND EXIT   */ 01210000
         SLR   @08,@08                                             0483 01211000
         CR    RTNCODE,@08                                         0483 01212000
         BE    @RF00483                                            0483 01213000
*     DO;                                                          0484 01214000
*       MGPTYPE=MGPSEV;             /* SET SEVERITY          @MS00001*/ 01215000
         MVI   MGPTYPE,X'04'                                       0485 01216000
*       MGPMGNO1=HMA202I;           /* UNABLE TO OBTAIN STORAGE FOR     01217000
*                                      WORK AREAS            @Z40SP00*/ 01218000
         MVC   MGPMGNO1(2),@CH00046                                0486 01219000
*       MGPMGNO2=ZERO;              /* ZERO SECONDARY                */ 01220000
         STH   @08,MGPMGNO2                                        0487 01221000
*       CALL HMASMMSG(HMASMMGP);    /* WRITE ERROR MESSAGE           */ 01222000
         L     @15,@CV01383                                        0488 01223000
         LA    @01,@AL00488                                        0488 01224000
         BALR  @14,@15                                             0488 01225000
*       SCPRET=STOPFUNC;            /* INDICATE SCAN ERROR   @YA07506*/ 01226000
         MVI   SCPRET,X'0C'                                        0489 01227000
*       RETURN;                     /* RETURN TO SCAN                */ 01228000
         B     @EL00005                                            0490 01229000
*     END;                                                         0491 01230000
*   DO J=1 TO MAXJCL;               /* LOOP TO MOVE BUFFER RECORDS   */ 01231000
@RF00483 LA    @08,1                                               0492 01232000
         B     @DE00492                                            0492 01233000
@DL00492 DS    0H                                                  0493 01234000
*     NXTBFRAD->BUFFER(J)=BUFFER(J);/* MOVE RECORD TO NEW BUFFER     */ 01235000
         LR    @07,@08                                             0493 01236000
         MH    @07,@CH00539                                        0493 01237000
         L     @01,NXTBFRAD                                        0493 01238000
         ALR   @01,@07                                             0493 01239000
         AL    @01,@CF01607                                        0493 01240000
         L     @06,BUFRPTR                                         0493 01241000
         ALR   @06,@07                                             0493 01242000
         AL    @06,@CF01607                                        0493 01243000
         MVC   BUFFER(80,@01),BUFFER(@06)                          0493 01244000
*   END;                                                           0494 01245000
         AL    @08,@CF00054                                        0494 01246000
@DE00492 STH   @08,J                                               0494 01247000
         CH    @08,MAXJCL                                          0494 01248000
         BNH   @DL00492                                            0494 01249000
*   IF MAXJCL>INCR                  /* HAS PRIOR GETMAIN BEEN DONE?  */ 01250000
*     THEN                          /* YES - MUST FREE OLD           */ 01251000
         LH    @08,MAXJCL                                          0495 01252000
         C     @08,@CF00488                                        0495 01253000
         BNH   @RF00495                                            0495 01254000
*     DO;                                                          0496 01255000
*       RFY                                                        0497 01256000
*         SIZE RSTD;                /*                       @Z40SP00*/ 01257000
*       SIZE=MAXJCL*LENGTH(BUFFER); /* CALCULATE SIZE OF OLD BUFFER  */ 01258000
         MH    @08,@CH00539                                        0498 01259000
         LR    SIZE,@08                                            0498 01260000
*       GEN(FREEMAIN E,LV=(SIZE),A=BUFRPTR)                        0499 01261000
*       REFS(SIZE,BUFRPTR);         /* FREE OLD JCL BUFFER   @Z40SP00*/ 01262000
         FREEMAIN E,LV=(SIZE),A=BUFRPTR                                 01263000
*       RFY                                                        0500 01264000
*         SIZE UNRSTD;              /*                       @Z40SP00*/ 01265000
*     END;                                                         0501 01266000
*   BUFRPTR=NXTBFRAD;               /* SET BASE TO NEW BUFFER        */ 01267000
@RF00495 L     @08,NXTBFRAD                                        0502 01268000
         ST    @08,BUFRPTR                                         0502 01269000
*   MAXJCL=MAXJCL+INCR;             /* SET NEW MAXIMUM JCL NUMBER    */ 01270000
         LH    @08,MAXJCL                                          0503 01271000
         LA    @08,25(,@08)                                        0503 01272000
         STH   @08,MAXJCL                                          0503 01273000
*   GO TO JCLSAV;                   /* GO TO CONTINUE READING JCL    */ 01274000
*                                                                  0504 01275000
         B     JCLSAV                                              0504 01276000
*   /*****************************************************************/ 01277000
*   /*                                                               */ 01278000
*   /* SET UP TO PASS JCL TO CALLED ROUTINE                          */ 01279000
*   /*                                                               */ 01280000
*   /*****************************************************************/ 01281000
*                                                                  0505 01282000
*UPDEXC20:                                                         0505 01283000
*   IF BUFFER(NUMJCL,1:2)=SLASHAST  /* IS THIS A NULL STEP?  @Z67SP00*/ 01284000
*     THEN                          /* YES - STOP SCAN               */ 01285000
UPDEXC20 LH    @08,NUMJCL                                          0505 01286000
         MH    @08,@CH00539                                        0505 01287000
         L     @01,BUFRPTR                                         0505 01288000
         ALR   @01,@08                                             0505 01289000
         AL    @01,@CF01607                                        0505 01290000
         CLC   BUFFER(2,@01),@CC01431                              0505 01291000
         BNE   @RF00505                                            0505 01292000
*     DO;                                                          0506 01293000
*       SCPRET=SCPNDSCN;            /* INDICATE SCAN STOP    @YA07506*/ 01294000
         MVI   SCPRET,X'04'                                        0507 01295000
*       RETURN;                     /* RETURN TO CONTINUE            */ 01296000
         B     @EL00005                                            0508 01297000
*     END;                                                         0509 01298000
*   BUFFER(NUMJCL,1)=EOLST;         /* INDICATE END OF JCL   @Z67SP00*/ 01299000
@RF00505 LH    @08,NUMJCL                                          0510 01300000
         MH    @08,@CH00539                                        0510 01301000
         LA    @07,255                                             0510 01302000
         L     @06,BUFRPTR                                         0510 01303000
         AL    @06,@CF01607                                        0510 01304000
         STC   @07,BUFFER(@08,@06)                                 0510 01305000
*   SCPPMLN=ZERO;                   /* RESET LENGTH SO THAT SCAN WILL   01306000
*                                      START SCAN AT START OF CARD 0511 01307000
*                                      (SINCE CRD HAS READ ANOTHER 0511 01308000
*                                      CARD) RATHER THAN OFFSET INTO    01309000
*                                      CARD EQUAL TO LENGTH OF PROC     01310000
*                                      OR PGM=XX FOUND       @Z67SP00*/ 01311000
         SLR   @08,@08                                             0511 01312000
         STH   @08,SCPPMLN                                         0511 01313000
*   SCPRET=SCPGOOD;                 /* INDICATE SUCCESS      @YA07506*/ 01314000
         MVI   SCPRET,X'00'                                        0512 01315000
*   END UPDEXC10;                   /* RETURN TO SCAN                */ 01316000
         B     @EL00005                                            0513 01317000
         EJECT                                                          01318000
*                                                                  0514 01319000
*   /*****************************************************************/ 01320000
*   /*                                                               */ 01321000
*   /* FOLLOWING ROUTINES INVOKE THE PROPER SYSGEN SCANNERS WHEN A   */ 01322000
*   /* STEP CONSISTING OF AN EXECUTE OF THE LINKAGE EDITOR, THE      */ 01323000
*   /* ASSEMBLER, OR IEBCOPY IS FOUND ON THE SYSGEN TAPE             */ 01324000
*   /*                                                               */ 01325000
*   /*****************************************************************/ 01326000
*                                                                  0514 01327000
*RINVOK:                                                           0514 01328000
*   PROCEDURE OPTIONS(SAVEAREA);                                   0514 01329000
*                                                                  0514 01330000
RINVOK   STM   @14,@12,12(@13)                                     0514 01331000
         ST    @13,@SA00006+4                                      0514 01332000
         LA    @08,@SA00006                                        0514 01333000
         ST    @08,8(,@13)                                         0514 01334000
         LR    @13,@08                                             0514 01335000
*   /*****************************************************************/ 01336000
*   /*                                                               */ 01337000
*   /* SCAN HAS ENCOUNTERED AN ASSEMBLY STEP - INVOKE HMASMASM       */ 01338000
*   /*                                                               */ 01339000
*   /*****************************************************************/ 01340000
*                                                                  0515 01341000
*   MGPCLEAR=''B;                   /* CLEAR MSG PARTS       @Z40SP00*/ 01342000
         XC    MGPCLEAR(6),MGPCLEAR                                0515 01343000
*   IF ASMSW=ON                     /* WAS STEP ASM?         @YA05008*/ 01344000
*     THEN                          /* YES                   @YA05008*/ 01345000
         TM    ASMSW,B'01000000'                                   0516 01346000
         BNO   @RF00516                                            0516 01347000
*     DO;                           /* PROCESS JCL           @YA05008*/ 01348000
*       MGPMGNO2=PART025;           /* ASSEMBLER INPUT       @Z40SP00*/ 01349000
         MVC   MGPMGNO2(2),@CH00488                                0518 01350000
*       CALL HMASMASM(BUPPARM,HMASMCRP,BUFFER,NUMJCL);/*     @Z67SP00*/ 01351000
         MVC   @AL00001(16),@AL00519                               0519 01352000
         L     @08,BUFRPTR                                         0519 01353000
         ST    @08,@AL00001+8                                      0519 01354000
         L     @15,@CV01381                                        0519 01355000
         LA    @01,@AL00001                                        0519 01356000
         BALR  @14,@15                                             0519 01357000
*     END;                          /* END ASM STEP PROCESSING     0520 01358000
*                                                            @YA05008*/ 01359000
*                                                                  0520 01360000
*   /*****************************************************************/ 01361000
*   /*                                                               */ 01362000
*   /* SCAN HAS ENCOUNTERED A LINK EDIT STEP - INVOKE HMASMLKD       */ 01363000
*   /*                                                               */ 01364000
*   /*****************************************************************/ 01365000
*                                                                  0521 01366000
*   ELSE                            /*                       @ZA24269*/ 01367000
*     IF LKDSW=ON                   /* LINK STEP?            @YA05008*/ 01368000
*       THEN                        /* YES                   @YA05008*/ 01369000
         B     @RC00516                                            0521 01370000
@RF00516 TM    LKDSW,B'00100000'                                   0521 01371000
         BNO   @RF00521                                            0521 01372000
*       DO;                         /* DO LINK PROCESSING    @YA05008*/ 01373000
*         MGPMGNO2=PART023;         /* LINKAGE EDITOR INPUT  @Z40SP00*/ 01374000
         MVC   MGPMGNO2(2),@CH00484                                0523 01375000
*         CALL HMASMLKD(BUPPARM,HMASMCRP,BUFFER,NUMJCL);/*   @Z67SP00*/ 01376000
         MVC   @AL00001(16),@AL00524                               0524 01377000
         L     @08,BUFRPTR                                         0524 01378000
         ST    @08,@AL00001+8                                      0524 01379000
         L     @15,@CV01382                                        0524 01380000
         LA    @01,@AL00001                                        0524 01381000
         BALR  @14,@15                                             0524 01382000
*       END;                        /* END LINK PROCESSING   @YA05008*/ 01383000
*                                                                  0525 01384000
*   /*****************************************************************/ 01385000
*   /*                                                               */ 01386000
*   /* SCAN HAS ENCOUNTERED AN IEBCOPY STEP - INVOKE HMASMCPY        */ 01387000
*   /*                                                               */ 01388000
*   /*****************************************************************/ 01389000
*                                                                  0526 01390000
*     ELSE                          /*                       @ZA24269*/ 01391000
*       IF CPYSW=ON                 /* COPY STEP?            @YA05008*/ 01392000
*         THEN                      /* YES                   @YA05008*/ 01393000
         B     @RC00521                                            0526 01394000
@RF00521 TM    CPYSW,B'00010000'                                   0526 01395000
         BNO   @RF00526                                            0526 01396000
*         DO;                       /* DO COPY PROCESSING    @YA05008*/ 01397000
*           MGPMGNO2=PART024;       /* IEBCOPY INPUT         @Z40SP00*/ 01398000
         MVC   MGPMGNO2(2),@CH00193                                0528 01399000
*           CALL HMASMCPY(BUPPARM,HMASMCRP,BUFFER,NUMJCL);/* @Z67SP00*/ 01400000
         MVC   @AL00001(16),@AL00529                               0529 01401000
         L     @08,BUFRPTR                                         0529 01402000
         ST    @08,@AL00001+8                                      0529 01403000
         L     @15,@CV01384                                        0529 01404000
         LA    @01,@AL00001                                        0529 01405000
         BALR  @14,@15                                             0529 01406000
*         END;                      /* END COPY PROCESSING   @YA05008*/ 01407000
*                                                                  0531 01408000
*   /*****************************************************************/ 01409000
*   /*                                                               */ 01410000
*   /* CHECK RETURN CODE FROM SCANNER ROUTINES - RETURN TO SCAN      */ 01411000
*   /*                                                               */ 01412000
*   /*****************************************************************/ 01413000
*                                                                  0531 01414000
*   IF RTNCODE^=ZERO                /* GOOD RETURN CODE?     @YA07506*/ 01415000
*       &RTNCODE^=IOPEXC            /* AND NOT IOP EXCEEDED? @YA07506*/ 01416000
*     THEN                          /* NO - EXIT BADLY               */ 01417000
@RF00526 DS    0H                                                  0531 01418000
@RC00521 DS    0H                                                  0531 01419000
@RC00516 LTR   RTNCODE,RTNCODE                                     0531 01420000
         BZ    @RF00531                                            0531 01421000
         LA    @08,8                                               0531 01422000
         CR    RTNCODE,@08                                         0531 01423000
         BE    @RF00531                                            0531 01424000
*     DO;                           /* ISSUE PROPER MESSAGE          */ 01425000
*       IF RTNCODE=SYNTERR          /* IS IT SYNTAX ERROR?           */ 01426000
*         THEN                                                     0533 01427000
         C     RTNCODE,@CF00034                                    0533 01428000
         BNE   @RF00533                                            0533 01429000
*         DO;                                                      0534 01430000
*           MGPTYPE=MGPERR;         /* SET SEVERITY          @MS00001*/ 01431000
         MVI   MGPTYPE,X'03'                                       0535 01432000
*           MGPMGNO1=HMA203I;       /* SYNTAX ERROR IN       @Z40SP00*/ 01433000
         MVC   MGPMGNO1(2),@CH00037                                0536 01434000
*           UPDRTNCD=MAX(UPDRTNCD,STOPPTF);/*                @ZA24269*/ 01435000
         SLR   @07,@07                                             0537 01436000
         IC    @07,UPDRTNCD                                        0537 01437000
         CR    @07,@08                                             0537 01438000
         BNL   *+6                                                      01439000
         LR    @07,@08                                             0537 01440000
         STC   @07,UPDRTNCD                                        0537 01441000
*         END;                      /*                       @YA07506*/ 01442000
*       ELSE                        /* CHECK THE REST                */ 01443000
*         IF RTNCODE=IOPIOERR       /* I/O ERROR?            @YA07506*/ 01444000
*           THEN                    /* YES - INDICATE ERROR          */ 01445000
         B     @RC00533                                            0539 01446000
@RF00533 LA    @08,16                                              0539 01447000
         CR    RTNCODE,@08                                         0539 01448000
         BNE   @RF00539                                            0539 01449000
*           DO;                     /*                       @YA07506*/ 01450000
*             MGPTYPE=MGPTERM;      /* SET SEVERITY          @MS00001*/ 01451000
         MVI   MGPTYPE,X'05'                                       0541 01452000
*             MGPMGNO1=HMA266I;     /* ERROR OCCURRED IN     @Z40SP00*/ 01453000
         MVC   MGPMGNO1(2),@CH01056                                0542 01454000
*             UPDRTNCD=MAX(UPDRTNCD,STOPSMP);/*              @ZA24269*/ 01455000
         SLR   @07,@07                                             0543 01456000
         IC    @07,UPDRTNCD                                        0543 01457000
         CR    @07,@08                                             0543 01458000
         BNL   *+6                                                      01459000
         LR    @07,@08                                             0543 01460000
         STC   @07,UPDRTNCD                                        0543 01461000
*           END;                    /*                       @YA07506*/ 01462000
*         ELSE                      /* OTHERWISE, TABLE EXCEED       */ 01463000
*           IF RTNCODE=TBLEXCER     /* TABLE SPACE EXCEEDED?         */ 01464000
*             THEN                  /* YES - INDICATE NO SPACE       */ 01465000
         B     @RC00539                                            0545 01466000
@RF00539 LA    @08,12                                              0545 01467000
         CR    RTNCODE,@08                                         0545 01468000
         BNE   @RF00545                                            0545 01469000
*             DO;                   /*                       @YA07506*/ 01470000
*               MGPTYPE=MGPSEV;     /* SET SEVERITY          @MS00001*/ 01471000
         MVI   MGPTYPE,X'04'                                       0547 01472000
*               MGPMGNO1=HMA202I;   /* UNABLE TO OBTAIN STORAGE FOR     01473000
*                                      WORK AREAS            @Z40SP00*/ 01474000
         MVC   MGPMGNO1(2),@CH00046                                0548 01475000
*               UPDRTNCD=MAX(UPDRTNCD,STOPFUNC);/*           @ZA24269*/ 01476000
         SLR   @07,@07                                             0549 01477000
         IC    @07,UPDRTNCD                                        0549 01478000
         CR    @07,@08                                             0549 01479000
         BNL   *+6                                                      01480000
         LR    @07,@08                                             0549 01481000
         STC   @07,UPDRTNCD                                        0549 01482000
*             END;                  /*                       @YA07506*/ 01483000
*           ELSE                                                   0551 01484000
*             IF RTNCODE=PREMEOF    /* IS IT END OF FILE?            */ 01485000
*               THEN                /* YES - INDICATE EOF FOUND      */ 01486000
         B     @RC00545                                            0551 01487000
@RF00545 C     RTNCODE,@CF00273                                    0551 01488000
         BNE   @RF00551                                            0551 01489000
*               DO;                                                0552 01490000
*                 EOFSW=ON;         /* INDICATE EOF FOUND ON JCL     */ 01491000
         OI    EOFSW,B'10000000'                                   0553 01492000
*                 SCPRET=SCPNDSCN;  /* SAY STOP THE SCAN     @YA07506*/ 01493000
         MVI   SCPRET,X'04'                                        0554 01494000
*                 RETURN;           /* RETURN WITH NO MESSAGE        */ 01495000
@EL00006 L     @13,4(,@13)                                         0555 01496000
@EF00006 DS    0H                                                  0555 01497000
@ER00006 LM    @14,@12,12(@13)                                     0555 01498000
         BR    @14                                                 0555 01499000
*               END;                                               0556 01500000
*             ELSE                                                 0557 01501000
*               DO;                 /* JCL STATEMENTS ENCOUNTERED    */ 01502000
@RF00551 DS    0H                                                  0558 01503000
*                 SKIPREAD=ON;      /* INDICATE SKIP READ OP         */ 01504000
         OI    SKIPREAD,B'01000000'                                0558 01505000
*                 BUFFER(1)=CRPBUFFR;/* MOVE IOP RECORD TO BUFR      */ 01506000
         L     @08,BUFRPTR                                         0559 01507000
         MVC   BUFFER(80,@08),CRPBUFFR                             0559 01508000
*                 SCPRET=SCPNDSCN;  /* INDICATE END SCAN     @YA07506*/ 01509000
         MVI   SCPRET,X'04'                                        0560 01510000
*                 RETURN;           /* RETURN TO SCAN                */ 01511000
         B     @EL00006                                            0561 01512000
*               END;                                               0562 01513000
*       CALL HMASMMSG(HMASMMGP);    /* ISSUE MESSAGE                 */ 01514000
@RC00545 DS    0H                                                  0563 01515000
@RC00539 DS    0H                                                  0563 01516000
@RC00533 L     @15,@CV01383                                        0563 01517000
         LA    @01,@AL00563                                        0563 01518000
         BALR  @14,@15                                             0563 01519000
*       SCPRET=SCPSTOP;             /* INDICATE ERROR 2 SCN  @YA07506*/ 01520000
         MVI   SCPRET,X'08'                                        0564 01521000
*     END;                                                         0565 01522000
*   ELSE                            /* OTHERWISE INDICATE SUCCESS    */ 01523000
*     DO;                           /*                       @YA07506*/ 01524000
         B     @RC00531                                            0566 01525000
@RF00531 DS    0H                                                  0567 01526000
*       IF RTNCODE=IOPEXC           /* IOPEXCEEDED?          @YA07506*/ 01527000
*         THEN                                                     0567 01528000
         C     RTNCODE,@CF00039                                    0567 01529000
         BNE   @RF00567                                            0567 01530000
*         RTNCODE=STOPFUNC;         /* YES-TERMINATE JCLIN   @YA07506*/ 01531000
         LA    RTNCODE,12                                          0568 01532000
*       SCPRET=RTNCODE;             /* SET RC                @YA07506*/ 01533000
@RF00567 STC   RTNCODE,SCPRET                                      0569 01534000
*       IF UPDRTNCD<SCPRET          /* CHANGE RC?            @YA07506*/ 01535000
*         THEN                                                     0570 01536000
         CLC   UPDRTNCD(1),SCPRET                                  0570 01537000
         BNL   @RF00570                                            0570 01538000
*         UPDRTNCD=SCPRET;          /* INSURE RC             @YA07506*/ 01539000
         SLR   @08,@08                                             0571 01540000
         IC    @08,SCPRET                                          0571 01541000
         STC   @08,UPDRTNCD                                        0571 01542000
*     END;                          /*                       @YA07506*/ 01543000
*   END RINVOK;                     /* RETURN TO SCAN                */ 01544000
         B     @EL00006                                            0573 01545000
*   END HMASMUPD                                                   0574 01546000
*                                                                  0574 01547000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01548000
*/*%INCLUDE SYSLIB  (HMASMCCA)                                       */ 01549000
*/*%INCLUDE SYSLIB  (HMASMIOP)                                       */ 01550000
*/*%INCLUDE SYSLIB  (HMASMCRP)                                       */ 01551000
*/*%INCLUDE SYSLIB  (HMASMSCP)                                       */ 01552000
*/*%INCLUDE SYSLIB  (HMASMMGP)                                       */ 01553000
*                                                                  0574 01554000
*       ;                                                          0574 01555000
@DATA    DS    0H                                                       01556000
@CH00067 DC    H'2'                                                     01557000
@CH00467 DC    H'13'                                                    01558000
@CH00484 DC    H'23'                                                    01559000
@CH00193 DC    H'24'                                                    01560000
@CH01388 DC    H'47'                                                    01561000
@CH00708 DC    H'63'                                                    01562000
@CH01050 DC    H'64'                                                    01563000
@CH01056 DC    H'67'                                                    01564000
@CH00353 DC    H'74'                                                    01565000
@CH00539 DC    H'80'                                                    01566000
@CH00557 DC    H'89'                                                    01567000
@SM01599 MVC   DSCKEY(0,@08),UPDPGMNM-1(@06)                            01568000
@SM01604 MVC   NAMESAVE(0),SCPSTRNG(@01)                                01569000
         DS    0F                                                       01570000
@AL00317 DC    A(HMASMSCP)             LIST WITH   1 ARGUMENT(S)        01571000
@AL00519 EQU   *                       LIST WITH   4 ARGUMENT(S)        01572000
@AL00524 EQU   *                       LIST WITH   4 ARGUMENT(S)        01573000
@AL00529 EQU   *                       LIST WITH   4 ARGUMENT(S)        01574000
@AL00330 DC    A(BUPPARM)              LIST WITH   1 ARGUMENT(S)        01575000
@AL00288 EQU   *                       LIST WITH   1 ARGUMENT(S)        01576000
@AL00384 DC    A(HMASMCRP)             LIST WITH   1 ARGUMENT(S)        01577000
@AL00272 EQU   *                       LIST WITH   1 ARGUMENT(S)        01578000
@AL00304 EQU   *                       LIST WITH   1 ARGUMENT(S)        01579000
@AL00307 EQU   *                       LIST WITH   1 ARGUMENT(S)        01580000
@AL00324 EQU   *                       LIST WITH   1 ARGUMENT(S)        01581000
@AL00328 EQU   *                       LIST WITH   1 ARGUMENT(S)        01582000
@AL00488 EQU   *                       LIST WITH   1 ARGUMENT(S)        01583000
@AL00563 DC    A(HMASMMGP)             LIST WITH   1 ARGUMENT(S)        01584000
         DC    A(NUMJCL)                                                01585000
         DS    0F                                                       01586000
@SA00001 DS    18F                                                      01587000
@PC00001 DS    1F                                                       01588000
@SA00005 DS    18F                                                      01589000
@SA00006 DS    18F                                                      01590000
@AL00001 DS    4A                                                       01591000
@TF00001 DS    F                                                        01592000
         DS    0F                                                       01593000
@CF00054 DC    F'1'                                                     01594000
@CH00054 EQU   @CF00054+2                                               01595000
@CF00046 DC    F'3'                                                     01596000
@CH00046 EQU   @CF00046+2                                               01597000
@CF00037 DC    F'4'                                                     01598000
@CH00037 EQU   @CF00037+2                                               01599000
@CF00039 DC    F'8'                                                     01600000
@CF00034 DC    F'10'                                                    01601000
@CF00273 DC    F'14'                                                    01602000
@CF00488 DC    F'25'                                                    01603000
@CH00488 EQU   @CF00488+2                                               01604000
@CF01064 DC    F'71'                                                    01605000
@CH01064 EQU   @CF01064+2                                               01606000
@CF00860 DC    F'72'                                                    01607000
@CF01612 DC    F'-82'                                                   01608000
@CF01609 DC    F'-81'                                                   01609000
@CF01607 DC    F'-80'                                                   01610000
@CF01614 DC    F'-78'                                                   01611000
@CF01611 DC    F'-77'                                                   01612000
@CF01597 DC    F'-13'                                                   01613000
@CF01598 DC    F'-12'                                                   01614000
@CV01377 DC    V(HMASMIO)                                               01615000
@CV01378 DC    V(HMASMBUE)                                              01616000
@CV01379 DC    V(HMASMCRD)                                              01617000
@CV01380 DC    V(HMASMSCN)                                              01618000
@CV01381 DC    V(HMASMASM)                                              01619000
@CV01382 DC    V(HMASMLKD)                                              01620000
@CV01383 DC    V(HMASMMSG)                                              01621000
@CV01384 DC    V(HMASMCPY)                                              01622000
         DS    0D                                                       01623000
K        DS    F                                                        01624000
NXTBFRAD DC    A(0)                                                     01625000
BUFRPTR  DC    AL4(JCLBUF)                                              01626000
I        DS    H                                                        01627000
J        DS    H                                                        01628000
NUMJCL   DS    H                                                        01629000
MAXJCL   DS    H                                                        01630000
UPDRTNCD DC    AL1(0)                                                   01631000
@TS00001 DS    CL80                                                     01632000
@CC01416 DC    C'//SYSIN '                                              01633000
@CC01418 DC    C'*NONAME*'                                              01634000
@CC01420 DC    C'SMPTLIB '                                              01635000
@CC01422 DC    C'JCLIN   '                                              01636000
@CC01412 DC    C'EXEC '                                                 01637000
@CC01410 DC    C'JOB '                                                  01638000
@CC01569 DC    C'DATA'                                                  01639000
@CC01570 DC    C'DLM='                                                  01640000
@CC01414 DC    C'DD '                                                   01641000
@CC01568 DC    C'DSN'                                                   01642000
@CC01429 EQU   @CC01416                                                 01643000
@CC01431 DC    C'/*'                                                    01644000
@CC01487 DC    C'++'                                                    01645000
HMASMCRP DS    CL106                                                    01646000
         ORG   HMASMCRP                                                 01647000
CRPUXNUM DS    FL1                                                      01648000
@NM00172 DS    CL3                                                      01649000
CRPSCPAD DS    AL4                                                      01650000
CRPINDS  DS    FL1                                                      01651000
CRPOUTDS DS    FL1                                                      01652000
CRPRETRN DS    FL1                                                      01653000
@NM00173 DS    CL3                                                      01654000
CRPFLG1  DS    BL2                                                      01655000
         ORG   CRPFLG1                                                  01656000
CRPBFPRM DS    BL1                                                      01657000
CRPLOGCK EQU   CRPFLG1+0                                                01658000
CRPPTS   EQU   CRPFLG1+0                                                01659000
CRPLOG   EQU   CRPFLG1+0                                                01660000
CRPPRINT EQU   CRPFLG1+0                                                01661000
CRPOTHER EQU   CRPFLG1+0                                                01662000
CRPOFFST EQU   CRPFLG1+0                                                01663000
CRPSCNCL EQU   CRPFLG1+0                                                01664000
CRPEOFEN DS    BL1                                                      01665000
CRPTRMEX EQU   CRPFLG1+1                                                01666000
CRPNOWPP EQU   CRPFLG1+1                                                01667000
CRPLIST  EQU   CRPFLG1+1                                                01668000
CRPRPT   EQU   CRPFLG1+1                                                01669000
@NM00174 EQU   CRPFLG1+1                                                01670000
         ORG   HMASMCRP+16                                              01671000
CRPFLG2  DS    BL2                                                      01672000
         ORG   CRPFLG2                                                  01673000
CRPINSW0 DS    BL1                                                      01674000
         ORG   CRPINSW0                                                 01675000
CRPEOFSW DS    BL1                                                      01676000
         ORG   CRPFLG2+0                                                01677000
CRPINSW1 EQU   CRPFLG2+0                                                01678000
         ORG   CRPINSW1                                                 01679000
CRPEXADD EQU   CRPINSW1+0                                               01680000
         ORG   CRPFLG2+0                                                01681000
CRPINSW2 EQU   CRPFLG2+0                                                01682000
         ORG   CRPINSW2                                                 01683000
CRPWRTLG EQU   CRPINSW2+0                                               01684000
         ORG   CRPFLG2+0                                                01685000
CRPINSW3 EQU   CRPFLG2+0                                                01686000
         ORG   CRPINSW3                                                 01687000
CRPEOF1  EQU   CRPINSW3+0                                               01688000
         ORG   CRPFLG2+0                                                01689000
CRPINSW4 EQU   CRPFLG2+0                                                01690000
CRPINSW5 EQU   CRPFLG2+0                                                01691000
CRPINSW6 EQU   CRPFLG2+0                                                01692000
CRPINSW7 EQU   CRPFLG2+0                                                01693000
         DS    CL1                                                      01694000
CRPINSW8 DS    BL1                                                      01695000
CRPINSW9 EQU   CRPFLG2+1                                                01696000
CRPINSWA EQU   CRPFLG2+1                                                01697000
CRPINSWB EQU   CRPFLG2+1                                                01698000
CRPINSWC EQU   CRPFLG2+1                                                01699000
CRPINSWD EQU   CRPFLG2+1                                                01700000
CRPINSWE EQU   CRPFLG2+1                                                01701000
CRPINSWF EQU   CRPFLG2+1                                                01702000
         ORG   HMASMCRP+18                                              01703000
CRPBUFFR DS    CL80                                                     01704000
         ORG   CRPBUFFR                                                 01705000
CRPBFCTL DS    CL72                                                     01706000
         ORG   CRPBFCTL                                                 01707000
CRPBFDTA DS    CL71                                                     01708000
CRPBFCNT DS    CL1                                                      01709000
         ORG   CRPBUFFR+72                                              01710000
CRPBFSEQ DS    CL8                                                      01711000
         ORG   HMASMCRP+98                                              01712000
CRPDDNAM DS    CL8                                                      01713000
         ORG   HMASMCRP+106                                             01714000
         DS    CL2                                                      01715000
HMASMSCP DS    CL26                                                     01716000
         ORG   HMASMSCP                                                 01717000
SCPCHAR  DS    AL4                                                      01718000
SCPSRCH  DS    AL4                                                      01719000
SCPWKAR  DS    AL4                                                      01720000
SCPIORTN DS    AL4                                                      01721000
SCPIOPAD DS    AL4                                                      01722000
SCPINLN  DS    FL2                                                      01723000
SCPPMLN  DS    FL2                                                      01724000
SCPEOR   DS    BL1                                                      01725000
         ORG   SCPEOR                                                   01726000
SCPCONT  DS    BL1                                                      01727000
SCPNOCT  EQU   SCPEOR+0                                                 01728000
SCPCOMNT EQU   SCPEOR+0                                                 01729000
SCPRTERR EQU   SCPEOR+0                                                 01730000
SCPNOSUC EQU   SCPEOR+0                                                 01731000
SCPNORT  EQU   SCPEOR+0                                                 01732000
@NM00175 EQU   SCPEOR+0                                                 01733000
         ORG   HMASMSCP+25                                              01734000
SCPRETRN DS    FL1                                                      01735000
         ORG   SCPRETRN                                                 01736000
SCPRET   DS    FL1                                                      01737000
         ORG   HMASMSCP+26                                              01738000
         DS    CL2                                                      01739000
HMASMMGP DS    CL24                                                     01740000
         ORG   HMASMMGP                                                 01741000
MGPFIXED DS    CL12                                                     01742000
         ORG   MGPFIXED                                                 01743000
MGPCLEAR DS    CL6                                                      01744000
         ORG   MGPCLEAR                                                 01745000
MGPMGNO1 DS    FL2                                                      01746000
MGPMGNO2 DS    FL2                                                      01747000
MGPMGNO3 DS    FL2                                                      01748000
         ORG   MGPFIXED+6                                               01749000
MGPFLAGS DS    BL2                                                      01750000
         ORG   MGPFLAGS                                                 01751000
MGPPRINT DS    BL1                                                      01752000
MGPLIST  EQU   MGPFLAGS+0                                               01753000
MGPRPT   EQU   MGPFLAGS+0                                               01754000
MGPHLDS  EQU   MGPFLAGS+0                                               01755000
MGPWTOR  EQU   MGPFLAGS+0                                               01756000
MGPWTO   EQU   MGPFLAGS+0                                               01757000
MGPWTP   EQU   MGPFLAGS+0                                               01758000
@NM00177 EQU   MGPFLAGS+0                                               01759000
         ORG   MGPFIXED+8                                               01760000
MGPTYPE  DS    FL1                                                      01761000
@NM00178 DS    CL3                                                      01762000
         ORG   HMASMMGP+12                                              01763000
MGPVAR   DS    CL12                                                     01764000
         ORG   MGPVAR                                                   01765000
MGPVARPT DS    3A                                                       01766000
         ORG   HMASMMGP+24                                              01767000
BUPPARM  DS    CL20                                                     01768000
         ORG   BUPPARM                                                  01769000
BUPFUNCT DS    FL1                                                      01770000
BUPTYPE  DS    FL1                                                      01771000
BUPSTYPE DS    FL1                                                      01772000
BUPFLAGS DS    BL1                                                      01773000
         ORG   BUPFLAGS                                                 01774000
BUPREDO  DS    BL1                                                      01775000
@NM00179 EQU   BUPFLAGS+0                                               01776000
         ORG   BUPPARM+4                                                01777000
BUPSYSMD DS    CL7                                                      01778000
@NM00180 DS    CL1                                                      01779000
BUPIOPAD DS    AL4                                                      01780000
BUPGTPAD DS    AL4                                                      01781000
         ORG   BUPPARM+20                                               01782000
DLM      DC    CL2'  '                                                  01783000
NAMESAVE DS    CL8                                                      01784000
STEPNAME DS    CL8                                                      01785000
JOBNAME  DS    CL8                                                      01786000
DDNAME   DS    CL8                                                      01787000
PATCHUPD DS    CL80                                                     01788000
         ORG   PATCHUPD                                                 01789000
@NM00181 DC    80X'FF'                                                  01790000
         ORG   PATCHUPD+80                                              01791000
FLAGS    DS    BL1                                                      01792000
         ORG   FLAGS                                                    01793000
EOFSW    DS    BL1                                                      01794000
SKIPREAD EQU   FLAGS+0                                                  01795000
FRSTREAD EQU   FLAGS+0                                                  01796000
ALCDONE  EQU   FLAGS+0                                                  01797000
@NM00182 EQU   FLAGS+0                                                  01798000
         ORG   FLAGS+1                                                  01799000
UPDSW1   DS    BL1                                                      01800000
         ORG   UPDSW1                                                   01801000
CONTSW   DS    BL1                                                      01802000
DDSW     EQU   UPDSW1+0                                                 01803000
DLMSW    EQU   UPDSW1+0                                                 01804000
ASTFSW   EQU   UPDSW1+0                                                 01805000
DATAFSW  EQU   UPDSW1+0                                                 01806000
DLMFSW   EQU   UPDSW1+0                                                 01807000
@NM00183 EQU   UPDSW1+0                                                 01808000
         ORG   UPDSW1+1                                                 01809000
UPDSW2   DS    BL1                                                      01810000
         ORG   UPDSW2                                                   01811000
UPDSW    DS    BL1                                                      01812000
ASMSW    EQU   UPDSW2+0                                                 01813000
LKDSW    EQU   UPDSW2+0                                                 01814000
CPYSW    EQU   UPDSW2+0                                                 01815000
@NM00184 EQU   UPDSW2+0                                                 01816000
         ORG   UPDSW2+1                                                 01817000
         DS    CL3                                                      01818000
ALTADDR  DC    AL4(KALTASM)                                             01819000
         DC    AL4(KALTLKED)                                            01820000
         DC    AL4(KALTUPDT)                                            01821000
         DC    AL4(KALTCOPY)                                            01822000
JCLBUF   DS    25CL80                                                   01823000
HMASMUPD CSECT                                                          01824000
KSLBLNK  DSCAN KEY='// ',ALT=KSLSL,SUCC=KJOB,ROUT=RSLBLNK    @XA07937   01825000
KSLSL    DSCAN KEY='//',ALT=KRESET,SUCC=KJOBNMV                         01826000
KJOBNMV  DSCAN MINLEN=0,MAXLEN=8,TYPE=AN,SUCC=KJOB,ROUT=RJOBNMV         01827000
KJOB     DSCAN KEY='JOB',ALT=KEXEC,SUCC=KRESET,ROUT=RJOB                01828000
KEXEC    DSCAN KEY='EXEC',ALT=KRESET,SUCC=KASMS                         01829000
KRESET   DSCAN MINLEN=0                                                 01830000
KASMS    DSCAN KEY='ASMS',ALT=KLINKS,SUCC=KINVOK,ROUT=RASMS             01831000
KLINKS   DSCAN KEY='LINKS',ALT=KPCOPY,SUCC=KINVOK,ROUT=RLINKS           01832000
KPCOPY   DSCAN KEY='PGM=IEBCOPY',ALT=KPIEUASM,SUCC=KINVOK,ROUT=RPCOPY   01833000
KPIEUASM DSCAN KEY='PGM=IEUASM',ALT=KPIFOX00,SUCC=KINVOK,ROUT=RPIEUASM  01834000
KPIFOX00 DSCAN KEY='PGM=IFOX00',ALT=KPASMBLR,SUCC=KINVOK,ROUT=RPIFOX00  01835000
KPASMBLR DSCAN KEY='PGM=ASMBLR',ALT=KPIEWL,SUCC=KINVOK,ROUT=RPASMBLR    01836000
KPIEWL   DSCAN KEY='PGM=IEWL',ALT=KPHEWL,SUCC=KINVOK,ROUT=RPIEWL        01837000
KPHEWL   DSCAN KEY='PGM=HEWL',ALT=KPUPDTE,SUCC=KINVOK,ROUT=RPHEWL       01838000
KPUPDTE  DSCAN KEY='PGM=IEBUPDTE',ALT=KALTASM,ROUT=RPUPDTE              01839000
KALTASM  DSCAN KEY='////////////',ALT=KALTLKED,SUCC=KINVOK,            X01840000
               ROUT=RALTASM                                             01841000
KALTLKED DSCAN KEY='////////////',ALT=KALTUPDT,SUCC=KINVOK,            X01842000
               ROUT=RALTLKED                                            01843000
KALTUPDT DSCAN KEY='////////////',ALT=KALTCOPY,                        X01844000
               ROUT=RALTUPDT                                            01845000
KALTCOPY DSCAN KEY='////////////',ALT=KRESET,SUCC=KINVOK,              X01846000
               ROUT=RALTCOPY                                            01847000
KINVOK   DSCAN MINLEN=0,ROUT=RINVOK                                     01848000
HMASMUPD CSECT                                                          01849000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01850000
@01      EQU   01                                                       01851000
@02      EQU   02                                                       01852000
@03      EQU   03                                                       01853000
@04      EQU   04                                                       01854000
@05      EQU   05                                                       01855000
@06      EQU   06                                                       01856000
@07      EQU   07                                                       01857000
@08      EQU   08                                                       01858000
@09      EQU   09                                                       01859000
@10      EQU   10                                                       01860000
@11      EQU   11                                                       01861000
@12      EQU   12                                                       01862000
@13      EQU   13                                                       01863000
@14      EQU   14                                                       01864000
@15      EQU   15                                                       01865000
CCAPTR   EQU   @11                                                      01866000
IOPPTR   EQU   @09                                                      01867000
SIZE     EQU   @02                                                      01868000
RTNREG   EQU   @14                                                      01869000
RTNCODE  EQU   @15                                                      01870000
R1       EQU   @01                                                      01871000
HMASMCCA EQU   0                                                        01872000
CCAFBUFR EQU   HMASMCCA+4                                               01873000
CCADSAD  EQU   CCAFBUFR+124                                             01874000
CCATPAD  EQU   CCAFBUFR+128                                             01875000
CCAFLAG7 EQU   CCAFBUFR+132                                             01876000
CCAFIOP  EQU   HMASMCCA+140                                             01877000
CCAIOPTR EQU   CCAFIOP                                                  01878000
CCAFSYS  EQU   HMASMCCA+148                                             01879000
CCASREL  EQU   CCAFSYS+12                                               01880000
CCAFLAGA EQU   CCAFSYS+21                                               01881000
CCAFSTA  EQU   HMASMCCA+188                                             01882000
CCAFICT  EQU   HMASMCCA+192                                             01883000
CCAFPGM  EQU   HMASMCCA+208                                             01884000
CCABLDLP EQU   CCAFPGM                                                  01885000
CCADBLDL EQU   CCAFPGM+4                                                01886000
CCAFGTP  EQU   HMASMCCA+224                                             01887000
CCASEGTP EQU   CCAFGTP                                                  01888000
@NM00010 EQU   HMASMCCA+244                                             01889000
CCAFFUNC EQU   HMASMCCA+264                                             01890000
CCAFLAG1 EQU   CCAFFUNC+8                                               01891000
CCAFLAG2 EQU   CCAFFUNC+11                                              01892000
CCAFPROC EQU   HMASMCCA+276                                             01893000
CCAFLAG3 EQU   CCAFPROC                                                 01894000
CCAFDIS  EQU   HMASMCCA+278                                             01895000
CCAFLAG4 EQU   CCAFDIS                                                  01896000
CCAFLAG5 EQU   CCAFDIS+1                                                01897000
CCAFLAG6 EQU   CCAFDIS+2                                                01898000
CCAFCNV  EQU   HMASMCCA+281                                             01899000
CCAFLAG8 EQU   CCAFCNV                                                  01900000
CCAFCTL  EQU   HMASMCCA+282                                             01901000
CCAFLAG9 EQU   CCAFCTL                                                  01902000
CCAFDSNG EQU   HMASMCCA+298                                             01903000
CCAFLAGB EQU   CCAFDSNG                                                 01904000
CCABLDLA EQU   0                                                        01905000
@NM00026 EQU   CCABLDLA                                                 01906000
CCABLDLL EQU   0                                                        01907000
@NM00028 EQU   CCABLDLL                                                 01908000
CCALKDRC EQU   @NM00028+20                                              01909000
@NM00030 EQU   CCABLDLL+124                                             01910000
CCAASMRC EQU   @NM00030+20                                              01911000
@NM00032 EQU   CCABLDLL+248                                             01912000
CCACPYRC EQU   @NM00032+20                                              01913000
@NM00034 EQU   CCABLDLL+372                                             01914000
CCACOMRC EQU   @NM00034+20                                              01915000
@NM00036 EQU   CCABLDLL+496                                             01916000
CCAZAPRC EQU   @NM00036+20                                              01917000
@NM00038 EQU   CCABLDLL+620                                             01918000
CCASUPRC EQU   @NM00038+20                                              01919000
@NM00040 EQU   CCABLDLL+744                                             01920000
CCAUPDRC EQU   @NM00040+20                                              01921000
CCABLDLM EQU   0                                                        01922000
CCABELMT EQU   CCABLDLM+4                                               01923000
CCABMPOS EQU   CCABELMT                                                 01924000
HMASMIOP EQU   0                                                        01925000
IOPDSID  EQU   HMASMIOP                                                 01926000
IOPFUNCT EQU   HMASMIOP+1                                               01927000
IOPRETRN EQU   HMASMIOP+2                                               01928000
IOPTYPE  EQU   HMASMIOP+3                                               01929000
IOPNAME  EQU   HMASMIOP+4                                               01930000
@NM00044 EQU   HMASMIOP+12                                              01931000
@NM00045 EQU   @NM00044                                                 01932000
IOPDDNAM EQU   HMASMIOP+24                                              01933000
IOPBUFAD EQU   HMASMIOP+52                                              01934000
IOPDRMAP EQU   HMASMIOP+56                                              01935000
IOPINAME EQU   IOPDRMAP                                                 01936000
IOPINAM  EQU   IOPINAME                                                 01937000
IOPITYP  EQU   IOPINAM                                                  01938000
IOPUSERL EQU   IOPDRMAP+11                                              01939000
IOPEND   EQU   IOPDRMAP+12                                              01940000
IOPLMCTL EQU   0                                                        01941000
IOPQSMIF EQU   0                                                        01942000
@NM00155 EQU   IOPQSMIF                                                 01943000
IOPQSMLS EQU   IOPQSMIF+8                                               01944000
IOPQSMNM EQU   IOPQSMLS                                                 01945000
IOPBS02  EQU   0                                                        01946000
IOPBS04  EQU   0                                                        01947000
IOPBAPF  EQU   IOPBS04                                                  01948000
SCPSTRNG EQU   0                                                        01949000
DSCANMAP EQU   0                                                        01950000
DSCFLAG  EQU   DSCANMAP+12                                              01951000
DSCKEYLN EQU   DSCANMAP+15                                              01952000
DSCEND   EQU   DSCANMAP+16                                              01953000
BUFFER   EQU   0                                                        01954000
CCADSIDA EQU   0                                                        01955000
CCATYPEA EQU   0                                                        01956000
IOPBS01  EQU   0                                                        01957000
IOPBS03  EQU   0                                                        01958000
SCPIOPRM EQU   0                                                        01959000
UPDPARM  EQU   0                                                        01960000
UPDPGMS  EQU   UPDPARM                                                  01961000
UPDPGMLN EQU   UPDPGMS                                                  01962000
UPDPGMNM EQU   UPDPGMS+1                                                01963000
UPDSYSMD EQU   UPDPARM+52                                               01964000
UPDSTYPE EQU   UPDPARM+59                                               01965000
UPDDSID  EQU   UPDPARM+60                                               01966000
UPDDDNAM EQU   UPDPARM+64                                               01967000
UPDDSNAM EQU   UPDPARM+72                                               01968000
UPDGTPAD EQU   UPDPARM+116                                              01969000
UPDFLAGS EQU   UPDPARM+120                                              01970000
UPDFLG1  EQU   UPDFLAGS                                                 01971000
UPDFLG2  EQU   UPDFLAGS                                                 01972000
UPDFLG3  EQU   UPDFLAGS                                                 01973000
UPDREDO  EQU   UPDFLG3                                                  01974000
IOPUDATA EQU   IOPEND                                                   01975000
IOPINAM3 EQU   IOPINAME                                                 01976000
@NM00051 EQU   IOPINAM3                                                 01977000
IOPSTCMP EQU   IOPUDATA                                                 01978000
IOPDYNDT EQU   IOPUDATA                                                 01979000
IOPDSN   EQU   IOPDYNDT                                                 01980000
IOPSPACE EQU   IOPDYNDT+44                                              01981000
IOPDTYPE EQU   IOPDYNDT+50                                              01982000
IOPNTMAX EQU   IOPDRMAP                                                 01983000
IOPNTMAP EQU   IOPDRMAP                                                 01984000
IOPCDMAP EQU   IOPNTMAP                                                 01985000
IOPPTMAP EQU   IOPCDMAP                                                 01986000
IOPSCMAP EQU   IOPPTMAP                                                 01987000
IOPDIRCT EQU   IOPSCMAP+12                                              01988000
IOPCDMAX EQU   IOPDIRCT                                                 01989000
IOPCQMAP EQU   IOPDRMAP                                                 01990000
@NM00062 EQU   IOPUDATA                                                 01991000
@NM00063 EQU   IOPUDATA                                                 01992000
IOPASMNT EQU   IOPUDATA                                                 01993000
IOPASMDR EQU   IOPASMNT                                                 01994000
IOPABUNT EQU   IOPASMDR+1                                               01995000
IOPLMDNT EQU   IOPUDATA                                                 01996000
IOPLMDDR EQU   IOPLMDNT                                                 01997000
IOPLMLEP EQU   IOPLMDDR+1                                               01998000
IOPLMDF1 EQU   IOPLMLEP                                                 01999000
IOPFLGS2 EQU   IOPLMDF1                                                 02000000
IOPLMDF2 EQU   IOPLMLEP+1                                               02001000
IOPLMDF3 EQU   IOPLMLEP+2                                               02002000
IOPLMDF4 EQU   IOPLMLEP+3                                               02003000
IOPLMDF5 EQU   IOPLMDDR+5                                               02004000
IOPFLGS3 EQU   IOPLMDF5                                                 02005000
IOPLMDFX EQU   IOPLMDNT+24                                              02006000
@NM00072 EQU   IOPLMDFX                                                 02007000
IOPLNTRY EQU   IOPLMDFX+8                                               02008000
IOPLSYS  EQU   IOPLNTRY                                                 02009000
IOPSYSLB EQU   IOPLSYS                                                  02010000
IOPMACNT EQU   IOPUDATA                                                 02011000
IOPMACDR EQU   IOPMACNT                                                 02012000
IOPRMIDE EQU   IOPMACDR+1                                               02013000
IOPRMST  EQU   IOPRMIDE+7                                               02014000
IOPFMIDE EQU   IOPMACDR+9                                               02015000
IOPMACFX EQU   IOPMACNT+24                                              02016000
IOPBUNT  EQU   IOPMACFX                                                 02017000
IOPMCEND EQU   IOPMACNT+104                                             02018000
IOPMACVR EQU   IOPMCEND                                                 02019000
IOPMCENT EQU   IOPMACVR                                                 02020000
IOPMCDTA EQU   IOPMCENT                                                 02021000
IOPMCASM EQU   IOPMCDTA                                                 02022000
IOPMACID EQU   IOPMCASM                                                 02023000
IOPMACST EQU   IOPMCASM+7                                               02024000
IOPMCIND EQU   IOPMCENT+8                                               02025000
IOPEOFNT EQU   IOPUDATA                                                 02026000
IOPSRCNT EQU   IOPUDATA                                                 02027000
IOPSRCDR EQU   IOPSRCNT                                                 02028000
@NM00083 EQU   IOPSRCDR+1                                               02029000
@NM00085 EQU   @NM00083+7                                               02030000
@NM00089 EQU   IOPSRCDR+9                                               02031000
IOPSRCFX EQU   IOPSRCNT+24                                              02032000
@NM00093 EQU   IOPSRCFX                                                 02033000
IOPSREND EQU   IOPSRCNT+104                                             02034000
IOPSRCVR EQU   IOPSREND                                                 02035000
IOPSNTRY EQU   IOPSRCVR                                                 02036000
IOPSRDTA EQU   IOPSNTRY                                                 02037000
IOPSRCID EQU   IOPSRDTA                                                 02038000
IOPSRCST EQU   IOPSRDTA+7                                               02039000
IOPMODNT EQU   IOPUDATA                                                 02040000
IOPMODDR EQU   IOPMODNT                                                 02041000
@NM00099 EQU   IOPMODDR+1                                               02042000
@NM00101 EQU   @NM00099+7                                               02043000
@NM00105 EQU   IOPMODDR+9                                               02044000
IOPMODFX EQU   IOPMODNT+24                                              02045000
@NM00109 EQU   IOPMODFX                                                 02046000
IOPMDLEP EQU   IOPMODFX+8                                               02047000
IOPMODF1 EQU   IOPMDLEP                                                 02048000
IOPMODF2 EQU   IOPMDLEP+1                                               02049000
IOPMODF3 EQU   IOPMDLEP+2                                               02050000
IOPMODF4 EQU   IOPMDLEP+3                                               02051000
IOPMDEND EQU   IOPMODNT+104                                             02052000
IOPMODVR EQU   IOPMDEND                                                 02053000
IOPMNTRY EQU   IOPMODVR                                                 02054000
IOPMDDTA EQU   IOPMNTRY                                                 02055000
IOPLMODS EQU   IOPMDDTA                                                 02056000
IOPMODID EQU   IOPLMODS                                                 02057000
IOPMODST EQU   IOPLMODS+7                                               02058000
IOPDLBNT EQU   IOPUDATA                                                 02059000
IOPDLBDR EQU   IOPDLBNT                                                 02060000
IOPDLBFX EQU   IOPDLBNT+24                                              02061000
@NM00120 EQU   IOPDLBFX                                                 02062000
IOPDLEND EQU   IOPDLBNT+104                                             02063000
IOPDLBVR EQU   IOPDLEND                                                 02064000
IOPDNTRY EQU   IOPDLBVR                                                 02065000
IOPDSYS  EQU   IOPDNTRY                                                 02066000
IOPSYSNT EQU   IOPUDATA                                                 02067000
IOPSYSDR EQU   IOPSYSNT                                                 02068000
IOPSYSF1 EQU   IOPSYSDR+4                                               02069000
IOPFLGS7 EQU   IOPSYSF1                                                 02070000
IOPSYSFX EQU   IOPSYSNT+24                                              02071000
@NM00127 EQU   IOPSYSFX                                                 02072000
IOPSYEND EQU   IOPSYSNT+184                                             02073000
IOPSYSVR EQU   IOPSYEND                                                 02074000
IOPSYSTR EQU   IOPSYSVR                                                 02075000
IOPSYNTR EQU   IOPSYSTR                                                 02076000
IOPPTFNT EQU   IOPUDATA                                                 02077000
IOPPTFDR EQU   IOPPTFNT                                                 02078000
IOPPSTAT EQU   IOPPTFDR+2                                               02079000
IOPPTFF1 EQU   IOPPSTAT                                                 02080000
IOPFLGS5 EQU   IOPPTFF1                                                 02081000
IOPPTFF2 EQU   IOPPSTAT+1                                               02082000
IOPPTFF3 EQU   IOPPSTAT+3                                               02083000
IOPPTFFX EQU   IOPPTFNT+24                                              02084000
@NM00136 EQU   IOPPTFFX                                                 02085000
@NM00137 EQU   @NM00136                                                 02086000
IOPPDTES EQU   IOPPTFFX+41                                              02087000
@NM00140 EQU   IOPPDTES                                                 02088000
IOPPTPFX EQU   IOPPDTES+6                                               02089000
IOPDATES EQU   IOPPTPFX                                                 02090000
IOPPTEND EQU   IOPPTFNT+104                                             02091000
IOPPTFVR EQU   IOPPTEND                                                 02092000
IOPPNTRY EQU   IOPPTFVR                                                 02093000
IOPPMODS EQU   IOPPNTRY                                                 02094000
IOPENTNT EQU   IOPUDATA+104                                             02095000
IOPSRLNT EQU   IOPUDATA+104                                             02096000
IOPPRENT EQU   IOPUDATA+104                                             02097000
IOPNPRNT EQU   IOPUDATA+104                                             02098000
IOPSUPNT EQU   IOPUDATA+104                                             02099000
IOPREQNT EQU   IOPUDATA+104                                             02100000
IOPIRQNT EQU   IOPUDATA+104                                             02101000
IOPFIDNT EQU   IOPUDATA+104                                             02102000
IOPDELNT EQU   IOPUDATA+104                                             02103000
IOPVERNT EQU   IOPUDATA+104                                             02104000
IOPSBYNT EQU   IOPUDATA+104                                             02105000
IOPQSMNT EQU   IOPUDATA                                                 02106000
IOPQSMDR EQU   IOPQSMNT                                                 02107000
IOPQFMNT EQU   IOPUDATA                                                 02108000
IOPQFMDR EQU   IOPQFMNT                                                 02109000
IOPQFEND EQU   IOPQFMNT+2                                               02110000
IOPQFMVR EQU   IOPQFEND                                                 02111000
IOPQFMLS EQU   IOPQFMVR                                                 02112000
IOPQFMNM EQU   IOPQFMLS                                                 02113000
IOPPTSYS EQU   IOPUDATA                                                 02114000
IOPPTSDR EQU   IOPPTSYS                                                 02115000
IOPPTSFX EQU   IOPPTSYS+24                                              02116000
IOPDSSPC EQU   IOPPTSFX                                                 02117000
IOPPTFG1 EQU   IOPPTSFX+34                                              02118000
IOPPSEND EQU   IOPPTSYS+1064                                            02119000
IOPPTSVR EQU   IOPPSEND                                                 02120000
IOPPTNTR EQU   IOPPTSVR                                                 02121000
@NM00165 EQU   IOPPTNTR                                                 02122000
IOPPTFMD EQU   @NM00165                                                 02123000
IOPPTREL EQU   IOPPTFMD                                                 02124000
IOPBPDS  EQU   IOPUDATA                                                 02125000
IOPBLEP1 EQU   IOPBPDS+8                                                02126000
IOPBLEP2 EQU   IOPBPDS+9                                                02127000
@NM00169 EQU   IOPBPDS+18                                               02128000
IOPBFTB0 EQU   @NM00169                                                 02129000
IOPBFTB1 EQU   IOPBFTB0                                                 02130000
DSCKEY   EQU   DSCEND                                                   02131000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02132000
IOPBCEND EQU   IOPBPDS+21                                               02133000
IOPBFTB3 EQU   IOPBFTB0+2                                               02134000
IOPBFTB2 EQU   IOPBFTB0+1                                               02135000
@NM00171 EQU   IOPBFTB1                                                 02136000
IOPBAPFP EQU   IOPBFTB1                                                 02137000
IOPBSSI  EQU   IOPBFTB1                                                 02138000
IOPBPAGA EQU   IOPBFTB1                                                 02139000
@NM00170 EQU   IOPBFTB1                                                 02140000
IOPBAOSL EQU   IOPBFTB1                                                 02141000
IOPBSEPA EQU   IOPBPDS+15                                               02142000
IOPBFTBL EQU   IOPBPDS+13                                               02143000
IOPBSTOR EQU   IOPBPDS+10                                               02144000
IOPBREFR EQU   IOPBLEP2                                                 02145000
IOPBLEF  EQU   IOPBLEP2                                                 02146000
IOPBTEST EQU   IOPBLEP2                                                 02147000
IOPBNE   EQU   IOPBLEP2                                                 02148000
@NM00168 EQU   IOPBLEP2                                                 02149000
IOPBDC   EQU   IOPBLEP2                                                 02150000
@NM00167 EQU   IOPBLEP1                                                 02151000
IOPBSCTR EQU   IOPBLEP1                                                 02152000
IOPBOL   EQU   IOPBLEP1                                                 02153000
@NM00166 EQU   IOPBLEP1                                                 02154000
IOPBOVLY EQU   IOPBLEP1                                                 02155000
IOPBREUS EQU   IOPBLEP1                                                 02156000
IOPBRENT EQU   IOPBLEP1                                                 02157000
IOPBNL   EQU   IOPBPDS+7                                                02158000
IOPBTTRN EQU   IOPBPDS+4                                                02159000
IOPBZERO EQU   IOPBPDS+3                                                02160000
IOPBTTRT EQU   IOPBPDS                                                  02161000
IOPPTIND EQU   IOPPTNTR+8                                               02162000
IOPPTSND EQU   IOPPTREL                                                 02163000
@NM00164 EQU   IOPPTSFX+872                                             02164000
IOPSYZPP EQU   IOPPTSFX+772                                             02165000
IOPSYZPR EQU   IOPPTSFX+771                                             02166000
IOPSYZPS EQU   IOPPTSFX+763                                             02167000
IOPSYZAP EQU   IOPPTSFX+755                                             02168000
IOPSYUPP EQU   IOPPTSFX+655                                             02169000
IOPSYUPR EQU   IOPPTSFX+654                                             02170000
IOPSYUPS EQU   IOPPTSFX+646                                             02171000
IOPSYUPD EQU   IOPPTSFX+638                                             02172000
IOPSYSPP EQU   IOPPTSFX+538                                             02173000
IOPSYSPR EQU   IOPPTSFX+537                                             02174000
IOPSYSPS EQU   IOPPTSFX+529                                             02175000
IOPSYSUP EQU   IOPPTSFX+521                                             02176000
IOPSYLKP EQU   IOPPTSFX+421                                             02177000
IOPSYLKR EQU   IOPPTSFX+420                                             02178000
IOPSYLKS EQU   IOPPTSFX+412                                             02179000
IOPSYLKD EQU   IOPPTSFX+404                                             02180000
IOPSYCPP EQU   IOPPTSFX+304                                             02181000
IOPSYCPR EQU   IOPPTSFX+303                                             02182000
IOPSYCPS EQU   IOPPTSFX+295                                             02183000
IOPSYCPY EQU   IOPPTSFX+287                                             02184000
IOPSYCOP EQU   IOPPTSFX+187                                             02185000
IOPSYCOR EQU   IOPPTSFX+186                                             02186000
IOPSYCOS EQU   IOPPTSFX+178                                             02187000
IOPSYCOM EQU   IOPPTSFX+170                                             02188000
IOPSYASP EQU   IOPPTSFX+70                                              02189000
IOPSYASR EQU   IOPPTSFX+69                                              02190000
IOPSYASS EQU   IOPPTSFX+61                                              02191000
IOPSYASM EQU   IOPPTSFX+53                                              02192000
@NM00163 EQU   IOPPTSFX+35                                              02193000
@NM00162 EQU   IOPPTFG1                                                 02194000
IOPPTSNJ EQU   IOPPTFG1                                                 02195000
IOPPTSNP EQU   IOPPTFG1                                                 02196000
IOPSYPLN EQU   IOPPTSFX+32                                              02197000
IOPDSPFX EQU   IOPPTSFX+6                                               02198000
IOPDSDIR EQU   IOPDSSPC+4                                               02199000
IOPDSSEC EQU   IOPDSSPC+2                                               02200000
IOPDSPRM EQU   IOPDSSPC                                                 02201000
@NM00161 EQU   IOPPTSDR+4                                               02202000
IOPPTPEM EQU   IOPPTSDR+2                                               02203000
IOPPCNVL EQU   IOPPTSDR+1                                               02204000
@NM00160 EQU   IOPPTSDR                                                 02205000
IOPQFMTP EQU   IOPQFMLS+8                                               02206000
@NM00159 EQU   IOPQFMLS+7                                               02207000
IOPQFMND EQU   IOPQFMNM                                                 02208000
@NM00158 EQU   IOPQFMDR                                                 02209000
@NM00154 EQU   IOPQSMDR                                                 02210000
@NM00153 EQU   IOPSBYNT+8                                               02211000
IOPSBYST EQU   IOPSBYNT+7                                               02212000
IOPSBYNM EQU   IOPSBYNT                                                 02213000
@NM00152 EQU   IOPVERNT+8                                               02214000
IOPVERST EQU   IOPVERNT+7                                               02215000
IOPVERNM EQU   IOPVERNT                                                 02216000
@NM00151 EQU   IOPDELNT+8                                               02217000
IOPDELST EQU   IOPDELNT+7                                               02218000
IOPDELNM EQU   IOPDELNT                                                 02219000
@NM00150 EQU   IOPFIDNT+8                                               02220000
IOPFIDST EQU   IOPFIDNT+7                                               02221000
IOPFIDNM EQU   IOPFIDNT                                                 02222000
@NM00149 EQU   IOPIRQNT+8                                               02223000
IOPIRQST EQU   IOPIRQNT+7                                               02224000
IOPIRQNM EQU   IOPIRQNT                                                 02225000
@NM00148 EQU   IOPREQNT+8                                               02226000
IOPREQST EQU   IOPREQNT+7                                               02227000
IOPREQNM EQU   IOPREQNT                                                 02228000
@NM00147 EQU   IOPSUPNT+8                                               02229000
IOPSUPST EQU   IOPSUPNT+7                                               02230000
IOPSUPNM EQU   IOPSUPNT                                                 02231000
@NM00146 EQU   IOPNPRNT+8                                               02232000
IOPNPRST EQU   IOPNPRNT+7                                               02233000
IOPNPRNM EQU   IOPNPRNT                                                 02234000
@NM00145 EQU   IOPPRENT+8                                               02235000
IOPPREST EQU   IOPPRENT+7                                               02236000
IOPPRENM EQU   IOPPRENT                                                 02237000
@NM00144 EQU   IOPSRLNT+8                                               02238000
IOPSRLST EQU   IOPSRLNT+7                                               02239000
@NM00143 EQU   IOPSRLNT+4                                               02240000
IOPSRLNM EQU   IOPSRLNT                                                 02241000
@NM00142 EQU   IOPENTNT+8                                               02242000
IOPENTST EQU   IOPENTNT+7                                               02243000
IOPENTNM EQU   IOPENTNT                                                 02244000
IOPPIND  EQU   IOPPNTRY+8                                               02245000
IOPPTFND EQU   IOPPMODS                                                 02246000
IOPPFMID EQU   IOPPTFFX+73                                              02247000
@NM00141 EQU   IOPPTPFX+24                                              02248000
IOPUCLT  EQU   IOPDATES+21                                              02249000
IOPUCLD  EQU   IOPDATES+18                                              02250000
IOPACCT  EQU   IOPDATES+15                                              02251000
IOPACCD  EQU   IOPDATES+12                                              02252000
IOPRSTT  EQU   IOPDATES+9                                               02253000
IOPRSTD  EQU   IOPDATES+6                                               02254000
IOPAPPT  EQU   IOPDATES+3                                               02255000
IOPAPPD  EQU   IOPDATES                                                 02256000
IOPRECT  EQU   @NM00140+3                                               02257000
IOPRECD  EQU   @NM00140                                                 02258000
@NM00139 EQU   IOPPTFFX+8                                               02259000
@NM00138 EQU   @NM00136+7                                               02260000
IOPPRELN EQU   @NM00137                                                 02261000
@NM00135 EQU   IOPPTFDR+20                                              02262000
IOPSBYNO EQU   IOPPTFDR+13                                              02263000
IOPDBYNO EQU   IOPPTFDR+6                                               02264000
@NM00134 EQU   IOPPTFF3                                                 02265000
IOPFLF   EQU   IOPPTFF3                                                 02266000
IOPDBYP  EQU   IOPPTFF3                                                 02267000
IOPSBYP  EQU   IOPPTFF3                                                 02268000
IOPPMDLP EQU   IOPPTFF2+1                                               02269000
IOPPADDP EQU   IOPPTFF2+1                                               02270000
@NM00133 EQU   IOPPTFF2+1                                               02271000
IOPLRFP  EQU   IOPPTFF2                                                 02272000
IOPJCLP  EQU   IOPPTFF2                                                 02273000
IOPSUPP  EQU   IOPPTFF2                                                 02274000
IOPREQP  EQU   IOPPTFF2                                                 02275000
IOPPREP  EQU   IOPPTFF2                                                 02276000
IOPNPRP  EQU   IOPPTFF2                                                 02277000
IOPIRQP  EQU   IOPPTFF2                                                 02278000
IOPDELP  EQU   IOPPTFF2                                                 02279000
IOPREGEN EQU   IOPFLGS5                                                 02280000
IOPBYP   EQU   IOPFLGS5                                                 02281000
IOPDUMMP EQU   IOPFLGS5                                                 02282000
@NM00132 EQU   IOPFLGS5                                                 02283000
IOPERROR EQU   IOPFLGS5                                                 02284000
IOPACC   EQU   IOPFLGS5                                                 02285000
IOPRES   EQU   IOPFLGS5                                                 02286000
IOPAPP   EQU   IOPFLGS5                                                 02287000
IOPPTYPE EQU   IOPPTFDR+1                                               02288000
@NM00131 EQU   IOPPTFDR                                                 02289000
IOPSYSTP EQU   IOPSYSTR+8                                               02290000
IOPSYSND EQU   IOPSYNTR                                                 02291000
@NM00130 EQU   IOPSYSFX+21                                              02292000
IOPSYSID EQU   IOPSYSFX+13                                              02293000
IOPNUCID EQU   IOPSYSFX+12                                              02294000
IOPSREL  EQU   IOPSYSFX+8                                               02295000
@NM00129 EQU   @NM00127+7                                               02296000
@NM00128 EQU   @NM00127                                                 02297000
@NM00126 EQU   IOPSYSDR+5                                               02298000
@NM00125 EQU   IOPFLGS7                                                 02299000
IOPSYNG  EQU   IOPFLGS7                                                 02300000
IOPSYDL  EQU   IOPFLGS7                                                 02301000
IOPSTSNP EQU   IOPFLGS7                                                 02302000
IOPMTSNP EQU   IOPFLGS7                                                 02303000
IOPPEMAX EQU   IOPSYSDR+2                                               02304000
IOPSCNVL EQU   IOPSYSDR+1                                               02305000
@NM00124 EQU   IOPSYSDR                                                 02306000
IOPDLIND EQU   IOPDNTRY+8                                               02307000
IOPDLBND EQU   IOPDSYS                                                  02308000
@NM00123 EQU   IOPDLBFX+8                                               02309000
@NM00122 EQU   @NM00120+7                                               02310000
@NM00121 EQU   @NM00120                                                 02311000
@NM00119 EQU   IOPDLBDR+1                                               02312000
@NM00118 EQU   IOPDLBDR                                                 02313000
IOPMDIND EQU   IOPMNTRY+8                                               02314000
@NM00117 EQU   IOPMODST                                                 02315000
IOPMODND EQU   IOPMODID                                                 02316000
IOPDLIB  EQU   IOPMODFX+72                                              02317000
@NM00116 EQU   IOPMODFX+12                                              02318000
@NM00115 EQU   IOPMODF4                                                 02319000
@NM00114 EQU   IOPMODF3                                                 02320000
@NM00113 EQU   IOPMODF2                                                 02321000
IOPMPAGA EQU   IOPMODF2                                                 02322000
IOPMNE   EQU   IOPMODF2                                                 02323000
@NM00112 EQU   IOPMODF1                                                 02324000
IOPMDC   EQU   IOPMODF1                                                 02325000
IOPMREFR EQU   IOPMODF1                                                 02326000
IOPMOVLY EQU   IOPMODF1                                                 02327000
IOPMSCTR EQU   IOPMODF1                                                 02328000
IOPMREUS EQU   IOPMODF1                                                 02329000
IOPMRENT EQU   IOPMODF1                                                 02330000
IOPMAPF  EQU   IOPMODF1                                                 02331000
@NM00111 EQU   @NM00109+7                                               02332000
@NM00110 EQU   @NM00109                                                 02333000
@NM00108 EQU   IOPMODDR+17                                              02334000
@NM00107 EQU   @NM00105+7                                               02335000
@NM00106 EQU   @NM00105                                                 02336000
@NM00104 EQU   @NM00101                                                 02337000
@NM00103 EQU   @NM00101                                                 02338000
@NM00102 EQU   @NM00101                                                 02339000
@NM00100 EQU   @NM00099                                                 02340000
@NM00098 EQU   IOPMODDR                                                 02341000
IOPSRIND EQU   IOPSNTRY+8                                               02342000
@NM00097 EQU   IOPSRCST                                                 02343000
IOPSRCND EQU   IOPSRCID                                                 02344000
IOPSRDLB EQU   IOPSRCFX+72                                              02345000
IOPSRSYS EQU   IOPSRCFX+64                                              02346000
@NM00096 EQU   IOPSRCFX+8                                               02347000
@NM00095 EQU   @NM00093+7                                               02348000
@NM00094 EQU   @NM00093                                                 02349000
@NM00092 EQU   IOPSRCDR+18                                              02350000
IOPSRLNG EQU   IOPSRCDR+17                                              02351000
@NM00091 EQU   @NM00089+7                                               02352000
@NM00090 EQU   @NM00089                                                 02353000
@NM00088 EQU   @NM00085                                                 02354000
@NM00087 EQU   @NM00085                                                 02355000
@NM00086 EQU   @NM00085                                                 02356000
@NM00084 EQU   @NM00083                                                 02357000
@NM00082 EQU   IOPSRCDR                                                 02358000
IOPEOFND EQU   IOPEOFNT                                                 02359000
IOPMCTYP EQU   IOPMCIND                                                 02360000
@NM00081 EQU   IOPMACST                                                 02361000
IOPMACND EQU   IOPMACID                                                 02362000
IOPMCDLB EQU   IOPMACFX+72                                              02363000
IOPMCSYS EQU   IOPMACFX+64                                              02364000
@NM00080 EQU   IOPMACFX+8                                               02365000
IOPBUTYP EQU   IOPBUNT+7                                                02366000
IOPBUSMD EQU   IOPBUNT                                                  02367000
@NM00079 EQU   IOPMACDR+18                                              02368000
IOPMCLNG EQU   IOPMACDR+17                                              02369000
IOPFMST  EQU   IOPFMIDE+7                                               02370000
IOPFMID  EQU   IOPFMIDE                                                 02371000
@NM00078 EQU   IOPRMST                                                  02372000
IOPRMASM EQU   IOPRMST                                                  02373000
@NM00077 EQU   IOPRMST                                                  02374000
IOPRMID  EQU   IOPRMIDE                                                 02375000
@NM00076 EQU   IOPMACDR                                                 02376000
IOPLMIND EQU   IOPLNTRY+8                                               02377000
IOPLMDND EQU   IOPSYSLB                                                 02378000
@NM00074 EQU   @NM00072+7                                               02379000
@NM00073 EQU   @NM00072                                                 02380000
@NM00071 EQU   IOPLMDDR+6                                               02381000
@NM00070 EQU   IOPFLGS3                                                 02382000
IOPCHREP EQU   IOPFLGS3                                                 02383000
IOPLINK  EQU   IOPFLGS3                                                 02384000
IOPCOPY  EQU   IOPFLGS3                                                 02385000
@NM00069 EQU   IOPLMDF4                                                 02386000
@NM00068 EQU   IOPLMDF3                                                 02387000
@NM00067 EQU   IOPLMDF2                                                 02388000
IOPPAGA  EQU   IOPLMDF2                                                 02389000
IOPNE    EQU   IOPLMDF2                                                 02390000
@NM00066 EQU   IOPFLGS2                                                 02391000
IOPDC    EQU   IOPFLGS2                                                 02392000
IOPREFR  EQU   IOPFLGS2                                                 02393000
IOPOVLY  EQU   IOPFLGS2                                                 02394000
IOPSCTR  EQU   IOPFLGS2                                                 02395000
IOPREUS  EQU   IOPFLGS2                                                 02396000
IOPRENT  EQU   IOPFLGS2                                                 02397000
IOPAPF   EQU   IOPFLGS2                                                 02398000
@NM00065 EQU   IOPLMDDR                                                 02399000
@NM00064 EQU   IOPASMDR+9                                               02400000
IOPABUTP EQU   IOPABUNT+7                                               02401000
IOPABUPT EQU   IOPABUNT                                                 02402000
IOPNTLVL EQU   IOPASMDR                                                 02403000
IOPALLOC EQU   @NM00063+4                                               02404000
IOPUSED  EQU   @NM00063                                                 02405000
IOPTPSEQ EQU   @NM00062+8                                               02406000
IOPVLSER EQU   @NM00062+2                                               02407000
IOPBLKSI EQU   @NM00062                                                 02408000
IOPCQMAX EQU   IOPCQMAP+12                                              02409000
@NM00061 EQU   IOPCQMAP+11                                              02410000
@NM00060 EQU   IOPCQMAP+8                                               02411000
@NM00059 EQU   IOPCQMAP                                                 02412000
IOPPTMAX EQU   IOPCDMAX                                                 02413000
@NM00058 EQU   IOPSCMAP+11                                              02414000
@NM00057 EQU   IOPSCMAP+8                                               02415000
@NM00056 EQU   IOPSCMAP                                                 02416000
IOPDIRMX EQU   IOPNTMAX+12                                              02417000
@NM00055 EQU   IOPNTMAX+11                                              02418000
@NM00054 EQU   IOPNTMAX+8                                               02419000
@NM00053 EQU   IOPNTMAX                                                 02420000
@NM00052 EQU   IOPDTYPE                                                 02421000
IOPDMOD  EQU   IOPDTYPE                                                 02422000
IOPDJCL  EQU   IOPDTYPE                                                 02423000
IOPDSRC  EQU   IOPDTYPE                                                 02424000
IOPDMAC  EQU   IOPDTYPE                                                 02425000
IOPSDIR  EQU   IOPSPACE+4                                               02426000
IOPSSCND EQU   IOPSPACE+2                                               02427000
IOPSPRIM EQU   IOPSPACE                                                 02428000
IOPNTYPE EQU   IOPSTCMP+17                                              02429000
IOPNNAME EQU   IOPSTCMP+9                                               02430000
IOPOTYPE EQU   IOPSTCMP+8                                               02431000
IOPONAME EQU   IOPSTCMP                                                 02432000
IOPISEQ3 EQU   IOPINAM3+6                                               02433000
IOPITYP3 EQU   @NM00051+5                                               02434000
IOPIPTF3 EQU   @NM00051                                                 02435000
UPDFLG8  EQU   UPDFLAGS                                                 02436000
UPDFLG7  EQU   UPDFLAGS                                                 02437000
UPDFLG6  EQU   UPDFLAGS                                                 02438000
UPDFLG5  EQU   UPDFLAGS                                                 02439000
UPDFLG4  EQU   UPDFLAGS                                                 02440000
UPDTRACE EQU   UPDFLG2                                                  02441000
UPDCHECK EQU   UPDFLG1                                                  02442000
@NM00001 EQU   UPDPARM+61                                               02443000
DSCMINLN EQU   DSCANMAP+14                                              02444000
DSCMAXLN EQU   DSCANMAP+13                                              02445000
@NM00176 EQU   DSCFLAG                                                  02446000
DSCCALRT EQU   DSCFLAG                                                  02447000
DSCHEX   EQU   DSCFLAG                                                  02448000
DSCCOMMA EQU   DSCFLAG                                                  02449000
DSCCONT  EQU   DSCFLAG                                                  02450000
DSCBLANK EQU   DSCFLAG                                                  02451000
DSCNUMER EQU   DSCFLAG                                                  02452000
DSCALPHA EQU   DSCFLAG                                                  02453000
DSCRTAD  EQU   DSCANMAP+8                                               02454000
DSCSUCAD EQU   DSCANMAP+4                                               02455000
DSCALTAD EQU   DSCANMAP                                                 02456000
IOPBS04E EQU   IOPBS04+2                                                02457000
IOPBAPFC EQU   IOPBAPF+1                                                02458000
IOPBAPFL EQU   IOPBAPF                                                  02459000
IOPBS2NM EQU   IOPBS02+3                                                02460000
IOPBS2EP EQU   IOPBS02                                                  02461000
IOPQSMTP EQU   IOPQSMLS+8                                               02462000
@NM00157 EQU   IOPQSMLS+7                                               02463000
IOPQSMND EQU   IOPQSMNM                                                 02464000
@NM00156 EQU   @NM00155+7                                               02465000
IOPQSMFM EQU   @NM00155                                                 02466000
@NM00075 EQU   IOPLMCTL+17                                              02467000
IOPLMCRD EQU   IOPLMCTL+9                                               02468000
IOPLMCRN EQU   IOPLMCTL+1                                               02469000
IOPLMCC  EQU   IOPLMCTL                                                 02470000
@NM00050 EQU   IOPUSERL                                                 02471000
@NM00049 EQU   IOPUSERL                                                 02472000
IOPALIS  EQU   IOPUSERL                                                 02473000
IOPTTR   EQU   IOPDRMAP+8                                               02474000
IOPINAM2 EQU   IOPINAM+1                                                02475000
IOPITYP2 EQU   IOPITYP                                                  02476000
@NM00048 EQU   HMASMIOP+32                                              02477000
IOPDELDD EQU   IOPDDNAM                                                 02478000
@NM00047 EQU   @NM00044+10                                              02479000
IOPSEQNO EQU   @NM00044+8                                               02480000
@NM00046 EQU   @NM00045+7                                               02481000
IOPPTFNM EQU   @NM00045                                                 02482000
IOPNAM17 EQU   IOPNAME                                                  02483000
CCABMREC EQU   CCABELMT+10                                              02484000
CCABPOS  EQU   CCABMPOS+8                                               02485000
CCABNAME EQU   CCABMPOS                                                 02486000
@NM00043 EQU   CCABLDLM+2                                               02487000
@NM00042 EQU   CCABLDLM                                                 02488000
CCAUPDPM EQU   @NM00040+24                                              02489000
@NM00041 EQU   @NM00040+21                                              02490000
CCARUPDT EQU   CCAUPDRC                                                 02491000
CCAUPDSP EQU   @NM00040+12                                              02492000
CCAUPDTE EQU   @NM00040+8                                               02493000
CCAUPDNM EQU   @NM00040                                                 02494000
CCASUPPM EQU   @NM00038+24                                              02495000
@NM00039 EQU   @NM00038+21                                              02496000
CCARSUP  EQU   CCASUPRC                                                 02497000
CCASUPSP EQU   @NM00038+12                                              02498000
CCAIOSUP EQU   @NM00038+8                                               02499000
CCASUPNM EQU   @NM00038                                                 02500000
CCAZAPPM EQU   @NM00036+24                                              02501000
@NM00037 EQU   @NM00036+21                                              02502000
CCARZAP  EQU   CCAZAPRC                                                 02503000
CCAZAPSP EQU   @NM00036+12                                              02504000
CCASPZAP EQU   @NM00036+8                                               02505000
CCAZAPNM EQU   @NM00036                                                 02506000
CCACOMPM EQU   @NM00034+24                                              02507000
@NM00035 EQU   @NM00034+21                                              02508000
CCARCOMP EQU   CCACOMRC                                                 02509000
CCACOMSP EQU   @NM00034+12                                              02510000
CCACOMRS EQU   @NM00034+8                                               02511000
CCACOMNM EQU   @NM00034                                                 02512000
CCACPYPM EQU   @NM00032+24                                              02513000
@NM00033 EQU   @NM00032+21                                              02514000
CCARCOPY EQU   CCACPYRC                                                 02515000
CCACPYSP EQU   @NM00032+12                                              02516000
CCACOPY  EQU   @NM00032+8                                               02517000
CCACPYNM EQU   @NM00032                                                 02518000
CCAASMPM EQU   @NM00030+24                                              02519000
@NM00031 EQU   @NM00030+21                                              02520000
CCARASM  EQU   CCAASMRC                                                 02521000
CCAASMSP EQU   @NM00030+12                                              02522000
CCAASM   EQU   @NM00030+8                                               02523000
CCAASMNM EQU   @NM00030                                                 02524000
CCALKDPM EQU   @NM00028+24                                              02525000
@NM00029 EQU   @NM00028+21                                              02526000
CCARLINK EQU   CCALKDRC                                                 02527000
CCALKDSP EQU   @NM00028+12                                              02528000
CCALKED  EQU   @NM00028+8                                               02529000
CCALKDNM EQU   @NM00028                                                 02530000
CCAPGMPM EQU   @NM00026+24                                              02531000
@NM00027 EQU   @NM00026+21                                              02532000
CCABPGRC EQU   @NM00026+20                                              02533000
CCABPGSP EQU   @NM00026+12                                              02534000
CCABPGAD EQU   @NM00026+8                                               02535000
CCABPGNM EQU   @NM00026                                                 02536000
CCAEND   EQU   HMASMCCA+371                                             02537000
@NM00025 EQU   HMASMCCA+309                                             02538000
CCACURDD EQU   CCAFDSNG+3                                               02539000
CCACURDS EQU   CCAFDSNG+2                                               02540000
@NM00024 EQU   CCAFLAGB                                                 02541000
CCAOUTNG EQU   CCAFLAGB                                                 02542000
CCALOGNG EQU   CCAFLAGB                                                 02543000
CCAFMID  EQU   HMASMCCA+291                                             02544000
CCALSTDS EQU   CCAFCTL+8                                                02545000
CCARPTDS EQU   CCAFCTL+7                                                02546000
CCATIME  EQU   CCAFCTL+4                                                02547000
CCADATE  EQU   CCAFCTL+1                                                02548000
@NM00023 EQU   CCAFLAG9                                                 02549000
CCARVCAN EQU   CCAFLAG9                                                 02550000
CCARVEST EQU   CCAFLAG9                                                 02551000
CCAPTSNJ EQU   CCAFLAG9                                                 02552000
CCASTSNP EQU   CCAFLAG9                                                 02553000
CCAMTSNP EQU   CCAFLAG9                                                 02554000
CCAPTSNP EQU   CCAFLAG9                                                 02555000
@NM00022 EQU   CCAFLAG8                                                 02556000
CCAACDSC EQU   CCAFLAG8                                                 02557000
CCACDSC  EQU   CCAFLAG8                                                 02558000
@NM00021 EQU   CCAFLAG6                                                 02559000
CCAACRUP EQU   CCAFLAG6                                                 02560000
CCACRQUP EQU   CCAFLAG6                                                 02561000
CCAACDUP EQU   CCAFLAG6                                                 02562000
CCACDSUP EQU   CCAFLAG6                                                 02563000
@NM00020 EQU   CCAFLAG5                                                 02564000
CCAACROS EQU   CCAFLAG5                                                 02565000
CCACRQOS EQU   CCAFLAG5                                                 02566000
CCAACDOS EQU   CCAFLAG5                                                 02567000
CCACDSOS EQU   CCAFLAG5                                                 02568000
@NM00019 EQU   CCAFLAG4                                                 02569000
CCAACRIS EQU   CCAFLAG4                                                 02570000
CCACRQIS EQU   CCAFLAG4                                                 02571000
CCAACDIS EQU   CCAFLAG4                                                 02572000
CCACDSIS EQU   CCAFLAG4                                                 02573000
@NM00018 EQU   CCAFLAG3+1                                               02574000
CCARGNP  EQU   CCAFLAG3+1                                               02575000
CCADISRQ EQU   CCAFLAG3+1                                               02576000
CCAICTOK EQU   CCAFLAG3                                                 02577000
CCADELP  EQU   CCAFLAG3                                                 02578000
CCACMPRS EQU   CCAFLAG3                                                 02579000
CCAZAPP  EQU   CCAFLAG3                                                 02580000
CCALINKP EQU   CCAFLAG3                                                 02581000
CCACOPYP EQU   CCAFLAG3                                                 02582000
CCAASIP  EQU   CCAFLAG3                                                 02583000
CCAUPDP  EQU   CCAFLAG3                                                 02584000
CCAEOSMP EQU   CCAFLAG2                                                 02585000
CCAEOFNC EQU   CCAFLAG2                                                 02586000
@NM00017 EQU   CCAFLAG2                                                 02587000
CCACHECK EQU   CCAFLAG2                                                 02588000
CCATERM  EQU   CCAFLAG2                                                 02589000
CCASVCLB EQU   CCAFLAG2                                                 02590000
CCANCPTF EQU   CCAFLAG2                                                 02591000
@NM00016 EQU   CCAFLAG1+1                                               02592000
CCAUNL   EQU   CCAFLAG1+1                                               02593000
CCARESET EQU   CCAFLAG1+1                                               02594000
CCALOG   EQU   CCAFLAG1+1                                               02595000
CCACNV   EQU   CCAFLAG1+1                                               02596000
CCALIST  EQU   CCAFLAG1                                                 02597000
CCAUPDU  EQU   CCAFLAG1                                                 02598000
CCAUPDJ  EQU   CCAFLAG1                                                 02599000
CCARES   EQU   CCAFLAG1                                                 02600000
CCAREJ   EQU   CCAFLAG1                                                 02601000
CCAACCPT EQU   CCAFLAG1                                                 02602000
CCAAPPLY EQU   CCAFLAG1                                                 02603000
CCAREC   EQU   CCAFLAG1                                                 02604000
CCAFUNCT EQU   CCAFFUNC                                                 02605000
@NM00015 EQU   @NM00010+18                                              02606000
@NM00014 EQU   @NM00010+16                                              02607000
CCATBLPA EQU   @NM00010+12                                              02608000
@NM00013 EQU   @NM00010+8                                               02609000
@NM00012 EQU   @NM00010+4                                               02610000
@NM00011 EQU   @NM00010                                                 02611000
CCAIFGTP EQU   CCAFGTP+16                                               02612000
CCAGTP3  EQU   CCAFGTP+12                                               02613000
CCAGTP2  EQU   CCAFGTP+8                                                02614000
CCAGTP1  EQU   CCAFGTP+4                                                02615000
CCASETAD EQU   CCASEGTP                                                 02616000
CCACLST  EQU   CCAFPGM+12                                               02617000
CCASPDCB EQU   CCAFPGM+8                                                02618000
CCAICLMD EQU   CCAFICT+12                                               02619000
CCAICMOD EQU   CCAFICT+8                                                02620000
CCAICPTF EQU   CCAFICT+4                                                02621000
CCAICT   EQU   CCAFICT                                                  02622000
CCARVAD  EQU   CCAFSTA                                                  02623000
CCAACDID EQU   CCAFSYS+32                                               02624000
CCACDSID EQU   CCAFSYS+24                                               02625000
CCALNLEN EQU   CCAFSYS+22                                               02626000
@NM00009 EQU   CCAFLAGA                                                 02627000
CCAPSYSF EQU   CCAFLAGA                                                 02628000
CCAASYSF EQU   CCAFLAGA                                                 02629000
CCACSYSF EQU   CCAFLAGA                                                 02630000
CCANUCID EQU   CCAFSYS+20                                               02631000
CCAASREL EQU   CCAFSYS+16                                               02632000
CCACSREL EQU   CCASREL                                                  02633000
CCAPEMAX EQU   CCAFSYS+10                                               02634000
CCAPGLEN EQU   CCAFSYS+8                                                02635000
CCAIOPAS EQU   CCAFSYS+4                                                02636000
CCAIOPCS EQU   CCAFSYS                                                  02637000
CCAPESIZ EQU   CCAFIOP+4                                                02638000
@NM00008 EQU   CCAFLAG7+3                                               02639000
CCALOGP  EQU   CCAFLAG7+2                                               02640000
CCAOUTP  EQU   CCAFLAG7+2                                               02641000
CCASLBP  EQU   CCAFLAG7+2                                               02642000
CCARPTP  EQU   CCAFLAG7+2                                               02643000
CCALISTP EQU   CCAFLAG7+2                                               02644000
CCAJCLP  EQU   CCAFLAG7+2                                               02645000
CCAPTFP  EQU   CCAFLAG7+2                                               02646000
CCATLBP  EQU   CCAFLAG7+2                                               02647000
CCAUT3P  EQU   CCAFLAG7+1                                               02648000
CCAUT2P  EQU   CCAFLAG7+1                                               02649000
CCAUT1P  EQU   CCAFLAG7+1                                               02650000
CCAWK5P  EQU   CCAFLAG7+1                                               02651000
CCAWK4P  EQU   CCAFLAG7+1                                               02652000
CCAWK3P  EQU   CCAFLAG7+1                                               02653000
CCAWK2P  EQU   CCAFLAG7+1                                               02654000
CCAWK1P  EQU   CCAFLAG7+1                                               02655000
CCAACRQP EQU   CCAFLAG7                                                 02656000
CCACRQP  EQU   CCAFLAG7                                                 02657000
CCASTSP  EQU   CCAFLAG7                                                 02658000
CCAMTSP  EQU   CCAFLAG7                                                 02659000
CCAPTSP  EQU   CCAFLAG7                                                 02660000
CCASCDSP EQU   CCAFLAG7                                                 02661000
CCAACDSP EQU   CCAFLAG7                                                 02662000
CCACDSP  EQU   CCAFLAG7                                                 02663000
@NM00007 EQU   CCAFBUFR+122                                             02664000
@NM00006 EQU   CCAFBUFR+120                                             02665000
@NM00005 EQU   CCAFBUFR+118                                             02666000
CCATBFMX EQU   CCAFBUFR+116                                             02667000
CCA4BFMX EQU   CCAFBUFR+114                                             02668000
CCA3BFMX EQU   CCAFBUFR+112                                             02669000
CCA2BFMX EQU   CCAFBUFR+110                                             02670000
CCA1BFMX EQU   CCAFBUFR+108                                             02671000
CCAXBFMX EQU   CCAFBUFR+106                                             02672000
CCAQBFMX EQU   CCAFBUFR+104                                             02673000
CCASBFMX EQU   CCAFBUFR+102                                             02674000
CCAMBFMX EQU   CCAFBUFR+100                                             02675000
CCAPBFMX EQU   CCAFBUFR+98                                              02676000
CCAVBFMX EQU   CCAFBUFR+96                                              02677000
CCAABFMX EQU   CCAFBUFR+94                                              02678000
CCACBFMX EQU   CCAFBUFR+92                                              02679000
@NM00004 EQU   CCAFBUFR+88                                              02680000
@NM00003 EQU   CCAFBUFR+84                                              02681000
CCA4BFSZ EQU   CCAFBUFR+80                                              02682000
CCATBFSZ EQU   CCAFBUFR+76                                              02683000
CCAWBFSZ EQU   CCAFBUFR+72                                              02684000
CCAQBFSZ EQU   CCAFBUFR+68                                              02685000
CCAPBFSZ EQU   CCAFBUFR+64                                              02686000
CCAVBFSZ EQU   CCAFBUFR+60                                              02687000
CCACBFSZ EQU   CCAFBUFR+56                                              02688000
@NM00002 EQU   CCAFBUFR+52                                              02689000
CCA4BFOA EQU   CCAFBUFR+48                                              02690000
CCA4BFIA EQU   CCAFBUFR+44                                              02691000
CCATBFIA EQU   CCAFBUFR+40                                              02692000
CCAWBFOA EQU   CCAFBUFR+36                                              02693000
CCAWBFIA EQU   CCAFBUFR+32                                              02694000
CCAQBFOA EQU   CCAFBUFR+28                                              02695000
CCAQBFIA EQU   CCAFBUFR+24                                              02696000
CCAPBFOA EQU   CCAFBUFR+20                                              02697000
CCAPBFIA EQU   CCAFBUFR+16                                              02698000
CCAVBFOA EQU   CCAFBUFR+12                                              02699000
CCAVBFIA EQU   CCAFBUFR+8                                               02700000
CCACBFOA EQU   CCAFBUFR+4                                               02701000
CCACBFIA EQU   CCAFBUFR                                                 02702000
CCAID    EQU   HMASMCCA                                                 02703000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02704000
@RF00246 EQU   @RC00238                                                 02705000
@RT00277 EQU   TERMMSG                                                  02706000
@RT00281 EQU   GOODEXIT                                                 02707000
@RT00297 EQU   GOODEXIT                                                 02708000
@RC00389 EQU   @EL00005                                                 02709000
@RT00422 EQU   JCLSCN30                                                 02710000
@RF00437 EQU   UPDT030                                                  02711000
@RT00455 EQU   UPDEXC20                                                 02712000
@RT00461 EQU   JCLSCN10                                                 02713000
@RT00467 EQU   JCLSCN20                                                 02714000
@RC00531 EQU   @EL00006                                                 02715000
@RF00570 EQU   @EL00006                                                 02716000
@ENDDATA EQU   *                                                        02717000
         END   HMASMUPD,(C'PLS2234',0802,78334)                         02718000
