         TITLE 'HMASMFXF   FORMAT AND PRINT HISTORY DATA FROM XRF FILE' 00001000
HMASMFXF CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'HMASMFXF  78.334'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         ST    @13,@SA00001+4                                      0001 00013000
         LA    @14,@SA00001                                        0001 00014000
         ST    @14,8(,@13)                                         0001 00015000
         LR    @13,@14                                             0001 00016000
         MVC   @PC00001(4),0(@01)                                  0001 00017000
*   FXFRTNCD=ZERO;                  /* RESET THE SWITCHES            */ 00018000
         SLR   FXFRTNCD,FXFRTNCD                                   0168 00019000
*   CALL FXFINIT;                   /*                               */ 00020000
*                                                                  0169 00021000
         BAL   @14,FXFINIT                                         0169 00022000
*   /*****************************************************************/ 00023000
*   /*                                                               */ 00024000
*   /* IF CALL WAS NOT FOR END OF FILE THEN LOOP READING RECORDS FROM*/ 00025000
*   /* XREF GTA FILE AND FORMATTING THEM AS LONG AS THE RECORDS      */ 00026000
*   /* RETRIEVED ARE FOR THE ELEMENT PASSED IN THE HMASMIOP          */ 00027000
*   /*                                                               */ 00028000
*   /*****************************************************************/ 00029000
*                                                                  0170 00030000
*   IF IOPRETRN=IOPGOOD             /* IF NOT END OF FILE            */ 00031000
*     THEN                          /*                               */ 00032000
         CLI   IOPRETRN(IOPPTR),0                                  0170 00033000
         BNE   @RF00170                                            0170 00034000
*     DO;                           /*                               */ 00035000
*       DO WHILE(                   /* LOOP                          */ 00036000
*             FXFRTNCD=ZERO         /* AS LONG AS NO ERRORS          */ 00037000
*             &GTPRETRN=GTPGOOD     /* AND NOT EOF ON GTA FILE       */ 00038000
*             &IOPTYPE=XRFETYPE     /* AND XREF RCD FOR MEMBER       */ 00039000
*             &IOPNAME=XRFENAME);   /*                               */ 00040000
         B     @DE00172                                            0172 00041000
@DL00172 DS    0H                                                  0173 00042000
*         RFY                       /*                               */ 00043000
*           RTNCODE RSTD;           /*                               */ 00044000
*         IF XRFRTYPE=XRFPBYMC      /* IF SYSMOD FOR MAC             */ 00045000
*             |XRFRTYPE=XRFPBYMD    /* OR SYSMOD FOR MOD             */ 00046000
*             |XRFRTYPE=XRFPBYSC    /* OR SYSMOD FOR SRC             */ 00047000
*           THEN                    /* THEN CALL ROUTINE TO PRODUCE  */ 00048000
         CLI   XRFRTYPE,37                                         0174 00049000
         BE    @RT00174                                            0174 00050000
         CLI   XRFRTYPE,47                                         0174 00051000
         BE    @RT00174                                            0174 00052000
         CLI   XRFRTYPE,57                                         0174 00053000
         BNE   @RF00174                                            0174 00054000
@RT00174 DS    0H                                                  0175 00055000
*           CALL FXFSMDBY;          /* SYSMOD HISTORY REPORT         */ 00056000
         BAL   @14,FXFSMDBY                                        0175 00057000
*         ELSE                      /* ELSE CALL ROUTINE TO PRODUCE  */ 00058000
*           CALL FXFXREF;           /* ALL OTHER XREF REPORTS        */ 00059000
         B     @RC00174                                            0176 00060000
@RF00174 BAL   @14,FXFXREF                                         0176 00061000
*         FXFRTNCD=MAX(FXFRTNCD,RTNCODE);/* SAVE RC                  */ 00062000
@RC00174 CR    FXFRTNCD,RTNCODE                                    0177 00063000
         BNL   *+6                                                      00064000
         LR    FXFRTNCD,RTNCODE                                    0177 00065000
*         RFY                       /*                               */ 00066000
*           RTNCODE UNRSTD;         /*                               */ 00067000
*       END;                        /* END DO WHILE READ LOOP        */ 00068000
@DE00172 CH    FXFRTNCD,@CH00251                                   0179 00069000
         BNE   @DC00172                                            0179 00070000
         CLI   GTPRETRN(GTPPTR),0                                  0179 00071000
         BNE   @DC00172                                            0179 00072000
         CLC   IOPTYPE(1,IOPPTR),XRFETYPE                          0179 00073000
         BNE   @DC00172                                            0179 00074000
         CLC   IOPNAME(8,IOPPTR),XRFENAME                          0179 00075000
         BE    @DL00172                                            0179 00076000
@DC00172 DS    0H                                                  0180 00077000
*     END;                          /* END NOT EOF                   */ 00078000
*                                                                  0180 00079000
*   /*****************************************************************/ 00080000
*   /*                                                               */ 00081000
*   /* ALL XREF LISTINGS PRODUCED FOR ELEMENT. RETURN TO CALLER      */ 00082000
*   /*                                                               */ 00083000
*   /*****************************************************************/ 00084000
*                                                                  0181 00085000
*   RETURN CODE(FXFRTNCD);          /*                               */ 00086000
@RF00170 LR    @15,FXFRTNCD                                        0181 00087000
         L     @13,4(,@13)                                         0181 00088000
         L     @14,12(,@13)                                        0181 00089000
         LM    @00,@12,20(@13)                                     0181 00090000
         BR    @14                                                 0181 00091000
         EJECT                                                          00092000
*                                                                  0182 00093000
*   /*****************************************************************/ 00094000
*   /*                                                               */ 00095000
*   /* DO INITIALIZATION AND IF CALL FOR EOF DO TERMINATION          */ 00096000
*   /*                                                               */ 00097000
*   /*****************************************************************/ 00098000
*                                                                  0182 00099000
*FXFINIT:                           /*                               */ 00100000
*   PROCEDURE;                      /*                               */ 00101000
FXFINIT  STM   @14,@01,@SA00002                                    0182 00102000
         ST    @03,@SA00002+16                                     0182 00103000
         STM   @05,@12,@SA00002+20                                 0182 00104000
*   DECLARE                         /*                               */ 00105000
*     LASTTYPE FIXED(8) INIT(IOPEOLST);/* TYPE CODE OF LAST ELEMENT  */ 00106000
*   RFY                                                            0184 00107000
*     HMASMIOP BASED(IOPPTR);       /*                               */ 00108000
*   RFY                                                            0185 00109000
*     HMASMGTP BASED(GTPPTR);       /* XRF FILE                      */ 00110000
*   IOPPTR=ADDR(PASSIOP);           /* INITIAL SETUP/ADDRESSABILITY  */ 00111000
         L     IOPPTR,@PC00001                                     0186 00112000
*   GTPPTR=CCAGTP1;                 /*                               */ 00113000
         L     GTPPTR,CCAGTP1(,CCAPTR)                             0187 00114000
*   GTPRCDLN=LENGTH(XRFRCD);        /* SETUP THE GTP FOR A READ      */ 00115000
         MVC   GTPRCDLN(2,GTPPTR),@CH00472                         0188 00116000
*   GTPKEYLN=LENGTH(XRFETYPE)+LENGTH(XRFENAME);/*                    */ 00117000
         MVC   GTPKEYLN(2,GTPPTR),@CH00434                         0189 00118000
*   GTPBUFAD=ADDR(XRFRCD);          /* SETUP FOR GETNEXT PROCESSING  */ 00119000
*                                                                  0190 00120000
         LA    @10,XRFRCD                                          0190 00121000
         ST    @10,GTPBUFAD(,GTPPTR)                               0190 00122000
*   /*****************************************************************/ 00123000
*   /*                                                               */ 00124000
*   /* IF CALL AT END OF FILE RESET INTERNAL WORK AREAS IN CASE      */ 00125000
*   /* CALLED AGAIN                                                  */ 00126000
*   /*                                                               */ 00127000
*   /*****************************************************************/ 00128000
*                                                                  0191 00129000
*   IF IOPRETRN=IOPEOF              /* IF CALL FOR END OF FILE       */ 00130000
*     THEN                          /*                               */ 00131000
         CLI   IOPRETRN(IOPPTR),4                                  0191 00132000
         BNE   @RF00191                                            0191 00133000
*     DO;                           /*                               */ 00134000
*       LASTTYPE=IOPEOLST;          /* SET INVALID LAST TYPE         */ 00135000
         MVI   LASTTYPE,X'FF'                                      0193 00136000
*       XRFRCD=''B;                 /*                               */ 00137000
         XC    XRFRCD(30),XRFRCD                                   0194 00138000
*       GTPFUNCT=GTPFREE;           /*                               */ 00139000
         MVI   GTPFUNCT(GTPPTR),X'0A'                              0195 00140000
*       CALL HMASMGTA(HMASMGTP);    /* FREE GTA FILE                 */ 00141000
         ST    GTPPTR,@AL00001                                     0196 00142000
         L     @15,@CV01352                                        0196 00143000
         LA    @01,@AL00001                                        0196 00144000
         BALR  @14,@15                                             0196 00145000
*     END;                          /*                               */ 00146000
*                                                                  0197 00147000
*   /*****************************************************************/ 00148000
*   /*                                                               */ 00149000
*   /* IF CALL FOR NEW TYPE OF ELEMENT THEN REPOSITION GTA FILE SO   */ 00150000
*   /* THAT NEXT GETN WILL GET THE FIRST RECORD OF THE NEW TYPE      */ 00151000
*   /*                                                               */ 00152000
*   /*****************************************************************/ 00153000
*                                                                  0198 00154000
*   ELSE                            /*                               */ 00155000
*     DO;                           /*                               */ 00156000
         B     @RC00191                                            0198 00157000
@RF00191 DS    0H                                                  0199 00158000
*       IF LASTTYPE^=IOPTYPE        /* IF XREF FOR NEW TYPE ELEMENT  */ 00159000
*         THEN                      /* THEN MUST REPOSITION GETN     */ 00160000
         CLC   LASTTYPE(1),IOPTYPE(IOPPTR)                         0199 00161000
         BE    @RF00199                                            0199 00162000
*         DO;                       /* OPERATIONS TO FIRST RECORD    */ 00163000
*           XRFRCD=''B;             /*                               */ 00164000
         XC    XRFRCD(30),XRFRCD                                   0201 00165000
*           LASTTYPE=IOPTYPE;       /*                               */ 00166000
         MVC   LASTTYPE(1),IOPTYPE(IOPPTR)                         0202 00167000
*           GTPFUNCT=GTPLOC;        /* OF THAT TYPE                  */ 00168000
         MVI   GTPFUNCT(GTPPTR),X'03'                              0203 00169000
*           XRFETYPE=IOPTYPE;       /* SET KEY FOR TYPE CODE         */ 00170000
         MVC   XRFETYPE(1),IOPTYPE(IOPPTR)                         0204 00171000
*           XRFENAME=''B;           /* AND LOWEST POSSIBLE MEMBER    */ 00172000
         XC    XRFENAME(8),XRFENAME                                0205 00173000
*           CALL HMASMGTA(HMASMGTP);/*                               */ 00174000
         ST    GTPPTR,@AL00001                                     0206 00175000
         L     @15,@CV01352                                        0206 00176000
         LA    @01,@AL00001                                        0206 00177000
         BALR  @14,@15                                             0206 00178000
*           GTPFUNCT=GTPSTRTN;      /* RESTART GETN PROCESSING       */ 00179000
         MVI   GTPFUNCT(GTPPTR),X'06'                              0207 00180000
*           CALL HMASMGTA(HMASMGTP);/* AT THAT POINT                 */ 00181000
         ST    GTPPTR,@AL00001                                     0208 00182000
         L     @15,@CV01352                                        0208 00183000
         LA    @01,@AL00001                                        0208 00184000
         BALR  @14,@15                                             0208 00185000
*           GTPFUNCT=GTPGETN;       /* NOW PRIME BUFFER WITH         */ 00186000
         MVI   GTPFUNCT(GTPPTR),X'08'                              0209 00187000
*           CALL HMASMGTA(HMASMGTP);/* THAT RECORD                   */ 00188000
         ST    GTPPTR,@AL00001                                     0210 00189000
         L     @15,@CV01352                                        0210 00190000
         LA    @01,@AL00001                                        0210 00191000
         BALR  @14,@15                                             0210 00192000
*         END;                      /*                               */ 00193000
*                                                                  0211 00194000
*       /*************************************************************/ 00195000
*       /*                                                           */ 00196000
*       /* IF CALL FOR SAME TYPE ELEMENT THEN READ THRU GTA FILE TILL*/ 00197000
*       /* THE FIRST RECORD FOR THAT TYPE AND ELEMENT IS FOUND OR    */ 00198000
*       /* UNTIL A HIGHER ELEMENT OR DIFFERENT TYPE IS FOUND         */ 00199000
*       /*                                                           */ 00200000
*       /*************************************************************/ 00201000
*                                                                  0212 00202000
*       GTPFUNCT=GTPGETN;           /*                               */ 00203000
@RF00199 MVI   GTPFUNCT(GTPPTR),X'08'                              0212 00204000
*       DO WHILE(                   /* LOOP UNTIL                    */ 00205000
*             GTPRETRN=GTPGOOD      /* BAD RC FOR GTA                */ 00206000
*             &XRFETYPE=IOPTYPE     /* OR DIFFERENT TYPE FOUND       */ 00207000
*             &XRFENAME<IOPNAME);   /* OR HIGHER ELEMENT ENCOUNTERED */ 00208000
         B     @DE00213                                            0213 00209000
@DL00213 DS    0H                                                  0214 00210000
*         CALL HMASMGTA(HMASMGTP);  /*                               */ 00211000
         ST    GTPPTR,@AL00001                                     0214 00212000
         L     @15,@CV01352                                        0214 00213000
         LA    @01,@AL00001                                        0214 00214000
         BALR  @14,@15                                             0214 00215000
*       END;                        /* END GTA READ LOOP             */ 00216000
@DE00213 CLI   GTPRETRN(GTPPTR),0                                  0215 00217000
         BNE   @DC00213                                            0215 00218000
         CLC   XRFETYPE(1),IOPTYPE(IOPPTR)                         0215 00219000
         BNE   @DC00213                                            0215 00220000
         CLC   XRFENAME(8),IOPNAME(IOPPTR)                         0215 00221000
         BL    @DL00213                                            0215 00222000
@DC00213 DS    0H                                                  0216 00223000
*     END;                          /* END CALL FOR SAME TYPE ELEMENT*/ 00224000
*   GTPFUNCT=GTPGETN;               /* THEN GO TO THE READ ROUTINE   */ 00225000
@RC00191 MVI   GTPFUNCT(GTPPTR),X'08'                              0217 00226000
*   RETURN CODE(ZERO);              /*                               */ 00227000
         SLR   @15,@15                                             0218 00228000
         L     @14,@SA00002                                        0218 00229000
         LM    @00,@01,@SA00002+8                                  0218 00230000
         L     @03,@SA00002+16                                     0218 00231000
         LM    @05,@12,@SA00002+20                                 0218 00232000
         BR    @14                                                 0218 00233000
*   END FXFINIT;                    /*                               */ 00234000
         EJECT                                                          00235000
*                                                                  0220 00236000
*   /*****************************************************************/ 00237000
*   /*                                                               */ 00238000
*   /* THIS PROCEDURE IS CALLED TO PRODUCE THE XREF REPORTS FOR      */ 00239000
*   /* RECORDS OF THE SYSMOD HISTORY TYPE                            */ 00240000
*   /*                                                               */ 00241000
*   /*****************************************************************/ 00242000
*                                                                  0220 00243000
*FXFSMDBY:                                                         0220 00244000
*   PROCEDURE;                      /*                               */ 00245000
FXFSMDBY STM   @14,@12,@SA00003                                    0220 00246000
*   DECLARE                                                        0221 00247000
*     SMDBYRC FIXED(8);             /*                               */ 00248000
*   RFY                             /*                               */ 00249000
*     HMASMIOP BASED(IOPPTR);       /*                               */ 00250000
*   RFY                             /*                               */ 00251000
*     HMASMGTP BASED(GTPPTR);       /*                               */ 00252000
*   SMDBYRC=ZERO;                   /*                               */ 00253000
*                                                                  0224 00254000
         SLR   SMDBYRC,SMDBYRC                                     0224 00255000
*   /*****************************************************************/ 00256000
*   /*                                                               */ 00257000
*   /* SET UP AND PRINT SUBHEADING LINE. SAVE TYPE CODE AND NAME OF  */ 00258000
*   /* THE XREF RECORD TO DETERMINE WHEN LOOP WILL STOP              */ 00259000
*   /*                                                               */ 00260000
*   /*****************************************************************/ 00261000
*                                                                  0225 00262000
*   HDSUBHD=TXTSMDBY;               /* SET UP SUBHEADING             */ 00263000
         MVC   HDSUBHD(15),@CC01410                                0225 00264000
*   HDSEPCHR=TXTEQ;                 /*                               */ 00265000
         MVI   HDSEPCHR,C'='                                       0226 00266000
*   HDSMDHMP=TXTSMDMP;              /* HEADING                       */ 00267000
         MVC   HDSMDHMP(65),TXTSMDMP                               0227 00268000
*   CALL FXFWRITE;                  /*                               */ 00269000
         BAL   @14,FXFWRITE                                        0228 00270000
*   RFY                             /*                               */ 00271000
*     RTNCODE RSTD;                 /*                               */ 00272000
*   SMDBYRC=MAX(SMDBYRC,RTNCODE);   /*                               */ 00273000
         CR    SMDBYRC,RTNCODE                                     0230 00274000
         BNL   *+6                                                      00275000
         LR    SMDBYRC,RTNCODE                                     0230 00276000
*   RFY                             /*                               */ 00277000
*     RTNCODE UNRSTD;               /*                               */ 00278000
*   SAVETYPE=XRFETYPE;              /* SAVE TYPE AND ELEMENT NAME    */ 00279000
         SLR   SAVETYPE,SAVETYPE                                   0232 00280000
         IC    SAVETYPE,XRFETYPE                                   0232 00281000
*   SAVENAME=XRFENAME;              /*                               */ 00282000
         MVC   SAVENAME(8),XRFENAME                                0233 00283000
*   SAVRTYPE=XRFRTYPE;              /* AND XREF RECORD TYPE          */ 00284000
*                                                                  0234 00285000
         SLR   SAVRTYPE,SAVRTYPE                                   0234 00286000
         IC    SAVRTYPE,XRFRTYPE                                   0234 00287000
*   /*****************************************************************/ 00288000
*   /*                                                               */ 00289000
*   /* LOOP READING AND FORMATTING RECORDS UNTIL A RECORD IS HIT THAT*/ 00290000
*   /* IS NOT FOR ELEMENT AND TYPE PASSED IN INITIAL XREF RCD.       */ 00291000
*   /*                                                               */ 00292000
*   /*****************************************************************/ 00293000
*                                                                  0235 00294000
*   DO WHILE(                       /* LOOP PROCESSING RECORDS       */ 00295000
*         SMDBYRC=ZERO              /* WHILE NO ERRORS               */ 00296000
*         &GTPRETRN=GTPGOOD         /* AND NOT EOF                   */ 00297000
*         &XRFETYPE=SAVETYPE        /* AND SAME TYPE ELEMENT         */ 00298000
*         &XRFENAME=SAVENAME        /* FOR SAME ELEMENT              */ 00299000
*         &XRFRTYPE=SAVRTYPE);      /* AND SAME TYPE XREF RECORD     */ 00300000
*                                                                  0235 00301000
         B     @DE00235                                            0235 00302000
@DL00235 DS    0H                                                  0236 00303000
*     /***************************************************************/ 00304000
*     /*                                                             */ 00305000
*     /* SET UP SYSMOD NUMBER AND TYPE SYSMOD                        */ 00306000
*     /*                                                             */ 00307000
*     /***************************************************************/ 00308000
*                                                                  0236 00309000
*     HDSMDHNM=XRF3PTF;             /* SYSMOD NUMBER(7CHARS)         */ 00310000
         MVC   HDSMDHNM(7),XRF3PTF                                 0236 00311000
*     IF XRF3PTYP=IOPPPTF           /*                               */ 00312000
*       THEN                        /*                               */ 00313000
         CLI   XRF3PTYP,3                                          0237 00314000
         BNE   @RF00237                                            0237 00315000
*       HDSMDHTP=TXTPTF;            /*                               */ 00316000
         MVC   HDSMDHTP(8),@CC01433                                0238 00317000
*     ELSE                          /*                               */ 00318000
*       IF XRF3PTYP=IOPPAPAR        /*                               */ 00319000
*         THEN                      /*                               */ 00320000
         B     @RC00237                                            0239 00321000
@RF00237 CLI   XRF3PTYP,2                                          0239 00322000
         BNE   @RF00239                                            0239 00323000
*         HDSMDHTP=TXTAPAR;         /*                               */ 00324000
         MVC   HDSMDHTP(8),@CC01435                                0240 00325000
*       ELSE                        /*                               */ 00326000
*         IF XRF3PTYP=IOPPUSER      /*                               */ 00327000
*           THEN                    /*                               */ 00328000
         B     @RC00239                                            0241 00329000
@RF00239 CLI   XRF3PTYP,1                                          0241 00330000
         BNE   @RF00241                                            0241 00331000
*           HDSMDHTP=TXTUSER;       /*                               */ 00332000
         MVC   HDSMDHTP(8),@CC01437                                0242 00333000
*         ELSE                      /*                               */ 00334000
*           IF XRF3PTYP=IOPPFUNC    /*                               */ 00335000
*             THEN                  /*                               */ 00336000
         B     @RC00241                                            0243 00337000
@RF00241 CLI   XRF3PTYP,4                                          0243 00338000
         BNE   @RF00243                                            0243 00339000
*             HDSMDHTP=TXTFUNCT;    /*                               */ 00340000
*                                                                  0244 00341000
         MVC   HDSMDHTP(8),@CC01431                                0244 00342000
*     /***************************************************************/ 00343000
*     /*                                                             */ 00344000
*     /* CONVERT DATE ROUTINE                                        */ 00345000
*     /*                                                             */ 00346000
*     /***************************************************************/ 00347000
*                                                                  0245 00348000
*     CNVDATE=XRF3DAT;              /* UNPAK XRF3DAT FOR HDSMDHDT    */ 00349000
@RF00243 DS    0H                                                  0245 00350000
@RC00241 DS    0H                                                  0245 00351000
@RC00239 DS    0H                                                  0245 00352000
@RC00237 MVC   CNVDATE(3),XRF3DAT                                  0245 00353000
*     UNPK(WORKAREA(1:5),CNVDATE(1:3));                            0246 00354000
         UNPK  WORKAREA(5),CNVDATE(3)                              0246 00355000
*     HDSMDHYY=YEAR;                /* FILL IN THE YEAR              */ 00356000
         MVC   HDSMDHYY(2),YEAR                                    0247 00357000
*     HDSMDHPR=TXTPER;              /* THIS IS THE JULIAN DATE       */ 00358000
         MVI   HDSMDHPR,C'.'                                       0248 00359000
*     HDSMDHDD=DAY;                 /* FILL IN THE DAY               */ 00360000
         MVC   HDSMDHDD(3),DAY                                     0249 00361000
*     HDSMDHDD(3)=HDSMDHDD(3)|HEX0;                                0250 00362000
*                                                                  0250 00363000
         OI    HDSMDHDD+2,X'F0'                                    0250 00364000
*     /***************************************************************/ 00365000
*     /*                                                             */ 00366000
*     /* SET MCS TYPE                                                */ 00367000
*     /*                                                             */ 00368000
*     /***************************************************************/ 00369000
*                                                                  0251 00370000
*     IF XRF3PIND=IOPPMOD           /*                               */ 00371000
*       THEN                        /*                               */ 00372000
         CLI   XRF3PIND,1                                          0251 00373000
         BNE   @RF00251                                            0251 00374000
*       HDSMDHMC=TXTMOD;            /*                               */ 00375000
         MVC   HDSMDHMC(8),@CC01443                                0252 00376000
*     ELSE                          /*                               */ 00377000
*       IF XRF3PIND=IOPPZAP         /*                               */ 00378000
*         THEN                      /*                               */ 00379000
         B     @RC00251                                            0253 00380000
@RF00251 CLI   XRF3PIND,2                                          0253 00381000
         BNE   @RF00253                                            0253 00382000
*         HDSMDHMC=TXTSZAP;         /*                               */ 00383000
         MVC   HDSMDHMC(8),@CC01445                                0254 00384000
*       ELSE                        /*                               */ 00385000
*         IF XRF3PIND=IOPPXPD       /*                               */ 00386000
*           THEN                    /*                               */ 00387000
         B     @RC00253                                            0255 00388000
@RF00253 CLI   XRF3PIND,3                                          0255 00389000
         BNE   @RF00255                                            0255 00390000
*           HDSMDHMC=TXTXZAP;       /*                               */ 00391000
         MVC   HDSMDHMC(8),@CC01447                                0256 00392000
*         ELSE                      /*                               */ 00393000
*           IF XRF3PIND=IOPPMCR     /*                               */ 00394000
*             THEN                  /*                               */ 00395000
         B     @RC00255                                            0257 00396000
@RF00255 CLI   XRF3PIND,4                                          0257 00397000
         BNE   @RF00257                                            0257 00398000
*             HDSMDHMC=TXTMAC;      /*                               */ 00399000
         MVC   HDSMDHMC(8),@CC01449                                0258 00400000
*           ELSE                    /*                               */ 00401000
*             IF XRF3PIND=IOPPMCU   /*                               */ 00402000
*               THEN                /*                               */ 00403000
         B     @RC00257                                            0259 00404000
@RF00257 CLI   XRF3PIND,5                                          0259 00405000
         BNE   @RF00259                                            0259 00406000
*               HDSMDHMC=TXTMACU;   /*                               */ 00407000
         MVC   HDSMDHMC(8),@CC01451                                0260 00408000
*             ELSE                  /*                               */ 00409000
*               IF XRF3PIND=IOPPSCR /*                               */ 00410000
*                 THEN              /*                               */ 00411000
         B     @RC00259                                            0261 00412000
@RF00259 CLI   XRF3PIND,6                                          0261 00413000
         BNE   @RF00261                                            0261 00414000
*                 HDSMDHMC=TXTSRC;  /*                               */ 00415000
         MVC   HDSMDHMC(8),@CC01439                                0262 00416000
*               ELSE                /*                               */ 00417000
*                 IF XRF3PIND=IOPPSCU/*                              */ 00418000
*                   THEN            /*                               */ 00419000
         B     @RC00261                                            0263 00420000
@RF00261 CLI   XRF3PIND,7                                          0263 00421000
         BNE   @RF00263                                            0263 00422000
*                   HDSMDHMC=TXTSRCU;/*                              */ 00423000
         MVC   HDSMDHMC(8),@CC01441                                0264 00424000
*                 ELSE              /*                               */ 00425000
*                   IF XRF3PIND=IOPPASM/*                            */ 00426000
*                     THEN          /*                               */ 00427000
         B     @RC00263                                            0265 00428000
@RF00263 CLI   XRF3PIND,8                                          0265 00429000
         BNE   @RF00265                                            0265 00430000
*                     HDSMDHMC=TXTASM;/*                             */ 00431000
         MVC   HDSMDHMC(8),@CC01453                                0266 00432000
*     IF HDSMDHMC(1)=BLANK          /* IF TYPE NOT SET YET           */ 00433000
*       THEN                        /*                               */ 00434000
@RF00265 DS    0H                                                  0267 00435000
@RC00263 DS    0H                                                  0267 00436000
@RC00261 DS    0H                                                  0267 00437000
@RC00259 DS    0H                                                  0267 00438000
@RC00257 DS    0H                                                  0267 00439000
@RC00255 DS    0H                                                  0267 00440000
@RC00253 DS    0H                                                  0267 00441000
@RC00251 CLI   HDSMDHMC,C' '                                       0267 00442000
         BNE   @RF00267                                            0267 00443000
*       DO;                         /*                               */ 00444000
*         IF XRF3PIND=IOPPRMOD      /*                               */ 00445000
*           THEN                    /*                               */ 00446000
         CLI   XRF3PIND,81                                         0269 00447000
         BNE   @RF00269                                            0269 00448000
*           HDSMDHMC=TXTRMOD;       /*                               */ 00449000
         MVC   HDSMDHMC(8),@CC01459                                0270 00450000
*         ELSE                      /*                               */ 00451000
*           IF XRF3PIND=IOPPRZAP    /*                               */ 00452000
*             THEN                  /*                               */ 00453000
         B     @RC00269                                            0271 00454000
@RF00269 CLI   XRF3PIND,82                                         0271 00455000
         BNE   @RF00271                                            0271 00456000
*             HDSMDHMC=TXTRSZAP;    /*                               */ 00457000
         MVC   HDSMDHMC(8),@CC01461                                0272 00458000
*           ELSE                    /*                               */ 00459000
*             IF XRF3PIND=IOPPRXPD  /*                               */ 00460000
*               THEN                /*                               */ 00461000
         B     @RC00271                                            0273 00462000
@RF00271 CLI   XRF3PIND,83                                         0273 00463000
         BNE   @RF00273                                            0273 00464000
*               HDSMDHMC=TXTRXZAP;  /*                               */ 00465000
         MVC   HDSMDHMC(8),@CC01463                                0274 00466000
*             ELSE                  /*                               */ 00467000
*               IF XRF3PIND=IOPPRMCR/*                               */ 00468000
*                 THEN              /*                               */ 00469000
         B     @RC00273                                            0275 00470000
@RF00273 CLI   XRF3PIND,84                                         0275 00471000
         BNE   @RF00275                                            0275 00472000
*                 HDSMDHMC=TXTRMAC; /*                               */ 00473000
         MVC   HDSMDHMC(8),@CC01465                                0276 00474000
*               ELSE                /*                               */ 00475000
*                 IF XRF3PIND=IOPPRMCU/*                             */ 00476000
*                   THEN            /*                               */ 00477000
         B     @RC00275                                            0277 00478000
@RF00275 CLI   XRF3PIND,85                                         0277 00479000
         BNE   @RF00277                                            0277 00480000
*                   HDSMDHMC=TXTRMACU;/*                             */ 00481000
         MVC   HDSMDHMC(8),@CC01467                                0278 00482000
*                 ELSE              /*                               */ 00483000
*                   IF XRF3PIND=IOPPRSCR/*                           */ 00484000
*                     THEN          /*                               */ 00485000
         B     @RC00277                                            0279 00486000
@RF00277 CLI   XRF3PIND,86                                         0279 00487000
         BNE   @RF00279                                            0279 00488000
*                     HDSMDHMC=TXTRSRC;/*                            */ 00489000
         MVC   HDSMDHMC(8),@CC01455                                0280 00490000
*                   ELSE            /*                               */ 00491000
*                     IF XRF3PIND=IOPPRSCU/*                         */ 00492000
*                       THEN        /*                               */ 00493000
         B     @RC00279                                            0281 00494000
@RF00279 CLI   XRF3PIND,87                                         0281 00495000
         BNE   @RF00281                                            0281 00496000
*                       HDSMDHMC=TXTRSRCU;/*                         */ 00497000
         MVC   HDSMDHMC(8),@CC01457                                0282 00498000
*       END;                        /*                               */ 00499000
*                                                                  0283 00500000
@RF00281 DS    0H                                                  0283 00501000
@RC00279 DS    0H                                                  0283 00502000
@RC00277 DS    0H                                                  0283 00503000
@RC00275 DS    0H                                                  0283 00504000
@RC00273 DS    0H                                                  0283 00505000
@RC00271 DS    0H                                                  0283 00506000
@RC00269 DS    0H                                                  0284 00507000
*     /***************************************************************/ 00508000
*     /*                                                             */ 00509000
*     /* CHECK THE FLAGS IN THE XREF RECORD USING IOPFLGS5 AS A MAP  */ 00510000
*     /*                                                             */ 00511000
*     /***************************************************************/ 00512000
*                                                                  0284 00513000
*     IOPFLGS5=XRF3STAT;            /* USE IOPFLGS5 AS A MAP FOR   0284 00514000
*                                      CHECK OF XRF3STAT             */ 00515000
@RF00267 MVC   IOPFLGS5(1,IOPPTR),XRF3STAT                         0284 00516000
*     IF IOPAPP=ON                  /* IF APP BIT IS ON              */ 00517000
*       THEN                        /*                               */ 00518000
         TM    IOPAPP(IOPPTR),B'10000000'                          0285 00519000
         BNO   @RF00285                                            0285 00520000
*       HDSMDAPP=TXTAPP;            /* PUT TEXT IN THE BUFFER        */ 00521000
         MVC   HDSMDAPP(3),@CC01469                                0286 00522000
*     IF IOPRES=ON                  /* IF RES BIT IS ON              */ 00523000
*       THEN                        /*                               */ 00524000
@RF00285 TM    IOPRES(IOPPTR),B'01000000'                          0287 00525000
         BNO   @RF00287                                            0287 00526000
*       HDSMDRES=TXTRES;            /* PUT TEXT IN THE BUFFER        */ 00527000
         MVC   HDSMDRES(3),@CC01471                                0288 00528000
*     IF IOPACC=ON                  /* IF ACC BIT IS ON              */ 00529000
*       THEN                        /*                               */ 00530000
@RF00287 TM    IOPACC(IOPPTR),B'00100000'                          0289 00531000
         BNO   @RF00289                                            0289 00532000
*       HDSMDACC=TXTACC;            /* PUT TEXT IN THE BUFFER        */ 00533000
         MVC   HDSMDACC(3),@CC01473                                0290 00534000
*     IF IOPBYP=ON                  /* IF BYP BIT IS ON              */ 00535000
*       THEN                        /*                               */ 00536000
@RF00289 TM    IOPBYP(IOPPTR),B'00000010'                          0291 00537000
         BNO   @RF00291                                            0291 00538000
*       HDSMDBYP=TXTBYP;            /* PUT TEXT IN THE BUFFER        */ 00539000
         MVC   HDSMDBYP(3),@CC01477                                0292 00540000
*     IF IOPERROR=ON                /* IF ERR BIT IS ON              */ 00541000
*       THEN                        /*                               */ 00542000
@RF00291 TM    IOPERROR(IOPPTR),B'00010000'                        0293 00543000
         BNO   @RF00293                                            0293 00544000
*       HDSMDERR=TXTERR;            /* PUT TEXT IN THE BUFFER        */ 00545000
         MVC   HDSMDERR(3),@CC01475                                0294 00546000
*     IF IOPREGEN=ON                /* IF RGN BIT IS ON              */ 00547000
*       THEN                        /*                               */ 00548000
@RF00293 TM    IOPREGEN(IOPPTR),B'00000001'                        0295 00549000
         BNO   @RF00295                                            0295 00550000
*       HDSMDRGN=TXTRGN;            /* PUT TEXT IN THE BUFFER        */ 00551000
*                                                                  0296 00552000
         MVC   HDSMDRGN(3),@CC01479                                0296 00553000
*     /***************************************************************/ 00554000
*     /*                                                             */ 00555000
*     /* ALL DATA FROM LINE FORMATTED. NOW PRINT LINE AND THEN CALL  */ 00556000
*     /* HMASMGTA TO GET NEXT RECORD FROM XREF FILE.                 */ 00557000
*     /*                                                             */ 00558000
*     /***************************************************************/ 00559000
*                                                                  0297 00560000
*     CALL FXFWRITE;                /*                               */ 00561000
@RF00295 BAL   @14,FXFWRITE                                        0297 00562000
*     RFY                           /*                               */ 00563000
*       RTNCODE RSTD;               /*                               */ 00564000
*     SMDBYRC=MAX(SMDBYRC,RTNCODE); /*                               */ 00565000
         CR    SMDBYRC,RTNCODE                                     0299 00566000
         BNL   *+6                                                      00567000
         LR    SMDBYRC,RTNCODE                                     0299 00568000
*     RFY                           /*                               */ 00569000
*       RTNCODE UNRSTD;             /*                               */ 00570000
*     CALL HMASMGTA(HMASMGTP);      /* GET ANOTHER RECORD TO PROCESS */ 00571000
         ST    GTPPTR,@AL00001                                     0301 00572000
         L     @15,@CV01352                                        0301 00573000
         LA    @01,@AL00001                                        0301 00574000
         BALR  @14,@15                                             0301 00575000
*   END;                            /* END FOR DO WHILE GTA READ     */ 00576000
*                                                                  0302 00577000
@DE00235 CH    SMDBYRC,@CH00251                                    0302 00578000
         BNE   @DC00235                                            0302 00579000
         CLI   GTPRETRN(GTPPTR),0                                  0302 00580000
         BNE   @DC00235                                            0302 00581000
         SLR   @10,@10                                             0302 00582000
         IC    @10,XRFETYPE                                        0302 00583000
         CR    SAVETYPE,@10                                        0302 00584000
         BNE   @DC00235                                            0302 00585000
         CLC   XRFENAME(8),SAVENAME                                0302 00586000
         BNE   @DC00235                                            0302 00587000
         SLR   @10,@10                                             0302 00588000
         IC    @10,XRFRTYPE                                        0302 00589000
         CR    SAVRTYPE,@10                                        0302 00590000
         BE    @DL00235                                            0302 00591000
@DC00235 DS    0H                                                  0303 00592000
*   /*****************************************************************/ 00593000
*   /*                                                               */ 00594000
*   /* ALL GTA RECORDS FOR SYSMODBY FOR ELEMENT HAVE BEEN PROCESSED  */ 00595000
*   /* AND FORMATTED. RETURN TO CALLER                               */ 00596000
*   /*                                                               */ 00597000
*   /*****************************************************************/ 00598000
*                                                                  0303 00599000
*   RETURN CODE(SMDBYRC);                                          0303 00600000
         LR    @15,SMDBYRC                                         0303 00601000
         L     @14,@SA00003                                        0303 00602000
         LM    @00,@12,@SA00003+8                                  0303 00603000
         BR    @14                                                 0303 00604000
*   END FXFSMDBY;                                                  0304 00605000
         EJECT                                                          00606000
*                                                                  0305 00607000
*   /*****************************************************************/ 00608000
*   /*                                                               */ 00609000
*   /* ROUTINE CALLED TO PROCESS ALL XREF FORMATTING OTHER THAN      */ 00610000
*   /* SYSMOD BY REPORTS                                             */ 00611000
*   /*                                                               */ 00612000
*   /*****************************************************************/ 00613000
*                                                                  0305 00614000
*FXFXREF:                                                          0305 00615000
*   PROCEDURE;                      /*                               */ 00616000
FXFXREF  STM   @14,@12,@SA00004                                    0305 00617000
*   DECLARE                                                        0306 00618000
*     XREFRC FIXED(8);              /*                               */ 00619000
*   DECLARE                         /*                               */ 00620000
*     XREFX FIXED(31);              /* OUTPUT ARRAY INDEX            */ 00621000
*   RFY                             /*                               */ 00622000
*     HMASMIOP BASED(IOPPTR);       /*                               */ 00623000
*   RFY                             /*                               */ 00624000
*     HMASMGTP BASED(GTPPTR);       /*                               */ 00625000
*   XREFRC=ZERO;                    /*                               */ 00626000
         SLR   XREFRC,XREFRC                                       0310 00627000
*   SAVETYPE=XRFETYPE;              /* SAVE TYPE AND ELEMENT NAME    */ 00628000
         SLR   SAVETYPE,SAVETYPE                                   0311 00629000
         IC    SAVETYPE,XRFETYPE                                   0311 00630000
*   SAVENAME=XRFENAME;              /*                               */ 00631000
         MVC   SAVENAME(8),XRFENAME                                0312 00632000
*   SAVRTYPE=XRFRTYPE;              /* AND XREF RECORD TYPE          */ 00633000
*                                                                  0313 00634000
         SLR   SAVRTYPE,SAVRTYPE                                   0313 00635000
         IC    SAVRTYPE,XRFRTYPE                                   0313 00636000
*   /*****************************************************************/ 00637000
*   /*                                                               */ 00638000
*   /* SET UP SUBHEADINGS                                            */ 00639000
*   /*                                                               */ 00640000
*   /*****************************************************************/ 00641000
*                                                                  0314 00642000
*   DO XREFX=1 BY 1 WHILE(          /* LOOP THRU ARRAY               */ 00643000
*         FXFRTYPE(XREFX)^=IOPEOLST /* TILL END OF LIST              */ 00644000
*         &FXFRTYPE(XREFX)^=XRFRTYPE);/* OR MATCH FOUND              */ 00645000
         LA    XREFX,1                                             0314 00646000
         B     @DE00314                                            0314 00647000
@DL00314 DS    0H                                                  0315 00648000
*   END;                            /*                               */ 00649000
         AH    XREFX,@CH00085                                      0315 00650000
@DE00314 LR    @10,XREFX                                           0315 00651000
         SLA   @10,4                                               0315 00652000
         SLR   @15,@15                                             0315 00653000
         IC    @15,FXFRTYPE-16(@10)                                0315 00654000
         CH    @15,@CH00623                                        0315 00655000
         BE    @DC00314                                            0315 00656000
         SLR   @10,@10                                             0315 00657000
         IC    @10,XRFRTYPE                                        0315 00658000
         CR    @15,@10                                             0315 00659000
         BNE   @DL00314                                            0315 00660000
@DC00314 DS    0H                                                  0316 00661000
*   HDSUBHD=FXFHEAD(XREFX);         /* MOVE OVER HEADING             */ 00662000
         LR    @10,XREFX                                           0316 00663000
         SLA   @10,4                                               0316 00664000
         LA    @01,FXFHEAD-16(@10)                                 0316 00665000
         MVC   HDSUBHD(15),0(@01)                                  0316 00666000
*                                                                  0317 00667000
*   /*****************************************************************/ 00668000
*   /*                                                               */ 00669000
*   /* LOOP READING AND PROCESSING XREF RECORDS AS LONG AS SAME TYPE */ 00670000
*   /* XREF RECORD AND FOR SAME ELEMENT                              */ 00671000
*   /*                                                               */ 00672000
*   /*****************************************************************/ 00673000
*                                                                  0317 00674000
*   HDSEPCHR=TXTEQ;                 /*                               */ 00675000
         MVI   HDSEPCHR,C'='                                       0317 00676000
*   XREFX=1;                        /* INIT OUTPUT ARRAY INDEX       */ 00677000
         LA    XREFX,1                                             0318 00678000
*   DO WHILE(                       /* LOOP PROCESSING RECORDS       */ 00679000
*         XREFRC=ZERO               /* WHILE NO ERRORS               */ 00680000
*         &GTPRETRN=GTPGOOD         /* AND NOT EOF                   */ 00681000
*         &XRFETYPE=SAVETYPE        /* AND SAME TYPE ELEMENT         */ 00682000
*         &XRFENAME=SAVENAME        /* FOR SAME ELEMENT              */ 00683000
*         &XRFRTYPE=SAVRTYPE);      /* AND SAME TYPE XREF RECORD     */ 00684000
*                                                                  0319 00685000
         B     @DE00319                                            0319 00686000
@DL00319 DS    0H                                                  0320 00687000
*     /***************************************************************/ 00688000
*     /*                                                             */ 00689000
*     /* IF OUTPUT LINE FULL THEN PRINT IT NOW                       */ 00690000
*     /*                                                             */ 00691000
*     /***************************************************************/ 00692000
*                                                                  0320 00693000
*     IF XREFX>DIM(HDVSLIST)        /* IF MAX PER LINE REACHED       */ 00694000
*       THEN                        /*                               */ 00695000
         CH    XREFX,@CH00434                                      0320 00696000
         BNH   @RF00320                                            0320 00697000
*       DO;                         /*                               */ 00698000
*         CALL FXFWRITE;            /* WRITE OUTPUT LINE             */ 00699000
         BAL   @14,FXFWRITE                                        0322 00700000
*         RFY                       /*                               */ 00701000
*           RTNCODE RSTD;           /*                               */ 00702000
*         XREFRC=MAX(XREFRC,RTNCODE);/* SAVE RC                      */ 00703000
         CR    XREFRC,RTNCODE                                      0324 00704000
         BNL   *+6                                                      00705000
         LR    XREFRC,RTNCODE                                      0324 00706000
*         RFY                       /*                               */ 00707000
*           RTNCODE UNRSTD;         /*                               */ 00708000
*         XREFX=1;                  /* RESET INDEX TO FIRST ENTRY    */ 00709000
         LA    XREFX,1                                             0326 00710000
*       END;                        /*                               */ 00711000
*                                                                  0327 00712000
*     /***************************************************************/ 00713000
*     /*                                                             */ 00714000
*     /* NOW PUT IN ELEMENT OR SYSMOD NUMBER IN OUTPUT LINE          */ 00715000
*     /*                                                             */ 00716000
*     /***************************************************************/ 00717000
*                                                                  0328 00718000
*     IF XRFRTYPE=XRFASMMC          /* IF MAC FOR ASSEM              */ 00719000
*         |XRFRTYPE=XRFSRCMC        /* OR MAC FOR SRC                */ 00720000
*       THEN                        /*                               */ 00721000
@RF00320 CLI   XRFRTYPE,10                                         0328 00722000
         BE    @RT00328                                            0328 00723000
         CLI   XRFRTYPE,53                                         0328 00724000
         BNE   @RF00328                                            0328 00725000
@RT00328 DS    0H                                                  0329 00726000
*       HDVSDATA(XREFX)=XRF1MAC;    /* MOVE MACRO NAME               */ 00727000
         LR    @10,XREFX                                           0329 00728000
         MH    @10,@CH00327                                        0329 00729000
         LA    @01,HDVSDATA-10(@10)                                0329 00730000
         MVC   0(8,@01),XRF1MAC                                    0329 00731000
*     ELSE                          /*                               */ 00732000
*       IF XRFRTYPE=XRFLMDMD        /* IF MOD FOR LMODS              */ 00733000
*         THEN                      /*                               */ 00734000
         B     @RC00328                                            0330 00735000
@RF00328 CLI   XRFRTYPE,20                                         0330 00736000
         BNE   @RF00330                                            0330 00737000
*         HDVSDATA(XREFX)=XRF2MOD;  /* MOVE MOD NAME                 */ 00738000
         LR    @10,XREFX                                           0331 00739000
         MH    @10,@CH00327                                        0331 00740000
         LA    @01,HDVSDATA-10(@10)                                0331 00741000
         MVC   0(8,@01),XRF2MOD                                    0331 00742000
*       ELSE                        /* ELSE MUST BE PTF TYPE DATA    */ 00743000
*         HDVSSMD(XREFX)=XRFX4PTF;  /* MOVE SYSMOD NUMBER            */ 00744000
         B     @RC00330                                            0332 00745000
@RF00330 LR    @10,XREFX                                           0332 00746000
         MH    @10,@CH00327                                        0332 00747000
         LA    @01,HDVSSMD-10(@10)                                 0332 00748000
         MVC   0(7,@01),XRFX4PTF                                   0332 00749000
*     XREFX=XREFX+1;                /* INCR OUTPUT INDEX             */ 00750000
@RC00330 DS    0H                                                  0333 00751000
@RC00328 AH    XREFX,@CH00085                                      0333 00752000
*     CALL HMASMGTA(HMASMGTP);      /* GET NEXT RECORD TO PROCESS    */ 00753000
         ST    GTPPTR,@AL00001                                     0334 00754000
         L     @15,@CV01352                                        0334 00755000
         LA    @01,@AL00001                                        0334 00756000
         BALR  @14,@15                                             0334 00757000
*   END;                            /* END DO WHILE GTA READ LOOP    */ 00758000
@DE00319 CH    XREFRC,@CH00251                                     0335 00759000
         BNE   @DC00319                                            0335 00760000
         CLI   GTPRETRN(GTPPTR),0                                  0335 00761000
         BNE   @DC00319                                            0335 00762000
         SLR   @10,@10                                             0335 00763000
         IC    @10,XRFETYPE                                        0335 00764000
         CR    SAVETYPE,@10                                        0335 00765000
         BNE   @DC00319                                            0335 00766000
         CLC   XRFENAME(8),SAVENAME                                0335 00767000
         BNE   @DC00319                                            0335 00768000
         SLR   @10,@10                                             0335 00769000
         IC    @10,XRFRTYPE                                        0335 00770000
         CR    SAVRTYPE,@10                                        0335 00771000
         BE    @DL00319                                            0335 00772000
@DC00319 DS    0H                                                  0336 00773000
*                                                                  0336 00774000
*   /*****************************************************************/ 00775000
*   /*                                                               */ 00776000
*   /* IF ANY DATA WAS MOVED TO OUTPUT LINE AND NOT YET PRINTED THEN */ 00777000
*   /* PRINT IT NOW                                                  */ 00778000
*   /*                                                               */ 00779000
*   /*****************************************************************/ 00780000
*                                                                  0336 00781000
*   IF XREFX>1                      /* IF ANY DATA IN OUTPUT LINE    */ 00782000
*     THEN                          /*                               */ 00783000
         CH    XREFX,@CH00085                                      0336 00784000
         BNH   @RF00336                                            0336 00785000
*     DO;                           /*                               */ 00786000
*       CALL FXFWRITE;              /*                               */ 00787000
         BAL   @14,FXFWRITE                                        0338 00788000
*       RFY                         /*                               */ 00789000
*         RTNCODE RSTD;             /*                               */ 00790000
*       XREFRC=MAX(XREFRC,RTNCODE); /* SAVE RC                       */ 00791000
         CR    XREFRC,RTNCODE                                      0340 00792000
         BNL   *+6                                                      00793000
         LR    XREFRC,RTNCODE                                      0340 00794000
*       RFY                         /*                               */ 00795000
*         RTNCODE UNRSTD;           /*                               */ 00796000
*     END;                          /*                               */ 00797000
*                                                                  0342 00798000
*   /*****************************************************************/ 00799000
*   /*                                                               */ 00800000
*   /* ALL XREF DATA OF INIT TYPE FOR THIS ELEMENT HAS BEEN PROCESSED*/ 00801000
*   /* AND FORMATTED. RETURN TO CALLER                               */ 00802000
*   /*                                                               */ 00803000
*   /*****************************************************************/ 00804000
*                                                                  0343 00805000
*   RETURN CODE(XREFRC);                                           0343 00806000
@RF00336 LR    @15,XREFRC                                          0343 00807000
         L     @14,@SA00004                                        0343 00808000
         LM    @00,@12,@SA00004+8                                  0343 00809000
         BR    @14                                                 0343 00810000
*   END FXFXREF;                                                   0344 00811000
         EJECT                                                          00812000
*                                                                  0345 00813000
*   /*****************************************************************/ 00814000
*   /*                                                               */ 00815000
*   /* ROUTINE TO PRINT OUTPUT LINE                                  */ 00816000
*   /*                                                               */ 00817000
*   /*****************************************************************/ 00818000
*                                                                  0345 00819000
*FXFWRITE:                                                         0345 00820000
*   PROCEDURE;                      /*                               */ 00821000
FXFWRITE STM   @14,@12,@SA00005                                    0345 00822000
*   DECLARE                         /*                               */ 00823000
*     SAVBUFAD FIXED(31),           /*                               */ 00824000
*     SAVDSID FIXED(8),             /*                               */ 00825000
*     SAVTYPE FIXED(8),             /*                               */ 00826000
*     SAVFUNCT FIXED(8);            /*                               */ 00827000
*   RFY                                                            0347 00828000
*     HMASMIOP BASED(IOPPTR);       /*                               */ 00829000
*   RFY                                                            0348 00830000
*     HMASMPRL BASED(IOPBUFAD);     /*                               */ 00831000
*   SAVBUFAD=IOPBUFAD;              /* SAVE THE IOP                  */ 00832000
         L     SAVBUFAD,IOPBUFAD(,IOPPTR)                          0349 00833000
*   SAVDSID=IOPDSID;                /*                               */ 00834000
         SLR   SAVDSID,SAVDSID                                     0350 00835000
         IC    SAVDSID,IOPDSID(,IOPPTR)                            0350 00836000
*   SAVTYPE=IOPTYPE;                /*                               */ 00837000
         SLR   SAVTYPE,SAVTYPE                                     0351 00838000
         IC    SAVTYPE,IOPTYPE(,IOPPTR)                            0351 00839000
*   SAVFUNCT=IOPFUNCT;              /*                               */ 00840000
         SLR   SAVFUNCT,SAVFUNCT                                   0352 00841000
         IC    SAVFUNCT,IOPFUNCT(,IOPPTR)                          0352 00842000
*   IOPBUFAD=ADDR(OUTAREA);         /* SETUP THE IOP FOR PRINT       */ 00843000
         LA    @10,OUTAREA                                         0353 00844000
         ST    @10,IOPBUFAD(,IOPPTR)                               0353 00845000
*   HMASMPRL=''B;                   /*                               */ 00846000
         XC    HMASMPRL(10,@10),HMASMPRL(@10)                      0354 00847000
*   PRLRLEN=LENGTH(PRNTBUF);        /* THE PRL MUST BE SET EVEN IF NO*/ 00848000
         MVC   PRLRLEN(2,@10),@CH01289                             0355 00849000
*   IOPDSID=CCALSTDS;               /*                               */ 00850000
         MVC   IOPDSID(1,IOPPTR),CCALSTDS(CCAPTR)                  0356 00851000
*   IOPFUNCT=IOPWRITE;              /*                               */ 00852000
         MVI   IOPFUNCT(IOPPTR),X'51'                              0357 00853000
*   CALL HMASMIO(HMASMIOP);         /* CALL I/O TO PRINT THE BUFFER  */ 00854000
         ST    IOPPTR,@AL00001                                     0358 00855000
         L     @15,@CV01351                                        0358 00856000
         LA    @01,@AL00001                                        0358 00857000
         BALR  @14,@15                                             0358 00858000
*   PRNTBUF(1:LENGTH(PRNTBUF))='';  /* RESET OUTPUT AREA             */ 00859000
         MVI   PRNTBUF,C' '                                        0359 00860000
         MVC   PRNTBUF+1(119),PRNTBUF                              0359 00861000
*   IOPBUFAD=SAVBUFAD;              /* RESTORE THE IOP               */ 00862000
         ST    SAVBUFAD,IOPBUFAD(,IOPPTR)                          0360 00863000
*   IOPDSID=SAVDSID;                /*                               */ 00864000
         STC   SAVDSID,IOPDSID(,IOPPTR)                            0361 00865000
*   IOPTYPE=SAVTYPE;                /*                               */ 00866000
         STC   SAVTYPE,IOPTYPE(,IOPPTR)                            0362 00867000
*   IOPFUNCT=SAVFUNCT;              /*                               */ 00868000
         STC   SAVFUNCT,IOPFUNCT(,IOPPTR)                          0363 00869000
*   RETURN CODE(IOPRETRN);          /* RETURN WITH CODE FROM WRITE   */ 00870000
         SLR   @15,@15                                             0364 00871000
         IC    @15,IOPRETRN(,IOPPTR)                               0364 00872000
         L     @14,@SA00005                                        0364 00873000
         LM    @00,@12,@SA00005+8                                  0364 00874000
         BR    @14                                                 0364 00875000
*   END FXFWRITE;                   /*                               */ 00876000
*   END HMASMFXF                    /*                               */ 00877000
*                                                                  0366 00878000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00879000
*/*%INCLUDE SYSLIB  (HMASMCCA)                                       */ 00880000
*/*%INCLUDE SYSLIB  (HMASMIOP)                                       */ 00881000
*/*%INCLUDE SYSLIB  (HMASMPRL)                                       */ 00882000
*/*%INCLUDE SYSLIB  (HMASMGTP)                                       */ 00883000
*                                                                  0366 00884000
*       ;                                                          0366 00885000
@DATA    DS    0H                                                       00886000
@CH00251 DC    H'0'                                                     00887000
@CH00085 DC    H'1'                                                     00888000
@CH00434 DC    H'9'                                                     00889000
@CH00327 DC    H'10'                                                    00890000
@CH00472 DC    H'30'                                                    00891000
@CH01289 DC    H'120'                                                   00892000
@CH00623 DC    H'255'                                                   00893000
         DS    0F                                                       00894000
@SA00001 DS    18F                                                      00895000
@PC00001 DS    1F                                                       00896000
@SA00003 DS    15F                                                      00897000
@SA00004 DS    15F                                                      00898000
@SA00005 DS    0F                                                       00899000
@SA00002 DS    0F                                                       00900000
         DS    15F                                                      00901000
@AL00001 DS    1A                                                       00902000
         DS    0F                                                       00903000
@CV01351 DC    V(HMASMIO)                                               00904000
@CV01352 DC    V(HMASMGTA)                                              00905000
         DS    0D                                                       00906000
LASTTYPE DC    AL1(255)                                                 00907000
@CC01410 DC    C'SYSMOD HISTORY '                                       00908000
@CC01431 DC    C'FUNCTION'                                              00909000
@CC01433 DC    C'PTF     '                                              00910000
@CC01435 DC    C'APAR    '                                              00911000
@CC01437 DC    C'USERMOD '                                              00912000
@CC01439 DC    C'SRC     '                                              00913000
@CC01441 DC    C'SRCUPD  '                                              00914000
@CC01443 DC    C'MOD     '                                              00915000
@CC01445 DC    C'SZAP    '                                              00916000
@CC01447 DC    C'XZAP    '                                              00917000
@CC01449 DC    C'MAC     '                                              00918000
@CC01451 DC    C'MACUPD  '                                              00919000
@CC01453 DC    C'ASSEM   '                                              00920000
@CC01455 DC    C'RSRC    '                                              00921000
@CC01457 DC    C'RSRCUPD '                                              00922000
@CC01459 DC    C'RMOD    '                                              00923000
@CC01461 DC    C'RSZAP   '                                              00924000
@CC01463 DC    C'RXZAP   '                                              00925000
@CC01465 DC    C'RMAC    '                                              00926000
@CC01467 DC    C'RMACUPD '                                              00927000
@CC01469 DC    C'APP'                                                   00928000
@CC01471 DC    C'RES'                                                   00929000
@CC01473 DC    C'ACC'                                                   00930000
@CC01475 DC    C'ERR'                                                   00931000
@CC01477 DC    C'BYP'                                                   00932000
@CC01479 DC    C'RGN'                                                   00933000
XRFRCD   DS    CL30                                                     00934000
         ORG   XRFRCD                                                   00935000
XRFKEY1  DS    CL29                                                     00936000
         ORG   XRFKEY1                                                  00937000
XRFETYPE DS    FL1                                                      00938000
XRFENAME DS    CL8                                                      00939000
XRFRTYPE DS    FL1                                                      00940000
XRFUKEY1 DS    FL1                                                      00941000
@NM00176 DS    CL18                                                     00942000
         ORG   XRFRCD+29                                                00943000
XRFNKEY1 DS    CL1                                                      00944000
         ORG   XRFNKEY1                                                 00945000
XRFFLAG1 DS    BL1                                                      00946000
         ORG   XRFFLAG1                                                 00947000
XRFFLGA  DS    BL1                                                      00948000
XRFFLGB  EQU   XRFFLAG1+0                                               00949000
XRFFLGC  EQU   XRFFLAG1+0                                               00950000
XRFFLGD  EQU   XRFFLAG1+0                                               00951000
XRFFLGE  EQU   XRFFLAG1+0                                               00952000
XRFFLGF  EQU   XRFFLAG1+0                                               00953000
XRFFLGG  EQU   XRFFLAG1+0                                               00954000
XRFFLGH  EQU   XRFFLAG1+0                                               00955000
         ORG   XRFRCD+30                                                00956000
SAVENAME DS    CL8                                                      00957000
CNVDATE  DS    CL3                                                      00958000
WORKAREA DS    CL5                                                      00959000
         ORG   WORKAREA                                                 00960000
YEAR     DS    CL2                                                      00961000
DAY      DS    CL3                                                      00962000
         ORG   WORKAREA+5                                               00963000
PATCHFXF DS    CL80                                                     00964000
         ORG   PATCHFXF                                                 00965000
@NM00197 DC    80X'FF'                                                  00966000
         ORG   PATCHFXF+80                                              00967000
OUTAREA  DS    CL130                                                    00968000
         ORG   OUTAREA                                                  00969000
PRNTPRLG DS    CL10                                                     00970000
PRNTBUF  DC    CL120' '                                                 00971000
         ORG   OUTAREA+130                                              00972000
TXTSMDMP DS    CL65                                                     00973000
         ORG   TXTSMDMP                                                 00974000
@NM00210 DC    CL7'SYSMOD '                                             00975000
@NM00211 DC    CL2'  '                                                  00976000
@NM00212 DC    CL8'TYPE    '                                            00977000
@NM00213 DC    CL2'  '                                                  00978000
@NM00214 DC    CL6' DATE '                                              00979000
@NM00215 DC    CL2'  '                                                  00980000
@NM00216 DC    CL8'MCS     '                                            00981000
@NM00217 DC    CL2'  '                                                  00982000
@NM00218 DC    CL28'---------- STATUS ----------'                       00983000
         ORG   TXTSMDMP+65                                              00984000
FXFTBL1  DS    CL176                                                    00985000
         ORG   FXFTBL1                                                  00986000
@NM00220 DS    CL16                                                     00987000
         ORG   @NM00220                                                 00988000
@NM00221 DC    AL1(10)                                                  00989000
@NM00222 DC    CL15'MACROS USED    '                                    00990000
         ORG   FXFTBL1+16                                               00991000
@NM00223 DS    CL16                                                     00992000
         ORG   @NM00223                                                 00993000
@NM00224 DC    AL1(20)                                                  00994000
@NM00225 DC    CL15'MODULES        '                                    00995000
         ORG   FXFTBL1+32                                               00996000
@NM00226 DS    CL16                                                     00997000
         ORG   @NM00226                                                 00998000
@NM00227 DC    AL1(53)                                                  00999000
@NM00228 DC    CL15'MACROS USED    '                                    01000000
         ORG   FXFTBL1+48                                               01001000
@NM00229 DS    CL16                                                     01002000
         ORG   @NM00229                                                 01003000
@NM00230 DC    AL1(105)                                                 01004000
@NM00231 DC    CL15'IFREQBY  (XREF)'                                    01005000
         ORG   FXFTBL1+64                                               01006000
@NM00232 DS    CL16                                                     01007000
         ORG   @NM00232                                                 01008000
@NM00233 DC    AL1(110)                                                 01009000
@NM00234 DC    CL15'NPREBY   (XREF)'                                    01010000
         ORG   FXFTBL1+80                                               01011000
@NM00235 DS    CL16                                                     01012000
         ORG   @NM00235                                                 01013000
@NM00236 DC    AL1(115)                                                 01014000
@NM00237 DC    CL15'PREBY    (XREF)'                                    01015000
         ORG   FXFTBL1+96                                               01016000
@NM00238 DS    CL16                                                     01017000
         ORG   @NM00238                                                 01018000
@NM00239 DC    AL1(120)                                                 01019000
@NM00240 DC    CL15'REQBY    (XREF)'                                    01020000
         ORG   FXFTBL1+112                                              01021000
@NM00241 DS    CL16                                                     01022000
         ORG   @NM00241                                                 01023000
@NM00242 DC    AL1(125)                                                 01024000
@NM00243 DC    CL15'SUPBY    (XREF)'                                    01025000
         ORG   FXFTBL1+128                                              01026000
@NM00244 DS    CL16                                                     01027000
         ORG   @NM00244                                                 01028000
@NM00245 DC    AL1(130)                                                 01029000
@NM00246 DC    CL15'DELBY    (XREF)'                                    01030000
         ORG   FXFTBL1+144                                              01031000
@NM00247 DS    CL16                                                     01032000
         ORG   @NM00247                                                 01033000
@NM00248 DC    AL1(135)                                                 01034000
@NM00249 DC    CL15'VERSIONBY(XREF)'                                    01035000
         ORG   FXFTBL1+160                                              01036000
@NM00250 DS    CL16                                                     01037000
         ORG   @NM00250                                                 01038000
@NM00251 DC    AL1(255)                                                 01039000
@NM00252 DC    CL15'UNKNOWN        '                                    01040000
         ORG   FXFTBL1+176                                              01041000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01042000
@01      EQU   01                                                       01043000
@02      EQU   02                                                       01044000
@03      EQU   03                                                       01045000
@04      EQU   04                                                       01046000
@05      EQU   05                                                       01047000
@06      EQU   06                                                       01048000
@07      EQU   07                                                       01049000
@08      EQU   08                                                       01050000
@09      EQU   09                                                       01051000
@10      EQU   10                                                       01052000
@11      EQU   11                                                       01053000
@12      EQU   12                                                       01054000
@13      EQU   13                                                       01055000
@14      EQU   14                                                       01056000
@15      EQU   15                                                       01057000
SAVFUNCT EQU   @06                                                      01058000
SAVTYPE  EQU   @05                                                      01059000
SAVDSID  EQU   @04                                                      01060000
SAVBUFAD EQU   @03                                                      01061000
XREFX    EQU   @03                                                      01062000
XREFRC   EQU   @05                                                      01063000
SMDBYRC  EQU   @03                                                      01064000
SAVRTYPE EQU   @07                                                      01065000
SAVETYPE EQU   @06                                                      01066000
FXFRTNCD EQU   @03                                                      01067000
GTPPTR   EQU   @04                                                      01068000
IOPPTR   EQU   @02                                                      01069000
CCAPTR   EQU   @11                                                      01070000
RTNCODE  EQU   @15                                                      01071000
RTNREG   EQU   @14                                                      01072000
HMASMCCA EQU   0                                                        01073000
CCAFBUFR EQU   HMASMCCA+4                                               01074000
CCADSAD  EQU   CCAFBUFR+124                                             01075000
CCATPAD  EQU   CCAFBUFR+128                                             01076000
CCAFLAG7 EQU   CCAFBUFR+132                                             01077000
CCAFIOP  EQU   HMASMCCA+140                                             01078000
CCAFSYS  EQU   HMASMCCA+148                                             01079000
CCASREL  EQU   CCAFSYS+12                                               01080000
CCAFLAGA EQU   CCAFSYS+21                                               01081000
CCAFSTA  EQU   HMASMCCA+188                                             01082000
CCAFICT  EQU   HMASMCCA+192                                             01083000
CCAFPGM  EQU   HMASMCCA+208                                             01084000
CCABLDLP EQU   CCAFPGM                                                  01085000
CCADBLDL EQU   CCAFPGM+4                                                01086000
CCAFGTP  EQU   HMASMCCA+224                                             01087000
CCASEGTP EQU   CCAFGTP                                                  01088000
CCAGTP1  EQU   CCAFGTP+4                                                01089000
@NM00009 EQU   HMASMCCA+244                                             01090000
CCAFFUNC EQU   HMASMCCA+264                                             01091000
CCAFLAG1 EQU   CCAFFUNC+8                                               01092000
CCAFLAG2 EQU   CCAFFUNC+11                                              01093000
CCAFPROC EQU   HMASMCCA+276                                             01094000
CCAFLAG3 EQU   CCAFPROC                                                 01095000
CCAFDIS  EQU   HMASMCCA+278                                             01096000
CCAFLAG4 EQU   CCAFDIS                                                  01097000
CCAFLAG5 EQU   CCAFDIS+1                                                01098000
CCAFLAG6 EQU   CCAFDIS+2                                                01099000
CCAFCNV  EQU   HMASMCCA+281                                             01100000
CCAFLAG8 EQU   CCAFCNV                                                  01101000
CCAFCTL  EQU   HMASMCCA+282                                             01102000
CCAFLAG9 EQU   CCAFCTL                                                  01103000
CCALSTDS EQU   CCAFCTL+8                                                01104000
CCAFDSNG EQU   HMASMCCA+298                                             01105000
CCAFLAGB EQU   CCAFDSNG                                                 01106000
CCABLDLA EQU   0                                                        01107000
@NM00025 EQU   CCABLDLA                                                 01108000
CCABLDLL EQU   0                                                        01109000
@NM00027 EQU   CCABLDLL                                                 01110000
CCALKDRC EQU   @NM00027+20                                              01111000
@NM00029 EQU   CCABLDLL+124                                             01112000
CCAASMRC EQU   @NM00029+20                                              01113000
@NM00031 EQU   CCABLDLL+248                                             01114000
CCACPYRC EQU   @NM00031+20                                              01115000
@NM00033 EQU   CCABLDLL+372                                             01116000
CCACOMRC EQU   @NM00033+20                                              01117000
@NM00035 EQU   CCABLDLL+496                                             01118000
CCAZAPRC EQU   @NM00035+20                                              01119000
@NM00037 EQU   CCABLDLL+620                                             01120000
CCASUPRC EQU   @NM00037+20                                              01121000
@NM00039 EQU   CCABLDLL+744                                             01122000
CCAUPDRC EQU   @NM00039+20                                              01123000
CCABLDLM EQU   0                                                        01124000
CCABELMT EQU   CCABLDLM+4                                               01125000
CCABMPOS EQU   CCABELMT                                                 01126000
HMASMIOP EQU   0                                                        01127000
IOPDSID  EQU   HMASMIOP                                                 01128000
IOPFUNCT EQU   HMASMIOP+1                                               01129000
IOPRETRN EQU   HMASMIOP+2                                               01130000
IOPTYPE  EQU   HMASMIOP+3                                               01131000
IOPNAME  EQU   HMASMIOP+4                                               01132000
@NM00043 EQU   HMASMIOP+12                                              01133000
@NM00044 EQU   @NM00043                                                 01134000
IOPDDNAM EQU   HMASMIOP+24                                              01135000
IOPBUFAD EQU   HMASMIOP+52                                              01136000
IOPDRMAP EQU   HMASMIOP+56                                              01137000
IOPINAME EQU   IOPDRMAP                                                 01138000
IOPINAM  EQU   IOPINAME                                                 01139000
IOPITYP  EQU   IOPINAM                                                  01140000
IOPUSERL EQU   IOPDRMAP+11                                              01141000
IOPEND   EQU   IOPDRMAP+12                                              01142000
IOPLMCTL EQU   0                                                        01143000
IOPQSMIF EQU   0                                                        01144000
@NM00154 EQU   IOPQSMIF                                                 01145000
IOPQSMLS EQU   IOPQSMIF+8                                               01146000
IOPQSMNM EQU   IOPQSMLS                                                 01147000
IOPBS02  EQU   0                                                        01148000
IOPBS04  EQU   0                                                        01149000
IOPBAPF  EQU   IOPBS04                                                  01150000
HMASMPRL EQU   0                                                        01151000
PRLRLEN  EQU   HMASMPRL                                                 01152000
PRLSPAN  EQU   HMASMPRL+2                                               01153000
PRLFLGS  EQU   PRLSPAN                                                  01154000
PRLDATE  EQU   HMASMPRL+4                                               01155000
PRLTIME  EQU   HMASMPRL+7                                               01156000
PRLEND   EQU   HMASMPRL+10                                              01157000
HMASMGTP EQU   0                                                        01158000
GTPFUNCT EQU   HMASMGTP                                                 01159000
GTPRETRN EQU   HMASMGTP+1                                               01160000
GTPRCDLN EQU   HMASMGTP+4                                               01161000
GTPKEYLN EQU   HMASMGTP+6                                               01162000
GTPBUFAD EQU   HMASMGTP+12                                              01163000
GTPRESTR EQU   HMASMGTP+16                                              01164000
GTPFLGS1 EQU   HMASMGTP+26                                              01165000
CCADSIDA EQU   0                                                        01166000
CCATYPEA EQU   0                                                        01167000
IOPBS01  EQU   0                                                        01168000
IOPBS03  EQU   0                                                        01169000
PASSIOP  EQU   0                                                        01170000
IOPUDATA EQU   IOPEND                                                   01171000
IOPINAM3 EQU   IOPINAME                                                 01172000
@NM00050 EQU   IOPINAM3                                                 01173000
IOPSTCMP EQU   IOPUDATA                                                 01174000
IOPDYNDT EQU   IOPUDATA                                                 01175000
IOPSPACE EQU   IOPDYNDT+44                                              01176000
IOPDTYPE EQU   IOPDYNDT+50                                              01177000
IOPNTMAX EQU   IOPDRMAP                                                 01178000
IOPNTMAP EQU   IOPDRMAP                                                 01179000
IOPCDMAP EQU   IOPNTMAP                                                 01180000
IOPPTMAP EQU   IOPCDMAP                                                 01181000
IOPSCMAP EQU   IOPPTMAP                                                 01182000
IOPDIRCT EQU   IOPSCMAP+12                                              01183000
IOPCDMAX EQU   IOPDIRCT                                                 01184000
IOPCQMAP EQU   IOPDRMAP                                                 01185000
@NM00061 EQU   IOPUDATA                                                 01186000
@NM00062 EQU   IOPUDATA                                                 01187000
IOPASMNT EQU   IOPUDATA                                                 01188000
IOPASMDR EQU   IOPASMNT                                                 01189000
IOPABUNT EQU   IOPASMDR+1                                               01190000
IOPLMDNT EQU   IOPUDATA                                                 01191000
IOPLMDDR EQU   IOPLMDNT                                                 01192000
IOPLMLEP EQU   IOPLMDDR+1                                               01193000
IOPLMDF1 EQU   IOPLMLEP                                                 01194000
IOPFLGS2 EQU   IOPLMDF1                                                 01195000
IOPLMDF2 EQU   IOPLMLEP+1                                               01196000
IOPLMDF3 EQU   IOPLMLEP+2                                               01197000
IOPLMDF4 EQU   IOPLMLEP+3                                               01198000
IOPLMDF5 EQU   IOPLMDDR+5                                               01199000
IOPFLGS3 EQU   IOPLMDF5                                                 01200000
IOPLMDFX EQU   IOPLMDNT+24                                              01201000
@NM00071 EQU   IOPLMDFX                                                 01202000
IOPLNTRY EQU   IOPLMDFX+8                                               01203000
IOPLSYS  EQU   IOPLNTRY                                                 01204000
IOPSYSLB EQU   IOPLSYS                                                  01205000
IOPMACNT EQU   IOPUDATA                                                 01206000
IOPMACDR EQU   IOPMACNT                                                 01207000
IOPRMIDE EQU   IOPMACDR+1                                               01208000
IOPRMST  EQU   IOPRMIDE+7                                               01209000
IOPFMIDE EQU   IOPMACDR+9                                               01210000
IOPMACFX EQU   IOPMACNT+24                                              01211000
IOPBUNT  EQU   IOPMACFX                                                 01212000
IOPMCEND EQU   IOPMACNT+104                                             01213000
IOPMACVR EQU   IOPMCEND                                                 01214000
IOPMCENT EQU   IOPMACVR                                                 01215000
IOPMCDTA EQU   IOPMCENT                                                 01216000
IOPMCASM EQU   IOPMCDTA                                                 01217000
IOPMACID EQU   IOPMCASM                                                 01218000
IOPMACST EQU   IOPMCASM+7                                               01219000
IOPMCIND EQU   IOPMCENT+8                                               01220000
IOPEOFNT EQU   IOPUDATA                                                 01221000
IOPSRCNT EQU   IOPUDATA                                                 01222000
IOPSRCDR EQU   IOPSRCNT                                                 01223000
@NM00082 EQU   IOPSRCDR+1                                               01224000
@NM00084 EQU   @NM00082+7                                               01225000
@NM00088 EQU   IOPSRCDR+9                                               01226000
IOPSRCFX EQU   IOPSRCNT+24                                              01227000
@NM00092 EQU   IOPSRCFX                                                 01228000
IOPSREND EQU   IOPSRCNT+104                                             01229000
IOPSRCVR EQU   IOPSREND                                                 01230000
IOPSNTRY EQU   IOPSRCVR                                                 01231000
IOPSRDTA EQU   IOPSNTRY                                                 01232000
IOPSRCID EQU   IOPSRDTA                                                 01233000
IOPSRCST EQU   IOPSRDTA+7                                               01234000
IOPMODNT EQU   IOPUDATA                                                 01235000
IOPMODDR EQU   IOPMODNT                                                 01236000
@NM00098 EQU   IOPMODDR+1                                               01237000
@NM00100 EQU   @NM00098+7                                               01238000
@NM00104 EQU   IOPMODDR+9                                               01239000
IOPMODFX EQU   IOPMODNT+24                                              01240000
@NM00108 EQU   IOPMODFX                                                 01241000
IOPMDLEP EQU   IOPMODFX+8                                               01242000
IOPMODF1 EQU   IOPMDLEP                                                 01243000
IOPMODF2 EQU   IOPMDLEP+1                                               01244000
IOPMODF3 EQU   IOPMDLEP+2                                               01245000
IOPMODF4 EQU   IOPMDLEP+3                                               01246000
IOPMDEND EQU   IOPMODNT+104                                             01247000
IOPMODVR EQU   IOPMDEND                                                 01248000
IOPMNTRY EQU   IOPMODVR                                                 01249000
IOPMDDTA EQU   IOPMNTRY                                                 01250000
IOPLMODS EQU   IOPMDDTA                                                 01251000
IOPMODID EQU   IOPLMODS                                                 01252000
IOPMODST EQU   IOPLMODS+7                                               01253000
IOPDLBNT EQU   IOPUDATA                                                 01254000
IOPDLBDR EQU   IOPDLBNT                                                 01255000
IOPDLBFX EQU   IOPDLBNT+24                                              01256000
@NM00119 EQU   IOPDLBFX                                                 01257000
IOPDLEND EQU   IOPDLBNT+104                                             01258000
IOPDLBVR EQU   IOPDLEND                                                 01259000
IOPDNTRY EQU   IOPDLBVR                                                 01260000
IOPDSYS  EQU   IOPDNTRY                                                 01261000
IOPSYSNT EQU   IOPUDATA                                                 01262000
IOPSYSDR EQU   IOPSYSNT                                                 01263000
IOPSYSF1 EQU   IOPSYSDR+4                                               01264000
IOPFLGS7 EQU   IOPSYSF1                                                 01265000
IOPSYSFX EQU   IOPSYSNT+24                                              01266000
@NM00126 EQU   IOPSYSFX                                                 01267000
IOPSYEND EQU   IOPSYSNT+184                                             01268000
IOPSYSVR EQU   IOPSYEND                                                 01269000
IOPSYSTR EQU   IOPSYSVR                                                 01270000
IOPSYNTR EQU   IOPSYSTR                                                 01271000
IOPPTFNT EQU   IOPUDATA                                                 01272000
IOPPTFDR EQU   IOPPTFNT                                                 01273000
IOPPSTAT EQU   IOPPTFDR+2                                               01274000
IOPPTFF1 EQU   IOPPSTAT                                                 01275000
IOPFLGS5 EQU   IOPPTFF1                                                 01276000
IOPAPP   EQU   IOPFLGS5                                                 01277000
IOPRES   EQU   IOPFLGS5                                                 01278000
IOPACC   EQU   IOPFLGS5                                                 01279000
IOPERROR EQU   IOPFLGS5                                                 01280000
IOPBYP   EQU   IOPFLGS5                                                 01281000
IOPREGEN EQU   IOPFLGS5                                                 01282000
IOPPTFF2 EQU   IOPPSTAT+1                                               01283000
IOPPTFF3 EQU   IOPPSTAT+3                                               01284000
IOPPTFFX EQU   IOPPTFNT+24                                              01285000
@NM00135 EQU   IOPPTFFX                                                 01286000
@NM00136 EQU   @NM00135                                                 01287000
IOPPDTES EQU   IOPPTFFX+41                                              01288000
@NM00139 EQU   IOPPDTES                                                 01289000
IOPPTPFX EQU   IOPPDTES+6                                               01290000
IOPDATES EQU   IOPPTPFX                                                 01291000
IOPPTEND EQU   IOPPTFNT+104                                             01292000
IOPPTFVR EQU   IOPPTEND                                                 01293000
IOPPNTRY EQU   IOPPTFVR                                                 01294000
IOPPMODS EQU   IOPPNTRY                                                 01295000
IOPENTNT EQU   IOPUDATA+104                                             01296000
IOPSRLNT EQU   IOPUDATA+104                                             01297000
IOPPRENT EQU   IOPUDATA+104                                             01298000
IOPNPRNT EQU   IOPUDATA+104                                             01299000
IOPSUPNT EQU   IOPUDATA+104                                             01300000
IOPREQNT EQU   IOPUDATA+104                                             01301000
IOPIRQNT EQU   IOPUDATA+104                                             01302000
IOPFIDNT EQU   IOPUDATA+104                                             01303000
IOPDELNT EQU   IOPUDATA+104                                             01304000
IOPVERNT EQU   IOPUDATA+104                                             01305000
IOPSBYNT EQU   IOPUDATA+104                                             01306000
IOPQSMNT EQU   IOPUDATA                                                 01307000
IOPQSMDR EQU   IOPQSMNT                                                 01308000
IOPQFMNT EQU   IOPUDATA                                                 01309000
IOPQFMDR EQU   IOPQFMNT                                                 01310000
IOPQFEND EQU   IOPQFMNT+2                                               01311000
IOPQFMVR EQU   IOPQFEND                                                 01312000
IOPQFMLS EQU   IOPQFMVR                                                 01313000
IOPQFMNM EQU   IOPQFMLS                                                 01314000
IOPPTSYS EQU   IOPUDATA                                                 01315000
IOPPTSDR EQU   IOPPTSYS                                                 01316000
IOPPTSFX EQU   IOPPTSYS+24                                              01317000
IOPDSSPC EQU   IOPPTSFX                                                 01318000
IOPPTFG1 EQU   IOPPTSFX+34                                              01319000
IOPPSEND EQU   IOPPTSYS+1064                                            01320000
IOPPTSVR EQU   IOPPSEND                                                 01321000
IOPPTNTR EQU   IOPPTSVR                                                 01322000
@NM00164 EQU   IOPPTNTR                                                 01323000
IOPPTFMD EQU   @NM00164                                                 01324000
IOPPTREL EQU   IOPPTFMD                                                 01325000
IOPBPDS  EQU   IOPUDATA                                                 01326000
IOPBLEP1 EQU   IOPBPDS+8                                                01327000
IOPBLEP2 EQU   IOPBPDS+9                                                01328000
@NM00168 EQU   IOPBPDS+18                                               01329000
IOPBFTB0 EQU   @NM00168                                                 01330000
IOPBFTB1 EQU   IOPBFTB0                                                 01331000
XRFRCD1  EQU   XRFRCD                                                   01332000
XRF1MAC  EQU   XRFRCD1+11                                               01333000
XRFRCD2  EQU   XRFRCD                                                   01334000
XRF2MOD  EQU   XRFRCD2+11                                               01335000
XRFRCD3  EQU   XRFRCD                                                   01336000
XRF3MAC  EQU   XRFRCD3+1                                                01337000
XRF3MOD  EQU   XRF3MAC                                                  01338000
XRF3DAT  EQU   XRFRCD3+11                                               01339000
XRF3PTF  EQU   XRFRCD3+17                                               01340000
XRF3PF1  EQU   XRFRCD3+24                                               01341000
XRF3STAT EQU   XRF3PF1                                                  01342000
XRF3PTYP EQU   XRFRCD3+25                                               01343000
XRF3PIND EQU   XRFRCD3+26                                               01344000
XRFRCD4  EQU   XRFRCD                                                   01345000
XRFX4PTF EQU   XRFRCD4+11                                               01346000
FXOUTMAP EQU   PRNTBUF                                                  01347000
HDSUBHD  EQU   FXOUTMAP+10                                              01348000
HDSEPCHR EQU   FXOUTMAP+26                                              01349000
HDDATA   EQU   FXOUTMAP+28                                              01350000
SMDHLINE EQU   HDDATA                                                   01351000
HDSMDHMP EQU   SMDHLINE                                                 01352000
HDSMDHNM EQU   HDSMDHMP                                                 01353000
HDSMDHTP EQU   HDSMDHMP+9                                               01354000
HDSMDHDT EQU   HDSMDHMP+19                                              01355000
HDSMDHYY EQU   HDSMDHDT                                                 01356000
HDSMDHPR EQU   HDSMDHDT+2                                               01357000
HDSMDHDD EQU   HDSMDHDT+3                                               01358000
HDSMDHMC EQU   HDSMDHMP+27                                              01359000
HDSMDHST EQU   HDSMDHMP+37                                              01360000
HDSMDAPP EQU   HDSMDHST                                                 01361000
HDSMDRES EQU   HDSMDHST+5                                               01362000
HDSMDACC EQU   HDSMDHST+10                                              01363000
HDSMDERR EQU   HDSMDHST+15                                              01364000
HDSMDBYP EQU   HDSMDHST+20                                              01365000
HDSMDRGN EQU   HDSMDHST+25                                              01366000
XREFLINE EQU   HDDATA                                                   01367000
HDVSLIST EQU   XREFLINE                                                 01368000
HDVSDATA EQU   HDVSLIST                                                 01369000
HDVSSMD  EQU   HDVSDATA                                                 01370000
FXFARRY1 EQU   FXFTBL1                                                  01371000
FXFRTYPE EQU   FXFARRY1                                                 01372000
FXFHEAD  EQU   FXFARRY1+1                                               01373000
PRLDATA  EQU   PRLEND                                                   01374000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01375000
@NM00219 EQU   HDVSLIST+8                                               01376000
@NM00209 EQU   HDSMDHST+23                                              01377000
@NM00208 EQU   HDSMDHST+18                                              01378000
@NM00207 EQU   HDSMDHST+13                                              01379000
@NM00206 EQU   HDSMDHST+8                                               01380000
@NM00205 EQU   HDSMDHST+3                                               01381000
@NM00204 EQU   HDSMDHMP+35                                              01382000
@NM00203 EQU   HDSMDHMP+25                                              01383000
@NM00202 EQU   HDSMDHMP+17                                              01384000
@NM00201 EQU   HDSMDHMP+7                                               01385000
@NM00200 EQU   FXOUTMAP+27                                              01386000
@NM00199 EQU   FXOUTMAP+25                                              01387000
@NM00198 EQU   FXOUTMAP+8                                               01388000
HDNAME   EQU   FXOUTMAP                                                 01389000
@NM00196 EQU   XRFRCD4+28                                               01390000
@NM00195 EQU   XRFRCD4+18                                               01391000
@NM00194 EQU   XRFRCD4+10                                               01392000
@NM00193 EQU   XRFRCD4+9                                                01393000
XRF4PTF  EQU   XRFRCD4+1                                                01394000
@NM00192 EQU   XRFRCD4                                                  01395000
@NM00191 EQU   XRFRCD3+29                                               01396000
@NM00190 EQU   XRFRCD3+28                                               01397000
XRF3PF3  EQU   XRFRCD3+27                                               01398000
XRF3TIM  EQU   XRFRCD3+14                                               01399000
@NM00189 EQU   XRFRCD3+10                                               01400000
@NM00188 EQU   XRFRCD3+9                                                01401000
XRF3SRC  EQU   XRF3MOD                                                  01402000
@NM00187 EQU   XRFRCD3                                                  01403000
@NM00186 EQU   XRFRCD2+29                                               01404000
@NM00185 EQU   XRFRCD2+19                                               01405000
@NM00184 EQU   XRFRCD2+10                                               01406000
@NM00183 EQU   XRFRCD2+9                                                01407000
XRF2LMD  EQU   XRFRCD2+1                                                01408000
@NM00182 EQU   XRFRCD2                                                  01409000
@NM00181 EQU   XRFRCD1+29                                               01410000
@NM00180 EQU   XRFRCD1+19                                               01411000
@NM00179 EQU   XRFRCD1+10                                               01412000
@NM00178 EQU   XRFRCD1+9                                                01413000
XRF1ASM  EQU   XRFRCD1+1                                                01414000
@NM00177 EQU   XRFRCD1                                                  01415000
IOPBCEND EQU   IOPBPDS+21                                               01416000
IOPBFTB3 EQU   IOPBFTB0+2                                               01417000
IOPBFTB2 EQU   IOPBFTB0+1                                               01418000
@NM00170 EQU   IOPBFTB1                                                 01419000
IOPBAPFP EQU   IOPBFTB1                                                 01420000
IOPBSSI  EQU   IOPBFTB1                                                 01421000
IOPBPAGA EQU   IOPBFTB1                                                 01422000
@NM00169 EQU   IOPBFTB1                                                 01423000
IOPBAOSL EQU   IOPBFTB1                                                 01424000
IOPBSEPA EQU   IOPBPDS+15                                               01425000
IOPBFTBL EQU   IOPBPDS+13                                               01426000
IOPBSTOR EQU   IOPBPDS+10                                               01427000
IOPBREFR EQU   IOPBLEP2                                                 01428000
IOPBLEF  EQU   IOPBLEP2                                                 01429000
IOPBTEST EQU   IOPBLEP2                                                 01430000
IOPBNE   EQU   IOPBLEP2                                                 01431000
@NM00167 EQU   IOPBLEP2                                                 01432000
IOPBDC   EQU   IOPBLEP2                                                 01433000
@NM00166 EQU   IOPBLEP1                                                 01434000
IOPBSCTR EQU   IOPBLEP1                                                 01435000
IOPBOL   EQU   IOPBLEP1                                                 01436000
@NM00165 EQU   IOPBLEP1                                                 01437000
IOPBOVLY EQU   IOPBLEP1                                                 01438000
IOPBREUS EQU   IOPBLEP1                                                 01439000
IOPBRENT EQU   IOPBLEP1                                                 01440000
IOPBNL   EQU   IOPBPDS+7                                                01441000
IOPBTTRN EQU   IOPBPDS+4                                                01442000
IOPBZERO EQU   IOPBPDS+3                                                01443000
IOPBTTRT EQU   IOPBPDS                                                  01444000
IOPPTIND EQU   IOPPTNTR+8                                               01445000
IOPPTSND EQU   IOPPTREL                                                 01446000
@NM00163 EQU   IOPPTSFX+872                                             01447000
IOPSYZPP EQU   IOPPTSFX+772                                             01448000
IOPSYZPR EQU   IOPPTSFX+771                                             01449000
IOPSYZPS EQU   IOPPTSFX+763                                             01450000
IOPSYZAP EQU   IOPPTSFX+755                                             01451000
IOPSYUPP EQU   IOPPTSFX+655                                             01452000
IOPSYUPR EQU   IOPPTSFX+654                                             01453000
IOPSYUPS EQU   IOPPTSFX+646                                             01454000
IOPSYUPD EQU   IOPPTSFX+638                                             01455000
IOPSYSPP EQU   IOPPTSFX+538                                             01456000
IOPSYSPR EQU   IOPPTSFX+537                                             01457000
IOPSYSPS EQU   IOPPTSFX+529                                             01458000
IOPSYSUP EQU   IOPPTSFX+521                                             01459000
IOPSYLKP EQU   IOPPTSFX+421                                             01460000
IOPSYLKR EQU   IOPPTSFX+420                                             01461000
IOPSYLKS EQU   IOPPTSFX+412                                             01462000
IOPSYLKD EQU   IOPPTSFX+404                                             01463000
IOPSYCPP EQU   IOPPTSFX+304                                             01464000
IOPSYCPR EQU   IOPPTSFX+303                                             01465000
IOPSYCPS EQU   IOPPTSFX+295                                             01466000
IOPSYCPY EQU   IOPPTSFX+287                                             01467000
IOPSYCOP EQU   IOPPTSFX+187                                             01468000
IOPSYCOR EQU   IOPPTSFX+186                                             01469000
IOPSYCOS EQU   IOPPTSFX+178                                             01470000
IOPSYCOM EQU   IOPPTSFX+170                                             01471000
IOPSYASP EQU   IOPPTSFX+70                                              01472000
IOPSYASR EQU   IOPPTSFX+69                                              01473000
IOPSYASS EQU   IOPPTSFX+61                                              01474000
IOPSYASM EQU   IOPPTSFX+53                                              01475000
@NM00162 EQU   IOPPTSFX+35                                              01476000
@NM00161 EQU   IOPPTFG1                                                 01477000
IOPPTSNJ EQU   IOPPTFG1                                                 01478000
IOPPTSNP EQU   IOPPTFG1                                                 01479000
IOPSYPLN EQU   IOPPTSFX+32                                              01480000
IOPDSPFX EQU   IOPPTSFX+6                                               01481000
IOPDSDIR EQU   IOPDSSPC+4                                               01482000
IOPDSSEC EQU   IOPDSSPC+2                                               01483000
IOPDSPRM EQU   IOPDSSPC                                                 01484000
@NM00160 EQU   IOPPTSDR+4                                               01485000
IOPPTPEM EQU   IOPPTSDR+2                                               01486000
IOPPCNVL EQU   IOPPTSDR+1                                               01487000
@NM00159 EQU   IOPPTSDR                                                 01488000
IOPQFMTP EQU   IOPQFMLS+8                                               01489000
@NM00158 EQU   IOPQFMLS+7                                               01490000
IOPQFMND EQU   IOPQFMNM                                                 01491000
@NM00157 EQU   IOPQFMDR                                                 01492000
@NM00153 EQU   IOPQSMDR                                                 01493000
@NM00152 EQU   IOPSBYNT+8                                               01494000
IOPSBYST EQU   IOPSBYNT+7                                               01495000
IOPSBYNM EQU   IOPSBYNT                                                 01496000
@NM00151 EQU   IOPVERNT+8                                               01497000
IOPVERST EQU   IOPVERNT+7                                               01498000
IOPVERNM EQU   IOPVERNT                                                 01499000
@NM00150 EQU   IOPDELNT+8                                               01500000
IOPDELST EQU   IOPDELNT+7                                               01501000
IOPDELNM EQU   IOPDELNT                                                 01502000
@NM00149 EQU   IOPFIDNT+8                                               01503000
IOPFIDST EQU   IOPFIDNT+7                                               01504000
IOPFIDNM EQU   IOPFIDNT                                                 01505000
@NM00148 EQU   IOPIRQNT+8                                               01506000
IOPIRQST EQU   IOPIRQNT+7                                               01507000
IOPIRQNM EQU   IOPIRQNT                                                 01508000
@NM00147 EQU   IOPREQNT+8                                               01509000
IOPREQST EQU   IOPREQNT+7                                               01510000
IOPREQNM EQU   IOPREQNT                                                 01511000
@NM00146 EQU   IOPSUPNT+8                                               01512000
IOPSUPST EQU   IOPSUPNT+7                                               01513000
IOPSUPNM EQU   IOPSUPNT                                                 01514000
@NM00145 EQU   IOPNPRNT+8                                               01515000
IOPNPRST EQU   IOPNPRNT+7                                               01516000
IOPNPRNM EQU   IOPNPRNT                                                 01517000
@NM00144 EQU   IOPPRENT+8                                               01518000
IOPPREST EQU   IOPPRENT+7                                               01519000
IOPPRENM EQU   IOPPRENT                                                 01520000
@NM00143 EQU   IOPSRLNT+8                                               01521000
IOPSRLST EQU   IOPSRLNT+7                                               01522000
@NM00142 EQU   IOPSRLNT+4                                               01523000
IOPSRLNM EQU   IOPSRLNT                                                 01524000
@NM00141 EQU   IOPENTNT+8                                               01525000
IOPENTST EQU   IOPENTNT+7                                               01526000
IOPENTNM EQU   IOPENTNT                                                 01527000
IOPPIND  EQU   IOPPNTRY+8                                               01528000
IOPPTFND EQU   IOPPMODS                                                 01529000
IOPPFMID EQU   IOPPTFFX+73                                              01530000
@NM00140 EQU   IOPPTPFX+24                                              01531000
IOPUCLT  EQU   IOPDATES+21                                              01532000
IOPUCLD  EQU   IOPDATES+18                                              01533000
IOPACCT  EQU   IOPDATES+15                                              01534000
IOPACCD  EQU   IOPDATES+12                                              01535000
IOPRSTT  EQU   IOPDATES+9                                               01536000
IOPRSTD  EQU   IOPDATES+6                                               01537000
IOPAPPT  EQU   IOPDATES+3                                               01538000
IOPAPPD  EQU   IOPDATES                                                 01539000
IOPRECT  EQU   @NM00139+3                                               01540000
IOPRECD  EQU   @NM00139                                                 01541000
@NM00138 EQU   IOPPTFFX+8                                               01542000
@NM00137 EQU   @NM00135+7                                               01543000
IOPPRELN EQU   @NM00136                                                 01544000
@NM00134 EQU   IOPPTFDR+20                                              01545000
IOPSBYNO EQU   IOPPTFDR+13                                              01546000
IOPDBYNO EQU   IOPPTFDR+6                                               01547000
@NM00133 EQU   IOPPTFF3                                                 01548000
IOPFLF   EQU   IOPPTFF3                                                 01549000
IOPDBYP  EQU   IOPPTFF3                                                 01550000
IOPSBYP  EQU   IOPPTFF3                                                 01551000
IOPPMDLP EQU   IOPPTFF2+1                                               01552000
IOPPADDP EQU   IOPPTFF2+1                                               01553000
@NM00132 EQU   IOPPTFF2+1                                               01554000
IOPLRFP  EQU   IOPPTFF2                                                 01555000
IOPJCLP  EQU   IOPPTFF2                                                 01556000
IOPSUPP  EQU   IOPPTFF2                                                 01557000
IOPREQP  EQU   IOPPTFF2                                                 01558000
IOPPREP  EQU   IOPPTFF2                                                 01559000
IOPNPRP  EQU   IOPPTFF2                                                 01560000
IOPIRQP  EQU   IOPPTFF2                                                 01561000
IOPDELP  EQU   IOPPTFF2                                                 01562000
IOPDUMMP EQU   IOPFLGS5                                                 01563000
@NM00131 EQU   IOPFLGS5                                                 01564000
IOPPTYPE EQU   IOPPTFDR+1                                               01565000
@NM00130 EQU   IOPPTFDR                                                 01566000
IOPSYSTP EQU   IOPSYSTR+8                                               01567000
IOPSYSND EQU   IOPSYNTR                                                 01568000
@NM00129 EQU   IOPSYSFX+21                                              01569000
IOPSYSID EQU   IOPSYSFX+13                                              01570000
IOPNUCID EQU   IOPSYSFX+12                                              01571000
IOPSREL  EQU   IOPSYSFX+8                                               01572000
@NM00128 EQU   @NM00126+7                                               01573000
@NM00127 EQU   @NM00126                                                 01574000
@NM00125 EQU   IOPSYSDR+5                                               01575000
@NM00124 EQU   IOPFLGS7                                                 01576000
IOPSYNG  EQU   IOPFLGS7                                                 01577000
IOPSYDL  EQU   IOPFLGS7                                                 01578000
IOPSTSNP EQU   IOPFLGS7                                                 01579000
IOPMTSNP EQU   IOPFLGS7                                                 01580000
IOPPEMAX EQU   IOPSYSDR+2                                               01581000
IOPSCNVL EQU   IOPSYSDR+1                                               01582000
@NM00123 EQU   IOPSYSDR                                                 01583000
IOPDLIND EQU   IOPDNTRY+8                                               01584000
IOPDLBND EQU   IOPDSYS                                                  01585000
@NM00122 EQU   IOPDLBFX+8                                               01586000
@NM00121 EQU   @NM00119+7                                               01587000
@NM00120 EQU   @NM00119                                                 01588000
@NM00118 EQU   IOPDLBDR+1                                               01589000
@NM00117 EQU   IOPDLBDR                                                 01590000
IOPMDIND EQU   IOPMNTRY+8                                               01591000
@NM00116 EQU   IOPMODST                                                 01592000
IOPMODND EQU   IOPMODID                                                 01593000
IOPDLIB  EQU   IOPMODFX+72                                              01594000
@NM00115 EQU   IOPMODFX+12                                              01595000
@NM00114 EQU   IOPMODF4                                                 01596000
@NM00113 EQU   IOPMODF3                                                 01597000
@NM00112 EQU   IOPMODF2                                                 01598000
IOPMPAGA EQU   IOPMODF2                                                 01599000
IOPMNE   EQU   IOPMODF2                                                 01600000
@NM00111 EQU   IOPMODF1                                                 01601000
IOPMDC   EQU   IOPMODF1                                                 01602000
IOPMREFR EQU   IOPMODF1                                                 01603000
IOPMOVLY EQU   IOPMODF1                                                 01604000
IOPMSCTR EQU   IOPMODF1                                                 01605000
IOPMREUS EQU   IOPMODF1                                                 01606000
IOPMRENT EQU   IOPMODF1                                                 01607000
IOPMAPF  EQU   IOPMODF1                                                 01608000
@NM00110 EQU   @NM00108+7                                               01609000
@NM00109 EQU   @NM00108                                                 01610000
@NM00107 EQU   IOPMODDR+17                                              01611000
@NM00106 EQU   @NM00104+7                                               01612000
@NM00105 EQU   @NM00104                                                 01613000
@NM00103 EQU   @NM00100                                                 01614000
@NM00102 EQU   @NM00100                                                 01615000
@NM00101 EQU   @NM00100                                                 01616000
@NM00099 EQU   @NM00098                                                 01617000
@NM00097 EQU   IOPMODDR                                                 01618000
IOPSRIND EQU   IOPSNTRY+8                                               01619000
@NM00096 EQU   IOPSRCST                                                 01620000
IOPSRCND EQU   IOPSRCID                                                 01621000
IOPSRDLB EQU   IOPSRCFX+72                                              01622000
IOPSRSYS EQU   IOPSRCFX+64                                              01623000
@NM00095 EQU   IOPSRCFX+8                                               01624000
@NM00094 EQU   @NM00092+7                                               01625000
@NM00093 EQU   @NM00092                                                 01626000
@NM00091 EQU   IOPSRCDR+18                                              01627000
IOPSRLNG EQU   IOPSRCDR+17                                              01628000
@NM00090 EQU   @NM00088+7                                               01629000
@NM00089 EQU   @NM00088                                                 01630000
@NM00087 EQU   @NM00084                                                 01631000
@NM00086 EQU   @NM00084                                                 01632000
@NM00085 EQU   @NM00084                                                 01633000
@NM00083 EQU   @NM00082                                                 01634000
@NM00081 EQU   IOPSRCDR                                                 01635000
IOPEOFND EQU   IOPEOFNT                                                 01636000
IOPMCTYP EQU   IOPMCIND                                                 01637000
@NM00080 EQU   IOPMACST                                                 01638000
IOPMACND EQU   IOPMACID                                                 01639000
IOPMCDLB EQU   IOPMACFX+72                                              01640000
IOPMCSYS EQU   IOPMACFX+64                                              01641000
@NM00079 EQU   IOPMACFX+8                                               01642000
IOPBUTYP EQU   IOPBUNT+7                                                01643000
IOPBUSMD EQU   IOPBUNT                                                  01644000
@NM00078 EQU   IOPMACDR+18                                              01645000
IOPMCLNG EQU   IOPMACDR+17                                              01646000
IOPFMST  EQU   IOPFMIDE+7                                               01647000
IOPFMID  EQU   IOPFMIDE                                                 01648000
@NM00077 EQU   IOPRMST                                                  01649000
IOPRMASM EQU   IOPRMST                                                  01650000
@NM00076 EQU   IOPRMST                                                  01651000
IOPRMID  EQU   IOPRMIDE                                                 01652000
@NM00075 EQU   IOPMACDR                                                 01653000
IOPLMIND EQU   IOPLNTRY+8                                               01654000
IOPLMDND EQU   IOPSYSLB                                                 01655000
@NM00073 EQU   @NM00071+7                                               01656000
@NM00072 EQU   @NM00071                                                 01657000
@NM00070 EQU   IOPLMDDR+6                                               01658000
@NM00069 EQU   IOPFLGS3                                                 01659000
IOPCHREP EQU   IOPFLGS3                                                 01660000
IOPLINK  EQU   IOPFLGS3                                                 01661000
IOPCOPY  EQU   IOPFLGS3                                                 01662000
@NM00068 EQU   IOPLMDF4                                                 01663000
@NM00067 EQU   IOPLMDF3                                                 01664000
@NM00066 EQU   IOPLMDF2                                                 01665000
IOPPAGA  EQU   IOPLMDF2                                                 01666000
IOPNE    EQU   IOPLMDF2                                                 01667000
@NM00065 EQU   IOPFLGS2                                                 01668000
IOPDC    EQU   IOPFLGS2                                                 01669000
IOPREFR  EQU   IOPFLGS2                                                 01670000
IOPOVLY  EQU   IOPFLGS2                                                 01671000
IOPSCTR  EQU   IOPFLGS2                                                 01672000
IOPREUS  EQU   IOPFLGS2                                                 01673000
IOPRENT  EQU   IOPFLGS2                                                 01674000
IOPAPF   EQU   IOPFLGS2                                                 01675000
@NM00064 EQU   IOPLMDDR                                                 01676000
@NM00063 EQU   IOPASMDR+9                                               01677000
IOPABUTP EQU   IOPABUNT+7                                               01678000
IOPABUPT EQU   IOPABUNT                                                 01679000
IOPNTLVL EQU   IOPASMDR                                                 01680000
IOPALLOC EQU   @NM00062+4                                               01681000
IOPUSED  EQU   @NM00062                                                 01682000
IOPTPSEQ EQU   @NM00061+8                                               01683000
IOPVLSER EQU   @NM00061+2                                               01684000
IOPBLKSI EQU   @NM00061                                                 01685000
IOPCQMAX EQU   IOPCQMAP+12                                              01686000
@NM00060 EQU   IOPCQMAP+11                                              01687000
@NM00059 EQU   IOPCQMAP+8                                               01688000
@NM00058 EQU   IOPCQMAP                                                 01689000
IOPPTMAX EQU   IOPCDMAX                                                 01690000
@NM00057 EQU   IOPSCMAP+11                                              01691000
@NM00056 EQU   IOPSCMAP+8                                               01692000
@NM00055 EQU   IOPSCMAP                                                 01693000
IOPDIRMX EQU   IOPNTMAX+12                                              01694000
@NM00054 EQU   IOPNTMAX+11                                              01695000
@NM00053 EQU   IOPNTMAX+8                                               01696000
@NM00052 EQU   IOPNTMAX                                                 01697000
@NM00051 EQU   IOPDTYPE                                                 01698000
IOPDMOD  EQU   IOPDTYPE                                                 01699000
IOPDJCL  EQU   IOPDTYPE                                                 01700000
IOPDSRC  EQU   IOPDTYPE                                                 01701000
IOPDMAC  EQU   IOPDTYPE                                                 01702000
IOPSDIR  EQU   IOPSPACE+4                                               01703000
IOPSSCND EQU   IOPSPACE+2                                               01704000
IOPSPRIM EQU   IOPSPACE                                                 01705000
IOPDSN   EQU   IOPDYNDT                                                 01706000
IOPNTYPE EQU   IOPSTCMP+17                                              01707000
IOPNNAME EQU   IOPSTCMP+9                                               01708000
IOPOTYPE EQU   IOPSTCMP+8                                               01709000
IOPONAME EQU   IOPSTCMP                                                 01710000
IOPISEQ3 EQU   IOPINAM3+6                                               01711000
IOPITYP3 EQU   @NM00050+5                                               01712000
IOPIPTF3 EQU   @NM00050                                                 01713000
@NM00175 EQU   HMASMGTP+27                                              01714000
GTPPSIZE EQU   GTPFLGS1                                                 01715000
@NM00174 EQU   GTPFLGS1                                                 01716000
GTPRCDNF EQU   GTPFLGS1                                                 01717000
GTPNOSPM EQU   GTPFLGS1                                                 01718000
GTPPOS   EQU   GTPRESTR+8                                               01719000
GTPRCD   EQU   GTPRESTR+4                                               01720000
GTPPAG   EQU   GTPRESTR                                                 01721000
GTPWKAD  EQU   HMASMGTP+8                                               01722000
@NM00173 EQU   HMASMGTP+2                                               01723000
PRLCONC  EQU   PRLTIME+2                                                01724000
@NM00172 EQU   PRLTIME                                                  01725000
PRLHDADR EQU   PRLDATE                                                  01726000
@NM00171 EQU   PRLFLGS                                                  01727000
PRLBLANK EQU   PRLFLGS                                                  01728000
PRLHEADO EQU   PRLFLGS                                                  01729000
PRLHEAD  EQU   PRLFLGS                                                  01730000
IOPBS04E EQU   IOPBS04+2                                                01731000
IOPBAPFC EQU   IOPBAPF+1                                                01732000
IOPBAPFL EQU   IOPBAPF                                                  01733000
IOPBS2NM EQU   IOPBS02+3                                                01734000
IOPBS2EP EQU   IOPBS02                                                  01735000
IOPQSMTP EQU   IOPQSMLS+8                                               01736000
@NM00156 EQU   IOPQSMLS+7                                               01737000
IOPQSMND EQU   IOPQSMNM                                                 01738000
@NM00155 EQU   @NM00154+7                                               01739000
IOPQSMFM EQU   @NM00154                                                 01740000
@NM00074 EQU   IOPLMCTL+17                                              01741000
IOPLMCRD EQU   IOPLMCTL+9                                               01742000
IOPLMCRN EQU   IOPLMCTL+1                                               01743000
IOPLMCC  EQU   IOPLMCTL                                                 01744000
@NM00049 EQU   IOPUSERL                                                 01745000
@NM00048 EQU   IOPUSERL                                                 01746000
IOPALIS  EQU   IOPUSERL                                                 01747000
IOPTTR   EQU   IOPDRMAP+8                                               01748000
IOPINAM2 EQU   IOPINAM+1                                                01749000
IOPITYP2 EQU   IOPITYP                                                  01750000
@NM00047 EQU   HMASMIOP+32                                              01751000
IOPDELDD EQU   IOPDDNAM                                                 01752000
@NM00046 EQU   @NM00043+10                                              01753000
IOPSEQNO EQU   @NM00043+8                                               01754000
@NM00045 EQU   @NM00044+7                                               01755000
IOPPTFNM EQU   @NM00044                                                 01756000
IOPNAM17 EQU   IOPNAME                                                  01757000
CCABMREC EQU   CCABELMT+10                                              01758000
CCABPOS  EQU   CCABMPOS+8                                               01759000
CCABNAME EQU   CCABMPOS                                                 01760000
@NM00042 EQU   CCABLDLM+2                                               01761000
@NM00041 EQU   CCABLDLM                                                 01762000
CCAUPDPM EQU   @NM00039+24                                              01763000
@NM00040 EQU   @NM00039+21                                              01764000
CCARUPDT EQU   CCAUPDRC                                                 01765000
CCAUPDSP EQU   @NM00039+12                                              01766000
CCAUPDTE EQU   @NM00039+8                                               01767000
CCAUPDNM EQU   @NM00039                                                 01768000
CCASUPPM EQU   @NM00037+24                                              01769000
@NM00038 EQU   @NM00037+21                                              01770000
CCARSUP  EQU   CCASUPRC                                                 01771000
CCASUPSP EQU   @NM00037+12                                              01772000
CCAIOSUP EQU   @NM00037+8                                               01773000
CCASUPNM EQU   @NM00037                                                 01774000
CCAZAPPM EQU   @NM00035+24                                              01775000
@NM00036 EQU   @NM00035+21                                              01776000
CCARZAP  EQU   CCAZAPRC                                                 01777000
CCAZAPSP EQU   @NM00035+12                                              01778000
CCASPZAP EQU   @NM00035+8                                               01779000
CCAZAPNM EQU   @NM00035                                                 01780000
CCACOMPM EQU   @NM00033+24                                              01781000
@NM00034 EQU   @NM00033+21                                              01782000
CCARCOMP EQU   CCACOMRC                                                 01783000
CCACOMSP EQU   @NM00033+12                                              01784000
CCACOMRS EQU   @NM00033+8                                               01785000
CCACOMNM EQU   @NM00033                                                 01786000
CCACPYPM EQU   @NM00031+24                                              01787000
@NM00032 EQU   @NM00031+21                                              01788000
CCARCOPY EQU   CCACPYRC                                                 01789000
CCACPYSP EQU   @NM00031+12                                              01790000
CCACOPY  EQU   @NM00031+8                                               01791000
CCACPYNM EQU   @NM00031                                                 01792000
CCAASMPM EQU   @NM00029+24                                              01793000
@NM00030 EQU   @NM00029+21                                              01794000
CCARASM  EQU   CCAASMRC                                                 01795000
CCAASMSP EQU   @NM00029+12                                              01796000
CCAASM   EQU   @NM00029+8                                               01797000
CCAASMNM EQU   @NM00029                                                 01798000
CCALKDPM EQU   @NM00027+24                                              01799000
@NM00028 EQU   @NM00027+21                                              01800000
CCARLINK EQU   CCALKDRC                                                 01801000
CCALKDSP EQU   @NM00027+12                                              01802000
CCALKED  EQU   @NM00027+8                                               01803000
CCALKDNM EQU   @NM00027                                                 01804000
CCAPGMPM EQU   @NM00025+24                                              01805000
@NM00026 EQU   @NM00025+21                                              01806000
CCABPGRC EQU   @NM00025+20                                              01807000
CCABPGSP EQU   @NM00025+12                                              01808000
CCABPGAD EQU   @NM00025+8                                               01809000
CCABPGNM EQU   @NM00025                                                 01810000
CCAEND   EQU   HMASMCCA+371                                             01811000
@NM00024 EQU   HMASMCCA+309                                             01812000
CCACURDD EQU   CCAFDSNG+3                                               01813000
CCACURDS EQU   CCAFDSNG+2                                               01814000
@NM00023 EQU   CCAFLAGB                                                 01815000
CCAOUTNG EQU   CCAFLAGB                                                 01816000
CCALOGNG EQU   CCAFLAGB                                                 01817000
CCAFMID  EQU   HMASMCCA+291                                             01818000
CCARPTDS EQU   CCAFCTL+7                                                01819000
CCATIME  EQU   CCAFCTL+4                                                01820000
CCADATE  EQU   CCAFCTL+1                                                01821000
@NM00022 EQU   CCAFLAG9                                                 01822000
CCARVCAN EQU   CCAFLAG9                                                 01823000
CCARVEST EQU   CCAFLAG9                                                 01824000
CCAPTSNJ EQU   CCAFLAG9                                                 01825000
CCASTSNP EQU   CCAFLAG9                                                 01826000
CCAMTSNP EQU   CCAFLAG9                                                 01827000
CCAPTSNP EQU   CCAFLAG9                                                 01828000
@NM00021 EQU   CCAFLAG8                                                 01829000
CCAACDSC EQU   CCAFLAG8                                                 01830000
CCACDSC  EQU   CCAFLAG8                                                 01831000
@NM00020 EQU   CCAFLAG6                                                 01832000
CCAACRUP EQU   CCAFLAG6                                                 01833000
CCACRQUP EQU   CCAFLAG6                                                 01834000
CCAACDUP EQU   CCAFLAG6                                                 01835000
CCACDSUP EQU   CCAFLAG6                                                 01836000
@NM00019 EQU   CCAFLAG5                                                 01837000
CCAACROS EQU   CCAFLAG5                                                 01838000
CCACRQOS EQU   CCAFLAG5                                                 01839000
CCAACDOS EQU   CCAFLAG5                                                 01840000
CCACDSOS EQU   CCAFLAG5                                                 01841000
@NM00018 EQU   CCAFLAG4                                                 01842000
CCAACRIS EQU   CCAFLAG4                                                 01843000
CCACRQIS EQU   CCAFLAG4                                                 01844000
CCAACDIS EQU   CCAFLAG4                                                 01845000
CCACDSIS EQU   CCAFLAG4                                                 01846000
@NM00017 EQU   CCAFLAG3+1                                               01847000
CCARGNP  EQU   CCAFLAG3+1                                               01848000
CCADISRQ EQU   CCAFLAG3+1                                               01849000
CCAICTOK EQU   CCAFLAG3                                                 01850000
CCADELP  EQU   CCAFLAG3                                                 01851000
CCACMPRS EQU   CCAFLAG3                                                 01852000
CCAZAPP  EQU   CCAFLAG3                                                 01853000
CCALINKP EQU   CCAFLAG3                                                 01854000
CCACOPYP EQU   CCAFLAG3                                                 01855000
CCAASIP  EQU   CCAFLAG3                                                 01856000
CCAUPDP  EQU   CCAFLAG3                                                 01857000
CCAEOSMP EQU   CCAFLAG2                                                 01858000
CCAEOFNC EQU   CCAFLAG2                                                 01859000
@NM00016 EQU   CCAFLAG2                                                 01860000
CCACHECK EQU   CCAFLAG2                                                 01861000
CCATERM  EQU   CCAFLAG2                                                 01862000
CCASVCLB EQU   CCAFLAG2                                                 01863000
CCANCPTF EQU   CCAFLAG2                                                 01864000
@NM00015 EQU   CCAFLAG1+1                                               01865000
CCAUNL   EQU   CCAFLAG1+1                                               01866000
CCARESET EQU   CCAFLAG1+1                                               01867000
CCALOG   EQU   CCAFLAG1+1                                               01868000
CCACNV   EQU   CCAFLAG1+1                                               01869000
CCALIST  EQU   CCAFLAG1                                                 01870000
CCAUPDU  EQU   CCAFLAG1                                                 01871000
CCAUPDJ  EQU   CCAFLAG1                                                 01872000
CCARES   EQU   CCAFLAG1                                                 01873000
CCAREJ   EQU   CCAFLAG1                                                 01874000
CCAACCPT EQU   CCAFLAG1                                                 01875000
CCAAPPLY EQU   CCAFLAG1                                                 01876000
CCAREC   EQU   CCAFLAG1                                                 01877000
CCAFUNCT EQU   CCAFFUNC                                                 01878000
@NM00014 EQU   @NM00009+18                                              01879000
@NM00013 EQU   @NM00009+16                                              01880000
CCATBLPA EQU   @NM00009+12                                              01881000
@NM00012 EQU   @NM00009+8                                               01882000
@NM00011 EQU   @NM00009+4                                               01883000
@NM00010 EQU   @NM00009                                                 01884000
CCAIFGTP EQU   CCAFGTP+16                                               01885000
CCAGTP3  EQU   CCAFGTP+12                                               01886000
CCAGTP2  EQU   CCAFGTP+8                                                01887000
CCASETAD EQU   CCASEGTP                                                 01888000
CCACLST  EQU   CCAFPGM+12                                               01889000
CCASPDCB EQU   CCAFPGM+8                                                01890000
CCAICLMD EQU   CCAFICT+12                                               01891000
CCAICMOD EQU   CCAFICT+8                                                01892000
CCAICPTF EQU   CCAFICT+4                                                01893000
CCAICT   EQU   CCAFICT                                                  01894000
CCARVAD  EQU   CCAFSTA                                                  01895000
CCAACDID EQU   CCAFSYS+32                                               01896000
CCACDSID EQU   CCAFSYS+24                                               01897000
CCALNLEN EQU   CCAFSYS+22                                               01898000
@NM00008 EQU   CCAFLAGA                                                 01899000
CCAPSYSF EQU   CCAFLAGA                                                 01900000
CCAASYSF EQU   CCAFLAGA                                                 01901000
CCACSYSF EQU   CCAFLAGA                                                 01902000
CCANUCID EQU   CCAFSYS+20                                               01903000
CCAASREL EQU   CCAFSYS+16                                               01904000
CCACSREL EQU   CCASREL                                                  01905000
CCAPEMAX EQU   CCAFSYS+10                                               01906000
CCAPGLEN EQU   CCAFSYS+8                                                01907000
CCAIOPAS EQU   CCAFSYS+4                                                01908000
CCAIOPCS EQU   CCAFSYS                                                  01909000
CCAPESIZ EQU   CCAFIOP+4                                                01910000
CCAIOPTR EQU   CCAFIOP                                                  01911000
@NM00007 EQU   CCAFLAG7+3                                               01912000
CCALOGP  EQU   CCAFLAG7+2                                               01913000
CCAOUTP  EQU   CCAFLAG7+2                                               01914000
CCASLBP  EQU   CCAFLAG7+2                                               01915000
CCARPTP  EQU   CCAFLAG7+2                                               01916000
CCALISTP EQU   CCAFLAG7+2                                               01917000
CCAJCLP  EQU   CCAFLAG7+2                                               01918000
CCAPTFP  EQU   CCAFLAG7+2                                               01919000
CCATLBP  EQU   CCAFLAG7+2                                               01920000
CCAUT3P  EQU   CCAFLAG7+1                                               01921000
CCAUT2P  EQU   CCAFLAG7+1                                               01922000
CCAUT1P  EQU   CCAFLAG7+1                                               01923000
CCAWK5P  EQU   CCAFLAG7+1                                               01924000
CCAWK4P  EQU   CCAFLAG7+1                                               01925000
CCAWK3P  EQU   CCAFLAG7+1                                               01926000
CCAWK2P  EQU   CCAFLAG7+1                                               01927000
CCAWK1P  EQU   CCAFLAG7+1                                               01928000
CCAACRQP EQU   CCAFLAG7                                                 01929000
CCACRQP  EQU   CCAFLAG7                                                 01930000
CCASTSP  EQU   CCAFLAG7                                                 01931000
CCAMTSP  EQU   CCAFLAG7                                                 01932000
CCAPTSP  EQU   CCAFLAG7                                                 01933000
CCASCDSP EQU   CCAFLAG7                                                 01934000
CCAACDSP EQU   CCAFLAG7                                                 01935000
CCACDSP  EQU   CCAFLAG7                                                 01936000
@NM00006 EQU   CCAFBUFR+122                                             01937000
@NM00005 EQU   CCAFBUFR+120                                             01938000
@NM00004 EQU   CCAFBUFR+118                                             01939000
CCATBFMX EQU   CCAFBUFR+116                                             01940000
CCA4BFMX EQU   CCAFBUFR+114                                             01941000
CCA3BFMX EQU   CCAFBUFR+112                                             01942000
CCA2BFMX EQU   CCAFBUFR+110                                             01943000
CCA1BFMX EQU   CCAFBUFR+108                                             01944000
CCAXBFMX EQU   CCAFBUFR+106                                             01945000
CCAQBFMX EQU   CCAFBUFR+104                                             01946000
CCASBFMX EQU   CCAFBUFR+102                                             01947000
CCAMBFMX EQU   CCAFBUFR+100                                             01948000
CCAPBFMX EQU   CCAFBUFR+98                                              01949000
CCAVBFMX EQU   CCAFBUFR+96                                              01950000
CCAABFMX EQU   CCAFBUFR+94                                              01951000
CCACBFMX EQU   CCAFBUFR+92                                              01952000
@NM00003 EQU   CCAFBUFR+88                                              01953000
@NM00002 EQU   CCAFBUFR+84                                              01954000
CCA4BFSZ EQU   CCAFBUFR+80                                              01955000
CCATBFSZ EQU   CCAFBUFR+76                                              01956000
CCAWBFSZ EQU   CCAFBUFR+72                                              01957000
CCAQBFSZ EQU   CCAFBUFR+68                                              01958000
CCAPBFSZ EQU   CCAFBUFR+64                                              01959000
CCAVBFSZ EQU   CCAFBUFR+60                                              01960000
CCACBFSZ EQU   CCAFBUFR+56                                              01961000
@NM00001 EQU   CCAFBUFR+52                                              01962000
CCA4BFOA EQU   CCAFBUFR+48                                              01963000
CCA4BFIA EQU   CCAFBUFR+44                                              01964000
CCATBFIA EQU   CCAFBUFR+40                                              01965000
CCAWBFOA EQU   CCAFBUFR+36                                              01966000
CCAWBFIA EQU   CCAFBUFR+32                                              01967000
CCAQBFOA EQU   CCAFBUFR+28                                              01968000
CCAQBFIA EQU   CCAFBUFR+24                                              01969000
CCAPBFOA EQU   CCAFBUFR+20                                              01970000
CCAPBFIA EQU   CCAFBUFR+16                                              01971000
CCAVBFOA EQU   CCAFBUFR+12                                              01972000
CCAVBFIA EQU   CCAFBUFR+8                                               01973000
CCACBFOA EQU   CCAFBUFR+4                                               01974000
CCACBFIA EQU   CCAFBUFR                                                 01975000
CCAID    EQU   HMASMCCA                                                 01976000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01977000
@ENDDATA EQU   *                                                        01978000
         END   HMASMFXF,(C'PLS2023',0802,78334)                         01979000
