         TITLE 'HMASMTDD DD CARD CHECK ROUTINE'                         00001000
HMASMTDD CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'HMASMTDD  78.334'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         ST    @13,@SA00001+4                                      0001 00013000
         LA    @14,@SA00001                                        0001 00014000
         ST    @14,8(,@13)                                         0001 00015000
         LR    @13,@14                                             0001 00016000
         MVC   @PC00001(4),0(@01)                                  0001 00017000
*   HMASMMGP=''B;                   /* ZERO OUT MGP          @Z67SP00*/ 00018000
         XC    HMASMMGP(24),HMASMMGP                               0182 00019000
*   INTFLAGS=''B;                   /* CLEAR LOCAL FLAGS     @Z67SP00*/ 00020000
         MVI   INTFLAGS,X'00'                                      0183 00021000
*   HIGHTDD=0;                      /* CLEAR RETURN CODE     @Z67SP00*/ 00022000
*                                                                  0184 00023000
         SLR   HIGHTDD,HIGHTDD                                     0184 00024000
*   /*****************************************************************/ 00025000
*   /*                                                               */ 00026000
*   /* LOOP THRU PROCESSING ALL DDCARD CHECK FOR ONE PTF AT A TIME SO*/ 00027000
*   /* THAT ALL MESSAGES WILL APPEAR TOGETHER                        */ 00028000
*   /*                                                               */ 00029000
*   /*****************************************************************/ 00030000
*                                                                  0185 00031000
*   DO DDI=1 BY 1 WHILE ICTPEND(DDI)^=ICTENDNT;/* PTF LOOP           */ 00032000
         LA    DDI,1                                               0185 00033000
         B     @DE00185                                            0185 00034000
@DL00185 DS    0H                                                  0186 00035000
*     PTFERRSW=OFF;                 /* SET DD MISSING IN PTF         */ 00036000
         NI    PTFERRSW,B'01111111'                                0186 00037000
*     IF ICTPGELM(DDI)=OFF          /* SYSMOD NOT GROUP ELIMINATED   */ 00038000
*         &(ICTPECPL(DDI)=OFF       /* SYSMOD NOT ELEMENT COMPLETE   */ 00039000
*         |ICTPNOGO(DDI)=ON)        /* SYSMOD IS NOGO                */ 00040000
*       THEN                        /* NEED DD CHECKING              */ 00041000
         LR    @10,DDI                                             0187 00042000
         MH    @10,@CH01768                                        0187 00043000
         L     @04,CCAICPTF(,CCAPTR)                               0187 00044000
         ST    @10,@TF00001                                        0187 00045000
         ALR   @10,@04                                             0187 00046000
         AL    @10,@CF01775                                        0187 00047000
         TM    ICTPGELM-13(@10),B'00001000'                        0187 00048000
         BNZ   @RF00187                                            0187 00049000
         LR    @10,@04                                             0187 00050000
         AL    @10,@TF00001                                        0187 00051000
         AL    @10,@CF01776                                        0187 00052000
         TM    ICTPECPL-14(@10),B'01000000'                        0187 00053000
         BZ    @RT00187                                            0187 00054000
         AL    @04,@TF00001                                        0187 00055000
         AL    @04,@CF01777                                        0187 00056000
         TM    ICTPNOGO-8(@04),B'01000000'                         0187 00057000
         BNO   @RF00187                                            0187 00058000
@RT00187 DS    0H                                                  0188 00059000
*       DO;                         /*                               */ 00060000
*                                                                  0188 00061000
*         /***********************************************************/ 00062000
*         /*                                                         */ 00063000
*         /* GO THRU ALL MODS FOR SYSMODS WHICH ARE EITHER NOT       */ 00064000
*         /* "ELEMENT" COMPLETE OR ARE NOGO                          */ 00065000
*         /*                                                         */ 00066000
*         /***********************************************************/ 00067000
*                                                                  0189 00068000
*         DO DDJ=1 BY 1 WHILE ICTIXP(DDJ)^=ICTENDIX;/* PTF TO MOD  0189 00069000
*                                      INDEX LOOP                    */ 00070000
         LA    DDJ,1                                               0189 00071000
         B     @DE00189                                            0189 00072000
@DL00189 DS    0H                                                  0190 00073000
*           IF ICTMISEL(1)=ON       /* ELEMENT SELECTED              */ 00074000
*             THEN                                                 0190 00075000
         LR    @10,DDJ                                             0190 00076000
         SLA   @10,2                                               0190 00077000
         LR    @04,DDI                                             0190 00078000
         MH    @04,@CH01768                                        0190 00079000
         L     @01,CCAICPTF(,CCAPTR)                               0190 00080000
         AL    @01,@CF01778                                        0190 00081000
         L     @04,ICTPCHN-64(@04,@01)                             0190 00082000
         AL    @04,@CF01779                                        0190 00083000
         L     @10,ICTIXP(@10,@04)                                 0190 00084000
         TM    ICTMISEL(@10),B'10000000'                           0190 00085000
         BNO   @RF00190                                            0190 00086000
*             DO;                                                  0191 00087000
*                                                                  0191 00088000
*               /*****************************************************/ 00089000
*               /*                                                   */ 00090000
*               /* CHECK ICTTOLIB AND ICTFMLIB DD CARDS              */ 00091000
*               /*                                                   */ 00092000
*               /*****************************************************/ 00093000
*                                                                  0192 00094000
*               DO DDL=1 TO 2;      /*                               */ 00095000
         LA    DDL,1                                               0192 00096000
@DL00192 DS    0H                                                  0193 00097000
*                 IF DDL=1          /* FIRST PASS IF FMLIB           */ 00098000
*                   THEN            /*                               */ 00099000
         CH    DDL,@CH00061                                        0193 00100000
         BNE   @RF00193                                            0193 00101000
*                   DEVDDNAM=ICTFMLIB(1);/* SAVE FMLIB DDNAME        */ 00102000
         LR    @10,DDJ                                             0194 00103000
         SLA   @10,2                                               0194 00104000
         LR    @07,DDI                                             0194 00105000
         MH    @07,@CH01768                                        0194 00106000
         L     @04,CCAICPTF(,CCAPTR)                               0194 00107000
         AL    @04,@CF01778                                        0194 00108000
         L     @07,ICTPCHN-64(@07,@04)                             0194 00109000
         AL    @07,@CF01779                                        0194 00110000
         L     @10,ICTIXP(@10,@07)                                 0194 00111000
         MVC   DEVDDNAM(8),ICTFMLIB(@10)                           0194 00112000
*                 ELSE              /* SECOND PASS IF TOLIB          */ 00113000
*                   DO;             /* CHCK TOLIB AND FMLIB          */ 00114000
         B     @RC00193                                            0195 00115000
@RF00193 DS    0H                                                  0196 00116000
*                     IF ICTTOLIB(1)=ICTFMLIB(1)/* IF SAME THEN      */ 00117000
*                       THEN        /* DONT NEED TO CHECK            */ 00118000
         LR    @10,DDJ                                             0196 00119000
         SLA   @10,2                                               0196 00120000
         LR    @07,DDI                                             0196 00121000
         MH    @07,@CH01768                                        0196 00122000
         L     @04,CCAICPTF(,CCAPTR)                               0196 00123000
         AL    @04,@CF01778                                        0196 00124000
         L     @07,ICTPCHN-64(@07,@04)                             0196 00125000
         AL    @07,@CF01779                                        0196 00126000
         L     @10,ICTIXP(@10,@07)                                 0196 00127000
         CLC   ICTTOLIB(8,@10),ICTFMLIB(@10)                       0196 00128000
         BNE   @RF00196                                            0196 00129000
*                       DEVDDNAM=BLANK8;/* SET TO NO DD              */ 00130000
         MVC   DEVDDNAM(8),@CC01720                                0197 00131000
*                     ELSE          /* IF NOT EQUAL                  */ 00132000
*                       DEVDDNAM=ICTTOLIB(1);/* SAVE TOLIB DDNAME    */ 00133000
         B     @RC00196                                            0198 00134000
@RF00196 LR    @10,DDJ                                             0198 00135000
         SLA   @10,2                                               0198 00136000
         LR    @07,DDI                                             0198 00137000
         MH    @07,@CH01768                                        0198 00138000
         L     @04,CCAICPTF(,CCAPTR)                               0198 00139000
         AL    @04,@CF01778                                        0198 00140000
         L     @07,ICTPCHN-64(@07,@04)                             0198 00141000
         AL    @07,@CF01779                                        0198 00142000
         L     @10,ICTIXP(@10,@07)                                 0198 00143000
         MVC   DEVDDNAM(8),ICTTOLIB(@10)                           0198 00144000
*                   END;            /* END SECOND PASS               */ 00145000
@RC00196 DS    0H                                                  0200 00146000
*                 IF DEVDDNAM^=TXTPTS/* DONT CHECK IF PTS            */ 00147000
*                     &DEVDDNAM^=BLANK8/* OR BLANK                   */ 00148000
*                     &DEVDDNAM^=HEXZERO/* OR IF ALL ZEROES          */ 00149000
*                   THEN            /* IF NOT ONE OF ABOVE           */ 00150000
@RC00193 CLC   DEVDDNAM(8),@CC01727                                0200 00151000
         BE    @RF00200                                            0200 00152000
         CLC   DEVDDNAM(8),@CC01720                                0200 00153000
         BE    @RF00200                                            0200 00154000
         CLC   DEVDDNAM(8),HEXZERO                                 0200 00155000
         BE    @RF00200                                            0200 00156000
*                   DO;             /* THEN CHECK FOR DD             */ 00157000
*                     GEN(DEVTYPE DEVDDNAM,DEVADDR)                0202 00158000
*                     REFS(DEVDDNAM,DEVADDR);/* CHECK FOR DD CARD    */ 00159000
         DEVTYPE DEVDDNAM,DEVADDR                                       00160000
*                     RFY                                          0203 00161000
*                       RTNCODE RSTD;/*                              */ 00162000
*                     IF RTNCODE^=ZERO/* DD CARD FOUND?              */ 00163000
*                       THEN        /* NO                            */ 00164000
         LTR   RTNCODE,RTNCODE                                     0204 00165000
         BZ    @RF00204                                            0204 00166000
*                       DO;         /* ERROR                         */ 00167000
*                         RFY                                      0206 00168000
*                           RTNCODE UNRSTD;/*                        */ 00169000
*                         DO;       /* HMASMPMG M1(HMA283I)M2(PART012   00170000
*                                      )M3(PART014)VAR(DEVDDNAM,ICTMN   00171000
*                                      AME(1),ICTPTFS(DDI))TYPE(ERR)T   00172000
*                                      ARGET(LOG,SYSOUT)             */ 00173000
*                           HMASMMGP=HMASMMGP&&HMASMMGP;/* SET PARMS    00174000
*                                      TO ZEROS                      */ 00175000
         XC    HMASMMGP(24),HMASMMGP                               0208 00176000
*                           MGPMGNO1=HMA283I;/* SET UP MSG 1 CODE    */ 00177000
         MVC   MGPMGNO1(2),@CH00606                                0209 00178000
*                           MGPMGNO2=PART012;/* SET UP MSG 2 CODE    */ 00179000
         MVC   MGPMGNO2(2),@CH00265                                0210 00180000
*                           MGPMGNO3=PART014;/* SET UP MSG 3 CODE    */ 00181000
         MVC   MGPMGNO3(2),@CH00332                                0211 00182000
*                           MGPTYPE=MGPERR;/* SET MESSAGE TYPE       */ 00183000
         MVI   MGPTYPE,X'03'                                       0212 00184000
*                           MGPHLDS='1'B;/* SET TARGET FLAG          */ 00185000
*                           MGPPRINT='1'B;/* SET TARGET FLAG         */ 00186000
         OI    MGPHLDS,B'10010000'                                 0214 00187000
*                           MGPVARPT(1)=ADDR(DEVDDNAM);/* SET      0215 00188000
*                                      VARIABLE PTR                  */ 00189000
         LA    @10,DEVDDNAM                                        0215 00190000
         ST    @10,MGPVARPT                                        0215 00191000
*                           MGPVARPT(2)=ADDR(ICTMNAME(1));/* SET   0216 00192000
*                                      VARIABLE PTR                  */ 00193000
         LR    @10,DDJ                                             0216 00194000
         SLA   @10,2                                               0216 00195000
         LR    @07,DDI                                             0216 00196000
         MH    @07,@CH01768                                        0216 00197000
         L     @04,CCAICPTF(,CCAPTR)                               0216 00198000
         LA    @01,0(@07,@04)                                      0216 00199000
         AL    @01,@CF01778                                        0216 00200000
         L     @01,ICTPCHN-64(,@01)                                0216 00201000
         AL    @01,@CF01779                                        0216 00202000
         L     @10,ICTIXP(@10,@01)                                 0216 00203000
         ST    @10,MGPVARPT+4                                      0216 00204000
*                           MGPVARPT(3)=ADDR(ICTPTFS(DDI));/* SET  0217 00205000
*                                      VARIABLE PTR                  */ 00206000
         AL    @04,@CF01780                                        0217 00207000
         LA    @10,ICTPTFS(@07,@04)                                0217 00208000
         ST    @10,MGPVARPT+8                                      0217 00209000
*                           CALL HMASMMSG(HMASMMGP);/* HAVE MESSAGE     00210000
*                                      ISSUED                        */ 00211000
         L     @15,@CV01710                                        0218 00212000
         LA    @01,@AL00218                                        0218 00213000
         BALR  @14,@15                                             0218 00214000
*                         END;                                     0219 00215000
*                         HIGHTDD=MAX(HIGHTDD,STOPPTF);/*    @Z67SP00*/ 00216000
         LA    @10,8                                               0220 00217000
         CR    HIGHTDD,@10                                         0220 00218000
         BNL   *+6                                                      00219000
         LR    HIGHTDD,@10                                         0220 00220000
*                         PTFERRSW=ON;/* ERR FOR THIS PTF SET MOD  0221 00221000
*                                      BITS WILL BE SET AT NOGOCK    */ 00222000
         OI    PTFERRSW,B'10000000'                                0221 00223000
*                         ICTMMSG(1)=ON;/* MOD MSG WRITTEN   @Z67SP00*/ 00224000
         LR    @10,DDJ                                             0222 00225000
         SLA   @10,2                                               0222 00226000
         LR    @07,DDI                                             0222 00227000
         MH    @07,@CH01768                                        0222 00228000
         L     @04,CCAICPTF(,CCAPTR)                               0222 00229000
         AL    @04,@CF01778                                        0222 00230000
         L     @07,ICTPCHN-64(@07,@04)                             0222 00231000
         AL    @07,@CF01779                                        0222 00232000
         L     @10,ICTIXP(@10,@07)                                 0222 00233000
         OI    ICTMMSG(@10),B'00010000'                            0222 00234000
*                       END;        /* END DD NOT FOUND              */ 00235000
*                   END;            /* END DD TO BE CHECKED          */ 00236000
@RF00204 DS    0H                                                  0225 00237000
*               END;                /* END TOLIB/FMLIB LOOP          */ 00238000
*                                                                  0225 00239000
@RF00200 AH    DDL,@CH00061                                        0225 00240000
         CH    DDL,@CH00272                                        0225 00241000
         BNH   @DL00192                                            0225 00242000
*               /*****************************************************/ 00243000
*               /*                                                   */ 00244000
*               /* FOR EACH MODULE LOOP THRU ITS LOAD MODULES        */ 00245000
*               /* CHECKING FOR THIER DD CARDS                       */ 00246000
*               /*                                                   */ 00247000
*               /*****************************************************/ 00248000
*                                                                  0226 00249000
*               DO DDK=1 BY 1 WHILE ICTIXM(DDK)^=ICTENDIX;/* LOOP ON    00250000
*                                      MOD TO LMOD CHAIN             */ 00251000
         LA    DDK,1                                               0226 00252000
         B     @DE00226                                            0226 00253000
@DL00226 DS    0H                                                  0227 00254000
*                 LDDERRSW=OFF;     /* NO LMOD ERR SET               */ 00255000
         NI    LDDERRSW,B'10111111'                                0227 00256000
*                 IF ICTLMSG(1)=OFF /* IF NO MSG FOR THIS PTF AND  0228 00257000
*                                      THIS LMOD YET                 */ 00258000
*                     &ICTLDDCK(1)=OFF/* AND DDS NOT CHECKED         */ 00259000
*                   THEN            /* THEN CHECK NOW                */ 00260000
         LR    @10,DDK                                             0228 00261000
         SLA   @10,2                                               0228 00262000
         LR    @15,DDJ                                             0228 00263000
         SLA   @15,2                                               0228 00264000
         LR    @14,DDI                                             0228 00265000
         MH    @14,@CH01768                                        0228 00266000
         L     @01,CCAICPTF(,CCAPTR)                               0228 00267000
         AL    @01,@CF01778                                        0228 00268000
         L     @01,ICTPCHN-64(@14,@01)                             0228 00269000
         AL    @01,@CF01779                                        0228 00270000
         L     @01,ICTIXP(@15,@01)                                 0228 00271000
         L     @01,ICTMCHN(,@01)                                   0228 00272000
         AL    @01,@CF01779                                        0228 00273000
         L     @10,ICTIXM(@10,@01)                                 0228 00274000
         TM    ICTLMSG(@10),B'00011000'                            0228 00275000
         BNZ   @RF00228                                            0228 00276000
*                   DO;             /*                               */ 00277000
*                                                                  0229 00278000
*                     /***********************************************/ 00279000
*                     /*                                             */ 00280000
*                     /* LOOP CHECKING THE TWO TARGET LIBRARY DD     */ 00281000
*                     /* CARDS                                       */ 00282000
*                     /*                                             */ 00283000
*                     /***********************************************/ 00284000
*                                                                  0230 00285000
*                     DO DDL=1 TO IOPLSMAX;/* LOOP ON NUM OF SYSLIB     00286000
*                                      LIBRARIES             @ZD00004*/ 00287000
         LA    DDL,1                                               0230 00288000
@DL00230 DS    0H                                                  0231 00289000
*                       IF DDL=1    /* FIRST PASS ON SYSLIB1         */ 00290000
*                         THEN      /*                               */ 00291000
         CH    DDL,@CH00061                                        0231 00292000
         BNE   @RF00231                                            0231 00293000
*                         DEVDDNAM=ICTTG1(1);/*                      */ 00294000
         LR    @10,DDK                                             0232 00295000
         SLA   @10,2                                               0232 00296000
         LR    @07,DDJ                                             0232 00297000
         SLA   @07,2                                               0232 00298000
         LR    @15,DDI                                             0232 00299000
         MH    @15,@CH01768                                        0232 00300000
         L     @01,CCAICPTF(,CCAPTR)                               0232 00301000
         AL    @01,@CF01778                                        0232 00302000
         L     @01,ICTPCHN-64(@15,@01)                             0232 00303000
         AL    @01,@CF01779                                        0232 00304000
         L     @07,ICTIXP(@07,@01)                                 0232 00305000
         L     @07,ICTMCHN(,@07)                                   0232 00306000
         AL    @07,@CF01779                                        0232 00307000
         L     @10,ICTIXM(@10,@07)                                 0232 00308000
         MVC   DEVDDNAM(8),ICTTG1(@10)                             0232 00309000
*                       ELSE        /* SECOND PASS ON                */ 00310000
*                         DEVDDNAM=ICTTG2(1);/* SYSLIB2              */ 00311000
         B     @RC00231                                            0233 00312000
@RF00231 LR    @10,DDK                                             0233 00313000
         SLA   @10,2                                               0233 00314000
         LR    @07,DDJ                                             0233 00315000
         SLA   @07,2                                               0233 00316000
         LR    @15,DDI                                             0233 00317000
         MH    @15,@CH01768                                        0233 00318000
         L     @01,CCAICPTF(,CCAPTR)                               0233 00319000
         AL    @01,@CF01778                                        0233 00320000
         L     @01,ICTPCHN-64(@15,@01)                             0233 00321000
         AL    @01,@CF01779                                        0233 00322000
         L     @07,ICTIXP(@07,@01)                                 0233 00323000
         L     @07,ICTMCHN(,@07)                                   0233 00324000
         AL    @07,@CF01779                                        0233 00325000
         L     @10,ICTIXM(@10,@07)                                 0233 00326000
         MVC   DEVDDNAM(8),ICTTG2(@10)                             0233 00327000
*                       IF DEVDDNAM^=BLANK8/* DONT CHECK IF BLANK    */ 00328000
*                           &DEVDDNAM^=HEXZERO/* OR ALL ZEROES OR    */ 00329000
*                           &DEVDDNAM^=TXTSYSPN/* SYSPUNCH   @ZD00004*/ 00330000
*                         THEN      /* IF NOT ONE OF ABOVE           */ 00331000
@RC00231 CLC   DEVDDNAM(8),@CC01720                                0234 00332000
         BE    @RF00234                                            0234 00333000
         CLC   DEVDDNAM(8),HEXZERO                                 0234 00334000
         BE    @RF00234                                            0234 00335000
         CLC   DEVDDNAM(8),TXTSYSPN                                0234 00336000
         BE    @RF00234                                            0234 00337000
*                         DO;       /* THEN CHECK FOR DD             */ 00338000
*                           GEN(DEVTYPE DEVDDNAM,DEVADDR)          0236 00339000
*                           REFS(DEVDDNAM,DEVADDR);/* CHECK DD       */ 00340000
         DEVTYPE DEVDDNAM,DEVADDR                                       00341000
*                           RFY                                    0237 00342000
*                             RTNCODE RSTD;/*                        */ 00343000
*                           IF RTNCODE^=ZERO/* DD FOUND?             */ 00344000
*                             THEN  /* NO                            */ 00345000
         LTR   RTNCODE,RTNCODE                                     0238 00346000
         BZ    @RF00238                                            0238 00347000
*                             DO;   /* ERROR                         */ 00348000
*                               RFY                                0240 00349000
*                                 RTNCODE UNRSTD;/*                  */ 00350000
*                               LDDERRSW=ON;/* LMOD DD ERR SET       */ 00351000
*                               PTFERRSW=ON;/* ERR IN PTF            */ 00352000
         OI    LDDERRSW,B'11000000'                                0242 00353000
*                               IF DEVDDNAM=TXTNUC/* NUCLEUS DD?     */ 00354000
*                                 THEN/* THEN CANT SAVE BACKUP       */ 00355000
         CLC   DEVDDNAM(8),@CC01725                                0243 00356000
         BNE   @RF00243                                            0243 00357000
*                                 CCANCPTF=OFF;/* OF IEANUC01        */ 00358000
         NI    CCANCPTF(CCAPTR),B'01111111'                        0244 00359000
*                               MGPTYPE=MGPERR;/* SET MESSAGE SEV. 0245 00360000
*                                                            @ZD00001*/ 00361000
@RF00243 MVI   MGPTYPE,X'03'                                       0245 00362000
*                               DO; /* HMASMPMG M1(HMA283I)M2(PART013   00363000
*                                      )M3(PART014)VAR(DEVDDNAM,ICTLN   00364000
*                                      AME(1),ICTPTFS(DDI))TYPE(ERR)T   00365000
*                                      ARGET(LOG,SYSOUT)             */ 00366000
*                                 HMASMMGP=HMASMMGP&&HMASMMGP;/* SET    00367000
*                                      PARMS TO ZEROS                */ 00368000
         XC    HMASMMGP(24),HMASMMGP                               0247 00369000
*                                 MGPMGNO1=HMA283I;/* SET UP MSG 1 0248 00370000
*                                      CODE                          */ 00371000
         MVC   MGPMGNO1(2),@CH00606                                0248 00372000
*                                 MGPMGNO2=PART013;/* SET UP MSG 2 0249 00373000
*                                      CODE                          */ 00374000
         MVC   MGPMGNO2(2),@CH00526                                0249 00375000
*                                 MGPMGNO3=PART014;/* SET UP MSG 3 0250 00376000
*                                      CODE                          */ 00377000
         MVC   MGPMGNO3(2),@CH00332                                0250 00378000
*                                 MGPTYPE=MGPERR;/* SET MESSAGE TYPE */ 00379000
         MVI   MGPTYPE,X'03'                                       0251 00380000
*                                 MGPHLDS='1'B;/* SET TARGET FLAG    */ 00381000
*                                 MGPPRINT='1'B;/* SET TARGET FLAG   */ 00382000
         OI    MGPHLDS,B'10010000'                                 0253 00383000
*                                 MGPVARPT(1)=ADDR(DEVDDNAM);/* SET     00384000
*                                      VARIABLE PTR                  */ 00385000
         LA    @10,DEVDDNAM                                        0254 00386000
         ST    @10,MGPVARPT                                        0254 00387000
*                                 MGPVARPT(2)=ADDR(ICTLNAME(1));/* 0255 00388000
*                                      SET VARIABLE PTR              */ 00389000
         LR    @10,DDK                                             0255 00390000
         SLA   @10,2                                               0255 00391000
         LR    @09,DDJ                                             0255 00392000
         SLA   @09,2                                               0255 00393000
         LR    @07,DDI                                             0255 00394000
         MH    @07,@CH01768                                        0255 00395000
         L     @15,CCAICPTF(,CCAPTR)                               0255 00396000
         LA    @01,0(@07,@15)                                      0255 00397000
         AL    @01,@CF01778                                        0255 00398000
         L     @01,ICTPCHN-64(,@01)                                0255 00399000
         AL    @01,@CF01779                                        0255 00400000
         L     @09,ICTIXP(@09,@01)                                 0255 00401000
         L     @09,ICTMCHN(,@09)                                   0255 00402000
         AL    @09,@CF01779                                        0255 00403000
         L     @10,ICTIXM(@10,@09)                                 0255 00404000
         ST    @10,MGPVARPT+4                                      0255 00405000
*                                 MGPVARPT(3)=ADDR(ICTPTFS(DDI));/*     00406000
*                                      SET VARIABLE PTR              */ 00407000
         AL    @15,@CF01780                                        0256 00408000
         LA    @10,ICTPTFS(@07,@15)                                0256 00409000
         ST    @10,MGPVARPT+8                                      0256 00410000
*                                 CALL HMASMMSG(HMASMMGP);/* HAVE  0257 00411000
*                                      MESSAGE ISSUED                */ 00412000
         L     @15,@CV01710                                        0257 00413000
         LA    @01,@AL00257                                        0257 00414000
         BALR  @14,@15                                             0257 00415000
*                               END;                               0258 00416000
*                               HIGHTDD=MAX(HIGHTDD,STOPPTF);/*    0259 00417000
*                                                            @Z67SP00*/ 00418000
         LA    @10,8                                               0259 00419000
         CR    HIGHTDD,@10                                         0259 00420000
         BNL   *+6                                                      00421000
         LR    HIGHTDD,@10                                         0259 00422000
*                               ICTLNOGO(1)=ON;/* LMOD NOGO          */ 00423000
*                               ICTLCPL(1)=ON;/* LMOD COMPLETED      */ 00424000
*                               ICTLMSG(1)=ON;/* LMOD MSG WRITTEN FOR   00425000
*                                      THIS PTF                      */ 00426000
*                                                                  0262 00427000
         LR    @10,DDK                                             0262 00428000
         SLA   @10,2                                               0262 00429000
         LR    @09,DDJ                                             0262 00430000
         SLA   @09,2                                               0262 00431000
         LR    @07,DDI                                             0262 00432000
         MH    @07,@CH01768                                        0262 00433000
         L     @01,CCAICPTF(,CCAPTR)                               0262 00434000
         AL    @01,@CF01778                                        0262 00435000
         L     @07,ICTPCHN-64(@07,@01)                             0262 00436000
         AL    @07,@CF01779                                        0262 00437000
         L     @09,ICTIXP(@09,@07)                                 0262 00438000
         L     @09,ICTMCHN(,@09)                                   0262 00439000
         AL    @09,@CF01779                                        0262 00440000
         L     @10,ICTIXM(@10,@09)                                 0262 00441000
         OI    ICTLNOGO(@10),B'01110000'                           0262 00442000
*                               /*************************************/ 00443000
*                               /*                                   */ 00444000
*                               /* LOOP MARKING ALL PTF FOR LMOD AS  */ 00445000
*                               /* NOGO                              */ 00446000
*                               /*                                   */ 00447000
*                               /*************************************/ 00448000
*                                                                  0263 00449000
*                               DDLMDPTR=ADDR(ICTLMOD(1));/* SAVE  0263 00450000
*                                      ADDR OF CURRENT LMOD          */ 00451000
         LR    DDLMDPTR,@10                                        0263 00452000
*                               RFY                                0264 00453000
*                                 ICTLMOD BASED(DDLMDPTR);/*         */ 00454000
*                               RFY                                0265 00455000
*                                 ICTIXLF BASED(ICTLCHN(1));/*       */ 00456000
*                               RFY                                0266 00457000
*                                 ICTMOD BASED(ICTIXL(DDM));/*       */ 00458000
*                               RFY                                0267 00459000
*                                 ICTPTF BASED(ICTPPTR(1));/*        */ 00460000
*                               DO DDM=1 BY 1 WHILE ICTIXL(DDM)^=  0268 00461000
*                                     ICTENDIX;/* LOOP ON LMOD TO MOD   00462000
*                                      CHAIN                         */ 00463000
         LA    DDM,1                                               0268 00464000
         B     @DE00268                                            0268 00465000
@DL00268 DS    0H                                                  0269 00466000
*                                 ICTPNOGO(1)=ON;/* SET PTF NOGO. MOD   00467000
*                                      BITS WILL BE SET IN NOGOCHECK */ 00468000
         LR    @10,DDM                                             0269 00469000
         SLA   @10,2                                               0269 00470000
         L     @09,ICTLCHN(,DDLMDPTR)                              0269 00471000
         AL    @09,@CF01779                                        0269 00472000
         L     @10,ICTIXL(@10,@09)                                 0269 00473000
         L     @10,ICTPPTR(,@10)                                   0269 00474000
         OI    ICTPNOGO(@10),B'01000000'                           0269 00475000
*                               END;/* END LMOD TO MOD LOOP          */ 00476000
         AH    DDM,@CH00061                                        0270 00477000
@DE00268 LR    @10,DDM                                             0270 00478000
         SLA   @10,2                                               0270 00479000
         L     @09,ICTLCHN(,DDLMDPTR)                              0270 00480000
         AL    @09,@CF01779                                        0270 00481000
         L     @10,ICTIXL(@10,@09)                                 0270 00482000
         CL    @10,ICTENDIX                                        0270 00483000
         BNE   @DL00268                                            0270 00484000
*                               RFY                                0271 00485000
*                                 ICTMOD BASED(ICTIXP(DDJ));/*       */ 00486000
*                               RFY                                0272 00487000
*                                 ICTLMOD BASED(ICTIXM(DDK));/*      */ 00488000
*                               RFY                                0273 00489000
*                                 ICTPTF BASED(CCAICPTF);/*          */ 00490000
*                             END;  /* END DD NOT FOUND              */ 00491000
*                         END;      /* END MUST CHECK DD             */ 00492000
@RF00238 DS    0H                                                  0276 00493000
*                     END;          /* END TGT1/TGT2 LOOP            */ 00494000
@RF00234 AH    DDL,@CH00061                                        0276 00495000
         CH    DDL,@CH00272                                        0276 00496000
         BNH   @DL00230                                            0276 00497000
*                     IF LDDERRSW=OFF/* IF NO ERR IN LMOD            */ 00498000
*                       THEN        /* THEN SET DD CHECKED           */ 00499000
         TM    LDDERRSW,B'01000000'                                0277 00500000
         BNZ   @RF00277                                            0277 00501000
*                       ICTLDDCK(1)=ON;/* BIT IN ICT TO PREVENT    0278 00502000
*                                      CHECKING IF LMOD HIT AGAIN    */ 00503000
         LR    @10,DDK                                             0278 00504000
         SLA   @10,2                                               0278 00505000
         LR    @15,DDJ                                             0278 00506000
         SLA   @15,2                                               0278 00507000
         LR    @14,DDI                                             0278 00508000
         MH    @14,@CH01768                                        0278 00509000
         L     @01,CCAICPTF(,CCAPTR)                               0278 00510000
         AL    @01,@CF01778                                        0278 00511000
         L     @01,ICTPCHN-64(@14,@01)                             0278 00512000
         AL    @01,@CF01779                                        0278 00513000
         L     @01,ICTIXP(@15,@01)                                 0278 00514000
         L     @01,ICTMCHN(,@01)                                   0278 00515000
         AL    @01,@CF01779                                        0278 00516000
         L     @10,ICTIXM(@10,@01)                                 0278 00517000
         OI    ICTLDDCK(@10),B'00001000'                           0278 00518000
*                   END;            /* END NO LMOD MSG               */ 00519000
@RF00277 DS    0H                                                  0280 00520000
*               END;                /* END MOD TO LMOD LOOP          */ 00521000
@RF00228 AH    DDK,@CH00061                                        0280 00522000
@DE00226 LR    @10,DDK                                             0280 00523000
         SLA   @10,2                                               0280 00524000
         LR    @15,DDJ                                             0280 00525000
         SLA   @15,2                                               0280 00526000
         LR    @14,DDI                                             0280 00527000
         MH    @14,@CH01768                                        0280 00528000
         L     @01,CCAICPTF(,CCAPTR)                               0280 00529000
         AL    @01,@CF01778                                        0280 00530000
         L     @01,ICTPCHN-64(@14,@01)                             0280 00531000
         AL    @01,@CF01779                                        0280 00532000
         L     @01,ICTIXP(@15,@01)                                 0280 00533000
         L     @01,ICTMCHN(,@01)                                   0280 00534000
         AL    @01,@CF01779                                        0280 00535000
         L     @10,ICTIXM(@10,@01)                                 0280 00536000
         CL    @10,ICTENDIX                                        0280 00537000
         BNE   @DL00226                                            0280 00538000
*             END;                  /* END SELECTED MOD LOOP         */ 00539000
*         END;                      /* END MOD LOOP                  */ 00540000
*                                                                  0282 00541000
@RF00190 AH    DDJ,@CH00061                                        0282 00542000
@DE00189 LR    @10,DDJ                                             0282 00543000
         SLA   @10,2                                               0282 00544000
         LR    @04,DDI                                             0282 00545000
         MH    @04,@CH01768                                        0282 00546000
         L     @15,CCAICPTF(,CCAPTR)                               0282 00547000
         LA    @01,0(@04,@15)                                      0282 00548000
         AL    @01,@CF01778                                        0282 00549000
         L     @01,ICTPCHN-64(,@01)                                0282 00550000
         AL    @01,@CF01779                                        0282 00551000
         L     @10,ICTIXP(@10,@01)                                 0282 00552000
         CL    @10,ICTENDIX                                        0282 00553000
         BNE   @DL00189                                            0282 00554000
*         /***********************************************************/ 00555000
*         /*                                                         */ 00556000
*         /* IF AN ERROR WAS FOUND IN LOOKING AT THE MODS OR LMODS   */ 00557000
*         /* THEN MARK THE PTF IN ERROR                              */ 00558000
*         /*                                                         */ 00559000
*         /***********************************************************/ 00560000
*                                                                  0283 00561000
*         IF PTFERRSW=ON            /* ERR FOUND FOR PTF             */ 00562000
*           THEN                    /* YES                           */ 00563000
         TM    PTFERRSW,B'10000000'                                0283 00564000
         BNO   @RF00283                                            0283 00565000
*           DO;                     /* SET PTF IN ERROR              */ 00566000
*             ICTPROCS(DDI)=OFF;    /* NOT IN PROCESS SINCE THIS MOD    00567000
*                                      WILL PUT OUT ERR MSG          */ 00568000
         ST    @04,@TF00001                                        0285 00569000
         ALR   @04,@15                                             0285 00570000
         AL    @04,@CF01777                                        0285 00571000
         NI    ICTPROCS-8(@04),B'01111111'                         0285 00572000
*             ICTPECPL(DDI)=ON;     /* PTF COMPLETE                  */ 00573000
         LR    @10,@15                                             0286 00574000
         AL    @10,@TF00001                                        0286 00575000
         AL    @10,@CF01776                                        0286 00576000
         OI    ICTPECPL-14(@10),B'01000000'                        0286 00577000
*             ICTPNOGO(DDI)=ON;     /* PTF NOGO                      */ 00578000
         LR    @10,@15                                             0287 00579000
         AL    @10,@TF00001                                        0287 00580000
         AL    @10,@CF01777                                        0287 00581000
         OI    ICTPNOGO-8(@10),B'01000000'                         0287 00582000
*             IF ICTPMSG(DDI)=OFF   /* HAS PTF MSG BEEN SENT         */ 00583000
*               THEN                /* NO                            */ 00584000
         LR    @10,@15                                             0288 00585000
         AL    @10,@TF00001                                        0288 00586000
         AL    @10,@CF01777                                        0288 00587000
         TM    ICTPMSG-8(@10),B'00010000'                          0288 00588000
         BNZ   @RF00288                                            0288 00589000
*               DO;                 /* WRITE IT NOW                  */ 00590000
*                 DO;               /* HMASMPMG M1(HMA226I)M2(PART011   00591000
*                                      )VAR(CCAFUNCT,ICTPTFS(DDI))TYP   00592000
*                                      E(INFO)TARGET(LOG,SYSOUT)     */ 00593000
*                   HMASMMGP=HMASMMGP&&HMASMMGP;/* SET PARMS TO ZEROS*/ 00594000
         XC    HMASMMGP(24),HMASMMGP                               0291 00595000
*                   MGPMGNO1=HMA226I;/* SET UP MSG 1 CODE            */ 00596000
         MVC   MGPMGNO1(2),@CH00551                                0292 00597000
*                   MGPMGNO2=PART011;/* SET UP MSG 2 CODE            */ 00598000
         MVC   MGPMGNO2(2),@CH00522                                0293 00599000
*                   MGPTYPE=MGPINFO;/* SET MESSAGE TYPE              */ 00600000
         MVI   MGPTYPE,X'01'                                       0294 00601000
*                   MGPHLDS='1'B;   /* SET TARGET FLAG               */ 00602000
*                   MGPPRINT='1'B;  /* SET TARGET FLAG               */ 00603000
         OI    MGPHLDS,B'10010000'                                 0296 00604000
*                   MGPVARPT(1)=ADDR(CCAFUNCT);/* SET VARIABLE PTR   */ 00605000
         LA    @10,CCAFUNCT(,CCAPTR)                               0297 00606000
         ST    @10,MGPVARPT                                        0297 00607000
*                   MGPVARPT(2)=ADDR(ICTPTFS(DDI));/* SET VARIABLE 0298 00608000
*                                      PTR                           */ 00609000
         L     @10,@TF00001                                        0298 00610000
         AL    @15,@CF01780                                        0298 00611000
         LA    @10,ICTPTFS(@10,@15)                                0298 00612000
         ST    @10,MGPVARPT+4                                      0298 00613000
*                   CALL HMASMMSG(HMASMMGP);/* HAVE MESSAGE ISSUED   */ 00614000
         L     @15,@CV01710                                        0299 00615000
         LA    @01,@AL00299                                        0299 00616000
         BALR  @14,@15                                             0299 00617000
*                 END;                                             0300 00618000
*                 HIGHTDD=MAX(HIGHTDD,STOPPTF);/*            @Z67SP00*/ 00619000
         LA    @10,8                                               0301 00620000
         CR    HIGHTDD,@10                                         0301 00621000
         BNL   *+6                                                      00622000
         LR    HIGHTDD,@10                                         0301 00623000
*                 ICTPMSG(DDI)=ON;  /* SET PTF MSG SENT              */ 00624000
         LR    @10,DDI                                             0302 00625000
         MH    @10,@CH01768                                        0302 00626000
         L     @04,CCAICPTF(,CCAPTR)                               0302 00627000
         ALR   @04,@10                                             0302 00628000
         AL    @04,@CF01777                                        0302 00629000
         OI    ICTPMSG-8(@04),B'00010000'                          0302 00630000
*               END;                /* END PTF MSG NOW SENT          */ 00631000
*                                                                  0303 00632000
*             /*******************************************************/ 00633000
*             /*                                                     */ 00634000
*             /* ISSUE MESSAGE 'HMA370I XXXXXXXX PROCESSING          */ 00635000
*             /* TERMINATED BECAUSE FUNCTION SYSMOD XXXXXXX FAILED'  */ 00636000
*             /*                                                     */ 00637000
*             /*******************************************************/ 00638000
*                                                                  0304 00639000
*                                   /*                       @Z67SP00*/ 00640000
*             IF ICTPTYPE(DDI)=IOPPFUNC/* FUNCTION           @Z67SP00*/ 00641000
*               THEN                /* SYSMOD                @Z67SP00*/ 00642000
@RF00288 LR    @10,DDI                                             0304 00643000
         MH    @10,@CH01768                                        0304 00644000
         L     @04,CCAICPTF(,CCAPTR)                               0304 00645000
         LA    @03,0(@10,@04)                                      0304 00646000
         AL    @03,@CF01786                                        0304 00647000
         SLR   @15,@15                                             0304 00648000
         IC    @15,ICTPTYPE-17(,@03)                               0304 00649000
         CH    @15,@CH00035                                        0304 00650000
         BNE   @RF00304                                            0304 00651000
*               DO;                 /* ERROR                 @Z67SP00*/ 00652000
*                 DO;               /* HMASMPMG M1(HMA370I)VAR(CCAFUN   00653000
*                                      CT,ICTPTFS(DDI))TYPE(SEV)TARGE   00654000
*                                      T(LOG,SYSOUT)                 */ 00655000
*                   HMASMMGP=HMASMMGP&&HMASMMGP;/* SET PARMS TO ZEROS*/ 00656000
         XC    HMASMMGP(24),HMASMMGP                               0307 00657000
*                   MGPMGNO1=HMA370I;/* SET UP MSG 1 CODE            */ 00658000
         MVC   MGPMGNO1(2),@CH01714                                0308 00659000
*                   MGPTYPE=MGPSEV; /* SET MESSAGE TYPE              */ 00660000
         MVI   MGPTYPE,X'04'                                       0309 00661000
*                   MGPHLDS='1'B;   /* SET TARGET FLAG               */ 00662000
*                   MGPPRINT='1'B;  /* SET TARGET FLAG               */ 00663000
         OI    MGPHLDS,B'10010000'                                 0311 00664000
*                   MGPVARPT(1)=ADDR(CCAFUNCT);/* SET VARIABLE PTR   */ 00665000
         LA    @03,CCAFUNCT(,CCAPTR)                               0312 00666000
         ST    @03,MGPVARPT                                        0312 00667000
*                   MGPVARPT(2)=ADDR(ICTPTFS(DDI));/* SET VARIABLE 0313 00668000
*                                      PTR                           */ 00669000
         AL    @04,@CF01780                                        0313 00670000
         LA    @10,ICTPTFS(@10,@04)                                0313 00671000
         ST    @10,MGPVARPT+4                                      0313 00672000
*                   CALL HMASMMSG(HMASMMGP);/* HAVE MESSAGE ISSUED   */ 00673000
         L     @15,@CV01710                                        0314 00674000
         LA    @01,@AL00314                                        0314 00675000
         BALR  @14,@15                                             0314 00676000
*                 END;                                             0315 00677000
*                 HIGHTDD=MAX(HIGHTDD,STOPFUNC);/*           @Z67SP00*/ 00678000
         LA    @10,12                                              0316 00679000
         CR    HIGHTDD,@10                                         0316 00680000
         BNL   *+6                                                      00681000
         LR    HIGHTDD,@10                                         0316 00682000
*               END;                /*                       @Z67SP00*/ 00683000
*           END;                    /* END ERR FOUND IN PTF          */ 00684000
*                                                                  0318 00685000
@RF00304 DS    0H                                                  0319 00686000
*         /***********************************************************/ 00687000
*         /*                                                         */ 00688000
*         /* LOOP THRU ALL LMODS TURNING OFF LMOD MSG BITS SO THAT A */ 00689000
*         /* MSG WILL BE WRITTEN FOR THE NEXT PTF                    */ 00690000
*         /*                                                         */ 00691000
*         /***********************************************************/ 00692000
*                                                                  0319 00693000
*         RFY                                                      0319 00694000
*           ICTLMOD BASED(CCAICLMD);/*                               */ 00695000
@RF00283 DS    0H                                                  0320 00696000
*         DO DDN=1 BY 1 WHILE ICTLEND(DDN)^=ICTENDNT;/* LOOP THRU ALL   00697000
*                                      LMOD ENTRIES                  */ 00698000
         LA    DDN,1                                               0320 00699000
         B     @DE00320                                            0320 00700000
@DL00320 DS    0H                                                  0321 00701000
*           ICTLMSG(DDN)=OFF;       /* SET MSG BIT OFF               */ 00702000
         LR    @10,DDN                                             0321 00703000
         MH    @10,@CH01093                                        0321 00704000
         L     @04,CCAICLMD(,CCAPTR)                               0321 00705000
         ALR   @04,@10                                             0321 00706000
         AL    @04,@CF01787                                        0321 00707000
         NI    ICTLMSG-8(@04),B'11101111'                          0321 00708000
*         END;                      /* END LMOD LOOP                 */ 00709000
         AH    DDN,@CH00061                                        0322 00710000
@DE00320 LR    @10,DDN                                             0322 00711000
         MH    @10,@CH01093                                        0322 00712000
         L     @04,CCAICLMD(,CCAPTR)                               0322 00713000
         AL    @04,@CF01789                                        0322 00714000
         L     @10,ICTLEND(@10,@04)                                0322 00715000
         CL    @10,ICTENDNT                                        0322 00716000
         BNE   @DL00320                                            0322 00717000
*       END;                        /* END PTF NOT ELIMINATED        */ 00718000
*   END;                            /* END LOOP ON PTFS              */ 00719000
@RF00187 AH    DDI,@CH00061                                        0324 00720000
@DE00185 LR    @10,DDI                                             0324 00721000
         MH    @10,@CH01768                                        0324 00722000
         L     @04,CCAICPTF(,CCAPTR)                               0324 00723000
         AL    @04,@CF01780                                        0324 00724000
         L     @10,ICTPEND(@10,@04)                                0324 00725000
         CL    @10,ICTENDNT                                        0324 00726000
         BNE   @DL00185                                            0324 00727000
*   RETURN CODE(HIGHTDD);           /* RETURN                        */ 00728000
         LR    @15,HIGHTDD                                         0325 00729000
         L     @13,4(,@13)                                         0325 00730000
         L     @14,12(,@13)                                        0325 00731000
         LM    @00,@12,20(@13)                                     0325 00732000
         BR    @14                                                 0325 00733000
*   END HMASMTDD                    /*                               */ 00734000
*                                                                  0326 00735000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00736000
*/*%INCLUDE SYSLIB  (HMASMCCA)                                       */ 00737000
*/*%INCLUDE SYSLIB  (HMASMIOP)                                       */ 00738000
*/*%INCLUDE SYSLIB  (HMASMICT)                                       */ 00739000
*/*%INCLUDE SYSLIB  (HMASMMGP)                                       */ 00740000
*                                                                  0326 00741000
*       ;                                                          0326 00742000
@DATA    DS    0H                                                       00743000
@CH00061 DC    H'1'                                                     00744000
@CH00272 DC    H'2'                                                     00745000
@CH00035 DC    H'4'                                                     00746000
@CH00522 DC    H'11'                                                    00747000
@CH00265 DC    H'12'                                                    00748000
@CH00526 DC    H'13'                                                    00749000
@CH00332 DC    H'14'                                                    00750000
@CH00551 DC    H'27'                                                    00751000
@CH01093 DC    H'54'                                                    00752000
@CH00606 DC    H'84'                                                    00753000
@CH01768 DC    H'116'                                                   00754000
@CH01714 DC    H'171'                                                   00755000
         DS    0F                                                       00756000
@AL00218 EQU   *                       LIST WITH   1 ARGUMENT(S)        00757000
@AL00257 EQU   *                       LIST WITH   1 ARGUMENT(S)        00758000
@AL00299 EQU   *                       LIST WITH   1 ARGUMENT(S)        00759000
@AL00314 DC    A(HMASMMGP)             LIST WITH   1 ARGUMENT(S)        00760000
         DS    0F                                                       00761000
@SA00001 DS    18F                                                      00762000
@PC00001 DS    1F                                                       00763000
@TF00001 DS    F                                                        00764000
         DS    0F                                                       00765000
@CF01780 DC    F'-116'                                                  00766000
@CF01777 DC    F'-108'                                                  00767000
@CF01775 DC    F'-103'                                                  00768000
@CF01776 DC    F'-102'                                                  00769000
@CF01786 DC    F'-99'                                                   00770000
@CF01789 DC    F'-54'                                                   00771000
@CF01778 DC    F'-52'                                                   00772000
@CF01787 DC    F'-46'                                                   00773000
@CF01779 DC    F'-4'                                                    00774000
@CV01710 DC    V(HMASMMSG)                                              00775000
         DS    0D                                                       00776000
IOPPTR   DS    A                                                        00777000
@CC01720 DC    C'        '                                              00778000
@CC01725 DC    C'NUCLEUS '                                              00779000
@CC01727 DC    C'SMPPTS  '                                              00780000
ICTENDCH DC    X'FFFFFFFF'                                              00781000
HMASMMGP DS    CL24                                                     00782000
         ORG   HMASMMGP                                                 00783000
MGPFIXED DS    CL12                                                     00784000
         ORG   MGPFIXED                                                 00785000
MGPCLEAR DS    CL6                                                      00786000
         ORG   MGPCLEAR                                                 00787000
MGPMGNO1 DS    FL2                                                      00788000
MGPMGNO2 DS    FL2                                                      00789000
MGPMGNO3 DS    FL2                                                      00790000
         ORG   MGPFIXED+6                                               00791000
MGPFLAGS DS    BL2                                                      00792000
         ORG   MGPFLAGS                                                 00793000
MGPPRINT DS    BL1                                                      00794000
MGPLIST  EQU   MGPFLAGS+0                                               00795000
MGPRPT   EQU   MGPFLAGS+0                                               00796000
MGPHLDS  EQU   MGPFLAGS+0                                               00797000
MGPWTOR  EQU   MGPFLAGS+0                                               00798000
MGPWTO   EQU   MGPFLAGS+0                                               00799000
MGPWTP   EQU   MGPFLAGS+0                                               00800000
@NM00239 EQU   MGPFLAGS+0                                               00801000
         ORG   MGPFIXED+8                                               00802000
MGPTYPE  DS    FL1                                                      00803000
@NM00240 DS    CL3                                                      00804000
         ORG   HMASMMGP+12                                              00805000
MGPVAR   DS    CL12                                                     00806000
         ORG   MGPVAR                                                   00807000
MGPVARPT DS    3A                                                       00808000
         ORG   HMASMMGP+24                                              00809000
HEXZERO  DS    CL8                                                      00810000
         ORG   HEXZERO                                                  00811000
@NM00241 DC    8X'00'                                                   00812000
         ORG   HEXZERO+8                                                00813000
TXTSYSPN DC    CL8'SYSPUNCH'                                            00814000
INTFLAGS DS    BL1                                                      00815000
         ORG   INTFLAGS                                                 00816000
PTFERRSW DS    BL1                                                      00817000
LDDERRSW EQU   INTFLAGS+0                                               00818000
         ORG   INTFLAGS+1                                               00819000
         DS    CL3                                                      00820000
DEVDDNAM DS    CL8                                                      00821000
DEVADDR  DS    CL8                                                      00822000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00823000
@01      EQU   01                                                       00824000
@02      EQU   02                                                       00825000
@03      EQU   03                                                       00826000
@04      EQU   04                                                       00827000
@05      EQU   05                                                       00828000
@06      EQU   06                                                       00829000
@07      EQU   07                                                       00830000
@08      EQU   08                                                       00831000
@09      EQU   09                                                       00832000
@10      EQU   10                                                       00833000
@11      EQU   11                                                       00834000
@12      EQU   12                                                       00835000
@13      EQU   13                                                       00836000
@14      EQU   14                                                       00837000
@15      EQU   15                                                       00838000
DDLMDPTR EQU   @08                                                      00839000
DDN      EQU   @03                                                      00840000
DDM      EQU   @07                                                      00841000
DDL      EQU   @06                                                      00842000
DDK      EQU   @04                                                      00843000
DDJ      EQU   @03                                                      00844000
DDI      EQU   @02                                                      00845000
HIGHTDD  EQU   @05                                                      00846000
CCAPTR   EQU   @11                                                      00847000
RTNCODE  EQU   @15                                                      00848000
RTNREG   EQU   @14                                                      00849000
TBLXOPTS EQU   0                                                        00850000
TBLFLAGS EQU   TBLXOPTS+8                                               00851000
TBLFLG1  EQU   TBLFLAGS                                                 00852000
TBLFLG2  EQU   TBLFLAGS+2                                               00853000
TBLFLG3  EQU   TBLFLAGS+3                                               00854000
TBLFLG4  EQU   TBLFLAGS+5                                               00855000
TBLFLG5  EQU   TBLFLAGS+7                                               00856000
HMASMCCA EQU   0                                                        00857000
CCAFBUFR EQU   HMASMCCA+4                                               00858000
CCADSAD  EQU   CCAFBUFR+124                                             00859000
CCATPAD  EQU   CCAFBUFR+128                                             00860000
CCAFLAG7 EQU   CCAFBUFR+132                                             00861000
CCAFIOP  EQU   HMASMCCA+140                                             00862000
CCAFSYS  EQU   HMASMCCA+148                                             00863000
CCASREL  EQU   CCAFSYS+12                                               00864000
CCAFLAGA EQU   CCAFSYS+21                                               00865000
CCAFSTA  EQU   HMASMCCA+188                                             00866000
CCAFICT  EQU   HMASMCCA+192                                             00867000
CCAICT   EQU   CCAFICT                                                  00868000
CCAICPTF EQU   CCAFICT+4                                                00869000
CCAICMOD EQU   CCAFICT+8                                                00870000
CCAICLMD EQU   CCAFICT+12                                               00871000
CCAFPGM  EQU   HMASMCCA+208                                             00872000
CCABLDLP EQU   CCAFPGM                                                  00873000
CCADBLDL EQU   CCAFPGM+4                                                00874000
CCAFGTP  EQU   HMASMCCA+224                                             00875000
CCASEGTP EQU   CCAFGTP                                                  00876000
@NM00023 EQU   HMASMCCA+244                                             00877000
CCAFFUNC EQU   HMASMCCA+264                                             00878000
CCAFUNCT EQU   CCAFFUNC                                                 00879000
CCAFLAG1 EQU   CCAFFUNC+8                                               00880000
CCAFLAG2 EQU   CCAFFUNC+11                                              00881000
CCANCPTF EQU   CCAFLAG2                                                 00882000
CCAFPROC EQU   HMASMCCA+276                                             00883000
CCAFLAG3 EQU   CCAFPROC                                                 00884000
CCAFDIS  EQU   HMASMCCA+278                                             00885000
CCAFLAG4 EQU   CCAFDIS                                                  00886000
CCAFLAG5 EQU   CCAFDIS+1                                                00887000
CCAFLAG6 EQU   CCAFDIS+2                                                00888000
CCAFCNV  EQU   HMASMCCA+281                                             00889000
CCAFLAG8 EQU   CCAFCNV                                                  00890000
CCAFCTL  EQU   HMASMCCA+282                                             00891000
CCAFLAG9 EQU   CCAFCTL                                                  00892000
CCAFDSNG EQU   HMASMCCA+298                                             00893000
CCAFLAGB EQU   CCAFDSNG                                                 00894000
CCABLDLA EQU   0                                                        00895000
@NM00039 EQU   CCABLDLA                                                 00896000
CCABLDLL EQU   0                                                        00897000
@NM00041 EQU   CCABLDLL                                                 00898000
CCALKDRC EQU   @NM00041+20                                              00899000
@NM00043 EQU   CCABLDLL+124                                             00900000
CCAASMRC EQU   @NM00043+20                                              00901000
@NM00045 EQU   CCABLDLL+248                                             00902000
CCACPYRC EQU   @NM00045+20                                              00903000
@NM00047 EQU   CCABLDLL+372                                             00904000
CCACOMRC EQU   @NM00047+20                                              00905000
@NM00049 EQU   CCABLDLL+496                                             00906000
CCAZAPRC EQU   @NM00049+20                                              00907000
@NM00051 EQU   CCABLDLL+620                                             00908000
CCASUPRC EQU   @NM00051+20                                              00909000
@NM00053 EQU   CCABLDLL+744                                             00910000
CCAUPDRC EQU   @NM00053+20                                              00911000
CCABLDLM EQU   0                                                        00912000
CCABELMT EQU   CCABLDLM+4                                               00913000
CCABMPOS EQU   CCABELMT                                                 00914000
HMASMIOP EQU   0                                                        00915000
IOPNAME  EQU   HMASMIOP+4                                               00916000
@NM00057 EQU   HMASMIOP+12                                              00917000
@NM00058 EQU   @NM00057                                                 00918000
IOPDDNAM EQU   HMASMIOP+24                                              00919000
IOPBUFAD EQU   HMASMIOP+52                                              00920000
IOPDRMAP EQU   HMASMIOP+56                                              00921000
IOPINAME EQU   IOPDRMAP                                                 00922000
IOPINAM  EQU   IOPINAME                                                 00923000
IOPITYP  EQU   IOPINAM                                                  00924000
IOPUSERL EQU   IOPDRMAP+11                                              00925000
IOPEND   EQU   IOPDRMAP+12                                              00926000
IOPLMCTL EQU   0                                                        00927000
IOPQSMIF EQU   0                                                        00928000
@NM00168 EQU   IOPQSMIF                                                 00929000
IOPQSMLS EQU   IOPQSMIF+8                                               00930000
IOPQSMNM EQU   IOPQSMLS                                                 00931000
IOPBS02  EQU   0                                                        00932000
IOPBS04  EQU   0                                                        00933000
IOPBAPF  EQU   IOPBS04                                                  00934000
HMASMICT EQU   0                                                        00935000
ICTCORE  EQU   HMASMICT                                                 00936000
ICTPSPLN EQU   ICTCORE                                                  00937000
ICTMSPLN EQU   ICTCORE+4                                                00938000
ICTLSPLN EQU   ICTCORE+8                                                00939000
ICTGMSPL EQU   0                                                        00940000
ICTPTF   EQU   0                                                        00941000
ICTPTFS  EQU   ICTPTF                                                   00942000
ICTPEND  EQU   ICTPTFS                                                  00943000
ICTPFLG1 EQU   ICTPTF+7                                                 00944000
ICTPFLG3 EQU   ICTPTF+8                                                 00945000
ICTPPROC EQU   ICTPFLG3                                                 00946000
ICTPROCS EQU   ICTPPROC                                                 00947000
ICTPNOGO EQU   ICTPFLG3                                                 00948000
ICTPMSG  EQU   ICTPFLG3                                                 00949000
ICTPFLG5 EQU   ICTPTF+9                                                 00950000
ICTPFLG6 EQU   ICTPTF+11                                                00951000
ICTPFLF  EQU   ICTPFLG6                                                 00952000
ICTPFLG2 EQU   ICTPTF+12                                                00953000
ICTPFLG4 EQU   ICTPTF+13                                                00954000
ICTPGELM EQU   ICTPFLG4                                                 00955000
ICTPFLG8 EQU   ICTPTF+14                                                00956000
ICTPECPL EQU   ICTPFLG8                                                 00957000
ICTPFLG9 EQU   ICTPTF+15                                                00958000
@NM00195 EQU   ICTPFLG9                                                 00959000
ICTPFLGA EQU   ICTPTF+16                                                00960000
ICTPUSR1 EQU   ICTPFLGA                                                 00961000
ICTPTYPE EQU   ICTPTF+17                                                00962000
ICTPCHN  EQU   ICTPTF+64                                                00963000
ICTPRCHN EQU   ICTPTF+68                                                00964000
ICTPSCHN EQU   ICTPTF+72                                                00965000
ICTPPCHN EQU   ICTPTF+76                                                00966000
ICTPICHN EQU   ICTPTF+80                                                00967000
ICTPNCHN EQU   ICTPTF+84                                                00968000
ICTPVCHN EQU   ICTPTF+88                                                00969000
ICTPDCHN EQU   ICTPTF+92                                                00970000
ICTPBCHN EQU   ICTPTF+96                                                00971000
ICTIXPF  EQU   0                                                        00972000
ICTIXP   EQU   ICTIXPF                                                  00973000
ICTENTLS EQU   0                                                        00974000
ICTENTNT EQU   ICTENTLS                                                 00975000
ICTENTNM EQU   ICTENTNT                                                 00976000
ICTENTST EQU   ICTENTNT+7                                               00977000
ICTREQLS EQU   0                                                        00978000
ICTREQNT EQU   ICTREQLS                                                 00979000
ICTREQNM EQU   ICTREQNT                                                 00980000
ICTREQST EQU   ICTREQNT+7                                               00981000
ICTSUPLS EQU   0                                                        00982000
ICTSUPNT EQU   ICTSUPLS                                                 00983000
ICTSUPNM EQU   ICTSUPNT                                                 00984000
ICTPRELS EQU   0                                                        00985000
ICTPRENT EQU   ICTPRELS                                                 00986000
ICTPRENM EQU   ICTPRENT                                                 00987000
ICTPREST EQU   ICTPRENT+7                                               00988000
ICTIRQLS EQU   0                                                        00989000
ICTIRQNT EQU   ICTIRQLS                                                 00990000
ICTIRQNM EQU   ICTIRQNT                                                 00991000
ICTIRQST EQU   ICTIRQNT+7                                               00992000
ICTCSRST EQU   ICTIRQNT+15                                              00993000
ICTNPRLS EQU   0                                                        00994000
ICTNPRNT EQU   ICTNPRLS                                                 00995000
ICTNPRNM EQU   ICTNPRNT                                                 00996000
ICTVRSLS EQU   0                                                        00997000
ICTVRSNT EQU   ICTVRSLS                                                 00998000
ICTVRSNM EQU   ICTVRSNT                                                 00999000
ICTDELLS EQU   0                                                        01000000
ICTDELNT EQU   ICTDELLS                                                 01001000
ICTDELNM EQU   ICTDELNT                                                 01002000
ICTDELST EQU   ICTDELNT+7                                               01003000
ICTSBYLS EQU   0                                                        01004000
ICTSBYNT EQU   ICTSBYLS                                                 01005000
ICTSBYNM EQU   ICTSBYNT                                                 01006000
ICTMOD   EQU   0                                                        01007000
ICTMNAME EQU   ICTMOD                                                   01008000
ICTMFLG2 EQU   ICTMOD+8                                                 01009000
ICTMMSG  EQU   ICTMFLG2                                                 01010000
ICTMFLG1 EQU   ICTMOD+9                                                 01011000
ICTMMODR EQU   ICTMFLG1                                                 01012000
ICTMFLG3 EQU   ICTMOD+10                                                01013000
ICTMFLG4 EQU   ICTMOD+11                                                01014000
ICTMISEL EQU   ICTMFLG4                                                 01015000
ICTMFLG5 EQU   ICTMOD+12                                                01016000
ICTMODF4 EQU   ICTMOD+13                                                01017000
ICTMLEP1 EQU   ICTMODF4                                                 01018000
ICTMODF5 EQU   ICTMOD+14                                                01019000
ICTMLEP2 EQU   ICTMODF5                                                 01020000
ICTMODF6 EQU   ICTMOD+15                                                01021000
ICTMLEP3 EQU   ICTMODF6                                                 01022000
ICTMODF7 EQU   ICTMOD+16                                                01023000
ICTMLEP4 EQU   ICTMODF7                                                 01024000
ICTMACF4 EQU   ICTMOD+17                                                01025000
ICTFMLIB EQU   ICTMOD+24                                                01026000
ICTTOLIB EQU   ICTMOD+32                                                01027000
ICTPPTR  EQU   ICTMOD+96                                                01028000
ICTMCHN  EQU   ICTMOD+100                                               01029000
ICTMICHN EQU   ICTMOD+104                                               01030000
ICTMACHN EQU   ICTMOD+112                                               01031000
ICTMTCHN EQU   ICTMOD+116                                               01032000
ICTMVCHN EQU   ICTMOD+120                                               01033000
ICTMUCHN EQU   ICTMOD+124                                               01034000
ICTIXMF  EQU   0                                                        01035000
ICTIXM   EQU   ICTIXMF                                                  01036000
ICTMIDLS EQU   0                                                        01037000
ICTMID   EQU   ICTMIDLS                                                 01038000
ICTMODID EQU   ICTMID                                                   01039000
ICTMODST EQU   ICTMID+7                                                 01040000
ICTASMLS EQU   0                                                        01041000
ICTASMAD EQU   ICTASMLS                                                 01042000
ICTTALLS EQU   0                                                        01043000
ICTTALNM EQU   ICTTALLS                                                 01044000
ICTMVRLS EQU   0                                                        01045000
ICTMVRNT EQU   ICTMVRLS                                                 01046000
ICTMVRNM EQU   ICTMVRNT                                                 01047000
ICTMUMLS EQU   0                                                        01048000
ICTMUMNT EQU   ICTMUMLS                                                 01049000
ICTMUMNM EQU   ICTMUMNT                                                 01050000
ICTLMOD  EQU   0                                                        01051000
ICTLMNAM EQU   ICTLMOD                                                  01052000
ICTLNAME EQU   ICTLMNAM                                                 01053000
ICTLEND  EQU   ICTLNAME                                                 01054000
ICTLFLG4 EQU   ICTLMOD+8                                                01055000
ICTLNOGO EQU   ICTLFLG4                                                 01056000
ICTLCPL  EQU   ICTLFLG4                                                 01057000
ICTLMSG  EQU   ICTLFLG4                                                 01058000
ICTLDDCK EQU   ICTLFLG4                                                 01059000
ICTLFLG1 EQU   ICTLMOD+9                                                01060000
ICTLFLG5 EQU   ICTLMOD+10                                               01061000
ICTLFLG6 EQU   ICTLMOD+11                                               01062000
ICTLFLG7 EQU   ICTLMOD+12                                               01063000
ICTLFLG2 EQU   ICTLMOD+13                                               01064000
ICTLFLG3 EQU   ICTLMOD+14                                               01065000
ICTTG1   EQU   ICTLMOD+15                                               01066000
ICTTG2   EQU   ICTLMOD+23                                               01067000
ICTLCHN  EQU   ICTLMOD+34                                               01068000
ICTIXLF  EQU   0                                                        01069000
ICTIXL   EQU   ICTIXLF                                                  01070000
CCADSIDA EQU   0                                                        01071000
CCATYPEA EQU   0                                                        01072000
IOPBS01  EQU   0                                                        01073000
IOPBS03  EQU   0                                                        01074000
TBLXPARM EQU   0                                                        01075000
TBLXINDX EQU   TBLXPARM+4                                               01076000
TBLXTBL  EQU   TBLXPARM+28                                              01077000
TBLXFLG1 EQU   TBLXPARM+80                                              01078000
TBLXRC   EQU   TBLXPARM+92                                              01079000
IOPUDATA EQU   IOPEND                                                   01080000
IOPINAM3 EQU   IOPINAME                                                 01081000
@NM00064 EQU   IOPINAM3                                                 01082000
IOPSTCMP EQU   IOPUDATA                                                 01083000
IOPDYNDT EQU   IOPUDATA                                                 01084000
IOPSPACE EQU   IOPDYNDT+44                                              01085000
IOPDTYPE EQU   IOPDYNDT+50                                              01086000
IOPNTMAX EQU   IOPDRMAP                                                 01087000
IOPNTMAP EQU   IOPDRMAP                                                 01088000
IOPCDMAP EQU   IOPNTMAP                                                 01089000
IOPPTMAP EQU   IOPCDMAP                                                 01090000
IOPSCMAP EQU   IOPPTMAP                                                 01091000
IOPDIRCT EQU   IOPSCMAP+12                                              01092000
IOPCDMAX EQU   IOPDIRCT                                                 01093000
IOPCQMAP EQU   IOPDRMAP                                                 01094000
@NM00075 EQU   IOPUDATA                                                 01095000
@NM00076 EQU   IOPUDATA                                                 01096000
IOPASMNT EQU   IOPUDATA                                                 01097000
IOPASMDR EQU   IOPASMNT                                                 01098000
IOPABUNT EQU   IOPASMDR+1                                               01099000
IOPLMDNT EQU   IOPUDATA                                                 01100000
IOPLMDDR EQU   IOPLMDNT                                                 01101000
IOPLMLEP EQU   IOPLMDDR+1                                               01102000
IOPLMDF1 EQU   IOPLMLEP                                                 01103000
IOPFLGS2 EQU   IOPLMDF1                                                 01104000
IOPLMDF2 EQU   IOPLMLEP+1                                               01105000
IOPLMDF3 EQU   IOPLMLEP+2                                               01106000
IOPLMDF4 EQU   IOPLMLEP+3                                               01107000
IOPLMDF5 EQU   IOPLMDDR+5                                               01108000
IOPFLGS3 EQU   IOPLMDF5                                                 01109000
IOPLMDFX EQU   IOPLMDNT+24                                              01110000
@NM00085 EQU   IOPLMDFX                                                 01111000
IOPLNTRY EQU   IOPLMDFX+8                                               01112000
IOPLSYS  EQU   IOPLNTRY                                                 01113000
IOPSYSLB EQU   IOPLSYS                                                  01114000
IOPMACNT EQU   IOPUDATA                                                 01115000
IOPMACDR EQU   IOPMACNT                                                 01116000
IOPRMIDE EQU   IOPMACDR+1                                               01117000
IOPRMST  EQU   IOPRMIDE+7                                               01118000
IOPFMIDE EQU   IOPMACDR+9                                               01119000
IOPMACFX EQU   IOPMACNT+24                                              01120000
IOPBUNT  EQU   IOPMACFX                                                 01121000
IOPMCEND EQU   IOPMACNT+104                                             01122000
IOPMACVR EQU   IOPMCEND                                                 01123000
IOPMCENT EQU   IOPMACVR                                                 01124000
IOPMCDTA EQU   IOPMCENT                                                 01125000
IOPMCASM EQU   IOPMCDTA                                                 01126000
IOPMACID EQU   IOPMCASM                                                 01127000
IOPMACST EQU   IOPMCASM+7                                               01128000
IOPMCIND EQU   IOPMCENT+8                                               01129000
IOPEOFNT EQU   IOPUDATA                                                 01130000
IOPSRCNT EQU   IOPUDATA                                                 01131000
IOPSRCDR EQU   IOPSRCNT                                                 01132000
@NM00096 EQU   IOPSRCDR+1                                               01133000
@NM00098 EQU   @NM00096+7                                               01134000
@NM00102 EQU   IOPSRCDR+9                                               01135000
IOPSRCFX EQU   IOPSRCNT+24                                              01136000
@NM00106 EQU   IOPSRCFX                                                 01137000
IOPSREND EQU   IOPSRCNT+104                                             01138000
IOPSRCVR EQU   IOPSREND                                                 01139000
IOPSNTRY EQU   IOPSRCVR                                                 01140000
IOPSRDTA EQU   IOPSNTRY                                                 01141000
IOPSRCID EQU   IOPSRDTA                                                 01142000
IOPSRCST EQU   IOPSRDTA+7                                               01143000
IOPMODNT EQU   IOPUDATA                                                 01144000
IOPMODDR EQU   IOPMODNT                                                 01145000
@NM00112 EQU   IOPMODDR+1                                               01146000
@NM00114 EQU   @NM00112+7                                               01147000
@NM00118 EQU   IOPMODDR+9                                               01148000
IOPMODFX EQU   IOPMODNT+24                                              01149000
@NM00122 EQU   IOPMODFX                                                 01150000
IOPMDLEP EQU   IOPMODFX+8                                               01151000
IOPMODF1 EQU   IOPMDLEP                                                 01152000
IOPMODF2 EQU   IOPMDLEP+1                                               01153000
IOPMODF3 EQU   IOPMDLEP+2                                               01154000
IOPMODF4 EQU   IOPMDLEP+3                                               01155000
IOPMDEND EQU   IOPMODNT+104                                             01156000
IOPMODVR EQU   IOPMDEND                                                 01157000
IOPMNTRY EQU   IOPMODVR                                                 01158000
IOPMDDTA EQU   IOPMNTRY                                                 01159000
IOPLMODS EQU   IOPMDDTA                                                 01160000
IOPMODID EQU   IOPLMODS                                                 01161000
IOPMODST EQU   IOPLMODS+7                                               01162000
IOPDLBNT EQU   IOPUDATA                                                 01163000
IOPDLBDR EQU   IOPDLBNT                                                 01164000
IOPDLBFX EQU   IOPDLBNT+24                                              01165000
@NM00133 EQU   IOPDLBFX                                                 01166000
IOPDLEND EQU   IOPDLBNT+104                                             01167000
IOPDLBVR EQU   IOPDLEND                                                 01168000
IOPDNTRY EQU   IOPDLBVR                                                 01169000
IOPDSYS  EQU   IOPDNTRY                                                 01170000
IOPSYSNT EQU   IOPUDATA                                                 01171000
IOPSYSDR EQU   IOPSYSNT                                                 01172000
IOPSYSF1 EQU   IOPSYSDR+4                                               01173000
IOPFLGS7 EQU   IOPSYSF1                                                 01174000
IOPSYSFX EQU   IOPSYSNT+24                                              01175000
@NM00140 EQU   IOPSYSFX                                                 01176000
IOPSYEND EQU   IOPSYSNT+184                                             01177000
IOPSYSVR EQU   IOPSYEND                                                 01178000
IOPSYSTR EQU   IOPSYSVR                                                 01179000
IOPSYNTR EQU   IOPSYSTR                                                 01180000
IOPPTFNT EQU   IOPUDATA                                                 01181000
IOPPTFDR EQU   IOPPTFNT                                                 01182000
IOPPSTAT EQU   IOPPTFDR+2                                               01183000
IOPPTFF1 EQU   IOPPSTAT                                                 01184000
IOPFLGS5 EQU   IOPPTFF1                                                 01185000
IOPPTFF2 EQU   IOPPSTAT+1                                               01186000
IOPPTFF3 EQU   IOPPSTAT+3                                               01187000
IOPPTFFX EQU   IOPPTFNT+24                                              01188000
@NM00149 EQU   IOPPTFFX                                                 01189000
@NM00150 EQU   @NM00149                                                 01190000
IOPPDTES EQU   IOPPTFFX+41                                              01191000
@NM00153 EQU   IOPPDTES                                                 01192000
IOPPTPFX EQU   IOPPDTES+6                                               01193000
IOPDATES EQU   IOPPTPFX                                                 01194000
IOPPTEND EQU   IOPPTFNT+104                                             01195000
IOPPTFVR EQU   IOPPTEND                                                 01196000
IOPPNTRY EQU   IOPPTFVR                                                 01197000
IOPPMODS EQU   IOPPNTRY                                                 01198000
IOPENTNT EQU   IOPUDATA+104                                             01199000
IOPSRLNT EQU   IOPUDATA+104                                             01200000
IOPPRENT EQU   IOPUDATA+104                                             01201000
IOPNPRNT EQU   IOPUDATA+104                                             01202000
IOPSUPNT EQU   IOPUDATA+104                                             01203000
IOPREQNT EQU   IOPUDATA+104                                             01204000
IOPIRQNT EQU   IOPUDATA+104                                             01205000
IOPFIDNT EQU   IOPUDATA+104                                             01206000
IOPDELNT EQU   IOPUDATA+104                                             01207000
IOPVERNT EQU   IOPUDATA+104                                             01208000
IOPSBYNT EQU   IOPUDATA+104                                             01209000
IOPQSMNT EQU   IOPUDATA                                                 01210000
IOPQSMDR EQU   IOPQSMNT                                                 01211000
IOPQFMNT EQU   IOPUDATA                                                 01212000
IOPQFMDR EQU   IOPQFMNT                                                 01213000
IOPQFEND EQU   IOPQFMNT+2                                               01214000
IOPQFMVR EQU   IOPQFEND                                                 01215000
IOPQFMLS EQU   IOPQFMVR                                                 01216000
IOPQFMNM EQU   IOPQFMLS                                                 01217000
IOPPTSYS EQU   IOPUDATA                                                 01218000
IOPPTSDR EQU   IOPPTSYS                                                 01219000
IOPPTSFX EQU   IOPPTSYS+24                                              01220000
IOPDSSPC EQU   IOPPTSFX                                                 01221000
IOPPTFG1 EQU   IOPPTSFX+34                                              01222000
IOPPSEND EQU   IOPPTSYS+1064                                            01223000
IOPPTSVR EQU   IOPPSEND                                                 01224000
IOPPTNTR EQU   IOPPTSVR                                                 01225000
@NM00178 EQU   IOPPTNTR                                                 01226000
IOPPTFMD EQU   @NM00178                                                 01227000
IOPPTREL EQU   IOPPTFMD                                                 01228000
IOPBPDS  EQU   IOPUDATA                                                 01229000
IOPBLEP1 EQU   IOPBPDS+8                                                01230000
IOPBLEP2 EQU   IOPBPDS+9                                                01231000
@NM00182 EQU   IOPBPDS+18                                               01232000
IOPBFTB0 EQU   @NM00182                                                 01233000
IOPBFTB1 EQU   IOPBFTB0                                                 01234000
ICTENDNT EQU   ICTENDCH                                                 01235000
ICTENDIX EQU   ICTENDCH                                                 01236000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01237000
IOPBCEND EQU   IOPBPDS+21                                               01238000
IOPBFTB3 EQU   IOPBFTB0+2                                               01239000
IOPBFTB2 EQU   IOPBFTB0+1                                               01240000
@NM00184 EQU   IOPBFTB1                                                 01241000
IOPBAPFP EQU   IOPBFTB1                                                 01242000
IOPBSSI  EQU   IOPBFTB1                                                 01243000
IOPBPAGA EQU   IOPBFTB1                                                 01244000
@NM00183 EQU   IOPBFTB1                                                 01245000
IOPBAOSL EQU   IOPBFTB1                                                 01246000
IOPBSEPA EQU   IOPBPDS+15                                               01247000
IOPBFTBL EQU   IOPBPDS+13                                               01248000
IOPBSTOR EQU   IOPBPDS+10                                               01249000
IOPBREFR EQU   IOPBLEP2                                                 01250000
IOPBLEF  EQU   IOPBLEP2                                                 01251000
IOPBTEST EQU   IOPBLEP2                                                 01252000
IOPBNE   EQU   IOPBLEP2                                                 01253000
@NM00181 EQU   IOPBLEP2                                                 01254000
IOPBDC   EQU   IOPBLEP2                                                 01255000
@NM00180 EQU   IOPBLEP1                                                 01256000
IOPBSCTR EQU   IOPBLEP1                                                 01257000
IOPBOL   EQU   IOPBLEP1                                                 01258000
@NM00179 EQU   IOPBLEP1                                                 01259000
IOPBOVLY EQU   IOPBLEP1                                                 01260000
IOPBREUS EQU   IOPBLEP1                                                 01261000
IOPBRENT EQU   IOPBLEP1                                                 01262000
IOPBNL   EQU   IOPBPDS+7                                                01263000
IOPBTTRN EQU   IOPBPDS+4                                                01264000
IOPBZERO EQU   IOPBPDS+3                                                01265000
IOPBTTRT EQU   IOPBPDS                                                  01266000
IOPPTIND EQU   IOPPTNTR+8                                               01267000
IOPPTSND EQU   IOPPTREL                                                 01268000
@NM00177 EQU   IOPPTSFX+872                                             01269000
IOPSYZPP EQU   IOPPTSFX+772                                             01270000
IOPSYZPR EQU   IOPPTSFX+771                                             01271000
IOPSYZPS EQU   IOPPTSFX+763                                             01272000
IOPSYZAP EQU   IOPPTSFX+755                                             01273000
IOPSYUPP EQU   IOPPTSFX+655                                             01274000
IOPSYUPR EQU   IOPPTSFX+654                                             01275000
IOPSYUPS EQU   IOPPTSFX+646                                             01276000
IOPSYUPD EQU   IOPPTSFX+638                                             01277000
IOPSYSPP EQU   IOPPTSFX+538                                             01278000
IOPSYSPR EQU   IOPPTSFX+537                                             01279000
IOPSYSPS EQU   IOPPTSFX+529                                             01280000
IOPSYSUP EQU   IOPPTSFX+521                                             01281000
IOPSYLKP EQU   IOPPTSFX+421                                             01282000
IOPSYLKR EQU   IOPPTSFX+420                                             01283000
IOPSYLKS EQU   IOPPTSFX+412                                             01284000
IOPSYLKD EQU   IOPPTSFX+404                                             01285000
IOPSYCPP EQU   IOPPTSFX+304                                             01286000
IOPSYCPR EQU   IOPPTSFX+303                                             01287000
IOPSYCPS EQU   IOPPTSFX+295                                             01288000
IOPSYCPY EQU   IOPPTSFX+287                                             01289000
IOPSYCOP EQU   IOPPTSFX+187                                             01290000
IOPSYCOR EQU   IOPPTSFX+186                                             01291000
IOPSYCOS EQU   IOPPTSFX+178                                             01292000
IOPSYCOM EQU   IOPPTSFX+170                                             01293000
IOPSYASP EQU   IOPPTSFX+70                                              01294000
IOPSYASR EQU   IOPPTSFX+69                                              01295000
IOPSYASS EQU   IOPPTSFX+61                                              01296000
IOPSYASM EQU   IOPPTSFX+53                                              01297000
@NM00176 EQU   IOPPTSFX+35                                              01298000
@NM00175 EQU   IOPPTFG1                                                 01299000
IOPPTSNJ EQU   IOPPTFG1                                                 01300000
IOPPTSNP EQU   IOPPTFG1                                                 01301000
IOPSYPLN EQU   IOPPTSFX+32                                              01302000
IOPDSPFX EQU   IOPPTSFX+6                                               01303000
IOPDSDIR EQU   IOPDSSPC+4                                               01304000
IOPDSSEC EQU   IOPDSSPC+2                                               01305000
IOPDSPRM EQU   IOPDSSPC                                                 01306000
@NM00174 EQU   IOPPTSDR+4                                               01307000
IOPPTPEM EQU   IOPPTSDR+2                                               01308000
IOPPCNVL EQU   IOPPTSDR+1                                               01309000
@NM00173 EQU   IOPPTSDR                                                 01310000
IOPQFMTP EQU   IOPQFMLS+8                                               01311000
@NM00172 EQU   IOPQFMLS+7                                               01312000
IOPQFMND EQU   IOPQFMNM                                                 01313000
@NM00171 EQU   IOPQFMDR                                                 01314000
@NM00167 EQU   IOPQSMDR                                                 01315000
@NM00166 EQU   IOPSBYNT+8                                               01316000
IOPSBYST EQU   IOPSBYNT+7                                               01317000
IOPSBYNM EQU   IOPSBYNT                                                 01318000
@NM00165 EQU   IOPVERNT+8                                               01319000
IOPVERST EQU   IOPVERNT+7                                               01320000
IOPVERNM EQU   IOPVERNT                                                 01321000
@NM00164 EQU   IOPDELNT+8                                               01322000
IOPDELST EQU   IOPDELNT+7                                               01323000
IOPDELNM EQU   IOPDELNT                                                 01324000
@NM00163 EQU   IOPFIDNT+8                                               01325000
IOPFIDST EQU   IOPFIDNT+7                                               01326000
IOPFIDNM EQU   IOPFIDNT                                                 01327000
@NM00162 EQU   IOPIRQNT+8                                               01328000
IOPIRQST EQU   IOPIRQNT+7                                               01329000
IOPIRQNM EQU   IOPIRQNT                                                 01330000
@NM00161 EQU   IOPREQNT+8                                               01331000
IOPREQST EQU   IOPREQNT+7                                               01332000
IOPREQNM EQU   IOPREQNT                                                 01333000
@NM00160 EQU   IOPSUPNT+8                                               01334000
IOPSUPST EQU   IOPSUPNT+7                                               01335000
IOPSUPNM EQU   IOPSUPNT                                                 01336000
@NM00159 EQU   IOPNPRNT+8                                               01337000
IOPNPRST EQU   IOPNPRNT+7                                               01338000
IOPNPRNM EQU   IOPNPRNT                                                 01339000
@NM00158 EQU   IOPPRENT+8                                               01340000
IOPPREST EQU   IOPPRENT+7                                               01341000
IOPPRENM EQU   IOPPRENT                                                 01342000
@NM00157 EQU   IOPSRLNT+8                                               01343000
IOPSRLST EQU   IOPSRLNT+7                                               01344000
@NM00156 EQU   IOPSRLNT+4                                               01345000
IOPSRLNM EQU   IOPSRLNT                                                 01346000
@NM00155 EQU   IOPENTNT+8                                               01347000
IOPENTST EQU   IOPENTNT+7                                               01348000
IOPENTNM EQU   IOPENTNT                                                 01349000
IOPPIND  EQU   IOPPNTRY+8                                               01350000
IOPPTFND EQU   IOPPMODS                                                 01351000
IOPPFMID EQU   IOPPTFFX+73                                              01352000
@NM00154 EQU   IOPPTPFX+24                                              01353000
IOPUCLT  EQU   IOPDATES+21                                              01354000
IOPUCLD  EQU   IOPDATES+18                                              01355000
IOPACCT  EQU   IOPDATES+15                                              01356000
IOPACCD  EQU   IOPDATES+12                                              01357000
IOPRSTT  EQU   IOPDATES+9                                               01358000
IOPRSTD  EQU   IOPDATES+6                                               01359000
IOPAPPT  EQU   IOPDATES+3                                               01360000
IOPAPPD  EQU   IOPDATES                                                 01361000
IOPRECT  EQU   @NM00153+3                                               01362000
IOPRECD  EQU   @NM00153                                                 01363000
@NM00152 EQU   IOPPTFFX+8                                               01364000
@NM00151 EQU   @NM00149+7                                               01365000
IOPPRELN EQU   @NM00150                                                 01366000
@NM00148 EQU   IOPPTFDR+20                                              01367000
IOPSBYNO EQU   IOPPTFDR+13                                              01368000
IOPDBYNO EQU   IOPPTFDR+6                                               01369000
@NM00147 EQU   IOPPTFF3                                                 01370000
IOPFLF   EQU   IOPPTFF3                                                 01371000
IOPDBYP  EQU   IOPPTFF3                                                 01372000
IOPSBYP  EQU   IOPPTFF3                                                 01373000
IOPPMDLP EQU   IOPPTFF2+1                                               01374000
IOPPADDP EQU   IOPPTFF2+1                                               01375000
@NM00146 EQU   IOPPTFF2+1                                               01376000
IOPLRFP  EQU   IOPPTFF2                                                 01377000
IOPJCLP  EQU   IOPPTFF2                                                 01378000
IOPSUPP  EQU   IOPPTFF2                                                 01379000
IOPREQP  EQU   IOPPTFF2                                                 01380000
IOPPREP  EQU   IOPPTFF2                                                 01381000
IOPNPRP  EQU   IOPPTFF2                                                 01382000
IOPIRQP  EQU   IOPPTFF2                                                 01383000
IOPDELP  EQU   IOPPTFF2                                                 01384000
IOPREGEN EQU   IOPFLGS5                                                 01385000
IOPBYP   EQU   IOPFLGS5                                                 01386000
IOPDUMMP EQU   IOPFLGS5                                                 01387000
@NM00145 EQU   IOPFLGS5                                                 01388000
IOPERROR EQU   IOPFLGS5                                                 01389000
IOPACC   EQU   IOPFLGS5                                                 01390000
IOPRES   EQU   IOPFLGS5                                                 01391000
IOPAPP   EQU   IOPFLGS5                                                 01392000
IOPPTYPE EQU   IOPPTFDR+1                                               01393000
@NM00144 EQU   IOPPTFDR                                                 01394000
IOPSYSTP EQU   IOPSYSTR+8                                               01395000
IOPSYSND EQU   IOPSYNTR                                                 01396000
@NM00143 EQU   IOPSYSFX+21                                              01397000
IOPSYSID EQU   IOPSYSFX+13                                              01398000
IOPNUCID EQU   IOPSYSFX+12                                              01399000
IOPSREL  EQU   IOPSYSFX+8                                               01400000
@NM00142 EQU   @NM00140+7                                               01401000
@NM00141 EQU   @NM00140                                                 01402000
@NM00139 EQU   IOPSYSDR+5                                               01403000
@NM00138 EQU   IOPFLGS7                                                 01404000
IOPSYNG  EQU   IOPFLGS7                                                 01405000
IOPSYDL  EQU   IOPFLGS7                                                 01406000
IOPSTSNP EQU   IOPFLGS7                                                 01407000
IOPMTSNP EQU   IOPFLGS7                                                 01408000
IOPPEMAX EQU   IOPSYSDR+2                                               01409000
IOPSCNVL EQU   IOPSYSDR+1                                               01410000
@NM00137 EQU   IOPSYSDR                                                 01411000
IOPDLIND EQU   IOPDNTRY+8                                               01412000
IOPDLBND EQU   IOPDSYS                                                  01413000
@NM00136 EQU   IOPDLBFX+8                                               01414000
@NM00135 EQU   @NM00133+7                                               01415000
@NM00134 EQU   @NM00133                                                 01416000
@NM00132 EQU   IOPDLBDR+1                                               01417000
@NM00131 EQU   IOPDLBDR                                                 01418000
IOPMDIND EQU   IOPMNTRY+8                                               01419000
@NM00130 EQU   IOPMODST                                                 01420000
IOPMODND EQU   IOPMODID                                                 01421000
IOPDLIB  EQU   IOPMODFX+72                                              01422000
@NM00129 EQU   IOPMODFX+12                                              01423000
@NM00128 EQU   IOPMODF4                                                 01424000
@NM00127 EQU   IOPMODF3                                                 01425000
@NM00126 EQU   IOPMODF2                                                 01426000
IOPMPAGA EQU   IOPMODF2                                                 01427000
IOPMNE   EQU   IOPMODF2                                                 01428000
@NM00125 EQU   IOPMODF1                                                 01429000
IOPMDC   EQU   IOPMODF1                                                 01430000
IOPMREFR EQU   IOPMODF1                                                 01431000
IOPMOVLY EQU   IOPMODF1                                                 01432000
IOPMSCTR EQU   IOPMODF1                                                 01433000
IOPMREUS EQU   IOPMODF1                                                 01434000
IOPMRENT EQU   IOPMODF1                                                 01435000
IOPMAPF  EQU   IOPMODF1                                                 01436000
@NM00124 EQU   @NM00122+7                                               01437000
@NM00123 EQU   @NM00122                                                 01438000
@NM00121 EQU   IOPMODDR+17                                              01439000
@NM00120 EQU   @NM00118+7                                               01440000
@NM00119 EQU   @NM00118                                                 01441000
@NM00117 EQU   @NM00114                                                 01442000
@NM00116 EQU   @NM00114                                                 01443000
@NM00115 EQU   @NM00114                                                 01444000
@NM00113 EQU   @NM00112                                                 01445000
@NM00111 EQU   IOPMODDR                                                 01446000
IOPSRIND EQU   IOPSNTRY+8                                               01447000
@NM00110 EQU   IOPSRCST                                                 01448000
IOPSRCND EQU   IOPSRCID                                                 01449000
IOPSRDLB EQU   IOPSRCFX+72                                              01450000
IOPSRSYS EQU   IOPSRCFX+64                                              01451000
@NM00109 EQU   IOPSRCFX+8                                               01452000
@NM00108 EQU   @NM00106+7                                               01453000
@NM00107 EQU   @NM00106                                                 01454000
@NM00105 EQU   IOPSRCDR+18                                              01455000
IOPSRLNG EQU   IOPSRCDR+17                                              01456000
@NM00104 EQU   @NM00102+7                                               01457000
@NM00103 EQU   @NM00102                                                 01458000
@NM00101 EQU   @NM00098                                                 01459000
@NM00100 EQU   @NM00098                                                 01460000
@NM00099 EQU   @NM00098                                                 01461000
@NM00097 EQU   @NM00096                                                 01462000
@NM00095 EQU   IOPSRCDR                                                 01463000
IOPEOFND EQU   IOPEOFNT                                                 01464000
IOPMCTYP EQU   IOPMCIND                                                 01465000
@NM00094 EQU   IOPMACST                                                 01466000
IOPMACND EQU   IOPMACID                                                 01467000
IOPMCDLB EQU   IOPMACFX+72                                              01468000
IOPMCSYS EQU   IOPMACFX+64                                              01469000
@NM00093 EQU   IOPMACFX+8                                               01470000
IOPBUTYP EQU   IOPBUNT+7                                                01471000
IOPBUSMD EQU   IOPBUNT                                                  01472000
@NM00092 EQU   IOPMACDR+18                                              01473000
IOPMCLNG EQU   IOPMACDR+17                                              01474000
IOPFMST  EQU   IOPFMIDE+7                                               01475000
IOPFMID  EQU   IOPFMIDE                                                 01476000
@NM00091 EQU   IOPRMST                                                  01477000
IOPRMASM EQU   IOPRMST                                                  01478000
@NM00090 EQU   IOPRMST                                                  01479000
IOPRMID  EQU   IOPRMIDE                                                 01480000
@NM00089 EQU   IOPMACDR                                                 01481000
IOPLMIND EQU   IOPLNTRY+8                                               01482000
IOPLMDND EQU   IOPSYSLB                                                 01483000
@NM00087 EQU   @NM00085+7                                               01484000
@NM00086 EQU   @NM00085                                                 01485000
@NM00084 EQU   IOPLMDDR+6                                               01486000
@NM00083 EQU   IOPFLGS3                                                 01487000
IOPCHREP EQU   IOPFLGS3                                                 01488000
IOPLINK  EQU   IOPFLGS3                                                 01489000
IOPCOPY  EQU   IOPFLGS3                                                 01490000
@NM00082 EQU   IOPLMDF4                                                 01491000
@NM00081 EQU   IOPLMDF3                                                 01492000
@NM00080 EQU   IOPLMDF2                                                 01493000
IOPPAGA  EQU   IOPLMDF2                                                 01494000
IOPNE    EQU   IOPLMDF2                                                 01495000
@NM00079 EQU   IOPFLGS2                                                 01496000
IOPDC    EQU   IOPFLGS2                                                 01497000
IOPREFR  EQU   IOPFLGS2                                                 01498000
IOPOVLY  EQU   IOPFLGS2                                                 01499000
IOPSCTR  EQU   IOPFLGS2                                                 01500000
IOPREUS  EQU   IOPFLGS2                                                 01501000
IOPRENT  EQU   IOPFLGS2                                                 01502000
IOPAPF   EQU   IOPFLGS2                                                 01503000
@NM00078 EQU   IOPLMDDR                                                 01504000
@NM00077 EQU   IOPASMDR+9                                               01505000
IOPABUTP EQU   IOPABUNT+7                                               01506000
IOPABUPT EQU   IOPABUNT                                                 01507000
IOPNTLVL EQU   IOPASMDR                                                 01508000
IOPALLOC EQU   @NM00076+4                                               01509000
IOPUSED  EQU   @NM00076                                                 01510000
IOPTPSEQ EQU   @NM00075+8                                               01511000
IOPVLSER EQU   @NM00075+2                                               01512000
IOPBLKSI EQU   @NM00075                                                 01513000
IOPCQMAX EQU   IOPCQMAP+12                                              01514000
@NM00074 EQU   IOPCQMAP+11                                              01515000
@NM00073 EQU   IOPCQMAP+8                                               01516000
@NM00072 EQU   IOPCQMAP                                                 01517000
IOPPTMAX EQU   IOPCDMAX                                                 01518000
@NM00071 EQU   IOPSCMAP+11                                              01519000
@NM00070 EQU   IOPSCMAP+8                                               01520000
@NM00069 EQU   IOPSCMAP                                                 01521000
IOPDIRMX EQU   IOPNTMAX+12                                              01522000
@NM00068 EQU   IOPNTMAX+11                                              01523000
@NM00067 EQU   IOPNTMAX+8                                               01524000
@NM00066 EQU   IOPNTMAX                                                 01525000
@NM00065 EQU   IOPDTYPE                                                 01526000
IOPDMOD  EQU   IOPDTYPE                                                 01527000
IOPDJCL  EQU   IOPDTYPE                                                 01528000
IOPDSRC  EQU   IOPDTYPE                                                 01529000
IOPDMAC  EQU   IOPDTYPE                                                 01530000
IOPSDIR  EQU   IOPSPACE+4                                               01531000
IOPSSCND EQU   IOPSPACE+2                                               01532000
IOPSPRIM EQU   IOPSPACE                                                 01533000
IOPDSN   EQU   IOPDYNDT                                                 01534000
IOPNTYPE EQU   IOPSTCMP+17                                              01535000
IOPNNAME EQU   IOPSTCMP+9                                               01536000
IOPOTYPE EQU   IOPSTCMP+8                                               01537000
IOPONAME EQU   IOPSTCMP                                                 01538000
IOPISEQ3 EQU   IOPINAM3+6                                               01539000
IOPITYP3 EQU   @NM00064+5                                               01540000
IOPIPTF3 EQU   @NM00064                                                 01541000
TBLXEND0 EQU   TBLXPARM+124                                             01542000
@NM00007 EQU   TBLXPARM+108                                             01543000
TBLXIOP3 EQU   TBLXPARM+104                                             01544000
TBLXD2GT EQU   TBLXPARM+100                                             01545000
TBLXDLGT EQU   TBLXPARM+96                                              01546000
@NM00006 EQU   TBLXRC+3                                                 01547000
TBLXIRC  EQU   TBLXRC+2                                                 01548000
TBLXLRC  EQU   TBLXRC+1                                                 01549000
TBLXTRC  EQU   TBLXRC                                                   01550000
TBLXIBGN EQU   TBLXPARM+88                                              01551000
TBLXTSLP EQU   TBLXPARM+84                                              01552000
@NM00005 EQU   TBLXPARM+83                                              01553000
@NM00004 EQU   TBLXPARM+82                                              01554000
@NM00003 EQU   TBLXPARM+81                                              01555000
@NM00002 EQU   TBLXFLG1                                                 01556000
TBLXTCRC EQU   TBLXFLG1                                                 01557000
TBLXFUND EQU   TBLXPARM+72                                              01558000
TBLXFUNC EQU   TBLXPARM+64                                              01559000
@NM00001 EQU   TBLXPARM+62                                              01560000
TBLXCRQI EQU   TBLXPARM+61                                              01561000
TBLXCDSI EQU   TBLXPARM+60                                              01562000
TBLXLMGT EQU   TBLXPARM+56                                              01563000
TBLXSCGT EQU   TBLXPARM+52                                              01564000
TBLXSREL EQU   TBLXPARM+48                                              01565000
TBLXASGT EQU   TBLXPARM+44                                              01566000
TBLXIFGT EQU   TBLXPARM+40                                              01567000
TBLXNULL EQU   TBLXPARM+36                                              01568000
TBLXTOP  EQU   TBLXPARM+32                                              01569000
TBLXSEGT EQU   TBLXPARM+24                                              01570000
TBLXIOPF EQU   TBLXPARM+20                                              01571000
TBLXIOP2 EQU   TBLXPARM+16                                              01572000
TBLXEND  EQU   TBLXINDX+8                                               01573000
TBLXSTRT EQU   TBLXINDX+4                                               01574000
TBLXCUR  EQU   TBLXINDX                                                 01575000
TBLXHDR  EQU   TBLXPARM                                                 01576000
@NM00238 EQU   ICTLMOD+38                                               01577000
ICTLTTR  EQU   ICTLMOD+31                                               01578000
@NM00237 EQU   ICTLFLG3                                                 01579000
ICTLZAP  EQU   ICTLFLG3                                                 01580000
ICTLLKD  EQU   ICTLFLG3                                                 01581000
ICTLCPY  EQU   ICTLFLG3                                                 01582000
ICTLXPND EQU   ICTLFLG3                                                 01583000
ICTTIND2 EQU   ICTLFLG3                                                 01584000
ICTTIND1 EQU   ICTLFLG3                                                 01585000
@NM00236 EQU   ICTLFLG2                                                 01586000
ICTLDEL  EQU   ICTLFLG2                                                 01587000
@NM00235 EQU   ICTLFLG2                                                 01588000
ICTLTDEL EQU   ICTLFLG2                                                 01589000
ICTLINK  EQU   ICTLFLG2                                                 01590000
ICTCOPY  EQU   ICTLFLG2                                                 01591000
@NM00234 EQU   ICTLFLG7                                                 01592000
@NM00233 EQU   ICTLFLG6                                                 01593000
@NM00232 EQU   ICTLFLG5                                                 01594000
ICTLPAGA EQU   ICTLFLG5                                                 01595000
ICTLNE   EQU   ICTLFLG5                                                 01596000
@NM00231 EQU   ICTLFLG1                                                 01597000
ICTLDC   EQU   ICTLFLG1                                                 01598000
ICTLREFR EQU   ICTLFLG1                                                 01599000
ICTLOVLY EQU   ICTLFLG1                                                 01600000
ICTLSCTR EQU   ICTLFLG1                                                 01601000
ICTLREUS EQU   ICTLFLG1                                                 01602000
ICTLRENT EQU   ICTLFLG1                                                 01603000
ICTLAPF  EQU   ICTLFLG1                                                 01604000
@NM00230 EQU   ICTLFLG4                                                 01605000
ICTLPASS EQU   ICTLFLG4                                                 01606000
ICTLPROC EQU   ICTLFLG4                                                 01607000
@NM00229 EQU   ICTMUMNT+7                                               01608000
ICTMUMND EQU   ICTMUMNM                                                 01609000
@NM00228 EQU   ICTMVRNT+7                                               01610000
ICTMVRND EQU   ICTMVRNM                                                 01611000
ICTTALND EQU   ICTTALNM                                                 01612000
ICTASMND EQU   ICTASMAD                                                 01613000
ICTMIDTY EQU   ICTMODST                                                 01614000
ICTMIDAM EQU   ICTMODST                                                 01615000
ICTMIDRG EQU   ICTMODST                                                 01616000
ICTMIDF1 EQU   ICTMODST                                                 01617000
ICTMIDPL EQU   ICTMODST                                                 01618000
ICTMIDPS EQU   ICTMODST                                                 01619000
@NM00227 EQU   ICTMODST                                                 01620000
ICTMIDND EQU   ICTMODID                                                 01621000
@NM00226 EQU   ICTMOD+128                                               01622000
ICTMICHA EQU   ICTMOD+108                                               01623000
@NM00225 EQU   ICTMOD+95                                                01624000
ICTMFMID EQU   ICTMOD+88                                                01625000
@NM00224 EQU   ICTMOD+87                                                01626000
ICTMRMID EQU   ICTMOD+80                                                01627000
ICTMSSI  EQU   ICTMOD+72                                                01628000
ICTMDOBJ EQU   ICTMOD+64                                                01629000
ICTMSYSL EQU   ICTMOD+56                                                01630000
ICTMDSTL EQU   ICTMOD+48                                                01631000
ICTMASLB EQU   ICTMOD+40                                                01632000
ICTMRELN EQU   ICTMOD+22                                                01633000
@NM00223 EQU   ICTMOD+21                                                01634000
ICTMLANG EQU   ICTMOD+20                                                01635000
@NM00222 EQU   ICTMOD+19                                                01636000
ICTMACF5 EQU   ICTMOD+18                                                01637000
ICTMZMPR EQU   ICTMACF4                                                 01638000
ICTMZOMZ EQU   ICTMACF4                                                 01639000
ICTMDOAS EQU   ICTMACF4                                                 01640000
ICTMXUPD EQU   ICTMACF4                                                 01641000
ICTMFXC  EQU   ICTMACF4                                                 01642000
ICTMFXBS EQU   ICTMACF4                                                 01643000
ICTMHASM EQU   ICTMACF4                                                 01644000
ICTMACDL EQU   ICTMACF4                                                 01645000
@NM00221 EQU   ICTMLEP4                                                 01646000
@NM00220 EQU   ICTMLEP3                                                 01647000
@NM00219 EQU   ICTMLEP2                                                 01648000
ICTMPAGA EQU   ICTMLEP2                                                 01649000
ICTMNE   EQU   ICTMLEP2                                                 01650000
@NM00218 EQU   ICTMLEP1                                                 01651000
ICTMDC   EQU   ICTMLEP1                                                 01652000
ICTMREFR EQU   ICTMLEP1                                                 01653000
ICTMOVLY EQU   ICTMLEP1                                                 01654000
ICTMSCTR EQU   ICTMLEP1                                                 01655000
ICTMREUS EQU   ICTMLEP1                                                 01656000
ICTMRENT EQU   ICTMLEP1                                                 01657000
ICTMAPF  EQU   ICTMLEP1                                                 01658000
@NM00217 EQU   ICTMFLG5                                                 01659000
ICTMNORL EQU   ICTMFLG5                                                 01660000
ICTMELCK EQU   ICTMFLG5                                                 01661000
ICTMCOPY EQU   ICTMFLG5                                                 01662000
ICTMPASS EQU   ICTMFLG5                                                 01663000
@NM00216 EQU   ICTMFLG4                                                 01664000
ICTMTSEL EQU   ICTMFLG4                                                 01665000
ICTMDSTE EQU   ICTMFLG4                                                 01666000
ICTMMIDE EQU   ICTMFLG4                                                 01667000
ICTMASOC EQU   ICTMFLG4                                                 01668000
ICTMSELM EQU   ICTMFLG4                                                 01669000
ICTMIDEL EQU   ICTMFLG4                                                 01670000
@NM00215 EQU   ICTMFLG3                                                 01671000
ICTMPRMS EQU   ICTMFLG3                                                 01672000
ICTMALIS EQU   ICTMFLG3                                                 01673000
ICTMWRK  EQU   ICTMFLG3                                                 01674000
ICTMTRX  EQU   ICTMFLG3                                                 01675000
ICTMRELF EQU   ICTMFLG3                                                 01676000
ICTLIBTX EQU   ICTMFLG3                                                 01677000
ICTLIBLK EQU   ICTMFLG3                                                 01678000
ICTMSRCU EQU   ICTMFLG1                                                 01679000
ICTMSRCR EQU   ICTMFLG1                                                 01680000
ICTMMACU EQU   ICTMFLG1                                                 01681000
ICTMMACR EQU   ICTMFLG1                                                 01682000
ICTMXPND EQU   ICTMFLG1                                                 01683000
ICTMZAP  EQU   ICTMFLG1                                                 01684000
ICTMASM  EQU   ICTMMODR                                                 01685000
ICTMMOD  EQU   ICTMMODR                                                 01686000
@NM00214 EQU   ICTMFLG2                                                 01687000
@NM00213 EQU   ICTMFLG2                                                 01688000
ICTMMIDU EQU   ICTMFLG2                                                 01689000
ICTMDEL  EQU   ICTMFLG2                                                 01690000
ICTMCPL  EQU   ICTMFLG2                                                 01691000
ICTMNOGO EQU   ICTMFLG2                                                 01692000
ICTMPROC EQU   ICTMFLG2                                                 01693000
ICTMEND  EQU   ICTMNAME                                                 01694000
@NM00212 EQU   ICTSBYNT+7                                               01695000
ICTSBYND EQU   ICTSBYNM                                                 01696000
ICTDELEX EQU   ICTDELST                                                 01697000
ICTDELND EQU   ICTDELNM                                                 01698000
@NM00211 EQU   ICTVRSNT+7                                               01699000
ICTVRSND EQU   ICTVRSNM                                                 01700000
@NM00210 EQU   ICTNPRNT+7                                               01701000
ICTNPRND EQU   ICTNPRNM                                                 01702000
@NM00209 EQU   ICTCSRST                                                 01703000
@NM00208 EQU   ICTCSRST                                                 01704000
ICTCSRF  EQU   ICTCSRST                                                 01705000
@NM00207 EQU   ICTCSRST                                                 01706000
ICTCSRNM EQU   ICTIRQNT+8                                               01707000
@NM00206 EQU   ICTIRQST                                                 01708000
ICTIREQT EQU   ICTIRQST                                                 01709000
ICTIREQI EQU   ICTIRQST                                                 01710000
ICTIREQB EQU   ICTIRQST                                                 01711000
ICTIREQS EQU   ICTIRQST                                                 01712000
@NM00205 EQU   ICTIRQST                                                 01713000
ICTIRQND EQU   ICTIRQNM                                                 01714000
@NM00204 EQU   ICTPREST                                                 01715000
ICTPREQT EQU   ICTPREST                                                 01716000
ICTPREQI EQU   ICTPREST                                                 01717000
ICTPREQB EQU   ICTPREST                                                 01718000
ICTPREQS EQU   ICTPREST                                                 01719000
@NM00203 EQU   ICTPREST                                                 01720000
ICTPREND EQU   ICTPRENM                                                 01721000
@NM00202 EQU   ICTSUPNT+7                                               01722000
ICTSUPND EQU   ICTSUPNM                                                 01723000
@NM00201 EQU   ICTREQST                                                 01724000
ICTRREQT EQU   ICTREQST                                                 01725000
ICTRREQI EQU   ICTREQST                                                 01726000
ICTRREQB EQU   ICTREQST                                                 01727000
ICTRREQS EQU   ICTREQST                                                 01728000
@NM00200 EQU   ICTREQST                                                 01729000
ICTREQND EQU   ICTREQNM                                                 01730000
@NM00199 EQU   ICTENTST                                                 01731000
ICTEREQT EQU   ICTENTST                                                 01732000
ICTEREQI EQU   ICTENTST                                                 01733000
ICTEREQB EQU   ICTENTST                                                 01734000
ICTEREQS EQU   ICTENTST                                                 01735000
@NM00198 EQU   ICTENTST                                                 01736000
ICTENTND EQU   ICTENTNM                                                 01737000
@NM00197 EQU   ICTPTF+100                                               01738000
ICTPTPFX EQU   ICTPTF+38                                                01739000
ICTPRELN EQU   ICTPTF+36                                                01740000
ICTPRECT EQU   ICTPTF+33                                                01741000
ICTPRECD EQU   ICTPTF+30                                                01742000
ICTPVERN EQU   ICTPTF+29                                                01743000
ICTPFMID EQU   ICTPTF+22                                                01744000
ICTPSUPN EQU   ICTPTF+20                                                01745000
ICTPONUM EQU   ICTPTF+18                                                01746000
ICTPUSR8 EQU   ICTPFLGA                                                 01747000
ICTPUSR7 EQU   ICTPFLGA                                                 01748000
ICTPUSR6 EQU   ICTPFLGA                                                 01749000
ICTPUSR5 EQU   ICTPFLGA                                                 01750000
ICTPUSR4 EQU   ICTPFLGA                                                 01751000
ICTPUSR3 EQU   ICTPFLGA                                                 01752000
ICTPUSR2 EQU   ICTPFLGA                                                 01753000
ICTPPASS EQU   ICTPUSR1                                                 01754000
@NM00196 EQU   @NM00195                                                 01755000
ICTPRQBY EQU   @NM00195                                                 01756000
ICTPRQOK EQU   @NM00195                                                 01757000
ICTPRQCK EQU   @NM00195                                                 01758000
@NM00194 EQU   ICTPFLG9                                                 01759000
ICTPPDEL EQU   ICTPFLG9                                                 01760000
ICTPWRKO EQU   ICTPFLG9                                                 01761000
ICTPMSL  EQU   ICTPFLG9                                                 01762000
@NM00193 EQU   ICTPFLG8                                                 01763000
ICTPDCPL EQU   ICTPFLG8                                                 01764000
ICTPGCPL EQU   ICTPFLG8                                                 01765000
@NM00192 EQU   ICTPFLG4                                                 01766000
@NM00191 EQU   ICTPFLG4                                                 01767000
@NM00190 EQU   ICTPFLG4                                                 01768000
ICTPDIMP EQU   ICTPFLG4                                                 01769000
ICTPDEXP EQU   ICTPFLG4                                                 01770000
ICTPREDO EQU   ICTPFLG4                                                 01771000
ICTPCDSE EQU   ICTPFLG4                                                 01772000
@NM00189 EQU   ICTPFLG2                                                 01773000
ICTPRCND EQU   ICTPFLG2                                                 01774000
ICTPTPS  EQU   ICTPFLG2                                                 01775000
ICTPTR1  EQU   ICTPFLG2                                                 01776000
ICTPVRSP EQU   ICTPFLG2                                                 01777000
@NM00188 EQU   ICTPFLG6                                                 01778000
ICTFLF   EQU   ICTPFLF                                                  01779000
ICTPDBYP EQU   ICTPFLG6                                                 01780000
ICTPSBYP EQU   ICTPFLG6                                                 01781000
ICTPMDLP EQU   ICTPFLG5+1                                               01782000
ICTPADDP EQU   ICTPFLG5+1                                               01783000
@NM00187 EQU   ICTPFLG5+1                                               01784000
ICTPLRFP EQU   ICTPFLG5                                                 01785000
ICTPJCLP EQU   ICTPFLG5                                                 01786000
ICTPSUPP EQU   ICTPFLG5                                                 01787000
ICTPREQP EQU   ICTPFLG5                                                 01788000
ICTPPREP EQU   ICTPFLG5                                                 01789000
ICTPNPRP EQU   ICTPFLG5                                                 01790000
ICTPIRQP EQU   ICTPFLG5                                                 01791000
ICTPDELP EQU   ICTPFLG5                                                 01792000
@NM00186 EQU   ICTPFLG3                                                 01793000
ICTPSLST EQU   ICTPFLG3                                                 01794000
ICTPNOLB EQU   ICTPFLG3                                                 01795000
ICTPVERJ EQU   ICTPFLG3                                                 01796000
ICTPCPL  EQU   ICTPFLG3                                                 01797000
ICTREGEN EQU   ICTPFLG1                                                 01798000
ICTBYP   EQU   ICTPFLG1                                                 01799000
ICTDUMMP EQU   ICTPFLG1                                                 01800000
@NM00185 EQU   ICTPFLG1                                                 01801000
ICTERROR EQU   ICTPFLG1                                                 01802000
ICTACC   EQU   ICTPFLG1                                                 01803000
ICTRES   EQU   ICTPFLG1                                                 01804000
ICTAPP   EQU   ICTPFLG1                                                 01805000
ICTLEN   EQU   ICTGMSPL+1                                               01806000
ICTSP    EQU   ICTGMSPL                                                 01807000
ICTLLEN  EQU   ICTLSPLN+1                                               01808000
ICTLSP   EQU   ICTLSPLN                                                 01809000
ICTMLEN  EQU   ICTMSPLN+1                                               01810000
ICTMSP   EQU   ICTMSPLN                                                 01811000
ICTPLEN  EQU   ICTPSPLN+1                                               01812000
ICTPSP   EQU   ICTPSPLN                                                 01813000
IOPBS04E EQU   IOPBS04+2                                                01814000
IOPBAPFC EQU   IOPBAPF+1                                                01815000
IOPBAPFL EQU   IOPBAPF                                                  01816000
IOPBS2NM EQU   IOPBS02+3                                                01817000
IOPBS2EP EQU   IOPBS02                                                  01818000
IOPQSMTP EQU   IOPQSMLS+8                                               01819000
@NM00170 EQU   IOPQSMLS+7                                               01820000
IOPQSMND EQU   IOPQSMNM                                                 01821000
@NM00169 EQU   @NM00168+7                                               01822000
IOPQSMFM EQU   @NM00168                                                 01823000
@NM00088 EQU   IOPLMCTL+17                                              01824000
IOPLMCRD EQU   IOPLMCTL+9                                               01825000
IOPLMCRN EQU   IOPLMCTL+1                                               01826000
IOPLMCC  EQU   IOPLMCTL                                                 01827000
@NM00063 EQU   IOPUSERL                                                 01828000
@NM00062 EQU   IOPUSERL                                                 01829000
IOPALIS  EQU   IOPUSERL                                                 01830000
IOPTTR   EQU   IOPDRMAP+8                                               01831000
IOPINAM2 EQU   IOPINAM+1                                                01832000
IOPITYP2 EQU   IOPITYP                                                  01833000
@NM00061 EQU   HMASMIOP+32                                              01834000
IOPDELDD EQU   IOPDDNAM                                                 01835000
@NM00060 EQU   @NM00057+10                                              01836000
IOPSEQNO EQU   @NM00057+8                                               01837000
@NM00059 EQU   @NM00058+7                                               01838000
IOPPTFNM EQU   @NM00058                                                 01839000
IOPNAM17 EQU   IOPNAME                                                  01840000
IOPTYPE  EQU   HMASMIOP+3                                               01841000
IOPRETRN EQU   HMASMIOP+2                                               01842000
IOPFUNCT EQU   HMASMIOP+1                                               01843000
IOPDSID  EQU   HMASMIOP                                                 01844000
CCABMREC EQU   CCABELMT+10                                              01845000
CCABPOS  EQU   CCABMPOS+8                                               01846000
CCABNAME EQU   CCABMPOS                                                 01847000
@NM00056 EQU   CCABLDLM+2                                               01848000
@NM00055 EQU   CCABLDLM                                                 01849000
CCAUPDPM EQU   @NM00053+24                                              01850000
@NM00054 EQU   @NM00053+21                                              01851000
CCARUPDT EQU   CCAUPDRC                                                 01852000
CCAUPDSP EQU   @NM00053+12                                              01853000
CCAUPDTE EQU   @NM00053+8                                               01854000
CCAUPDNM EQU   @NM00053                                                 01855000
CCASUPPM EQU   @NM00051+24                                              01856000
@NM00052 EQU   @NM00051+21                                              01857000
CCARSUP  EQU   CCASUPRC                                                 01858000
CCASUPSP EQU   @NM00051+12                                              01859000
CCAIOSUP EQU   @NM00051+8                                               01860000
CCASUPNM EQU   @NM00051                                                 01861000
CCAZAPPM EQU   @NM00049+24                                              01862000
@NM00050 EQU   @NM00049+21                                              01863000
CCARZAP  EQU   CCAZAPRC                                                 01864000
CCAZAPSP EQU   @NM00049+12                                              01865000
CCASPZAP EQU   @NM00049+8                                               01866000
CCAZAPNM EQU   @NM00049                                                 01867000
CCACOMPM EQU   @NM00047+24                                              01868000
@NM00048 EQU   @NM00047+21                                              01869000
CCARCOMP EQU   CCACOMRC                                                 01870000
CCACOMSP EQU   @NM00047+12                                              01871000
CCACOMRS EQU   @NM00047+8                                               01872000
CCACOMNM EQU   @NM00047                                                 01873000
CCACPYPM EQU   @NM00045+24                                              01874000
@NM00046 EQU   @NM00045+21                                              01875000
CCARCOPY EQU   CCACPYRC                                                 01876000
CCACPYSP EQU   @NM00045+12                                              01877000
CCACOPY  EQU   @NM00045+8                                               01878000
CCACPYNM EQU   @NM00045                                                 01879000
CCAASMPM EQU   @NM00043+24                                              01880000
@NM00044 EQU   @NM00043+21                                              01881000
CCARASM  EQU   CCAASMRC                                                 01882000
CCAASMSP EQU   @NM00043+12                                              01883000
CCAASM   EQU   @NM00043+8                                               01884000
CCAASMNM EQU   @NM00043                                                 01885000
CCALKDPM EQU   @NM00041+24                                              01886000
@NM00042 EQU   @NM00041+21                                              01887000
CCARLINK EQU   CCALKDRC                                                 01888000
CCALKDSP EQU   @NM00041+12                                              01889000
CCALKED  EQU   @NM00041+8                                               01890000
CCALKDNM EQU   @NM00041                                                 01891000
CCAPGMPM EQU   @NM00039+24                                              01892000
@NM00040 EQU   @NM00039+21                                              01893000
CCABPGRC EQU   @NM00039+20                                              01894000
CCABPGSP EQU   @NM00039+12                                              01895000
CCABPGAD EQU   @NM00039+8                                               01896000
CCABPGNM EQU   @NM00039                                                 01897000
CCAEND   EQU   HMASMCCA+371                                             01898000
@NM00038 EQU   HMASMCCA+309                                             01899000
CCACURDD EQU   CCAFDSNG+3                                               01900000
CCACURDS EQU   CCAFDSNG+2                                               01901000
@NM00037 EQU   CCAFLAGB                                                 01902000
CCAOUTNG EQU   CCAFLAGB                                                 01903000
CCALOGNG EQU   CCAFLAGB                                                 01904000
CCAFMID  EQU   HMASMCCA+291                                             01905000
CCALSTDS EQU   CCAFCTL+8                                                01906000
CCARPTDS EQU   CCAFCTL+7                                                01907000
CCATIME  EQU   CCAFCTL+4                                                01908000
CCADATE  EQU   CCAFCTL+1                                                01909000
@NM00036 EQU   CCAFLAG9                                                 01910000
CCARVCAN EQU   CCAFLAG9                                                 01911000
CCARVEST EQU   CCAFLAG9                                                 01912000
CCAPTSNJ EQU   CCAFLAG9                                                 01913000
CCASTSNP EQU   CCAFLAG9                                                 01914000
CCAMTSNP EQU   CCAFLAG9                                                 01915000
CCAPTSNP EQU   CCAFLAG9                                                 01916000
@NM00035 EQU   CCAFLAG8                                                 01917000
CCAACDSC EQU   CCAFLAG8                                                 01918000
CCACDSC  EQU   CCAFLAG8                                                 01919000
@NM00034 EQU   CCAFLAG6                                                 01920000
CCAACRUP EQU   CCAFLAG6                                                 01921000
CCACRQUP EQU   CCAFLAG6                                                 01922000
CCAACDUP EQU   CCAFLAG6                                                 01923000
CCACDSUP EQU   CCAFLAG6                                                 01924000
@NM00033 EQU   CCAFLAG5                                                 01925000
CCAACROS EQU   CCAFLAG5                                                 01926000
CCACRQOS EQU   CCAFLAG5                                                 01927000
CCAACDOS EQU   CCAFLAG5                                                 01928000
CCACDSOS EQU   CCAFLAG5                                                 01929000
@NM00032 EQU   CCAFLAG4                                                 01930000
CCAACRIS EQU   CCAFLAG4                                                 01931000
CCACRQIS EQU   CCAFLAG4                                                 01932000
CCAACDIS EQU   CCAFLAG4                                                 01933000
CCACDSIS EQU   CCAFLAG4                                                 01934000
@NM00031 EQU   CCAFLAG3+1                                               01935000
CCARGNP  EQU   CCAFLAG3+1                                               01936000
CCADISRQ EQU   CCAFLAG3+1                                               01937000
CCAICTOK EQU   CCAFLAG3                                                 01938000
CCADELP  EQU   CCAFLAG3                                                 01939000
CCACMPRS EQU   CCAFLAG3                                                 01940000
CCAZAPP  EQU   CCAFLAG3                                                 01941000
CCALINKP EQU   CCAFLAG3                                                 01942000
CCACOPYP EQU   CCAFLAG3                                                 01943000
CCAASIP  EQU   CCAFLAG3                                                 01944000
CCAUPDP  EQU   CCAFLAG3                                                 01945000
CCAEOSMP EQU   CCAFLAG2                                                 01946000
CCAEOFNC EQU   CCAFLAG2                                                 01947000
@NM00030 EQU   CCAFLAG2                                                 01948000
CCACHECK EQU   CCAFLAG2                                                 01949000
CCATERM  EQU   CCAFLAG2                                                 01950000
CCASVCLB EQU   CCAFLAG2                                                 01951000
@NM00029 EQU   CCAFLAG1+1                                               01952000
CCAUNL   EQU   CCAFLAG1+1                                               01953000
CCARESET EQU   CCAFLAG1+1                                               01954000
CCALOG   EQU   CCAFLAG1+1                                               01955000
CCACNV   EQU   CCAFLAG1+1                                               01956000
CCALIST  EQU   CCAFLAG1                                                 01957000
CCAUPDU  EQU   CCAFLAG1                                                 01958000
CCAUPDJ  EQU   CCAFLAG1                                                 01959000
CCARES   EQU   CCAFLAG1                                                 01960000
CCAREJ   EQU   CCAFLAG1                                                 01961000
CCAACCPT EQU   CCAFLAG1                                                 01962000
CCAAPPLY EQU   CCAFLAG1                                                 01963000
CCAREC   EQU   CCAFLAG1                                                 01964000
@NM00028 EQU   @NM00023+18                                              01965000
@NM00027 EQU   @NM00023+16                                              01966000
CCATBLPA EQU   @NM00023+12                                              01967000
@NM00026 EQU   @NM00023+8                                               01968000
@NM00025 EQU   @NM00023+4                                               01969000
@NM00024 EQU   @NM00023                                                 01970000
CCAIFGTP EQU   CCAFGTP+16                                               01971000
CCAGTP3  EQU   CCAFGTP+12                                               01972000
CCAGTP2  EQU   CCAFGTP+8                                                01973000
CCAGTP1  EQU   CCAFGTP+4                                                01974000
CCASETAD EQU   CCASEGTP                                                 01975000
CCACLST  EQU   CCAFPGM+12                                               01976000
CCASPDCB EQU   CCAFPGM+8                                                01977000
CCARVAD  EQU   CCAFSTA                                                  01978000
CCAACDID EQU   CCAFSYS+32                                               01979000
CCACDSID EQU   CCAFSYS+24                                               01980000
CCALNLEN EQU   CCAFSYS+22                                               01981000
@NM00022 EQU   CCAFLAGA                                                 01982000
CCAPSYSF EQU   CCAFLAGA                                                 01983000
CCAASYSF EQU   CCAFLAGA                                                 01984000
CCACSYSF EQU   CCAFLAGA                                                 01985000
CCANUCID EQU   CCAFSYS+20                                               01986000
CCAASREL EQU   CCAFSYS+16                                               01987000
CCACSREL EQU   CCASREL                                                  01988000
CCAPEMAX EQU   CCAFSYS+10                                               01989000
CCAPGLEN EQU   CCAFSYS+8                                                01990000
CCAIOPAS EQU   CCAFSYS+4                                                01991000
CCAIOPCS EQU   CCAFSYS                                                  01992000
CCAPESIZ EQU   CCAFIOP+4                                                01993000
CCAIOPTR EQU   CCAFIOP                                                  01994000
@NM00021 EQU   CCAFLAG7+3                                               01995000
CCALOGP  EQU   CCAFLAG7+2                                               01996000
CCAOUTP  EQU   CCAFLAG7+2                                               01997000
CCASLBP  EQU   CCAFLAG7+2                                               01998000
CCARPTP  EQU   CCAFLAG7+2                                               01999000
CCALISTP EQU   CCAFLAG7+2                                               02000000
CCAJCLP  EQU   CCAFLAG7+2                                               02001000
CCAPTFP  EQU   CCAFLAG7+2                                               02002000
CCATLBP  EQU   CCAFLAG7+2                                               02003000
CCAUT3P  EQU   CCAFLAG7+1                                               02004000
CCAUT2P  EQU   CCAFLAG7+1                                               02005000
CCAUT1P  EQU   CCAFLAG7+1                                               02006000
CCAWK5P  EQU   CCAFLAG7+1                                               02007000
CCAWK4P  EQU   CCAFLAG7+1                                               02008000
CCAWK3P  EQU   CCAFLAG7+1                                               02009000
CCAWK2P  EQU   CCAFLAG7+1                                               02010000
CCAWK1P  EQU   CCAFLAG7+1                                               02011000
CCAACRQP EQU   CCAFLAG7                                                 02012000
CCACRQP  EQU   CCAFLAG7                                                 02013000
CCASTSP  EQU   CCAFLAG7                                                 02014000
CCAMTSP  EQU   CCAFLAG7                                                 02015000
CCAPTSP  EQU   CCAFLAG7                                                 02016000
CCASCDSP EQU   CCAFLAG7                                                 02017000
CCAACDSP EQU   CCAFLAG7                                                 02018000
CCACDSP  EQU   CCAFLAG7                                                 02019000
@NM00020 EQU   CCAFBUFR+122                                             02020000
@NM00019 EQU   CCAFBUFR+120                                             02021000
@NM00018 EQU   CCAFBUFR+118                                             02022000
CCATBFMX EQU   CCAFBUFR+116                                             02023000
CCA4BFMX EQU   CCAFBUFR+114                                             02024000
CCA3BFMX EQU   CCAFBUFR+112                                             02025000
CCA2BFMX EQU   CCAFBUFR+110                                             02026000
CCA1BFMX EQU   CCAFBUFR+108                                             02027000
CCAXBFMX EQU   CCAFBUFR+106                                             02028000
CCAQBFMX EQU   CCAFBUFR+104                                             02029000
CCASBFMX EQU   CCAFBUFR+102                                             02030000
CCAMBFMX EQU   CCAFBUFR+100                                             02031000
CCAPBFMX EQU   CCAFBUFR+98                                              02032000
CCAVBFMX EQU   CCAFBUFR+96                                              02033000
CCAABFMX EQU   CCAFBUFR+94                                              02034000
CCACBFMX EQU   CCAFBUFR+92                                              02035000
@NM00017 EQU   CCAFBUFR+88                                              02036000
@NM00016 EQU   CCAFBUFR+84                                              02037000
CCA4BFSZ EQU   CCAFBUFR+80                                              02038000
CCATBFSZ EQU   CCAFBUFR+76                                              02039000
CCAWBFSZ EQU   CCAFBUFR+72                                              02040000
CCAQBFSZ EQU   CCAFBUFR+68                                              02041000
CCAPBFSZ EQU   CCAFBUFR+64                                              02042000
CCAVBFSZ EQU   CCAFBUFR+60                                              02043000
CCACBFSZ EQU   CCAFBUFR+56                                              02044000
@NM00015 EQU   CCAFBUFR+52                                              02045000
CCA4BFOA EQU   CCAFBUFR+48                                              02046000
CCA4BFIA EQU   CCAFBUFR+44                                              02047000
CCATBFIA EQU   CCAFBUFR+40                                              02048000
CCAWBFOA EQU   CCAFBUFR+36                                              02049000
CCAWBFIA EQU   CCAFBUFR+32                                              02050000
CCAQBFOA EQU   CCAFBUFR+28                                              02051000
CCAQBFIA EQU   CCAFBUFR+24                                              02052000
CCAPBFOA EQU   CCAFBUFR+20                                              02053000
CCAPBFIA EQU   CCAFBUFR+16                                              02054000
CCAVBFOA EQU   CCAFBUFR+12                                              02055000
CCAVBFIA EQU   CCAFBUFR+8                                               02056000
CCACBFOA EQU   CCAFBUFR+4                                               02057000
CCACBFIA EQU   CCAFBUFR                                                 02058000
CCAID    EQU   HMASMCCA                                                 02059000
@NM00014 EQU   TBLFLG5                                                  02060000
TBLICTOK EQU   TBLFLG5                                                  02061000
@NM00013 EQU   TBLFLG4                                                  02062000
TBLBPFM  EQU   TBLFLG4                                                  02063000
@NM00012 EQU   TBLFLG4                                                  02064000
TBLBPIRQ EQU   TBLFLG4                                                  02065000
TBLBPREQ EQU   TBLFLG4                                                  02066000
TBLBPPRE EQU   TBLFLG4                                                  02067000
TBLBPID  EQU   TBLFLG4                                                  02068000
@NM00011 EQU   TBLFLG3+1                                                02069000
TBLSTS   EQU   TBLFLG3                                                  02070000
TBLMTS   EQU   TBLFLG3                                                  02071000
TBLPTS   EQU   TBLFLG3                                                  02072000
TBLACRQ  EQU   TBLFLG3                                                  02073000
TBLCRQ   EQU   TBLFLG3                                                  02074000
TBLSCDS  EQU   TBLFLG3                                                  02075000
TBLACDS  EQU   TBLFLG3                                                  02076000
TBLCDS   EQU   TBLFLG3                                                  02077000
TBLMASS  EQU   TBLFLG2                                                  02078000
@NM00010 EQU   TBLFLG2                                                  02079000
TBLFMID  EQU   TBLFLG2                                                  02080000
TBLGROUP EQU   TBLFLG2                                                  02081000
TBLEXC   EQU   TBLFLG2                                                  02082000
TBLSEL   EQU   TBLFLG2                                                  02083000
@NM00009 EQU   TBLFLG1+1                                                02084000
TBLDISW  EQU   TBLFLG1+1                                                02085000
TBLDISR  EQU   TBLFLG1+1                                                02086000
TBLDISN  EQU   TBLFLG1+1                                                02087000
TBLNOJCL EQU   TBLFLG1                                                  02088000
TBLFLUSH EQU   TBLFLG1                                                  02089000
TBLUSER  EQU   TBLFLG1                                                  02090000
TBLAPAR  EQU   TBLFLG1                                                  02091000
TBLCOMP  EQU   TBLFLG1                                                  02092000
TBLASSEM EQU   TBLFLG1                                                  02093000
TBLCHECK EQU   TBLFLG1                                                  02094000
TBLNOAPP EQU   TBLFLG1                                                  02095000
@NM00008 EQU   TBLXOPTS+5                                               02096000
TBLNUCID EQU   TBLXOPTS+4                                               02097000
TBLJCLGT EQU   TBLXOPTS                                                 02098000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02099000
@ENDDATA EQU   *                                                        02100000
         END   HMASMTDD,(C'PLS2137',0802,78334)                         02101000
