         TITLE 'HMASMDR2 REWRITE INSTORAGE DIRECTORIES'                 00001000
HMASMDR2 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'HMASMDR2  78.334'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         ST    @13,@SA00001+4                                      0001 00013000
         LA    @14,@SA00001                                        0001 00014000
         ST    @14,8(,@13)                                         0001 00015000
         LR    @13,@14                                             0001 00016000
         MVC   @PC00001(12),0(@01)                                 0001 00017000
*   IOPPTR=CCAIOPTR;                /*                               */ 00018000
         L     IOPPTR,CCAIOPTR(,CCAPTR)                            0138 00019000
*   DR2RTNCD=ZERO;                  /*                               */ 00020000
         SLR   DR2RTNCD,DR2RTNCD                                   0139 00021000
*   DR2SW=''B;                      /*                               */ 00022000
         MVI   DR2SW,X'00'                                         0140 00023000
*   HMASMMGP=''B;                   /* ZERO MGP THEN                 */ 00024000
         XC    HMASMMGP(16),HMASMMGP                               0141 00025000
*   MGPPRINT=ON;                    /* SET TO WRITE MSG TO SMPOUT    */ 00026000
*   MGPHLDS=ON;                     /* AND LOG                       */ 00027000
*                                                                  0143 00028000
         OI    MGPPRINT,B'10010000'                                0143 00029000
*   /*****************************************************************/ 00030000
*   /*                                                               */ 00031000
*   /* DETERMINE WHETHER THE DIS FILE SHOULD BE REWRITTEN OR FREED   */ 00032000
*   /*                                                               */ 00033000
*   /*****************************************************************/ 00034000
*                                                                  0144 00035000
*   IF CCAUPDJ=ON                   /* IF JCLIN FUNCTION             */ 00036000
*       &SAVECODE>=STOPPTF          /* AND RETURN CODE IS STOPPTF    */ 00037000
*     THEN                          /* OR GREATER THEN DO NOT REWRITE*/ 00038000
         TM    CCAUPDJ(CCAPTR),B'00000100'                         0144 00039000
         BNO   @RF00144                                            0144 00040000
         L     @10,@PC00001+8                                      0144 00041000
         L     @10,SAVECODE(,@10)                                  0144 00042000
         CH    @10,@CH00061                                        0144 00043000
         BL    @RF00144                                            0144 00044000
*     DR2FUNCT=IOPFREE;             /* DIS. JUST FREE IT.            */ 00045000
         LA    DR2FUNCT,9                                          0145 00046000
*   ELSE                            /* FOR ALL OTHER FUNCTION AND    */ 00047000
*     DR2FUNCT=IOPWRDIR;            /* SUCCESSFULL JCLIN REWRITE THE    00048000
*                                      INSTORAGE DIRECTORY           */ 00049000
*                                                                  0146 00050000
         B     @RC00144                                            0146 00051000
@RF00144 LA    DR2FUNCT,89                                         0146 00052000
*   /*****************************************************************/ 00053000
*   /*                                                               */ 00054000
*   /* REMEMBER IF JCLIN BEING RUN                                   */ 00055000
*   /*                                                               */ 00056000
*   /*****************************************************************/ 00057000
*                                                                  0147 00058000
*   FJCLIN=OFF;                     /*                               */ 00059000
@RC00144 NI    FJCLIN,B'01111111'                                  0147 00060000
*   IF CCAUPDJ=ON                   /*                               */ 00061000
*     THEN                          /*                               */ 00062000
         TM    CCAUPDJ(CCAPTR),B'00000100'                         0148 00063000
         BNO   @RF00148                                            0148 00064000
*     FJCLIN=ON;                    /*                               */ 00065000
         OI    FJCLIN,B'10000000'                                  0149 00066000
         EJECT                                                          00067000
*                                                                  0150 00068000
*   /*****************************************************************/ 00069000
*   /*                                                               */ 00070000
*   /* IF CDS UPDATED IN STORAGE THEN PROCESS IT BY SETTING SYSTEM   */ 00071000
*   /* ENTRY INDICATOR IR REWRITE TO BE DONE, DO REWRITE OR FREE,    */ 00072000
*   /* RESET SYSTEM ENTRY ERROR INDICATOR, AND ISSUE MESSAGE         */ 00073000
*   /*                                                               */ 00074000
*   /*****************************************************************/ 00075000
*                                                                  0150 00076000
*   IF CCACDSOS=ON                  /* CDS IN STORAGE FOR UPDATE     */ 00077000
*     THEN                          /*                               */ 00078000
@RF00148 TM    CCACDSOS(CCAPTR),B'10000000'                        0150 00079000
         BNO   @RF00150                                            0150 00080000
*     DO;                           /*                               */ 00081000
*       IF DR2FUNCT=IOPWRDIR        /* IF DIRECTORY REWRITE          */ 00082000
*           &CCACSYSF=ON            /* AND SYSTEM ENTRY FOUND        */ 00083000
*           &CCACDSUP=ON            /* AND HAS BEEN UPDATED          */ 00084000
*         THEN                      /*                               */ 00085000
         CH    DR2FUNCT,@CH00632                                   0152 00086000
         BNE   @RF00152                                            0152 00087000
         TM    CCACSYSF(CCAPTR),B'10000000'                        0152 00088000
         BNO   @RF00152                                            0152 00089000
         TM    CCACDSUP(CCAPTR),B'10000000'                        0152 00090000
         BNO   @RF00152                                            0152 00091000
*         DO;                       /*                               */ 00092000
*           HMASMIOP=CCAIOPCS->HMASMIOP;/*                           */ 00093000
         L     @10,CCAIOPCS(,CCAPTR)                               0154 00094000
         MVC   HMASMIOP(68,IOPPTR),HMASMIOP(@10)                   0154 00095000
*           IOPCDMAP=CCAIOPCS->IOPCDMAP;/*                           */ 00096000
         MVC   IOPCDMAP(36,IOPPTR),IOPCDMAP(@10)                   0155 00097000
*           IOPFUNCT=IOPLOC;        /*                               */ 00098000
         MVI   IOPFUNCT(IOPPTR),X'03'                              0156 00099000
*           CALL HMASMIO(HMASMIOP); /*                               */ 00100000
         ST    IOPPTR,@AL00001                                     0157 00101000
         L     @15,@CV01343                                        0157 00102000
         LA    @01,@AL00001                                        0157 00103000
         BALR  @14,@15                                             0157 00104000
*           IF IOPRETRN=IOPGOOD     /*                               */ 00105000
*             THEN                  /*                               */ 00106000
         CLI   IOPRETRN(IOPPTR),0                                  0158 00107000
         BNE   @RF00158                                            0158 00108000
*             DO;                   /*                               */ 00109000
*               CCACDSOS=OFF;       /* UPDATE ACTUAL CDS             */ 00110000
         NI    CCACDSOS(CCAPTR),B'01111111'                        0160 00111000
*               IOPFUNCT=IOPSTOWR;  /*                               */ 00112000
         MVI   IOPFUNCT(IOPPTR),X'54'                              0161 00113000
*               IOPSYNG=ON;         /*                               */ 00114000
         OI    IOPSYNG(IOPPTR),B'00010000'                         0162 00115000
*               CALL HMASMIO(HMASMIOP);/* RESTOW CDS SYSTEM ENTRY    */ 00116000
         ST    IOPPTR,@AL00001                                     0163 00117000
         L     @15,@CV01343                                        0163 00118000
         LA    @01,@AL00001                                        0163 00119000
         BALR  @14,@15                                             0163 00120000
*               CCACDSOS=ON;        /*                               */ 00121000
         OI    CCACDSOS(CCAPTR),B'10000000'                        0164 00122000
*               CCAIOPCS->IOPCDMAP=IOPCDMAP;/*                       */ 00123000
         L     @10,CCAIOPCS(,CCAPTR)                               0165 00124000
         MVC   IOPCDMAP(36,@10),IOPCDMAP(IOPPTR)                   0165 00125000
*             END;                  /*                               */ 00126000
*           DR2RTNCD=MAX(DR2RTNCD,IOPRETRN);/*                       */ 00127000
@RF00158 SLR   @10,@10                                             0167 00128000
         IC    @10,IOPRETRN(,IOPPTR)                               0167 00129000
         CR    DR2RTNCD,@10                                        0167 00130000
         BNL   *+6                                                      00131000
         LR    DR2RTNCD,@10                                        0167 00132000
*         END;                      /*                               */ 00133000
*       IF DR2RTNCD=ZERO            /*                               */ 00134000
*           &CCACDSUP=ON            /* AND HAS BEEN UPDATED          */ 00135000
*         THEN                      /*                               */ 00136000
@RF00152 CH    DR2RTNCD,@CH00353                                   0169 00137000
         BNE   @RF00169                                            0169 00138000
         TM    CCACDSUP(CCAPTR),B'10000000'                        0169 00139000
         BNO   @RF00169                                            0169 00140000
*         DO;                       /*                               */ 00141000
*           IOPFUNCT=DR2FUNCT;      /* WRITE OR FREE                 */ 00142000
         STC   DR2FUNCT,IOPFUNCT(,IOPPTR)                          0171 00143000
*           IOPDSID=IOPCDS;         /* CDS DIS                       */ 00144000
         MVI   IOPDSID(IOPPTR),X'02'                               0172 00145000
*           CALL HMASMIO(HMASMIOP); /* CALL HMASMIO TO EITHER FREE OR   00146000
*                                      REWRITE CDS DIRECTORY.      0173 00147000
*                                      FUNCTION ALREADY SET UP IN  0173 00148000
*                                      PREVIOUS ROUTINE              */ 00149000
         ST    IOPPTR,@AL00001                                     0173 00150000
         L     @15,@CV01343                                        0173 00151000
         LA    @01,@AL00001                                        0173 00152000
         BALR  @14,@15                                             0173 00153000
*           DR2RTNCD=MAX(DR2RTNCD,IOPRETRN);/* SAVE RETURN CODE      */ 00154000
         SLR   @10,@10                                             0174 00155000
         IC    @10,IOPRETRN(,IOPPTR)                               0174 00156000
         CR    DR2RTNCD,@10                                        0174 00157000
         BNL   *+6                                                      00158000
         LR    DR2RTNCD,@10                                        0174 00159000
*         END;                      /*                               */ 00160000
*       CCACDSOS=OFF;               /* UPDATE ACTUAL CDS             */ 00161000
*                                                                  0176 00162000
@RF00169 NI    CCACDSOS(CCAPTR),B'01111111'                        0176 00163000
*       /*************************************************************/ 00164000
*       /*                                                           */ 00165000
*       /* IF DIRECTORY REWRITE OK THEN RESET SYSTEM ENTRY INDICATOR */ 00166000
*       /*                                                           */ 00167000
*       /*************************************************************/ 00168000
*                                                                  0177 00169000
*       IF DR2FUNCT=IOPWRDIR        /* IF DIRECTORY REWRITE          */ 00170000
*           &CCACSYSF=ON            /* AND SYSTEM ENTRY FOUND        */ 00171000
*           &DR2RTNCD=ZERO          /*                               */ 00172000
*         THEN                      /*                               */ 00173000
         CH    DR2FUNCT,@CH00632                                   0177 00174000
         BNE   @RF00177                                            0177 00175000
         TM    CCACSYSF(CCAPTR),B'10000000'                        0177 00176000
         BNO   @RF00177                                            0177 00177000
         CH    DR2RTNCD,@CH00353                                   0177 00178000
         BNE   @RF00177                                            0177 00179000
*         DO;                       /*                               */ 00180000
*           RFY                                                    0179 00181000
*             HMASMIOP BASED(CCAIOPCS);/*                            */ 00182000
*           CCAUPDJ=OFF;            /* SET SO MSG WILL GO TO LOG     */ 00183000
         NI    CCAUPDJ(CCAPTR),B'11111011'                         0180 00184000
*           IOPFUNCT=IOPUDEO;       /*                               */ 00185000
         L     @10,CCAIOPCS(,CCAPTR)                               0181 00186000
         MVI   IOPFUNCT(@10),X'56'                                 0181 00187000
*           IOPSYNG=OFF;            /*                               */ 00188000
*           IOPSYDL=OFF;            /*                               */ 00189000
         NI    IOPSYNG(@10),B'11001111'                            0183 00190000
*           CALL HMASMIO(HMASMIOP); /* RESTOW CDS SYSTEM ENTRY       */ 00191000
         ST    @10,@AL00001                                        0184 00192000
         L     @15,@CV01343                                        0184 00193000
         LA    @01,@AL00001                                        0184 00194000
         BALR  @14,@15                                             0184 00195000
*           DR2RTNCD=MAX(DR2RTNCD,IOPRETRN);/*                       */ 00196000
         L     @10,CCAIOPCS(,CCAPTR)                               0185 00197000
         SLR   @05,@05                                             0185 00198000
         IC    @05,IOPRETRN(,@10)                                  0185 00199000
         CR    DR2RTNCD,@05                                        0185 00200000
         BNL   *+6                                                      00201000
         LR    DR2RTNCD,@05                                        0185 00202000
*           RFY                                                    0186 00203000
*             HMASMIOP BASED(IOPPTR);/*                              */ 00204000
*           IF FJCLIN=ON            /*                               */ 00205000
*             THEN                  /*                               */ 00206000
         TM    FJCLIN,B'10000000'                                  0187 00207000
         BNO   @RF00187                                            0187 00208000
*             CCAUPDJ=ON;           /*                               */ 00209000
         OI    CCAUPDJ(CCAPTR),B'00000100'                         0188 00210000
*         END;                      /*                               */ 00211000
*                                                                  0189 00212000
@RF00187 DS    0H                                                  0190 00213000
*       /*************************************************************/ 00214000
*       /*                                                           */ 00215000
*       /* IF DIRECTORY REWRITE OK THEN ISSUE MESSAGE                */ 00216000
*       /*                                                           */ 00217000
*       /*************************************************************/ 00218000
*                                                                  0190 00219000
*       IF DR2RTNCD=ZERO            /*                               */ 00220000
*           &DR2FUNCT=IOPWRDIR      /*                               */ 00221000
*         THEN                      /*                               */ 00222000
@RF00177 CH    DR2RTNCD,@CH00353                                   0190 00223000
         BNE   @RF00190                                            0190 00224000
         CH    DR2FUNCT,@CH00632                                   0190 00225000
         BNE   @RF00190                                            0190 00226000
*         DO;                       /*                               */ 00227000
*           MGPCLEAR=''B;           /*                               */ 00228000
         XC    MGPCLEAR(6),MGPCLEAR                                0192 00229000
*           MGPMGNO1=HMA368I;       /* XXXXXXXX IN STORAGE DIRECTORY    00230000
*                                      SUCCESSFULLY REWRITTEN        */ 00231000
         MVC   MGPMGNO1(2),@CH01166                                0193 00232000
*           MGPVARPT(1)=ADDR(TXTCDS);/*                              */ 00233000
         LA    @10,@CC01347                                        0194 00234000
         ST    @10,MGPVARPT                                        0194 00235000
*           MGPTYPE=MGPINFO;        /*                               */ 00236000
         MVI   MGPTYPE,X'01'                                       0195 00237000
*           CALL HMASMMSG(HMASMMGP);/*                               */ 00238000
         L     @15,@CV01344                                        0196 00239000
         LA    @01,@AL00196                                        0196 00240000
         BALR  @14,@15                                             0196 00241000
*         END;                      /*                               */ 00242000
*     END;                          /*                               */ 00243000
@RF00190 DS    0H                                                  0199 00244000
         EJECT                                                          00245000
*                                                                  0199 00246000
*   /*****************************************************************/ 00247000
*   /*                                                               */ 00248000
*   /* IF ACDS UPDATED IN STORAGE THEN PROCESS IT BY SETTING SYSTEM  */ 00249000
*   /* ENTRY INDICATOR IR REWRITE TO BE DONE, DO REWRITE OR FREE,    */ 00250000
*   /* RESET SYSTEM ENTRY ERROR INDICATOR, AND ISSUE MESSAGE         */ 00251000
*   /*                                                               */ 00252000
*   /*****************************************************************/ 00253000
*                                                                  0199 00254000
*   IF CCAACDOS=ON                  /* ACDS IN STORAGE FOR UPDATE    */ 00255000
*     THEN                          /*                               */ 00256000
@RF00150 TM    CCAACDOS(CCAPTR),B'01000000'                        0199 00257000
         BNO   @RF00199                                            0199 00258000
*     DO;                           /*                               */ 00259000
*       IF DR2FUNCT=IOPWRDIR        /* IF DIRECTORY REWRITE          */ 00260000
*           &CCAASYSF=ON            /* AND SYSTEM ENTRY FOUND        */ 00261000
*           &CCAACDUP=ON            /* AND HAS BEEN UPDATED          */ 00262000
*         THEN                      /*                               */ 00263000
         CH    DR2FUNCT,@CH00632                                   0201 00264000
         BNE   @RF00201                                            0201 00265000
         TM    CCAASYSF(CCAPTR),B'01000000'                        0201 00266000
         BNO   @RF00201                                            0201 00267000
         TM    CCAACDUP(CCAPTR),B'01000000'                        0201 00268000
         BNO   @RF00201                                            0201 00269000
*         DO;                       /*                               */ 00270000
*           HMASMIOP=CCAIOPAS->HMASMIOP;/*                           */ 00271000
         L     @10,CCAIOPAS(,CCAPTR)                               0203 00272000
         MVC   HMASMIOP(68,IOPPTR),HMASMIOP(@10)                   0203 00273000
*           IOPCDMAP=CCAIOPAS->IOPCDMAP;/*                           */ 00274000
         MVC   IOPCDMAP(36,IOPPTR),IOPCDMAP(@10)                   0204 00275000
*           IOPFUNCT=IOPLOC;        /*                               */ 00276000
         MVI   IOPFUNCT(IOPPTR),X'03'                              0205 00277000
*           CALL HMASMIO(HMASMIOP); /*                               */ 00278000
         ST    IOPPTR,@AL00001                                     0206 00279000
         L     @15,@CV01343                                        0206 00280000
         LA    @01,@AL00001                                        0206 00281000
         BALR  @14,@15                                             0206 00282000
*           IF IOPRETRN=IOPGOOD     /*                               */ 00283000
*             THEN                  /*                               */ 00284000
         CLI   IOPRETRN(IOPPTR),0                                  0207 00285000
         BNE   @RF00207                                            0207 00286000
*             DO;                   /*                               */ 00287000
*               CCAACDOS=OFF;       /* UPDATE ACTUAL ACDS            */ 00288000
         NI    CCAACDOS(CCAPTR),B'10111111'                        0209 00289000
*               IOPFUNCT=IOPSTOWR;  /*                               */ 00290000
         MVI   IOPFUNCT(IOPPTR),X'54'                              0210 00291000
*               IOPSYNG=ON;         /*                               */ 00292000
         OI    IOPSYNG(IOPPTR),B'00010000'                         0211 00293000
*               CALL HMASMIO(HMASMIOP);/* RESTOW ACDS SYSTEM ENTRY   */ 00294000
         ST    IOPPTR,@AL00001                                     0212 00295000
         L     @15,@CV01343                                        0212 00296000
         LA    @01,@AL00001                                        0212 00297000
         BALR  @14,@15                                             0212 00298000
*               CCAACDOS=ON;        /*                               */ 00299000
         OI    CCAACDOS(CCAPTR),B'01000000'                        0213 00300000
*               CCAIOPAS->IOPCDMAP=IOPCDMAP;/*                       */ 00301000
         L     @10,CCAIOPAS(,CCAPTR)                               0214 00302000
         MVC   IOPCDMAP(36,@10),IOPCDMAP(IOPPTR)                   0214 00303000
*             END;                  /*                               */ 00304000
*           DR2RTNCD=MAX(DR2RTNCD,IOPRETRN);/*                       */ 00305000
@RF00207 SLR   @10,@10                                             0216 00306000
         IC    @10,IOPRETRN(,IOPPTR)                               0216 00307000
         CR    DR2RTNCD,@10                                        0216 00308000
         BNL   *+6                                                      00309000
         LR    DR2RTNCD,@10                                        0216 00310000
*         END;                      /*                               */ 00311000
*       IF DR2RTNCD=ZERO            /*                               */ 00312000
*           &CCAACDUP=ON            /* AND HAS BEEN UPDATED          */ 00313000
*         THEN                      /*                               */ 00314000
@RF00201 CH    DR2RTNCD,@CH00353                                   0218 00315000
         BNE   @RF00218                                            0218 00316000
         TM    CCAACDUP(CCAPTR),B'01000000'                        0218 00317000
         BNO   @RF00218                                            0218 00318000
*         DO;                       /*                               */ 00319000
*           IOPFUNCT=DR2FUNCT;      /* FREE OR WRITE                 */ 00320000
         STC   DR2FUNCT,IOPFUNCT(,IOPPTR)                          0220 00321000
*           IOPDSID=IOPACDS;        /* ACDS DIS                      */ 00322000
         MVI   IOPDSID(IOPPTR),X'0C'                               0221 00323000
*           CALL HMASMIO(HMASMIOP); /* CALL HMASMIO TO EITHER FREE OR   00324000
*                                      REWRITE ACDS DIRECTORY.     0222 00325000
*                                      FUNCTION ALREADY SET UP IN  0222 00326000
*                                      PREVIOUS ROUTINE              */ 00327000
         ST    IOPPTR,@AL00001                                     0222 00328000
         L     @15,@CV01343                                        0222 00329000
         LA    @01,@AL00001                                        0222 00330000
         BALR  @14,@15                                             0222 00331000
*           DR2RTNCD=MAX(DR2RTNCD,IOPRETRN);/* SAVE RETURN CODE      */ 00332000
         SLR   @10,@10                                             0223 00333000
         IC    @10,IOPRETRN(,IOPPTR)                               0223 00334000
         CR    DR2RTNCD,@10                                        0223 00335000
         BNL   *+6                                                      00336000
         LR    DR2RTNCD,@10                                        0223 00337000
*         END;                      /*                               */ 00338000
*       CCAACDOS=OFF;               /* UPDATE ACTUAL ACDS            */ 00339000
*                                                                  0225 00340000
@RF00218 NI    CCAACDOS(CCAPTR),B'10111111'                        0225 00341000
*       /*************************************************************/ 00342000
*       /*                                                           */ 00343000
*       /* IF DIRECTORY REWRITE OK THEN RESET SYSTEM ENTRY INDICATOR */ 00344000
*       /*                                                           */ 00345000
*       /*************************************************************/ 00346000
*                                                                  0226 00347000
*       IF DR2FUNCT=IOPWRDIR        /* IF DIRECTORY REWRITE          */ 00348000
*           &CCAASYSF=ON            /* AND SYSTEM ENTRY FOUND        */ 00349000
*           &DR2RTNCD=ZERO          /*                               */ 00350000
*         THEN                      /*                               */ 00351000
         CH    DR2FUNCT,@CH00632                                   0226 00352000
         BNE   @RF00226                                            0226 00353000
         TM    CCAASYSF(CCAPTR),B'01000000'                        0226 00354000
         BNO   @RF00226                                            0226 00355000
         CH    DR2RTNCD,@CH00353                                   0226 00356000
         BNE   @RF00226                                            0226 00357000
*         DO;                       /*                               */ 00358000
*           RFY                                                    0228 00359000
*             HMASMIOP BASED(CCAIOPAS);/*                            */ 00360000
*           CCAUPDJ=OFF;            /*                               */ 00361000
         NI    CCAUPDJ(CCAPTR),B'11111011'                         0229 00362000
*           IOPFUNCT=IOPUDEO;       /*                               */ 00363000
         L     @10,CCAIOPAS(,CCAPTR)                               0230 00364000
         MVI   IOPFUNCT(@10),X'56'                                 0230 00365000
*           IOPSYNG=OFF;            /*                               */ 00366000
*           IOPSYDL=OFF;            /*                               */ 00367000
         NI    IOPSYNG(@10),B'11001111'                            0232 00368000
*           CALL HMASMIO(HMASMIOP); /* RESTOW ACDS SYSTEM ENTRY      */ 00369000
         ST    @10,@AL00001                                        0233 00370000
         L     @15,@CV01343                                        0233 00371000
         LA    @01,@AL00001                                        0233 00372000
         BALR  @14,@15                                             0233 00373000
*           DR2RTNCD=MAX(DR2RTNCD,IOPRETRN);/*                       */ 00374000
         L     @10,CCAIOPAS(,CCAPTR)                               0234 00375000
         SLR   @05,@05                                             0234 00376000
         IC    @05,IOPRETRN(,@10)                                  0234 00377000
         CR    DR2RTNCD,@05                                        0234 00378000
         BNL   *+6                                                      00379000
         LR    DR2RTNCD,@05                                        0234 00380000
*           RFY                                                    0235 00381000
*             HMASMIOP BASED(IOPPTR);/*                              */ 00382000
*           IF FJCLIN=ON            /*                               */ 00383000
*             THEN                  /*                               */ 00384000
         TM    FJCLIN,B'10000000'                                  0236 00385000
         BNO   @RF00236                                            0236 00386000
*             CCAUPDJ=ON;           /*                               */ 00387000
         OI    CCAUPDJ(CCAPTR),B'00000100'                         0237 00388000
*         END;                      /*                               */ 00389000
*                                                                  0238 00390000
@RF00236 DS    0H                                                  0239 00391000
*       /*************************************************************/ 00392000
*       /*                                                           */ 00393000
*       /* IF DIRECTORY REWRITE OK THEN ISSUE MESSAGE                */ 00394000
*       /*                                                           */ 00395000
*       /*************************************************************/ 00396000
*                                                                  0239 00397000
*       IF DR2RTNCD=ZERO            /*                               */ 00398000
*           &DR2FUNCT=IOPWRDIR      /*                               */ 00399000
*         THEN                      /*                               */ 00400000
@RF00226 CH    DR2RTNCD,@CH00353                                   0239 00401000
         BNE   @RF00239                                            0239 00402000
         CH    DR2FUNCT,@CH00632                                   0239 00403000
         BNE   @RF00239                                            0239 00404000
*         DO;                       /*                               */ 00405000
*           MGPCLEAR=''B;           /*                               */ 00406000
         XC    MGPCLEAR(6),MGPCLEAR                                0241 00407000
*           MGPMGNO1=HMA368I;       /* XXXXXXXX IN STORAGE DIRECTORY    00408000
*                                      SUCCESSFULLY REWRITTEN        */ 00409000
         MVC   MGPMGNO1(2),@CH01166                                0242 00410000
*           MGPVARPT(1)=ADDR(TXTACDS);/*                             */ 00411000
         LA    @10,@CC01349                                        0243 00412000
         ST    @10,MGPVARPT                                        0243 00413000
*           MGPTYPE=MGPINFO;        /*                               */ 00414000
         MVI   MGPTYPE,X'01'                                       0244 00415000
*           CALL HMASMMSG(HMASMMGP);/*                               */ 00416000
         L     @15,@CV01344                                        0245 00417000
         LA    @01,@AL00245                                        0245 00418000
         BALR  @14,@15                                             0245 00419000
*         END;                      /*                               */ 00420000
*     END;                          /*                               */ 00421000
@RF00239 DS    0H                                                  0248 00422000
         EJECT                                                          00423000
*                                                                  0248 00424000
*   /*****************************************************************/ 00425000
*   /*                                                               */ 00426000
*   /* PROCESS CRQ DATASET DIRECTORY                                 */ 00427000
*   /*                                                               */ 00428000
*   /*****************************************************************/ 00429000
*                                                                  0248 00430000
*   IF CCACRQOS=ON                  /* CRQ IN STORAGE FOR UPDATE     */ 00431000
*     THEN                          /*                               */ 00432000
@RF00199 TM    CCACRQOS(CCAPTR),B'00100000'                        0248 00433000
         BNO   @RF00248                                            0248 00434000
*     DO;                           /*                               */ 00435000
*       IF CCACRQUP=ON              /*                               */ 00436000
*         THEN                      /*                               */ 00437000
         TM    CCACRQUP(CCAPTR),B'00100000'                        0250 00438000
         BNO   @RF00250                                            0250 00439000
*         DO;                       /*                               */ 00440000
*           IOPFUNCT=DR2FUNCT;      /* FREE OR WRITE                 */ 00441000
         STC   DR2FUNCT,IOPFUNCT(,IOPPTR)                          0252 00442000
*           IOPDSID=IOPCRQ;         /* CRQ DIS                       */ 00443000
         MVI   IOPDSID(IOPPTR),X'1C'                               0253 00444000
*           CALL HMASMIO(HMASMIOP); /* CALL HMASMIO TO EITHER FREE OR   00445000
*                                      REWRITE CRQ DIRECTORY.      0254 00446000
*                                      FUNCTION ALREADY SET UP IN  0254 00447000
*                                      PREVIOUS ROUTINE              */ 00448000
         ST    IOPPTR,@AL00001                                     0254 00449000
         L     @15,@CV01343                                        0254 00450000
         LA    @01,@AL00001                                        0254 00451000
         BALR  @14,@15                                             0254 00452000
*           DR2RTNCD=MAX(DR2RTNCD,IOPRETRN);/* SAVE RETURN CODE      */ 00453000
         SLR   @10,@10                                             0255 00454000
         IC    @10,IOPRETRN(,IOPPTR)                               0255 00455000
         CR    DR2RTNCD,@10                                        0255 00456000
         BNL   *+6                                                      00457000
         LR    DR2RTNCD,@10                                        0255 00458000
*         END;                      /*                               */ 00459000
*                                                                  0256 00460000
*       /*************************************************************/ 00461000
*       /*                                                           */ 00462000
*       /* IF DIRECTORY REWRITE OK THEN ISSUE MESSAGE                */ 00463000
*       /*                                                           */ 00464000
*       /*************************************************************/ 00465000
*                                                                  0257 00466000
*       IF DR2RTNCD=ZERO            /*                               */ 00467000
*           &DR2FUNCT=IOPWRDIR      /*                               */ 00468000
*         THEN                      /*                               */ 00469000
@RF00250 CH    DR2RTNCD,@CH00353                                   0257 00470000
         BNE   @RF00257                                            0257 00471000
         CH    DR2FUNCT,@CH00632                                   0257 00472000
         BNE   @RF00257                                            0257 00473000
*         DO;                       /*                               */ 00474000
*           MGPCLEAR=''B;           /*                               */ 00475000
         XC    MGPCLEAR(6),MGPCLEAR                                0259 00476000
*           MGPMGNO1=HMA368I;       /* XXXXXXXX IN STORAGE DIRECTORY    00477000
*                                      SUCCESSFULLY REWRITTEN        */ 00478000
         MVC   MGPMGNO1(2),@CH01166                                0260 00479000
*           MGPVARPT(1)=ADDR(TXTCRQ);/*                              */ 00480000
         LA    @10,@CC01351                                        0261 00481000
         ST    @10,MGPVARPT                                        0261 00482000
*           MGPTYPE=MGPINFO;        /*                               */ 00483000
         MVI   MGPTYPE,X'01'                                       0262 00484000
*           CALL HMASMMSG(HMASMMGP);/*                               */ 00485000
         L     @15,@CV01344                                        0263 00486000
         LA    @01,@AL00263                                        0263 00487000
         BALR  @14,@15                                             0263 00488000
*         END;                      /*                               */ 00489000
*     END;                          /*                               */ 00490000
@RF00257 DS    0H                                                  0266 00491000
         EJECT                                                          00492000
*                                                                  0266 00493000
*   /*****************************************************************/ 00494000
*   /*                                                               */ 00495000
*   /* PROCESS ACRQ DATASET DIRECTORY                                */ 00496000
*   /*                                                               */ 00497000
*   /*****************************************************************/ 00498000
*                                                                  0266 00499000
*   IF CCAACROS=ON                  /* ACR IN STORAGE FOR UPDATE     */ 00500000
*     THEN                          /*                               */ 00501000
@RF00248 TM    CCAACROS(CCAPTR),B'00010000'                        0266 00502000
         BNO   @RF00266                                            0266 00503000
*     DO;                           /*                               */ 00504000
*       IF CCAACRUP=ON              /*                               */ 00505000
*         THEN                      /*                               */ 00506000
         TM    CCAACRUP(CCAPTR),B'00010000'                        0268 00507000
         BNO   @RF00268                                            0268 00508000
*         DO;                       /*                               */ 00509000
*           IOPFUNCT=DR2FUNCT;      /* FREE OR WRITE                 */ 00510000
         STC   DR2FUNCT,IOPFUNCT(,IOPPTR)                          0270 00511000
*           IOPDSID=IOPACRQ;        /* ACRQ DIS                      */ 00512000
         MVI   IOPDSID(IOPPTR),X'1E'                               0271 00513000
*           CALL HMASMIO(HMASMIOP); /* CALL HMASMIO TO EITHER FREE OR   00514000
*                                      REWRITE ACRQ DIRECTORY.     0272 00515000
*                                      FUNCTION ALREADY SET UP IN  0272 00516000
*                                      PREVIOUS ROUTINE              */ 00517000
         ST    IOPPTR,@AL00001                                     0272 00518000
         L     @15,@CV01343                                        0272 00519000
         LA    @01,@AL00001                                        0272 00520000
         BALR  @14,@15                                             0272 00521000
*           DR2RTNCD=MAX(DR2RTNCD,IOPRETRN);/* SAVE RETURN CODE      */ 00522000
         SLR   @10,@10                                             0273 00523000
         IC    @10,IOPRETRN(,IOPPTR)                               0273 00524000
         CR    DR2RTNCD,@10                                        0273 00525000
         BNL   *+6                                                      00526000
         LR    DR2RTNCD,@10                                        0273 00527000
*         END;                      /*                               */ 00528000
*                                                                  0274 00529000
*       /*************************************************************/ 00530000
*       /*                                                           */ 00531000
*       /* IF DIRECTORY REWRITE OK THEN ISSUE MESSAGE                */ 00532000
*       /*                                                           */ 00533000
*       /*************************************************************/ 00534000
*                                                                  0275 00535000
*       IF DR2RTNCD=ZERO            /*                               */ 00536000
*           &DR2FUNCT=IOPWRDIR      /*                               */ 00537000
*         THEN                      /*                               */ 00538000
@RF00268 CH    DR2RTNCD,@CH00353                                   0275 00539000
         BNE   @RF00275                                            0275 00540000
         CH    DR2FUNCT,@CH00632                                   0275 00541000
         BNE   @RF00275                                            0275 00542000
*         DO;                       /*                               */ 00543000
*           MGPCLEAR=''B;           /*                               */ 00544000
         XC    MGPCLEAR(6),MGPCLEAR                                0277 00545000
*           MGPMGNO1=HMA368I;       /* XXXXXXXX IN STORAGE DIRECTORY    00546000
*                                      SUCCESSFULLY REWRITTEN        */ 00547000
         MVC   MGPMGNO1(2),@CH01166                                0278 00548000
*           MGPVARPT(1)=ADDR(TXTACRQ);/*                             */ 00549000
         LA    @10,@CC01353                                        0279 00550000
         ST    @10,MGPVARPT                                        0279 00551000
*           MGPTYPE=MGPINFO;        /*                               */ 00552000
         MVI   MGPTYPE,X'01'                                       0280 00553000
*           CALL HMASMMSG(HMASMMGP);/*                               */ 00554000
         L     @15,@CV01344                                        0281 00555000
         LA    @01,@AL00281                                        0281 00556000
         BALR  @14,@15                                             0281 00557000
*         END;                      /*                               */ 00558000
*     END;                          /*                               */ 00559000
*                                                                  0283 00560000
@RF00275 DS    0H                                                  0284 00561000
*   /*****************************************************************/ 00562000
*   /*                                                               */ 00563000
*   /* TURN OFF IN-STORAGE ONLY BITS AMD DIS UPDATED BITS. RETURN TO */ 00564000
*   /* CALLER                                                        */ 00565000
*   /*                                                               */ 00566000
*   /*****************************************************************/ 00567000
*                                                                  0284 00568000
*   CCAFLAG5=''B;                   /* TURN OFF ALL DATASET UPDATED     00569000
*                                      IN IN-STORAGE MODE ONLY BITS  */ 00570000
@RF00266 MVI   CCAFLAG5(CCAPTR),X'00'                              0284 00571000
*   CCAFLAG6=''B;                   /* TURN OFF ALL DATASETS UPDATED    00572000
*                                      BITS                          */ 00573000
         MVI   CCAFLAG6(CCAPTR),X'00'                              0285 00574000
*   RETURN CODE(DR2RTNCD);          /*                               */ 00575000
         LR    @15,DR2RTNCD                                        0286 00576000
         L     @13,4(,@13)                                         0286 00577000
         L     @14,12(,@13)                                        0286 00578000
         LM    @00,@12,20(@13)                                     0286 00579000
         BR    @14                                                 0286 00580000
*   END HMASMDR2                    /*                               */ 00581000
*                                                                  0287 00582000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00583000
*/*%INCLUDE SYSLIB  (HMASMCCA)                                       */ 00584000
*/*%INCLUDE SYSLIB  (HMASMIOP)                                       */ 00585000
*/*%INCLUDE SYSLIB  (HMASMMGP)                                       */ 00586000
*                                                                  0287 00587000
*       ;                                                          0287 00588000
@DATA    DS    0H                                                       00589000
@CH00353 DC    H'0'                                                     00590000
@CH00061 DC    H'8'                                                     00591000
@CH00632 DC    H'89'                                                    00592000
@CH01166 DC    H'169'                                                   00593000
         DS    0F                                                       00594000
@AL00196 EQU   *                       LIST WITH   1 ARGUMENT(S)        00595000
@AL00245 EQU   *                       LIST WITH   1 ARGUMENT(S)        00596000
@AL00263 EQU   *                       LIST WITH   1 ARGUMENT(S)        00597000
@AL00281 DC    A(HMASMMGP)             LIST WITH   1 ARGUMENT(S)        00598000
         DS    0F                                                       00599000
@SA00001 DS    18F                                                      00600000
@PC00001 DS    3F                                                       00601000
@AL00001 DS    1A                                                       00602000
         DS    0F                                                       00603000
@CV01343 DC    V(HMASMIO)                                               00604000
@CV01344 DC    V(HMASMMSG)                                              00605000
         DS    0D                                                       00606000
@CC01347 DC    C'SMPCDS  '                                              00607000
@CC01349 DC    C'SMPACDS '                                              00608000
@CC01351 DC    C'SMPCRQ  '                                              00609000
@CC01353 DC    C'SMPACRQ '                                              00610000
HMASMMGP DS    CL16                                                     00611000
         ORG   HMASMMGP                                                 00612000
MGPFIXED DS    CL12                                                     00613000
         ORG   MGPFIXED                                                 00614000
MGPCLEAR DS    CL6                                                      00615000
         ORG   MGPCLEAR                                                 00616000
MGPMGNO1 DS    FL2                                                      00617000
MGPMGNO2 DS    FL2                                                      00618000
MGPMGNO3 DS    FL2                                                      00619000
         ORG   MGPFIXED+6                                               00620000
MGPFLAGS DS    BL2                                                      00621000
         ORG   MGPFLAGS                                                 00622000
MGPPRINT DS    BL1                                                      00623000
MGPLIST  EQU   MGPFLAGS+0                                               00624000
MGPRPT   EQU   MGPFLAGS+0                                               00625000
MGPHLDS  EQU   MGPFLAGS+0                                               00626000
MGPWTOR  EQU   MGPFLAGS+0                                               00627000
MGPWTO   EQU   MGPFLAGS+0                                               00628000
MGPWTP   EQU   MGPFLAGS+0                                               00629000
@NM00183 EQU   MGPFLAGS+0                                               00630000
         ORG   MGPFIXED+8                                               00631000
MGPTYPE  DS    FL1                                                      00632000
@NM00184 DS    CL3                                                      00633000
         ORG   HMASMMGP+12                                              00634000
MGPVAR   DS    CL4                                                      00635000
         ORG   MGPVAR                                                   00636000
MGPVARPT DS    1A                                                       00637000
         ORG   HMASMMGP+16                                              00638000
DR2SW    DS    BL1                                                      00639000
         ORG   DR2SW                                                    00640000
FJCLIN   DS    BL1                                                      00641000
@NM00185 EQU   DR2SW+0                                                  00642000
         ORG   DR2SW+1                                                  00643000
         DS    CL1                                                      00644000
PATCHDR2 DS    CL80                                                     00645000
         ORG   PATCHDR2                                                 00646000
@NM00186 DC    80X'FF'                                                  00647000
         ORG   PATCHDR2+80                                              00648000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00649000
@01      EQU   01                                                       00650000
@02      EQU   02                                                       00651000
@03      EQU   03                                                       00652000
@04      EQU   04                                                       00653000
@05      EQU   05                                                       00654000
@06      EQU   06                                                       00655000
@07      EQU   07                                                       00656000
@08      EQU   08                                                       00657000
@09      EQU   09                                                       00658000
@10      EQU   10                                                       00659000
@11      EQU   11                                                       00660000
@12      EQU   12                                                       00661000
@13      EQU   13                                                       00662000
@14      EQU   14                                                       00663000
@15      EQU   15                                                       00664000
DR2FUNCT EQU   @04                                                      00665000
DR2RTNCD EQU   @03                                                      00666000
IOPPTR   EQU   @02                                                      00667000
CCAPTR   EQU   @11                                                      00668000
RTNCODE  EQU   @15                                                      00669000
RTNREG   EQU   @14                                                      00670000
HMASMCCA EQU   0                                                        00671000
CCAFBUFR EQU   HMASMCCA+4                                               00672000
CCADSAD  EQU   CCAFBUFR+124                                             00673000
CCATPAD  EQU   CCAFBUFR+128                                             00674000
CCAFLAG7 EQU   CCAFBUFR+132                                             00675000
CCAFIOP  EQU   HMASMCCA+140                                             00676000
CCAIOPTR EQU   CCAFIOP                                                  00677000
CCAFSYS  EQU   HMASMCCA+148                                             00678000
CCAIOPCS EQU   CCAFSYS                                                  00679000
CCAIOPAS EQU   CCAFSYS+4                                                00680000
CCASREL  EQU   CCAFSYS+12                                               00681000
CCAFLAGA EQU   CCAFSYS+21                                               00682000
CCACSYSF EQU   CCAFLAGA                                                 00683000
CCAASYSF EQU   CCAFLAGA                                                 00684000
CCAFSTA  EQU   HMASMCCA+188                                             00685000
CCAFICT  EQU   HMASMCCA+192                                             00686000
CCAFPGM  EQU   HMASMCCA+208                                             00687000
CCABLDLP EQU   CCAFPGM                                                  00688000
CCADBLDL EQU   CCAFPGM+4                                                00689000
CCAFGTP  EQU   HMASMCCA+224                                             00690000
CCASEGTP EQU   CCAFGTP                                                  00691000
@NM00021 EQU   HMASMCCA+244                                             00692000
CCAFFUNC EQU   HMASMCCA+264                                             00693000
CCAFLAG1 EQU   CCAFFUNC+8                                               00694000
CCAUPDJ  EQU   CCAFLAG1                                                 00695000
CCAFLAG2 EQU   CCAFFUNC+11                                              00696000
CCAFPROC EQU   HMASMCCA+276                                             00697000
CCAFLAG3 EQU   CCAFPROC                                                 00698000
CCAFDIS  EQU   HMASMCCA+278                                             00699000
CCAFLAG4 EQU   CCAFDIS                                                  00700000
CCAFLAG5 EQU   CCAFDIS+1                                                00701000
CCACDSOS EQU   CCAFLAG5                                                 00702000
CCAACDOS EQU   CCAFLAG5                                                 00703000
CCACRQOS EQU   CCAFLAG5                                                 00704000
CCAACROS EQU   CCAFLAG5                                                 00705000
CCAFLAG6 EQU   CCAFDIS+2                                                00706000
CCACDSUP EQU   CCAFLAG6                                                 00707000
CCAACDUP EQU   CCAFLAG6                                                 00708000
CCACRQUP EQU   CCAFLAG6                                                 00709000
CCAACRUP EQU   CCAFLAG6                                                 00710000
CCAFCNV  EQU   HMASMCCA+281                                             00711000
CCAFLAG8 EQU   CCAFCNV                                                  00712000
CCAFCTL  EQU   HMASMCCA+282                                             00713000
CCAFLAG9 EQU   CCAFCTL                                                  00714000
CCAFDSNG EQU   HMASMCCA+298                                             00715000
CCAFLAGB EQU   CCAFDSNG                                                 00716000
CCABLDLA EQU   0                                                        00717000
@NM00037 EQU   CCABLDLA                                                 00718000
CCABLDLL EQU   0                                                        00719000
@NM00039 EQU   CCABLDLL                                                 00720000
CCALKDRC EQU   @NM00039+20                                              00721000
@NM00041 EQU   CCABLDLL+124                                             00722000
CCAASMRC EQU   @NM00041+20                                              00723000
@NM00043 EQU   CCABLDLL+248                                             00724000
CCACPYRC EQU   @NM00043+20                                              00725000
@NM00045 EQU   CCABLDLL+372                                             00726000
CCACOMRC EQU   @NM00045+20                                              00727000
@NM00047 EQU   CCABLDLL+496                                             00728000
CCAZAPRC EQU   @NM00047+20                                              00729000
@NM00049 EQU   CCABLDLL+620                                             00730000
CCASUPRC EQU   @NM00049+20                                              00731000
@NM00051 EQU   CCABLDLL+744                                             00732000
CCAUPDRC EQU   @NM00051+20                                              00733000
CCABLDLM EQU   0                                                        00734000
CCABELMT EQU   CCABLDLM+4                                               00735000
CCABMPOS EQU   CCABELMT                                                 00736000
HMASMIOP EQU   0                                                        00737000
IOPDSID  EQU   HMASMIOP                                                 00738000
IOPFUNCT EQU   HMASMIOP+1                                               00739000
IOPRETRN EQU   HMASMIOP+2                                               00740000
IOPNAME  EQU   HMASMIOP+4                                               00741000
@NM00055 EQU   HMASMIOP+12                                              00742000
@NM00056 EQU   @NM00055                                                 00743000
IOPDDNAM EQU   HMASMIOP+24                                              00744000
IOPBUFAD EQU   HMASMIOP+52                                              00745000
IOPDRMAP EQU   HMASMIOP+56                                              00746000
IOPINAME EQU   IOPDRMAP                                                 00747000
IOPINAM  EQU   IOPINAME                                                 00748000
IOPITYP  EQU   IOPINAM                                                  00749000
IOPUSERL EQU   IOPDRMAP+11                                              00750000
IOPEND   EQU   IOPDRMAP+12                                              00751000
IOPLMCTL EQU   0                                                        00752000
IOPQSMIF EQU   0                                                        00753000
@NM00166 EQU   IOPQSMIF                                                 00754000
IOPQSMLS EQU   IOPQSMIF+8                                               00755000
IOPQSMNM EQU   IOPQSMLS                                                 00756000
IOPBS02  EQU   0                                                        00757000
IOPBS04  EQU   0                                                        00758000
IOPBAPF  EQU   IOPBS04                                                  00759000
CCADSIDA EQU   0                                                        00760000
CCATYPEA EQU   0                                                        00761000
IOPBS01  EQU   0                                                        00762000
IOPBS03  EQU   0                                                        00763000
TBLPARM  EQU   0                                                        00764000
TBLFLAGS EQU   TBLPARM+8                                                00765000
TBLFLG1  EQU   TBLFLAGS                                                 00766000
TBLFLG2  EQU   TBLFLAGS+2                                               00767000
TBLFLG3  EQU   TBLFLAGS+3                                               00768000
TBLFLG4  EQU   TBLFLAGS+5                                               00769000
TBLFLG5  EQU   TBLFLAGS+7                                               00770000
LISTPARM EQU   0                                                        00771000
LISTPRM1 EQU   LISTPARM                                                 00772000
LISTPRM2 EQU   LISTPARM+2                                               00773000
LISTPRM3 EQU   LISTPARM+4                                               00774000
LISTPRM4 EQU   LISTPARM+6                                               00775000
LISTDATE EQU   LISTPARM+7                                               00776000
LISTBDAT EQU   LISTDATE                                                 00777000
LISTEDAT EQU   LISTDATE+6                                               00778000
SAVECODE EQU   0                                                        00779000
IOPUDATA EQU   IOPEND                                                   00780000
IOPINAM3 EQU   IOPINAME                                                 00781000
@NM00062 EQU   IOPINAM3                                                 00782000
IOPSTCMP EQU   IOPUDATA                                                 00783000
IOPDYNDT EQU   IOPUDATA                                                 00784000
IOPSPACE EQU   IOPDYNDT+44                                              00785000
IOPDTYPE EQU   IOPDYNDT+50                                              00786000
IOPNTMAX EQU   IOPDRMAP                                                 00787000
IOPNTMAP EQU   IOPDRMAP                                                 00788000
IOPCDMAP EQU   IOPNTMAP                                                 00789000
IOPPTMAP EQU   IOPCDMAP                                                 00790000
IOPSCMAP EQU   IOPPTMAP                                                 00791000
IOPDIRCT EQU   IOPSCMAP+12                                              00792000
IOPCDMAX EQU   IOPDIRCT                                                 00793000
IOPCQMAP EQU   IOPDRMAP                                                 00794000
@NM00073 EQU   IOPUDATA                                                 00795000
@NM00074 EQU   IOPUDATA                                                 00796000
IOPASMNT EQU   IOPUDATA                                                 00797000
IOPASMDR EQU   IOPASMNT                                                 00798000
IOPABUNT EQU   IOPASMDR+1                                               00799000
IOPLMDNT EQU   IOPUDATA                                                 00800000
IOPLMDDR EQU   IOPLMDNT                                                 00801000
IOPLMLEP EQU   IOPLMDDR+1                                               00802000
IOPLMDF1 EQU   IOPLMLEP                                                 00803000
IOPFLGS2 EQU   IOPLMDF1                                                 00804000
IOPLMDF2 EQU   IOPLMLEP+1                                               00805000
IOPLMDF3 EQU   IOPLMLEP+2                                               00806000
IOPLMDF4 EQU   IOPLMLEP+3                                               00807000
IOPLMDF5 EQU   IOPLMDDR+5                                               00808000
IOPFLGS3 EQU   IOPLMDF5                                                 00809000
IOPLMDFX EQU   IOPLMDNT+24                                              00810000
@NM00083 EQU   IOPLMDFX                                                 00811000
IOPLNTRY EQU   IOPLMDFX+8                                               00812000
IOPLSYS  EQU   IOPLNTRY                                                 00813000
IOPSYSLB EQU   IOPLSYS                                                  00814000
IOPMACNT EQU   IOPUDATA                                                 00815000
IOPMACDR EQU   IOPMACNT                                                 00816000
IOPRMIDE EQU   IOPMACDR+1                                               00817000
IOPRMST  EQU   IOPRMIDE+7                                               00818000
IOPFMIDE EQU   IOPMACDR+9                                               00819000
IOPMACFX EQU   IOPMACNT+24                                              00820000
IOPBUNT  EQU   IOPMACFX                                                 00821000
IOPMCEND EQU   IOPMACNT+104                                             00822000
IOPMACVR EQU   IOPMCEND                                                 00823000
IOPMCENT EQU   IOPMACVR                                                 00824000
IOPMCDTA EQU   IOPMCENT                                                 00825000
IOPMCASM EQU   IOPMCDTA                                                 00826000
IOPMACID EQU   IOPMCASM                                                 00827000
IOPMACST EQU   IOPMCASM+7                                               00828000
IOPMCIND EQU   IOPMCENT+8                                               00829000
IOPEOFNT EQU   IOPUDATA                                                 00830000
IOPSRCNT EQU   IOPUDATA                                                 00831000
IOPSRCDR EQU   IOPSRCNT                                                 00832000
@NM00094 EQU   IOPSRCDR+1                                               00833000
@NM00096 EQU   @NM00094+7                                               00834000
@NM00100 EQU   IOPSRCDR+9                                               00835000
IOPSRCFX EQU   IOPSRCNT+24                                              00836000
@NM00104 EQU   IOPSRCFX                                                 00837000
IOPSREND EQU   IOPSRCNT+104                                             00838000
IOPSRCVR EQU   IOPSREND                                                 00839000
IOPSNTRY EQU   IOPSRCVR                                                 00840000
IOPSRDTA EQU   IOPSNTRY                                                 00841000
IOPSRCID EQU   IOPSRDTA                                                 00842000
IOPSRCST EQU   IOPSRDTA+7                                               00843000
IOPMODNT EQU   IOPUDATA                                                 00844000
IOPMODDR EQU   IOPMODNT                                                 00845000
@NM00110 EQU   IOPMODDR+1                                               00846000
@NM00112 EQU   @NM00110+7                                               00847000
@NM00116 EQU   IOPMODDR+9                                               00848000
IOPMODFX EQU   IOPMODNT+24                                              00849000
@NM00120 EQU   IOPMODFX                                                 00850000
IOPMDLEP EQU   IOPMODFX+8                                               00851000
IOPMODF1 EQU   IOPMDLEP                                                 00852000
IOPMODF2 EQU   IOPMDLEP+1                                               00853000
IOPMODF3 EQU   IOPMDLEP+2                                               00854000
IOPMODF4 EQU   IOPMDLEP+3                                               00855000
IOPMDEND EQU   IOPMODNT+104                                             00856000
IOPMODVR EQU   IOPMDEND                                                 00857000
IOPMNTRY EQU   IOPMODVR                                                 00858000
IOPMDDTA EQU   IOPMNTRY                                                 00859000
IOPLMODS EQU   IOPMDDTA                                                 00860000
IOPMODID EQU   IOPLMODS                                                 00861000
IOPMODST EQU   IOPLMODS+7                                               00862000
IOPDLBNT EQU   IOPUDATA                                                 00863000
IOPDLBDR EQU   IOPDLBNT                                                 00864000
IOPDLBFX EQU   IOPDLBNT+24                                              00865000
@NM00131 EQU   IOPDLBFX                                                 00866000
IOPDLEND EQU   IOPDLBNT+104                                             00867000
IOPDLBVR EQU   IOPDLEND                                                 00868000
IOPDNTRY EQU   IOPDLBVR                                                 00869000
IOPDSYS  EQU   IOPDNTRY                                                 00870000
IOPSYSNT EQU   IOPUDATA                                                 00871000
IOPSYSDR EQU   IOPSYSNT                                                 00872000
IOPSYSF1 EQU   IOPSYSDR+4                                               00873000
IOPFLGS7 EQU   IOPSYSF1                                                 00874000
IOPSYDL  EQU   IOPFLGS7                                                 00875000
IOPSYNG  EQU   IOPFLGS7                                                 00876000
IOPSYSFX EQU   IOPSYSNT+24                                              00877000
@NM00138 EQU   IOPSYSFX                                                 00878000
IOPSYEND EQU   IOPSYSNT+184                                             00879000
IOPSYSVR EQU   IOPSYEND                                                 00880000
IOPSYSTR EQU   IOPSYSVR                                                 00881000
IOPSYNTR EQU   IOPSYSTR                                                 00882000
IOPPTFNT EQU   IOPUDATA                                                 00883000
IOPPTFDR EQU   IOPPTFNT                                                 00884000
IOPPSTAT EQU   IOPPTFDR+2                                               00885000
IOPPTFF1 EQU   IOPPSTAT                                                 00886000
IOPFLGS5 EQU   IOPPTFF1                                                 00887000
IOPPTFF2 EQU   IOPPSTAT+1                                               00888000
IOPPTFF3 EQU   IOPPSTAT+3                                               00889000
IOPPTFFX EQU   IOPPTFNT+24                                              00890000
@NM00147 EQU   IOPPTFFX                                                 00891000
@NM00148 EQU   @NM00147                                                 00892000
IOPPDTES EQU   IOPPTFFX+41                                              00893000
@NM00151 EQU   IOPPDTES                                                 00894000
IOPPTPFX EQU   IOPPDTES+6                                               00895000
IOPDATES EQU   IOPPTPFX                                                 00896000
IOPPTEND EQU   IOPPTFNT+104                                             00897000
IOPPTFVR EQU   IOPPTEND                                                 00898000
IOPPNTRY EQU   IOPPTFVR                                                 00899000
IOPPMODS EQU   IOPPNTRY                                                 00900000
IOPENTNT EQU   IOPUDATA+104                                             00901000
IOPSRLNT EQU   IOPUDATA+104                                             00902000
IOPPRENT EQU   IOPUDATA+104                                             00903000
IOPNPRNT EQU   IOPUDATA+104                                             00904000
IOPSUPNT EQU   IOPUDATA+104                                             00905000
IOPREQNT EQU   IOPUDATA+104                                             00906000
IOPIRQNT EQU   IOPUDATA+104                                             00907000
IOPFIDNT EQU   IOPUDATA+104                                             00908000
IOPDELNT EQU   IOPUDATA+104                                             00909000
IOPVERNT EQU   IOPUDATA+104                                             00910000
IOPSBYNT EQU   IOPUDATA+104                                             00911000
IOPQSMNT EQU   IOPUDATA                                                 00912000
IOPQSMDR EQU   IOPQSMNT                                                 00913000
IOPQFMNT EQU   IOPUDATA                                                 00914000
IOPQFMDR EQU   IOPQFMNT                                                 00915000
IOPQFEND EQU   IOPQFMNT+2                                               00916000
IOPQFMVR EQU   IOPQFEND                                                 00917000
IOPQFMLS EQU   IOPQFMVR                                                 00918000
IOPQFMNM EQU   IOPQFMLS                                                 00919000
IOPPTSYS EQU   IOPUDATA                                                 00920000
IOPPTSDR EQU   IOPPTSYS                                                 00921000
IOPPTSFX EQU   IOPPTSYS+24                                              00922000
IOPDSSPC EQU   IOPPTSFX                                                 00923000
IOPPTFG1 EQU   IOPPTSFX+34                                              00924000
IOPPSEND EQU   IOPPTSYS+1064                                            00925000
IOPPTSVR EQU   IOPPSEND                                                 00926000
IOPPTNTR EQU   IOPPTSVR                                                 00927000
@NM00176 EQU   IOPPTNTR                                                 00928000
IOPPTFMD EQU   @NM00176                                                 00929000
IOPPTREL EQU   IOPPTFMD                                                 00930000
IOPBPDS  EQU   IOPUDATA                                                 00931000
IOPBLEP1 EQU   IOPBPDS+8                                                00932000
IOPBLEP2 EQU   IOPBPDS+9                                                00933000
@NM00180 EQU   IOPBPDS+18                                               00934000
IOPBFTB0 EQU   @NM00180                                                 00935000
IOPBFTB1 EQU   IOPBFTB0                                                 00936000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00937000
IOPBCEND EQU   IOPBPDS+21                                               00938000
IOPBFTB3 EQU   IOPBFTB0+2                                               00939000
IOPBFTB2 EQU   IOPBFTB0+1                                               00940000
@NM00182 EQU   IOPBFTB1                                                 00941000
IOPBAPFP EQU   IOPBFTB1                                                 00942000
IOPBSSI  EQU   IOPBFTB1                                                 00943000
IOPBPAGA EQU   IOPBFTB1                                                 00944000
@NM00181 EQU   IOPBFTB1                                                 00945000
IOPBAOSL EQU   IOPBFTB1                                                 00946000
IOPBSEPA EQU   IOPBPDS+15                                               00947000
IOPBFTBL EQU   IOPBPDS+13                                               00948000
IOPBSTOR EQU   IOPBPDS+10                                               00949000
IOPBREFR EQU   IOPBLEP2                                                 00950000
IOPBLEF  EQU   IOPBLEP2                                                 00951000
IOPBTEST EQU   IOPBLEP2                                                 00952000
IOPBNE   EQU   IOPBLEP2                                                 00953000
@NM00179 EQU   IOPBLEP2                                                 00954000
IOPBDC   EQU   IOPBLEP2                                                 00955000
@NM00178 EQU   IOPBLEP1                                                 00956000
IOPBSCTR EQU   IOPBLEP1                                                 00957000
IOPBOL   EQU   IOPBLEP1                                                 00958000
@NM00177 EQU   IOPBLEP1                                                 00959000
IOPBOVLY EQU   IOPBLEP1                                                 00960000
IOPBREUS EQU   IOPBLEP1                                                 00961000
IOPBRENT EQU   IOPBLEP1                                                 00962000
IOPBNL   EQU   IOPBPDS+7                                                00963000
IOPBTTRN EQU   IOPBPDS+4                                                00964000
IOPBZERO EQU   IOPBPDS+3                                                00965000
IOPBTTRT EQU   IOPBPDS                                                  00966000
IOPPTIND EQU   IOPPTNTR+8                                               00967000
IOPPTSND EQU   IOPPTREL                                                 00968000
@NM00175 EQU   IOPPTSFX+872                                             00969000
IOPSYZPP EQU   IOPPTSFX+772                                             00970000
IOPSYZPR EQU   IOPPTSFX+771                                             00971000
IOPSYZPS EQU   IOPPTSFX+763                                             00972000
IOPSYZAP EQU   IOPPTSFX+755                                             00973000
IOPSYUPP EQU   IOPPTSFX+655                                             00974000
IOPSYUPR EQU   IOPPTSFX+654                                             00975000
IOPSYUPS EQU   IOPPTSFX+646                                             00976000
IOPSYUPD EQU   IOPPTSFX+638                                             00977000
IOPSYSPP EQU   IOPPTSFX+538                                             00978000
IOPSYSPR EQU   IOPPTSFX+537                                             00979000
IOPSYSPS EQU   IOPPTSFX+529                                             00980000
IOPSYSUP EQU   IOPPTSFX+521                                             00981000
IOPSYLKP EQU   IOPPTSFX+421                                             00982000
IOPSYLKR EQU   IOPPTSFX+420                                             00983000
IOPSYLKS EQU   IOPPTSFX+412                                             00984000
IOPSYLKD EQU   IOPPTSFX+404                                             00985000
IOPSYCPP EQU   IOPPTSFX+304                                             00986000
IOPSYCPR EQU   IOPPTSFX+303                                             00987000
IOPSYCPS EQU   IOPPTSFX+295                                             00988000
IOPSYCPY EQU   IOPPTSFX+287                                             00989000
IOPSYCOP EQU   IOPPTSFX+187                                             00990000
IOPSYCOR EQU   IOPPTSFX+186                                             00991000
IOPSYCOS EQU   IOPPTSFX+178                                             00992000
IOPSYCOM EQU   IOPPTSFX+170                                             00993000
IOPSYASP EQU   IOPPTSFX+70                                              00994000
IOPSYASR EQU   IOPPTSFX+69                                              00995000
IOPSYASS EQU   IOPPTSFX+61                                              00996000
IOPSYASM EQU   IOPPTSFX+53                                              00997000
@NM00174 EQU   IOPPTSFX+35                                              00998000
@NM00173 EQU   IOPPTFG1                                                 00999000
IOPPTSNJ EQU   IOPPTFG1                                                 01000000
IOPPTSNP EQU   IOPPTFG1                                                 01001000
IOPSYPLN EQU   IOPPTSFX+32                                              01002000
IOPDSPFX EQU   IOPPTSFX+6                                               01003000
IOPDSDIR EQU   IOPDSSPC+4                                               01004000
IOPDSSEC EQU   IOPDSSPC+2                                               01005000
IOPDSPRM EQU   IOPDSSPC                                                 01006000
@NM00172 EQU   IOPPTSDR+4                                               01007000
IOPPTPEM EQU   IOPPTSDR+2                                               01008000
IOPPCNVL EQU   IOPPTSDR+1                                               01009000
@NM00171 EQU   IOPPTSDR                                                 01010000
IOPQFMTP EQU   IOPQFMLS+8                                               01011000
@NM00170 EQU   IOPQFMLS+7                                               01012000
IOPQFMND EQU   IOPQFMNM                                                 01013000
@NM00169 EQU   IOPQFMDR                                                 01014000
@NM00165 EQU   IOPQSMDR                                                 01015000
@NM00164 EQU   IOPSBYNT+8                                               01016000
IOPSBYST EQU   IOPSBYNT+7                                               01017000
IOPSBYNM EQU   IOPSBYNT                                                 01018000
@NM00163 EQU   IOPVERNT+8                                               01019000
IOPVERST EQU   IOPVERNT+7                                               01020000
IOPVERNM EQU   IOPVERNT                                                 01021000
@NM00162 EQU   IOPDELNT+8                                               01022000
IOPDELST EQU   IOPDELNT+7                                               01023000
IOPDELNM EQU   IOPDELNT                                                 01024000
@NM00161 EQU   IOPFIDNT+8                                               01025000
IOPFIDST EQU   IOPFIDNT+7                                               01026000
IOPFIDNM EQU   IOPFIDNT                                                 01027000
@NM00160 EQU   IOPIRQNT+8                                               01028000
IOPIRQST EQU   IOPIRQNT+7                                               01029000
IOPIRQNM EQU   IOPIRQNT                                                 01030000
@NM00159 EQU   IOPREQNT+8                                               01031000
IOPREQST EQU   IOPREQNT+7                                               01032000
IOPREQNM EQU   IOPREQNT                                                 01033000
@NM00158 EQU   IOPSUPNT+8                                               01034000
IOPSUPST EQU   IOPSUPNT+7                                               01035000
IOPSUPNM EQU   IOPSUPNT                                                 01036000
@NM00157 EQU   IOPNPRNT+8                                               01037000
IOPNPRST EQU   IOPNPRNT+7                                               01038000
IOPNPRNM EQU   IOPNPRNT                                                 01039000
@NM00156 EQU   IOPPRENT+8                                               01040000
IOPPREST EQU   IOPPRENT+7                                               01041000
IOPPRENM EQU   IOPPRENT                                                 01042000
@NM00155 EQU   IOPSRLNT+8                                               01043000
IOPSRLST EQU   IOPSRLNT+7                                               01044000
@NM00154 EQU   IOPSRLNT+4                                               01045000
IOPSRLNM EQU   IOPSRLNT                                                 01046000
@NM00153 EQU   IOPENTNT+8                                               01047000
IOPENTST EQU   IOPENTNT+7                                               01048000
IOPENTNM EQU   IOPENTNT                                                 01049000
IOPPIND  EQU   IOPPNTRY+8                                               01050000
IOPPTFND EQU   IOPPMODS                                                 01051000
IOPPFMID EQU   IOPPTFFX+73                                              01052000
@NM00152 EQU   IOPPTPFX+24                                              01053000
IOPUCLT  EQU   IOPDATES+21                                              01054000
IOPUCLD  EQU   IOPDATES+18                                              01055000
IOPACCT  EQU   IOPDATES+15                                              01056000
IOPACCD  EQU   IOPDATES+12                                              01057000
IOPRSTT  EQU   IOPDATES+9                                               01058000
IOPRSTD  EQU   IOPDATES+6                                               01059000
IOPAPPT  EQU   IOPDATES+3                                               01060000
IOPAPPD  EQU   IOPDATES                                                 01061000
IOPRECT  EQU   @NM00151+3                                               01062000
IOPRECD  EQU   @NM00151                                                 01063000
@NM00150 EQU   IOPPTFFX+8                                               01064000
@NM00149 EQU   @NM00147+7                                               01065000
IOPPRELN EQU   @NM00148                                                 01066000
@NM00146 EQU   IOPPTFDR+20                                              01067000
IOPSBYNO EQU   IOPPTFDR+13                                              01068000
IOPDBYNO EQU   IOPPTFDR+6                                               01069000
@NM00145 EQU   IOPPTFF3                                                 01070000
IOPFLF   EQU   IOPPTFF3                                                 01071000
IOPDBYP  EQU   IOPPTFF3                                                 01072000
IOPSBYP  EQU   IOPPTFF3                                                 01073000
IOPPMDLP EQU   IOPPTFF2+1                                               01074000
IOPPADDP EQU   IOPPTFF2+1                                               01075000
@NM00144 EQU   IOPPTFF2+1                                               01076000
IOPLRFP  EQU   IOPPTFF2                                                 01077000
IOPJCLP  EQU   IOPPTFF2                                                 01078000
IOPSUPP  EQU   IOPPTFF2                                                 01079000
IOPREQP  EQU   IOPPTFF2                                                 01080000
IOPPREP  EQU   IOPPTFF2                                                 01081000
IOPNPRP  EQU   IOPPTFF2                                                 01082000
IOPIRQP  EQU   IOPPTFF2                                                 01083000
IOPDELP  EQU   IOPPTFF2                                                 01084000
IOPREGEN EQU   IOPFLGS5                                                 01085000
IOPBYP   EQU   IOPFLGS5                                                 01086000
IOPDUMMP EQU   IOPFLGS5                                                 01087000
@NM00143 EQU   IOPFLGS5                                                 01088000
IOPERROR EQU   IOPFLGS5                                                 01089000
IOPACC   EQU   IOPFLGS5                                                 01090000
IOPRES   EQU   IOPFLGS5                                                 01091000
IOPAPP   EQU   IOPFLGS5                                                 01092000
IOPPTYPE EQU   IOPPTFDR+1                                               01093000
@NM00142 EQU   IOPPTFDR                                                 01094000
IOPSYSTP EQU   IOPSYSTR+8                                               01095000
IOPSYSND EQU   IOPSYNTR                                                 01096000
@NM00141 EQU   IOPSYSFX+21                                              01097000
IOPSYSID EQU   IOPSYSFX+13                                              01098000
IOPNUCID EQU   IOPSYSFX+12                                              01099000
IOPSREL  EQU   IOPSYSFX+8                                               01100000
@NM00140 EQU   @NM00138+7                                               01101000
@NM00139 EQU   @NM00138                                                 01102000
@NM00137 EQU   IOPSYSDR+5                                               01103000
@NM00136 EQU   IOPFLGS7                                                 01104000
IOPSTSNP EQU   IOPFLGS7                                                 01105000
IOPMTSNP EQU   IOPFLGS7                                                 01106000
IOPPEMAX EQU   IOPSYSDR+2                                               01107000
IOPSCNVL EQU   IOPSYSDR+1                                               01108000
@NM00135 EQU   IOPSYSDR                                                 01109000
IOPDLIND EQU   IOPDNTRY+8                                               01110000
IOPDLBND EQU   IOPDSYS                                                  01111000
@NM00134 EQU   IOPDLBFX+8                                               01112000
@NM00133 EQU   @NM00131+7                                               01113000
@NM00132 EQU   @NM00131                                                 01114000
@NM00130 EQU   IOPDLBDR+1                                               01115000
@NM00129 EQU   IOPDLBDR                                                 01116000
IOPMDIND EQU   IOPMNTRY+8                                               01117000
@NM00128 EQU   IOPMODST                                                 01118000
IOPMODND EQU   IOPMODID                                                 01119000
IOPDLIB  EQU   IOPMODFX+72                                              01120000
@NM00127 EQU   IOPMODFX+12                                              01121000
@NM00126 EQU   IOPMODF4                                                 01122000
@NM00125 EQU   IOPMODF3                                                 01123000
@NM00124 EQU   IOPMODF2                                                 01124000
IOPMPAGA EQU   IOPMODF2                                                 01125000
IOPMNE   EQU   IOPMODF2                                                 01126000
@NM00123 EQU   IOPMODF1                                                 01127000
IOPMDC   EQU   IOPMODF1                                                 01128000
IOPMREFR EQU   IOPMODF1                                                 01129000
IOPMOVLY EQU   IOPMODF1                                                 01130000
IOPMSCTR EQU   IOPMODF1                                                 01131000
IOPMREUS EQU   IOPMODF1                                                 01132000
IOPMRENT EQU   IOPMODF1                                                 01133000
IOPMAPF  EQU   IOPMODF1                                                 01134000
@NM00122 EQU   @NM00120+7                                               01135000
@NM00121 EQU   @NM00120                                                 01136000
@NM00119 EQU   IOPMODDR+17                                              01137000
@NM00118 EQU   @NM00116+7                                               01138000
@NM00117 EQU   @NM00116                                                 01139000
@NM00115 EQU   @NM00112                                                 01140000
@NM00114 EQU   @NM00112                                                 01141000
@NM00113 EQU   @NM00112                                                 01142000
@NM00111 EQU   @NM00110                                                 01143000
@NM00109 EQU   IOPMODDR                                                 01144000
IOPSRIND EQU   IOPSNTRY+8                                               01145000
@NM00108 EQU   IOPSRCST                                                 01146000
IOPSRCND EQU   IOPSRCID                                                 01147000
IOPSRDLB EQU   IOPSRCFX+72                                              01148000
IOPSRSYS EQU   IOPSRCFX+64                                              01149000
@NM00107 EQU   IOPSRCFX+8                                               01150000
@NM00106 EQU   @NM00104+7                                               01151000
@NM00105 EQU   @NM00104                                                 01152000
@NM00103 EQU   IOPSRCDR+18                                              01153000
IOPSRLNG EQU   IOPSRCDR+17                                              01154000
@NM00102 EQU   @NM00100+7                                               01155000
@NM00101 EQU   @NM00100                                                 01156000
@NM00099 EQU   @NM00096                                                 01157000
@NM00098 EQU   @NM00096                                                 01158000
@NM00097 EQU   @NM00096                                                 01159000
@NM00095 EQU   @NM00094                                                 01160000
@NM00093 EQU   IOPSRCDR                                                 01161000
IOPEOFND EQU   IOPEOFNT                                                 01162000
IOPMCTYP EQU   IOPMCIND                                                 01163000
@NM00092 EQU   IOPMACST                                                 01164000
IOPMACND EQU   IOPMACID                                                 01165000
IOPMCDLB EQU   IOPMACFX+72                                              01166000
IOPMCSYS EQU   IOPMACFX+64                                              01167000
@NM00091 EQU   IOPMACFX+8                                               01168000
IOPBUTYP EQU   IOPBUNT+7                                                01169000
IOPBUSMD EQU   IOPBUNT                                                  01170000
@NM00090 EQU   IOPMACDR+18                                              01171000
IOPMCLNG EQU   IOPMACDR+17                                              01172000
IOPFMST  EQU   IOPFMIDE+7                                               01173000
IOPFMID  EQU   IOPFMIDE                                                 01174000
@NM00089 EQU   IOPRMST                                                  01175000
IOPRMASM EQU   IOPRMST                                                  01176000
@NM00088 EQU   IOPRMST                                                  01177000
IOPRMID  EQU   IOPRMIDE                                                 01178000
@NM00087 EQU   IOPMACDR                                                 01179000
IOPLMIND EQU   IOPLNTRY+8                                               01180000
IOPLMDND EQU   IOPSYSLB                                                 01181000
@NM00085 EQU   @NM00083+7                                               01182000
@NM00084 EQU   @NM00083                                                 01183000
@NM00082 EQU   IOPLMDDR+6                                               01184000
@NM00081 EQU   IOPFLGS3                                                 01185000
IOPCHREP EQU   IOPFLGS3                                                 01186000
IOPLINK  EQU   IOPFLGS3                                                 01187000
IOPCOPY  EQU   IOPFLGS3                                                 01188000
@NM00080 EQU   IOPLMDF4                                                 01189000
@NM00079 EQU   IOPLMDF3                                                 01190000
@NM00078 EQU   IOPLMDF2                                                 01191000
IOPPAGA  EQU   IOPLMDF2                                                 01192000
IOPNE    EQU   IOPLMDF2                                                 01193000
@NM00077 EQU   IOPFLGS2                                                 01194000
IOPDC    EQU   IOPFLGS2                                                 01195000
IOPREFR  EQU   IOPFLGS2                                                 01196000
IOPOVLY  EQU   IOPFLGS2                                                 01197000
IOPSCTR  EQU   IOPFLGS2                                                 01198000
IOPREUS  EQU   IOPFLGS2                                                 01199000
IOPRENT  EQU   IOPFLGS2                                                 01200000
IOPAPF   EQU   IOPFLGS2                                                 01201000
@NM00076 EQU   IOPLMDDR                                                 01202000
@NM00075 EQU   IOPASMDR+9                                               01203000
IOPABUTP EQU   IOPABUNT+7                                               01204000
IOPABUPT EQU   IOPABUNT                                                 01205000
IOPNTLVL EQU   IOPASMDR                                                 01206000
IOPALLOC EQU   @NM00074+4                                               01207000
IOPUSED  EQU   @NM00074                                                 01208000
IOPTPSEQ EQU   @NM00073+8                                               01209000
IOPVLSER EQU   @NM00073+2                                               01210000
IOPBLKSI EQU   @NM00073                                                 01211000
IOPCQMAX EQU   IOPCQMAP+12                                              01212000
@NM00072 EQU   IOPCQMAP+11                                              01213000
@NM00071 EQU   IOPCQMAP+8                                               01214000
@NM00070 EQU   IOPCQMAP                                                 01215000
IOPPTMAX EQU   IOPCDMAX                                                 01216000
@NM00069 EQU   IOPSCMAP+11                                              01217000
@NM00068 EQU   IOPSCMAP+8                                               01218000
@NM00067 EQU   IOPSCMAP                                                 01219000
IOPDIRMX EQU   IOPNTMAX+12                                              01220000
@NM00066 EQU   IOPNTMAX+11                                              01221000
@NM00065 EQU   IOPNTMAX+8                                               01222000
@NM00064 EQU   IOPNTMAX                                                 01223000
@NM00063 EQU   IOPDTYPE                                                 01224000
IOPDMOD  EQU   IOPDTYPE                                                 01225000
IOPDJCL  EQU   IOPDTYPE                                                 01226000
IOPDSRC  EQU   IOPDTYPE                                                 01227000
IOPDMAC  EQU   IOPDTYPE                                                 01228000
IOPSDIR  EQU   IOPSPACE+4                                               01229000
IOPSSCND EQU   IOPSPACE+2                                               01230000
IOPSPRIM EQU   IOPSPACE                                                 01231000
IOPDSN   EQU   IOPDYNDT                                                 01232000
IOPNTYPE EQU   IOPSTCMP+17                                              01233000
IOPNNAME EQU   IOPSTCMP+9                                               01234000
IOPOTYPE EQU   IOPSTCMP+8                                               01235000
IOPONAME EQU   IOPSTCMP                                                 01236000
IOPISEQ3 EQU   IOPINAM3+6                                               01237000
IOPITYP3 EQU   @NM00062+5                                               01238000
IOPIPTF3 EQU   @NM00062                                                 01239000
LISTEYY  EQU   LISTEDAT+4                                               01240000
LISTEDD  EQU   LISTEDAT+2                                               01241000
LISTEMM  EQU   LISTEDAT                                                 01242000
LISTBYY  EQU   LISTBDAT+4                                               01243000
LISTBDD  EQU   LISTBDAT+2                                               01244000
LISTBMM  EQU   LISTBDAT                                                 01245000
@NM00012 EQU   LISTPRM4                                                 01246000
LISTXREF EQU   LISTPRM4                                                 01247000
LISTSEL  EQU   LISTPRM4                                                 01248000
@NM00011 EQU   LISTPRM3+1                                               01249000
LISTERR  EQU   LISTPRM3+1                                               01250000
LISTBYP  EQU   LISTPRM3+1                                               01251000
LISTDEL  EQU   LISTPRM3+1                                               01252000
LISTNSUP EQU   LISTPRM3+1                                               01253000
LISTSUP  EQU   LISTPRM3+1                                               01254000
LISTUSER EQU   LISTPRM3                                                 01255000
LISTAPAR EQU   LISTPRM3                                                 01256000
LISTPTF  EQU   LISTPRM3                                                 01257000
LISTFUNC EQU   LISTPRM3                                                 01258000
LISTRES  EQU   LISTPRM3                                                 01259000
LISTNOAC EQU   LISTPRM3                                                 01260000
LISTNOAP EQU   LISTPRM3                                                 01261000
LISTALL3 EQU   LISTPRM3                                                 01262000
@NM00010 EQU   LISTPRM2+1                                               01263000
LISTMCS  EQU   LISTPRM2+1                                               01264000
LISTFMD  EQU   LISTPRM2+1                                               01265000
LISTSMD  EQU   LISTPRM2+1                                               01266000
LISTSYS  EQU   LISTPRM2                                                 01267000
LISTDLB  EQU   LISTPRM2                                                 01268000
LISTSRC  EQU   LISTPRM2                                                 01269000
LISTMOD  EQU   LISTPRM2                                                 01270000
LISTMAC  EQU   LISTPRM2                                                 01271000
LISTLMD  EQU   LISTPRM2                                                 01272000
LISTASM  EQU   LISTPRM2                                                 01273000
LISTALL2 EQU   LISTPRM2                                                 01274000
@NM00009 EQU   LISTPRM1+1                                               01275000
LISTLOG  EQU   LISTPRM1+1                                               01276000
@NM00008 EQU   LISTPRM1                                                 01277000
LISTPTS  EQU   LISTPRM1                                                 01278000
LISTACRQ EQU   LISTPRM1                                                 01279000
LISTCRQ  EQU   LISTPRM1                                                 01280000
LISTSCDS EQU   LISTPRM1                                                 01281000
LISTACDS EQU   LISTPRM1                                                 01282000
LISTCDS  EQU   LISTPRM1                                                 01283000
LISTALL1 EQU   LISTPRM1                                                 01284000
@NM00007 EQU   TBLFLG5                                                  01285000
TBLICTOK EQU   TBLFLG5                                                  01286000
@NM00006 EQU   TBLFLG4                                                  01287000
TBLBPFM  EQU   TBLFLG4                                                  01288000
@NM00005 EQU   TBLFLG4                                                  01289000
TBLBPIRQ EQU   TBLFLG4                                                  01290000
TBLBPREQ EQU   TBLFLG4                                                  01291000
TBLBPPRE EQU   TBLFLG4                                                  01292000
TBLBPID  EQU   TBLFLG4                                                  01293000
@NM00004 EQU   TBLFLG3+1                                                01294000
TBLSTS   EQU   TBLFLG3                                                  01295000
TBLMTS   EQU   TBLFLG3                                                  01296000
TBLPTS   EQU   TBLFLG3                                                  01297000
TBLACRQ  EQU   TBLFLG3                                                  01298000
TBLCRQ   EQU   TBLFLG3                                                  01299000
TBLSCDS  EQU   TBLFLG3                                                  01300000
TBLACDS  EQU   TBLFLG3                                                  01301000
TBLCDS   EQU   TBLFLG3                                                  01302000
TBLMASS  EQU   TBLFLG2                                                  01303000
@NM00003 EQU   TBLFLG2                                                  01304000
TBLFMID  EQU   TBLFLG2                                                  01305000
TBLGROUP EQU   TBLFLG2                                                  01306000
TBLEXC   EQU   TBLFLG2                                                  01307000
TBLSEL   EQU   TBLFLG2                                                  01308000
@NM00002 EQU   TBLFLG1+1                                                01309000
TBLDISW  EQU   TBLFLG1+1                                                01310000
TBLDISR  EQU   TBLFLG1+1                                                01311000
TBLDISN  EQU   TBLFLG1+1                                                01312000
TBLNOJCL EQU   TBLFLG1                                                  01313000
TBLFLUSH EQU   TBLFLG1                                                  01314000
TBLUSER  EQU   TBLFLG1                                                  01315000
TBLAPAR  EQU   TBLFLG1                                                  01316000
TBLCOMP  EQU   TBLFLG1                                                  01317000
TBLASSEM EQU   TBLFLG1                                                  01318000
TBLCHECK EQU   TBLFLG1                                                  01319000
TBLNOAPP EQU   TBLFLG1                                                  01320000
@NM00001 EQU   TBLPARM+5                                                01321000
TBLNUCID EQU   TBLPARM+4                                                01322000
TBLJCLGT EQU   TBLPARM                                                  01323000
IOPBS04E EQU   IOPBS04+2                                                01324000
IOPBAPFC EQU   IOPBAPF+1                                                01325000
IOPBAPFL EQU   IOPBAPF                                                  01326000
IOPBS2NM EQU   IOPBS02+3                                                01327000
IOPBS2EP EQU   IOPBS02                                                  01328000
IOPQSMTP EQU   IOPQSMLS+8                                               01329000
@NM00168 EQU   IOPQSMLS+7                                               01330000
IOPQSMND EQU   IOPQSMNM                                                 01331000
@NM00167 EQU   @NM00166+7                                               01332000
IOPQSMFM EQU   @NM00166                                                 01333000
@NM00086 EQU   IOPLMCTL+17                                              01334000
IOPLMCRD EQU   IOPLMCTL+9                                               01335000
IOPLMCRN EQU   IOPLMCTL+1                                               01336000
IOPLMCC  EQU   IOPLMCTL                                                 01337000
@NM00061 EQU   IOPUSERL                                                 01338000
@NM00060 EQU   IOPUSERL                                                 01339000
IOPALIS  EQU   IOPUSERL                                                 01340000
IOPTTR   EQU   IOPDRMAP+8                                               01341000
IOPINAM2 EQU   IOPINAM+1                                                01342000
IOPITYP2 EQU   IOPITYP                                                  01343000
@NM00059 EQU   HMASMIOP+32                                              01344000
IOPDELDD EQU   IOPDDNAM                                                 01345000
@NM00058 EQU   @NM00055+10                                              01346000
IOPSEQNO EQU   @NM00055+8                                               01347000
@NM00057 EQU   @NM00056+7                                               01348000
IOPPTFNM EQU   @NM00056                                                 01349000
IOPNAM17 EQU   IOPNAME                                                  01350000
IOPTYPE  EQU   HMASMIOP+3                                               01351000
CCABMREC EQU   CCABELMT+10                                              01352000
CCABPOS  EQU   CCABMPOS+8                                               01353000
CCABNAME EQU   CCABMPOS                                                 01354000
@NM00054 EQU   CCABLDLM+2                                               01355000
@NM00053 EQU   CCABLDLM                                                 01356000
CCAUPDPM EQU   @NM00051+24                                              01357000
@NM00052 EQU   @NM00051+21                                              01358000
CCARUPDT EQU   CCAUPDRC                                                 01359000
CCAUPDSP EQU   @NM00051+12                                              01360000
CCAUPDTE EQU   @NM00051+8                                               01361000
CCAUPDNM EQU   @NM00051                                                 01362000
CCASUPPM EQU   @NM00049+24                                              01363000
@NM00050 EQU   @NM00049+21                                              01364000
CCARSUP  EQU   CCASUPRC                                                 01365000
CCASUPSP EQU   @NM00049+12                                              01366000
CCAIOSUP EQU   @NM00049+8                                               01367000
CCASUPNM EQU   @NM00049                                                 01368000
CCAZAPPM EQU   @NM00047+24                                              01369000
@NM00048 EQU   @NM00047+21                                              01370000
CCARZAP  EQU   CCAZAPRC                                                 01371000
CCAZAPSP EQU   @NM00047+12                                              01372000
CCASPZAP EQU   @NM00047+8                                               01373000
CCAZAPNM EQU   @NM00047                                                 01374000
CCACOMPM EQU   @NM00045+24                                              01375000
@NM00046 EQU   @NM00045+21                                              01376000
CCARCOMP EQU   CCACOMRC                                                 01377000
CCACOMSP EQU   @NM00045+12                                              01378000
CCACOMRS EQU   @NM00045+8                                               01379000
CCACOMNM EQU   @NM00045                                                 01380000
CCACPYPM EQU   @NM00043+24                                              01381000
@NM00044 EQU   @NM00043+21                                              01382000
CCARCOPY EQU   CCACPYRC                                                 01383000
CCACPYSP EQU   @NM00043+12                                              01384000
CCACOPY  EQU   @NM00043+8                                               01385000
CCACPYNM EQU   @NM00043                                                 01386000
CCAASMPM EQU   @NM00041+24                                              01387000
@NM00042 EQU   @NM00041+21                                              01388000
CCARASM  EQU   CCAASMRC                                                 01389000
CCAASMSP EQU   @NM00041+12                                              01390000
CCAASM   EQU   @NM00041+8                                               01391000
CCAASMNM EQU   @NM00041                                                 01392000
CCALKDPM EQU   @NM00039+24                                              01393000
@NM00040 EQU   @NM00039+21                                              01394000
CCARLINK EQU   CCALKDRC                                                 01395000
CCALKDSP EQU   @NM00039+12                                              01396000
CCALKED  EQU   @NM00039+8                                               01397000
CCALKDNM EQU   @NM00039                                                 01398000
CCAPGMPM EQU   @NM00037+24                                              01399000
@NM00038 EQU   @NM00037+21                                              01400000
CCABPGRC EQU   @NM00037+20                                              01401000
CCABPGSP EQU   @NM00037+12                                              01402000
CCABPGAD EQU   @NM00037+8                                               01403000
CCABPGNM EQU   @NM00037                                                 01404000
CCAEND   EQU   HMASMCCA+371                                             01405000
@NM00036 EQU   HMASMCCA+309                                             01406000
CCACURDD EQU   CCAFDSNG+3                                               01407000
CCACURDS EQU   CCAFDSNG+2                                               01408000
@NM00035 EQU   CCAFLAGB                                                 01409000
CCAOUTNG EQU   CCAFLAGB                                                 01410000
CCALOGNG EQU   CCAFLAGB                                                 01411000
CCAFMID  EQU   HMASMCCA+291                                             01412000
CCALSTDS EQU   CCAFCTL+8                                                01413000
CCARPTDS EQU   CCAFCTL+7                                                01414000
CCATIME  EQU   CCAFCTL+4                                                01415000
CCADATE  EQU   CCAFCTL+1                                                01416000
@NM00034 EQU   CCAFLAG9                                                 01417000
CCARVCAN EQU   CCAFLAG9                                                 01418000
CCARVEST EQU   CCAFLAG9                                                 01419000
CCAPTSNJ EQU   CCAFLAG9                                                 01420000
CCASTSNP EQU   CCAFLAG9                                                 01421000
CCAMTSNP EQU   CCAFLAG9                                                 01422000
CCAPTSNP EQU   CCAFLAG9                                                 01423000
@NM00033 EQU   CCAFLAG8                                                 01424000
CCAACDSC EQU   CCAFLAG8                                                 01425000
CCACDSC  EQU   CCAFLAG8                                                 01426000
@NM00032 EQU   CCAFLAG6                                                 01427000
@NM00031 EQU   CCAFLAG5                                                 01428000
@NM00030 EQU   CCAFLAG4                                                 01429000
CCAACRIS EQU   CCAFLAG4                                                 01430000
CCACRQIS EQU   CCAFLAG4                                                 01431000
CCAACDIS EQU   CCAFLAG4                                                 01432000
CCACDSIS EQU   CCAFLAG4                                                 01433000
@NM00029 EQU   CCAFLAG3+1                                               01434000
CCARGNP  EQU   CCAFLAG3+1                                               01435000
CCADISRQ EQU   CCAFLAG3+1                                               01436000
CCAICTOK EQU   CCAFLAG3                                                 01437000
CCADELP  EQU   CCAFLAG3                                                 01438000
CCACMPRS EQU   CCAFLAG3                                                 01439000
CCAZAPP  EQU   CCAFLAG3                                                 01440000
CCALINKP EQU   CCAFLAG3                                                 01441000
CCACOPYP EQU   CCAFLAG3                                                 01442000
CCAASIP  EQU   CCAFLAG3                                                 01443000
CCAUPDP  EQU   CCAFLAG3                                                 01444000
CCAEOSMP EQU   CCAFLAG2                                                 01445000
CCAEOFNC EQU   CCAFLAG2                                                 01446000
@NM00028 EQU   CCAFLAG2                                                 01447000
CCACHECK EQU   CCAFLAG2                                                 01448000
CCATERM  EQU   CCAFLAG2                                                 01449000
CCASVCLB EQU   CCAFLAG2                                                 01450000
CCANCPTF EQU   CCAFLAG2                                                 01451000
@NM00027 EQU   CCAFLAG1+1                                               01452000
CCAUNL   EQU   CCAFLAG1+1                                               01453000
CCARESET EQU   CCAFLAG1+1                                               01454000
CCALOG   EQU   CCAFLAG1+1                                               01455000
CCACNV   EQU   CCAFLAG1+1                                               01456000
CCALIST  EQU   CCAFLAG1                                                 01457000
CCAUPDU  EQU   CCAFLAG1                                                 01458000
CCARES   EQU   CCAFLAG1                                                 01459000
CCAREJ   EQU   CCAFLAG1                                                 01460000
CCAACCPT EQU   CCAFLAG1                                                 01461000
CCAAPPLY EQU   CCAFLAG1                                                 01462000
CCAREC   EQU   CCAFLAG1                                                 01463000
CCAFUNCT EQU   CCAFFUNC                                                 01464000
@NM00026 EQU   @NM00021+18                                              01465000
@NM00025 EQU   @NM00021+16                                              01466000
CCATBLPA EQU   @NM00021+12                                              01467000
@NM00024 EQU   @NM00021+8                                               01468000
@NM00023 EQU   @NM00021+4                                               01469000
@NM00022 EQU   @NM00021                                                 01470000
CCAIFGTP EQU   CCAFGTP+16                                               01471000
CCAGTP3  EQU   CCAFGTP+12                                               01472000
CCAGTP2  EQU   CCAFGTP+8                                                01473000
CCAGTP1  EQU   CCAFGTP+4                                                01474000
CCASETAD EQU   CCASEGTP                                                 01475000
CCACLST  EQU   CCAFPGM+12                                               01476000
CCASPDCB EQU   CCAFPGM+8                                                01477000
CCAICLMD EQU   CCAFICT+12                                               01478000
CCAICMOD EQU   CCAFICT+8                                                01479000
CCAICPTF EQU   CCAFICT+4                                                01480000
CCAICT   EQU   CCAFICT                                                  01481000
CCARVAD  EQU   CCAFSTA                                                  01482000
CCAACDID EQU   CCAFSYS+32                                               01483000
CCACDSID EQU   CCAFSYS+24                                               01484000
CCALNLEN EQU   CCAFSYS+22                                               01485000
@NM00020 EQU   CCAFLAGA                                                 01486000
CCAPSYSF EQU   CCAFLAGA                                                 01487000
CCANUCID EQU   CCAFSYS+20                                               01488000
CCAASREL EQU   CCAFSYS+16                                               01489000
CCACSREL EQU   CCASREL                                                  01490000
CCAPEMAX EQU   CCAFSYS+10                                               01491000
CCAPGLEN EQU   CCAFSYS+8                                                01492000
CCAPESIZ EQU   CCAFIOP+4                                                01493000
@NM00019 EQU   CCAFLAG7+3                                               01494000
CCALOGP  EQU   CCAFLAG7+2                                               01495000
CCAOUTP  EQU   CCAFLAG7+2                                               01496000
CCASLBP  EQU   CCAFLAG7+2                                               01497000
CCARPTP  EQU   CCAFLAG7+2                                               01498000
CCALISTP EQU   CCAFLAG7+2                                               01499000
CCAJCLP  EQU   CCAFLAG7+2                                               01500000
CCAPTFP  EQU   CCAFLAG7+2                                               01501000
CCATLBP  EQU   CCAFLAG7+2                                               01502000
CCAUT3P  EQU   CCAFLAG7+1                                               01503000
CCAUT2P  EQU   CCAFLAG7+1                                               01504000
CCAUT1P  EQU   CCAFLAG7+1                                               01505000
CCAWK5P  EQU   CCAFLAG7+1                                               01506000
CCAWK4P  EQU   CCAFLAG7+1                                               01507000
CCAWK3P  EQU   CCAFLAG7+1                                               01508000
CCAWK2P  EQU   CCAFLAG7+1                                               01509000
CCAWK1P  EQU   CCAFLAG7+1                                               01510000
CCAACRQP EQU   CCAFLAG7                                                 01511000
CCACRQP  EQU   CCAFLAG7                                                 01512000
CCASTSP  EQU   CCAFLAG7                                                 01513000
CCAMTSP  EQU   CCAFLAG7                                                 01514000
CCAPTSP  EQU   CCAFLAG7                                                 01515000
CCASCDSP EQU   CCAFLAG7                                                 01516000
CCAACDSP EQU   CCAFLAG7                                                 01517000
CCACDSP  EQU   CCAFLAG7                                                 01518000
@NM00018 EQU   CCAFBUFR+122                                             01519000
@NM00017 EQU   CCAFBUFR+120                                             01520000
@NM00016 EQU   CCAFBUFR+118                                             01521000
CCATBFMX EQU   CCAFBUFR+116                                             01522000
CCA4BFMX EQU   CCAFBUFR+114                                             01523000
CCA3BFMX EQU   CCAFBUFR+112                                             01524000
CCA2BFMX EQU   CCAFBUFR+110                                             01525000
CCA1BFMX EQU   CCAFBUFR+108                                             01526000
CCAXBFMX EQU   CCAFBUFR+106                                             01527000
CCAQBFMX EQU   CCAFBUFR+104                                             01528000
CCASBFMX EQU   CCAFBUFR+102                                             01529000
CCAMBFMX EQU   CCAFBUFR+100                                             01530000
CCAPBFMX EQU   CCAFBUFR+98                                              01531000
CCAVBFMX EQU   CCAFBUFR+96                                              01532000
CCAABFMX EQU   CCAFBUFR+94                                              01533000
CCACBFMX EQU   CCAFBUFR+92                                              01534000
@NM00015 EQU   CCAFBUFR+88                                              01535000
@NM00014 EQU   CCAFBUFR+84                                              01536000
CCA4BFSZ EQU   CCAFBUFR+80                                              01537000
CCATBFSZ EQU   CCAFBUFR+76                                              01538000
CCAWBFSZ EQU   CCAFBUFR+72                                              01539000
CCAQBFSZ EQU   CCAFBUFR+68                                              01540000
CCAPBFSZ EQU   CCAFBUFR+64                                              01541000
CCAVBFSZ EQU   CCAFBUFR+60                                              01542000
CCACBFSZ EQU   CCAFBUFR+56                                              01543000
@NM00013 EQU   CCAFBUFR+52                                              01544000
CCA4BFOA EQU   CCAFBUFR+48                                              01545000
CCA4BFIA EQU   CCAFBUFR+44                                              01546000
CCATBFIA EQU   CCAFBUFR+40                                              01547000
CCAWBFOA EQU   CCAFBUFR+36                                              01548000
CCAWBFIA EQU   CCAFBUFR+32                                              01549000
CCAQBFOA EQU   CCAFBUFR+28                                              01550000
CCAQBFIA EQU   CCAFBUFR+24                                              01551000
CCAPBFOA EQU   CCAFBUFR+20                                              01552000
CCAPBFIA EQU   CCAFBUFR+16                                              01553000
CCAVBFOA EQU   CCAFBUFR+12                                              01554000
CCAVBFIA EQU   CCAFBUFR+8                                               01555000
CCACBFOA EQU   CCAFBUFR+4                                               01556000
CCACBFIA EQU   CCAFBUFR                                                 01557000
CCAID    EQU   HMASMCCA                                                 01558000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01559000
@ENDDATA EQU   *                                                        01560000
         END   HMASMDR2,(C'PLS2012',0802,78334)                         01561000
