         TITLE 'HMASMFVL - FORMAT VARIABLE SUBENTRY LIST'               00001000
HMASMFVL CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'HMASMFVL  78.334'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         ST    @13,@SA00001+4                                      0001 00013000
         LA    @14,@SA00001                                        0001 00014000
         ST    @14,8(,@13)                                         0001 00015000
         LR    @13,@14                                             0001 00016000
         MVC   @PC00001(4),0(@01)                                  0001 00017000
         EJECT                                                          00018000
*                                                                  0141 00019000
*   /*****************************************************************/ 00020000
*   /*                                                               */ 00021000
*   /* INIT INTERNAL SWITCHES AND IOPPTR                             */ 00022000
*   /*                                                               */ 00023000
*   /*****************************************************************/ 00024000
*                                                                  0141 00025000
*   FVLRTNCD=ZERO;                  /* INIT RETURN CODE              */ 00026000
         SLR   FVLRTNCD,FVLRTNCD                                   0141 00027000
*   IOPPTR=CCAIOPTR;                /* IOP FOR WRITES                */ 00028000
         L     IOPPTR,CCAIOPTR(,CCAPTR)                            0142 00029000
*   PRNTBUF(1:LENGTH(PRNTBUF))=BLANK;/* THEN CLEAR THE PRINT AREA    */ 00030000
         MVI   PRNTBUF+1,C' '                                      0143 00031000
         MVC   PRNTBUF+2(118),PRNTBUF+1                            0143 00032000
         MVI   PRNTBUF,C' '                                        0143 00033000
*   MAXPERLN=((FVPLNLEN-LENGTH(HDVPFX))-FVPOFFST)/LENGTH(HDVSLIST(1));  00034000
         L     @10,@PC00001                                        0144 00035000
         LH    @00,FVPLNLEN(,@10)                                  0144 00036000
         SH    @00,@CH00472                                        0144 00037000
         SH    @00,FVPOFFST(,@10)                                  0144 00038000
         SRDA  @00,32                                              0144 00039000
         D     @00,@CF00350                                        0144 00040000
         LR    MAXPERLN,@01                                        0144 00041000
*                                   /* CALC MAX NUMBER OF ENTRIES PER   00042000
*                                      LINE                          */ 00043000
*   IF CCALIST=ON                   /* IF LIST                       */ 00044000
*     THEN                          /* THEN                          */ 00045000
         TM    CCALIST(CCAPTR),B'00000001'                         0145 00046000
         BNO   @RF00145                                            0145 00047000
*     SEPCHR=TXTEQ;                 /* = SEPARATES HEADING FROM DATA */ 00048000
         MVI   SEPCHR,C'='                                         0146 00049000
*   ELSE                            /* IF UNLOAD                     */ 00050000
*     SEPCHR=TXTLP;                 /* THEN ( SEPARATES              */ 00051000
         B     @RC00145                                            0147 00052000
@RF00145 MVI   SEPCHR,C'('                                         0147 00053000
*                                                                  0148 00054000
*   /*****************************************************************/ 00055000
*   /*                                                               */ 00056000
*   /* MAJOR LOOP IS THRU THE TYPE ENTRIES IN THE CONTROL ARRAY      */ 00057000
*   /*                                                               */ 00058000
*   /*****************************************************************/ 00059000
*                                                                  0148 00060000
*   DO TYPEINDX=1 BY 1 WHILE(       /* LOOP THRU TYPE ARRAY          */ 00061000
*         FVPAEND(TYPEINDX)^=IOPEOLST/* TILL END                     */ 00062000
*         &FVLRTNCD=ZERO);          /* AND NO ERR FROM WRITE         */ 00063000
@RC00145 LA    TYPEINDX,1                                          0148 00064000
         B     @DE00148                                            0148 00065000
@DL00148 DS    0H                                                  0149 00066000
*     HDSUBHD=FVPAHEAD(TYPEINDX);   /* SETUP SUBHEADING              */ 00067000
         LA    @10,PRNTBUF                                         0149 00068000
         L     @08,@PC00001                                        0149 00069000
         AH    @10,FVPOFFST(,@08)                                  0149 00070000
         LR    @07,TYPEINDX                                        0149 00071000
         MH    @07,@CH00470                                        0149 00072000
         L     @05,FVPARRAD(,@08)                                  0149 00073000
         ALR   @05,@07                                             0149 00074000
         AL    @05,@CF01307                                        0149 00075000
         MVC   HDSUBHD(15,@10),FVPAHEAD-2(@05)                     0149 00076000
*     HDSEPCHR=SEPCHR;              /* PUT IN = OR (                 */ 00077000
         MVC   HDSEPCHR(1,@10),SEPCHR                              0150 00078000
*     IF FVPVERN^=ZERO              /* IF CALL FOR VER DATA          */ 00079000
*       THEN                        /*                               */ 00080000
         CLI   FVPVERN(@08),0                                      0151 00081000
         BE    @RF00151                                            0151 00082000
*       DO;                         /*                               */ 00083000
*         CVD(FVPVERN,VERTEMP);     /*                               */ 00084000
         SLR   @07,@07                                             0153 00085000
         IC    @07,FVPVERN(,@08)                                   0153 00086000
         CVD   @07,@TS00001                                        0153 00087000
         MVC   VERTEMP(3),@TS00001+5                               0153 00088000
*         UNPK(HDVERN,VERTEMP);     /* UNPACK VER NUMBER             */ 00089000
         UNPK  HDVERN(3,@10),VERTEMP(3)                            0154 00090000
*         HDVERN(3)=HDVERN(3)|HEX0; /*                               */ 00091000
         OI    HDVERN+2(@10),X'F0'                                 0155 00092000
*       END;                        /*                               */ 00093000
*     SUBNINDX=1;                   /* INITIALIZE DATA INDEX POINTER */ 00094000
@RF00151 LA    SUBNINDX,1                                          0157 00095000
*     PRNTDONE=OFF;                 /* NO LINE PRINTED               */ 00096000
*                                                                  0158 00097000
         NI    PRNTDONE,B'01111111'                                0158 00098000
*     /***************************************************************/ 00099000
*     /*                                                             */ 00100000
*     /* SEARCH THRU ALL SUB-ENTRIES WITHIN THE LIST                 */ 00101000
*     /*                                                             */ 00102000
*     /***************************************************************/ 00103000
*                                                                  0159 00104000
*     DO WHILE(                     /* LOOP UNTIL                    */ 00105000
*           FVPLEND(SUBNINDX)^=IOPEOLST/* END OF LIST OR             */ 00106000
*           &FVLRTNCD=ZERO);        /* ERROR FROM WRITE              */ 00107000
*                                                                  0159 00108000
         B     @DE00159                                            0159 00109000
@DL00159 DS    0H                                                  0160 00110000
*       /*************************************************************/ 00111000
*       /*                                                           */ 00112000
*       /* LOOP LISTING MAXIMUM MEMBER OF SUB-ENTRIES PER LINE       */ 00113000
*       /*                                                           */ 00114000
*       /*************************************************************/ 00115000
*                                                                  0160 00116000
*       DO PRNTINDX=1 TO MAXPERLN   /* PLACE NAMES IN OUTPUT LINE    */ 00117000
*             WHILE FVPLEND(SUBNINDX)^=IOPEOLST;/*                   */ 00118000
         LA    PRNTINDX,1                                          0160 00119000
         B     @DE00160                                            0160 00120000
@DL00160 LR    @10,SUBNINDX                                        0160 00121000
         MH    @10,@CH00457                                        0160 00122000
         L     @08,@PC00001                                        0160 00123000
         L     @07,FVPLSTAD(,@08)                                  0160 00124000
         LA    @01,0(@10,@07)                                      0160 00125000
         AL    @01,@CF01309                                        0160 00126000
         SLR   @00,@00                                             0160 00127000
         IC    @00,FVPLEND(,@01)                                   0160 00128000
         CH    @00,@CH00646                                        0160 00129000
         BE    @DC00160                                            0160 00130000
*         IF FVPLTYPE(SUBNINDX)=FVPATYPE(TYPEINDX)/* SAME TYPE NAME? */ 00131000
*             &(FVPVERN=ZERO        /* AND NO SECONDARY SEARCH       */ 00132000
*             |FVPVERN=FVPLSTAT(SUBNINDX))/* OR IS MATCH             */ 00133000
*           THEN                    /*                               */ 00134000
         LR    @15,TYPEINDX                                        0161 00135000
         MH    @15,@CH00470                                        0161 00136000
         L     @01,FVPARRAD(,@08)                                  0161 00137000
         LA    @14,0(@10,@07)                                      0161 00138000
         BCTR  @14,0                                               0161 00139000
         SLR   @00,@00                                             0161 00140000
         IC    @00,FVPLTYPE-8(,@14)                                0161 00141000
         AL    @01,@CF01310                                        0161 00142000
         SLR   @14,@14                                             0161 00143000
         IC    @14,FVPATYPE(@15,@01)                               0161 00144000
         CR    @00,@14                                             0161 00145000
         BNE   @RF00161                                            0161 00146000
         CLI   FVPVERN(@08),0                                      0161 00147000
         BE    @RT00161                                            0161 00148000
         SLR   @15,@15                                             0161 00149000
         IC    @15,FVPVERN(,@08)                                   0161 00150000
         BCTR  @07,0                                               0161 00151000
         BCTR  @07,0                                               0161 00152000
         SLR   @08,@08                                             0161 00153000
         IC    @08,FVPLSTAT-7(@10,@07)                             0161 00154000
         CR    @15,@08                                             0161 00155000
         BNE   @RF00161                                            0161 00156000
@RT00161 DS    0H                                                  0162 00157000
*           HDVSDATA(PRNTINDX,1:FVPALEN(TYPEINDX))=FVPLDATA(SUBNINDX,1: 00158000
*               FVPALEN(TYPEINDX)); /* MOVE DATA                     */ 00159000
         LR    @10,PRNTINDX                                        0162 00160000
         MH    @10,@CH00350                                        0162 00161000
         LA    @08,PRNTBUF                                         0162 00162000
         L     @07,@PC00001                                        0162 00163000
         AH    @08,FVPOFFST(,@07)                                  0162 00164000
         ALR   @08,@10                                             0162 00165000
         LR    @10,TYPEINDX                                        0162 00166000
         MH    @10,@CH00470                                        0162 00167000
         L     @01,FVPARRAD(,@07)                                  0162 00168000
         AL    @01,@CF01311                                        0162 00169000
         SLR   @15,@15                                             0162 00170000
         IC    @15,FVPALEN-1(@10,@01)                              0162 00171000
         BCTR  @15,0                                               0162 00172000
         LR    @10,SUBNINDX                                        0162 00173000
         MH    @10,@CH00457                                        0162 00174000
         L     @07,FVPLSTAD(,@07)                                  0162 00175000
         ALR   @07,@10                                             0162 00176000
         AL    @07,@CF01309                                        0162 00177000
         EX    @15,@SM01312                                        0162 00178000
*         ELSE                      /*                               */ 00179000
*           PRNTINDX=PRNTINDX-1;    /* DECR PRINT POINTER-NO HIT     */ 00180000
         B     @RC00161                                            0163 00181000
@RF00161 BCTR  PRNTINDX,0                                          0163 00182000
*         SUBNINDX=SUBNINDX+1;      /* BUMP DATA POINTER TO NEXT     */ 00183000
@RC00161 AH    SUBNINDX,@CH00054                                   0164 00184000
*       END;                        /* END MAX ENT/LINE LOOP         */ 00185000
*                                                                  0165 00186000
         AH    PRNTINDX,@CH00054                                   0165 00187000
@DE00160 CR    PRNTINDX,MAXPERLN                                   0165 00188000
         BNH   @DL00160                                            0165 00189000
@DC00160 DS    0H                                                  0166 00190000
*       /*************************************************************/ 00191000
*       /*                                                           */ 00192000
*       /* IF LINE CONTAINS DATA NOT PRINTED, PRINT IT NOW           */ 00193000
*       /*                                                           */ 00194000
*       /*************************************************************/ 00195000
*                                                                  0166 00196000
*       IF PRNTINDX>1               /* ANYTHING IN OUTPUT LINE ?     */ 00197000
*         THEN                                                     0166 00198000
         CH    PRNTINDX,@CH00054                                   0166 00199000
         BNH   @RF00166                                            0166 00200000
*         DO;                                                      0167 00201000
*           CALL FVLWRITE;          /* YES-PRINT IT OUT              */ 00202000
         BAL   @14,FVLWRITE                                        0168 00203000
*           RFY                                                    0169 00204000
*             RTNCODE RSTD;         /*                               */ 00205000
*           FVLRTNCD=MAX(FVLRTNCD,RTNCODE);/* SAVE RC FROM WRITE     */ 00206000
         CR    FVLRTNCD,RTNCODE                                    0170 00207000
         BNL   *+6                                                      00208000
         LR    FVLRTNCD,RTNCODE                                    0170 00209000
*           RFY                                                    0171 00210000
*             RTNCODE UNRSTD;       /*                               */ 00211000
*           PRNTDONE=ON;            /* SET LINE PRINTED              */ 00212000
         OI    PRNTDONE,B'10000000'                                0172 00213000
*         END;                      /* END PRINT INCOMPLETE LINE     */ 00214000
*     END;                          /* END PTF SEARCH LOOP           */ 00215000
*                                                                  0174 00216000
@RF00166 DS    0H                                                  0174 00217000
@DE00159 LR    @10,SUBNINDX                                        0174 00218000
         MH    @10,@CH00457                                        0174 00219000
         L     @08,@PC00001                                        0174 00220000
         L     @08,FVPLSTAD(,@08)                                  0174 00221000
         AL    @08,@CF01309                                        0174 00222000
         SLR   @07,@07                                             0174 00223000
         IC    @07,FVPLEND(@10,@08)                                0174 00224000
         CH    @07,@CH00646                                        0174 00225000
         BE    @DC00159                                            0174 00226000
         CH    FVLRTNCD,@CH00274                                   0174 00227000
         BE    @DL00159                                            0174 00228000
@DC00159 DS    0H                                                  0175 00229000
*     /***************************************************************/ 00230000
*     /*                                                             */ 00231000
*     /* IF UNLOAD AND LINE PRINTED PRINT LINE WITH )                */ 00232000
*     /*                                                             */ 00233000
*     /***************************************************************/ 00234000
*                                                                  0175 00235000
*     IF CCAUNL=ON                  /*                               */ 00236000
*         &PRNTDONE=ON              /*                               */ 00237000
*       THEN                        /*                               */ 00238000
         TM    CCAUNL(CCAPTR),B'00010000'                          0175 00239000
         BNO   @RF00175                                            0175 00240000
         TM    PRNTDONE,B'10000000'                                0175 00241000
         BNO   @RF00175                                            0175 00242000
*       DO;                         /*                               */ 00243000
*         HDSEPCHR=TXTRP;           /* LINE WITH )                   */ 00244000
         LA    @10,PRNTBUF                                         0177 00245000
         L     @08,@PC00001                                        0177 00246000
         AH    @10,FVPOFFST(,@08)                                  0177 00247000
         MVI   HDSEPCHR(@10),C')'                                  0177 00248000
*         CALL FVLWRITE;            /* YES-PRINT IT OUT              */ 00249000
         BAL   @14,FVLWRITE                                        0178 00250000
*         RFY                                                      0179 00251000
*           RTNCODE RSTD;           /*                               */ 00252000
*         FVLRTNCD=MAX(FVLRTNCD,RTNCODE);/* SAVE RC FROM WRITE       */ 00253000
         CR    FVLRTNCD,RTNCODE                                    0180 00254000
         BNL   *+6                                                      00255000
         LR    FVLRTNCD,RTNCODE                                    0180 00256000
*         RFY                                                      0181 00257000
*           RTNCODE UNRSTD;         /*                               */ 00258000
*       END;                        /* END PRINT ) LINE              */ 00259000
*   END;                            /* END VALID SUB-ENTRY LOOP      */ 00260000
*                                                                  0183 00261000
@RF00175 AH    TYPEINDX,@CH00054                                   0183 00262000
@DE00148 LR    @10,TYPEINDX                                        0183 00263000
         MH    @10,@CH00470                                        0183 00264000
         L     @08,@PC00001                                        0183 00265000
         L     @08,FVPARRAD(,@08)                                  0183 00266000
         AL    @08,@CF01310                                        0183 00267000
         SLR   @07,@07                                             0183 00268000
         IC    @07,FVPAEND(@10,@08)                                0183 00269000
         CH    @07,@CH00646                                        0183 00270000
         BE    @DC00148                                            0183 00271000
         CH    FVLRTNCD,@CH00274                                   0183 00272000
         BE    @DL00148                                            0183 00273000
@DC00148 DS    0H                                                  0184 00274000
*   /*****************************************************************/ 00275000
*   /*                                                               */ 00276000
*   /* NOW RETURN TO CALLER                                          */ 00277000
*   /*                                                               */ 00278000
*   /*****************************************************************/ 00279000
*                                                                  0184 00280000
*   FVPRETRN=FVLRTNCD;              /* PUT RC IN PARM                */ 00281000
         L     @10,@PC00001                                        0184 00282000
         STC   FVLRTNCD,FVPRETRN(,@10)                             0184 00283000
*   RETURN CODE(FVLRTNCD);          /*                               */ 00284000
         LR    @15,FVLRTNCD                                        0185 00285000
         L     @13,4(,@13)                                         0185 00286000
         L     @14,12(,@13)                                        0185 00287000
         LM    @00,@12,20(@13)                                     0185 00288000
         BR    @14                                                 0185 00289000
         EJECT                                                          00290000
*                                                                  0186 00291000
*   /*****************************************************************/ 00292000
*   /*                                                               */ 00293000
*   /* OUTPUT PRINT SUBROUTINE - PRINTS THE FORMATTED OUTPUT         */ 00294000
*   /*                                                               */ 00295000
*   /*****************************************************************/ 00296000
*                                                                  0186 00297000
*FVLWRITE:                                                         0186 00298000
*   PROCEDURE;                                                     0186 00299000
FVLWRITE STM   @14,@12,@SA00002                                    0186 00300000
*   RFY                                                            0187 00301000
*     HMASMIOP BASED(IOPPTR);       /*                               */ 00302000
*   DECLARE                                                        0188 00303000
*     WTRDSID FIXED(8),             /*                               */ 00304000
*     WTRFUNCT FIXED(8),            /*                               */ 00305000
*     WTRBUFSV PTR(31);             /* SAVE AREA FOR IOPBUFAD        */ 00306000
*   WTRDSID=IOPDSID;                /*                               */ 00307000
         SLR   WTRDSID,WTRDSID                                     0189 00308000
         IC    WTRDSID,IOPDSID(,IOPPTR)                            0189 00309000
*   WTRFUNCT=IOPFUNCT;              /*                               */ 00310000
         SLR   WTRFUNCT,WTRFUNCT                                   0190 00311000
         IC    WTRFUNCT,IOPFUNCT(,IOPPTR)                          0190 00312000
*   WTRBUFSV=IOPBUFAD;              /* SAVE THE BUFFER ADDRESS       */ 00313000
         L     WTRBUFSV,IOPBUFAD(,IOPPTR)                          0191 00314000
*   IOPBUFAD=ADDR(OUTAREA);         /* AIM THE IOP BUFFER AT THE   0192 00315000
*                                      INTERNAL AREA                 */ 00316000
         LA    @10,OUTAREA                                         0192 00317000
         ST    @10,IOPBUFAD(,IOPPTR)                               0192 00318000
*   PRLRLEN=LENGTH(PRNTBUF);        /* INSERT RECORD LENGTH          */ 00319000
         MVC   PRLRLEN(2,@10),@CH01280                             0193 00320000
*   PRLHEAD=OFF;                    /* THIS IS NOT A HEADING         */ 00321000
*   PRLHEADO=OFF;                   /* DITTO                         */ 00322000
*   PRLBLANK=OFF;                   /* THIS LINE IS NOT BLANK        */ 00323000
         NI    PRLHEAD(@10),B'00011111'                            0196 00324000
*   IOPDSID=FVPDSID;                /* SEND TO INDICATED DSID        */ 00325000
         L     @10,@PC00001                                        0197 00326000
         MVC   IOPDSID(1,IOPPTR),FVPDSID(@10)                      0197 00327000
*   IOPFUNCT=IOPWRITE;              /* AND WRITE IT                  */ 00328000
         MVI   IOPFUNCT(IOPPTR),X'51'                              0198 00329000
*   CALL HMASMIO(HMASMIOP);         /* CALL THE I/O ROUTINE          */ 00330000
         ST    IOPPTR,@AL00001                                     0199 00331000
         L     @15,@CV01254                                        0199 00332000
         LA    @01,@AL00001                                        0199 00333000
         BALR  @14,@15                                             0199 00334000
*   PRNTBUF(1:LENGTH(PRNTBUF))=BLANK;/* THEN CLEAR THE AREA          */ 00335000
         MVI   PRNTBUF+1,C' '                                      0200 00336000
         MVC   PRNTBUF+2(118),PRNTBUF+1                            0200 00337000
         MVI   PRNTBUF,C' '                                        0200 00338000
*   IOPBUFAD=WTRBUFSV;              /* RESTORE BUFFER ADDRESS        */ 00339000
         ST    WTRBUFSV,IOPBUFAD(,IOPPTR)                          0201 00340000
*   IOPDSID=WTRDSID;                /*                               */ 00341000
         STC   WTRDSID,IOPDSID(,IOPPTR)                            0202 00342000
*   IOPFUNCT=WTRFUNCT;              /*                               */ 00343000
         STC   WTRFUNCT,IOPFUNCT(,IOPPTR)                          0203 00344000
*   RETURN CODE(IOPRETRN);          /*                               */ 00345000
         SLR   @15,@15                                             0204 00346000
         IC    @15,IOPRETRN(,IOPPTR)                               0204 00347000
         L     @14,@SA00002                                        0204 00348000
         LM    @00,@12,@SA00002+8                                  0204 00349000
         BR    @14                                                 0204 00350000
*   END FVLWRITE;                   /* RETURN TO CALLER              */ 00351000
*   END HMASMFVL                                                   0206 00352000
*                                                                  0206 00353000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00354000
*/*%INCLUDE SYSLIB  (HMASMCCA)                                       */ 00355000
*/*%INCLUDE SYSLIB  (HMASMIOP)                                       */ 00356000
*/*%INCLUDE SYSLIB  (HMASMPRL)                                       */ 00357000
*                                                                  0206 00358000
*       ;                                                          0206 00359000
@DATA    DS    0H                                                       00360000
@CH00274 DC    H'0'                                                     00361000
@CH00054 DC    H'1'                                                     00362000
@CH00457 DC    H'9'                                                     00363000
@CH00470 DC    H'17'                                                    00364000
@CH00472 DC    H'18'                                                    00365000
@CH01280 DC    H'120'                                                   00366000
@CH00646 DC    H'255'                                                   00367000
@SM01312 MVC   HDVSDATA-10(0,@08),FVPLDATA(@07)                         00368000
         DS    0F                                                       00369000
@SA00001 DS    18F                                                      00370000
@PC00001 DS    1F                                                       00371000
@SA00002 DS    0F                                                       00372000
         DS    15F                                                      00373000
@AL00001 DS    1A                                                       00374000
         DS    0F                                                       00375000
@CF00350 DC    F'10'                                                    00376000
@CH00350 EQU   @CF00350+2                                               00377000
@CF01310 DC    F'-17'                                                   00378000
@CF01311 DC    F'-16'                                                   00379000
@CF01307 DC    F'-15'                                                   00380000
@CF01309 DC    F'-9'                                                    00381000
@CV01254 DC    V(HMASMIO)                                               00382000
         DS    0D                                                       00383000
         DS    0D                                                       00384000
@TS00001 DS    CL8                                                      00385000
VERTEMP  DS    CL3                                                      00386000
SEPCHR   DS    CL1                                                      00387000
FVLSW    DS    BL1                                                      00388000
         ORG   FVLSW                                                    00389000
PRNTDONE DS    BL1                                                      00390000
@NM00177 EQU   FVLSW+0                                                  00391000
         ORG   FVLSW+1                                                  00392000
         DS    CL1                                                      00393000
PATCHFVL DS    CL80                                                     00394000
         ORG   PATCHFVL                                                 00395000
@NM00178 DC    80X'FF'                                                  00396000
         ORG   PATCHFVL+80                                              00397000
         DS    CL2                                                      00398000
OUTAREA  DS    CL130                                                    00399000
         ORG   OUTAREA                                                  00400000
PRNTPRLG DS    CL10                                                     00401000
PRNTBUF  DC    CL120' '                                                 00402000
         ORG   OUTAREA+130                                              00403000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00404000
@01      EQU   01                                                       00405000
@02      EQU   02                                                       00406000
@03      EQU   03                                                       00407000
@04      EQU   04                                                       00408000
@05      EQU   05                                                       00409000
@06      EQU   06                                                       00410000
@07      EQU   07                                                       00411000
@08      EQU   08                                                       00412000
@09      EQU   09                                                       00413000
@10      EQU   10                                                       00414000
@11      EQU   11                                                       00415000
@12      EQU   12                                                       00416000
@13      EQU   13                                                       00417000
@14      EQU   14                                                       00418000
@15      EQU   15                                                       00419000
WTRBUFSV EQU   @04                                                      00420000
WTRFUNCT EQU   @03                                                      00421000
WTRDSID  EQU   @02                                                      00422000
MAXPERLN EQU   @06                                                      00423000
TYPEINDX EQU   @04                                                      00424000
SUBNINDX EQU   @03                                                      00425000
PRNTINDX EQU   @05                                                      00426000
FVLRTNCD EQU   @02                                                      00427000
CCAPTR   EQU   @11                                                      00428000
IOPPTR   EQU   @09                                                      00429000
RTNCODE  EQU   @15                                                      00430000
RTNREG   EQU   @14                                                      00431000
FVPARRAY EQU   0                                                        00432000
FVPATYPE EQU   FVPARRAY                                                 00433000
FVPAEND  EQU   FVPATYPE                                                 00434000
FVPALEN  EQU   FVPARRAY+1                                               00435000
FVPAHEAD EQU   FVPARRAY+2                                               00436000
FVPLIST  EQU   0                                                        00437000
FVPLDATA EQU   FVPLIST                                                  00438000
FVPLEND  EQU   FVPLDATA                                                 00439000
FVPLSTAT EQU   FVPLDATA+7                                               00440000
FVPLTYPE EQU   FVPLIST+8                                                00441000
HMASMCCA EQU   0                                                        00442000
CCAFBUFR EQU   HMASMCCA+4                                               00443000
CCADSAD  EQU   CCAFBUFR+124                                             00444000
CCATPAD  EQU   CCAFBUFR+128                                             00445000
CCAFLAG7 EQU   CCAFBUFR+132                                             00446000
CCAFIOP  EQU   HMASMCCA+140                                             00447000
CCAIOPTR EQU   CCAFIOP                                                  00448000
CCAFSYS  EQU   HMASMCCA+148                                             00449000
CCASREL  EQU   CCAFSYS+12                                               00450000
CCAFLAGA EQU   CCAFSYS+21                                               00451000
CCAFSTA  EQU   HMASMCCA+188                                             00452000
CCAFICT  EQU   HMASMCCA+192                                             00453000
CCAFPGM  EQU   HMASMCCA+208                                             00454000
CCABLDLP EQU   CCAFPGM                                                  00455000
CCADBLDL EQU   CCAFPGM+4                                                00456000
CCAFGTP  EQU   HMASMCCA+224                                             00457000
CCASEGTP EQU   CCAFGTP                                                  00458000
@NM00013 EQU   HMASMCCA+244                                             00459000
CCAFFUNC EQU   HMASMCCA+264                                             00460000
CCAFLAG1 EQU   CCAFFUNC+8                                               00461000
CCALIST  EQU   CCAFLAG1                                                 00462000
CCAUNL   EQU   CCAFLAG1+1                                               00463000
CCAFLAG2 EQU   CCAFFUNC+11                                              00464000
CCAFPROC EQU   HMASMCCA+276                                             00465000
CCAFLAG3 EQU   CCAFPROC                                                 00466000
CCAFDIS  EQU   HMASMCCA+278                                             00467000
CCAFLAG4 EQU   CCAFDIS                                                  00468000
CCAFLAG5 EQU   CCAFDIS+1                                                00469000
CCAFLAG6 EQU   CCAFDIS+2                                                00470000
CCAFCNV  EQU   HMASMCCA+281                                             00471000
CCAFLAG8 EQU   CCAFCNV                                                  00472000
CCAFCTL  EQU   HMASMCCA+282                                             00473000
CCAFLAG9 EQU   CCAFCTL                                                  00474000
CCAFDSNG EQU   HMASMCCA+298                                             00475000
CCAFLAGB EQU   CCAFDSNG                                                 00476000
CCABLDLA EQU   0                                                        00477000
@NM00029 EQU   CCABLDLA                                                 00478000
CCABLDLL EQU   0                                                        00479000
@NM00031 EQU   CCABLDLL                                                 00480000
CCALKDRC EQU   @NM00031+20                                              00481000
@NM00033 EQU   CCABLDLL+124                                             00482000
CCAASMRC EQU   @NM00033+20                                              00483000
@NM00035 EQU   CCABLDLL+248                                             00484000
CCACPYRC EQU   @NM00035+20                                              00485000
@NM00037 EQU   CCABLDLL+372                                             00486000
CCACOMRC EQU   @NM00037+20                                              00487000
@NM00039 EQU   CCABLDLL+496                                             00488000
CCAZAPRC EQU   @NM00039+20                                              00489000
@NM00041 EQU   CCABLDLL+620                                             00490000
CCASUPRC EQU   @NM00041+20                                              00491000
@NM00043 EQU   CCABLDLL+744                                             00492000
CCAUPDRC EQU   @NM00043+20                                              00493000
CCABLDLM EQU   0                                                        00494000
CCABELMT EQU   CCABLDLM+4                                               00495000
CCABMPOS EQU   CCABELMT                                                 00496000
HMASMIOP EQU   0                                                        00497000
IOPDSID  EQU   HMASMIOP                                                 00498000
IOPFUNCT EQU   HMASMIOP+1                                               00499000
IOPRETRN EQU   HMASMIOP+2                                               00500000
IOPNAME  EQU   HMASMIOP+4                                               00501000
@NM00047 EQU   HMASMIOP+12                                              00502000
@NM00048 EQU   @NM00047                                                 00503000
IOPDDNAM EQU   HMASMIOP+24                                              00504000
IOPBUFAD EQU   HMASMIOP+52                                              00505000
IOPDRMAP EQU   HMASMIOP+56                                              00506000
IOPINAME EQU   IOPDRMAP                                                 00507000
IOPINAM  EQU   IOPINAME                                                 00508000
IOPITYP  EQU   IOPINAM                                                  00509000
IOPUSERL EQU   IOPDRMAP+11                                              00510000
IOPEND   EQU   IOPDRMAP+12                                              00511000
IOPLMCTL EQU   0                                                        00512000
IOPQSMIF EQU   0                                                        00513000
@NM00158 EQU   IOPQSMIF                                                 00514000
IOPQSMLS EQU   IOPQSMIF+8                                               00515000
IOPQSMNM EQU   IOPQSMLS                                                 00516000
IOPBS02  EQU   0                                                        00517000
IOPBS04  EQU   0                                                        00518000
IOPBAPF  EQU   IOPBS04                                                  00519000
HMASMPRL EQU   0                                                        00520000
PRLRLEN  EQU   HMASMPRL                                                 00521000
PRLSPAN  EQU   HMASMPRL+2                                               00522000
PRLFLGS  EQU   PRLSPAN                                                  00523000
PRLHEAD  EQU   PRLFLGS                                                  00524000
PRLHEADO EQU   PRLFLGS                                                  00525000
PRLBLANK EQU   PRLFLGS                                                  00526000
PRLDATE  EQU   HMASMPRL+4                                               00527000
PRLTIME  EQU   HMASMPRL+7                                               00528000
PRLEND   EQU   HMASMPRL+10                                              00529000
HDVLINE  EQU   0                                                        00530000
HDVPFX   EQU   HDVLINE                                                  00531000
HDSUBHD  EQU   HDVPFX                                                   00532000
HDVERN   EQU   HDSUBHD+11                                               00533000
HDSEPCHR EQU   HDVPFX+16                                                00534000
HDVSLIST EQU   HDVLINE+18                                               00535000
HDVSDATA EQU   HDVSLIST                                                 00536000
CCADSIDA EQU   0                                                        00537000
CCATYPEA EQU   0                                                        00538000
IOPBS01  EQU   0                                                        00539000
IOPBS03  EQU   0                                                        00540000
HMASMFVP EQU   0                                                        00541000
FVPARRAD EQU   HMASMFVP                                                 00542000
FVPLSTAD EQU   HMASMFVP+4                                               00543000
FVPLNLEN EQU   HMASMFVP+8                                               00544000
FVPOFFST EQU   HMASMFVP+10                                              00545000
FVPVERN  EQU   HMASMFVP+12                                              00546000
FVPDSID  EQU   HMASMFVP+13                                              00547000
FVPRETRN EQU   HMASMFVP+14                                              00548000
IOPUDATA EQU   IOPEND                                                   00549000
IOPINAM3 EQU   IOPINAME                                                 00550000
@NM00054 EQU   IOPINAM3                                                 00551000
IOPSTCMP EQU   IOPUDATA                                                 00552000
IOPDYNDT EQU   IOPUDATA                                                 00553000
IOPSPACE EQU   IOPDYNDT+44                                              00554000
IOPDTYPE EQU   IOPDYNDT+50                                              00555000
IOPNTMAX EQU   IOPDRMAP                                                 00556000
IOPNTMAP EQU   IOPDRMAP                                                 00557000
IOPCDMAP EQU   IOPNTMAP                                                 00558000
IOPPTMAP EQU   IOPCDMAP                                                 00559000
IOPSCMAP EQU   IOPPTMAP                                                 00560000
IOPDIRCT EQU   IOPSCMAP+12                                              00561000
IOPCDMAX EQU   IOPDIRCT                                                 00562000
IOPCQMAP EQU   IOPDRMAP                                                 00563000
@NM00065 EQU   IOPUDATA                                                 00564000
@NM00066 EQU   IOPUDATA                                                 00565000
IOPASMNT EQU   IOPUDATA                                                 00566000
IOPASMDR EQU   IOPASMNT                                                 00567000
IOPABUNT EQU   IOPASMDR+1                                               00568000
IOPLMDNT EQU   IOPUDATA                                                 00569000
IOPLMDDR EQU   IOPLMDNT                                                 00570000
IOPLMLEP EQU   IOPLMDDR+1                                               00571000
IOPLMDF1 EQU   IOPLMLEP                                                 00572000
IOPFLGS2 EQU   IOPLMDF1                                                 00573000
IOPLMDF2 EQU   IOPLMLEP+1                                               00574000
IOPLMDF3 EQU   IOPLMLEP+2                                               00575000
IOPLMDF4 EQU   IOPLMLEP+3                                               00576000
IOPLMDF5 EQU   IOPLMDDR+5                                               00577000
IOPFLGS3 EQU   IOPLMDF5                                                 00578000
IOPLMDFX EQU   IOPLMDNT+24                                              00579000
@NM00075 EQU   IOPLMDFX                                                 00580000
IOPLNTRY EQU   IOPLMDFX+8                                               00581000
IOPLSYS  EQU   IOPLNTRY                                                 00582000
IOPSYSLB EQU   IOPLSYS                                                  00583000
IOPMACNT EQU   IOPUDATA                                                 00584000
IOPMACDR EQU   IOPMACNT                                                 00585000
IOPRMIDE EQU   IOPMACDR+1                                               00586000
IOPRMST  EQU   IOPRMIDE+7                                               00587000
IOPFMIDE EQU   IOPMACDR+9                                               00588000
IOPMACFX EQU   IOPMACNT+24                                              00589000
IOPBUNT  EQU   IOPMACFX                                                 00590000
IOPMCEND EQU   IOPMACNT+104                                             00591000
IOPMACVR EQU   IOPMCEND                                                 00592000
IOPMCENT EQU   IOPMACVR                                                 00593000
IOPMCDTA EQU   IOPMCENT                                                 00594000
IOPMCASM EQU   IOPMCDTA                                                 00595000
IOPMACID EQU   IOPMCASM                                                 00596000
IOPMACST EQU   IOPMCASM+7                                               00597000
IOPMCIND EQU   IOPMCENT+8                                               00598000
IOPEOFNT EQU   IOPUDATA                                                 00599000
IOPSRCNT EQU   IOPUDATA                                                 00600000
IOPSRCDR EQU   IOPSRCNT                                                 00601000
@NM00086 EQU   IOPSRCDR+1                                               00602000
@NM00088 EQU   @NM00086+7                                               00603000
@NM00092 EQU   IOPSRCDR+9                                               00604000
IOPSRCFX EQU   IOPSRCNT+24                                              00605000
@NM00096 EQU   IOPSRCFX                                                 00606000
IOPSREND EQU   IOPSRCNT+104                                             00607000
IOPSRCVR EQU   IOPSREND                                                 00608000
IOPSNTRY EQU   IOPSRCVR                                                 00609000
IOPSRDTA EQU   IOPSNTRY                                                 00610000
IOPSRCID EQU   IOPSRDTA                                                 00611000
IOPSRCST EQU   IOPSRDTA+7                                               00612000
IOPMODNT EQU   IOPUDATA                                                 00613000
IOPMODDR EQU   IOPMODNT                                                 00614000
@NM00102 EQU   IOPMODDR+1                                               00615000
@NM00104 EQU   @NM00102+7                                               00616000
@NM00108 EQU   IOPMODDR+9                                               00617000
IOPMODFX EQU   IOPMODNT+24                                              00618000
@NM00112 EQU   IOPMODFX                                                 00619000
IOPMDLEP EQU   IOPMODFX+8                                               00620000
IOPMODF1 EQU   IOPMDLEP                                                 00621000
IOPMODF2 EQU   IOPMDLEP+1                                               00622000
IOPMODF3 EQU   IOPMDLEP+2                                               00623000
IOPMODF4 EQU   IOPMDLEP+3                                               00624000
IOPMDEND EQU   IOPMODNT+104                                             00625000
IOPMODVR EQU   IOPMDEND                                                 00626000
IOPMNTRY EQU   IOPMODVR                                                 00627000
IOPMDDTA EQU   IOPMNTRY                                                 00628000
IOPLMODS EQU   IOPMDDTA                                                 00629000
IOPMODID EQU   IOPLMODS                                                 00630000
IOPMODST EQU   IOPLMODS+7                                               00631000
IOPDLBNT EQU   IOPUDATA                                                 00632000
IOPDLBDR EQU   IOPDLBNT                                                 00633000
IOPDLBFX EQU   IOPDLBNT+24                                              00634000
@NM00123 EQU   IOPDLBFX                                                 00635000
IOPDLEND EQU   IOPDLBNT+104                                             00636000
IOPDLBVR EQU   IOPDLEND                                                 00637000
IOPDNTRY EQU   IOPDLBVR                                                 00638000
IOPDSYS  EQU   IOPDNTRY                                                 00639000
IOPSYSNT EQU   IOPUDATA                                                 00640000
IOPSYSDR EQU   IOPSYSNT                                                 00641000
IOPSYSF1 EQU   IOPSYSDR+4                                               00642000
IOPFLGS7 EQU   IOPSYSF1                                                 00643000
IOPSYSFX EQU   IOPSYSNT+24                                              00644000
@NM00130 EQU   IOPSYSFX                                                 00645000
IOPSYEND EQU   IOPSYSNT+184                                             00646000
IOPSYSVR EQU   IOPSYEND                                                 00647000
IOPSYSTR EQU   IOPSYSVR                                                 00648000
IOPSYNTR EQU   IOPSYSTR                                                 00649000
IOPPTFNT EQU   IOPUDATA                                                 00650000
IOPPTFDR EQU   IOPPTFNT                                                 00651000
IOPPSTAT EQU   IOPPTFDR+2                                               00652000
IOPPTFF1 EQU   IOPPSTAT                                                 00653000
IOPFLGS5 EQU   IOPPTFF1                                                 00654000
IOPPTFF2 EQU   IOPPSTAT+1                                               00655000
IOPPTFF3 EQU   IOPPSTAT+3                                               00656000
IOPPTFFX EQU   IOPPTFNT+24                                              00657000
@NM00139 EQU   IOPPTFFX                                                 00658000
@NM00140 EQU   @NM00139                                                 00659000
IOPPDTES EQU   IOPPTFFX+41                                              00660000
@NM00143 EQU   IOPPDTES                                                 00661000
IOPPTPFX EQU   IOPPDTES+6                                               00662000
IOPDATES EQU   IOPPTPFX                                                 00663000
IOPPTEND EQU   IOPPTFNT+104                                             00664000
IOPPTFVR EQU   IOPPTEND                                                 00665000
IOPPNTRY EQU   IOPPTFVR                                                 00666000
IOPPMODS EQU   IOPPNTRY                                                 00667000
IOPENTNT EQU   IOPUDATA+104                                             00668000
IOPSRLNT EQU   IOPUDATA+104                                             00669000
IOPPRENT EQU   IOPUDATA+104                                             00670000
IOPNPRNT EQU   IOPUDATA+104                                             00671000
IOPSUPNT EQU   IOPUDATA+104                                             00672000
IOPREQNT EQU   IOPUDATA+104                                             00673000
IOPIRQNT EQU   IOPUDATA+104                                             00674000
IOPFIDNT EQU   IOPUDATA+104                                             00675000
IOPDELNT EQU   IOPUDATA+104                                             00676000
IOPVERNT EQU   IOPUDATA+104                                             00677000
IOPSBYNT EQU   IOPUDATA+104                                             00678000
IOPQSMNT EQU   IOPUDATA                                                 00679000
IOPQSMDR EQU   IOPQSMNT                                                 00680000
IOPQFMNT EQU   IOPUDATA                                                 00681000
IOPQFMDR EQU   IOPQFMNT                                                 00682000
IOPQFEND EQU   IOPQFMNT+2                                               00683000
IOPQFMVR EQU   IOPQFEND                                                 00684000
IOPQFMLS EQU   IOPQFMVR                                                 00685000
IOPQFMNM EQU   IOPQFMLS                                                 00686000
IOPPTSYS EQU   IOPUDATA                                                 00687000
IOPPTSDR EQU   IOPPTSYS                                                 00688000
IOPPTSFX EQU   IOPPTSYS+24                                              00689000
IOPDSSPC EQU   IOPPTSFX                                                 00690000
IOPPTFG1 EQU   IOPPTSFX+34                                              00691000
IOPPSEND EQU   IOPPTSYS+1064                                            00692000
IOPPTSVR EQU   IOPPSEND                                                 00693000
IOPPTNTR EQU   IOPPTSVR                                                 00694000
@NM00168 EQU   IOPPTNTR                                                 00695000
IOPPTFMD EQU   @NM00168                                                 00696000
IOPPTREL EQU   IOPPTFMD                                                 00697000
IOPBPDS  EQU   IOPUDATA                                                 00698000
IOPBLEP1 EQU   IOPBPDS+8                                                00699000
IOPBLEP2 EQU   IOPBPDS+9                                                00700000
@NM00172 EQU   IOPBPDS+18                                               00701000
IOPBFTB0 EQU   @NM00172                                                 00702000
IOPBFTB1 EQU   IOPBFTB0                                                 00703000
PRLDATA  EQU   PRLEND                                                   00704000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00705000
IOPBCEND EQU   IOPBPDS+21                                               00706000
IOPBFTB3 EQU   IOPBFTB0+2                                               00707000
IOPBFTB2 EQU   IOPBFTB0+1                                               00708000
@NM00174 EQU   IOPBFTB1                                                 00709000
IOPBAPFP EQU   IOPBFTB1                                                 00710000
IOPBSSI  EQU   IOPBFTB1                                                 00711000
IOPBPAGA EQU   IOPBFTB1                                                 00712000
@NM00173 EQU   IOPBFTB1                                                 00713000
IOPBAOSL EQU   IOPBFTB1                                                 00714000
IOPBSEPA EQU   IOPBPDS+15                                               00715000
IOPBFTBL EQU   IOPBPDS+13                                               00716000
IOPBSTOR EQU   IOPBPDS+10                                               00717000
IOPBREFR EQU   IOPBLEP2                                                 00718000
IOPBLEF  EQU   IOPBLEP2                                                 00719000
IOPBTEST EQU   IOPBLEP2                                                 00720000
IOPBNE   EQU   IOPBLEP2                                                 00721000
@NM00171 EQU   IOPBLEP2                                                 00722000
IOPBDC   EQU   IOPBLEP2                                                 00723000
@NM00170 EQU   IOPBLEP1                                                 00724000
IOPBSCTR EQU   IOPBLEP1                                                 00725000
IOPBOL   EQU   IOPBLEP1                                                 00726000
@NM00169 EQU   IOPBLEP1                                                 00727000
IOPBOVLY EQU   IOPBLEP1                                                 00728000
IOPBREUS EQU   IOPBLEP1                                                 00729000
IOPBRENT EQU   IOPBLEP1                                                 00730000
IOPBNL   EQU   IOPBPDS+7                                                00731000
IOPBTTRN EQU   IOPBPDS+4                                                00732000
IOPBZERO EQU   IOPBPDS+3                                                00733000
IOPBTTRT EQU   IOPBPDS                                                  00734000
IOPPTIND EQU   IOPPTNTR+8                                               00735000
IOPPTSND EQU   IOPPTREL                                                 00736000
@NM00167 EQU   IOPPTSFX+872                                             00737000
IOPSYZPP EQU   IOPPTSFX+772                                             00738000
IOPSYZPR EQU   IOPPTSFX+771                                             00739000
IOPSYZPS EQU   IOPPTSFX+763                                             00740000
IOPSYZAP EQU   IOPPTSFX+755                                             00741000
IOPSYUPP EQU   IOPPTSFX+655                                             00742000
IOPSYUPR EQU   IOPPTSFX+654                                             00743000
IOPSYUPS EQU   IOPPTSFX+646                                             00744000
IOPSYUPD EQU   IOPPTSFX+638                                             00745000
IOPSYSPP EQU   IOPPTSFX+538                                             00746000
IOPSYSPR EQU   IOPPTSFX+537                                             00747000
IOPSYSPS EQU   IOPPTSFX+529                                             00748000
IOPSYSUP EQU   IOPPTSFX+521                                             00749000
IOPSYLKP EQU   IOPPTSFX+421                                             00750000
IOPSYLKR EQU   IOPPTSFX+420                                             00751000
IOPSYLKS EQU   IOPPTSFX+412                                             00752000
IOPSYLKD EQU   IOPPTSFX+404                                             00753000
IOPSYCPP EQU   IOPPTSFX+304                                             00754000
IOPSYCPR EQU   IOPPTSFX+303                                             00755000
IOPSYCPS EQU   IOPPTSFX+295                                             00756000
IOPSYCPY EQU   IOPPTSFX+287                                             00757000
IOPSYCOP EQU   IOPPTSFX+187                                             00758000
IOPSYCOR EQU   IOPPTSFX+186                                             00759000
IOPSYCOS EQU   IOPPTSFX+178                                             00760000
IOPSYCOM EQU   IOPPTSFX+170                                             00761000
IOPSYASP EQU   IOPPTSFX+70                                              00762000
IOPSYASR EQU   IOPPTSFX+69                                              00763000
IOPSYASS EQU   IOPPTSFX+61                                              00764000
IOPSYASM EQU   IOPPTSFX+53                                              00765000
@NM00166 EQU   IOPPTSFX+35                                              00766000
@NM00165 EQU   IOPPTFG1                                                 00767000
IOPPTSNJ EQU   IOPPTFG1                                                 00768000
IOPPTSNP EQU   IOPPTFG1                                                 00769000
IOPSYPLN EQU   IOPPTSFX+32                                              00770000
IOPDSPFX EQU   IOPPTSFX+6                                               00771000
IOPDSDIR EQU   IOPDSSPC+4                                               00772000
IOPDSSEC EQU   IOPDSSPC+2                                               00773000
IOPDSPRM EQU   IOPDSSPC                                                 00774000
@NM00164 EQU   IOPPTSDR+4                                               00775000
IOPPTPEM EQU   IOPPTSDR+2                                               00776000
IOPPCNVL EQU   IOPPTSDR+1                                               00777000
@NM00163 EQU   IOPPTSDR                                                 00778000
IOPQFMTP EQU   IOPQFMLS+8                                               00779000
@NM00162 EQU   IOPQFMLS+7                                               00780000
IOPQFMND EQU   IOPQFMNM                                                 00781000
@NM00161 EQU   IOPQFMDR                                                 00782000
@NM00157 EQU   IOPQSMDR                                                 00783000
@NM00156 EQU   IOPSBYNT+8                                               00784000
IOPSBYST EQU   IOPSBYNT+7                                               00785000
IOPSBYNM EQU   IOPSBYNT                                                 00786000
@NM00155 EQU   IOPVERNT+8                                               00787000
IOPVERST EQU   IOPVERNT+7                                               00788000
IOPVERNM EQU   IOPVERNT                                                 00789000
@NM00154 EQU   IOPDELNT+8                                               00790000
IOPDELST EQU   IOPDELNT+7                                               00791000
IOPDELNM EQU   IOPDELNT                                                 00792000
@NM00153 EQU   IOPFIDNT+8                                               00793000
IOPFIDST EQU   IOPFIDNT+7                                               00794000
IOPFIDNM EQU   IOPFIDNT                                                 00795000
@NM00152 EQU   IOPIRQNT+8                                               00796000
IOPIRQST EQU   IOPIRQNT+7                                               00797000
IOPIRQNM EQU   IOPIRQNT                                                 00798000
@NM00151 EQU   IOPREQNT+8                                               00799000
IOPREQST EQU   IOPREQNT+7                                               00800000
IOPREQNM EQU   IOPREQNT                                                 00801000
@NM00150 EQU   IOPSUPNT+8                                               00802000
IOPSUPST EQU   IOPSUPNT+7                                               00803000
IOPSUPNM EQU   IOPSUPNT                                                 00804000
@NM00149 EQU   IOPNPRNT+8                                               00805000
IOPNPRST EQU   IOPNPRNT+7                                               00806000
IOPNPRNM EQU   IOPNPRNT                                                 00807000
@NM00148 EQU   IOPPRENT+8                                               00808000
IOPPREST EQU   IOPPRENT+7                                               00809000
IOPPRENM EQU   IOPPRENT                                                 00810000
@NM00147 EQU   IOPSRLNT+8                                               00811000
IOPSRLST EQU   IOPSRLNT+7                                               00812000
@NM00146 EQU   IOPSRLNT+4                                               00813000
IOPSRLNM EQU   IOPSRLNT                                                 00814000
@NM00145 EQU   IOPENTNT+8                                               00815000
IOPENTST EQU   IOPENTNT+7                                               00816000
IOPENTNM EQU   IOPENTNT                                                 00817000
IOPPIND  EQU   IOPPNTRY+8                                               00818000
IOPPTFND EQU   IOPPMODS                                                 00819000
IOPPFMID EQU   IOPPTFFX+73                                              00820000
@NM00144 EQU   IOPPTPFX+24                                              00821000
IOPUCLT  EQU   IOPDATES+21                                              00822000
IOPUCLD  EQU   IOPDATES+18                                              00823000
IOPACCT  EQU   IOPDATES+15                                              00824000
IOPACCD  EQU   IOPDATES+12                                              00825000
IOPRSTT  EQU   IOPDATES+9                                               00826000
IOPRSTD  EQU   IOPDATES+6                                               00827000
IOPAPPT  EQU   IOPDATES+3                                               00828000
IOPAPPD  EQU   IOPDATES                                                 00829000
IOPRECT  EQU   @NM00143+3                                               00830000
IOPRECD  EQU   @NM00143                                                 00831000
@NM00142 EQU   IOPPTFFX+8                                               00832000
@NM00141 EQU   @NM00139+7                                               00833000
IOPPRELN EQU   @NM00140                                                 00834000
@NM00138 EQU   IOPPTFDR+20                                              00835000
IOPSBYNO EQU   IOPPTFDR+13                                              00836000
IOPDBYNO EQU   IOPPTFDR+6                                               00837000
@NM00137 EQU   IOPPTFF3                                                 00838000
IOPFLF   EQU   IOPPTFF3                                                 00839000
IOPDBYP  EQU   IOPPTFF3                                                 00840000
IOPSBYP  EQU   IOPPTFF3                                                 00841000
IOPPMDLP EQU   IOPPTFF2+1                                               00842000
IOPPADDP EQU   IOPPTFF2+1                                               00843000
@NM00136 EQU   IOPPTFF2+1                                               00844000
IOPLRFP  EQU   IOPPTFF2                                                 00845000
IOPJCLP  EQU   IOPPTFF2                                                 00846000
IOPSUPP  EQU   IOPPTFF2                                                 00847000
IOPREQP  EQU   IOPPTFF2                                                 00848000
IOPPREP  EQU   IOPPTFF2                                                 00849000
IOPNPRP  EQU   IOPPTFF2                                                 00850000
IOPIRQP  EQU   IOPPTFF2                                                 00851000
IOPDELP  EQU   IOPPTFF2                                                 00852000
IOPREGEN EQU   IOPFLGS5                                                 00853000
IOPBYP   EQU   IOPFLGS5                                                 00854000
IOPDUMMP EQU   IOPFLGS5                                                 00855000
@NM00135 EQU   IOPFLGS5                                                 00856000
IOPERROR EQU   IOPFLGS5                                                 00857000
IOPACC   EQU   IOPFLGS5                                                 00858000
IOPRES   EQU   IOPFLGS5                                                 00859000
IOPAPP   EQU   IOPFLGS5                                                 00860000
IOPPTYPE EQU   IOPPTFDR+1                                               00861000
@NM00134 EQU   IOPPTFDR                                                 00862000
IOPSYSTP EQU   IOPSYSTR+8                                               00863000
IOPSYSND EQU   IOPSYNTR                                                 00864000
@NM00133 EQU   IOPSYSFX+21                                              00865000
IOPSYSID EQU   IOPSYSFX+13                                              00866000
IOPNUCID EQU   IOPSYSFX+12                                              00867000
IOPSREL  EQU   IOPSYSFX+8                                               00868000
@NM00132 EQU   @NM00130+7                                               00869000
@NM00131 EQU   @NM00130                                                 00870000
@NM00129 EQU   IOPSYSDR+5                                               00871000
@NM00128 EQU   IOPFLGS7                                                 00872000
IOPSYNG  EQU   IOPFLGS7                                                 00873000
IOPSYDL  EQU   IOPFLGS7                                                 00874000
IOPSTSNP EQU   IOPFLGS7                                                 00875000
IOPMTSNP EQU   IOPFLGS7                                                 00876000
IOPPEMAX EQU   IOPSYSDR+2                                               00877000
IOPSCNVL EQU   IOPSYSDR+1                                               00878000
@NM00127 EQU   IOPSYSDR                                                 00879000
IOPDLIND EQU   IOPDNTRY+8                                               00880000
IOPDLBND EQU   IOPDSYS                                                  00881000
@NM00126 EQU   IOPDLBFX+8                                               00882000
@NM00125 EQU   @NM00123+7                                               00883000
@NM00124 EQU   @NM00123                                                 00884000
@NM00122 EQU   IOPDLBDR+1                                               00885000
@NM00121 EQU   IOPDLBDR                                                 00886000
IOPMDIND EQU   IOPMNTRY+8                                               00887000
@NM00120 EQU   IOPMODST                                                 00888000
IOPMODND EQU   IOPMODID                                                 00889000
IOPDLIB  EQU   IOPMODFX+72                                              00890000
@NM00119 EQU   IOPMODFX+12                                              00891000
@NM00118 EQU   IOPMODF4                                                 00892000
@NM00117 EQU   IOPMODF3                                                 00893000
@NM00116 EQU   IOPMODF2                                                 00894000
IOPMPAGA EQU   IOPMODF2                                                 00895000
IOPMNE   EQU   IOPMODF2                                                 00896000
@NM00115 EQU   IOPMODF1                                                 00897000
IOPMDC   EQU   IOPMODF1                                                 00898000
IOPMREFR EQU   IOPMODF1                                                 00899000
IOPMOVLY EQU   IOPMODF1                                                 00900000
IOPMSCTR EQU   IOPMODF1                                                 00901000
IOPMREUS EQU   IOPMODF1                                                 00902000
IOPMRENT EQU   IOPMODF1                                                 00903000
IOPMAPF  EQU   IOPMODF1                                                 00904000
@NM00114 EQU   @NM00112+7                                               00905000
@NM00113 EQU   @NM00112                                                 00906000
@NM00111 EQU   IOPMODDR+17                                              00907000
@NM00110 EQU   @NM00108+7                                               00908000
@NM00109 EQU   @NM00108                                                 00909000
@NM00107 EQU   @NM00104                                                 00910000
@NM00106 EQU   @NM00104                                                 00911000
@NM00105 EQU   @NM00104                                                 00912000
@NM00103 EQU   @NM00102                                                 00913000
@NM00101 EQU   IOPMODDR                                                 00914000
IOPSRIND EQU   IOPSNTRY+8                                               00915000
@NM00100 EQU   IOPSRCST                                                 00916000
IOPSRCND EQU   IOPSRCID                                                 00917000
IOPSRDLB EQU   IOPSRCFX+72                                              00918000
IOPSRSYS EQU   IOPSRCFX+64                                              00919000
@NM00099 EQU   IOPSRCFX+8                                               00920000
@NM00098 EQU   @NM00096+7                                               00921000
@NM00097 EQU   @NM00096                                                 00922000
@NM00095 EQU   IOPSRCDR+18                                              00923000
IOPSRLNG EQU   IOPSRCDR+17                                              00924000
@NM00094 EQU   @NM00092+7                                               00925000
@NM00093 EQU   @NM00092                                                 00926000
@NM00091 EQU   @NM00088                                                 00927000
@NM00090 EQU   @NM00088                                                 00928000
@NM00089 EQU   @NM00088                                                 00929000
@NM00087 EQU   @NM00086                                                 00930000
@NM00085 EQU   IOPSRCDR                                                 00931000
IOPEOFND EQU   IOPEOFNT                                                 00932000
IOPMCTYP EQU   IOPMCIND                                                 00933000
@NM00084 EQU   IOPMACST                                                 00934000
IOPMACND EQU   IOPMACID                                                 00935000
IOPMCDLB EQU   IOPMACFX+72                                              00936000
IOPMCSYS EQU   IOPMACFX+64                                              00937000
@NM00083 EQU   IOPMACFX+8                                               00938000
IOPBUTYP EQU   IOPBUNT+7                                                00939000
IOPBUSMD EQU   IOPBUNT                                                  00940000
@NM00082 EQU   IOPMACDR+18                                              00941000
IOPMCLNG EQU   IOPMACDR+17                                              00942000
IOPFMST  EQU   IOPFMIDE+7                                               00943000
IOPFMID  EQU   IOPFMIDE                                                 00944000
@NM00081 EQU   IOPRMST                                                  00945000
IOPRMASM EQU   IOPRMST                                                  00946000
@NM00080 EQU   IOPRMST                                                  00947000
IOPRMID  EQU   IOPRMIDE                                                 00948000
@NM00079 EQU   IOPMACDR                                                 00949000
IOPLMIND EQU   IOPLNTRY+8                                               00950000
IOPLMDND EQU   IOPSYSLB                                                 00951000
@NM00077 EQU   @NM00075+7                                               00952000
@NM00076 EQU   @NM00075                                                 00953000
@NM00074 EQU   IOPLMDDR+6                                               00954000
@NM00073 EQU   IOPFLGS3                                                 00955000
IOPCHREP EQU   IOPFLGS3                                                 00956000
IOPLINK  EQU   IOPFLGS3                                                 00957000
IOPCOPY  EQU   IOPFLGS3                                                 00958000
@NM00072 EQU   IOPLMDF4                                                 00959000
@NM00071 EQU   IOPLMDF3                                                 00960000
@NM00070 EQU   IOPLMDF2                                                 00961000
IOPPAGA  EQU   IOPLMDF2                                                 00962000
IOPNE    EQU   IOPLMDF2                                                 00963000
@NM00069 EQU   IOPFLGS2                                                 00964000
IOPDC    EQU   IOPFLGS2                                                 00965000
IOPREFR  EQU   IOPFLGS2                                                 00966000
IOPOVLY  EQU   IOPFLGS2                                                 00967000
IOPSCTR  EQU   IOPFLGS2                                                 00968000
IOPREUS  EQU   IOPFLGS2                                                 00969000
IOPRENT  EQU   IOPFLGS2                                                 00970000
IOPAPF   EQU   IOPFLGS2                                                 00971000
@NM00068 EQU   IOPLMDDR                                                 00972000
@NM00067 EQU   IOPASMDR+9                                               00973000
IOPABUTP EQU   IOPABUNT+7                                               00974000
IOPABUPT EQU   IOPABUNT                                                 00975000
IOPNTLVL EQU   IOPASMDR                                                 00976000
IOPALLOC EQU   @NM00066+4                                               00977000
IOPUSED  EQU   @NM00066                                                 00978000
IOPTPSEQ EQU   @NM00065+8                                               00979000
IOPVLSER EQU   @NM00065+2                                               00980000
IOPBLKSI EQU   @NM00065                                                 00981000
IOPCQMAX EQU   IOPCQMAP+12                                              00982000
@NM00064 EQU   IOPCQMAP+11                                              00983000
@NM00063 EQU   IOPCQMAP+8                                               00984000
@NM00062 EQU   IOPCQMAP                                                 00985000
IOPPTMAX EQU   IOPCDMAX                                                 00986000
@NM00061 EQU   IOPSCMAP+11                                              00987000
@NM00060 EQU   IOPSCMAP+8                                               00988000
@NM00059 EQU   IOPSCMAP                                                 00989000
IOPDIRMX EQU   IOPNTMAX+12                                              00990000
@NM00058 EQU   IOPNTMAX+11                                              00991000
@NM00057 EQU   IOPNTMAX+8                                               00992000
@NM00056 EQU   IOPNTMAX                                                 00993000
@NM00055 EQU   IOPDTYPE                                                 00994000
IOPDMOD  EQU   IOPDTYPE                                                 00995000
IOPDJCL  EQU   IOPDTYPE                                                 00996000
IOPDSRC  EQU   IOPDTYPE                                                 00997000
IOPDMAC  EQU   IOPDTYPE                                                 00998000
IOPSDIR  EQU   IOPSPACE+4                                               00999000
IOPSSCND EQU   IOPSPACE+2                                               01000000
IOPSPRIM EQU   IOPSPACE                                                 01001000
IOPDSN   EQU   IOPDYNDT                                                 01002000
IOPNTYPE EQU   IOPSTCMP+17                                              01003000
IOPNNAME EQU   IOPSTCMP+9                                               01004000
IOPOTYPE EQU   IOPSTCMP+8                                               01005000
IOPONAME EQU   IOPSTCMP                                                 01006000
IOPISEQ3 EQU   IOPINAM3+6                                               01007000
IOPITYP3 EQU   @NM00054+5                                               01008000
IOPIPTF3 EQU   @NM00054                                                 01009000
@NM00183 EQU   HDVSLIST+8                                               01010000
@NM00182 EQU   HDVPFX+17                                                01011000
@NM00181 EQU   HDVPFX+15                                                01012000
@NM00180 EQU   HDSUBHD+14                                               01013000
@NM00179 EQU   HDSUBHD                                                  01014000
PRLCONC  EQU   PRLTIME+2                                                01015000
@NM00176 EQU   PRLTIME                                                  01016000
PRLHDADR EQU   PRLDATE                                                  01017000
@NM00175 EQU   PRLFLGS                                                  01018000
IOPBS04E EQU   IOPBS04+2                                                01019000
IOPBAPFC EQU   IOPBAPF+1                                                01020000
IOPBAPFL EQU   IOPBAPF                                                  01021000
IOPBS2NM EQU   IOPBS02+3                                                01022000
IOPBS2EP EQU   IOPBS02                                                  01023000
IOPQSMTP EQU   IOPQSMLS+8                                               01024000
@NM00160 EQU   IOPQSMLS+7                                               01025000
IOPQSMND EQU   IOPQSMNM                                                 01026000
@NM00159 EQU   @NM00158+7                                               01027000
IOPQSMFM EQU   @NM00158                                                 01028000
@NM00078 EQU   IOPLMCTL+17                                              01029000
IOPLMCRD EQU   IOPLMCTL+9                                               01030000
IOPLMCRN EQU   IOPLMCTL+1                                               01031000
IOPLMCC  EQU   IOPLMCTL                                                 01032000
@NM00053 EQU   IOPUSERL                                                 01033000
@NM00052 EQU   IOPUSERL                                                 01034000
IOPALIS  EQU   IOPUSERL                                                 01035000
IOPTTR   EQU   IOPDRMAP+8                                               01036000
IOPINAM2 EQU   IOPINAM+1                                                01037000
IOPITYP2 EQU   IOPITYP                                                  01038000
@NM00051 EQU   HMASMIOP+32                                              01039000
IOPDELDD EQU   IOPDDNAM                                                 01040000
@NM00050 EQU   @NM00047+10                                              01041000
IOPSEQNO EQU   @NM00047+8                                               01042000
@NM00049 EQU   @NM00048+7                                               01043000
IOPPTFNM EQU   @NM00048                                                 01044000
IOPNAM17 EQU   IOPNAME                                                  01045000
IOPTYPE  EQU   HMASMIOP+3                                               01046000
CCABMREC EQU   CCABELMT+10                                              01047000
CCABPOS  EQU   CCABMPOS+8                                               01048000
CCABNAME EQU   CCABMPOS                                                 01049000
@NM00046 EQU   CCABLDLM+2                                               01050000
@NM00045 EQU   CCABLDLM                                                 01051000
CCAUPDPM EQU   @NM00043+24                                              01052000
@NM00044 EQU   @NM00043+21                                              01053000
CCARUPDT EQU   CCAUPDRC                                                 01054000
CCAUPDSP EQU   @NM00043+12                                              01055000
CCAUPDTE EQU   @NM00043+8                                               01056000
CCAUPDNM EQU   @NM00043                                                 01057000
CCASUPPM EQU   @NM00041+24                                              01058000
@NM00042 EQU   @NM00041+21                                              01059000
CCARSUP  EQU   CCASUPRC                                                 01060000
CCASUPSP EQU   @NM00041+12                                              01061000
CCAIOSUP EQU   @NM00041+8                                               01062000
CCASUPNM EQU   @NM00041                                                 01063000
CCAZAPPM EQU   @NM00039+24                                              01064000
@NM00040 EQU   @NM00039+21                                              01065000
CCARZAP  EQU   CCAZAPRC                                                 01066000
CCAZAPSP EQU   @NM00039+12                                              01067000
CCASPZAP EQU   @NM00039+8                                               01068000
CCAZAPNM EQU   @NM00039                                                 01069000
CCACOMPM EQU   @NM00037+24                                              01070000
@NM00038 EQU   @NM00037+21                                              01071000
CCARCOMP EQU   CCACOMRC                                                 01072000
CCACOMSP EQU   @NM00037+12                                              01073000
CCACOMRS EQU   @NM00037+8                                               01074000
CCACOMNM EQU   @NM00037                                                 01075000
CCACPYPM EQU   @NM00035+24                                              01076000
@NM00036 EQU   @NM00035+21                                              01077000
CCARCOPY EQU   CCACPYRC                                                 01078000
CCACPYSP EQU   @NM00035+12                                              01079000
CCACOPY  EQU   @NM00035+8                                               01080000
CCACPYNM EQU   @NM00035                                                 01081000
CCAASMPM EQU   @NM00033+24                                              01082000
@NM00034 EQU   @NM00033+21                                              01083000
CCARASM  EQU   CCAASMRC                                                 01084000
CCAASMSP EQU   @NM00033+12                                              01085000
CCAASM   EQU   @NM00033+8                                               01086000
CCAASMNM EQU   @NM00033                                                 01087000
CCALKDPM EQU   @NM00031+24                                              01088000
@NM00032 EQU   @NM00031+21                                              01089000
CCARLINK EQU   CCALKDRC                                                 01090000
CCALKDSP EQU   @NM00031+12                                              01091000
CCALKED  EQU   @NM00031+8                                               01092000
CCALKDNM EQU   @NM00031                                                 01093000
CCAPGMPM EQU   @NM00029+24                                              01094000
@NM00030 EQU   @NM00029+21                                              01095000
CCABPGRC EQU   @NM00029+20                                              01096000
CCABPGSP EQU   @NM00029+12                                              01097000
CCABPGAD EQU   @NM00029+8                                               01098000
CCABPGNM EQU   @NM00029                                                 01099000
CCAEND   EQU   HMASMCCA+371                                             01100000
@NM00028 EQU   HMASMCCA+309                                             01101000
CCACURDD EQU   CCAFDSNG+3                                               01102000
CCACURDS EQU   CCAFDSNG+2                                               01103000
@NM00027 EQU   CCAFLAGB                                                 01104000
CCAOUTNG EQU   CCAFLAGB                                                 01105000
CCALOGNG EQU   CCAFLAGB                                                 01106000
CCAFMID  EQU   HMASMCCA+291                                             01107000
CCALSTDS EQU   CCAFCTL+8                                                01108000
CCARPTDS EQU   CCAFCTL+7                                                01109000
CCATIME  EQU   CCAFCTL+4                                                01110000
CCADATE  EQU   CCAFCTL+1                                                01111000
@NM00026 EQU   CCAFLAG9                                                 01112000
CCARVCAN EQU   CCAFLAG9                                                 01113000
CCARVEST EQU   CCAFLAG9                                                 01114000
CCAPTSNJ EQU   CCAFLAG9                                                 01115000
CCASTSNP EQU   CCAFLAG9                                                 01116000
CCAMTSNP EQU   CCAFLAG9                                                 01117000
CCAPTSNP EQU   CCAFLAG9                                                 01118000
@NM00025 EQU   CCAFLAG8                                                 01119000
CCAACDSC EQU   CCAFLAG8                                                 01120000
CCACDSC  EQU   CCAFLAG8                                                 01121000
@NM00024 EQU   CCAFLAG6                                                 01122000
CCAACRUP EQU   CCAFLAG6                                                 01123000
CCACRQUP EQU   CCAFLAG6                                                 01124000
CCAACDUP EQU   CCAFLAG6                                                 01125000
CCACDSUP EQU   CCAFLAG6                                                 01126000
@NM00023 EQU   CCAFLAG5                                                 01127000
CCAACROS EQU   CCAFLAG5                                                 01128000
CCACRQOS EQU   CCAFLAG5                                                 01129000
CCAACDOS EQU   CCAFLAG5                                                 01130000
CCACDSOS EQU   CCAFLAG5                                                 01131000
@NM00022 EQU   CCAFLAG4                                                 01132000
CCAACRIS EQU   CCAFLAG4                                                 01133000
CCACRQIS EQU   CCAFLAG4                                                 01134000
CCAACDIS EQU   CCAFLAG4                                                 01135000
CCACDSIS EQU   CCAFLAG4                                                 01136000
@NM00021 EQU   CCAFLAG3+1                                               01137000
CCARGNP  EQU   CCAFLAG3+1                                               01138000
CCADISRQ EQU   CCAFLAG3+1                                               01139000
CCAICTOK EQU   CCAFLAG3                                                 01140000
CCADELP  EQU   CCAFLAG3                                                 01141000
CCACMPRS EQU   CCAFLAG3                                                 01142000
CCAZAPP  EQU   CCAFLAG3                                                 01143000
CCALINKP EQU   CCAFLAG3                                                 01144000
CCACOPYP EQU   CCAFLAG3                                                 01145000
CCAASIP  EQU   CCAFLAG3                                                 01146000
CCAUPDP  EQU   CCAFLAG3                                                 01147000
CCAEOSMP EQU   CCAFLAG2                                                 01148000
CCAEOFNC EQU   CCAFLAG2                                                 01149000
@NM00020 EQU   CCAFLAG2                                                 01150000
CCACHECK EQU   CCAFLAG2                                                 01151000
CCATERM  EQU   CCAFLAG2                                                 01152000
CCASVCLB EQU   CCAFLAG2                                                 01153000
CCANCPTF EQU   CCAFLAG2                                                 01154000
@NM00019 EQU   CCAFLAG1+1                                               01155000
CCARESET EQU   CCAFLAG1+1                                               01156000
CCALOG   EQU   CCAFLAG1+1                                               01157000
CCACNV   EQU   CCAFLAG1+1                                               01158000
CCAUPDU  EQU   CCAFLAG1                                                 01159000
CCAUPDJ  EQU   CCAFLAG1                                                 01160000
CCARES   EQU   CCAFLAG1                                                 01161000
CCAREJ   EQU   CCAFLAG1                                                 01162000
CCAACCPT EQU   CCAFLAG1                                                 01163000
CCAAPPLY EQU   CCAFLAG1                                                 01164000
CCAREC   EQU   CCAFLAG1                                                 01165000
CCAFUNCT EQU   CCAFFUNC                                                 01166000
@NM00018 EQU   @NM00013+18                                              01167000
@NM00017 EQU   @NM00013+16                                              01168000
CCATBLPA EQU   @NM00013+12                                              01169000
@NM00016 EQU   @NM00013+8                                               01170000
@NM00015 EQU   @NM00013+4                                               01171000
@NM00014 EQU   @NM00013                                                 01172000
CCAIFGTP EQU   CCAFGTP+16                                               01173000
CCAGTP3  EQU   CCAFGTP+12                                               01174000
CCAGTP2  EQU   CCAFGTP+8                                                01175000
CCAGTP1  EQU   CCAFGTP+4                                                01176000
CCASETAD EQU   CCASEGTP                                                 01177000
CCACLST  EQU   CCAFPGM+12                                               01178000
CCASPDCB EQU   CCAFPGM+8                                                01179000
CCAICLMD EQU   CCAFICT+12                                               01180000
CCAICMOD EQU   CCAFICT+8                                                01181000
CCAICPTF EQU   CCAFICT+4                                                01182000
CCAICT   EQU   CCAFICT                                                  01183000
CCARVAD  EQU   CCAFSTA                                                  01184000
CCAACDID EQU   CCAFSYS+32                                               01185000
CCACDSID EQU   CCAFSYS+24                                               01186000
CCALNLEN EQU   CCAFSYS+22                                               01187000
@NM00012 EQU   CCAFLAGA                                                 01188000
CCAPSYSF EQU   CCAFLAGA                                                 01189000
CCAASYSF EQU   CCAFLAGA                                                 01190000
CCACSYSF EQU   CCAFLAGA                                                 01191000
CCANUCID EQU   CCAFSYS+20                                               01192000
CCAASREL EQU   CCAFSYS+16                                               01193000
CCACSREL EQU   CCASREL                                                  01194000
CCAPEMAX EQU   CCAFSYS+10                                               01195000
CCAPGLEN EQU   CCAFSYS+8                                                01196000
CCAIOPAS EQU   CCAFSYS+4                                                01197000
CCAIOPCS EQU   CCAFSYS                                                  01198000
CCAPESIZ EQU   CCAFIOP+4                                                01199000
@NM00011 EQU   CCAFLAG7+3                                               01200000
CCALOGP  EQU   CCAFLAG7+2                                               01201000
CCAOUTP  EQU   CCAFLAG7+2                                               01202000
CCASLBP  EQU   CCAFLAG7+2                                               01203000
CCARPTP  EQU   CCAFLAG7+2                                               01204000
CCALISTP EQU   CCAFLAG7+2                                               01205000
CCAJCLP  EQU   CCAFLAG7+2                                               01206000
CCAPTFP  EQU   CCAFLAG7+2                                               01207000
CCATLBP  EQU   CCAFLAG7+2                                               01208000
CCAUT3P  EQU   CCAFLAG7+1                                               01209000
CCAUT2P  EQU   CCAFLAG7+1                                               01210000
CCAUT1P  EQU   CCAFLAG7+1                                               01211000
CCAWK5P  EQU   CCAFLAG7+1                                               01212000
CCAWK4P  EQU   CCAFLAG7+1                                               01213000
CCAWK3P  EQU   CCAFLAG7+1                                               01214000
CCAWK2P  EQU   CCAFLAG7+1                                               01215000
CCAWK1P  EQU   CCAFLAG7+1                                               01216000
CCAACRQP EQU   CCAFLAG7                                                 01217000
CCACRQP  EQU   CCAFLAG7                                                 01218000
CCASTSP  EQU   CCAFLAG7                                                 01219000
CCAMTSP  EQU   CCAFLAG7                                                 01220000
CCAPTSP  EQU   CCAFLAG7                                                 01221000
CCASCDSP EQU   CCAFLAG7                                                 01222000
CCAACDSP EQU   CCAFLAG7                                                 01223000
CCACDSP  EQU   CCAFLAG7                                                 01224000
@NM00010 EQU   CCAFBUFR+122                                             01225000
@NM00009 EQU   CCAFBUFR+120                                             01226000
@NM00008 EQU   CCAFBUFR+118                                             01227000
CCATBFMX EQU   CCAFBUFR+116                                             01228000
CCA4BFMX EQU   CCAFBUFR+114                                             01229000
CCA3BFMX EQU   CCAFBUFR+112                                             01230000
CCA2BFMX EQU   CCAFBUFR+110                                             01231000
CCA1BFMX EQU   CCAFBUFR+108                                             01232000
CCAXBFMX EQU   CCAFBUFR+106                                             01233000
CCAQBFMX EQU   CCAFBUFR+104                                             01234000
CCASBFMX EQU   CCAFBUFR+102                                             01235000
CCAMBFMX EQU   CCAFBUFR+100                                             01236000
CCAPBFMX EQU   CCAFBUFR+98                                              01237000
CCAVBFMX EQU   CCAFBUFR+96                                              01238000
CCAABFMX EQU   CCAFBUFR+94                                              01239000
CCACBFMX EQU   CCAFBUFR+92                                              01240000
@NM00007 EQU   CCAFBUFR+88                                              01241000
@NM00006 EQU   CCAFBUFR+84                                              01242000
CCA4BFSZ EQU   CCAFBUFR+80                                              01243000
CCATBFSZ EQU   CCAFBUFR+76                                              01244000
CCAWBFSZ EQU   CCAFBUFR+72                                              01245000
CCAQBFSZ EQU   CCAFBUFR+68                                              01246000
CCAPBFSZ EQU   CCAFBUFR+64                                              01247000
CCAVBFSZ EQU   CCAFBUFR+60                                              01248000
CCACBFSZ EQU   CCAFBUFR+56                                              01249000
@NM00005 EQU   CCAFBUFR+52                                              01250000
CCA4BFOA EQU   CCAFBUFR+48                                              01251000
CCA4BFIA EQU   CCAFBUFR+44                                              01252000
CCATBFIA EQU   CCAFBUFR+40                                              01253000
CCAWBFOA EQU   CCAFBUFR+36                                              01254000
CCAWBFIA EQU   CCAFBUFR+32                                              01255000
CCAQBFOA EQU   CCAFBUFR+28                                              01256000
CCAQBFIA EQU   CCAFBUFR+24                                              01257000
CCAPBFOA EQU   CCAFBUFR+20                                              01258000
CCAPBFIA EQU   CCAFBUFR+16                                              01259000
CCAVBFOA EQU   CCAFBUFR+12                                              01260000
CCAVBFIA EQU   CCAFBUFR+8                                               01261000
CCACBFOA EQU   CCAFBUFR+4                                               01262000
CCACBFIA EQU   CCAFBUFR                                                 01263000
CCAID    EQU   HMASMCCA                                                 01264000
@NM00004 EQU   FVPLDATA+1                                               01265000
@NM00003 EQU   FVPAHEAD+14                                              01266000
FVPAVERN EQU   FVPAHEAD+11                                              01267000
@NM00002 EQU   FVPAHEAD+10                                              01268000
FVPAVER  EQU   FVPAHEAD+7                                               01269000
@NM00001 EQU   FVPAHEAD                                                 01270000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01271000
@ENDDATA EQU   *                                                        01272000
         END   HMASMFVL                                                 01273000
