         TITLE 'HMASMMPH HEADER PARSE ROUTINE'                          00001000
HMASMMPH CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'HMASMMPH  78.334'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         ST    @13,@SA00001+4                                      0001 00013000
         LA    @14,@SA00001                                        0001 00014000
         ST    @14,8(,@13)                                         0001 00015000
         LR    @13,@14                                             0001 00016000
         MVC   @PC00001(4),0(@01)                                  0001 00017000
*                                      PTF ENTRY IF PTF DATA TO BE 0167 00018000
*                                      FILLED IN ELSE 0              */ 00019000
*   MPHRTNCD=ZERO;                  /* TO BE RETURNED IF NO ERRORS   */ 00020000
*                                                                  0168 00021000
         SLR   @10,@10                                             0168 00022000
         ST    @10,MPHRTNCD                                        0168 00023000
*   /*****************************************************************/ 00024000
*   /*                                                               */ 00025000
*   /* INITIALIZE CRP AND MCB                                        */ 00026000
*   /*                                                               */ 00027000
*   /*****************************************************************/ 00028000
*                                                                  0169 00029000
*   CRPSCPAD=ADDR(HMASMSCP);        /* INIT. CRD PARM. LIST          */ 00030000
         L     @10,@PC00001                                        0169 00031000
         L     @15,MPPCRDPM(,@10)                                  0169 00032000
         LA    @14,HMASMSCP                                        0169 00033000
         ST    @14,CRPSCPAD(,@15)                                  0169 00034000
*   MCBPNO=NULLPTF#;                /* CLEAR SYSMOD-ID FIELD         */ 00035000
         L     @14,MPPMCBAD(,@10)                                  0170 00036000
         MVC   MCBPNO(7,@14),@CC01438                              0170 00037000
*   MCBTYPE=MCBPTFTP;               /* SET CONSTANT PTF TYPE RECORD     00038000
*                                      IN MCB                        */ 00039000
         MVI   MCBTYPE(@14),X'01'                                  0171 00040000
*   MCBPRELN=''B;                   /* INIT. FILES BINARY 0'S        */ 00041000
*                                                                  0172 00042000
         SLR   @09,@09                                             0172 00043000
         STH   @09,MCBPRELN(,@14)                                  0172 00044000
*   /*****************************************************************/ 00045000
*   /*                                                               */ 00046000
*   /* INITIALIZE SCAN PARMS                                         */ 00047000
*   /*                                                               */ 00048000
*   /*****************************************************************/ 00049000
*                                                                  0173 00050000
*   SCPRET=SCPGOOD;                 /* GOOD RETURN CODE              */ 00051000
         MVI   SCPRET,X'00'                                        0173 00052000
*   SCPCHAR=ADDR(CRPBUFFR);         /* CHAR STRING TO BE SCANNED     */ 00053000
         LA    @14,CRPBUFFR(,@15)                                  0174 00054000
         ST    @14,SCPCHAR                                         0174 00055000
*   SCPSRCH=ADDR(KPLPL);            /* FIRST DSCAN MACRO USED IN SCAN*/ 00056000
         LA    @14,KPLPL                                           0175 00057000
         ST    @14,SCPSRCH                                         0175 00058000
*   SCPIORTN=MPPCRDAD;              /* ADDR OF USER I/O ROUTINE      */ 00059000
         MVC   SCPIORTN(4),MPPCRDAD(@10)                           0176 00060000
*   SCPIOPAD=MPPCRDPM;              /* ADDR OF PARM I/O ROUTINE      */ 00061000
         ST    @15,SCPIOPAD                                        0177 00062000
*   SCPINLN=LENGTH(CRPBFCTL);       /* INPUT RECORD LENGTH 72 COLUMNS*/ 00063000
         MVC   SCPINLN(2),@CH00839                                 0178 00064000
*   SCPEOR=ZERO;                    /* FLAG BYTE                     */ 00065000
         MVI   SCPEOR,X'00'                                        0179 00066000
*   SCPCOMNT=ON;                    /* CHECK FOR COMMENT DELIMITERS  */ 00067000
*   SCPCONT=ON;                     /* GO TO NEXT CARD               */ 00068000
*                                                                  0181 00069000
         OI    SCPCOMNT,B'10100000'                                0181 00070000
*   /*****************************************************************/ 00071000
*   /*                                                               */ 00072000
*   /* INITIALIZE MESSAGE PARMS                                      */ 00073000
*   /*                                                               */ 00074000
*   /*****************************************************************/ 00075000
*                                                                  0182 00076000
*   HMASMMGP=''B;                   /* CLEAR MGP                     */ 00077000
         XC    HMASMMGP(24),HMASMMGP                               0182 00078000
*   MGPHLDS=ON;                     /* MESSAGES TO LOG               */ 00079000
*   MGPPRINT=ON;                    /* SET FOR MSG TO PRINTER        */ 00080000
         OI    MGPHLDS,B'10010000'                                 0184 00081000
*                                                                  0185 00082000
*   /*****************************************************************/ 00083000
*   /*                                                               */ 00084000
*   /* SCAN CONTROL CARD FOR TYPE SYSMOD                             */ 00085000
*   /*                                                               */ 00086000
*   /*****************************************************************/ 00087000
*                                                                  0185 00088000
*   CALL HMASMSCN(HMASMSCP);                                       0185 00089000
*                                                                  0185 00090000
         L     @15,@CV01421                                        0185 00091000
         LA    @01,@AL00185                                        0185 00092000
         BALR  @14,@15                                             0185 00093000
*   /*****************************************************************/ 00094000
*   /*                                                               */ 00095000
*   /* IF END OF FILE BEFORE END OF COMPLETE STATEMENT CALL PROC TO  */ 00096000
*   /* ISSUE MSG HMA252I RETRN 8 TO CALLER                           */ 00097000
*   /*                                                               */ 00098000
*   /*****************************************************************/ 00099000
*                                                                  0186 00100000
*   IF CRPRETRN=CRPEOF              /*                               */ 00101000
*     THEN                          /*                               */ 00102000
         L     @10,@PC00001                                        0186 00103000
         L     @10,MPPCRDPM(,@10)                                  0186 00104000
         CLI   CRPRETRN(@10),4                                     0186 00105000
         BNE   @RF00186                                            0186 00106000
*     DO;                           /*                               */ 00107000
*       CALL INCOMPMG;              /*                               */ 00108000
         BAL   @14,INCOMPMG                                        0188 00109000
*       MPHRTNCD=STOPPTF;           /*                               */ 00110000
         MVC   MPHRTNCD(4),@CF00116                                0189 00111000
*     END;                          /*                               */ 00112000
*                                                                  0190 00113000
*   /*****************************************************************/ 00114000
*   /*                                                               */ 00115000
*   /* IF SYNTAX ERROR PUT OUT MESSAGE. IF SEVERE ERROR JUST SET RC  */ 00116000
*   /*                                                               */ 00117000
*   /*****************************************************************/ 00118000
*                                                                  0191 00119000
*   ELSE                            /*                               */ 00120000
*     IF SCPRET>=SCPBAD             /* IF ERROR IN SCAN              */ 00121000
*       THEN                        /*                               */ 00122000
         B     @RC00186                                            0191 00123000
@RF00186 CLI   SCPRET,4                                            0191 00124000
         BL    @RF00191                                            0191 00125000
*       DO;                         /*                               */ 00126000
*         IF SCPRET=SCPBAD          /*                               */ 00127000
*           THEN                    /*                               */ 00128000
         CLI   SCPRET,4                                            0193 00129000
         BNE   @RF00193                                            0193 00130000
*           CALL SYNTAXMG;          /*                               */ 00131000
         BAL   @14,SYNTAXMG                                        0194 00132000
*         MPHRTNCD=MAX(SCPRET,STOPPTF,MPHRTNCD);                   0195 00133000
@RF00193 SLR   @10,@10                                             0195 00134000
         IC    @10,SCPRET                                          0195 00135000
         LA    @15,8                                               0195 00136000
         CR    @10,@15                                             0195 00137000
         BNL   *+6                                                      00138000
         LR    @10,@15                                             0195 00139000
         L     @15,MPHRTNCD                                        0195 00140000
         CR    @10,@15                                             0195 00141000
         BNL   *+6                                                      00142000
         LR    @10,@15                                             0195 00143000
         ST    @10,MPHRTNCD                                        0195 00144000
*       END;                                                       0196 00145000
*   RETURN CODE(MPHRTNCD);                                         0197 00146000
@RF00191 DS    0H                                                  0197 00147000
@RC00186 L     @15,MPHRTNCD                                        0197 00148000
         L     @13,4(,@13)                                         0197 00149000
         L     @14,12(,@13)                                        0197 00150000
         LM    @00,@12,20(@13)                                     0197 00151000
         BR    @14                                                 0197 00152000
         EJECT                                                          00153000
*   RFY                                                            0198 00154000
*    (RTNCODE,                                                     0198 00155000
*     REG1,                                                        0198 00156000
*     RTNREG) RSTD;                                                0198 00157000
*                                                                  0198 00158000
*   /*****************************************************************/ 00159000
*   /*                                                               */ 00160000
*   /* MCB BIT SETTING FOR PTF                                       */ 00161000
*   /*                                                               */ 00162000
*   /*****************************************************************/ 00163000
*                                                                  0199 00164000
*RPTF:                                                             0199 00165000
*   MCBPTP=IOPPPTF;                 /* SET PTF BIT IN MCB            */ 00166000
RPTF     L     @10,@PC00001                                        0199 00167000
         L     @10,MPPMCBAD(,@10)                                  0199 00168000
         MVI   MCBPTP(@10),X'03'                                   0199 00169000
*   GO TO GOODSCN1;                 /* RETURN NORMALLY               */ 00170000
*                                                                  0200 00171000
         B     GOODSCN1                                            0200 00172000
*   /*****************************************************************/ 00173000
*   /*                                                               */ 00174000
*   /* MCB BIT SETTING FOR FUNCTION                                  */ 00175000
*   /*                                                               */ 00176000
*   /*****************************************************************/ 00177000
*                                                                  0201 00178000
*RFUNCT:                                                           0201 00179000
*   MCBPTP=IOPPFUNC;                /* SET FUNC BIT IN MCB           */ 00180000
RFUNCT   L     @10,@PC00001                                        0201 00181000
         L     @10,MPPMCBAD(,@10)                                  0201 00182000
         MVI   MCBPTP(@10),X'04'                                   0201 00183000
*   GO TO GOODSCN1;                 /* RETURN NORMALLY               */ 00184000
*                                                                  0202 00185000
         B     GOODSCN1                                            0202 00186000
*   /*****************************************************************/ 00187000
*   /*                                                               */ 00188000
*   /* MCB BIT SETTING FOR USERMOD                                   */ 00189000
*   /*                                                               */ 00190000
*   /*****************************************************************/ 00191000
*                                                                  0203 00192000
*RUSER:                                                            0203 00193000
*   MCBPTP=IOPPUSER;                /* SET USERMOD BIT IN MCB        */ 00194000
RUSER    L     @10,@PC00001                                        0203 00195000
         L     @10,MPPMCBAD(,@10)                                  0203 00196000
         MVI   MCBPTP(@10),X'01'                                   0203 00197000
*   GO TO GOODSCN1;                 /* RETURN NORMALLY               */ 00198000
*                                                                  0204 00199000
         B     GOODSCN1                                            0204 00200000
*   /*****************************************************************/ 00201000
*   /*                                                               */ 00202000
*   /* MCB BIT SETTING FOR APAR                                      */ 00203000
*   /*                                                               */ 00204000
*   /*****************************************************************/ 00205000
*                                                                  0205 00206000
*RAPAR:                                                            0205 00207000
*   MCBPTP=IOPPAPAR;                /* SET APAR BIT IN MCB           */ 00208000
RAPAR    L     @10,@PC00001                                        0205 00209000
         L     @10,MPPMCBAD(,@10)                                  0205 00210000
         MVI   MCBPTP(@10),X'02'                                   0205 00211000
*   GO TO GOODSCN1;                 /* RETURN NORMALLY               */ 00212000
         B     GOODSCN1                                            0206 00213000
         EJECT                                                          00214000
*                                                                  0207 00215000
*   /*****************************************************************/ 00216000
*   /*                                                               */ 00217000
*   /* PICK UP SYSMOD ID WHICH IS 7 ALPHA NUMERIC CHARS              */ 00218000
*   /*                                                               */ 00219000
*   /*****************************************************************/ 00220000
*                                                                  0207 00221000
*RSMDNO:                                                           0207 00222000
*                                                                  0207 00223000
*   /*****************************************************************/ 00224000
*   /*                                                               */ 00225000
*   /* CHECK FOR IOP, IF PASSED FILL IN IOP TYPE BIT AND PTF #       */ 00226000
*   /*                                                               */ 00227000
*   /*****************************************************************/ 00228000
*                                                                  0207 00229000
*   IF MPPIOPAD^=0 THEN                                            0207 00230000
RSMDNO   L     @10,@PC00001                                        0207 00231000
         L     @09,MPPIOPAD(,@10)                                  0207 00232000
         LTR   @09,@09                                             0207 00233000
         BZ    @RF00207                                            0207 00234000
*     DO;                                                          0208 00235000
*       IOPPTYPE=MCBPTP;                                           0209 00236000
         L     @10,MPPMCBAD(,@10)                                  0209 00237000
         MVC   IOPPTYPE(1,@09),MCBPTP(@10)                         0209 00238000
*       IOPNAM17=SCPSTRNG(1:LENGTH(IOPNAM17));/*                     */ 00239000
         L     @10,SCPCHAR                                         0210 00240000
         MVC   IOPNAM17(7,@09),SCPSTRNG(@10)                       0210 00241000
*     END;                                                         0211 00242000
*                                                                  0211 00243000
*   /*****************************************************************/ 00244000
*   /*                                                               */ 00245000
*   /* FILL IN PTF# FOR MCB                                          */ 00246000
*   /*                                                               */ 00247000
*   /*****************************************************************/ 00248000
*                                                                  0212 00249000
*   MCBPNO=SCPSTRNG(1:LENGTH(MCBPNO));/* MOVE SYSMOD NUMBER          */ 00250000
@RF00207 L     @10,@PC00001                                        0212 00251000
         L     @10,MPPMCBAD(,@10)                                  0212 00252000
         L     @09,SCPCHAR                                         0212 00253000
         MVC   MCBPNO(7,@10),SCPSTRNG(@09)                         0212 00254000
*   GO TO GOODSCN1;                 /* RETURN NORMALLY               */ 00255000
         B     GOODSCN1                                            0213 00256000
         EJECT                                                          00257000
*                                                                  0214 00258000
*   /*****************************************************************/ 00259000
*   /*                                                               */ 00260000
*   /* PUT NUM OF FILES IN MCB AND IOP IF PASSED                     */ 00261000
*   /*                                                               */ 00262000
*   /*****************************************************************/ 00263000
*                                                                  0214 00264000
*RRELFNO:                                                          0214 00265000
*   DECLARE                                                        0214 00266000
*     PKWKAREA CHAR(8) BDY(DWORD);  /* CONVERT CHAR FILES# TO BINARY */ 00267000
RRELFNO  DS    0H                                                  0215 00268000
*   DECLARE                                                        0215 00269000
*     FILEWKA CHAR(8);                                             0215 00270000
*   DECLARE                                                        0216 00271000
*     FILESNO FIXED(15);                                           0216 00272000
*   DECLARE                                                        0217 00273000
*     FOPERAND CHAR(*) BASED(SCPCHAR);                             0217 00274000
*   DECLARE                                                        0218 00275000
*     INVALID CHAR(1) INIT('0');                                   0218 00276000
*                                                                  0218 00277000
*   /*****************************************************************/ 00278000
*   /*                                                               */ 00279000
*   /* CHECK FOR INVALID 0 PRECEEDING FILES NUMBER                   */ 00280000
*   /*                                                               */ 00281000
*   /*****************************************************************/ 00282000
*                                                                  0219 00283000
*   IF FOPERAND(1:1)=INVALID THEN                                  0219 00284000
         L     @10,SCPCHAR                                         0219 00285000
         CLC   FOPERAND(1,@10),INVALID                             0219 00286000
         BNE   @RF00219                                            0219 00287000
*     DO;                           /* ZERO PRECEDING FILES          */ 00288000
*       SCPRET=SCPSTOP;                                            0221 00289000
         MVI   SCPRET,X'08'                                        0221 00290000
*     END;                                                         0222 00291000
*                                                                  0222 00292000
*   /*****************************************************************/ 00293000
*   /*                                                               */ 00294000
*   /* CONVERT TO BINERY FILES NUMBER MOVE FILE # IN MCB AND IOP IF  */ 00295000
*   /* PASSED                                                        */ 00296000
*   /*                                                               */ 00297000
*   /*****************************************************************/ 00298000
*                                                                  0223 00299000
*   ELSE                                                           0223 00300000
*     DO;                                                          0223 00301000
         B     @RC00219                                            0223 00302000
@RF00219 DS    0H                                                  0224 00303000
*       FILEWKA=' ';                                               0224 00304000
         MVI   FILEWKA+1,C' '                                      0224 00305000
         MVC   FILEWKA+2(6),FILEWKA+1                              0224 00306000
         MVI   FILEWKA,C' '                                        0224 00307000
*       FILEWKA((9-SCPPMLN):8)=FOPERAND(1:SCPPMLN);                0225 00308000
         LA    @10,9                                               0225 00309000
         SH    @10,SCPPMLN                                         0225 00310000
         LA    @09,FILEWKA-1(@10)                                  0225 00311000
         LCR   @10,@10                                             0225 00312000
         AL    @10,@CF00116                                        0225 00313000
         L     @08,SCPCHAR                                         0225 00314000
         EX    @10,@SM01488                                        0225 00315000
*       PACK(PKWKAREA,FILEWKA);                                    0226 00316000
         PACK  PKWKAREA(8),FILEWKA(8)                              0226 00317000
*       CVB(FILESNO,PKWKAREA);                                     0227 00318000
         CVB   @10,PKWKAREA                                        0227 00319000
         STH   @10,FILESNO                                         0227 00320000
*       MCBPRELN=FILESNO;           /* NUM FILES TO MCB              */ 00321000
         L     @09,@PC00001                                        0228 00322000
         L     @08,MPPMCBAD(,@09)                                  0228 00323000
         STH   @10,MCBPRELN(,@08)                                  0228 00324000
*       IF MPPIOPAD^=0 THEN                                        0229 00325000
         L     @09,MPPIOPAD(,@09)                                  0229 00326000
         LTR   @09,@09                                             0229 00327000
         BZ    @RF00229                                            0229 00328000
*         DO;                       /*                               */ 00329000
*           IOPPRELN=MCBPRELN;      /* NUM FILES TO IOP              */ 00330000
         STH   @10,IOPPRELN(,@09)                                  0231 00331000
*           IOPLRFP=ON;             /*                               */ 00332000
         OI    IOPLRFP(@09),B'00000001'                            0232 00333000
*         END;                      /*                               */ 00334000
*     END;                                                         0234 00335000
*   GO TO GOODSCN1;                 /* RETURN NORMALLY               */ 00336000
         B     GOODSCN1                                            0235 00337000
*                                                                  0236 00338000
*   /*****************************************************************/ 00339000
*   /*                                                               */ 00340000
*   /* RETURN TO SCAN WITH NORMAL RETURN CODE                        */ 00341000
*   /*                                                               */ 00342000
*   /*****************************************************************/ 00343000
*                                                                  0236 00344000
*RXTRA:                             /*                               */ 00345000
*   SCPRETRN=SCPSTOP;               /* SYNTAX ERROR                  */ 00346000
RXTRA    MVI   SCPRETRN,X'08'                                      0236 00347000
*GOODSCN1:                                                         0237 00348000
*   DECLARE                                                        0237 00349000
*     SCNAPRET LABEL BASED(RTNREG) VALUERANGE(0);/* RETURN REGISTER     00350000
*                                      FROM APPENDAGE TO SCAN ROUTINE*/ 00351000
GOODSCN1 DS    0H                                                  0238 00352000
*   GO TO SCNAPRET;                 /* RETURN TO MAIN SCAN ROUTINE   */ 00353000
         BR    RTNREG                                              0238 00354000
*   RFY                                                            0239 00355000
*    (RTNCODE,                                                     0239 00356000
*     REG1,                                                        0239 00357000
*     RTNREG) UNRSTD;                                              0239 00358000
*                                                                  0240 00359000
*   /*****************************************************************/ 00360000
*   /*                                                               */ 00361000
*   /* SYNTAX ERROR MESSAGE                                          */ 00362000
*   /*                                                               */ 00363000
*   /*****************************************************************/ 00364000
*                                                                  0240 00365000
*SYNTAXMG:                                                         0240 00366000
*   PROC;                                                          0240 00367000
@EL00001 L     @13,4(,@13)                                         0240 00368000
@EF00001 DS    0H                                                  0240 00369000
@ER00001 LM    @14,@12,12(@13)                                     0240 00370000
         BR    @14                                                 0240 00371000
SYNTAXMG STM   @14,@12,@SA00002                                    0240 00372000
*   HEXNO=SCPCHAR-ADDR(CRPBUFFR)+1; /* GET COLUMN NUMBER             */ 00373000
         L     @10,@PC00001                                        0241 00374000
         L     @10,MPPCRDPM(,@10)                                  0241 00375000
         LA    @15,CRPBUFFR(,@10)                                  0241 00376000
         LCR   @15,@15                                             0241 00377000
         AL    @15,SCPCHAR                                         0241 00378000
         AH    @15,@CH00091                                        0241 00379000
         ST    @15,HEXNO                                           0241 00380000
*   CVD(HEXNO,DECNO1);              /* CONVERT NO. TO DECIMAL        */ 00381000
         CVD   @15,DECNO1                                          0242 00382000
*   UNPK(BCDNO,DECNO(COLSTR:COLSTP));/* UNPACK NO.                   */ 00383000
         UNPK  BCDNO(5),DECNO+6(3)                                 0243 00384000
*   MGPMGNO1=HMA203I;               /* SYNTAX ERROR IN               */ 00385000
         MVC   MGPMGNO1(2),@CH00044                                0244 00386000
*   MGPMGNO2=PART021;               /* CONTROL STATEMENT             */ 00387000
         MVC   MGPMGNO2(2),@CH00459                                0245 00388000
*   MGPMGNO3=PART026;               /* AT COLUMN                     */ 00389000
         MVC   MGPMGNO3(2),@CH00469                                0246 00390000
*   MGPVARPT(1)=ADDR(BCDCOL);       /* MESSAGE TEXT = COL NUM        */ 00391000
         LA    @15,BCDCOL                                          0247 00392000
         ST    @15,MGPVARPT                                        0247 00393000
*   MGPTYPE=MGPERR;                 /* MESSAGE SEVERITY              */ 00394000
         MVI   MGPTYPE,X'03'                                       0248 00395000
*   IF CRPPRINT=ON                  /* STMT. WAS WRITTEN TO SMPOUT   */ 00396000
*     THEN                                                         0249 00397000
         TM    CRPPRINT(@10),B'00001000'                           0249 00398000
         BNO   @RF00249                                            0249 00399000
*     CALL HMASMMSG(HMASMMGP);      /* CALL MESSAGE ROUTINE          */ 00400000
         L     @15,@CV01420                                        0250 00401000
         LA    @01,@AL00250                                        0250 00402000
         BALR  @14,@15                                             0250 00403000
*   END SYNTAXMG;                                                  0251 00404000
*                                                                  0251 00405000
@EL00002 DS    0H                                                  0251 00406000
@EF00002 DS    0H                                                  0251 00407000
@ER00002 LM    @14,@12,@SA00002                                    0251 00408000
         BR    @14                                                 0251 00409000
*   /*****************************************************************/ 00410000
*   /*                                                               */ 00411000
*   /* ERROR MESSAGE FOR INCOMPLETE CONTROL STATEMENT                */ 00412000
*   /*                                                               */ 00413000
*   /*****************************************************************/ 00414000
*                                                                  0252 00415000
*INCOMPMG:                                                         0252 00416000
*   PROC;                                                          0252 00417000
INCOMPMG STM   @14,@12,@SA00003                                    0252 00418000
*   MGPMGNO1=HMA252I;               /* INCOMPL SMP CNTRL STMT        */ 00419000
         MVC   MGPMGNO1(2),@CH01424                                0253 00420000
*   MGPTYPE=MGPERR;                 /* MESSAGE SEVERITY              */ 00421000
         MVI   MGPTYPE,X'03'                                       0254 00422000
*   IF CRPPRINT=ON                  /* STMT. WAS WRITTEN TO SMPOUT   */ 00423000
*     THEN                                                         0255 00424000
         L     @10,@PC00001                                        0255 00425000
         L     @10,MPPCRDPM(,@10)                                  0255 00426000
         TM    CRPPRINT(@10),B'00001000'                           0255 00427000
         BNO   @RF00255                                            0255 00428000
*     CALL HMASMMSG(HMASMMGP);      /* CALL MESSAGE ROUTINE          */ 00429000
         L     @15,@CV01420                                        0256 00430000
         LA    @01,@AL00256                                        0256 00431000
         BALR  @14,@15                                             0256 00432000
*   END INCOMPMG;                                                  0257 00433000
@EL00003 DS    0H                                                  0257 00434000
@EF00003 DS    0H                                                  0257 00435000
@ER00003 LM    @14,@12,@SA00003                                    0257 00436000
         BR    @14                                                 0257 00437000
*   END HMASMMPH                                                   0258 00438000
*                                                                  0258 00439000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00440000
*/*%INCLUDE SYSLIB  (HMASMCCA)                                       */ 00441000
*/*%INCLUDE SYSLIB  (HMASMIOP)                                       */ 00442000
*/*%INCLUDE SYSLIB  (HMASMMCB)                                       */ 00443000
*/*%INCLUDE SYSLIB  (HMASMMGP)                                       */ 00444000
*/*%INCLUDE SYSLIB  (HMASMSCP)                                       */ 00445000
*/*%INCLUDE SYSLIB  (HMASMCRP)                                       */ 00446000
*                                                                  0258 00447000
*       ;                                                          0258 00448000
@DATA    DS    0H                                                       00449000
@CH00091 DC    H'1'                                                     00450000
@CH00044 DC    H'4'                                                     00451000
@CH00459 DC    H'21'                                                    00452000
@CH00469 DC    H'26'                                                    00453000
@CH01424 DC    H'53'                                                    00454000
@CH00839 DC    H'72'                                                    00455000
@SM01488 MVC   0(0,@09),FOPERAND(@08)                                   00456000
         DS    0F                                                       00457000
@AL00185 DC    A(HMASMSCP)             LIST WITH   1 ARGUMENT(S)        00458000
@AL00250 EQU   *                       LIST WITH   1 ARGUMENT(S)        00459000
@AL00256 DC    A(HMASMMGP)             LIST WITH   1 ARGUMENT(S)        00460000
         DS    0F                                                       00461000
@SA00001 DS    18F                                                      00462000
@PC00001 DS    1F                                                       00463000
@SA00002 DS    0F                                                       00464000
@SA00003 DS    0F                                                       00465000
         DS    15F                                                      00466000
         DS    0F                                                       00467000
@CF00116 DC    F'8'                                                     00468000
@CV01420 DC    V(HMASMMSG)                                              00469000
@CV01421 DC    V(HMASMSCN)                                              00470000
         DS    0D                                                       00471000
IOPPTR   DS    A                                                        00472000
HEXNO    DS    F                                                        00473000
MPHRTNCD DS    A                                                        00474000
FILESNO  DS    H                                                        00475000
@CC01438 DC    C'       '                                               00476000
         DS    CL3                                                      00477000
HMASMMGP DS    CL24                                                     00478000
         ORG   HMASMMGP                                                 00479000
MGPFIXED DS    CL12                                                     00480000
         ORG   MGPFIXED                                                 00481000
MGPCLEAR DS    CL6                                                      00482000
         ORG   MGPCLEAR                                                 00483000
MGPMGNO1 DS    FL2                                                      00484000
MGPMGNO2 DS    FL2                                                      00485000
MGPMGNO3 DS    FL2                                                      00486000
         ORG   MGPFIXED+6                                               00487000
MGPFLAGS DS    BL2                                                      00488000
         ORG   MGPFLAGS                                                 00489000
MGPPRINT DS    BL1                                                      00490000
MGPLIST  EQU   MGPFLAGS+0                                               00491000
MGPRPT   EQU   MGPFLAGS+0                                               00492000
MGPHLDS  EQU   MGPFLAGS+0                                               00493000
MGPWTOR  EQU   MGPFLAGS+0                                               00494000
MGPWTO   EQU   MGPFLAGS+0                                               00495000
MGPWTP   EQU   MGPFLAGS+0                                               00496000
@NM00182 EQU   MGPFLAGS+0                                               00497000
         ORG   MGPFIXED+8                                               00498000
MGPTYPE  DS    FL1                                                      00499000
@NM00183 DS    CL3                                                      00500000
         ORG   HMASMMGP+12                                              00501000
MGPVAR   DS    CL12                                                     00502000
         ORG   MGPVAR                                                   00503000
MGPVARPT DS    3A                                                       00504000
         ORG   HMASMMGP+24                                              00505000
HMASMSCP DS    CL26                                                     00506000
         ORG   HMASMSCP                                                 00507000
SCPCHAR  DS    AL4                                                      00508000
SCPSRCH  DS    AL4                                                      00509000
SCPWKAR  DS    AL4                                                      00510000
SCPIORTN DS    AL4                                                      00511000
SCPIOPAD DS    AL4                                                      00512000
SCPINLN  DS    FL2                                                      00513000
SCPPMLN  DS    FL2                                                      00514000
SCPEOR   DS    BL1                                                      00515000
         ORG   SCPEOR                                                   00516000
SCPCONT  DS    BL1                                                      00517000
SCPNOCT  EQU   SCPEOR+0                                                 00518000
SCPCOMNT EQU   SCPEOR+0                                                 00519000
SCPRTERR EQU   SCPEOR+0                                                 00520000
SCPNOSUC EQU   SCPEOR+0                                                 00521000
SCPNORT  EQU   SCPEOR+0                                                 00522000
@NM00184 EQU   SCPEOR+0                                                 00523000
         ORG   HMASMSCP+25                                              00524000
SCPRETRN DS    FL1                                                      00525000
         ORG   SCPRETRN                                                 00526000
SCPRET   DS    FL1                                                      00527000
         ORG   HMASMSCP+26                                              00528000
         DS    CL6                                                      00529000
DECNO    DS    CL9                                                      00530000
         ORG   DECNO                                                    00531000
DECNO1   DS    CL8                                                      00532000
@NM00188 DS    CL1                                                      00533000
         ORG   DECNO+9                                                  00534000
         DS    CL3                                                      00535000
BCDNO    DS    CL5                                                      00536000
         ORG   BCDNO                                                    00537000
@NM00189 DS    CL1                                                      00538000
BCDCOL   DS    CL2                                                      00539000
@NM00190 DS    CL2                                                      00540000
         ORG   BCDNO+5                                                  00541000
         DS    CL3                                                      00542000
PATCHMPH DS    CL80                                                     00543000
         ORG   PATCHMPH                                                 00544000
@NM00191 DC    80X'FF'                                                  00545000
         ORG   PATCHMPH+80                                              00546000
         DS    CL4                                                      00547000
PKWKAREA DS    CL8                                                      00548000
FILEWKA  DS    CL8                                                      00549000
INVALID  DC    CL1'0'                                                   00550000
HMASMMPH CSECT                                                          00551000
*                                                                       00552000
* SCAN ++HEADER FOR STATEMENT TYPE                                      00553000
*                                                                       00554000
KPLPL    DSCAN   KEY='++',SUCC=KPTF,BLANKS=ON,IO=NO                     00555000
KPTF     DSCAN   KEY='PTF',ALT=KFUNCT,SUCC=KLP1,ROUT=RPTF,IO=NO         00556000
KFUNCT   DSCAN   KEY='FUNCTION',ALT=KUSER,SUCC=KLP1,ROUT=RFUNCT,      XX00557000
                 IO=NO                                                  00558000
KUSER    DSCAN   KEY='USERMOD',ALT=KAPAR,SUCC=KLP1,ROUT=RUSER,        XX00559000
                 IO=NO                                                  00560000
KAPAR    DSCAN   KEY='APAR',SUCC=KLP1,ROUT=RAPAR,IO=NO                  00561000
*                                                                       00562000
* SCAN ++HEADER SYSMOD ID                                               00563000
*                                                                       00564000
KLP1     DSCAN   KEY='(',SUCC=KSMDNO                                    00565000
KSMDNO   DSCAN   MINLEN=7,MAXLEN=7,TYPE=AN,SUCC=KRP1,ROUT=RSMDNO        00566000
KRP1     DSCAN   KEY=')',SUCC=KRELF                                     00567000
*                                                                       00568000
* SCAN ++HEADER FILES                                                   00569000
*                                                                       00570000
KRELF    DSCAN   KEY='FILES',ALT=KPERIOD,SUCC=KRELFLP                   00571000
KRELFLP  DSCAN   KEY='(',SUCC=KRELFNO                                   00572000
KRELFNO  DSCAN   MINLEN=1,MAXLEN=4,SUCC=KRELFRP,TYPE=N,ROUT=RRELFNO     00573000
KRELFRP  DSCAN   KEY=')',SUCC=KPERIOD                                   00574000
*                                                                       00575000
* SCAN ++HEADER  COMPLETION                                             00576000
KPERIOD  DSCAN   KEY='.',SUCC=KXTRA                                     00577000
KXTRA    DSCAN   MINLEN=0,IO=NO,ROUT=RXTRA                              00578000
HMASMMPH CSECT                                                          00579000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00580000
@01      EQU   01                                                       00581000
@02      EQU   02                                                       00582000
@03      EQU   03                                                       00583000
@04      EQU   04                                                       00584000
@05      EQU   05                                                       00585000
@06      EQU   06                                                       00586000
@07      EQU   07                                                       00587000
@08      EQU   08                                                       00588000
@09      EQU   09                                                       00589000
@10      EQU   10                                                       00590000
@11      EQU   11                                                       00591000
@12      EQU   12                                                       00592000
@13      EQU   13                                                       00593000
@14      EQU   14                                                       00594000
@15      EQU   15                                                       00595000
CCAPTR   EQU   @11                                                      00596000
REG1     EQU   @01                                                      00597000
RTNREG   EQU   @14                                                      00598000
RTNCODE  EQU   @15                                                      00599000
HMASMCCA EQU   0                                                        00600000
CCAFBUFR EQU   HMASMCCA+4                                               00601000
CCADSAD  EQU   CCAFBUFR+124                                             00602000
CCATPAD  EQU   CCAFBUFR+128                                             00603000
CCAFLAG7 EQU   CCAFBUFR+132                                             00604000
CCAFIOP  EQU   HMASMCCA+140                                             00605000
CCAFSYS  EQU   HMASMCCA+148                                             00606000
CCASREL  EQU   CCAFSYS+12                                               00607000
CCAFLAGA EQU   CCAFSYS+21                                               00608000
CCAFSTA  EQU   HMASMCCA+188                                             00609000
CCAFICT  EQU   HMASMCCA+192                                             00610000
CCAFPGM  EQU   HMASMCCA+208                                             00611000
CCABLDLP EQU   CCAFPGM                                                  00612000
CCADBLDL EQU   CCAFPGM+4                                                00613000
CCAFGTP  EQU   HMASMCCA+224                                             00614000
CCASEGTP EQU   CCAFGTP                                                  00615000
@NM00009 EQU   HMASMCCA+244                                             00616000
CCAFFUNC EQU   HMASMCCA+264                                             00617000
CCAFLAG1 EQU   CCAFFUNC+8                                               00618000
CCAFLAG2 EQU   CCAFFUNC+11                                              00619000
CCAFPROC EQU   HMASMCCA+276                                             00620000
CCAFLAG3 EQU   CCAFPROC                                                 00621000
CCAFDIS  EQU   HMASMCCA+278                                             00622000
CCAFLAG4 EQU   CCAFDIS                                                  00623000
CCAFLAG5 EQU   CCAFDIS+1                                                00624000
CCAFLAG6 EQU   CCAFDIS+2                                                00625000
CCAFCNV  EQU   HMASMCCA+281                                             00626000
CCAFLAG8 EQU   CCAFCNV                                                  00627000
CCAFCTL  EQU   HMASMCCA+282                                             00628000
CCAFLAG9 EQU   CCAFCTL                                                  00629000
CCAFDSNG EQU   HMASMCCA+298                                             00630000
CCAFLAGB EQU   CCAFDSNG                                                 00631000
CCABLDLA EQU   0                                                        00632000
@NM00025 EQU   CCABLDLA                                                 00633000
CCABLDLL EQU   0                                                        00634000
@NM00027 EQU   CCABLDLL                                                 00635000
CCALKDRC EQU   @NM00027+20                                              00636000
@NM00029 EQU   CCABLDLL+124                                             00637000
CCAASMRC EQU   @NM00029+20                                              00638000
@NM00031 EQU   CCABLDLL+248                                             00639000
CCACPYRC EQU   @NM00031+20                                              00640000
@NM00033 EQU   CCABLDLL+372                                             00641000
CCACOMRC EQU   @NM00033+20                                              00642000
@NM00035 EQU   CCABLDLL+496                                             00643000
CCAZAPRC EQU   @NM00035+20                                              00644000
@NM00037 EQU   CCABLDLL+620                                             00645000
CCASUPRC EQU   @NM00037+20                                              00646000
@NM00039 EQU   CCABLDLL+744                                             00647000
CCAUPDRC EQU   @NM00039+20                                              00648000
CCABLDLM EQU   0                                                        00649000
CCABELMT EQU   CCABLDLM+4                                               00650000
CCABMPOS EQU   CCABELMT                                                 00651000
HMASMIOP EQU   0                                                        00652000
IOPNAME  EQU   HMASMIOP+4                                               00653000
IOPNAM17 EQU   IOPNAME                                                  00654000
@NM00043 EQU   HMASMIOP+12                                              00655000
@NM00044 EQU   @NM00043                                                 00656000
IOPDDNAM EQU   HMASMIOP+24                                              00657000
IOPBUFAD EQU   HMASMIOP+52                                              00658000
IOPDRMAP EQU   HMASMIOP+56                                              00659000
IOPINAME EQU   IOPDRMAP                                                 00660000
IOPINAM  EQU   IOPINAME                                                 00661000
IOPITYP  EQU   IOPINAM                                                  00662000
IOPUSERL EQU   IOPDRMAP+11                                              00663000
IOPEND   EQU   IOPDRMAP+12                                              00664000
IOPLMCTL EQU   0                                                        00665000
IOPQSMIF EQU   0                                                        00666000
@NM00154 EQU   IOPQSMIF                                                 00667000
IOPQSMLS EQU   IOPQSMIF+8                                               00668000
IOPQSMNM EQU   IOPQSMLS                                                 00669000
IOPBS02  EQU   0                                                        00670000
IOPBS04  EQU   0                                                        00671000
IOPBAPF  EQU   IOPBS04                                                  00672000
MCBPTFMP EQU   0                                                        00673000
MCBTYPE  EQU   MCBPTFMP                                                 00674000
MCBPNO   EQU   MCBPTFMP+1                                               00675000
MCBPRELN EQU   MCBPTFMP+8                                               00676000
MCBPTP   EQU   MCBPTFMP+10                                              00677000
MCBVERMP EQU   0                                                        00678000
MCBVEND  EQU   MCBVERMP+8                                               00679000
MCBIFMP  EQU   0                                                        00680000
MCBIEND  EQU   MCBIFMP+8                                                00681000
MCBELEMP EQU   0                                                        00682000
MCBELEPM EQU   MCBELEMP+136                                             00683000
MCBEFLG1 EQU   MCBELEPM                                                 00684000
MCBEFLG2 EQU   MCBELEPM+1                                               00685000
MCBEFLG3 EQU   MCBELEPM+2                                               00686000
MCBEFLG4 EQU   MCBELEPM+3                                               00687000
MCBEFLG5 EQU   MCBELEMP+140                                             00688000
MCBEEND  EQU   MCBELEMP+141                                             00689000
SCPSTRNG EQU   0                                                        00690000
HMASMCRP EQU   0                                                        00691000
CRPSCPAD EQU   HMASMCRP+4                                               00692000
CRPRETRN EQU   HMASMCRP+10                                              00693000
CRPFLG1  EQU   HMASMCRP+14                                              00694000
CRPPRINT EQU   CRPFLG1                                                  00695000
CRPFLG2  EQU   HMASMCRP+16                                              00696000
CRPINSW0 EQU   CRPFLG2                                                  00697000
CRPINSW1 EQU   CRPFLG2                                                  00698000
CRPINSW2 EQU   CRPFLG2                                                  00699000
CRPINSW3 EQU   CRPFLG2                                                  00700000
CRPBUFFR EQU   HMASMCRP+18                                              00701000
CRPBFCTL EQU   CRPBUFFR                                                 00702000
FOPERAND EQU   0                                                        00703000
SCNAPRET EQU   0                                                        00704000
CCADSIDA EQU   0                                                        00705000
CCATYPEA EQU   0                                                        00706000
IOPBS01  EQU   0                                                        00707000
IOPBS03  EQU   0                                                        00708000
SCPIOPRM EQU   0                                                        00709000
MPPPARM  EQU   0                                                        00710000
MPPIOPAD EQU   MPPPARM                                                  00711000
MPPMCBAD EQU   MPPPARM+4                                                00712000
MPPCRDAD EQU   MPPPARM+8                                                00713000
MPPCRDPM EQU   MPPPARM+12                                               00714000
IOPUDATA EQU   IOPEND                                                   00715000
IOPINAM3 EQU   IOPINAME                                                 00716000
@NM00050 EQU   IOPINAM3                                                 00717000
IOPSTCMP EQU   IOPUDATA                                                 00718000
IOPDYNDT EQU   IOPUDATA                                                 00719000
IOPSPACE EQU   IOPDYNDT+44                                              00720000
IOPDTYPE EQU   IOPDYNDT+50                                              00721000
IOPNTMAX EQU   IOPDRMAP                                                 00722000
IOPNTMAP EQU   IOPDRMAP                                                 00723000
IOPCDMAP EQU   IOPNTMAP                                                 00724000
IOPPTMAP EQU   IOPCDMAP                                                 00725000
IOPSCMAP EQU   IOPPTMAP                                                 00726000
IOPDIRCT EQU   IOPSCMAP+12                                              00727000
IOPCDMAX EQU   IOPDIRCT                                                 00728000
IOPCQMAP EQU   IOPDRMAP                                                 00729000
@NM00061 EQU   IOPUDATA                                                 00730000
@NM00062 EQU   IOPUDATA                                                 00731000
IOPASMNT EQU   IOPUDATA                                                 00732000
IOPASMDR EQU   IOPASMNT                                                 00733000
IOPABUNT EQU   IOPASMDR+1                                               00734000
IOPLMDNT EQU   IOPUDATA                                                 00735000
IOPLMDDR EQU   IOPLMDNT                                                 00736000
IOPLMLEP EQU   IOPLMDDR+1                                               00737000
IOPLMDF1 EQU   IOPLMLEP                                                 00738000
IOPFLGS2 EQU   IOPLMDF1                                                 00739000
IOPLMDF2 EQU   IOPLMLEP+1                                               00740000
IOPLMDF3 EQU   IOPLMLEP+2                                               00741000
IOPLMDF4 EQU   IOPLMLEP+3                                               00742000
IOPLMDF5 EQU   IOPLMDDR+5                                               00743000
IOPFLGS3 EQU   IOPLMDF5                                                 00744000
IOPLMDFX EQU   IOPLMDNT+24                                              00745000
@NM00071 EQU   IOPLMDFX                                                 00746000
IOPLNTRY EQU   IOPLMDFX+8                                               00747000
IOPLSYS  EQU   IOPLNTRY                                                 00748000
IOPSYSLB EQU   IOPLSYS                                                  00749000
IOPMACNT EQU   IOPUDATA                                                 00750000
IOPMACDR EQU   IOPMACNT                                                 00751000
IOPRMIDE EQU   IOPMACDR+1                                               00752000
IOPRMST  EQU   IOPRMIDE+7                                               00753000
IOPFMIDE EQU   IOPMACDR+9                                               00754000
IOPMACFX EQU   IOPMACNT+24                                              00755000
IOPBUNT  EQU   IOPMACFX                                                 00756000
IOPMCEND EQU   IOPMACNT+104                                             00757000
IOPMACVR EQU   IOPMCEND                                                 00758000
IOPMCENT EQU   IOPMACVR                                                 00759000
IOPMCDTA EQU   IOPMCENT                                                 00760000
IOPMCASM EQU   IOPMCDTA                                                 00761000
IOPMACID EQU   IOPMCASM                                                 00762000
IOPMACST EQU   IOPMCASM+7                                               00763000
IOPMCIND EQU   IOPMCENT+8                                               00764000
IOPEOFNT EQU   IOPUDATA                                                 00765000
IOPSRCNT EQU   IOPUDATA                                                 00766000
IOPSRCDR EQU   IOPSRCNT                                                 00767000
@NM00082 EQU   IOPSRCDR+1                                               00768000
@NM00084 EQU   @NM00082+7                                               00769000
@NM00088 EQU   IOPSRCDR+9                                               00770000
IOPSRCFX EQU   IOPSRCNT+24                                              00771000
@NM00092 EQU   IOPSRCFX                                                 00772000
IOPSREND EQU   IOPSRCNT+104                                             00773000
IOPSRCVR EQU   IOPSREND                                                 00774000
IOPSNTRY EQU   IOPSRCVR                                                 00775000
IOPSRDTA EQU   IOPSNTRY                                                 00776000
IOPSRCID EQU   IOPSRDTA                                                 00777000
IOPSRCST EQU   IOPSRDTA+7                                               00778000
IOPMODNT EQU   IOPUDATA                                                 00779000
IOPMODDR EQU   IOPMODNT                                                 00780000
@NM00098 EQU   IOPMODDR+1                                               00781000
@NM00100 EQU   @NM00098+7                                               00782000
@NM00104 EQU   IOPMODDR+9                                               00783000
IOPMODFX EQU   IOPMODNT+24                                              00784000
@NM00108 EQU   IOPMODFX                                                 00785000
IOPMDLEP EQU   IOPMODFX+8                                               00786000
IOPMODF1 EQU   IOPMDLEP                                                 00787000
IOPMODF2 EQU   IOPMDLEP+1                                               00788000
IOPMODF3 EQU   IOPMDLEP+2                                               00789000
IOPMODF4 EQU   IOPMDLEP+3                                               00790000
IOPMDEND EQU   IOPMODNT+104                                             00791000
IOPMODVR EQU   IOPMDEND                                                 00792000
IOPMNTRY EQU   IOPMODVR                                                 00793000
IOPMDDTA EQU   IOPMNTRY                                                 00794000
IOPLMODS EQU   IOPMDDTA                                                 00795000
IOPMODID EQU   IOPLMODS                                                 00796000
IOPMODST EQU   IOPLMODS+7                                               00797000
IOPDLBNT EQU   IOPUDATA                                                 00798000
IOPDLBDR EQU   IOPDLBNT                                                 00799000
IOPDLBFX EQU   IOPDLBNT+24                                              00800000
@NM00119 EQU   IOPDLBFX                                                 00801000
IOPDLEND EQU   IOPDLBNT+104                                             00802000
IOPDLBVR EQU   IOPDLEND                                                 00803000
IOPDNTRY EQU   IOPDLBVR                                                 00804000
IOPDSYS  EQU   IOPDNTRY                                                 00805000
IOPSYSNT EQU   IOPUDATA                                                 00806000
IOPSYSDR EQU   IOPSYSNT                                                 00807000
IOPSYSF1 EQU   IOPSYSDR+4                                               00808000
IOPFLGS7 EQU   IOPSYSF1                                                 00809000
IOPSYSFX EQU   IOPSYSNT+24                                              00810000
@NM00126 EQU   IOPSYSFX                                                 00811000
IOPSYEND EQU   IOPSYSNT+184                                             00812000
IOPSYSVR EQU   IOPSYEND                                                 00813000
IOPSYSTR EQU   IOPSYSVR                                                 00814000
IOPSYNTR EQU   IOPSYSTR                                                 00815000
IOPPTFNT EQU   IOPUDATA                                                 00816000
IOPPTFDR EQU   IOPPTFNT                                                 00817000
IOPPTYPE EQU   IOPPTFDR+1                                               00818000
IOPPSTAT EQU   IOPPTFDR+2                                               00819000
IOPPTFF1 EQU   IOPPSTAT                                                 00820000
IOPFLGS5 EQU   IOPPTFF1                                                 00821000
IOPPTFF2 EQU   IOPPSTAT+1                                               00822000
IOPLRFP  EQU   IOPPTFF2                                                 00823000
IOPPTFF3 EQU   IOPPSTAT+3                                               00824000
IOPPTFFX EQU   IOPPTFNT+24                                              00825000
@NM00135 EQU   IOPPTFFX                                                 00826000
@NM00136 EQU   @NM00135                                                 00827000
IOPPRELN EQU   @NM00136                                                 00828000
IOPPDTES EQU   IOPPTFFX+41                                              00829000
@NM00139 EQU   IOPPDTES                                                 00830000
IOPPTPFX EQU   IOPPDTES+6                                               00831000
IOPDATES EQU   IOPPTPFX                                                 00832000
IOPPTEND EQU   IOPPTFNT+104                                             00833000
IOPPTFVR EQU   IOPPTEND                                                 00834000
IOPPNTRY EQU   IOPPTFVR                                                 00835000
IOPPMODS EQU   IOPPNTRY                                                 00836000
IOPENTNT EQU   IOPUDATA+104                                             00837000
IOPSRLNT EQU   IOPUDATA+104                                             00838000
IOPPRENT EQU   IOPUDATA+104                                             00839000
IOPNPRNT EQU   IOPUDATA+104                                             00840000
IOPSUPNT EQU   IOPUDATA+104                                             00841000
IOPREQNT EQU   IOPUDATA+104                                             00842000
IOPIRQNT EQU   IOPUDATA+104                                             00843000
IOPFIDNT EQU   IOPUDATA+104                                             00844000
IOPDELNT EQU   IOPUDATA+104                                             00845000
IOPVERNT EQU   IOPUDATA+104                                             00846000
IOPSBYNT EQU   IOPUDATA+104                                             00847000
IOPQSMNT EQU   IOPUDATA                                                 00848000
IOPQSMDR EQU   IOPQSMNT                                                 00849000
IOPQFMNT EQU   IOPUDATA                                                 00850000
IOPQFMDR EQU   IOPQFMNT                                                 00851000
IOPQFEND EQU   IOPQFMNT+2                                               00852000
IOPQFMVR EQU   IOPQFEND                                                 00853000
IOPQFMLS EQU   IOPQFMVR                                                 00854000
IOPQFMNM EQU   IOPQFMLS                                                 00855000
IOPPTSYS EQU   IOPUDATA                                                 00856000
IOPPTSDR EQU   IOPPTSYS                                                 00857000
IOPPTSFX EQU   IOPPTSYS+24                                              00858000
IOPDSSPC EQU   IOPPTSFX                                                 00859000
IOPPTFG1 EQU   IOPPTSFX+34                                              00860000
IOPPSEND EQU   IOPPTSYS+1064                                            00861000
IOPPTSVR EQU   IOPPSEND                                                 00862000
IOPPTNTR EQU   IOPPTSVR                                                 00863000
@NM00164 EQU   IOPPTNTR                                                 00864000
IOPPTFMD EQU   @NM00164                                                 00865000
IOPPTREL EQU   IOPPTFMD                                                 00866000
IOPBPDS  EQU   IOPUDATA                                                 00867000
IOPBLEP1 EQU   IOPBPDS+8                                                00868000
IOPBLEP2 EQU   IOPBPDS+9                                                00869000
@NM00168 EQU   IOPBPDS+18                                               00870000
IOPBFTB0 EQU   @NM00168                                                 00871000
IOPBFTB1 EQU   IOPBFTB0                                                 00872000
MCBVVLST EQU   MCBVEND                                                  00873000
MCBVNTRY EQU   MCBVVLST                                                 00874000
MCBVNUM  EQU   MCBVNTRY                                                 00875000
MCBIVLST EQU   MCBIEND                                                  00876000
MCBINTRY EQU   MCBIVLST                                                 00877000
MCBINUM  EQU   MCBINTRY                                                 00878000
MCBEVLST EQU   MCBEEND                                                  00879000
MCBENTRY EQU   MCBEVLST                                                 00880000
MCBENUM  EQU   MCBENTRY                                                 00881000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00882000
MCBEIND  EQU   MCBEVLST+8                                               00883000
@NM00181 EQU   MCBENTRY+7                                               00884000
MCBEND   EQU   MCBENUM                                                  00885000
MCBIIND  EQU   MCBIVLST+8                                               00886000
@NM00174 EQU   MCBINTRY+7                                               00887000
MCBIND   EQU   MCBINUM                                                  00888000
MCBVIND  EQU   MCBVVLST+8                                               00889000
@NM00172 EQU   MCBVNTRY+7                                               00890000
MCBVND   EQU   MCBVNUM                                                  00891000
IOPBCEND EQU   IOPBPDS+21                                               00892000
IOPBFTB3 EQU   IOPBFTB0+2                                               00893000
IOPBFTB2 EQU   IOPBFTB0+1                                               00894000
@NM00170 EQU   IOPBFTB1                                                 00895000
IOPBAPFP EQU   IOPBFTB1                                                 00896000
IOPBSSI  EQU   IOPBFTB1                                                 00897000
IOPBPAGA EQU   IOPBFTB1                                                 00898000
@NM00169 EQU   IOPBFTB1                                                 00899000
IOPBAOSL EQU   IOPBFTB1                                                 00900000
IOPBSEPA EQU   IOPBPDS+15                                               00901000
IOPBFTBL EQU   IOPBPDS+13                                               00902000
IOPBSTOR EQU   IOPBPDS+10                                               00903000
IOPBREFR EQU   IOPBLEP2                                                 00904000
IOPBLEF  EQU   IOPBLEP2                                                 00905000
IOPBTEST EQU   IOPBLEP2                                                 00906000
IOPBNE   EQU   IOPBLEP2                                                 00907000
@NM00167 EQU   IOPBLEP2                                                 00908000
IOPBDC   EQU   IOPBLEP2                                                 00909000
@NM00166 EQU   IOPBLEP1                                                 00910000
IOPBSCTR EQU   IOPBLEP1                                                 00911000
IOPBOL   EQU   IOPBLEP1                                                 00912000
@NM00165 EQU   IOPBLEP1                                                 00913000
IOPBOVLY EQU   IOPBLEP1                                                 00914000
IOPBREUS EQU   IOPBLEP1                                                 00915000
IOPBRENT EQU   IOPBLEP1                                                 00916000
IOPBNL   EQU   IOPBPDS+7                                                00917000
IOPBTTRN EQU   IOPBPDS+4                                                00918000
IOPBZERO EQU   IOPBPDS+3                                                00919000
IOPBTTRT EQU   IOPBPDS                                                  00920000
IOPPTIND EQU   IOPPTNTR+8                                               00921000
IOPPTSND EQU   IOPPTREL                                                 00922000
@NM00163 EQU   IOPPTSFX+872                                             00923000
IOPSYZPP EQU   IOPPTSFX+772                                             00924000
IOPSYZPR EQU   IOPPTSFX+771                                             00925000
IOPSYZPS EQU   IOPPTSFX+763                                             00926000
IOPSYZAP EQU   IOPPTSFX+755                                             00927000
IOPSYUPP EQU   IOPPTSFX+655                                             00928000
IOPSYUPR EQU   IOPPTSFX+654                                             00929000
IOPSYUPS EQU   IOPPTSFX+646                                             00930000
IOPSYUPD EQU   IOPPTSFX+638                                             00931000
IOPSYSPP EQU   IOPPTSFX+538                                             00932000
IOPSYSPR EQU   IOPPTSFX+537                                             00933000
IOPSYSPS EQU   IOPPTSFX+529                                             00934000
IOPSYSUP EQU   IOPPTSFX+521                                             00935000
IOPSYLKP EQU   IOPPTSFX+421                                             00936000
IOPSYLKR EQU   IOPPTSFX+420                                             00937000
IOPSYLKS EQU   IOPPTSFX+412                                             00938000
IOPSYLKD EQU   IOPPTSFX+404                                             00939000
IOPSYCPP EQU   IOPPTSFX+304                                             00940000
IOPSYCPR EQU   IOPPTSFX+303                                             00941000
IOPSYCPS EQU   IOPPTSFX+295                                             00942000
IOPSYCPY EQU   IOPPTSFX+287                                             00943000
IOPSYCOP EQU   IOPPTSFX+187                                             00944000
IOPSYCOR EQU   IOPPTSFX+186                                             00945000
IOPSYCOS EQU   IOPPTSFX+178                                             00946000
IOPSYCOM EQU   IOPPTSFX+170                                             00947000
IOPSYASP EQU   IOPPTSFX+70                                              00948000
IOPSYASR EQU   IOPPTSFX+69                                              00949000
IOPSYASS EQU   IOPPTSFX+61                                              00950000
IOPSYASM EQU   IOPPTSFX+53                                              00951000
@NM00162 EQU   IOPPTSFX+35                                              00952000
@NM00161 EQU   IOPPTFG1                                                 00953000
IOPPTSNJ EQU   IOPPTFG1                                                 00954000
IOPPTSNP EQU   IOPPTFG1                                                 00955000
IOPSYPLN EQU   IOPPTSFX+32                                              00956000
IOPDSPFX EQU   IOPPTSFX+6                                               00957000
IOPDSDIR EQU   IOPDSSPC+4                                               00958000
IOPDSSEC EQU   IOPDSSPC+2                                               00959000
IOPDSPRM EQU   IOPDSSPC                                                 00960000
@NM00160 EQU   IOPPTSDR+4                                               00961000
IOPPTPEM EQU   IOPPTSDR+2                                               00962000
IOPPCNVL EQU   IOPPTSDR+1                                               00963000
@NM00159 EQU   IOPPTSDR                                                 00964000
IOPQFMTP EQU   IOPQFMLS+8                                               00965000
@NM00158 EQU   IOPQFMLS+7                                               00966000
IOPQFMND EQU   IOPQFMNM                                                 00967000
@NM00157 EQU   IOPQFMDR                                                 00968000
@NM00153 EQU   IOPQSMDR                                                 00969000
@NM00152 EQU   IOPSBYNT+8                                               00970000
IOPSBYST EQU   IOPSBYNT+7                                               00971000
IOPSBYNM EQU   IOPSBYNT                                                 00972000
@NM00151 EQU   IOPVERNT+8                                               00973000
IOPVERST EQU   IOPVERNT+7                                               00974000
IOPVERNM EQU   IOPVERNT                                                 00975000
@NM00150 EQU   IOPDELNT+8                                               00976000
IOPDELST EQU   IOPDELNT+7                                               00977000
IOPDELNM EQU   IOPDELNT                                                 00978000
@NM00149 EQU   IOPFIDNT+8                                               00979000
IOPFIDST EQU   IOPFIDNT+7                                               00980000
IOPFIDNM EQU   IOPFIDNT                                                 00981000
@NM00148 EQU   IOPIRQNT+8                                               00982000
IOPIRQST EQU   IOPIRQNT+7                                               00983000
IOPIRQNM EQU   IOPIRQNT                                                 00984000
@NM00147 EQU   IOPREQNT+8                                               00985000
IOPREQST EQU   IOPREQNT+7                                               00986000
IOPREQNM EQU   IOPREQNT                                                 00987000
@NM00146 EQU   IOPSUPNT+8                                               00988000
IOPSUPST EQU   IOPSUPNT+7                                               00989000
IOPSUPNM EQU   IOPSUPNT                                                 00990000
@NM00145 EQU   IOPNPRNT+8                                               00991000
IOPNPRST EQU   IOPNPRNT+7                                               00992000
IOPNPRNM EQU   IOPNPRNT                                                 00993000
@NM00144 EQU   IOPPRENT+8                                               00994000
IOPPREST EQU   IOPPRENT+7                                               00995000
IOPPRENM EQU   IOPPRENT                                                 00996000
@NM00143 EQU   IOPSRLNT+8                                               00997000
IOPSRLST EQU   IOPSRLNT+7                                               00998000
@NM00142 EQU   IOPSRLNT+4                                               00999000
IOPSRLNM EQU   IOPSRLNT                                                 01000000
@NM00141 EQU   IOPENTNT+8                                               01001000
IOPENTST EQU   IOPENTNT+7                                               01002000
IOPENTNM EQU   IOPENTNT                                                 01003000
IOPPIND  EQU   IOPPNTRY+8                                               01004000
IOPPTFND EQU   IOPPMODS                                                 01005000
IOPPFMID EQU   IOPPTFFX+73                                              01006000
@NM00140 EQU   IOPPTPFX+24                                              01007000
IOPUCLT  EQU   IOPDATES+21                                              01008000
IOPUCLD  EQU   IOPDATES+18                                              01009000
IOPACCT  EQU   IOPDATES+15                                              01010000
IOPACCD  EQU   IOPDATES+12                                              01011000
IOPRSTT  EQU   IOPDATES+9                                               01012000
IOPRSTD  EQU   IOPDATES+6                                               01013000
IOPAPPT  EQU   IOPDATES+3                                               01014000
IOPAPPD  EQU   IOPDATES                                                 01015000
IOPRECT  EQU   @NM00139+3                                               01016000
IOPRECD  EQU   @NM00139                                                 01017000
@NM00138 EQU   IOPPTFFX+8                                               01018000
@NM00137 EQU   @NM00135+7                                               01019000
@NM00134 EQU   IOPPTFDR+20                                              01020000
IOPSBYNO EQU   IOPPTFDR+13                                              01021000
IOPDBYNO EQU   IOPPTFDR+6                                               01022000
@NM00133 EQU   IOPPTFF3                                                 01023000
IOPFLF   EQU   IOPPTFF3                                                 01024000
IOPDBYP  EQU   IOPPTFF3                                                 01025000
IOPSBYP  EQU   IOPPTFF3                                                 01026000
IOPPMDLP EQU   IOPPTFF2+1                                               01027000
IOPPADDP EQU   IOPPTFF2+1                                               01028000
@NM00132 EQU   IOPPTFF2+1                                               01029000
IOPJCLP  EQU   IOPPTFF2                                                 01030000
IOPSUPP  EQU   IOPPTFF2                                                 01031000
IOPREQP  EQU   IOPPTFF2                                                 01032000
IOPPREP  EQU   IOPPTFF2                                                 01033000
IOPNPRP  EQU   IOPPTFF2                                                 01034000
IOPIRQP  EQU   IOPPTFF2                                                 01035000
IOPDELP  EQU   IOPPTFF2                                                 01036000
IOPREGEN EQU   IOPFLGS5                                                 01037000
IOPBYP   EQU   IOPFLGS5                                                 01038000
IOPDUMMP EQU   IOPFLGS5                                                 01039000
@NM00131 EQU   IOPFLGS5                                                 01040000
IOPERROR EQU   IOPFLGS5                                                 01041000
IOPACC   EQU   IOPFLGS5                                                 01042000
IOPRES   EQU   IOPFLGS5                                                 01043000
IOPAPP   EQU   IOPFLGS5                                                 01044000
@NM00130 EQU   IOPPTFDR                                                 01045000
IOPSYSTP EQU   IOPSYSTR+8                                               01046000
IOPSYSND EQU   IOPSYNTR                                                 01047000
@NM00129 EQU   IOPSYSFX+21                                              01048000
IOPSYSID EQU   IOPSYSFX+13                                              01049000
IOPNUCID EQU   IOPSYSFX+12                                              01050000
IOPSREL  EQU   IOPSYSFX+8                                               01051000
@NM00128 EQU   @NM00126+7                                               01052000
@NM00127 EQU   @NM00126                                                 01053000
@NM00125 EQU   IOPSYSDR+5                                               01054000
@NM00124 EQU   IOPFLGS7                                                 01055000
IOPSYNG  EQU   IOPFLGS7                                                 01056000
IOPSYDL  EQU   IOPFLGS7                                                 01057000
IOPSTSNP EQU   IOPFLGS7                                                 01058000
IOPMTSNP EQU   IOPFLGS7                                                 01059000
IOPPEMAX EQU   IOPSYSDR+2                                               01060000
IOPSCNVL EQU   IOPSYSDR+1                                               01061000
@NM00123 EQU   IOPSYSDR                                                 01062000
IOPDLIND EQU   IOPDNTRY+8                                               01063000
IOPDLBND EQU   IOPDSYS                                                  01064000
@NM00122 EQU   IOPDLBFX+8                                               01065000
@NM00121 EQU   @NM00119+7                                               01066000
@NM00120 EQU   @NM00119                                                 01067000
@NM00118 EQU   IOPDLBDR+1                                               01068000
@NM00117 EQU   IOPDLBDR                                                 01069000
IOPMDIND EQU   IOPMNTRY+8                                               01070000
@NM00116 EQU   IOPMODST                                                 01071000
IOPMODND EQU   IOPMODID                                                 01072000
IOPDLIB  EQU   IOPMODFX+72                                              01073000
@NM00115 EQU   IOPMODFX+12                                              01074000
@NM00114 EQU   IOPMODF4                                                 01075000
@NM00113 EQU   IOPMODF3                                                 01076000
@NM00112 EQU   IOPMODF2                                                 01077000
IOPMPAGA EQU   IOPMODF2                                                 01078000
IOPMNE   EQU   IOPMODF2                                                 01079000
@NM00111 EQU   IOPMODF1                                                 01080000
IOPMDC   EQU   IOPMODF1                                                 01081000
IOPMREFR EQU   IOPMODF1                                                 01082000
IOPMOVLY EQU   IOPMODF1                                                 01083000
IOPMSCTR EQU   IOPMODF1                                                 01084000
IOPMREUS EQU   IOPMODF1                                                 01085000
IOPMRENT EQU   IOPMODF1                                                 01086000
IOPMAPF  EQU   IOPMODF1                                                 01087000
@NM00110 EQU   @NM00108+7                                               01088000
@NM00109 EQU   @NM00108                                                 01089000
@NM00107 EQU   IOPMODDR+17                                              01090000
@NM00106 EQU   @NM00104+7                                               01091000
@NM00105 EQU   @NM00104                                                 01092000
@NM00103 EQU   @NM00100                                                 01093000
@NM00102 EQU   @NM00100                                                 01094000
@NM00101 EQU   @NM00100                                                 01095000
@NM00099 EQU   @NM00098                                                 01096000
@NM00097 EQU   IOPMODDR                                                 01097000
IOPSRIND EQU   IOPSNTRY+8                                               01098000
@NM00096 EQU   IOPSRCST                                                 01099000
IOPSRCND EQU   IOPSRCID                                                 01100000
IOPSRDLB EQU   IOPSRCFX+72                                              01101000
IOPSRSYS EQU   IOPSRCFX+64                                              01102000
@NM00095 EQU   IOPSRCFX+8                                               01103000
@NM00094 EQU   @NM00092+7                                               01104000
@NM00093 EQU   @NM00092                                                 01105000
@NM00091 EQU   IOPSRCDR+18                                              01106000
IOPSRLNG EQU   IOPSRCDR+17                                              01107000
@NM00090 EQU   @NM00088+7                                               01108000
@NM00089 EQU   @NM00088                                                 01109000
@NM00087 EQU   @NM00084                                                 01110000
@NM00086 EQU   @NM00084                                                 01111000
@NM00085 EQU   @NM00084                                                 01112000
@NM00083 EQU   @NM00082                                                 01113000
@NM00081 EQU   IOPSRCDR                                                 01114000
IOPEOFND EQU   IOPEOFNT                                                 01115000
IOPMCTYP EQU   IOPMCIND                                                 01116000
@NM00080 EQU   IOPMACST                                                 01117000
IOPMACND EQU   IOPMACID                                                 01118000
IOPMCDLB EQU   IOPMACFX+72                                              01119000
IOPMCSYS EQU   IOPMACFX+64                                              01120000
@NM00079 EQU   IOPMACFX+8                                               01121000
IOPBUTYP EQU   IOPBUNT+7                                                01122000
IOPBUSMD EQU   IOPBUNT                                                  01123000
@NM00078 EQU   IOPMACDR+18                                              01124000
IOPMCLNG EQU   IOPMACDR+17                                              01125000
IOPFMST  EQU   IOPFMIDE+7                                               01126000
IOPFMID  EQU   IOPFMIDE                                                 01127000
@NM00077 EQU   IOPRMST                                                  01128000
IOPRMASM EQU   IOPRMST                                                  01129000
@NM00076 EQU   IOPRMST                                                  01130000
IOPRMID  EQU   IOPRMIDE                                                 01131000
@NM00075 EQU   IOPMACDR                                                 01132000
IOPLMIND EQU   IOPLNTRY+8                                               01133000
IOPLMDND EQU   IOPSYSLB                                                 01134000
@NM00073 EQU   @NM00071+7                                               01135000
@NM00072 EQU   @NM00071                                                 01136000
@NM00070 EQU   IOPLMDDR+6                                               01137000
@NM00069 EQU   IOPFLGS3                                                 01138000
IOPCHREP EQU   IOPFLGS3                                                 01139000
IOPLINK  EQU   IOPFLGS3                                                 01140000
IOPCOPY  EQU   IOPFLGS3                                                 01141000
@NM00068 EQU   IOPLMDF4                                                 01142000
@NM00067 EQU   IOPLMDF3                                                 01143000
@NM00066 EQU   IOPLMDF2                                                 01144000
IOPPAGA  EQU   IOPLMDF2                                                 01145000
IOPNE    EQU   IOPLMDF2                                                 01146000
@NM00065 EQU   IOPFLGS2                                                 01147000
IOPDC    EQU   IOPFLGS2                                                 01148000
IOPREFR  EQU   IOPFLGS2                                                 01149000
IOPOVLY  EQU   IOPFLGS2                                                 01150000
IOPSCTR  EQU   IOPFLGS2                                                 01151000
IOPREUS  EQU   IOPFLGS2                                                 01152000
IOPRENT  EQU   IOPFLGS2                                                 01153000
IOPAPF   EQU   IOPFLGS2                                                 01154000
@NM00064 EQU   IOPLMDDR                                                 01155000
@NM00063 EQU   IOPASMDR+9                                               01156000
IOPABUTP EQU   IOPABUNT+7                                               01157000
IOPABUPT EQU   IOPABUNT                                                 01158000
IOPNTLVL EQU   IOPASMDR                                                 01159000
IOPALLOC EQU   @NM00062+4                                               01160000
IOPUSED  EQU   @NM00062                                                 01161000
IOPTPSEQ EQU   @NM00061+8                                               01162000
IOPVLSER EQU   @NM00061+2                                               01163000
IOPBLKSI EQU   @NM00061                                                 01164000
IOPCQMAX EQU   IOPCQMAP+12                                              01165000
@NM00060 EQU   IOPCQMAP+11                                              01166000
@NM00059 EQU   IOPCQMAP+8                                               01167000
@NM00058 EQU   IOPCQMAP                                                 01168000
IOPPTMAX EQU   IOPCDMAX                                                 01169000
@NM00057 EQU   IOPSCMAP+11                                              01170000
@NM00056 EQU   IOPSCMAP+8                                               01171000
@NM00055 EQU   IOPSCMAP                                                 01172000
IOPDIRMX EQU   IOPNTMAX+12                                              01173000
@NM00054 EQU   IOPNTMAX+11                                              01174000
@NM00053 EQU   IOPNTMAX+8                                               01175000
@NM00052 EQU   IOPNTMAX                                                 01176000
@NM00051 EQU   IOPDTYPE                                                 01177000
IOPDMOD  EQU   IOPDTYPE                                                 01178000
IOPDJCL  EQU   IOPDTYPE                                                 01179000
IOPDSRC  EQU   IOPDTYPE                                                 01180000
IOPDMAC  EQU   IOPDTYPE                                                 01181000
IOPSDIR  EQU   IOPSPACE+4                                               01182000
IOPSSCND EQU   IOPSPACE+2                                               01183000
IOPSPRIM EQU   IOPSPACE                                                 01184000
IOPDSN   EQU   IOPDYNDT                                                 01185000
IOPNTYPE EQU   IOPSTCMP+17                                              01186000
IOPNNAME EQU   IOPSTCMP+9                                               01187000
IOPOTYPE EQU   IOPSTCMP+8                                               01188000
IOPONAME EQU   IOPSTCMP                                                 01189000
IOPISEQ3 EQU   IOPINAM3+6                                               01190000
IOPITYP3 EQU   @NM00050+5                                               01191000
IOPIPTF3 EQU   @NM00050                                                 01192000
MPPSMDNM EQU   MPPPARM+16                                               01193000
CRPDDNAM EQU   HMASMCRP+98                                              01194000
CRPBFSEQ EQU   CRPBUFFR+72                                              01195000
CRPBFCNT EQU   CRPBFCTL+71                                              01196000
CRPBFDTA EQU   CRPBFCTL                                                 01197000
CRPINSWF EQU   CRPFLG2+1                                                01198000
CRPINSWE EQU   CRPFLG2+1                                                01199000
CRPINSWD EQU   CRPFLG2+1                                                01200000
CRPINSWC EQU   CRPFLG2+1                                                01201000
CRPINSWB EQU   CRPFLG2+1                                                01202000
CRPINSWA EQU   CRPFLG2+1                                                01203000
CRPINSW9 EQU   CRPFLG2+1                                                01204000
CRPINSW8 EQU   CRPFLG2+1                                                01205000
CRPINSW7 EQU   CRPFLG2                                                  01206000
CRPINSW6 EQU   CRPFLG2                                                  01207000
CRPINSW5 EQU   CRPFLG2                                                  01208000
CRPINSW4 EQU   CRPFLG2                                                  01209000
CRPEOF1  EQU   CRPINSW3                                                 01210000
CRPWRTLG EQU   CRPINSW2                                                 01211000
CRPEXADD EQU   CRPINSW1                                                 01212000
CRPEOFSW EQU   CRPINSW0                                                 01213000
@NM00187 EQU   CRPFLG1+1                                                01214000
CRPRPT   EQU   CRPFLG1+1                                                01215000
CRPLIST  EQU   CRPFLG1+1                                                01216000
CRPNOWPP EQU   CRPFLG1+1                                                01217000
CRPTRMEX EQU   CRPFLG1+1                                                01218000
CRPEOFEN EQU   CRPFLG1+1                                                01219000
CRPSCNCL EQU   CRPFLG1                                                  01220000
CRPOFFST EQU   CRPFLG1                                                  01221000
CRPOTHER EQU   CRPFLG1                                                  01222000
CRPLOG   EQU   CRPFLG1                                                  01223000
CRPPTS   EQU   CRPFLG1                                                  01224000
CRPLOGCK EQU   CRPFLG1                                                  01225000
CRPBFPRM EQU   CRPFLG1                                                  01226000
@NM00186 EQU   HMASMCRP+11                                              01227000
CRPOUTDS EQU   HMASMCRP+9                                               01228000
CRPINDS  EQU   HMASMCRP+8                                               01229000
@NM00185 EQU   HMASMCRP+1                                               01230000
CRPUXNUM EQU   HMASMCRP                                                 01231000
@NM00180 EQU   MCBEFLG5                                                 01232000
MCBEDEL  EQU   MCBEFLG5                                                 01233000
MCBESTD  EQU   MCBEFLG5                                                 01234000
@NM00179 EQU   MCBEFLG4                                                 01235000
@NM00178 EQU   MCBEFLG3                                                 01236000
@NM00177 EQU   MCBEFLG2                                                 01237000
MCBEPAGA EQU   MCBEFLG2                                                 01238000
MCBENE   EQU   MCBEFLG2                                                 01239000
@NM00176 EQU   MCBEFLG1                                                 01240000
MCBEDC   EQU   MCBEFLG1                                                 01241000
MCBEREFR EQU   MCBEFLG1                                                 01242000
MCBEOVLY EQU   MCBEFLG1                                                 01243000
MCBESCTR EQU   MCBEFLG1                                                 01244000
MCBEREUS EQU   MCBEFLG1                                                 01245000
MCBERENT EQU   MCBEFLG1                                                 01246000
MCBEAPF  EQU   MCBEFLG1                                                 01247000
MCBERMID EQU   MCBELEMP+129                                             01248000
MCBELLKD EQU   MCBELEMP+128                                             01249000
MCBEJLKD EQU   MCBELEMP+116                                             01250000
MCBELUPI EQU   MCBELEMP+115                                             01251000
MCBEJUPI EQU   MCBELEMP+103                                             01252000
MCBELCPY EQU   MCBELEMP+102                                             01253000
MCBEJCPY EQU   MCBELEMP+90                                              01254000
MCBELASM EQU   MCBELEMP+89                                              01255000
MCBEJASM EQU   MCBELEMP+77                                              01256000
MCBERLF  EQU   MCBELEMP+73                                              01257000
MCBESSI  EQU   MCBELEMP+65                                              01258000
MCBEDALS EQU   MCBELEMP+57                                              01259000
MCBEASLB EQU   MCBELEMP+49                                              01260000
MCBELKLB EQU   MCBELEMP+41                                              01261000
MCBETXLB EQU   MCBELEMP+33                                              01262000
MCBESYS  EQU   MCBELEMP+25                                              01263000
MCBEDOBJ EQU   MCBELEMP+17                                              01264000
MCBEDIST EQU   MCBELEMP+9                                               01265000
MCBENAME EQU   MCBELEMP+1                                               01266000
@NM00175 EQU   MCBELEMP                                                 01267000
MCBIFENV EQU   MCBIFMP+1                                                01268000
@NM00173 EQU   MCBIFMP                                                  01269000
MCBSFMID EQU   MCBVERMP+1                                               01270000
@NM00171 EQU   MCBVERMP                                                 01271000
IOPBS04E EQU   IOPBS04+2                                                01272000
IOPBAPFC EQU   IOPBAPF+1                                                01273000
IOPBAPFL EQU   IOPBAPF                                                  01274000
IOPBS2NM EQU   IOPBS02+3                                                01275000
IOPBS2EP EQU   IOPBS02                                                  01276000
IOPQSMTP EQU   IOPQSMLS+8                                               01277000
@NM00156 EQU   IOPQSMLS+7                                               01278000
IOPQSMND EQU   IOPQSMNM                                                 01279000
@NM00155 EQU   @NM00154+7                                               01280000
IOPQSMFM EQU   @NM00154                                                 01281000
@NM00074 EQU   IOPLMCTL+17                                              01282000
IOPLMCRD EQU   IOPLMCTL+9                                               01283000
IOPLMCRN EQU   IOPLMCTL+1                                               01284000
IOPLMCC  EQU   IOPLMCTL                                                 01285000
@NM00049 EQU   IOPUSERL                                                 01286000
@NM00048 EQU   IOPUSERL                                                 01287000
IOPALIS  EQU   IOPUSERL                                                 01288000
IOPTTR   EQU   IOPDRMAP+8                                               01289000
IOPINAM2 EQU   IOPINAM+1                                                01290000
IOPITYP2 EQU   IOPITYP                                                  01291000
@NM00047 EQU   HMASMIOP+32                                              01292000
IOPDELDD EQU   IOPDDNAM                                                 01293000
@NM00046 EQU   @NM00043+10                                              01294000
IOPSEQNO EQU   @NM00043+8                                               01295000
@NM00045 EQU   @NM00044+7                                               01296000
IOPPTFNM EQU   @NM00044                                                 01297000
IOPTYPE  EQU   HMASMIOP+3                                               01298000
IOPRETRN EQU   HMASMIOP+2                                               01299000
IOPFUNCT EQU   HMASMIOP+1                                               01300000
IOPDSID  EQU   HMASMIOP                                                 01301000
CCABMREC EQU   CCABELMT+10                                              01302000
CCABPOS  EQU   CCABMPOS+8                                               01303000
CCABNAME EQU   CCABMPOS                                                 01304000
@NM00042 EQU   CCABLDLM+2                                               01305000
@NM00041 EQU   CCABLDLM                                                 01306000
CCAUPDPM EQU   @NM00039+24                                              01307000
@NM00040 EQU   @NM00039+21                                              01308000
CCARUPDT EQU   CCAUPDRC                                                 01309000
CCAUPDSP EQU   @NM00039+12                                              01310000
CCAUPDTE EQU   @NM00039+8                                               01311000
CCAUPDNM EQU   @NM00039                                                 01312000
CCASUPPM EQU   @NM00037+24                                              01313000
@NM00038 EQU   @NM00037+21                                              01314000
CCARSUP  EQU   CCASUPRC                                                 01315000
CCASUPSP EQU   @NM00037+12                                              01316000
CCAIOSUP EQU   @NM00037+8                                               01317000
CCASUPNM EQU   @NM00037                                                 01318000
CCAZAPPM EQU   @NM00035+24                                              01319000
@NM00036 EQU   @NM00035+21                                              01320000
CCARZAP  EQU   CCAZAPRC                                                 01321000
CCAZAPSP EQU   @NM00035+12                                              01322000
CCASPZAP EQU   @NM00035+8                                               01323000
CCAZAPNM EQU   @NM00035                                                 01324000
CCACOMPM EQU   @NM00033+24                                              01325000
@NM00034 EQU   @NM00033+21                                              01326000
CCARCOMP EQU   CCACOMRC                                                 01327000
CCACOMSP EQU   @NM00033+12                                              01328000
CCACOMRS EQU   @NM00033+8                                               01329000
CCACOMNM EQU   @NM00033                                                 01330000
CCACPYPM EQU   @NM00031+24                                              01331000
@NM00032 EQU   @NM00031+21                                              01332000
CCARCOPY EQU   CCACPYRC                                                 01333000
CCACPYSP EQU   @NM00031+12                                              01334000
CCACOPY  EQU   @NM00031+8                                               01335000
CCACPYNM EQU   @NM00031                                                 01336000
CCAASMPM EQU   @NM00029+24                                              01337000
@NM00030 EQU   @NM00029+21                                              01338000
CCARASM  EQU   CCAASMRC                                                 01339000
CCAASMSP EQU   @NM00029+12                                              01340000
CCAASM   EQU   @NM00029+8                                               01341000
CCAASMNM EQU   @NM00029                                                 01342000
CCALKDPM EQU   @NM00027+24                                              01343000
@NM00028 EQU   @NM00027+21                                              01344000
CCARLINK EQU   CCALKDRC                                                 01345000
CCALKDSP EQU   @NM00027+12                                              01346000
CCALKED  EQU   @NM00027+8                                               01347000
CCALKDNM EQU   @NM00027                                                 01348000
CCAPGMPM EQU   @NM00025+24                                              01349000
@NM00026 EQU   @NM00025+21                                              01350000
CCABPGRC EQU   @NM00025+20                                              01351000
CCABPGSP EQU   @NM00025+12                                              01352000
CCABPGAD EQU   @NM00025+8                                               01353000
CCABPGNM EQU   @NM00025                                                 01354000
CCAEND   EQU   HMASMCCA+371                                             01355000
@NM00024 EQU   HMASMCCA+309                                             01356000
CCACURDD EQU   CCAFDSNG+3                                               01357000
CCACURDS EQU   CCAFDSNG+2                                               01358000
@NM00023 EQU   CCAFLAGB                                                 01359000
CCAOUTNG EQU   CCAFLAGB                                                 01360000
CCALOGNG EQU   CCAFLAGB                                                 01361000
CCAFMID  EQU   HMASMCCA+291                                             01362000
CCALSTDS EQU   CCAFCTL+8                                                01363000
CCARPTDS EQU   CCAFCTL+7                                                01364000
CCATIME  EQU   CCAFCTL+4                                                01365000
CCADATE  EQU   CCAFCTL+1                                                01366000
@NM00022 EQU   CCAFLAG9                                                 01367000
CCARVCAN EQU   CCAFLAG9                                                 01368000
CCARVEST EQU   CCAFLAG9                                                 01369000
CCAPTSNJ EQU   CCAFLAG9                                                 01370000
CCASTSNP EQU   CCAFLAG9                                                 01371000
CCAMTSNP EQU   CCAFLAG9                                                 01372000
CCAPTSNP EQU   CCAFLAG9                                                 01373000
@NM00021 EQU   CCAFLAG8                                                 01374000
CCAACDSC EQU   CCAFLAG8                                                 01375000
CCACDSC  EQU   CCAFLAG8                                                 01376000
@NM00020 EQU   CCAFLAG6                                                 01377000
CCAACRUP EQU   CCAFLAG6                                                 01378000
CCACRQUP EQU   CCAFLAG6                                                 01379000
CCAACDUP EQU   CCAFLAG6                                                 01380000
CCACDSUP EQU   CCAFLAG6                                                 01381000
@NM00019 EQU   CCAFLAG5                                                 01382000
CCAACROS EQU   CCAFLAG5                                                 01383000
CCACRQOS EQU   CCAFLAG5                                                 01384000
CCAACDOS EQU   CCAFLAG5                                                 01385000
CCACDSOS EQU   CCAFLAG5                                                 01386000
@NM00018 EQU   CCAFLAG4                                                 01387000
CCAACRIS EQU   CCAFLAG4                                                 01388000
CCACRQIS EQU   CCAFLAG4                                                 01389000
CCAACDIS EQU   CCAFLAG4                                                 01390000
CCACDSIS EQU   CCAFLAG4                                                 01391000
@NM00017 EQU   CCAFLAG3+1                                               01392000
CCARGNP  EQU   CCAFLAG3+1                                               01393000
CCADISRQ EQU   CCAFLAG3+1                                               01394000
CCAICTOK EQU   CCAFLAG3                                                 01395000
CCADELP  EQU   CCAFLAG3                                                 01396000
CCACMPRS EQU   CCAFLAG3                                                 01397000
CCAZAPP  EQU   CCAFLAG3                                                 01398000
CCALINKP EQU   CCAFLAG3                                                 01399000
CCACOPYP EQU   CCAFLAG3                                                 01400000
CCAASIP  EQU   CCAFLAG3                                                 01401000
CCAUPDP  EQU   CCAFLAG3                                                 01402000
CCAEOSMP EQU   CCAFLAG2                                                 01403000
CCAEOFNC EQU   CCAFLAG2                                                 01404000
@NM00016 EQU   CCAFLAG2                                                 01405000
CCACHECK EQU   CCAFLAG2                                                 01406000
CCATERM  EQU   CCAFLAG2                                                 01407000
CCASVCLB EQU   CCAFLAG2                                                 01408000
CCANCPTF EQU   CCAFLAG2                                                 01409000
@NM00015 EQU   CCAFLAG1+1                                               01410000
CCAUNL   EQU   CCAFLAG1+1                                               01411000
CCARESET EQU   CCAFLAG1+1                                               01412000
CCALOG   EQU   CCAFLAG1+1                                               01413000
CCACNV   EQU   CCAFLAG1+1                                               01414000
CCALIST  EQU   CCAFLAG1                                                 01415000
CCAUPDU  EQU   CCAFLAG1                                                 01416000
CCAUPDJ  EQU   CCAFLAG1                                                 01417000
CCARES   EQU   CCAFLAG1                                                 01418000
CCAREJ   EQU   CCAFLAG1                                                 01419000
CCAACCPT EQU   CCAFLAG1                                                 01420000
CCAAPPLY EQU   CCAFLAG1                                                 01421000
CCAREC   EQU   CCAFLAG1                                                 01422000
CCAFUNCT EQU   CCAFFUNC                                                 01423000
@NM00014 EQU   @NM00009+18                                              01424000
@NM00013 EQU   @NM00009+16                                              01425000
CCATBLPA EQU   @NM00009+12                                              01426000
@NM00012 EQU   @NM00009+8                                               01427000
@NM00011 EQU   @NM00009+4                                               01428000
@NM00010 EQU   @NM00009                                                 01429000
CCAIFGTP EQU   CCAFGTP+16                                               01430000
CCAGTP3  EQU   CCAFGTP+12                                               01431000
CCAGTP2  EQU   CCAFGTP+8                                                01432000
CCAGTP1  EQU   CCAFGTP+4                                                01433000
CCASETAD EQU   CCASEGTP                                                 01434000
CCACLST  EQU   CCAFPGM+12                                               01435000
CCASPDCB EQU   CCAFPGM+8                                                01436000
CCAICLMD EQU   CCAFICT+12                                               01437000
CCAICMOD EQU   CCAFICT+8                                                01438000
CCAICPTF EQU   CCAFICT+4                                                01439000
CCAICT   EQU   CCAFICT                                                  01440000
CCARVAD  EQU   CCAFSTA                                                  01441000
CCAACDID EQU   CCAFSYS+32                                               01442000
CCACDSID EQU   CCAFSYS+24                                               01443000
CCALNLEN EQU   CCAFSYS+22                                               01444000
@NM00008 EQU   CCAFLAGA                                                 01445000
CCAPSYSF EQU   CCAFLAGA                                                 01446000
CCAASYSF EQU   CCAFLAGA                                                 01447000
CCACSYSF EQU   CCAFLAGA                                                 01448000
CCANUCID EQU   CCAFSYS+20                                               01449000
CCAASREL EQU   CCAFSYS+16                                               01450000
CCACSREL EQU   CCASREL                                                  01451000
CCAPEMAX EQU   CCAFSYS+10                                               01452000
CCAPGLEN EQU   CCAFSYS+8                                                01453000
CCAIOPAS EQU   CCAFSYS+4                                                01454000
CCAIOPCS EQU   CCAFSYS                                                  01455000
CCAPESIZ EQU   CCAFIOP+4                                                01456000
CCAIOPTR EQU   CCAFIOP                                                  01457000
@NM00007 EQU   CCAFLAG7+3                                               01458000
CCALOGP  EQU   CCAFLAG7+2                                               01459000
CCAOUTP  EQU   CCAFLAG7+2                                               01460000
CCASLBP  EQU   CCAFLAG7+2                                               01461000
CCARPTP  EQU   CCAFLAG7+2                                               01462000
CCALISTP EQU   CCAFLAG7+2                                               01463000
CCAJCLP  EQU   CCAFLAG7+2                                               01464000
CCAPTFP  EQU   CCAFLAG7+2                                               01465000
CCATLBP  EQU   CCAFLAG7+2                                               01466000
CCAUT3P  EQU   CCAFLAG7+1                                               01467000
CCAUT2P  EQU   CCAFLAG7+1                                               01468000
CCAUT1P  EQU   CCAFLAG7+1                                               01469000
CCAWK5P  EQU   CCAFLAG7+1                                               01470000
CCAWK4P  EQU   CCAFLAG7+1                                               01471000
CCAWK3P  EQU   CCAFLAG7+1                                               01472000
CCAWK2P  EQU   CCAFLAG7+1                                               01473000
CCAWK1P  EQU   CCAFLAG7+1                                               01474000
CCAACRQP EQU   CCAFLAG7                                                 01475000
CCACRQP  EQU   CCAFLAG7                                                 01476000
CCASTSP  EQU   CCAFLAG7                                                 01477000
CCAMTSP  EQU   CCAFLAG7                                                 01478000
CCAPTSP  EQU   CCAFLAG7                                                 01479000
CCASCDSP EQU   CCAFLAG7                                                 01480000
CCAACDSP EQU   CCAFLAG7                                                 01481000
CCACDSP  EQU   CCAFLAG7                                                 01482000
@NM00006 EQU   CCAFBUFR+122                                             01483000
@NM00005 EQU   CCAFBUFR+120                                             01484000
@NM00004 EQU   CCAFBUFR+118                                             01485000
CCATBFMX EQU   CCAFBUFR+116                                             01486000
CCA4BFMX EQU   CCAFBUFR+114                                             01487000
CCA3BFMX EQU   CCAFBUFR+112                                             01488000
CCA2BFMX EQU   CCAFBUFR+110                                             01489000
CCA1BFMX EQU   CCAFBUFR+108                                             01490000
CCAXBFMX EQU   CCAFBUFR+106                                             01491000
CCAQBFMX EQU   CCAFBUFR+104                                             01492000
CCASBFMX EQU   CCAFBUFR+102                                             01493000
CCAMBFMX EQU   CCAFBUFR+100                                             01494000
CCAPBFMX EQU   CCAFBUFR+98                                              01495000
CCAVBFMX EQU   CCAFBUFR+96                                              01496000
CCAABFMX EQU   CCAFBUFR+94                                              01497000
CCACBFMX EQU   CCAFBUFR+92                                              01498000
@NM00003 EQU   CCAFBUFR+88                                              01499000
@NM00002 EQU   CCAFBUFR+84                                              01500000
CCA4BFSZ EQU   CCAFBUFR+80                                              01501000
CCATBFSZ EQU   CCAFBUFR+76                                              01502000
CCAWBFSZ EQU   CCAFBUFR+72                                              01503000
CCAQBFSZ EQU   CCAFBUFR+68                                              01504000
CCAPBFSZ EQU   CCAFBUFR+64                                              01505000
CCAVBFSZ EQU   CCAFBUFR+60                                              01506000
CCACBFSZ EQU   CCAFBUFR+56                                              01507000
@NM00001 EQU   CCAFBUFR+52                                              01508000
CCA4BFOA EQU   CCAFBUFR+48                                              01509000
CCA4BFIA EQU   CCAFBUFR+44                                              01510000
CCATBFIA EQU   CCAFBUFR+40                                              01511000
CCAWBFOA EQU   CCAFBUFR+36                                              01512000
CCAWBFIA EQU   CCAFBUFR+32                                              01513000
CCAQBFOA EQU   CCAFBUFR+28                                              01514000
CCAQBFIA EQU   CCAFBUFR+24                                              01515000
CCAPBFOA EQU   CCAFBUFR+20                                              01516000
CCAPBFIA EQU   CCAFBUFR+16                                              01517000
CCAVBFOA EQU   CCAFBUFR+12                                              01518000
CCAVBFIA EQU   CCAFBUFR+8                                               01519000
CCACBFOA EQU   CCAFBUFR+4                                               01520000
CCACBFIA EQU   CCAFBUFR                                                 01521000
CCAID    EQU   HMASMCCA                                                 01522000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01523000
@RC00219 EQU   GOODSCN1                                                 01524000
@RF00229 EQU   GOODSCN1                                                 01525000
@RF00249 EQU   @EL00002                                                 01526000
@RF00255 EQU   @EL00003                                                 01527000
@ENDDATA EQU   *                                                        01528000
         END   HMASMMPH,(C'PLS2059',0802,78334)                         01529000
